{
 "title": "Ode to Joy",
 "author": "Bry",
 "citation": "   Bry. \"Ode to Joy: experience with Ecstasy (ID 10)\". Erowid.org. May 30, 2000. erowid.org/exp/10",
 "substance": "Ecstasy",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 10",
   "Male",
   " ",
   "Not Given",
   "May 30, 2000",
   "Views: 3853",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy friend had some experience with X and had told me about it.  One day, she said she had come across some really good stuff (chocolate chips from Amsterdam), and asked if I was interested.  I had done acid once before, and was a seasoned pot smoker.  I was ready for it.  We got the tabs, and prepared ourselves by getting some comfortable clothes, a video (alice in Wonderland), and generally psyching ourselves up for the event.</p><p>Upon taking the drug, I was somewhat anxious for the fun to begin.  After watching TV for a while, I noticed K acting funny.  She is significantly smaller than me, so I guess it hit her faster.  I wasn't feeling anything.  Then, I decided to stand up.  WHOAH!  COLD FLOOR ON BARE FEET!  It was like ice.  It was so cold it tickled.  Happy happy happy.  I began to dance around.  I could almost hear music in my head.  I settled down and we proceeded to massage one another with a mentholyptus rub (half a jar in all:  the smell was in my room for 3 days).  Masturbating was never this good.  I was shuddering from the waves of pure, unadulterated delight that were just sweeping over me like a rising tide.  I honestly heard some heavenly choir singing.  </p><p>I received a couple of random phone calls from some people I hadn't heard from in a while, some of whom later came over.  Hearing those voices was like a reunion of some long-estranged family or something.  Utter elation.  I could NOT hold anyone close enough to me.  I wanted to keep squeezing until I had totally absorbed them into myself.  The drug is aptly named.  If you are ever looking for that total mind/body massage and spiritual connection with another person, this is the way to go.  We finished the night wrapped tightly in a fuzzy blanket listening to some beautiful violin music.  I was so happy and at peace that I almost wept.</p>"
}
