{
 "title": "Very Clear Mindset",
 "author": "Drosky",
 "citation": "   Drosky. \"Very Clear Mindset: experience with Marinol & Hydrocodone (ID 100028)\". Erowid.org. Apr 26, 2013. erowid.org/exp/100028",
 "substance": "Marinol & Hydrocodone",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   " ",
   "10 mg",
   "oral",
   "Pharms - Dronabinol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2013",
   "100028",
   "Male",
   " ",
   "24",
   "Apr 26, 2013",
   "Views: 1395",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>5:00 AM. I could not sleep because of my second day in attempting to withdrawal from a heavy opiate dependency with a very fast tapering. It has been a long battle and this was going to be it. Anyways I stay with my mother right now because she is a cancer patient. She is prescribed marinol, and all kinds of the highest dose opiates out here. So I go and ask because we had talked earlier about my tapering and that I might need help to finish it. So she gives me 2 10mg Lortabs and 2 5mg Marinol.</p><p>6:00 Withdrawals are going away and I start to feel back to normal but not high(20mg lortabs is nothing to me) A few minutes later, I noticed a heavy sensation in my whole body while I was sitting in my chair, but with a odd floaty sensation to it.</p><p>6:20 OK I definitely feel like  just smoked some pot, but with some things that seemed different. Body is still heavy and floaty and its kind of enjoyable and funny. Closing my eyes was very similar to an old school DXM trip, when I closed them I would kind of drift off in to my own head I guess with a very clear mindset and it was very pleasant. I would say that is my favorite effect of marinol.</p><p>6:30 I go to the bathroom and noticed my eyes were squinted and bloodshot, a little later I became very sleepy and wanted to go to bed and go back to my dream world and fall asleep which I did and it was awsome.</p><p>Anyways my final words: Marinol felt about 80% of the effects of marijuana, I had Bloodshot eyes, munchies, and the general feeling to the feeling of Marijuana. It had some great extra effects that are different and enjoyable especially when you go to bed.</p>"
}
