{
 "title": "Heavy Hallucinogenic Expreince",
 "author": "Saer",
 "citation": "   Saer. \"Heavy Hallucinogenic Expreince: experience with 25C-NBOMe (ID 100001)\". Erowid.org. Sep 18, 2013. erowid.org/exp/100001",
 "substance": "25C-NBOMe",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "sublingual",
   "25C-NBOMe",
   "(blotter / tab)",
   "  T+ 5:00",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 100001",
   "Gender: Male",
   " ",
   "Age at time of experience: 22",
   "Added: Sep 18, 2013",
   "Views: 805",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n00:00 - Just dropped tab alone. Holding under tongue w/o swallowing any spit.<br>00:12  Constantly chewing on tab, swishing saliva around mouth. Have a funny feeling in my chest. The typical Im on drugs feeling.<br>00:20  Tab is disintegrating, trying to find something to do while holding spit in my own mouth.<br>00:44  Finished watching a TV episode on my phone, still feeling funny, no visuals. Starting to doubt if I was going to trip at all.<br>00:45  Jaw extremely tired from holding in saliva. All of saliva swallowed followed with a chaser of water.<br>00:47  As quoted in a text Im def trippin. Feeling very funny, hard not to laugh at anything, things starting to look funny, feel hammered.<br>00:55  First sign of visual trip is bark on a tree. Things just looking different. Full understanding that I am on drugs. Cant stop laughing at random stuff, sense of confusion, feel extremely drunk.<br>01:15  Laying out by pool in the sun. Ground is moving, breathing almost. All patterns/colors moving. Confusion, feeling hammered, not wanting to be around anybody I didnt know.<br>02:20  Just got back from pool. First sign of heavy motion trails, heavy sense of confusion, everything is hilarious. Spent last hour trippin with heavy closed eye visuals. Almost as if dreaming while still awake. Several mood swings. Sun, wind, noise, water, everything feels amazing. Very intense mind trip, second guessing, the world is just different.<br>02:25  First contact with a mirror. Feels like I am rolling heavily. Body looks indescribable, feeling ripped, confusion, heavy motion trails, laughing at the fact that I have no idea what is going on. Texting at this point is very hard. Hunger is kicking in, havent eaten since earlier this morning.<br>02:30   Extreme confusion, second guessing how to dress, second guessing what is normal to say, do, act, etc. This was the peak of my experience. Tried listening to music, but did not notice it being very amazing. However I did not not like it. <br>02:45  I decide to jump on my motorcycle. (I DO NOT CONDONE THIS ACTION). Extreme motion blur/trail. Listening to electronic music as I ride. Music at this point was calming if anything.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] <br>02:58  Still riding motorcycle. Starting to feel a comedown, very slight however. Still heavy motion trails, and distorted body feeling, and understanding of anything that is going on. Quoted from a text I feel like I am flying a dragon.<br>03:43  Just got back from ride. Consistent motion blur/trails, hallucinating flocks of birds in the sky. Raced a Mustang BOSS with up to speeds of 160mph. (AGAIN I DO NOT CONDONE THIS ACTION). Felt like I was going light speed in reference to Star Wars, extreme tunnel vision.<br>05:00  Ground is no longer moving, however motion trails still heavy. Had a couple beers with a large dinner, still feel under obvious substance. <br>07:00  Finishing up trip, motion trails still noticeable slightly. Feeling relaxed, reflecting on the heavy trip that had conspired. Overall a very pleasant, yet heavy, hallucinogenic experience.\n\n\n"
}
