{
 "title": "Simply Amazing",
 "author": "Rob",
 "citation": "   Rob. \"Simply Amazing: experience with Methylone & Piracetam (ID 100010)\". Erowid.org. Jun 19, 2013. erowid.org/exp/100010",
 "substance": "Methylone & Piracetam",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.2 g",
   "oral",
   "Piracetam",
   " ",
   "  T+ 0:00",
   "1 g",
   "oral",
   "Vitamins - Choline",
   " ",
   "  T+ 2:00",
   "200 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 2:45",
   "50 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 3:30",
   "1.5 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   "  T+ 3:30",
   "7.5 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2013",
   "100010",
   "Male",
   " ",
   "43",
   "Jun 19, 2013",
   "1332",
   " "
  ]
 ],
 "report": "<p>For several days prior each morning we took 200mg 5-htp, 500mg L-tyrosine, a B-complex, 2.4g piracetam & 500mg Choline, same dose of piracetam & choline repeated in the afternoon</p><p>Day of: 2.4g piracetam & 500 choline in the morning (8:00 am)</p><p>T-2:00 3.2g piracetam & 1g choline</p><p>T-1:00 500mg Magnesium</p><p>T-0:00 200mg Methylone</p><p>T+0:45 50mg Methylone</p><p>T+2:00 500mg Magnesium</p><p>T+5:30 1-2mg Klonopin & 5-10mg Ambien to sleep</p><p>THC from the initial Methylone dose and throughout the night, usually 2-4 bowls worth dependng on the night</p><p>My wife and I both have many years experience with multiple substances the primary being THC, LSD, MDMA (and MDA/MDEA) and GHB. I personally am on a daily pain regimen of 30-40mg of oxycodone and 1-3mg klonopin and we both take ambien to sleep about 5 nights a week, I avoid the oxycodone as long as possible to avoid any numbing side effects on days we will take MDMA or methylone so usually I will take a dose 5 hours prior to the methylone/MDMA and one at the end of the night. At our peak with MDMA we took it every week for approximatly 1.5 years around 1998/1999, afterwords dropping the frequency rapidly to currently about once a year. During our peak MDMA years we started and followed the 'original' pre-load regimen of 5-htp, tyrosine, magnesium, DLPA and Glutamine with 200mg of 5-htp taken daily during the week.</p><p>Our first experience we did not know for certain it was methylone as my testing kits were no longer chemically active from age. The supplier was someone I trusted so we took him at his word and later testing with Marquis & Mercke reagents both indicate methylone. All methylone weights were taken with a digital scale.</p><p>The first three times we did not do the piracetum or choline supplements and instead did our standard MDMA pre/post loads which did not seem to have much of an effect one way or the other. The 4th time with the piracetum supplements resulted in a tremendous difference in both the experience and comedown. Once we were both at our peaks and had 2 or 3 hits of THC we felt we honestly could not tell the difference between this and an MDMA experience. The empathic qualities were far more pronounced and the body/head rushes were extremely intense and pleasurable. The first two hours were spent in bed drifting back and forth between massages and running fingers through each others hair and full on sex.</p><p>Once the effects started to diminish around T+3:00 the comedown was far, far more relaxing than the first times we had tried methylone and there was almost no stress at the thought of the night starting to end. Instead of familiar 'Damn its over' there was an extremely relaxing and gentle drop from full peak to just stoned over about 2 hours. There was none of the 'Nononono its over can we take more to bring it back' feeling, just an overall 'That was really fun, too bad it cant last all night but we'll do it again in two weeks' while we drifted into just listening to music while still giving each other light massages and giggling from the pot.</p><p>The difference between taking it with piracetam and without was extremely obvious to the point that neither of would want to take methylone without it.</p>"
}
