{
 "title": "One of the Old-School Sedatives",
 "author": "Pharmacologuy",
 "citation": "   Pharmacologuy. \"One of the Old-School Sedatives: experience with Chloral Hydrate (ID 100216)\". Erowid.org. May 21, 2013. erowid.org/exp/100216",
 "substance": "Chloral Hydrate",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1000 mg",
   "oral",
   "Chloral Hydrate",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2013",
   "100216",
   "Male",
   " ",
   "21",
   "May 21, 2013",
   "1575",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have always been enamored with the pharmaceuticals of the past. Leading me to study pharmacology in college.  I had always heard stories of the 'holy grail' sedative/hypnotics such as Qualuudes, Placidyl, Seconal, Chloral Hydrate, etc. </p><p>        </p><p> After some research I discovered that almost all of these medications had been discontinued except for Seconal and Chloral Hydrate, both of which are extremely rarely prescribed by doctors in favor of benzodiazepines (triazolam, flurazepam, temazepam, etc.) or even more recently the new 'Z Drugs' such as zolpidem (Ambien), zopiclone (Sonata), and Eszopiclone (Lunesta), because these drugs have a large therapeutic window and much more manageable dependence and overdose. As well as a lower abuse potential (supposedly).</p><p>        </p><p>I fortunately (maybe unfortunately) came across a psychiatrist that respected my opinions and was open to exploring the treatments that I thought would be effective. So after going through various first line insomnia treatments I mentioned chloral hydrate, which he informed me was very addictive. I informed him why I believed that this would be an effective treatment and that the benefits would outweigh the risks, so I was prescribed Chloral Hydrate syrup. I was to take  two 5ml teaspoons of 500mg. each. So 1,000mg or 1g total.</p><p>   </p><p>+0:00        After finding the only pharmacy in town who stocked it, I took my first dose.</p><p>+0:30.      I feel a general numbness not unlike the effects of 3-4 alcoholic beverages, including the increased sociability. With minor euphoric properties.</p><p>+1:00.       The effects have now peaked. I feel a slight drunkenness which is mixed with euphoria. I am very calm and I enjoy just sitting and relaxing. True to its indication I am very sedated. Sleep could come very easily. </p><p>+2:00.  I lay in bed and slowly drift off into a deep sleep, completely void of any dreams.</p><p>The next morning I was extremely groggy and I felt un-rested. </p><p>The second night was much of the same.</p><p>My third  night I was very disappointed. I took the exact same dose with the same amount of stomach contents, and I didn't get any of the numbness or euphoria, only a light relief from anxiety. I found myself battling insomnia even. It was as though I had developed a tolerance over 2 nights! I knew that tolerance built quickly but this was unbelievable. I know why this drug isn't a first line treatment anymore.</p><p>All in all this drug is interesting but unpredictable in my opinion. This is a substance to be respected as well. I have read that physical dependence develops in as little as 7-10 days with a withdrawal profile similar to alcohol. Including delirium tremens and seizures. As well as carcinogenic properties.</p><p>  This substance may be best suited for the glorified stories of generations past.</p>"
}
