{
 "title": "Mad Anxiety",
 "author": "red rum",
 "citation": "   red rum. \"Mad Anxiety: experience with Ecstasy & Alcohol (ID 10025)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10025",
 "substance": "Ecstasy & Alcohol",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   "8 ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10025",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2005",
   "Views: 10575",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been doing E for 2 or 3 years, I've only done around 30 or so pills and I never do more than 1 1/2 at a time. I'm a pretty careful user and I'd never had a serious reaction. I think the problem this time may have been that I was stressed out in general and had a bad experience with a girl I thought I trusted. I was a bit depressed I guess. </p><p>Anyway, after getting a bit drunk, maybe 7 or 8 drinks, I was still in control, me and a friend decided to do some E. I knew it didn't combine well with drink, so we split one pill between us. I was in a great mood at this point from drinking and felt brilliant as the E started to kick in and slowly build up to that feeling of euphoria. You know the feeling, when you know you're just going to have a great night. </p><p>Then it all started to go wrong. I started to get anxious, and everything seemed wrong. I've had it before, it's a common reaction, you just ride it out. But this felt a lot worse and was coming on fast. I spent the next couple of hours worrying like crazy, convinced I'd hurt myself badly. After a few hours I calmed down, but I still felt all wrong. I was in control, but my head was just telling me something was going wrong, and it was intense. I smoked some cigarettes and sat around watching others dance at the club we were at until I went home to sleep.</p><p>The next day was the worst feeling, when you wake up and your head is just on fire. I had a massive headache, it was ringing like nothing else and I still felt really anxious and was shaking. By now I was really scared. The day after was even worse, I couldn't go to work. I couldn't relax, I was completely on edge, I drifted between watching TV for 2 minutes to going for a walk. Nothing could take my mind off it, I was in a permanent state of anxiety. </p><p>I don't know if it was nervous exhaustion, but my vision started to slow down and get blurry. I couldn't eat or sleep anymore. I was completely exhausted but couldn't sleep, I was in that state you get when you're coming down off E and you just want to drift off but you can't. I went and saw a doctor and he told me not to worry, it'd wear off, but I didn't believe him. I thought I had brain damage. I was off work for a week and I'm on anti-depressants now. Two weeks later I feel much better, though still slightly on edge and down.</p>"
}
