{
 "title": "25B-rilliant",
 "author": "25B-rilliant",
 "citation": "   25B-rilliant. \"25B-rilliant: experience with 25B-NBOMe (ID 100347)\". Erowid.org. Sep 20, 2013. erowid.org/exp/100347",
 "substance": "25B-NBOMe",
 "bodyweight": "98 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 mg",
   " ",
   "25B-NBOMe",
   "(blotter / tab)",
   "  T+ 3:00",
   "1 mg",
   " ",
   "25B-NBOMe",
   "(blotter / tab)",
   "  T+ 5:00",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2013",
   "100347",
   "Female",
   " ",
   "17",
   "Sep 20, 2013",
   "1330",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Drugs consumed before experience: tobacco, cannibas, aMT, 25i.</p><p>Set: I am extremely interested in hallucinogens, and positive about my ability to handle strong trips. I understand that mindset is important for having a good psychedelic experience, and would never take anything that I am unsure of, or if I am not feeling positive. The only other drug I had consumed that day was my birth control pill.</p><p>Setting: I would be tripping with my boyfriend, J, (18 years old) and his friend, B, (18 years old).</p><p>J has tried the same drugs as me, with the addition of 25C.</p><p>B has tried the same as J, but with the addition of ecstasy (content unclear - he never tested them and said he didn't feel much) and cocaine (but not a large dosage).</p><p>It was an incredibly sunny and warm day, the warmest of the year so far.</p><p>B was already at J's house, and they walked to meet me half way to his house. On meeting each other, we decided to take the tabs. It was still about a 30 minute walk to J's house, but we decided we wouldn't come up too much until we got there.</p><p>T=0:00 (4.40pm). We each took one tab (1mg) and continued the walk. After about five minutes, our mouths were filled with saliva so conversation became scarce.</p><p>T+0.10. I began to feel somewhat heavy. Moving my legs felt strange. I wanted to sit down, but thought it would be best to keep walking.</p><p>T+0.15. Things began 'breathing', I was already getting slight CEVs and I began to feel a bit sick.</p><p>T+0.20. I noticed my saliva was thick and disgusting. I took the tab out, spat my saliva out and put the tab back in. J did the same. My nausea felt a bit worse.</p><p>T+0.30. Visuals were getting  intense. It was as if the brightness had been turned up, and everything was now in HD. Everything was 'breathing' and moving. I was loving it, but we had to take a moment to sit down to readjust to our new perception of reality.</p><p>T+0.40. We all spat our tabs out, then got up and continued our walk. Everything was insane. It all looked new and different, and we seemed to be walking forever. J and B felt as if they could continue walking for hours but I just wanted to sit down.</p><p>T+0.50. We eventually arrived at J's house. I lay down outside, while they brought out beanbags, a blanket and speakers. We lay outside admiring the visuals, stroking J's cats and just enjoying ourselves until around T+2.20, when we went inside.</p><p>T+3.00. Second tab (1mg) taken.</p><p>T+3.30. Tabs were out. The visuals had slowed down, but the 'psychedelic thinking' had increased. Everything was a bit confusing and strange and different. It was like experiencing life for the first time.</p><p>T+5.00. This time is approximate, as I had become too engrossed to check the time. B rolled joints, joints were smoked. Everything went absolutely crazy. Everything looked like a cartoon. I lit the lighter and held it up to my face, and the flame was extremely pixelated. We replaced the light in J's room with the black light and B put on his tshirt that we had decorated with UV paint the week before on aMT. B painted J's bong with UV paints. </p><p>By this point, I think I was at (+++). The cartoon vision was making me slightly paranoid, convinced that I was in a television show, none of my memories were real and this trip was the only thing that had ever happened. I never shared these thoughts with J or B because I didn't want to seem strange. Although there were times I was convinced it was true, I wasn't worried about it. I just accepted it.</p><p>T+5.40. We decided to sit outside in the dark and smoke some more. It was beautiful and peaceful and wonderful. There was a full moon, which was pretty magical.</p><p>I'm not quite sure, but I think I was back at baseline at about T+8.00, maybe T+9.00. I didn't sleep until the early hours of the morning, but it didn't matter because I was too engrossed it what I was seeing and feeling; I didn't want to sleep. </p><p>The next day we each felt headaches. J's headache went away after some weed and aMT. I vomited about an hour after taking my aMT, so I most likely threw it up as I didn't feel anything. B took his first dose of aMT in the late evening and I took a second dose then too. This time, the aMT removed both of our headaches and I no longer felt ill. </p><p>We are not sure if the headache/sickness was due to the 25B, but if it was then we all agreed that it was worth it.</p>"
}
