{
 "title": "Sugar and Spice and Everything...?",
 "author": "psyonic-one",
 "citation": "   psyonic-one. \"Sugar and Spice and Everything...?: experience with Spice & Synthetic Cannabinoids (ID 100341)\". Erowid.org. Sep 13, 2013. erowid.org/exp/100341",
 "substance": "Spice & Synthetic Cannabinoids",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 100341",
   "Gender: Male",
   " ",
   "Age at time of experience: 36",
   "Added: Sep 13, 2013",
   "Views: 770",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have gone down the synthetic cannabinoid rabbit hole and returned. You may know it as spice, potpourri or incense and maybe you have even gone as far as getting raw chems like me and making your own 'blends'. Whatever the case, I have personally found both the dregs of addiction and the upper echelons of enlightenment. These chemicals have, in my opinion, great potential..and also great risk.\r\nMy first forays into the spice world came rather innocently, having heard about the first few brands and rumors that they 'worked'. Upon entering a local smoke shop, I discovered what appeared to be a similar 'potpourri' substance. This strawberry flavored stuff seemed innocuous enough but, upon smoking a hit when I got home, I found myself propelled rather far into the 'stoned' vibe. I was surprised and upon my partner entering the house, shocked at just how off-kilter I actually was.\r\nLike many things of this nature in my past, I quickly became obsessed. I began buying many similar products, touring the various smoke shops available to me in my metro area, trying different brands and blends until I found a few favorites. Eventually, I even went as far as finding raw chemicals online, ordering them, and experimenting with my own homemade blends. \r\nI bought grams of jwh-019, 210, 250, am-2201, and other synthetic cannabinoids, blended them with denatured alcohol, added them to herbs, and allowed the alcohol to evaporate. Through experimentation, I was able to make rather potent (one hit) blends that propelled me deep into something more than stoned...something that was on par with psychedelics even.\r\nNow several months in, I was smoking store bought and homemade blends many times a day. At the peak, I was smoking as much as 10 grams of high potency cannabinoid blend a day...sometimes more.... We're talking at points, 1/2 a gram of cannabinoids a day. Even doing base hits from crack-pipes.\r\nThe results have been both horrifying and lovely.\r\nThe experiences, which I know now I can never recreate, of smoking high potency homemade blends where a single hit is equivalent to taking and 1/8th of regular THC in a single hit, were, and remain, some of the more beautiful experiences I have experienced.\r\nAt times, a deep MDMA like empathy was prevalent. I was able to experience an indescribably deep connection to eternal input from audio to video to real life. The connection to grand empathic experiences like I have not experienced since doing MDMA drew me further in. I also began experiencing DMT-like time dilation.  \r\nCertain times I used my home blends, or even the more potent store blends (now essentially unavailable), I experienced complete psychedelic experiences, with visuals, true psychedelia, time distortion, and emotional empathy all rolled into a rather abruptly short (20-30 minutes) experience with a lingering 'stoney' vibe.\r\nNow nearly a year in, I begin to recognize some very detrimental effects to my indulgences. A persistent cough, insomnia, anorexia and compulsory use all set in. I lost 70lbs. I was using 70% of the waking day, even smoking at work. I stopped dreaming. I even began to cough blood. No matter...I kept smoking.\r\nI had recently broken a bone rather seriously, and knowing that MJ helped with pain management, I figured synthetics were a cheaper alternative. And while the synthetics did indeed ease pain at first, they became a pain and symptom in and of themselves in the long run, aches becoming a justification for abuse.\r\nSince beginning use, I have been diagnosed with chronic bronchitis with COPD like symptoms. At times, my insomnia lasted for days and days on end with the longest stretch of inconsistent sleep being some 14 hours in 14 days. At that point, I was no longer human. I was living in a constant dream...sometimes beautiful, and often horrible.\r\nHaving been addicted to crack at a previous place in life, I can say that this was nearly equivalent. Some nights I would stay awake all night smoking, entering a dreamy state, and 'waking' again 10 minutes later only to smoke some more. At points, I experienced heart arrhythmia, loss of consciousness and distinct fear that I was literally killing myself and unable to stop. At times, I was even OK with all that. \r\nSome of these experiences were absolutely beautiful. Many were horrible, scraping the depths of my own human addiction potential, lies, self-destruction and all.\r\nAt this point, after nearly two years, and ironically, intervention by the fucking government, I have been able to break the habit. I will admit that I still smoke occasionally but have been able to manage my addiction through supply and potency issues and straight up will power.\r\nDo what you will, but from the perspective of a serious veteran, these were among some of the most difficult, indulgent, and destructive substances I have experienced personally. Caveat emptor.\n\n\n"
}
