{
 "title": "Finalization And Then Rebirth",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"Finalization And Then Rebirth: experience with Psilocin & 5-MeO-DMT (ID 100384)\". Erowid.org. Jun 3, 2013. erowid.org/exp/100384",
 "substance": "Psilocin & 5-MeO-DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "IM",
   "Psilocin",
   "(liquid)",
   "  T+ 1:00",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "2013",
   "ID: 100384",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 3, 2013",
   "Views: 1752",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The vehicle is 4-Ho-DMT fumarate.  10mg will be taken by IM injection.  I read a lot of (western) ibogaine initiates find a dose of mushrooms a few days after ibogaine is very helpful/good.  Four weeks have past for me and I know it is going to be good.  Ive never used psilocin from a lab before.  Since I am not a fan of the wave-like action of mushrooms I am going to take this via a muscle shot.  I am very curious if IMed psilocin will resemble the intra-muscular DMT excursions I am so fond of.</p><p>Cue up Rushes by The Fireman, light a candle, say a prayer, I decide to take 7mg for now and see how that hits.  I take the shot and wait.  About 5 minutes in, I felt a heavenly Godly type of trip setting in, similar to my DMT trips.  I decide to take the extra 3mg and almost immediately I started peaking.</p><p>I notice right away that this is NOTHING like IMed 4-AcO-DMTthis is a very cold (but in a very good way), deep, VERY too-the-point spiritual experience4-AcO-DMT is a warm, happy, gentle round about spiritual experience.  I cant say one is better than the other but on this occasionpsilocin seemed like something that God himself ordered up for this night.</p><p>The primary effects lasted about an hour and were dominated by the experience of revisiting my ibogaine experience, patching up loose ends, revisiting some parts, reliving other parts, and basically adding a fitting conclusion.</p><p>By the time the album was over I was in tears filled with the feelings of Grace and Knowledgeand joy for having my life back after 10 years of solid opiate addiction.  I realize (again) how fucking lucky I am to made it out alive, and to have the family I do that supports me in my process back to the world of the living.</p><p>I thank the Universe for the psilocin I had in my safe and giving me the knowledge I need to make the most of my life from the point forward.  But my night is not over.</p><p>I was given my life back on ibogaine, now this psilocin has finished patching up the loose ends.  More work needs to be done; I measure out 10mg of 5-MeO-DMT because it is time to be reborn again.</p><p>I take a shower to wash away the old and cleanse myself before I take the sacrament.  Back in my room, I put on Today by Jefferson Airplane (in a loop) and prepare a bowl of tobacco and 10mg 5-MeO-DMTthe tobacco to carry my prayers away for rebirth as the 5-MeO-DMT enters my system.</p><p>I take the hit and am propelled into the cosmic white void of total and complete love.  The song is playing in a loop</p><p>Today, I feel like pleasing you</p><p>More than before</p><p>Today, I know what I want to do</p><p>But I don't know what for</p><p>To be living for you</p><p>Is all I want to do</p><p>To be loving you</p><p>It'll all be there</p><p>When my dreams come true</p><p>Today, you'll make me say</p><p>That I somehow have changed</p><p>Today, you'll look into my eyes</p><p>I'm just not the same</p><p>To be any more than all I am</p><p>Would be a lie</p><p>I'm so full of love</p><p>I could burst apart</p><p>And start to cry</p><p>With you standing here</p><p>I could tell the world</p><p>What it means to love</p><p>To go on from here</p><p>I can't use words</p><p>They don't say enough</p><p>The joy and ecstasy I felt cannot possible be described.  This was not just euphoria because I felt good and was trippingI realized that today I was going to take some profound steps in my life to move forward.  Friends and family who can open opportunities to me, who have been there waiting, and now today I am ready to call them.  I realize I am reborn.  I am starting new today, and I am going to begin work on my future.</p><p>After a year of weaning off opiates, detoxifying, then almost two months of PAWS and hopelessness, iboga saved me.  It gave me my life back last month.  Now tonight after psilocin and 5-MeO-DMT I am reborn again and free tomorrow to begin making the connections I need to return to society as a productive, functional, and happy person.  I start coming down from the 5-MeO-DMT but I am being filled with more and more knowledge and realizations.</p><p>I start to think about a family member of mine who has never tripped but having seen the powerful transformation with ibogaine that rewired me.they now wish to become an initiate.  Some much more is going on but it is on a very personal level and beyond the scope of this report.</p><p>Suffice to say, the overall experience was an astounding ++++.  I am filled with a deep euphoria the rest of the morning as I drink my coffee and type this.   Life is amazing and it is only just beginning.</p>"
}
