{
 "title": "Someone Should Have Warned Me",
 "author": "ThirdEyeOpen",
 "citation": "   ThirdEyeOpen. \"Someone Should Have Warned Me: experience with Methoxetamine (ID 100443)\". Erowid.org. Dec 8, 2013. erowid.org/exp/100443",
 "substance": "Methoxetamine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "IV",
   "Methoxetamine ",
   "  T+ 5:00",
   "100 mg",
   "IV",
   "Methoxetamine "
  ]
 ],
 "footer": [
  [
   "2012",
   "100443",
   "Male",
   " ",
   "25",
   "Dec 8, 2013",
   "1219",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 100 mg of methoxetamine is considered an extremely high dose, see Methoxetamine Dose Chart] </p><p>After being arrested on bullshit charges and spending 54 days in jail, my tolerance to every drug was pretty much gone by then. When you spend that long in confinement, just being in the outside world is almost a high in its self. Let me give you a little background about me. My drug of choice is opiates, which I've been using over 10 years starting with a botched surgery. Though my addiction is somewhat under control now there was a time where I thought I couldn't even breathe without them. For 4 years I was a homeless junkie roaming the streets of Portland, OR. I gave everything for that drug, but eventually had to leave it behind. After moving to Washington I began experimenting with psychedelics to 'expand the mind' and try to see the beauty in everyday life that seems so absent in the thick of a massive heroin addiction. Lots of acid, lots of mushrooms, but fast-forward back to my release from jail. My friends started telling me about this research chemical MXE that was legal and can be ordered online. When I asked what it was like they told me similar to PCP which I've never tried. Being a long-term IV Heroin addict I had no aversion to needles and believe it's the best way to administer most drugs so I took that route. </p><p>9:55 PM</p><p>I'm handed a syringe full of MXE. It looked like a very small amount, but I was quickly told it was more than enough. Since my veins had a break I hit fairly quickly. As I came out of the bathroom, I began to anticipate a rush of some kind, and started to get a taste in my mouth like chewing on a rubber balloon.</p><p>9:57 PM</p><p>Instantly I felt my soul leave my body and I started leaning back in a very bizarre pose where I was standing but bent backwards. These otherworldly sensations began to pass through my body, as if I had recently inherited a new sensory organ - suddenly I could feel energy as a living force passing in waves throughout the room. I jokingly accused my friend of stealing my body, then sunk down onto my knees while inching my face closer to the floor.  My arms didn't seem to be a part of my body anymore and began by themselves to make repeated robot-like movements. At a snails pace I began to move closer and closer to the floor until suddenly I felt as if I had merged with the asphalt in the room (which there was carpeting in there - no asphalt). I merged into the floor, completely forgetting my friends even existed. I became part of the room, no longer an individual, but part of a whole. It felt as if I were tapping into the cellular consciousness of inanimate objects and realizing they were alive in their own way. After spending a good 45 minutes on the floor, I rose and surveyed the room and once again became aware of my friends. My GF had somehow caught herself in a loop and was only capable of speaking our names in repetition. Jake was sitting on the bathroom floor with his pants around is ankles wearing a vacant expression.</p><p>11:00 PM</p><p>Feeling the fog clear in my head I was once again capable of rudimentary thinking. Perhaps the most odd thing about the high was a repeated sense of deja vu, like I had repeated this exact process in another dimension. I kept feeling as if I were back in high school, aware of all the assorted cliques and social classes, but this time I found it all amusing. I realized that I am a part of everything and yet at the same time I'm nothing. Finally attempting to converse my friends, I found my speech had an odd intonation. It was as if every sentence spoken would gradually rise in pitch until the period. Simple tasks were a challenge for my infant-like mind. All cognitive functions were impaired. I neither liked nor disliked the high, I wasn't even capable of opinions about anything.</p><p>12:15 PM</p><p>Every minute that passes my sobriety increases. Except for a weightless body sensation and difficulty forming thoughts the drug is all but gone. Jake asked me to prepare a shot for him. When I asked how much to put in the spoon he told me a good amount. Reaching into the bag I brought out a big pinch which probably weighed 2/10ths of a gram and asked if this was enough. He started laughing hysterically and said it was twice as much as he needs. So I split up the shot and put the other half in my front shirt pocket. After administering his dose for him, he began a vacant stare which lasted over an hour.</p><p>3:00 AM (Insomnia)</p><p>The effects of the drug have long since worn off. The only thing left is complete insomnia. After it became clear to me that I wasn't getting any more sleep, I decided to re-dose with that half shot I had in my pocket. Sliding the needle into my vein, I flagged the shot and started to push in when my vein blew, missing almost the whole shot. Unlike Heroin, missing didn't burn at all and I did manage to get a bit in there, leaving that strange rubber taste in my mouth.</p><p>3:15 AM</p><p>I reached for my weed pipe and was about to test how the two mix when I felt a wave of energy swoop through the room. With the pipe still in my hand (simple blown glass with carb) I noticed the bowl of it became a center point in gravity. The room began to swirl around in my peripherals, while staring direct appeared normal. A whirlpool of energy started being pulled into my pipe, as if my bowlpiece were a blackhole and the room was being sucked into it. Capable of very little thought or feeling I sat on my bed gripping my pipe and staring in awe for over 2 and a half hours. I couldn't shake the feeling that an evil presence was watching me from behind and I started to convince myself that I would never return to normal.</p><p>5:45</p><p>Thoroughly spent with very little brain activity, I tried sleeping and once again found it impossible. Neither happy nor sad, I felt like a piece of furniture. After going to check on my friends I found them also awake. Part of me was a bit irritated that I hadn't been warned about the effects. I use drugs to feel good, not to escape dimensions. Though eventually I realized there was no real way to warn me about it.  Here I'm attempting to, but words don't exist to describe the bizarre transition into a dimension where living energy flows as freely as the wind - able to grasp, shape, and manipulate it. If astral projection were a possibility, I think MXE would be the closest way to experiencing it. </p><p>Epilogue</p><p>Although offered it many times, I never did indulge in any more MXE. Whatever you hear from people, it is nothing like an opiate. Perhaps the only similarity is a dulled sensation of pain. My buddy Jake, however, became hopelessly addicted. Suddenly this bright, humorous, ambitious guy started spending his days as a drooling infant. At times I'd walk by and find him naked with a needle still in his arm and a look as blank as an overmedicated schizophrenic. Trying to talk sense into him just wasn't a possibility when he didn't know who I was most of the time. The only thing that made him stop was when he ran out. </p><p>Though the name sounds a lot like Ketamine, do not confuse the two. They share very little effects. MXE didn't appeal to me in the least, but proof exists of its severe addiction potential. If you are prone to drug abuse please use caution! I'm glad I experienced the drug, but given the choice next time I would have said no.</p>"
}
