{
 "title": "Spirit Binding",
 "author": "Firewolf",
 "citation": "   Firewolf. \"Spirit Binding: experience with Mushrooms - P. cubensis (ID 10041)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10041",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10041",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2005",
   "Views: 3026",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe Value of Learning<br>Over the course of adolescence, I realized that I never fit in. Not with my stoner buddies, not with the academia nuts, no one. I turned to myself, and, for the most part, my beloved (K)This solitaire approach at the world has made me a very strange person. I took the Shaman path, and learned as much as I could of the world around me. This eventually provided me with the means of mushroom productionI Consumed many 'lessons' and this is one of them<br>It was a quiet and unpleasantly lonely Saturday evening, and I felt as if the spirit of the mushroom wished to speak to me. I gladly smudged myself, meditated, and accepted the challenge offered. I gladly peeked into my dry chamber and acquired four grams of cubensis, quietly munching them down with some orange juice, sitting on my futon. Being on an empty stomach, I was rapidly catapulted into a very stoned, confused feeling. I began to feel very heavy, and my thoughts wandered in the direction of love and light. I embraced the warm feeling radiating from within, and released the negative energy I usually harbor. Thoughts seemed to swirl about my head rather rapidly, and I began to write them down. The writing quickly turned to incomprehensible slurs, so I decided against it.<br>It did me no good to reflect on 'the emanid of ansklrj is sooo ahiutou' At least not then. I began to see geometrical shapes on my body, as if my previous life was being revived. I heard the sounds of ancient Asian gongs, and pondered the possibility of Cubensis originating there. As the experience progressed, something very new occurred to me. My long embraced spirit teacher, the Wolf, became me. I became Wolf. Suddenly I WAS a wolf. I was playing in the snow, and I could see the rest of the pack in the far off distanceNO words can do this experience justice. I could feel the cold barely penetrating my fur (fur I could feel!) I could smell the freshly killed animal, see my burning yellow eyes, hear the howling, that magic howling reverberate through me<br>About 30 minutes later, I found myself laying on the floor, weepingMy thoughts turned to (K), whom I love dearly. I felt as nothing, undeserving of her affection. I realized that true love knows no moral boundaries, different religions do work, because love goes deeper than what we embrace in this life. I could feel her vibrations near me, how she had permanently effected the world around me, leaving a beautiful mark on a dismal beingBy now I was coming down, and realized that the lessons learned were sacred, and very conflicting. About 6 and a half hours after ingestion, I drifted off to sleep, with no memorable dream activity. Soon after, I realized that the geometric pattern that had formed on me wasn't random, but was actually a rendition of Christianitys 'trinity mystery'. The image was burned into my consciousness, and to this day have never forgotten that image, in fact, it is now a personal mark of importance.  <br>The wolf I will never forget, as I will never know if I was alone that night, or was really there, cantering over the Earth, happy, and solitaire.\n\n\n"
}
