{
 "title": "Not For The Squeamish",
 "author": "SpongeBob",
 "citation": "   SpongeBob. \"Not For The Squeamish: experience with Syrian Rue & Amanita muscaria (ID 10049)\". Erowid.org. May 22, 2002. erowid.org/exp/10049",
 "substance": "Syrian Rue & Amanita muscaria",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   "  T+ 1:00",
   "7.5 g",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10049",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 22, 2002",
   "Views: 23385",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n  I am an occasional psychonaut, meaning that I get the urge to trip about once a year. Most of my experiences were '75-'82, high school and college, therefore my system is fairly clear. I got the urge after reading Robert Anton Wilson's 'Cosmic Trigger' triology. I became curious about Leary's 'neural imprinting' research. Since I am a sporadic user at best, I tend to lose touch with my sources. After moderate research, I decided to try this substance. It's also legal, another plus. </p><p>  Below is a chronological narrative of my experience with this notable compound.</p><p>T-22hrs.  Last Meal</p><p>T- 3hrs.  Stopped liquid intake. Had read that a lot of A. Muscaria gets washed out in the urine. I didn't want to have to drink my pee.</p><p>T- 1hr.   Ate 3gms crushed Syrian Rue Seeds for MAOI effect.</p><p>T- 0hr.   Ate 7.5gms slow-dried shrooms advertised as Grade A. Felt a little out-of-phase, could have been the rue or psychological anticipation effect. Taste of shrooms was peanutty, with a distinct odor of sweaty socks.</p><p>T+ 1/2hr. Onset. Body sweats, chills, nausea. Did not vomit. Tried 2 tokes of MJ and that seemed to work for the nausea. Body feels drunk, but thoughts are starting to race. Feels better to lay down.</p><p>T+ 1hr.   Physical discomfort gone. Glad that part is over. 'Body drunk' mellowed to analgesia/euphoria. Beginning to feel 'trippy'. Began watching 'Odyssey Into The Mind's Eye' video. (graphics/music) Hard to stay focused mentally.</p><p>T+1-1/2hr. Motor skills impaired. Consciousness is beginning to alter. Feel like I have one foot in the door. Visualization easy now. Considered taking a higher dose, but stomach said no. Took 15 minutes to write this paragraph.</p><p>T+ 2hrs.  Dammit! Gotta pee. The reports I've seen say A.Muscaria pee is as strong as the tea for 3-5 body cycles. I am feeling close to Peak, I guess another first will be O.K..</p><p>There is only about 4oz of pee...well,shit...I guess if it is good enough for Siberian Shamans...then, By God (fuck)... It's good enough for me. Mixed a double strength batch of Kool-Aid, mixed 1/2 Kool-Aid and 1/2 pee, and down the hatch. Tasted like the shrooms, but salty and acidic.</p><p>Thoughts still racing. Feels now like about 2 hits of fair street acid without the speediness. Vunerability state coming on, becoming impressionable. Usual worries and negative thoughts come and go, but not amplified. Positive thinking comes easily. Feeling hungry. Think I can handle a 2 block walk to Taco Bell. Vision blurry, attention deficit, reading comprehension lowered.</p><p>T+ 3hrs. Peaking. Very 'acidy' but very mellow. Body effects minor. Went to Taco Bell, felt slightly self-conscious, but nowhere near abject paranoia. Couldn't have handled work, or a Republican Convention. Recycled piss 2 more times, 3oz each time. Getting ready to run a positive reinforcement subliminal video by Dick Sutphen called 'Monetary Success'. </p><p>T+ 4hrs. Plateau. Psychedelic tunnel-vision. Subdued cellular vibration. Watched the 'Monetary Success' video. Could see the subliminal messages being flashed. Got a CNS jolt when they flashed. Had a 'vision' that someone was going to send me back to college to get a Masters degree. They would pay tuition and give me a salary while I was in school. All I had to do was ask. I missed who it was that I was supposed to ask. (damn) Still prefer to be horizontal. Recycled pee for a 4th and final time. I do believe that it sustained the effects.</p><p>T+ 5hrs. Coming Down. Still impressionable. Ate my Taco Bell, opened a brew, and started watching 'Dune'. Heartplugs and shaven cats make sense now. Having guilty feelings for not being out right now, filling up my wallet. Got a big CNS rush when I heard someone at the door. Started feeling psychic, yanked out the Thoth deck and did a very accurate reading on my guest.</p><p>T+6hrs. Going to bed, listening to 'Brainwave Journey' audio tapes.</p><p>I have to rate this experience in the 'positive' column. I will difinitely be returning. (I bought an oz of this stuff.) I would like to further explore the high vulnerability state,  and find a way to subdue the onset physical effects. My advise to anyone wishing to try this is to have a strong belly, don't be squeamish about urine recycling, and respect your limits.</p>"
}
