{
 "title": "An Excellent Combination",
 "author": "doof",
 "citation": "Citation:   doof. \"An Excellent Combination: experience with 2C-I & LSD (ID 10046)\". Erowid.org. Dec 1, 2001. erowid.org/exp/10046",
 "substance": "2C-I & LSD",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "16 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 1:30",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10046",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 1, 2001",
   "Views: 25067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI've taken 2C-I about 10 times. I find it to be one of the most positive, yet most gentle, psychedelics out there. Extremely intense visuals without ever being overwhelming. I've followed a progression from a safe, home environment to outdoors, at art festivals, to having this substance in a club setting, surrounded by sweaty people in crowds, and the worst side effect I've ever had was getting very hungry. I've even started to experiment-- taking MDMA towards the aftereffects.\r\n2C-I is so slow and gentle, I've had people at T+2 hours insisting that it isn't working, but they're giggling at the trash on the sidewalk. Seriously: don't drive. I initially thought that the 2C-I experience lasted about 4-6 hours, though I'm thinking now that it's more along the lines of 8-10-- incredibly slow and gentle in the come-on and the come-down.\r\nThis particular evening, I'd planned to go to an outdoor arts festival, with music, costume, lights... I was covered in fur and expecting an excellent time, and I thought that 2C-I was a perfect experience for the evening.\r\nAbout 1730, I dropped a gelcap with ~16-18 mg of 2C-I powder in it. At about 1845, I was just on the edge of feeling warm, loved, extra-sensitive to its effects-- and all the art (incredibly cool while sober) was just getting nicer and cooler. As stated earlier, I think this is a tough material to judge 'where you're at', but I'd say I was at a nice, pleasant, +1/+1.5.\r\nA friend showed up, who had recently failed to procure a quantity of LSD. Unknown to me, however, he had managed to get a small quantity, and a small square of paper was placed right on my tongue. My judgement was a bit impaired, and it was a Sunday night (I have a day job...), but I figured: you only live once, so let's do it right. Onwards and upwards.\r\nNow some folks have a bit of stomach cramps with 2C-I, some folks get a bit queasy. I have none of that. Within 30 minutes I was feeling about a +2.5, and everything had just gone completely amazing. Certainly a part of this was set and setting (art, great people, etc.), but my entire world just went completely positive. I'd put it at a +3 or +3.5 within an hour. I stayed there for at least two hours, and quite possibly longer (it being impossible to keep track of time at this point), talking to people, dancing, and mostly wandering through the crowd, finding incredible friends, new and old to talk to.\r\nThere were photos that pretended as if they were blacklight photos, but they weren't. There was an incredible sense-- somewhat like the first time I did MDMA, when hugging friends-- of some sort of spiral energy signature going through both bodies. There was a Gigeresque alien playing with puddles of light on the ground. Fortunately, photos proved that this was a man in costume later. I remember thinking 'well, I'm on drugs, and it looks pretty cool, so I'm just going to accept it'.\r\nImportant to note: I'd had about 8 hours' sleep in 3 days. I'd been out clubbing with an inordinate amount of mdma 2 nights before, and had had a small abount of 5-MEO-dipt the night before that. I hadn't expected to feel as marvelous as I did.\r\nI've had a pretty wide range of experience with psychedelics: 5-meo-dmt, 5-meo-dipt, 2ci, mdma, mbdb, lsd, psylocybin, thc and cannabis, etc. This is, quite possibly, the highest I've ever been. Caveat: I've been a lot higher before, however, at any of those points, I started to become less and less functional -- floppy and tired yet wired (foxy, E), or plain wandering in other universes (5-meo-dmt).\r\nAt about T+8 hours, we packed up our art installation, got someone who hadn't been indulging to drive us home, and chilled and chatted for ~ 3 hours. At T+11 hours (from the 2CI), my girlfriend and I went to bed, and were still chatty-- we were both quite enjoying a warm body glow, positive experience, a little bit overwhelmed, a little tired, a little --very little-- cracked out. I really think that if we hadn't both had a 7AM alarm impending, we wouldn't have had a bad time at all.\r\nAll in all, I'd have to say that this is a combo that I am willing to try, again.\r\nand again.\n\n\n"
}