{
 "title": "Mild Hallucinogen, Miserable Comedown",
 "author": "TheTripMan1234",
 "citation": "   TheTripMan1234. \"Mild Hallucinogen, Miserable Comedown: experience with Allylescaline & Cannabis (ID 100507)\". Erowid.org. Jun 17, 2013. erowid.org/exp/100507",
 "substance": "Allylescaline & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Allylescaline",
   "(powder / crystals)",
   " ",
   "  repeated",
   "vaporized",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 100507",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Jun 17, 2013",
   "Views: 1563",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>T 0:00 Very peaceful June day at 75 degrees F. I was very sleep deprived for the last two weeks averaging a little less than 5.5 hours of sleep each night. Slept on-and-off for a total of 10-11 hours last night but I feel very well rested. My friend and I feel mentally prepared to trip with a carefree mind. We dissolve the 25 mg of Ally from its non-gelatin capsule it was originally in into a glass of water (about 4-6 oz). (He eats the capsule to make sure he gets all the thin white powder. We begin sipping on the water/powder combo. The Ally is not visible in the mixture. I have decided to document this experience since I have not submitted a journey report, despite tripping roughly 5 times before this. Ally is also not well documented so I also feel it is important to for others to hear a detailed report of my feelings. I am very excited to let this substance become one with me and have a journey of its own through my body.</p><p>T 0:17 I finished the beverage but spilled the last few dropsoops. Both my friend and I added more water to the finished cup to make sure we got any residue leftover.</p><p>T 0:21 Feels like I look a single hit from my Arizer Solo Vaporizer; face feels warm, especially in my upper cheek bones. Digestion feels normal so far; normally I get a little nausea on the come-up of a trip. My friend and I stop watching Bobs Burgers and decide to play some Super Smash Bros Brawl on the Wii.</p><p>T 1:00 I begin to feel the wooden floor gently breathing as I dovery slow breaths bring out this visual even more. As I breathe in, the floor sinks and as I exhale, the floor rises back; very slight but noticeable after we play a second game. This element stops mostly and transfers to my upper body as a head heaviness. </p><p>T 1:21 I begin to notice the effects more so as I observe my friends abstract painting to the left of me. The painting breathes somewhat as the red and orange streaks are more vibrant than the darker blacks and blues. It is the only thing in the room I really notice which brings out the psychedelic elements but it is nonetheless beautiful.</p><p>T 1:32 Less so than other experiences with acid tabs, I notice that my body shakes less in this come-up period. The effects of the painting breathing have faded and now just the orange and red steaks vibrate slowly, if that. Similar to other psychedelics, the </p><p>Ally seems to make visual effects come and go in waves.</p><p>T 2:10 Effects are similar to my entry 40 minutes ago. My friend and I just took a hit off of a vaporizer. He (male, my age, couple inches shorter and weighs less than me) has said he solely experienced the body high with no visual effects so far with heaviness in his fingertips. I remain in the basement, which was recently turned into his sisters art studio. A swirly, abstract painting captures me and again, in waves, brings about the psychedelic shape-shifting effects. I feel like my body temperature had risen from 40 minutes ago.</p><p>T 2:15 Finally! I begin to see the floors red, black and white sporadic-spotted pattern flow like a lazy river. The streams flow in one direction and then shift </p><p>another way as my focus moves slightly forward/up.</p><p>T 2:27 I am still enjoying this painting. I focus in one spot and the whole movement of the shape-shifting sections slows down until I un-focus while the movements speed up to a previous rate.</p><p>T 3:30 I vape two hits of weed; it makes the berry yogurt smoothie taste delicious. I imagine this overruled the Ally. (Others have reported that the Ally is a detriment to taste.)</p><p>T 4:09 I can comfortably say at this point that the trip has not been noticeable when I am not looking for it. Playing foosball 30 minutes ago really brought up my temperature and I still feel warm. I feel some much enhanced body high effects (likely from the weed and elevated blood flowfoosball got more intense in the second game). I will continue to monitor for psychedelic elements or anything of its nature.</p><p>T 5:23 I just inhaled a small light vapor from my friends log plug-in vaporizer (the RockZap) Four minutes later I take another two hits. I do not feel a very euphoric high since I have taken sparingly few and small hits. I have noticed a slight enhanced case of the giggles throughout various times over the last hour. (In previous experiences, acid has given me uncontrollable fits of laughteramong other deep emotions.) My temples and forehead feel slightly achy. I will drink some water to see if this disappears.</p><p>T 5:37 I just pissed and drank some water for the first time since the initial intake. I took one more hit from the RockZap. Saw small patterns on my marble countertop after looking at/for it for a minute; small shape-shifting but again, only if I looked for it.</p><p>T 6:52 My headache is still not gone. I take two hits from my Arizer Solo. I am wondering if the vapor will help the headache on the front and sides of my forehead. I have been drinking water but to no avail. I believe this is the come-down since I am feeling this headache and the visuals have died down significantly.</p><p>T 7:02 I take one more hit. Headache is slightly smallermostly, if not fully, accredited to the green.</p><p>T 8:25 I am considering vaping again but the headache is growing to a point where I think my neurotransmitters need a rest. I am just going to continue drinking water.</p><p>T 8:49 My headache was gotten much worse in the last 20 minutes or so; this come-down sucksa lot. I wonder what tomorrow will bring.</p><p>T 22:00 Headache is still pretty bad this following day. I have consciously decided to take a break from all my usual and occasional substances (i.e. weed, alcohol, tobacco). I have been drinking lots of water but today I feel awful. Headache persists in the same place as yesterdayfront forehead and side temples.</p><p>T 45:00 It is around 8 AM and I am leaving for my internship. My headache is slightly better but still very noticeable. I have never experienced something like this. I will buy cranberry juice and begin my detox-week.</p><p>Overall thoughts: This was a mild hallucinogen. The visual effects were mild and only appeared when looking for them (except in the come-up). The body effects were light and heightened by the marijuana. The come-down was the worst part and my headache didn't fully dissipate until about 4-5 days after the trip. I would not recommend this to anyone. It was just not worth the money nor the aching head.</p>"
}
