{
 "title": "A Peaceful and Soothing Spiritual Experience",
 "author": "Hedkandi",
 "citation": "   Hedkandi. \"A Peaceful and Soothing Spiritual Experience: experience with Mushrooms & Nitrous Oxide (ID 10054)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10054",
 "substance": "Mushrooms & Nitrous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "4 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10054",
   "Female",
   " ",
   "Not Given",
   "Jul 12, 2005",
   "6082",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nOn a warm spring evening earlier this year, a group of good friends and I decided to do some mush. We ate them whole and as soon as everyone started to feel it we took off on a long walk. </p><p>We walked to a beautiful spot overlooking the river and downtown and just sat and talked. My friend M surprised us all by bringing out some whippets and his cracker. As soon as I got my balloon I laid back and looked up at the star filled sky.</p><p>I had taken about 2-3 huffs on my balloon when the sky changed from night to day. It was the most beautiful blue sky I have ever seen with big fluffy, billowy clouds. As I sat there a dove flew directly in front of me and I was aware of a bright light (I know it sounds like a near death experience) but it was not in my field of vision. There was a strong but kind male voice saying 'Come with me' or 'Be with me' over and over again. The entire experience couldn't have lasted much more then a minute but it seemed to go on forever. It was very peaceful and soothing and nothing like any other mushroom/whippet experience I have ever had.</p><p>When I started to come back to earth, the first words out of my mouth were ' Aw, shit you guys I had a religious one.' I was quite disappointed really. I have never been much for religion and although I always believed in God I truly never thought of Him much.</p><p>Of course my friends were asking me to tell them about it but I found I had no words to describe what had just happened. As I laid there I understood that something unusual and very special had happened. It was both a wonderful and frightening feeling. </p><p>We did a few more whippets and although I tried to recapture the first vision all I got were funky visuals. I feel lucky to have had this experience and although I am still searching for the meaning behind it, I know in my heart there is someone out there watching over us.</p>"
}
