{
 "title": "A Walk to Remember",
 "author": "2cfuture",
 "citation": "   2cfuture. \"A Walk to Remember: experience with 25B-NBOMe (ID 100663)\". Erowid.org. Sep 13, 2013. erowid.org/exp/100663",
 "substance": "25B-NBOMe",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "800 ug",
   " ",
   "25B-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2013",
   "ID: 100663",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Sep 13, 2013",
   "Views: 482",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have a fairly extensive background with various psychedelics, including LSD, 2C-B, MXE, salvia, DMT, and DXM. I had previously taken an equal dose and a dose of 500µg separately, weeks before this experience. </p><p>The night started out fairly normally. I was having a beer when several friends and I decided to drop some 25B-NBOMe blotters that I happened to have left over. I had experienced the compound twice before, but it hadn't ever hit this quickly. I had to go inside to get comfortable...immediately. I was used to this, as the come up was very much like this before. I felt very sleepy and couldn't seem to decide what temperature I currently was. Nearly everyone else in the room was also tripping, but at a dose of 500µg. They all seemed to think that I wasn't doing well, which made me feel worse. Eventually the negative effects went away. I felt like a weight had been lifted off my shoulders. I began to see most things in waves. It was as if heat waves were rising from every surface and they disturbed my vision.</p><p>It was so nice out that I decided a walk was in order; I had to get out and grasp reality a bit. By this time I had intense OEVs very reminiscent of 2C-B. All lights had beautiful trails, the night sky seemed so deep and perfect, and the grass seemed almost virtual. Something was strange about the walk: everything was perfectly silent. Normally I might find that sort of silence to be eerie at such a time, but instead it was picturesque. The rest of the night was filled with more walking, scatterbrained thoughts about humanity, and a promise to not waste my time with 25B or any other RCs again. I'm not bashing, but I just don't see the reward in these sorts of experiences. </p><p>Lessons Learned:\nAlcohol seems to have a major effect on this compound. It seems to make the come up quite miserable on the stomach, but way faster/more intense. I only had one beer and noticed these effects. Others in the group consumed a bit more.\nThis isn't much of a 'thinking' psychedelic. Compared to LSD, 25B is very hectic, cluttered, and leaves a rather unpleasant hangover on occasion.\nBe very careful with dosing. The tabs I procured were 1mg complexed blotters. 1mg is a very substantial dose for 25B and I do not plan on ever taking it again, especially at that level.\nIt really isn't that great. Giggly, everything is pretty, but its just OK.</p>\n"
}
