{
 "title": "Crank: Never Felt Better",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Crank: Never Felt Better: experience with Methamphetamine (Crank) (ID 10066)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10066",
 "substance": "Methamphetamine (Crank)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)",
   " ",
   "  repeated",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10066",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2005",
   "Views: 15808",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience with crank was about who knows how long ago, and I'll have to say that I never felt better. It was 9:00 AM, a little more than an hour into school, and my class was ready to go on a field study to some environmental place. The night before a hook-up went wrong and I was stuck with nothing to smoke for the night. However, one of my newly found friends from my school smoked crank and I had a feeling she might have some with her. My instincts were correct and we ended up snorting a few lines in the bathroom at school. About 3 minutes later I started to feel it. I had a huge energy boost and felt like running a few miles.</p><p>About 10 minutes later we were on our way to the field study, sitting in the very back of the bus. We snorted a few more lines before we got there. During the 5 hours that we were there, me and my friend were having a great time, while all the rest of the group were half asleep. On the way home, it came to the point where we had to clean out her straw and piece, just so we could snort up the leftovers. I got home at about 2:30, and right away called some people who might be up for doing crank that night. I got 3 people together and ended up spending 100 dollars between us. With the stuff we bought, and the stuff my friend had, I myself ended up smoking from light bulbs, tinnys, and snorting for about 30 hours straight. I was completely messed up, but at the same time, felt damn good!</p><p>Into the night I started getting antsy so I decided to clean out the light bulb. I started to tweak and out of nowhere the light bulb burst and blood and glass were everywhere. My fingers were torn up, and I didn't care. All I wanted was the remains of crank from the bulb. While my friends were cleaning up the mess and my fingers, I was determined to get every powder substance off of the pieces of glass. I was absolutely mad. I started to shake, so me and my friends smoked up some more. I was awake for the whole night, while others who were starting to let down, went to sleep.</p><p>At 7:30 in the morning I started to tweak for a cigarette, and ended up running around my friends house for an hour and a half, in search for a cigarette. I ended up smoking butts from the trash. My eyes were dilated to the point were almost no more color was showing. I hadn't eaten for about 24 hours then, and yet I still wasn't hungry. I finished up snorting up everything left at about 3:00 pm in the afternoon of the next day, and at 8:00 pm, I was still feeling it, and still had dilated pupils. I finally came down later that night, and slept for only 5 hours.</p><p>The next morning I had horrible cravings and some side effects. My lips were so chapped, that you were able to make out any line or crease in my lips. This was due to the fact that I kept licking my lips constantly while on crank. In the morning my lips were a hot pink and slowly made it to a dark purple. The inside of my mouth was the absolute worst. My tongue was swollen, yellow, and was hairy because the taste buds were swollen too. Under my tongue there were red bumps everywhere, and I had canker soars all around the undersides of my lips. That was all fixed later though, with a lot of Listerine, Carmex and brushing.</p><p>The last side effect was the shaking and twitching in my hands. I noticed this when I had a cigarette when I woke up the following day, and the cigarette just fell out of my hands. To this day, I still have a twitching. Even after these physical side effects, and the lack of sleep, the cravings were so bad that I called my friend to get some more. The side effects have never been as the first experience and I've always had the best of time. To this day I still smoke crank. I do it, cause I love it and because of my addiction. I have tried cocaine, meth, speed, glass, and snuggle many times, and I would still choose crank over them all. It was love at first sight!</p>"
}
