{
 "title": "Eating Dirt",
 "author": "187",
 "citation": "   187. \"Eating Dirt: experience with Spice Product (ID 100650)\". Erowid.org. Nov 6, 2013. erowid.org/exp/100650",
 "substance": "Spice Product",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 100650",
   "Not Specified",
   " ",
   "14",
   "Nov 6, 2013",
   "Views: 2060",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>New Years Day. I was currently hosting a Chinese foreign exchange student who spoke barely any English and was expecting a Korean exchange student later that day. When he arrived, two friends invited the three of us over to meet the new student. I had never drank, smoked, or done any drugs, but the my friend whose house we were at showed me a bowl and a baggie of what he called 'spice.' Never having done any drugs due to never being presented with the opportunity, I was eager to try it. He said we would smoke a bowl after his dad went to bed. I told him not to let my foreign exchange in on it in fear that they would snitch on me.</p><p>At around 2:30, we (B and M, the non asians) left the house to walk to McDonalds. On the way back they suggested I smoke a Black 'n Mild so I would know what smoking felt like before I tried the spice. I guess this was practice. I enjoyed the Black 'n Mild.</p><p>An hour later, we (B and M) were finally back at his house. He began to pack the bowl and we walked outside. I told them how I had recently become an atheist and we talked about religion for a little hit. They taught me how to smoke the bowl and even lit it for me. They told me to inhale for as long as possible, which I did, and also to hold the smoke in for 15 seconds, which I did. In retrospect, I believe they might have been trying to get me incredibly high thinking it would be funny. Anyway, the bowl was passed around, I took another big hit. Not feeling anything and wanting so bad to be 'high' for the first time, I asked if I could finish the bowl off. Bad mistake.</p><p>Immediately after finishing the bowl, I could feel things slowing down. I sort of stumbled through the door. 'I'm feeling it guys!' I said. The Asian students were confused as they didn't know I smoked the spice. The next thing I noticed was my heartbeat climbing steadily. I stood there shocked and someone asked me what was wrong. I fell onto the bed and my friend M rushed to my side to see if I was ok. 'Chill dude,' M said. 'Just calm down until you fade away into nothing.' What the hell does that mean? I lay there contemplating what it meant to 'Fade away into nothing.' Colors were swirling across my field of vision and my head hurt. 'This is it, I'm dying.' I thought. Remembering our conversation about atheism, I came to the (what I thought was) the most logical conclusion that God was upset with me for turning away from him and he was going to let me die. Thinking they were playing a sick joke on me, I rushed towards M asking what he did to me. I thought they put some type of poison in there and pretended to smoke it and let me actually smoke it. For some reason I quickly dismissed this thought and decided they were demons. A lot more rational, right? I began punching them thinking the more I fought the more the high would go away. I screamed at the top of my lungs while B restrained me. As soon as I could get away I ran out of the house. At this point I blacked out.</p><p>When I came to I was walking in the unfamiliar neighborhood. I felt like my limbs were flying off my body and I was missing a shoe and my wallet. I checked my phone and noticed I had sent text talking about 'grung tp hell' that I didn't remember sending. The text were horribly misspelled and made no sense other than a few words. I eventually came to a house with a porch light on and decided God was in there since there was light. I started banging on the glass door and ringing the door bell. A shocked man answered. I begged him for water and all I remember was him telling me to stay put and that he was getting help. It was winter and the glass door had condensation on it. I began to lick the door to cure my intense thirst since the man was clearly not bringing me any water. Memories are fuzzy at this point.</p><p>For what seemed like forever later I eventually heard a voice ask if I was ok. I realized it was a cop and he must have called the cops. I began to somewhat come back to reality. He was asking me what was going on, where I came from, what I was doing, etc. I don't know if I could answer all of his questions or not, but I at least knew my name and address. Eventually my friend's dad showed up on the scene and explained everything to the cop. I asked if he was going to arrest me and he told me no, he was just worried about me. An ambulance showed up while I waited in the cop car and I was in route to the hospital. Assuming this was all a dream, I texted my girlfriend something about seeing her when I would wake up.</p><p>I waited at the hospital in a wheelchair while I calmed down. My parents showed up and they were livid. All the hospital did was give me a drug test and they were incredibly confused when no drugs showed up. I told them I smoked spice and they said I wasn't the first kid in there who freaked out after trying this drug which does not show up on a drug test. I went home and was grounded for a month.</p><p>For the next six months I honestly believed I never stopped tripping. I assumed I went into a coma and my life now was a dream. Reading was difficult. Letters would always switch places if I didn't look at them closely enough. I'd often mistake people for other people until I got a closer look at them and suddenly they'd look like the person they actually were. I don't know how to explain this. I guess I had brain damage. There would even be times where I would feel high again and I would have 5-15 minute panic attacks. I rarely left my room or talked to anyone. Life seemed like a dream.</p><p>My mistake was trying way too much of a powerful drug for my first time. Moderation is key when trying a drug for the first time.</p><p>PS: My first foreign exchange student became scared of me and we haven't talked much since. The other one, who experienced all of this on his first night living with me, is now one of my closest friends. The house I went to and begged for water was a friend's house from school. She watched the whole thing and apparently I was eating dirt from her lawn at one point. I have no recollection of this.</p>"
}
