{
 "title": "Too Close To The Edge",
 "author": "James",
 "citation": "   James. \"Too Close To The Edge: experience with 25B-NBOMe (ID 100632)\". Erowid.org. Sep 27, 2013. erowid.org/exp/100632",
 "substance": "25B-NBOMe",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.8 mg",
   "buccal",
   "25B-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2013",
   "ID: 100632",
   "Male",
   " ",
   "Age at time of experience: 21",
   "Sep 27, 2013",
   "Views: 1049",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In the past I have experienced with 25i, 25c, DMT, LSD, Shrooms, MXE, Meth, crack and a slew of other drugs. So I expected 25b to not be too much of an ordeal, but I was very foolish and unprepared for what was going to happen.</p><p>I picked up 3 blotters of 25B NBOME from my dealer. I decided to wait 2 days to drop them due to work and I would need to reserve a good 10-15 hours for this trip. What was about to happen to me, I completely didn't expect, and I underestimated the sheer power of 25B NBOME, one of the strongest psychedelic research chemicals ever made.\r[Erowid Note: 100 mgs of an NBOMe compound is considered an extremely high dose, see NBOMe Series Dose Chart & related dose charts.]</p><p>8:20PM: Drop all 3 blotters. Effects start hitting me within 25 minutes. I go to drive and pick up some girlfriends I know. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] As I drive to their house I can tell the chemical is quickly working. It's still somewhat bright out. My vision has gotten noticeably sharper. Colors are more vibrant and stand out and trails were especially noticeable as I was driving. Music started to sound amazing and the car was very light. Time dilation was starting to take effect. Still at this point, I was under control.</p><p>8:45pm: I am no longer driving the car and hand over the keys to my lady friend. I am experiencing  the most intense euphoria I have ever felt off any drug ever. I have done the best of MDMA and even Meth once, and it could not compare to the orgasmic body feels I was experiencing. I couldn't stop gigging. At the same time my stomach is on fire from the chemical I ingested and I start feeling noticeably worse. It just so turns out that for the next 2 hours, I suffered from NMS (Neuroleptic Maligant Syndrome) from overdosing on 25b NBOME.</p><p>9:30PM: As I am sitting in the passenger seat I am burning up. Sweating way to much. I have absolutely no energy left in my body. I feel lifeless. The longer I keep the blotters in, the more it felt like I was actually dying. All of my electolytes and enzymes in my body have been thrown out of whack due to this chemical. I drink a water but all I taste are chemicals. I start having convulsions and mini-seizures throughout my body. At one point I couldn't even talk or move my hands. I light up a cigarette and only hit it twice before it's done because my hands were sweating so much, I covered the whole cigarette in liquid (also tobacco tasted like crap while on 25b so I didn't want it anyway). I consider calling 911 or being driven to the hospital to be administered an anti-psychotic/Benzo or anything to stop what was happening. I was in fear for my life and almost cried. The worst part is I couldn't do anything about it except breathe deeply and try to stay calm. My heart was ready to explode and nobody could really assist me medically. </p><p>10:00PM: We drive to a local walmart and I attempt to purchase 2 four lokos for my friends while still feeling horrible. At this point I was tripping absolute balls. I go to retrieve an item from my car and it takes 4 attempts before I can correctly do it and go about my night. People looked like elves, the Walmart logo on the front of the store was spinning in a clockwise motion while bouncing up and down. I look into the polluted sky and even then I can see the most beautiful star display. At one point I even saw a strong white line connecting all of the stars into a beautiful patten that could only be described as the Universe. It was the most beautiful thing I ever saw. My body was very stiff so I had to take short steps, deep breaths. I repeated this over and over silently 'Short steps, deep breaths'. My body was also very red, especially my face and neck. I never in my life felt so impaired off a drug.</p><p>10:15PM: As I walked around Walmart, the extremely bright lights were much brighter due to my severe eye dilation. I was seeing trails so much, that the light coming from above was literally splitting into more light. Like I could see physical light stretch in my field of vision. I could barely walk straight, and despite the AC I was still sweating like a pig. I looked completely drugged. Despite this I managed to purchase 2 loko's and complete a purchase while tripping and thinking I am dying at the same time. I was honestly shocked I even remembered my own PIN number and didn't forget the items I purchased. Various items inside the store were morphing, splitting and breaking apart into new objects which blew my mind. However I quickly left because I was feeling too paranoid around all of the people.</p><p>11:00PM: We drive across town to a friends house. At this point I am feeling much better. The visuals at this point are absolutely mindblowing. When I look at trees I see the branches closing in on each other and all of the vegetation outside was moving around in a slow, clock-wise fashion, like there was a gentle breeze blowing everything in an elegant fashion. At the same time those same trees looked demonic and evil, and I was very scared when I looked into the entrance of a dark creek off to the side of the main road we were driving on. Despite it being nighttime, all of the trees had a deep, medium pink/purple hue to them. As I was looking out the passenger side window, I saw the bright streetlamps go from being up in the sky, to literally landing on the road and flying back into the sky. The lines on the road were darting around everywhere and I couldn't make out anything. At some points I recall looking up into the sky again and literally seeing falling/shooting stars flying right towards the ground and then shooting back up into the sky. Cars on the road were shapeshifting before my very eyes. Purple clouds were blowing fast over the ground and also shapeshifting into dinosaurs, shoes and various random objects that I couldn't describe. When I looked out the window everything was extremely dizzying, more than anything I was trailing really hard to the point where everything I looked at was stretching abnormally. I couldn't do anything but close my eyes because it was too much too handle.</p><p>12:30PM-8:00AM: The only thing I really dislike about the RC's is the fact that the duration lasts way to long. I wanted to go to bed early but I didn't end up sleeping until 8 in the morning. I had to drink lots of milk, take 30mg of melatonin and take sleeping pills to kill the stimulant effects of 25b. This was hours and hours after going home and having nothing to do and being physically exhausted from working and then staying out all night. Eventually I fell asleep for 12 hours straight and woke up fine.</p><p>Some noteworthy remarks I have to make about this chemical:\nThought loops are very common to the point where I would forget a conversation every 5 seconds. Socializing on it was hard as I was tripping hard. Do not do any complex tasks while under the influence, forgetting shit is very easy to do.\nThere is a weird headspace with this drug that I do not like. Hours into the trip, my head started to feel empty, like my brain is literally missing. Sometimes I feel a sizzling effect in the back of my head, creeped me out.\nDo not dose over 1,000ug just to be safe. I am very experienced with psychedelics and this trip honestly FUCKED me up really hard. IF I dosed anymore I definitely would of died.\nI personally would not do this chemical again. If I had to, I would keep the dose at around 1,200 for a good time. 1,800 ug was just stupid and suicidal and I hope to never have such a repeat ever again. I would limit usage to once a month or more and make sure I especially have a good dose, set and setting for this chemical. Bad stuff can happen very easily on 25b, everyone I know that has done it personally agreed. You could say it has an evil side to it that can easily overpower a person.</p>\n"
}
