{
 "title": "How I Zapped My Way Free of Cocaine",
 "author": "Roberto Carbaja",
 "citation": "   Roberto Carbaja. \"How I Zapped My Way Free of Cocaine: experience with Crack & Homemade Electro Shock Therapy (ID 10063)\". Erowid.org. Oct 19, 2001. erowid.org/exp/10063",
 "substance": "Crack & Homemade Electro Shock Therapy",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2001",
   "10063",
   "Male",
   " ",
   "Not Given",
   "Oct 19, 2001",
   "25869",
   " "
  ]
 ],
 "report": "</p>Originally published at: http://s_croll.tripod.com/crackcure/id1-2.html</p><p>I had to improvise a Psycotronic facilitator or Shock Box (the Black Box method of quiting Drugs),employing a dimmer switch, an Electrical cord, Electrial tape, and highly absorbent diasprum like cotton.</p><p>My pipe was new and I used 151 proof Puerto Rican Rum so it wouldn't darken the pipe and obscure the Smoke (so that I could create a trama at the mear sight of the Smoke going threw the pipe).</p><p>To keep my hands free I used cotton and a candel but if I had usually used a lighter then I would have used that .</p><p>To fashion the device I first took and cut the female end of the Electric cord and split it in two, forming a 'Y' The ends being about ten inches long.</p><p>Next I stripped the plastic ends off (one about 4 and a half inches and the second just under an inch).</p><p>Third; I hooked the Dimmer Switch and the shorter exposed wire up by twisting and taping them together (The shorter exposed end to the Dimmer Switch).</p><p>Fourth;I proceeded to bend the other end of the longer exposed wire back upon itself (pic3) and tweak it in to a hangmans noose to fit just the tip of my finger at the point where my cuticle extends. Then I placed the noose over the nail and finger print area of my trigger finger; not letting the exposed part go past the crease where my palm starts(pic 3).</p><p>Fifth;I cut a small amount of the highly absorbent material and placed this up under the twisted part of the noose (using a tiny amount,about as much as on a Q-tip (pic 2& 3), adding just a dab of water for  better conductivity.</p><p>Six;I taped the wire only to my trigger finger.</p><p>Seven;I finished taping the wire from the nuckel part of my finger to my nail, wringing out the excess moisture by tugging lightly on the black Electrical tape as I spiraled it down to my nail completeley covering the end (this was very important to preserve just the right moisture. Eight;I made sure that the Dimmer Switch was all the way down and off before I plugged it in. </p><p>Nine; Trepidation was an integral part of the process(see tunnel vision page),so I focused on my Smokes.</p><p>Preemptive;(I was a Nicotin laced Tabacco'Addict' and I had to start a general aversion to Smoke foremost) taking my smokes all out of the pack at this point and then plugging the cord into the socket, and as I did focusing to the point of fixation on the smell and look of the fresh Cigarettes,reading the words on them or the pack or beer bottle. \n</p><p>Eleven;I cut the Dimmer Switch on; since only one end was affixed to my finger,it didn't 'BITE' me at this point. </p><p>Twelve;I kept the Dimmer Voltage all the way down and QUICKLY tapped the free wire with my thumb to see if it was on and safely gage how many Volts the wire packed.Then amplified the Voltage  until my fingertips signaled in protested.</p><p>Thirteen;All through this I ignored the Dimmer and wires and fixated to the point of self-hypnosis on the smell, sight, and even the sizzle sound of the Drug, Beer or Cigarette in my grasp (works for Beer also). The wire from the Dimmer flashed one inch of exposed wire and was not taped and was placed between my thumb and pipe (or Cigarette or Beer mug) and held in place by digital opposition. I took advantage of the natural 'Electro phobia'in me;especially of it Tazering some of my lip;Priming myself in the event it did,that it was the pipe or the Cigarette that caused it.</p><p>Fourteen;As I pointed out before, I had to make strong visualizations and associations with regards as to what I was doing, AS I WAS DOING IT. Actually seeing with the minds eye, the poison Smoke coming threw the joint or pipe (Beer), convincing myself that the Electroshocking field was emanating from this Cigarette, pipe or the liquid in the mug!- that the rush, or Intoxication or buzz, IN AND OF ITSELF, was actually the cause and the culprit of the Electrical irritation.</p><p>Repeating this for four or five days with the Cigarettes,I then transferred the aversion to Crack Cocaine. </p><p>With Fast,my Father had  then found a shock box or, Mexican 'chichara'It cost about 13 American in a Electronic store in Mexico;also called a tens unit 'caja de toces'(and no we don't sell them,or their address would be on this page!)(pic 1 & 4).I also desided to expierment with a new auto training technic.I would hit myself with sudden burst of Electricity for the duration of the craving.I would amp and set the Voltage up as much as I could take then cut it off (and then turn it up a little more)and wait for a craving to come haunt me.At this point I would flip the switch (LOL,I know theres a giggle factor).This was like an 'exsorsizum' or something;I only needed to do this for about 4 seconds and it spooked the cravings right out.Three times in a couple of hours and it was totaly under control.</p><p>\n"
}
