{
 "title": "Neon Pinks Blues and Greens",
 "author": "zombywoof",
 "citation": "   zombywoof. \"Neon Pinks Blues and Greens: experience with AL-LAD (ID 100783)\". Erowid.org. Jul 18, 2013. erowid.org/exp/100783",
 "substance": "AL-LAD",
 "bodyweight": "11.5 kg",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Tryptophan",
   "(daily)",
   " ",
   "150 ug",
   "oral",
   "AL-LAD",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2013",
   "ID: 100783",
   "Gender: Male",
   " ",
   "Age at time of experience: 50",
   "Added: Jul 18, 2013",
   "Views: 1796",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Just a quick report .</p><p>One 150ug blotter dosed bucally at 7.00pm last night. First effects felt about 8.00.very gradual build not very pushy and almost no body load I actually felt I had underdosed so about this time I chewed the blotter up and swallowed it. Glad I waited though because it just kept building and by about 9.00 I was gone but not sure about the time as it had all slowed down. Then came the ego loss I actually thought I had gone insane as I was caught in this thought loop and everything just got cartoonish. The wife said I sounded like harry potter coming out with all these made up words. It was pretty scary at the time as I have never lost it like that before must be what the 60s lucy was like.</p><p>Eventually I came back to reality and realised I wasnt insane and it was the loops and total ego loss. I would advise people not to go above 150ug with this compound unless very experienced with psychedelic. This is not like the nbomes but very much like lucy as far as I remember but thats been many years since that experience so thoughts slightly clouded. Also I found this compound very erotic and performed like a 17 year old again all night once I had returned from inside my head.</p><p>Didnt really listen to much music till trip was winding right down so only noticed slight appreciation. Did smoke some noids at end and drifted off to sleep listening to jefferson airplane. Now that is what they really sound like its amazing the difference music can make to the trip. One other thing I got hungry too and ate a packet of cold sausage rolls and they tasted like heaven. I have only had about 3 hours sleep and woke up feeling radiant. Hope I have got it all down here</p><p>One other thing I had been preloading with 200mg of 5-htp daily for seven days prior to trial dont know if it made a difference or not but maybe useful to know.</p><p>Please note this compound needs treated with respect .remember start low as this could be quite scary for the inexperienced but also wonderful too</p><p>I guess I have a very low tolerance for this will try 300ug next time but will not be for at least 4 weeks. But now I know what to expect I should be able to lose myself easier next time.</p><p>It was like we were both characters in a cartoon and I kept repeating some punchline.At one point I actually didnt know where I was and had been insane for years and everytime I thought I was getting back the same thought would come back and I felt I was back to square one, it was pretty scary for a while. I dont think this lasted for too long though and I was really glad it didnt. As for visuals it was quite similar to lsd and some objects did take on sinister appearances but the colours were really bright neon pinks blues and greens. Also at one point everything looked like it was made of of tiny tiles like mosaics. As for next day I felt good but tired and crashed about 10 that night very early for me but I did have only 3 hours sleep that morning. Two days later still quite tired but no moodiness yet. A lot of fellow researchers have been dosing twice the dose that I did but I like to play it safe first time out</p><p>Also I am not saying this was a bad trip as it was far from it. I'm really looking forward to next time and now know what to expect.</p><p>It was like we were both characters in a cartoon and I kept repeating some punchline.At one point I actually didnt know where I was and had been insane for years and everytime I thought I was getting back the same thought would come back and I felt I was back to square one,it was pretty scary for a while. I dont think this lasted for too long though and I was really glad it didnt. As for visuals it was quite similar and some objects did take on sinister appearances but the colours were really bright neon pinks blues and greens. Also at one point everything looked like it was made of of tiny tiles like mosaics. As for next day felt good but tired and crashed about 10 last night very early for me but I did have only 3 hours sleep that morning. Today still quite tired but no moodiness yet. A lot of fellow researchers have been dosing twice the dose that I did but I like to play it safe first time out</p>"
}
