{
 "title": "A Night to Remember",
 "author": "krell vid-user",
 "citation": "   krell vid-user. \"A Night to Remember: experience with Mushrooms (ID 1007)\". Erowid.org. Dec 12, 2000. erowid.org/exp/1007",
 "substance": "Mushrooms",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2000",
   "1007",
   "Not Specified",
   " ",
   "Not Given",
   "Dec 12, 2000",
   "6562",
   " "
  ]
 ],
 "report": "<p>\nI had my first experience on mushrooms a few months ago.  It was the beginning of the spring semester at my college, and four friends and I made plans to trip out on a friday night.</p><p>We bought the mushrooms the day before and after a heavy dinner, we ate them in my friend's dorm room at about 6:30 and washed them down with orange juice (we each had a little less than an eighth of what supposedly were some really good booms).  After a half hour of watching the Simpsons, we went down to the basement to take bong hits in the boiler room.  I took 3 or 4 big hits of the chronic weed we had, and I was pretty stoned.</p><p>I had taken acid a few times and had pleasant but not-very-intense experiences.  I was not at all ready for what was about to happen to me.  When we came upstairs, the other two of our 5-person crew that smoke cigarettes came outside with me for a cigarette.  As soon as I stepped outside, the buzz hit me.  </p><p>My two friends were starting to feel it too, but not nearly as hard as I was.  They knew something was wrong when I decided I didn't want a cigarette.  There was a totally overwhelming ringing in my ears that thoroughly freaked me out.  Every noise anyone made sounded like an electric 'zap.'  </p><p>I hadn't experienced anything like it before and I was pretty scared.  It was the coldest night of the year, sub-zero temperatures and about a foot of snow, not to mention the fact that every sidewalk on campus was covered with inch-thick ice.  I told my friends I was going for a walk; in reality, I wanted to go back to my dorm and fall asleep to get rid of the incredible feelings I was experiencing.  </p><p>My friends knew it wasn't a good idea to let me go off on my own, so they said they'd come with me.  They called upstairs to the other two guys and said that we were going for a walk.  By the time they got downstairs, though, one of my friends had calmed me down and helped me appreciate the trip instead of being scared by it.  I had overcome the only bad part of the entire night, and was ready to enjoy the trip.</p><p>We went upstairs and hung out in one of our rooms.  I was completely lost in my thoughts, and one pattern that recurred throughout the entire night began at this point.  This pattern was my propensity for deep self-reflection.  I spent a lot of time in front of the mirror, thinking about how I go through life playing a character and how other people saw me.  When we sat in the basement chain-smoking cigarettes later in the evening, that kind of thing dominated our conversations, which tended to be very profound and on much heavier subject matter than what we usually talked about with each other.</p><p>We only left the dorm twice over the course of the night.  Once, about an hour into our trip, we went outside just for fun.  The entire world was frozen over and many of us were having visuals, so being outside was pretty entertaining.  We slid around on the ice and played in the snow on the main green.  Bypassers must have thought we were insane; everyone else who was out was trying to reach their destination as quickly as possible because it was so cold, while we were just running around like idiots.</p><p>The other time we left was to make a beer run minutes before the liquor store closed.  The outside world again was especially entertaining, and our determination to get beer before the store closed made us think about how, even though our priorities aren't always the best, we are the kind of people who get what they want.</p><p>It's impossible to describe everything that went through my head that night, but it definitely brought me closer to the people I shared the experience with, and it taught me a lot about myself.  Overall, it was a night to remember.</p>"
}
