{
 "title": "Good, But Not Mind Blowing",
 "author": "Spiderman",
 "citation": "   Spiderman. \"Good, But Not Mind Blowing: experience with Nutmeg & Caffeine (ID 10087)\". Erowid.org. Jul 13, 2005. erowid.org/exp/10087",
 "substance": "Nutmeg & Caffeine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 0:30",
   "60 mg",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10087",
   "Male",
   " ",
   "Not Given",
   "Jul 13, 2005",
   "24246",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading much about nutmeg, I was eager to try it, but was wary about dosage, since I could not find a recommended 1st time dose.  I decided to take one heaping teaspoon of powdered nutmeg, since that's about half of the minimum dose I'd seen. I took it at 11:00 on a Saturday morning, and was surprised to find the taste not at all unpleasant. Definitely strange, but not bad. What was bad was the texture of the nutmeg grains, but a few good drinks of water washed it all down.</p><p>At the time, I was in good health both physically and mentally, and my mood and life in general were pretty good.</p><p>Thirty minutes after ingestion, I began to feel the need for some caffeine, so I quickly downed a can of soda.</p><p>As the standard caffeine buzz began to wear off two hours after taking the nutmeg, I could definitely feel a change beginning. It took about one hour after that to reach peak effects, nice euphoria, not overpowering, I was able to walk around, talk to people and go about my business with not the least trouble. There was only a slight dry mouth sensation, but there was no nausea, headache or any other unpleasant side effects. Four hours into it, the high had diminished, and I felt only calm and sleepy. </p><p>Sleep was not necessary however, and after walking around for a while, I came down fully, and felt no after effects for the remainder of the day.</p><p>In conclusion, my experience with nutmeg was good, but not mind blowing by any means. I think I'll try it again at a slightly higher dose when I have more time to spend with it.</p>"
}
