{
 "title": "An Interesting Beginning",
 "author": "Agrivan",
 "citation": "   Agrivan. \"An Interesting Beginning: experience with H.B. Woodrose (ID 10098)\". Erowid.org. Aug 28, 2002. erowid.org/exp/10098",
 "substance": "H.B. Woodrose",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10098",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 28, 2002",
   "Views: 7839",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI currently live in an area where certain substances of an illicit nature are hard to come by and cracked down on often. So my quest for good legal high began.</p><p>I was talking with an old friend who used to hook me up before I moved and he mentioned he ordered these seeds off of the internet because he had some friends that took them and had reports of nice LSD-like trips. I had never tripped before, but since they were legal, cheap, and very easy to obtain I figured, what the hell?, and ordered some.</p><p>A few days later they came in a bag, over 100 at least. After reading about so many people getting bad stomach reactions, I decided to try them later as I had a dinner thing that night.... Anyway after the dinner I came home and decided to try them anyway. I took 4 seeds, scraped a little bit of the fuzz off with my fingernails and then burned them a little to make sure the skin wouldnt make me ill. Now I am a big guy, and I have heard of people taking much more than I and being much smaller, but I had never tripped before. Anyway, I cut the seeds into fourths with a knife and soaked them in cold water for a while. The water turned greenish after an hour or so, so I drank the water and chewed up the seeds in my mouth and swallowed them. I also took a dramamine and some pepto at the same time. I had a very small amount of nausea which when away quickly when I took a tums and another small swig of pepto.</p><p>So about three hours later I didnt really feel much and decided to go to sleep. The only thing I had felt was the TV like coming towards me and everything else falling away, also I felt a little euphoric. Just better than usual I guess. I checked my email and had the same thing happen with the monitor, but it wasnt much so I went to bed.</p><p>Thats when the cool things happened! I had one dim candle going flickering and I was staring up at the ceiling fan and its shadow and it felt like I was being raised and the fan was falling. An excellent experience indeed. I found I could ground myself very easily by just lighting another candle, but i blew it out and stared at the shadow of the fan on the ceiling. It was sort of changing shape and moving... also the walls seems to be different somehow, (not breathing like many people have said would happen). Anyway, there was also some sound in my  ears, mainly a ringing type noise while this was going on.</p><p>I told my girlfriend about it, and while she is hesitant... I think I might be able to get her to try it with me. It was a very mile pleasureable experience and I would recommend it for anyone, including first time trippers like me. I think I might up the dosage next time.</p>"
}
