{
 "title": "For Science",
 "author": "Poppy",
 "citation": "   Poppy. \"For Science: experience with AH-7921 (ID 100939)\". Erowid.org. Aug 4, 2013. erowid.org/exp/100939",
 "substance": "AH-7921",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "160 mg",
   "sublingual",
   "AH-7921",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2013",
   "100939",
   "Female",
   " ",
   "22",
   "Aug 4, 2013",
   "4361",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I (P) and a friend (B) have low tolerance to opiates, with previous experience using Oxycodone, Dihydrocodeine, Codeine and Fentanyl. </p><p>Setting was a party with a small number of friends.</p><p>We received 1 gram of AH-7921 (CAS number 41804-96-0) from a reputable european vendor. This was a fine crystalline powder with some larger crystals in it. It was dissolved into a solution of 40ml water and 10ml of lemon juice and heated in a water bath, as it would not dissolve alone. This was dosed using an oral syringe (20mg per ml) sublingually and held under the tongue for 10-15 minutes each time.</p><p>T - 1:15 Allergy test ~5mg</p><p>T 0:00 Dosed 40mg. Blood pressure readings were 124:88 for B with a pulse rate of 113 and 105:65 for P (pulse rate error).</p><p>T + 0:40 Experienced some light-headedness.</p><p>T + 0:55 Mild pain relief - B had an injured foot before dosing, this was alleviated somewhat.</p><p>T + 1:10 Experienced feelings of warmth, alertness, mild stimulation and clarity of thought. We felt less 'dumb' than on other opiates.</p><p>T + 1:25 Dosed another 20mg each.</p><p>T + 2:15 Itching and histamine release began and continued for the rest of the night. We felt relaxed, with some euphoria and a warm opiate 'glow'.</p><p>T + 2:55 Dosed another 20mg each.</p><p>T + 3:15 Greater pain relief was experienced - B could no longer feel the pain in his foot and P was no longer feeling a shoulder injury. Feelings of euphoria were increased. We had some pupil constriction by this point, and feelings of mild to moderate stimulation. There were also occasional feelings of nausea.</p><p>T + 4:05 Dosed another 10mg each.</p><p>T + 4:30 B's blood pressure readings were 128:91 with a pulse rate of 103. P's were 115:78 with a pulse rate of 90.</p><p>T + 4:50 Sandwiches were consumed by both of us.</p><p>T + 5:30 Dosed 10mg (P) and 20mg (B). P was experiencing some agitation, but still with opiate glow and muscle relaxation.</p><p>T + 7:35 Dosed another 20mg each.</p><p>T + 9:05 Dosed a final 20mg.</p><p>T + 11:20 Both of us experienced some hand tremors, and B experienced some twitching - after some reading, this is fairly common at the tail end of a trip. Final blood pressure readings were: B 121:76 with a pulse rate of 100, and P 124:62 with a pulse rate of 86.</p><p>Overall the experience was a good one. The chemical itself tastes foul, and is a little difficult to keep under the tongue. Throughout the evening we felt inner warmth and euphoria, mental clarity and muscular relaxation. We found socialising with others easy and pleasant. We also felt the urge to dance a lot, which was unusual. It was not as intense as we expected, though this may have been due to titrating up towards our desired doses. However, this is a recommended method due to the lack of information available about this compound.  Smoking a bowl of marijuana brought back a lot of the effects after they had faded. I'm a pretty irritable person, and unfortunately during some parts this was magnified. So if you're like me, and get pissed off easy, maybe do this in a calm environment, without loud music.</p>"
}
