{
 "title": "A Shroomy Day at the Beach",
 "author": "Shroomy Rob",
 "citation": "   Shroomy Rob. \"A Shroomy Day at the Beach: experience with Mushrooms (P. cubensis) (ID 1009)\". Erowid.org. Dec 12, 2000. erowid.org/exp/1009",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1.8 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1009",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2000",
   "Views: 9130",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nOne beautiful Saturday on Spring Break I bought an eighth of shrooms and I decided to call up a friend of mine to ask him if he wanted to shroom. He said sure, so I headed down to his house. We had each done shrooms three times before and we decided to make tea out of them this time. I boiled the eighth of shrooms in water for about a half hour and added some tea bags for flavor. We then cooled the tea and added some sugar. We drank our iced tea in about five minutes. Our plan was to spend our trip at a small, nice and fairly quiet beach a few minutes away from his apartment. We decided to drive there, but we had to get there BEFORE we started tripping (I was driving). We parked and made our way down to the beach. By then I was having some slight nausea. I felt a gradually intensifying energy throughout my limbs and even in my eyes. We sat down in the cool sand, which felt not quite like normal sand for some reason, with our backs up against a log. I had barely sat down when I noticed the sand, which lay there in front of me in a rippled pattern. Since I knew the kinds of things I was looking for, I stared at the sand and tried to make it 'move.' I've found that in the beginning stages of trips I can visually manipulate objects if I try hard enough. It seemed to take a while, but at about 50 minutes in, the sand began acting very much like rippling water, moving back and forth in all directions. If I stared at one point for more than few seconds the sand took on a seemingly infinite and three-dimensional black and white pattern. I felt like I was being sucked into it. The cliffs along the beach off in the distance looked like green lions' heads that were breathing and moving up and down. At this point I couldn't believe how hard I was tripping off the equivalent of half of an eighth (I think it was making tea that helped). I felt a good deal of euphoria and I kept thinking how great I felt on a day when I had nothing to do but shroom. I was carefree. When I looked at the sky and the ocean, the light colors seemed pixelated, as though it was a computer screen with really bad resolution, yet everything (and I mean everything) was as clear and sharp and colorful as it could be. Things seemed closer than they really were, which kept making me do double-takes when I looked at specific objects. This was especially true for a nearby piece of driftwood that looked like a seal that was talking to me! The high, thin clouds swirled above me almost violently and the sun seemed to grab my attention more than the sun normally does (my sunglasses helped me stare into the bright sky). I noticed that I kept forgetting I had hands, and smoking cigarettes (I'm normally a non-smoker) helped me keep in touch with them. The sea turned a greenish color a few times and sea gulls that I'm not sure were really there flew around on the horizon. My friend and I remained fairly quiet except for occasional conversations and crazy laughter almost like we were silly stoned. Despite our rather odd behavior I didn't feel paraniod at all about people knowing what we were doing. I'd point things out every few minutes and we'd talk about them and laugh. There were only a few people on the beach and our only interaction was with some girls that said hi to us as they were leaving. Interactions with other people were rather disruptive, so it was fortunate that that was the only one. My friend suggested we get up and walk around, so we went and smoked a blunt in the nearby bathroom (as a side note - taking a leak felt very odd but very good :)). We walked around the cliffs a bit right next to the water, but it was starting to get kinda cloudy and cold, so we headed back still feeling very shroomy. My friend claimed he could drive 'if he had to,' but we decided against it and walked back. We would get the car later. I initially thought walking along sidewalks and dealing with traffic would suck, but we handled it normally. At this point in the story, I should tell you it seemed like FOREVER that we were at the beach, the shrooms completely obliterated any normal sense of time passage. Looking at my watch and trying to judge how fast time was passing was a fucking waste of time! We eventually got back to his apartment where I resumed tripping out on the ceiling, which was stretching back and forth in different directions. By now, I was down from my peak but was still having some mild visuals. This was about four and half hours since we took the shrooms and the sun was just about to go down. We watched TV and as we descended back into some degree of normalcy we reflected on the day's events. All in all, the trip lasted about five hours which was great for only having taken a half-eighth! There were just soooo many things to stimulate us at the beach and it afforded a seemingly endless supply of visuals to trip out on. I would definitely suggest an outdoors trip during the day, like the beach, for mushroom experiences.\n\n\n"
}
