{
 "title": "Struggling to Accept the Sage",
 "author": "Clear Skies",
 "citation": " Clear Skies. \"Struggling to Accept the Sage: experience with Salvia divinorum (10x extract) (ID 10091)\". Erowid.org. Sep 9, 2004. erowid.org/exp/10091",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10091",
   "Male",
   "",
   "Not Given",
   "Sep 9, 2004",
   "6327",
   " "
  ]
 ],
 "report": "<p>Salvia divinorum has been a very difficult thing to work with for me.  I KNOW that there is so much potential in those leaves -- so much to see, so many worlds to explore, that I keep trying despite how hard it hits me back into reality.</p><p>My first problem was obtaining effects.  Those have been remedied by better smoking technique and making my own extracts which have superior burning qualities to the ultra-fine powder commercially available.  I have finally opened the door to whatever world lies in Salvinorin A, but I cannot pass...</p><p>My typical smoked experience goes like this, generally.  I take a hit or two of 10x extract, and the Force grabs me.  My body feels as if it's in a physical state of restraint, completely against my will.  It is at this point that I remember a fact that I always manage to forget:  Salvia does you, you do not do Salvia.  This is not psilocin, LSD, nor any other 'hallucinogen.'  Salvia divinorum DEMANDS you to leave reality, and there's not much choice in the matter.  I suppose I resent this, and remember I have a life here and I can't leave completely.  Salvia takes me to a state of mind that is VERY uncomfortable, awkward, and radically nihilistic.  It is a feeling I believe I have felt in childhood, when I was forced to go to an strange day-care, a stranger's house, or anywhere else I felt isolated from familiarity.  I am reduced to a spectator of the world -- completely powerless to change anything.  I can't stand the alieness of it all!  I am still conscious of the world around me, although my sureness of everything wavers a bit.</p><p>Now comes a decision -- another hit?  Thus far, the answer has been no, and I try to make my body comfortable, to fight the Sage's grip, to ease the annoying prickly feeling, to stop the sweating.  Then I wait.  I wait for my body to feel normal.  And I wait for my world to feel familiar again.  Then it's over in a few minutes, and I briefly wonder why I even bother.</p><p>That, my friends, is what Salvia does to me.  It's such an intrusive and forceful feeling.  I haven't gotten much out of it yet, and I think it's because I am afraid to leave.  I'm afraid to let go.  I really do not know what's on the other side, no matter how many trip reports I read.  Will all the discomfort be there, only magnified?  Will vast places be there to inspire me?  I know I'll keep trying, and what it's going to come down to is a clear decision to leave.  I think getting to level 4 or 5 (on the SALVIA trip scale) is going to require me to know EXACTLY what I'm going to have to do, and when the painful arrival at that alien doorway comes, it is my job to take that hit to pass through.  I cannot keep giving into the fear and the astonishment that a force has me so strongly.  Perhaps the world that waits for me is one I shall never wish to see again.  However, many people have seen divination in that world, and as the old saying goes, 'You cannot discover new oceans if you lack the courage to lose sight of the shore.'  </p><p>If any other traveller is having my difficulties in getting the true Salvia experience, I hope you can persevere.  I will certainly try my best, and with a little courage I, too, will join the very few travellers who can say they've completely left this world.</p>"
}
