{
 "title": "The Bomb",
 "author": "likuidpaper",
 "citation": "   likuidpaper. \"The Bomb: experience with Ethylphenidate (ID 100914)\". Erowid.org. Aug 27, 2013. erowid.org/exp/100914",
 "substance": "Ethylphenidate",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "insufflated",
   "Ethylphenidate",
   "(powder / crystals)",
   "  T+ 0:40",
   "10 mg",
   "IV",
   "Ethylphenidate",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 100914",
   "Gender: Male",
   " ",
   "Age at time of experience: 30",
   "Added: Aug 27, 2013",
   "Views: 1694",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMindset: just got off work feeling a bit excited and anxious due to 8 hours of manual labor and recent delivery of RC's.<br>Previous drug experience: Alsmost everything, a lot.<br>preparation: some mental preparation<br>T+0:00<br>Insuffilate 10 mg ethylphenidate. Slight burn, not as painful as most reports report.<br>T+0:10min<br>Slight mood boost, most likely placebo. Drain not too repulsive.<br>T+0:20min<br>Definate stimulant properties, not unlike methamphetamine. <br>T+0:30min<br>Stimulation building. Mild euphoria present, building.<br>T+0:35min<br>Niiiice, excellent body feeling, mental clarity, rush, moderate euphoria.<br>T+0:40min<br>Inject 10mg. This is when I lose track of time.  I feel wonderful. Very clean stimulant, with quite a bit of euphoria. Mind is calm yet stimulated.  Body rush still going strong.  Slight dehydration present at this time but nothing more than you would expect from a stimulant. Ingest several alcoholic beverages.  Mixing well.<br>T+2:00hr<br>Still feeling great with a bit of a moreish quality but altogether feeling very good.<br>T+3:00hr<br>Coming down.  Not bad at all.  Feel slightly dehydrated and wanting more alcohol. Still stimulated.  Altogether a small dose with a very positive reaction.  Lots of euphoria, nice speedy vibe, easy comedown.  Way better than any ritalin experience I've had.  Definatley a novel RC with potential.  risk of abuse yet to be determined :-)\n\n\n"
}
