{
 "title": "A Taste of Nirvana",
 "author": "SkRaPz",
 "citation": "   SkRaPz. \"A Taste of Nirvana: experience with Cannabis (ID 1010)\". Erowid.org. Dec 12, 2000. erowid.org/exp/1010",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "11 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1010",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2000",
   "Views: 11845",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI am a regular user of cannabis, and have been smoking on almost an everyday basis for only a year.  Getting high and cutting up or embarking in deep thought had become rather routine, almost boring, until one night a couple of weeks ago.\r\nI was in my room by myself trying to get to sleep.  I had some things on my mind that seemed to bother me, although I couldn't figure out what they were.  After a couple of hours of restlessness I decided 'I need to smoke.'  So I set up my homemade gravity bong using a two liter bottle.  I am usually pretty high after 2 or 3 gravity swats, but by the time I had reached my fourth hit, I wasn't as high as I should have been (I was not on any other medication).  So I started packing bowl after bowl until I realized it had almost become involuntary, and that's when I noticed I was blitzed!\r\nI cleaned up and laid flat on my bed with my eyes closed, trying to ease my mind and get some rest for the day ahead. Before I knew it I was in a dream-like state, but I was conscious.  It was like my body was asleep but my mind was awake.  I found myself in a vast void, with visible ideas circling around me.  Then I heard a voice that seemed to echo over everything (I assigned him the name Buddha, although not until after the experience).  It seemed like somebody was talking to me, and while I remember carrying on a conversation with the voice, I cannot put into words what was said.  The voice then became dormant, and other smaller voices began to whisper all around simultaneously.  I questioned where I was and what was going on and almost instantly the echoing voice returned and told me that if I lost concentration, I would be forced to leave and never return.  I then questioned all of the whispers and was told that they were spirits who reached inner peace and this was where they resided (NO FUCKIN LIE!!!).  Then everything began to get distant until it faded away.  This is when I returned to the real world and looked at the clock to see that about 3 hours had passed and my high was gone (of course).\r\nI still question whether this experience really happened or not, but it seemed as real as the weed I smoked.  Since then I have actually noticed things about people and the ways of life that I had never noticed before.  Almost as if my eyes have been opened.  I have tried numerous times using the same technique, and even more potent herb at higher amounts, as I had that night and have not begun to re-visit the place.  Whether it was a dream or not, it was definitely total bliss.  I'm sure that I am not the only one to have such an experience from just marijuana, and have started looking for others who have, yet I am still unsuccesful.\n\n\n"
}
