{
 "title": "An LSD-like High",
 "author": "Death",
 "citation": "   Death. \"An LSD-like High: experience with Cannabis (ID 10105)\". Erowid.org. Dec 8, 2004. erowid.org/exp/10105",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10105",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 8, 2004",
   "Views: 39692",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For whatever particular reason, eating marijuana is, at least where I live, considered an ineffective method of consumption. Being, as I am, ever the curious young psychonaut, I have recently conducted a series of experiments testing the efficiency of consuming marijuana orally. The first such experiment was largely successful, but was planned poorly and my memory is shady of the entire experience. Because of this, I conducted the second in a series of experiments last night, and the result was nothing less than about 75% of an LSD trip. The following is a detailed log/list of ingredients utilized by me to attain an LSD-like state of consciousness. </p><p>PREPARATION:</p><p>Definetely the most important stage of the process. The majority of people who experiment with eating marijuana seem to have some odd fixation on making the entire process elaborate and outdrawn, and this is simply unneccesary. Instead of making THC butter or magic brownies, i opted for a simpler, more effective means of consumption. </p><p>The following ingredients were used:</p><p>-3 grams of mid-level marijuana</p><p>-Chunky Peanut Butter (the more fat it has, the more effective it is at absorbing THC)</p><p>-regular crackers</p><p>-microwave</p><p>Using generous amounts of peanut butter and huge amounts of weed, I managed to use 3 grams in just 6 little cracker-sandwiches. I then heated them up in my microwave using the HIGH setting (no pun intended), and waiting 3 minutes. The entire process took no more than 10 minutes. Once they were ready, I ate them hot off the microwave drank plenty of water. I wasn't TOO afraid about 'overheating' the weed and making it lose THC - it was more important to make sure that I heated it up as much as possible without totally burning the crackers in order to get as much THC into the peanut butter as possible.</p><p>EFFECTS: </p><p>initial time of ingestion = 12:40AM</p><p>12:50AM: Mild effects noted. Sudden surge of energy, subtle massage feeling throughout muscles and tendons. At this point I was rather sceptical of the entire procedure, depsite the fact that eating 2grams a week before had gotten me utterly inebriated.</p><p>1:15AM: Going up fast. Feelings now very similar to those experienced after smoking 3 or 4 large bowls of good cannabis. Vision blurring more and more every second, relaxtion overpowering, numbing sensation makes itself apparent. </p><p>1:40AM: Blasted off the face of the earth. Numb feeling felt throughout extremeties to a ridiculous extent, can barely move hands or feet. Hallucinations of all sorts begin to bombard me, HARD. Although visual disturbances are insofar absent from my experience, a somewhat frightening barrage of tactile hallucinations has begun and is quickly intensifying. Feels like I'm in an old movie and frames are skipping, strobe light feeling utterly disorienting. </p><p>2:10AM: All previous symptoms intensified, and still intensifying, at a ridiculous pace. Slight visual distortions first perceived. </p><p>2:30AM: Total loss of connection with real world. Although I promised myself I'd stay up to experience the effects. I find myself sitting on my bed, tempted to lay down. Visual hallucinations are now unbelievably intense, I find myself laughing with fear at the incredulous nature of the entire experience. Cartoon-faces begin to pummel me as though each face formed part of some gargantuan waterfall positioned right in front of my face. At this point I look at the clock and almost suffer a panic attack when I realize I still have a long time to go before peaking. </p><p>3:00AM: Visual hallucinations gain 3D quality to them, no longer just odd spirals and faces. A patch of moonlight near my door morphs into strange, all-white dogs, little children, and rabid wolves, all quickly running toward me. Every now and then I find the utter weight of the world extremely crushing, and find myself dreaming with my eyes wide open. STRONG chills overcome me, sound becomes blurry. Music I'm listening to becomes a static-filled cacophony of confusion, I find myself checking my headphones to see if they're broken (so much for enhancement of the senses). The world flashes in and out, I feel like I'm about to pass out. Total loss of time; at one point minutes seem like hours, and then suddenly what feels like 2mins time turns out to be 2 fucking hours. My eyes insist on closing, and although the feeling is great since my body is begging me for sleep, the entire experience is intensified 10x by closing my eyes. I repeatedly feel as though some evil presence is within feet of me, at one point I even hear the ragged breathing of some shadowy figure. </p><p>All of a sudden the world gets EXTREMELY blurry and i find myself laughing with how out of touch I am, I try to get up but find my entire body numb. Suddenly I lose all touch with reality; memory, rationalization and all the other components of standard consiousness are totally gone. I cling to consiousness with icy-numb fingers.</p><p>4:50AM: After a long blackout period, I wake up to find my ego and reality itself completely dead. My eyes stare blankly at the clock, and for whatever reason the time gets burnt into my head. At this point I'm knocked out cold, and the next few hours will forever stand as a big question mark in the history of my life. Absolutely no recollection.</p><p>10:00AM: Wake up for a few seconds and stare at the clock. I get up and try to sit down on a nearby chair, I find myself in bed again without remembering how I got there. </p><p>1PM: After numerous unsuccesfull attempts at getting up, I finally manage to. I can barely speak coherently, still very much disoriented and eyes half-closed. Warm fuzz obscures everything, I'm totally lost and confused and totally startled by the fact that I'm STILL utterly inebriated.</p><p>2:40PM: Warm, almost sensual sleepiness overcomes me, and I willingly give in to the gentle excstacy of sleep. Much more relaxed and pleasant than the cold knock out of a sleep I got the night before. </p><p>4:00PM: What began as a slight hunger turns incontrollable. I eat a huge cheeseburger, and a huge bag of chips,along with several cups of water. I find myself feeling bloated and even nauseated, yet nothing seems to quench my burning hunger. </p><p>5:00PM: Wake up feeling slightly less inebriated, but a warm, fuzzy cloud still persists. </p><p>7:05PM: Baseline finally within view, but still feeling disoriented and UTTERLY, UTTERLY unmotivated to do anything. At this point I realize that I've spent the entire doing, literally, nothing save for eating, sleeping, and watching tv from my bed. </p><p>All in all, the most amazing experience on weed I've ever had. The sheer intensity of the experience is easily worth the extra amount of herb needed; I simply cant get these kind of effects by smoking. Also, those nasty, unwanted smoking effects I often get (increased heart rate, annoying restlessness, irritability, burnt out feeling near the end) are nowhere to be seen. The strongest experience of my life.</p>"
}
