{
 "title": "Perma-fried from LSD",
 "author": "anonymous",
 "citation": "   anonymous. \"Perma-fried from LSD: experience with LSD (ID 10101)\". Erowid.org. May 8, 2002. erowid.org/exp/10101",
 "substance": "LSD",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "LSD"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10101",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 8, 2002",
   "Views: 49532",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOver the course of about a 8 months, a good friend and I consumed acid in the masses.  On average we would trip about 4 times a week, initially only doing one of two hits at a time.  But I was always pushing my limits. eventually I was dropping up to 8 hits at a time.</p><p>I began to notice that I was 'perma-fried' as I call it,  and that I was occasionally getting flashbacks that were intense enough to make me decide against continuing my use of lsd.  My memory had also been damaged.  eg. if I was to look at a page number in a magazine, close it, and then try and return to that page a few minutes later, I would have almost always forgotten it. Also my arithmatic ability, which has always been rather good has plummeted.  I lose track of where i am in an equation.</p><p>It is now over a year later and I still get flashbacks, although they seem to be decreasing in freqeuency.  I'm still perma-fried but my ability to remember things such as numbers and peoples names is begining to get better.  Also i'm getting better at math again. </p><p>I don't regret doing acid as I feel I learned a lot about the way the world is while under the influence.  However I don't think that i'll do it again as i'm 18 and will need all the memory and math skills I can get to be able to get thru my education that I plan on resuming soon.</p><p>To those in the same predicament as me,  bear with it and things will gradually return to normal, if not close to.</p>"
}
