{
 "title": "A Good Thing Gone Wrong",
 "author": "Groovegal",
 "citation": "   Groovegal. \"A Good Thing Gone Wrong: experience with MDMA (?) (ID 10110)\". Erowid.org. Oct 22, 2001. erowid.org/exp/10110",
 "substance": "MDMA (?)",
 "bodyweight": "116 lb",
 "header": [
  [
   "DOSE:",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10110",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 22, 2001",
   "Views: 8614",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI've started taking E in April of this year, 2001. A friend of mine at work told me about the glowing experience she had shared with her boyfriend and told me she could score me some if I wanted to try it. I talked it over with my boyfriend and we both decided it might be fun. Boy was it! We had one of the deepest conversations in the history of our 3 year relationship. We talked about things we never EVER could have brought up to each other! Everything was so clear, his eyes were so beautiful. Touching each other was incredible!! However, the next day, we both crashed really hard and he decided that 'that would be the end of it'. I, on the otherhand, felt that the experience I had was well worth the crash. I was in love! I would continue to take E, and he wouldn't have to know. The second time I tried it, I went to a club with my friend from work. Taking E at a club is a totally different experience from taking it at home. I was uninhibited, free! I was totally grinding with my friend and rubbing her pleather pants! They felt sooo good to touch! The music in my ears resonated and bounced off my ear drums in such a fantastic way. Life was grand! Since then, I've probably taken a tab of E every month, since April, always at a club or a musical event. <br>My not-so-good experience happened in Septemeber. Maybe I should back up a month to set the scene. In August, going out to the club with my buddies, I decided to buy 2 tabs instead of my usual one, you know, for another time.  We all took our tabs. About 30 minutes into it, I threw up like 3 times and my roll wasn't good at all. My buddy wasn't feeling good either.  Our other friend stayed in the restroom all night, grinding her teeth.  We decided, to take a half of our other pill, maybe that would get us going.  It kinda did, but it really wasn't that great of a roll.  <br>So back to September, I was home alone, one Friday night. I was feeling kind of lonley, my boyfriend had to work, so I thought, what the hell, I'll take my other half of E left from August.  So I took my half a tab, put my headphones on, and plugged up a really cool screensaver on my computer to watch.  I started to feel the E kicking in pretty quickly. I usually start breathing deeply, when the E first starts coming on, but I noticed that as I was breathing, I could feel my pulses..like all of them, everywhere in my body.  That was kind of freaky. Next thing I know, I feel my heart in my chest, racing...and I mean RACING. That really freaked me out. So I got up and decided to walk around a bit.  I took my pulse again, this time, I REALLY freaked. My heartbeat was too fast, way too fast. It scared me to even feel it, even though I could feel my heart racing away in my cheast. I took my driver lisence and placed it in my pocket, so that if I passed out on the street, someone might be able to identify me.  As I started for the door, my legs started to go weak, I was getting totally light-headed and my head was all tingly. I started thinking, 'So this is an overdose.' I contemplated my death, what would my parents think? Who would find me? Should I call 911? Meanwhile, my heartbeat is thumping and racing away, in my ears, in my head and I can feel every pulse in every pulsepoint in my body. I tried to calm myself down by walking around my neighborhood.  I ended up walking around for 2 hours before I felt I was calm enough to go home. When I did get home, I fell right asleep. That has NEVER happened to me while on E. This was half of the pill I had taken the 2 weeks before! What the hell happened here? Since that episode, I've been experiencing heart palpitations and feelings similar to my last Ecstasy trip. I've been to the ER twice and taken 2 EKGs, both of them fine and normal.  I don't know what is causing them now (I don't even drink caffeine anymore) but I do know, the first time was a result of taking Ecstasy.  I'm too afraid to take E now. Maybe in the future, if these palpitations stop, but for now, I'm playing it safe.\n\n\n"
}
