{
 "title": "Carnevil",
 "author": "Ryecatcher",
 "citation": "   Ryecatcher. \"Carnevil: experience with Salvia Divinorum (ID 10121)\". Erowid.org. Feb 19, 2004. erowid.org/exp/10121",
 "substance": "Salvia Divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10121",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 19, 2004",
   "Views: 4820",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have posted previously regarding various experiences with the legal herb Salvia Divinorum.  Those experiences I would classify as either good or indifferent.  Never had I had a bad experience, though that was to change.  Actually, bad is a, well, bad word for it.  It was more of a sobering experience, with a bit of warning thrown in.  In any case, here it goes.</p><p>Set was a restless yearning to have a reality-bending experience.  This was more out of boredom than any real spiritual quest, which, in retrospect, was my first mistake.  I prayed to God for protection, but not really discernment or seeing, as my heart wasnt in it.</p><p>Physical setting was same as the previous times: peaceful bedroom, though I was alone in there, with the wife playing Nintendo in a separate room, wanting no part of the Salvia Experience.  Some of my favorite music was keeping me company.</p><p>I crumbled two bowls worth of the dried leaf and smoked all of the first and most of the second before I started sliding down the Salvia whirlpool of energy.  As in previous experiences, there was a strong physical pull/push to one side.  I have found that sitting crosslegged (meditation style) controls the pulling some and allows my head to get into Salvia-space more easily.  I did this, and my soul began to unhinge itself from my body.  </p><p>At that point, the music was maddening.  What is normally very relaxing music to me was unbearably complex (it is pretty complex guitar music, but normally soothing nonetheless).  I (my body) shut it off.  The quiet was welcome, and allowed me to relax.  Moving had ground me into reality some.  I could hear, very distant through closed doors, the Nintendo my wife was playing.</p><p>I sat there, waiting for something to happen, waiting to visit another realm, but nothing, just a vague, uneasy feeling.  I smoked the rest of the bowl, taking two large hits, and sat again.  Again, the vortex feeling was back.  </p><p>As I sat there, eyes closed, I remember thinking this stuff isnt working today.  I dont want to be at the carnival.  I want to go a mystical journey.  Pause.  Then:  What carnival?  Im not at a carnival, Im at home.  What the hell was I thinking?  Another pause.  Then: Am I at a carnival?  Sure enough, as it turned out, I was.</p><p>Behind me, though I did not look, was a crazy wall of colors, a riot of plastic and old style tin toys making up the entire reality behind me.  It was indeed a carnival, a fun-house twisted reality of menacing clowns and cheap plastic and tin.  I knew this carnival was there, though I did not turn to look, and knew what it looked like, though I did not see.  The sense of it was utterly convincing, the sounds and smells even creeping into my (previous) consensus reality.   At that point, a presence entered the space.  This presence was beckoning me to turn around, look, and come and play in the carnival.  I was frozen in place.</p><p>I cannot properly convey in words the sense of foreboding and raw evil that I sensed.  There is a God, He is very much real.  There are demons also, and they are very much real.  I had my back turned to a demon, and I was in his playground.  I must stress here that I am by nature a very rational and logical person, not prone to superstition and whatnot.   I am also humble enough to accept that there are realms of reality that are not readily apparent and that we have not (should not?) visit.  Anyone that has experimented with Salvia or other entheogenic substances knows this truth first-hand.  I have (mind you, not under the influence of anything) seen both God and demons in action in peoples lives, specially during missionary trips in areas more primitive than our own strip-mall wastelands.  I know that God always triumphs, and that I had prayed for protection and was safe.  </p><p>I never sensed fear as such at the entity beckoning me, though I did give it healthy respect, as you would a passing lion.  My only concern was that I was indeed in his playground.  I prayed, and by doing so, slowly walked away, leaving the crazy carnival behind me.  I opened my eyes, and my soft bedroom was there. No carnival, and, more important still, no demon.  It felt like I had been gone a good half hour, though it was less than a few minutes. Feeling like I dodged a bullet, I got up and went to my wife.  </p><p>I attempted to tell her what transpired, but speaking about a Salvia trip after it just happens makes nothing but disjointed gibberish come out of my mouth.  After I integrated it (much later) I told her.  She was better able to verbalize her previous (all bad) experiences, having been though one myself now.  We both agreed that Salvia opens a huge door in our fabric of reality through which any number of things (some, yes, unpleasant) can slip through.</p><p>Retrospective and two cents worth:  I have a much healthier respect for Salvia now.  Though my experience was not incredibly intense as such, it was pregnant with potential for all manner of psychic harm.  I can see how entering the carnival could have left me battered and bruised.  The warning is duly noted.  I am forced to remind myself again that Salvia is a rare and powerful leaf, previously known to just a small group of indigenous people who live very simple (though hard) lives with none of the spiritual baggage that our society heaps on us, and normally is used by a person trained to dance between these two worlds.  I have, through the Internet, been given knowledge that I have not earned and probably do not deserve.   Living in suburbia under constant spiritual attack, I feel like I am not supposed to have this knowledge, as it is a dangerous thing in our environment.  I will, in the future, be more careful about the doors I open, and ask myself if I really want to see what is behind them.</p>"
}
