{
 "title": "Methyl vs Ethyl: What a Difference",
 "author": "rawkingrukus",
 "citation": "   rawkingrukus. \"Methyl vs Ethyl: What a Difference: experience with Ethylphenidate (ID 101364)\". Erowid.org. Oct 25, 2013. erowid.org/exp/101364",
 "substance": "Ethylphenidate",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Ethylphenidate",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2013",
   "101364",
   "Male",
   " ",
   "22",
   "Oct 25, 2013",
   "Views: 1123",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So, I have quite a lot of ritalin on hand, witch I use unprescribed at the momoemt since I have to piss clean for four month until I can get a script for my ADHD. My regular dose of Ritalin is kinda low, 15-20mg a day combined with Etizolam to perhaps combat the nervousness/jitteryness that made me quit Concerta every time. I suppose the dose was too high and I ono weird to start on but on Ritalin I've been doing decently. I'm going to detox and 18 month rehab in three months where I'll be able to see wether or not methylphenidate can assist me with my ADHD issues and not make me a nervous wreck without the etizolam.</p><p>Well enough intro here we go:</p><p>+00:00 I snorted about what I can imagine being 10mg of Ethylphenidate</p><p>My mindset was kinda vary, because high doses of methylphenidate has never been much euphoric or enjoyable, I get very nervous and jittery on high doses and in turn create what many would describe as anxiety.</p><p>I kinda expected the same but boy was I wrong.</p><p>First effects noticed was actually aggression, I had just been kicked from my e-sport team (changed to sub) and I was kinda in a murderous mood; witch is unlike me but it didn't feel awkward out of place or unjustifiable. I was just angry and felt I had a good reason to be so.</p><p>+2:00 snorted one twice the size, I'm guessing between 30-40 mg.</p><p>Now I'm feeling it, holding my rage under control and not letting it go out on anyone I am very chatty, and in a good way. Not like amphetamines or meth where I only talk about myself. Small talk and responding on topic and actually being able to have a normal conversation (witch is totally unlike me, I am awkward and cant keep on topic or be relevant) so it felt really good.</p><p>It was not an intrusive high where I just had to do something, I was just very focused and, perhaps not entertained, but I felt good being able to do things even Amphetamines or Methylphenidate hasn't been able to do for me, 'function normally'.</p><p>I know this is a dangerous statement, as thats how people go down a road of addiction so I won't claim that this is the perfect me and I have no troubles living the way I am without it. </p><p>Through out the night I took maybe five more lines of similar dose, not having a compulsion to redose like Amphetamines I was quite content with the high and was able to get lots of stuff done, even while drunk.</p><p>I was able to catch up with an old school mate, conversate very well with lots of unknown people witch on Ritalin is a nightmare (even when ingesting large amounts of alcohol), it's easier without but then I'm just apathetic and totally spaced.</p><p>I will def chose this stim over amphetamine any day. It's not as intrusive, egotistic, self centered or totally wired. It's a good middleground.</p><p>Compared to methylphenidate I can say that anxiety, nevousness and paranoia was def decreased and I can almost say non existant.. even the three hours I had two lines without any alcohol or etizolam. </p><p>I will def stock up on this for social occassions and emergency study sessions, because thats where I'll find the most use for this, it doesnt realy belong at a party as its much more usefull elsewhere. I better get those pesky boring study and school things done and just party without it. </p><p>-----</p><p>Also I went to a friend later who inject all kinds of drugs from MDPV, Ketamine to Amphetamines (I never injected myself and I don't plan to)and I asked him if he was going to inject and he said yes. So I gave him aprox a 10mg dose just to be on the 'safe' side. At first he didn't notice anything and I asked him to wait another hour and I gave him a slightly bigger dose.</p><p>He reported no rush at those doses but he got incredibly stimulated. He even turned down extra Ethylphenidate because he was very happy with his state of mind, even tough it took a while to kick in (or for him to recognize it), this guy never turns down a line, he's pretty reckless, and that says something. </p><p>I don't have a scale so these doses might be totally wrong but imagine half of a standard visa card and slightly thicker then just a pen stroke.</p>"
}
