{
 "title": "Rectal Administration Was Nice",
 "author": "Paradox",
 "citation": "   Paradox. \"Rectal Administration Was Nice: experience with TMA-6 (ID 101462)\". Erowid.org. Oct 4, 2013. erowid.org/exp/101462",
 "substance": "TMA-6",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 mg",
   "insufflated",
   "TMA-6",
   " ",
   "  T+ 0:45",
   "27.5 mg",
   "rectal",
   "TMA-6",
   "(liquid)",
   "  T+ 9:45",
   "  ",
   "smoked",
   "Salvia divinorum",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 101462",
   "Gender: Male",
   " ",
   "Age at time of experience: 24",
   "Added: Oct 4, 2013",
   "Views: 650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had the opportunity to try the TMA-6 for the second time. Since there is not a lot of info available about it, I think this contribution could be useful.</p><p>The first time was about a year ago with 35mg, oral. This experience left me unimpressed by this material. Since I have not much of this substance but still want to experience a stronger effect, I decided myself for a rectal administration of ~27.5mg (diluted in 10ml of warm water).</p><p>This dose was administered at 07:00 PM (T+0:00). I took 3mg by nasal administration 45 min before to test for any allergic reaction. The last meal was from 01:00 PM.</p><p>The alert (placebo?) was felt pretty quickly (T+0:10-0:15) but the real come-up began strongly at T+50'. I felt that something strong was invading me while my mind was left pretty unchanged. I got the same feeling I get in my mouth and in my belly when I'm coming up on other psychedelic phenethylamines, not nauseous but still a bit disturbed. During this phase, I felt pretty febrile, my legs trembling a bit.</p><p>At T+1:25, it seems to me that the biggest part of the come-up was done but until T+5:00 I felt like the effect were developing. Time was passing pretty slowly until this moment. A contrario, it was the opposite after this. I spend the night on a place in town with friends. I never got paranoid or feel assaulted by the environment or people. The effects were really enjoyable, providing a good body comfort like 2C-B/MDMA with less amphetaminic sensations than MDMA. Also, there wasn't excessive emphatic feelings or urge to talk but nonetheless a real satisfaction to be there. </p><p>The psychedelic component was not strong but still undoubtedly present. I'd enjoy to talk profoundly about trippy subjects, grasping and being fascinated by the mystery of Life but still be there on this place with my friends.</p><p>My friends told me that they'd hardly notice that I was under influence. Visually, things weren't moving but I did see beautiful and strange faces in the paving of this place. My vision was beautifully enhanced, the lights and the colours were really appreciated. I'd say it was a strong ++ on the shulgin scale.</p><p>By T+9:00, I go to bed after a Salvia join that really surprised me (I got one of the strongest crazy laughing of my life) and fall asleep with ease. There was no come-down to speak of.</p><p>The next day, I was fine (minus the hangover I got from the alcohol) but pretty tired.</p><p>All in all, I'd take this substance again without hesitation at the same dosage, maybe a bit more (e.g. 30mg rectal) if I plan to spend the experience alone in my apartment. This place with friends was a really nice context. At this dose, it's not strongly psychedelic but in no way frustrating. I would not push this really higher than 30mg rectal, since the come-up was already pretty strong. I don't feel like this substance has to be used as a strong, archetypal psychedelic.</p>"
}
