{
 "title": "Just a Glimpse",
 "author": "Lucid_Dreamz",
 "citation": "   Lucid_Dreamz. \"Just a Glimpse: experience with Salvia divinorum (5x extract) (ID 10144)\". Erowid.org. Aug 23, 2004. erowid.org/exp/10144",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10144",
   "Not Specified",
   " ",
   "Not Given",
   "Aug 23, 2004",
   "4487",
   " "
  ]
 ],
 "report": "<p>Last year Salvia caught my eye.  After some thorough research, I decided I would like to experience Salvia.  I ordered some leaves.  On quite a few separate occassions, I smoked the leaves.  This was done EVERY way possible.  Most of the time I would just get kinda light-headed and 'wishy-washy.'  They were very minimal effects.  </p><p>I haven't touched the leaves for a long time and just recently ordered some 5X extract.  When it arrived in the mail I couldn't wait to try it out.  After a day or so, I decided I would try it out.  I measured out 1/10 of a gram and put it in a bowl.  It was substantially more material than I had expected.  Slight meditation was performed to relieve any tension present in my body.  After the exhalalation of a deep breath I lit the bowl and pulled in the smoke as hard as I could and held it in my lungs.  I lay back on the comfortable pillow pile and closed my eyes.  My heart started racing and to keep my mind thoughtless, I counted the heart beats.  As soon as I hit seventeen heartbeats, I could feel the Diviners Sage pulsing through my body.  While letting out the smoke, my mind just slightly started telepathically communicating with some being.  The communication became clearer and clearer, I could almost understand what it was saying.  As the voice was getting clearer, my body got 'pulled' into a room where the being was.  I thought the voice was coming from a she, somehow I knew she was beautiful, not sexy but beautiful.  </p><p>By now, I could hear what she was saying.  It was something along the lines of, 'You need to come back later.  This is not your time - we aren't completely ready for you.'  I could not see her, I just somehow knew that she was in the same room as me.  With this statement, I was nearly pushed out of the room and my eyes opened.  Next time I smoke the extract, I will smoke more.  This experience was very interesting.</p>"
}
