{
 "title": "Museum Dose",
 "author": "Horizbiz",
 "citation": "   Horizbiz. \"Museum Dose: experience with AL-LAD (ID 101492)\". Erowid.org. Oct 11, 2013. erowid.org/exp/101492",
 "substance": "AL-LAD",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "150 ug",
   "oral",
   "AL-LAD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 101492",
   "Gender: Male",
   " ",
   "Age at time of experience: 50",
   "Added: Oct 11, 2013",
   "Views: 1372",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWeight: 105Kg\r\nDose: 150ug on Blotter\r\nMy friend Ben and I dropped some AL-LAD on Saturday afternoon at 4:30. We held the blotter under our tongues for 15 min and then swallowed. There was no taste to it at all and earlier I had tested it with Ehrlichs reagent which gave a positive (Violet) for LSD or other Indole based drug. Based on the test and taste I was satisfied it was not an nbome. \r\nThere was a slow come up over the next hour and we fell into a fairly mild trip. No OEVs and just a trace of CEV visuals. Conversation flowed easily and we had a great time. There was a lot of energy and dancing would have been easy and enjoyable. There is definitely a speedy feel to this as opposed to mushrooms, and it is certainly not in any way introspective at this dose. \r\nMy wife was present but not tripping, and said both Ben and I were very funny. She could tell we were on something but it could easily have been mistaken for just drinking. Ben took another half at around 6:30 and by 6:45 said the trip had noticeably intensified with trails starting to appear. We took a few hits of nitrous throughout the night which definitely brought on some CEV kaleidoscope imagery.  By 11:00 we were down and at 12:00 I was in bed.\r\nAt this dose the substance is completely manageable. I generally like a more intense trip and next time we both agreed we could easily start with 300ug and possibly go another 75ug. We both liked the shorter 8hour duration and look forward to doing it again.\n\n\n"
}
