{
 "title": "Quick Ascension of Sensual Mountain",
 "author": "emd",
 "citation": "   emd. \"Quick Ascension of Sensual Mountain: experience with 5-MEO-DIPT (ID 101526)\". Erowid.org. Oct 15, 2013. erowid.org/exp/101526",
 "substance": "5-MEO-DIPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2013",
   "ID: 101526",
   "Female",
   " ",
   "26",
   "Oct 15, 2013",
   "Views: 1865",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a survivor of sexual abuse and my primary interest in psychedelics and empathogens is their healing properties, particularly the ability to have sexual experiences while remaining present and fully embodied. I have experienced MDMA and a few different empathogenic RCs I cant recall the names of, acid, 6-APB , 2C-E, 2C-I, 2C-B, 25-I-NBome, 25-B-NBome, many different strains of marijuana, and various stimulants that arent really relevant here. I should add, though, that compared to other RCs, especially the NBome series, 5-MEO-DIPT does not feel very stimmy. I have had some bad experiences with stimulants which I think may have resulted in temporary stimulant psychosis, so if the come-up on a drug is very stimulating, it can trigger intense anxiety for me now.</p><p>1:20pm DROPPED with a little bit of remaining green smoothie, even though a trip report advised fasting beforehand.</p><p>2:20 Havent had any physical discomfort, so that is RAD. Getting a little giggly looking at funny posts on the internet.</p><p>2:30 Started to feel warm in various parts of my body. Especially in my neck. Tummy feels a little full. Might be time for music!</p><p>2:37 Put on a record I really love, and feel a little weirded out by the initial effect this drug has on sound there are weird layers between sound, which result in the music feeling flat. I didnt really like this, because I like drugs to enhance the sound of music, but this subsided and music sounded great eventually).  Started to feel sweaty, so I took a showerfelt effected by the chemical at this point, but didnt have any trouble moving around. Parts of my body which have been sore felt exacerbated a little bit, and I wanted to stretch, and keeping my balance to do a toe bend was a little more challenging than usual, but now that I was clean I could spend my trip laying down.</p><p>2:48. Feel very warm. Opened window. I can tell I am feeling kind of aroused because I want the music currently playing from a speaker to be closer to my ear, and I switch to headphonesmusic sounded sort of odd from the other room. Sounds better in headphonesbut still sort of muted in this odd way. Watching sekai stare into the sun in the window and I can see so much movement in her every breath.</p><p>2:50-3:10 Didnt want to put clothes on, and there is no curtain in my window seen from the street and it is daytime, so I made a little nest on the floor next to my bed.</p><p>3:14 I proceeded to give myself the most epic orgasm I have ever experienced. There are no words for this.</p><p>3:55 Music sounds amazing. Have a vague pain around what I imagine is one of my ovaries from whatever that epic shit was. As with most other psychedelics I have experienced, heightened senses seem to enhance whatever is happening, so while air on my skin feels completely amazing, parts of my body that are sore or in pain also feel amplified at points. Dated this for a minute before the present time, so you know, that is how it is going.</p><p>4:01 Eating a little snack because I feel like moving but also too trippy to be outside by myself.  Music is the best shit.</p><p>4:12 I wish there was someone to be dumb withnot really a cerebral high at all. </p><p>4:19 No music, watching sun through window, seeing beautiful moving almost rooms, if I was looking in from the ceilingif I sort of interrupt, I realize that I am actually just watching the sunlight through the window, but when I relax into this gaze I see slowly swirling tapestries, like walls covered in wallpaper of pretty-hued patterns with bits of light shifting as they move. This is the most intense visual I have ever had on a psychedelic, and it is very beautiful. I would put this at a ++which I found interesting, because many of the trip reports I read reported fairly intense experiences at much lower doses.</p><p>4:38 Spent some time thinking about the person I am in love with and feeling a little indeterminate in life right now. Cried. Mood then shifted to something much lighter. Desire to connect with someone. Might watch a movie. </p><p>4:49 Feel very contemplative. Have just been sitting here thinking about a number of different things, mainly what I would like to do at this point.</p><p>5:54 Feel like Ive definitely been coming down for like an hour, eager to move and be socialwalked to the tobacco store to test out how ready I am to be in public space. Still didnt feel fully back to baseline and had a little anxiety walking around, but made it back okay.</p><p>6:30 Friend called and we talked for about an hour. Felt a little bit high still and struggled with my words at points, but had a good talk and felt connected. </p><p>7:30 Left to meet up with friends to go to a show. Still felt a little bit groggy, and had difficulty fully entering into the experience because I felt like connecting meaningfully with people and we were primarily in a loud, super crowded venue. Definitely a bit of a residual slowness as with any trip being integrated for the next 24-48 hours. </p><p>This is definitely a drug Id probably prefer to do in a social setting, but an intimate one. Very heightened senses, and a definite sexual dimension to that elevation of senses. A perfect context would be with someone you are intimate with, so you can fully immerse yourself in the power of heightened senses and also have someone to connect with and keep you company after the sensual peak of the trip. Didnt really experience an afterglow as with many other psychedelicsmuch shorter in its immediate and long-term effects. Music sounds good eventually, but there are other drugs that enhance music much more fantastically.</p>"
}
