{
 "title": "Daydreaming",
 "author": "E.Rohde",
 "citation": "   E.Rohde. \"Daydreaming: experience with Mushrooms - P. semilanceata (ID 10169)\". Erowid.org. Nov 6, 2003. erowid.org/exp/10169",
 "substance": "Mushrooms - P. semilanceata",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8.0 g",
   "oral",
   "Mushrooms - P. semilanceata"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10169",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2003",
   "Views: 4996",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm just going to sit here, sit here awhile and let time forget about me.  Im in this empty park that over looks the grey pudget sound.  It's rainy its cold its windy, it's beautiful it's the island.  The wind makes my ears like bottle tops with wind blown across, loud cold rumbling.  The sea is ceasless rolling waves that sound like passing traffic.  Autmnal tumbling leaves all red and orange gold brown  everywere causing tracers of colors I cant describe.  Crows looming and calling making me think of Poe and his poems.  All this makes me want to write this all down maybe if I write it down precisly I can capture it hold it have this feeling forever. Write about the windmill thats the concession stand all closed up with mums surrounding it swaying vibrating breathing with life. Everything is awake now no longer sleeping but its all slow and sleepy,  all the trees and the plants are yawning getting ready to go down for winter and I have broken through to there world to watch them curl and stretch watch their eyes get foggy with dreams just like mine.  </p><p>Big puffy clouds look no different than the cascade mountain range below them, floating mountains all tonal gray and creamy white gliding, colliding breaking apart like iceburgs in the sky when they explode shafts of blazing sunlight scream through the sky like pillars to the gods, its all pink and gold and purple another sunset I cant describe so brillant so common.  Makes me want to swell up with it all and burst into a thousand flecks of stardust and fall into the wet rich soil and green grass and be all this that I see.  Mostly images broken random beautiful.  We think the indians that lived here knew about the mushrooms, thats what the old hippy tells me he must be a hundred years old himself his skin is like wet paper and he wears beads and lives in the woods he is witch indian magic he is my friend.  They are probably earth spirts, I can see dancing and hear singing and feel drums smell smoke and warm fire and water and crazy painted eyes.  The little people laughing and dancing in the fertile times with skin like burned brass the color of trees and grass.</p><p> Circles moving echo voices,</p><p> there all ghost now so sacred so intense I can feel the earth pulse in my naked feet on this wet grass makes my body beat with it. The whole world is alive and every moment speaks in some life sound all around me effaced by life I'm deluged in my senses and even the air is intoxicaitng.</p><p> To call this high would be cheap,</p><p> I'm lost for words now.</p>"
}
