{
 "title": "Twisting and Spinnin",
 "author": "Psychonaut",
 "citation": "   Psychonaut. \"Twisting and Spinnin: experience with LSZ (ID 101615)\". Erowid.org. Oct 22, 2013. erowid.org/exp/101615",
 "substance": "LSZ",
 "bodyweight": "50 kg",
 "header": [
  [
   "DOSE:",
   "300 ug",
   "oral",
   "LSZ",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2013",
   "ID: 101615",
   "Male",
   " ",
   "Age at time of experience: 16",
   "Added: Oct 22, 2013",
   "Views: 1128",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Just a quick intro: I have previously tried AL-LAD and LSD and had gotten very curious as to what LSZ was like.</p><p>I also prefer to trip with others, and being outside smoking and just doing whatever, but I couldn't really do it with anyone at the time and I just had to see what it was like. </p><p>00:00 - I put two tabs of 150 microgram blotters totalling 300 microgram LSZ in my mouth and chew it for a while before swallowing.</p><p>00:20 - Sensing low noise, probably false alarm. Just very eager to see how it compares to other psychedelics.</p><p>00:40 - No signs yet, definitively false alarm.</p><p>01:00 - Nothing so far, I'll just play video games while waiting. I launched World of Warcraft and decided to log in. I had pretty much nothing to do so I went around exploring.</p><p>01:27 - Feeling weirdly good, seing mild patterns and tracers. Great euphoria. I have now almost ran through an entire continent in the game running around exploring. Suddenly some guy asks if I want to help and I thought joining a group of four other players and enter a dungeon would be very interesting.</p><p>01:40 - We have gathered in the temple of Zul Farrak, ready to slay the trolls and defeat the wild beast within.</p><p>01:45 - The visuals had just gotten started, it was becoming stronger and stronger with huge patterns everywhere with the most silly faces all over my room and on my computer. The euphoria was so intense, however I came across one issue. I could just not lie comfortably enough, This always happens.</p><p>01:50 - We have just now almost killed fifty trolls, I can barely concentrate on the game, but we managed to survive somehow.</p><p>02:07 - We all suddenly died, there was a bug in the game. I decided that it was too hard anyways so I got the (possibly) best idea I have ever had. I started to watch Adventure Time, and boy it was the most fascinating and trippy shit ever, even the episodes I had seen before I couldn't recognize.</p><p>12:32 - Just woke up, trip ended around 08:30 (from 2 to 8 I had been watching adventure time, it was so fucking awesome) except I couldn't sleep till 09:00 due to the heavy body load. Also, before I fell asleep the whole room was twisting and spinning, It was really intense.</p><p>I actually could not tell a damn difference from this and LSD, so I guess that's cool. The visuals were fantastic, and the headspace kept my thoughts going the whole night, though I remember little of my thoughts. I do feel a little tired, but I always do that after being awake 24hours+ and tripping. Honestly, if someone were to give me the choice between this and LSD, I would not give two fucks which one I took.</p><p>10/10, would do again! Next time I am bringing friends though and definitively going outside.</p>"
}
