{
 "title": "Music, Dance and Movement",
 "author": "howsthewater",
 "citation": "   howsthewater. \"Music, Dance and Movement: experience with LSZ (ID 101648)\". Erowid.org. Oct 24, 2013. erowid.org/exp/101648",
 "substance": "LSZ",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "LSZ ug",
   "buccal",
   "LSZ",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "101648",
   "Male",
   " ",
   "Not Given",
   "Oct 24, 2013",
   "2109",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Launch</p><p>LSZ is a functional analog of LSD developed by a team led by Dr. David Nichols at Purdue University.</p><p>I start my day with an intense swimming workout and an attack on my to-do list in an attempt to free my afternoon and evening for psychedelic experimentation. At 2:30pm, feeling healthy, strong and in a positive mood I dose 150ug of LSZ blotter buccally. The paper is tasteless and odorless and I swallow it at T + 0:20.</p><p>T + 0:25</p><p>I take out my chess set to work through a practice scenario from a book. Shulmans In Search of a Meaningful Moment is playing on my Corsair SP2500 speakers and I am noticing initial alerts from the LSZ. Music sounds wider and my cell phone screen appears a bit brighter. The chess problem is fun and easy to follow but I am also glad that I chose a relatively simple lesson. I doubt that I could have solved or even followed a complex chess solution.</p><p>T + 0:30</p><p>Typing is easy. Appropriately, I am watching a David Nichols talk on the science of psychedelics. First physical alert: my body feels heavy.</p><p>T + 0:45</p><p>The Nichols talk is fascinating. He claims that LSDs similarity to serotonin was one of the first clues that neurochemistry and behavior might be linked. Looking out my window the outdoors appears brighter. No negative physical effects, but reading is becoming more difficult. +1.</p><p>T + 1:10</p><p>There is very mild movement in some of my favorite psychedelic art, but only after staring at it for a while. There is a tactile / erotic component to LSZ, although it is more subtle than with other substances.</p><p>T + 1:20</p><p>Typing has become more difficult and feels somewhat robotic. (This is a common sensation for me on psychedelics.) Music is joyously deep and I am loving the effects of LSZ on sound. The substance is minimally visual and I decide to focus much of the rest of my trip on music, dance and juggling.</p><p>T + 1:30</p><p>Food! Yes, food! Taste is dramatically enhanced. I eat a large red pepper and a toasted bagel with cream cheese. I pack a bag with headphones, water, a notepad and some juggling balls and walk a half-mile to a nearby park.</p><p>T + 2:30</p><p>I am a fairly advanced juggler and it seems like my five-ball juggling is better on LSZ than it is sober. Great! Dance, music and movement are all wonderful on this substance. Most psychedelics and stimulants give me saucer-pupils but this dose of LSZ has my pupils only partially dilated and I am not wearing sunglasses outdoors. LSZ at this dose seems perfect for going out dancing downtown, with minimal open- and closed-eye visuals but tremendous music and movement enhancement.</p><p>T + 3:15</p><p>Showering feels wonderful. LSZ is energizing in a non-speedy way in that it could fuel hours of activity (dance, juggling, acrobatics, etc.) but as soon as I lie down or sit I feel like I could veg out and be still until bedtime.</p><p>T + 5:30</p><p>My girlfriend and I head out to birdwatch. Music is wonderful, as is touch. Slight enhancement of color and crispness of visual field. The peak of my experience very gently touches +2 but isnt quite there. Not very heady or introspective. Erotic is excellent.</p><p>T + 8:30</p><p>I am not yet at baseline and wouldnt drive but I cook a rice and vegetable curry dinner and eat a fair amount. Mild GI upset, but totally worth the food and the upset is temporary. We turn on the projector and watch an hour of video from Ultra Music Festival Miami.</p><p>T + 10</p><p>Baseline.</p><p>Experience: DMT, 2C-E, 2C-B, 2C-C, 2C-I, LSD, 25I-NBOMe, allylescaline, nitrous oxide, psilocyble cubensis, MDA, MDMA, hydrocodone, cannabis, amphetamine, alcohol. Late 20s male, ~190 pounds and in good physical condition. LSD and MDMA were consumed six days prior.</p><p>*It is possible that the LSZ blotter that I consumed had degraded, as my experience wasnt on par with my expectations for 150ug. I am by no stretch of the imagination disappointed, as I really enjoy the low-dose experience. The blotter was properly stored and was dosed within two weeks of receipt.</p>"
}
