{
 "title": "A Cocaine Retrospective",
 "author": "Jules",
 "citation": "   Jules. \"A Cocaine Retrospective: experience with Cocaine (ID 1017)\". Erowid.org. Feb 4, 2001. erowid.org/exp/1017",
 "substance": "Cocaine",
 "bodyweight": "60 kg",
 "header": [],
 "footer": [
  [
   "2000",
   "ID: 1017",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 4, 2001",
   "Views: 194156",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is not about a once-off experience with coke, but rather me taking a step back from my life and looking at the past few years or so.</p><p>I've been using coke, on and off, for about 3 years now. It's a bit weird because sometimes I feel that all those movies and stories about coke don't seem that relevant to my life and then sometimes I feel like I'm a character from a drug story and then I start to feel oh so pathetic.</p><p>You spend half your life trying to prove that you're unique and immune from normal human fallibility, then before you know it you're in some room far away from home with a bunch of strangers snorting lines off some filthy toilet seat that you've 'cleaned' with a flimsy piece of tissue paper. It's times like this I find myself staring at my reflection in a mirror thinking, who the fuck are you? and realising that I'm actually just like everybody else and I'm a sucker.</p><p>It's not like I'm not a functional member of society. I'm 26 with a regular well-paying job with a fair deal of responsibility. I'm popular, I have had a few great intimate relationships in the last few years, live at home with the folks who suspect nothing (I think). I work, I play and I don't use coke other than on weekends. Still the thing that really bugs me is that throughout this year, and granted it's only 4 months old, I've only been clean one weekend. That's scary. In 12 weeks I've only been without coke for about 6 days. So I'm wondering (and coming to terms with the fact) that I'm in the throes of mild cocaine addiction. I don't need it, I don't crave it but if a casual suggestion is made about scoring a gram, I'm there like a bear. It's also quite concerning that recently, those casual suggestions seem to be coming from me.</p><p>I remember saying to myself that the day I took the name of my dealer off my cell-phone directory, I'd quit. Trouble is that I've used him so often that I know his number by heart. </p><p>Most people try to avoid the uglier sides of our characters. Then again, life's got this way of forcing you to take a long, hard look at yourself every now and then. This week I met a lovely girl and we hit it off like a house on fire and I really like her. I would see her this weekend except that she's just booked into rehab for heroin withdrawal. We spent a couple of days together and she said it was the first time in 4 months that she'd been clean and that she was happy. I felt rather proud of myself, thinking that I could be a good influence on her. Now I'm thinking, 'hey kettle, it's the pot, you're black!' </p><p>I'm just lucky enough to have chosen a drug with withdrawal symptoms that aren't so bad. (Well not bad enough to book yourself into rehab to go cold turkey.) I wonder if I stay clean for longer than a couple of weeks if I'll still be thinking this way. And I can't stop thinking about her. She's 20 and way too young and beautiful to go through this hell. That in a nutshell is hypocrisy for you. </p><p>I was trying to think what I like about coke and there wasn't much. I love the smell, I love numbing my gums, I love the ritual of scoring the gram, making the coke envelope and I absolutely love the very first line. It's pretty much all-downhill from there though. I can't sleep, I think way too much and get really depressed. I get incredibly horny, but I can't get it up so that frustrates me enormously. I smoke like a chimney and spend the next day coughing my lungs out. And I cry.</p><p>Just to end off I'll relate one really funny coke experience Ive had: Last year my girlfriend and I bought a gram and went back to my place. It was about 1 in the morning and I found it strange that my folks weren't home yet. So we spent the rest of the evening playing backgammon and polishing off what turned out to be a really nice gram, thank you very much. I kept saying to her how worried I was because they never get home this late and that they were very irresponsible for not at least phoning me and telling me where they were. When they finally got home at about 5am, I went to go ask them how they were. After a 5-minute conversation I went back to my room. My girlfriend had this shocked look on her face and told me to look in the mirror. My nostrils were clogged with thick white paste as clear as daylight. And to this day, my mum (who's a pharmacist for Christ's sake) and dad never suspected a thing. </p><p>Now you tell me who's more ignorant: the coke user or his parents and now tell me who needs to be educated more...</p>"
}
