{
 "title": "Really Funny but Less Spiritual That I Expected",
 "author": "TheCoolKamikaze",
 "citation": "   TheCoolKamikaze. \"Really Funny but Less Spiritual That I Expected: experience with LSZ (ID 101781)\". Erowid.org. Nov 11, 2013. erowid.org/exp/101781",
 "substance": "LSZ",
 "bodyweight": "56 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 ug",
   " ",
   "LSZ",
   "  T+ 1:00",
   "75 ug",
   " ",
   "LSZ"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 101781",
   "Gender: Male",
   " ",
   "Age at time of experience: 22",
   "Added: Nov 11, 2013",
   "Views: 874",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'll start with a bit of history :</p><p>I'm relatively new to psychedelic drugs as I've been only trying LSA and Salvia Divinorum for a couple of times so far. Other than these, I've been smoking cannabis for quite some time but only with friends, making me more of a 'party smoker'.</p><p>Anyway I heard rumours about LSZ coming out this summer on RC websites and I decided to try it with one of my best friend.</p><p>00:00</p><p>We dropped 75ug after a small dinner/party organized in my friend's apartment (at that time there was only a few people left). We were aware of the effects of LSD but as first timers we could not guess entirely what the trip would be like. We weren't drunk or anything but had a few beer during dinner (maybe 4 or 5).</p><p>00:30</p><p>My friend noticed something mild but said it might be placebo or alcohol.</p><p>01:00</p><p>We dropped another 75ug after the last guests left us. No sign of anything yet.</p><p>01:30</p><p>First alert, very very mild but I felt relaxed and a bit energized. As we listened to music my friend and I chat about our previous experiences.</p><p>01:50</p><p>At some point during the conversation I felt euphoric and surprisingly started to laugh really hard at a joke. Something was definitely building!</p><p>02:30</p><p>We felt more and more euphoric as we continued chatting. I started to notice a strange feeling at the back of my neck, some sort of rigidity but it wasn't uncomfortable. Music was also enhanced and had the feeling I could hear it clearer, better. We were both excited about the slow-building high we were experiencing and curious about what would happen next!</p><p>03:00</p><p>Some changes in lighting of the room, along with breathing walls, which made me euphoric and impressed.</p><p>03:30</p><p>Music is wonderful! We start listening to Pink Floyd and it really gets into me. It felt like the 'high' is following the music, in waves, and it was very comfortable as we kinda used the time between songs to explain what we were experiencing (which was hard and funny!)</p><p>04:30</p><p>Still building! We started wandering around in the apartment, looking at the paintings on the walls. Colours were really intense and the different characters or landscapes represented seems alive (A portrait becomes a 'Friend'). Still very euphoric about the museum his house became my friend had the wonderful idea of picking some pencil and sheets. We started drawing for some time and it felt wonderful and very funny: my drawings seemed to be commanded by me and the pencil itself.</p><p>05:30</p><p>As I was playing with some fruits my friend juggled with few moments earlier (with great skill!), I wanted to eat an apple but found it extremely difficult: the fruit looks so beautiful that a part of me don't want to 'destroy' or 'kill' it by chewing the first bit off. Finally after a few moments I started eating it and the taste was great !</p><p>06:30</p><p>My experience became a lot more easy to control at that time. I lied down on the carpet in the middle of the room and started closing my eyes, but I got lots of CEVs and it kinda scared me so I got up and continue tripping on the objects of the room, especially the carpet and the sofa where my friend were lying : while talking to him I saw the colours of the sofa and the wall behind it melting around him, which was pretty cool !</p><p>07:00</p><p>We both felt tired but it didn't seemed to be less intense as we still experienced CEVs and OEVs. We decided to go in his room and we both finished our trip side to side on his bed, in silence.</p><p>07:30</p><p>I felt like coming down as the CEV gets less profound and complicated. It really was a relief : I could start resting a bit.</p><p>08:00</p><p>I felt asleep and woke up clean few hours later around 11:00</p><p>To conclude, we really enjoyed that night but maybe we didn't expected the trip to be so long as we were really tired the day after it ! As my first experience using 'strong' psychedelics, it was really funny but less spiritual that I expected from a LSD-like molecule, even if I did had some challenging thoughts it didn't felt like it was life-changing or scary or anything, and I'm kinda happy of it :)</p><p>Thanks for reading and to end this report, one quote : 'It is only with the heart that one can see rightly; what is essential is invisible to the eye.' Antoine de St. Exupery</p>"
}
