{
 "title": "Everything Seemed to Bubble",
 "author": "not given",
 "citation": "   not given. \"Everything Seemed to Bubble: experience with Nitrous Oxide (ID 10179)\". Erowid.org. Sep 15, 2003. erowid.org/exp/10179",
 "substance": "Nitrous Oxide",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10179",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 15, 2003",
   "Views: 17634",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was just an ordinary Thursday night, with my friends going to pick up our shit for the weekend. After about two hours, they finally called us, telling us about some nitrous party.  As much as I had heard about it, I had never tried it myself, and everything was exciting and new. When we got there, my friend had been telling me he'd done at least 20 balloons. I thought it was bullshit, but I went on in anyway. In any case, this guy had one of those dentist sized nitrous tanks, and a shitload of balloons.</p><p>Before I get into this, I need to say that I can't even tell you how many balloons I emptied that night, but it was amazing. On the first balloon, I inhaled, getting the slightly cold, yet, tasty nitrous taste. After inhaling a bit, all at once, I think I blacked out, but it's slightly vague. After that, everything seemed to bubble (even sound), and I tingled all over, with each of my senses. The sound then modulated a little, and returned to normal, at which time I realized that it was the music from Gran Turismo in the background.</p><p>Although it was fun, I needed another. This time, me and three of my friends went into an open room and took a few balloons. We filled them a little more, to enhance, and wow. I remember inhaling the balloon, in and out (I don't know if that's the way you're supposed to), and then my friend just froze, and his balloon went flying. I almost laughed, but at the same time, everything started to echo increasingly more and more, until I felt myself thrust into the nitrous high. From this time on, every high had generally the same features. It would start out strange. I didn't know where I was and how I got there, but all I could think about was how my senses had melted together, and I was 'waving' around. I specifically remember waving, because every time involved some repeated scene, waving to a rhythm (maybe my heart). </p><p>After this, I could almost feel the drug peak. I could hear to myself, almost a drone, or a buzz from a machine kicking in, and then it would peak. My vision would be a blurred block map of some strange almost plaid tiles. In the middle, would be a rough cutout, and I could see all my friends through it. In addition, at the point of the peak, I could almost hear like a monkey calling, signifying my entrance to this jungle. In any case, it felt so good. Thousands of orgasms, and the recurring thought of how good it felt mixed with how guilty I must be to experience the feeling.</p><p>Following the peak, everything became scary, dark, and increasingly loud, so bad that it was ear-piercing, until I realized the sound I was hearing was another balloon being filled.</p><p>When I looked up, I saw my friend running into the wall repeatedly, head first, and I realized, I had been under for probably less than 30 seconds total.</p><p>In addition to our nitrous, we were partying with the standard stock of alcohol and marijuana, alternating balloons with hookah sessions somewhat.</p><p>The craziest part about nitrous, though, was that I felt almost like an animal, without controlling anything, yet perceiving the world through a crazy red tint.</p><p>After a while, we found we could go without a balloon for a bit, and then hit one, and get a tremendously strong high, that masturbated our every nerve, and then we'd follow up with a few more to binge, which resulted in eventually a longer high at the end.</p><p>All I can really add is that I felt a slave to the tank, which brought me heaven, and I don't even know how we were able to pull ourselves away for that night, but I definitely would visit that nitrous heaven again, only trying to limit myself first.</p>"
}
