{
 "title": "A Pleasurable Experience",
 "author": "Ipsod",
 "citation": "   Ipsod. \"A Pleasurable Experience: experience with Nutmeg (ID 10178)\". Erowid.org. Aug 19, 2004. erowid.org/exp/10178",
 "substance": "Nutmeg",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 nuts",
   "oral",
   "Nutmeg",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10178",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 19, 2004",
   "Views: 22542",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading about Nutmeg on Erowid and other sites, I felt the whole thing was a little bit shaky. I couldn't believe that something my mother owned in a spice cabinet could produce hallucinogenic effects. Despite all this, I decided to give it a whirl on a low dose.</p><p>Since pre-ground nutmeg appears to lack the hallucinogenic chemical, I bought some Nutmeg in nut form. Since I didn't want to be tripping balls in school the next day, I decided to cut my dose to 3 nuts.</p><p>Now alot of people have a problem digesting this spice. Once the spice is ground up, people try an assortment of techniques in order to digest it. Well I found a simple solution. Don't grind it. Eat the nuts, bite down hard and swallow it with water. You don't taste it nearly as much and it is much easier than spending the time to grind it up. And now the experience:</p><p>10:30 PM : Seeking a new high, I go into the bathroom and munch down 2 nuts.</p><p>10:45 PM: Nothing at all yet. Go into the bathroom and eat another nuts.</p><p>11:30 PM: Still nothing at all yet. I thought it would start working in an hour but I guess not. It was getting late so I hit the hay.</p><p>6:25 AM: This is where my alarm supposedly goes off. I cannot hear it and it takes my mom 4 times to wake me up fully. I get out of bed stumbling and into the bathroom. I notice something different and started to wonder if the nut really worked.</p><p>6:35 AM: Out of the shower and feeling quite stoned at the same time. It was a comfortable high and I felt no nausea at all.</p><p>7:15 AM: Outside, at the school bus, and the environment around me seems superficial and I am indifferent toward it. The feeling I was experiencing was similar to Cannabis but different. I felt as if my thinking was elevated, I could think deeper and more clearly, probing my memory was a snatch.</p><p>7:50 AM: Band class starts, and I feel a warm fold envelope me while I am playing my trumpet. It bonds the instrument with me and I play quite well. I am getting bad cotton mouth. Hey I thought weed was the king in this area, but I suppose not.</p><p>8:30 AM: Taking an incredibly important and hard test in English. The effects start to rise here during my test and entered a high state of euphoria. Thinking and problem solving was clear while I was in this state, much unlike what I expected.</p><p>11:30 AM: While eating my sandwich, I become fascinated by the fact that the Nutmeg was still going strong. It was about 13 hours since I took the dose and it was not letting up.</p><p>3:07 PM: The nutmeg is barely starting to let up. As soon as I feel that I'm sober, the feeling hits me again.</p><p>3:45 PM: I run out to the woods to smoke the wonder Marijuana and I was in anticipation in how Marijuana would interact with nutmeg.</p><p>4:30 PM: The high was very nice but very short lived. In fact I'm unsure whether what I'm feeling is from the weed or from the nutmeg.</p><p>7:00 PM: I'm typing this up and still feeling effects...</p><p>This was a very enjoyable high. I felt no nausea or discomfort. I have to admit that my planning was poorly thought out, though. Next time I do Nutmeg it will be way before bed and a much higher dose to achieve hallucinogenic states. I will refrain smoking weed with nutmeg again, as the weed does little to add to the effect. All in all, I'm amazed at what this spice you can find in grocery stores can do and will be sure to experiment with it later.</p>"
}
