{
 "title": "Smoked Surprise",
 "author": "Judgecrater",
 "citation": "   Judgecrater. \"Smoked Surprise: experience with JWH-200 (ID 101705)\". Erowid.org. Nov 14, 2013. erowid.org/exp/101705",
 "substance": "JWH-200",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "JWH-200",
   "(daily)",
   " ",
   "  ",
   " ",
   "Modafinil",
   "(daily)",
   " ",
   "  ",
   " ",
   "Pharms - Nortriptyline",
   "(daily)",
   " ",
   "4 mg",
   "smoked",
   "JWH-200",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 101705",
   "Gender: Male",
   " ",
   "Age at time of experience: 66",
   "Added: Nov 14, 2013",
   "Views: 559",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>66 year old male, 6'6', 250 lbs, good health. In the distant past I have had experience with LSD, mushrooms, mescaline, pot, hash and amphetamines. Alcohol and cocaine were my drugs of choice for most of my adulthood. I have been sober for over twenty years. I take prescribed modafinil and nortriptyline daily. I enjoy a (very) occasional joint or bit of hash.  </p><p>At the suggestion of a friend, I have been taking 30 mg JWH-200 orally for neuropathic pain. It gives me a mild body buzz, no euphoria. As it's a cannabinoid I figured there is little chance of any serious physical overdose, I have tried larger doses (100mg or so) on two occasions and gotten a heavier, woozy (and believe me I know from 'woozy') buzz but again no euphoria.</p><p>I read that a typical dosage when smoked is 2-4mg. That seemed unrealistically small, so I gave it a try. Home alone, weekend afternoon. It blew the doors off. Hit in 30 seconds and popped me into a psychedelic fountain of competing realities. Hurtling down electric geometric day-glo crazy quilt tubes. Immersive, as 'real' as the living room I was sitting in. Sometimes I was in them, sometimes I was them. Couldn't really tell if my eyes were open or not. Couldn't care either. The TV across the room did make an occasional guest appearance - a token reality that allowed me to remind myself that I'd taken a drug and would come down in a while. I toured my inner realities - looked at the things that made me tick at their most basic. They were at the ends of those tubes.  Beckoning. Receding just as fast as I was traveling. Needs. For connection. For love. Sex. Safety. Intimacy. Coexistent and competing pathways that twined, melded and split apart in a headlong rush forward. I'd be whooshing towards one when another tube, with a different goal,  would swing in from the side and have me flinging myself after something else. I'd always envisioned the human psyche as impassioned but deliberate, moving ahead at a walk. Apparently not. There's a whirlygig in there.  </p><p>About 45 minutes in my breakfast decided it wanted up and out and I coincidentally discovered that upright locomotion was an iffy proposition in this particular altered state. I made it to the bathroom (decades of alcoholic practice - I crawled) and lay in the tub slowly coming down for the next hour. </p><p>All in all not the experience I had expected. Much, much deeper. Dissociative. No LSD 'body electric.' No euphoric (or even emotional) component. It felt valid though. Like looking through the candy factory window...I could see how the candy is made, but just don't get to visit the tasting room at the end of the tour. Watching my basic drivers gushing forward in a sparkling and ever-evolving dynamism was...cool. The lack of affect (apart from WHOA!!!) was in retrospect disappointing.     </p><p>All in all, I think I'll stick with eating my medicine for now.</p>"
}
