{
 "title": "A Dark Comedy",
 "author": "Delsymfan",
 "citation": "   Delsymfan. \"A Dark Comedy: experience with 2C-E (ID 101800)\". Erowid.org. Nov 16, 2013. erowid.org/exp/101800",
 "substance": "2C-E",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 101800",
   "Male",
   " ",
   "17",
   "Nov 16, 2013",
   "Views: 377",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>3 years after my last dose of 2C-E, I decided to share some of my collective experiences. For science's sake, here's the nitty gritty. </p><p>Weight: Around 190-200lbs</p><p>Dosages From 12mg up to 27mg</p><p>Doses: Roughly 20 over the course of 3 years</p><p>2C-E for me was a fascinating chemical and to date has provided me with the strongest psychedelic experiences I've ever had. I'm going to break this down into a few different sections.</p><p>1. Dosage: Generally I found 2C-E's effects to be very mild under the 16mg dose for my weight, which equates to roughly 0.2mg/kg. Above 16mg, things got interesting. Effects seemed to scale in a non-linear fashion. Dosage became much stronger above 20mg, with very powerful visual effects. An accurate dosage method is highly advised. </p><p>2. Timing: I generally felt effects after 40 minutes, with a climb for the next 40 minutes. At about T+1:20 effects seemed to spike, and gently increase for the next 2 hours. The next 40 minutes would be a plateau, with the next hour being a steady decline. By T+4:00 I'd be feeling much more normal. Usually by T+5:30 I was near baseline. This didn't change very much depending on dose, but larger doses hit a bit faster. </p><p>3. Physical Effects: All dosages of 2C-E seemed to have a more or less linear bodyload. Doses under 16mg usually had very little discomfort, some stomach discomfort but that usually faded after 1 hour. Doses above 16mg always made me vomit around the 1 hour mark. This would be a one time only 'purge' followed by no further tummy aches. </p><p>I had a general inability to sit still. I would constantly be flexing muscles, moving my legs, wiggling my back, etc. Everything felt kind of stiff. Not painful at all, but just a bit odd. But oh how good does stretching feel. </p><p>4. Mental effects: 2C-E has the odd effect of keeping me relatively sober mentally at low-mid doses. I honestly felt quite normal. There's generally some increased euphoria at lower doses. Again 16mg was a real cutoff for everything in my experience. I had a mix of silly and sometimes surprisingly smart and logical thoughts. It felt almost like weed that made me smarter. </p><p>At higher doses things become quite different. The drug became much darker. Thoughts were more objective, more neutral. Emotion seems virtually stripped away from the equation. I've heard 2C-E called 'cold' in an emotional sense, and it's not inaccurate. It has the potential to allow me to think about some serious subjects without emotional overload. I found I was able to think clearly about tough decisions. I actually made the decision to pack up and move to another country while on 2C-E. I had been thinking about it for a while, and 2C-E simply made me see everything very clearly without other influences.</p><p>I'm a fairly pragmatic and objective person by nature, so this could just be a coincidence. But the morbidity and darkness pervaded other things, such as visuals. Since emotion is removed, I was never scared by these things. I simply observed. It's not all doom and gloom either, there are funny moments (e.g. me arguing with a Pine Tree). </p><p>5. Visual effects: Visuals at lower doses register a lot of swaying and breathing of objects. Surface inspection reveals the Persian carpet-style visuals everywhere I look. The fractals will never end and I could find yourself staring at a wall or a table for a while.</p><p>At higher doses, the previous effects are amplified. But flat out hallucination and morphing of objects occurs. Especially above the 20mg mark I saw some far out stuff. Objects transform, and everything seems like it's in some new form of 3D. My pine tree for example. The branches were no longer boring needle-covered pieces of wood. They were eyestalks/tentacles that would enter my window and peer inside to discuss things with me. My pine tree was kind of a dick by the way. We had uprooted and chopped up three of his neighbors, so he did have a point. </p><p>Other natural things tend to take on personality. My other trees after a thunderstorm got up and walked around commenting on how great and refreshing it was, and asked each other typical Monday questions.</p><p>Inanimate objects proved profound too, as hallucinations could appear out of basic patterns at 20mg+ doses. I've seen sores of the dead emerging from the bricks in the road. The street appeared as an abyss, bookended by sidewalks where I stood. Again, none of this terrified me, it's simply awe-inspiring. \rConclusion: 2C-E is a very potent hallucinogen that really opened my mind and eyes to other things. It's not the most social drug, but at lower doses it is a delight to take with a group. Higher doses are probably best in comfortable and familiar settings. Effects from dosage are amazingly predicable for each person, my 16mg number would prove true even with a .5mg difference (16.5 was way stronger than 15.5). Still, good measuring must be done because it doesn't take much of an error to put me on my ass. Physical discomfort early on also encourages planning this trip out, it's not ideal for clubs or parties. Besides, I probably seemed like a sociopath with my lack of emotions. </p><p>As the type who likes staying home and tripping, I loved this. Or if I just wanted to hang out with my friends with a little something extra. 2C-E is a great chemical I hope to try again.</p>"
}
