{
 "title": "Close to Being Able to Touch His Soul",
 "author": "King Relex",
 "citation": "   King Relex. \"Close to Being Able to Touch His Soul: experience with Salvia divinorum (leaves) (ID 10202)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10202",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "5 leaves",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10202",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 14, 2005",
   "Views: 3070",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On my second use of Salvia, I had an incredible trip that had me blown away for a few days. My experience was not planned and was a spur of the moment attempt to get something out of my purchase of this amazing plant. I found that my 'oneie' tool could be screwed onto the top of my bong and gave me the huge bowl needed to get enough leaves in with out having to reload again and again. A big bowl for smoking is a must.</p><p>With the bowl packed solid with 5 leaves, I tried my best to get through all the leaves before it hit me. I tell you, when I passed off the bong, my reality changed and I was blown away. Still feeling fully aware of my state of living, I was aware of an extra field of existence. I was in front of a 56' projection TV that was off, but the reflection from the light behind me gave the TV a mirror effect. I was convinced that if I tried, I would be able to step into the screen and dwell on the other side with out a problem. A quick thought told me that in the near future, we would be traveling through such devices (some kind of teleport thing).</p><p>As I turned to relate this to my friend, I was suddenly aware of another dimension to my surroundings. The only way I can describe this is like this. Picture if you laid Handi-wrap over a swimming pool and did a belly flop right into the middle. As you sank, the wrap would completely surround you, as if you were to push an object into latex rubber. The object would be visible, but the latex would be keeping it from being it's true self. Such as it was when I looked at my friend. I felt as if I could reach around behind him and touch his soul, if only the reality of our existence had an edge. I tried to tell him that I was so close to being able to touch his soul, but my words were quick and stumbled. I couldn't get out the right explanation for my experience until the effects of the salvia began to wear off.</p><p>Definitely a great night for tripping. We continued the evening with some very pure MDMA and kept on smoking small amounts of salvia mixed with THC. The doubled up pair of smokage was a great inducer of mental wandering. It was one of those nights that you just didn't want to end.</p>"
}
