{
 "title": "Pleasant 2C-B Alternative",
 "author": "Zam",
 "citation": "   Zam. \"Pleasant 2C-B Alternative: experience with 2C-I & Wine (ID 10204)\". Erowid.org. Oct 25, 2001. erowid.org/exp/10204",
 "substance": "2C-I & Wine",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "18 mg",
   "oral",
   "2C-I",
   "(liquid)",
   "  T+ 7:00",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10204",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 25, 2001",
   "Views: 15325",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nSaturday October 20, 2001<br>Material: 2C-I measured by mixing 96mg of 2C-I powder in 24ml of water, resulting in 4mg per 1 ml. The material was mixed first in distilled water in June 2001, over 4 months prior.  The water appeard perfectly clear with no sign of degradation or oxidation.  2C-B similarly stored has lasted years with no apparent loss in potency.  Material was from a known, reliable source of underground chemicals.<br>Mindset: Zam: I'd been in cycles of depressive funk since the WTC attack on September 11th and was having trouble finding motivation and interest in work.  A friend had mentioned a previous weekend's recreation with 2C-B and something about that hit home and I wanted to try to shove myself out of my rut with some sort of crowbar.  I considered mushrooms, lsd, etc and wasn't sure how to pick.  In talking with Zara, she was interested in trying 2C-I and so was I and that sealed it.  <br>We'd heard a number of people talk about their experiences, some very glowing, and some saying that they thought it had a higher body load than the brominated version.  A couple who had tried it first in a semi-therapeutic setting had said they didn't like it 'as much' as 2C-B, but I am all too aware of how much experience can vary from exposure to exposure and individual to individual to put too much weight on any of the vague comments.  Generally the agreement seems to be building that the duration is somewhat longer, but thats not necessarily a bad thing.  Dosage observations seem to be similar to 2C-B with many people saying its 'more potent' by some degree, but again dosage comments are not terribly reliable.  Folks who work with 2C-B just a few times often report wildly disparate dosages, but generally over time they settle out to more consistent readings as people get used to the normal variation in effects.<br>So, going into this, we were hoping for some downtime to reconnect, talk about life and the world and just take some time off.  One of the recurring incredible things is how much taking a psychedelic or strong psychoactive can really create a space or a break between weeks or periods or work-mind where just excercise or movies or other types of recreation don't seem to. 8pm: Zam & Zara each have eaten nothing all day, now have 2 pieces of bread and 2 pieces of cheddar cheese.<br>10:05pm : Zam & Zara each have a glass of wine as a way to smooth the coming up phase, which both find uncomfortable.<br>10:21 pm: Zam 18mg 2C-I, Zara 10mg 2C-I in water solution, taken with a small amount of orange juice. The flavor is tolerable and seems to go pretty well with oj.<br>10:40pm: Begin watching The Princess Bride as a way to ease the transition.<br>11:00pm: Distinct effects begin, some visual changes, body feeling, light perspiration and alterations between hot and cold feelings.  Generally uncomfortable stomach and body feeling.<br>11:40pm: Buzzing muscles and body, generally feeling stimulated and odd.  Discuss with Zara the different strange sensations.  Definitely altered.  Zara describes as feeling a sort of disequilibrium. Pee, drink a little more wine.  Zara has distinct mucus-draining in her throat causing her to cough (a normal reaction for her on 2C-B), so 25mg of pseudoephedrine is added for her (again a normal part of her 2C-B experience).<br>12:01am: Zara notices that Zam's forehead has a vein poking out, which is somewhat normal while tripping and we discuss whether it could be blood pressure related.  We break out the wrist BP cuff, which we've been using for a few months, and try it out.  Zam's resting BP is usually 90-100 / 60-70 with pulse of 50-60.  Tonight the cuff reads 136/89 pulse 70 & 141/88 pulse 71, which are both very high for Zam with no exertion.  Zara's resting BP is normally 90/60 with pulse 60-75.  Tonight it was 116/86 pulse 74 & 119/82 pulse 69.<br>Zara's coughing reduced to a very minor issue.<br>~12:15am: Zam continues to get worse sour stomach feelings, I take one extra strength tums and this helps within a couple minutes.  <br>Somewhere in this time period Zara reports that she is through the peak & coming up phase and has settled into the more pleasant effects.  Zam is still in the peak, but coming up is mostly over, muscle buzzing has settled in and general disquiet is over.<br>12:35: Princess Bride over.  More BP measurements.  Zam 147/87 p 73 & 138/79 p 73, Zara 96/68 p 62, 101/70 p 71.  Zam's BP still quite high, not worrisome at all, but quite noticeable.  Zara's BP is a little high but pulse is on the low side of normal.<br>At this point we re-evaluate the level of effects.  There are distinct but mild visuals, slow shifting and a little patterning.  Looking at the movie it was hard to tell if something was standing still. Continued 'body noise', muscle tension and buzzing, but not bad.  Small, pleasant starring around lights. We have tea candles lit around the edges of the room.<br>2:00am : Zara bp 93/64 p 63<br>3am: Zam 164/90 p 80, 153/85 p 96, 149/75 p 83.  Still quite high, still not worried about it, but definitely this is very much on the high side considering my normal resting bp is so low.  <br>Zara 104/75 p 61, 94/65 p 58.  Slightly high normal bp.  Zara appears to have come down somewhat faster than Zam.  Residual jaw tension still quite present.<br>4am: still going, definitely down significantly from the main plateau but not completely. Cook dinner / snack of a light japanese broth with fresh mushrooms and green onions.  Follow up with Cookies and soymilk as Crouching Tiger ends.<br>5:30am: 1mg xanax for Zam, .5mg xanax for Zara.  Asleep before 6:30am.  I am pretty sure I would not have gotten to sleep without the xanax.  Zara would probably have been fine, but the effects were not fully subsided.<br>T+3 days (as I write this): Zam BP: 124/54 p 56 & 128/64 p 54 - Zara 84/57 p 63 & 92/58 p 61<br>Those are all the notes I have from the evening, but after the Princess Bride got over, we spent a long time talking about the world, the net, drug information websites, terrorist attacks, with a generally upbeat tone.  The conversation was lively and we drank a little over half the bottle of a mediocre-minus pinot through the evening.  After a while (perhaps half an hour) we decided to throw in another movie as a way to stimulate further conversation.  <br>I put in 2001, a movie I hadnt seen in over 10 years and had only vague memories of.  The pace was slow, but tolerable, but one distracting element is that the DVD recording quality on the version we watched was awful.  Something I learned is that not all DVD's are encoded the same and one has to be careful with these things that you get the Right Version otherwise you're stuck looking at really ugly digitization errors and jpeg-ing artifacts.  The black space with sunlight coming through it in the movie looked like a bad web image with jagged bands around dark objects or light objects on dark fields.  Yuck.  The 2C-I made it initially difficult to determine if it was a strange visual effect or if it was actually on the screen (which was initially hard to believe).  After some experimentation it was clear that it was actually the movie. I later read a review that said that this (the first) release of 2001 on DVD was 'horrible' and 'must be avoided'.  Oh well.<br>As we headed into the part of the story with HAL, we decided to save the more difficult part for some other time and then watched Crouching Tigger instead.  Throughout both movies the 2C-I definitely provided a long, generous platform of mental stimulation that added to my mood and made the movies and conversation more fun.  I felt mildly intoxicated, not super 'clear' throughout the experience, but associations ran more freely and I felt like my language and communication centers were opened up a little.<br>The overall effects level was pleasant and in the low end of medium for me: visuals starting but not really overwhelming anything, mental shifts but not huge ones, could act straight if required, wouldn't want to drive (but could).  Probably equivalent of 2 good beers for me that had a 5 hour plateau.  <br>I really quite enjoyed the effects, as I have 2C-B.  I've done more 2C-B than any other psychedelic-class psychoactive and this 2C-I definitely was difficult to tell apart from the 2C-B that I've had before except that it seemed distinctly longer.  Normally with 2C-B at T+4 hours I'm noticing the plateau waning.  With this experience, the plateau started between 90 and 120 minutes and lasted to T+5.5 or so, so thats about a solid 3 hour plateau and then a couple hour ramp down to T+7 or so.  A single experience is certainly far from enough to make reliable generalizations, but this seems longer than my previous 2C-B experiences unless I redose.  \rThe Day After: I slept quite a long time after going to sleep late, but my recent normal sleep schedule has been 4am to sleep, wake up 11am or so.  We slept til late afternoon, then got up and did a little work and played some computer games.  We watched the rest of 2001 (god what an awful and disjointed end, did they lose some footage?), had a hearty dinner of brown rice and stir fry, watched some tv and went to bed early (1am or so).  Generally felt drained, but not in a bad way, and tired.  Little to no motivation.  Had a little wine before bed.  In a positive, but tired, mood.\r2 Days After: I woke up after a normal sleeping period and found myself feeling well rested and recharged.\n\n\n"
}
