{
 "title": "Alien Waketime",
 "author": "abacis",
 "citation": "   abacis. \"Alien Waketime: experience with DPT (ID 102118)\". Erowid.org. Dec 22, 2013. erowid.org/exp/102118",
 "substance": "DPT",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "4-AcO-DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 102118",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Dec 22, 2013",
   "Views: 433",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy friend ordered a less known tryptamine off the internet via a research chemical website. The chemical name for it is N,N-Dipropyltryptamine, or DPT. I was familiar with a few psychedelics at the time, and had tried 4-aco-DMT before, which I figured would be quite similar. I was an avid cannibis smoker as well so I figured maybe I knew something about something. *Laughs*\r\nAlright boys and girls there's only one place to start with this story and its from the beginning.\r\n-Night time in a small room in the suburbs-\r\nI sat down at my desk and pulled open the drawer. Hidden under rubbish was the light, the connection, the powder. I pulled it out and opened the bag. It smelled pretty strange. Out of a journal a page was ripped, and then put on the desk. DPT followed on waves into the shore of white across the dried plant sheet. On the page was now 75 mg DPT, which was a guess because I didn't have a scale to measure it properly.[Erowid Note: Two samples of powder (even of the same chemical) with equivalent volumes won't necessarily weigh the same. For this reason, eyeballing is an inaccurate and potentially dangerous method of measuring, particularly for substances that are active in very small amounts. See related article]I wouldn't recommend this, its potent stuff. I took out a straw and insufflated the strange powder.\r\nWow. What a burn. I drank about two giant glasses of green tea and landed myself on my leather couch. I felt myself sinking into something. It comes on fairly fast. I haven't done DMT yet but I would say based on my research and listening to McKenna that this is quite a different venture. Now my sense of time was quite off but I would say I could feel myself coming up after about a minute or two. My body slowly came up with this extremely euphoric feeling, something so elated and free that I had never experienced and haven't experienced again since. If saying cloud 9 was ever appropriate that truly would fit it. After some moments, time wasn't an observable pattern at this point, I started to feel my mind completely and utterly altered. I could feel the waveforms all around me flowing through me, and I felt as If, while still in my body, I was sinking into some sort of weird hyperspace, but while still half existing in this dimension. My eyes were closed for some time just feeling this honestly indescribable feeling, and then I opened them. This is when things truly got strange. I was sitting almost completely in the dark, except for the street lamp emitting a barely visible light spectrum through my window. Sitting in the chair in front of me a figure began to illuminate, starting from its head down not quite to its chin, like a strange light shadow casted over something. It was staring right at me, not the me I always think I am, the real me, my real self. At this point my ego shell had been slowly stripping away until I was completely naked, but it wasn't an uncomfortable naked, it was like taking off dirty rotten rags that I had been wearing since my induction into society.\r\nIt was like being a newborn baby in the sense that one doesn't understand the reflections that others project onto them to give them their refracted perception of their self. I was pure soul. And this being could see right into me. But I wasn't scared. I was amazed and speechless. I can tell you what it looked like. Giant elongated, domehead, with huge pitch black eyes. Gray skin. The color of dirty snow. And just like that I can't recall. A moment passes and I recall sitting and just listening, in the complete silence, to a ex- and post-worldly symphony of vibrations. Zoom and zaps and zips and all the music my creative god-self could conjure, anything, everything, its all inside, I just didn't know it yet. It hits you hard. Without the movement of a finger I can create almost anything, and its so beautiful. But at that point I know its not really just 'me', words can only paint a picture around the reality of the situation. Experience is real. Believing is now seeing.\r\nAs I said perception of time went out the window, so my next memory frame is this:\r\nAs I laid on my couch I felt the biggest surge of sexual energy I have ever felt. It was like all the hidden energy around me was tunneling into my Sacral Chakra. I felt like I was on fire with emotion and energy. Then two fairies came to me and started caressing me. The rest I will leave to your imagination.\r\nNext frame:\r\nI am now in my garage, smoking a cigarette. I am at a supraconsciousness level and my senses are also the most heightened they have ever been. I am not exaggerating any of this. If anything this is all an understatement. Wow. Smoking the cigarette was so bizarre and it felt like such an abstract thing to do. I could smell and taste every particle and the smoke made strange intricacies and fractals. Then the voices came. The only thing I can really say is that It was like the was a meeting inside my head of people who weren't exactly me, but were part of me at the same time, or rather I was a part of them. It was like alternate reality versions of myself, or like multiple spirit guides. A few of them were saying things like 'This one...This one...This one's going to change things. Don't you think?' and then only one of them was saying something like 'Oh, I don't know...'. Then a few were saying 'this one will do great things.' and then in solitude again was the voice of doubt, until it stopped saying anything and was convinced my soul was capable of something unique to my situation.\r\nThe overall experience I would say lasted a few hours but I'm not exactly sure. Time warps when you're there. But you're still here. I would say it was one of the most mind-manifesting experiences of this natural life. I wasn't quite the same afterwards, although I have slipped back into my ego patterns I know where I kind find something special in my mind, and in my self.\n\n\n"
}
