{
 "title": "Unusually Long Buzz",
 "author": "The Dude",
 "citation": "   The Dude. \"Unusually Long Buzz: experience with Nutmeg (ID 10223)\". Erowid.org. Nov 30, 2001. erowid.org/exp/10223",
 "substance": "Nutmeg",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10223",
   "Male",
   " ",
   "Not Given",
   "Nov 30, 2001",
   "Views: 8294",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is an account of two experiences, one being uneventful, and the other being successful. This story is kinda long, so bear with me (I don't like to leave out details).</p><p>Being without cannabis for a while, I searched the internet for easily obtainable highs. I decided to pick nutmeg, so I bought a small can of whole nutmegs at a grocery store. By my calculations, it was equal to about three doses. I was eagerly anticipating my nutmeg experience and tried it later that night.</p><p>I broke up the whole nutmegs into much smaller chunks (small enough so that it was slightly uncomfortable to swallow with water), then started ingesting it. Believe me, this stuff is VERY nasty. I have a strong stomach, and after eating about two whole nutmegs (average dose is about 5), I couldn't take any more without puking my guts out. So, I chalked it off as a failed attempt and threw out the rest of the putrid spice.</p><p>About a week or two later, still no cannabis in sight, I decided to give nutmeg one last chance. I have read that people have an easier time ingesting ground nutmeg than whole nutmeg, so I broke down and got some. Same brand, same store, except ground this time. Went home, put the whole can into a small cereal bowl, and proceeded to eat it, teaspoon at a time, each with a mouthful of pop.</p><p>This was quite better, although still nowhere near delicious, but I could handle it. I gagged a few times but held back. I went through a half a can, when I stopped and watched Stir of Echoes. While watching the movie, there were parts where I thought the nutmeg was taking effect, but now I'm pretty sure it was just the movie. At this point (approx. 1 1/2 hrs. after eating the nutmeg), I was getting frustrated that it wasn't working, so I became even more desperate.</p><p>I have heard several accounts of people smoking nutmeg and getting effects, but it's very hard to burn. So I grabbed some Everclear, and poured equal parts of the alcohol and nutmeg into the bowl, then lit it. I let it flame for a couple minutes then put it out. I then proceeded to inhale the vapors over the course of maybe ten minutes. I guess you could say I was smoking a bowl in the most literal sense ;). But there were no additional effects from that, so I decided to throw all the shit away and call it a night.</p><p>I woke up the next day feeling fine, and I thought to myself, 'Never again, nutmeg.' About 4 hours after I woke up I was watching tv when it happened - I suddenly realized I was stoned, much like on cannabis, except that this wouldn't end. Everything on tv was strange and hard to focus on. I didn't have to work that day, but I got in trouble with my mom over things unrelated to the nutmeg, but I was too fucked up to talk to her.</p><p>I tried my best to avoid my parents all night. When I woke up the next day, my stoned feeling was still there! I had to work that day, but I figured it would wear off by then (3rd shift 10-6). I was wrong. It stayed with me almost all the way through the end of my shift. A buzz lasting more than 36 hours!</p><p>In retrospect, I figure it was worth it just to feel what it's like, but I'll never do it again. I have never read any reports where the effects of nutmeg remain dormant for 12 hours, then they hit and linger for another 36. Possibly it has something to do with the alcohol mixed with nutmeg and being smoked, but I don't know. Maybe someone could shed some light on this?</p>"
}
