{
 "title": "Morphine Sulfate vs. Morphine HCl",
 "author": "desox",
 "citation": "   desox. \"Morphine Sulfate vs. Morphine HCl: experience with Morphine (ID 10234)\". Erowid.org. Oct 27, 2001. erowid.org/exp/10234",
 "substance": "Morphine",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "insufflated",
   "Morphine",
   "(powder / crystals)",
   "  T+ 2:30",
   "10 mg",
   "insufflated",
   "Morphine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10234",
   "Male",
   " ",
   "Not Given",
   "Oct 27, 2001",
   "Views: 149922",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAfter my experiences with snorting crushed up morphine sulfate pills, which were quite disappointing, I asked a friend why nothing really had happened. He told me snorting sulfate salts doesn't work well, since sulfates aren't that good water-soluble and I should change the morphine sulfate to morphine hcl, which is suitable for snorting.</p><p>[edit: I checked that solubility matter and it turned out that morphine sulfate is even better soluble in water than the hydrochloride... So to be honest, I have no clue why the crushed pills did barely anything good. Lately I tried them again and they worked just as fine as the hcl.]</p><p>I did so and ended up with about 300mg of pure morphine hcl powder. I divided the powder in 15 parts, 20mg each and snorted one of those little bumps. First thing I felt was a burning sensation in my nose, worse than that you get from meth. I was waiting for the effects to begin, but nothing really happened and I was getting disappointed, but then suddenly after 10mins the effects started to kick in.</p><p>This gave me a really nice feeling, that typical opiate high. You get relaxed, a little bit euphoric and don't care about nothing. I just sat down, read some magazines, listened to music and watched TV. I snorted the first bump at about 8pm and at 10:30pm I decided to do another little bump to intensify the feelings. I devided one of the 20mg bumps in two and snorted that. This time there were absolutely no pain, I wonder why? :) I continued reading, listening to music and watching TV for a few hours until 3am. Then I went to bed, had that dreamlike state I use to get when trying to sleep on opiates and finally felt asleep at 5am.</p><p>The conclusion is, that when you come across some morphine pills, which all are morphine sf, extract the morphine, change it to the HCl salt and snort it. Eating is a terrible waste (I need 80mg oral, but only 30mg nasal) so if you're not into IV'ing snort it.</p><p>Extraction is easy:</p><p>1) Dissolve crushed pills in water</p><p>2) _Slowly_ add _little_ drops of an NaOH solution until the water reaches pH 9. Be sure not to add too much, because then the extraction fails and nothing happens.</p><p>3) At pH 9 crystals should fall off, forming a clowd in the water. Put the glass in the freezer for about 10mins and filter out the crystals after that.</p><p>What you now have is pure morphine freebase. Changing to HCl salt is easy, too:</p><p>1) Dissolve in anhydrous (99%) alcohol.</p><p>2) Add 1ml of HCl and shake.</p><p>3) Let the alcohol evaporate (do NOT boil!) and you'll have some nice morphine hcl crystals.</p><p>4) Have fun.</p>"
}
