{
 "title": "Pounding Heart",
 "author": "Dash",
 "citation": "   Dash. \"Pounding Heart: experience with Levmetafetamine, Cannabis, St John's Wort, & Other Herbs (ID 10283)\". Erowid.org. Dec 15, 2003. erowid.org/exp/10283",
 "substance": "Levmetafetamine, Cannabis, St John's Wort, & Other Herbs",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2 hits",
   "inhaled",
   "Levmetamfetamine",
   " ",
   " ",
   "400 mg",
   "oral",
   "Pharms - Ibuprofen",
   " ",
   " ",
   "300 mg",
   "oral",
   "St. John's Wort",
   " ",
   " ",
   "135 mg",
   "oral",
   "Kava",
   " ",
   " ",
   "  ",
   "oral",
   "Valerian",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10283",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2003",
   "Views: 19811",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Around 10:30, set up to smoke some weed. Took 400mg ibuprofen, and a bunch of herbs in capsule format (300mg St. John's Wort, 135mg Kava Kava, 2 Inhalations Levmetafetamine, 75mg Echinacea, Golden Seal, Valerian). Smoked 2 bowls, and immediately my heart started going nuts. Now I'm pretty much a veteran smoker, and I know your heartbeat raises, but this time it was scary as hell and felt like a heart attack. My limbs grew numb, as well as my head, I was overwhelmed with the sensations in my chest. They weren't so violent persay, as they were annoying and uncomfortable, my heart was pounding non-stop. I panicked, but I generally kept my cool, I took a quick shower, took my temperature (98.7). I had intense pain for over 2 hours. After that it trailed off. I was too upset with the pain to even notice a high. I took an aspirin an hour through and my heart felt slightly better. My heartbeat was irregular and somewhat strong and weak at times averaging 90bpm. </p><p>I really don't know what specifically caused this, but I'd precaution one against combining too many different substances such as like I did, my body just could not take the amount and interaction of chemicals inside me. I had an intense feeling that I was going to die, I was edgy, unable to move much, my body shaking and shivering violently. I meditated and lit a candle as the aspirin took its course, and I was able to calm myself to a certain degree. After the high of weed passed by, I felt better and was able to go to sleep without fear of dying in my sleep. I don't know how hurt I am at this point, but I am visiting the doctor's today. I have been noticing over the past few weeks that my heart feels a lot different when I get high now than it used to, I feel it more and it hurts more. I don't know whether this is a result to other drugs I've taken (MDMA, shrooms, painkillers, opium, adderall, other anti-depressants) But I'm not taking the chance. </p><p>I really don't know what to make of this situation, all that I know is I'm happy I'm alive and that I didn't have a heart attack. Don't swallow too many things in one night. And if you start having severe heart problems on something simple like Weed, advil, and herbs, just try and relax and let it pass naturally, and see a doctor the next day. I could have busted myself and asked to go to the hospital, but I'm here right now and I am feeling better.</p>"
}
