{
 "title": "Existence Lost",
 "author": "SoulRebel",
 "citation": "   SoulRebel. \"Existence Lost: experience with Mushrooms (ID 10299)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10299",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10299",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 15, 2005",
   "Views: 3125",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My best friend and I were itching to try something new. Friends told us of amazing experiences on shrooms so it seemed perfect. We had the perfect opportunity. The UCLA Reggae festival was coming up and it seemed like the perfect atmosphere for our first time. I was told the shrooms I got (white caps) weren't that strong and were a little bit old, so they wouldn't do much. I was prepared to just get a tasteI was very mistaken.</p><p>We arrived at the festival early with about 5 friends. We set up our blanket and went to buy a smoothie to mix the shrooms in. Sarah and I were both completely relaxed and oddly enough not nervous whatsoever (partly because we didn't really expect them to work). We smoked about 2 joints of shwag hoping it would help it kick in. Sarah and I decided to take a trip to the bathroom about 20 minutes later and that's when it started to creep in. At first I thought it was just the effects of the bud, but it was different. As my friend was in the bathroom I found myself clutching the rail fearing I would fall. Without her I started to panic. People stared at me and I couldn't figure out why. When she finally emerged I ran to her and hugged her. She was the most comforting thing I could possibly imagine. We sat on the grass and laughed more than I think I've ever laughed before, when I realized that I couldn't get up. My legs just didn't want to work. I was grabbing her face and her glasses, untying her shoes telling her that I was my true self and that I was dead. </p><p>I began to feel lost. Everything appeared to be like an edited film. My voice seemed to be coming from a different direction. We turned to see this man coming from the distance of the bright blue and green grass and sky. He offered us sage for our journey and walked away. I looked at him like he was a godmy guru.</p><p>We decided that we should stand up and go back to our friends. We slowly got up on feeble legs, but as we walked back I felt my body melting and my head dizzy. I grabbed her as I fell and collapsed on the grass. I slowly came to, hearing 2 girls ask my friend what we were on. She couldn't communicate to them. This girl held my head in her lap stroking my head. When I opened my eyes who was this creature in glasseseerily comforting. They sent my friend off to get bananas, but she never returned. Then I started to cry for all that was there. I couldn't understand who I was or that I actually existed. I could recall my family and friends only as distant memories. I couldn't comprehend that other people existed. </p><p>From the corner of my eye I looked to see Dustin (another friend) running towards me. He tried getting me up, but I refused. I felt like my limbs were melting off my body. I then heard a voice telling the people that were with me that if I didn't get up they would call the paramedics. Sheer panic came over me and I held the girl stranger crying to her thinking how stupid I was. Dustin forced me to my feet and walked me back to the blanket. I then collapsed onto the blanket where I lay for about 4 hours tripping beyond imagination. I could feel and here the reggae drums and bass. Muffled at the same time echoing in my brain. The grass was so bright and the blades began growing over my hand. The little patch of grass that my hand laid upon seemed to be an evergrowing jungle. The trees were swirling oil paintings. </p><p>When my best friend finally returned, I grew happy once again. We reverted back to little girls. Rubbing food all over each other and poring water on our heads. She tried to show me Escher paintings but I couldn't look, they were too much. After she left once again, I began to feel like I was going crazy and that I would never be normal again. I couldn't even imagine seeing my parents that night. It didn't make sense. It didn't make sense that they had control over me, that my existence was solely based on their existence. I could not comprehend that I had to go to school the next day. That I belonged to a structure for a goal that seems pointless. It felt like that it was only a pretend reality and that I was in the rue world. I saw life for what it was. It didn't make sense how beautiful everything washow bright everything was. I was dead. </p><p>When I finally came downalthough I had the biggest headache I've ever had, I danced. I felt at peace with everyoneconnected. Sublimely happy. The experience change my view on everything. The world is too beautiful to waste. Freedom is true and realwe just have to find it.</p>"
}
