{
 "title": "Psychedelic Personal Revelation",
 "author": "Peter",
 "citation": "   Peter. \"Psychedelic Personal Revelation: experience with Nutmeg (ID 10312)\". Erowid.org. Jun 17, 2006. erowid.org/exp/10312",
 "substance": "Nutmeg",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 10312",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 17, 2006",
   "Views: 20443",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>How befitting that one of the most profound and emotionally intense discoveries of self I have experienced started one innocent morning with a condiment normally associated with apples and custard. The prompt which nutmeg had posed upon me was something which has affected me deeply unto this day, and helped me form a philosophy in my life which I like to follow still now, nearly a year from the experience. I'd like to emphasize the effects I had were quite long-lasting from the intoxication from the drug, and this allowed me to form said philosophy. People often can't think in a focused manner because they take way too high a dose and become distressed with the adverse effects, distracting them from the enjoyment which this drug can produce.</p><p>It started one morning, a week before Christmas 2000. I was at home with my girlfriend (I'll refer to her as A from now on), and no-one else was around at that time. I had the next ten days away from work, which throughout the year had exhausted me, so the time off was a blessing I wasn't going to waste.</p><p>I prepared a crude decoction from twenty ground nuts, and we both had half of this each. And yes, as all other reports say, the taste was that of reproach. </p><p>Two hours later, the effects began. My limbs felt heavy, like a small dose of valium or something, I was quite dry and I just wanted to chill out. So A & myself went upstairs to my bedroom & just sat for awhile. I was in a recliner & A was on a sofa, with 'Dark Side of The Moon' playing. I found myself disappearing into thought before too long.</p><p>I'd worked myself into quite an emotionally dark place, full of the pains and stresses I'd just hidden away throughout the year, some throughout my life. This time looking upon them, however was a completely reversed scenario. Instead of evasion, I chose to embrace them, feel their every part and controlled deal with each in their separate ways. With each problem I encountered, I could feel its nature throughout my fingertips, my heart chakra felt cold and my head felt shaky. With each solution, came the alleviation of this. Warmth and life was slowly returning to that once cold and dead part of my psyche, and I could feel all the good parts of my personality which I'd lost upon taking the burden of these problems. </p><p>I felt so happy that I'd accomplished what I had, tears started rolling down my cheeks. A immediately noticed, with her usual kind, empathetic words and all I could do was look at her. I hugged her as tightly as I could, my head nestled between her bosom, smelling the Chanel perfume I'd bought for our anniversary. I finally managed to muster up speech from the voice box which was lumpy from tears. I'd come to realize that I'd done a bad thing - I'd failed to recognize the love she'd given me and patience she'd spared through the stressful job and miserable home life. All I could say was 'I love you so much.', and then 'Thanks for being so patient'.</p><p>A lightbulb lit above my head, after another half-hour of hugging & kissing (strange - really with nutmeg breath!). And what an idea I'd had! As if from nowhere, a little baggie of our good green friend appeared from nowhere, and a bulging, carrot shaped spliff was in order.</p><p>That made all the difference - the nagging heaviness and nausea dissipated immediately, and of course the obligatory breaking in of a new drug with carnality came to mind. Oh and what an experience that was!</p><p>I calculated an optimal dosage at 80 - 110mg of nutmeg per pound of body mass. So for me that's roughly 13 to 17.5 grams.</p><p>Peace to you all.</p>"
}
