{
 "title": "The Lessons of the Plant",
 "author": "Spencer",
 "citation": "Citation:   Spencer. \"The Lessons of the Plant: experience with Cannabis (ID 10321)\". Erowid.org. Aug 16, 2004. erowid.org/exp/10321",
 "substance": "Cannabis",
 "bodyweight": "177 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 bowls",
   "smoked",
   "Cannabis",
   "  T+ 0:10",
   "2 bowls",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10321",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2004",
   "Views: 6562",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt all started out one night at my friends house, and we didn't have anything to smoke out of, other than an aluminum can.  After looking for something for about 5-10 minutes, we gave up and used the can.\r\nWe went outside to the cool Alaskan air, with the sun setting in the background... It was very peaceful.  We sat down on a love seat type swinging bench.  I remember birds singing a wonderful song.\r\nWith the tone set right, we loaded our dangerous aluminum can pipe.  I was filled with anticipation, for as previously stated, I had not smoked in some time.\r\nAfter my friend took the first hit, it was my turn to have the plant give me its lessons.  I watched the scented leaves burn away into innocent coals, as I inhaled the powerful fumes.  It went down kind of rough, and I caughed a bit, but it wasn't TOO bad (this was my 8th time doing it - Although i hadn't done it for 2 weeks before this time).  Anyway, we went back inside after we both had 3 bowls... then in about 10 minutes without feeling any significant effects, we went back and smoked 2 more each.  This last bowl literally PUSHED me over the edge.\r\nAs we went back inside, my reactions were delayed and I had very little depth perception... Things were normal so far.  I started to feel tired, like I needed to close my eyes.  Without questioning my body, I leaned up against a cabinet, and briefly closed my eyes.  What happened next is the most wonderful thing I have ever experienced.\r\nI felt as if I was blacking out (like blood was rushing to my head), and I couldn't open my eyelids for about 3 seconds.  When I did, I was in the world of the plant.  It showed my things that I did not know were possible.\r\nI don't know how, but I was definately experiencing visual hallucinations, even though Cannabis is not a hallucinogen.  The only thing I can come up with is that it was probably laced with something.\r\n[Erowid Note: Cannabis can and does cause visuals (mostly closed eye) and other perceptual distortions in some users, usually at higher doses.  It is sometimes grouped with psychedelics/hallucinogens because of both the perceptual effects and its effects on ideation and contemplation.  Cannabis is rarely laced with other drugs and the effects described are all possible for cannabis-alone.]\r\nIt was like everything was choppy, I was seeing my life go by in 5 frames per second.  My body tingled to the touch, as if my entire body had fallen asleep (like when your foot falls alseep).  I had no recollection of time, nor of what I was doing.  It was unlike any trip I had ever experienced.  This was about 20 minutes after taking the initial hit.\r\nI enjoyed moving in rythms.  Doing patterns while walking, like rubbing my hands in synchronous circles, in rythm with my walking.  Or when I was eating, the rythm in my jaw moving up and down, and rubbing my arms in synch with the jaw.  I can't explain it, but rythm felt so good.  Not only that, but the touching my arms and legs in beat with something else doubled because of the unexplainable tingling that my entire body felt.  I know this sounds wierd, it's just nearly impossible to explain.\r\nAbout 30 minutes after the initial hit, we sat down and watched a movie, and I noticed HUGE audio hallucinations.  I would start hearing the TV behind me, and I kept thinking my friends parents came home.  I heard talking and footsteps behind me as well (probably interpretations my mind made up, from the TV).  I remember that I was INCREDIBLY paranoid about being caught.  Every minute or so I would say 'I think your parents are home, lets go to your room,' when in fact they weren't there.\r\nThis visual choppieness remained for about 2 hours (what seemed like an eternity), which started to scare me, because I just didn't expect it to last that long.  I also remember that I was extremely scared to go home because I didn't want to encounter my parents.  I wasn't sure of how I would look to someone who wasn't under the influence of any drugs... I kept thinking it was totally obvious that I was high, but in reality I was probably acting psuedo-normal.\r\nAnyway, after watching TV, I gained up my confidence and made the journey home (about 2 hours after the initial hit).  Things were starting to wear off, but I was definately still dazed.  As I walked home, I kept nervously looking into the woods for moose (a problem up here in Alaska), more than I usually do.  As I reached my driveway with relief, I remembered that I wanted to avoid my parents.  Luckily, my dad wasn't home and my mom was in the shower, so I didn't encounter any problems.  However, when I was walking up my driveway, I THOUGHT that I was halucinating sparkles everywhere... But then I realized it was my porch lights glistening on the snow.  That's one thing that I thought was odd, my mind interpretted the sparkles as halucinations, then about half way up my driveway I realized they were actually there.  Everything works slowly when you have Cannabis in you.\r\nAnother thing that I noticed is that it was nearly impossible to keep a thought going, it was as if I had NO short term memory.  I even tried to play games with myself... I would tell myself 'be sure to pick up those pliers after getting a drink.' So I went to get a drink, thinking about picking up the pliers, then on the way back to my room, I totally walked by them and got in bed.  Only a few minutes later did I realize what had happened... However, this short term memory loss was on the ladder side of the effects (about 2.5 hours after initial hit).  It was a bit odd...\r\nI have to say that this was one of the most interesting and enjoyable experiences with this plant that I have ever had.  I was utterly astonished with the effects.  I have tried to replicate this 'choppieness' with no success.  However, I have talked to some other people and they said they too have experienced this before, but only once or twice.  They said it was like reaching the 'highest high' and that I was very lucky to have experienced it.\r\nIn conclusion, I would like to say that this session has given me a lot more respect for the plant, and its vast power.\n\n\n"
}