{
 "title": "Too Much Ecstasy Has a Lasting Effect",
 "author": "wild magic",
 "citation": "   wild magic. \"Too Much Ecstasy Has a Lasting Effect: experience with Ecstasy (ID 10332)\". Erowid.org. Jan 13, 2002. erowid.org/exp/10332",
 "substance": "Ecstasy",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10332",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 13, 2002",
   "Views: 56099",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is not so much the story of a trip but of the REALLY nasty aftereffects. I decided to send it to you because I cannot seem to find any similar experiences on this site.</p><p>My boyfriend and I decided it would be a good idea to 'stock up' on E, since it is often hard to find here. We bought 50 pills, which were intended to last us 6 months or more. Unfortunately, we have no willpower and between the two of us we had finished it all within a week. I took more than he did; I can't remember the exact number of pills that I personally took each day, but I took at least 30 over the week, and possibly more.</p><p>It was a total waste. The first day was WONDERFUL- one of the best 'rolls' I ever had. The second day, we took about 7 each and not much happened. We skipped a day...the fourth day we took about 5 each and it was okay, but nothing special. We skipped a day and had a decent trip on the sixth day. On the seventh day we had 9 pills left and were planning to wait at least a couple of weeks before doing them. But I was surfing around online and discovered the idea of 'booty bumping' (rectal ingestion) and just HAD to try it. That trip was not great either...the only effect was to temporarily lift the apathy and semi-sickness for the evening.</p><p>Both of us felt TOTALLY shitty for more than a week after that. To me, it felt very much like motion sickness- I was constantly nauseated, and also had a frequent feeling that was sort of like an unpleasant, throbbing, but non-painful head rush. Usually on my past experiences with E, a small amount of marijuana would cure this problem- but this time, pot made it WORSE.</p><p>It was REALLY bad for three days- I could hardly get out of bed. I was able to function on the fourth day but still felt 'rushy', nauseated, apathetic, and STUPID. I hate to use the term 'stupid'- but I had trouble completing tasks I do every day because my short-term memory was so wrecked. </p><p>Also, there were the nightmares. They persisted for about two weeks in my case. They started the night after we ran out of E.  That night I had three nightmares which were severe enough for me to wake screaming. The next night I had four- the only one I remember was so vivid that I feel dread just thinking about it now. Strangely, it was a dream that I had been arrested with a large amount of E and charged with intent to distribute (even though I have never, and will never, deal drugs of any kind). I could even feel the handcuffs on my wrists in the dream, and woke up with both my arms 'asleep' (tingling) as though I had really been handcuffed. Once I woke I laid in bed for over an hour, crying with relief, because I had been SO certain that the dream was real. I had terrible, vivid dreams at least once a night for about two weeks. I am STILL having nightmares much more frequently than usual- I used to have one or two a year, and now I have at least one a week. </p><p>I'm not sure if I am really even back to normal now. It's been a few weeks, and I have been depressed and lacked appetite since then. I also still feel as though my head were full of cobwebs. I wonder if I will ever be the same again.</p><p>As a result of this episode my boyfriend and I have totally stopped using any kind of drugs. We were formerly 'casual' users, using E about once every two months and hash about once a week. But it just does not seem fun any more after this experience.</p>"
}
