{
 "title": "What or Is This Real?",
 "author": "Name",
 "citation": "   Name. \"What or Is This Real?: experience with Mushrooms & Cannabis (ID 10339)\". Erowid.org. Dec 13, 2006. erowid.org/exp/10339",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "100 kg",
 "header": [
  [
   "DOSE:",
   "5 caps",
   "oral",
   "Mushrooms",
   "(fresh)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10339",
   "Male",
   " ",
   "Not Given",
   "Dec 13, 2006",
   "Views: 2894",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Okay, the house is mine, the parents are away somewhere, so me and a friend on a monday nite decided that we should take advantage of the sanctity of a house to trip. Mindset umm end of the mushie season, so unfortunately a tinge of sadness pertaining to the thought, 'these mushies could be our last for the year'. </p><p>My friend has seen me lose the conscious connection to my identity once before on mushies, so he is somewhat reserved about the dosage we (or I) will consume (it is not advisable to have any amount close to thirty largish mushies!!!) So bearing my previous history and that we only had found a dozen or so mushies, there was a concensus that we'd trip but probably not that hardcore, which is good. Side-track: I luv the search for the mushies in the field, its like finding ten dollars on the ground, or your lost wallet, I reckon the search is half the fun.</p><p>Blah, blah, so anyway, mushies for this occasion had been previously prepared. As normal, we drank the mushie juice in a strong surgary coffee (0hrs). Nothing unusual what is taste anyway, in a matter of minutes the slight delay echo of sound becomes minutely noticable, also my awareness of the intensity of colours increases, my eyes feel more sharper/in focus. So to increasing is the stomach/intestine grumbling, slightly nauseating, but hey nothing I haven't experienced before.</p><p>(T+30) Life is good, the feeling I associate with mushies is returning and growing as I expect. I'm grinning almost mechanically (I've been told I sometimes look like a frog on mushies!), the electrical rushes that fizz and pop up and out extending my feeling in my skin starts, its most noticeable around the back/shoulders region. Thought here is rapid and sense orientated, need fluid, and entertainment, videos, playstation, music. Wow, the music listened to was Ether by the Necks, amazing, the band is three dudes, a drummer, a double bass player, and a pianist, right and their concept is improvised songs that go for an hour, the music was good for tripping out and caused my to lose sense of time.</p><p>So my memory of time (and memory in general) after about an hour becomes somewhat distorted. Effects increasing, yeah, my ability to judge distances is going, things are either bigger or smaller than how I would normally perceive them. OK, outside, my cigarette, friend bong, the leaves of the palm trees, and any plant is moving. I was now getting the big sighs or yawns. For me, when this happens and someone is talking to me, when I breathe in their voice slows down to an inaudible tone, and then speeds back up to normal on exhalation, also with the sighs the rushes intensify as do the mental visual imagery.</p><p>For arguments sake lets say at T+1:30, I don't know, I closed my eyes, and whatever image I had last seen would fragment into the same image but in another colour, overlapping one another until the image would be whatever my imagination went to. Me personally, well I'm quite happy to drift in that visual fast colour pattern image time, but I had company so I had to keep my eyes open.</p><p>Had a chuff on a bong at some stage while I was near the pool outside, bear in mind I've drastically reduced my intake of pot over a number of years to virtually nothin. So now, my neck is wanting drope down onto my chest, with eyes closed, the intense detailed everchanging patterns of light start now, you've got to wonder how these images appear (someone told me mushies let you see the patterns of the cells on your eyes). Anyway, so fantasy like images, I see images but they constantly morph. For example I see bird flying then I see its wings microscopic up close which actually turns out to be a flies eyes and then the earth, and back forth distance seeing to microscopic seeing of anything I've ever seen and even things I've possibly never seen before.</p><p>Whoa I want to move back inside, to the warmth and safetly of my house, feeling somewhat wicked, but a bit parnoid nonetheless. Right, every movement is a chore, plus must entertain friend. Friend made decision to put video on, me I wanted to watch a doco on wasson, but anyway, from here it becomes confusing.</p><p>Words can be so inadequate, but bear with me as my vocabulary or ability to articulate what happened becomes bloody hard...at some stage sitting in my family room armchair, I've urinated on myself, thus in hindsight I can recognise that pathways in a normal state in my brain are not being accessed. Right so with eyes closed, and the rapid imagery of galaxies and microscopic cells, I felt a distancing or a shutdown of the frontal regions of my brain, with this I sensed that the personality components of whole physical life were lesser.</p><p>Thought was now coming from a region somewhere in the direct middle of my head. This thought felt like an awakening of this essence, I for lack of a better term, define as a soul. The person I knew in the physical realm was just a pawn for this soul. As you can imagine,  my perception of my soul awakening felt really really fukin good, I felt how old I was, millions and billions of years. </p><p>Furthermore I felt another awakeing, this time it was my soul that became aware of reality that it is god, and that god is present in everything. Hardly revoluntionary, but hey it felt beyond good to have this perception. Then I (me, soul, god?) had the ability to morphe into lifeforms. I was a universe the size of a speck of dust, etc, or possibilities seemed to happen. So, as a fully conscious god I remembered my age and how to control time (uhuh, I swear these my recollections untainted), I lived entire solar systems, galaxies in seconds, and seconds in almost unbearable eternitys.</p><p>Now after re-exploring the consciousness to create, stabilize and destroy, I felt I'd lived another massive amount of time. Eventually I became almost tired/bored of being to be any state of matter no matter their size/form. It kept annoying me that with all this ability to be anything, why the hell did I keep returning to this human form....Time felt its best when it was going fast, but it never was enough.....</p><p>Now if you were god, right and you had created everything, what mystery or intrigue would be left? The god in me wanted not to participate in the endless renewal of life, rather it wanted to be dormat or to not feel or be in the cooking pot. For lack of a better analogy, the god in me wanted to die, but it seemed such a cruel twist for it because it could never not exist..........ummmmm I wish I was making this up, but this is what I experienced on mushrooms. Some things just can't be explained, so my question is what is real, or is this real??? words from/for the naive/wise, RESPECT THE MUSHROOM!</p>"
}
