{
 "title": "Possibly the Happiest Night of My Life",
 "author": "Mitch Texten",
 "citation": "   Mitch Texten. \"Possibly the Happiest Night of My Life: experience with MDMA (ID 10345)\". Erowid.org. Feb 15, 2004. erowid.org/exp/10345",
 "substance": "MDMA",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10345",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 15, 2004",
   "Views: 8210",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm going to attempt to put to words the absolutly amazing experience that this drug facilitated for me.  To describe this I feel that its important that the reader know my mental state prior to taking MDMA and the setting I was in.  This is because, at least from my experiences, the effect of ecstasy is _greatly_ influenced by your mood and environment durring the trip.</p><p>Last weekend several of my closest friends and I attended a rave in Seattle.  We had been planning and anticipating this rave for weeks, so by the time we arrived we were so excited that it was nearly unbearable.  Every possible detail of our little vacation had been worked out so there was nothing that could distract or worry us.  We were totaly free to have a good time.  Before we left we had aquired a quantity of ecstasy from a very trustworthy source and tested it to be sure of its purity.</p><p>Once at the rave(12:00am) my friends and I each ate a pill and started to walk around the building enjoying the music, talking to people, taking in the amazing light displays, and in general just getting as comfortable with our surroundings and possible.</p><p>After about a half hour I noticed that my friends and I were seeming to get along even better (if that was possible), and that heartfleat words of friendship were starting to become common. This is how I can always tell it's starting...I get along with everyone around me and want to tell everyone how they really are a good person and that I care about them.</p><p>Probably about ten minutes later I noticed my body was starting to feel electric, my arms felt like they almost floated to the music.  At this point it also became almost impossible not to move in harmony with the music.  An OH the music!  The music started to sound so good...almost orgasmic..as if it was ressonating from inside me.</p><p>By 1:20am I was really feeling the effects.  I wanted to be everyone's friend, to tell every girl I saw that I thought she was unbelievably beautiful, and to just make people as happy as I was.  I was awe struck just at how amazingly happy I was, all my problems were millions of miles away.  Not to be sappy but it was as if my soul was about to burst with joy and I was desperate to express this to people and help them feel the same.  Another interesting effect was that my vision wiggled laterally.  It was as if someone put a vibrating massager against my head shaking my eyes around.  It was very pleasurable.</p><p>At this point a girl I met earlier gave me a back rub.  I can not put to words how amazing it was.  The experience transcended sexual pleasure....and it was just a simple back rub.  But it wasn't just the back rub, it was to being with someone...sharing the experience with them, being in contact with a living, breathing, _FEELING_ human.  I can not stress enought the importance of sharing emotionaly with others while on extacy...it make it so much more intence and meaningfull. (be carefull though..once you come down you may feel abit dumb if you say too much.)</p><p>After what I can only guess was about three and a half hours of happiness so intence that it was almost overwhelming I started to come down.  Coming down off 'e' really wasn't that bad.  I simply felt that it was time to stop.  A walm calm feeling overcame me and I felt the need to sit and just observe and enjoy other people.  The only downside was that at this point I noticed that my jaw was rather sore from being clenched all night.  Also the next day I definitly felt mentaly slowed, but still warm and peaceful.</p><p>In conclusing I don't think any drug could have possibly been given a more fitting name...it truely is ecstasy.  Also, the setting really does matter with this drug.  If you take 'e' while with people you don't feel too great around with a bad mood you really do get a pretty so-so trip.  Sure you'll feel happy...but nothing very special..you'll probably have had better times without chemical help.</p><p>And lastly, be VERY carefull who you get it from.  I've had two friends end up in the hospital from bad pills.  Too many people want to make a fast buck and are willing to risk your health for it.  That and remember, moderation is key.  MDMA very likely _IS_ neurotoxic...in other words...do it too much and you really could become an 'e-tard'.</p>"
}
