{
 "title": "Trick or Treat?",
 "author": "Toad",
 "citation": "   Toad. \"Trick or Treat?: experience with Tiletamine (ID 10352)\". Erowid.org. Nov 2, 2001. erowid.org/exp/10352",
 "substance": "Tiletamine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "IM",
   "Pharms - Tiletamine",
   "(powder / crystals)",
   "  T+ 2:59",
   "-999.0 mg",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10352",
   "Male",
   " ",
   "Not Given",
   "Nov 2, 2001",
   "28127",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIn the spirit of Halloween I decided to try something new to me and previously untested... Would this unknown candy apple be a terrible trick or a tasty treat???</p><p>The compound in question was tiletamine, a structural relative of ketamine that's also used in animals as a veterinary anesthetic.  The vet brand Telazol is a mixture of tiletamine and zolazepam (benzodiazapine added for to lessen muscle stiffness during surgery).</p><p>Tiletamine is not approved for use in humans like ketamine is.  Tiletamine is scheduled as a controlled medicine in many countries including the US, however it's not regulated or controlled in my country of residence.</p><p>The material I had obtained was a pure tiletamine powder (not the vet brand telazol mix with added benzodiazapine), properly mixed in saline and ph adjusted, then sterilized by passing through a .02 micron syringe filter.  15mg IM was administered. I had not seen any experience reports other than a first hand report from a fellow traveller. The dosage levels were based on animal data and recollections from a friend that I had provided samples to many years back.</p><p>I figured it was about 4 times the potency of ketamine. I recalled my friend telling me it was similar to ketamine but with much greater potency as we had predicted and somewhat longer acting. He didn't provide too many details about the experience but did mention that if given the choice he preferred ketamine.  He had developed a very large tolerance and habit with ketamine at the time, which i suspect is why he was not able to provide more details and a better qualitative evaluation of the effects.</p><p>To sum it up in a nutshell... the stuff is vile !!! it has an undesirable receptor binding profile with poor kinetics if you ask me.  The ride up was easy going and interesting, less floaty than K, more solidified and blocky feeling in the body and mind, less psychedelic but definitely disassociating, some similarities with K but very unique, some insights and ideas immerging, the degree of disassociation was similar to a 50mg IM dose of K.  During the peak my mind awareness was completely intact, body partially immobile. This part of the trip was interesting and somewhat enjoyable, although not as euphoric as ketamine. </p><p>The ride down was where it really became obvious that this compound is far in-superior to ketamine. The recovery phase lasted what seemed like *forever*. My head felt like it had gone through a cheese grater and then placed on a merry go round.  Motion sickness, headache, general dysphoric malaise that just kept going and going.  The peak/plateau seemed to last for perhaps 1.5 - 2 hours and the recovery/re-entry phase lasted some 4-6 hours or more.</p><p>Smoked some cannabis to try and help with re-entry, but it was to no avail. During recovery I was able to steer the trip into some interesting places at times, but overall it could be characterized as a very unpleasant feeling which dominated the last 3/4 of the experience. I was not in a bad place psychologically speaking, no demons or such, mostly just thoughts like 'ok we got our answer, now how much longer must we endure?'</p><p>At one point I contemplated aborting by adding more ketamine to launch back into hyperspace while the tiletamine wore off, decided against it however due to the unknown factors involved. Glad I made this decision since I was later to find out just how long acting the tiletamine residual is.  I couldn't believe how long the stuff stayed with me.</p><p>My body felt toxified, with strange rubbery chemical taste on the back of my tongue along with considerable level of general physical malaise.  I was finally able to fall asleep for a few hours and then woke up with a very nasty hangover, complete with painful headache.  I felt sick and dizzy all the next day, couldn't even look at the computer screen without feeling overwhelmed.  I layed on the couch all day and evening and was not able to work. Found myself repeating a familiar mantra :</p><p>'That's it... no more crazy experimental drugs! From here on out I'm going to stick with the tried and true...'</p><p>(spectators commentary) (yeah right, I'll belive it when I see it Mr. Toad. In any case, Toad claims that he'll definitely be taking an extended vacation from all experimental drugs with potentially dubious qualities for awhile.)</p><p>I feel sorry for the poor apes who get a load of tiletamine! such treatment is nothing short of animal abuse in my opinion. This is one case where a compound has been deemed 'not for human consumption' for good reason. It would be interesting to find out more regarding the history of this drug to determine if human trials and tests were ever performed during its development and evaluation stages.  Of course this could be a case of one individual's idiosyncratic negative response, however one trial with Mr T. was all I needed to know.</p><p>As far as I'm concerned the tiletamine chapter is closed.</p>"
}
