{
 "title": "Adventures with Flexeril",
 "author": "A Kat",
 "citation": "   A Kat. \"Adventures with Flexeril: experience with Cyclobenzaprine (Flexeril) (ID 10357)\". Erowid.org. Feb 10, 2004. erowid.org/exp/10357",
 "substance": "Cyclobenzaprine (Flexeril)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)",
   "  T+ 1:00",
   "10 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10357",
   "Male",
   " ",
   "Not Given",
   "Feb 10, 2004",
   "196012",
   " "
  ]
 ],
 "report": "<p>After noticing a lack of cyclobenzaprine (Flexeril) information, I figured I'd like to submit what I've learned recently.</p><p>I've only done it a handful of times (say, 10), but I could share my latest trip report.</p><p>Flexeril comes in 10mg tabs.  The highest amount I've taken is 20mg, which seems to be a strong dose, unless one is using it as a sleep aid.  5mg(half of a pill) seems to be about the highest dose I can endure without falling asleep.  Flexeril lasts (for me) about 18 hours.</p><p>Throughout the experience below I kept a steady caffeine intake.  I'm not certain how much caffeine is in Mountain Dew, but I drank about one every half of an hour.  It didn't help.</p><p>I take a 10mg tab.  The drug's effects normally present themselves within 45mins to 1 hour.</p><p>t + 1:00 I take another 10mg tab.  I'm going to try and stay up this time.  I've just started to feel the effects of the first dose.  A mild sedation, and relaxed mindset has been noticed.</p><p>t + 1:30 I am definately feeling very calm.  My muscles seem to be relaxed (it may be placebo, though I doubt it).  My mindset is becoming very... calm, yet oddly in a melancholy way.  </p><p>t + 1:45 I feel a strong urge for nicotine.  This is unexplainable, as I smoked a cigarette 15 minutes ago.  I usually have one every hour.. but I'll smoke a cigarette anyway.</p><p>t + 2:30(ish) - I think I'm feeling the second dose.  Extremely sedated, and very calm.  I'm beginning to feel very tired.  I listen to some Boards of Canada, because it feels right for the mood I'm in.  My dog seems to have picked up on my mood, and has layed down next to me.  So I'll pet him for quite awhile.  Dogs are so easy to make happy.</p><p>t + 3:00 - Okay.. now I'm feeling extremely tired.  The first dose should be reaching peak plasma levels by now.  The second dose is just starting to kick in.  Definate anti-cholinerogenic effects.  Starting to see odd flashes of white light.  My heartbeat has become a little chaotic; not in a speed sense, but it shifts and changes alot.  Not feeling euphoria, really, but there is a general something.  My mind is just very calm.  Bodyload due to the anti-cholinerogenic effects is present.</p><p>I didn't look at a clock after that.  I just layed down on my couch, listening to music, until I drifted asleep.  I sleep for about 7 hours, and then was awoke by a friend.</p><p>He asked me if I wanted to go for a drive and smoke some crank.  I politely declined, but said I'd go with him anyway.  </p><p>After he took a good hit of crank, I decided I'd take one to help rid of the flexeril effects.  Not surprisingly, it didn't do anything.  Not sure of any contradictions between flexeril and methamphetamine, I decline more.  Meth's nasty stuff anyway.</p><p>We went back to his place.  Played cards with a few people, but was really just in a daze.  After awhile, I put in some John Lennon and just stared at the wall.  Simply too relaxed to be social.</p><p>Got a ride back home.  Went for a brief, 5-minute walk.  Wanted it to be a little longer, but gave up because I was still very tired.  Went home, ate some food for energy, but fell asleep anyway.  </p><p>I then slept off the effects, sleeping for another good 4 or so hours.  Could have gone more, but decided to get up anyway.</p><p>It's an odd drug.  Not 'fun' in the traditional sense.. but very welcome after a hectic week.  Kind of like a vacation.  My problems with it are the mild anti-cholinerogenic effect and it's long duration.</p>"
}
