{
 "title": "Powerful Substance",
 "author": "Canetoad",
 "citation": "Citation:   Canetoad. \"Powerful Substance: experience with 5-MeO-DiPT (ID 10373)\". Erowid.org. Jul 15, 2002. erowid.org/exp/10373",
 "substance": "5-MeO-DiPT",
 "bodyweight": "120 kg",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10373",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 15, 2002",
   "Views: 6170",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had read that it was recommended to fast 12 hrs before taking 5meodipt, and that's what I did.  Of course I counted sleeping hours, which were 8, I got up at 6 am, and took approx 40 mg of 5 meodipt without having consuming anything except coffee...  10 minutes later, while I was still having a cup of coffee, I noticed that my t-shirt was soaked with sweat.  I thought, that's odd, couldn't possibly be the 5meodipt, because that takes 2 hours...Wrong!  The 5 meodipt it was.  I didn't have to wait long for the visuals, they came on with enormous power:  Almost everything I looked at, was continuously moving one way or the other...\r\nMy wife demanded to be taken to the shopping centre, and since I had promised to her to take her there, I did so...or at least I tried...  After a ten minutes drive the traffic, the exhaust fumes, te noise and everything else got too much for me...(I have to insert here that I used to be a professional driver, being used to drive stoned, I retired on my own free will), i had to disappoint my wife and tell her i couldn't take her to the shopping centre, and instead turned back...  I agreed to stop at a shop where she at least buy a few things she wanted...while she went there, I strolled off into the beautiful nursery next door...looked at the amazing patterns of certain plants...spent a long time in the cactus section...would have bought some if I had the money...especially that one large trichocereus pachanoi...or was it real a pachanoi and not some stray species...I ended up at some coleus looking new sort of ritzi plants which werent really coleus, but something mutated from coleus...I could practically FEEL the dmt present in them...but don't ask me what they are called...anyway I can still find them in that nursery if I want to...\r\nAll the colours and patterns and sheer radiance in that nursery put me back on the right path...\r\nAfter we got back home I spent hours walking around in the garden, studying my plants and simply being taken away by them... I spent hours in another dimension... It was way more overwhelming than the lsd trip which was actually kind of depressing... the visuals never stopped even after I got sick of them...Every thing I looked at would move and change, whether I wanted or not... Visuals much stronger than most lsd trips I remeber...and there have been many...while 'inside' I could still contain some sort of logic...and yes, like on lsd I was scared of that small sharp kitchen knife in the sink...the everlasting fear that I could hurt myself with it....which I had first felt 30 yrs ago on acid...but at the same time I was in control, because the logic inside my head was still working in spite of all this overwhelming spinning outside of my body... I took 2 temazepams during this trip, and they barely sufficed to calm me down...  I had taken the 5meodipt at 10 am in the morning, and at 10 pm still found it impossible to sleep...finally, with the help of a 3rd temazepam and my last weed I fell asleep at midnight...\r\nthis 5meodipt is some strong substance, visuals way better than lsd,\r\nstill less mindfuck than acid and more controllable...5meodipt absolutely rules....\n\n\n"
}