{
 "title": "Quite Interesting...",
 "author": "WanderingShadow",
 "citation": "   WanderingShadow. \"Quite Interesting...: experience with Syrian Rue, H.B. Woodrose, Kava, & Cannabis (ID 10374)\". Erowid.org. Mar 8, 2004. erowid.org/exp/10374",
 "substance": "Syrian Rue, H.B. Woodrose, Kava, & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 tsp",
   "oral",
   "Syrian Rue",
   "(seeds)",
   " ",
   "8 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   " ",
   "2 Tbsp",
   "oral",
   "Kava",
   "(roots)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10374",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 8, 2004",
   "Views: 9932",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter trying some Hawaiian Baby Woodrose seeds with unsatisfying results, I was convinced I needed something else to improve their effects. So, I bought some Kava from an herb store and borrowed some Syrian Rue from a friend. Why not experiment by making a tea out of these three? So, I took about 5 teaspoons of the semi-ground up Syrian Rue seeds, 8 HB Woodrose seeds (scraped and crushed), about 2 tablespoons of dried Kava root, and two bags of herbal tea (mint and orange rind-yummy!) and let them soak in hot water all day, which was about 14 hours. So, after waiting, I strained this mush through a coffee filter, resulting in a cup (more or less) of poo-coloured liquid. I managed to drink it (it was bitter, but bearable, although it tasted worse closer to the bottom of the cup). After gagging down the last gulp, I had to drink some honey tea to help keep down the other tea (NOTE: I ate a mid-sized meal about two hours earlier). \r\nAfter only a few minutes, I thought I felt a little bit lighter (probably placebo effect though) and I noticed my pupils were really quite large. Soon after, my brother came home and asked a favor of me. He was dead tired, so he asked me to go get his quarter sack. I was hesitant, but eager to get out of the house (let's face it, Alabama is BORING as Hell). Thus, I hopped in my car, and headed out (CAUTION: I DO NOT RECOMMEND DRIVING WHILE UNDER THE INFLUENCE OF PSYCHOACTIVE DRUGS).\r\nMy journey began. Normally I'm not the greatest driver at night, but because my pupils were dilated, I could see much better. Also, I felt a certain pleasant, content aura around my mind, but I didn't really experience any other effects physically or mentally. I arrived at my neighborhood Waffle House and met up with my friend, Captain P. I explained my situation to him, and he said he was getting hooked up later, so he'd sell me some of his. So we waited at Waffle House and it was actually wasn't bad at all. I felt really content and creative, so I pulled out paper and pen and proceeded with some abstract sketches of the evening (the full moon was really spectacular). Everything was annoyingly bright, it was a little warm, and my head felt a little weak, although I felt no real nausea. I know these sound kind of bad, but perhaps I'm blowing these out of preportion. Everyone seemed so interesting and with diverse personalities. Things were much funnier too. The whole time, I had this wierd feeling that the moon was looming outside. Twenty mintues later, the captain's hookup arrived and dealt out the sweet leaf. \r\nHe wanted to make some cash, so we drove over to a FOAF's house. What do you think we did? That's right! We burned a fatty and smoked a bowl while listening to Sublime. At this point, the tea was getting obnoxious, so I wanted to get it out of my system. After trying to puke for a couple minutes to no avail, I gave up and decided to chill on the couch. For the next couple of hours, we sat and watched my FOAF play Sonic the Hedgehog, and it was a lot more engrossing than you'd think. I had cottonmouth and dry eyes, which was a bit annoying. Every few minutes, I'd close my eyes and travel to a differnt place filled with colours, shapes, and lines. In one of these little trips, I thought I experienced a Miro painting. Then I'd open my eyes and repeat the cycle again. But around 2:30, this experience was tiring me out. So, I drove home, handed my brother his nickel sack, and fell into a deep sleep.\r\nThe next day, had the kind of hangover I had before with the HB Woodrose seeds alone: an odd feeling in my stomach, and a sort of 'fuzzy' feeling, but I think I felt sleepy cause of the hangover from the weed. Looking back, I remember the whole experience divided up into several wierd 'panels'. The first panel: drinking the tea and being asked a favor. The second panel: Waffle house. The third panel: inside my FOAF's house. The fourth panel: gazing at the full moon outside my FOAF's house and the drive home. The whole ordeal was really interesting, but I don't think I'll try this again for a while; I still feel a little worn out.\n\n\n"
}
