{
 "title": "Doin' The Wrong Thing For All The Right Reasons",
 "author": "Sam-I-Am",
 "citation": "   Sam-I-Am. \"Doin' The Wrong Thing For All The Right Reasons: experience with Methamphetamine (ID 1039)\". Erowid.org. Feb 15, 2001. erowid.org/exp/1039",
 "substance": "Methamphetamine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1039",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 15, 2001",
   "Views: 21211",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was 24 years old, faced with the overwhelming responsibility of being a single mom (due to recent seperation) and working very hard at a very demanding job. I was on-call 24 hours per day, 7 days a week in a hospital setting, setting up and sterilizing instruments for surgery. I was getting called in to work the dreaded 'graveyard' shift (11pm-7:30am) alot; sometimes weeks-on-end with no day off. My job performance began to suffer (as did my driving skills on the way home in the morning). I could hardly stay awake. </p><p>My co-worker, on the other hand, was working the same hours as me, but her energy seemed endless. I should also mention that she was single-handedly raising very active twin girls, as opposed to my one, mild-mannered, sweet little boy. HOW ON EARTH WAS SHE DOING IT?!!? One night (around 3am), I asked her just that. She replied, 'Ya really wanna know? Come 'ere, I'll show ya.' We proceeded into the break room, she closed and locked the door, poured out a small pile of this clearish/white crystally looking stuff on the table, and began crushing it up. I said, 'No way! If that's coke, I'm outta here!' 'Don't worry' she replied, 'It's not coke, it's speed.' 'Oh!' I said with a sigh of relief, 'That's cool. As long as it's not coke, 'cause I've been clean now for 5 years after a 4-year cocaine habit. That shit's like poison in my opinion! But speed? I guess it's okay.' (DUH!!!) </p><p>So I do my line. What comes next? Let's say, MOTIVATION is a profound understatement. Before I knew it, it was 7am, the department (which is rather large, to say the least) was more than spotless, and I was still bright-eyed and bushy-tailed, reading the change-of-shift report (at about a mile a minute) to the morning crew. 'Who spiked your oatmeal?' asked another co-worker as she passed by me. I laughed.</p><p>Very alert, I had an excellent time driving home. My co-worker had given me a small amount to get me going that night when I had to return to work, and it's a good thing, because I wasn't able to sleep at all that day. I'm telling you though, my house sure got a thorough cleaning!</p><p>Upon arriving to work that night, I walked into an absolutely disasterous department! Surgery had been busy that day. Row upon row of instrument trays which needed to be set-up, wrapped, and sterilized for surgery the following morning. Once again, when morning came, and after a few lines, the morning crew came in to a neat and tidy department, and a well-organized/powerfully delivered change-of shift report. This time however, I went home and went to sleep (after I took my son to preschool).</p><p>My son...his preschool... I HAD to keep him in that school! The tuition was $130.00 per week, therefore I HAD to be able to work all of the crazy hours that I was called in for. My family expected that I provide my son with the very 'best'; a pretty harsh demand, considering I was doing it alone. My husband just disappeared one day, he did the all-too-easy 'dead-beat-dad' thing for the next five years. Driven by the burden of responsible single-parenting, and the desire to keep my job, I began purchasing and doing meth regularly. In the begining, 1/4 gram would last me three or four days. I'm 31 years old now, and I could (and do) consume about 1/2 gram per day. I'm no longer working at that job; there's no need to. My husband came back a few years ago, we reconciled, and are to this day happily married. I run a small business from home, so that I can be an 'at-home mom' to my now two sons. (Not to worry, I stayed clean during my pregnancy, with some difficulty.</p><p>I am an addict. I know this. I have the 'battle-scars' to prove it. I'm only 31, and I wear a partial denture to fill in for the teeth that fell apart and rotted out. Twenty-one root canals took care of the rest. A few years ago, people would guess by looking at me that I was in my late teens/early twenties. I did some modeling on the side; I wasn't bad looking. Now I have no smile to speak of, and I've added a rather harsh decade to my appearance. (My husband still tells me I'm beautiful though, I love him for that!)</p><p>Every time I have tried to stop, the withdrawl symptoms got the better of me. I get very dizzy after about 3 days of abstinence, and the dizziness doesn't stop until I do some meth again. Believe me; I've REALLY given it a legitimate chance! After three months of abstinence, a couple of different times (dealer got busted), I was still dizzy and falling down steps...THREE MONTHS!!! How long does it last?? It's not just the dizziness. When I stop, everything about me goes into hybernation; including the ol' intestinal tract (excuse the reference, it's extremely uncomfortable though!).</p><p>I would like to stop. I would like to be free from the bondage of this drug. I don't feel, however, that I can do it alone. I am fearful and somewhat ashamed to reveal my addiction to my doctor in exchange for treatment (if there is any available). I guess I'm afraid that he'll judge me somehow. </p><p>What have I learned from all of this? That I am only human, and by nature, the 'flesh' is weak. Denial comes all-too-easy, and rationalism is just another way of putting the blinders on and forging ahead.</p><p>Again, I'm ONLY 31 -- but most of the time I feel like I'm 50.</p>"
}
