{
 "title": "Adrafinil and Modafinil: Some Observations",
 "author": "Rhizome",
 "citation": "   Rhizome. \"Adrafinil and Modafinil: Some Observations: experience with Adrafinil & Modafinil (ID 10393)\". Erowid.org. Jan 18, 2002. erowid.org/exp/10393",
 "substance": "Adrafinil & Modafinil",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "900 mg",
   "oral",
   "Adrafinil",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Modafinil",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10393",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2002",
   "Views: 77652",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've experimented with Adrafinil for about two years and have found it to be a useful stimulant. Initial trials were conducted at 900mg which I found to be substantially stimulating, this stimulation was, for me at least, of considerable duration, and even after dosing relatively early in the day I would often find that I had difficult in sleeping. However in contrast to stimulants such as amphetamine and cocaine I have always fallen asleep (eventually) after taking adrafinil.\r\nThe nature of the stimulation induced by Adrafinil is distincly different from that produced by other stimulants, being characterised by a particularly cerebal quality- the motor stimulation produced by more conventional stimulants largely absent. One drawback for me is the level of 'inner tension'that Adrafinil produces especially during the later stages of its effects, often I've found that I become irritable and slightly 'scatty'.\r\nThe day after has been characterised by feelings of lassitude and exhaustion, though minor compared to that induced by other uppers. I've found that taking a second dose when in this state seems to have little or no effect. One curious property of adrafinil seems to be that one cannot be certain wether a given dose will have an effect. It would appear that your natural energy levels have to be at their best to derive an effect from this substance. The most useful quality of adrafinil is motivational-after taking it you find yourself keen to undertake intellectual work and will often stick with the task in hand for far longer than normal.\r\nModafinil though similar has a few unique qualities. It was easier to fall asleep after a dose, it did not produce the inner tension that adrafinil did, and the quality of stimulation seemed subjectivley 'finer' than that of adrafinil-- which has more of a down and dirty 'druggy' feel about it. In addition modafinil does not seem to produce any post dose exhaustion and seems to work when taken consecutively for a number of days. However, unlike adrafinil, modafinil does not seems to focus one as singularly on a given task.\r\nFrom what I've experienced both have a low abuse potential, there's little in states of mind they induce to attract the thrill seeker. But if taken with a particular purpose in mind (eg. completing overdue university assingments) then they definitley have their uses, in fact they probaly the best substances for this sort of task available.\n\n\n"
}
