{
 "title": "The Yawns",
 "author": "DeadBeat420uk",
 "citation": "   DeadBeat420uk. \"The Yawns: experience with Citalopram, THC, Alcohol (ID 10394)\". Erowid.org. Jan 7, 2007. erowid.org/exp/10394",
 "substance": "Citalopram, THC, Alcohol",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Citalopram",
   "(pill / tablet)",
   " ",
   "20 mg",
   "oral",
   "Pharms - Citalopram",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10394",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 7, 2007",
   "Views: 22273",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Mindset: Good.</p><p>And so the story begins... </p><p>Managed to get ahold of 6 generic 40mg Citalopram tabs from a friend. He described them as constantly making you yawn and every time you did the expeirance was similar to coming up on E.</p><p>Ever the sceptic, I chow down 1 & 1/2 of the small white tabs and make my way to the local bar. Over an hour later I'm still experiancing few effects if any and so I have the other half. My friends and I decide to go to a club, it is now some 3 hrs after I took the initial tab and I've had a few beers since (3 pints) Our taxi arrives outside the bar and as I leave the club the cold november wind wakes me up a bit and without realising it I yawn, and get a massive (increadbly pleasent) rush that seemed to come from my solar plexus.</p><p>After I'd got over the initial shock of it I suddenly realised that stopping yawning was proving to be a problem and each time I did yawn I got another massive rush extreamly similar to the feeling when some good E kicks in. After each yawn I would be basking an a pleasent afterglow for a few seconds and then almost uncontrollably had to yawn again.</p><p>We arrive at the night club which is very busy. I felt extreamly sociable and slightly energetic but the amount of people and crowds in genral were making me very tense (The reverse of what I'm like on E, usually I love crows, the more people the better) The yawns die down a bit and I have a good time at the club, much bonding is done with old friends. I feel slightly queasy and we leave the club and smoke a spliff waiting for our taxi, instantly the yawns kick back in again.</p><p>Go back to a friends house and smoke a few more spliffs but now I feel sleepy and slightly sick so I make my way home. Even though I feel tired sleeping proves to be impossible, a feel pretty horny but orgasm also proved difficult (This stuff seems to give you tremendus staying power, ask my girlfriend!) I got no sleep at all (from the citalopram!) as every time I started to doze off I yawned, rushed and woke up again. It took mabey 18-20 hours for this to wear off and then mabey another 4 hours to get properly back to baseline.</p><p>All of the next day my stomach was extreamly upset and I felt pretty worn out by the whole thing (nothing compared to an E comedown though...) All in all it's decent stuff just I'd recoment taking it at home with a few good friends 'cos crowds are scarey.  And take it early in the day 'cos the effects last a -long- time (and are irrotating if you're trying to get to sleep) I never got any life changing epiphanies from this drug but it's pleasent enought to use in a social situation, good for parties ;)</p><p>I found it made me feel a very close empathy with my friends but would hesitate to do it again 'cos of the sleep/upset stomach problems (the stomach could have just been off the beer, but it wasn't pleasent) Not only that I found these pretty frustrating 'cos it's as if you're about to come up on E but never quite get there which is annoying as I'm sure you can imagine anyhow,</p><p>Later 'w Love</p><p>DeadBeat420uk</p>"
}
