{
 "title": "Not a Clean Buzz",
 "author": "Daemon",
 "citation": "   Daemon. \"Not a Clean Buzz: experience with Caffeine, Amphetamines & Ginseng (ID 10409)\". Erowid.org. Feb 2, 2007. erowid.org/exp/10409",
 "substance": "Caffeine, Amphetamines & Ginseng",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Caffeine",
   "(liquid)",
   " ",
   "10 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Ginseng",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10409",
   "Male",
   " ",
   "Not Given",
   "Feb 2, 2007",
   "Views: 13181",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This fall my class went to the beach for a semi-educational field trip. At some historic town on the way we were sent off on a scavenger hunt that no one actually actively did. So after downing the remains of a can of EZ-Cheez and one of those chocolate oranges, I went into a coffee shop and bought a cup of chocolate-covered expresso beans and a cup of chai tea (good stuff). I ate the coffee beans on the way to a smoothie store nearby, where I got even more caffeine from a passionfruit smoothie w/guarana, ginkgo and ginseng. I then drank my *well chilled* chai. This is probably over a span of 30 minutes.</p><p>Maybe another 30 minutes later I'm feeling a little jumpy around loud noise. I go and get an iced double shot expresso and split it with my girlfriend. Then I stop eating stuff so I don't spew. I buy a can of a red bull ripoff, venom, which was described to me as 'Mountain Dew on smack.' I get on the bus and take the Dex with the soda when the nausea wears off (20-30 more minutes).</p><p>We started watching Indiana Jones, and now that my nausea wears off and I'm not busy doing anything I realize how buzzed I am. This had to have been an interaction between the Dex and the caffeine, and perhaps w/the ginseng, because I am not very stimulant sensitive. You know how if you've been staring at something for a while, your indirect/side vision gradually gets grayed out and jittery? Well, this seemed to happen immediately, like my brain was shutting out all distractions besides the movie. Lines, especially vertical ones stuck out w/gray edges. Dull colors became even more faded, while grass growing in direct sun outside the bus window burned my eyes. My right eyelid was twitching, and my eyes would randomly water. I was shivering slightly, and my shirt was damp w/sweat for no reason.</p><p>I had these weird sensations, like my body was suspended in liquid. Also, I got a sensation like hearing a quarter of a second of speech very loudly through one ear, which was odd. This happened 4 or 5 times in 15 minutes. My friend looked at me and laughed, so I asked him what was so funny. He told me to look at myself, and I did in the reflection of the T.V. screen during a dimly-lit scene in the movie. My eyes looked like they might pop out of my skull, they were so huge. Oh well. The buzz tapered off until 9 or 10 at night, and I had to pee a LOT during this time. This wasn't the most fun experience ever, but it was interesting, and only had a day of crash.  If I was to experiment with caffeine again, I would definately take a pill form, the sugar crash and initial nausea of eating/drinking so much were major factors in the enjoyability of its (ab)use.</p>"
}
