{
 "title": "Requesting Oddness Face",
 "author": "smallcat",
 "citation": "   smallcat. \"Requesting Oddness Face: experience with LSD & Cannabis (ID 10425)\". Erowid.org. Nov 4, 2012. erowid.org/exp/10425",
 "substance": "LSD & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 hits",
   " ",
   "LSD",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   "  T+ 6:00",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10425",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 4, 2012",
   "Views: 880",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI'd come back from university for the weekend to attend my sisters christening. I'd had a hard weekend having an exciting time with friends, some ket, coke, and a couple of pills over the two previous days. </p><p>On the Sunday morning of the christening myself and my friend (D) decided an exciting plan of action would be to take a trip (LSD) and go to the church. We hadn't had any acid for a while and were busting to get our trips on our tongues, so we drove to my parents house in the country which was a mile or so from the church. We decided that only half a trip was the best plan as I couldn't afford to completely loose the plot in front of my parents and their friends. We took the trip at 13.00hrs at the house, then we nipped out for a spliff. When we returned to the house we were pretty stoned, but these days we normally are so handling my parents was no problem. As we sat waiting for guests and relatives to arrive so we could all walk to the church, the acid started to kick in.</p><p>(t+45min) Things became very funny and me and D couldn't even look at each other without laughing. As usual the music we were listening to became to manic and we were forced to change it so we would calm down! Soon the guests arrived and we walked to the church. By this time (t+1:30) everything visually had assumed a kind of cartoon form. There were waves of motion on everything I looked at. When we entered the church I could barely stop laughing, the gargoyles were not even vaguely scary as I had worried they would be, but like odd little animals. We sat down, (at the back out the way) through out the service. The vicker was some kind of ridiculous caberait fool, though when he spoke the words rang and danced around the church. Occasionally the place became very ominous. He spoke of surrendering to god and christ being our savior. I was both skeptical and scared. </p><p>Feeling relieved we left the church, (t+3.00) still tripping madly. We returned to my parents house and joined in the celebrations. There were about 30 of my parents friends and 5 or so relatives, all of whom wanted to talk to me about university and my future. This I found very difficult as my brain was fairly scrambled. Soon we were paranoid about being caught but whet upstairs to calm down. We told ourselves that they had no idea we were tripping as there are no obvious physical signs and we sure as hell hadn't told any of them. D left to go home and I continued to talk to my parents and their friends. I found this extremely exciting and rewarding. I feel that a few of the people there may think I'm a little strange. It's extremely hard to order my thoughts correctly when tripping.</p><p>(t+6.00) I had a crack at using the internet but couldn't hack it. All the icons that are normally the same size kept moving around and changing size! I decided to go for a spliff with another friend I gave him a call and left the party, it was November 4th and the fireworks that were going off were fantastic.</p><p>(t+8.00) I returned home to a dilapidated party. I sat down and pretended to read a book while I really couldn't take my eyes of the paisley style carpet which was a puddle of colour and movement. The shapes and patterns moved in sync with the chemical brothers I was listening to. After a couple of hours I went up to bed. I was exhausted due to practically no sleep all weekend, though only fell asleep at t+13hrs-ish.</p><p>This was truly one of the most exciting days of my life. Taking a small quantity of LSD in a more exciting situation is easily as much fun as a large dose in a safer controlled environment! I realize that I put a great deal at risk taking acid in such an unpredictable situation, but now I am sure that my grasp of how it can alter your mind and how you can control and direct both the visuals and the thoughts will leave me in good stead for future trips.</p><p>Remenber folks...they don't know you're tripping until you tell them!! :-> What an oddness.</p>"
}
