{
 "title": "Feeling Great!",
 "author": "I.M. King",
 "citation": "   I.M. King. \"Feeling Great!: experience with Codeine (ID 10420)\". Erowid.org. Feb 8, 2009. erowid.org/exp/10420",
 "substance": "Codeine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Codeine",
   "(pill / tablet)",
   " ",
   "120 mg",
   "smoked",
   "Codeine",
   "(pill / tablet)",
   " ",
   "120 mg",
   "oral",
   "Codeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10420",
   "Male",
   " ",
   "Not Given",
   "Feb 8, 2009",
   "Views: 10627",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday I was very bored and home alone. I didn't have any marijuana so I started reading user experiences here on erowid, I came across codeine.. I knew I had some aspirin or something with codeine somewhere in the house so I did the seperation trick with hot water, cooled the water and filtered the solution into a glass and drank it.. it wasn't that bad of a taste more bitter than sour, but I wouldn't drink it regularly. I went upstairs and started reading more user experiences on erowid.</p><p>I started feeling light headed and kind of tired about 30 minutes later. The strange part about the tiredness is that I would close my eyes and my eye lids would shake until I opened them again. I soon started feeling extremely relaxed, like I could sit in my chair for days on end, I did stuff on my computer, listened to music.. played games.. nothing was really spectacular visually or audibally, but I was so comfortable just sitting there it was unbelievable.</p><p>I went downstairs to get a drink and as I was leaving the kitched I turned off the light, at that point I was extremely scared, I had to run upstairs. </p><p>I soon went to lay down, this is where it got strange. I couldn't sleep, I was just relaxed and thinking about stuff.. I kept hearing noises from downstairs (real, every day house creeks.. wasn't hearing things :)) at this point I was VERY scared and it was hard to take my mind off it, that kept going on for an hour or two when finally I passed out.</p><p>All in all I had a wonderful time on the codeine, I've never felt more relaxed.. I'm writing this the day after the experience and I feel fine.. still generally relaxed and somewhat tired.. no headache or bad side effects.. I did have a MINOR stomach ache earlier but a bit of pepto-bismal fixed that right up..</p><p>I recommend codeine for relaxing and every once and awhile.</p><p>With all drugs though, watch how much you take.. start off somewhat low. I took just enough to feel good and have no side effects, I'll probably try increasing the dose sometime soon..</p><p>Positive effects</p><p>----------------</p><p>Relaxation</p><p>Great comfort</p><p>Neutral effects</p><p>---------------</p><p>None? :)</p><p>Negative effects</p><p>----------------</p><p>Paranoia</p><p>Somewhat hard to go to sleep when I wanted</p><p>Minor stomach ache</p><p>Hard time concentrating (Out of curiousity I tried doing simple math equations in my head [8x12] and found I could hardly concentrate enough to do them)</p>"
}
