{
 "title": "Entheneo-Tourist",
 "author": "Ryecatcher",
 "citation": "   Ryecatcher. \"Entheneo-Tourist: experience with Mushrooms - P. tampanesis & Cannabis (ID 10438)\". Erowid.org. Sep 23, 2004. erowid.org/exp/10438",
 "substance": "Mushrooms - P. tampanesis & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 ",
   "oral",
   "Cannabis",
   "(cookie / food)",
   " ",
   "2.5 g",
   "sublingual",
   "Mushrooms - P. tampanensis",
   "(plant material)",
   "  T+ 1:00",
   "0.5 ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10438",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 23, 2004",
   "Views: 6571",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Here is a dream I had:</p><p>Last year I was blessed enough to take a trip to Amsterdam and Paris.  As you might imagine, such a trip would yield a thousand and one stories.  This is a sliver of the vast realities that unfolded themselves on that incredible trip.  At times, I will insert excerpts of a journal that I managed to keep whilst enhanced on the local flora.</p><p>The story begins in Amsterdam for supplies.  Having partaken of Hollands finest crops for five incredibly elongated days, I decided to take discreet forms of foodstuff back to the much less friendly climes of Paris.  I procured a quantity of space cakes (yum!) and mushrooms from one of the many Smartshops.  Sadly, most of the mushrooms were consumed as fast as we could buy them in Amsterdam proper.  Still, I managed to save a small quantity of the P. tampanesis Philosopher Stones.  These are simply incredible, as I will go on to describe.  Also, I need to stop here and say that I completely Love Amsterdam.  If you have the means, I highly recommend getting there however you can.</p><p>While in Paris, my breakfast consisted pretty much of half of a space cake and a couple of mouthfuls of the Philosopher Stones (and, of course, baguettes and café au lait).  I did not swallow much of the Stones, as they gave me unpleasant cramps.  Instead, I chewed them well as long as I could stand, and kept the chewed cud in my mouth sublingually for about fifteen minutes.  The following slightly edited description from the journal pretty much sums up the spiritually tinged Stone experience the first day: </p><p>An array of mind and reality bending stones sit growing from the ground like miniature potatoes, a food gift from God.  How could the ancients not eat these small potatoes?  They taste mild, like a ripe mushroom.  Just another food, designed to eat.  Then, a taste nightmare begins to creep in, like a bath in sour acid beginning in your mouth, then stripping away your body, your flesh, and the fog of reality around you.  You are released.  Above the clouds, nothing, clarity, silence, thought, pure thought.  Flying on instruments, the body can take care of itself.  Above the clouds, ceiling unlimited, I begin my day for good.</p><p>[a pleasant walk from the hotel to Notre Dame, the heart of Paris in the rain.  I will spare you the description of the visit, as the experience was not pleasant due to the mob of flash-snapping tourists and the fact that the main organ was being tuned with unbelievably loud, dissonant, end-of-the-world blasts of its mighty pipes.  I sought quiet . . .]</p><p>across the street, in the even more ancient Eglise Saint-Julien-le Pauvre.  This place has been Holy ground for more than 1,600 years.  Finally, quiet and solitude.  I dont even realize how quiet until I stop and hear the racket Im making as I take off my coat and gloves.  This is a Church visited by almost no one, even though it is more historically significant than its larger sister across the street.  Inside is peace, as much peace as is available in this hectic town.  Nowhere to kneel, I sit on one of the comfortable but plain chairs and bow my head.  Prayer, slowly at first, then faster.  Alone in my mind with God.  I am unsure, as there is no music, no distractions, no feeling of my body, just pure thought, but I persist.  There.  In the distance.  Like a babbling brook.  Thirsty, I walk towards it.  It gets louder.  Light begins to gleam off its glistening cool surface.  Then He comes.  Like a flood filling every nook and cranny of this ancient Church, the Holy Spirit, cool, electric, vibrant and refreshing, like the cleanest breath of air youve ever taken.  He fills my every pore and cleans off all the dust and dirt that I seem to manage getting myself into.  I want to leave at first, not feeling worthy or even permitted to take part in this luxury, this incredible gift.  But a gentle Human, most Human of hands sets on my shoulder and comforts me.  Ive got this one, He says, paying the price to the Great Bath Owner for my Bath.  I am washed clean.  I pray.  I pray for the world.  I pray for the lost souls that I know and love, that they may all come to drink Him in.  I am left renewed, refreshed, reborn.</p><p>After that, as you can imagine, everything else that day pretty much paled in comparison.  It was an astounding experience.  Set and setting are everything, goes the oft repeated mantra.  Well, set was wanting to connect with God, and setting was among the ancient stones that made up that Church, a thousand years plus of spiritual energy contained therein.  And connect with God I did.  There are no words to describe that Connection, only that you know you want nothing but that for all eternity.  Now, Ive connected on many occasions, without the need of chemical assistance.  The Stones, though, made it so easy, and so powerful.  The name Philosopher Stones is well deserved.  Thought is clear, logical, intuitive, comes rapidly, but not so much so that you cant handle it.  Serenity is available as you view the trivialities of modern life around you with the amusement and detachment they deserve, and are able to focus on What Really Matters.  The Stones are a powerful tool, but only that.  It is the mindset, the yearning for Connection that really matters.  Together, it was a simply an amazing experience.</p><p>In retrospect, I must say that these Stones, potentiated with the space cake, provided the perfect combination to safely walk around Paris and be a tourist, only on a whole different level.  Call it Entheneo-tourism.  The way that the Stones rip you (gently) from the fog of reality is incredible.  I hate to use a reference, but it was a bit like the scene in the Matrix after Keanu eats the red pill, a sort of cold/sour feeling emanating from the chewed up stones and through and around your head to the rest of your body.  The space cakes were an efficient means of maintaining the feeling.  I would eat a half a cake a couple of hours after the first to stay aloft.  If youve never tried these, they are chocolate muffins with a large quantity of Netherlands homegrown baked in.  Makes for an easy plane ride back, too.  Anyway, there is so much more, so many other trips within that trip.  Best saved for another rainy day for now.</p><p>Find the Connection.</p><p>Peace.</p>"
}
