{
 "title": "Finally A Breakthrough!",
 "author": "jibberia",
 "citation": "   jibberia. \"Finally A Breakthrough!: experience with Salvia divinorum & Cannabis (ID 10432)\". Erowid.org. Dec 14, 2012. erowid.org/exp/10432",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10432",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 14, 2012",
   "Views: 874",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was researching mushroom growing kits online when I stumbled upon salvia. After some research, I bought 2 grams of regular strength enhanced salvia, and received it a few days later. I was eager to try it, so I layed some out on tin foil, put the lighter to it, and inhaled through a tube. I did about 4 of these hits, holding them for a long time, but nothing happened. I felt jipped, but wanted to give salvia another chance. I decided to grab the screen from my garden hose and build a salvia pipe out of some metal piping and an elbow joint I had. I continued experimenting with salvia for a few weeks, trying it every few days, but to no avail. I felt weird after each smoking, but nothing to call a trip happened. The world bent itself in a strange way, and certain objects appeared strange to me, but nothing major or shocking. I was rather disgusted with salvia. I thought that what I was feeling was exactly what everyone else felt - but people were talking their experiences up to something completely different.</p><p>Then one day I was smoking some marijuana with friends. I was about to leave, and was packing up my water pipe and other accessories, when 'John' said, 'Hey, whats that?' I explained what salvia was, and that it sucked. I ended up pouring a bit of the extract into his bowl, and saying, 'good luck... its pretty worthless.'</p><p>The next day, John saw me, grinned, and said 'salvia is sick! wow!' He thought it was the combination of weed with the salvia that made it work. I figured I would give it a try, but doubted that it would work.</p><p>Later that day, we (me, John, and another friend, 'Francis') went out to a favorite smoking spot in the woods, and smoked some very good marijuana through a bong. About half an hour later, we were feeling rather stoned, and I broke out the salvia. I loaded a big bowl into the slide, and told John and Francis to take 2 or 3 huge hits and to hold them for 30 seconds. John acted like an old pro, took a hit and passed the bong. We went for 2 rounds. By my second hit (I happened to be the last in the smoking circle), John seemed to be feeling it, and Francis wasn't. I held that hit until I was gasping for air. Still holding the bong, I glanced to my in the woods to my left, and froze.</p><p>The world melted somehow. I vaguely remember swimming around in colors and various random places. The whole time, I was thinking about life - I could sort of remember my life on earth, but I eventually was convinced that it was a dream, and that my current existence was all there ever really was. I felt rather content in my own world. Eventually, I became this sort of tree. There was a bay, with water, and around it, forming the walls against the water, were these 10 or so huge tree-like structures, arranged right next to each other to hold the water. Each tree was a different color, and I was one of these trees. I remember looking down, and feeling as if we were all tapped and filling up the bay with the water. Right at that point, my real self dropped the bong like an idiot. I rocketed out of the salvia world to see the bong. The real world was extremely screwed up, and I could barely stand. I somehow stumbled to a sitting spot and sat for about 20 more minutes, gradually coming off the salvia. The peak ended in just a few minutes, less than 5.</p><p>I believe I tripped so hard that day because I was completely not expecting it, nor was I looking for it. I smoked that salvia fully expecting not to trip.</p><p>Since then, I have smoked salvia a few times, each time in combination with marijuana. I found my experience too absorbing and incredible to do more than once in a while. My trips since then have been less intense, and I attribute that to my mindset. I have had a few experiences outside now in which everything looked very strange, the world looked like a big Magic Eye 3d thing. A rush of thought accompanies this. My last experience involved a ton of random things from my life flowing around, and forming other things. I can't remember anything specific (I didn't trip with the intent of writing a report on it so I wasn't trying to remember). Everything flowed together, and pictures came out of nowhere. It was a great experience.</p><p>I hope one day to repeat that first breakthrough I had, but I guess it will take a certain mindset to happen. Salvia is quite a substance. I believe that mixing it with marijuana is the way to go. Enjoy!</p>"
}
