{
 "title": "Immersion in Godness",
 "author": "Van Sykl",
 "citation": "Citation:   Van Sykl. \"Immersion in Godness: experience with 5-MeO-DMT (ID 10455)\". Erowid.org. Feb 11, 2002. erowid.org/exp/10455",
 "substance": "5-MeO-DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10455",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 11, 2002",
   "Views: 12369",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMy Guide prepared me well, explaining that this was an experience of importance and ensuring that I was in a safe place and that there would be no chance of unwanted interruptions.  We had spent the day on bicycles in the cool fall air of southern California.  We had eaten lightly a few hours earlier.  She did not describe what I might feel, and that was a good thing.  My mind set was open.  I was completely unprepared for the actual experience and its impact, and that was a good thing for me.\r\nAs the smoke took its time to wander through my bloodstream to my brain, I had a premonition of this being absolutely unique, and it was.  This experience was nothing like any other chemical pathway to an altered state I have ever tried, including many LSD trips, psilocybin, mescaline, peyote, grass, crack, speed, cocaine, you name it.  My consciousness was broken open and my separation from pure direct connection of all that exists dissolved, so that I and the universe were now recognizable in experience as one thing.\r\nThe sensation was of almost unbearable beauty, of complete immersion in all time, all space and all reality.  And the obvious truth is that there is nothing between each soul and constant ecstay but our ability to recognize that we are already in heaven, that intense joy is ours whenever we choose and that death and life are the same and that constant, perpetual ecstacy is the fundamental condition of this universe.  There is nothing to be 'done', there is no one recipe of behavior that will transport us to some 'place'.\r\nThe universe is love and love is the only requisite to live our material segment of existence in connection with this truth.  It is the truth that all great spiritual leaders have told us, and yet without some catalyst to help us experience it personally, we cannot translate the prophets' words into our own reality.  This chemical Doorway, for me, was such a catalyst.\r\nWeeks after, I am still transformed.  And the question was raised in my mind, 'Now that I know nirvana exists here and now if we want it, what next do I do with my physical life?'  And the answer was 'Take out the trash.  It's full.'  And so I did, with love in my heart.\n\n\n"
}