{
 "title": "Changed",
 "author": "A man",
 "citation": "   A man. \"Changed: experience with MDMA, Alcohol & Cannabis (ID 10451)\". Erowid.org. Sep 27, 2004. erowid.org/exp/10451",
 "substance": "MDMA, Alcohol & Cannabis",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "rectal",
   "MDMA",
   "(capsule)",
   " ",
   "100 mg",
   "oral",
   "MDMA",
   "(capsule)",
   " ",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "100 mg",
   "rectal",
   "MDMA",
   "(capsule)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10451",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 27, 2004",
   "Views: 6849",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There is an overwhelming gush of excitement that overtakes my tongue with every slurp of a well poured vodka martini. I like them dirty, even filthy at times. A dirty martini changed my life once, this is true. All fly martini bars have one thing in common, dim lighting. This one in particular was plush, glowing in a dim blue and steel haze. It has the best Grey Goose martini in []. </p><p>Gavin and I are big on filthy Grey Geese, we also share a completely hetero preference of supository ecstacy. Little gel caps we find at the health food outlet store. We get some damn good molly, as pure MDMA is referred to in this particular demographic. Filling them is fun because we dont use a scale. Gavin and I split the gram  $75.00 each. Fill 10 caps evenly, pop two apiece, wash our hands well, I pocket the rest, (Gavin has some warrants) and somehow we end up in this beautiful matador themed, blue lit steel countered martini bar.</p><p>Rollin'- damn what a chill ass feeling, mellow and smooth. Some tight beats, Tosca maybe. It's 7:30 pm. Sometimes Gavin and I start a little bit toO early. I personally enjoy bobbin' my head to downtempo, jazzy music on a patio while the harvest moon starts to appear over Denver and the crimson sun dives into the Rockies. Darkness falls quick and I swallow my third cap, not that my ass is sore, but I was in public and its a classy place. Gavin is tempted by my venture but declines to reach that level at this point. I stagger pimpishly into the bar for my second dirty goose, my jaw clenches and I smile. Looking into the eyes of my new lover I twist with excitement beginning the slurred conversation with her that has not stopped six months later. Gavin likes hos, at least he likes the fine ones. </p><p>Back at my house I slip into the bathroom, slam one up there, wash my hands and stare into the mirror beginning to realize who I am and why I love everything about my existence. I love you man. I was saying that to Gavin in my basement while we lined our last molly and dug for my old breakbeat records. Gavin, being the social genius he is, graciously gave each of the girls a pill so they were upstairs in balls watching the end of Lost Highway. Later Gavin and I tag team the turntables with some mellow breaks, the girls dance together, we all smoke one of my now famous blunts- lightly coated in honey. Early the next morning as Gavin and I lay on my king bed, seperated by two beautifully curvy women, I realize that the most important things to live for are the things that make you and the people you love the most happy. Sometimes for me that is sitting around my family's Christmas tree, hugging my little sister. Sometimes it is slurping on a vodka martini.</p>"
}
