{
 "title": "A Divine Perception of Truth",
 "author": "Meat Nipples",
 "citation": "Citation:   Meat Nipples. \"A Divine Perception of Truth: experience with DPT (ID 10479)\". Erowid.org. Feb 15, 2002. erowid.org/exp/10479",
 "substance": "DPT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "90 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10479",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 15, 2002",
   "Views: 7792",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nWaking from the illusion of physical discomfort,\r\nI lay in the warmth of a new sun rising.\r\nA gentle presence moves about me,\r\nTakes my hand and touches my mind\r\nTides of emotion rise and fall\r\nIn a sea of iridescent geometry\r\nTension builds to a crescendo of inner conflict,\r\nThen the waves retreat;\r\nI feel the warmth of the sun, still rising.\r\nA blanket of cool wind\r\ndancing to soft jungle drums.\r\nThe rhythm drives the trance.\r\nThen a shift; the moaning of the ocean\r\nSwells to a monstrous growl\r\nClimbing from the abyss of my mind\r\nScreaming like an insect under a microscope\r\nSelf, Soul, Mind, Body; dissolve.\r\nLines of binary code flood all awareness.\r\nThe presence reveals its gaping ambivalence\r\nPromising to swallow me whole.\r\nFear is alien; anxiety an abstraction\r\nThe experience is real and nothing besides.\r\nAs the raging waters cease their toil\r\nI bath my naked soul in the fading light\r\nLying there; panting, wishing, smiling\r\nI feel heavens kiss of softened hues and gratitude\r\nWith crystal clarity I open my eyes,\r\nAnd witness a Divine Perception of Truth.\r\n*Inspired by the effects of dipropyl-tryptamine, an analogue of DMT.  Though I describe my self-awareness using the words  I and me, a normal, tangible sense of self was often absent during the peak of the experience.  Although much of the imagery used sounds pleasant, the actual trip was physically, emotionally, intellectually and spiritually taxing.  It also took a much longer period of time for me to integrate and gain insight from than most psychedelics.  When I did, however, I indeed felt heavens kiss.  Tryptamines are good medicine, but they deserve our utmost respect and prudence.\n\n\n"
}