{
 "title": "Strangest Day of My Life",
 "author": "Nbt",
 "citation": "   Nbt. \"Strangest Day of My Life: experience with Coffee (ID 10483)\". Erowid.org. Mar 23, 2006. erowid.org/exp/10483",
 "substance": "Coffee",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Coffee",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10483",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 23, 2006",
   "Views: 46503",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This morning, I had a shower, brewed up a strong cup of coffee (plungered) and knocked it down quickly before leaving. This was at about 8:30, and I'd say I put in about four heaped teaspoons (this is the amount I normally have every morning).</p><p>This woke me up, and by ten fifteen (about 2 hours later), I was sitting in the year twelve common room, with my trusty bottle of instant coffee. I initially brewed up three more cups (each around the same strength as the first), and sunk them down. I felt awake, but it was as though the instant coffee wasn't having a strong effect on me. I stirred up another three cups, making seven over about three hours (with six within an hour), and ran off to my english class. </p><p>I sat down, and suddenly it occurred to me that I was feeling VERY euphoric, chatting away about the most random garbage without a care in the world. My heart was beating really fast, and by I was feeling ALIVE. </p><p>I was too hyperactive to sit at the computer for long. I picked up my assignment, and began to read it as fast as I could. or some reason, I seemed to be able to speak so fast barely anybody could keep up, but I didn't stutter or mess up a single word. Now I flicked on my discman (chemical brothers: dig your own hole. the ONLY choice when being drugbent), and closed my eyes. I felt as though as I was spinning around at a million miles an hour, and when I opened my eyes and turned off the discman (about half an hour later), my friends were joking around, saying stuff like 'hey, Mr *teacher*, I think *me* is trippin' out.' he took it as a joke, but I suddenly felt EXTREMELY paranoid. I begged with my best friend to be quiet so I could relax, but he thought I was joking. I had to pick up my stuff and go to the other side of the class, where I stayed for about 5 minutes. Lunch time.</p><p>This is where the strange part started to sink in.</p><p>After being euphoric, I had become paranoid (a seemingly normal reaction), and I figured I was probably just dregging out. I thought my experience was over. wrong.</p><p>Back in the common room, I found it hard to concentrate on anything that moved around (a game of hacky sack - my fave game - was too disturbing), and sat down at my friend's roulette wheel. It all of a sudden felt as though I was gambling for real (even though we use plastic chips), and I was in the middle of some crazy casino. The music was cranking, everyone was talking, and we were all having fun. The only thing that started to really bug me out was when people would change things (for example, the music, or they might come up and interrupt our game of roulette), and I continued off in the same, lost, crazy sort of state for about 90 minutes, swinging in and out of highs, lows, and scattered in-betweens. Things never seemed quite right (usually sounds or people's faces), and it wasn't until my biology lesson at 2:45 that I finally calmed down enough to concentrate. I felt like I had just woken up, and I needed to go to bed.</p><p>I managed to hang in until about 3:30 when I went back to shoot some more pool, and I stayed there until 5. Then, I walked home, turned on some relaxing jazz, an jumped in the shower (for about forty minutes). </p><p>It's now nearly seven, and I'm just beginning to feel normal again. But tired. REEEEALLY tired.</p><p>In summary, this was probably the strangest experience of my life. I used to smoke dope, and I've taken LSD and magic mushrooms, so Ive had heaps of experience. I think the really weird thing about this, was that for a start I was at school, and secondly, I wasn't expecting such a crazy reaction.</p><p>peace</p><p>Na</p>"
}
