{
 "title": "There's a Reason This Ain't Popular!",
 "author": "Highly Disoriented",
 "citation": "Citation:   Highly Disoriented. \"There's a Reason This Ain't Popular!: experience with Nutmeg (ID 1050)\". Erowid.org. Apr 9, 2001. erowid.org/exp/1050",
 "substance": "Nutmeg",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Nutmeg"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1050",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 9, 2001",
   "Views: 28556",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm the kind of person who'll try anything once-- acid, 'shrooms, x, you name it, I've given it a whirl. So when I read on the Internet that the myristicin in nutmeg is a psychotropic, I thought to myself, 'Now, why not??'\r\nWell, I mosied down to the health food store and bought a bag of whole nutmeg nuts--Indian was the only kind they had, so that's what I got--and the cashier lady looked at me as if she would've liked to have known just how many pumpkin pies I was planning on making in early April, but she didn't say anything, to my relief.\r\nCommon sense told me that, with my weak stomach and deathly gag reflex, chewing the shit whole or grinding it up like a headache powder was not going to be the thing to do. Therefore I chopped the nuts into thirds, boiled them in a little better than a cup of water, and then let my sickly brew simmer on low for oh, say SIX HOURS. I strained the stuff in a collander, let it cool, and then noticed this brownish-white muck around the edges of the pan; I figured I had better let that redissolve so I got it hot again and then poured the nutmeg-water over a Twining's Earl Grey teabag (you know, the kind the Queen of England uses). I then imbibed my cup of goodness and set about to wait for the effects to set in.\r\nI watched TV for about forty-five minutes, all by my lonesome, and noticed after that length of time that I was beginning to intensely concentrate on everything that crossed my mind without really trying to. I know that sounds fucked up, but that's just how it seemed to me. I started to stare at everything that my eyes passed over, and I started listening intently for nothing in particular. Don't get me wrong--I wasn't 'seeing things' or 'hearing things' in any sense of the term--I just had this sort of heightened awareness that I couldn't shake. I got online and downloaded a couple of MP3's; this took about twenty more minutes, during which time the intense concentration seemed to wax and wane irregularly. I had worked all day that day, so I was beginning to catch the sleepies, and as I got sleepy I began to do all sorts of little, stupid things like getting up and then instantly not being able to remember why, but still nothing I would classify as a 'buzz' or abnormal bodily sensation of any kind. \r\nMy silly actions freaked me out a little, I guess, and the sleepies left me as I found myself sitting in front of the computer wondering what in God's name I was doing. It had been close to an hour and a half since I'd ingested the tea, and I was really beginning to think I'd been duped by an urban myth when the strangest thing happened.\r\nI was on my way to the kitchen from the study where the computer is when, suddenly, as if a bolt of metaphysical lightning had descended from the sky and made itself at home in my parietal lobe, I became unable to walk in a straight line. I felt instantly drunk, and yet not drunk at all as far as the dizzy, sluggish sensations of normal intoxication go. \r\nAt that point a buzz unlike anything I'd ever experienced began to descend upon me and kept increasing with agonizing understated persistence for the next several hours. I watched TV again, this time the evening news, and I felt unable to concentrate on the actual program while at the same time being unable to stop staring at the TV.  As the faux-buzz progressed I started getting this really annoying ringing in my ears, something which NEVER and I mean NEVER happens to me, and in my head the sound of the ringing kept somehow warping into these little fairy-voices which were chanting in some language I couldn't understand. With no regularity at all these weird distortions of perception seemed to come and go; sometimes I could control it, and sometimes I was too dazed to care.\r\nEventually I really did get too sleepy to stay awake, so I stumbled to my bedroom (well, I stopped by the bathroom first and nearly SHIT on myself when I saw how red my eyes were, like I had smoked a pound of grass [N.B. I guess the only real reason I did this is because I DIDN'T have any grass]) and crashed upon my cat fuzz-covered bed until five thirty the next morning, when I woke up and felt so shitty that I instinctively passed out in the same breath I awoke with.\r\nThank holy JESUS that I was off the next day, because I spent all damn day in bed so thirsty I could drink my own urine but too biologically lethargic to engineer anything of the sort. My fiancée came over for dinner, and, needless to say, SHE did the cooking.  I went back to work the next day and felt fine; I had a little trouble concentrating as I have a number-crunching job, but I played my inefficiency off as a 'bad weekend' (the vaguer the excuse, the better, am I right??) and recovered completely after another good night's rest.\r\nWould I recommend nutmeg?? I think that everyone who's interested in that type of thing should at least try it, because it is a *really* different experience. I think that, in combination with shrooms and/or mj, some of the finer qualities of myristicin et al. might come to light more fully.\r\nBut it won't be something I repeat again.  Not for a while, at least. Like someone else commented, it's just too much bullshit for too little action to make it something anyone sane would do on a regular basis. But I can't deny it was definitely interesting. Thanks for reading, and I hope I gave everyone some halfway useful or at least partially interesting info. :-)\n\n\n"
}