{
 "title": "The Binary Ketamine",
 "author": "Surreal Computers",
 "citation": "   Surreal Computers. \"The Binary Ketamine: experience with Ketamine (ID 10553)\". Erowid.org. Nov 13, 2001. erowid.org/exp/10553",
 "substance": "Ketamine",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10553",
   "Male",
   " ",
   "Not Given",
   "Nov 13, 2001",
   "Views: 15115",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis was my first time doing K.  My trip sitter told me to insufflate 2  lines (100mg each) quickly, then lay down.  I did that.  He put on some trance records, and I found the effects coming on within a few minutes.  I lay down and closed my eyes, hoping that I'd be prepared for my first k/k-hole experience.  The visuals began to set on, and the body high quickly switched from drunk to dissociative. I don't remember anything from that point, until I was deep into the k-hole.  </p><p>Some background information on me, I'm a computer science major, and consider myself heavily into computers and the basic underlying method of logic, reason and programming structure.  I had no idea this would affect my k-hole.</p><p>I found myself sitting on top of a processor (a large microchip), and the processor was sitting atop a river of binary code (i.e. 110011000011001010010101), just 1's and 0's that make up the computer.  Around me were thousands and thousands of wires, all very psychedelic looking, and constantly shape-changing.  I opened my eyes and tried to focus, i could not.  Everything was shattered into hundreds of pieces, outlining a sort of tunnel vision.  I tried to talk to my trip sitter, but my speech was heavily slurred.  I asked 'am i dead?'  he said 'no.'  So i closed my eyes again and entered my world.  I was still floating through the binary river, this time faster, and then i shot out of the tunnel.  I was now riding atop a spiral wave, going downwards, I felt like a cowboy riding a bull.  I opened my eyes again and asked my sitter 'where am i?'  he said 'your house.'  I really had no clue that I was in my apt, as I did not recognize anything at all.  </p><p>Some thoughts that entered my head were 'how will I finish college like this?'  'my parents won't like this one bit.'  But it really didn't scare me, as I felt such a completeness and one-ness with all spiritual things around me.  It was truly beautiful.  I laid back down and just observed the world around me (with my eyes open) and I realized I was not actually in my body.  I was sort of floating over it, and I could still move my limbs, but I could not feel them moving, just watch them.  I played around with that for a while, and then went back into my k-hole (closed my eyes.)  The vision was sort of fading, so I opened up my eyes again and tried to stand up.  That was a bad idea, because I just fell back down.  My trip sitter told me to stay sitting and that I was emerging from my k-hole.  He told me the jarring into reality was kinda tough, and brought me something to throw-up in.  Nice guy.  So I did just that, threw up, and then lay back down and emerged from my k-hole.  Coming out, i felt an intense drunkness, and just lay there thinking about it all.</p><p>I had a wonderful experience, and did not fear any of it, even the parts where I thought I had died, I still liked.  It was funny, because the entire time I thought I had not taken any drug whatsoever.\rI find K to be a very beautiful substance.</p>"
}
