{
 "title": "On Death and Dying",
 "author": "Ivan Illyich",
 "citation": "Citation:   Ivan Illyich. \"On Death and Dying: experience with P. harmala (Syrian Rue) & LSD (ID 10581)\". Erowid.org. Nov 15, 2001. erowid.org/exp/10581",
 "substance": "P. harmala (Syrian Rue) & LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "0.375 oz",
   "oral",
   "Syrian Rue",
   "(tea)",
   " ",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10581",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 15, 2001",
   "Views: 13682",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI acquired 3/8 of an ounce of fine ground Syrian rue seed powder.  I made it into a tea by boiling the powder in a coffee filter and squeezing it.  I filled the abominable tea with sugar, and half and half.  Downed the brew in a swift gulp and then proceeded to ingest some LSD, roughly 2 hits.\r\nI have taken large LSD doses of upwards of 15 hits and never had any adverse physical reactions.  I have also taken Syrian rue before (with LSD), but never more than 1/8 of an ounce.  This was all done with a friend of mine who took a little less than a 1/8 of Syrian rue and also two hits of acid.  It was acid from the same sheet and Syrian rue from the same bag.  He had no adverse effects.\r\nI knew something was wrong almost immediately.  Heavy visuals began within 5-10 minutes of taking the LSD and the Syrian rue.  I am not sure if the MAOI increased the uptake of the LSD or if the visuals were purely the Syrian rue.  Although I was enjoying myself my body seemed to say 'hello! Hello!! What are you doing you crazy bastard.  This is it, you've done it.' No particular pains yet, just an overwhelming feeling of distress. \r\nRoughly 45 minutes later (I really do not know) I began to have very, very severe stomach pains.  I stumbled to my room looking for the sanctuary of my space and the comfort of my cats.  But it grew worse, I was a being faced with not being, and I was as frightened as any being could be.  I began violently vomiting, luckily in the cat's litter box.  It was then that I faced my death.  I no longer cared if I died on the spot or in sixty years.\r\nIt was not a dislike of life; it was an acceptance of my own mortality.  Yes I would fight my death, but I would not anguish over my death.  I have always tried to understand my mortality, known that I would die.  But it was never a possibility NOW, always much much later.  But my death was here.  I accepted and understood that I would no longer exist.  As my death drew nearer and my vomiting more violent, my thoughts became placid and less distressed.  Then death left me, I felt fine, besides a sore throat and some mild nausea.  More than nauseous, I felt disappointed.  I truly believed it was my time (whether it was true or not is not for me to decide) that I would die that night.  And I was calm.  Accepting of what has happened.\n\n\n"
}