{
 "title": "Mom's Soup",
 "author": "Chris007",
 "citation": "   Chris007. \"Mom's Soup: experience with LSD (ID 10632)\". Erowid.org. Jan 2, 2008. erowid.org/exp/10632",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10632",
   "Male",
   " ",
   "Not Given",
   "Jan 2, 2008",
   "4614",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>16y/o</p><p>150pnds</p><p>I heard alot of good things about acid, and a friend said she had some that she didn't really wanna try, supposedly it was 'double dipped' acid, She gave me 2 tabs of it. When I got home I couldn't wait to try out the new experience. So I took one of them, Waited an hour, and nothing happened. So I took the second one, waited another hour, and still nothing. A total of 2 hours passed after taking the second one, and I was at my computer chatting on irc, someone sent me a screenshot of their desktop, and I looked at his spiral background. When I concentrated on it, it would move, This freaked me out and I asked the guy why his desktop was moving, and I realized that the drug had kicked in. I said to myself, 'Finally!'</p><p>I went out on the internet and found some more cool pictures that changed into different shapes and colors. I decided to go downstairs where my mom was making dinner. As I get up out of my chair, I start to laugh my ass off, for no particular reason. I finally get a hold of myself and take a trip downstairs, the floor was breathing, moving as if I was going to sink into it. I felt like I was in heaven. I ate some of my moms soup, it tasted so rich, and was one of the most delicious things I've ever eaten. I could take everything so vividly. I watched some tv which wasn't that interesting, just plain old tv. So I went back upstairs and decided to enjoy myself, and play some quake2. Something I didn't expect was viewing the game differently. When I started to play the game, it all looked funneled. As if I was inside the game. I had extremely good reactions in playing. It was amazing. All night I had been looking at pictures move around. It was a totally new experience. </p><p>I try to come in here often and read the experiences. I believe acid can open new ways of thinking, and I'm definately planning on doing it very soon! I was sort of disappointed since I didn't see any trails, or the colors I'm hearing about. Next time I'm planning on a little higher dosage, maybe 2. I don't believe the hits I took were double dipped.</p>"
}
