{
 "title": "A Week of Oneiromancy",
 "author": "Pineal Glutton",
 "citation": "   Pineal Glutton. \"A Week of Oneiromancy: experience with Calea zacatechichi (ID 10637)\". Erowid.org. Oct 16, 2003. erowid.org/exp/10637",
 "substance": "Calea zacatechichi",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Calea zacatechichi",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10637",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 16, 2003",
   "Views: 13370",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nAs an occasional lucid dreamer who has had many deep and profound dream experiences (linking with loved ones in dreams mainly), Calea drew my attention a long time back. I finally procured some from a friend recently, and I have smoked a bowl of it each night since then. I add a few drops of water to the herb before I place it in the bowl, as it is rather dry and I'm not trying to smoke fast. It isn't a harsh or particularly unpleasant smoke, remniscent of salvia in many ways to me but ultimately I've been told I come back smelling like I've smoked Prince Alberts. I smoke it reverently, under the stars, calmly, breathing deeply. The only things I leave for afterwards are brushing teeth and a short yoga/stretching session before bed (less than 5 mins). Then it's off to the world where dreams never cease.</p><p>I have not missed one night of dreaming in this week since I've had the calea. The first night I must have had at least 10, no exaggeration. I cannot remember all the details because many times I will slip back into another dream before jotting it down in my dream journal. But the dreams have always been numerous, and intense. Calea is definitely an ally of mine. Perhaps my best. Of course, opinions vary. But I recommend it for anyone inclined to making use of these states. If you're looking for the latest, greatest high, keep looking. Calea does very little, besides a *MILD* relaxation, while awake. But when you wake up.. you'll know.</p>"
}
