{
 "title": "My First Shamanic Trip",
 "author": "Phyz",
 "citation": "   Phyz. \"My First Shamanic Trip: experience with Mushrooms (P. cubensis), Ginseng, Ephedra, Guarana & Cannabis (ID 10660)\". Erowid.org. Feb 25, 2007. erowid.org/exp/10660",
 "substance": "Mushrooms (P. cubensis), Ginseng, Ephedra, Guarana & Cannabis",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "30 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)",
   " ",
   "1 tsp",
   "oral",
   "Ginseng",
   "(tea)",
   " ",
   "1 tsp",
   "oral",
   "Ephedra sinica",
   "(tea)",
   " ",
   "1 tsp",
   "oral",
   "Guarana",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10660",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2007",
   "Views: 9213",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last week I gave a Psychedelic Party to celebrate my birthday and invited 7 close friends to take mushrooms with. I took 30 grams of fresh Thai Cubensis and a little (0,25 g I suppose) dried Copelandia leftovers. </p><p>These I prepared by cutting each mushroom in half and putting them one at a time in a blender with one kiwi and half a banana. With the fresh shrooms this worked very good, but the dried ones stayed quite intact and I had to chew them. To this potion I added a teaspoon of Ginseng, Guarana and Ephedra each. </p><p>I slowly sipped from it leaving each sip of potion in my mouth for a while, it tasted a lot better than just eating dried mushrooms. The shrooms came on quite quickly, I think the first effects came on after 30 minutes, this is about twice as fast as when I chew them. I didn't really mentally feel anything from the Ephedra and Guarana, but I was more physically active, I think. </p><p>The setting was informal, I was with good friends and my intention was just to have fun, no real psychonautic plans. Set was ok, I felt good, a little worried maybe about two girls for whom this was their first trip. What also bothered me a bit was that I had eaten a large meal that night, while I usually fast for at least 6 hours. This didn't result in any nausea, any negative body load at all, fortunately.</p><p>The trip was nice, not very strong visuals but the shroom euphoria and weirdness was definitely there. I always enjoy tripping very much but I usually feel I want to go deeper. This time was no exception, so after a couple hours I decided on smoking some weed to intensify things. I usually don't smoke while tripping because the only time I had previously done that, things had become quite weird.</p><p>I smoked even more this time, and 5 minutes after that I was propelled in a extreme intensity I had never experienced, the feeling of my previous Mushroom/Marijuana combo came back, but with much greater intensity. This feeling was a total disbelief in the existence of what I normally experience as reality. </p><p>I had the experience that everybody, including myself, moves in small, kind of spastic, robotic movements quickly followed by each other. This is very hard to explain, but very frustrating and kind of frightening to experience. Illustration: A friend of mine told me he was going home, and every word of his was followed by a one movement, moving his hand for 5 centimeters to the right, for example. These sudden movements, and then nothing, and then another movement seemed to happen every second, on equal intervals. </p><p>They seemed like a sort of dances, my role was to move or say something in the interval when he didn't and that was what the communication was all about. Meanwhile I realised that I had already experienced this conversation, but was unable to give any other answer or act any different than I felt I did that other time. I also didn't understand what he said, hearing only half sentences or something. </p><p>These very intense deja-vu's were accompanied by a loss of control of what I did, it wasn't my normal ego controlling my actions, but there certainly was an ego, and I recognised it as a part of me. </p><p>Worse than communicating with the outside world was going introspective, I experienced a state of consciousness I thought to be worse than death, in death there seemed peace and serenity, but I was currently being bombarded with the most extreme and unsettling thoughts and experiences. </p><p>There didn't seem to be any time passing, so I frequently thought I was stuck in this crazy state forever, and my thoughts were very frequently interrupted with sentences like 'If I ever get back to reality I will never take drugs again' and more depressed and suicidal thoughts, but although not believing in the existence of reality at all, I told myself to not do anything stupid, like wounding myself, my head was clear enough for these rational thoughts, fortunately. </p><p>I didn't really learn anything from the trip, the introspection was only extremely weird, therefore interesting, but not enlightening. I asked very deep questions to this other ego, but didn't get any sensible answers. This I contribute to the marijuana, mushrooms always have an aura of meaning around them, but I experience marijuana-induced hallucinations as being merely silly, no mystical entheogenic properties, although it is entheogenic in meditation, awaking my kundalini.</p><p>This trip happened last week, but I had forgotten almost everything, until last night.</p><p>I smoked a lot of weed at a party, and totally flashed back to the trip the week before. That flashback enabled my to write this detailed report, because I remembered and re-experienced a lot of it. And this morning when I woke up it was fresh in my mind. Because of the similarity to the 'real' trip, I will not discuss what I experienced last night but what I will go in to one thing that I think is extremely interesting.</p><p>The thing I experienced (in the sense that it really happened) last night had been experienced by me the week before too! So I had had a 'Préja-vú' then, I off course can't be a 100% sure because I had remembered very little of that trip, so it could be that I projected the 'real-life' experience of talking to a friend to a vision I had had during the trip last week.</p><p>More esoterically speaking, I now have this theory that the Cannabis/Mushroom combination might put me in a timeless dimension from which I can travel to previous trips and trips I will have in the future. </p><p>Being safe back in reality now, I quickly remember the experience as being extremely interesting, but I must not forget the terror accompanied by it, and I will not be using any drugs the coming weeks, especially high dose cannabis.</p><p>As a last remark I want to say that this combination also enables me to have very vivid memories of past experiences and that it's quite sensual at times. This combination resulted in my having very vivid images of previous sexual experiences, and having intense kundalini in first chakra and a erection as a result. Very much like to explore this particular aspect further, for obvious reasons ;-) </p><p>The lesson learned here is that people should not assume that Cannabis is very mild and fit for combination with a every psychedelic for this can produce very intense synergy in some people, like me.</p><p>I am not sure if the Homeopathy has any role in this but I recommend being easy on the psychedelics while using it. I'm on something to treat mild depression (platinum, for connaisseurs). It might have made me more sensitive.</p><p>This trip and it's flashback I consider my first real trips, I've had a 5 gr. Cubensis and Salvia 10x intense trip, but those were nothing compared to these. These trips have opened my mind to a more shamanistic approach to entheogens.</p>"
}
