{
 "title": "I Told Them",
 "author": "Darkii",
 "citation": " Darkii. \"I Told Them: experience with PMA & MDMA (Ecstasy) (ID 10681)\". Erowid.org. Mar 31, 2006. erowid.org/exp/10681",
 "substance": "PMA & MDMA (Ecstasy)",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "PMA",
   "",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2000",
   "10681",
   "Female",
   "",
   "Not Given",
   "Mar 31, 2006",
   "21861",
   " "
  ]
 ],
 "report": "<p>Some time ago I ran into some of those nasty Misubishi's that were going around. I knew they were PMA and warned my friends not to take any. But they did not listen. I got to my friends house around 10pm one saturday night. Everyone seemed to be in a good mood and pretty normal. One of the girls that was there had already took a mitsubishi. After a couple hours she decided she wasnt not feeling anything and took a good pill that we had. </p><p>She seemed ok for about an hour then she got extreamly hyper and was talking REALLY fast. While she was talking 100mph she started rocking back and forth over and over very hard and was starting to worry me already. About 2 - 3 hours after taking the second pill she starting flopping on the ground and was pretty much uncounsous. She was VERY hot, was repeating the same words over and over 'I can not take it' and basically babbling not making any sence. Then she started twitching and violently kicking and spazing she was convulsing so hard that a 170lb man could not hold her down (and this was a tiny girl). None of us had ever seen anything like this. I finally realize she was way too hot and we take some of her cloths off and start pouring water all over her. </p><p>We turned the A/C way down and kept her wet. After doing this for about an hour and talking to her and making her count to 10 over and over and over she finally started coming out of it. I really think we were lucky this girl didnt die. Thinking back on this we probably should have took her to the hospital but it all turned out ok.</p>"
}
