{
 "title": "Learning Love Through Ecstasy",
 "author": "Turtle",
 "citation": "   Turtle. \"Learning Love Through Ecstasy: experience with MDMA (ID 10694)\". Erowid.org. Nov 20, 2001. erowid.org/exp/10694",
 "substance": "MDMA",
 "bodyweight": "135 lb",
 "header": [],
 "footer": [
  [
   "2000",
   "ID: 10694",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 20, 2001",
   "Views: 8698",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am writing this report as a general overview of my experiences while on MDMA and also regarding the after-effects I have felt. My usage ranged from infrequent (once every 4 months) to what I would consider quite frequent (thrice in a single week). The latter was the main reason for me giving up, not just MDMA, but all drugs. I must say too that this drug was particularly helpful in quitting both tobacco and pot smoking. But more on that later. First some history.</p><p>I grew up in a rather unique environment. My parents raised me as a Jehovah's Witness, a religion whose followers are meant to be distinct from the rest of society for the sake of protection from bad or 'worldly' influences. From grade school on, for example, I was forced to not participate in most traditionally bonding experiences that all the other children shared in. These included, but were not limited to: refusing to stand for the daily playing of the national anthem; refusing to salute the flag on Remembrance Day; not going to birthday or Christmas parties; not being able to participate in any after-school activities; and of course, I wasn't to help with the creation or putting up of Christmas or Halloween decorations nor even allowed to participate in Easter egg hunts. As JWs we were cut off from the celebration of ANY secular holidays and, as I'm sure you're all aware, a big part of grade school is the social aspect that children learn to share with one another in all of the above activities. These opportunities give in ways that's impossible for children to appreciate because they're just another part of learning (the reason why they are at school in the first place). It was little wonder to me even then why I was picked on. My sister and I might as well have been from the Addams Family. Never mind the fact that every Saturday we would go around rapping on peoples' doors at ten o'clock in the morning IN OUR COMMUNITY, earnestly beseeching that poor, unfortunate householder to join the ranks before Jehovah God brings on Armageddon and destroys all 'worldly' (meaning non-JW) people.</p><p>My point is that by the time I quit high school after grade eleven, I was completely depressed. But I didn't even recognize this because I was meant to persevere in hopes of being in God's favour. I never knew what it felt like to be even slightly happy, even as a child. My father wanted me to obey him like a sergeant otherwise I would be senselessly beaten. Expressing any opinion that was different from either parent was seriously forbidden. I'd get in trouble for so much as looking at them funny. (Apparently I would roll my eyes at them.) I learned to lie to avoid punishment (this would only sometimes work) and from the age of fourteen on I just kept my mouth shut and avoided contact with my parents as much as possible. This was a difficult task since I lived on a ten acre 'hobby' farm that I was forced to work on for hours a day. The folks of course saw this as an act of love on their part, as training their son to have a good work ethic. Someone should have told them that training someone by making them feel constantly ashamed of themselves is only ever counter-productive. Again this background serves to explain why my experiences on E were truly extraordinary; it's because I had no previous reference for feeling anything for anyone other then my sorry self.</p><p>When the drug takes effect I don't care where I am. Quite often I've been at some high energy dance space, surrounded with people, some of whom I know, but most I don't. Instead of clinging to those I know and LOVE, I enjoy the opportunity to connect with complete strangers. The funny thing is when I look into their eyes I see a level of understanding and acceptance as if they can tell that my interest in them is genuine as opposed to malevolent, or at the very least, self-serving. My usual lack of confidence in my ability to carry a light conversation dissipates and I find that I'm no longer plagued with a heavy heart. In short, I stop feeling sorry for myself and, feeling great, I look around for other people to build up, just in case theyre not. Even if they are, then the exchange is just that much better because, again, it gives the opportunity for two (or more) people to truly see each other as lovely, and indeed, as loving as they ever imagined themselves to be. I must mention too that this happened not just once, or a few times, but rather each and every occasion that I've taken this medicine.</p><p>Alas, in a few short hours it's pretty near over. Sometimes, to postpone the inevitable, I'd dose another tab after 90 minutes or so. This method assured me a good six hours of bliss. But at what cost? It is well documented that MDMA takes quite the toll on one's body. For the most part I found it helpful to drink ginseng/ginger tea, as well as 5-HTP (5-Hydroxytryptophan) before and after my trip. Still this only helps me to feel how I normally feel (commonly referred to as 'baseline'). And, as I've confessed, that's pretty insecure and miserable most of time. It complexes me to no end if I think about how I can't feel the love and compassion anymore because I once again have the weight of my world on my shoulders. I'm way beyond blaming any external forces for how I feel and hence, respond to those feelings. Even my parents I've learned to forgive, understanding that they too were raised in the confines of the same fascist beliefs that they tried to instill in me. They never knew any different. Indeed their sadness for me leaving the 'fold' ten years ago is still very great. But, getting back to the point, the reason I've given up E use is because it fails to offer me any lasting insight into the letting go of my past so that I can truly live and love myself as well as others.</p><p>So then the question could be asked: why did I title this essay 'Learning Love Through MDMA'? Have I fooled the enthusiast with a 'negative' drug experience? I don't think so. Not unless you believe and fully accept that one is fine to be on E anytime they want to feel ecstasy. I only did E to find out if I could truly feel love and empathy for others AFTER I came back to baseline. Perhaps one's Spirit would feel somewhat lifted after the experience. Indeed, this did happen at first. However the last few times I knew that in order to truly understand love I have to be CLEAR in my head, then work on my heart through meditation. In short, I believe in use of drugs until one gets the point. Or, as its been said of acid: 'once you receive the message, you're wise to hang up the phone'. It's been a long lesson; through MDMA, LSD, mushrooms, DMT, 5-MEO-DMT, Salvia divinorum, and caffeine. I've come around full circle to the knowledge that I just need to fully love MYSELF first, and then the rest fills in effortlessly.</p><p>God Bless.</p>"
}
