{
 "title": "My Regrets",
 "author": "Rainshadow",
 "citation": " Rainshadow. \"My Regrets: experience with Methamphetamine (ID 10700)\". Erowid.org. Oct 19, 2012. erowid.org/exp/10700",
 "substance": "Methamphetamine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10700",
   "Female",
   "",
   "Not Given",
   "Oct 19, 2012",
   "17169",
   " "
  ]
 ],
 "report": "<p>I've always been the type to experiment with drugs, actions, anything. I never want to say I regret not doing something, and I always figured I'd never regret something I did. I wouldn't go so far to say that I completely regret ever trying Crystal meth, but I do regret knowing all that I now know about it. I wish I didn't know how unconditionally happy I can be. I wish I didn't know how fun all people can be. I wish I didn't know where to get it from. I wish I didn't know how smart I can be on it. I wish I hadn't spent all my money on it. I wish I didn't know that if I wanted it, I could have it for free now. I wish I didn't see things in the dark now. I wish I could fall asleep without thinking my heart is beating way too fast. I wish I wouldn't wake up in the middle of the night chewing on my lips and cheeks. I wish I didn't see people who know I used to use all the time. I wish they wouldn't try to talk to me. I wish my friends didn't think less of me. I wish my family never saw me crying in the corner. I wish my mom could still look at me the same. I wish I could just talk about it, like I am now, without clenching my teeth and picturing white smoke coming from my mouth. I wish I didn't crave that white smoke. I wish I could drive at night, without things jumping out of the dark at me. I wish I didn't have to turn every single light in my house on at all times. No, it's not trying it that I regret, it's the fact that I couldn't stop at just trying. I had to keep doing it. And the fact that I couldn't strike a balance between doing crystal, and living my life. It was one or the other. And now I realize that I chose the wrong one.</p>"
}
