{
 "title": "Stationary Satisfaction",
 "author": "Kodos",
 "citation": "   Kodos. \"Stationary Satisfaction: experience with AMT (ID 10712)\". Erowid.org. Nov 20, 2001. erowid.org/exp/10712",
 "substance": "AMT",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "AMT",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "10712",
   "Male",
   " ",
   "Not Given",
   "Nov 20, 2001",
   "7390",
   " "
  ]
 ],
 "report": "<p>\nNOTE: Many people would say (and I think rightly so) that on board an aircraft is not an appropriate place to take psychedelics. Indeed, though I have tried this on a couple of previous occasions, I would strongly caution anybody else against trying it. The available medical support is completely minimal, even non-existant, should the need arise. You are unable to change your setting should you so desire, you are probably cramped, and surrounded either by sleeping people (on a night flight) or screaming children (on a day flight). Perhaps worse, you will on occasion be assaulted by the stench of airline food.</p><p>Even so, on one occasion I found myself on a long day flight with plenty of legroom (bulkhead seat), a good book, a wallet full of funky trippin' CDs, and a gelcap of 40 mg of AMT in my carry-on baggage. </p><p>I want to make it perfectly clear that I had experienced AMT several times beforehand, and was well aware of its effects on me, at a variety of doses. So it was with no concern at all that I took the gelcap as soon as we were airborne. I hadn't eaten that morning, and declined the 'food' they offered me, intending instead of make use of a few apples and a big bottle of water I had with me, should I need them.</p><p>I didn't. Not only wasn't I hungry -- I wasn't cramped, upset, twitchy, nervous, bored, tired, or even merely resigned, at least after the AMT came on about 1.5 hours later. In fact, so comfortable was I with exactly where I was and what I was doing, that the book I'd bought for the flight disappeared page by page beneath my roving eyes, until there were no more pages left. I listened to many of my CDs -- at least, I think I did, as there was a different disc in at the end of the flight, though I don't remember changing them. Yes, there were visuals -- when I looked up and paid attention to them. I wouldn't have been able to work, but light reading takes so little brainpower that it runs itself.</p><p>All in all, I was surprised. I was still tripping lightly when I landed at my destination (this was a *long* flight -- 14 hours), but at no time during the flight did I want to get off, get out, or even change things.</p><p>I won't be doing it again, though. If my intent is to sit still, read a book and listen to music, then I can do that without AMT. And although it wasn't boring, it certainly wasn't interesting either. The only benefit I can discern was that, for once, I didn't feel like I couldn't wait for the flight to be over.</p>"
}
