{
 "title": "To the End of the Universe",
 "author": "Pheonix",
 "citation": "   Pheonix. \"To the End of the Universe: experience with Salvia divinorum (ID 10728)\". Erowid.org. Apr 27, 2007. erowid.org/exp/10728",
 "substance": "Salvia divinorum",
 "bodyweight": "54 kg",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10728",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 27, 2007",
   "Views: 2704",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I tried a drug called salvia yesterday for the second time. From what I understand it is a halucinagenic drug which has been used for a very long time in shamanism and the like. A long term friend of mine who I trust implicitly introduced it to me. I have tried a multitude of other drugs and had mixed experiences, though all good. This, however, was not good at all. </p><p>The first time I tried it. I was fine a bit startled but I kept it together. No lasting side effects (that I know about) and no brain mush feeling like other drugs. My mistake was underestimating the drug. And little knowledge of it too.</p><p>I decided to try it again. I had been told that the experience could be thrilling and was described as the high of highs. As a dragon chaser, I have always sought that.</p><p>But it was also where I was to receive the most terrifying experience of my life.</p><p>This time, as before, I decided on 2 cones. I was sitting on the bed at my friends place. I took back the first one easily but about halfway through the second I felt something pulling me. I lent back to place the lighter on the side table and passed the bong to my friend. I thought I leaned back to lay down. As I did I heard him reach 20 seconds holding and I tried to expel my lungs. As I did I realized I could not breathe and my reality then turned inside out. My mind screamed over and over IcantbreatheIcantbreatheIcantbreathe.</p><p>I think then I might have blacked out but I barely remember seeing my friends head in my hands with me saying something. My line of sight seemed to be ripped to the right, with an empty blackness replacing it. Though what was behind me was real/normal. The blackness looked as though what I was looking at was the end of the universe. Or what had not been made yet. Somewhere in my mind I realized I had to get back and through my mind I traveled the various systems of stars back to our own, then to our planet; Country; State; Town; My friends house; To him.</p><p>I felt a sharp clapping noise at every step I took towards home and each clap felt like it was trying to push me back to the blackness. I then heard my friend telling my to hush and that it would wear off soon. That seemed to be the time I came back to reality. Then the blackness closed, though it still ripped apart every second or two, and I saw my friend again. I felt cold in my hands and saw that I had moved off the bed and was now standing at the head of the bed with the head boards metal pole in my hand.</p><p>I turned on the light and when I felt my vision come back a bit we moved outside. (10mins) I felt the blackness pull at me for about half an hour, trying to rip my reality apart again. After about 45mins my I was feeling as I did the first time; Reality Seperation, Surrouded by aura, Floating, Electrical current through and surrounding the body. It took about 2 hours all up to wear off completely. I was petrified my mind was gone. But it got worse because what I have written is what was happening in my mind. What was happening in the real world was far different and much more disturbing. My friend described it in detail to me.</p><p>After I took back the second bong, I put the lighter on the table and passed the bong back. But when I felt myself lay back I was not. I sat bolt upright and looked at Ronnie then into the mirror behind him. Then I looked around. My eyes were clouded and unseeing. (30 to 45 secs) I reached out for my friend at that time and he thought it was ok. Then I snapped back to focus and said Whats happening to me. Then I jumped away from him like something had pulled me away. (1min) Then I started kicking my legs furiously, as though I was running whislt in a sitting position. Then I flipped onto the bed and began pushing myself in a circle with my legs on the outside and my head at the center of the circle. I was going very fast though. My friend described it like I had been spun like a top.</p><p>I was yelling from the start saying Not good, not good, phase three phase three, No NONONO, phase three, not good and various combinations of those words repetitively. (1min to 7mins)Then I started crawling around on the bed. Then I got up to pull myself to the bed head. (8mins) I cant remember hearing anything at all during that time and I do not remember what happened in the real world'. Or really what happened to me...</p><p>I learnt the most valuable lesson. It is NOTHING like anything else.</p>"
}
