{
 "title": "Psychedelic Experiment: Quest for Visuals",
 "author": "muschi",
 "citation": "   muschi. \"Psychedelic Experiment: Quest for Visuals: experience with DPT & 2C-T-7 (ID 10727)\". Erowid.org. Jan 5, 2002. erowid.org/exp/10727",
 "substance": "DPT & 2C-T-7",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "35 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   "  T+ 2:30",
   "150 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10727",
   "Male",
   " ",
   "Not Given",
   "Jan 5, 2002",
   "14823",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was at a friends apartment and we had been discussing psychedelic drugs.  I mentioned that while I have taken large quantities psychedelics in the past (LSD, mushrooms)I have never had what I would describe as a 'psychedelic experience'  </p><p>One of the main things I would never experience is visuals.  I would always hear the great stories about awesome visuals... but, to much dismay had never experienced this for myself.  (and I have certainly tried!  10+ hits of really strong LSD that has everyone else floored... and i just get a very intense body high... and maybe a slight tracer or two)</p><p>Anyways... he said to me 'I am going to give you some drugs, and you are going to have visuals'  I replied that sounded great to me, and he proceeded to bring me a white powder which he then weighed on a scale to 35mg.  I asked what it was, and he said 2-ct-7.  I was familiar with the substance, dissolved it in water and swallowed the nasty liquid.</p><p>I anxiously awaited for something to take effect.  Nothing.  After about 1 hour I felt a mild body high simular to how I feel on LSD.  I waited another hour and still could not really feel the effects of the drug... I mean, they were there... but very minor.</p><p>I told him 'im not really feeling it.'  He told me 35mg is a fairly large dose... and that I should be quite high.  I said I was not.</p><p>At this point he got frustrated and said 'ok... I am going to give you something now and you are going to have visuals'  He went to the cuppoard and got another white substance.  I asked what it was and he told me DPT.  I was not familiar with this drug, so I asked him a few questions about it... I asked if anyone had ever combined the two before.  He told me not to his knowlege.</p><p>I was about to poineer new ground.  About 2hours and 30minutes had passed since I ingested the T7.  He measured out 150mg for me and cut it into two lines.  I snorted one in each nostril.  It was pretty harsh.</p><p>He said the effects should take place within 20minutes.  I laid down on the bed and he put in a CD (funki porcini).</p><p>I waited and suddenly I started to feel very strange.  This feeling rapidly shot up...  And then a very funny thing started to happen.  I closed my eyes and colorful swirls & geometric shapes started to appear.  The music became more intense and these shapes and colors began to morph to the music.</p><p>This was bizarre!  I have been taking psychedelics for over 10 years and never experienced anything like this!  Suddenly these colors and shapes morphed into animated caracters.  It was like a music video inside my head.  Absolutely incredible.  Mind boggling.  This lasted about 1hour. Intense closed eye visuals.  If I opened my eyes it was kind of like looking thru a frosted glass, everything was distorted, so I chose to keep my eyes closed.</p><p>The comedown was pretty harsh (but short).  I lay on the ground twitching, unable to move, yet concious.  Somewhere between comatose and awake, yet I felt there was no harm or risk involved.  Eventually I could walk again... and decided to have a bite to eat.</p><p>In the end it was a truely amazing experience.  I have tried DPT since then by itself, thinking this was the substance thaht caused this... at 150-250mg doses on (3) occasions.  It has given me a strong body high, but no visuals... so maybe it just took time for T7 to kick in... or maybe the combination created a whole new experience... Who knows.</p><p>Definately worth trying once.</p><p>-muschi</p>"
}
