{
 "title": "Overwhelming Feelings and Long Duration",
 "author": "Devilman",
 "citation": "   Devilman. \"Overwhelming Feelings and Long Duration: experience with AMT & Cannabis (ID 10739)\". Erowid.org. Feb 25, 2002. erowid.org/exp/10739",
 "substance": "AMT & Cannabis",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "AMT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10739",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2002",
   "Views: 7540",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA psychonaut friend of mine gave me his last bit of AMT. It wasn't weighed out, but by judging how it fit in a gel cap-we assumed about 50mg.  I ate the cap and went home to get comfy.  It was my first time with the substance.  My girlfriend came home around 1:00am.  We smoked some weed and I actually kinda forgot about the AMT (I made some phone calls and a few friends popped in and out of the apartment).\r\nSuddenly, I went to choose a CD and couldn't read the titles because of the visuals I was getting.  'Im tripping nuts' I said to my girlfriend (who is usually my sitter).  I enjoyed the trip which mimicked an LSD trip to a T. I was describing my thoughts and listening to music, when out of nowhere I could feel the trip wanting to go higher.  Im an experienced psychedelic user and knew what to expect-so I thought.  I was fully aware that the drug was taking me to a spiritual place (this is in no means a party drug).  When this part of the trip kicked in-it was totally crazy (the term I kept repeating) everything was so 'high'.\r\nMy girlfriend has a very intense and powerful aura that I can usually 'see' when Im tripping.  This nite her aura was blazing!  Her face seemed sunburned from the energy she was putting off.  Her hair even became the same color and I couldn't tell it was hair (told you it was high).  The same energy radiated from the palms of her hands as well.  She was getting tired and we retreated to the bedroom to lay down.  My vision was starting to betray me.  Her face distorted to the point of a Picasso painting and eventually I was practically blind.  I recognized her by touch and smell.  This was very intense but I wasn't scared-very confused.\r\nI became dissociated several times: thought I was in another apartment, I would pick up a glass of water and thought someone was handing it to me.  I also became detached from my body, but it wasn't like an out of body experience.  I got impressions and imagery of how the universe worked and how we (humans) energy seemed to be part of that even though I felt incredibly insignificant and small.  I was also getting impressions of native, tribal symbolism and icons.\r\nBy this time she was asleep and I was on my own.  I couldn't get comfy, so I traveled from room to room trying to ride it out.  This was 7:00am and my mother was due to show up at 12:00pm.  The 'come down' was rough.  I had to face myself.  I felt really peaceful and strong ties to my family and close friends-regular day-to-day life seemed unnecessary and unimportant.  I could not sleep or even focus on one thing.\r\nEventually I could feel the drug wearing off (slowly) and when my mother arrived I was still tripping.  Her presence really warmed my soul.  I gave her a big hug and told her about the previous 14 hours.  This drug is incredible but should only be experimented by users who know their shit.  An inexperienced user could easily freak out.  I was still affected some 26 hours later and was mentally wiped out for the next 3 days.  This is heavy shit at high dosage.  You may have a very interesting journey but beware of the overwhelming feelings and long duration.  I also advise a sitter on this and maybe even take notes, which I will do next time.\n\n\n"
}
