{
 "title": "Rethinking Frequency of Use",
 "author": "Kopentac",
 "citation": "   Kopentac. \"Rethinking Frequency of Use: experience with GBL (ID 10747)\". Erowid.org. Apr 1, 2008. erowid.org/exp/10747",
 "substance": "GBL",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "GBL"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10747",
   "Male",
   " ",
   "Not Given",
   "Apr 1, 2008",
   "Views: 6469",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>GHB/GBL has been much maligned in both the press and even the alternative communities as a dangerous and addictive substance. I personally have seen way too many people 'O.G.' on this drug, consume it chronically and irresponsibly, and use its disinhibiting effects as a springboard to week long drug binges.</p><p>I have used GBL for about three years. I went into it knowing of its abuse potential, and have been very disciplined about my intake. I have never had a problem with it. This is what I have learned:</p><p>1- Using GBL more than once a week significantly shortens the amount of time I spend in the euphoric state, and increases the sense of sleepiness and dizziness. This is a drag.</p><p>2- Using GBL no more than once every other week consistently produces the most reliably euphoric highs.</p><p>3- Using GBL no more than once a month allows the euphoric highs to manifest some therapeutic potential, leading to sensations of insight and spiritual understanding, especially if combined with proper set and setting, usually meditative breathing exercises. Used infrequently, this drug thus becomes more entheogenic, but to a much lesser degree than such major teachers as peyote, ayahuasca, or possibly MDMA.</p><p>I have also spoken to about a dozen other people (11) who reported a significant decrease in depth and quality of the high when GBL was used more than once a week. In four of these cases, my recommendation to reduce intake to once a month was followed, and all four reported that the full depth and magical qualities of the intoxication had returned.</p>"
}
