{
 "title": "Unlocking the Inner-Mind",
 "author": "Jacob M.",
 "citation": "   Jacob M.. \"Unlocking the Inner-Mind: experience with Cannabis (ID 10742)\". Erowid.org. Feb 26, 2005. erowid.org/exp/10742",
 "substance": "Cannabis",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10742",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 26, 2005",
   "Views: 5505",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had just bought a dime of incredibly potent marijuana. I and my best friend set off to walk around his neighborhood smoking the herb of God. We rested in a cut off section of our library and smoked 4 bowls. We headed off to the tennis courts and smoked 5 more and finally went to this ditch filled with vegetation and smoked one more. </p><p>I sat down with this intense ecstacy knowing that the two barriers to my life were melting away, paranoid schizophrenia and manic-depression. I began to feel my body in a way that I never felt before. My skin was this blanket embracing me and being me at the same moment. I could explore my mind without prejudices or barriers to see the inner workings of my mind and I saw beauty. I was at piece and felt the wisdom of all those who had came before me and all those who would come. I understood how to help myself and how to quit drowning in this abyss of insanity. Every time I felt the rise and fall of my chest breathing I was happy with every second that I lived. In my mind I saw why people act as they do and what I can do to help them. I found purpose in all things and tried to contain these feelings of love and compassion that I felt for everything. All grudges were off. Nothing that was evil could infect my mind and I entered a complete state of chi. I walked back to his house and put in my favorite band korn. I felt the emotion and pain and distorted mental process of a man who was raped of a normal life. It was a sad moment but I wasn't depressed, I felt depression without becoming it. </p><p>It was then that I had reached a new level of humanity where all emotions are felt and all ideas are considered and I embarked onto this new level of existence and felt joy in knowing that I had someone to share this moment with and remind me of this experience that truely changed my life for the better 10 fold. I was set free in ways that aren't capable of expression. I fell gratitude for this moment and will treasure it and all the ones like it forever.</p>"
}
