{
 "title": "Video Games and Devils",
 "author": "?",
 "citation": "   ?. \"Video Games and Devils: experience with Mushhrooms (ID 10772)\". Erowid.org. Feb 26, 2007. erowid.org/exp/10772",
 "substance": "Mushhrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10772",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2007",
   "Views: 2718",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was Thanksgiving, and I had been very excited to see my cousin's once again simply because I knew they did drugs and I was interested if I could get ahold of any magic mushies. Over the previous few weeks my 2 friends and I wanted to trip.  So I arrive at my cousins for Thanksgiving.  I get on the subject of drugs not wanting to rush into the shroom topic.  After a few minutes of a conversation, I popped the question, 'Do you know where I could possibly get any shrooms?'  To my suprise my cousin answered 'As a matter of fact I have a lil more then an 8th' I was so excited immeditly we left the house and went to go get the shrooms. \r\nAbout 30 mins later I was dropped off at my house with the shrooms I thanked him. I quickly dashed into the house to call my friend. He came over and we called our other best friend.  On his arrival we ate the mushrooms. Just sitting around waiting for the magic to kick in we began to roll a zig.  After it was finished we went outside to have a smoke.\r\nBout half way thru the zig my friend started to trip and noticed stange figures in the yard.  He started to speak about the universe and saw an elf.  He becamed worried so me and my other friend took him to my room.  There I began to trip, I noticed the posters in my room began to move and become life-like.  Then I heard my front door open.\r\nI realized my mother had just got home from the Thanksgiving dinner. I was worried and panicy but still tripping. She came in my room and asked why it smelled like smoke we all replied we didn't know, after realizing my mother did not know we were fucked up, me and my friend went and spoke to her.  Still tripping bad, I had fun talking to her and so did my friend.\r\nMinutes past and we decided to go to my friends house where we would end up staying the night, and we got in the car the outside world was nothing I recognized.  Reaching my friends house the shrooms begin to hit me hard. I was now seeing colorful patterns everywhere and the walls were beating like a heart.  I stared in amazement.  I felt so happy, everthing was great and so colorful.  The room was decorated in black lights and fake cob weebs we saved from Halloween.\r\nMy friends was tripping thinking he has a mass swarm or ants on his head, he said he needed ant killer RAID.  Next thing we knew me and my friend were tripping thinking we were in a nintendo game and our other friend was the devil.  We kept transforming with horns and he had a red shirt on.  We both became scared and told him to remove the red shirt.  He came back and his lil brother came into the room with a Scream mask on and was tripping me out so bad.  We started to rip away and pillows and take out the fluff. It was so soft it felt like a life saver.\r\nAfter tripping for 2 hours now, I noticed I lost track of time thinking it was bout 1 am in the morning, I looked at the clock to notice it was only 11 pm I was amazed.  I felt like taking a piss so I entered the bathroom, after done I washed my hands and my face. I briefly looked up in the mirror to see my friends lil brother with a knife cutting off a stuffed bunny's head, I felt scared but knew I was only seeing things, but I turned around and it was real. I quickly ran to my friends room with his brother on hot pursuit of me I jumped in his bed.  My friend kicked his brother out of his room.\r\nAfter a few minutes I felt the shrooms wearing off, so I suggest we roll another zig, my friend rolled 6 for us, 2 each.  He began our journey out to my friends barn, we all stopped out side the doors of the barn and started in amazement.  The barn was gigantic growing as we spoke, it looked bout 50 ft high in the air.  A bit scared we entered the second floor of the barn, and lit the candles, as I begun to smoke the zig, I became very buzzed and felt the best I had all night very warm and happy.  \r\nI glanced over to my friend, to notice he was in a deep trance.  He began to moan in pain, I questioned what was happening, and he said it was far to scary to explain.  My other friend began to get the same trance, but deeper.  He became very depressed and sad looking. Minutes later he came out of his trance and we all finished smoking.\r\nAll of us had ended our trips and were completly sober.  As we climbed the ladder down the stairs and out the barn door, we discussed we should now do.  As we were walking towards the house I saw a deerlike figure dash across the grass, and let out a scream, my friends were startled and ask me what I was screaming at.  As the thing came back into the house they got scared very bad.  The 'thing' ran very fast but made no noise and left no tracks. We had no idea what it could of been knowing we were in the middle of the city and deer do not come around.\r\nAs we started to put the puzzle together, I remembered that last thanksgiving a year ago, a goat had been slaughtered by some type of animal.  I told my friends and they also became scared and remembered.  We still don't know what it was, knowing that every Thanksgiving that creature must come back for something.  So that was one trip that was quite amazing, I can't wait to do it once more.\n\n\n"
}
