{
 "title": "Suprising",
 "author": "Strumpling",
 "citation": " Strumpling. \"Suprising: experience with Mushrooms (ID 10794)\". Erowid.org. Feb 23, 2002. erowid.org/exp/10794",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Mushrooms",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "10794",
   "Male",
   "",
   "Not Given",
   "Feb 23, 2002",
   "6592",
   " "
  ]
 ],
 "report": "<p>\nI had done shrooms probably 5 times before, in amounts of up to 8 grams, but these shrooms were 'different' </p><p>There were POWERFUL! REALLY powerful! They made it seem like those other shrooms I'd taken before didn't even COUNT. </p><p>Here's the story: </p><p>My friend and I ground up 6 grams of these mushrooms each, and made some tea. After downing the tea, we each took our place (a couch for each of us). I've noticed that with shroom tea it seems to hit people a bit faster and harder than with eating them straight. Anyway, they hit us. </p><p>The unease, nervousness, and nausea came and went without a hitch, as usual (I wonder why the nervousness happens every time - seems like I'd get USED to it). We settled down for the first hour, holding out on smoking pot until we felt we might not be able to - and we now did. </p><p>We both commented at the exact same time that 'we should smoke pot now' and we did. The shrooms were quite powerful, and the pot kicked them into full gear. Within 10 minutes of smoking the 3rd bowl (we did 3 in a row each), I was tripping 'harder' than I had ever imagined possible (heard THAT before, huh?). One second i was wondering if i was invincible, and the next second i got NAILED by a surge of energy and flopped off the couch, onto the ground. I didn't even notice; I wasn't really paying attention to my body. My mind was in a different place. I was thinking about life in general (if it can be called thinking) and the connections we make with every person we meet. I felt little bits of everybody I'd met showing in me; the way I speak, the way I look, the way I act; it's all been done before; nobody's original, we're all just animals struggling to live. These thoughts were not nearly as organized and to-the-point as my previous mushroom trips (where the whole trip, my thoughts would be going on ONE general direction, and everything would finally tie itself together near the end; destination reached); Maybe they were, but I was definitely not in good enough shape to make the connections that were trying to be made. </p><p>Suddenly I remembered that I was actually a human being, and that I had a body, family, friends, and home, and stove, and tea kettle, and had used that kettle to make mushroom tea. I wondered if my body was OK. 'body?' i was thinking. 'body, are you there?' </p><p>Every time before this trip that I had taken shrooms, I was ALWAYS 150% aware of my body, and everybody around me. INTENSELY aware, actually. More aware than usual. These shrooms at this dose, however, had knocked the senses right off of me. It was like I had forgotten that I even had senses, so had stopped interpreting the data from them. </p><p>Now that I was paying attention to my body again, I noticed that I could in fact *SEE* </p><p>My eyes were working. I was seeing objects and shading, but nothing was in focus. 'hmmmmm,' i thought. 'how did these eyes work again?' I started 'doing stuff' with my brain and finally moved my eyeballs. 'that's IT! i can focus them! i can move them,' i thought, excited. I focused on whatever was in front of me, and noticed that I was on the ground next to the couch. I made a noise, kind of a 'gurrg' and saw my friend move. I focused on him and saw that he was laying there peacefully, with his eyes closed. </p><p>Wow, he seemed to be taking these 6 grams a bit more like a champion than I had. I kept moving my eyes around, looking at different things; then I remembered that I had other senses, and I even had LIMBS that i could use to move around with. After some work, I stood up, swaying back and forth, then sat down on the couch. My friend heard me, opened his eyes, and we both said 'we should smoke some pot now' </p><p>Although I did not learn much about myself from that trip, the physical and mental experience was probably the coolest thing I've ever been through. Since then I've taken the same shrooms, a bit more prepared for them, and have come away a better person.</p>"
}
