{
 "title": "Eternal Terror, Fear and Torment",
 "author": "JJ",
 "citation": "   JJ. \"Eternal Terror, Fear and Torment: experience with LSD & MDMA (ID 108)\". Erowid.org. Jul 19, 2001. erowid.org/exp/108",
 "substance": "LSD & MDMA",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "8 hits",
   "oral",
   "LSD",
   "(gel tab)",
   " ",
   "2 capsls",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "1999",
   "108",
   "Not Specified",
   " ",
   "Not Given",
   "Jul 19, 2001",
   "Views: 27379",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nWell, the trip started out beautifully.  I had taken the X a couple hours before I dropped the acid.  I was looking for a beautiful, heavenly experience.  A pure enlightnening peaceful exploration of my consciousness.  And it started out fine.  I found myself in the most beautiful trance, thinking about the future of mankind, seeing a visual map of man-made creations that are yet to come.  A map of the future.  I thought, this is what we are supposed to be'.  This is the future of mankind, beautiful colors, powerful machines, and sooo much love.  And then..</p><p>My friend A came over to me, looked me in the eyes and said 'Are you okay?'  I thought.. 'Am I okay?'  then my whole world shook.  'What if I'm not okay?'  I thought..  I could sense a strong strong netted vibe that suspended between the 4 of us.  I could feel the feelings of everyone in the room, and it became clear to me that each one of us was responsible for the experience of the other.</p><p>I saw something dark.  I thought, 'I can't be around these guys if I start having bad thoughts.. They must stay happy!'  So, I raced into the bathroom as the darkness began to take over my thoughts... I could no longer see what was in front of me, I was so engulfed in my thoughts.. The pure unadulterated fear that something bad is going to happen.  </p><p>After 3 or 4 minutes of searching for the light switch, I came out, decided that in order to save the other 3 voyagers, I have to get out and get my head straight.  So I ran out the apartment.</p><p>This voyage became the scariest thing I've ever experienced.  My mind was functioning on 2 levels, pure fear, and a voice inside my head rationalizing and trying to figure out what was going on.  Suddenly anything and everything became ugly, scary, terrifying.  The gutter, the trashbags, the road workers, the oil on the street... it all disgusted me, and I had nowhere to turn. the earth's evilness was swallowing me whole.  I pissed my pants.</p><p>About this time, the other three emerge from the complex to see me darting around in fear, sock-footed, in the middle of the parking lot.  I see them, think that they're part of a cult and that I've got to get away from them.  They grab me, and a violent struggle commences.  My friends become demons dragging me into a horrible place I do not want to be.  The trip gets worse.  I begin to think that the more I struggle to be free, the better chance I have of getting in to heaven.  And then I give in for a few moments, get a glimpse of the terror of hell, and begin struggling for a positive eternity again.  They carry me into the apartment, and visions I conjured up at an early age begin appearing.  I cannot describe the fear.  They take me, and put me in the shower to hose me off (bad idea)... I see myself in the mirror, and it is covered in blood..  I see the toilet, I am disgusted to the point of puking..  I let out multiple grunts and horrible yelps.  I am being tortured in hell.  </p><p>Then my first glimpse of eternity arrives.  I realize, I am here in Hell forever.  This will go on forever.  For one last instant, I give in, and submit to the demons... I see the devil, only... it looks like me.. and I can see the pure evil inside..  I let out a bloodcurdling scream, and the others in the room realize that I am experiencing something truly horrible.  Now I've got them.  I have conveyed my terror.  I am horseshit.. rejected by God.. He's so far away from me now.. </p><p>I walk alone into the other room... the others try to stop me, but I let them know that I need to be alone.  I lie down.  I look at the wall.  'Oh my God.. I'm tripping.'</p><p>And the true sadness and realization starts.  One of my friends comes in and asks 'Are you okay?'  I look at him and say 'I've seen the devil.  I didn't want to... but I saw him..'  He comes, lays his head on my stomach, and I realize that everything is alright.  But it won't be over for a looong time.  </p><p>I have this trip embedded in my mind, and it will take years for me to forget.  It has sent me into a horrible depression that I am currently fighting.  I suffer horrible mental problems because of my experience.  My mind is stuck on seeing the bad in life.  I think about the positive, and the complete opposite arises.  If anyone else has had an experience even remotely close to this, please submit it here, and describe how you have dealt with it.</p><p>I have quit all drugs... I cannot take them without them sending me off my rocker.  Why did this experience take place?  I often think I'm just a sick person.. but others tell me that it could have happened to anyone.  who knows.. I need a witness.</p>"
}
