{
 "title": "It Changed my Life",
 "author": "Veruca Salt",
 "citation": "   Veruca Salt. \"It Changed my Life: experience with Ephedra (ID 10839)\". Erowid.org. Apr 12, 2007. erowid.org/exp/10839",
 "substance": "Ephedra",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   " ",
   "Ephedra sinica",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10839",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 12, 2007",
   "Views: 21640",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I take about 40mg of ephedra on a daily basis.  This is my third year of taking it.  I started taking it a year after I started smoking weed.  I don't reccommend new users to take 40mg I only do it because I've built tolerance to it.  When I first started taking it I weighed 200 pounds.  I didn't start taking ephedra to lose weight; I started taking it for energy.  Ephedra makes me ready for action, sometimes I feel like I can take on the world and I'm definetly more talkative and outgoing after taking it.</p><p>I guess having all that energy, running around like a maniac, and the fact that ephedra boosts metabolism is why I've also managed to loose 80 pounds.  Not only that but the asthma that used to plague me as a child has dissappeared as ephedra helps open up the bronchial tubes.  The common culprit of ephedrine related problems comes from ECA stacks which are combinations of ephedra, caffinee, and asprin.  Ephedra shouldn't be combined with caffinee, and asprin thins the blood out.</p><p>I've found that once I started taking ephedra, I wouldn't get cottonmouth when I smoked weed, and I still don't.  I have these hyper highs where the world just suddenly makes complete sense to me, like I've been suddenly enlightened and I have to share these revelations with all the people I'm around, ofcourse when I sober up I find that what I was thinking before was really way off track and mostly ephedra induced ramblings.  I still eat normally but my appetite isn't close to what it used to be.  I sometimes have trouble getting to sleep and occasionally I get jittery.  </p><p>Ephedra and weed makes me real paranoid so I try to avoid getting high in places I'm not comfortable with.  The dizziness and heart palipitations I started getting about a year ago stopped after I began drinking 8+ glasses of water a day.  I love ephedra but this stuff is addictive.  I think I would be able to give up smoking cigarettes before I stopped taking ephedra.</p>"
}
