{
 "title": "7 Years of Bad Bullshit",
 "author": "barly alive",
 "citation": "   barly alive. \"7 Years of Bad Bullshit: experience with Heroin (ID 10853)\". Erowid.org. Feb 13, 2003. erowid.org/exp/10853",
 "substance": "Heroin",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2001",
   "10853",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 13, 2003",
   "23115",
   " "
  ]
 ],
 "report": "<p>The first time I tried heroin was when I was 13 years old. It happened at one of my brothers parties.  I'll never forget it because it ruined my teen years.</p><p>Here goes my story: It was 7 years ago and I was at my brothers apartment with alot of my brothers freinds partying and smoking weed hanging out shit like that. I was there for about 2 hours and even more people showed up, they were there for about 15 minutes and my brother kicked them out for bringing heroin there, on their way out one of them looked at me and asked if i wanted to smoke with them, so I said sure and followed them to their car. We all got in and one of the guys asked if I knew how to smoke, I said yea that i've been smoking weed for a while, but then he turned and looked at me and laughed and said not weed fool, heroin.</p><p>After he said that my heart dropped to my stomach. So I watched them put a brown powder on some tin foil and add a few drops of water, then take a lighter and heat the bottom and suck in the smoke, when it got to my turn I didnt want to do it but they said it was like weed and they would help me smoke it. I said ok (which was the WORST mistake of my life) I watched as he put the lighter under the tin foil and then the smoke started forming and I sucked it threw the tube. It tasted kind of nasty but it hit me no later it took for the taste to get of my mouth.</p><p>I loved it, so he gave me his phone number and said if I need more to ask him. The next day i convinced one of my freinds to go in on a bag with me, after about 2 hours I finally did it. After I got the bag that day we went to my mom's house and smoked it there because she was at work. We smoked it and flew to the moon and back. Well the next day I wanted to get more but was short on cash so i robbed some thing at school for about $200, I called my guy from school to have him pick me up. He got at school about 5 mins later and i bought $150 from him and him take me home so I could smoke.</p><p>Well after about 4 months of smoking heroin with my freinds day in day out I went on my own and started injecting it. After about 6 years of injecting heroin, being in and out of hospitals due to overdoses I knew my  life was a big joke, my family didnt want me around, most of my freinds are dead due to overdoses ( I guess I was lucky) and all I was doing all day was finding a way to get my fix, lieing, cheating, stealing.</p><p>Finally got some sense one day while shooting up and went to get presribed on methadone. I started methadone and it took about 8 months to get me clean off heroin. in all, that shit ruined my life, killed most of my freinds, and left me a high-school drop out with no diploma and future. Its been 3 months since my last methadone treatment and i am living back at my moms doing fine.</p>"
}
