{
 "title": "Bad Feeling",
 "author": "TheGelcap",
 "citation": "   TheGelcap. \"Bad Feeling: experience with Datura Stramonium (ID 10875)\". Erowid.org. May 22, 2002. erowid.org/exp/10875",
 "substance": "Datura Stramonium",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "150 seeds",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10875",
   "Male",
   " ",
   "Not Given",
   "May 22, 2002",
   "Views: 14766",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n        I have been loking for a legal alternative to drugs for quite some time now. I am in the military so i have pretty much put my drug use on hold. One day on a walk in the woods my wife found what she believed to be wild growing morning glories, but she wasn't sure. I told her to go to the vaults. (when in doubt, where else?) She found out that the flower she had picked was from datura stramonium. I was extremely excited because i had been wanting to try datura for some time now. I have had a good bit of experience with acid, mushrooms, dxm,and peyote. But i have never been able to (probobly from lack of trying) find datura. </p><p>We cracked open a seed pod and me and my wife both counted out about 150. Chewed them up and then i decided to make dinner. About 35-40 minutes later i started feeling a little dizzy and had cottonmouth so bad that i had to keep water in my mouth constantly to keep it from drying out completely. I couldn't even eat there was no saliva at all. I started to feel really weird. I tried to sleep but it was like every part of my body was trying to move by itself but the confinements of my flesh was stopping them from doing so. It was not painful just uncomfortable as all hell. I finally fell asleep a few hours three cold showers and what seemed like 30 gallons of water later. I had extremely vivid dreams of talking to friends back home. It was like they were here. At one point i told my wife that i had been talking to Josh and she told me that i hadn't called anyone back home for a few weeks. I don't think she knew what i was talking about. And all the next day i was getting hallucinations, audible and visual. I heard cats meowing in my office. My eyes wouldn't focus for shit. The pattern in the carpet seemed 3-d. And people kept coming into the office and standing next to my desk. I would ask them what they needed, but when i looked up they would dissapear. A few days later my eyes returned to focus and it's like nothing ever happened. I plan on experimenting a little more with the plant. I will get back to you with the results. Also i have transplanted a very healthy plant to my living room. </p><p>My cat has eaten about 10-20 of the leaves. I don't know what the long term effects will be on her. Or even if it will kill her. But one thing i can say is that it is funny as all hell. I know that sounds sadistic, but there's just something about a cat walking into a wall, falling over, and then looking at the wall like 'where the hell did you come from?' But seriously, this is the third time i have heard of cats eating datura (my friend had a plant that his cats got into a few times.) Be careful with your datura around your feline friends..</p>"
}
