{
 "title": "Really Fun, Once in a While",
 "author": "Zippy",
 "citation": "   Zippy. \"Really Fun, Once in a While: experience with Methylphenidate (Ritalin) (ID 10899)\". Erowid.org. Jan 4, 2005. erowid.org/exp/10899",
 "substance": "Methylphenidate (Ritalin)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Vitamins / Supplements",
   "(pill / tablet)",
   " ",
   "60 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   " ",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 10899",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 4, 2005",
   "Views: 26845",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFor two days I had been taking 40mg of ritalin orally for a 'pick me up' in the morning because I start out sluggish as all hell. At that dosage I felt a bit euphoric for about 3 hours and I could feel that my heart rate would go up slightly. I felt a general sense of well-being and was more energetic, nothing overwhelming. The next day I didn't take the 40mg in the morning because I just didn't feel like it. That night I decided to see what 60mg would do, so I took 3 20mg pills around 10:30pm and they started to kick in about 30 minutes later. I'm gonna guess it took 30 minutes because I ate something prior to taking the pills, along with a multi-vitamin and a b12 vitamin. then I had a cigarette. I don't take pills on an empty stomach because if I do my stomach gets all nasty. My general mood at the time I ingested the pills was just 'normal', not overly excited or depressed about anything. <br>The first thing I felt was happiness and a desire to be around people I love. It was like all my positive emotions were greatly amplified, nothing could ruin my mood. I was feeling relaxed and extremely happy. I wanted to be held and to hold someone. Another effect I noticed was that I was very horny, maybe it's just me. I also felt kind of amorous at the 40mg dose, but to a lesser degree.<br>Physically, I felt kind of jumpy, like when on speed or after too much caffeine. I don't like speed at all, it makes me tense and uncomfortable. But the way I felt was pretty mild and pleasant. The only negative side effect I had was a dry mouth. An annoying problem, but easily solved with water.<br>Three hours later (1:30am) I was still euphoric, my heart rate had gone down and I was still very calm and peaceful. The happiness I experienced at the beginning of my high was still there, though not as intense. I had no desire to sleep, I just wanted to do something. So I played video games until about 5am then went to bed.<br>I'm trying to quit smoking, and I've cut back to about 5 a day. I think this may have affected how I felt while on ritalin, I had one smoke all day and I lit one up during the first hour and I felt more calm and at ease. I didn't feel like having another cigarette all night after that.<br>In retrospect, I'd have to say I really enjoyed this drug. I'm not gonna take any for a while because I know amphetamines are pretty addictive and I don't want to build up a tolerance. Maybe I'll get up the nerve to snort it sometime, I wonder how different that would be. I'll definitely do it again, but next time I'd like to take more time for introspection and deep meditation.<br>as with ALL drugs, if you're gonna take ritalin recreationally start at the lowest dosage and work your way up so you know how your body will react, that way if you don't like it you won't be suffering through it for hours on end. be safe, be smart, and have fun! This is just my experience, your milage may vary.\n\n\n"
}
