{
 "title": "LSD - A Personal Low",
 "author": "omphalos",
 "citation": "   omphalos. \"LSD - A Personal Low: experience with LSD (ID 10891)\". Erowid.org. Nov 28, 2001. erowid.org/exp/10891",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10891",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2001",
   "Views: 7272",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLSD has had a very negative impact on my life. The experience I relate here is my first and only experience with the drug, and I intend to make it my last. Prior to dropping acid, I had been smoking pot for about a year, and I continue to use marijuana. </p><p>I dropped the acid on a two-day vacation to a very liberal city. I don't remember exactly what time it was, but it was summer and the sun was just setting when I chewed the blotter. I tripped with a companion who had had prior experience with acid. As the effects came on, I found myself enjoying the sensation of the trip. I listened to some music, and it was amazing in its beauty. </p><p>My memories of the trip are sketchy, but I have a few very distinct images: Getting freaked out and scared by the convoluted passageway into/out of my hotel room, sitting on the front steps of the hotel getting all freaked out and feeling the lowest I've ever felt in my life, vomiting in the back seat of a taxi and briefly returning to a euphoric state, and seeing the sun come up in my hotel room as the drug slowly wore off. </p><p>Overall, the trip was frightening and depressing. It has been three months since I dropped the acid, and I still find my outlook on life shifted toward the negative end of the spectrum. Since the trip, my self-confidence has suffered, and I have struggled to feel fulfilled in my life.  </p><p>Not that I am completely depressed as a result of the trip; I still love and enjoy life, but I think that the trip had a definite negative impact on my psyche. My outlook on things tends to be more pessimistic, and I find myself searching nostalgically for the near-constant happiness that I once knew. I have done much soul-searching, and am contemplating seeking professional psychological help. </p><p>I would advise against the use of LSD; its impact on me was not positive in any way.</p>"
}
