{
 "title": "Not Quite Certain Death",
 "author": "Irene",
 "citation": "   Irene. \"Not Quite Certain Death: experience with Heroin (ID 109)\". Erowid.org. Sep 11, 2000. erowid.org/exp/109",
 "substance": "Heroin",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "1999",
   "109",
   "Not Specified",
   " ",
   "Not Given",
   "Sep 11, 2000",
   "Views: 27737",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI probably would not have tried heroin had there not been so much hype surrounding it.  It had less to do with 'Trainspotting' than it did with the number of magazine and newspaper articles that followed the release of Trainspotting, each painting a portrait of heroin as a fashionable, certain death.  It was less the fashion than the certain death that I was after at the point in my life when I first tried it -- it was not pressured upon me, either, and I asked for it, by name.  The idea was not to look like a supermodel or to fuck Ewan McGregor;  the idea was to die.</p><p>At this point in my life (I thoght) things could not get any worse, and so I might as well do it -- I had always had the curiosity.  I still figure that if you have the curiosity, you might as well try it -- because it's as if you already have.  This might be a faulty viewpoint.  I tend not to trust heroin use to any of my friends, because I've got this idea that only I can handle it, that I am the 'miracle child' who never got addicted.  (Suppose the future will tell on that one.)  I am writing because I want to dispel the silly myth that heroin is '1000 times better than sex' or whatever that stupid figure is;  I want to erase the misconception that it is like automatic suicide, that if you do it once you are automatically addicted, that it is certain death.  It isn't.</p><p>First of all, it's not like sex.  It's like love.  It's like feeling really comfortable with yourself.  The first time I did it -- I have alluded to being really sad, and depressed, and kind of death-longing -- I was shocked at the way the drug felt so HARMLESS, that's the main thing.  It felt like a painkiller, 'cause that's what it was, and I'd done that before.  Heroin, quite frankly, didn't live up to my expectations.  I'd expected of have my socks knocked off -- I'd expected to want it to badly the next day that I was willing to prostitute myself, that I was willing to trade in</p><p>everything.  This wasn't how it felt.  It felt nice, but it wasn't an answer.  I knew that.</p><p>I did it that one time, and then I did it a month later for a few days, and then I went to college.  I craved it a little, but I am convinced that it was not physical longing but psychological longing -- these f*ing newspaper articles had *convinced* me that I would feel this way.  I ignored it, as YOU TOO CAN DO.  I liked it -- this much is true -- but I didn't need it.  This wasn't Trainspotting, after all. This was my life, and I was determined not to get addicted.</p><p>Okay, so I do think about it every once in awhile.  Especially because my friends will bring it up.  Once I admitted to one person I'd done it, the news spread and spread and spread.  People were constantly asking 'what it felt like,' and were disappointed to hear that it felt like a really strong painkiller.  I guess they'd wanted me to say something more.  Like, 'hey, I've done heroin, I now know the secrets to the universe.'  haha.  Anyway, I sometimes think of it when I get down.... I sometimes wonder how I could get ahold of it again.  Remnants of previous thinking.  But that's all. </p><p>A few days ago I did it again (this is about a year and a half after my 'first time') .... just to see if I could recapture 'that old feeling.'  You know what?  I felt sick, and sort of bored.  I did it with an old friend:  a friend who'd been a junkie, quit, and recently started again.  I also did it with two younger friends who'd never tried it.  The next day my younger friends were asking for it, and I did feel kind of worried, but I guess that I figure it's their lives.  If they keep their heads, they'll be alright.</p><p>I don't think that heroin is for everyone, but I think that if you are informed -- not by media but by actual scientific fact -- that you can avoid the drug and use it recreationally.  I realize that by writing this I may be pissing off people who were formerly (or are currently) addicted, and for that I am sorry.  Like I said, I don't have that much experience.  But I believe that the media hype -- the idea that heroin is this thing you 'can't resist' -- is what does more harm than anything else, and I just want to point that out.</p>"
}
