{
 "title": "Planes of Existence",
 "author": "TryptomineDream",
 "citation": "   TryptomineDream. \"Planes of Existence: experience with LSD (ID 10935)\". Erowid.org. Apr 23, 2007. erowid.org/exp/10935",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "8 drops",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10935",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 23, 2007",
   "Views: 3611",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had done acid 8-9 times previously and was looking for an absolutely mind-bending experience, so while with a couple of friends (who took 2 doses each) I took 8 doses of some pretty good liquid lavender. First trip effects were sliding visuals and auditory hallucinations about 20 mins after dosing. After about an hour I am having full blown sliding visuals, then it gets fun.</p><p>My vision becomes mirrored, in the left half of my vision I see what is actually occurring (kinda) and the right side of my vision is an exact mirror image of the left. I am living in deja vu for about an hour, everything I see and hear has happened to me before. Then I feel tingling. I look down and my skin is crawling with centipedes. I convince myself that there are no bugs and the tingling finally subsides.</p><p>Then, my friends and I decide to take a walk down an unpopulated path, my legs function fine but instead of seeing the path and surroundings I am seeing the primordial origins of earth. I see the first cell divisions and my consciousness then zooms outward into space. I am flying through the cosmos and finally reach the absolute center (or end?) of the universe. I speak with a being of pure energy. My friend speaks to me and I am brought back suddenly to earth. Then reality begins to dissolve - everything fragments into its component atoms and is pulled into a black void.</p><p>I fight to stop from being absorbed but my arms begin to break apart. I am struggling as hard as I can to stop from being pulled into oblivion. This is the end. I stop fighting the void and allow myself to be pulled inward. I am in another place the likes of which I can barely begin to describe. I am a ball of pure energy in a myriad of undiscernable color and sound. I believe I am dead, yet I am not saddened by this revelation. This place I have come to is a billion times more beautiful than the reality I had previously known.</p><p>But something is wrong, I hear voices calling me back, saying that I cannot go yet, there are things I must do. I am being pulled back through the void against my will but this time the journey is different. Pain, agony, despair, an eternity of misery in the void until finally I am back in my body again. </p><p>Apparently I had sat down on a park bench in a daze and my friends were talking to me for some time trying to snap me out of it. Though I am back in this reality, I still am experiencing massive somatic, visual, and aural hallucinations. My friends and I decide to return home and put on some Trance to ride out the rest of the trip, which I will not describe as it seems miniscule compared to what I have just described. </p><p>Approximately 18 hours after dosing I am back to baseline. This trip was by far the longest most mind-bending trip I have ever had on any substance, but afterwards, it didn't seem frightening, but illuminating. Hooray for Discordia. Since that trip LSD has become my favorite drug.</p>"
}
