{
 "title": "Falling Down the Fox Hole",
 "author": "xerxes",
 "citation": "   Xerxes. \"Falling Down the Fox Hole: experience with 5-MeO-DiPT (ID 10961)\". Erowid.org. Feb 10, 2003. erowid.org/exp/10961",
 "substance": "5-MeO-DiPT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "6.0 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 10961",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 10, 2003",
   "Views: 6258",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have recently had the extreme pleasure of experiencing the wonderful world of Fox.  After reading as much material online and in the library as possible about 5-MeO-DiPT, 2C-T-7, and AMT, I decided that the fox was the best bet.  I recieved the material a week after ordering it, and divided the 100 mg pile by eye into 8 parts, each containing about 12.5 mg.  I wasn't too worried about doing it by eye, because even if the doses wern't all exactly the same, one would have to be obviously larger in order to be dangerous.</p><p>A friend, T, and myself decided to take only half the tab at first. T is on an SSRI, and expected a diminished reaction, as is the case with mose psychedelics.  The powder has the most awful taste I have ever experienced.  Worse than alcohol, worse than mushrooms, and worse than San Pedro.  Also, the taste seemed to soak into my mouth.  I ended up having to brush my teeth to get it out, so please, use a gelcap.  We dosed around 4:30 pm.</p><p>The preliminary effects started within 10 minutes.  We were on the way to a local mall when this happened.  Dizzyness, nausea, and a mild feeling of unreality.  Nothing too serious, and not imparing at all.  I asked T if he felt it, and he replied in the affirmative.  We then took one puff of some low grade cannabis to kill the nausea.  This worked wonderfully, and I highly suggest having some around when taking fox.</p><p>We arrived at the mall at T+ 1 hour.  Now I was tripping hard.  Colors were very enhances.  Burning cigarrettes looked like neon bulbs on the end of sticks.  It felt very much like mushrooms, with the body buzz of acid, and the 'pleasure' feeling of a little bit of ecstasy.  Wow.  When walking through the mall, strange auditory shifts and visual distortions manifested.  The music playing sounded distorted, almost like the pitch was shifted downward, but I coulden't put my finger on it.  The Christmas lights hanging from the roof looked distorted and bent, and appeared to be blowing around in the wind, but this was impossible, since we were indoors.</p><p>T was feeling it, but was clearly not at the same level I was at, so after sitting in the massage chairs in the Sharper Image for about 20 minutes, we returned to his house.  T ate the other half of his tab, and we both had some more cannabis.  It seems that every time I smoked pot that night, the effects of the Fox kicked back in just as strong as ever.</p><p>We headed out from there to a small party with some friends we both knew.  This is not a good drug to sit around by yourself on.  With acid, I could have fun staring at the walls, but Fox was different.  I needed to be in a social situation.  The party was perfect for this.  T noted that he was feeling the effects of the second half tab very strongly now.  We had a good time at the party for the rest of the night, and T had a few drinks with no ill effect.</p><p>After the party, we returned to my house to sit and talk for a while.  Both of us were still tripping, so sleep was out of the question.  This is when I noticed that, as well as having mushroom like effects, Fox also has MDMA like effects.  Sitting in comfortable cloths, washing my face, etc. was very pleasurable.  Around 2:00 AM (!), we called it a night.  Sleep was restless.  I had a hard time falling asleep, and didn't sleep well.</p><p>Overall, Fox gets two big thumbs up in my book.  6mg was quite enough for me, but T needed 12.5 to get off, probbally due to his SSRI prescription.  This is a powerful substance, not to be taken lightly.  For me, It was better than mushrooms.  I really liked it and will definitely try it again.  It seems to have only positive interactions with alcohol and cannabis.  The day after I felt 'burned out', but nothing too bad considering the powerful effects it has.  No worse than mushrooms.  Be safe!</p>"
}
