{
 "title": "My Favorite Color",
 "author": "OK Now",
 "citation": "Citation:   OK Now. \"My Favorite Color: experience with Cocaine (ID 110)\". Erowid.org. Jul 30, 2001. erowid.org/exp/110",
 "substance": "Cocaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 110",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 30, 2001",
   "Views: 16431",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter a year of binging and crashing, it took a good sober look at myself in the mirror for me to realize I had a problem.  My friends and I were waiting for more. After an entire weekend of being 'up' I'd finally gotten about 4 hours of unrestful sleep, hadn't eaten in three days and was anxious just knowing it was on it's way. I started to get the usual nose twitches.  Then my sinuses released and I wiped my nose.  I expected for it to be clear like all the other times, but it wasn't.  I had a handful of blood.  I ran to the bathroom to clean up and that's when I saw her.  \r\nIn the mirror was a girl who looked a little familiar and so sad.  It was me I saw there, the me that NEEDED to be seen.  My hair was dirty, oily, because I'd neglected showering to get high, to stay high.  My teeth were yellow and covered with nicotine stains and plaque.  I had gone from a healthy 105 pounds to around 85, and I almost looked like a cancer patient.  Now I had blood running out of my nose into my mouth.  18 years old.  The prime time of life.  I don't know why I woke up then, why it had to take something so horrifying for me to realize that I was killing myself.  I called my mom and asked her if I could come home.  She told me she'd be there in 30 minutes.  She arrived in 20, and helped me pack my bags.  \r\nTHAT was the first day of the end and the 1st day of a beginning.  I also received the best feeling in the world...a feeling of pure and true peace, love and security, for the first time in a year, I KNEW I was gonna be okay.  It wasn't easy, but here I am, a mother of two beautiful children and a life I wouldn't trade for anything.  On the flip side of that, even though I wish I had never experienced what I did, it made me smarter, so much more aware of what is out there.  I'm afraid for my kids, but with the honesty we share they will know, how close their own mom was to dying, and I pray that what I went through was not at all for me, but for my babies.  This is part of a poem I wrote in the days of the parties and chaos, and I still keep it to remind me where I have promised myself I will never be again.\r\n'White-my favorite color, the only one I know.\r\nIt's the color of my walls. The color of my snow.\r\nThey say it makes you crazy. You say it makes you sane.\r\nYes, white's my favorite drug, and its color is cocaine.'\n\n\n"
}