{
 "title": "A Good First Time",
 "author": "Nitsuj",
 "citation": "   Nitsuj. \"A Good First Time: experience with MDMA (ID 11001)\". Erowid.org. Apr 26, 2007. erowid.org/exp/11001",
 "substance": "MDMA",
 "bodyweight": "117 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   " ",
   "0.5 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11001",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 26, 2007",
   "Views: 3820",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have used MDMA only once, last night at about 10:30pm (it is 9:24 pm now of the following day) at a rave/club in LA. I am 16 years old, 5'2'-5'3' and I weigh around 115 lbs. </p><p>A friend of mine gave me and my friends (there were 7 people that we were with) free pills of something called orange alligator, and it was pure MDMA. Anyway, we popped the pill (doesn't taste good) and drank some water to wash it down. Then we waited approximately 20-25 mins for the effects to take place. At first I didn't think I was feeling it but then they said I should just go on a walk to see how I was. So I walked downstairs into the Jungle music area and during the walk I felt funny. I felt a little more light headed than usual and I felt good just moving. As I went back upstairs to meet my friends I was definitely coming up.</p><p>Then one of my friends 'floated' me. 'Floating' is when you stand back to back and your friend behind you leans forward taking you off the ground, then they move up and down and side to side in a comforting swaying motion. Also my friend who hooked me up with the pill gave me a light show with some glow sticks. I was trippin. Then we went outside to the smoking area (some of my friends smoked cigs) and I was going up faster and faster. I soon became a little scared and confused about where I was and I was a little bit paranoid. Then I saw this girl walking towards me (she was rolling hard) and out of nowhere we look at each other and start kissing.</p><p>Well that is when the real fun started. We kissed for a few minutes then she wanted to go dance, but I didn't feel I was able to at the time. So I said I would try to find her out there. Then my 'big Sis' (nickname for friend) gave me a lollipop. The whole night was excellent. I was talking to and making out with at least 6 girls, I felt so open and alive. Everyone I talked to gave me the royal treatment when I told them it was my first time rolling. They would massage my back, give me light shows and be super nice to me sharing water and lollipops. Someone gave me some bead bracelets and a bead necklace with a binky on it (that thing that babies suck).</p><p>Well I was going on rolling hard, dancing, macking with girls, drinking water and eating candy. Then my friend gave me one of those masks that doctors wear and it had Vicks inside of it. The Vicks instantly brought me back up when I was going down. Then my friend scored some more stuff and gave me a half a pill. I downed it. The overall time was very, very fun. Ravers are some of the nicest people I have ever met. The whole trip lasted from 11pm when I began to roll until 4:30 when I fell asleep at my Big sis's apartment. On the ride home I guess I had some minor hallucinations because I kept seeing huge swarms of gnats on the freeway. </p><p>THE NEXT MORNING</p><p>The next morning I woke up at 7 am (a mere 2 1/2 hours of sleep) feeling OK but I knew I would feel worse later. I had my Big Sis call me in sick for work because I definitely wouldn't have been able to work an 8 hour shift. All day I sat around and slept. It is very hard to eat during and after a trip, but I had to force myself to because my body needed the energy from all the dancing from the night before.</p><p>To me it is definitely worth it, it was all good except for earlier today when I was getting the after affects of dropping (E chills, tiredness, no hunger). Also I would like to note that one of my friends didn't have such a good time. After I started rolling he got lost from us and we didn't see him for almost 2 hours. I found him in the corner of a room on a couch looking pretty bad.</p>"
}
