{
 "title": "Drops Are Dangerous for Your 1st Time",
 "author": "Liquidlite",
 "citation": "   Liquidlite. \"Drops Are Dangerous for Your 1st Time: experience with LSD (ID 11053)\". Erowid.org. Oct 9, 2010. erowid.org/exp/11053",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8 drops",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11053",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 9, 2010",
   "Views: 4034",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was down in Washington DC for school and I was pretty bored one night and my friend was going to a rave in the city at a random location.  Good idea I thought.  we got to the rave and it was pretty small with a good flow of drugs but I felt I needed acid because I haven't done it before.  My friend said that he knew somebody with drops.  <br>To cut to the chase he came over and I purchased 4 drops.  I held out my hand and he dosed me.  after he yelled over the music,'did I get you?'.  I saw my opportunity 'no man' I said so he dosed me 4 once again.  Looking down at the puddle on me hand I put it to my mouth and licked it up..sssllluurrppp...  after about an hour I felt the world turn inside out and the fucked upness was beyond anything that I have ever seen.  <br>I saw blue and red static (if you've been really fucked you know what I'm talking about) that static then turned into hallucinations.  The walls were flowing like goddamn waterfalls and the graffitti on the walls were floating by me.  Why the fuck are all these people dancing?  what is dancing?  why do we move to these strange vibrations in the air.  <br>What's strange is that I could see the music vibrations in the air. Jjungle 'music' really messes with you.  I remember that during the trip that everything was too clear and so clear that all I wanted to do was kill myself. The reality of the world was too much for me to take.  The sparkle of life was taken away and I saw the behind the scenes look at life and it was depressing as hell.  <br>Life was falling apart at the seams and I had to sit at this apartment with people I didn't know and listen to them talk about the most pointless things.  But I noticed that they were all putting blankets around each other and there was a wind blowing through the room (it wasn't wind from outside.) It was like they were helping each other survive.  I wondered what are they surviving against? After thinking I came to the conclusion, LIFE.\n\n\n"
}
