{
 "title": "The Twilight of Reality",
 "author": "Recoveryguru",
 "citation": "   Recoveryguru. \"The Twilight of Reality: experience with Heroin (ID 11050)\". Erowid.org. Feb 13, 2003. erowid.org/exp/11050",
 "substance": "Heroin",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "insufflated",
   "Heroin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11050",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2003",
   "Views: 91222",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I snorted Heroin<br>Before this I had already tried alcohol, marijuana, hash, and cocaine.<br>Getting the stuff in the late 80s was a bitch. Everybody was into cocaine or weed.  Besides, I lived in the suburbs.  It wasnt like there was a heroin dealer down the street.  My ethnic friend had already been busted for selling coke to an undercover cop and had served 9 months. I knew him from high school and we had jammed together as musicians.  He was trustable as far as giving him the money up-front (fronting) and getting the stuff.<br>He was living with his aunt in Detroit.  They lived in a shit house set up in an enclave of Arab people.  Surrounding them was the ghetto.  He said getting H was no problem. The cost? $25 a pack. I gave him $50 and told him to get one pack of heroin for me and one for him.  I figured that was generous for 15 minutes of work.<br>His brother was already using the stuff daily.  Of course he claimed he wasnt hooked and just snorted it for fun.  I didnt really care. I was already a drug dealer and was used to people talking shit. This was of course no different.  <br>Nash finally called a day later and said, Were on! I couldnt wait. This was like Christmas.  I always wanted to try this shit because it was so taboo.  I mean common, were talking heroin.  What gets more shock or concern from parents?  Only the really bad people take this stuff.  I saw it as a challenge similar to lion hunting.<br>So I race off to the ghetto to meet Nash that afternoon.  He tells me that his brothers instructions are for me to only use * the pack. He hands me a mini-like manila envelope about the length of a half-dollar. We shake hands and say goodbye; as easy as that.<br>I wanted to have an opportunity to use it without any hassles so I waited until the next day when no one was around.  I opened up the pack and looked inside.  I noticed an off-white chalky powder with a bunch of fine brown specks.  Having been an experienced cocaine tooter by this point I took out the old razor and mirror.  I ran the blade back and forth across the smack until I created fine powdery lines about * inch each. <br>Then I stuck a rolled up bill in my nose and snorted up about 1/3 of the pack.  The sensation up the nose was mild with a slight sting. As far as scent, it had no real odor to it. The taste was slightly like that of quinine. It was bitter, best described as similar to the taste of a codeine tablet.  Then I waited. It took about 3 minutes, which seemed like forever.<br>I was slowly feeling loose and relaxed.  I had the sensation of not feeling an aches or pains.  Since I was working out at the gym and my muscles were sore, this was great.  Later, it grew more intense and my face became real relaxed giving me a tired lazy look.<br>The sensation went all through my arms, lets, then fingers, and toes.  I felt warm all over just like being in a bath set at the perfect temperature.  Then my eyes began to close and I fell into a dreamy state.  I could open my eyes if I put in the effort, but I didnt want to fight the feeling. It was like that point right before I am unconscious and fall asleep.  I can just pull myself out but I dont want to.<br>I call it the twilight of reality.<br>I was having little pleasurable dreams.  Thoughts of running through fields with birds and butterflies. I hate to admit that.  I should have pushed my mind for cool macho sex dreams, but I was content to play in fields with birds and butterflies. I slipped in and out of consciousness.<br>All of a sudden I felt like I had to throw up. I walked quickly to the sink and barfed whatever was in my stomach.  Then I felt better.  I was only slightly uncomfortable, as once in a while my stomach would cramp.  I figured that was a small price to pay for what I was experiencing.<br>Looking back, my body was trying to tell me something.<br>After about 30 more minutes I entered the next stage.  The pain and feeling to vomit was completely gone. Now my head felt real heavy.  My solution? I layed on the floor against my bed for hours.  It was like being cradled by mom as I was nursing.  I felt warm and loved. My jaw dropped and I drooled down my chin like an infant.<br>No cares, who cares? Everything for those moments was all right.  I slowly came to and still felt great. No sudden cravings for more.  No regret for doing it.  I thought of it as a well deserved mental vacation from the stresses and worries of life.<br>The next morning I was groggy, but I didnt feel like holding up a liquor store to get more.\n\n\n"
}
