{
 "title": "First Natural Entheogen Experience",
 "author": "HappilyAnonymous",
 "citation": "Citation:   HappilyAnonymous. \"First Natural Entheogen Experience: experience with Salvia divinorum (ID 1105)\". Erowid.org. May 6, 2001. erowid.org/exp/1105",
 "substance": "Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "sublingual",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1105",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 6, 2001",
   "Views: 26308",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI obtained an ounce of dried Salvia divinorum leaves (Oaxacan wild harvest) on Tuesday, April 25, 2000, and decided to try a small amount on Saturday, April 29 as a test to see if this plant lived up to her reputation.  At 9 p.m. EDT I began chewing a quid of rehydrated leaves in a small dark upstairs room, while sitting on a folding chair.  I was alone except for four 12-week-old kittens who were in and out of the room.  \r\nAt 9:15 I started to feel a slight strange intoxication.  At this time I swallowed the first quid (waste not, want not!) and began another quid.  About ten minutes into the second quid I felt a presence in the room, a very large presence, which was moving closer to me.  When I closed my eyes I could see a living entity, of no definite shape, a composite plant/animal that was to me more feminine than masculine.  This being had tendrils, tentacles, foliage, hands, all in a vast shapeless mass.  \r\nThe being came closer,  emanating great power and pure love.  It engulfed me and I surrendered to her, and was in sweet repose in her loving, caring embrace.  In the process of surrendering I had what felt like a long, intense orgasm, but without ejaculation.  I could not physically talk with this being, only thinking the words 'Thank you!'.  The lovingness of her embrace, and of her spirit, was evident.  As part of her now, I vowed to extend this love to all. \r\nAt this point the four kittens were trying to jump on my lap, and I realized the kittens were also a part of her, pure spirits, wild and free.  I had to move to the floor, as I was totally overwhelmed.  After a few minutes I found my voice, and whispered Thank You to the Goddess, the Goddess of Life.  After a while I was able to walk to the stairs and made my way downstairs, where the incredible love and teachings continued to flash in my mind.  \r\nIf I never had Salvia divinorum again I would not be unhappy in the least--what I experienced in those minutes will take the rest of my life to integrate.  I may not be able to put into words much of what I experienced, and learned, but I will try; the main thing I learned from this experience is to be a loving person, as loving as the Goddess, and to help life in all its forms.  I look forward to exploring Salvia more, with respect.  It is a powerful, sacred plant, and I'm grateful and fortunate to have met her.  I have used powerful synthetic psychotropes in the past, decades ago, and this is the first natural entheogen I have ever used; there is no comparison.  This plant is a teacher and a healer, suitable for those who are either pure in heart or who wish to be.\n\n\n"
}