{
 "title": "This Was One Ride I Couldnt Get Off",
 "author": "Recoveryguru",
 "citation": "   Recoveryguru. \"This Was One Ride I Couldnt Get Off: experience with Heroin & Cocaine (ID 11051)\". Erowid.org. Jun 30, 2007. erowid.org/exp/11051",
 "substance": "Heroin & Cocaine",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Heroin",
   " ",
   " ",
   "125 mg",
   "IV",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11051",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 30, 2007",
   "Views: 50827",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I shot a Speedball (Heroin and Cocaine)<br>Before this I had already tried alcohol, marijuana, hash, and snorted coke, shot coke, and shot heroin.<br>John Belushi died from a night of shooting speedballs just around the time that I decided to give it a try.  I figured he was fat and out of shape anyway, fuck him.  You need to be young and in good shape in order to handle powerful narcotics. Besides I knew what I was doing and didnt care too much if I died anyway.<br>My friend Steve was already a real big coke dealer and was shooting coke with me on a weekly basis.  I mentioned the idea and he thought it would be great fun.  We thought it would be a neat chance to push the envelope and feel something new.  The term Speedball had reached a mythic spiritual level on the street.  People had only heard of others who had done it. Now we would be like astronauts, going beyond the normal reach of man.<br>Steve hated going to Detroit for drugs and I loved it. This made the division of labor simple.  I fetched Heroin from the ghetto and he procured Coke in the suburbs from the ethnics.  We both did our jobs very well and met at his girlfriends house to put our plan into action.<br>I loaded the first spoon of dope for myself.  No surprise, as I was always the guinea pig. I took one pack of $13 Heroin (ten years later it only costs $10) and loaded about an 1/8 of a gram of pure coke. I cooked it up with some distilled water, watching some vapor rise. I then ran my nose past the spoon like a gourmet chef sniffing truffles.  This got my palms sweating and heart beating.<br>I filled up a little insulin needle with the mixture. We no longer used big needles, they only looked cool and left big holes in our arms.  With our new little pin needles there wasnt much pain to an injection anymore. I stuck it in my arm, I pulled back and saw the blood, verified hit.  It was then I became scared; I hope I make it back to tell Steve what it was like.  This was one ride I couldnt get off.<br>My buddy and his girlfriend where staring at me as if I was some kinda motorcycle daredevil or something. Is this guy gonna make it?<br>I gave them a fake smile and pushed forward on the plunger.  It was then I felt two powerful sensations at the same time. In a simple description it was just like shooting coke and shooting heroin, but it was much more.<br>My ears rang and I felt like I was cumming.  My body flushed with warmth and energy.  I could feel every nerve in my body get stimulated at the same time.  I felt all the power of Cocaine with all the euphoria of Heroin.<br>Part of me felt like it was being born, part of me felt like I was dying, and part of me felt like I was in heaven.  All this occurred with such intensity I felt like I had been struck by lightning.  Powerful, weak, energized, and exhausted.<br>I now knew what it felt like to be a God!<br>Later on things just got worse and worse like shooting heroin and shooting coke.\n\n\n"
}
