{
 "title": "Six Seeds",
 "author": "Kat",
 "citation": "   Kat. \"Six Seeds: experience with H.B. Woodrose Seeds (ID 11067)\". Erowid.org. Dec 5, 2001. erowid.org/exp/11067",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "6 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11067",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2001",
   "Views: 16628",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was at my friends house one night it was 11pm and the two of us were bored. We decided to take HBW. My friend had taken them before and said that they were really good. We tried to peel the skin off of them but found it difficult and gave up. I took all six at once and chewed them up. We rented a movie and about a half hour into the movie I started feeling really oozy, kind of drowsy and mellow but nausious at the same time. I thought that like mushrooms it would pass and I'd start to feel better. The nausious feeling went on for the rest of the movie and I fell asleep. A half hour later I woke up fucked. My friend had fallen asleep and they didn't hit her at all and she had seven. I tried to sleep but I couldn't. I felt like I couldn't breath, like something heavy was on my chest. I was tripping but it was good, it was scary. They gave me the weirdest feeling, everytime I was lying down I had to get up and when I stood up and tried to walk I got so dizzy I had to sit down. I felt as if I drank two 40s of vodka. After hours of crying, tripping and freaking out at 8am I finally fell asleep. </p><p>I've done lots of other types of drugs before and this was definatly the worst experience. I know other people that have done them as well and their experience similar to mine. I thought that because it was natural and even legal that they couldn't be that potent but I was wrong.</p>"
}
