{
 "title": "Blind Leading the Gullible",
 "author": "Willow",
 "citation": "   Willow. \"Blind Leading the Gullible: experience with Cocaine (ID 11071)\". Erowid.org. Jun 2, 2003. erowid.org/exp/11071",
 "substance": "Cocaine",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "0.5 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "0.5 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11071",
   "Male",
   " ",
   "Not Given",
   "Jun 2, 2003",
   "Views: 20433",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There will be only old news in this repert I am afraid. But at least it is as accurate. Ironically, I did coke for the first time tonight when I invited a friend of mine over to come and relax at my place. Ironic because he had acquried a large amount of the stuff and had been snorting almost continually for two weeks and I was goimg to try calm him down. I also wanted to make a plan for how we were gonna handle his imminent crash at work - his stash was almost gone and he got into trouble last time because he became aggressive.</p><p>My invitation to him was to come and chill and/or do some lines, not to preach. It may seem to some that I was not doing a very good rehab job when he offered me some and I snorted it. But I think you'd have to understand our relationship. I did it despite the evidence that it might be a bad idea. (my friend - exhibit 'b'). </p><p>I had been on call for five consecutive days and was entirely exhausted. About thirty seconds after the first line, I felt as though I had had a good night's sleep and was buzzing with energy. There was significant elevation in mood, but no euphoria per se. My hunger disappeared. (And I started to babble, which was lots of fun.)</p><p>The thing I was most curious about was the come down. I had heard so much about it. So I held off a long time on a second hit. It was not all that unpleasant. I definitely wanted more, but if there hadn't been any I think I would have been OK. In fact the come down, lasting about an hour and a half, was also fun - a novelty. I did another half gram, and got more euphoria this time, occasionally babbling so much that I forgot what I was talking about, which is apparently not typical. I hadn't come down yet when I had the third hit. This one felt a lot like ectasy does if I have used it heavily and no longer become euphoric, except that I do not get that 'e-stupidity'. In fact I am now typing this report at at leat twice my normal speed. Also noteworthy is that I had an atypical (for me) craving for alcohol.</p><p>The last hit was an hour and a half ago. I am expecting a come down for real some time, and probably due to the confidence boost from the coke, am looking forward to learning what it is like.</p><p>Adverse effects noted:</p><p>Psychologically- no problem encountered yet. I expect a bout of insomnia tonight.</p><p>Physically- degree of bronchospasm and dysphagia - quite unpleasant. I do not read about this in the vaults - apparently occurs with smoked crack. I surmise the mechanism is different with crack, though. I have had moments of panic about anaphylaxis. also palpitations and sweaty palms.</p><p>In summary: Very PLEASANT, but not mindblowing like many other substances. The danger with coke that I foresee is that it is USEFUL. Other substances cannot be used in the same way. I could do this any time, anywhere - and for a moment I would be able to handle anything. I already know that I will do it again, but I think I wil feel less lauditory about it tomorrow, when the fun has stopped, and I must deal with a night of poor sleep. The solution that might present itself is a line or two. And that is the problem, really.</p>"
}
