{
 "title": "Niacin Nightmare",
 "author": "JK",
 "citation": "   JK. \"Niacin Nightmare: experience with LSD & Niacin (ID 11095)\". Erowid.org. Dec 6, 2001. erowid.org/exp/11095",
 "substance": "LSD & Niacin",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 6:00",
   "200 mg",
   "oral",
   "Vitamins - Niacin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 11095",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 6, 2001",
   "Views: 31560",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was at a club and my good friend gave me a hit of acid, which I hadn't done in over a year. I was apprehensive, but took it knowing I'd have a fun time with him. So we danced and I made out with a cute girl, and we went to get some food on the way home. </p><p>I had to be up for work the next morning, so I wanted to come down easy so i could sleep. My friend told me he heard that taking Niacin makes the effects virtually stop. He had the WRONG information!!! I took 200mg of the vitamin, and 10 minutes later, my whole body felt like it was on fire.</p><p>A searing pain started in my crotch, then my armpits, my buttocks, my feet... all my hot points--and spread quickly. My friend had gone home, and my roommate was asleep, and I was freaking out. I ran to the bathroom and couldn't recognize myself in the mirror. My face was beet red and swelling up around my eyes--I had to claw out my contacts because my eyeballs felt literally like someone had poured liquid fire into them.</p><p>By this point I was screaming, and I jumped into a cold shower to try to cool off. I really thought i might be dying, so I screamed for my roommate to wake up and help me. I was tripping very hard at this point and wanted to make sure I wasn't hallucinating. But when she came running in, she screamed too. My feet and hands were bright purple, with streaks of purple running up my legs and arms. And my eyes were almost swollen shut. All my skin was stretched and cracking. By the way, I was in shock too, so I was convulsing and shivering and chattering my teeth uncontrollably. The shower had made the condition much worse! </p><p>I tried to have her call the ER to ask if I should come in. I couldn't imagine the reaction being from the acid, since I had taken it 6 hours before. I knew it had to do with the Niacin. My roommate was so scared she almost called 911, but I had no insurance and didn't want anyone to know I took drugs. So I called myself, while I could barely walk or talk. The man that answered kind of laughed at me and told me to just wait it out. I had to sit for 2 hours convulsing under lots of blankets, drinking water, tripping out.</p><p>The doctor said it was just an allergic reaction to Niacin, which is very common. He called my condition 'flushing'--HA! I literally was afraid that I was going to be permanently disfigured. You wouldn't believe what I looked like. So the next morning, I looked at my multivitamin, and saw that 100% daily dose of Niacin is only 20 mg! I took 10 times the normal dose! I have never been so scared in my life.</p>"
}
