{
 "title": "Feel This ...",
 "author": "The Wild Grape",
 "citation": "   The Wild Grape. \"Feel This ...: experience with Ecstasy (ID 111)\". Erowid.org. Oct 7, 2000. erowid.org/exp/111",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 111",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Oct 7, 2000",
   "Views: 7962",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took E with my friend of two years last weekend. We were prepared with candy, pacifier and all the other trinkets that the FAQ's recommend. We popped it at 7:15 and it took 45 minutes to kick in.</p><p>It hit her first. I could tell she was starting to act funny when she wouldn't stop talking about the photos of her ex girlfriend and how awesome they were and how she missed her. She also said she felt lightheaded and that there were echoes in the room. I was not experiencing any of that yet. We tape recorded the first 15 minutes of our trip which will be a conversation piece for years to come. When it hit me, the room started to seem detached from me. A sort of floating or swimming through the room. A slight dizziness set in and within the next few minutes, it felt as if I passed through a brick wall of consciousness.</p><p>I was on the floor making the most agonizing noises. I was immobilized with a haze so thick I couldn't pick myself up, nor did I want to. Suddenly, the carpet felt wonderful, every tuft of polyester ruffled through my fingers. My feet felt like they were across the room, at times I was even surprised I could move them. We either sat or waded around the room for the initial trip, simply admiring the music or the sensation of feeling the ground beneath. After a while we got ourselves together and began to do all the things we had planned. At times there was paranoia. My friend was obsessed with finding her legos for us to play with. She gave me the backrub of my life. My body  felt like it was sizzling. The lotion was cold, not cool, and the feeling of it being rubbed on my skin lingered for minutes after her hands had left me. We kneaded each other's bodies like dough and it became my fixation. </p><p>My jaw started clenching and I had to suck on a pacifier for half the night. My friend was eating tootsie roll lollipops one after another. The taste of candy was amazing and intense. It was virtually bursting with fruit  flavor. Music was alive. Music sounded like it was coming from inside your head. I could close my eyes while lying on the floor with the bass beating through me and see the most vivid, colorful 3-d images of shapes swirling before me. We didn't talk for the most part but it felt like I was talking inside my head. Sometimes I even thought I heard her say something to me just barely intelligible only to find that she had not said a word.</p><p>I was doing things that I never would have if I were not on E. It lifted all my inhibitiions about being with this girl that I had a crush on for the last 2 years and with whom I had quietly resigned myself to friendship. I wanted to shower. Instead I found myself propped up against a wall, unable to gather the coordination to get to the bathroom. She ended up undressing me and putting me in the shower. Normally, I'm fiecely self conscious about revealing my body but when I was naked in the shower with her spraying water on me, I wanted her to look at me. I wanted her to see every part of me. The feeling of hot water pelting my body was amazing. It felt like the water was falling in slow motion. The cold tiles contrasted the sensation of the water. I didn't want to put my clothes back on after the shower. My friend put me in front of the heater to warm me up. Oddly it had turned arctic cold.</p><p>Then she wanted to shower. Not wanting to be alone, I remember watching her through the frosted strips on the shower door. I was fascinated, I was turned on, I was enraptured.</p><p>An overwhelming desire was building up. I could feel it the first time I touched her after we popped the E. I couldn't be away from her for a moment. I couldn't let her out of my sight or else anxienty set in. I remember trailing behind her everywhere she went. I remember holding her around the waist from behind as we walked from room to room. She became the object of my obsession. Everything that was her was intensified a million times. The smell of her hair, the softness of her skin, the taste of her mouth. It was amazing. Her skin, her skin! I remember so much of it. I remember rubbing her stomach while she lay next to me. Sometimes it was as though she was lying across the room from me, other times it felt like i was pulling her so close it was like I was trying to push her into me. I felt this need to touch every part of her body. Touching her felt better than her touching me. I loved the feeling of kneading her flesh. I couldn't keep my hands still.</p><p>I felt transformed into a baby. I wanted to be held and caressed. I suppose I might have looked like a baby too, with that pacifier in my mouth. I was running my hands all over her face. It's so strange how you can know someone so long, look at them day after day and never know what their face feels like. She was licking my fingers. It felt great. Just the saliva cooling on my hands felt great. I was kissing her face, her nose, her forehead. Then I was kissing her mouth. It was strange kissing someone else after so long, but it was good. Kissing was so good I can't even describe it.</p><p>We ate pop rocks on the suggestion of my frequent E-dropper, Lisa. It was vastly overrated. It was an interesting feeling, the fizzle and crackle of the candy, but it was even cooler biting into it. It sounded like your skull was breaking. We also tried eating ice, my personal favorite. She rubbed it on my back and it felt like being cut, the sharpness, the coldness, but without the pain.</p><p>I tried smoking a cigarette. I don't know why I thought it would be easier while on E, but I gagged it up, just like normal. We also loafed around on the carpet, with horsey rides and stuff. I was fascinated with fire, sort of how I thought I would be. I ran my hand over a candle flame admiring how it felt. It seems like it would have felt hotter, but it didn't.  We spent a lot of the time just comforting each other, hugging and rubbing each other's backs. Towards the end we just immobilized ourselves on the carpet and zoned out to the music. Time either stood still or flew by. I grew cold. I stared at the fire dancing around on the log. I lay on her chest and listened to her heartbeat racing around inside her. I remember saying 'Tell me what you want, I'll do anything you want.' I remember saying such things as 'I love life, I wish every day could be like this'  and wondering if I could do it again next weekend. I felt absolutely at peace, a warming happiness that I've never been able to acheive before. I felt a oneness with my surroundings, with the music, with her. Absolutely euphoric and free.</p><p>Days after the trip I'm still reeling back from the experience. Thinking about the evening, I can almost perceive those same sensations that were so heightened. I feel easier, free-er. I can't say that there haven't been drawbacks. I've also felt forgetful and anxious, sometimes paranoid. It's opened many doors between my friend and me. Our relationship before was so cold, stiff and gaurded. I think I was afraid of giving her the impression that I was attracted to her, because she was in a relationship as I was. We spent so much time building up these walls between us, these tall insurmountable walls. I think that I was especially cool to compensate for the feelings of guilt and frustration that I felt while hiding my attraction. </p><p>I'm generally good at surpressing things but after that night, all the feelings I've had for her resurfaced and multiplied. All those walls melted away into a pillowy space. I feel bonded to her on a level that I've only felt while being in love. I feel affectionate and open. I want to hug her everytime I see her. Sometimes I just want to sit and stare at her. Thinking about what we did that night works me into a frenzy. At the same time time, it goes so much deeper than that. The kind of bond I share with her feels like one where two people get deserted on a an island for a long  long time and have to learn everything about each other and survive together and then are finally returned to civilization. It feels like we've been on a long vacation together. I feel safe with her, warm.  I feel like I can tell her anything and I feel like she knows everything about me without my having to say a word.</p><p>In terms of the other aspects of life, I feel liberated. More at ease with myself. I feel like I've been someplace not many other people have been and that I'm a better person for it. I feel lighter than I used to. More confident. To be honest, it all sounds great, but it also makes real life feel boring compared to the euphoria E produced. I'm sure that part will pass with time and as life gets more interesting and meaningful, but the bond built between us feels lasting. Sometimes when I think about her I get so happy I don't think my heart can contain it and sure enough when I stop to feel it, it's racing and pounding inside my chest.</p><p>Now that's happiness. :)</p>"
}
