{
 "title": "Help with Addiction",
 "author": "Dr. T",
 "citation": "Citation:   Dr. T. \"Help with Addiction: experience with GHB & GBL (ID 11121)\". Erowid.org. Nov 9, 2005. erowid.org/exp/11121",
 "substance": "GHB & GBL",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "GHB",
   " ",
   "  repeated",
   "oral",
   "GBL"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11121",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2005",
   "Views: 11904",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFor all who may be experiencing GHB addiction there is hope!\r\nI had used the product over the past 2.5 years with no problems. After a few changes at work and added stress I started to increase my dosage to about 30 ML every 3 hours and that was a long wait time for me. I tried cold turkey, but the anxiety and panic attacks and lack of concentration where too unbearable.\r\nFinally I went to a Rehab center where I was treated with benzo (librium 50 MG) which seems to be the best, every 4 to 6 hours and clonodine .2 (for high blood pressure) at the same interval. My dosage was reduced to half of that the second day. One of the biggest dangers of withdrawal is very high blood pressure. The second day I felt much better. The third day a was a different man.\r\nWell 2 years later I was bitten by the same snake, GHB has a strong attraction. This time I was smarter, I monitored my blood pressure and had my doctor prescribe the librium and clonidine (I'm by no means suggesting to do this without doctor supervision!!!). Be honest with your doctor. There is hope I know I was desperately seeking information on it. \r\nGHB has had both positive and negative impacts in my life, like any substance abuse when life begins to revolve around it THERE'S A PROBLEM. GHB definitely helped me stop drinking, something I tried many times before.\r\nJust remember if you do take it, don't do it too often (never mix alcohol or other drugs with it) and always take 2 or 3 days off to level of the dopamine level.\r\nWish you all the best of luck with recovery.\n\n\n"
}