{
 "title": "A Myriad of Rooms",
 "author": "Mark",
 "citation": "   Mark. \"A Myriad of Rooms: experience with Salvia divinorum (ID 1112)\". Erowid.org. Apr 1, 2001. erowid.org/exp/1112",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "  T+ 0:59",
   "1 hit",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1112",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 1, 2001",
   "Views: 7131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThe other night I was fortunate to be able to try some Salvia for the first time. A friend and I had just purchased some 5x extact, and by the time night rolled around, I was getting anxious to try some. I felt a little jittery about it, so I decided I would wait until I was comfortable before smoking any. At one point I noticed that my nerves had calmed down considerably, so I loaded a small amount into my water pipe, inhaled what I would consider to be a medium-sized hit, and held it in for about 20 seconds.</p><p>As I exhaled, I began to feel that there was a large tree behind me, wrapping its roots around me and pulling me towards it. I realized that it wanted to tell me something, but at this point I was starting to come down, and I failed to glean any information from it. I was disappointed. I felt like a door had been opened, and beyond it was an experience of great intensity and power, but I had been unable to pass though it. I was determined to try again.</p><p>About an hour later, I decided it was time to revisit Salvia space. I loaded up a considerable amount into my pipe and inhaled it all in one massive drag. What happened next is almost beyond words...</p><p>I layed back, feeling the effects of the drug coming on rather quickly. I saw my friend's hammock suspended in the air above me, so I reached out and grabbed it. At that moment, I was transported to some kind of playground,where I was holding on to a chainlink fence. I could hear the playful voices of children all around me, and this made me happy. I saw a large building in the distance, and a school bus passing in front of it. Suddenly I was on the school bus, and looking at the building as I passed. I became aware that there were millions of rooms in this building, all of them quite similar. I began focusing on one of them, and I realized that it was the room I was in, complete with my friend sitting there looking at me. It seemed strange that he was staring at me, because I felt that I should be the observer in this situation. As I looked at my friend, and the room around me, I slowly started to drift back into reality. About ten minutes later, I felt completely normal again and smoked some cannabis to finish out the night.</p><p>This experience was very positive. I feel that I learned that I am only a small part of the massive aggregation of humans on our planet. I think I will make further contact with Salvia in the future.</p>"
}
