{
 "title": "Intense, Terrifying and Unconcerning",
 "author": "Ishmael",
 "citation": "   Ishmael. \"Intense, Terrifying and Unconcerning: experience with P. harmala (Syrian Rue) & Cannabis (ID 1113)\". Erowid.org. Oct 20, 2000. erowid.org/exp/1113",
 "substance": "P. harmala (Syrian Rue) & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Harmala Alkaloids",
   "(seeds)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1113",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 20, 2000",
   "Views: 15113",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe night started off as just a camping trip with the intention of getting drunk.  Much to my dismay, all of the 'local' stores were closed early for some reason.  Lacking any other substance to initiate oddity during the evening, A compatriot and myself decided to take harmala; He took a dosage of about 2 gm concentrated Harmala crude-extract (citric-acid extraction method) while I took approximately 6 to 8 gms of finely blended seed (administered by mixing it with Squirt and kicking it back; tasted horrible and I'd reccomend anyone trying to duplicate this plug their nose before drinking).  \r\nWe then went and procured approximately 15 grams of cannabis while the harmala took effect (about an hour).  The pure Harmala effects are difficult to describe because they seemed very subtle and elusive; I'd say I had a definiate 'buzzing' feeling, though it the buzzing vibration seemed to be on a lower frequency than the buzz associated alcohol or the begining of mushrooms/LSD experiences.  Also, I noticed a bit of fuzziness to the thought process, as well as a generic lack of clarity to my visual field.  \r\nWe smoked the cannabis via a pipe, and listened to music for a while next to the fire.  After about 4 bowls (it should be noted that this took half an hour, but SEEMED to take HOURS), I was definately high...but it was far more intense and mental than a typical high.  My friend noted this as well.  Progressing into the evening, it took only about 30 minutes before STRONG level 3 visual hallucinations occured.  These were NOT limited to patterns morphing into similarly shaped objects but Faces, objects and bodies appearing out of seemingly nowhere...for instance, a piece of wood burning within the fire became like a movie-screen showing pictures of heros, conquest and cloudscapes in a very classical greco-roman style (this was just one style encountered, though all were incredibly abstract but easily recongnizable as containing significant subconsious messag!\r\nes of a spiritual variety)  \r\nHallucinations were not limited to the visual, though.  Audial hallucinations were strong and completely mind bending.  My friend and I both swore we heard growling...howling...screeching that one would typically associate with hollywood-type sound effects from Jurassic Park, Star Wars or other such high budget films.  By late evening, my experience could definately have fallen into the category of 'tripping' rather than 'high'.  Unlike mushrooms or LSD, though, this trip had no feeling of excessive energy or inability to fall asleep.  \r\nAll told, the entire experience extended for less than 5 hours (Midnight to 5 am; with effects taperinb), but was incredibly intricate.  Any thing done was distorted by the quickly onsetting visual distortions.   All told, I spent about 4 dollars myself (for both the cannabis & harmala) and got higher than I've ever gotten off cannabis AND as high as I would have on about 3 or 4 gms of Mushrooms (about $40 bucks aro!\r\nund here).  \r\nI do have to warn, though...there was very intense paranoia, especially when the audial hallucinations kicked in.  I had QUITE a few experiences in the span of 5 hours that would have been TERRIFYING by normal standards; but conversely, I was very aloof and unconcerned about how afraid I was.\n\n\n"
}
