{
 "title": "Consistent Stages of Transformation: Fire",
 "author": "Baklava",
 "citation": "   Baklava. \"Consistent Stages of Transformation: Fire: experience with LSD & Cannabis (ID 11148)\". Erowid.org. Nov 14, 2004. erowid.org/exp/11148",
 "substance": "LSD & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "1997",
   "ID: 11148",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 14, 2004",
   "Views: 5146",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[I've enclosed the section of this report concerning the key part concerning my title in *****, since the report is long and I'd rather people skip to that part and read it if they don't find the tale as a whole intriguing rather than skip this report altogether]</p><p>One of the standard recommendations for having a good psychedelic experience is, 'Keep an open mind.'  The rationale behind this suggestion - a well-meaning one I personally support - is that a  whole other universe of new experience awaits on the other side which a closed mind with preconceived expectations might reject with dangerous repurcussions.  'Go with the flow,' is an important psychedelic maxim because it instructs one to minimize the resistance that creates tumultuous friction between what's coming and what one is willing to permit.  </p><p>Once one is familiar with this vital concept of the open path with least resistance, he or she can begin to direct the manner of their perceptions toward investigating that vague territory called 'reality' or 'truth'.  'Investigating' is the key word here, because many glimpses we have of the beyond seem ephemeral and unrepeatable, yet we feel they contained some powerful mystery another deeper look might reveal.  </p><p>A bit disappointed by the vast number of disparate, inconclusive, and frightfully gone awry experiences reported on various websites, I feel compelled to provide here a 'systematic' method of perceiving what seem to me to be 'universals' that was revealed to me over the course of many trips, particularly this one.  I have shown numerous friends (and been shown) during the psychedelic experience how to see in this manner.  Much of that guidance is quite frankly telepathic, but I have been told that my verbal/linguistic capacities are particularly vivid during the experience. This linguistic capacity is one area emphasized by Terence McKenna that the psychedelic community can and must hone into, both during and after the experience for the sake of credibility.  It is primarily syntactic, in my view, since timing and emphasis seem to produce the 'right words' almost of their own accord.  I'm going to make a go at describing what I believe to be an important intermediate, transitional stage in the psychedelic experience.</p><p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it.] </p><p>I went camping in the woods with 3 friends one evening and the 4 of us split 10 hits in the car on the way (I don't think this is a good idea, but we were 20 minutes away.  Also I'd recommend mushrooms over acid, since acid can be dirty, but this stuff was pretty good). We were all kind of feeling something on our first trip of carrying stuff to our site from the car, but it was on the second trip that things unleashed ('trip' meaning 'walking' here, we were all 'experienced').  </p><p>We were in good spirits, a laid back bunch looking to have an eerie bit of wild fun in the woods.  Well, as it went from sunset to dusk on our 2nd trip carrying stuff to the site (including a bag of firewood since we were in a protected national forest, and a cooler full of beer), our expectations came true as we got lost.  As can be guessed, we argued, emit exasperated sighs, offered plans that filled our hopes only to be disappointed by the wrong route, then directed our condescension at the guy who'd convinced us that was the way.  With much relief we finally found our way back to the site, but drenched in sweat along the way, we'd got fed up with carrying the firewood and dropped it.  Two of the guys went off to get it, while I collapsed in the leaves with R. to look through a clearing at the stars.</p><p>Something about the physical duress of looking for our site kicked the acid in heavy upon the soonest moment of rest.  R. was claiming he'd never had a trip come on that heavy before, and as I chuckled at his exaggerations, I became aware of an overhead whirring like UFOs passing overhead.  Bemused, I told R. to listen, and as he zoned in on the same sound, wide-eyed in smiling amazement he repeatedly asked, 'What is that?' interspacing his interrogations with keen listening.</p><p>The other 2 came back around this time trudging through the forest like elephants, making jokes about how easy our site was to find and how dumb we were.  R. began telling them about the intensity of the trip and the UFO sounds, upon which he was mocked and I was looked to for blame.  Implicitly agreeing with R., we quickly arrived at consensus to make some light by building a fire before we were too wacked to accomplish the primitive task. </p><p>Building a fire is a great lesson in cooperation - on levels that multiplied with every moment on this occasion.  For the most part averting the 3 stooges bickering that characterized getting lost, we soon had a nice bright blaze and enormous satisfied grins.  An MMW live tape kicked out funky grooves from the little boombox we'd brought along, and R. was much revered for his goofy dance and facial expressions upon hearing the unforgettable riff he dubbed, 'The Funky Marshmellow'.  I wish I could hum it or play it for you right now, it's contagiously groovy.  I remember his face looked so Renaissance to me for some reason in the firelight, like a character out of a Brughel or Rembrandt.  god he was funny!  legendary stuff. </p><p>   *************************************************************</p><p>I think a bit of guilt at our indulgent giggling at the scene of R.'s jig probably spurred the more serious introspective period that followed.  The four of us stared into the fire from our respective positions and listened to the cicadas mix with the MMW and the crackling flames.  It was kind of like a slow exhale for us - we'd gone through hell finding our site after all!  And we were finally away from campus in Nature.  Aaaah, and tripping.  I focused on the white hot coals in one of the crevices for some reason - I think because of this space's consistency compared to the flickering flames above.  </p><p>I soon became aware of that phenomena I'd discovered many trips before in which my eyes move out of focus in order to bring into focus psychedelic visuals.  'Normally' when I focus on a point in space sober, there's a kind of immediate boxing, or tunneling, or framing of the space around it.  But on psychedelics this space is produced more slowly and requires greater concentration.  One conceives this focus as a kind of peeling.  Often, previously, upon the commencement of this peeling, I would be immediately distracted by its motion and transformations.  Once that happens, it's absurdly easy to forget what produced the phenomena until it happens again the next time I try focusing.  Another deterrent is the mind-bending feeling that accompanies the dramatic revisioning before me.  'Is something going wrong?' or 'Am I going too far?' are 2 of the questions I've thought in the past at these moments.  But if I stick with it, moves through the process layer after layer, the rewards are extraordinary.</p><p>The blazing alcoves in a campfire are prime spaces to develop this kind of focused vision while on psychedelic drugs.  The ebb and flow of light in these spaces is far easier to follow than the dancing flames above.  The intensity of the space is rivetting.  The ancient, cosmic mysticism of the fire; its sheer heat and power - this primal thing actually in front of you! - is awesome to behold and wondrous to ponder.  Throw some psychedelics in the perceiver and it's not hard to convince myself the fire holds secrets.</p><p>While staring into this alcove as the peeling process began, I persisted to concentrate beyond the initial defocusing.  This is when 'trippy' crossed over to 'sublime'.  I began to see rotating motion in opposite directions at each layer of wood-fold leading in toward the core. I then chose to focus on these folds, almost sideways-like as it seemed I was still focusing on the hot coals in the core (I felt a physical shifting in my head as this happened).  What soon emerged were a series of profiled, skull-like faces which I had become aware of in an earlier trip.  The hazy, breathing visuals I always see tripping began to delineate themselves with an almost concrete structural clarity.  If I continue to concentrate and continue to believe in what I am seeing, such imagery becomes ever more refined.</p><p>The profiled cranial faces led all the way to the coals - my original focus - transforming in real-time with the ebb and flow of light in the fire.  I almost forgot there was heat involved, this precise motion of light was so fascinating.  Now once more focused on the coals, incorporating also the surrounding tunnel that had started the process, I became aware of prismlike shapes, as though they were actually octagonally cut stones illuminated by inner light.  The notion of something very old and elemental about this new impression made me think of them as fossils or shells.  Upon thinking this the prisms took on a segmented spiralling shape.  I became aware of the fire's interconnectivity with the ground and the space we'd cleared for it.  Integeration was so overwhelming that it hardly seemed there was anything 'burning' at all.  </p><p>Blown away I broke the silence and brought this to the attention of my friends, whose silence I suddenly became aware of with a sneaky suspicion they'd been waiting for me to talk all this time.  I tried to coax (a very adamant NOT HOAX) them through the process of seeing what I'd just gone through.  Intrigue was at every stop accompanied by resistance, as though seeing what I was telling them was either going too far, or demanding some type of responsibility on their part.  It soon became ridiculously evident that once this vision was interconnected, it depended on mutual belief.  A series of 'I got it's' and 'I see it's' and 'Woa's' encouraged each progressive step toward the integrational structure where I'd stopped previously alone.  Yet, suddenly I lost the vision.  I looked at D. next to me.  'What happened?' he asked me.  'I don't know, that's why I'm looking at you,' I said.  'It disappeared,' he said.  We looked over at P. who'd heard us, 'Same here,' he said.  In unison the 3 of us looked accusingly at R.. 'R.?' D. asked with obvious implications.  'What?' R. responds looking shifty-eyed like a little kid caught disobeying his parents.  'It stopped,' D. told him.  Aware we're all looking at him, R. stammers out a denial of any knowledge or responsibility.</p><p>A discussion ensues.  We decide that we're either all crazy, or that some kind of mutual faith is needed for all of us to see these visions.  We agree we're all crazy, but we all thought this was pretty mind-blowing, and it definitely helped integrate us as we were hitting the peak-levels at which ordinary speech is increasingly irrelevent and each man is an island.  so we gave it another go, D. instructing R. to stick with it.  It all happened again, but each time it was like someone pulled the plug.  I even felt responsible at one point as the resistance aura built up and interfered with my system.  Now that I 'the founder' had mis-fired, it was like a virtual frown where the gang threw up their hands and gave up.  Now they were in general agreement this was too much, although they acknowledged they knew what I was talking about and had seen it.</p><p>     ******************************************************</p><p>A bit dismayed, I relented.  I didn't want to go pushing my bros over the edge here in the woods.  We were supposed to be chilling anyway, not 'thinking' right?  But this left us with a void.  A pronounced aversion to the fire became palpable.  The desire was voiced to go visit the fire tower up the trail and look out at the stars (i just now notice the irony in this as I write. Hahaha!  Read on.)  I kind of wanted to go too and try out this experiment on the whole sky.  But then the question arose, could the 4 of us leave the fire unattended?  It had died down quite a bit in the hour since the MMW tape started and we hadn't added extra logs, but was this safe?  A long unpleasant confrontation with responsibility ensued, and we were peaking massively in our 3rd hour.  We had beers in a cooler for later when the trip tapered off to drink by the fire, so no one wanted to put it out and start it up later.  I volunteered to stay, but then D. asked, 'Do you feel ok with staying here by yourself?'  I paused and considered.  A creepy crowd of druid-like figures seemed to emerge from the woods and recede.  'Hmmmm, not really,' I replied.  D. grinned with understanding, 'I didn't think so.'  So what do we do?  I finally agree reluctantly the fire's ok, and we could all go. </p><p>P. was already hanging about the trail with a headlamp like he was about to go coal-mining.  R. embarked to the trail in what was later to be fiercely debated as a new short path from our site to the main path.  It was definitely one of 2 pre-established paths from our site to the main path, but had we traversed it up till now?  D. followed R. with me behind them.  R. suddenly starts to seem like he's moving in slow motion and turns an odd sheepish grin back toward D..  I can see D.'s face in part from the side return a questioning grin at R., like 'what r u smiling at wiseguy?'   Then D. starts to move in slow-mo too and a clutter of 'Whaaa's' and 'Hey's' transpire from them as R. starts falling forward with D. coming on top of him.  It felt like we were pushing through some invisible membrane.  I felt a kind of 'whoosh' at the end of which enclosing me I could feel congealing the membrane's broken edges.  'SPIDER WEB,' I said quietly, immediately turning to go back to the fire, resisting a thousand hallucinations that thrust in upon me. </p><p>At the fire my hands felt over my body to confer that I could perceive nothing accurately, the hallucinations were intense and interference was everywhere.  Fear sprung upon me at this no-man's land reality.  Is there a black widow down the back of my shirt?!  What kind of web would be strong enough to make R. and D. fall!?  A big pissed off spider's.  'Come back to the fire!' I barked in sharp syllables of urgent fear.</p><p>I ordered my aghast and bewildered friends check every inch of my upper body with flashlights.  Luckily P. was composed since he hadn't endured the event, and provided a much needed calming, rational influence while almost angrily with a huge chip on my shoulder I interrogated R. and D..  Nothing could be agreed on.  The spider web seemed plausible but not conclusive, and it seemed like R. and D. were actually hiding some dimly realized knowledge of the event from me.  I couldn't tell if it was a big fat web and they didn't want to freak me out, or if they actually suspected what I was starting to: the 'membrane' kept us from leaving the fire, whatever it was.  The words, 'bubble,' 'cellophane,' 'plastic wrap,' etc. were used to describe the strange entity, but its reality could neither be dismissed nor agreed upon.  D. & R. fell to the GROUND as they passed through it!  Either that web had strands like steel cables or it was constructed mentally with greater strength than physical entities.  It's still open to question.</p><p>D. ended up sticking by the fire with me while R. and P. went to the tower, and we took our turn later.  Things calmed down and the rest of the trip was beautiful and contemplative, with a few beers to ground the 4 of us after our wild ride before sleep.</p><p>The central portion of the story regarding the fire and higher perception is the major facet I wanted to convey here.  I have since duplicated the process with others on various occasions, and I have no doubt if any of them desired, they could show other people the same thing, leading all the way to a crystalline structure verging on Buddha.</p>"
}
