{
 "title": "A Couple Share a Brain and Body",
 "author": "Myke Ralphy",
 "citation": "   Myke Ralphy. \"A Couple Share a Brain and Body: experience with Mushrooms (P. cubensis) & Cannabis (ID 11236)\". Erowid.org. Dec 12, 2001. erowid.org/exp/11236",
 "substance": "Mushrooms (P. cubensis) & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1.8 g",
   "oral",
   "Mushrooms - P. cubensis",
   " ",
   "5 hits",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "11236",
   "Male",
   " ",
   "Not Given",
   "Dec 12, 2001",
   "13585",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy girlfriend and I had taken extacy a couple times before our mushroom experience, and had smoked pot occasionally.  I thought we were as close as a couple of people could be.  We not only share common interests, but our brains think alike much of the time.  We ate the shrooms at about 7 pm, and then proceded to her room.  We lay on the bed and stared at the ceilng while listening to Tool's Aenima (excellent companion to shrooming).</p><p>The normal shroom feeling started to come over us and we were telling each other what we were seeing in the stucco on the ceiling.  After the album ended, we wanted to listen to the new Tool album Lateralus, but it was nowhere to be found.  After looking thru her entire cd collection, we found it in her portable cd player.  Then her cd player on the computer wouldn't read the disc and both of us started to get really bummed out.  I remembered that I had my portable cd player and car tape adapter in my truck, and we could plug that into her boombox(with only a working tape deck).  We ventured out thru the parking lot and realized how high we really were.  </p><p>To get on with the story, about three songs into Lateralus, I asked her if she wanted to smoke pot, and she happily obliged.  After taking about 5 hits each, we lay down on her bed and let the music do its thing. The pot sparked the visuals to increase in length and beauty, but my mind was so preoccupied that I hardly noticed them until my girlfriend moved around.  </p><p>Then, out of nowhere, the trip took an unexpected turn.  The two of us embraced, and with our heads right next to each other, we sort of fell into this mutual body of light.  Both of our minds were united in a telepathic (bad word) connection.  We had these exquisite conversations(another bad word) that were like a mental texture.  Our bodies melted together and it was pretty difficult to tell where her body and mind ended and mine began.</p><p>The whole time, Tool and Maynard's side project A Perfect Circle were narrating the entire experience to us.  The singer, Maynard James Keenan, well, his presence permeated the entire thing and made it delicately brutal.   </p><p>I have read quite a bit of stuff about Tool, they are my absolute favorite band, and in different interviews they talk about a book that dosen't exist.  They say it is called 'A Joyful Guide to Lachrymology', lachrymology being the study of crying.  Maynard kept telling me what I needed to do, and his voice was so beautiful that I suddenly realized how bad I needed to cry.  The release that I felt was incredible.  My girlfriend was telling me to let it all out, and the powerful Perfect Circle song Brena took ahold of me.  One line in the song is just two words, but there is such emotion behind it that I felt like Maynard knew me inside and out. 'It's alright' was all he said to me and I knew he was always going to be there for me.  </p><p>Went off on a tangent about the music, but I can't stress enough how important Tool is to me.  I reccomend everyone that is going to take shrooms to get ahold of Tool's Lateralus and A Perfect Circle.  It is an experience that will not soon leave you.</p><p>This was by far the closest I have ever felt to anybody.  My girlfriend and I both know each other inside and out, and I know deep down that we were meant for each other.  Far beyond just soul mates, it was like we had done this a thousand times before.  And to quote a line from the Tool song 'Third Eye'</p><p>             'So glad to see you, I've missed you so much.</p><p>               So glad it's over, I've missed you so much.'</p>"
}
