{
 "title": "Trailerpark Tripping",
 "author": "AnthemisNobelis",
 "citation": "   AnthemisNobelis. \"Trailerpark Tripping: experience with Mushrooms (ID 11300)\". Erowid.org. Jun 25, 2002. erowid.org/exp/11300",
 "substance": "Mushrooms",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11300",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2002",
   "Views: 6516",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis was my second experience taking shrooms. The first time they either were bogus, or I didn't eat enough.  This second time, I took two doses worth. I had priorly only done marijuana at this time.<br>While ingesting them, I usually just try to swallow them as quickly as possible with as little chewing and tasting as possible as they aren't particuarly tasty.<br>The onset took a little over an hour, and I had almost thought that I had gotten another bogus batch again, but I started noticing a change in my perception.<br>At first it was pretty mild and I was still able to be pretty coherant, but I was starting to experience a lot of visual hallucinations, but I was physically aware it was all an illusion brought on by the shrooms, so I was cool with it.<br>I went to the bathroom to talk to a girl I was going out with at the time and was watching myself in the mirror, watching the skin on my face form boils and my face getting all gargoyle-like and evil looking. I found this intruiging and tripped out in the mirror for quite some time.<br>I than sat chatting with my brother on his bed describing the visual effects being produced by the shrooms. The first noticable effect was walls and surfaces being wavy and/or turning liquidy. <br>For example, his closet had that fake magoheny wood trim which was very wavy and it seemed to melt and glob into it's self, much like a lava lamp.  <br>I then stared at him for a short while, still describing the visual effects as I watched his face get all chunky and then cave in on it's self. I found it extremely cool because it looked so real even though I knew it was just a visual hallucination. I had to keep reminding myself it wasn't real. <br>After a while I looked at a fake rubber cockroach he kept on his mirror and it appeared to come alive and move around. I also looked at one of those little square paint blobs you make at local fairs, and the black dried paint began to run and move to the edges.<br>About this time my brother kicked my tripping ass out of his room since he had to work so I lay in the hallway for what seemed like two hours tripping on the walls and the ceiling and laughing to myself because they were all wavy and pulsating and appeared to come closer to me.  I was able to somehow soom into the ceiling and see the smallest particles.<br>I finally made it out to the living room where I realized the television was on and I tried to watch it, but my mind could not put the visual and audio together. My hearing would make the sound slow down out of sync with the picture on the TV or go really fast.  <br>There were times when I would hear a sound with my whole body and my whole body would just do one big twitch. By this time it had been about three or four hours and it was probably around 2 in the morning and I was getting tired.<br>I began tripping on my hand a bit, holding it out, and watching it turn to a rubber-like texture, and then looking at a plaque with a religious inscription my deceased grandmother had given my brother. The plaque started glowing and I saw weird characters burn into the plaque, like old arabic or hebrew or something.  I felt my grandmother was trying to contact me from the grave and it was a very rewarding and spiritual experience.<br>I finally tried to go to my room and go to sleep, but I realized the heater vent sounded as loud as a 747 jet, even though in reality it wasn't, it was just my distorted hearing.<br>I continually tried closing my eyes for about an hour, only to have the sensation of thousands of thoughts, images, and feelings pulse through my brain, almost like an information overload and wishing it would stop so I could go to sleep. It was more annoying than anything else since it wouldn't have bothered me so much had I not been so exhausted.<br>I finally was able to succumb to sleep and awoke the next morning, very tired, but pretty much returned to normal. Sadly, I had to work a 10 hour shift at work that day and I dragged ass, but it was definately worth the experience. Next time I would take the day after the trip off though to recuperate from the mental and physical drain it does on the body\n\n\n"
}
