{
 "title": "Why Am I Doing This?",
 "author": "Zeke",
 "citation": "   Zeke. \"Why Am I Doing This?: experience with Diethyl Ether (ID 11308)\". Erowid.org. Feb 11, 2004. erowid.org/exp/11308",
 "substance": "Diethyl Ether",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Ether",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11308",
   "Male",
   " ",
   "Not Given",
   "Feb 11, 2004",
   "Views: 62760",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>..as I write this I am looking over my shoulder at a backpack,  some socks and shirt crumpled on the floor,  these soft items represent the only barrier between me and..  it.  Concealed in a glass jar the ether writhes in torrid volatility at the slightest..  jar,  or whichever movement might disturb it's selfless pooling. I am aware of it's..  nature,  that of a solvent,  and purpose..  to the more normal,  utilitarian man.  God..  help me.  I love the smell..  like so many memories wafting into review,  it is familiar,  like the smell of high octane gas and the momentary glance you recieve from the person at the pump just opposite yours..  above the short,  diminished shape of the pump.  Ether is the essence,  the precursor of modern fuel.  Long before there was any use, there was the attribute..</p><p>EXPERIENCE:   i had opened the jar,  immediately the pungence was pleasing to me.  'Inhale it'  Yes,  master..  i have recieved instruction.  If i dip a rag in it and huff and blow past it it will stink up the room..  people are sleeping,  namely family.  I find a long narrow bag,  bright orange construction colored bag..  industrial warning colored bag,  and take a folded up piece of paper towel..  this is the regulator,  placed it at the bottom.   Mmmm..  spray paint. I am breathing slowly,  it is strong..   i now how this works,  i need more.  Breathing..  breathing faster. it is strong..  it is natural,  i am numb and wet in the mouth. hyperventilating, i can't stop now,  i feel it with every breath..  faster,  necessary breather..  you want it!  i am diving in!  jesus,  what is this?!  what is that sound..  it is accleration..  what is going to happen to me?  Intensly audial,  emotions sweeping along..  i pause.  Soberness..  Soberness?  Breath from the bag..  there is a lot left.  Enough for now..  20 minutes later,  headache,  tell tale sign.  Dissolvent solution..  yet so temporary.  I will put it away,  under this crap on the floor..</p><p>there it is.. calling, i don't know</p>"
}
