{
 "title": "Shivering",
 "author": "Stefoine",
 "citation": "   Stefoine. \"Shivering: experience with Amphetamines (Adderall) (ID 11310)\". Erowid.org. Nov 29, 2007. erowid.org/exp/11310",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11310",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 29, 2007",
   "Views: 6374",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have a friend with ADD and he takes 10 mg of Adderall daily.  He told me that if I take enough of it that I could get pretty messed up since I don't have ADD.  So he sold me 17 10mg pills. I split these up with two other friends so I had 6, my friend, J, had 6 and my other friend, M, had 5.  We hadn't eaten since 11:00 and took the pills at 4:00 p.m. with a couple swallows of orange pop.  We were all sitting on a couch in M's basement and I thought I was feeling something happen.  At 4:35 I stood up to get a drink and it hit me.  The room seemed different, expanded, and my eyes felt more open than normal. I was completely awake and alert.  I told my friends to stand up too and the same thing happened to them.</p><p>The feeling of being really alert continued to get stronger.  It was different than anything I've felt before.  It felt like being high, but without the disoriented feeling, and also like being drunk but I didn't feel sick or dizzy.  We decided to go outside because I didn't want to stay indoors.  Once I stepped outside I felt even more messed up, but not like normal drugs that make u feel stupid, I was just taking in more of the world.  Something strange about this drug was that the hair on my head felt like it was standing up and moving around.  J felt this too even though he was wearing a hat. We made a really good decision to drive to Pizza Hut because we all wanted to sit down, but none of us were hungry.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>I had been really hungry before taking the pills. So J got in his car with two other friends that had been with us(they were both straight). And I got into my car with M.  Somehow we made it to Pizza Hut, but the entire way there was scary.  M kept moving his head around on the back of the seat because of the tingling feeling in his hair.  I did the same and it felt really cool.  The drug was peaking out when we got to Pizza Hut at 5:10.  I kept just hanging my mouth open and my eyes were wide open too. It felt really good and I was so relaxed.  I didn't eat anything inside the restaraunt, neither did J.  M had a small piece of garlic bread but didn't want any more.</p><p>We left around 6 and went to J's house. The Adderall was still goin strong at 6:30. In J's basement I felt really cold.  I was wearing a sweatshirt and jeans but I couldn't stop shivering.  The two friends with us that were straight didn't feel cold at all, but J and M were gettin the chills too.  Time seemed to be going by so slow.  At 7:00 I was still the same, cold, alert, and really messed up, but I was also being really serious.  I usually always joke around, but the three of us on Adderall were having a long conversation about god, parents, suicide, being mean to other kids, snowboarding, and some other stuff I can't remember. I realized how stupid and mean it was to make fun of people that can't help being who they are.</p><p>The high wasn't as strong anymore but I was still shivering like crazy and still not hungry. I tried to eat because I knew it was bad to go so long without food, but I couldn't.  We left J's house to go downtown and then we all went home around 11: 45. I'm usually a little tired around 12:00 but when I got home I was still wide awake.  I thought the drug would wear off soon and I'd go to sleep. At 1:00 I felt no need to sleep and still no need to eat. I wasn't really the same high that I was earlier.  My body was weak but my brain didn't need a rest at all. I went online and talked to J who was feeling the same way.</p><p>It was about 1:30 a.m. when I started hallucinating.  I looked at my wall next to my computer and it started to pulsate.  I got a little scared but it was cool looking. I had an empty pop can and if I stared at it, it would pulse in and out. Almost anything I looked at seemed to swell and shrink slightly. J said he was seeing some crazy stuff too. We had done LSD the week before and I thought we might be having a flashback.  I didn't like being by myself and J said to come over to his house.  He lives right in my neighboorhood.  So at 2:05 I put on my shoes and walked over to his house.  This was the scariest journey that I have ever taken in my hood.  I thought that I saw an old lady sitting on the corner of a street, and when I walked over a sewer I was pretty sure that there were rats squeaking down there.</p><p>I got to J's and we sat for a while and watched a snowboard video that seemed to last ten minutes.  Time was now speeding by instead of going slow.  I drank a little water but still wasn't hungry.  We were both still wide awake.  I wanted to go to sleep so badly. I left his house at 3 to try and sleep.  I was in my bed until 6:00 am when I think I finally fell asleep. I woke at 7:30 a.m. and wasn't tired at all.  It is now 10:58 a.m. and I got an hour and a half of sleep.  I am still having mild hallucinations and I don't feel normal yet. I don't think I will ever do this again.  The initial feeling is great but the coming down is a bitch.</p>"
}
