{
 "title": "Salvia 10x Didn't Work...Yet",
 "author": "Jack and the FA",
 "citation": "   Jack and the FA. \"Salvia 10x Didn't Work...Yet: experience with Salvia divinorum (10x extract) (ID 11323)\". Erowid.org. Dec 16, 2001. erowid.org/exp/11323",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11323",
   "Male",
   " ",
   "Not Given",
   "Dec 16, 2001",
   "Views: 7879",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI received an order of 'supposed' Salvia 10X extract yesterday in the mail from an online retailer whom I won't mention. Never having tried this magical herb, I'm unaware of its potency from the straight up plant to the 5X or even 10X extract and hopefully this online retailer was forthcoming in the product they sold me. But either way, I'd like to share my first experience with the readers. </p><p>I work 3rd shift, so when I get home, I'm usually too wired to just go to bed. At around 3:00 in the afternoon, I started to feel tired and a little buzzed from the few beers I'd drank a few hours earlier. I went to check my mail and to my surprise, there was a package from the company I recently made the purchase from. I was home alone and getting ready for bed and decided to take my chances and smoke this 'salvia 10X extract', without a sitter. Note--the reason for the quotes is I can only assume it was 10X. </p><p>I was feeling relaxed although a little nervous and a bit anxious from the other reports I'd read concerning 10X extract. I didn't want to go over the dosage my first time so I got into my comfortable bed with the lights down and packed my bong with only enough for about 1 decent hit. I lit it up, took a nice big toke and held it in for about 25 seconds. There was still a bit more in there so I hit it again, just a small hit but again held it in for about 20 seconds this time. Put the pipe down and lay in bed with my eyes closed. I definitely felt something. . . the first step in the salvia chart is the best way to describe it. I could feel my limbs becoming heavier but only slightly and I was feeling relaxed but also anticipating this great rush that never came. </p><p>After about 5 minutes, I wanted to have another go at it, so I packed myself a bigger bowl and hit it twice holding the smoke in for roughly 20-30 seconds again. Again, I lay on my bed and only felt a little heavier in my limbs but nothing profound. After 10 more minutes I figured I should hang it up for the day and get some much needed sleep. Total consumption - . 05 grams - well over the recommended dosage for a 'first-timer' w/ no sitter!!!</p><p>As I write this I begin to question why I didn't gain the desired effects. Like I said, never having smoked or even seen Salvia in leaf or in extract form, I have no idea if the company I dealt with was honest in dealing with me. It could also possibly be my state of mind, even as tired as I was having a few beers earlier, I was still anxious and not as relaxed as I could have been. Perhaps it was the way I ingested this product. Maybe I didn't smoke 'fast' enough? </p><p>I read somewhere on the web that Salvia may also 'grow on you' and that you may need to try it a few times before gaining the desired effect. I'll NOT give up this quest until I'm absolutely certain that this herb is not for me. I'm going to finish the batch I have and order from a different company this time, hopefully able to make the leap from this plane of existence to the next.</p>"
}
