{
 "title": "Being Pulled into Oblivion",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Being Pulled into Oblivion: experience with Salvia divinorum (ID 1133)\". Erowid.org. Apr 16, 2001. erowid.org/exp/1133",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "0.25 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1133",
   "Not Specified",
   " ",
   "Not Given",
   "Apr 16, 2001",
   "Views: 7963",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is pretty much how it went:</p><p>12:00PM - I loaded my pipe about 1/4 full with salvia 5x extract and lit up.  Before this experience I had tried a couple hits using a bit less, and I experienced no effects.  But, this time was the breakthrough I guess.</p><p>I inhaled the smoke (it was VERY hot, but it's not too hard to inhale once you get used to it).  After holding the smoke in for 15-20 seconds, I decided to go sit on my bed. I let the smoke out and immediately began to feel strange, as if I were outside of myself.  </p><p>12:05PM - Soon, my vision began to turn 2D...I didn't really focus on anything while I was sitting down.  My vision was a bit blurred.  I kept staring wide-eyed at my dresser and all of a sudden, something started to pull me forward. There appeared to be a very subtle, indescribable path in front of me, like an airstrip, where I'm the plane waiting to take off.  I kept feeling this force pulling me onto it, but I just stared in amazement and waited. It felt as if it wanted me to lie back and experience the whole shebang, but I refused to. A few seconds later I heard something say, 'Come with me,'...but still, I didn't want to move.  I had no sitter and I didn't want to risk hitting myself in the head or something.  </p><p>12:15 - I was sort of half awake at this point...VERY spaced out. I walked down the stairs to the first floor and looked outside.  There were no visuals, but I was still pretty out of it.  2-3 minutes later I returned to reality.</p><p>For the next 30 minutes I was in a rather euphoric state, a little spaced out, but still aware of all my surroundings.  Listening to music was extremely pleasurable.  In about an hour, the effects were completely gone.  Although I know for a FACT that I didn't go through the complete salvia experience, I was still amazed at how powerful the plant was.  I was able to control whether or not I wanted to 'take off' into salvia-space, possibly because of the small dose I had taken.  This drug is definitely weird, and I'm probably going to try it again, but maybe with a sitter and a larger dose of the 5x extract.</p>"
}
