{
 "title": "Unanticipated Sitting for 5-MeO-DMT",
 "author": "Samanthe",
 "citation": "   Samanthe. \"Unanticipated Sitting for 5-MeO-DMT: experience with 5-MeO-DMT (ID 11353)\". Erowid.org. Feb 15, 2002. erowid.org/exp/11353",
 "substance": "5-MeO-DMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11353",
   "Female",
   " ",
   "Not Given",
   "Feb 15, 2002",
   "Views: 17087",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I arrived at my friend Edgar's house, to discover that he had brought out his stash of 5-MeO-DMT and was going to turn on his two guests. I did not want to smoke any 5-MeO, nor did I particularly want to sit around while others smoked it. However, I felt it would be awkward to leave right after getting there, so I stayed and decided to make the most of an unanticipated opportunity to learn more about sitting.</p><p>I couldn't just sit there nonchalantly, because I was part of the space whether I wanted that or not, so I adjusted my attitude to one of a sitter witnessing a sacred thing, people launching their minds into a tryptamine space.</p><p>Guest 2 went first (Guest 1 opted out). I sat next to her, with my arm on the couch behind her, closed my eyes, deepened and steadied my breathing, and imagined anchoring myself on the earth, 'holding space' for her. I simply concentrated my attention on making the space around us protected and neutral. After she inhaled and the pipe-holder took the pipe away, her head slumped down. After a few moments, she started to breath more deeply and quickly, she giggled, and she drooled. I continued to imagine calmness and acceptance for whatever experience she was having.</p><p>When she started to emerge, that felt like a crucial time, and I paid attention to cues from her and my intuition as to whether and when to speak to her. She was ecstatic, so I just returned her smile and sat there while she whooped and hollered, continuing to send anchoring energy down into the earth. Because we were in an apartment building and she was being loud, we tried to gently remind her to keep it down, but she was pretty oblivious and didn't care. This is an example of why I didn't at first want to stay there while people smoked 5-MeO-DMT -- you never know when you might have a situation on your hands, and I think carefully picking the setting (i.e. feeling safe about people hollering if they want to holler) is important.</p><p>Next Edgar went. It was also his first time smoking 5-MeO-DMT, and he was an experienced psychonaut. I repeated my 'holding space' process for him, as he inhaled and sat back on the couch. His eyes remained open the whole time, and his breathing got shallow, the opposite of Guest 2's experience. It looked as if he were 'stuck' somewhere. He 'stayed out' longer and eventually started to look around, glazed, almost like a strange incredulous child. This is when I felt he might be emerging. I put my hand softly between his shoulder blades and said, 'welcome back.' That was basically because I was having trouble distinguishing whether he'd 'made it back yet' and it had been a while since he'd inhaled, so I felt like saying something to him.</p><p>The 'welcome back' hit the spot with him -- I asked him softly if he wanted to talk about it. He's very analytical, and began explaining how he'd been completely out, and the trip almost didn't begin for him until he heard those words, and he felt like he was being welcomed back into a warm world of loving friends after a long voyage to a foreign land.</p><p>Meanwhile, I felt wiped out from sitting. Concentrating like that, banishing any worry about possible mishaps while at the same time feeling prepared for them, while projecting protective calm energy, takes a lot out of me. I can begin to understand how career sitters who've been there for my tripping have felt after many hours. </p><p>Fortunately these two experiencers had no problems with their trips. If they had, I would have continued to project calm and OK-ness, because the feedback it creates when the sitter shows any sense of worry at all is really counterproductive. But damn if that's not a huge responsibility!</p>"
}
