{
 "title": "Pharm Poetry",
 "author": "Evan L",
 "citation": "   Evan L. \"Pharm Poetry: experience with Oxycodone (ID 11357)\". Erowid.org. Mar 24, 2006. erowid.org/exp/11357",
 "substance": "Oxycodone",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)",
   " ",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   " ",
   "0.5 mg",
   "oral",
   "Pharms - Risperidone",
   "(daily)",
   " ",
   "  ",
   "smoked",
   "Tobacco",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11357",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 24, 2006",
   "Views: 9980",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI swallowed 25 mg's of oxycodone at 7:30. At 9 o'clock I was feeling euphoric and in the mood to write how I felt. Extreme beauty and the feeling that everything was getting better swarmed around me. I was also taking Effexor 150 mg's and Risperdal .5mg's daily for my depression. I also smoked two black and mild cigars while writing. Here is what I wrote..\r\nWarm waves slip into my heart,\r\nMy eyes close and enter sweet slumber.\r\nSmoke rises from a joy-filled plain.\r\nThe cold of the night doesn't enter me,\r\nYet gains awareness that I don't grasp for it.\r\nFuzzy cottonballs replace my bone.\r\nThey cozily fit together to form my body.\r\nThe starless night still seems bright,\r\nUnevading and calm the moon does appear.\r\nNo news could change my state of mind.\r\nThe moon then creates a spotlight on me.\r\nEverything working for me is ten times as clear,\r\nAnd the negative things cease to exist.\r\nTime drives by in bundles as I smile.\r\nLights gain a mysterious glow.\r\nMy limbs move in a warm fire of hope.\r\nYet my skin stays in a radiant way.\r\nClear are my thoughts and ambitions.\r\nMy eyes are starlit as if another universe is inside me,\r\nWith only good to let the planets revolve.\r\nTowards the end of the experience, I felt better about myself. As if my current depression had been swept away. All and all, I had a very pleasant time. It was the best Halloween of my life..\n\n\n"
}
