{
 "title": "Getting Up While Staying Calm",
 "author": "Tina & Gina",
 "citation": "   Tina & Gina. \"Getting Up While Staying Calm: experience with Methamphetamine & GBL (ID 11378)\". Erowid.org. Dec 8, 2006. erowid.org/exp/11378",
 "substance": "Methamphetamine & GBL",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 bumps",
   "inhaled",
   "Methamphetamine",
   "(powder / crystals)",
   " ",
   "0.1 oz",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11378",
   "Male",
   " ",
   "Not Given",
   "Dec 8, 2006",
   "12860",
   " "
  ]
 ],
 "report": "<p>My lover and I live in a medium-sized Midwestern US city. There seems to be a large concentration of other people here who've discovered a combination of drugs that, while I can't 'recommend' it to everyone, seems to be a great way to party-hearty over the course of an entire weekend.</p><p>We call it the 'Tina/Gina' plan.</p><p>It consists of a combination of Crytal Methamphetamine ('Tina') and GBL ('Gina'). For us, the combination of the two works wonderfully. A 'bump' or two of Tina every few hours keeps you going for 2 or 3 days (which we find to be about our maximum before sleep deprivation psychosis settles in), and a 'dose' of Gina (.10 oz) about every 1.5-2 hours) not only takes off the 'edge' of the Tina, but adds a wonderful relaxation feeling and mild euphoria.</p><p>There do seem to be some things requiring care with this combination. First, Gina dosage should be watched very carefully. With the consumption of Tina, your mind is on high but the Gina can quickly (and without much warning) wear my body down. Sometimes, a dose may not produce any effect, but from my research I've found that the body is storing it in organs and it can be released at any time which may cause an unpleasant overdose ('crossing over' as it's called around here).  Personally, I've found that raising the blood-sugar level of someone who's crossing over helps (best done by making them eat something with a high sugar content, i.e donuts, candy bar, etc). Smelling salts also seem to snap even the biggest OD'er out of it.</p><p>Even though my lover and I love this combination to best enjoy a weekend of partying, I'm growing more and more leary of the Tina part of the combination. I've noticed the gums of my mouth slowly deteriorating (receeding) and I've seen heavy rotting of the teeth of the more hardcore Crystal users in our group. Though I'm not thoroughly convinced that Crystal is the sole culprit (it might be the GBL sold as 'contact cement cleaner' that's stripping the gums...), I do know that the Tina keeps us going far longer than the body/mind is meant to go without sleep or rest and that worries me. Addiction doesn't seem to be a problem with either of us as we very rarely ever use Tina during the week. We are finding ourselves using Gina more regularly (during the week), but I'm not too worried about its effects...yet. Eventually, we may get ourselves off of both, but for now, the combination we've found is the best way to enjoy an entire weekend of festivities.</p>"
}
