{
 "title": "Purgatory at Magnolia Street",
 "author": "Lyla",
 "citation": "Citation:   Lyla. \"Purgatory at Magnolia Street: experience with Cannabis (ID 11374)\". Erowid.org. Oct 25, 2004. erowid.org/exp/11374",
 "substance": "Cannabis",
 "bodyweight": "50 kg",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 11374",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 25, 2004",
   "Views: 6592",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had a fucked up, fucked up childhood and so when my friends started smoking cones at age thirteen, I was all for it. I honestly don't remember if I enjoyed myself or not, I don't think it really hit me for a few years. By the time I was seventeen I had a bit of an eating disorder, a few hang ups about my body, that sort of shit. I was pretty fucking happy alot of the time. I had heaps of friends, alot of boyfriends...that sort of thing.\r\nI'd been avoiding pot for a while. I'd notice I'd green out alot of the time, or get in weird moods where I couldn't talk to anyone. But one day I was at my friends house and I was offered a couple of cones. I wasn't in the mood but I said yes anyway. I'm that sort of person.\r\nI had two cones, a few cigarettes, a coffee and a lie down. About a minute after I lay down I knew something was wrong. It was my heart. It was racing so fast that I could feel the vibrations, my hands were shaking, it was missing beats, I stood up and I fell down. Everyone thought it was so funny. I had to crawl to the bathroom with everyone laughing so I could collapse on the tiles and try to shake the feeling.\r\nI was crying in the bathroom. It's hard to describe but I just knew in myself I was dying. I had denounced God years before, and here I was begging, pleading, screaming with God to save me. I was blacking out and coming to and seeing visions of God and the Devil (more like auras than human figures) and neither of them wanted me. I wanted to be with God so I promised him I wouldn't fuck my life up anymore. I said I'd cut off all my hair, stop smoking, swearing, fucking, anything.\r\nAfter a bit I felt a bit better, still really sick but not on deaths door. A friend came in and offered me a cigarette. I said 'fuck yeah' took a drag, and it all started again. I was sure God was punishing me.\r\nIn the end I went to the hospital. My heart beat was 170 or something fucked like that. I stopped seeing my friends. The truth is I have never been the same since. I have an anxiety problem that is so bad that I can barely leave the house.\r\nIt's not fair to say marijuana wrecked my life. I have a lengthy history of mental illness in my family. However I hate how people say pot is so harmless. Because for some people it is fucking hell.\r\nIt was for me.\r\nIf you don't like smoking cones just dont do it. It doesnt matter what your friend think it hits some people differently.\n\n\n"
}