{
 "title": "Sprung",
 "author": "Susie Q",
 "citation": "   Susie Q. \"Sprung: experience with Amphetamines (Adderall) (ID 11399)\". Erowid.org. Nov 29, 2007. erowid.org/exp/11399",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Amphetamines"
  ]
 ],
 "footer": [
  [
   "97",
   "11399",
   "Female",
   " ",
   "Not Given",
   "Nov 29, 2007",
   "7955",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Once upon a time I had a semi-normal life. I went to school. I ran cross country.I played guitar.I hung out with my friends. I aspired to become a trauma surgeon. I ate three meals a day. I slept at night. But those things I just described to you are hard for me to remember now. Why? Because for the past 3 years of my life I have, without realizing it, given my life over to 'Addy.' </p><p>Before Addy, my drug habits consisted mainly of alcohol (on weekends and in very moderate amounts), weed (maybe once a week), and on very rare occasions, coke and/or smack (but never to the point of addiction). I was prescribed Ritalin (I have a mild case of ADD) for 6 or 7 years before I was introduced to the bitch that now controls every facet of my life. When my pediatrician suggested that I switch from Ritalin to Adderall, or as he called it, 'The newest, longest-acting and most effective ADD medication', I was a little nervous because after years of taking Ritalin I had grown quite accustomed to it and was reluctant to part w / it. I had heard of people abusing Ritalin before but never had a desire to try it myself. I liked the way it made me feel when I took it as prescribed. I told my doctor that I would agree to meet this 'Addy' on a trial basis. I was 15 years old at that time.</p><p>So, at that point, I allowed Addy into my life in a 10 mg dose at breakfast and a second, 5 mg dose at noon. My life changed radically in the months that followed. I noticed that about an hour after taking my morning dose, time turned into a somewhat abstract thing. An activity that would usually be boring and dull, became the most exciting thing in the world with Addy there to keep me company. All of my senses were amplified. I didn't have to bother with trivial things like eating and sleeping. I was intensely FOCUSED on everything around me and inside of me. It felt so good to be in my skin. To sum it up in a word : Supernatural. I felt like a goddess when I was with Addy. Three years flew by, before I  even had the chance to blink my dilated eyes. Life was perfect, or so I thought. </p><p>Let me take this opportunity to explain some things that I have discovered the hard way about Miss Addy. Addy is sly : She can trick me into believing that everything is OK in my life even if, in reality, things are falling apart. Addy is hypnotic : She will call my name and I WILL answer her call even if I don't want to, because she is so enchanting. Addy is possessive : She will only accept first place in my life and nothing can come before her. Addy is clingy : If I ever decide I want out of my relationship with her, she will fuck my world up. Addy is beautiful but costly : The more I indulge in her, the more I HAVE to be with her just to function. Addy is powerful : She has become the impetus behind my every action. </p><p>She has created a burning desire for herself in my body and mind. Addy promised me the moon but then turned right around and stole it from the sky. This is real. The shit has ruined my life. I am not some loser kid that got sprung on my ADD medicine because I  had nothing better to do than to sit around dropping pills or bumping lines. I graduated Valedictorian of my class. I had a lot of friends. I was awarded a $24,000 scholarship to college. But that was then........</p><p>Now:</p><p>It's 8:51 on a Sunday morning and I have watched the sun come up again for the third day in a row. I haven't eaten substantial food in 4 days and I haven't slept at all in 3 days. I jump everytime I hear the slightest sound. I am chewing gum and my jaws are moving as fast as my brain. I have some serious muscle stiffness as well as the dreaded speed headache (the one I get when my brain is trying to slow the fuck down after 4 or 5 days of racing). I have eaten/snorted 250 mgs of Addy in the past 3 days. My heart is beating really hard and fast. I see lights flashing but it is completely dark in this room except for the computer monitor. Two years ago this type of come-down would've scared me to death, but I know this feeling so well that I don't even really notice it anymore. Addy is calling me...................I have to do more so that I won't crash............. Here we go again...........</p>"
}
