{
 "title": "Flashes of Imagery",
 "author": "shadow",
 "citation": "   Shadow. \"Flashes of Imagery: experience with Diphenhydramine HCl (ID 11409)\". Erowid.org. Feb 10, 2003. erowid.org/exp/11409",
 "substance": "Diphenhydramine HCl",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11409",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2003",
   "Views: 29398",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA few times in my past, I've taken Dramamine (Dimenhydrinate) in large quantities to experience delirium. Dimenhydrinate is similar to Diphenhydramine, only with extra atoms attached that are not responsible for the hallucinations.\r\nI had spent the day pondering when my next drug experience was going to be. After having a conversation with a friend from California (D), I raided our medicine cabinet and found a bottle of 100 25mg Diphenhydramine HCl tablets. I was extremely excited, so I came back to my room and hid the bottle.\r\nI began to make preparations. I put some Starbucks ground coffee into a Diet Coke and drank it - the amount of coffee should be around 3 cups. \r\nThen, I went to work on setting up an environment that would help with the Diphenhydramine. I drew dots on a piece of white paper, drew squiggly lines on a paper book I use as my mousepad, and found a short broken pencil that would hopefully become a cigarette.\r\nAfter that part was done, I got out my lava lamp and after replacing its bulb turned it on. I then replaced the bulb in the lamp next to my bed with a black light bulb. I put saran-wrap over my mirror in my bathroom to blur the image somewhat.\r\nAnd finally, to help convince me not to sleep, I covered my bed with books and other highly uncomfortable objects that I would have to move before I fell asleep.\r\nThe stage was set. At 11:00 PM CST, I consumed all 24 pills in the course of 45 seconds. I then rushed off to get a glass of water which I drank over the course of the next few minutes.\r\nTo get my blood flowing, I stood up in the darkness of my room and moved around quite a bit. At 11:45 I began to notice the effects. I had minor visual disturbances and minor audible ones as well.\r\nI was *extremely* tired - fighting this sensation was becoming a losing battle. I noticed on my floor that a pile of jeans next to a t-shirt appeared to be a statue of some sort. My coordination was shot as well.\r\nAfter another hour, the fatigue was getting to me and I was also becoming nauseous. I threw up and got into bed.\r\nThe next day, I woke up at around 1:00 PM. I walked around and noticed that I still felt intoxicated. Throughout the day, very minor events would startle me heavily. For example, while walking through the house I saw my dad. Just seeing him made my muscles all seem to jump a bit.\r\nLater that night, I was asked to drop my sister's friend off after picking them both up from the mall. The night was dark, and for some reason, Diphenhydramine still seemed to be affecting me. I watched as a small child walked down the darkened street, only to disappear. I finally figured out it was a mailbox that I was seeing. Other hallucinations of this sort continued to affect me for the remainder of the night.\r\nI have been changing my mind in regards to whether or not I want another Diphenhydramine experience. However, I have come to the conclusion that I do want to have the experience again. Hopefully I'll be able to stay awake for longer periods of time the next time I chose to take Diphenhydramine.\n\n\n"
}
