{
 "title": "Freebasing and Chronic Usage",
 "author": "Tribalone-psychonaut",
 "citation": " Tribalone-psychonaut. \"Freebasing and Chronic Usage: experience with 5-MeO-DMT (ID 11405)\". Erowid.org. Sep 15, 2002. erowid.org/exp/11405",
 "substance": "5-MeO-DMT",
 "bodyweight": "180 lb",
 "header": [],
 "footer": [
  [
   "2001",
   "11405",
   "Male",
   "",
   "Not Given",
   "Sep 15, 2002",
   "14689",
   " "
  ]
 ],
 "report": "<p>I recently started purchasing large quantitys of 5-MeO-DMT, for reasons that do not matter. During the period of about a month I have done close to a gram of 5-MeO-DMT. I have always felt the effects to be preferable to that of tripping on acid or mushrooms because of the quick comedown. I now have reason to believe that the effects of 5-MeO-DMT last much much longer than 20 minutes. Also that it may be physically addictive. Over the course of my drug experimentation I have done at least a book of acid total and at least a pound of mushrooms. I have also done heroin, morphine, glass(crystal meth of a high quality), valium, xanax, benzodiazopam, lorazipam, nitrous oxide (a tank of medical grade), painkillers of various sorts, cocaine, phenegrine mixed with alchohol, amt, mdma, pcp, mda, marijuana, regular N,N-DMT, blood(a different bloodtype from my own), bearberry(tea and smoked), crack and a number of other drugs. My point is I have a fair amount of experience. </p><p>    The first time I smoked 5-MeO-DMT it was out of a vaporizer, I did 15mg and the effects were strong but lacking. I was not overwhelmed nor did I feel anything profound. I soon decided that this method was weak and wastefull. Obviously methods of smoking developed for cannabis were not going to be sufficient. I attempted to snort about 5mg and this was a painfull and fruitless process, yielding weaker effects than the vaporizer. The next step in my eyes was the way people smoke glass or crack in a light bulb and in foilies, freebase. I decided to skip the foil and go straight to lightbulb freebase as I had done this with glass before and knew how strong it would be. the first time I used this method I loaded 10mg into a bulb and got one hit into it before I dropped the bulb onto the carpet because the effects where so intense. It kicked in in about 1 or 2 seconds after I blew the 'smoke' (you don't generally blow out much smoke because it is absorbed) out... I have never tripped that hard before.  It was similar to the effects of about 35 hits of very pure acid, compressed into about 30 min. I snapped out of it after about 15 minutes and did more. the end result of this was about 3 hours of 5-MeO-DMTtripping. this is where we coined the name liquid tension experiment (in reference to 5-MeO-DMT) because your brain is almost overflowing and you can feel it pushing. I have since done dosages of up to 50mg, that being extremely intense. I seem to have developed a small tolerance but I think this is because my brain is getting used to the alternate reality of 5-MeO-DMT. I have spent entire days engulfed in the effects of freebase dmt. Recently I cut down. I realized that I had an almost irrational urge to do 5-MeO-DMT. I do not have an addictive personality. I have handled extremely addictive drugs like coke, crack, and heroin fine. I am still extremely unsure as to the nature of 5-MeO-DMT. In non scientific terms I think it may diminish the wall between the dream world and the waking world, creating an intense lucid dreaming state. I will update when I find more. Freebasing this drug makes it 10 times as powerfull, be wary, be careful and always be learning.</p>"
}
