{
 "title": "A Pleasant Blend",
 "author": "Oakland",
 "citation": "   Oakland. \"A Pleasant Blend: experience with Paroxetine & Cannabis (ID 11453)\". Erowid.org. Mar 15, 2006. erowid.org/exp/11453",
 "substance": "Paroxetine & Cannabis",
 "bodyweight": "112 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11453",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 15, 2006",
   "Views: 10339",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am 30 years old. I use marijuana occassionally, anywhere from once every other month to twice a week depending on how busy I am and whether I am obsessing about my weight or not. (Pot always makes me eat.) This entry covers several experiences, which are dated. BTW, when I say 'bong hits' I mean tiny tokes. I do not use cigarrettes and cannot tolerate inhaling much smoke.\r\nPaxil is a SSRI:  My previous experience with an SSRI was Prozac, which takes about two weeks to take effect. I noticed an effect three days after starting Paxil. \r\n11/30/01 I had started paxil at 10mg 16 days prior. I was at home and it was night. I took a couple of smallish hits early in the evening. As soon as I was high, I noticed that the effect of marijuana was much more intense than usual. The effect was as if I had done about twice as many bong hits as I actually had. It was a very pleasant high. I did not experience the anxiety or paranoia that I usually experience when stoned. I became very sociable and energetic. I took two vicodin which made me feel even better. I thoroughly cleaned our bedroom and bathroom and reorganized everything in my cabinets, which is very unusual for me (cleaning is typically very low on my list of priorities). My partner got tired and fell asleep. I wanted to go out, but decided it was unwise to do so in my current state (and anyways I was stranded in the middle of the suburbs) so I hung out on the internet for a few hours. After a while I 'came down' and went to bed.\r\n12/9 Did maybe 3-4 bong hits at a brunch I was attending. I was still at the 10mg daily dosage. This got me very stoned. Again much more so than I normally would from that dosage. I think I did the hits at noonish and only started to come down around five or six o'clock in the evening. (I did not smoke any more during this time.) My partner, who had done the same amount of pot (maybe a little more) at the same time was high for about half as long. Again it was a very pleasant high, I felt happy and sociable. I was very interested in the people around me on the street and in the shops (we were in San Francisco): where they came from, what their lives were like. Everybody was my friend. Coming down was uneventful, I was fully awake this time and just gradually returned to normal.\r\n12/23? I don't remember the exact dates. It started after finals, so it was definitely at least the evening of 12/19. Most likely this happened over the weekend. Since I have never been very good at recalling exactly when a past event occurred and since I now no longer work or go to school there's not much to distinguish one day from another. Anyhow, one evening started out drinking wine, eating pizza, and smoking pot with our roommate. By this time, I had been up to 20 mg daily dosage of Paxil for at least a week, and then had dropped back down to 10mg because my sex drive had disappeared at 20mg. I got very high and enjoyed it very much. The next day, I got stoned in the morning and basically stayed high all day. This didn't take much, since I am now extremely sensitive to the effects of marijuana and only needed one toke every few hours or so to remain in the stratosphere. My last hit, if I remember correctly, was at about four o'clock in the afternoon on sunday 12/22.\r\nI woke up the next day (12/23) *and I was still high*! I was rather alarmed because smoking pot generally goes away pretty fast. I was basically normal, but definitely off baseline. I was able to drive, which I did, running errands and purchasing christmas presents. I was in a good mood, I still had that 'everybody is my friend' attitude and interest in other people. The next day was the same, only less so. Again, I was not exactly high, but there was a lingering feeling of being not quite entirely back to normal. Two days later (12/26) I am still a little 'off' but back to normal in such a way that I am restless and the world looks a little 'flat' the way it does when I have a major depressive episode. I am still in a pretty good mood.\r\nIn the future I will be much more cautious, in light of my increased sensitivity.\r\nOverall, I would describe the combination of paxil and pot as a good experience. It is extremely pleasant and seems to have no ill effects on me.\n\n\n"
}
