{
 "title": "Bhang Death",
 "author": "Dan",
 "citation": "   Dan. \"Bhang Death: experience with Cannabis (ID 11465)\". Erowid.org. Dec 27, 2001. erowid.org/exp/11465",
 "substance": "Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 glass",
   "oral",
   "Cannabis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11465",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 27, 2001",
   "Views: 14666",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nJust a note on eating cannabis. I was in Benares, India, back in 1998. Benares the City of Death (it really is). Anyway. I drank a hearty glass of thick marijuana milk shake with a flamboyant Australian friend sometime in the evening. A little later the effects came on, and I found myself transported from a restaurant, where I should have been calmly eating my dindins to a dark nether world of panic and delusions of apocalypse. The usual effects of increased heart beat and paranoia that one experiences having taken on too much THC were the least of my troubles. The world spun, I could not focus, and I felt sick to my stomach. I could not breath, but not from my usual response to overindulgence (panic), but because my body was sucked so completely of energy that the muscles in my chest were not strong enough to lift my ribs and arms from my chest.<br>Making my way home, having parted from my companion who was happy and having a whale of a time making friends with the fry chef, I came as close to crawling as one can without actually touching the floor with one's hands. I had to walk, doubled up with exhaustion, using the narrow alley walls as crutches.<br>When I got back to my room, experiencing and having experienced horrors that are too dreary to list here, I lay down, waiting for the storm to pass, which did not happen for many hours. I was even unable to resort to my standard last ditch method of reclaiming normality after taking too much, masturbation, so locked out was I from my body.<br>Anyway, in light of this anecdote I would like to offer a few tips that have helped me, specifically concerning overindulgence in cannabis: <br>#1. Remember that eating marijuana can lead to a really foul experience. Eating can be good, but less is always more when doing so. You can never lose buy eating too little, and, conversely, once you realize you have eaten too much, it is too late.<br>#2.When too stoned, focus on something that will really keep your attention. Best of all is a friend. Do not be afraid to tell them that you feel shitty, it really helps. This also usually sparks up an involved dialogue which makes you forget how terribly panicked you were.  <br>#3.When too stoned, the ancient remedy of the Hindu holy men is sugar melted in butter. It works pretty good.<br>#4. I do not recommend, as have others on this site, the concentration on one's breathing if it is your breathing that is bothering you. I, personally, am never satisfied with the state of my breathing when stoned to any degree. I find that ignoring what you think is wrong with you is the best way to get rid of such feelings, especially in light of the fact that those feelings are never real.<br>#5. As noted before, and with the hope of not sounding vulgar, having a wank, along with the old favourites of brushing the teeth or taking a shower, usually works too. <br>I hope those who read this find it helpful if they are ever caught out.<br>Thanks\n\n\n"
}
