{
 "title": "Looking Back at Salviaspace",
 "author": "Galaxy",
 "citation": "   Galaxy. \"Looking Back at Salviaspace: experience with Salvia divinorum (ID 11474)\". Erowid.org. Apr 30, 2007. erowid.org/exp/11474",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "  ",
   "sublingual",
   "Salvia divinorum",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11474",
   "Male",
   " ",
   "Not Given",
   "Apr 30, 2007",
   "2609",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>November 1999 Oxacan 1.5g</p><p>The room responds slowly to the uniquely flavoured smoke. Sliding panels of my visual field slowly crawl upwards. The tapestry on the ceiling tries to crawl out of my sight. Violet/Purple waves of reality wafted across the ceiling just before I closed my eyes. Needles of icy warmth pricked at my being. It was strange yet soothing. They gripped and curled the inner walls of consciousness until it expanded spiraling inward to an infinite egg of suchness. Ephemeral visions danced and traced across the timeless void. Self dissolved into experience. It took 15 minutes for a gradual return to concentual space-time; I awake from the dreamtime slowly lifting off the layers for a pleasant return to baseline.</p><p>June 2000 Hawaiian 2.0 g & 5x booster .25g</p><p>A planer shift to a highly textured version of the living room has just occurred. Angles and definition soften to an interconnected veil. Warmth mixed with a heavy feeling surged across my body, but my thoughts are clear. I watch J as he takes his turn. As I do he changes. His aura glows and grows. I see his features change; a long beard grows and shrinks, His clothing morphs as he turns from young to old, male to female, Asian to African Indian to Caucasian a thousand and one different forms of human, resting finally on an inverted black and white shimmering being wearing a long robe with a long beard & sandals. As suddenly as it came on the vision fades away returning J to his normal state of visual being. </p><p>It was not as if the vision was a hallucination laid on top of him, it seemed to be a peek at who he was/is in a way that I've never seen. I was seeing a previously inaccessible side of his multidimensionality. 30 minutes later the experience ends.</p><p>July 2000 5x .5g</p><p>Internal head-space is twisted and curled in on itself. But not beyond the edges of  the here and now. The reality gnomes tease at an experience just beyond the veil of the real world. Singsong laughter and speech fills my head:</p><p> 'Were not letting you thru this timeAh Ah AhHee Hee HeeOum-ba wec ta-see ta-see du-jza suu ney; du-jza suu ney'</p><p>After 5 minutes of this teasing baseline returns.</p><p>September 2001 Liquid 3.5 droppers full w/ 6x .25g on Oxacan 1.0g booster</p><p>Sage is burned to clear the space. Prayers and silent meditations are made by all 3 of us.</p><p>First half of the solution is held for 7 minutes. My mouth is burning! Unnatural burning turns to a pushing of an iron bar growing under my oral mucosa.  This starts to fade as the second solution is held. This burns even more. The second shot is swallowed as I move towards the bed to lay down. Familiar twisting starts slowly, much smoother than the bridge of smoke. 12 minutes after I held the first shot I take the water pipe in hand. The chamber is cleared in 4 lungfulls.</p><p>I look up to the candle lit room to see a well-defined texture has taken over. I meditate on the Celtic knot that is alive on the tapestry before me. After some time I lie down and move inward to explore the space salvia has opened. The liquid provides a smoother access to the depths of this experience; it comes on slower but allows for more space to explore. The booster smoke invoked the power of the sage and increased the visual texture. Feeling warm and safe reality has been smudged into place. I am besaged. 40 minutes later I open my eyes smyling. Effects linger for another hour before baseline return.</p>"
}
