{
 "title": "Walking in a Dream",
 "author": "ghostface",
 "citation": "   ghostface. \"Walking in a Dream: experience with Zolpidem & Hydromorphone (ID 11499)\". Erowid.org. Apr 12, 2007. erowid.org/exp/11499",
 "substance": "Zolpidem & Hydromorphone",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 1:30",
   "2.0 mg",
   "insufflated",
   "Hydromorphone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11499",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 12, 2007",
   "Views: 12775",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have an unusual liking for pharmaceuticals of any kind and for the past year im experimented with the sleeping drug, Ambien. I found Ambien perfect for what it's meant for, sleeping. But over a period of time I have noticed its potential recreationally. There are many experiences I've had but I will focus on the most recent one which would be last night, December 27, 2001. I'm on winter break which is particularly boring around here so instead of going all out like I would usually do when there is no school I decided to take it easy with some Ambien.</p><p>At around 6pm I picked up 3 Ambiens with my friend P. We then took 1 each and headed back to his house. I noticed my usual double vision when smoking my cigarette and the nice calming body high. I think the effects mimic normal sleep patterns the only difference is your awake. I get horrible dry mouth and hard breathing, but the dreamy, calm effects outweigh that. At around 730pm we each sniffed about 2mg Hydromorphone to boost the effects as they were dying down.</p><p>I felt the opiate warming and it mingled with the ambien to the point where closing my eyes and lieing in a curled position felt amazing. Next thing I know I wake up its 9pm, the effects seemed to be nothing more than my body wanting to go to bed. I was drained. At 10pm I took another Ambien. After this point I only remember some things. Everything was a daze. Nothing looked real, it was just me dreaming only I was awake. I spent the night drifting in and out of sleep but I couldn't tell whether I was sleeping or awake because I felt the same either way. Overall, Ambien is nice to consume only if your not planning on doing anything because that's exacly what you'll be doing.</p>"
}
