{
 "title": "A Match Made in Heaven",
 "author": "5L-Jubeii",
 "citation": "   5L-Jubeii. \"A Match Made in Heaven: experience with AMT & MDMA (Ecstasy) (ID 11494)\". Erowid.org. Jan 15, 2008. erowid.org/exp/11494",
 "substance": "AMT & MDMA (Ecstasy)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7.0 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   "  T+ 2:00",
   "0.5 tablets",
   "insufflated",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11494",
   "Male",
   " ",
   "Not Given",
   "Jan 15, 2008",
   "Views: 4189",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was not prepared for a 48-hour weekend.  It was only supposed to be a Friday-night get-together.  I only went because ther was supposed to be some high-grade bud there, but it only ended up being really harsh gel-tabs.  I dind't want to stay because I didn't like the acid.  I had taken some the weekend before, and decided that it was far too strong for me.  I was going to leave when the owner approached me with some great new and legal substance.  He sold me on the idea and we went over to his dealer's place.  </p><p>I wasn't too sure about it.  After a lil' bit of bickering they decided that I should have as much as I wanted for free that night; they called it my moving-away gift as I would leave the following Thursday.  I only asked for one dose as I am very careful of what chemicals I put in my body.  Especially new ones.</p><p>We got back to the party and it was going strong.  After 2 hours I was getting pretty pissed because nothing was happening.  So i split a roll with a friend and we went and snorted it.  The roll came pretty quick and it seemed like it would be the kind where you just want to sit and chill.  I wasn't expecting it to last too long and it started to die about 2 hour later (4 hours after AMT dose).  I was getting thirsty and I decided to get something to drink.</p><p>I don't think I ever made it to a full standing position.  As soon as my rear left the usually hard and uncomfortabel surface of the couch, I felt my senses being sucked into the back of my head.  I thought I was going to black-out; but as soon as I hit the sofa, I felt like I was in Utopia.  The couch and I just clicked.  I was in love with it.  I didn't want to move, and I achieved this for about an hour.</p><p>Then I became very jumpy.  I went and busted into every conversation I could find.  I even had an intelligent conversation with the dog.  At this point I was on a very peaceful roll.  I was very calm of thought, but I wanted to be absolutely everywhere at once and with everyone.  My vision was out the door.  It was beyond that.  I couldn't focus on anything.  Everything was moving, breathing, thinking.  My senses were maxed out, and I didnt miss a thing.  I heard and saw every detail of the back room while I wasn't even ther.  But I didn't comprehend a thing.</p><p>About 10 hours after I dosed AMT I started to come down from my roll.  I wanted to lay down.  I found the floor, the closest thing.  I laid there in front of the TV watching Fraggle Rock.  I didn't comprehend or make sense of it at all.  It scared me.  I started going into these pleasurable little convulsions which turned out to be shivers.  For the first time that night, and day, I noticed how sweaty and clammy I was.  I got a blanket and felt myself melt into the couch.</p><p>Most of the people were going now or crashing where they were.  A few of us decided to watch Anime Videos.  I recommend to everyone that Anime be a big part of your AMT experience.  It was great.  We watched TV until nightfall.  I felt as if I knew each character personally.  I remained like this until the next morning, Sunday.  It was 36 hours after I dosed AMT.</p><p>I was up and running until about 5 P.M. that day.  I got tired really quick and had a friend take me home.  I went and crashed.  Hard.  I was out for 16 hours; just in time for work.  It was an easy day and all I could think of was finding this new and wonderful substance at the place I was moving to.  </p><p>I definately enjoyed this experince.</p>"
}
