{
 "title": "Such a False Assumption!",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Such a False Assumption!: experience with MDMA (Ecstasy) (ID 11498)\". Erowid.org. Oct 4, 2006. erowid.org/exp/11498",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11498",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 4, 2006",
   "Views: 7389",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI started taking Ecstasy just before my 18th birthday. I was a faithful regular weekend user for just over a year. On average I consumed between 1-2 pills, 1-2 nights a week. The first couple of months were magical and I chased for those same experiences thereafter, but I noticed that the high wasn't as intense and my comedowns were getting drastically more depressing, as was every day life. It got the point where I'd be taking pills and they weren't doing anything for me, apart from making me feel sick and giving my panic attacks. <br>The final straw came when I went out one night and left before the club had ended because I was feeling sick and dizzy. I got home and dry heaved for an hr. That has never ever happened to me before on E and I believe that was my eye opener because I quit and never touched E again, not for a year and a half. The longer I went without it, the more scared I was of trying it again. I didn't want to fall back into the vicious cirle of false pretence and happiness. I didn't want to get sick. I didn't want to be depressed. I didn't want to risk losing my job, my life. <br>It wasn't until I moved across country and started a new life and made new friends that I slowly got introduced back into the 'scene'. I love trance music, and love to go clubbing but stayed away from both because I associated these things with E. But, one night my new boyfriend suggested that we go to this club because a world wide DJ was playing and all of his friends were going. That was all I needed to hear. I went to the club and it was that night that I rolled for the first time in almost a year and a half. The experience was overwhelming. It almost matched the first time I ever tried it but not quite, becuase I knew what to expect ;) Still, it was a phenominal experience and reminded me why I was *addicted* to the shit back when I was younger. <br>The next day my comedown was actually enjoyable. SUCH FALSE PRETENCE! It only made me want to do it more again! I thought that by doing it in moderation, apposed to every weekend the way I used to do it would be OK. Again, SUCH A FALSE ASSUMPTION! Once every month turned into once every two weeks, which turned into every weekend. I was back where I started. The ONLY thing that helped me get out of that cycle was my former experience/addiction with E. I tried to remind myself over and over again about how bad I used to feel and how much it fucked up my life and how depressed I got etc etc etc. So I started lowering my doses to once every other weekend. This has been going on for the past year. Just recently I managed to go a month without taking it, but E was all I thought about. I'm still battling with my addiction. It's only been two weeks since I popped my last pill. <br>For some *moderation* might work and I'm jealous if it does!!! but I have an addictive personality and it's people like me who take and enjoy E that will probably battle it for life. I still associate clubs with E and I find it extremely hard not to take it when I'm surrounded by temptation (others who are doing it, and the music combined), so I've found myself having to remove myself from the scene, which saddens me very much. <br>My year and a half of *sobriety* proved to be an enlightening one. I rediscovered myself and found that I accomplished so much more. I moved across seas(a dream I've had since childhood), started going back to school, signed up for the gym and went faithfully 5-6 times a week. Since I started taking again, I lost interest in school, lost motivation to go to the gym, and feel like I COULD lose focus of my life, BUT, I'm not going to let myself do that - hence the reason I am going to go to counseling for my addictive personality.\n\n\n"
}
