{
 "title": "Ignorance is Dangerous",
 "author": "Martian",
 "citation": "   Martian. \"Ignorance is Dangerous: experience with Mushrooms (ID 11520)\". Erowid.org. Oct 28, 2004. erowid.org/exp/11520",
 "substance": "Mushrooms",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "4.5 capsls",
   "oral",
   "Mushrooms",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11520",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 28, 2004",
   "Views: 5602",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I spontaneously decided to take Mushrooms for the first time one week ago today. From this, I have learnt that these substances are not to be treated lightly, and, most importantly, ignorance is the most dangerous thing of all. </p><p>I ingested 3 gel caps of crushed Mushrooms initially, and then 1 and a half more a few hours later. I felt I was at a good stage of my life, feeling positive about myself and looking forward to a holiday to New Zealand in a few weeks. The trip was quite pleasant. I was very happy and content, almost euphoric at times. I have been taking ecstasy for about a year now, and it almost reminded of some of the more enjoyable pills I have been on. There weren't many visuals, just a few psychedelic patterns in the grass and sky. Occassionally, my friend's face would display flourescent oranges and greens, and my colour perception was definitely heightened. Physiologically, my palms were sweating, I had no concept of temperature and my pain sensors were dulled. The trip started at my friend's house, but being such a beautiful day, we decided to spend the rest of it in the park, with the last stages concluding at another mate's BBQ where my two 'tripping partners' decided to leave me, and I was left there on my own. This was manageable and enjoyable for the most part.</p><p>I learnt quite a bit about myself and my attitudes towards various issues (including drug use). I found it interesting to sit back at the BBQ and observe human social interaction, analysing people's moods, body language and reactions to various situations (especially when I decided to put on some hard psy-trance!!). My perception of these reactions and ability to read it was heightened and I found myself witnessing things that I would not have generally picked up on otherwise.</p><p>As good as this sounds, this past week has not been pleasant. I have had moments where I feel detached from myself, intense anxiety attacks, sweaty palms, some visual distortions and I have not been sleeping very well. These symptoms seem to be gradually easing over time, I am just praying that they are all gone before I leave for New Zealand.</p>"
}
