{
 "title": "'Social Anxiety' and the Pink Pill Experiment",
 "author": "Veronica",
 "citation": "   Veronica. \"'Social Anxiety' and the Pink Pill Experiment: experience with Paroxetine (ID 11522)\". Erowid.org. Oct 7, 2004. erowid.org/exp/11522",
 "substance": "Paroxetine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Paroxetine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11522",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2004",
   "Views: 18319",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started taking Paxil after being clinically diagnosed with Social Anxiety Disorder and panic attacks. Now, I have always been willing to try anything once, so I followed my doctors advice.  </p><p>It took about 1 week for me to notice the effects of the drug. I started on 10 mg a day and increased to 20 mg in two weeks.  After 2 weeks I was able to function in society without panicking and wanting to die. It was instant confidence for me which before I had only been able to reach through alcohol or E.  Friends and family think it is a miracle. A few friends often get irratated and jealous of my new-found happiness and upbeat nature. </p><p>         After a visit to a new doctor today, he mentioned </p><p>                    a few intersting things. </p><p>1. That I will need to be on Paxil for the rest of my life or until    medical science develops something other than a pink pill.</p><p>2. That research shows Paxil is re-constructing DNA in certain areas of the brain.... ??? This is quite interesting</p><p>3. I do not have medical and it is getiing expensive.... really!?!</p><p>              A few side effects I have noticed... </p><p>                 some are fun... some are not.</p><p>1. Balance - like I am walking on a rocky boat from time to time.</p><p>2. Very vivid and complex dreams</p><p>3. I am like a non-sexual being. No feeling, no interest, no nothin'</p><p>4. Enhanced self image, and extreme self confidence</p><p>5. Smoking a lot more, Grinding teeth quite often, jaw clenching.</p><p>6. Loss of emotion, yet extremely happy and confident @ the same time</p><p>7. Have always been blessed by the gift of telepathy, it is now       slowly withering away. Can no longer read minds, and this saddens me.</p><p>I am still taking Paxil and will continue for fear of falling back into my old self. I am now vey scared for what will happen if I stop taking the drug. So in fact, medical science has now trapped me financially and emotionally. I am now dependent on a little pink pill... until there is a new teal, turquoise or fuschia pill.</p>"
}
