{
 "title": "Beautiful Hallucinations",
 "author": "teenagepsychonaut",
 "citation": "   teenagepsychonaut. \"Beautiful Hallucinations: experience with Kava & Cannabis (ID 11539)\". Erowid.org. Oct 28, 2004. erowid.org/exp/11539",
 "substance": "Kava & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Kava",
   "(capsule)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11539",
   "Male",
   " ",
   "Not Given",
   "Oct 28, 2004",
   "11683",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had a wake and bake day and was tired but still too stoned to sleep. A few days before I had bought, a bottle of Fingerprinted, Kava Kava root powder capsules. I have ingested Kava several times over a period of a year. So I was in my room with only the black light on with a Stranglers CD playing, stoned. I poured six 500 mg.  tablets into my hand a swallowed them down with Nikken pimag water (magnetic filtered water). I chilled in my room for about an hour listening to music. </p><p>After about 30 minutes I decided to smoke a bowl out of my small tin foil pipe. So I smoked the bowl and layed back and shut my eyes in a sleepy/dreamy state. I noticed my heart was beating fast but that always happens when I get stoned. I lay there for probably an hour completely stoned and seeing magnificent closed eye hallucinations. Like colorful,  psychedelic, gasoline swirl, patterns. The beautiful hallucinations were so strong that when I opened my eyes and looked into the darkness I could see them perfectly. It was like when I took some acid that was almost completely visuals, and I could control them! Keep in mind that I have a very low tolerance for marijuana. I find marijuana and Kava Kava (especially if I take alot) are a good psychadelic mixture. I can see why Kava Kava has been labeled as a hallucinogen by some people!</p>"
}
