{
 "title": "Oil and Methanol Extractions",
 "author": "THE WATCHER",
 "citation": "Citation:   THE WATCHER. \"Oil and Methanol Extractions: experience with Datura (extract) (ID 11563)\". Erowid.org. Jan 27, 2004. erowid.org/exp/11563",
 "substance": "Datura (extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  seeds",
   "transdermal",
   "Datura",
   "(extract)",
   " ",
   "  seeds",
   "oral",
   "Datura",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11563",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 27, 2004",
   "Views: 30973",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe fallowing is an entry from the watchers fabled lab note book:\r\nDO NOT DO THESE PROCESSES THIS CAN BE HAZARDOUS TO YOUR HEALTH DUE TO THE\r\nTYPE OF ALKALOIDS INVOLVED!!!!\r\nEXTRACTION OF DANTRA ALKALOIDS via an oil solvent. (from JIMSONWEED)\r\nSTEP #1\r\nGround seeds into a fine pulp, used 1500 mg seed. (Approx. 200 seeds.)\r\nSTEP #2\r\nPlaced 1500 mg seed pulp into test tube.\r\nSTEP #3\r\nPoured enough olive oil into tube to make the entire contents of test tube = 7 ml (this includes seed pulp and olive oil.)\r\nSTEP #4\r\nShook contents of test tube.\r\nSTEP #5\r\nLet sit for 2 days.\r\nNote: after shaking the mixture for just a few seconds the oil became\r\ncloudy and after shaking 3 more times and letting sit for 20 min. the oil\r\ndarkened considerably.\r\nNotes on the next day-day1\r\nAfter the extract sits over night the seed pulp settles to the bottom of the oil, the oil will look clear, but there seems to be another oil layer\r\nsettled on top of the seed pulp which is dark brown in color, it is possible that this layer of liquid could be the water content of the seeds or it could be an oil contained in the seeds with a density greater than the olive oil used for this extraction, when shaken these two liquids mix and will color the olive oil a darkish brown color.\r\nNotes on day 2:\r\nThe olive oil had a darkish color to it, the lower liquid layer was not as\r\nevident as it was the day before but was still there.\r\nSTEP #6\r\nUsed vacuum filtration to filter the oil from the seed pulp. (you will need\r\nto apply a vacuum or this step will take forever!)\r\nSTEP #7\r\nWashed test tube with 2ml fresh olive oil and vacuum filtered this through the seed pulp.\r\nNote: end product = 6ml\r\nIt was a cloudy yellow color.\r\nUse of this product:\r\nApplied 2ml of oil to any area where there is a high concentration blood\r\nvessel near the surface of the skin. (In the male this could be the penis\r\nand in the female the vagina) noticeable effects began in about 25 min., peaking in approx. 2 hours after application. There was slight\r\ndisorientation, slight visual hallucinations, and slight audio\r\nhallucination. After 9 1/2 hours there is still noticeable effects with some visual effects still noticeable, disorientation has cleared up but a\r\nnoticeable detachment to reality is still event, during this time there was\r\na noticeable dryness of the mouth but not really uncomfortable.\r\nDay after application.\r\nThere were some slight effects the fallowing day for approx. 6 hours then\r\nsubsided.\r\nEXTRACTION OF DANTRA (JIMSON WEED) via. METHYL ALCOHOL.\r\nSTEP #1\r\nGround 2 grams dantra seed in mortar and pestle.\r\nSTEP #2\r\nPlaced seed pulp into test tube.\r\nSTEP #3\r\nUsed pipette to place 6mL methyl alcohol into test tube with seed pulp. (the entire contents of the test tube should be 9mL this includes alcohol and seed pulp.)\r\nSTEP #4\r\nShook very well.\r\nNote 1: methanol soon turned a clear yellowish color.\r\nNote 2: end of day one there was only a slight darkening of the alcohol.\r\nNote 3: end of day two there was no change in the appearance of the\r\nmethanol.\r\nSTEP #4\r\nFiltered methanol from seed pulp. (gravity filtration will work fine for\r\nthis).\r\nSTEP #5\r\nPoured 2 mL. methanol through seed pulp to wash any remaining alkaloids from the seeds.\r\nNOTE: Upon evaporation of methanol I was left with a golden yellow\r\ncrystalline powder, (be sure to evaporate methanol to complete dryness it is very poisonous). The total product of this extraction is 80 mg.\r\nUSAGE:\r\n10:40 pm Ingested 8mg. Extract orally (taste was slightly bitter but mildly\r\nso).\r\n11:05 pm can feel the onset of alkaloids. (onset of effects are consistent\r\nwith the use of the topical preparation prepared with olive oil).\r\n11:30 pm delirious effects are increasingly noticeable, very slight visual\r\neffects becoming noticeable also slight dryness of mouth with no pupil\r\ndilation present.\r\n1:15 am effect of alkaloid has leveled out with only a slight dry mouth,\r\nslight disorientation, slight visual effects, and pupils slightly dilated\r\nbut reactive.\r\n7:30 am effects only slightly noticeable put still present, vision has\r\nalmost returned to normal.\r\n11:30 am effects have subsided.\r\nDOSAGE CALCULATION (USE AT OWN RISK)\r\n8mg......................mild effects.\r\n10mg....................mild to moderate effects.\r\n12mg....................moderate effects.\r\n14mg....................moderate to heavy effects.\r\n16mg....................heavy to dangerous effects.\r\nBy: THE WATCHER\r\nFROM: the chemistry works\n\n\n"
}