{
 "title": "Tripping in Class is Fun",
 "author": "Encased",
 "citation": "   Encased. \"Tripping in Class is Fun: experience with Morning Glory (ID 11571)\". Erowid.org. Jul 27, 2007. erowid.org/exp/11571",
 "substance": "Morning Glory",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "200 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11571",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2007",
   "Views: 2944",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was midnight and I hadn't started work on my answer to the question for tomorrow's test on public policy. I hadn't slept for a couple of days and I was feeling slightly panicked as I rifled through books looking for some quotes I could use. It was then that I decided to go to my test tripping. What did I have to lose? And besides, it would be interesting.\r\nI had used morning glories several times before. I've never vomited with them, or had anything worse than a slight stomach ache. I was pretty certain that I could keep it together on them. So, after a few hours hours working on the question, I ground up 200 morning glory seeds and, at five AM, I ate them. The worst thing about morning glories is eating them. The texture lodges in your throat and makes you gag. However, I've discovered a good way to get them down. I put the seeds in a shallow bowl, which I filled with orange juice. Take a gulp of the seeds and juice, then add more juice. Keep doing this until the seeds are gone.\r\nThe timing of consumption was intentional. For me, morning glories take around five hours to peak. My test was an hour long and started at 10am. I intended to reach the peak of the trip during the test. The morning glories came on slowly as expected. I left my halls to go to the test a little early - I wanted to buy some cigarettes and perhaps have some breakfast. By now, I was having closed-eye visuals and the world looked subtly different. The walk between the halls and the class is about ten minutes. As I walked, my thoughts raced. I had trouble preventing myself from grinning madly at people. I thought about how I could be paranoid and suddenly, I was convinced that I was convinced that people knew that I was tripping. This made me grin even more. It was as if there was a huge joke and I was the only one who knew the punchline.\r\nI reached the shop and bought my cigarettes. This was the first interaction I'd had with anyone. I believe that I handled myself well and quite normally, although I'm not sure how big my pupils were. I suspect that they were huge (as they usually are on morning glories). I continued to the canteen where I decided that I couldn't stomach any breakfast, but got myself a coffee instead. I sat outside, looking at the static in the sky when Kali, a girl in my class came up to my table. I chatted to her much more ably than usual - normally I'm somewhat asocial and have difficulty conversing with people I don't like. However, today I talked easily. I almost wanted to tell her that I was tripping, but I managed to restrain myself.\r\nThe test itself was fine. Before, I had been concerned about whether I'd actually be able to write, but from the time the test began, to the time it ended I was one conduit of knowledge on the subject. I didn't even need to use the cheat-notes that I'd written on my wrist. The trip peaked, as expected, around half-way through. It was very intense - suddenly, colors flowed over everything, flickering and strobing. I sat back and enjoyed it for a minute or so, and then continued to write.\r\nI believe that I did very well on the test, although I haven't got my result yet.\r\nAfterwards, I met up with my friend Jon and went shopping for Christmas gifts. The shopping center was a very stimulating environment - almost overwhelming. As I came down, things began to make more sense. I was left feeling happy and energised, and not in the least bit tired - almost as if the morning glories had paid back the sleep debt of the last couple of days.\r\nIt might be the case that the morning glories actually enhanced my ability to think whilst taking the test - I certainly couldn't have remembered the dates and names that I did. All in all, another positive MG experience for me.\n\n\n"
}
