{
 "title": "They Don't Go Together",
 "author": "Mark",
 "citation": "   Mark. \"They Don't Go Together: experience with Cannabis & Alcohol (ID 11604)\". Erowid.org. Nov 14, 2004. erowid.org/exp/11604",
 "substance": "Cannabis & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11604",
   "Male",
   " ",
   "Not Given",
   "Nov 14, 2004",
   "8317",
   " "
  ]
 ],
 "report": "<p>I was hanging out at my friend's house, drinking a little, and they were gonna smoke. I had never done any drugs, just drank, and said sure. I had no idea what being high was like. Well, they had a speed bong, and I took one small hit (I had never smoked and was nervous about inhaling smoke). I felt something but not much. Then they put on a movie and went into the kitchen to prepare the sink for a gravity bong. They had this milk jug, a gallon, in the sink. They told me to take the green hit, just put my mouth over it and inhale as long as I could. I sucked on it for a few seconds but then my chest started hurting. I pulled back and tried to breathe. I started coughing like I never had before, and LOTS of smoke was coming up. </p><p>I didnt feel instantly high or anything, probably cause it was my first time. I thought I was gonna throw up, and went in the bathroom. After a few minutes we sat down to the movie, I felt fucking weird. But not high, cause I smoke now and know what it's like. And I had stopped coughing up smoke, which shoulda been a bad sign considering the size of the hit. All of a sudden my left leg started hurting, and I realized my blood was racing fast. I told my friends and they were like 'your leg's not supposed to hurt'. That comment probably was what really fucked everything up. I tried to ignore it, but then my veins all over buzzed. They started burning cause the blood was racing fast, and my heart was about to explode. Then my vision started going black. I knew something was wrong, and ran into the bathroom. I started breathing in and out as fast as I could, and smoke started coming up again. I realized it had got trapped in my lungs somehow (I think), but I was still paranoid. </p><p>I started hearing the STRANGEST music like I'll never hear again, and I heard voices. One kept saying 'a human fluid' over and over, cause I was thinking of blood. It was fucked. We tried to watch another movie but I kept walking around thinking I was dying. They went to bed, and I had to work the next day so I was gonna drive home. Ha. </p><p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it.]  </p><p>I pulled over three times before I realized it wasn't safe, so I pulled into a gas station and talked to the fuckin clerk till two a.m. Then I went home. It was one of the worst experiences ever, even worse than my first hangover (at least I knew I wasnt dying then). But I till smoke, just not much. And be careful about drinking alcohol and smoking weed, I had the same bad trip experience when I had like 8 shots of rum (3 is my limit usually) and smoked part of a joint. They really dont go together, at least not for me.</p>"
}
