{
 "title": "Newyear's Candyflip",
 "author": "Dextrose",
 "citation": "   Dextrose. \"Newyear's Candyflip: experience with Vitamin-C, Vitamin-B6, 5-HTP, Alcohol, Ecstasy, LSD & 5-MeO-DiPT (ID 11614)\". Erowid.org. Jul 6, 2004. erowid.org/exp/11614",
 "substance": "Vitamin-C, Vitamin-B6, 5-HTP, Alcohol, Ecstasy, LSD & 5-MeO-DiPT",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 g",
   "oral",
   "Vitamin C",
   "(pill / tablet)",
   " ",
   "60 mg",
   "oral",
   "Vitamin B-6",
   "(pill / tablet)",
   " ",
   "150 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)",
   "  T+ 1:00",
   "8 glasses",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 1:30",
   "  ",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 9:00",
   "0.75 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 9:45",
   "10 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)",
   " ",
   "150 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)",
   "  T+ 12:00",
   "150 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11614",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 6, 2004",
   "Views: 12190",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n[21:00]\r\nIngests 2 pills Vitamin-C (500 mg. in each, selfdosing over 12 hours), 2 pills Vitamin-B6 (30 mg. in each) and 150 mg. 5-HTP.\r\n[22:00]\r\nArrives at some friends, starts drinking booze and beers (there were plenty of alcohol).\r\n[~22:30]\r\nStarts eating of them pills. (3 Diamonds, an EZ-test first turned orange, then pitch black - definitly MDMA, and probably also amphetamine).\r\n[~23:30]\r\nParty's on, everybody is totally drunk, loud and most of us are drugged too.\r\n[somewhere between 2 and 4]\r\nWe take off 8-10 persons to a new-years psytrance party.\r\n[~45 mins. after]\r\nArrives at the party, i don't remember details but it ruled, and i danced my ass off.\r\n[~5:45]\r\nA girl gives me 2 blotters (Condoms, very good LSD!), after i give her 10 mg. foxy methoxy.\r\n[~6:00]\r\nMy friend doesn't hesitate to eat the one, i eat 3/4 of my blotter, and give the last quarter to a friend. (I had eaten the 3 pills at that time).\r\n[~6:45]\r\nWe can't feel if the acid has kicked in, because we are pretty MDMA-fucked, so we each eat a capsule of 10 mg. foxy methoxy (5-MeO-DiPT) to kick in the acid... It was about that time i ate another 150 mg. 5-HTP.\r\n[~7:00]\r\nI go to take a piss, and notice some minor visual distortions, 30 seconds after while i'm pissing, the visuals are accelerating, and from that point i have the most beautifull visuals i've ever had, definitly from the acid, but with a little of the foxy-visuals mixed in.\r\n[~7:45]\r\nI take off from the party with a couple of friends.\r\n[~8:30-9:30]\r\nWe arrive 3 persons at my place, my MDMA-buzz is still present, but now clearly much more dominated by the hallucinogens.\r\nI eat another 150 mg.'s of 5-HTP.\r\n...we trip, talk, listens to music, and enjoys each others great friendly company.\r\nWe order some food at about 8 pm., i go online to post something on a webboard, IRC's a little, logs off, and watches a movie with my friends.\r\nSleeps at about 11 pm.\r\nAbsolutely the best new years eve i had, a clear +++!\r\nGreat music, good friends, nice set & setting, good drugs...\r\nI've been told that the blotters (Condoms) are 185 mic. each, wich i believe is true. [Erowid note: Nobody really knows]\r\nMDMA & LSD is wonderfull together, and the little fox on top of it, is a great combination - absolutely recommendable!\r\n/Dex\n\n\n"
}
