{
 "title": "Weird Shakes After a Decade of Rolling",
 "author": "LL",
 "citation": "   LL. \"Weird Shakes After a Decade of Rolling: experience with MDMA (Ecstasy) (ID 11613)\". Erowid.org. May 23, 2007. erowid.org/exp/11613",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11613",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 23, 2007",
   "Views: 7362",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>What's up kids!</p><p>I stumbled across this site researching some health issues and think I should share my experience with you.</p><p>I'm 33 years old and have been raving since the early nineties. I'm not going to ramble on in a preachy way about the hazards of drug use but I hope you'll take what I have to say seriously.</p><p>Since about 1991, I've spent countless weekends partying for days at a time, rolling, tripping, tweaking and all sorts of fun stuff. Awesome memories of these days I will keep with me for the rest of my life but I may be paying a price for it now.</p><p>I'd say the peak of my E consumption came between 1998 and the end of 2000 when a friend of mine was selling it. He always had clean, excellent quality pills and we would do it about once a month. (This may not seem like much to some of you but keep in mind I did it between once a week and eight times a year since 1991). We'd usually take between 2 and 3 but there were times when we'd do up to five. During this time I was also fighting depression and was sometimes also taking Zoloft, Wellbutrin and Buspar.</p><p>Last year at work, I started experiencing a weird sort of shaking in the back of my head where it meets my neck. It felt almost like a deep shivering at the base of my brain. It would only last a few seconds but it was enough to scare me to death. I'd also get involuntary twitches in my hands, feet and midsection that didn't seem to make sense. These symtoms would occur most frequently after drinking coffee or during stress but the fact that they were occuring at all freaked me out. I've always had the good fortune of good health and never experienced these things before. Part of the reason I indulged in chemical party favors for so long was because I was in perfect health and didn't think anything bad would ever happen to me.</p><p>I saw a neurologist last year and had a bunch of tests done that came up negative but I still experience the symptoms. My neurologist said that I wasn't the first person who's done lot's of E that has come to see him and that we're only beginning to learn the long term effects it. Again, not trying to preach or discourage anyone from doing it. I'm just trying to warn everyone reading this that bad, permanent brain damage can happen from doing too much of it for too long.</p><p>These symptoms still happen frequently and I cringe when I think of being diagnosed with Parkinson's or something similar by the time I'm in my forties. I'm praying to God that this will eventually go away and never progress into something worse.</p><p>Time goes by fast kids! It seems like last week when I was 23, rolling and dancing my ass off to the most killer DJs in the world - feeling nothing but bliss. Now I'm just starting to get good at my career and make money and I'm constantly in fear of not being able to hold my head up straight in another ten years.</p><p>You're only young once. But be smart and selective when you party.</p><p>LL</p>"
}
