{
 "title": "Uncharted Catalyst",
 "author": "Jammy99",
 "citation": "   Jammy99. \"Uncharted Catalyst: experience with Citalopram (Celexa), DXM, Mushrooms & Cannabis (ID 11624)\". Erowid.org. Sep 20, 2007. erowid.org/exp/11624",
 "substance": "Citalopram (Celexa), DXM, Mushrooms & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   " ",
   "  ",
   " ",
   "Various",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "11624",
   "Male",
   " ",
   "Not Given",
   "Sep 20, 2007",
   "Views: 12383",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Thought it might be interesting to some how Celexa (or maybe antidepressants in general) can affect certain drugs in combination. I have taken low doses before, and have worked my way up to very high doses of dxm, cannabis and mushrooms at separate times, all while on 40mg celexa daily.</p><p>DXM: The highest dose I've hit is 600mg of pure dxm powder. If you're familiar with a regular dose like this, celexa has made dxm trips much more abstract and jumpy. I find myself losing my touch with reality altogether. At 600mg there were times where I would forget where I was and who I was. Like I had to explain to myself my own life. Visuals were cut down a lot, now just a jumple of fuzziness compared to before taking celexa at all. I am convinced that celexa has drastically reduced the excitement and euphoria of a trip, although it is still fun.</p><p>CANNABIS: The most I smoked was 2 medium sized bowls of very nice chronic, and the trip was almost not worth doing. My body was shaking hard and I felt like the back of my head was buzzing or being electrocuted. I have smoked much more weed before celexa and never had this. I was very paranoid, and normally I have trouble keeping thoughts together, but now it was like not controlling my thoughts at all. It reminded me more of a disassociative and I felt totally out of body and mind, so I forced myself to go to sleep. However at smaller doses I still have a good time.</p><p>MUSHROOMS: This is the most drastically affected. Celexa has all but ruined mushroom use for me, and has almost convinced me to stop taking it just because. Normally 3 grams was enough to have open eye visuals, life impacting thoughts and intense euphoria and positive outlook. Now it is almost like getting drunk. I feel funny and kind of stupid, but not enlightened or any of the 'magical' mushroom feelings. I have taken 8 grams at once now and still I might as well have taken 5 or better yet none because the effects are more like alcohol combined with being energetic. What a waste.</p><p>Hope that helps anyone who is deciding about taking an antidepressant but not sure. If you enjoy your usage as it is, don't ever start, cause it changes EVERYTHING. Peace.</p>"
}
