{
 "title": "Focused, Unfocused",
 "author": "Curious",
 "citation": "   Curious. \"Focused, Unfocused: experience with Morning Glory (ID 11638)\". Erowid.org. Jul 27, 2007. erowid.org/exp/11638",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11638",
   "Male",
   " ",
   "Not Given",
   "Jul 27, 2007",
   "3130",
   " "
  ]
 ],
 "report": "<p>Well, this was my second try with Morning Glory seeds. I've tried some other stuff, e, 'shrooms, pot.  Neither time was BAD, but the first time was sorta boring and not really worth the effort.</p><p>First time, I took some seeds then went to a fairly mellow party some friends had.  They are good people and lots of fun, but all I really felt was a mild buzz (like I was buzzed from a bit of alcohol, and my fingers sorta twinged, but that was all).  I assumed it was because I didn't have too many seeds, but now I don't think that was the case.</p><p>Now the second time was FAR better.  I took them while my wife, who really didn't wanna mess with something until we better understood it (effects, etc.-I read the vault from here & stuff, but it's better to have a person to directly tell you) and therefore just had a bit of liquor.  As other people have mentioned, the seeds sorta upset your stomach, so I just wanted to rest for a while.</p><p>When I rested, I started to become aware that, if I had little stimuli-if my eyes were closed and I was sitting still-my mind could focus on something and really pay attention and some funky things would happen.  I know that doesn't make too much sense, but I'll explain it a few times throughout this story, so hopefully it finally will.  This time I will give an example: I was listening to Cake and noticed a progression of the bassline that I'd never noticed before (I think the song was Stickshifts & Safety Belts).  While noticing this, I felt totally fine-no stomach ache.  This was simply because I wasn't focusing on my stomach.</p><p>I slowly started to notice that what was happening was that my mind could focus on something much more intensely than usual.  It wouldn't necessarily be more accurate or better, just more focused.  In this case I noticed the bassline, which is normally somewhat subdued.  Focusing on it, I didn't focus on my stomach, and therefore it was OK.  When I needed to get up again (and therefore feel my own equilibrium again), I felt the mild stomach ache.  But, at least for me, the ache was not really enough to ruin the mood or anything.  In some ways it helped, as it helped force me to sit still, which is key to appreciating the seeds.</p><p>Next, I played some Ozomatli and could totally feel the emotion and setting of the songs.  I could totally sense that some were 'family' songs like at a family picnic sort of setting, while others were 'hanging with friends' sort of songs.  It was really strong and I could imagine it throughout the song.</p><p>I was able to notice other things as well, not just sounds.  Smells were really strong, and would also create images in my mind.  So would tastes (although I must say that nothing really tasted too good) and especially touch.  Sound & touch were the two biggest things that I could focus upon.  Not visions TOO much, I think because it's too difficult to focus on just one thing at a time.  I occasionally saw some stuff, if I'd keep my head staring in the same direction for long enough, but it certainly wasn't as interesting as keeping my eyes closed & focusing on other stuff.</p><p>There were also some general effects that I noticed.  I got chilly when first getting the effects of the seeds.  I think that's b/c our house is cold (bad insulation) and my sense of touch got more sensitive.  Even so, I had a generally cozy & happy feeling.  I remember saying to my wife, who eventually had some seeds herself, that I felt both nauseous and comfortable at the same time.</p><p>I could 'get back to normal' whenever I wanted.  If I got up to go to the bathroom or make some tea, by the time the task was finished I felt as if the effects had worn off.  They hadn't, it was just that since I was 'over-stimulated' and doing more than 1 thing at a time, then I wasn't properly focused & wouldn't notice the drug.  I could rthymically do something and eventually my mind could stop focusing on it.  This led to some cool things I could do.  My wife, after the effects came on for her, felt a similar effect.  If we sat still & kept the # of stimuli low, we could feel the effects more strongly.</p><p>Neither of us had bad or negative images or thoughts.  With all that lying around with our eyes closed, neither of us fell asleep until the effects wore off-which took a while.  I usually fall asleep whenever I'm tired in the least if I'm lying around.</p><p>I told my wife I wanted to try having sex while on it.  We did some raunchy 'pain is pleasure' sort of stuff for a while, but rythmically.  Eventually I would unfocus my attention (since it was something repetitive and rythmic).  I still felt the pleasure, but would not orgasm.  It was pretty cool.  I thought maybe it gave a sexual inhibition, like 'e', so I focused again.  Then I did orgasm.  So it wasn't that, it seemed to simply be that I could unfocus and therefore feel the pleasure without coming.</p><p>Generally, I really liked the experience.  It's very mellow, but certainly worth while.  By NO means is it a party drug.  It's best in small company.</p>"
}
