{
 "title": "The Coolest Experience I Have Had",
 "author": "Neogreg",
 "citation": "   Neogreg. \"The Coolest Experience I Have Had: experience with Salvia divinorum (5x extract) (ID 11646)\". Erowid.org. Nov 16, 2004. erowid.org/exp/11646",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11646",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 16, 2004",
   "Views: 5943",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me first start off by saying that I am not a hardcore drug user. I have smoked plenty of pot, which I love but is hard to get where I live, and I've had plenty of alcohol, which I really dont like, but nothing had prepared me for the trip I was about to take with Salvia divinorum. I had previously tried plain Salvia leaves with very minimal results. I would just kind of zone out for about 30 seconds and then nothing. So anyhoo I ordered some Salvia 5x off the Internet because where I live you cannot get your hands on anything even remotely good. The package arrived and sat around a week until I had my first chance to try it. I was chomping at the bit to try it because of my previous Salvia uses (probably about 5 or 6 times) and I wanted to have a break-through experience.</p><p>I had nothing else in my system except some prescription antihistamine that I had taken the night before and was ready to give it a whirl. I was in my living room with all of the lights off except for the Xmas tree lights and the DMX New Wave music channel. So with Salvia vial in hand and a water pipe that I had made out of an old candle jar I embarked on my journey. I filled the bowl as full as I could get it and relaxed into my recliner. I proceeded to light it up and take in the smoke, which if you are a non-smoker is quite harsh. I took in as much smoke that I thought I could handle and held it in as long as I could keeping the lighter lit in the Salvia the whole time. Also I think that the 5x smoke is a lot harsher as it has a definite darker color and stronger smell. I held it in for what seemed to be forever, but was only about 30 seconds. I could feel the familiar effects coming on and I quickly tried to relight and burn what was left in the bowl but I couldnt get my lighter to light. I finally got it lit and burned everything that was left up. At this point I thought to myself, this is going to hit me hard. I had better put my pipe down whilst I still can (because I didnt have a sitter which is recommended) and that is the last moment that I had in this reality......</p><p>I will try to explain this the best I can, but no words can do justice to what I experienced. The next thing I know I had this feeling that I was flying over water and that I was about 500 feet in the air. The water had perfect shaped waves or ripples that were about 2 to 3 feet high. I was seeing everything from the side like I was at an even plain of existence with what I was seeing but only from above. All the while I could feel the presence of what I thought was my mother. I also had that new age music going in the background and I could still hear it though it sounded like I was listening to it through a long tunnel. I had the feeling that while I was flying that I was in an airplane, no I was the airplane, maybe I am the air, and maybe I was the water and the air and everything else that was around me. Then I remembered my daughter and that I wanted to see her again. My thoughts kind of scared me that I might never return from where I was to see her and I wondered if I was even still alive.  </p><p>But I could still hear the music. And all the while I knew that I was still breathing. If I got scared I could always tell that I was still breathing. Dont ask me how I knew, I just did. All the while this female presence was with me. I thought it was my mother but after the experience I think that it was Lady Salvia who was with me on my journey. I have read lots of trip reports where the people think as Salvia as female in gender. Anyway with the sense that I was still breathing and that I knew that I would eventually return, I gave myself totally and completely to the Salvia and just let myself go. I enjoyed flying or coexisting with the universe that I was in for a while. Then just as quickly as I had been taken away to this wonderful place I returned to my recliner. The only words that I could get out of my mouth were holy shit. Holy shit over and over again. Then I kept muttering holy shit that was the coolest thing that has ever happened to me over and over again. I happened to look over at the clock and realized that I had been gone for almost 10 minutes. I laid there kind of dizzy and relaxed for a while just kind of enjoying the experience that I had just had. I had my break-through experience and it was wonderful.</p><p>I will definitely be trying Salvia again in the future to explore this wonderful plant and everything it has to offer.  It is something that should be treated with the utmost respect. I dont know if people should fear it or not as the experiences that I have with this great plant have all been very positive and uplifting.</p>"
}
