{
 "title": "Datura Extractions and Effect",
 "author": "THE WATCHER",
 "citation": "   THE WATCHER. \"Datura Extractions and Effect: experience with Datura (ID 11686)\". Erowid.org. May 22, 2002. erowid.org/exp/11686",
 "substance": "Datura",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "oral",
   "Datura",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11686",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 22, 2002",
   "Views: 70671",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAnother little tid bit from the watcher's fabled lab note book.</p><p>DANGER DO NOT ATTEMPT TO DO THIS PROJECT IT CAN CAUSE DEATH.</p><p>EXTRACTION OF Datura (JIMSON WEED) via. METHYL ALCOHOL. </p><p>[Erowid Note: According to Merck, scopolamine and hyoscyamine/atropine are both readily soluble in ethyl alcohol as well.]</p><p>STEP #1 Grind 2 grams dantra seed in mortar and pestle. </p><p>STEP #2 Place seed pulp into test tube. </p><p>STEP #3 Use pipette to place 6mL methyl alcohol into test tube with seed pulp. (the entire contents of the test tube should be 9mL this includes alcohol and seed pulp.) </p><p>STEP #4 Shake very well. </p><p>Note 1: methanol soon turns a clear yellowish color. </p><p>Note 2: end of day one there was only a slight darkening of the alcohol. </p><p>Note 3: end of day two there was no change in the appearance of the methanol. </p><p>STEP #5 Filter methanol from seed pulp. (gravity filtration will work fine for this). </p><p>STEP #6 Pour 2 mL. methanol through seed pulp to wash any remaining alkaloids from the seeds. </p><p>NOTE: Upon evaporation of methanol you are left with a golden yellow crystalline powder, (be sure to evaporate methanol to complete dryness as it is very poisonous). The total product of this extraction is 80 mg. </p><p>USAGE: 10:40 PM Ingested 8mg. Extract orally (taste was slightly bitter but mildly so). </p><p>11:05 PM can feel the onset of alkaloids. (onset of effects are consistent with the use of the topical preparation prepared with olive oil). </p><p>11:30 PM delirious effects are increasingly noticeable, very slight visual effects becoming noticeable also slight dryness of mouth with no pupil dilation present. </p><p>1:15 am effect of alkaloid has leveled out with only a slight dry mouth, slight Dis-orientation , slight visual effects, and pupils slightly dilated but reactive. </p><p>7:30 am effects only slightly noticeable but still present, vision has almost returned to normal. </p><p>11:30 am effects have subsided. </p><p>DOSAGE CALCULATION (USE AT OWN RISK) </p><p>8mg......................mild effects. </p><p>10mg....................mild to moderate effects. </p><p>12mg....................moderate effects. </p><p>14mg....................moderate to heavy effects. </p><p>16mg....................heavy to dangerous effects. </p><p>EXTRACTION OF Datura  ALKALOIDS via an oil solvent. (from JIMSONWEED) </p><p>STEP #1 Grind seeds into a fine pulp, used 1500 mg seed. (Approx. 200 seeds.) </p><p>STEP #2 Placed 1500 mg seed pulp into test tube. </p><p>STEP #3 Pour enough olive oil into tube to make the entire contents of test tube = 7 ml (this includes seed pulp and olive oil.) </p><p>STEP #4 Shake contents of test tube. </p><p>STEP #5 Let sit for 2 days. Note: after shaking the mixture for just a few seconds the oil becomes cloudy and after shaking 3 more times and letting sit for 20 min. the oil darkens considerably. </p><p>Notes on the next day-</p><p>day1 After the extract sits over night the seed pulp settles to the bottom of the oil, the oil will look clear, but there seems to be another oil layer settled on top of the seed pulp which is dark brown in color, it is possible that this layer of liquid could be the water content of the seeds or it could be an oil contained in the seeds with a density greater than the olive oil used for this extraction, when shaken these two liquids mix and will color the olive oil a darkish brown color. </p><p>Notes on day 2: The olive oil had a darkish color to it, the lower liquid layer was not as evident as it was the day before but was still there. </p><p>STEP #6 Use vacuum filtration to filter the oil from the seed pulp. (you will need to apply a vacuum or this step will take forever!) </p><p>STEP #7 Wash test tube with 2ml fresh olive oil and vacuum filter this through the seed pulp. </p><p>Note: end product = 6ml It was a cloudy yellow color. </p><p>Use of this product: Apply 2ml of oil to any area where there is a high concentration blood vessel near the surface of the skin. (In the male this would be the penis and in the female the vagina) noticeable effects will begin in about 25 min. it will peak in approx. 2 hours after application. There was slight Dis-orientation, slight visual hallucinations, and slight audio hallucination. After 9 1/2 hours there is still noticeable effects with some visual effects still noticeable, Dis-orientation has cleared up but a noticeable detachment to reality is still evident, during this time there was a noticeable dryness of the mouth but not really uncomfortable. </p><p>Day after application. There were some slight effects the following day for approx. 6 hours then subsided.</p>"
}
