{
 "title": "First Contact",
 "author": "Q",
 "citation": "   Q. \"First Contact: experience with P. harmala (Syrian Rue), LSD & Cannabis (ID 11680)\". Erowid.org. Feb 12, 2002. erowid.org/exp/11680",
 "substance": "P. harmala (Syrian Rue), LSD & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tsp",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   "  T+ 0:25",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 9:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 20:00",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "11680",
   "Male",
   " ",
   "Not Given",
   "Feb 12, 2002",
   "Views: 18894",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n6:20am</p><p>Set & Setting</p><p>Solo, at Home - just woken up, ready to seriously do some internal explorations (extrusion in hyperspace, maybe?)</p><p>[an account of mixed thoughts written during the trip and other comments further added]</p><p>(T-0:0 min): Harmala, a teaspoon of powdered S.Rue</p><p>(T-0:25): 1 Hoffman blotter</p><p>(T+0:30): somethings happening ? acid, nope... the harmala :)</p><p>(T+0:50): thoughts accelerating and smiling :)</p><p>(T+1:15): transitional period. flow of information ...'you're coming on strong and i like the way, the visions we've had ... are part of the way</p><p>i'm telling you now i'm here to stay the hard way'</p><p>(T+1:25) hard way, synaesthesia ... (between) Patterns appear around ... colours are glowing - I can hear a melody of sorts, two notes. I try playing them and figure them out... I decide not to listen to music and definitely engage in a McKenna style, pitch black room, alone trip. </p><p>The small space in the darkness starts to look like a definite place in hyperspace - like a cave of sorts. Slowly, but surely, a 'vacuum cleaner' appears in front of me, an entity of sorts - Cascade style - ball with loong tentacles, somehow wired up into my head. It's a 'huge evergrowing pulsating brain' which tells me that it loves me, that 'all you need is love' and that it's here to bring good. I am totally stunned and BELIEVE this. I wonder if it'll appear outside of this space and venture out - sure enough, on a wall in front of me, I can see it mapped on to the texture - it's tentacles floating in hyperspace and connecting to my mind. I then go under a blanket, again - in darkness, it appears - it is here, I know it and I can sense it will somehow always be with me...</p><p>Further, I go sit before my window and look at the snow on the roof - it textures all over, letters, somehow wrapped in a circling pattern appear. The curves in the uneven texture appear like curves of the brain...</p><p>The air seems heavy & thick, with a glow on it...</p><p>Strings on blankets appear alive and moving, like small tentacles drifting in a sea of air</p><p>(T+3:25) weird, exactly 9:20 ... ;-) ... 3 hours since the beginning. i still feel like i have made contact with a strange entity from another dimension ... a dimension of (linguistic) ideas ... the more i let go, the more obvoius it looks like ... everything looks like it's from the dimmension of thoughts.</p><p>... i am sure it's hard reading me ;-) but stick around ...</p><p>VOICING LOVE</p><p>KISS</p><p>ECTODERMOSTIC WASHBATH ccchhhllllkkkkkrrdddssshhhhh pppp</p><p>... massages the Mind withe the momenT</p><p>...a Tale of two taiL</p><p>...s</p><p>(T+3:55) Weird things are happening here, it's best to come and see them. .. the next time i'll sort the flow of thoughts in a muuuuch better way! ;-)</p><p>the circle will be smaller, with more cultural influences  :)</p><p>(T+4:05) when i looked it was 10:00, when i started writing it was 10:01, while writing it was 10:02 and when i finished it was 10:03 ... </p><p>you cannot win ;-) the system in the game it plays unless you can</p><p>sting it, shake it like nobody expects (thoughts about The System - i can experience it - i am the System, the System is all around us (think, the Mattrix)</p><p>(T+4:57) still more madness (System examining) ... i don't wanna write :) it's that good</p><p>(T+9h) smoke dope ... full time back in to the System</p><p>(T+?h) there are now other entities. plastikman style skeletons with wicked grins, think there are two of them, facing each other - i associate them with weed. i have seen them before, but now i am totally sure they exist. are these some of the entities McKenna talks about ? i think so - maybe a lot of people 'get them', but they don't know ?</p><p>(T+15h) still more weird stuff, everythings weird and i can still surf the noise of the system - the noise btw seems to rise and fall in pitch, and go into weird flangers and wobbles. have you heard the end (-0:10s) of A Study of Six Guitars and the beginning of Snake Hips from ISDN - very much the sound of it!!! </p><p>(T+20h) light a small spliff, then another one (nail size) and put on my headphones with ISDN on - and fall asleep.</p><p>(T+31h) I awake, totally refreshed, new & nice feeling - ready for life. all my realizations are still with me and i can still relate to them. a mind blowingly wonderful trip... i have tried before Harmala + LSD (and LSA) and I can tell it's a really nice one. Just be sure to have an empty stomach at least 6-7 hours and be sure avoid hard food before. </p><p>Dream Free</p>"
}
