{
 "title": "Nice, Then Unsettling",
 "author": "Unknown",
 "citation": "   Unknown. \"Nice, Then Unsettling: experience with Mushrooms (P. cubensis) (ID 11727)\". Erowid.org. Feb 26, 2005. erowid.org/exp/11727",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11727",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2005",
   "Views: 4546",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>To introduce myself, I am a white male, age 17, and my previous drug experience include AMT, DPT, DXM, 2ct2, marijuana, xanax, alcohol, caffeine , nicotine, bzp, 5meodipt, 5meodmt, salvia, ether, kava, adderall, ritalin, and a few other substances I can't quite remember at the moment. This was my first trip with psilocybin mushrooms. I've had pretty positive experiences with psychedelics prior. 2 previous unpleasant trips had occured, both on AMT, during a time of great stress in my life, having problems with former gf, etc. I'm not a particularly spiritual person in the traditional sense and consider myself an atheist. I use psychedelics for the purposes of gaining insight into myself and my reality and for general recreation. I've been diagnosed with 3 mental illnesses which I don't believe to be accurate: Bipolar Disorder, ADHD, and minor OCD. </p><p>This report is from a trip on psilocybe cubenis several weeks ago. </p><p>Bought 1/2 an ounce (14 grams) of some, later to be discovered, very unpotent mushrooms from a fellow at work with the intent to ingest them sometime that week. About 3 days later, Saturday, I talk a walk to the local convience store and get some OJ, a pack of marboro, and a weekly world news, and walk home. I divide out about half of the mushrooms (Approximately 7 grams) and take a sip of OJ, put the mushrooms in my mouth and begin chewing. Orange juice completely kills the somewhat earthy not too unpleasant but far from appetizing taste of the mushies. Take about 5 minutes to thouroughly chew and swallow all the mushies. About 20 minutes begin to feel the familiar tryptamine buzz. I put on a Parliament Funkadelic compilation CD. After about 30 minutes I feel them completely take effect and put the cd in my discman, headphones on, and go for a walk through the paths in the woods. I am barefoot and the ground is mooshy from recent rain. I walk through this path for an hour or so, enjoying the beatiful hues of the forest. Smoke a few cigarettes along the way and walk back home. I watch some tv. Lay on my kitchen floor for most of the remainder of the trip enjoying the music and smoking some more cigs. </p><p>After about 3-4 hours I start feeling agitated, restless, and slightly upset/depressed. I go to change the music and put on a Doors live album, Disc 1. I continue to grow gradually more unsettled and start seeing depressing imagery in all of the programs on tv. I try to call several people during the trip but nobody is home. The one person I managed to reach was going out at the moment so it was a quick call. I seem to have a strong need for other humanly contact, especially during trips. Which is quite odd as I'm usually very reclusive and isolate myself from other humans the majority of the time. I'm very uncomfortable in social situations and feel that I'm too dissimiliar from others to relate in a proper manner. No other substances were ingested during this time. I would like to try mushrooms again as I feel they could have more to offer and just that the set and setting were probably off, and perhaps it was just the wrong time.</p>"
}
