{
 "title": "Beautiful and Clear",
 "author": "Maison",
 "citation": "   Maison. \"Beautiful and Clear: experience with 4-Acetoxy-DET (ID 11723)\". Erowid.org. Feb 18, 2002. erowid.org/exp/11723",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "35 mg",
   "insufflated",
   "4-Acetoxy-DET",
   "(powder / crystals)",
   "  T+ 0:45",
   "12 mg",
   "insufflated",
   "4-Acetoxy-DET",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 11723",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2002",
   "Views: 19798",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis was my second time on 4-AcO-DET and only a few days since my last trip. Last time I noticed a strong spiritual component to the drug which I wasn't really prepared to make use of. This time, I decided that I would get the most of that.\r\nA couple hours before I took it, I spent some time doing some magic. I won't go into the content of the magic, or the goals, but it involved smudging my house (ie burning sage and, with some ceremony, waving the smoke into the corners and the doors. This typically connotes ridding a place of 'bad' energy.).  I lit some candles, and said a few short prayers in an attempt to direct me toward my goals as the drugs took hold.\r\nI made a point of saying these prayers multiple times so that the chance of me remembering them in my altered state would be higher. I would discover later that, at this dose, it would have helped to write them down, perhaps in very large, easy to read letters.\r\nMy cohorts arrived about an hour after my ritual was done and we spent some time locating a last minute sitter (our original sitter plans fell through) and weighing out compounds. Everyone else ate theirs in doses from 20 to 35. I snorted mine and was feeling the effects within 5 minutes; slightly blurred lines, poor balance, colors were slightly more saturated than usual, and then a few minutes later I felt like I was heading down, and then up once again. It went in waves like this for the first 30 minutes. By 45 minutes, I was fairly high, the windows into which I was typing my trip notes had a shimmering, ghost-like quality to them and I'm pretty convinced that it is the most beautiful thing I've seen in some time.\r\nBut I felt like I'd leveled off and wasn't quite where I wanted to be, so I snorted a 12 mg line I had thoughtfully weighed out for myself earlier (attempting to measure compound in that state would, almost certainly, have come to a bad end). This boost had the desired effect and I'm off like a rocket.\r\nI manage to make it back to my bed somehow, away from the other trippers who are still able to talk before my world explodes. I ended up spending about two and a half hours there letting the music control my trip. The computer was set to randomly play a set of ambientish tracks, each one of which seems to open up a whole new experience. At pauses in the music, I would feel like I was almost not high, and then a new song would play and the trip would return, instantly, to utter insanity of a new kind.\r\nThe silver comforter was spouting mouths and tentacles, my body was being pulled by strange, unseen forces, in all directions and in dimensions that are unlikely to exist outside of the world I was in, the bed was at times engulfed in faint blue flames that blew inwards. Answers to the questions that I'd asked in my pre-trip ritual came to me in many ways, but often with unearthly clarity that seemed unfitting to my thoroughly twisted state. My trip notes contain many quotes like 'the music drives the trip... everything about it.' \r\nI attempt some ritual, but I can only remember bits and pieces of the words or goals (next time, I'll write things down) and I feel that my work has already been done, my questions answered. By about hour three I am sane enough to move and I wander out of my room to rejoin the rest of the group. The conversation is fairly silly; acid like banter. I'm still not fully able to follow the conversation, but I can at least listen and enjoy it. I spend the next two hours wandering in and out and trying to work through the massive amounts of muscle tension that have been with me all night. I finished it off with a couple glasses of port.\r\nFor the next few days, I am struck by the utter beauty of this drug. Everything was so shiny and clear and I am impressed with the clarity of the answers that I had to my questions (though the skeptical scientist in me can not discount the possibility that they may just be bullshit thrown at me from the magic 8 ball in my head 'Answer unclear, shake brain, try again later').\r\nI am also a bit nervous about the degree to which I want to do more of this substance. With acid, or really any other powerful psychadelic, I always end up feeling like I had a good time, but could really use a month or so to rest and recover. Not so with this, I could happily do more the next day. Thankfully, the pressures of work and a social life will keep me from it for a bit, but this is something to watch out for.\n\n\n"
}
