{
 "title": "The Perfect Process",
 "author": "Trevor G.",
 "citation": "   Trevor G.. \"The Perfect Process: experience with Cannabis, Morning Glory & Alcohol (ID 11722)\". Erowid.org. Jul 27, 2007. erowid.org/exp/11722",
 "substance": "Cannabis, Morning Glory & Alcohol",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "1 shot",
   "oral",
   "Morning Glory",
   "(extract)",
   "  T+ 3:00",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "1 shot",
   "oral",
   "Morning Glory",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11722",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2007",
   "Views: 7255",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had read several recipes for isolating the chemical LSA from morning glory seeds on this site, and didn't fully trust any of them.  But one process described in the update section of the Morning glory FAQ gave an alternative to using, the hard to find, ether ethanol or seemingly unsafe liter fluid.  The process just involves common household kitchen tools, water, and a high proof alcohol, in my case 80 proof tequila. </p><p>A few friends of mine had tried the Morning Glory seeds without using this method, or any other sugested process, simply by washing the seeds in water, then chewing them down.  This process, brought about heavy nausea, fish-eyes, and even severe psychological distress in one case.  Needless to say, unpleasant.</p><p>I got the Heavenly Blue Morning Glory seeds from the local Home Depot, not bad prices 6 packs for under $10.  Each packet had 1.5 grams of seeds, altogether 9 grams in all 6 packs.  I started out by washing the seeds in hot water with a little detergent, then grinding up all the seeds in a coffee bean grinder, I then took this powder and dissolved it in a minimal amount of water, then let it sit for a few hours, I then used coffee filters to filter out all the leftover solids, easier said than done, it takes a while unless you change the filter often.  Then I poured the liquid into a large pan and left it for a couple days for all the water to evaporate.  A brown pasty stuff was left over, and I then redissolved it in 80 proof tequila, about an ounce and a half.  </p><p>The next weekend I decided to try it out.  At 10pm I smoke a few bowls of marijuana, accumulating to about a gram.  I hadn't smoked in a few weeks, so this alone hit me pretty hard.  Then at 11pm I smoked another bowl, and at about 12pm I drank the first shot of LSA laced tequila, I felt an immediate increase in my marijuana high, and an intense body high.  My pupils were overly dilated, but not quite as dilated as they were on brugmansia (hell's bells).  I felt an excessively hot feeling, and a rapid heart flutter as if I had just ran a mile.  Next I felt a head rush, muscle relaxation, a body high, tingles in back, and especially legs, at some points I couldn't feel them.  I had blurred vision, and lights seemed unusually bright.  Later on I had leg and body jitters with an excessive thirst, much more intense than the weed side effect.  I could imagine somewhat like the early stages of an acid trip.</p><p>At around 1am I smoked a few more bowls, accumulating to about another gram, which seemed to calm the jitters and bring me back up to another plateau.  Then at 1:30am I drank another shot of the tequila laced with LSA, it enhanced my high, but was no where near as powerful as the initial onset.  I eventually fell asleep at around 2:45.</p><p>I look forward to trying morning glory seeds again, only in larger quantities.  I can see how a larger amount could produce heavily psychadelic effects, next time, I would probably let the seed meal soak longer in the water before filtering it, and use as many seeds as I could get.  This was a great experience without any nausea, fish eyes, or psychological breakdown, and I would suggest it to anyone interested in the experience.</p>"
}
