{
 "title": "Finding Me",
 "author": "AnGeLgIrL",
 "citation": " AnGeLgIrL. \"Finding Me: experience with MDMA (ID 11739)\". Erowid.org. Jun 29, 2003. erowid.org/exp/11739",
 "substance": "MDMA",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11739",
   "Not Specified",
   "",
   "Not Given",
   "Jun 29, 2003",
   "11564",
   " "
  ]
 ],
 "report": "<p>For many years I knew of the drug exstacy and had only heard the 'facts' from the media.  Very afraid and uneducated about the drug I refused to ever try that drug.  I became very close with some friends of mine who used exstacy several times and only had wonderful things to say about it.  I decided I should research the drug online and see what I found out, I looked here on erowid and dancesafe and other websites to see what the effects were, percautions to take, etc.  I decided to attend a party and try exstacy.  The pill I purchased had been tested to make sure it contained mdma and not some other drug, I made sure my friends stayed near me until I knew I was safe and I could handle the effects of the drug on my own.  I drank plenty of water throughout the night.  </p><p>As for the experience itself, my life was changed forever.  After being at the party for an hour or so I took my pill and started dancing about 45 minutes later I started to feel like liquid moving with the music and I had this sensational feeling like tingly all over and so happy that I was listening to great music with good friends.  Throughout the night my mind expanded and matured growing with every new enjoyed sensation and experience with friends and strangers.  I truly felt like I knew who I was for the first time, I was me and I knew what I wanted what I enjoyed and I was ok with it.  I felt the need to be in the company of my friends and other and was willing to give back massages, hugs, or be a dancing partner.  When normally I would be too shy to do any of that.  Throughout the night I grew more and more and felt like my life was finally falling into place.  </p><p>I have been forever changed... I have found that mdma is a great tool to expand your mind, find yourself, and become closer to people you care about.  If it is used properly and you know what you are doing exstacy is a great drug.</p>"
}
