{
 "title": "No Effect Whatsoever",
 "author": "schiz girl",
 "citation": "   schiz girl. \"No Effect Whatsoever: experience with Alcohol, Paroxetine, Olanzapine, Cannabis & Methamphetamine (ID 11736)\". Erowid.org. Nov 30, 2004. erowid.org/exp/11736",
 "substance": "Alcohol, Paroxetine, Olanzapine, Cannabis & Methamphetamine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "4 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "30 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)",
   " ",
   "20 mg",
   "oral",
   "Pharms - Olanzapine",
   "(daily)",
   " ",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11736",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 30, 2004",
   "Views: 17100",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[Alcohol, Paroxetine 30mg (am), Olanzapine 20mg (pm), wrap of speed, half a joint.]</p><p>I used to use speed every weekend before I became ill (I have schizophrenia) and then I stopped because it worsens psychosis. This one night I went out to my old favourite places, a local club and bar. I felt pretty drunk (olanzapine increases the effects of alcohol), and we met this guy at my favourite bar. We got talking and had a smoke, and I had about half a joint. The joint made me feel more drunk, but was not unpleasant. The guy said he could get us anything we wanted, so, being drunk and slightly stoned, and being in my favourite bar just like old times, I scored some speed.</p><p>Later on, in my old favourite club, I dabbed at the speed over a period of about half an hour until it was all gone. It certainly tasted like speed (how could I forget that taste!). It had no effect whatsoever. I still felt drunk! In the old days I would have got a good high off the speed, and this was speed, I could tell by the taste. I wanted some more, but didn't get any. In the setting of the club I should have got a good buzz, but nothing.</p><p>Paroxetine is an SSRI and olanzapine is an antipsychotic which affects both dopamine and serotonin levels. Maybe this is why I got such a sound nights sleep that night.</p>"
}
