{
 "title": "Cars and Horses",
 "author": "arthur",
 "citation": "   arthur. \"Cars and Horses: experience with Mushrooms (ID 11750)\". Erowid.org. Dec 15, 2004. erowid.org/exp/11750",
 "substance": "Mushrooms",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "9 capsls",
   "oral",
   "Mushrooms",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11750",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2004",
   "Views: 4821",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My name's Arthur and I'd like to tell my very first and recent experience with mushrooms and so my first trip. I'd never thought about tripping before. Just not interested. I bought some mushrooms once before when I was 15 but they stank so much that I couldn't imagine putting them in my mouth so I sold them to another guy. He told me he gave to some other bastard who chewed em with gum and said they were ok. To tell the truth I'd never heard about trips until I fell upon internet mentions. Nobody I know calls em trips. It's probably a cultural thing. I don't have no hippy friends and hippy people are the only ones I heard about that take trips and often with bagpacks and sandals on their feet. I know nothing about mystical experiences or anything of the sort. The only thing approaching to a mystical experience I ever had is seeing the pope stoned on the toilet paper at a friend's house while taking a crap so totally fucked I would'nt have been able to pronounce my name if asked. (Whenever I can't remember my name I usually tell em to call me Enzo.) </p><p>No more, though I have prayed to god when I was so fucked up and desperate I didn't know what the fuck else to do. Forgive me. The only factual narration I had about mushrooms was about guys freakin out in clubs with paranoia strokes or other ones callin for their moms rolling on the pavement of the street of my city cause they're feelin just too shitty. Guys around here just don't go into details. A guy I know said after he took mushrooms after a night clubbing he and a pal went chasing rabbits in the dunes. I said ok and questioned no further. </p><p>So suddenly one day in the recent past I decide I wanna get hold of shroomies. I know where to go cause it's the same guy that sells weed and spacecakes in M. I don't really like the guy. He's about forty years old has a brittish accent and the only other customers I seen go to his place were either old rocker types or rasta white boys who suddenly dissapear when you take an order. No good sign: this testifies of their conformism when confronted to mercantile transactions, which I hate in an individual. Anybody who changes their attitude when money is at stake is an asshole, pure and simple like they say over here when they talk about bourbon. Good bourbon is pure and simple, an etalon for one's behaviour as it were. Unpure and complex a sign of derision. So I buy mushrooms from this english guy. </p><p>We go out I eat the mushroom. We're malking like twenty minutes when I start giggling about the fact that the cig I'm smoking taste like shit cause it's brown and it's got a cylinder form like a turd. I don't really say this but it's my idea and I giggle and giggle and I'm finally lying down face down on the street feeling fucked for life. I see no issue. I remember no mecanism of survival. It's here that things end and I'm to be taken away. Then I realize that it's just the mushrooms. I'd forgotten about them it seems. My friend who only bought some weed gets me back to my feet says it's the mushrooms fuckin with my head and that I gotta keep walkin. But I'm already feelin better. I see things around me. I mean stuff around me makes sense again, like normal though I'm now apprehending the effects of the drug. Like xtc with a hypertrophiating of the brain or thought effect. Everything tends to be surrounded by a story. Even myself and my friend walking by my side we're involved in a plot and something important is happening. I smile at some younger girls as they pass by but I'm not interested in anything else. They just made me happy that's all. </p><p>We take the bus back to my place. I don't believe a thing I see. Cars looks like horses. I extend my hand to the glass window to touch them something. The road looks like pastures fresh and green. The crowds walkin down the streets make me want to scream. I'm feelin good as we step off the bus. We go to my place and I put on some music I didn't listen to for years and I dance to it a little while till I join G and go play some games on the play station. Though I lose I feel I understand the game better than himand that it ain't important if I lose but that all I have to do is just keep on playing and be true to my characters. We smoke some weed but that doesn't seem enough so I smoke three cigarettes in a row that taste wonderful. I'm thirsty but I don't wanna drink. I'm hungry but I don't wanna eat. I wanna go out and live, meet people, talk to my friends and be happy. </p><p>We finish the game and go out. We buy some beers and drink them at the corner of a street. The effects are going away. For a minute I imagine I'm luke skywalker talking to Yoda saying: things are not like they use to be, I AM  sad. Yoda says: be not sad for what you HAVE is already forsaken. Did I invent this or not and if not what the fuck does it mean? Well anyway I was coming back to normal my legs hurting and walking down the street.</p>"
}
