{
 "title": "Fasten Your Seatbelts",
 "author": "Camille",
 "citation": "   Camille. \"Fasten Your Seatbelts: experience with LSD (ID 1178)\". Erowid.org. Oct 16, 2000. erowid.org/exp/1178",
 "substance": "LSD",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1178",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 16, 2000",
   "Views: 13297",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOnce upon a time, my boyfriend and I took 2 stamps (blotter hits) each for the first time. After one hour we still did not feel anything so we each decided to take another stamp.</p><p>After about one and a half hours sounds around us were starting to change. They were heard more intensely than before, our eye focusing changed and our legs started to feel like they were made of elastic, accompanied by an uneasy feeling in the stomach. On top of that we felt as if we were being watched and heard by someone. We tried to watch the movie. But no success. Suddenly the telephone rang. I staggered over, picked it up and all I could hear was a strange buzz on the other end.</p><p>By this time, the feeling of nausea, the limpness of our bodies and the change in sight, hearing, thinking, smelling and tasting really started to get to us seriously. My boyfriend felt pretty uneasy at the thought of how strong the effects would eventually be, and where it was gonna lead us. We decided to walk a bit around the house and everything we looked at, walls, ceilings, our faces, began to come alive, as if everything surrounding us, even the air we breathed, was covered with an amazingly colourful energy field composed of extraordinary vivid colours of sparkling green, purple and blue, like millions of pieces of glitter, all radiant and moving, constantly changing everything into living energy forms.</p><p>We walked towards the bedroom to lie down, hoping the strange feeling in our bodies would go away. Lying on the bed, we closed our eyes. I felt great and excited over my new state of mind. Believe it or not, when my attention shifted to my boyfriend's emotional state I could actually feel the essence of his deepest fear. He was so frightened for what he was momentarily experiencing, that he thought the hand of the devil tried to grab his heart right through the mattress to pull him down. I wrapped my arms around him and comforted him that there was no need to be frightened. That he should let go of that fear and that he should to try to surrender to this new state and perceptions.</p><p>Then something astonishing happened to us. As soon as we closed our eyes again, something pulled us out of our bodies and we were literally launched into the skies, like a rocket, right through the roof of our appartment into the vastness of  what appeared to be the actual universe itself. Together we flew with the speed of light through this immense black space and it felt like we were one with all the stars and planets and all that surrounds them. We could not see our bodies, we spoke through our thoughts to each other whilst travelling from one planet to the other. During this trip we searched for the meaning of life and while trying to find the essence of it, we read each other?s thoughts as we travelled together, side by side, from planet to star, from star to planet and back. It was as though we were one.</p><p>We were searching for the big Truth out there, and we finally arrived at the Unbearable Truth, unfolded Naked, in front us and part of us, namely that in this large black Universe, we were just a tiny little molecule forming parts with other molecules, forming a bigger part of larger parts and so on. Being one with the grandeur of Nature and Life, and at the same time even tinier than the smallest dot on a piece of paper. This really blew our minds out. </p><p>Finally at dawn, we came back to earth. We were pulled back into our bodies with a speed you cannot imagine. It felt like we had travelled in space for only one hour, at the most.</p><p>We found it difficult afterwards to fully comprehend. We were in a state of shock, I can tell you that, hardly able to speak with reason.</p>"
}
