{
 "title": "The Drug That Freed Me From Drugs",
 "author": "FormrTrippr",
 "citation": "   FormrTrippr. \"The Drug That Freed Me From Drugs: experience with H.B. Woodrose (ID 11785)\". Erowid.org. Aug 28, 2002. erowid.org/exp/11785",
 "substance": "H.B. Woodrose",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "2002",
   "11785",
   "Male",
   " ",
   "Not Given",
   "Aug 28, 2002",
   "14508",
   " "
  ]
 ],
 "report": "<p>I had been a pot head for years, and over the past year I had become obessed with 'ethnobotany.'</p><p>Anyway, I got some HBWR seeds, and was very excited to try them. I throuroughly washed and scraped three seeds obtained from a reputable supplier, and ate them, not really expecting much. The result: THE FIRST TRIP WHERE I ACTUALLY LEARNED SOMETHING.</p><p>The trip began about 1/2 hour after eating the seeds. It felt much like taking a small dose of LSD with a difference. Instead of the   usual sketchiness and scattered thoughts that accompany an LSD trip, my thoughts were crystal clear. I became more rational than I had ever been in my life, and began examining issues that were concerning me: School, Work, my relationship with my girlfriend, and my extremely heavy marijuana habit (I routinely smoked two - three joints a day).</p><p>And suddenly, something just clicked in my brain. Even though I was having an amazing and fun trip, I realized that drugs had taken me as far as they could, and that it's now up to me to make the life I want for myself. And this life I envisioned did not include regular drug use, OF ANY SORT, including marijuana. It was not that I decided that drugs were bad, or evil, or even hazardous to my health anymore; I simply lost all interest in them.</p><p>The next morning, I woke up, feeling lethargic and hazy, just like the day after an acid trip. Purely out of habit, I took a few pulls from a joint, and it was completely unenjoyable. It did nothing useful for me. And that's when the memories from my trip came back to me. I put out the joint, and sold my entire stash of weed to a stoner guy in my dorm.</p><p>And since then, I have not done (or desired) marijuana or any other mind-altering substances, including these seeds (although they were extremely enjoyable and mild on the body). I realize that my obsession with cannabis and the hallucinogens was a desire to learn who I was, to 'get the message.'</p><p>And that night, I got it.</p>"
}
