{
 "title": "Too Many Biccies",
 "author": "Emma Lemon",
 "citation": "   Emma Lemon. \"Too Many Biccies: experience with Hash (ID 11794)\". Erowid.org. Dec 15, 2004. erowid.org/exp/11794",
 "substance": "Hash",
 "bodyweight": "8.9 kg",
 "header": [
  [
   "DOSE:",
   "6 ",
   "oral",
   "Cannabis - Hash",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 11794",
   "Female",
   " ",
   "Not Given",
   "Dec 15, 2004",
   "Views: 9735",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have never got anything out of smoking hash or weed and much prefer baking with hash. I've had mostly good experiences and only one very scary trip. I'll talk about that one first.</p><p>I'd made a batch of almond and lemon biscuits with a fairly large chunk of hash ground up and chucked in (about a tenner's worth in the UK). I had so many I froze most and kept one bag in my room. I hadn't gotten the hang of how many I should take for a good experience and was just experimenting with 2, then three... Later that week one evening I took 6 biscuits at about 7pm. As usual I expected a few hours before it kicked in so went to bed. After I'd read a book for about an hour things started to happen and I was feeling great. I was euphoric and my mind felt the size of the world. Then I became very jittery and I fet very very thirsty and dehydrated. I thought I was controlling my heart beat but the horrid thing was that I thought I was slowing it down to the point where I was sure I was going to stop it completely. It was like the plants had taken over my mind and were trying to kill me. I felt like the plants were the gods of the earth and I needed to worship them to stop them from killing me. I could see in my mind towering forests of green staring down at me. My body was felt like it wasn't there, not the nice relaxed muscle feeling but like it'd dissolved.</p><p>I looked in the mirror and my face was terrible. My skin was so dry and the whites of my eyes were red and sore. My pupils were almost non-existant. My head felt so heavy and although the rest of me felt weightless. I eventually managed to sleep and in the morning I felt much better although up until mid-day I was feeling lethargic and a bit 'not with it'.</p><p>I now bake hash into fairy cakes and I know to take about two-three for a good trip. It is trips I seem to get rather than feeling stoned. I do get hallucinations, visual but mostly audible. I hear things miles away like a dog barking but then I completely block out other closer sounds. Once I was lying in bed which is above my garden and I could hear the slugs and snails munching very loudly on my plants and flowers, that made me laugh. Watching Button Moon and playing Santana records is the most enjoyable ways to spend a trip.</p>"
}
