{
 "title": "Smoking, Sitting Up, Headrush, Passing Out",
 "author": "Clayton",
 "citation": " Clayton. \"Smoking, Sitting Up, Headrush, Passing Out: experience with Cannabis (ID 11802)\". Erowid.org. Feb 26, 2005. erowid.org/exp/11802",
 "substance": "Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11802",
   "Male",
   "",
   "Not Given",
   "Feb 26, 2005",
   "7155",
   " "
  ]
 ],
 "report": "<p>Just the other night I had my most unusual experience with smoking bud.  A friend of mine, Matt, came to hang out with me the other night, and brought a joint of some fairly potent hydro. We went to a small building behind my house to smoke at approximately 6:30 pm.  We smoke about half the joint, and things were going good, I knew I'd be pretty stoned (ok, really stoned..) in about 5 minutes, as we've smoked this weed often and thats about the time it takes for the high to peak.  We finished smoking the joint about 45% into it, and I sat down on a box, while Matt starts to smoke a cig.  Then.. things got weird.  I was zoning out like I do when I'm high, and realized I had been holding my breath for as long as I had been sitting down (approx. 20-30 seconds) and take a deep breath, then stand up, and blood rushed to my head from standing quickly/breathing deeply simultaneously (I think..). </p><p>After this point.. things are fuzzy.  My head starts pounding.. I can't think straight at all. Its like my brain was shutting down and I was fighting it.  I could hear a buzzing, and it sounded (I know this sounds crazy, but its true..)like it was coming from Matt's cigarette.  Then the buzzing turned into a ringing.. And my head felt like it was going to burst.  I looked at Matt and told him I felt weird, and he asked if I was ok. I told him yes, and then I closed my eyes.  I dont think I've ever felt a high so intense.  I zoned out again, and remember falling down, and Matt saying.. 'Dude.. you didnt just do that.' He grabbed my arm and helped me up, and asked if I was ok, and I told him I needed to sit.  We walked back inside, and things are getting weirder for me.  My brain felt like it was in complete overload.. I went to get a glass of water and fell down again.. and laid on my kitchen floor for about 30 seconds untill Matt pulled me back up.  I got some water, I think, and we both went into my bedroom.  Matt turneed on my GameCube, and I sat infront of my computer.  The intensity slowly started to wear off.. It had only been about 5 minutes, but it felt like hours.  My brain was numb.  </p><p>About 20 minutes later I felt pretty normal, just stoned.. But I felt burnt.  I acted dumb for the rest of the night, and wasn't completely sure what had happened.  I had that headrush from sitting up, and taking a deep breath, apparently, I was so stoned for 5 minutes that I passed out! Twice! Crazy, huh? The coolest thing about it was smoking the rest of the joint later.. It was one of the best feelings I've had.. Kinda like that overload opened my mind up to feel the high more. I was able to produce slight colorful closed eye visuals... I don't know if anyone else has ever had that kind of experience.. the passing out or the visuals, but they were both crazy as hell.</p>"
}
