{
 "title": "Pleasant Relaxation",
 "author": "Randolph C.",
 "citation": "   Randolph C.. \"Pleasant Relaxation: experience with Absinthe & Cannabis (ID 11801)\". Erowid.org. Sep 29, 2004. erowid.org/exp/11801",
 "substance": "Absinthe & Cannabis",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 shot",
   "oral",
   "Absinthe",
   "(liquid)",
   "  T+ 0:45",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "11801",
   "Male",
   " ",
   "Not Given",
   "Sep 29, 2004",
   "20420",
   " "
  ]
 ],
 "report": "<p>We started the evening with a small miniature bottle of Absinthe that I ordered from a store in the Czech Republic.  They had advertised it as 'the best quality', so we had high hopes.  A friend and I mixed it according to the French ritual (pour one shot absinthe into a glass, and pour in three shots of water over a slotted spoon w/sugar or a sugar cube).  The taste was very interesting - like nothing I had ever tried.  I can't really describe it due to lack of something to compare it against.  However, I did notice that it leaves a somewhat bitter, oily aftertaste in the mouth which abates in a few minutes.  This absinthe reminded me of Sambuca; the anise smell was very strong, like licorice. </p><p>We slowly drank the absinthe, relaxing.  The entire scene was very pleasant, a few friends over for an evening.  Almost immediately after finishing the drink, I felt my tongue go somewhat numb.  I felt immediately relaxed, completely relaxed - even more than with marijuana.  Warmth and a feeling of peace spread throughout my body.  The absinthe also numbed my body somewhat; very similar to the effects of alcohol (this brand of absinthe, with a picture of Van Gogh on the label, was 150 proof), but with an underlying warmth that just isn't there when you're intoxicated.  As I mentioned, it was a relaxing, peaceful warmth, and I had general feelings of everything being completely fine and right in the world.</p><p>About 45 minutes later, we also passed several bowls between a few friends.  My friend and I both noticed that we were more alert than usual (we're both somewhat experienced smokers), able to focus and understand things very clearly, even when we were very high.  Normally, I feel quite a bit of paranoia every once in a while; it seemed like the absinthe negated that effect.  We remained totally and completely relaxed the entire time, and it was a very pleasant, enriching feeling.  Overall we both felt very clear, and that time was progressing 'slow and steady' rather than the microamnesia that sometimes occurs with marijuana.  We both had very interesting conversations relating to the fact that my friend and I could both very clearly understand each other and pose interesting questions about what effects the absinthe + THC was having.</p><p>In conclusion, it was a very rewarding experience.  I would like to explore the effects of absinthe in greater detail - since we only had a miniature bottle, we didn't have enough for more drinks, but we plan on ordering a 750mL bottle and having an old-fashioned absinthe party.</p>"
}
