{
 "title": "Lacking the 'Dark Side'",
 "author": "Elfstone",
 "citation": "   Elfstone. \"Lacking the 'Dark Side': experience with 4-Acetoxy-DET (ID 11847)\". Erowid.org. Jan 14, 2002. erowid.org/exp/11847",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "13 mg",
   "oral",
   "4-Acetoxy-DET",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 11847",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 14, 2002",
   "Views: 15071",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Elfstone took 13mg, while Evenstar requested 12mg.</p><p>Dissolved into ginger ale quite easily.  It came on within 10 minutes of swallowing it on an empty stomach.  Taste was barely noticable.  The visual irridescence I typically note with psilocybin was definitely there.  Conversation was easy, and we spent some time moving through personal material.</p><p>At one point in the conversation, I had a flash of memory from early childhood, being carried on my father's shoulders through the woods, including sunshine on the skin, a light breeze, and a sense of extraordinary well-being that was transmitted from the heart of the Universe.  This flowered into a deep recognition that I was one with the Creator and I felt I had come home to myelf once again.  Nothing not already experienced before, but with a renewal and deepening that was wonderfully wholesome and strengthening.  I noted that I have had similar experiences with mescaline.</p><p>After becoming one with the Father Creator, I began to gradually re-enter my ordinary awareness, and observed some of the side-effects of the material.  This included a slight muscle tension, particularly in the neck and shoulders, that ease up a little with some stretching.  Later that evening, Evenstar noted that I had some involuntary twitching and leg jumping that is usually only noticed when I take mescaline or certain other phenethylamines.  I was quite tired the next day and spent the day lounging and occasionally dozing.  Felt fine the third day, though I noted a slight slowing of my usual cognitive acumen.  </p><p>The euphoria persisted well into the next week.  On the way into work that Monday, I became so bucolic at one point that I inadvertently bumped my car into a truck in front of me at the light, a slight paint scrape on my bumper, but no major damage done.</p><p>All in all, a material worth exploring further.</p><p>As a postscript, I would add that 4-Acetoxy-DET is similar in some ways to psilocybin, lacking the 'dark side.'  This could be advantageous in some circumstances.  However, it has been my experience that psilocybin does not affect my system like a stimulant at all.  It is somewhat neutral in regard to the emergence of psychological/spiritual material, which allows for a greater psychic sensitivity with it and deeper journeying in that regard.  The ability to tap into shadow material makes it quite powerful for plumbing the depths of the psyche in a way that I can't accomplish with say mescaline, or, based on my one experience, 4-Acetoxy-DET.  I also think that to the degree I can plumb the deeper, darker regions of my psyche, I can also equally extend the antipodes of consciousness toward the higher regions as well.</p>"
}
