{
 "title": "Controlled Experiment",
 "author": "Pete",
 "citation": "   Pete. \"Controlled Experiment: experience with Alcohol - Hard & Diazepam (Valium) (ID 11841)\". Erowid.org. Apr 14, 2006. erowid.org/exp/11841",
 "substance": "Alcohol - Hard & Diazepam (Valium)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 3:00",
   "60 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11841",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 14, 2006",
   "Views: 12308",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI began the testing by timing the amount of vodka I was about to consume.  I drank approximiately 3/4 the bottle of expensive vodka, mixed with fresh squeezed orange juice.  \r\nI was with my girlfriend, but she was sober and just observing me, making sure I didn't over do it.  Well, I drank for about 3 hours. felt pretty loaded.  then I popped 6, 10mg tabs of Valium to cap off the night.  I felt the effects of the valium 15 to 20 minutes after administering them orally.  At first, it was the usual dry mouth, slurred speech and clumsiness.  All this occured indoors, I was sitting in my den, looking at a picture of a bear.  I began feeling very sleepy, due to the valium.  Everything seemed slower, my stereo was on, but the noise somehow bothered me.  \r\nI decided to call it a night.  Once I got up from my chair, I immediately stumbled backwards and landed on my butt, and banged my head.  My girlfriend came in and looked at me.  I quickly stood up and realized I had lost all sense of balance. (Severe ataxia)  my mouth was dry, but somehow I managed to walk up my stairs, and slowly crawl into bed.  I put my headphones on and timed myself to see how long I could stay awake.  I was unconsciounse in about 30 seconds.  My girlfriend took the data.   the most severe effect of the Valium was probably the total loss of balance.  \r\nI awoke 3 hours later to urinate.  I got up from bed, and again fell on the stereo, my girlfriend woke up and helped me up,  as soon as she let go, I fell on my desk.  Well, the next morning i did not have a hangover.  But, wow, 60mg of Valium will sure make me lose your balance. it's scary, but insightful.\n\n\n"
}
