{
 "title": "Smart Drug?",
 "author": "kajmal",
 "citation": "   kajmal. \"Smart Drug?: experience with Modafinil (Provigil) (ID 11860)\". Erowid.org. Jan 18, 2002. erowid.org/exp/11860",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11860",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2002",
   "Views: 37508",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was recently proscribed Provigil for AD/HD by my very progessive minded shrink to see if I reacted better to it than Adderall.</p><p>One 200mg tablet upon waking.  Effects felt within 30min. Very subtle mental alertness at first.  There was also a slight buzzing that defies all my previous experiences with the 'euphoria' side effect of other stimulants.  It was euphoria-like, but very distinctly NOT euphoria.  More like a floatiness.</p><p>I noticed other amphetamine-like side effects, but very subdued.  Things like jaw tension, which was less than a 'tension' and more like a jaw 'awareness'.  This awareness was felt throughout my entire face.  Listening to music, I found I could feel the music on my face.. like it was hyper sensitive to the vibrations.  I was alert.. very alert.  Bordering on paranoia.  I found that if I didn't have something to concentrate on, I was prone to drift from distraction to distraction, as if my ADD was made worse.</p><p>Reading was a treat, though.  Usually when I sit down to read I look up about once a minute, distracted by something around me.  I found that I was so intensly into what I was reading, I was able to tune the distractions out.  In this respect, it worked better than Adderall.  Though when I didn't have anything to focus on, my mind would race and loop even worse than normal.</p><p>Primary effects were felt for 12 hours.. and I had a lot of trouble getting to sleep.  A few shots of scotch were needed to calm me down.  I also noticed that I was very sensitive to the effects of alcohol and the 'buzzing' came back in full force after 2 shots.</p>"
}
