{
 "title": "Crinkled past the point of no return",
 "author": "HeWhoLives",
 "citation": "   HeWhoLives. \"Crinkled past the point of no return: experience with Salvia divinorum (10x extract) & Cannabis (ID 11874)\". Erowid.org. Apr 14, 2002. erowid.org/exp/11874",
 "substance": "Salvia divinorum (10x extract) & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "11874",
   "Male",
   " ",
   "Not Given",
   "Apr 14, 2002",
   "Views: 10209",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAfter about a year's respite from Salvia, I finally got up enough curiosity and courage to try it again. I think this trip sent me out the farthest I've been. I went over to a friends house in which I have tripped quite a few times. I intended to initiate him into Salvia and reacquaint myself with the substance.</p><p>He had a bong with a glass bowl so we put a weed plug in the bottom and filled it with 5X. He took 2 tokes and then handed it to me. It looked like there was still some in the bowl so I took a toke to kind of dip my toes in. I had a certain level of nervousness about this trip. The last major salvia experience I had was very frightening. I had to force myself to smoke a lower dose later so that I wouldnt end my salvia use with a bad experience. However, the memory of the scary experience was still in my mind.</p><p>Anyway, the hit I took turned out to be mostly the weed plug. This added a new unwanted dimension. I rarely smoke weed these days and am pretty sensitive to it as it is. I didnt want to be stoned going into my salvia experience but I figured there was nothing I could do about it now and I hadnt tried combining weed with Salvia yet. My friend didnt get much more than a body effect from the 5X. The weed was fast turning my nervousness into a mild paranoia but I loaded up the bowl with 10X for my own voyage anyway. </p><p>Immediately after smoking my 2nd hit I felt the familiar salvia prickles and pulling to the right. However, this time the momentum and feeling kept going and didnt stop where it usually would. This time it was like a giant hand reached down and completely crinkled my reality. I then became one of the crinkles in a world made of drab reddish-brownish-yellowish crosshatch crinkle patterns that were part of a giant wall. My family was also there and their faces were on one of the prongs of the crinkles which looked somewhat like swastikas painted by the swipes of an artist's paintbrush in the reddish-brownish-yellowish color. My family told in me in a matter of fact way that this is how the universe really is or would be for the rest of eternity.</p><p>It felt like my previous life had been an illusion or a trick. I had either died or smoking the salvia caused me to find out what is REALLY going on....which was a horribly bleak almost 2 dimensional universe that I was now trapped in. I remembered my vastly diverse and interesting normal life that I could never return too and I was in anguish that I could never return to it. The whole thing felt strongly familiar like I had existed there before my usual life or I had a dream of this before. I kept telling myself that I would soon come out as I always had but it was a serious struggle as that world seemed to have so much more reality than the one I usually occupy.</p><p>The weird thing though, was that my family's voices and messages seemed originate from myself like in a lucid dream. All my encounters with conversational beings in the salvia world have this tone of inauthenticity but at the same time the message seems so real. It's like I find myself in this weird dimension and then invent statements about the world that other entities tell me which support my fears or impressions of that world. </p><p>It also felt like my family and I were caught in this system of doing things in which we were prisoners. I could either fruitlessly struggle against the system or accept it. Yet accepting it meant doing vaguely demeaning and horrifying things or becoming a cog in the system (whatever this nebulous system was). </p><p>I opened my eyes to shake off the vision but found the salvia world starting to absorb the setting of the room. My friend was sitting perfectly still and I got the feeling that he was a lifeless husk. He served the purpose of supporting my illusion of my normal life and now whatever malevolent forces rule in the salvia had left his body like a piece of trash. I quickly closed my eyes because it is much more frightening to see your last foothold on sanityyour normal worldchanging into that other world. Its much more reassuring to me to know that behind my eyelids is a normal world that I can return to if I can just hold out long enough.  </p><p>After what seemed a half hour but was probably only about 5 minutes, I started to slide back to this world. As I came back to my usual consciousness, I felt my body and perception reintegrating. It felt like all the swastika crinkles were being ironed out and pieced back together into my usual sense of self. It took me a good 20 minutes to reintegrate and for an hour afterward I was shaking from the shock of the experience and the still present salvia energy. My mind felt very spacey and I was in a state of amazement during this hour. </p><p>I think I went the farthest out on this trip because my other trips usually entailed visions of places that somewhat resemble normal human life. However, these visions are covered with and made up of the crinkles. This time was the only time that the world was completely abstract and made up of only crinkles. Its like the previous experiences didnt twist or crinkle the world far enough.</p><p>No, this was not my first break through, but it was the strongest experience yet. I have only smoked Salvia and never tried the oral method. Ive gained effects once from the unfortified leaf alone but in conjunction with DXM (that report is already on Erowid). Ive experienced the salvia world 4 other times on 5 and 10X extracts. The terrifying experiences have been on 10X while the 5X merely produced extremely strange but non-transcendental experiences even when I did feel a female presence(The 10X experiences were also spiritually void as well. Come to think of it this last experience even lacked the female presence. It was like I had gone beyond such things although my family was still present which is a reoccurring theme for me on salvia). </p><p>The question of what the salvia experience means, represents, or is supposed to show us really bugged for about 48 hours after my experience. I wrote most of this report during that time period and then put it aside for awhile. Ive been reading a lot of the reports on Erowid as well parts of D. M. Turners Salvia book and am amazed at the similarities with my own trip as far as the reoccurring themes of salvia go.  </p><p>Some of the thoughts Ive been turning over in my head:</p><p>Is the salvia experience an experience of plant consciousness? Would being rooted to the ground seem almost 2 dimensional. Being a part of the crosshatch world was like being a part of a stucco wallalmost 2 dimensional but with just enough texture to make it 3 dimensional.</p><p>It was also very hard to move like I was rooted to the ground. Is the Salvia plant trying to show us how is to be a plant, harvested as food and made into inanimate objects? This could correspond to the feeling of being caught up in a system of which you have no control or merging with an inanimate object. Would the experience be different if I lovingly cultivated my salvia and established an ally relationship with it rather than buying it from a retailer who buys it from mass gardens?</p><p>Maybe this ordeal was affected by the weed and thus gave it a more abstract and paranoid dimension. I have, however, had one previous extremely frightening trip on just 10X though. </p><p>And whats up with the disassociative effects of Salvia? Its similarity to K and DXM??</p><p>The sense of familiarity or Deja vu could be merely connected to its dissociative effects but this sense nonetheless seems to make one think that the Salvia world is in some way connected to us. So how is it connected to us? Is the Salvia experience really a peek at the other side? </p><p>God, I hope that isnt how the afterlife really is. That is one way that merging with the world and other beings could be a truly horrible rather than ecstatic affair.  Or is it just some deep dark part of our own psyches? Why then do some people have consistently glowing spiritual experiences and some have consistently non-transcendental and ominous experiences?? Or, keeping with the plant theme, is the salvia experience some ancient evolutionary memory of plant life?</p><p>What does it all mean????</p><p>---HeWhoLives</p>"
}
