{
 "title": "The End",
 "author": "Suz25",
 "citation": "   Suz25. \"The End: experience with 2C-T-7 (ID 11873)\". Erowid.org. Aug 12, 2002. erowid.org/exp/11873",
 "substance": "2C-T-7",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11873",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 12, 2002",
   "Views: 13638",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nBeing from a small town, this was a new drug that only a couple of friends of mine had taken.  On a weekend in March 2001 after returning to college, a friend of mine offered me a capsule of 2ct7.  He stated, he had taken it a few days earlier and it was something to experience, but never wanted to try it again.  He explained to me what he felt and what it would do, hearing this I was eager try it.  The following weekend I decided to have some friends over to have a few beers and hang out.  Deciding that I would take this drug and be the only one on this was not a good idea. Wrong!  The capsule was in a small bag, that had been stepped on and crushed.  The capsule contained a good amount of powder with residue out side the bag.  Not thinking, I proceeded to take the powder contained in the capsule and snort it if my nose, and take the remaining powder left in the bag by mouth.  Within 5 seconds of snorting 2tc7, I was a instant trip.  </p><p>This experience is so hard to explain that words do not do it justice.  After the piercing burning in my nose left.  I became very disorientated and paranoid.  It was like floating on air when your on X, but knowing your tripping also.  I had never experienced what at this point was trolling.  It was good a great feeling. After, about 15 mins, this euphoria turned into hell.  After walking through the house disorienated, I soon became ill.  Barely making it to the bathroom to vomit.  After vomiting persisentaly for about 5 mins, I knew things were not right.  My body became limp, I could not move my arms and legs, my speech became sluggish.  My friend were coming into the bathroom, and checking on me.  I knew I was fucked up, but was trying to keep my cool, not to disturb them.  Since they were all sober.  I remember thinking that something was not right, and that I thought I should probably go to the hospital.  As my friends continued to check on my, I was becoming very paranoid.  I remember laying in the floor of the bathroom and my body temperature being stuck stuck.  I kinda reminded me of taking X, and your body temperature going from cold to hot.  This was different!  As this began to get worse, I asked one of my friends to call the friend who had given this to me.</p><p>He shortly arrived at my house, to me sitting in the bathroom floor, looking like a limp rag doll.  He proceeded to ask me what was going on. I stated to him that I had snorted it up my nose.  The expression on his face was like OH SHIT!  After this, he said you weren't supposed to do that.  He called the friend who had purchased this and was researching it.  AFter he arrived he began to ask me question like how much did u take, how long ago did u take it, what I was feeling at this point.  I was scared to death, at this point in my mind, I knew I had done something that I shouldn't of, and thinking I'm going to do. And what a miserable way to die that would be.  I told him slowly that I had vomited straigth unitl I could not do it anymore.  He then proceed to give me gatorade, to replenish the fluids in my system.  After sitting in that spot and drinking fluids I began to feel better.</p><p>After about 30 mins I was able to get up and move around slowly, after about 45 mins I was fine.  The after effects was like a weak trip.  In about 1 hour I was completely back to normal, and ready to go to bed.  This drug was so intense, that descriptions would not do it jusitce.  Emotions were high, and my thought process was changing every minute.  Visuals consisted of dots on the wall paper chasing each other, to things melting.  Some of my thoughts while on this drug were so intense that it felt real.  Like being in places that I had never been to before.  Especailly of thoughts of being  in the desert, and this loud humming noise, from power lines surrounding me.</p><p>My thoughts on this drug are I NEVER WANT TO DO IT AGAIN! Since taking this drug, I know longer do drugs.  It was to intense for me, especially being at the a point were I knew I was going to die.  I just thank GOD, that I had my friends around me when I took this, if not who knows where I would be now!</p>"
}
