{
 "title": "DiPT in Cuba",
 "author": "Jimmy",
 "citation": "   Jimmy. \"DiPT in Cuba: experience with DiPT (ID 1188)\". Erowid.org. Jul 18, 2000. erowid.org/exp/1188",
 "substance": "DiPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "DiPT",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1188",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 18, 2000",
   "Views: 24164",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was travelling, and in Havana when I decided to take the DIPT I had obtained about three weeks previous.  The DIPT was in a gelcap, so I popped it in my mouth, bit down on it and chased with a few good mouth fulls of water. Yuck! Bloody disgusting! It wasnt till about 45-60-mins after I ingested it that I noticed a definate tryptamine feeling.  A feeling I obviously couldn´t describe, but it was quite strong.  </p><p>I was wandering the streets enjoying the feeling when a thunder storm passed over. I was quite far from my hotel, but alas, a very nice man invited me into his work shop. He had a fellow worker who wanted to learn English and I proceeded to give him the alphabet and proper spelling of phrases he had tried to write down. This is when the voices of the two men, and my own became quite distorted and, mostly deep and bass like.  My hand writing was also very poor.  Havana in the rain is a very different place than when it´s sunny.  The children were sliding about on a slippery piece of sidewalk, the rain was pouring off the dilapidated roof tops.  It was beautiful, especially in the state I was in.  </p><p>I know this drug could be more psycedelic if the dosage was raised.  Because I felt that I was in a psychedelic state without the crazy visuals, just strange noises.  Although some slight visuals were noticed.  Overall it was great, and it is a drug I wish to try again at a higher dose. </p>"
}
