{
 "title": "Peace and Love of Pink Floyd",
 "author": "Stiggeracci",
 "citation": "Citation:   Stiggeracci. \"Peace and Love of Pink Floyd: experience with LSD, Cannabis & Nitrous Oxide (ID 11909)\". Erowid.org. May 5, 2007. erowid.org/exp/11909",
 "substance": "LSD, Cannabis & Nitrous Oxide",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:15",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:15",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 7:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 10:00",
   "5 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 10:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 11:15",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11909",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 5, 2007",
   "Views: 3356",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've known a few people who have done acid before, but I was a person who said 'it's not natural, it's a chemical, I won't do it.'  Understandable.  Then one day we all went to a rave and I saw how much fun they had while tripping on acid that I decided 'All right, I'll try it.  You guys do it, and I trust you, you're enjoying yourselves so I'll try it.' So that opportunity was August 2001.  A friend of mine had obtained some acid, called 'Pyramids', and one night we went to a party she was having.  At about 11 PM she shows it to us, and I say 'Hey, I'll try it.  First time.'  So I took one hit right off the bat, and gave the other hit to another friend.\r\nAt about 11:45 PM she says 'It's time.'  She turns on a light beaming at a disco ball, thus creating many moving lights on the wall.  I looked at it for a few minutes.  It was odd, this looks really cool.  Yet I don't get why.  Maybe if I stare some more I'll figure it out. At midnight I was looking at my friend who took the other hit.  He said 'That's mad cool. I don't get it.'  'That's just what I was thinking.'  It seemed really weird that we were thinking the same thing.  I was handed this little light thing we bought at Spencers, a little hand held light thing with 3 spinning lights.  I watched it spin, and it seemed wicked weird, yet cool at the same time.\r\nEventually at 12:15 something happened.  As I was watching the lights spin they suddenly formed black trails that followed them somewhat slowly.  I said out loud 'Holy shit that's awesome!'  I stopped the lights and the trails continue to spin until they disappeared gradually.  I would spin the lights again, the trails formed immediately, I stopped the lights and the trails continued for a bit again.'  I was so impressed I took another hit and we smoked some pot.  Every hit I took seemed to make the trip a little more intense.\r\nAt 1:00 AM we took a walk to my other friend's dorm.  There I smoked a lot of pot, and by 2:00 I was tripping ridiculously hard.  What happened in that hour was mindblowing.  When we got there I smoked a little pot.  By 1:15 I was sitting in a lounge room listening to techno.  For some reason I seemed to connect with the music, it made sense to listen to it.  It had a clarity I hadn't noticed before.  Then I started looking around the room.  The posters were absolutely unreal.  They glowed in the blacklights, and they had a level of depth I never saw.  Parts of them seemed to sink down into the wall, and bright colors seemed to appear somewhat off the poster, as if they were hovering above the poster.\r\nThere was a picture of a grim reaper, the skeleton holding the large blade wearing a black cloak.  It was so much fun to stare at that poster.  The skull seemed to shift positions every split second, and it was always staring at me.  It's hand was moving a little, as if it were waving the blade at me.  And his cloak was moving gracefully in some sort of breeze.  Just staring at the poster was enough, then I stared at the ceiling. It was a stucco ceiling, with those little bits of it that hang down from the ceiling.  All those little dots seemed to turn purlpe in the black light, and then every single one of them would start to flow in a direction away from me.  Some groups seemed to form shapes.\r\nBy 3:00 AM I had taken another hit of acid and then one of my friends took out some blue glowsticks on strings.  Hard trance techno was being played and he proceeded to give the best lightshow I had ever seen.  To this day I have seen few people that compare to his skills.  When it was going, the room was only lit by his glowsticks.  Everyone disappeared, so I only saw my buddy and his glowsticks.  And the glowsticks seemed to glow in a way I had never noticed before.  They were ultra-bright, yet fuzzy and I saw them in perfect clarity, like I saw just the light, not the plastic casing they were in.  I had a cigarette, a menthol marlboro light.  It was something I didn't expect, it tasted so ridiculously bad.  It was like sucking dry, hot, cardboard-flavored air, and I could feel the smoke moving across my teeth, and whenever I exhaled, I had to cough because it would loosen some phlegm in my throat.\r\nAt 4:00 AM I was really feeling the trip.  It all seemed to cumulate to this feeling I was having.  After listening to a lot of techno I felt this weird feeling that there was a war between people that prefer E to Acid, and vice versa.  My friends were talking about the differences between both drugs, and then I hadn't taken E yet.  But they gave enough information that I was going to prefer Acid.  We started watching the movie 'The Wall' and it seemed to be made for acid people.  Of course it was, but I hadn't seen it tripping before, it never seemed to make any sense.  Now I completely understood what it was all about.  Talking to my friends seemed so philosophical because it was really easy to relate to whatever they were talking about.\r\nBy 5:30 AM we were playing video games and smoking a bit, and I still couldn't have a cigarette because they tasted so bad.  The sun started coming up so we played some more techno and danced around like idiots with glowsticks, which was a lot of fun.  Then at about 6:00 AM he decides that it's time to show us the most mind-blowing thing in the world.  Obviously curious what he was talking about, so we opted to follow him.  Simple.  He takes us outside to the field behind his dorm.  I take another hit on the way.\r\nWalking outside to a beautiful warm sunny morning on a green grassy field with leafy trees and colorful flowers were like nothing I could have ever imagined.  It was breathless.  The different colored plants growing on the grass were not really there, I could only see a blanket of colors floating above the grass, that was moving in the breeze.  Every part of the world seemed to be boiling, because there were moving/boiling pockets of grass all over the field.  We talked about how nothing in life really matters right now because we're outside, on the grass, and there's nothing to bother us.  It seemed to true and deep, that anything we talk about is so true that we became philosophers.  While talking I was looking around looking at the trees and plants and the occasional squirrel, it dawned on me that I now understand what the hippies were talking about.\r\nWe sit there and I lie down because the hit I took a little while ago.  I look at my watch.  7:00 AM.  I look at my hand move and suddenly I look at the clouds.  They're not clouds anymore, they're layers of shades of gray and white clouds.  They seem so close I reach up to grab them and I see trails of my hand.  I have like 10 hands following my hand's motion.  I open my eyes wide, I have never seen anything so amazing in my life.  'Ooohhh myyy goood' is all I can say.  My friends out there with me look at me and laugh because I am bugging out at what I see.  I don't care, they don't see what I see.  I sit up and the trails go away, everything looks as it should, yet I see them in a clarity like I saw the glowsticks - true clarity, true beauty.  I look at my friends and they seem to have a different shape to them - hard to explain, except they look the same, yet different, I see them somewhat more as ovals.\r\nWe sit there a little longer and a spider jumps on my pant leg.  It scared me at first, but then I said 'Oh shit come here!' and pick up the spider.  I let it crawl around my hand a bit, and it seemed so mind-boggling that this is actually happening.  My friend said 'See?  You let it see that it has nothing to fear from you, so it just keeps crawling around, doing its thing.'  He was so right that I wanted to let this spider crawl around my hand as long as it wants.  I pass it around and we let it go.  It's 8:30 by now, so we go inside and use the facilities.\r\nAt 9:00 we were chilling in his dorm, and he says 'Hey, wanna do some whippets?'  'Yeah!'  I had never done them before so trying them sounded like a good thing.  So we went to get some.  We got 2-10 packs.  We got back to his dorm, and he showed me how to make one.  I did my first cartridge, at first I didn't feel anything. but then all of a sudden it hit me.  I was looking at my friend's face, and when it hit me, all of a sudden I zoomed in on his left eye.  I saw nothing but his left eye.  After a second or two (which seemed like minutes) I seemed to zoom out...things started coming into view.  Only everything was looking very lo-res.  Like a low quality computer image, very blocky.  Then when things started coming back into view, they did line by line.  I thought that I had been sucked into a computer, because everything looked very blocky and the sounds I was hearing sounded very computer-generated, and had a weird electronic echo.  I was convinced that somehow I was sucked into a computer.\r\nEventually it wore off, which was like 30 seconds but felt like 5 minutes, and I did a few more, and then we stopped.  By now it was 10:00 and I remembered that I have class in 30 minutes.  I was actually psyched to go to class because it was religion, it sounded like a fun idea.  Somehow 45 minutes passed, I don't remember much of what happened except that we were listening to techno in the background, and I missed class.  I was somewhat bummed but had a smile on my face.  So I went back to my dorm room and my roommate and a friend were there.  I looked at myself in the mirror.  Wow.  Don't ever look at yourself in the mirror, seeing yourself tripping face is weird.  Every contour of your face moves in its own way, and any type of hair on your body grows at an alarming rate, yet disappears at the tip.  Dilated pupils are funny to look at tho.\r\nSo from 11:45, for some reason, I was tripping all day.  It never wore off completely, I kept having a slight trip until about 9:00.  I took one more hit then when I decided to go over to a friend's place.  I left at about 9:30 and it kicked in at about 9:45.  We go to another friend's house, and I was tripping very hard.  On the way we were listening to some rap, and I noticed that I was tripping so hard that some parts of the song seemed unrecognizable, like people singing in the background sounded like they were singing mumbles.  We got there and I meet some new people.  I smoke and sit down, and started playing card games.  Then we were all talking about stuff to do while high, so we put on a live Dave Matthews Tape one of the people there had.  For some reason it sounded cooler than I had ever imagined.  A live Dave Matthews set is fun to listen to when you're tripping, you feel as if you're there.  So at about 10:15 we go to smoke some pot, and I go to my friend's house.  Nobody was there so we go to the basement and shoot some pool.\r\nShooting pool is very hard when you're tripping.  The balls seem to pulsate and move around a bit when they're just sitting there.  Linging up shots is impossible but a lot of fun to try.  Then my friend puts on some Pink Floyd.  Wow.  That's all I have to say.  Wow.  I finally understand what Pink Floyd was all about.  I've listened to them since I was 11, and they were great.  When I got high it was even better.  But when I was tripping face, that's it.  I finally understood what Pink Floyd was all about.  Acid really is the Gateway to Understanding.  I finally understood what they were doing.  So we hang out, smoke a few cigarettes and eat some chips, and around 11 PM we leave.\r\nWhen I get back I put on more Pink Floyd and use a visualization Plug-Ins for winamp, called AcidSpunk, which coincidentally I had downloaded earlier in the day, around 2 PM.  Watching play and listening to Pink Floyd became the single most mindboggling experience I had ever had in my life.  6 months ago and I still say it was the best time of my life.  Eventually my roommate got back, and we smoked a little and listened to more tunes.  Eventually I passed out, about 2AM.  I was tripping face for a total of 26 hours and I only had 5 hits of acid.\n\n\n"
}