{
 "title": "A Beautiful and Terrible Universe",
 "author": "kundalini",
 "citation": "   kundalini. \"A Beautiful and Terrible Universe: experience with Salvia divinorum (ID 11919)\". Erowid.org. Oct 29, 2004. erowid.org/exp/11919",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "0.75 g",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 11919",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 29, 2004",
   "Views: 12977",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI was interested in Salvia. I'd seen the name before, but considered it yet another in a cornucopia of substances that have come to light since I began various excursions, experimentations and indulgences. My first impressions were of a cannibis-equivalent to Herbal X - what a misconception! Any descriptions I give regarding my girlfriend are my external observation, and some of her immediate description.<br>Upon reading more experiences, it intrigued me more and more. While I enjoy certain things of a more party/fun oriented nature, this appealled to the part of me that seeks something more substantial than merely a fun night.<br>I ordered from an online store, and it took about 9 days to arrive. I ordered 'The Salvia Lover's Classic' (which sounds a bit presumptious of me, I suppose): 36.00 USD : 7 grams (1/4 oz) of high-potency Salvia leaves, 4 grams of 5X Salvia extract. My girlfriend and I spent some fun time with friends earlier in the evening, then went to a waterpipe shop and finally decided on a nice one that is about 2.5 feet long, blue acrylic pipe[1] with a blown glass bowl.[2] , turned off the phone, etc. While many experiences seemed to recommend silence, I tend to like music in any context, so I brought some low key material. <br>We divided the Salvia leaves into roughly sevenths - I know some would balk at this treatment, but the scales available were extremely expensive. I'll probably get a cooking scale before too long. We decided to re-package 5/7 and keep 2/7 to use this evening - but not anticipating using it all. No plans to use the extract this night.<br>We turned off all the lights, lit candles and I put on Global Communication. A bowl was loaded, and I sat on the floor, and pillows were all around me.<br>One draw[3] on the pipe...felt a little floaty, but this could have been the outright smoke/O2 deprivation.<br>Two draws...definite floating sensation, sound distorts as if a bubble suddenly appeared around my head.<br>One more draw...pause for effect...the bubble-feeling increased dramatically, I gestured for her to turn off the remaining light, then fell backwards into the pillows - sound was still sliding across the bubble around my head, and I got the distinct impression that something was moving across my face - no, then I realized it was my face moving through something, like curtains. When I opened my eyes, I could see clear panels of some sort, as if there were rows of material hanging in front of me. My face was moving through them while pushing them aside. I realized immediately that I was pushing through the very substance of the Universe. I know in a strictly scientific sense, of course this is what we do when our face moves through air, etc. - but this was a more basic sense: like the æther[4] of medieval science, the base element of existence, or Akasha. The bubble had become charged much like the legendary ether, and I tingled all over.<br>I saw Brahma in front of me, yes, just like the paintings - infinite faces/masks spread into eternity. One of these faces became my girlfriend and moved through the succession to the left - not as if moving in a straight line, but her face went down the row of faces, replacing each as it moved. (I later figured out she was moving around me to put down another pillow for me).<br>Brahma disappeared or faded, but more curtains of the universe...til they faded...I sensed loss, but not a desperate one like when the effects of Love's Secret Domain are slipping away, just a realization I was arising from this state. I sat upright and said 'Whoa. Oh my god.' for a while. I still felt as if I was surrounded by a bubble of air. This feeling persisted throughout the night. The music was definitely a part of this experience, but I can't define how. Especially after coming down from the peak, I felt aware, alert and...hm, how to say it...wise. This may very well be like when I drink alcohol and think I'm charming, but this was peaceful and not embarrassing.<br>For her experience, same set up. I put on Robert Rich's Seven Veils. She took one, two, three draws. Unfortunately, she began to cough during the second, which ended up hurting her throughout the evening and therefore seemingly detracted from her enjoyment. She began laughing mere seconds after taking the third draw, laughing wildly, but not frighteningly. She seemed to be sincerely happy. She rolled her head around as if warming up, then laughed some more, running her hands through her hair. She then laid back and laughed some more, then rolled back and forth on the ground. She mumbled something about elephants and gestured in a random direction. (Yes, she distinctly said 'elephants') She then fell back and rolled around some more. After a couple minutes, she crawled to the CD player and changed the track - said a few more things about elephants and snakes. She gestured as if trying to explain snakes to me, but it was mostly incoherent. After a bit more rolling around, she sat up, wide-eyed. She explained that the music was annoying to her, her mind called it 'cliched' and that it was giving her not-unpleasant images of snakes and elephants, which were not threatening, but just seemed 'cliche' and 'cheesy.'<br>I decided to take another go. Another bowl loaded. I put Global Communication back on.<br>One draw...lightheaded...two draws...bubble is back...three, felt as if I was hovering 3 feet off the ground...saw a little left in the bowl, so took a fourth...I suddenly felt as if my exhaling the smoke back into the pipe caused the water to erupt, hitting me in the face, and the pressure pushed me onto my back. INSTANTLY - I was in a village. I had a very distinct sense that I've lived here all my life, and the primary trade was making rice-paper fans. I lived here with my family. I was in the market, and all I could see were rice-paper fans of all colours, shapes and sizes surrounding me. Others were near, but no one could be seen or directly heard. I suddenly felt a threat -- something had arisen from the shapes and patterns of the fans hanging across the market square from me...it seemed like a dragon or foo-dog. It was coming towards me, and I knew it was here to ruin our trade and destroy my family, so I started hissing at it. My mouth felt watery...hisssssssssssssssssssss....it seemed to hold it back (it was probably confused). <br>I was still hissing and the fans began to give way...twirling away in a pattern til I could see the room again, no more thoughts of dragons or fans or the village where I lived. I could see...someone...with a light for a head, looking at me, and fixing something on a table, back and forth. Excuse the reference, but it reminded me of one of those scary androids from Herbie Hancock's 'Rocket' video. But it came clearer: it was my girlfriend, watching me and packing another bowl. Oh...and I was hissing this whole time. Til I sat up, then I just repeated OH MY GOD over and over...'That was amazing!' - she tried to elicit my experience, but I had to hold off until the absolute stunned expression wore itself off my face - I had to laugh loudly for a while as well.<br>I explained a bit to her, then prepared her for her next experience. I gave her an 'inhaling basics' statement again, just to hopefully help her avoid burning her lungs again. She took 1...2...3.. draws, and said she felt nothing. I repacked the bowl, about half-full, and sprinkled a little of the 5x extract on it...I have no idea if this made any difference.<br>She took 2 more draws, paused, one more...and began swaying. She then laughed some more, stroked her own face and fell over onto the pillows. She rolled around a bit, sat up, said very clearly that she thought she recognized the song that was on, then fell over again and rolled around. I rubbed her stomach after a bit. After she was obviously off the peak, she explained that this felt physically as she had expected MDMA to feel, but without the urge to bounce around or dance. A little later on, she said she felt more annoyance at the music, but not the idea of music - just the beats and specifics of the music we used, so suggested perhaps some non-beat-driven ambient next time. She also reported experiencing a little fear while we were in bed later.<br>Overall - wow, hard to describe. She asked if it was similar to my experiences with Ell-Ess-Dee, but while there were similarities, it was significantly different. It seems that the main points of each experience actually lasted about 10-15 minutes each, but as mentioned earlier, I kept the bubble sensation all night afterwards (2 hours +/-) and after the peak, another 10 minutes or so of recovery and gaping in amazement. At no point did my senses feel dulled, although we both lost some (physical) balance in the post-peak recovery.<br>I woke up with a slight headache, but it wasn't even enough to merit aspirin. We were both tired the next day, but I'm not convinced it had to do with the Salvia.<br>In summary: yes, as many others have said, this is not a party drug. At no point did I feel like dancing, or even touching much. I definitely felt isolated during the peaks, but not necessarily in a bad way. Light was bad - not painful, but I just wanted as little as possible. Music was part of the experience, but even for our low-key selections, it ranged from annoying to simply part of the background. I definitely intend to dance with the Lady Salvia again, and I have a different sort of respect than I do for any other substance - which almost sounds cliche in light of other reviews of the experience, but that's the closest I can say. It's unlike anything I've ever done - and won't replace other types of voyages, but has its own place now.<br>Thanks for reading,<br>Kundalini.<br>1) Since it's our first water-pipe, we decided to not overdo it on the money, in case we found little use for it. I've never been one much for cannabis, and she's a relatively new voyager.<br>2) The place is co-owned and shares the space with a large local porn store, which was amusing in itself. Kinda scary, too.<br>3) 'Draws' - long pull on pipe, holding in for as close to 30 seconds as I could figure. The bowl looked to hold about 1/4 of a gram, tightly packed.<br>4) The element believed in ancient and medieval civilizations to fill all space above the sphere of the moon and to compose the stars and planets. (dictionary.com, def. 4) -- ALSO OF NOTE: <br>aether n 1: personification of the sky or upper air breathed by the Olympians; son of Erebus and Night or of Chaos and Darkness 2: a medium that was once supposed to fill all space and to support the propagation of electromagnetic waves . (emphasis mine)\n\n\n"
}
