{
 "title": "Dreaming with Open Eyes",
 "author": "P",
 "citation": "   P. \"Dreaming with Open Eyes: experience with Salvia divinorum (ID 11913)\". Erowid.org. Nov 5, 2003. erowid.org/exp/11913",
 "substance": "Salvia divinorum",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2002",
   "11913",
   "Male",
   " ",
   "Not Given",
   "Nov 5, 2003",
   "Views: 5472",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I tried salvia I felt like I was looking through a sort of different dimension.  I tried to talk but said stupid stuff instead of what I was really trying to say.  I looked at my friend and started laughing uncontrollably for about.  I kept trying to figure out what it was that my friend said, but couldn't.  I got no visuals and my friend never said a joke.  I only thought that he said something funny.</p><p>The next time I tripped much differently.  I was getting a lot of body feelings and I was looking straight ahead.  When I turned to look at my friend, he seemed to be sitting in a whole different angle, so I looked away.  Everything looked normal except the angle my friend was sitting in, but my mind started tripping.  It was like a dream that seems real but is not.  I felt that I was on a dirt trail with a fence running along it.  This would be on a farm.  I felt that my mother or somebody was telling me to do some kind of work near this fence, but I didn't know what.  I looked at my friend and got frustrated because he wasn't helping me.  Then the music got to me.  The guy rapping was saying all kinds of words that didn't make any sense.  That irritated me, so I told my friend to turn it off, but he didn't because he liked it.  I then came out of the trip.  The whole time I was only thinking all of this, not seeing it, and it only lasted a few minutes.</p><p>After the trip ends, a feeling of being very high lingered on.  I tried breathing in and out very slowly and deeply and found that that caused me to feel very relaxed and get more body feelings.</p>"
}
