{
 "title": "Mild and Promising",
 "author": "Bricoleur",
 "citation": "Citation:   Bricoleur. \"Mild and Promising: experience with 4-Acetoxy-DET (ID 11976)\". Erowid.org. Aug 9, 2002. erowid.org/exp/11976",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "4-Acetoxy-DET",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 11976",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 9, 2002",
   "Views: 11390",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nSET: I am coming into he last 2 months of my audio engineering course. As a result I am required to shift more stress and anxiety; other than this I am in good running order. \r\nSETTING: Early evening at my flat. Last food approximately 4.5 hours prior (fruit salad). Last drug  cannabis previous evening. Other than this nothing inside of a week. \r\n10mg of 4-AcO-DET freebase was loaded into a glass DMT pipe. Freebase was a dark grey powder. \r\n+:00 I take 5 large lung-fulls of before I am satisfied that no chemical remains. Smoke is actually easy to smoke and not harsh on throat or lungs (I am surprised).\r\nAfter the 3rd toke the first effects are felt. Very similar to the first .5 seconds of 5-MeO-DMT. \r\nSweaty hands\r\nColours are more vibrant. \r\n+:10  No mental gymnastics at this point but I can see the veins through my hands. Body is feeling fine  no complaints. Lungs feel expanded. \r\n+:15  No progression of visual or mental effects. Upon standing I have a sense of feeling taller.\r\nI do not feel restless.\r\nOEVs are expanded, no morphing or dripping. Colours are vibrant.\r\nCEVs are no more lucid or intricate than when I am sober. \r\n+:30  Notice clenched jaw + tightness in stomach.\r\nStill no mental gymnastics, although I am starting to peak. \r\n+:45  Increase in sexual awareness  I now know what Ill be doing next time with this chemical. \r\n+1:00  Definitely passed my peak. Decide to go for a walk. Phone rings, talking no problem. \r\n+1:10  Go for a walk. \r\n+1:25  Back from the walk. Too cold and navigating London traffic (even as a pedestrian) is too scary.\r\nEffects have diminished considerably. \r\n+1:45  Just got off the phone talking to a mate about the trip. Post trip synopsis  nearly baseline now. \r\nREFLECTION:\r\nThis is a strange experience. I was expecting an increase in associations, to generate new perspectives. I think this is a dosage reliant effect.\r\nVisuals were not the typical bending/morphing variety. No form constants like lattice, filigree, tunnel, spiral, etc.\r\nMy visual field seemed expanded or as if I were viewing the world through a fish eye lens. This is a commonly noted effect of 4-AcO-DET.\n\n\n"
}