{
 "title": "Blessed Art Thou Who Arrange the Molecule",
 "author": "HappyCamper",
 "citation": "   HappyCamper. \"Blessed Art Thou Who Arrange the Molecule: experience with 2CB, GHB & Cannabis (ID 11999)\". Erowid.org. Jan 30, 2004. erowid.org/exp/11999",
 "substance": "2CB, GHB & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-B",
   "(powder / crystals)",
   "  T+ 2:30",
   "5.0 mg",
   "oral",
   "2C-B",
   "(powder / crystals)",
   " ",
   "  repeated",
   "oral",
   "GHB",
   "(liquid)",
   " ",
   "5 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "Tobacco",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 11999",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 30, 2004",
   "Views: 10114",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFlashback: I marry the most beautiful woman in the world...open-hearted, generous, and sexy...\r\nLast Night: A friend has kindly traded us - we've recieved 9 clear capsules with a tiny bit of white powder in each (2cb).  Take four, he says he's been told. After research, I'm assuming these are 5mg's, satisfying the fiending part of my ego that I've enough for a solid first trip with 'the bees'.  In addition, I read G and herb mix well..both are allies and will be used.\r\nAfter some 'discussion' as to whether to ingest that evening (there has been some recent illness, fatigue, and stress) we subtly agree that we create our experience and to stop fearing.  \r\n5:00pm  Open four capsules under my tounge, three under my partner's  (following a light lunch 6 hours prior).  Bitter, but not bad, likely due to the tiny amounts involved. We swallow the mostly empty caps.  Cheers. A cap of GHB (which has been exactly enough for a plesant buzz on an empty stomach from this batch).  We're off for a walk to the grocery for crytallized ginger - something about possible GI issues - and for something to do while we come on (already cleaned the house!)\r\n5:20 A little buzzy in the tea isle mildly anxious.  On the walk home, time lapses begin - I see the corner a hundred yards up...suddenly I'm there - interesting.\r\n5:50 Home.  We decide tobacco would be nice to mix in a joint.  Not really smokers, there's none in the house.  Solo back in the car to the liquor store - yeah, not the wisest.  Driving the 1/3 mile was easy with a bit of concentration.  Standing in line while some sorority sisters buy an unfathomable amount of vodka was a challenge.  Easy to keep the lid on, but I keep thinking 'I'm tripping balls...'.  The early rumblings of many a phychedelic are familiar...yet without loss of ego - no fear to speak of.\r\n6:15 Home.  Recently redecorated a room purely for solace...we retire there and put on some beautiful spiritual music (Om Shanti, she chants) my partner is fond of.  It fits right in and I'm quite appreciative of the melodies...this disk spins for the next 3 hours with only the occasional 'we just heard this' observation; no desire to find other tunes.  Feeling and visualizing very psilocybin, without, again, any ego challenge.  A few pieces of ginger here and there keep the stomach at bay - when the opportunity again arises, there will be a significant fast. Another cap of G, and, after being a bit concerned it might be overwhelming, a few hits of herb.  It's not.  It's great, in fact. Just play, and the play continues to grow.  \r\n7:00 Giggling and realizing and saying 'I create, I create, don't forget!, I create...'  The room is a sparkling enchanted forest, like fireflies in every direction.  The colors are brilliant, and the lights keep going up and down and up and down - alive. I am a biological entity who creates a perception into this universe and am very thrilled to be here.  Heaven.  My parter and I are understanding this together; speaking without talking; talking joyfully - and effectively able to discuss those moments when, out of unconcious patterns, we unwilling twist the flow.  An 'issue' is a hard-wired circuit in the gray matter that automatically ellicits a response to a given situation that does not produce the currently desired result.  We can work with that!\r\n7:30+ Time is lost.  A little more G and herb.  The cigarrettes are pretty disgusting - not like on MDMA at all.  No fiending; no smoking out of duress (sometimes on LSD or fungi).  The nicotine buzz is almost not pleasureable at all.  The room is a feast of sparkling color - everything is moving, flowing, lovely; my partner smiles and is unimagineablly beautiful.  Occasionally there is self-doubt, and it manifests until I recall that I CREATE.  Oh yeah!  This is incredibly friggin' fun...and it's back.  I'd read the trip reports about 2cb taking you where you lead, and it's no doubt the case.  Not unnaturally happy; happy when I choose/allow.  Brillant. Consume the last 5mg each.\r\nPee break...she's first.  I'm standing in the dark living room alone, stretching my shoulders between the kitchen doorway - my heart opens.  An old friend is sitting in our chair...Rastafari...I hear breath and am the tiniest bit afraid, new to such otherworldliness.  I have not seen spirits before, or at least not recognized them. We say hello; right on. All is well.\r\nMuch bodywork over the evening...both of us have some demons.  I can move energy so easily and we both feel it...hands off, healing.  Amazing, she says.\r\nLater...The play continues for hours, much longer than I expect. Nice.  I don't NEED it to go on, but appreciate that it does. We make love, and it's wonderful. To the sounds of an elfin princess singing '...love some, weep some, dance for joy...'  Play again!\r\nTired now, not unpleasantly so...trying to have enough G for solid sleep, but it really doesn't seem to have an effect.  Sleep comes, and it's nice too...\r\nNext Morning:  Rested well.  8 hours. No residual fatigue.  The message is intact - I create.  This is a fantastic chemical; choose for it to take you somewhere and it will.  Easy on the body and enlightening for the mind.  I fondly look forward to my next immersion.  Eat little, or none at all.  Choose your setting well. It plays again...'love some, weep some, dance for joy!'\r\nNamaste\n\n\n"
}
