{
 "title": "Beauty and Peace",
 "author": "DKMB",
 "citation": "   DKMB. \"Beauty and Peace: experience with LSD & Ecstasy (ID 120)\". Erowid.org. Mar 5, 2001. erowid.org/exp/120",
 "substance": "LSD & Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 5:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1999",
   "120",
   "Not Specified",
   " ",
   "Not Given",
   "Mar 5, 2001",
   "Views: 9164",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Me and my boyfriend had decided to candyflip for our first time on new years eve, 1999. We were going drug free for awhile as our new year resolutions, and we wanted to end it all with something new. We were headed for a party a couple hours away, and when we were about halfway there, I took my first tab of acid. When I started to trip lightly, I took another tab. About 20 minutes later, we arrived at the party, expecting a long line, but got in right away. We socialized for awhile, and at this point I was beginning to feel my trip, not an unusual feeling. We then found a friend and bought two and a half pills to split between the two of us.</p><p>We went out on the gigantic dancefloor and sat down (not something usual for me to do, but there was more than enough room), the lighting was scarce and not very thrilling, but there was a big projection screen with some nice visuals. I got up and danced for awhile, then at around 6 or 7, I took my half of the first pill. It didn't take long to hit, maybe 20 minutes at the most, but that's not long for me. I wasn't feeling amazingly social yet, but something about everyone looked different somehow. People's smiles beamed into my soul, anyone who smiled in my direction was instantly connected to me. As the E got stronger in me, the lights grew these amazing rainbow halos, much more brilliant than anything I'd ever seen on just acid. After awhile, anything light colored, people's shirts, faces, etc., grew the same halos. </p><p>The same feelings continued, along with some mild body effects of the roll, but nothing that jumped out at me. It was as if the body effects were diminished by the total feeling of love and empathy for people. But, the acid, like a normal trip, made me realize that not everyone was my friend, there were some sketchy people there, and I didn't have the same feelings for them as I would if I were just rolling. I also didn't get that sloppy, e-tarded way about me, I was well composed, but very social and loving. </p><p>I wanted to be connected with everyone, not in that E kind of way, but in a serious kind of way, like I'd never felt before. I got more phone numbers than I ever thought possible. I felt confident and beautiful as a person, not insecure as I sometimes do while tripping, nor did I forget I existed as I sometimes do while rolling. It was the perfect mix. I'd heard some stories of people being overwhelmed while Candyflipping, and they kinda played through in my head, I couldn't imagine why. </p><p>At about 11:30 I took my second pill. It hit right before the countdown to the new year, nothing could have been more beautiful. When the countdown was over, there was this electricity in the air that I hadn't felt at parties in years. There was love and understanding from everyone, between the party kids and the club kids, between young and old, gay and straight, between all races...you don't see enough of that anymore, and it was beautiful. The perfect setting for this new experience. I lost my boyfriend in the crowd a few minutes later, and I took this opportunity to hug everyone I could.</p><p>The love stuck with me for the rest of the night, and the comedown was the easiest I'd felt in a long time. The afterglow lasted for days after. I couldn't erase the smile from my face. I was never hit was the lows I usually get after rolling, nor the dis-attachment I usually feel after tripping. I really do think that, for the right person, this is the ultimate drug combination, and one that I am sure to do again in the future when I am ready to do drugs again. Right now, I am drug free. This experience definitely helped put some closure on my new year resolution.</p>"
}
