{
 "title": "Longer Than Ever Before",
 "author": "Vido",
 "citation": " Vido. \"Longer Than Ever Before: experience with Canabis & Salvia divinorium (extract) (ID 12004)\". Erowid.org. Oct 27, 2004. erowid.org/exp/12004",
 "substance": "Canabis & Salvia divinorium (extract)",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Salvia divinorum",
   "(plant material)",
   "",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12004",
   "Male",
   "",
   "Not Given",
   "Oct 27, 2004",
   "4927",
   " "
  ]
 ],
 "report": "<p>Last friday night we headed off to a party an hours drive from our home town.  Once there we decided not to drop any sleep-reducing substances as we were planning on sleeping that night (the party went all weekend).  About 10pm I decided to roll a joint and my girlfriend decided not to have any, so I had the whole thing.  Feeling very stoned but still thinking fairly clearly, after an hour or so, I decided to try Salvia which I had with me in a bag.  The feelings hit me in the normal (I have had it about 6 times previously but only at home) way and the trip was very intense.  Every sound, light and person around me became an input to the trip and the number of visuals and sensory alterations that occured was un-imaginable.  I saw the crowd of dancers infront of me as a solid mass moving in a wave.</p><p>A lot of what happened I dont remember and the trip lasted (in full strength) at least 30 minutes.  This is much longer than I have ever heard from such a combination.  I was frequently being asked if I was OK by my girlfriend as I was moaning and screaming in various pitches to the music and adding vibrating sounds in my own head.  These sounds were like singing to myself but came out like wimpers and groans. </p><p>I put my arms out to form a circle in front of me and saw a tube like tunnel forming, similar to an enclosed waterslide, I began flowing through it until I saw a tight left hand bend from above and the tube stopped and turned into a wire frame model of a left hand tube bend!  At this point I decided to lay down on advice from my Girlfriend and look at the stars above us.  The party was in a valley with a large open area (for horse riding) where the stages and camping were, thus the surrounding area was hills of trees in the Australian bush.  Upon looking up at the stars I realised that I could lift the nights sky upwards like a piece of a wooden jigsaw, an effect I have often seen on salvia trips especially when looking at peoples faces.  I then realised that I could actually control the trip.  Again something I have been unable to do previously.  I put my hands out to the sides lining them up with the tops of the trees on the hills beside us and lifted myself off into the nights sky.  </p><p>Mind you it was not too faroff but just enough to be above the whole site.  I then saw the site as being the entire world (similar to the city in Dark City), after a while (30 minutes or so) the trips effects began to reduce, but were still there like the very begining of a normal salvia trip.  I was able to put my hands through solid objects like my bag and legs and was able to do so for the next 20 or so minutes.  I then was told by my Girlfriend that we needed to get water so I got up with her very slowly, and walked from the back of the dance floor to the front.  When I was at the front I looked back and saw were we were before and realised that I had seemingly teleported from the back of the dancefloor to the front.  I felt that I had only thought about the journey from the back to the front and not actually participated in it.  Over the next day I still felt the signs of Salvia in me, particually the feeling of melting into objects etc, especially when moving my arms on my legs when sitting down in a tent etc.</p><p>This was by far the most intense trip I have every encountered (and I have had a 24 hour trip on 1/2 a tab of acid), and I would not recommend participating in the salvia experience at a party to anyone who has not tried the 5x strength beforehand and known what to expect.  The effects were extremely hightened yet were controllable only due to my previous useage and knowledge. I would only recommend salvia to people in an environment they are comfortable with, and always use a sitter.</p>"
}
