{
 "title": "Three Trippers at High Doses",
 "author": "moniker",
 "citation": "   moniker. \"Three Trippers at High Doses: experience with 5-MeO-DiPT (ID 12067)\". Erowid.org. Jan 8, 2004. erowid.org/exp/12067",
 "substance": "5-MeO-DiPT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "26 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 12067",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 8, 2004",
   "Views: 15232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had these capsules in my possession for several weeks now, and I decided to take one of them with my girlfriend (about 125lbs) and a mutual good friend of ours (about 140lbs). Both had much more experience with hallucinogens than I, and my girlfriend had even taken it the previous night (with a different reaction each night). I picked both of them up in my car and we gathered some warm clothing, in case we decided to go for some late night winter walks, and also some cannabis, for during or after the trip. (They chose to smoke it after, I chose not to at all.) We also arranged for a safe house to trip at, with two more (sober) friends. On the way over to the house, my girlfriend and friend took their pills (26mg each) and I took mine 30 minutes later after arriving at the house. Approximate time was 5pm. </p><p>At about 5:45 I had started to trip quite hard. The other two were still working on theirs, but within 20 minutes, they began to trip very hard as well. They both reported some stomach discomfort, and I had none.</p><p>By 6pm it was the most intense trip I had ever experienced. I felt as if one wrong thing could push me into insanity, as if I were looking through the mail slot in the doorway of my entire being. I began to get somewhat frightened with the thoughts I was having about the possibility of it getting too intense. So I went outside to ground myself and have a cigarette. It is now about 6:30. While Im outside I got the glorious idea to go on a walk. I ran inside to get my scarf and ran back outside. By the time I had gotten to the end of the alley I had talked to myself a little and come to the conclusion that I will most likely get lost if I stray more than 30 feet from the door. So I turned around and went back to the porch and had another cigarette. Now the entire ground was shifting into different fractals. They looked like ice crystals, I searched for a 'ground zero' for the origin of these, but I did not find it. The snow in the cracks of the sidewalks also began bubbling, as if they were a baking soda volcano, like the ones I made in grade school. The corner of the roof over the porch was bending down this was the extreme peak of my trip. </p><p>I tried to describe what I was seeing to my girlfriend, she told me that no matter how hard I tried to describe it, it wouldn't be adequate, so we both shut up and watched the world shift and bend. My friend comes outside and begins to talk to us; we discuss the inner workings of our brains, and wonder what our sober friends inside are thinking about us. We tried to discuss how our trips were similar so far, but soon stopped because conversation was difficult to manage. And voices and noises all had an echo to them. We go back inside and watch. Everything. The walls, the lights, the TV, hands, feet, anything and everything was interesting. I could look at my hand and see the different layers of my body. I could see my skin, underneath that were my nerves and then my blood vessels, under that I could see my muscles and bones. All of this just by staring at my hand (another friend later reported this happened to her too.) Also I saw red, orange and black skeletons of everything. Skeletons of fire. The shingles on the outside of the house had their own skeletons of fire. The red door on the house would change shades, and design on the outside of the door changed into otherworldly designs.</p><p>Its now about 7:15pm and my girlfriend and I go out to share a smoke. She tells me she almost can't handle this. I assure her she can and its just the drugs and shes going to be fine. Soon enough she goes into a really bad trip. She was so far gone into her mind the only words she would say were yes! And No! (Also when she looked at me and said No! it felt as if every ounce of her being and soul were telling me so.) I spent most of the remaining 3.5 hours of my trip with her trying to comfort her. For a good hour (until about 8:45 or so) she did nothing but say yes and no, and leap up from once place, only to switch rooms and crash onto a bed, floor, or sofa. I managed to tone my trip down by now to try to comfort her. I don't think our gracious sober hosts would have liked to a have two people freaking out.</p><p>By now (about 8:20) I feel I have my trip under complete control and if I chose, I could make it more intense or less intense. I did my best to lessen my trip so as to comfort my partner. Seeing her go through what she went through and being there with her was amazingly powerful. Sometimes she looked and me straight in the eyes and said with her entire being 'DON'T LEAVE ME!' with fear all the way into her soul. I felt closer to her after the experience. I realized how well I really know her. Some of the things she was saying (that was probably nonsense to everyone else) I knew what she was talking about.  By now I had almost stopped my trip. That was how in control I was at the time. I had stopped my trip to calm her down. She was tripping for another 2 hours. And the other friend was tripping for about the same. My trip still continued, I somehow managed to ignore it. Ive never been able to force myself to sober up like I did that night. Later we talked about her trip and came to the conclusion that she had somehow taken a slightly higher dose than the rest of us. The person we got it from was eyeballing the doses, because his scale had broken. We estimate she had somewhere from 27-30mg.</p><p>10:30. Finally my girlfriend has calmed down enough for me to talk coherently with her. I have stopped tripping completely, and the other two have some residual effects. </p><p>The next day my thought pattern was a little odd. And I was feeling somewhat spacey, but as soon as I got a little exercise that went away and I was feeling fine.</p><p>Some of the things I remember my girlfriend saying were Im incubating, I am beautiful, I am good, I am bad, am I evil?, I exist? I do not exist, drugs, just drugs. She said other things as well, but these were all repeated throughout her experience. </p><p>Higher doses of 5-MeO-DiPT are very intense. I would not recommend a high dose to anyone who has a history of anxiety, or other panic disorders. First time trippers beware of this.</p>"
}
