{
 "title": "Rollercoaster Ride",
 "author": "Muppet",
 "citation": "   Muppet. \"Rollercoaster Ride: experience with Methamphetamine (ID 12070)\". Erowid.org. Dec 29, 2004. erowid.org/exp/12070",
 "substance": "Methamphetamine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12070",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 29, 2004",
   "Views: 14438",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experience with tweek (or whatever you wanna call it) has been a strange one.  The only way I can think of to describe the drug is a rollercoaster ride.  A few months ago I first smoked it with some friends--they were all experienced and I had no clue what to do, but they helped me.  That night I had a decent to smallish amount to myself (maybe 5-6 hits) and all I felt was tingly and awake.  They said that was weird, that I should be feeling great and that it was good stuff, but to try it again some other time to see if the tolerance builds up.  So I tried it again two other times with the same result, and I thought it was a lost cause, that I just couldn't get spun.  But I decided to try it one last time, and if not, oh well.  That night I went over to a friend's house and smoked it, and within the second hit, I could feel something.  I felt it in my lungs then traveling to my head and all of a sudden a nice rush sweeped my head and I felt nice.  I talked so much, and played cards, and drew, and just felt good and happy I was there.  We smoked some about 6 hours later as the feelings were starting to fade, and within the first hit, I was back. </p><p>But when I got home, I started feeling worse and worse every minute in the pit of my stomach. The happy feelings went away and I was left feeling all alone, like a part of me was ripped out.  I tried sleeping but couldn't, and it kept getting worse for hours.  I was emotional and I started crying (and I'm not an emotional person) and was frustrated because I didn't know what to do with myself.  Nothing seemed right and everything I did didn't satisfy me.  Let's just say it was a hellish day, a very very unhappy day, the worst comedown I've ever had on anything.  I talked to my friends and they said that was extreme but maybe the next time that wouldn't happen.  Being an experimental girl, I wanted to see if that was just a fluke or what, so I tried it again a few weeks later, and that terrible comedown happened again.  </p><p>So all in all, for me it's just not worth it.  The high is fun and great, but the bad comedowns just aren't worth it all.  I've experience many different drugs and their comedowns, but this one was a major pain that I never want to put myself through again. It's strange because on everything else I never have a really bad comedown, but meth really got to me, and I'll not do it again.  I would just advise people to be careful with this one, it's a doozy.</p>"
}
