{
 "title": "Honest with My Folks",
 "author": "mountainhead",
 "citation": "   mountainhead. \"Honest with My Folks: experience with Various (ID 12074)\". Erowid.org. Jan 24, 2002. erowid.org/exp/12074",
 "substance": "Various",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 12074",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 24, 2002",
   "Views: 17470",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI am eighteen and have been using drugs for the past two years. Since that time I have done mushrooms five times, DXM three times, LSD twice, MDMA once, and LSA once. After being caught with herb several times, my parents came to realize that I am not going to stop smoking it. While they do not like it, so long as we manage to avoid confrontation, they tolerate the fact. Recently my mother read a journal entry of mine in which I described supplying pot and shrooms to some friends of mine. Seeing that I couldn't getin any more trouble, I decided to come clean about all of the drugs I've tried, except for cocaine.</p><p>I was honest about how I feel about marijuana and mushrooms. I told them that I felt they were gifts from the earth and that my consumption of them has definite spiritual benefits. They don't believe me. The fact that this is how I feel concerns them.</p><p>I was also honest about the method by which I tried DXM for the first time, this being, downing a bottle of cough syrup. My parents are continually using this to prove that I use drugs irresponsibly.</p><p>I had hoped that my parents would be able to understand and respect my beliefs. Instead my honesty has gotten me grounded and in rehab. Unfortunately, in order to regain some of my freedoms I've had to swallow my pride and pretend to be someone I am not.</p><p>Despite all the problems my honesty with my parents concerning my drug use has caused me, I do not regret having told them what I have.</p><p>I'm in a rough way but things are slowly getting a little bit better, and before too long I'll move out and no longer be subject to their invasive inquiries and punishments.</p>"
}
