{
 "title": "My Withdrawal Symptoms",
 "author": "Hit Rocks",
 "citation": "   Hit Rocks. \"My Withdrawal Symptoms: experience with Cannabis (ID 12113)\". Erowid.org. Jun 27, 2007. erowid.org/exp/12113",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12113",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2007",
   "Views: 6618",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm a 15 year old kid and I've been smoking weed since last spring (about 9 months).  Since the beginning of this school year I've been getting high every day, and in the last month or so it's been 2-3 times a day (it's late January now).  I would smoke with my friends during school, after school, at home when my parents weren't around, pretty much anywhere I could. </p><p>I've always had a tendency towards psychological addictions and I'd say that I love weed so much that I am pretty strongly *psychologically* dependant on it.  Anyway, 3 days ago a friend of mine dared me to quit so I did. </p><p>My first day of abstinence, I had an incredibly hard time getting to sleep and ended up getting to sleep at 5 am after lying in bed awake for 3 hours.  I also slept very lightly that night after I did get to sleep. </p><p>The next day I woke up with a pretty bad sick to my stomach feeling and I really didn't want to eat hardly anything that day.  The nausea lasted all day as well, and I had a mild headache.  The next night the same thing happened.  The night after that I decided to eat 4 extra strength Vicodin I found laying around to help me get to sleep (lol). </p><p>That brings me to this morning when I again woke up with nausea and I still don't want to eat anything.</p><p>It seems impossible that all of this could be happening out of coincidence (Im not getting sick or anything).  Even though I have always heard that pot isn't physically addictive and therefore doesn't cause withdrawal symptoms after quitting, that is obviously the only logical answer to why this is happening to me.</p><p>Weird shit.</p>"
}
