{
 "title": "Power to the Powerful",
 "author": "Blazed",
 "citation": "Citation:   Blazed. \"Power to the Powerful: experience with Ephedra (Xenadrine) & Cannabis (ID 12120)\". Erowid.org. Jan 14, 2005. erowid.org/exp/12120",
 "substance": "Ephedra (Xenadrine) & Cannabis",
 "bodyweight": "179 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Ephedra sinica",
   "(capsule)",
   " ",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12120",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 14, 2005",
   "Views: 18999",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI didnt know what I was getting into. I forgot what Xenadrine does to a persons heart. I forgot about how smoking marijuana intensifies the drugs taken prior. Damn.\r\nA feeling came over me, consuming me from the top of my head down to my legs. A sec later, I could feel my heart. I didnt know what was going on. I just had taken a drink of water and thats what started the rush. As the water fell down my throat, a sudden burst of energy followed. It was like the water was the fuel, which was the ammunition to start the fire. My heart jumped into overdrive... the pulsing feeling in my veins clearly gave it away. I was left confused and scared. I figured it out about 2 minutes later that I shouldnt have smoked weed after taking Xenadrine.\r\nIt was about 6-6:30pm. I took a capsule of Xenadrine (my 5th that day) and ate some Chinese food. At about 8, I smoked a blunt of about .5 grams of goodness. At about 8:45, I felt the burn. My heart was beating so fast that it started to ache. Occasionally, I could feel some other organs around my heart as well. It was like pressure was applied to them, so I could feel them. My body would also jump from time to time in a form of electrical nerve twitches. One at a time would come, and a body part would abruptly move (like my right leg when I was laying down on my back turned to the right).\r\nThis wasnt concerning me at all though. I got used to these shocks. Thats what weed does to my body whenever I smoke. There were other factors that contributed to this mess. I sat back and tried to remain calm so that my heart wouldnt have to work harder because of my stress level. I was watching The Chamber and my heart rate went up while I was watching a person going through very cold conditions while trying to answer questions. I was also thinking about having to take a drug test for school since they can test me anytime... and failing it. Then I thought that it might have been the cannabis that intensified the effects. I was stoned, yet my heart was beating heavily. The good news was that I wasnt breathing heavily. It was like being stoned, while the heart felt like it was going to rip itself out of the ribcage. A good 15 min into the experience I was afraid that my heart could burn out. My friends (mostly girls) warned me that Xenadrine was bad for me, and here I was smoking weed to intensify something that was already powerful in itself.\r\nAbout 2 ½ hours later, I could feel the ache. At that point, I was hoping that the Xenadrine did not in fact burn my heart out. What was going to happen tomorrow when I woke up? Would I be in a weakened state for the rest of my life? This was the paranoia induced by the smoke talking. Nonetheless, I was still worried.\r\nSome final thoughts:\r\nIm not going to stop taking Xenadrine. I want the fat off, and I want some muscle mass.\r\nIm not going to stop smoking marijuana.\r\nI have learned that mixing Xenadrine and cannabis isnt an enjoyable experience, and I will not soon repeat it.\n\n\n"
}