{
 "title": "A Beautiful Day",
 "author": "Blotter",
 "citation": " Blotter. \"A Beautiful Day: experience with 5-MeO-DiPT (ID 12192)\". Erowid.org. Feb 15, 2002. erowid.org/exp/12192",
 "substance": "5-MeO-DiPT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12192",
   "Male",
   "",
   "Not Given",
   "Feb 15, 2002",
   "6088",
   " "
  ]
 ],
 "report": "<p>\nThe effects lasted about 4-5 hours.  From 3pm on was pretty much just the same as the begining of the day, so I only have up to 2:30pm.  My mindset was clear, I had just woken up and was really relaxed from the night before.</p><p>Timeline:</p><p>12:00am - Ingested 15mg of 5-MeO-DiPT via half a pill capsule (Not Closed).</p><p>12:50am - Started feeling an MDMA type body high, stretching felt good.</p><p>1:20pm - Got a call from a friend.  While on the phone I noticed his voice warping and chaning tones, comparable to a old record player.</p><p>1:30pm - A friend, that I have not seen in a while, stopped by.  When I went outside to greet him I thought he was really tired because his face looked all dark and scary.  It seemed as if he had black rings around his eyes.  While I was outside I noticed how beautiful it was.  I hardly ever go outside, but when I saw it I decided that I should take a walk.</p><p>1:40pm - Went into the bathroom to freshen up and get ready to go outside.  While looking in the mirror I looked at my face and thought I was really ugly, but then I laughed at it and it went back to normal.  I noticed when I stared at the middle and just waited the wall would start moving in the background, and my face would warp a little.</p><p>1:50pm - Taking a walk.  Everything is wonderful and happy.  I think to myself that everything in the world is just fine and couldn't be any better.  Everything was new.  Trees, bushes, rocks, the bay all took ok new identities, as if they did not look like that everyday.  Walking outside was really dreamy.  I had urges, which are easily managable, to touch everything and take a close look at everything.  While looking really close at branches of a little shrub I noticed really cool looking patterns on it. (Not Caused By The 5-MeO-DiPT)</p><p>2:30pm - Layed down in my bed and played with a laser pointer on the ceiling, wall, and white objects.  I saw trails from the laser pointer and also my hand, which would have colored trails at times.</p><p>Moral:</p><p>Live life.  Don't keep yourself inside all the time.  The earth is a really wonderful place.  Just waking up and being alive is a good enough reason to be happy.</p><p>I learned to have a better understanding of things.  See things from a different perspective.  Possibly a good drug for certain therapies?</p><p>Trip Tips:</p><p>Go outside (Night or Day) - (Rain or Shine)</p><p>Look in the mirror</p><p>Listen to music</p><p>Talk on the phone</p><p>Play with a laser pointer</p><p>Stare (People, Walls, etc)</p><p>Stretch or get a massage</p><p>Be with a loved one</p><p>Other:</p><p>I really want this to stick around for a while.</p>"
}
