{
 "title": "Last dance with the Devil, I hope",
 "author": "M.W. Livingston",
 "citation": " M.W. Livingston. \"Last dance with the Devil, I hope: experience with Cannabis (ID 1220)\". Erowid.org. Apr 18, 2001. erowid.org/exp/1220",
 "substance": "Cannabis",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "0.75 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1220",
   "Not Specified",
   "",
   "Not Given",
   "Apr 18, 2001",
   "9107",
   " "
  ]
 ],
 "report": "<p>\nThis event has NEVER been shared with anyone, due to my fear of being labeled a loony.  </p><p>I was 14 or 15 years old, when I first began to smoke weed. As we all know, in our genisis stages, we sometimes have a tendency to 'over-do-it', whether it is weed, alcohol, crank, etc. But years passed I've reflected back on my unexplainable, and very horrifying tale, and have ruled that option out.</p><p>As I walked home from school, I began fumbling for my pipe, and the small bag containing my new found friend (a pinch of weed). My walk from school to home was at best, 1.5 miles, and the last part of it was through the city park which bordered the dense Oregon forest. Once I reached the head of the nature trail at roughly 3:00 pm, with the sun shining brightly and no clouds,I lit up, started toking, and slowed my walk somewhat.</p><p>I had been facinated with this maze of trails because all of them were heavily canopied with tree limbs, creating a 'Sherwood Forest' effect if you will. And since my parents had moved us to this small burg 6 months prior, I enjoyed wandering through the roughly 1 mile square catacomb of trails mainly due to the fact that my father introduced me to the woods at a very young age. I felt more at home there than I did in town most of the time.</p><p>About half way through my average sized bowl of weed, I realized that my high was coming on MUCH more quickly than the 8 or 9 times that I had first experienced. It was all good until I began to slip further away from any control over what my physical body was doing.</p><p>Normally, it should have taken me 10 minutes to cut across the outer edge of the trails, but as I plodded along on auto-pilot and I struggled to regain the wheel, my familiar trails were turning disturbingly wicked. I remember as if it were hours ago, the sheer terror I felt when I finally zeroed in on 'funny feeling' that I was being watched.....it was a paralysis of terror I now know you get, ONLY when your facing pure unfiltered EVIL.....</p><p>I began running IN FEAR OF MY SOUL, to hell with my life.</p><p>Every time one of my feet landed, the canopy of trees closed in more and more until I was running through a tunnel of limbs maybe six feet in diameter and dwindling in light.</p><p>The next event that I clearly recall of is my ex-Navy Seal Dad standing in my bedroom door chewing my ass off for not coming home until 2:00 am. As I was thrust awake, I payed little attention to Dad because I knew better than to be late or I would get my ass reamed by the Captain. </p><p>I walked to the bathroom, and suddenly realized what a whacked out dream I had last night. I passed it off as just a dream, but as I stood in front of the toilet, preparing for my morning urination, I shockingly remembered part of my dream in which I could no longer run from this evil presence, and had fallen to the ground, and as I lay exhausted on my stomach, I looked over my left shoulder to see this giant (15 or 16 feet tall) 'demon' about to grab my mid section as if to pick me up with its four massive clawed fingers (2 on each hand).  </p><p>To my absolute shock, when I unbuttoned my 501 Levis, there on my hips, just below the belt line, were two lacerations on each hip.....about 3 or 4 inches long each, and displaying blood that had freshly clotted.</p><p>Horrified, I began trying at that point, to recall, rationalize, account for, or even come up with a LAME ASS EXCUSE for what I saw and what I presume happened to me that afternoon and night.......I still try from time to time......when I look down at my scars, or if a girlfriend asks how I got them....I always change the subject.</p><p>I am 30 now, own a business, have full custody of my 6 year old daughter, and have alot more 'experience' under my belt as far as different substances go, but to date, I have no explaination as to my where-abouts, nor why my flesh was cut so badly yet the muddy pants I wore were not. </p><p>What I have written is my unfabricated account.</p><p>It has not been spiced up, or added to in the least. It is what I remember happened.....somehow...even though the only proof lies in my physical scars and the confusing account that I have just related.</p>"
}
