{
 "title": "Mild but Something",
 "author": "Taylor",
 "citation": "   Taylor. \"Mild but Something: experience with Catnip & Tobacco (ID 12208)\". Erowid.org. Apr 14, 2006. erowid.org/exp/12208",
 "substance": "Catnip & Tobacco",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Catnip",
   " ",
   "  ",
   "smoked",
   "Tobacco"
  ]
 ],
 "footer": [
  [
   "2002",
   "12208",
   "Male",
   " ",
   "Not Given",
   "Apr 14, 2006",
   "13636",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am 14 years old.  I use pot everyweek-end, and have tried most other drugs.  I have heard about catnip being used as a mild intoxicant.  I couldn't find much else about it, such as experience reports, so I decided to find out for myself.  I went to the petstore and asked where the catnip was.  The lady showed me and I selected a 1/2 ounce bag of Four Paws Super Catnip Leaves and Blossoms.  It looked surprisingly similar to shake weed.  It was green and had an exotic cigarette smell.  I was very intrigued.  </p><p>Anyway, the price was amazingly low.  $2.44 for this 1/2 ounce bag.  It was a great deal.  I purchased it and showed it to my friends.  They were intrigued also but declined to try it.  So I planned to try it the next morning by myself.  I plucked out a few grams and placed it on a piece of paper.  I then broke up and poured out the contents of a Marlboro Light cigarrette on the same piece of paper.  It was 2 parts catnip to 1 part tobacco.  (Twice as much catnip)  I rolled 3 fairly large joints and proceeded to smoke.  I smoked 2 of the joints, and then I had to stop as my throat was getting irritated.  The smoke however was aromatic and pleasant tasting.  It tasted like a Camel Jade.  I put the last joint back in the bag.  </p><p>I felt mildly intoxicated, with some zoning out and a little strange walking.  There wasn't any euphoria that I could tell.  The feeling lasted about an hour and was strange but not at all overwhelming.  the rest of the day I was tired.  It wasn't unpleasant however, and I plan to do it again later with some marijuana.  I suspect it will enhance the pot high somehwhat.  Well anyway I have tons left over.  I think I shall give some to my cat.  :)  It's supposed to make my cat happy and playful.  That's what the box it came in says.</p>"
}
