{
 "title": "Very Low Dose - Unexpected Results",
 "author": "Avvy",
 "citation": "   Avvy. \"Very Low Dose - Unexpected Results: experience with AMT & Cannabis (ID 12210)\". Erowid.org. Feb 11, 2002. erowid.org/exp/12210",
 "substance": "AMT & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "10 mg",
   "oral",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12210",
   "Male",
   " ",
   "Not Given",
   "Feb 11, 2002",
   "Views: 7827",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt is very important to understand before reading this that I am a very lightweight to most chemicals other than (meth)amphetamines. I was visiting a friend in a collage town a few states away from home and had not had the opportunity to fry (other then mushrooms) in a few months. After dosing on about 220 micrograms of LSD the night before I was sitting in a co-op room with a couple friends smoking weed and discussing my trip from the previous night. After getting really stoned we started talking about chemistry and such with one of the people in the co-op. he thought he might have some foxy and looked for it. Not finding it he found his last bit of AMT and offered it to me.</p><p>I took it and continued smoking some very good weed for about another half-hour before leaving. Two friends and I walked from the co-op to the library on campus to use the computers. While sitting in the library I had completely forgotten that I took the AMT and was noticing that I was VERY VERY high off what I thought was just the weed. I kept thinking that I was higher then usual and much higher then my friends. Talking on the internet with a friend from back home for about 20 minutes I realized that I was to the point of being so high it was difficult to keep up with what was going on. We ended up leaving the library and my friends had also forgotten that I was on AMT.</p><p>We walked down one of the busy streets and spoke to a few people on the streets. I was feeling very empathic and didn't understand why I was connection with people so well. We ended up going into another co-op housing project and sitting down talking to a few people in one of the rooms. I was feeling very awkward yet welcomed by one particular person and kept staring at them feeling that they wanted to be understood so I read them some bits out of the book T.A.Z. that I was carrying with me. After a while I looked at my friend and he asked 'woah. . . are you frying on the AMT?' and it hit me. I had completely forgotten that I had taken it. And I started to peak as soon as I realized it.</p><p>Very slight visuals began. Watching colors stick out more then usual and lights being almost unbearably bright then decided to take me through the house to look at all the art and graffiti on the walls. I was in awe the whole time. Admiring the creative and brilliance of the colors I walked around saying 'holy shit' and 'what the fuck' whenever I saw something so intense that it melted into a pattern. I then began noticing that my extreme empathic feelings were controlling my thoughts. I couldn't rationalize or reason I could only concentrate or tweak on the emotions I was feeling that were flowing with the visual patterns I saw. It was frustrating a bit to not be able to concentrate or recognize reality very well. I would have to think hard to interpret into empathic patterns when somebody tried to speak to me.</p><p>After I stopped peaking about an hour later I was just very very empathic and ran into a character who was very hateful. I could feel unfocused hate just oozing from him and even see patterns in those feelings around him. I told my friend I had to get out of the area and started walking back to the place we were when I took the AMT. On the way there I began coming down or at least I thought I was. I could concentrate a bit better but was still a little empathic and trying to rationalize and explain the trip to my friend. That was about 6 hours after I originally took the AMT. for the next 4 hours I sat around tweaking on lights a bit but mostly being very introverted and ripping apart things about myself and cried a lot.</p><p>Overall I loved the experience and will try a 30mg to 50mg dose next time as I love intensity.</p>"
}
