{
 "title": "A Horrible Experience",
 "author": "Tweek",
 "citation": "   Tweek. \"A Horrible Experience: experience with Datura (ID 12233)\". Erowid.org. Apr 7, 2002. erowid.org/exp/12233",
 "substance": "Datura",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 12233",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 7, 2002",
   "Views: 40809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had been curious about Datura since I had first read about it in lycaeum back in '96. In '98 I was in the caribbean at a beach house when on a walk a plant caught my attention.  I looked for a second and behold it was exactly as I had seen in pictures on the internet.  The long trumpet like flowers and the little seed pods dangling near the base clued me in to the fact that I had found my long sought after plant.  I was stoked to say the least.  I quickly ran and gathered a few handfuls of the leaves and took them back and stuffed them in a zip loc bag.<br>I took them back home with me and as soon as I got back I called my friend so that he would come sit for me and make sure I didn't do anything stupid while I was on it.  I took the whole bag and boiled it in a pot with about 2 cups of water until the water boiled down to the amount that would fit a coffee mug.  I strained out the leaves and made the raunchiest tasting iced tea I have ever encountered.  I pinched my nose shut and had a bottle of water nearby as a chaser to down the vile concoction.<br>About an hour later I started to feel kind of feverish and hot. And my head felt tight.  I got extremely tired and decided to lie down.  Then my mouth dried up worse then any weed induced cotton mouth ever could be.  It felt like I had taken a paper towel and started wiping all traces of saliva from my mouth.  It was so dry that I couldn't even swallow.  No amount of water alleviated this horrible dry feeling.  It was like there was a thin plastic coating between the water and my tormented mouth.  My throat felt like it had sandpaper grating against it. I couldn't talk above a whisper and even if my mouth had been moist I don't know if I would have had the strength to talk.  Reaching to my table by my bed for water took more energy than anything ever had.  It felt like I had been completely sapped of all energy and had been plunged into a fevered delirium.<br>Then the phone rang and I had my friend answer it cuz I couldn't and then my friend tried to make me talk on it and I just couldn't.  All I could do was mutter under my breath.  It was that really shitty feeling you get like if your really tired after a speed binge where you have no energy to talk and someone keeps saying 'what?? I can't hear you.' and you just finally summon up all the pissed off energy you can to shout out the words you just repeated 5 times. Then after the phone call I just passed out.<br>But here is where it gets weird.  At least I thought I had passed out.  Apparently I layed there with my eyes open some of the time staring off at nothing or I was asleep but the strangest part was that I kept coughing. I wasn't sick and I don't remember coughing. All fucking night long.  Though I had no recollection of it my friend most definitely did.  He says he punched me repeatedly to make me stop. And he had to deal with my concerned mom coming into my room and somehow he covered for me.  Yet I still was coughing.  I woke up to find that he was gone but he told me what was up soon enough.<br>What I do remember of the night is little but it was vivid.  There was this large portal in my back yard that I stepped through and then when I entered into the darkness of it I don't remember what happened.  And also there had been some dreams I had that I thought were real stuff but hadn't happened.  Like I believed one of my friends had been in a car wreck and when I asked  her about it the next day she told me she hadn't been in one.  It turned out I had dreamed/hallucinated it the night before. They weren't like dreams where in the morning you remember it as a dream, it was like these things had really happened. But that was all I remembered.  So I am sure there was whole night of me travelling and doing stuff in my head but I didn't remember any of it except for a few things.<br>The next day I couldn't focus on anything that was within arms reach and one other experience that was really weird happened.  I took a  nap and I was still feeling shitty but my mouth wasn't as dry.  So I was lying in my bed and I wanted some water.  I got up out of bed and went and got a glass of water and as I put it to my lips it disappeared and I realized I was back in bed with my eyes closed.  So I got up and got water. And again it disappeared as I brought it to my lips and I was back in bed.  This happened like 4 more times before I finally managed to roll in my bed and snap my eyes open to true reality.  The weird thing is that it seemed so real.<br>But all in all it was a horrible experience.  I mean I could see how it would sound cool that you would hallucinate, have real seeming lucid dreams, whatever, but it isn't at all.  The physical discomfort itself is more than enough to discourage any more experimenting with the horrible effects of scopolamine.  Maybe lower doses would have made it so I remembered more. But I don't know if remembering is necessarily a good thing when you're dealing with this junk.\n\n\n"
}
