{
 "title": "Friday Mood Enhancements",
 "author": "Dr Dan",
 "citation": "   Dr Dan. \"Friday Mood Enhancements: experience with Cannabis (ID 12275)\". Erowid.org. Dec 28, 2004. erowid.org/exp/12275",
 "substance": "Cannabis",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12275",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 28, 2004",
   "Views: 5844",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFridays are always the best.  Usually Pay Day, off for the weekend and just generally great moods. This past friday rolled around and a few friends and I were looking for something to do and had a good 40$ blowing a hole in our pockets. Time for some Friday Mood Enhancement! I have only been smoking the MJ for a good 3 months and had not had the chance to try a water bong out yet.  I've tried almost any other method; hookah, bowl, gravity bong, etc. Just for some backround I usually smoke out of a nice glass bowl about once a week, a little while ago it used to be me getting high almost everyday after school, but I have slowed down since then. \r\nAnd now for the experience, \r\nFriday \r\n3:00 pm\r\nMy house.\r\nI open the door, walk to my living room, slam my bookbag down, tired with the 12th grade blues, and went to pick up my check.  After cashing it and returning home with a good amount of money, the usual routine of my friends calling me for a fun activity begins. (I try not to have to work on Fridays)  I took my Timoptic XE for my glaucoma and out the door I went to pick up a friend... (we can call him 'J').  J had just bought a water bong about a good foot long that was neon green that we aptly named 'The Green Mile'. We had all been waiting for a chance to try it out and now seemed like the perfect time.  School and work were over till Monday and the mood was great.  All high spirits.  When I returned home to my house with J, the phone rang and it was my friend whom we can call 'C' wondering if I wanted to smoke up tonight, and of course I believe we all know the answer. Pretty soon it was myself, J, C, my friend D, and his woman friend H all chilling at my house waiting for some hookups to call back.  Much to our chagrin, nothing was coming through and it seemed like a bad start.   \r\nAt around 6pm , after 3 hours of trying, which was unprecedented in our world of getting weed, we called my old friend Ryan, who I didn't expect to come through, and he actaully hooked us up with a pretty fat quarter of some nice sticky green. We cant smoke at my house because it is connected to another house and my neighboors smell it, and no one else had an empty house to go to =, so we decided to buzz cruise (drive around and smoke,  clam-baking).  Pretty soon we had the 5 of us crammed in C's Berretta GTU. We drove around during the night for about an hour smoking a nice fat sack.\r[Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't do it!] \r\nHere is where it gets interesting.  I knew how to hit a bong, but I had never had the chance to try a water bong.  I was expecting to die from coughing so hard because I saw everyone taking huge hits that I don't see coming from bowls and what not.  I took the bong in my lap, put my mouth to it and sucked lightly and filled the chamber with smoke.  I released the carb and sucked, a little bong water hit my lips due to the fact it was over filled a little too much for my standards. I waited for the burn at the back of my throat and the tickling in my lungs and to my surprise it was much less then I expected and it was so easy to take a fairly big hit. I can not believe how big of hits I was taking off this thing and not choking.  Pretty soon my reality turned into a nice stoned feeling after only a few nice hits.  I was amazed how messed up I was and we still had a huge part of the sack to go yet. \r\nThis is where my memory gets a little fuzzy. Our main goal was to smoke then go to the circuit ...(the circuit is a large circle of the inner city of our town which everyone drives around racing, showing off cool cars, talking, and just generally having fun during the night).  At one point I remember taking a hit and holding it and my vision started to drop away into darkness like if you closed your eyes.  The bottom of my eyes started going black and I was thinking I might black out but it was damn cool, then just when everything was getting dark I let it out and enjoyed a nice rush in the head. (I dunno why, I never had that happen before but I guess it was from oxygen deprivation, which isnt too good but I figured one time wouldnt hurt) I remember sitting back against the seat and closing my eyes and seeing a horse on roller skates and a fork and spoon holding hands and I then transformed those visions into the feeling of going through a long tunnel at warp speed with a strobe light going off, partly due to the speed of the car.  \r\nI opened my eyes to find the feeling of my head floating above the car as though my skull was tethered to a string to my shoulders and was being pulled along with the car.  I could almost actaully FEEL my eyes getting bloodshot.. feel the pulsing in them.\r\nIt felt as though a giant blanket had been lifted off my head/brain/mind and a giant new space for all my thoughts to go had opened up.  I was looking around marvelling at how I felt when I realized everything looked as though it was made of clay, but brightly colored clay at that.  I breathed a deep sigh of relaxation and the only thing that would come to mind was the Cypress Hill lyric which I remember from the movie Friday when Smokey was puffin in his room; which had a slow almost 'watery' beat to it and I just remember the words 'deep mind state; ultimate relaxation.'  I smiled to myself as my muscles melted and thought of how true that actaully is.  I then realized how quiet it was in the car and looked back and everyone in the back seat was either staring ahead in front of them with a lost look in their face or had their head rested on the back seat.  Damn I couldnt believe how great this was.  I think all of us must have been thinking the same thing because we all erupted in a fit of laughter that could rival a thousand stand up comic audiences.  \r\nI suddenly snapped into a mood where I kept having great realizations.  I suddenly thought, 'hey I feel like I just got done doing hard work on a super hot day and was crawling into a cool bed in an air conditioned room combined with the feeling of taking a really huge crap when you need to the most.'  The relaxing thought of a yellowish buttery colored setting sun and rippling water came to mind. Suddenly it hit me how everything just worked out and the Gods always seemed to be smiling upon me. Every single conflict and idea that ever made me worry in my life that I could think of always seemed to work out, and I learned that if you have faith in things and work hard at them, it will always work out. I then kept thinking of wild ideas I never had before.  Like if particles and / or atoms are attracted to opposites why cant they make a fax machine that puts certain particles in places to attract others and make a certain object?\r\nI snapped out of that mood into another mood of the current state of being.  I heard every single sound of the engine running and the power it was creating. I heard all the ticks in the engine and all the stones in the road moving.  I could hear the car cutting through the air.  I closed my eyes and I could feel the entire G-force , if you like, pushing me into the seat and I enjoyed the feeling of being really close to the ground and feeling like I was going super fast on a go kart or something similar.  Maybe its just me, but remember the feeling when I was a kid when I rode on a 4 wheeler or maybe a go kart and it was so fun going really fast but cars never seem to gave the same feeling? Thats what I could best describe it as. I had my hands folded together on my legs and my legs felt so heavy as if they were in glue that was hardening and when I went to move my hands it felt as though they were big and clumsy, and when I did move them I felt electricity of every thing I touched and I felt every single pattern of everything; along with the general good feeling I felt throughout my body.\r\n I look at J and complimented him on his new bong but all he can manage is a muffled groan.  I look at C and D and their eyes were incredibly bloodshot. This, I thought, was something so funny I laughed so hard I couldnt breath.  They of course got a laugh at this and another fit of wild laughter broke out for another good 10 minutes till we had to stop the car and get out and literally rolled on the ground trying to breath till I forgot what we were laughing about; which in itself was funny.  \r\nThe night wound down and eventually we got to the point we thought it was safe to drive around with other cars.  Up until this point we had been driving around back roads where there was  a less chance of hitting someone/something and going to the Hardee's drive through.  We took H home and hit the circuit.  I was coming down pretty hard but that was ok with me because not only was I still up there enough to enjoy the cars and friends but the most intense feeling of relaxation came over me and I couldnt do anything but rest my hands on my chest and sigh, and each breath seemed to give me such a full and relaxing breath.  I dont remember much of the circuit except seeing a lot of cool cars and racing a few.  I remember the races being full of tension and excitement, noting all the single facts of human behavior and unspoken language.  It was amazing to see the human race from such a different perspective that it truly showed me how we are and how curious we act around each other, never knowing it.  I remember the intense rush of adrenaline the speed and craziness of each race gave me.  Never before have I had such fun on the circuit.\r\nIn conclusion .... I LOVE that bong, I cant wait to hit it again.  It definately elevated me to new levels. I cant believe the level of intensity I had with this thing.  It was like hitting out of this water bong we have is so much easier then hitting out of anything else, and less harsh on the  throat.  It also multiplied the effects of the bud for me.  Maybe it was the bud, maybe it was the bong, but I'm hoping for another great experience this coming Friday.  Thanks for reading my long novel and I wish everyone happy and safe smoking.\n\n\n"
}
