{
 "title": "Too Intense for Comfort",
 "author": "Anon",
 "citation": "Citation:   Anon. \"Too Intense for Comfort: experience with Nutmeg (ID 12299)\". Erowid.org. Feb 20, 2002. erowid.org/exp/12299",
 "substance": "Nutmeg",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "65 g",
   "oral",
   "Nutmeg",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12299",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 20, 2002",
   "Views: 21444",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nWe got this stuff from the Spice shop. 3.40 australian for about 8 nuts (not to sure),but 60 grams worth. Me and my freind were going to share it.\r\nNutmeg taught me a lesson\r\nBoiled/simmered it for 1 hour.\r\nTook it out and drank it straight, and it didnt taste that bad. I actually found it quite resonable to taste.\r\nI took it at 3. I had feelings come on similar to drunkness come on at first within 30min to an hour.\r\nI then got called in at work from about 5. If you ever 'megged' make sure you have nothing to do for the next 48 hours. Seriously this lasts. That can be a good thing if known... but most of the time its bad.\r\nThat was the last thing i can clearly and concisely remember.\r\nI got to work and things started flipping out, seriously my imagination went like anything... rotweillers jumping out of the donut king traffic lights, coke bottles walking along the shelf, high paranoia, not sure what to believe.\r\nIt was about 8 that i think it really started pounding me... i felt deprived of blood to the head. Halucinations and paranoia (about other people) were strong. My eyes were bloodshot as anything and people thought i was stoned. But this was everything pot was time 10. Way too much... the doseage was way to high i say in hindsight. I looked like a zombie, my mum said when she piked me up 'druggo's dont look as bad as you do now Adam' and i thought crap... whats happening to me.\r\nI already had weird thoughts about the lack of blood to my head, and there was severe concerns inside my head that i was going to get brain damage... i dont know if it was paranoia but i could feel the brain thirsty for blood. I was starving it. I was shitting myself at this stage, mum had seen my eyes and thought i was back on the pot. I waited till we got home and said- 'it was the nutmeg' she had seen and even helped us prepare earlier that day, she had no idea.\r\nBloodshot eyes and halucinations got more intense as i could feel my brain dying of thirst. I say a yellow and red blotchy pattern in my vision with what was really happening in the background. I could hear/feel my vision talking with my mind which was also talking to my hearing. Touch was slow to recognise...\r\nI then began to be an onlooker in my life as my eyes became red and deepset, i could only look on and see my body was doing whatever i might suggest to it... but not all the time... By this stage i was saying- 'ring poisons to find out' to my parents.. by this time my heart was racing and i was probably peaking at around 10...\r\nThen on im not to sure of the timings, but i was taken to hospital that night, and they basically hooked me up to these machines to watch my heart and makesure i wasnt going to die... I was flipping out in the waiting room always wanting to lie on the floor to get blood to my head, the doctors thinking what a waste of time their services are on me, and the nurses laughing at the general stupdity of taking nutmeg to get high... my liver did alot of work during this time...\r\nI got out pretty late, i went back home when things have calmed down. when i woke up i was greeted by the drunkness of morning after which i spent at home with mum playing scrabble and other stuff. I was loopy and introverted... although easily excitable and willing to laugh at anything... That day i was able to walk but not well, i stumbled alot.. i remember having a 5 second black out as well somewhere in there. On and off sleep the whole day.\r\nThe next day back at schol im still slightly trippy, its at a controllable state but i can still tell its there... Its now over 52 hours ince i have taken it and im still not sure of where i am...\r\nThis was my first big drug scare and its going to be my last- learn from other peoples mistakes so you dont have to learn your own.\r\nOver all there was some good stuff, but shit loads of bad stuff which i dont want to go through again...\n\n\n"
}