{
 "title": "The Final Frontier",
 "author": "Kernunnos",
 "citation": "   Kernunnos. \"The Final Frontier: experience with DMT (ID 12306)\". Erowid.org. May 19, 2002. erowid.org/exp/12306",
 "substance": "DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "smoked",
   "DMT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 12306",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 19, 2002",
   "Views: 17451",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n5 September 1999 3pm.</p><p>I am by myself at home. It is 3 pm on a sunny afternoon.</p><p>I mixed 50 mg DMT with some basil leaf and placed it in a large pipe and smoke it in two tokes, holding the first one about 20 seconds. I think it burned too hot, probably destroyed some of the DMT. I lay back in bed, and close my eyes, and in less than a minute I am transported to another plane of consciousness.</p><p>I see extremely sharp and intricate colorful pastel yellow, red, and green geometrical moving patterns all around me. I sense all beings who have ever used, or will ever use DMT are here with me. I did not see any individual people, or hear any words. It was a kind of feeling. This kind of sensing is not available in my everyday unaltered state, so it is difficult to describe in the english language, but it was clear and powerful.</p><p>The DMT space has a familiar feel to it. When I go to the DMT space, I often think, now I remember, this is where I have been before. It is a place that cannot be remembered once the DMT wears off, as the space is permeated by some senory field which is in addition to the normal senses. This sensory field is like thought except the thoughts are not coming from myself. Telepathy, time travel, genetic memory, earth consciousness, all are possible descriptions. This is a new frontier. An unknown.</p><p>In a few minutes I come out of the altered state, and start to think about the experience I just had.</p><p>I am saddened that all the accumulated knowledge, wisdom, and experiences of all of  the DMT users is being lost and ignored by our present culture, because of the insane, blind, obscene, hateful, evil attitude</p><p>toward consciousness altering substances by the lunatic fringe of control freaks running the USA. I remember the image of the DMT smoke going away from me towards the open window.</p><p>I have the wish that I could give this smoke to everyone, it is so simple and clean and short. In one minute you are no longer you, and are now goddess. How hard could it be to convince someone to take one puff from a pipe? Then there would be no judgement, just knowledge.</p><p>I evaluate the experience as mostly visual, not much insight.</p><p>It is a very positive experience, beautiful closed eye visuals, and a sense of connection to transcendent levels of consciousness, and other beings. I am back to normal in 20 minutes.</p>"
}
