{
 "title": "Unwinding",
 "author": "aum",
 "citation": "   aum. \"Unwinding: experience with Kava (ID 12305)\". Erowid.org. Jan 14, 2005. erowid.org/exp/12305",
 "substance": "Kava",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   "oral",
   "Kava",
   "(pill / tablet)",
   "  T+ 0:15",
   "800 mg",
   "oral",
   "Kava",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12305",
   "Male",
   " ",
   "Not Given",
   "Jan 14, 2005",
   "25189",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was having a long (not to mention stressful) week, so after reading about the wonders of kava kava I decided to put it to the test. I had purchased some pills in the grocery, 200mg each standardized to 30% kavalactones, which I figured to be approximately 60mg of kavalactones per pill. This product was unusual in that it was in pressed tablet form rather than powder, gelatin capsules or a liquid extract. I took 6 tablets at once, and waited fifteen minutes before taking the last four. I dont care to take a lot of pills at once as I tend to begin gagging after a while, which I doubted would be a problem due to the small size of these pills, but I decided not to risk losing the pills for something so silly as gag reflex.</p><p>After about 30 to 45 minutes I began to feel slight effects. They weren't the euphoric or intoxicating effects some people report, but they were definite effects. My formerly tense muscles relaxed and allowed me to relax in a physical means, and my stressed, melancholy mood lifted to a calm and contented mood. I felt pretty much at peace, and happy to just sit and chat with my friends online, glad to be where I was. I went to sleep after a few hours (around 12:00 PM) and slept deeper and better than I have in months...perhaps even a year or so. I woke up promptly the next morning, even more relaxed then I had been the previous night and found my legs were a bit off. I went to my morning classes in a mellow mood, but of course throughout the day that changed. This was a few days ago, and I'm pretty glad that I tried this, it was worth my time. </p><p>I am not very experienced in drugs, but it appears to me that at a higher dosage this herb may have some potential. I am planning to use it again soon, taking half again as much (~900mg kavalactones/15 pills). This definitely seems like something that could help a normally shy, nervous or depressed individual allow themselves to have fun at a party or other awkward social gathering without the hassle of becoming inebriated, which in truth many people would like to avoid.</p>"
}
