{
 "title": "2:20 AM",
 "author": "Stupified",
 "citation": "   Stupified. \"2:20 AM: experience with Carisoprodol (Soma) (ID 12316)\". Erowid.org. Jan 28, 2003. erowid.org/exp/12316",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "700 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 1:00",
   "700 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12316",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 28, 2003",
   "Views: 42833",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'm not sure if this is what you are lookin for but what the fuck.  This isn't my first experience with Soma, I've been using it for quite a few years now.  Dose for dose it is in my opinion the best legal substances out there.</p><p>This is a great drug to take if you really want to relax and forget all the bullshit for a while.  No preparations were taken except for making sure I had some weed for when I get Somafied.  About 20-45 minutes after ingesting, I start to feel a tingle throughout my body.  Along with visual imparment that I can only compare to the buzz stage of drinking alcohol, I get a 'comfortably numb' feeling and total relaxation.  Any stress or worries you had before it, fuhgeddaboudit.</p><p>As soon as I feel the numbness, I like to smoke at least 3 or 4 bats or weed.  This totally intensifies the true effects of Soma.  I have taken with alcohol as well, but DO NOT recommend unless you like to be really fucked up really fast without any control over it. But that's just my experience.</p><p>Also, Soma with a few vicodin is ok too, but that seems to bring you down to that sleepy state.  That is the only thing I disagree with what you guys have to say... I think this drug is not only great as a muscle relaxer as well as to releave stress and possibly depression, but I don't get drowsy from it at all.  That's why I love it, take it, get fucked up, and go out and have a good time without laying out somewhere.  </p><p>Also, to add to the effects, I've watched movies with heavy visuals, such as the Wall.  I personally like to jam out on video games, but you tend to trip out too bad and the fingers don't work quite as fast as I'd like.  All and all, Soma is by far my drug of choice.  So far, I haven't found any negative side effects.</p><p>The last thing I wanna do is jump off a building, drive a car, or anything that takes alot of effort for that matter.  Just sit back and feel the effects of the high.</p>"
}
