{
 "title": "2001: A Space Odyssey But More Personal",
 "author": "Mango",
 "citation": "   Mango. \"2001: A Space Odyssey But More Personal: experience with Mushrooms - P. cubensis (ID 12317)\". Erowid.org. Jan 18, 2005. erowid.org/exp/12317",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1.75 mg",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "1996",
   "12317",
   "Male",
   " ",
   "Not Given",
   "Jan 18, 2005",
   "5129",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In grade school I was considered a somewhat 'gifted' student. I easily acheived high exam scores and never studied. When I arrived at Middle School, sixth grade, I realized I was in for something much more challenging. It was a challenge I didn't want and still feel I don't need or anyone needs. Fun was at the top of my list. I couldn't care less for grades, academic acheivement, etc. This attitude brought me into summer school for a few years, the consequences of being a slacker in school.        But, I made it and survived Middle School and arrived at High School in Long Island as an optimistic, creative young man. The first time I smoked weed was with two girls I knew, and two of their friends, guys who were seniors. Now I didn't realize it at the time, but those girls who sort of became my 'guides' in high school were friends with the biggest stoners in the school.</p><p>Getting stoned was fun. From ninth grade and on, I was quite the casual toker in my high school. I had lots of fun just chilling out, listening to music, and firing up a bowl of nice green bud. My Dad's a Vietnam veteran and knows what weed is, because almost every soldier over there was getting drunk or stoned most of the time. I'm pretty sure my Dad knew exactly what I was doing but simply didn't know how to approach me about it. </p><p>I never really started buying weed until the end of tenth grade or so, and my tastes in marijuana became refined,not like Ed Rosenthal or some real hippie dude, but I knew my Schwags from Kind bud or Dank Nugs. Towards the end of senior year, my friend Scott had also started getting stoned a lot and we had a 'clique' of six or seven guys who hung out a lot and smoked all night and on the weekends. Scott is a cool guy, very well read and articulate, but also not afraid to try different things. He can be a real a**-hole on his bad days, but your best friend in the world on a good day. One day Scott was acting pretty kind and asked me to chill out, we would get ripped, go eat something, call some girls, etc. I said sure, I wasn't working that day, and we got into his car after school. We talked for a little while, and suddenly he asks me if I'd want to split an eighth of shrooms with him and spend the night at his house. I was like 'OK, let me try these magic mushrooms, and let's see what all the hype is about'. No amount of getting high from top quality marijuana could prepare me for that night.</p><p>We went and got some pizza, and he said to put the mushrooms on the pizza, like it was freakin' pizza hut or something. I ate my slice with the half eighth of magic mushrooms. About ten minutes after eating, I noticed some definite mental effects. I felt very good, almost too good, like it was MDMA/ecstacy or something like that. This feeling persisted for about an hour. Just euphoria, feeling toasty. We sat on his couch, him sitting a few feet away, and watched a GG Allin concert video/documentary. Now, GG Allin is considered the most insane punk rocker who ever lived, a guy whom his own friends, family, and bandmates lived in fear of. But, watching this video I felt nothing but good anticipation for the evening. That's when the stuff got weird, and in a fast way indeed. The lights from the VCR, green and red, started to look like tiny lasers, shooting horizontally, and going around the televison screen. My skull and top of brain area started feeling very warm, like my brain chemistry was concocting the psychedelic mixture of blood, brain fluid, and the mushroom's natural chemicals, whatever they are. </p><p>Scott turned off the VCR and we watched Sportscenter on ESPN, and the announcers faces and words started getting slow and weird. Their faces were scary. Their faces looked like they were boiling and their words freaked me out.  I looked over at Scott and he was smiling, reading a book of some kind. His walls and bed were shifting positions, and the room was in some weird purplish 'haze', but he had a blacklight on. I looked over to my right front view, and there sat Jerry Garcia, and I realized then that I was indeed tripping my balls off, so to speak. Jerry was smiling, giving me a kind of reassuring 'Just Be Cool' look. Now, what's really weird is that at the time, I was only very mildly into the Grateful Dead or their music. I bareley knew who Jerry was. But, there he was, appearing right in front of me. It's almost as if I was communicating with his ghost. And as quickly as he was there, a few minutes later, he was gone. </p><p>A few hours into the shrooming, I started to not enjoy my experience any more. The mushrooms were very fresh and potent, Scott told me before-hand. And boy were they ever. I was flipping my ghord. I saw amazing shapes, colors, visuals, and my mind felt as if it tapped into some sacred quantum realm of reality. I felt as if I was traveling into deep space, kind of like 2001: A Space Odyssey, but something much more personal. Drugs are a very personal experience, even though your friends may be right there. You made a personal decision to do this or that drug, and only you alone can cope with/survive the consequences. I find this is the best but also the worst thing about drugs. It can feel like the top of Mt. Everest, but coming down can feel like the depths of despair and gloom. This is the main reason that I personally cut down my use of substances to an almost non-existant level.</p><p>To sum it all up, I'm not really regretful nor am I glad that I ate magic mushrooms that night. I'm not sure if I will ever do that again. It does change how I look at the world, but not necessarily in a bad or negative way. I feel as if there are multiple realities, planes of thought, experience, living patterns. Just be careful, be safe, and learn to respect Nature and it's wonderful powers.</p>"
}
