{
 "title": "Codeine is F.I.N.E. fine!!",
 "author": "Grass",
 "citation": "   Grass. \"Codeine is F.I.N.E. fine!!: experience with Codeine (ID 1232)\". Erowid.org. Sep 8, 2000. erowid.org/exp/1232",
 "substance": "Codeine",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Codeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1232",
   "Not Specified",
   " ",
   "Not Given",
   "Sep 8, 2000",
   "Views: 42854",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLiving a city life could often lead to extreme boredome. you get bored with night clubs and other things - to do in the city. sometimes you find yourself stuck at home, dying of boredom. i was feeling just that when i decided to try codeine. since then, i have been a good friend with codeine for 5 years. we are still best friends!! :) i've heard a number of reports on codeine, some were good and some were bad. as for me, i found codeine F. I. N. E. FINE!!</p><p>codeine is found in many products like tylenols and stuff, but the best source of codeine is in form of codeine phosphate. you can find codeine phosphate in cough syrups that are sold OTCin some countries. The advantage of codeine phosphate in syrup is that you don't have to extract the codeine through tiresome processes. you can just drink it, and the taste is not that bad either. some of the brand names of cough syrups which contain codeine phosphate are :</p><p>* nortus / nordyl</p><p>* codyl</p><p>* commodine</p><p>* phencodyl</p><p>* teradyl</p><p>* coughcodyl</p><p>* conadyl</p><p>and many more.</p><p>All have somewhat different taste, but work just the same. i personally like nortus the most. drinking the pure syrup is ok, but i recommend that you mix the syrup with coke or pepsi and ice, kind of like rum and coke or something like that. coffee works fine too. the ratio should be 1/10th of glass with syrup and the rest with ice and coke. you can think of codeine phosphate syrup as some sort of whisky. you can drink it on the rock, or with soda.  you will find that the mixture will give somewhat strange but agreeable taste. i personnaly like it better than any other cocktail drinks!!</p><p> in most brands, there is 9 mg of codeine phosphate per 5 cc. i would suggest that a beginner should take about 75 cc to 125 cc and as you build tolerence to codeine, you can increase the dose to 150 cc or more. as for me, i take 500 cc at maximum and 200 cc at normal. </p><p>the timing for codeine phosphate is not complicated at all, unlike ecstasy. before you take codeine, i would suggest that you skip a meal. codeine kicks in the best and to its maximum when you feel a bit hungry, and your stomach is kinda empty. you don't have to take the whole dosage at once. you can, like i mentioned above, mix it with coke and drink while you watch a movie or listen to music. if you took the codeine straight up, then you should feel the kick after about 20 ~ 30 minutes. i would describe the feeling as 'mellow'. you can feel the codeine crawling up to your nose and your eyes. (i don't mean the syrup will literally do that but the feeling will.) after 30 minutes, you will find yourself leaning against the pillow or a cushion near you. your body will be relaxed like never before. mentally you should feel that everything is alright, and the world is actrually an OK place to be. if you had a fight with your boyfriend or girlfriend, you will find that you are completely ok with the situation. all the problems that were on your mind before kinda disappear. i guess this is the best quality of my friend, codeine.</p><p>i would suggest that you take it at home or somewhere you won't be bothered by anything or anyone. when you are on codeine, even a little disturbance will tick you off. you just want to be in your own world that you have created, with a little help from codeine of course. you wanna be in the world of your imagination. </p><p>on weekends, i take codeine all day long. large dose at a time can disable you too fast, so i take a little at a time, mixed with coke, but constantly.   </p><p>i would be fooling you if i said there are no bad side of codeine. in fact there are a number of negative side ot the drug. one of them would be that you feel really itchy. your nose itches and your arms itches. it itches everywhere. but if you get used to it, it feels kinda alright too.... another bad thing is that you are pretty much in a state of being a plant. you feel lazy to go anywhere, and do anything. but if you planned yourself right, by staying home in your room and preparing all the necessary stuffs like water, food, music, and vedeo, it should be fine. playing with internet while you are on codeine is a good idea too. just don't do anything physical or mentally complicated stuffs. </p><p>hang-over from codeine is not so harmful. i'd say hang-over from beer or whisky is about 17 times worse than hang over from codeine. </p><p>i must mention some of the don't with codeine for safe use. you definitly should not drink alcohol with codeine. it fucks you up pretty bad. and don't take MAOIs with codeine if you are not an experinced druggy. doing so will multiply the effect of all the shits you have taken and you will certainly not like the feeling when you wake up.  other don't are the usual stuffs like never talk to your mom and dad when you are on drugs, never drive a car, etc...</p><p>codeine is mildly addictive. but the symptoms are ignorable when compared to other hardcore drugs. i have been using it for 5 years but i don't think i am physically addicted to it. i tested myself and proved me right when i went abroad for 5 months. during that 5 months, i have not even smelled codeine, but i was fine. but mentally it is quite addictive. once you have tried and liked the stuff, you will find that you will want to take it again. but with a little bit of will power hopefully you can stop when you want. </p><p>in conclusion, i'd say codeine is pretty safe and worthy shit to try. you can even stick to it if you want. it will help you find yourself and learn more about yourself. also, you will be amazed how beautiful the world can be!!</p>"
}
