{
 "title": "Everything I Saw Had Meaning",
 "author": "RALjr.",
 "citation": "   RALjr.. \"Everything I Saw Had Meaning: experience with Cacti - T. pachanoi (ID 12334)\". Erowid.org. Nov 3, 2004. erowid.org/exp/12334",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "11 in",
   "oral",
   "Cacti",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 12334",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 3, 2004",
   "Views: 10797",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy experience with the San Pedro cactus is one that has shifted the sails of my life. It has inspired many things from me.   <br>I had aquired a large peice of the cactus and chopped off an eleven inch piece for consumption. I have never experienced any other psychedelic substance prior to this...but have had a high intrest in them for at least two years before. I have read about the ancient use of these plants and gained alot of intrest in how they affected ancient cultures.  I cut the spines off and slit the flesh off by little strips. i put the strips in a blender with the skin and blended it till it was a thick foamy fluid. I put this into a large bowl and ate it with a spoon. It took a little more than half and hour for me too finish it since it had a real bitter taste and i was constantly forcing myself not to think about it. Once I finished it, I spent an hour listening to music and laying down on my bed trying to contain my mind in a positive mood with a stomach full of nauseating cactus juice. <br>Another half hour later I was dissapointed and thought that nothing was going to happen since I didnt feel or see anything. But from then, there was a slow building of attention which seemed to be gaining more and more fluid thought.   I layed down on my bed with the lights off and put my blindfold on to see what i could see with my eyes closed. I noticed small very dim patterns which ever so subtly morphed into more and more complex designs. I was listening to some acoustic guitar music that seemed to be specifically designed to fit the mood of the world that I was soon to be completely immersed in.  Gradually the visual designs had gained more and more color and layout. What I saw seemed like a flow of Native American Indian designs in black light glowing purple and yellow interconnected designs, overflowing my visual field. These designs were like incredible naturally feeling openings of the minds eye. I felt incredibly grateful to be one of the ones to experience this incredible phenomeon.   <br>After a while of seeing this interflowing design of birds, mushrooms, plants, and figuires, I noticed a swirl that seemed to be gaining more and more complex design. This swirl also seemed to be moving inwardly and then something incredible happened...something that i will never forget. I felt a wave of the most incredible unified thought and meaning coming from the swirl of light. It was as if my mind came to an incredible realisation of life and unity ... It was as if my mind was working with all of its branches of thought. This was incredible and meaningful...to me, I learned so much from it. Slowly over the course of what i think is like an hour... I got up to look outside.....EVERYTHING I saw had MEANING and DESIGNS in it...it was the most incredible experience of my life.  I later gained more knowledge of this phenomenon from the book ....The Psychedelic Experience by Timothy Leary. I learned that the swirl of meaning and light was known as the clear light of reality. This book had writings in it that fit the entire description of my experience like a glove.   I gained a flow of insights and meaning from this cactus and the book only helped continue the way I now saw the world. I learned how to play the guitar ...wrote a poem which is being published in a book and gained a new view on life.   <br>I suggest anyone who takes a psychedelic substance read the book before entering the experience so that they can learn to regognize the Clear light and experience its glory.  R.A.L.JR.\n\n\n"
}
