{
 "title": "How I Lost Time",
 "author": "Lord A",
 "citation": "   Lord A. \"How I Lost Time: experience with Mushrooms (Cyanescens) (ID 12338)\". Erowid.org. Jan 19, 2005. erowid.org/exp/12338",
 "substance": "Mushrooms (Cyanescens)",
 "bodyweight": "100 kg",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12338",
   "Male",
   " ",
   "Not Given",
   "Jan 19, 2005",
   "10774",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started nice enough, I decided to do some cyanescens mushroom together with a good friend. I was a bit worried about if it would work because two days before I had had a small dose of cubensis (apr. 2 grams). I was wrong. I had done some preparing, mainly concentrating towards the mushroom, reading, South American mythology, drawing and I asked the prince of flowers for guidance.</p><p>We ground the mushrooms, 3 grams total, to a fine powder and mixed it in warm Moroccan tea with sugar and honey. We were in my friends house and drank the tea quickly. Right away I felt it entering my body and within what we guessed later to be ten minutes everything changed.</p><p>There was a concert video playing from King Crimson.</p><p>The journey began with and out of chaos, I didn't remember when I had taken the mushrooms, I suddenly was there.</p><p>How did it all start?</p><p>Hey I remember this reality, I was here before,</p><p>Maybe it has always been like this.</p><p>I had constant deja-vu's about the situation, the room, the state I was in, the feelings I had. It was like there was a  memory-space in the trip that connected this one to all the others.</p><p>After that I entered THE ROOM, quiet, clean, pure bordered space and although THE ROOM stayed the same it changed constantly. During the whole journey I was very confident, peaceful and totally without fear. THE ROOM stayed and from time to time the vibes of THE ROOM wanted to change to a wrong vibe, I just didn't cooperate and the room changed back (afterwards I found out that at those moments my friend was going in a wrong direction with the possibility to go very wrong and the feeling of insanity). Light started to radiate. There were white transparent flat forms floating through the air. The light in the room kept changing, brighter, golden. The impression of South American designs everywhere.</p><p>Meanwhile time stood still, the total experience lasted about 3 to 4 hours with a long tail after that with the inability to speak, awe, the usual giggling and uncontrollable laughter. I kept looking at the clock but it always showed me the same time. I knew time had passed because I had the concert on video as chronological time. The music of the concert was very clear and chronological which was a very nice reference to consensus time. I had means of measurement for my jumping out of time consciousness and perception.</p><p>The visuals of the concert were out of this world. This was really great. I saw Dionysus, aliens and a twenty years younger Fripp to name just a few of a couple of million transformations that appeared in the box. My friend told me afterwards that for him the images of the concert went out of the television box and filled everything. For me it stayed in the box, the box was part of THE ROOM, THE ROOM was important, the concert was interesting.</p><p>After a few songs I drifted away from the concert and started closing my eyes. This is when I met the entity which felt like the mushroom. It shared itself with me, I experienced mushroom consciousness, connected to the mycelium network, being one, experienced great love, honesty and warmth in the entity that shared itself and after many communications we said goodbye when we felt it was time and slowly the distance grew and I knew I would forget the reality of this meeting, the wonderful feelings I had but it didnt matter. I just knew I wanted to meet this wonderful being again and promissed to come back. During all of this a thousand other things happened, the room, my friend, the music, the light, my self, the visuals.</p><p>I had to pee constantly, which was a good thing because I could go out of THE ROOM for a moment (back to reality in a way), it was sort of a cord to real life. My body wasnt important and I had a feeling of no control athough I could go to the toilet, pet the dog and see my body. When i was back in THE ROOM, i kept thinking that I could piss all over me or not and I kept checking if I had but this wasn't negative at all. I also realised that I had agreements with myself, rules that I could use for connecting to consensus reality. Sometimes breathing loud, tapping my foot or changing my position. Time was cut up totally, it stood still, there were only 3 different clock times I saw during the peak that lasted 2 to 3 hours. Although I kept looking at the clock, the clock stayed the same. My consciousness kept going in and out of time, reality shuddered, wondering if it was the movement of my eyes that caused this.</p><p>I thought it was very strange that when I closed my eyes it was perfectly still and concentrated. It wasn't visual but more like being there and here at the same time. Being part of the network, feeling like a mushroom and experiencing the room and the situation, communicating with the entity, wondering about things, seeing visual delight. Asking myself about situations in my life, no answer, nothing to be said, everything was ok, no worry at all. This was a very nice entity, entirely different from the cubensis entity I experienced. With cubensis I always had a ambigious feeling, very serious and somewhat hostile in a way. With the cyanescens there was only trust and warmth.</p><p>When we were coming down and started to go through our experiences my friend told me that he had dissolved into everything, but my little rules to remind myself where I was helped him too. He had the feeling that those things had kept him from dying and he was glad I did it because that way he felt that he had stayed sane. We also had the same visuals from the concert like the young Robert Fripp and some closed eyes visuals were the same although the form was different (he saw coloured visuals, I experienced being there and knowing where I was with an absence of colour or form) the essence was the same.</p><p>All in all this was a very good and interesting journey. </p><p>This report is in no way accurate, I left out a lot because there is no way to translate it into words. I knew when it was happening that I couldnt take it with me, that I couldnt remember how it was when I got back but that didnt matter. Everything was how it was supposed to be.</p><p>I feel like this journey was a gift from the prince of flowers. The mushroom revealed itself to me and thats exactly what I wanted from this.</p>"
}
