{
 "title": "Into the Unknown",
 "author": "Murple",
 "citation": "   Murple. \"Into the Unknown: experience with AMDIPT (ID 12405)\". Erowid.org. Feb 6, 2002. erowid.org/exp/12405",
 "substance": "AMDIPT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "200 ug",
   "oral",
   "AM-DIPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "12405",
   "Male",
   " ",
   "Not Given",
   "Feb 6, 2002",
   "23305",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After consulting with every person, database and book I could think of, it seems that AMDIPT has never been tested on humans or any other animals for that matter. An unconfirmed source indicates that even the person who made it does not know what it does, and has not tasted it. This one is a total blank. A gut feeling tells me activity, if it exists, wont happen until around 10mg, but, better safe than sorry. I measured out 3mg, then cut it in half (1.5mg) visually with a razor, half again (750ug), again (375ug), again (187.5ug) and again (93.75) and, yes, again (46.875ug) giving me a few little flakes of dust.</p><p>With a touch of nervousness and a handful of excitation, I tasted this little dab of powder. No noticable taste... which isn't surprising given the quantity. This stuff does reek though, the smell reminding me of the smell of a hamster cage, with a touch of fish food smell. In appearance it is a tan, somewhat crystalline powder. It looks very much like the 5-MeO-DIPT sold by a certain European chemical supplier, only it has a little more crystalline sparkle.</p><p>Anyway, no symptoms manifested over the next 4 hours that could not be attributed to the anxiery of having eaten a totally unknown substance. It would appear that AMDIPT is most likely not a super-potent psychedelic active in the microgram range... which I wasn't expecting it to be. However, a ludicrous underdose is better than a Hofmann style surprise OD. Next, I plan to take this compound up to around 250ug, then 500ug, 1mg, 2mg, 4mg, 8mg etc until activity is detected. </p><p>Also, before I tried it, I asked an experienced chemist if he had anything on it. His response (Aug 24, 1999): \rthe only dialkyl compounds that I had found in the literature were the N,N-dimethyl (N,N-alpha-TMT) and the methyl propynyl analogue. But I am never sure that a search done this way is complete and I know that it is not up-to-date, so the next time I get over to the Chem. Abstracts at the Med. School library, I will check using the formula index. I certainly do not remember having heard of it before. It will be fascinating to learn of it's activity but, as is necessary with anything new, it is essential to creep up on the active level in small steps and with caution.</p><p></p>\n"
}
