{
 "title": "Ouch My Heart!",
 "author": "Tania Rotten",
 "citation": "   Tania Rotten. \"Ouch My Heart!: experience with Cannabis (ID 12420)\". Erowid.org. Dec 2, 2003. erowid.org/exp/12420",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "4 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 12420",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 2, 2003",
   "Views: 4911",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Worse thing ever to have happened to me from smoking weed. Me and two friends get together with another friend have a great time then decide, hey we want some weed. </p><p>First we 3 share one bowl. Then an hour later her brother brings over 2 friends, they have a shit load of weed and a big bong. They start smoking it and this is my first time smoking so much from a bong. The bong goes around like 5 times. Then that's when everything goes wrong. I started feeling kinda drunk, couldn't walk right, speech was terrible, and my eyes felt like a million pounds. Then we had to run for the bus, my heart was jumping like crazy, I started feeling numb in my arms and legs all I thought was that 'oh my god im having a heart attack!' I couldn't think right, all I thought was death, and I'm never ever doing this again. I couldn't sleep, all I thought was that I would die in my sleep, never wake up again. Say I love you to my family and bf...I coudln't believe what was going on. </p><p>Now I'm writting this, it's the next day now...my heart still feels crazy and I feel like a complete idiot. I am never ever going to do this again. Last time I said that was 2 yrs ago. And now that this happened I swear on my life, I will not ever put my life in such anxiety and fear. Hell no life is way too powerful and meaningful. Yes, you can run away from drugs, why live off something that controls you? Are you really free if you live off a substance????</p>"
}
