{
 "title": "Too Much? HELL NO!",
 "author": "Trendal",
 "citation": "   Trendal. \"Too Much? HELL NO!: experience with Mushrooms & Cannabis (ID 12456)\". Erowid.org. Nov 19, 2004. erowid.org/exp/12456",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 4:30",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 12456",
   "Male",
   " ",
   "Not Given",
   "Nov 19, 2004",
   "Views: 5326",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My favorite trips are always the unexpected ones. Showing up at a friends house to find a pile of mushrooms waiting for me always sets the tone for a great trip. So last night was no different. </p><p>Showed up at my friends' house at about 5pm. Got high, as usual (honey oil and killer bud) and sat around playing mario kart 64 for a few hours. At about 9pm a few of my friends came back from their dealer with a bag of 10 grams of small black mushrooms ('These are the outdoor ones. From BC.' my friend said). Few minutes later I had about 1.5 grams of them in my mouth. Tasted horrid. Stong manure aftertaste. It was just me and my friend bryan dosing, with everyone else doing blades of oil. </p><p>They hit me quick, as I hadn't had anything to eat for a good ten hours. Fifteen minutes later I found myself on the edge of tripping (you know the feeling!) in my friend's garage, nervously taking a hit of oil (I've never really mixed shrooms with anything until AFTER the peak). What a great thing I did the hit, and the other hits I did after the first one. We turned off the lights, turned on the blacklights, and layed back to listen to some happy hardcore I had brought over. </p><p>I had never listened to happy hardcore before, and had actually only been introduced to it the night before while smoking some bud. Now I'm addicted to it. Listening to it while tripping was an adventure. It was now about an hour after dosing and I was well into my trip. Another friend who lived there, Henrik, had decided to trip with us and had taken the same dose as me and Bryan. By 10:30 the three of us were very high. </p><p>The music was one of my favorite parts of the night, although Bryan and Henrik thought it was too intense, I think. If you don't know what happy hardcore is, it's fast techno with a high-pitch tone and usually female vocals. For me, the speed of the beat (usually 140 to 200 bpm) was nearly too intense, but the 'happy' feel to the music made it ok to listen to. It made me feel great. I was happy and energetic (close to how I felt on MDMA, actually) and ready for anything. As the bpm rose and fell, my trip rose and fell in magnitude as if I was peaking over and over again. Each peak was stronger than the last. </p><p>We turned the lights back on and did some more blades, which sent me still higher. By now (especially with the lights on) EVERYTHING was moving. Nothing would stay still as I looked at it. Colors swirled into each other like smeared paint. Another friend, Mike, had arrived in the garage for some oil now. He suggested I close my eyes, so I did. I was greeted with the most intense, realistic CEV's I have ever had. Full color images of giant cities as seen from above. Even a view of the earth from space, complete with little glowing spots where the cities I had seen were. All this lasted only moments before I opened my eyes again for more oil. </p><p>We decided to go upstairs at about 12am to watch Maximum Overdrive. Definately a strange movie to watch while tripping. The worst/best part was that Yeardly Smith (voice of Lisa Simpson) had a main role in the movie. If I closed my eyes I almost felt like I was watching a horror movie starring Lisa Simpson herself. </p><p>I was having a hard time paying attention to the movie at this point. The combination of good shrooms (and they were GOOD!) and all the honey oil had gotten me to a peak I had never had a concept of before. The TV melted into the floor as I watched it. Chairs looked like they were made of wax. Flashing dots of color covered most of my vision, at times. The pattern on the walls swirrled around in little circles constantly. I remember thinking 'Fuck. I'm high.' and very little else. We turned off the movie at about 1am to go back down to the garage. </p><p>By 1:30 I was again very high, but now it was more oil than shrooms. I remember getting the feeling that the mushrooms and oil were fighting each other for dominance. Mike decided that he was missing out, I think, because he went upstairs and returned with his dose of mushrooms (chocolate covered!) to take. Somehow Bryan decided more mushrooms were needed, so both him and I took another 1.5 grams each. I had never tried redosing with mushrooms, but I was still fairly high and ready for more insanity. We took the shrooms and did a few more blades. </p><p>Mike and I went upstairs to watch Fear and Loathing in Las Vegas. I had seen it before, once, but never while tripping. Mike put on the movie and we sat back to watch. Ten minutes into the movie I could feel my second dose starting to kick in. The feel of mushroom-induced insanity began to take over the mind-numbing feel of the oil. Mike would say 'These shrooms aren't doing a thing', then only a few minutes later 'No...these shrooms are hitting me'. Mike suggested that we pretend that we were the characters in the movie. I was Johnny Depp, and Mike was Benicio Del Toro. I think that was the point where things REALLY went insane. I was hallucinating less and less with respect to reality, and hallucinating more and more with what was on the TV. I would see things in the movie that I _KNEW_ were not part of the movie. Before long I felt like the movie wasn't a movie at all. I felt like I was Johnny Depp, and that everything he said as a narrator was my own voice in my head, narrating. It felt like I was watching myself (Johnny Depp) from out of my body at times. </p><p>Other times it felt like I was the camera, watching some madman frolic around in his insanity. Bryan and Henrik came upstairs to watch the movie about 30 minutes into it. The four of us barely said a word (aside from a few incoherent ramblings) as the story unfolded in front of us. I could not get the feeling out of my head that I was in the movie, a part of it. At some level I knew that I wasn't, and that made it all the more interesting. </p><p>When the movie ended (I had no idea of the time it was by that point) the four of us went back to the garage for a few more blades. The blades made me feel like I was peaking again, but there were FAR fewer visuals than earlier. The trip had moved into my mind, producing an endless stream of incoherent thougt patterns. I remember feeling completely insane, but still happy. </p><p>Henrik and I went back upstairs to watch the end of Maximum Overdrive. The second half was even stranger than the first. Way too hard to follow. Next we put in the movie Merlin and tried watching that. There are some nice trippy effects in the movie that I kind of liked. </p><p>By 5:00am Henrik and I were the only ones left upstairs. Every few minutes Henrik would say 'I'm going insane'. I felt the same way. I thought I had overdone it. I thought I was finished. I would never come down. We pondered the possibility that we were never tripping to begin with, and that we were actually in a mental institution somewhere. Was everything just a dream? Were either of us even real? These thoughts continued until 5:30 when I decided I just needed some sleep. Nine or so hours of tripping was wearing me down. Merlin was still playing as I tried to relax. I couldn't. I moved from one chair to another, then to another. I could not, anywhere, get comfortable. I would lie down, then roll over, flip upside down, change which direction I was facing, take off my sweater, put on my sweater, then move to a different couch. Nothing worked. Henrik laughed at me with a quick 'You can't stop moving'. Somehow I made it to sleep. I didn't have any dreams that I remember. I slept until 1 in the afternoon. </p><p>All in all, this was an amazing trip. Two doses of 1.5 grams put me into what I consider a low level 4 trip. It was much stronger (in some aspects) than my last trip when I ate 8 grams. The differences in species/strains are pretty big, I guess. The trip felt like it just continued to go up in intensity (mentally, anyway. visuals fell off dramatically after second dose) until I finally fell asleep with the thought that I would wake up an insane man. I even toyed with the thought of what I would do the next day and how long I could keep the fact that I had 'lost it' a secret (don't let them take me away!!!!!!!!!!). </p><p>The best part of the trip as a whole was all the new things I tried. Listening to happy hardcore is something I will definitely do again for future trips. The movies were a great trip toy. Fear and Loathing was an insane trip in its own. Also the redosing, something I had always thought to be a waste, pushed the trip to a length I could almost not handle. Everything was great, and this morning (ok, afternoon...) when I walked home I felt so happy to be alive as I took in the deep blue sky and listened to the birds chirping. </p><p>In short: life is amazing.</p>"
}
