{
 "title": "Less Than Mind Blowing",
 "author": "Catfish Rivers",
 "citation": "   Catfish Rivers. \"Less Than Mind Blowing: experience with DMT (ID 12509)\". Erowid.org. Feb 14, 2002. erowid.org/exp/12509",
 "substance": "DMT",
 "bodyweight": "245 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12509",
   "Male",
   " ",
   "Not Given",
   "Feb 14, 2002",
   "Views: 10071",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n(11:03 PM)</p><p>Aprx 60mg synthetic DMT crystals sprinkled on top of a pinch of cannabis. One deep inhalation was taken and held for 30 seconds. I estimate that a little more than half of the material was inhaled based on what was left in the pipe, and what must have congealed within the chamber of the glass pipe. By the end of the 30 seconds, my visual field was dissolving somewhat around the edges, nothing overly intense. The solid edge of the things around me seemed to blur into a static of sorts. This visual effect reminded me somewhat of the visual sensation that accompanies the act of standing up too quickly. A rippling effect was also observed as I stared at my basment walls waiting to exahle.</p><p>Mere seconds later, my heart felt like it was racing. A few times I felt as if I missed a beat. I have experienced this racing sensation twice prior on DMT, and was prepared to accept it this time, for in my previous experiences, I fought it and felt later that the experience was wasted by generating unneccasary anxiety. I suspect this same sensation is what several other experimenters have refered to as the 'rushing sensation'. I decided this time to lie down on the couch in the dark, with headphones on, close my eyes, and allow myself to accept the experience as it was.</p><p>I became very self aware of my body in this time. I consciously let myself become ultra aware of my heartbeat, which surpisingly didn't take all that much effort. I feel that the DMT gave me a certain heightened ability to focus on smaller, and minute aspects of my body that I normally am not aware of, my heartbeat acting almost as a hub point from which I could consciously reach out into other areas of my body. For instance, I have been plagued with painful back problems of late. During the experience, I was able to zero in on the smallest fibers of muscle that I could visualize in my mind, and actually feel relief from the pain as I consciously relaxed the tightness of those fibers. I did this by imagining two strings wound up tightly, and then slowly I let them unwind. I found this sort of visualization more accessable than trying to envision a clear white light or a healing blue energy. </p><p>(11:15)</p><p>I open my eyes and stand up at around the 12 minute mark. I did alot of stretching and knuckled massaged the sore spot beneath my shoulder, which has burcitus. The knuckle massage seemed to provide significant and immediate relief as I continued to visualize knots coming undone. I then I had a flash of bodily realization, and could feel how my posture was being pulled forward by extra weight on my body. I could feel how I had been altering my posture to conceal extra weight in the gut and chest area. I follwed the intuitive correction, letting my body upright itself, pulling my shoulders back and pushing the small of my back in. I stood still, breating slow measured breaths into my muscles, feeling myself slip into a posture that felt natural and aligned. I felt light and centered.</p><p>My mental content during this time was next to nil. A few random thoughts did float through my mind, as well as a few self referential statements, but on the whole my mind was blank, void of language. I was however, vividly imagining the above visualization, as well as other random scenarios (CEVs). I was also able to hear and focus in on the music that was playing in the background, a nice meditative selection from the Hemi-sync series, complete with binaural beat imbedded within the music. I was calmer than my previous attempts with this material, perhaps due to the music. Other than feeling calm, my mood was relatively the same as prior to the DMT, which was nuetral. I did not experience the burst of euphoria and perma-grin that I did on my other experiences.</p><p>Although the meat of the experience was nearly over around 10 mins, the decline was pleasant and lasted for about an hour as it slowly faded away. I did not meet up with any self replicating machine elves, nor did I come in contact with any reptilain entities or wierd machinary. The experiences so far have been much less mind blowing than I would have expected. My dosage levels have been low compared to other reports, but I am not sure that higher is better in my case, as the increased blood pressure and heart rate does seem to be an issue for some. All in all, this was a beneficial experience as I have been seeking relief from my back </p><p>problem without much luck for nearly 6 weeks now. I am hopeful that if I can keep the sense of posture shown to me during this experience with me in my everyday consciousness, that my backpain will slowly melt away. I am thankful for this experince but I do feel as if I came up short. Overly high expectation may have been responsable for this sentiment.</p>"
}
