{
 "title": "Candy Flipping Fling",
 "author": "Molecule",
 "citation": "   Molecule. \"Candy Flipping Fling: experience with Ecstasy & LSD (ID 1252)\". Erowid.org. Feb 16, 2001. erowid.org/exp/1252",
 "substance": "Ecstasy & LSD",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:45",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1252",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 16, 2001",
   "Views: 22332",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n  About a 2 months or so ago, I candy flipped (taking acid and exctasy, for those that don't know what it is) for the first time. The following is a report of what happened during the duration of the time I was on the drugs.</p><p>  I was home alone on a weekend and decided to go to a rave with a couple of my friends on Friday night. As we made our way to the party at around 10, we had to make a pit stop at a local dealer's house and get some acid. He had Tim Learys (sp?) so I bought a ten strip and proceeded to take the whole thing, and we were on our way. We got to the party about a half an hour later, and the effects from the acid were just kicking in, but not too heavily, so I decided to compliment the acid with some X, Dinos if I recall correctly, 2 tablets to be exact. About 5 minutes after taking the X, The acid really started kicking in. At first, it was a regular heavy trip, nothing too out of the norm. About 20 minutes later, however things took a change for the weirder. I was sitting on the ground staring at a wall, watching it wave and ripple, when one of my friends, who thought I was just rolling started to give me a backrub. Now usually, I don't like to be touched when I'm tripping, but this felt different. I was getting heavy visuals from the acid, but at the same time, I was feeling vibes off the X. I almost immediatly went into a state of extreme euphoria. Everything was so bright and cheerful, and I felt extremely full of positive energy and love. I'm usually an upbeat person, but this was beyond my limits. I prceeded to walk around for about 4 hours, although I'm not too sure how long because I had a time lapse, and just talk to people I wanted so much for everybody else to fell what I was feeling. I became really open with total strangers, and went around distributing hugs to everyone. The rest of the night was spent doing that. The next morning, after the x wore off, I tripped for about 9 more hours and finally, exhausted, fell asleep at around 5 o'clock p.m. saturday evening.</p><p>    The only side effects from candy flipping were I was gritting my teeth so hard that my jaw still hurt 2 days afterward, and for about a day and a half after, I couldn't eat anything. I tried to eat some fruit and I almost puked. Also, candy flipping is not for everyone. I have seen people freak out while doing it. I've candyflipped more times after that one and they vary in intensity, depending on what you take and how much you take. So, if you don't like really intense highs, don't candy flip. If you do, however, I suggest you try it.</p>"
}
