{
 "title": "Mostly Good",
 "author": "Private",
 "citation": "   Private. \"Mostly Good: experience with Nutmeg (ID 12548)\". Erowid.org. Apr 13, 2008. erowid.org/exp/12548",
 "substance": "Nutmeg",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "1988",
   "12548",
   "Male",
   " ",
   "Not Given",
   "Apr 13, 2008",
   "8695",
   " "
  ]
 ],
 "report": "<p>I did nutmeg 7-8 times when I was about 18, but still remember very well. I would grate 3 or more nuts, and take it with milk as suggested by a friend (milk may have something to do with digestion). It would take 2-3 hours to kick in, and peak for some few hours, then many days to fully recover. The experience wasn't the same each time, but almost always good for me, hence I kept doing it.</p><p>The best feeling was when I felt totally weightless and everything seemed like a series of pictures shown to me, while I still could talk and walk, it felt unreal but without any worries. Though I never was a cheerful person, I wouldn't be able to stop laughing for hours when with friends. I never had any real hallucinations, but when I closed my eyes, it was like I was moving very fast in another dimension, and I would see colorful patterns which had some meaning to me. While watching a music video, I once felt that time had slowed down and I could capture every hidden detail. Generally, everything around me would look interesting, and somehow alive. </p><p>When, at first, some friends took me to some public places, I had felt very uncomfortable. There was no way I could hide those red eyes, and I thought everyone was staring at me. Talking was difficult, too. It was hard to focus on what I was saying, it was even like I wasn't talking but someone else was. Sometimes I would say that life was like a movie or a game, it was all set up, and we were all pretending.</p><p>In the next few days after, all I would want to do was to sleep all the time. I would also be very hungry but wouldn't have the energy to leave the bed. And, later, I was forced to quit doing it, because it was discovered by my parents, and it was a big deal at the time. For some reason I haven't attempted to do nutmeg since, but even today I would consider it if I had that much spare time.</p>"
}
