{
 "title": "The Depression Guy",
 "author": "Shauntron",
 "citation": "   Shauntron. \"The Depression Guy: experience with Cannabis (ID 12543)\". Erowid.org. Aug 19, 2006. erowid.org/exp/12543",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "12543",
   "Male",
   " ",
   "Not Given",
   "Aug 19, 2006",
   "Views: 3501",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This story is actually about a friend of mine (G) who suffered from acute depression, and had a long history of depression and suicide attempts in his family. He is extremely chemically dependant, as both his parents formerly were. </p><p>What happened is that I bought a quarter, when this stupid kid called looking for a quarter and a dime, so I sold him that quarter which was skimpy at that for thirty-five dollars. I know it is a bastard move but it is some limp-bizkit kid that walks around calling people fags. I got the thirty five bucks and then called up the dude I got the quarter from, said it was a little skimpy, and asked him to sell me a half for 35. Well, he didn't give a fuck as we are friends, and then I took the half to a party at my friend J's house. </p><p>There were about eight of us smoking, and since I was packing for the time being, they made me smoke a bowl out of the bong to myself. Then we proceeded to smoke most of the half, and found that it is the most potent shwag/mec that I have ever smoked. I had no problem smoking a lot of it cause it was so cheap. We were all unbelievably fucked up. </p><p>My friend G, the depression guy, got higher than any of us. He also gets depressed when really high. He went home and decided to take two bottles of tylenol, 48 pills. I woke from a deep slumber to G's roomate calling and wanting to know if G took any acid or shrooms or anything, because G was puking red and delirious. I said get him to a hospital fast, and found out about the whole incident the next day.</p><p>He spent a couple weeks in the psych ward and on the whole fucked up his life. Anyone smart would see this as a cue to stop, but the day he was out of the hospital he took to smoking cigarettes again. The first time I saw him once he was out of the hospital, he was drinking. Two days later, he was smoking pot again. He ended up having some fucked up hallucinations due to some medication he was on. He is now back to smoking tons, and I have no doubt that he will kill himself one of these days.</p>"
}
