{
 "title": "A Friendly Visit to Death",
 "author": "Justafreak",
 "citation": "Citation:   Justafreak. \"A Friendly Visit to Death: experience with DET (ID 12554)\". Erowid.org. Feb 14, 2002. erowid.org/exp/12554",
 "substance": "DET",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "IV",
   "DET",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12554",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 14, 2002",
   "Views: 19853",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n\t\t[Epigraph]\r\n\t\tThese daggers of words \r\n\t\tPenetrating \r\n\t\tManipulating \r\n\t\tThe conscious thoughts of reality \r\n\t\tBlurring the lines between dreams and insanity \r\n\t\tThey repeat; \r\n\t\t\tDeath old friend \r\n\t\t\tDeath old friend \r\n\t\t\tDeath old friend \r\n\t\t-- The Magus, Death Old Friend\r\nShamans, mysticists, philosophers have used psychedelic substances to learn answers to tough questions of existence. Some of those answers found turned out to be so bizarre and dreadful that they led the unexperienced ones right into the abyss of madness.\r\nNowadays the situation is all different.  The drugs don't wait for you to ask a vital question.  They may give you an answer as strange as hell when you least expect it.  Would you like to know how death looks like? Can you go nuts instantly? What, you didn't ask for that, did you? The substance won't give a shit. And you will hardly be able to do anything but accept the answer into the very heart of yours.\r\nOnce I had a whole school period of such amazing answers. Believe me: it was a real lecture.  That's why I was merely sitting and hearkening to it instead of say jumping out of the window.\r\nThe professor to read the lecture was injected right into my vein: 60 mg of the DET fumarate salt.  For about the first couple of minutes I was somewhat confused: I perceived a chemical within my body, though my mind and perception altered just slightly.  Then a sort of excitement came.  I rushed to have a drink, but suddenly realized that I didn't know if I want it.  Step two: I didn't know or want anything at all.  What would you do in such a puzzling case? As for me, I simply sat down to see what would happen to me next.\r\nBy that moment, my vision and hearing underwent changes rather common to tryptamines.  However, they were very weak. No walls melting, no waterfalls of rainbow; there were only slight shivering in images and somewhat richer hues.  Music sounded pleasant, but didn't draw a single bit of my attention.  I was just about to ask myself if my trip proved to be a complete waste of time and health when I got the first sign I was in no circus.\r\nDuring the entire session I stayed awake: no DMT blackouts at all.  It was solely my thoughts that flowed in an unusual way.  Initially, a topic emerged; then followed its consideration.  Every idea that sprang in my consciousness appeared as natural to me as myself.  I could physically feel its truth.  That was a pure monologue.  My mind was a lecturer ultimately carried away by his own speech.\r\nThe first subject to study was death.  The facts to learn about it were as follows.  Speaking in terms of geometry, life was barely a side of the multi-dimensional entity of death.  Life virtually proved to be a painting on the wall while death was the space.  Death seemed not that irrational horror hidden in a Christian book, but the ether filling the void.  It was mysteriously beautiful.  The entire world lived in death.  Suddenly, I felt a real lust for death; but right away I understood dying would make no difference at all because how could you cross the border of life if there was only death? I'd like to confess: there was a thinnest moment when I knew my sole wish would be enough to die spontaneously, but I feared and escaped back.  The final passage on this fascinating matter was wondering why the Christian Church had been the only successful advertising scheme based on exploiting and developing the deep fear of death in the human being.  By the way, I failed to think up another one.\r\nNext the theme of madness came out of the blue.  I received a fair opportunity to become aware of how to go crazy.  Can you imagine a frozen river with a number of ice-holes over it? Sanity is just one of the ice-holes where most of us got stuck.  A psychedelic lets me slip down into the dark waters and travel there.  The other side of such freedom is evident: I may choose to pop up into a different hole and stay there forever.  That is madness.\r\nAll these 'facts' I told you sounded like gibberish, didn't they? Now I smile at them, too.  But I still remember how it felt to believe in them with every cell of my body.\r\nI still doubt the popular rumour that the drugs are actually able to make a person lose his mind straightway or commit an instant suicide; but I do know now *how* they would do that.\n\n\n"
}