{
 "title": "A Roll to Remember",
 "author": "Jeronimo",
 "citation": "   Jeronimo. \"A Roll to Remember: experience with MDMA (Ecstasy) (ID 12569)\". Erowid.org. May 1, 2007. erowid.org/exp/12569",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 12569",
   "Male",
   " ",
   "Not Given",
   "May 1, 2007",
   "Views: 3423",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Summer had just begun when the familiar boredom and restlessness set in as they always do when I'm free from the daily grind of high school for the first time in months.  Immediately following this came the all-consuming desire for fun new experiences, manifesting itself to some degree in the form of drugs.  </p><p>I had been getting stoned on a weekly basis for nearly a year by this time so I considered myself to be a mildly experienced pothead. Weed had lost its luster somewhat, and I found myself searching for something new. I was pretty much open to anything as long as it wasn't too hardcore.  So when a friend of mine mentioned doing ecstasy one day, I was more than eager.  The next day I gave her money for two hits. About a week later, I finally got it.  A few of my friends offered to buy them off me for much more than I paid, but I had to decline. I guarded them carefully until the weekend. </p><p>By the time Saturday arrived, I was VERY pumped.  I met Jess, one of my best friends, at the movies around eight o'clock along with two other people I had only met a couple of times.  The movie was very long and very boring so I decided to pop a tab in the theatre without telling anyone.  We all went out to my car about a half an hour later after the movie had ended to take a few hits off my pipe. While walking to the car, I could feel myself coming up.  It was then that I let everyone in on what I was doing.  They were definitely surprised.  I knew this because they didn't take a single hit off the pipe.  They just asked me questions on what it was like and observed my every movement.  I think they might have expected me to go into instant rave mode at any second.  </p><p>After the initial excitement and wonder died down, we headed over to a friend's house.  While waiting in the kitchen for Jess to come out of the bathroom, I really started to notice the x coming on fast and hard.  It was like a rocket launch going off in my body.  All of my senses seemed to intensify simultaneously.  It took me a minute to regain control of my awareness so I couldn't exactly make my body function normally (walking, talking, etc.)  This did not last very long, and we soon left to go eat.  </p><p>I was in the best mood of my entire life.  Laughing, singing, talking my head off--it was amazing.  I loved every minute of it.  At the restaurant, everything looked so tasty.  I ordered a big plate of nachos.  When it came, it still looked really good, but I couldn't make myself eat any of it no matter how hard I tried.  I got a to-go box from the waiter as well as a puzzled look.  While everyone else ate, I spent my time staring at all the decorations up on the walls and at the other people sitting at tables around us.  I waved and said hi to at least half of them.  They were all friendly and played along with me.  My friends then started to get the impression that I was drawing attention to our table and that we should leave before anyone got too suspicious.  We did.  </p><p>At this time I noticed that another person had joined our group.  I had no idea where she had come from, but I was glad she was with us anyway.  </p><p>Our next plan of action was to go swimming at the lake a few miles outside of town.  I thought it was a grand idea.  We drove out there and waited by the water for some more people to meet us.  It was almost midnight, and I was still thoroughly enjoying the ride.  We sat on our cars and listened to the radio for about twenty minutes. A few people were drinking beer and hard lemonade and what not.  Someone brought out a joint and started passing it around.  I took a few hits when it was my turn although I usually try to do new drugs by themselves to get a pure taste for it.</p><p>I noticed Peter Frampton on the radio.  It was that song, 'Do You Feel Like I Do.'  I remember one of the guys there saying, 'Dude I'm so fucked up...' (a phrase I have always hated and never let myself use).  All of the sudden I was gripped by the thought 'What am I doing here with these people?  It's probably almost two in the morning and I need to be home.  Why did I do this?'  It was almost a paralyzing sense of fear and dread.  I quickly turned it around and was back to feeling all right again.  I don't know what brought this on, but I still feel that horror every time that particular song comes on.  </p><p>After I got over my sudden bad mojo, I realized I wasn't feeling so great anymore and decided to go home.  I said goodbye to everyone, and Jess escorted me back into town.  On my way home, I did some reflecting on the night I had just had enjoyed.  Overall it was a glowing experience.  </p><p>Since then I have had many more adventures in ecstasy.  Practically every time has been a good one.  I have written pages and pages in my journal about life, the universe, people, reality, and similar topics while on x. I've found it to be vastly enriching and would recommend trying it to almost anyone--keeping moderation in mind of course.</p>"
}
