{
 "title": "Becoming One with the Party",
 "author": "5-MeO-DiPT",
 "citation": "   5-MeO-DiPT. \"Becoming One with the Party: experience with Ephedrine, 5-MeO-DIPT & Cannabis (ID 12576)\". Erowid.org. Jun 9, 2003. erowid.org/exp/12576",
 "substance": "Ephedrine, 5-MeO-DIPT & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   "  T+ 1:00",
   "10 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12576",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 9, 2003",
   "Views: 18304",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started at around 10:30 on Lundi Gras night (the night before Mardi Gras).  I was leaving work and about to head over to the local venue for a kick ass party (rave).  I had been at work all day so i decided to eat 3 (25mg) ephedrin to give me a little boost.  By the time i got into the venue (about an hour later) the ephedrin was starting to kick in and i was getting a nice tingly feeling that most people get when they take a nice dose of the substance. </p><p>At 11:15 the first DJ was comeing on to the main stage so i decided to take my foxy (10mg uncut in a gell cap).  By about 45 min after droping i started to feel something.  I wasn't sure what, but it was something.</p><p>I figured out that SOMETHING had taken ahold of me about +60 when i was watching the laser show and i closed my eyes and i could still see the lasers.  Once i started to walk around i could feel what the effects were going to be like.  My perception was messed up.  Going up and down stairs was not fun, but after a while i didnt' feel my legs anymore so i just kind of floated everywhere so that was fun.</p><p>One thing that i found is that foxy is VERY compatible with a person on MDMA, i don't know about combineing them in ONE person, but i found that it made putting up with my freinds that were rolling ALOT easier.  I latched onto one of my old kandiraver friends and we just stayed attached at the hip all night.  I found that his rolling and my trolling combined in such a way that when we went around together, whatever he was too out of it to do and whatever i was too out of it to do...the other one could do so it all worked out very nicely.</p><p>I had a nice smoke-less pipe in my pocket, so whenever i would get the usually upset stomach from foxy i'd just take a small toke and everything was great again.  I don't know if i would suggest anybody doing foxy anywhere besides at home or at a party.  I personally would not do it at a club since clubs CLOSE and i personally couldn't drive till about 6hrs into the experience (allways be responsible, never drive while entoxicated).  </p><p>All in all it was a wonderful experience and i plan on doing it again.  Just a note, the next day, i found that when i smoked it brought ALOT of the trip back and the next day (today) i'm pretty sore from the whole experience.  To me foxy is more than enough to do on it's own and really doesn't mean to be mixed with anything.  All i would suggest would be a little herb to settle the stomach.  PLUR</p>"
}
