{
 "title": "Death makes life beautiful",
 "author": "Maby",
 "citation": "   Maby. \"Death makes life beautiful: experience with LSD (ID 1257)\". Erowid.org. Apr 18, 2001. erowid.org/exp/1257",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "5.5 hits",
   "oral",
   "LSD",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1257",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 18, 2001",
   "Views: 21798",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had always been comfortable in my experiences.  Never had a thought of a bad time, or extreme insanity ever crossed my mind.  I started tripping at the beginning of my Junior year in college, I guess because I was bored with life.  My creativity had run out, and LSD seemed to be a way in which I could channel that creativity.  But nothing, nothing could have ever prepared me for the night of April 11.<br>On the day before that life changing event, I had decided to roll for the very first time, which was wonderful.  The next night I had decided to go on the trip of my life at a party that I was having.  I started the night off by eating two of these Jellies (orange if I am not mistaken) and had grown impatient for the trip to come on.  So I quickly ate another jelly, then in which my friend dared me to eat another.  So I did.  I mean young male pride was ripe, and I did not bother to give it a second thought.  My other friend (you could call her the supplier of such party favors) said she had a jelly and a half left.  So I bought those and ate them as well.  Thats when I started to trip. Hard.<br>The world began to glow red, sepping across and stretching into everything imaginable.  With the redness of the world and myself, things began to get very warm.  So I decided to go to my room and lock the door.  I didn't realize it yet, but the night had not even started.  I began to have horrific thoughts of having eaten too much LSD.  Perhaps my heart was about to explode, I don't know.  But death, death was on my mind.  I let some friends into the room and that is when the insanity hit.<br>I sat Indian style in the corner of the room and it bagan to disappear.  The world diasappeared in a series of flashes and I blacked out for a moment.  I came to and realized that I was stuck in time.  Stuck, a second was infinity and infinity was not long enough.  Every move I made, every breath I took lasted forever.  It was hell.<br>I rolled over in my bed and my sheets wrapped around me, forming a rock tight caccoon.  The world was gone and all I could see was a huge heart.  It was my heart and it exploded.  I was dead, dead as a rock and realized that the bed opened and my mind had left my body, as I fell through space.  I saw the stars, the moon, planets, the universe.  I had given up on life, nothing mattered when you were dead, but I couldn't accept it.  I couldn't.<br>Suddenly I found myself leaping down several staircases, a flight at a time.  I quickly made it outside with my roommate at least thirty seconds behind.  I was holding my head screaming over and over that I had died, and was entirely convinced.  I did not want to accept it, and it is that fact that kept me going.  I undressed in the road, as clothes had no meaning to a wanderless spirit of the night. That is when my roommate caught up with me and attempted to explain to me what was happening.  I was insane.  But his voice was nothing in comparison to the voice from above.  God's echoing voice covered all, and I was powerless to resist it.  It told me one thing (that phrase which if repeated, might get me a lighting bolt from above.)  That is when I ran and the dirt path in front of me became a stairway to heaven and in the clouds above I could see a white light.  The white light.  I went as high as I could and just as I put my finger to that light, my mind shut down.<br>I eventually awoke in my friend's car, stark naked, and vomit all over myself.  The world was different, I was different, and I don't think that my life can ever be like that hollowed shell again. This will probably be the most spiritual experience of my life.<br>I spent the next year of my life, depressed and sometimes on the edge of lunacy.  But I have finally recovered, as the events of that night are slowly fading in with my memory.  But I talked to God (or the voice in my Sub-concious, however you want to see it), learned a fundamental truth, touched the light at the end of the tunnel, and realized that I was alive.  Truly alive.  Life is beatiful, glorious, and is never to be wasted.\n\n\n"
}
