{
 "title": "Trip into Space",
 "author": "rhs_star",
 "citation": "Citation:   rhs_star. \"Trip into Space: experience with Diethyl Ether & Inhalants (Starter Fluid) (ID 12585)\". Erowid.org. Feb 9, 2005. erowid.org/exp/12585",
 "substance": "Diethyl Ether & Inhalants (Starter Fluid)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "45 ml",
   "inhaled",
   "Inhalants",
   "(gas)",
   " ",
   "  ",
   "inhaled",
   "Ether",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12585",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 9, 2005",
   "Views: 29053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]\r\nMy brother and I decided to try Ether for ourselves. Actually, I was more interested in the sedative effects of the ether than trying to get a high from it. So I went to a local hardware store and bought a can of automobile starter fluid. We sprayed the entire contents into a large freezer bag and added about 8 ounces of water. Almost immediately the layers seperated, and I turned the bag up on one corner and clipped the bottom corner so that the water/heptaine mixture would drain off, leaving us with I guess 12 ounces of ether. My brother poured about an ounce onto a rag and huffed lightly. Soon, he got a huge head rush, became disoriented and lay on the sofa until the effects wore off. I took the rag and poured on half an ounce of ether. Huffing that, I noticed a loud musical droning like a string on a bass guitar. My hearing got choppy and vision blurred. Intent on going completely out on this, I poured on probably another full ounce and huffed until my vision of the room went completely out. But I could see what appeared to be a glowing diamond out in space. I was hanging in outer space staring at the flashing and glowing diamond. My only thought was that I was being led by the diamond into other dimensions of space and time. I even doubted that the dimension we call 'reality' was actually the correct plane of existance I was from. \r\nI felt as though I would die, or wake up in another dimension that I was unfamiliar with. It was a scary thought. When I came back to ground zero, my brother was asking me if the effects were wearing off. He told me that while I was out, he had been asking me questions and all I would do was laugh a slow sneaky laugh! When I sat up I still felt tipsy and light-headed as if on cold medicine or something. I was slightly nauseated for another half-hour.  I may or may not try ether again. but this was one trip out of this world I can never forget.\n\n\n"
}