{
 "title": "Is this Space or the City?",
 "author": "Jerry",
 "citation": " Jerry. \"Is this Space or the City?: experience with LSD, Mushrooms & Cannabis (ID 12581)\". Erowid.org. Feb 8, 2005. erowid.org/exp/12581",
 "substance": "LSD, Mushrooms & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(liquid)",
   "",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 1:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   "1 hit",
   "oral",
   "LSD",
   "(liquid)",
   " T+ 5:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 10:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 13:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   " ",
   "smoked",
   "Opium",
   ""
  ]
 ],
 "footer": [
  [
   "2000",
   "12581",
   "Male",
   "",
   "Not Given",
   "Feb 8, 2005",
   "10577",
   " "
  ]
 ],
 "report": "<p>Set: feeling relatively confident about my ability to deal with hallucinogenic drugs after a series of eye opening and mind expanding adventures in cosmic consciousness. Happy to finally get to the weekend after a long week of college.</p><p>Setting: a small two room apartment that was habitated by my friend N and his girlfriend D. The apartment has a kitchen and living room that are basically connected with a bedroom door in the living room, a bathroom door in the kitchen. There is a bird in the apartment as well, I believe a parakeet.</p><p>Two of my friends had recently gone to a college for the weekend and returned with the nicest looking magic mushrooms I had ever seen. They didn't know the species, but the bags contained only caps, no stems. The 1/8 that I got was one giant wrinkly cap with golden sparkles in it. It was a bluish-grey color with earth tone highlights. This was during the time period that I was getting substantial quantities of acid, including UFO tabs and a bottle of Liquid Lavender. N and D, whose apartment we used for the trip, had never done acid. D decided to try some, N decided to stick to mushrooms for the night. My friend (and former girlfriend) S came with me, as we all had gone to high school together (though I didn't really know N or D until college). S and D took just acid, N took mushrooms, and D and I took acid and mushrooms together.</p><p>T+0: I drop a hit of liquid acid and eat the 1/8 of mushrooms at the same time. We're playing Dreamcast and generally relaxing at this point. N rolls us a nice blunt with the amazing hydro-chronic that we got for the night. I am excited about the evening, though still I feel some slight trepidation as I have never mixed acid and mushrooms or taken quite such a large dose as I plan to.</p><p>T+1: The effects hit us all at different times, but by now it would be fair to say we're all under the influence. S, D, and I each take a UFO tab. </p><p>I can't really recall what happened for some of the next period of the trip. I remember being in the next apartment from where N and D live talking to some very sketchy guys about ecstasy and how much it should cost. The whole scene over there was no good for my head so I went back to the other apartment to talk to S and drop another hit of liquid. We decide it would be a good idea to put on the Dark Side of the Moon and the Wizard of Oz (perfect tripping combination, whether the synergy was intentional or not on the part of Pink Floyd). </p><p>T+3 or 4: The movie is in progress at this point, maybe halfway through and things are getting weird. D keeps saying she is fine, then bursting into tears. We try to comfort her, which makes her laugh and then cry again. This cycle is repeated many times over the night. S spends a portion of time in the bathroom staring at the tiles. I keep telling myself I am close to sober, perhaps as a defensive reaction against the huge amount of psychedelics zipping around in my brain. My trip is definitely pronounced, but visuals are slight and the sort of 'mental clusterfuck' associated with tripping out doesn't seem that bad. However, my senses are definitely not normal, I believe that I am perceiving 'hidden' information in the auras of objects and people. </p><p>T+5 (or 6, but I'll stop second guessing now): We decide to go on a walk to when the movie is over, but not before having a massive smoke session. Things are becoming stranger by the second, and from the looks of my companions I am not the only one noticing this. Interpersonal dynamics at this point are quite amicable, as they usually are, but there is another level of openness that I do not usually encounter with other people. Dropping another UFO tab, me and S go outside first. Several minutes later N and D descend the long set of stairs and begin walking with us. At one point N says he feels like he is floating in outerspace. I look down at the sidewalk and all I can see is the blacktop, which looks like the cold distances between the galaxies.. I feel adrift in the universe. This feeling eventually gives way to a sensation of warm liquid running down my legs, and I feel like my skin is melting into blood. This sensation has returned in subsequent trips, but is not usually disturbing only odd. </p><p>T+7: Walking around the park for what seemed like years we observed a midnight ice skating event (it was still a little shy of midnight at this point, we had dosed early). We sat and watched small children and their parents having simple and unencumbered fun. The experience fills me with a sense of longing to create and nurture life, but luckily I do not run out and impregnate anyone.</p><p>T+8: Upon returning to the apartment we notice that the music has been playing the whole time we were gone, though not at a very loud volume. Instead of turning it off we pop in Alice in Wonderland and leave the movie muted. I watched the same movie with sound on my first acid trip and this helped to anchor me into a continuum of experiences that I had begun with that life-changing psychedelic event. My trip became very mental and introspective at this point, though startingly clear considering the drugs I took. S became wrapped up in the movie, identifying with Alice to the point of becoming quite upset when the movie was paused at one point. </p><p>T+10: Some time after the movie is over we are playing videogames and talking in general. The trip has levelled off for all of us, though not subsided. We smoked some more pot, which helped stir up some of the trip but mainly just had a calming effect. I notice that I am profoundly tired around this time.</p><p>T+13: It is the early morning hours as we smoke a final bowl laced with a small chunk of opium I had been saving. N and D retire to their bedroom to catch some sleep. S and I continue talking intermittently as we lay on a folded out sleeper couch. I drifted off to sleep at one point only to be awakened by the parakeet who landed on my head. I remember being confused and slightly frightened by this disturbance, and it took me a little while to fall back asleep. S was sleeping soundly by this point. </p><p>We all slept pretty late. I was awakened by D coming out of her bedroom in the midafternoon. S had already left to go back to her college. I walked back to my building which was about 10 minutes away, feeling a definite afterglow that manifested in the form of contentment and that familiar 'burned' feeling most acid-heads can tell you about. I slept pretty good that night and layed around like a waste all Sunday. By Monday I was pretty much back to normal, though a little fuzzy headed. </p><p>One interesting thing to note is the effect of psychedelics on animals. I don't mean we gave the parakeet any drugs (that would be pretty inexcusable, actually), but the bird still seemed to be able to perceive a noticable difference in us, even without us acting out any of the psychic turbulence. I have long believed that animals are very in tune to nonverbal communications of emotion through smell, body posture, etc. The bird very clearly knew something was up, because it seemed semi-agitated for much of the trip. This fact made me feel bad at several points as I didn't want to be contributing to the anxiety of another creature. Still, it would be interesting to see how a higher mammal such as an ape would react to seeing humans on acid or another psychedelic.</p><p>All in all, this trip was a mind bender, but in a subtle sort of way. A lot of the personal issues and ideas that were raised in this trip were a continuation of previous ones, and some of them continued into future trips, illustrating the cumulative nature of psychedelic excursions as explained in the philosophy behind psycholytic therapy (repeated ingestion of relatively low doses of acid for psychotherapeutic purposes).</p>"
}
