{
 "title": "In a Las Vegas Hotel Room",
 "author": "Strumpling",
 "citation": "   Strumpling. \"In a Las Vegas Hotel Room: experience with Salvia divinorum (5x extract) (ID 12595)\". Erowid.org. Nov 18, 2002. erowid.org/exp/12595",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12595",
   "Male",
   " ",
   "Not Given",
   "Nov 18, 2002",
   "Views: 9578",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSome friends of mine and I had done salvia quite a few times in the past, and had definitely enjoyed where it took us.</p><p>On my 21st birthday, in a Las Vegas hotel-room, my friend R blessed me with a giant bowl's worth of 5X extract. I had read to try and trip in a pitch-black area, so I took it into the restroom of the hotel room, along with my stereo (I'm really into music, so I'd brought my cd player to vegas :), and put it on track 4 (The Shen) of Infected Mushroom - Classical Mushroom.</p><p>My friend was standing next to me as I smoked most of the bowl in one hit, then snapped the remainder with a smaller 2nd hit. I handed him the bong, and he exited the room, turning off the light before he left :)</p><p>The salvia started taking hold. I felt a strange type of 'pressure' pushing in on my body from every angle. Having felt this before, I knew it was definitely going to work. I didn't know this trip would be totally different than all the others, though.</p><p>Suddenly I was no longer in a Las Vegas hotel room (well it FELT this way, anyway...). I had been shoved into some kind of tube, with bright reds and greens and blues rolling all over me in every direction. This tube was pushing me, shoving me out of itself. And I felt presences.... more than ever.</p><p>Every female I knew was next to me, outside the tube, waiting for me to get squeezed out into this odd world.</p><p>I felt an intense anxiety. I'd forgotten I was on a drug, and would not remember until it lost its grip on me. I was trying to figure out where I was, why all these women were cheering me on, motivating me to get out of this strange enclosure. Did I not exist anymore? What was going on?! Didn't I used to belong somewhere else?</p><p>These women continued cheering me on, with phrases such as 'you're DOING it!' and 'you're almost THERE!' and 'You're MAKING it!'</p><p>I had the feeling that I was supposed to be doing something. I started grasping old thoughts, and tiny fragments of old memories. I was remembering that I was Me.</p><p>As SOON as I remembered that I had smoked salvia, I was finally 'squirted' out of this strange tube-type structure, back into a Las Vegas hotel room. The CD player was now near the end of track 5, which meant I had been 'under' for about 10 minutes. It was definitely the longest-lasting salvia trip I'd had. I laid there until the end of track 5, taking it all in.</p><p>I found it fascinating that the entire trip was simply me trying to remember what I had done to myself, and that as soon as I'd remembered I was a human who smoked salvia, I was 'born' back into reality.</p><p>Within 10 minutes of leaving that restroom I was back out on the casino with my friends, feeling 100%!</p><p>I wouldn't recommend tripping on salvia alone unless you've tried it quite a few times and have gotten used to how disabled it can make you. Be sure to read as much as possible about this drug, but be ready to throw most of it out the window when you take that hit.</p>"
}
