{
 "title": "Rolling Blunts",
 "author": "Hydro",
 "citation": "   Hydro. \"Rolling Blunts: experience with Cannabis (ID 12606)\". Erowid.org. Mar 14, 2007. erowid.org/exp/12606",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  joints/cigs",
   " ",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "12606",
   "Not Specified",
   " ",
   "Not Given",
   "Mar 14, 2007",
   "7777",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThis is not an Experience, but I could not find anywhere suitable to share this information. I have read the article about rolling blunts, and thought that much more information was needed on the subject.</p><p>First thing's first, as you may or may not know, there are many types of cigars that can be used for rolling blunts. Not just the Phillies Blunt. I'll divide these into 2 basic catagories. </p><p>The first category is the 'Phillies' type of cigar, these are usually labeled as 'Blunts' on the box, but not always. These include Phillies Blunts, Phillies Titans, White Owls, Tampa Gold, Swisher Blunts and similar cigars. </p><p>The other basic category I'll call the 'Dutch Master' Category. This is my preferred type of cigar, because it's neater, doesn't fall apart as easily and burns nearly twice as long as a Phillies. The most popular cigar in this category is the Dutch Master Corona Deluxe. Others are the Garcia y Vega English Corona and the Dutch Master Corona Maduro, and any cigar labeled 'Corona' anything on the box. </p><p>Now to break it down. The difference in these categories is the way these cigars are rolled at the factory. The 'Phillies' category consists of a very thick inner leaf with a very thin outer leaf. These blunts are rolled in the standard fashion, like a joint. The 'Dutch Master' category of cigars is made of a thinner inner leaf which is spirally wrapped with a tobbacco leaf on the outside.</p><p>These two types of cigars must be rolled differently to produce satisfactory results. </p><p>No matter which type of cigar you're using, the first thing you want to do is lick the entire cigar to get it moist. With some types of cigars you really have to make love to them with your tongue. Others require less saliva to get the job done. Experiment with different types to find your personal favorite. </p><p>Next bite the 'ass' off the cigar. Just bite about an inch off the rounded end of the cigar. Throw this away, you don't need it. </p><p>This step is where the two categories of cigars really differ. If you've identified your cigar as a Phillies type, this step is pretty simple. </p><p>Starting at the end you've just bitten off, hold the cigar between your fingers vertically(standing up) with the other end pointing at the floor. Spread your thumbs apart so you tear the leaf of the blunt in an even fashion. This is called 'cracking' the blunt. Continue until the cigar has an even tear the whole length of it. Now throw the inside tobacco or 'guts' away. Take the remaining leaf, this is what you'll use to roll the blunt.</p><p>If you've identified your cigar as a Dutch Master type, this will be a little trickier. Start the same way, by licking the cigar. Bite the ass off of the blunt. With this type of cigar, DO NOT crack it like a Phillies type.</p><p>Look very closely at the outside leaf, and you'll notice a spiral line going around the cigar. This is your outside leaf. Find the end of the spiral line at the end of the blunt you bit off. Pick at the end untill you loosen the outside leaf. It comes off in a spiral. Pull it off. Save the outside leaf and the remaining part of the cigar. </p><p>Ok, now crack the inside leaf just like a Phillies, and dump the guts.</p><p>Take the outer leaf and lick one side until it's wet. Set it aside. Take the Inner leaf and blow onto it with your hot breath. This moistens it enough to start rolling.</p><p>Now no matter which type of cigar you have this step will be the same. Take the leaf (inner for a Dutch Master) and sort of half roll it and put the weed inside (just like a joint). Fold the side closest to you over the weed and hold it with your index fingers. Lick the remaining side well and fold it over the other side. Now lick your lips and and use them to help fold while holding the ends with your fingers. An additional lick is sometimes needed to secure the leaf. If you're rolling a Phillies you're done. </p><p>If you're rolling a Dutch Master, you're about halfway done. Now take the outer leaf and and lay it on a table, or other flat surface, or your knee if you don't have anything else. Make sure the wet side is facing up. Now take the inner leaf with the weed rolled inside and put one end on the end of the outer leaf perpendicularly(crossewise). Take both leaves and roll the outer leaf spirally around the inner leaf just like it was originally rolled on the cigar. When you get to the end just twist it and bite the excess off. Now you're done. </p><p>To improve the flavor and smokability of the blunt, you might want to take a lighter and 'toast' the blunt. This is drying the outside of the blunt with the flame. Be careful not to burn or cook the blunt. </p><p>All this may seem kind of clumsy, but with practice, you'll be rolling like a Dutch Masta in no time. You'll also find that a blunt is a great way to smoke, no pipes or anything to carry, no pack of papers, they hold almost a 1/4 oz., and it burns forever. I've rolled blunts that lasted an hour. Experiment with different amounts of saliva and different tightnesses of the blunt until you find what works best for you.</p><p>Now put one end in your mouth and light the other end. Inhale until blazed.</p><p>Peace... Hydro</p>"
}
