{
 "title": "It's Like Nitrous Times Infinity",
 "author": "7",
 "citation": "   7. \"It's Like Nitrous Times Infinity: experience with Inhalants - Duster (ID 12602)\". Erowid.org. May 23, 2007. erowid.org/exp/12602",
 "substance": "Inhalants - Duster",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 12602",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 23, 2007",
   "Views: 21835",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] </p><p>A very long time ago, I told myself that I'd never do any drug besides weed. Weed made me happy, weed was relatively easily obtainable, and I thought I'd never have the need for anything more than that. I was wrong. I am now in my second semester of college, and am just starting my 'experimental' phase. And the current thing I'm experimenting with is inhalants. Yeah, I know this is bad, and especially after the inhalant of which this report is concerned with, I fully plan to stop as soon as I can. Because I have a feeling that it's probably pretty bad for my body/brain. But man, these things are fun!</p><p>Anyway, I've tried nitrous whippits (my fav) and a couple other things, but I just read earlier today that the canned air computer dusters can be used to get fucked up. (I will warn you that as nitrous is my fav and probably the most popular, I will be comparing the effects of the duster to those of nitrous just because that is the only thing that even comes close to it.) So I trotted out to my local Circuit City and obtained a can of Interact brand 'Air Blaster'. It was about $8 including tax. If it matters, the chemical components section of the label says: '1,1,1,2-Tetrafluorethane' with a CAS of '811-97-2' (whatever that means).</p><p>Today's search for inhalants was started because my entire CD book thingy was stolen sometime last night, about 40-50 CDs that I've collected over several years. Needless to say, I was pretty pissed, and wanted something to raise my spirits. Being out of nitrous and low on funds, I decided to try the duster thing. So I went out and purchased it and came directly home. Not wanting to freeze my lungs as had been mentioned in a couple other reports, I just used my trusty nitrous balloon to inhale from - I filled it with about the same amount of duster stuff as normally comes out of a whippit, so I could see the difference in effects from roughly the same dosage of each. Using the same method as I use nitrous (exhale completely, then inhale the balloon slowly, and hold my breath as long as possible) I huffed the duster from the balloon. And the results were absolutely breathtaking!</p><p>As I was breathing it in, I noticed a very faint burning sensation in my throat, and it tasted fainly like the way rubbing alcohol smells. Then the effects started hitting me. They came on faster and harder than nitrous ever had. Everything in my field of vision started getting bright flashy spots all over it. Everything looked like I was looking at it on a TV with the contrast turned way up (light things were way lighter, dark things were way darker). The music I was listening to seemed to come from a very long ways away, even though the speakers are right behind my head. Every sound and movement was kind of echoey and vibratey, just like nitrous, but it was so much more intense! In one person's nitrous report they compared this effect to helecopters - yeah, that is a pretty accurate portrayal, but it sounded like I had an entire army of helecopters coming from inside my head.</p><p>Then everything started spinning and flying, as if I was underwater doing an infinite number of backflips. And that is the last definite separate effect that I remember. It was just a combination of the flashy lights and echoes/vibrations and flying/falling forwards and all sounds coming from a million miles away. And it stayed like that for at least two to three minutes, much much longer than nitrous.</p><p>Finally I started to come down, with all the effects gradually subsiding. I did two more balloons of the same amount after that (total 3 balloons, within about 15 minutes).  It is now about an hour after I did the last one. Things still feel kinda 'not right' occasionally, but it's nothing to really be worried about (I hope). My eyes feel dry, and like there's more pressure than normal behind them. Only a very minor headache that seems to be decreasing as I write this, and my throat/lungs feel surprisingly normal considering how the stuff tasted and felt going down.</p><p>I have no plans to do anymore today, though I will probably eventually finish off the can either with myself or with a friend. And after that, I'm going to try very hard not to get anymore and just go back to nitrous, since I'm sure this stuff is pretty evil in the long run.</p>"
}
