{
 "title": "Blasted Into the Carnival",
 "author": "Sal Via Satellite",
 "citation": "   Sal Via Satellite. \"Blasted Into the Carnival: experience with Salvia divinorum (5x extract) (ID 12608)\". Erowid.org. Feb 16, 2002. erowid.org/exp/12608",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12608",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 16, 2002",
   "Views: 17844",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSetting: My apartment livingroom, scattered with half-packed boxes due to an upcoming move.<br>Set: Happy, somewhat excited, looking forward to relocating to a new city, a bit anxious and apprehensive about trying Salvia for the first time.<br>After reading almost everything I could online about Salvia over the past week, including hundreds of trip reports, and after some brief meditation, I decided to smoke some without a trip sitter (BIG MISTAKE #1 -- no sitter!) in my own apartment, which I can't wait to move out of (BIG MISTAKE #2 -- bad setting!).<br>Being very experienced with mega-doses of LSD, mushrooms, pot, and many other legal and illegal drugs too numerous to mention, I figured I could handle any trip any new drug had to offer (BIG MISTAKE #3 -- overestimating my ability to handle an untried substance and underestimating the power of this plant!).<br>First, I made a sign that read, 'PLEASE DON'T GO OUTSIDE -- YOU JUST SMOKED SOME SALVIA -- RELAX AND IT WILL ALL BE OVER SOON -- PEACE.'  I taped that sign over the doorknob, and this was the smartest thing I had done, since it probably saved me some embarrassment.  I also placed a large inflatable bed over the door in order to remind me not to go wandering down the hallways of my apartment building while tripping.  I figured that seeing the inflatable bed and the note would be enough to keep me safe inside -- and they were, but just barely, as you'll see.<br>I put a pinch (perhaps less than a tenth of a gram) of 5X in a homemade pipe (BIG MISTAKE #4 -- I think I smoked too large a dose for my first time), sat in the middle of the floor with pillows behind me, in my semi-darkened livingroom, no music playing.  One huge hit, inhaling deeply and keeping the lighter on it the whole time as per all the instructions ... counting off the seconds in my head ... I think I reached 15 when I totally blacked out.<br>Details of the actual trip are very sketchy, EXACTLY like some wild, half-remembered dream.  I was in a carnival or circus, strange geometric patterns of neon light interspersed with absolute darkness everywhere ... and people surrounding me, seeming to pull me in all different dirrections at once, while I was laid out on some sort of invisible stretcher, as if they were levitating me.  Although they were pulling me in different directions, their movements seemed to be coordinated somehow ... hard to explain.<br>I started to panic and get VERY paranoid, afraid I was being taken to a hospital and also afraid I was in trouble for having taken an *illegal* drug which I was freaking out on.  There was no memory of having smoked Salvia, and therefor of course no memory that the drug I had taken was in fact legal.  (I feel that the typical American conditioning that 'all drugs are bad' coupled with the issues of illegality had a lot to do with this aspect of the trip.)<br>Somewhere within and during this insanity, a huge, greenish, female, disembodied face, encircled by what looked like curled petals of tin foil, appeared above me.  This must have been the Spirit of Salvia so many others have mentioned.  This Salvia-flower-head communicated to me (I don't remember her speaking, but I got the message nonetheless) -- I wasn't ready to handle all she had to offer.  She did not seem angry with me, in fact she was smiling, seemed calm and helpful and loving, and she began to lead me back to reality -- even though I was still convinced I was being taken to a hospital and in some sort of big trouble for having taken a drug.<br>At this point I came awake, or almost awake, enough to stand up, or try to stand up, but I still felt very heavy and somewhat paralyzed, and still felt as if the 'carnival people' were pulling me in different directions, mostly downward and sideways.  Very paranoid, I stumbled around the living room for a bit, half-in and half-out of the hallucination.  I removed the inflatable bed from the doorway, saw the note taped to the door, ripped it off and crumbled it up and threw it aside -- but THANKFULLY I did not venture into the hallway ... I know I wanted to but still don't know why I did not.  Perhaps the note had helped in some way after all, though it seemed to mean nothing to me while tripping -- I was fighting the gravitational effects and the carnival people, simply wanting to escape the madness.  I think I realized, just before I opened the door to the outside, public world, that that would be a bad idea, and began to reintegrate with consensus reality.<br>I managed to stumble over to my couch, still feeling as if I had gotten in some sort of deep trouble, but the effects were beginning to wear off.  I was sweating and scared out of my mind, trying to put reality back together again.  Slowly, over the course of ten minutes or so, that was exactly what I did.  It took a while to convince myself that all was well, that it was all just an hallucination, a bad trip.  The tingling and the sweats subsided and I began to pace all over the house, back and forth, mumbling softly, 'Oh my god ... holy shit ... un-be-fucking-lievable!' over and over, for a good half an hour.<br>In conclusion, this was THEE most intense trip I ever had.  I'm guessing that the people in the hallucination, the ones pulling me in different directions, represented the different aspects of my personality, each trying to be dominant.  (Note: I am an artist, musician and infrequently, a writer.)  In the future, I will DEFINITELY use a sitter and approach this plant with more caution and respect.  I feel there is much more to be learned from Salvia and the Flower-Lady, particularly in the areas of dream-research, introspection and shamanic studies.  Salvia is not a 'fun drug' and should not be used recreationally or to simply 'get high,' but if anyone out there is interested in experimenting with it for the 'proper' reasons, I strongly urge them to do so.  And DO listen to what the Flower-Lady has to tell you -- don't take her benevolence for granted, and don't mistake her kindness for a lack of power -- if what you really need is a good kick in the ass, she can easily and powerfully administer it -- with a smile :)<br>'Powerful' is perhaps the single best word to describe the Salvia trip.  Be careful, be safe, and be happy.\n\n\n"
}
