{
 "title": "5-HTP May Potentiate Cannabis",
 "author": "sfrumS",
 "citation": "   sfrumS. \"5-HTP May Potentiate Cannabis: experience with 5-HTP & Cannabis (ID 12627)\". Erowid.org. Feb 16, 2002. erowid.org/exp/12627",
 "substance": "5-HTP & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)",
   "  T+ 1:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:45",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 12627",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 16, 2002",
   "Views: 39191",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was in Wal-Mart the other day, checking out their vitamin and supplement section when a box labelled 5-HTP caught my eye.  I recognised the name but couldn't remember in what context.  I bought the 5-HTP (30 caplets, 50mg each) for about $8.00 (US).  I researched the compound online and found that it is a direct precursor to serotonin and is often used to preload for MDMA trips or used in conjunction with other substances that deplete serotonin.  </p><p>I am a regular cannabis user--it's kind of a hobby for me--and I wondered what would happen if I preloaded with 5-HTP for a smoking session.  Here is what happened:</p><p>T+0:00-->ingested 4 5-HTP caplets on a semi-full stomach.</p><p>T+0:20-->a tightness in the face (which I usually associate within the first few tokes of cannabis) is felt along with a dry mouth (also associated with cannabis). (*NOTE* At this point, I had not yet smoked any cannabis within 48 hours so I attribute the afore-mentioned symptoms to the 5-HTP alone.)</p><p>T+1:00-->same dry mouth/tightness in face but now experiencing some mild relaxation and increased metal activity (and by 'increased mental activity' I don't mean psychedelic thought-racing or a head trip--but merely a more in-depth internal dialogue--very mild but not placebo).</p><p>T+1:30-->same symptoms, maybe more of a relaxed feel.  It is now time to smoke a cone of some reefer--West Virginia's finest (and by the way--to all of you who think that West Virginia is totally lame and has nothing to offer its occupants--you're mostly right...BUT--you haven't tried our weed!).  Effects from the reefer are felt almost instantly, of course but as I take a few more hits, I notice that I'm getting way more stoned than I should be getting given that I've only had about five hits so far.</p><p>T+1:45-->as stoned as I feel, i should probably just want to chill out and drool on myself or something.  However, I feel kind of hyper (pretty much like when I first started smoking weed but with no paranoia).  I continue to smoke herb and I just keep getting higher.  This is strange because when I usually smoke a lot, I get to a point where I just keep getting more tired as opposed to getting more stoned.  Tonight, that is not the case.</p><p>T+2:15-->holy crap--I am so freaking stoned.  I am having mild hallucinations, especially vivid CEVs ranging from lattice-type patterns and swooshing colors to mental images of people and objects.  It is not an LSD or mushroom type visual experience but definitely uniquely pot-like.  It has marijuana written all over it.  Head trip is minimal but body sensation is strong.  Some spasming (especially hands and legs) happens on occasion--nothing too bothersome but could get annoying.  I know that some people experience this with weed alone so i blame is on the quantity of weed that I've smoked tonight (approximately .5-1 gram which is a lot for me).</p><p>T=3:00-->BEDTIME!  It's getting late so it's time to hit the hay.</p><p>Moral Of The Story-->5-HTP seemed to play a significant role on the effects of marijuana.  i could be wrong about that but I'm absolutely sure that this particular smoking session was totally different than any other that I've experienced--actually, I take that back--it was QUITE similar to the first few times that I smoked weed, in the way that I felt somewhat hyper and had an intense experience.  Anyone who habitually smokes weed knows what I'm talking about.  'There's no time like the first time...'--well maybe there *IS* with the correct chemical intervention.  </p><p>I have repeated this experiment with varying doses of 5-HTP always taken 1.5 hours before smoking the herb.  I have tried doses as low as 50 mg and as high as 550mg.  More spasming and general jitteryness was experienced as the dose increased but enhancement of the cannabis high was noted at even the smallest dose of 50HTP (50mg).  This does not seem to be a placebo effect but I would be interested in hearing about any other experiences involving 5-HTP and cannabis used in conjunction to serve as confirmation (or shoot-down) of my experiments.</p><p>Peace, Love, and let's all do our parts to bring an end to the 'war on drugs'.</p>"
}
