{
 "title": "Oh My... Entity Contact Once Again",
 "author": "Dr. E",
 "citation": "Citation:   Dr. E. \"Oh My... Entity Contact Once Again: experience with Salvia divinorum (5x extract) (ID 12633)\". Erowid.org. Mar 28, 2007. erowid.org/exp/12633",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12633",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 28, 2007",
   "Views: 3104",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI just came down an hour ago from my first trip for over a month. It's been maybe 10 trips and many months since my last encounter with the entities. Tonight I encountered them for the 4th time total. I'm quite shocked. The first three times they have been friendly, though always kind of childishly insisting that I follow them to somewhere. I don't know where, only that I feel they want me to go deeper, and to another place. I have always resisted, saying to them, or thinking to them actually 'No,no, sorry, I can't go, I have to stay here, I know it would be really cool to go there, yes I know, I can't, sorry'. They have sort of accepted that I don't go, although with, it seems, some kind of dissapointment.\r\nOne of my greatest goal with this plant has been to figure out who and what these enteties are, since the first time I met them. 'They' actually seem to be 'one', like a hive mind. They seem fractal, or faceted, though every facet reflects the same being. It's impossible to describe how they look, because there's so much more to them. They don't have a fixed shape or anything. This is how the enteties appear. And always wanting to take me somewhere or show me something.\r\nBut this time I made a new discovery; I now believe that they are really not faceted reflections of the *same* being/consciousness, but that they actually *are* different beings. Different, but with the same intentions or 'orders'. They seemed to work as a team, cooperating, although I could sense that they were individuals.\r\nOn my first encounters they have been friendly and insisting that I come along, and then the effects usually fade after a while. This time however, they were serious about it. I have just installed Winamp and several plugins for the first time. I put on the an ambient/meditation song and started the plugin 'eXess'. As the effects came I got lost in the visuals in Winamp, and that's were they first appeared, through the visuals. To my surprize, because I had not expected the trip to reach this level, I was aiming for a light experience while enoying the Winamp plug ins. But I smoked really effectively.\r\nIt was as if the screen and the visuals suddenly became conscious, alive and living. Not the screen in itself, but the stuff the screen is made of. The screen no longer seemed like solid matter, it seemed like it was made of mind stuff, as if the fabric was consciousness. The whole room became like this, as it often does when I'm on Salvia. I actually said hello to them when I saw them, but they obviously had no time for chit chat! They immediately urged me to come with them, but I resisted as usual. Then they went from urging to plain forcing! It was as if one being tried to pull me through the music, another through my vision, and one was in the space around me like a gas, but not just floating there, it *came out* from there, as if it was hardwired to another place through the space it occupied.\r\nI had to resist all I could, I was really afraid that I would not be able to resist, because their will was extremely strong, and they seemed angry or cold. They were really working on me. I resisted until the effects started to fade.\r\nThis being the 4th time I've encountered them I now think I'm accepting their existance. THEY WERE REAL!!! What more can I say? That's what I experienced, I witnessed it. They were there, completely alien and conscious of me. It happened, I can't deny it anymore. I was there. And they have been the exact same beings every damn time.\r\nI'm starting to fear Salvia, that's why it has been so long since the last time. But I won't back out, I'm going to figure them out. I'm going to speak to them, I'm going to ask them who they are, where they come from and what they want, and I'm going with them some day, I have to.\r\nTHE DAY AFTER\r\nI've had a nights sleep, and some hours thinking. I've been thinking a bit. Our mind has been moulded by natural selection for millions of years to perceive *this* version of reality. But this is only *one* version. With a different brain I could see the same reality but from another perspective, like for instance a snail or an insect does. They have a totally different perception of the world, but it's just as valid and real as ours. The common factor is that both the brains of snails and humans have evolved naturally to work as effectively and smoothly as possible, grounding us in *this* perspective. Evolution has shaped the brain so that it interprets various aspects of reality as vision, sound, space and time so that the species can interact with their environment in the most beneficial way for survival and reproduction.\r\nBut when I alter the brains natural balanced chemistry with for instance Salvia, then it no longer interprets reality way it's meant to. Essentially I am in chaos land. With chaos I mean a system that seems random and unpredictable yet still displays an inherent order, like fractals. I am no longer grounded in the natural perspective of reality, I actually get to see the world with a whole new brain. I sometimes think of the brain as a kind of filter; letting some perceptions pass and blocking out others that would be an evolutionary disadvantage. When I insert the 'Salvia filter', there's no telling what can happen.\r\nMy point is, the reality I perceive with the new brain exists. If it didn't exist, then I wouldn't experience it. Even though it's very different from my natural state of perception, the perceptions are just as real. The 'Salvia filter' lets through new aspects of reality, and blocks or alters the usual ones. And I believe the entities are one of these new aspects that the filter opens for. They don't seem any less real to me today as they did during and after my experience yesterday.\r\nEverything is interconnected, all aspects of reality. Our consciousness as well as our body is interwoven with the entire cosmos. Ultimately there are no divisions, only psychological divisions created by evolutionary forces to enable us to function the way we normally do. So I don't find it too hard to accept that there may be other conscious beings, hidden from our natural perception. Alter the mind with Salvia: Wham! There they are. The walls have collapsed.\r\nI may be on deep water here, but I have decided to take it at face value. I won't come one step closer unless I make a choice. I have only two choices; either I accept it or deny it. There is no third option. So, with my present worldview, I finally feel I can honestly accept their existance.\r\nI wonder if they are the same as the 'DMT-elves', just that with Salvia we get to see them from another perspective?\n\n\n"
}