{
 "title": "A Lesson in Variety of Experience",
 "author": "zombie",
 "citation": "   zombie. \"A Lesson in Variety of Experience: experience with DXM & 5MeO-DiPT (ID 12648)\". Erowid.org. Feb 16, 2002. erowid.org/exp/12648",
 "substance": "DXM & 5MeO-DiPT",
 "bodyweight": "54.5 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "DXM",
   "(pill / tablet)",
   "  T+ 0:40",
   "15 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12648",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 16, 2002",
   "Views: 8488",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n   I could only find one trip report on this combination, and it seemed to be a bad thing... but from my experiences on foxy and dxm individually, it seemed they would make a good combination.</p><p>   I took 10 30mg DexAlone pills, they were at one pharmacy, just one box out on the shelf, but they are just dxm.. heh, drove to the party so at T+40min. I ate the foxy, then I waited in line... started to feel a headchange, and get the euphoric body feeling from the dxm... i went down and danced it felt *great* to move, this was the DXM, eventually the foxy crept on in and everything started waving in my vision... this was at T+3 hours.. Mmy body felt incredible, for stretches I would just sit there lolling about, at the peak i couldn't stop from twitching and just slouching in these chairs and looking out over the dance floor </p><p>    It was a great experience! for the most part, I could sit down and close my eyes and lose myself in the visuals, riding the music like a snowboard, the music was connected to the hallucinations flying at me somehow...  i could also just stand up and felt all floaty and euphoric, things were wavy, but i could still talk to people if I wanted to. so yes, a very good experience, the hangover wasn't all that bad either as Irecall...</p><p>   So yes, drugs definitely affect people differently.</p>"
}
