{
 "title": "Consciousness Altered",
 "author": "Shard",
 "citation": "   Shard. \"Consciousness Altered: experience with LSD (ID 12658)\". Erowid.org. Jan 26, 2005. erowid.org/exp/12658",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "12658",
   "Male",
   " ",
   "Not Given",
   "Jan 26, 2005",
   "5089",
   " "
  ]
 ],
 "report": "<p>So my experience begins on a cold New England night.  The sky is clear and the stars are shining brightly.  It's about 8:30pm when I decide that I should take the remaining acid from a 10 strip I bought a while back.  I was alone in my home, parents had gone away and my brother had wondered off to who knows where.  I felt that being alone for a trip could be a growing experience for me, since almost all my previous psychedelic experiences involved fairly large numbers of people being around.  My intension for this trip was to explore myself, my mind.  </p><p>So I slip the blotter onto my tongue, with that pre-trip tension in my stomach.  Then I go downstairs to my living room, and pop on the TV.  It's about 45 minutes later I notice the first effects.  The windows in the room had white lacy curtains with flower designs.  These flowers began to swirl majestically, while the curtains swayed in the acid breeze.  Then I looked at my couch, it was divided up into perfectly symmetrical squares that were all rotating counter-clockwise.  So I thought, 'well here I go'.  I only watched TV for another 10-15 minutes before I decided I should go to my room, throw on some music, turn the lights off, and lay in bed.  </p><p>I chose the new Tool album Lateralus as the soundtrack to my journey, and this suited the trip fine.  The album flew by, its almost a full 80 minutes long, but for some reason it went by very quickly.  So instead of time slowing like it should it went much faster at least for that 80 minutes.  But during that time I saw some of the most beautiful CEV's that I could ever have imagined.  The only one I remember vividly was what appeared to be some sort of a fish creature, that had no real head, and its whole body swayed through the liquid colors.  Around this time I began to think about my life.  I came to many conclusions about what I should do and where I should direct my life.  I also figured out what I percieved God really is, but I won't go into that.  I don't want to rant on about things that I think are nearly impossible to explain.  If anyone knows the album I was listening too, the last track 'Faaip De Oiad' is a creepy phone message from a man talking about aliens with loud jarring music.  When this came on I felt an incredible fear rush throughout my body, but it went away as soon as the song ended.  </p><p>After the cd was over, again it went by so quickly, I turned the lights in my room on.  My god I was tripping hard.  Everything was divided into symmetrical shapes, and were spinning wildly.  A poster on my wall, a print of a Alex Grey painting 'Praying', was very cool.  The persons veins in the painting were pulsing, the person seemed to be living. I then put on a Sonic Youth cd, listened to one song, got a jacket on and went outside.  I layed down inthe grass facing the sky.  The stars were absolutely stunning.  They were sparkling, and each star would change color frequently.  And if I focused I could make the sky become symmetric, divided into 3 sections.  I spent quite a while out there.  But when I came back to my room...the same song was playing on my cd player.  I guess the cd was on repeat, but that totally shocked me at the time.  I thought that I had walked outside, layed down and got back up, all in the span of a few notes.</p><p>The next few hours are pretty hazy, I know I watched some TV.  And I also know I felt no need to explore my mind anymore then I already had that night.  I felt I had all the answers I would ever need.</p><p>The trip really did change the way that I actually thought for a a few weeks.  It is hard to explain, but the way I thought was actually transformed.  The biggest effect was that nothing petty even fazed me.  I never felt like arguing about anything with anyone for any reason, that all felt below me.  But I noticed that that effect wore off over time, and I feel like my old self.  I don't know if thats good or bad though.</p><p>Overall this was a great experience, not my first, and definately not my last experience with this powerful drug.</p>"
}
