{
 "title": "Ephedrine (Ephedra) Dose Comparison",
 "author": "Raoul",
 "citation": "   Raoul. \"Ephedrine (Ephedra) Dose Comparison: experience with Ephedrine, Caffeine & White Willow Bark (ID 12654)\". Erowid.org. Nov 19, 2004. erowid.org/exp/12654",
 "substance": "Ephedrine, Caffeine & White Willow Bark",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12654",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 19, 2004",
   "Views: 30811",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have taken ephedrine (ephedra) products over 50 times over the past year.  Ephedrine is legally available from fitness and vitamin retailers in the form of energy supplements or weight-loss products.  The pills I have taken usually contained 25 mg of ephedrine (from ephedra), 200-300 mg of caffeine (from guarana seed or kola nut extract), 200 mg of white willow bark (natural form of aspirin), and a proprietary blend of other various herbs.  I have also consumed it as an energy beverage with similar amounts of these substances.  <br>Consumption of one pill (25 mg ephedrine) causes markedly increased energy levels well above those produced by caffeine-only products.  The bronchodilating effects of ephedrine are noticeable at this dose, and it is relatively easier to breathe and more oxygen is taken in with each breath.  Because of this, it is easy to become light-headed from heavy breathing, heavy physical activity, or even standing up too quickly.  Pulse rate is increased dramatically at this dose, bringing my resting pulse from 75 beats/min to 115 beats/min.  Intrestingly (but not suprisingly), cognitive ability, memory retention, attentiveness, quickness of thought and wit, and sociability are all increased.  This dose will not allow me to sleep for about 10 to 15 hours.<br>Consumption of higher doses (two pills, or 50 mg ephedrine) produces these same effects, but to a considerably greater degree.  I have found this dose to instate feelings of light euphoria, general well-being, increased happiness, and sensations of power and confidence.  I would not recommend taking this dose until a tolerance has developed to 25 mg or even 10 mg doses.  50 mg doses will easily keep me awake for 20 hours or more.<br>The stomach discomfort I get is generally characterized by slight nausea (increasing with increased doses), especially when consumed on an empty stomach.  Tolerance to this (and the other effects of ephedrine) usually develops in about one week if a constant dose is taken every day.  I have taken 75 mg of ephedrine (3 pills) only once, and the stomach pain was enough to dissuade me from taking this dose a second time.  [Erowid Note: It is unknown if the stomach upset reported is due to the ephedrine or other substances in the product described.] I have talked with high-tolerance individuals who have taken up to 100 mg (4 pills) recreationally, who say that these high doses will keep them awake for atleast 40 hours.  It should be noted that doses higher than 100 mg in a 24-hour period greatly increase the user's risk of cardiac arrest or life-threatening arythmia.  <br>I have found the adverse effects of ephedrine (nausea and even headaches) to increase greatly when combined with marijuana or alcohol.  Ephedrine is a powerful appetite suppressant, and doses of 25 or 50 mg will curb my desire to eat for 7 to 12 hours.   <br>As an interesting sidenote, ephedrine can be used VERY effectively for  waking up in the morning.  If I swallow 25 mg twenty minutes or less before falling asleep at night, I will be instantly energized by the time my alarm clock goes off the next morning.  I have found myself instantly able to get up and get going with no residual fatigue whatsoever using this method.  It should be noted that if I take ephedrine at night and do not fall asleep within 20 minutes, I am likely to be awake all night long.  Not being able to fall asleep is a torturous experience, so I make sure I am tired enough to fall asleep quickly.  <br>-Raoul-\n\n\n"
}
