{
 "title": "5-HTP Cannabis Preloading Double Blind Study",
 "author": "xerxes",
 "citation": "   Xerxes. \"5-HTP Cannabis Preloading Double Blind Study: experience with 5-HTP & Cannabis (ID 12676)\". Erowid.org. Feb 10, 2003. erowid.org/exp/12676",
 "substance": "5-HTP & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Tryptophan - 5-HTP",
   "(capsule)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12676",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2003",
   "Views: 38198",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n[Erowid Note: Would the author of this report please contact sage@erowid.org.  We have a question about the report.]\r\nUpon hearing of a possible synergy between 5-HTP, a serotonin precursor, and marijuana, I obtained a bottle of the above mentioned suppliment from a local grocery store in the vitamin section.\r\n100mg of 5-HTP was given to a friend, and he was instructed to put this substance in a 00 size gelcap.  He then filled a second gelcap with sugar.  He marked the gelcaps with a #1 and a #2, taking note of which number gelcap contained the 5-HTP.\r\nA second friend recieved the gelcaps, and was not told which gelcap contained the 5-HTP.  His job was to randomly administer to myself the gelcaps.  I would swallow the pills with eyes closed, so as not to accidently distinguish between the appearance of the sugar and the 5-HTP however subtle.\r\n3 sessions were to take place, each occouring 1 week after the previous.  I abstained from all marijuana use for 1 week before beginning the study, and I haden't used any other drugs for at least 6 months, excluding nicotine and caffeine, which were present throughout the studies.  The marijuana was in the form of 3 medium-small joints, all originating from the same bag.  The buds were finely chopped, mixed, and weighed into 3 equal piles, and rolled.\r\nControl session-\r\nThe first joint was smoked.  Nothing much to note, moderate quality marijuana, the usual effects.  The Marijuana is definatly not laced with anything, and is the same as what I am used to.\r\nsession #1-\r\n(later determined to be the 5-HTP session)\r\n0:00 - Gelcap ingested on empty stomach.\r\n0:30 - No alteration is noticed from the gelcap.  At this time the marijuana is smoked.  I definatly feel different than with just the marijuana.  Perhaps placebo, perhaps not.\r\n0:35 - Now I'm sure I feel different.  The high is faster, and more psycadelic compared to a normal marijuana high.  I feel almost speedy, and euphoric.  Very similar to some of my first pot experiences.  If this is a sugar pill, I have to invest in some sugar.\r\n1:00 - I still feel very 'up.'  Interesting, the high has mellowed a little, but the main effects havent really declined that much.\r\n3:00 - 3 hours into the experience, and I'm definatly near baseline.  The duration of the high seems to not have been affected by the pill I took.  \r\nconclusion - I believe this was the 5-HTP session, but I could always be wrong.  Marijuana was definatly enhanced by whatever was in that pill.\r\nsession #2-\r\n(later determined to be the placebo session)\r\n0:00 - Gelcap ingested on an empty stomache.\r\n0:30 - No alteration noticed from the gelcap.  At this time the marijuana is smoked.  I feel a little different than with just marijuana.  Maybe I was wrong about the last session being 5-HTP.\r\n0:35 - Now I feel just the regular marijuana high.  Nothing really different.  No speedy feeling, no euphoria other than the expected from pot, nothing. \r\n1:00 - I'm convinced this is a placebo. I don't feel any different than with the control study.\r\n3:00 - Near baseline\r\nSummary-\r\nIt seems that preloading with 5-HTP does have a marked and definate effect on the pharmacology of marijuana.  The placebo and control sessions were nearly identical, while the 5-HTP session was marked by an enhanced high.  The enhancement took the form of increased euphoria, more intense high, and speedier, less tired/sleepy, mental state.  5-HTP is readily available from vitamin and grocery stores, and is not extremely expensive.  It provides a unique and interesting synergy with marijuana, and definatly warrants future exploration.\r\nNo more wars, drug or otherwise.\n\n\n"
}
