{
 "title": "Pain, Nausea and Lights",
 "author": "Arrdvark",
 "citation": "   Arrdvark. \"Pain, Nausea and Lights: experience with MAOI, & 5-MeO-DMT (ID 12730)\". Erowid.org. May 20, 2002. erowid.org/exp/12730",
 "substance": "MAOI, & 5-MeO-DMT",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MAOI",
   " ",
   " ",
   "7.0 mg",
   "insufflated",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12730",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 20, 2002",
   "Views: 11481",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nSo, my friend Q and I finally got our hands on the stuff. Even bought a crakpipe for the occasion. Too bad it's a wonky pipe and we're both very lacking in crak-smoking skills. After several attempts at smoking it, and minimal success, we decide to eat some MAOI's and try sniffing it. We made sure to invite over a babysitter (I reccomend having one that won't leave you alone every 5 minutes for a cigarette, and one who is actually more experienced than you with drugs) and finally sniffed it. Oh, and if you like the sensation of having your nose pierced over a 15min period with increasing force, then go right ahead and insufflate it.\r\nIt came on quickly with a feeling of pressure on my head and something inside me. Everything started looking, well, spooky. Dark and shimmery, kinda ghostly. Q and I seemed to conect on a whole nother level where we kinda just reached an understanding about issues and life in general. There was basically no need to talk because we could just sense what the other was feeling. Not too much visual activity, never hit me too hard (probably because of all the prior smoked attempts) but the nausea sure was incredible. I don't know how to explain it other than it felt like something was horribly wrong with my stomach. After attempting to relax and trying to focus on other things, I gave up and tried to vomit. Nothing doing. So i just stuck it out dry-heaving the whole time.\r\nWhen it had worn off to the point of mobility again, I went to my window to get some air. It was a completely overcast day, enough to not be able to see a single plane. Yet I saw a bright gold light, at my level but way off in the distance (my house is on a hill). It floated diagonally then disappeared. I called my friend over but it was gone. He left the room and I looked out my window again, there was the same gold light, where the other one had disappeared, and the same thing happened. I got really scared and hid in my bed for a period of time before returning to normality (or however normal one can be) around 20-30mins later.\n\n\n"
}
