{
 "title": "Swimming with Foxy",
 "author": "Ats",
 "citation": "   Ats. \"Swimming with Foxy: experience with 5-MeO-DiPT (ID 1275)\". Erowid.org. Oct 10, 2000. erowid.org/exp/1275",
 "substance": "5-MeO-DiPT",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "6.0 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1275",
   "Male",
   " ",
   "Not Given",
   "Oct 10, 2000",
   "Views: 5947",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nBackground:</p><p>I am a 23 year old male student.  I have previously tried Cannabis, Ecstasy, LSD, Salvia and DXM. So far, I have spent this day studying physics and programming. Some hours ago I have had 2 cups of coffee and 50 mg of a 'smart drug' called 5-OH-tryptophan, a precursor of serotonin, to help me concentrate. My mood is slightly stressed, but basically happy.</p><p>18:00 pm</p><p>I am with a friend in my university dorm room.  We got some 5-Meo-DIPT in the mail a couple of days ago, and today we are about to try it for the first time. We have dissolved the drug into water and we measure the appropriate amount of millilitres and mix it with Pepsi. The taste is rather bad, but drinking the stuff is no trouble. The effect starts to come up in about 20 minutes. I go to the toilet, and my body begins to feel different. It is weird, but not unpleasant. 'Foxy' describes it pretty well.</p><p>We start walking into a shopping centre, which is about 2 kilometres away,</p><p>As we walk, the effect continues to build up. Both of us agree that this  </p><p>feels a lot like a mild acid trip. There are no visual or aural</p><p>distortions of any kind, but the feeling is quite similar. I feel energized and a bit nervous physically, a lot like I feel on acid. I would really like to be dancing at a techno party now! The mental effects are also somewhat similar to a low dose of acid. The trippy feeling is still there as we enter the supermarket, and shopping is weird and fun.</p><p>After swimming, we decide to have a pizza. My appetite is all right, and the pizza is good. Neither my friend or I had any nausea during the evening. While eating the pizza, I continue to pay more attention to some thought patterns that I need to work out and forget. This is quite a bit like LSD, and very good. However, this stuff seems to have less potential for 'rewiring' the mind than LSD.</p><p>19:00 pm</p><p>We finish shopping and decide to go swimming into a nearby swimming hall. Swimming and sauna feel both pleasant and relaxing. I feel more 'tuned' to my body and how I sometimes have a tendency to stress too much. I feel some shoulder tension, or maybe I am just paying more attention to my shoulders.</p><p>21:00 pm</p><p>We walk back home. The effects are getting weaker now. I'd still like to go to a rave, but there doesn't seem to be anything tonight, so I spend the rest of the evening talking with friends via IRC and telephone.</p><p>24:00 pm</p><p>I am pretty much back to normal now. I have a slight headache, which may be caused by the 5-Meo-DiPT or maybe not. I can't notice any more effects of the drug. Feeling pretty good all in all, relaxed and happy.</p><p>Just went to the bathroom to have a piss, and my urine smelt pretty weird. I wonder if the stuff decomposes in the body or comes out intact.</p><p>All in all, this was an interesting and positive experience. To me, Foxy has a definite psychedelic edge, altough not as intense as acid. Later I will maybe try this stuff at a techno rave, with a slightly larger dose.</p>"
}
