{
 "title": "Conclusion (For the Moment)",
 "author": "Anavrin",
 "citation": "Citation:   Anavrin. \"Conclusion (For the Moment): experience with Mushrooms (ID 12767)\". Erowid.org. Feb 21, 2002. erowid.org/exp/12767",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 12767",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2002",
   "Views: 6700",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe last experience I had with psychedelic mushrooms was probably my sixth. It was almost (3) years ago.\r\nI was in Amsterdam with my girlfriend at the time. She remains the girl I have had the longest relationship with in my life. We had a common past of somewhat heavy marijuana use. She had taken mushrooms only once before and I had already used them maybe (5) times. We each got an eight of Mexican mushrooms in the Smart Shop. We asked extensive questions concerning the effects of the variety of mushrooms the shop offered, and the guy who ran the shop and sold us the sacred shrooms, answered our questions based on his own experiences with the different types. I think this gave my girlfriend a confidence that I resisted because I already had a knowledge of mushrooms.\r\nThe visual peak of my trip happened soon after we ate the mushrooms on empty stomachs and followed their ingestion with famous Dutch frites. We walked through a square in the city on our way to Vondel Park and came across a gathering of pigeons. They all flapped their wings and took off from the ground at the same time and their energy made me see them as spectacular, 3-dimensional glints of light. The geometry of their movement overtook me and I greatly enjoyed this unexpected insight into a familiar scene.\r\nOn our way to Vondel Park, I had an exchange of glance with a man who struck me as particularly scary. He seemed to be a native of the city of Amsterdam, and he freaked me out. I was happy to get to the park. In the park, my girlfriend remarked at how squishy the wet ground felt. When I paid attention to this thought, I felt what she meant, but I didn't find it particularly interesting. I was looking for something interesting. We drank some orange juice and my legs felt carbonated, quite a pleasant feeling.\r\nThen we came upon graffiti on the bridges and stone walls. My girlfriend looked at the art and it spoke to her. She marveled at the movement she saw and the underlying implications. I looked at the same art and felt the ability to make it move; I felt that I could let myself get lost in the graffiti and see it surprise me, but I didn't want to because I felt that that was a waste of this power I had. I felt that I had an especially visceral sensitivity to my surroundings, but I didn't want to waste this sensitivity on some paint and a brick wall. I wanted to see and feel the energy of nature: mountains and trees.\r\nAt one point we sat down near some water. I was climbing on a tree trunk that bended oddly, the water. Then I went and sat with my girlfriend on a bench. I lit a joint I had already rolled and just as I did so, a group of little girls rode up to the tree I had been climbing on. They were three girls probably between the ages of 5 and eight. The five year-old road on the back of the 8 year-old's bicycle. I watched them scamper on the trunk while we smoked our joint. I felt a little guilty smoking a joint when children were so near, but we were in a park in Amsterdam so we finished the joint without any legal worries. We sat and chilled and the girls finally mounted their bikes to rides somewhere else.\r\nI think the oldest girl was in front on her own bike and the middle girl rode another bike with the youngest sitting on a back seat, her legs dangling off to the side. The youngest carried a vibrant flower. They looked like one chain of angels to me, riding away single file like they did. As they rode away, the youngest girl on the back of one of the bikes looked back in my direction and I saw a large eye in the middle of her forehead, her third eye, the energy eye. She was a divine entity; a pure, unadulterated messenger of life, a vessel for energy. And she carried a flower. I felt touched by divinity. I felt confirmation of a force of nature I had only vaguely defined before. I felt blessed by her.\r\nThen we continued our journey and the graffiti seemed a waste of time, and my girlfriend's marveling of the 'squishy' ground was lost to me.\r\nI felt I couldn't relate to my girlfriend. I felt the underlying alienation that existed in our relationship and this troubled me.\r\nI learned from this last experience the following: The power of sensitivity that mushrooms activate is a holy power that should only be applied to nature. Tripping out to man-made shapes and colors is an abuse of that power. If I ever do mushrooms again, it must be an occasion in unadulterated nature. Only then will the mushrooms align me with my surroundings and interest me with their unique insight.\r\nDuring the trip, I tripped out about the relationship between my girlfriend and me. I need to be with someone I can be completely honest with. Ideally, I'd like to be completely honest with my girlfriend, but I definately have issues with that... The other day my girlfriend asked me if I wanted to do mushrooms with her and I said no because I'm too unsure about our relationship.\r\nPsyilocbian mushrooms are a powerful tool, but they must be used consciously and sparingly. Otherwise, you are just fucking with your senses and abusing a potential tool for growth. Don't ignore your sensitive spirit.\n\n\n"
}