{
 "title": "Just To Clear Things Up Here . . .",
 "author": "Lis",
 "citation": "   Lis. \"Just To Clear Things Up Here . . .: experience with Ecstasy (ID 1280)\". Erowid.org. Sep 20, 2000. erowid.org/exp/1280",
 "substance": "Ecstasy",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1280",
   "Not Specified",
   " ",
   "Not Given",
   "Sep 20, 2000",
   "6569",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nmore than anything i'd like to contradict a few stereotypes about ravers . . . i've been raving for maybe 6 months (and wishing i'd known about it sooner) and doing x for about a year (roughly every month or month and a half.)  i love the site, but there are some things i'd like to address as far as what kids that rave are like and where we'll end up.  i'm graduating high school at the end of may in the top 1% of my class (almost 700 people) and next year i'll be in the honors program at one of the top 5 business colleges in the country on a full academic scholarship; i run 20-30 miles per week.  the friend i rave with is also one of the most successful students in our school. i don't think that raving and taking x have had any lasting negative impact on my mind or bady, and as long as people realize that what they feel on x and at raves is temporary and maintain some sort of balance, there is no reason that either should harm you.  walking into a rave is walking into an entirely different world - time it so that you're just starting to roll when you walk through the doors; everything looks beautiful, sounds beautiful, feels beautiful.  there are thousands of people in an enclosed space for 8 hours and not a single shred of hostility to be found - nowhere else on earth does this happen.  all you feel is PLUR, euphoria, and you want everyone around you to feel the same way.</p><p>walk to the edge of the rave when you've temporarily exhausted yourself dancing to the most intoxicating music you'll ever hear - sit down - within 3 minutes, guaranteed, someone will start a conversation with you, offer you some water/candy/vicks or a massage, or do some glowstick tricks for you, expecting nothing in return but a smile. you, of course, offer them one of the bracelets off of the stack on your wrists because it's all part of the vibe and you want to make them smile as well.  the music is too much for the limitations of the english language - it becomes your heartbeat and the pattern of your brainwaves.  dancing is whatever feels good - no concerns about how you look, because no one is judging or criticizing you.  the people that hate raves are the people that don't understand them, and don't understand PLUR - something the whole world needs and the ravers have found.</p>"
}
