{
 "title": "Last G Experience",
 "author": "Kamdrankit",
 "citation": "   Kamdrankit. \"Last G Experience: experience with GHB (ID 1281)\". Erowid.org. May 15, 2001. erowid.org/exp/1281",
 "substance": "GHB",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 1281",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 15, 2001",
   "Views: 36289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOne night at a local night parade my girlfriend decided to take GHB to help her come down from using approx 1/2 an eight ball of coke.  The effect of 1 cap doses is similar to that of XTC when your body is dosed up on coke.  The parade finished but the festivities continued at her apartment. After ingesting several more caps (water bottle cap fulls) she decided to make a (stupid) brave move and increase the dosage.  She consumed a large 'swig' from a bottle and chased it down.  Soon thereafter the substance took over.</p><p>She went unconscious and that was followed by severe jerking and twitching.  Soon after she vomitted all over herself.  We tried to awaken her to no affect. She continued to jerk herself around and this was proceeded by her first of several urinations.  She urinated on herself and then proceeded to defecate on herself.  Myself and a friend were able to clean her and the mess and set her up on the couch where she seemed to sleep peacefully for 8-10 hours.</p><p>This is where it gets really crazy.....Upon awakening she acted as a person in an insane asylum.  She veered back and forth and repeated to rub her face in a circular motion and then hit her leg and place her hand on the couch, then all over again.  This continued for a while.  I had seen GHB overdoses before but nothing like this.</p><p>I tried to speak to her, she responded with moans (like an ape almost).  She started to cry and scream again like an asylum patient.  I consulted another individual at the scene to ask for guidance.  He recommended we take her to the hospital and so we did.  Getting her into the car was a journey, she fiddled with buttons and switched for the entire ride, while with one hand continuing to rub her face and pat her leg and then place her hand on the car seat.  Once there nurses hooked her up to tubes and a catheter and strapped her down because at this point she was  violently singing around (and moaning really load).</p><p>She finally rose from her slumber about 4 hours later.  She had been down for 16 hours when all was said and done.  This is far longer than any GHB overdose I have ever seen or heard of.  Once she was unstrapped she needed help walking and was not totally mentally stable for almost an entire day.  She had no recollection of what happened or what she had done.  She wondered why we had thrown away her blankets (feces).  She did not even remember the parade.  She did not remember her login password at work on monday. </p><p>Her short term memory did come back slowly but the effects of memory loss lasted for about 2 weeks.  She was then able to recall that she had swallowed the large amounts of GHB.  Please post any similar stories...i am wondering if she took something else with her G or if this is just an extremely severe case.</p>"
}
