{
 "title": "Creativity Extinguished",
 "author": "iNfRA P.",
 "citation": "   iNfRA P.. \"Creativity Extinguished: experience with Nutmeg (ID 12815)\". Erowid.org. May 13, 2008. erowid.org/exp/12815",
 "substance": "Nutmeg",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12815",
   "Male",
   " ",
   "Not Given",
   "May 13, 2008",
   "7993",
   " "
  ]
 ],
 "report": "<p>It all started on a Friday when I was home from school on a day off. I was fresh out of my usual substance for getting intoxified, marijuana. I was bored out of my mind. There was nothing to do, nowhere to go. It was time to experiment. I had read that nutmeg would get you messed up, but I had no idea.</p><p>I found an 1 oz jar of this that was 1/4 full. I consumed the whole thing, hating each grainly gulp of it. I knew it was going to be a while before it kicked in so I watched tv for about 45 mins. After that I decided to work on a paper I had to write. After staring at the computer and back at a book for about 30 mins, I realized that I could not think of one thing 2 write. I usually could go on about nothing for hours but this was different. It was like there was a lock on my brain and I couldn't think.</p><p>I left the computer because I was starting 2 get a headache so I took 2 advils and went to my room. I sat down at my desk with a pen in my hand and a blank sheet of paper in front of me. I WANTED to draw. I WANTED to write but nothing would come out. It was extremely aggravating. </p><p>The nutmeg was starting to really kick in. I laid down in my bed with the ceiling fan lights on. I remember staring at them and noticing that they kept getting briter and briter, until they were so bright they hurt my eyes. I turned the light off and returned to the bed. As I was sitting in the dark room I started to get some closed eye visuals which I would describe as electric. As time progressed I could identify shapes and then objects as they floated through my head. I was really enjoying them and time kept flying by. Six hours I was laying in my bed before my mom woke me up to eat dinner.</p><p>As soon as I got up I got the biggest head rush. Everything started spinning and my stomach felt like it was turning inside out. As soon as I layed back down, I was fine. I tried to make it upstairs to the kitchen but wound up on the bathroom floor. The rest of the night is really a blur, but I remained sick for Saturday and Sunday with a fever. I don't know if I got sick and that caused the feelings, or if it was induced by the nutmeg, but I was perfectly fine by Tuesday. Overall it was a bad experience and definatly not worth it for the visuals.</p>"
}
