{
 "title": "Inspiring and Decadent",
 "author": "fractalesque",
 "citation": "   fractalesque. \"Inspiring and Decadent: experience with Mushrooms (ID 12822)\". Erowid.org. Jan 28, 2005. erowid.org/exp/12822",
 "substance": "Mushrooms",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "2.5 mg",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12822",
   "Female",
   " ",
   "Not Given",
   "Jan 28, 2005",
   "Views: 8336",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I did mushrooms was at a party where there were a few people I knew well and a lot of people I didn't know at all. I was the only one who took mushrooms; everyone else was only drinking and/or smoking up, although a few of my friends had experience with them and knew what to expect. My actual first experience wasn't all that great - I just got really, really confused and kept frantically asking someone to explain what was going on. Partway into the trip, I bumped into something with my mouth, and on and off for the rest of the night, I felt as if my teeth were crushed and I was choking on the 'blood' gushing out of my mouth, even though part of me knew it was all just the mushrooms. </p><p>I hadn't gone into the trip expecting anything other than a fun time, and I didn't even really get that. However, I got some really astonishing after-effects. A few years back, I'd suffered from severe clinical depression, and while I had been over the depression for about a year, I wasn't what I would consider 'happy'. The depression had robbed me of my creativity and energy, and I felt as if I was stagnating in apathy. I had lost one of my most valuable traits - my imagination - and had resigned myself to the fact that I might never regain it.</p><p>After my first mushroom trip, that changed amazingly. Over the next few days, I felt incredible! It was as if the mushrooms had re-opened a part of my brain that was locked away. Thoughts began flowing the way they hadn't for years. Whatever was creating my mental block was gone, and suddenly, I felt productive and intelligent again. I saw everything in a totally new light, and was inspired to start writing again. This exuberance lasted for over two months, giving me a whole new perspective on life.</p><p>After a while, I did start to come down a little bit. Not into depression so much as feeling myself moving back into my old state of being - apathy, cynicism, and boredom. I managed to boost my mood back into its enlightened state a few times, through meditation and insistence on maintaining a positive outlook. About four months after my first trip, I decided to try again. This time I was tripping by myself - probably not too smart a move, considering I wasn't very experienced with the drug, but I only had a few friends who were into that kind of thing, and our schedules never seemed to connect. I was getting impatient to try again, but I wanted to wait for a time when there was no residual negativity in my mind. Finally there came a day where I was feeling calm and collected, and had the house to myself until evening.</p><p>I set out some blankets, pillows, trippy items such as bubbles and a feather boa, and a selection of music cds. I wrote a calming letter to myself to read if the trip started going bad, with suggestions on how to divert my attention away from scary thoughts. I prepared myself mentally by letting go of all expectations: whether it was simply a fun, silly experience or something more profound, I would be content with where my mind went.</p><p>At about 10:00 am, I began chewing on the mushrooms. I had heard that keeping them in one's mouth for as long as possible would cause the trip to begin sooner, and found this was true. Within ten mintues I started to feel stoned and 'out of it'; after about fifteen, I went to the bathroom and noticed the pattern on the walls was moving as if it was liquid. I put björk's album 'post' on in the living room and listened quietly for a while. I noticed that whenever I tried to move I felt floppy and sort of liquid, so I decided to lie on the carpet and see if I could melt into it. I closed my eyes, on my stomach in the middle of the floor, and soon found myself falling in love with the beautiful floor. It was accepting me into it, and it almost felt as if we were becoming one. I had a scary moment during one of björk's songs - one of the sound effects was kind of a vortex-like sound, and I feared for a minute that it was sucking out my soul. </p><p>After a while, I decided to get up and do something else. I separated myself slowly from the floor, and decided that a shower might be really fun. I undressed, turned the water on nice and hot, and got in. I was still feeling rather floppy, so I sat in the bottom of the tub and let the water run over me. The warmth and moisture all around me was so wonderful! I began to feel as if I was in some sort of womb-like state, getting ready to be reborn. I felt like a puddle of delicious chocolate melting into the tub. It was absolutely delicious, a total, completely decadent self-indulgence. It felt so intensely wonderful to just lie there and have time to myself to totally enjoy life.</p><p>I'm not sure how long I was in the shower for, but eventually the water started getting cold, so I turned it off. I lay in the bottom of the tub and looked at my body, and realized how beautiful it was. I realized that all the issues I had with my body - hairy legs, weird bumps, boniness, etc - didn't matter, because I was so beautiful. I started to dry off, then realized there was a mirror right in front of me. I was a little apprehensive at looking into it too much, because I'd heard bad stories about people's faces melting or turning into demons, but I decided to try it. </p><p>I was blown away. I was so beautiful. Not in a gorgeous, glamorous sense, but there was inner beauty that was shining out that I was sure everyone could see. I must've stayed naked in front of the mirror for a long time, and finally decided to grab my camera and take pictures. I wasn't ready to get into my clothes yet, so I wrapped a towel around myself and went to go find it. Outside of the bathroom, the whole house was lit up by sunshine - it was an absolutely gorgeous day. In the running commentary I was keeping in my head, I told myself, 'what a wonderful way to start the day - being rebirthed in the shower and finding out you are beautiful, all before breakfast!'. I found my camera and took some great pictures (and some not-so-great ones), and then lounged around naked for a while on my futon. </p><p>I had all these trip-toys that I had set out before I started, but found I didn't need them. I was so fascinated by the sensuality of my own body that I just lay there and looked at myself for about an hour. Body image has never been a big issue in my life, and I'm not a big narcissist or anything, so I'm not sure what it was that made me so interested in my own body. I kept telling myself over and over, 'I'm so beautiful!' Finally, I had the idea that I would probably look just as good with clothes ON. I tried on a few different outfits, and finally decided on a colourful red skirt over jeans with a beige vest over a blue-grey flowery tank top. It didn't match, but the WAY it didn't match was so beautiful! Everything I saw had this amazing, breathtakingly beautiful quality to it. I went downstairs and found my cat curled up on the couch. I put my face down into her fur and smelled this intense feeling of WILDNESS in her... She started to get annoyed at me so I backed off. I found myself wondering whether my pets could tell I was in an altered state of mind - I came to the conclusion that she could, and she didn't like it.</p><p>Then I went outside for a while. The intensity of the trip was fading, and I was starting to get a headache, but the beauty that I was seeing in everything continued. Even my headache was beautiful. I think the phrase that went through my head the most that day was, 'this is so great!' I marveled at the snow, the loneliness of my yard, how nothing was ever silent - there were always cars, and birds, and wind, and dogs barking. I sat quietly outside on a bench and enjoyed the quietness and stillness of everything. It was about 2:30 in the afternoon, and I couldn't tell how much I was still out of it, but I was still enjoying myself just being there, just existing together with everything else. I remembered reading something in the celestine prophecy about seeing a certain underlying power as beauty, and it fit right in with what I was experiencing. I went inside and tried to sleep for a couple of hours, but found I couldn't do it, so I got up and continued on my day. I didn't feel like attempting anything too complicated, so I took it easy; reading, checking my email, having a light lunch, and watching a movie with my dad in the evening. </p><p>All in all, it was a good day. I didn't get the same rush of energy that I got from my first trip, but I had a beautiful, decadent time to simply love and appreciate myself and my surroundings.</p>"
}
