{
 "title": "Getting Lost And Being Mindful",
 "author": "Knotty Tree",
 "citation": "   Knotty Tree. \"Getting Lost And Being Mindful: experience with Mushrooms (ID 12850)\". Erowid.org. May 5, 2007. erowid.org/exp/12850",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2001",
   "12850",
   "Male",
   " ",
   "Not Given",
   "May 5, 2007",
   "2900",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been in the woods all day, it was a pretty cold day, and I'd been working on a shelter I was building by myself all day. I decided to eat the mushrooms at the end of the day, as I was sleeping in the woods that night. I know them very well. I went up to a lookout to watch the sun set over my town and eat my mushrooms.  I sat there for a while, all the time anticipating the start of my experience if there was to be one.  It pretty much all started when I stood up from meditating over the view. I had not noticed very much up to that point, the lights looked a little brighter, but I couldn't feel anything strong.</p><p>When I got up, it all came as a rush.  I started seeing patterns in everything, and I felt strange, but not like a 'high.'  Anyways, the anxiety all started when I couldn't stop thoughts from rushing through my head, and I felt like I couldn't control a single thought, like the floodgates were open and there was nothing I could do.  The problem with this free thought was the fact that for some reason I couldn't cull, from the rushing multitude of thoughts, the directions back to camp.  I knew that they were in my mind, but when I tried to stop and think of the specific way, it seemed like the thought would just get washed away as soon as I thought I had anchored it, when I went searching for the succeeding part of my journey.  So I started walking.</p><p>As I was walking, my anxiety grew even greater, as I couldn't tell myself where to go next, so I kept walking.  Every once in a while, I would stop and lie down, and tell myself to THINK, but all it would do is get me more anxious, growing to the point of fear.  This is one of the most unusual parts, because, after my own house, I consider the woods the place I am the most comfortable.  This is why I chose the forest as the setting for my trip.  I found my camp, and looking back, I did take a relatively direct route there. At any one time, I could tell you exactly where I was at the time. I could not, however, for the life of me, tell you where to go to get to my shelter.</p><p>Instead of thinking to get there, I just walked where I felt I was supposed to go.  This is one of the strongest effects mushrooms have on me, is the buddhist concept of mindfulness, the ability to remain in the moment, right where you are, not looking down the road or thinking back.  At that moment I could have argued that I needed a little western thought to get me from point a to point b, but it turned out, that all I needed to do was relax and trust myself.</p><p>After returning to my shelter, I dove into my sleeping bag, and proceeded to have a very enjoyable time, mixed with some intense periods of reflection about my experience.  I have learned to trust myself more, that thoughts, however seemingly helpful or satisfying, are ultimately ephemeral.  Being grounded in the moment and doing what feels right deep inside, even if it is inexplicable at the moment, is what will lead me through difficult times.</p>"
}
