{
 "title": "One Summers Night Out of Work",
 "author": "oddsock",
 "citation": " oddsock. \"One Summers Night Out of Work: experience with MDMA (ID 12860)\". Erowid.org. May 3, 2002. erowid.org/exp/12860",
 "substance": "MDMA",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "12860",
   "Male",
   "",
   "Not Given",
   "May 3, 2002",
   "40115",
   " "
  ]
 ],
 "report": "<p>One Summers night out of work, me and my girlfriend got in a car with this couple we knew and headed out for a weekend camping.</p><p>Sitting silent on the back seat staring out the window, looking for reassurance in the passing scenery, individually contemplating the journey ahead.</p><p>My anxiety was natural, it was the product of an unnatural life. Seperated from myself just after birth, I'd ended up working in a mindless, faceless corporate sweat shop, processing processes. I wanted, needed,  a reunion, my only misgivings were wether what I had planned was going to aggrevate the schism.</p><p>We arrived at seven, pitched our tents, ate dinner.</p><p>An hour later I took one pill.</p><p>We went down by the riverside, sat down on cooling earth, the smell of chlorophyll and sweat, like when I was a kid.</p><p>Within 20 minutes I was feeling the beginnings.After 30 I was siezed by panic and it was evident from my sweating and cracked grin that I was struggling. Thankfully my friends left me alone.</p><p>Whilst they carried on their conversations I sat trying to come to terms with my condition, all I could do was stare out over the river. Slowly, over a few minutes my heart rate dropped, my sweat dried,cooling my skin. Staring at the river, the reflections, the persistent gentle flow, the greatest calmness I have ever felt descended on me,like all sense away from man revealed an endless coming into being. </p><p>(I spent the rest of the evening with my girlfriend).</p><p>I get angry at the unthinking, knee jerk, demonising critics of MDMA who seem unconcerned at the truly demonic aspects of a ruanway society with it's excessive demands, it's lonliness, it's greed, where we are all mentally ill, in an acceptable way. I suggest that this is a neccessary tool to combat the mental hardship inflicted on us by the unreasonable demands of a society which we can not control and which is, in fact, controlling us with threats.</p>"
}
