{
 "title": "The Most Benevolent Trip Ever",
 "author": "Manon",
 "citation": "Citation:   Manon. \"The Most Benevolent Trip Ever: experience with Mushrooms - P. cubensis (ID 12876)\". Erowid.org. Feb 7, 2005. erowid.org/exp/12876",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12876",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 7, 2005",
   "Views: 4241",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nNick handed me two bags of mushrooms.  One bag appeared to be slightly more filled than the other.  He explained to me that they were basically equal amounts and that the bag which was less full contained slightly more psilocybin than the other.  I handed Margo the fuller bag and stared at the contents in my own bag.  They looked moldy and old.  Nick brought us orange juice.  James had already swallowed his Hawaiian Baby Woodrose seeds.  Hawaiian Baby Woodrose is supposed to produce a longer trip than mushrooms, so in order for us all to peak at relatively the same time, he had eaten his about an hour earlier.\r\nMargo began to eat her mushrooms.  I kept staring at mine, wondering why they looked so grey and old.  Martin was fumbling with an empty bag and Nick was just finishing up his eighth.  James was watching us.  I put a very small piece of the mushroom in my mouth, held it there for a moment and chewed it.  It tasted like soft old sticks.  I gently took it out of my mouth and placed it back in my palm.  I wanted some orange juice.  Somehow I forced myself to eat the rest of what was in my bag.  After I got over my initial squeamishness the mushrooms werent that hard to chew and swallow.  I got used to the old-stick taste.  Three glasses of orange juice later, we were ready to go.  Martin wandered back into his room and Margo, Nick, James and I got ready for a walk outside. \r\nNick has a garage-barnish sort of building they call the carriage house.  We stopped in there and smoked a small bowl.  About three hits each, to fight our nausea.  We walked out of the driveway and onto the sidewalk, each of us very slightly stoned.  We took about a ten minute walk to Crystal Lake, on the edge of Rhinebeck.  The lake was frozen solid, with a shopping cart lodged in the ice.  Margo and I sat on an overturned trash can and smoked cigarettes.  Nick and James layed down on a hill leading down to the creek.  I wondered if I would start tripping here or when we got back to Nicks.  I didnt know how long we were planning on staying at Crystal Lake.  I started to feel a little light headed.  The hills were breathing softly.  That was the only thing I noticed.  Nick said 'Do you guys feel anything?'  Margo and I both answered with a tentative 'yeah,'\r\nAs we were walking back, the sky had started to darken.  The cars along the road had their headlights on and there were still Christmas lights in the small trees lining the streets.  Every small Christmas light that was wrapped around a lamppost, on a fence and in a tree had a small, beautiful halo around it.  All of the car headlights had slightly glaring purple halos.  All of the the headlights reminded me of the hallogen bulbs in new cars.  \r\nAbout forty-five minutes after we had eaten the mushrooms we returned to Nicks house.  We were relieved that his dads car wasnt in the driveway.  I followed Nick through the dark dining room and living room as he turned on the lights.  I couldnt see anything in the dark.  I could only sense where objects were and I had a strange fear of bumping into a coffee table or chair.  We walked up Nicks glowing red staircase and into his room.  James layed down on Nicks bed and said 'This is chill time now, folks.' James and Margo sat on Nicks bed.  Nick sat in a chair with wheels and I sat on a soft brown bench-chair in the corner.  They began a game of Blackjack with Nicks optical illusion playing cards.  Martin wandered in and out of the room, nervously picking up various things and pacing back and forth.  Nick and Margo and James card game slowly lost its definition as a card game when the players became more fascinated with the optical illusions on the cards than the game itself.  Margo layed down with her head against the wall and held cards up over her, every so often picking up a new card.  James did the same in the corner of the bed and wall.  Nick sat in his chair. \r\nMartin became fascinated with the cards and Nicks globe-light.  I sat in my brown chair smiling and watching things.  Martin became the center of my focus, because he and the globe were directly in front of me across the room.  I shifted in my chair.  The bookcase wobbled and bent, the walls took a breath.  'Wow.' I said. Martin continued walking in and out of the room, disoriented.  The walls continued breathing and the bookcase bending.  The door to the closet was open a crack and there was a space between the door to the hall and the floor.  The paper map of Japan, on the closet door was waving in the nonexistent wind and flapping like cloth.  I kept seeing shadows of people walking by under both the closet and hall doors.  I looked at the door frame and saw that the woodwork was flowing.  I couldnt tell where the woodwork ended and the corner between the two walls ended.  That was when I knew I was being affected.  Everything else could have been attributed to general sober weirdness, yet I knew that this was not a sober thing to see.  Different parts of the floor began to shift and slide at different times and I felt myself slowly and gently moving towards the others around the bed, travelling on my chair.  I looked down at my leg.  The pattern in the denim became rows and rows of alien symbols and letters.  Question marks, pound signs and odd looking things I had never seen before.  \r\nMargo and James layed down and became parts of the room and the bed.  I lost track of where Nick had gone.  When I 'found' Nick again there was some talk between he and Martin about Martin going over to Bens house.  Nick was worrying about Martin having to deal with their dad, who already knew something was up.  I became incredibly confused as to where Phil and Martin both were.  Where they had gone, where they were going, whether they were in the house or not.  I let it go.  Margo was completely silent, moving her hands around in front of her occasionally.  We had been listening to pleasant Indian music the entire time.  Nick and James were discussing the piece we were listening to which lasted either forty-five or sixty-three minutes. I kept thinking that the direction of lighting in the room was shifting around.  It looked like there was a swinging spotlight moving all around the ceiling and walls.  What I was seeing, however was the illusion of a disco ball; tons of lights and sparkles everywhere.  \r\nI found myself shivering and twitching.  I had a smile that wouldnt go away and I couldnt relax my eyes.  My hands were sweating.  I was wringing my hands and squeezing my fingers.  I thought, my name is Manon and I have taken a drug.  Im in control though.  Why am I shivering?  I dont have to.  Im in control of my situation and Im going to relax and be warm. With that the chair wrapped its cushions around me and rubbed my shoulders gently.  I was warm and happy.  I couldnt stop smiling.  When someone looked at me I giggled uncontrollably.  This is the best drug in the world because Im in control.  \r\nWe turned off the lights.  Shapes of cages and wire designs and transparent cubes and swirling things appeared in the absence of the light.  Nick brought out the four bottles of whipped cream and balloons we had bought earlier.  The colors on his painting were changing.  The blues would shift within a range of very pale blue to very dark blue.  The greens would go consecutively through every shade of green as well.  India on the globe light was slowly crawling and blowing north like sand.  The map of Japan was fluttering against the wall, and the bookcase was still bending.  I became intensely excited when I saw the package of balloons.  I didnt want any nitrous, I just wanted a balloon.  I asked James for a balloon and he tossed one at me.  I blew it up and tied it and threw it up in the air.  It somehow escaped so I asked if someone could give me another.  Nick handed me another balloon which I blew up and managed not to lose.  Instead I rubbed it and squeezed it and chewed on the end of it.  It was covered in a thin layer of very light dust.  I tried to wipe all of the dust off of it but I couldnt so I gave up.  When I touched the balloon delicate little spider-webby strings from my fingertips attached themselves to the balloon.  This also happened when I touched the chair, so I was unable to stop touching it.  I watched the other people.\r\n I heard whipped cream and Nick inhaling.  Then James inhaling.  Margo sat up and said 'Whats that?'  James gave her a balloon and said 'Here, inhale this.'  Margo said 'What is it?' and without waiting for an answer inhaled it.  She layed back down.  Then she looked at me and my balloon.  She stared and I could tell she wanted it.  'Thats the coolest balloon Ive ever seen.' She said.  'I know, but its mine.' I said.  Then everybody had a balloon.  Margo blew hers up and let it go, flying around the room.  We all became silent, even though I was on the brink of maniacal laughter.  I was still smiling uncontrollably and gnawing on the end of my balloon and squeezing my chair.  I took the balloon in both hands and squeezed it a little.  I was amazed by its resiliance.  Suddenly the rubber squeaked and everybody jumped.  I started laughing and apologizing profusely.\r\nI layed back and enjoyed my warm, friendly chair.  It was soft and squishy and comforting.  I touched my toe to the end table near the bed.  The smooth wood was also glowing with warmth.  It was amazing.  I was enjoying myself so much that I still couldnt stop smiling and giggling.  I felt almost like a lunatic because my friends werent feeling so ecstatic but I didnt care.  The shapes and patterns and colors and sounds and lights and temperatures swam around me.  I couldnt differentiate between my different senses, but everything made me feel so wonderfully happy that I didnt care.\r\nAt one point I went to the bathroom.  Or rather, I swam.   The carpet in the hallway was glowing and the door frames were still flowing and moving.  The floor was very hilly, and unfortunately those hills were moving around so I almost stumbled a few times, trying to avoid them.  The act of going to the bathroom was more or less normal, as was washing my hands and drying them off; except for the fact that the towel was wonderfully squishy.  \r\nAfter returning to my warm, friendly chair and reveling in the wonderful music and sounds and colors for some time, my persistent smile began to give me a slight headache.  I felt like there was a cross drawn on my forehead and two little accent lines on my temples, illustrating where the pain was beginning.  Something like this:  across my forehead.  It was minor though, and I didnt let it bother me.  At some point a thought entered my mind: 'Im tripping.  This is like when I was on acid.  I hate tripping.'  I couldnt ignore this.  Until then I had been thinking about how in control I was feeling and how much I was convinced that I wasnt tripping.  I realized I wasnt at all in control and that I was tripping harder than I had before, completely unbeknownst to me.  I pulled myself together.  I stopped seeing patterns and sparkles and cages that werent there and I focused on the concrete things that I was sure I knew.  'Maps do not flap without any breeze, India does not crawl across globes, bookcases do not bend and pictures do not change colors.'  \r\nIm sure I could have ended my trip slowly and peacefully but I went for the more violent 'Im going to stop tripping right now' approach.  My headache grew progessively worse and worse and was soon followed by nausea.  I felt like I had a migraine and all the while I wished that the floors would stop moving and the maps would stop flapping.  I couldnt stand the light and we all began arguing about whether the lights should be on or off.  The walls were still breathing, even though I was trying to force them not to.  I did everything within my power to force myself out of the trip but it wouldnt work.  I choked down some ibuprofen and leaned into my chair.  I closed my eyes and saw things I didnt want to be there.  I basically suffered for a half an hour until I began to feel better.  Nick and James went downstairs for dinner but Margo and I stayed in Nicks room.  We engaged in some disjointed conversation, mostly about how cool everything looked and how we were sort of coming down.  The conversation was at least human, and it was comforting to me.  No one had been talking for a while and I was beginning to feel slightly alone.  I stood up, walked around the room, took a closer look at things and realized I was done tripping.  I had had an amazing time.\n\n\n"
}