{
 "title": "Music Drove Me",
 "author": "Chris",
 "citation": "   Chris. \"Music Drove Me: experience with LSD, MDMA (Ecstasy) & Cannabis (ID 12884)\". Erowid.org. May 5, 2007. erowid.org/exp/12884",
 "substance": "LSD, MDMA (Ecstasy) & Cannabis",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:30",
   "1 ",
   "oral",
   "LSD",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12884",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 5, 2007",
   "Views: 2999",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell I'd tripped 4 times before, of varying strengths, it always went well, although it was in the right situation each time. In fact one of the times was one of the best nights of my life - certainly the funniest! :) This night was a little different. We were going to a party, and there were meant to be several of us going. In the end 3 of us turned up. Now there is where I should have realised that taking acid wouldn't be a good idea.<br>00:00 dropped ecstacy.<br>As usual the e kicked in and made everything fluffy. :) The music got better and I started to grin a lot. Even though there were 3 of us, I thought the music was so good that I wouldn't have a problem. I've been to many parties before, with & without e, on my own or with 1-2 friends. But not acid.<br>01:30 dropped acid<br>Well, the music was really good when I took the acid. I was a double-dosed sugar cube. I'm heavily into psychedelic trance, and I loved it long before I took any chemical. In fact the music was really really really good, which is why I think I finally decided to take the stuff. Unfortunately the ecstacy wasn't the best I've had, although it was nice, it didn't last very long so by the time the acid started to affect me the pill was on the way out.<br>02:15 or so... acid hits.<br>The trouble is, after that, the music got shit. I fully believe the music was shit, several acquaintences I met there have verified that it was, for want of a better term 'bad trip' music. Very repetitive, which psytrance normally isn't, and loopy. Yuk. It was still ok-ish, but things started to go wrong. The chai tea was too milky. The indian massage bloke was asleep. Another couple of friends who were meant to turn up, didn't.<br>I started to get the weird picture that this was not a happy world. I think it was excaberated by the fact that a lot of other people there were tripping too and they weren't smiling a lot. In fact I think few people really enjoyed the music that night. I am normally a happy person, I prefer to smile or laugh at stuff than get depressed, but that night I had a very hard time being happy. I also like to cheer people up and make them laugh, but obviously in my state I couldn't do that. I wanted to apologise for being on a bad one and 'dragging my friends down'.<br>Then the fear started. I didn't have a FULL ON bad trip then, it was semi-controllable and only lasted 3-4 hours, but it was bad enough. I was pretty scared, and just wanted to get away from the music. But I couldn't get away from the music, trains & buses don't run all night in these here parts. It was about 4:00am by this time.<br>So what happened was I spent about 2 1/2 hours lying on a staircase (with fresh air, which helped) with 1 friend, trying to get my head back into order. God knows where the other friend was - we did go and find him to see if he was ok, he looked in better shape than me, but still not having the best time. Then after sitting there for 5 mins he headed back to the dancefloor. Hardcore. :)<br>It hasn't happened on any of the other trips, but I felt as if walls in my head were being broken down, and it came down to the typical 'Am I mad?' question. Now I was able to answer 'No, I'm not, or I wouldn't ask that question. I am, however, heavily tripping' :) I also asked myself if I was an evil person, because I felt nasty. I decided that was stupid as well, I have any number of friends who can vouch for me being nice.<br>At about 06:00, the music got better (different dj!) but by then I was too worn out to dance. Mental battles like that really wear you out. So we left about 6:30. Once we got out of the building I was feeling a bit better, it was a nice morning, birds singing etc etc. But the weirdness wasn't over, just the bad part. :D<br>Waiting for, and then sitting on, the bus on the way back to my friend's place was BIZARRE. All 3 of us were conducting a conversation which took place mainly without speaking. At least it seemed that way. We would say maybe 1 word out of 20, and yet the conversation still took place. It was one of those head conversations about fractals. I love fractals. :) All 3 of us have puzzled over this, and my personal findings are inconclusive. I was tripping hard, which makes it very very hard to be objective, but that was something I haven't experienced at all on acid before, and I do believe in esp and the like. Who knows, maybe we achieved true telepathy that day.<br>Anyway, after sitting on the bus for an hour, we got back to friend's house and put on some damn good music. Immediately I felt MILES MILES better. Very euphoric, like the aftermath of a huge adrenalin hit. We all enjoyed the remainder of our comedowns with a large amount of strong skunk, and great music, as we tried to piece together what we had experienced.<br>As it stands, I am reluctant to class this as a 'bad trip' because I dealt with it, and the latter 3 hours were actually a lot of fun. What I have noticed is, since then, I do get mild paranoia when smoking pot. Nothing like that, but sometimes I get nasty feelings, and have to reassure myself that it's just the drugs. I used to get paranoia from weed, but didn't for about 3 years prior to that fateful evening.<br>I will probably try acid again - but only if I'm sure and if the situation is right. I don't really want to experience *that* again, but at the same time I've had great times with it, and I am 99% certain that the reason it all went titsup was the music and not having enough stuff around to cheer me up. Next time we go to a party, we're going to take backgammon or something so if it all gets bad, at least we can play games :D\n\n\n"
}
