{
 "title": "A Little Too Much",
 "author": "scientist",
 "citation": "   scientist. \"A Little Too Much: experience with LSD (ID 12882)\". Erowid.org. Jan 27, 2005. erowid.org/exp/12882",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "12882",
   "Male",
   " ",
   "Not Given",
   "Jan 27, 2005",
   "6009",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I remember the day, in the middle of July or so. My friend obtained some very potent liquid LSD. I was experienced with low to medium doses and was excited to try it in liquid form. I asked him for a drop or too, so he took out the small dropper bottle. It was his first time even squeezing the small bottle, and dropped a little too much on my tongue. I tried to rub some off with my fingers, but it may have just absorbed into my skin. When we looked at the hundred dollar bottle, about a quarter of it was gone. He apologized, and I realized all I could do was hold on and let it hit me. </p><p>It was obviously the strongest acid trip I ever had. The come up was VERY intense. My emotions were swinging uncomfortably. When I began peaking, the visuals were so incredibly intense that I couldnt even worry anymore. I was just a vapor floating through different colors and patterns. Reality was non-existent, while I sat in one spot for about 5 hours. One visual I can describe was seeing a river rise 10 times over my head, and crashing into lasers in colors I never saw. Eventually I was able to name things I was looking at, and I tried to enjoy the hallucinations. My friend who was watching me would melt into a puddle of color and slowly build into his original shape. I looked at my hand, but it would just spiral away into many colors. </p><p>After the trip, I was very shocked and silent for many days. I couldnt even have a bad trip because I really couldnt even think. I just wanted to post this to warn all of you to be careful with liquid LSD. It changed the way that I interpret my sense of sight.</p>"
}
