{
 "title": "Delightful Stimulant Effect",
 "author": "Norm de Plume",
 "citation": "   Norm de Plume. \"Delightful Stimulant Effect: experience with Amanitas - A. muscaria (ID 12889)\". Erowid.org. Nov 10, 2003. erowid.org/exp/12889",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "2 caps",
   "oral",
   "Amanitas",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 12889",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 10, 2003",
   "Views: 9859",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I tried Amanita last night after ordering some from a well-known catalog.  I had heard conflicting reports about Amanita, and was concerned about nausea, so I tried about a half a cap, found that there was no gag reaction, so the next day I took two of the caps. At first, I wasn't sure there would be any effect.  I fact,I got tired, went to bed and struggled in a semi-dream state with a mild queasiness.  This little internal dialogue with the possibility of vomiting was something I was familiar with, due to my (distant) past history of heavy drinking. </p><p>I noticed the first psychedelic effects, as I lay there with my eyes closed, when colorful scenes displaced each other in a manner that reminded me of rapidly changing TV channels.  After about two hours of this, I opened my eyes, and this was when the experience took on a speedy and somewhat psychedelic quality.  There were no real open-eye visuals to speak of.  Instead, it occurred to me that this substance would be ideal at a rave as a sort of substitute for MDMA.  I was highly energized, and very dissappointed that my house-mate, a philosophy major, had gone to bed.  I would have liked to talk or take a walk.  </p><p>I ended up walking up and down the Ave. (I live in the U. District of Seattle) I also made the mistake of chatting with a tottering twenty-something drunk, which was a waste of breath, and a drag on my highly elated frame of mind.  I eventually lost him when he excused himself to urinate in a doorway, and I returned home to listen to Santana's first album on a classic rock station.  The effect of the amanita on the closed-eye visual element of music listening was very pronounced, although I was also lucid enough to tire of the musical cliches which were being beaten to death.  The second album would have been much better.</p>"
}
