{
 "title": "It's All Good",
 "author": "Avvy",
 "citation": " Avvy. \"It's All Good: experience with AMT & DXM (ID 12898)\". Erowid.org. Jun 25, 2007. erowid.org/exp/12898",
 "substance": "AMT & DXM",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "220 mg",
   "oral",
   "DXM",
   "",
   "",
   "20 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   "",
   "20 mg",
   "insufflated",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12898",
   "Male",
   "",
   "Not Given",
   "Jun 25, 2007",
   "4450",
   " "
  ]
 ],
 "report": "<p>It is 4:36pm. I just dosed about 15 minutes ago. 20mg amt orally and 10mg amt snorted. Mild visuals.</p><p>It's now 7:20pm. it appears as though it's been 3 hours. Mild visuals. good tracers. hard to concentrate on spelling. have snorted about another 10mg. its all good. Very pleasant happy body high.</p><p>It's 2:55pm(next day) - woke up at about 1:45 this afternoon. Had a very good time last night. At about 3:30am I went to bed and lay there contemplating my existence and realizing my perma-fry insanity caused by salvia. Realized that 'it's all good' is a reality anchor that I use to re-focus my existence. I always say this and never really understood why it makes me feel good. Last night AMT helped me realize that I have programmed myself to believe that 'it' - being my subjective reality at that moment which is always changing now - really is 'all good.' A</p><p>Finally fell asleep around 8am. Throughout the night I took 220mg of DXM as well as another 10mg-ish line of AMT. I noticed that the AMT masked the effects of DXM and just made for a pleasant night. I would describe this drug as 'slightly psychedelic, very happy happy happy, functional, empathic, speedy but mellow calm acid.' I would also describe it as 'emotionally hallucinogenic.' The visuals were great in the dark or with my eyes closed however they were mellow enough in the light with my eyes open that I could still easily function in society. </p><p>I believe that as that entire afternoon and evening was beautifully gleeful. Smiles and great conversation as well as admiring visuals filled my night. The conversation was at great as meth conversation but not as sporadic and unfocused or tweeked. Anyway overall experience was superb. This was my second experience with AMT. Looking around I am still noticing very very mellow tracers and auras around lights.</p>"
}
