{
 "title": "Life Is So Beautiful",
 "author": "Fleck",
 "citation": "   Fleck. \"Life Is So Beautiful: experience with Mushrooms - P. cubensis & Cannabis (ID 12933)\". Erowid.org. Mar 28, 2007. erowid.org/exp/12933",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 0:15",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:15",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "12933",
   "Male",
   " ",
   "Not Given",
   "Mar 28, 2007",
   "2680",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first experience with shrooms. I had been trying to get my hands on some for months and finally the day had come for me to eat some shrooms. I was very eager to try them, with no fear of a bad trip at all. I purposely did not eat anything that day. I wanted to have an empty stomach. I arrived at my friends dorm at 3:30 in the afternoon. It was a beautiful day with barely any clouds in the sky. For the middle of February it was extremely hot. We consumed the mushrooms around 4pm. The 3 other people venturing on this trip were my good friend J and his two friends C and T. They were all experienced with mushrooms and aware that it was my first time. The shrooms tasted like shit, but we washed them down with some mountain dew. </p><p>T+15mins... T decided that a bowl would be a good idea so we proceeded to smoke some very fine dank weed. When that bowl was cashed he quickly packed another one. I was feeling pretty high by the end of those two bowls. </p><p>T+45mins... We have been sitting on the couch listening to some music, I can't remember what. Possibly some phish. I started to notice my vision was becoming distorted. I sat quietly and watched as my friends floor changed colors and intricate geometric shapes spun around. This did not frighten me in the least bit. I welcomed any type of visuals. The rug on the floor was no longer visible to me. I looked at the door and watched as it melted into the ground. I asked the guys if they were seeing anything, and they simply laughed at me. They told me to shut up because it was too soon to see anything. But I knew I was begining my trip. </p><p>T+50mins... The group decided to take a walk outside. The sun was still shining and it looked great outside. Walking was an extremely fun activity. My body felt very light and my legs felt very jello like. Shortly after going outside we had a laughing attack. I had a huge grin on my face the entire time. I was laughing for no reason at all. I just felt so great!! Despite how warm it looked outside, it had gotten somewhat colder. Trees were changing color and size. The grass fields seemed to be talking to me, even spelling letters. I was having a blast!</p><p>T+2hrs...  The walk was getting old so we headed back to J's room. Upon entering the room we discovered there to be company. There were five girls sitting around with L, J's roommate. People were trying to introduce each other, but I wasn't understanding it. I was seeing all types of shit. These strange girls were not who we wanted to trip with, so we quickly left. We went back outside in search of a room to chill in. We went to T's room and found more people there. We grabbed Pulp Fiction and headed out. Someone in his hall was playing LOUD ASS techno music and it was definitely having an impact on my senses. It was like a sensory overload. Damn these shrooms are fun!</p><p>T+2hrs20mins... We arrive back at J's room and find that L has left. These sluts are in his room even though the owners are nowhere to be found! This is where things started to take a bit of a down hill. I would just like to say that psychedelics are wonderful things, especially when used responsibly. But the people you are around have a HUGE impact on your mood. I did not want to be with these girls. I had no idea who they were, and I was tripping pretty hard. At one point they asked me to change the channel on the tv. I walked upto it but could not see a damn thing. I stood there like an idiot for a minute or so and then gave up. I sat back down and felt like a jackass. I was imagining everyone laughing at me. I was even hearing things that were not being said. Someone put a Doors video in and I like the doors usually, but the music was fucking with me in a bad way. </p><p>T+3hrs... This might be the worst part of the entire trip. The girls were still in the room, and I was still feeling very uncomfortable around them. I can only describe what happened as being stuck in a loop of thought. I kept thinking the same few thoughts. 'These girls really piss me off. I should just leave. Fuck it I'm leaving. I need to get gas and I don't have much money. What am I thinking, I'm too fucked up to drive anywhere. But these girls are pissing me off. Fuck it I'm leaving. I need to get gas, wait what am I thinking, I am too fucked up to drive.' I just kept thinking those thoughts over and over. I couldnt think about anything else. I kept looking at a LCD clock and time seemed to be going so slow. A minute seemed like it took an hour. I started to lose touch with reality. I started to think I was going insane. I was begining to become very afraid and I wanted to be able to think straight, but couldn't. I knew it was only a trip, and would be over, but when? Finally J kicked the girls out of the room, and I almost instantly was back to normal. Still tripping hard, but at ease now. </p><p>T+4hrs... We are now watching Pulp Fiction. What a great movie! I suddenly realized that I had to call my mom to let her know when I would be home. I'm still in high school, with a very bitchy mother. She knows I do drugs and is very strict with me. I was really in no shape to call, but I had to. I was an hour late calling. She discovered that I was not with who I said I would be with all day. She wanted me home immediately, but I couldn't drive. So I told her I would be home after midnight. I was very glad I no longer had to worry about calling her. Sure I fucked it up pretty bad, I sounded like I was on something. But I felt too good to care.</p><p>We smoked another 2 bowls when I returned. I was no longer seeing all that much, I just felt trippy. That was not the case for T. He stood up out of nowhere and just started to mumble something and tried to walk around the room. We all started laughing at him, so he asked us to take a walk outside with him. It was after eight and we were relaxing. Noone wanted to go. So he sat back down for a little. Soon enough he had another episode. Without any warning he threw up. I thought it was pretty late into the trip to throw up, but what do i know? He then said he wanted to go the bathroom because he had been pissing himself. Scared that the hallway would 'eat him alive' C went with him to the bathroom. When they came back C was laughing his ass off. It turns out that T was saying,'C am I pissing? Tell me if I'm pissing. I can't see anything man.' He ended up pissing himself on the way back to the room. He was pretty fucked up. </p><p>The remainder of the night was spent in J's room just watching tv, smoking more pot, and drinking some beers. T passed out for a good bit of the night. When midnight rolled around I tried to start my car. It caught on fire!! So I had to call my already pissed off mom and tell her I couldnt drive home. My car was broke. She refused to come get me so I spent the night on J's couch. </p><p>The next day even though I was in a good bit of trouble, I didnt seem to care. I felt as though I had found this secret. That life was beautiful no matter what happens. Life is a gift, and should never be taken for granted. I was depressed a few years ago, and almost killed myself. Boy have I come a long way from there. Everyday I thank God for giving me all I have. Life is not perfect, but it's still a whole lot of fun! I will never again hate life so much that I would want to take my own. Shrooms helped me to see this. It was like my eyes were finally wide open. I intend to trip with these little wonders again. I would suggest that anyone who is interested in shrooms, or any psychedelic, to investigate what you are getting yourself into first. They can be great fun, even life changing tools. Just don't be stupid and rush into something you are not ready for. It's called a trip for a reason. Once you embark upon it, you can't just quit halfway through. You're in it for the long haul. So have fun everyone, be safe, and remember that life is a beautiful thing!!</p>"
}
