{
 "title": "Sexual No More",
 "author": "swiss plankton",
 "citation": "   swiss plankton. \"Sexual No More: experience with MDMA & 5-HTP (ID 12931)\". Erowid.org. May 3, 2002. erowid.org/exp/12931",
 "substance": "MDMA & 5-HTP",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2001",
   "12931",
   "Male",
   " ",
   "Not Given",
   "May 3, 2002",
   "9124",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSomewhere halfway into my 10 years of experiencing MDMA I realized that I could no longer achieve that delicate balance between body and brain or between empathy, ernergy and stimulation to experience the full-blown sexual feeling that e can provide.</p><p>Here's what I'm talking about: </p><p>You are experiencing the drugs? best (basic) aspects. Extreme empathy towards virtually anybody (I recall generating tremendeous affection for a cop who was shutting down a desert rave that I was attenting), the sense of utter physical relaxation (so calming indeed, that even as a avid smoker, I prefer breathing fresh air over filtered smoke), a cozy sense of space (that can lend the warmth of a swiss ski hut with a fireplace to a vomit-littered back alley in hollywood) and the peak perception of both sensual (touch, smell) and artistic impulses (music, art, nature).</p><p>Now, in addition to (and usually as a consequence of) all those lovely things, one can feel overcome by a most beautiful sort of sexual feeling, reaching far beyond the basic animalistic lust into a realm of physio-psycological lust. It could be described as an urge to be ultimately close to someone, to exchange each others bodily fluids in order to understand the essence of what makes them and yourself so human, so beautiful and complete. This is not a race for orgasms but rather the pursuit of lasting and sustained erotic waves.</p><p>These moments are so exquisite that they can outlast the effects of the MDMA. So even though there might be melancholy tied to the gradual fading of that wholesome feeling, the essence and beauty of it all seems to prevail and help you through the inevitable next-day dumpiness.</p><p>Now I am asking myself the same questions as many of you do: Why can?t I reach this same feeling anymore, when I felt that it was so much a part of who I am? </p><p>My intake is much more controlled than it used to be, probably 5 times a year now, averaging 3 pills. I take better care of myself, do plenty of sports, loving it, I also use more vitamins in conjunction with the drug, as well as 5-HTTP. I typically take the e in the afternoon, and I will sleep during normal hours thereafter. All this should help to improve my trips, but it doesn?t. Off course, I still enjoy doing e, but either I don?t get sexually excited anymore or I will be too knocked out to be able to do something about it, even if I DO have erotic thoughts. I really looooved that feeling. Where has it gone?</p><p>[ Note 1: My normal sex life (outside of e) is intact. ]</p><p>[ Note 2: Write about your experiences. It's the best thing. ]</p>"
}
