{
 "title": "First Foxy at the Festival",
 "author": "Sotoyama",
 "citation": "   Sotoyama. \"First Foxy at the Festival: experience with 5-MeO-DiPT (ID 12940)\". Erowid.org. Jul 19, 2002. erowid.org/exp/12940",
 "substance": "5-MeO-DiPT",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 12940",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 19, 2002",
   "Views: 11993",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nJuly had been unusually cool and foggy in the San Francisco Bay Area, but finally on the 31st we finally got some nice warm weather.  And just in time for the Area:One music festival! Some friends from San Diego were visiting, and it sounded like a great time, with a lot of great bands and DJs there.</p><p>Now I had been debating whether or not I should try some 5-MeO-DiPT ('foxy') that I had recently gotten.  I had talked with a friend the night before who had recommended that I wait until I was in a more controlled environment to try a new substance.  I agreed that this was a good idea, but everything I had read had indicated that this wasn't too much of a mind-blower, and so I didn't think there would be much chance of a bad scene.  I was going with a few friends so in the small chance that something bad did happen, I wouldn't be in too big of trouble.</p><p>So I decided to bring it along with me and see what kind of scene it was.  The festival was at a local amphitheatre, with a second tent set up for DJs and a few techno bands.  We had tickets for the lawn area in the back, so we brought a blanket and set up in the middle of the lawn.</p><p>The day was beautiful and warm, and after wandering around the place to see what booths were there and finding some friends that happened to be around, we put on a ton of sunscreen and lay down in the sun to watch Rhinoceros, a cool french band that plays what I can only describe as 'guitar-techno'.  Feeling that the set and setting were pretty good, I poured a pre-measured 5 milligrams of foxy into a little dixie cup, washed it around with a little bit of water and swallowed it down.</p><p>One thing first:  5 mg is a miniscule amount of material!  I can't imagine measuring out an accurate amount with a pretty good scale or unless someone used the dilution method.</p><p>So anyways, I swallowed the stuff, and it had the bitter alkaloid taste.  I didn't think it was nearly as bad as some people have said.  I don't know that I'd make it the newest flavor at ben&jerry's, but it wasn't anything that a gulp or two of water didn't wash away.  It was 5:08pm, and I laid back on the blanket while The Roots started their set, and waited for things to start.  A minute or so later my gf SMS-ed me a message hoping that I was having a good time at the concert, which I thought was nice and put me in an even better mood. :)</p><p>I got the 'alert' at about 10 minutes, at 15 I knew that this stuff was definitely active, and by 20 things were ALL going on!  I found two things...  first I noticed that there was a definite sense of time-dilation.  I'd keep on checking my watch to see how much time had gone by, and it had only been a minute or two!</p><p>The other important thing, though, is that this stuff is truly active on the digestive system.  At 20 minutes my stomach was already a little upset.  I was never truly nauseous, but I definitely wouldn't want much to eat.  I had read about this effect, and so I had purposely eaten a light lunch, just a fruit smoothie.  I don't think that a bigger lunch would've caused any problem, but on the other hand some friends came by with some garlic fries at that moment, and I was *not* interested.</p><p>After about 40 minutes I was getting tired of hip-hop and wanted to go over to the techno tent. My 'sitter' and I got over just in time to catch the end of Timo Maas's set.  It was amazing, and I no problem at all getting into the music and dancing around.  After 20 minutes or so Timo Maas left and The Orb came on next.  They got all their wacky visual stuff set up, and started their show.  The Orb always put on a great live show, and I was loving it.</p><p>At a little past 1 hour, something interesting happened.  I was up near the front, dancing to the orb, with my eyes closed, just enjoying the music, when a girl moved by me.  In doing so, her sweaty arm brushed my sweaty arm, and *WOW*...  I was jolted out of my trance, and thought, 'what was THAT?!'.  It was an incredibly erotic sensation.  I can see where the name 'foxy' comes from...</p><p>At 1:30 past  I left to get some water, and discovered that I was hungry.  Actually, I mean: HUNGRY!  The smoothie for lunch apparently wasn't enough, and I was in such a mood for some food.  However, I remembered the 5-MeO-DiPT 'peristalsis' report in TIHKAL, and so I decided that it might be better to wait until later to eat.  It was hard to, with all the food places around.  Anorexia is not a side-effect of this stuff!</p><p>At about 2 hours elapsed (about 7:10pm), I'd say that I was peaking.  I was totally engrossed in The Orb, and was having a fantastic time. The strange thing is that it was almost completely physical.  My thought processes seemed only maybe a little different, not at all like the weird speculations that happen on acid.  Although the thought of talking to people seemed a little scary, doing so was not a problem at all.  And while things seemed brighter and more intense, there were no visuals at all.  I get tracers even on half a hit of acid, and so I was looking specifically for something, even closed eye visuals that I have had gotten on low-dose shroom trip.  Nothing!</p><p>Soon after this, I began to start coming down.  The Orb finished up, and they were followed by Paul Oakenfold.  I'm not a big fan of Oakie, and so decided to head back to the main amphitheatre just in time to catch the end of New Order's set.  That was a lot of fun, I danced some more, and then sat down with my friends.</p><p>At 3 hours I was rapidly coming back to normal.  Talking to people was easy, so I told the few friends who knew what I was up to what a good time I had had.  I was still starving, so I broke down and had a kit-kat bar.  While I may have been hungry, foxy definitely isn't like pot in making everything taste good!  The kit kat bar tasted merely average, and combined with the weirdness going on with my stomach, I didn't even finish it.  It felt good to eat a little bit, though. </p><p>At 3:30 hours past, Outkast started their set, and I sat back and listened to the hip-hop.  It was good, I had never really listened to much of their music, and I quite enjoyed it.  By this time I was almost back to normal, and at 4 hours I only had a little bit of tingling in my lips and a slighty queasy stomach to indicate that anything was going on.</p><p>By 5 hours I was through.  Outkast finished, and then Moby came on. After that, we left, stopped by In-n-Out, where I got an Animal-Style Double-Double Burger which tasted good.. That night I was feeling a little tired, fell asleep easily and slept well.</p><p>My overall reaction? I had an incredibly fun time.  At the small dose that I did, 5-MeO-DiPT doesn't seem to a particularly intense substance.  I experienced a small amount of mental effects, although I've had much stronger effects from Marijuana.  In fact, at the 1-hour point I described it to a friend as 'being stoned but without being stupid'.   No profound thoughts, and with the complete lack of visuals, no profound visions either!  My mood was lifted, like being on a small amount of shrooms.,</p><p>The body-effects were something else, though!  Movement was pleasing, and physical contact was incredible.  I really wished I had someone to give me a massage, but suitable person was around. :(  Oh well, I still enjoyed myself thoroughly.  There is nothing profound about this stuff, so I think that it's a lot more suited to personal interaction (especially involving physical contact! :) ) as opposed to the 'meditating in a dark room filled with candles' experience like some other substances do.</p><p>I would say that the amount I took (5mg) was a little low, as at the 2-hour point I was wishing that things could go just a little bit higher.  But I think that it was better to aim low than high for my first time.</p><p>Bottom line: I would totally do it again!</p>"
}
