{
 "title": "Not Again",
 "author": "Bonatlanta",
 "citation": "Citation:   Bonatlanta. \"Not Again: experience with GBL (Renewtrient) (ID 1296)\". Erowid.org. Sep 10, 2000. erowid.org/exp/1296",
 "substance": "GBL (Renewtrient)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1296",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 17695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nhaving a 30 yr history of drug addiction, i know one when i see one, except for this. heroin, methedone, dilaudid, morphine, demerol-any and all opiates opiates,synthetics and deritives-plus all arbs, speeds, hypnotics, bla,bla,blah ad infinitum. substituting one for another, took me from respectability (i'm college educated and had a career) to the gutter (through a series of jails, detox hospitals and near death experiences. this was not the future that i had planned for but i had lost all power of choice BEFORE i knew it.\r\nthrough the grace of GOD and a 12 step program, i got clean and was clean for 1& 1/2 yrs.before i met mr.gbl(renutrient). having an exercise program, i had no problem taking a nutritional supplement to aid in hgh production-after this was a legal 'nutritional supplement' that would help me-right?  wrong-i was hooked from the first 1/2 oz. sip. it was as good-as far as the euphoria, and as bad -as far as the destruction, as anything i've ever done. in the beginning, i thought that i'd found the perfect drug-legal, non addicting, mood enhancing, bearier breaking, sex enhancing, body building and more.\r\nwithin weeks i was out of control. during this binge, i was stopped by police 6 times for erratic driving (once i had passed out in a total strangers driveway and they called the police). each time i took the breathalizer it was negative and i was able to become perfectly alert-so they let me go. i could have killed many people, including my 6 yr old daughter. i had auditory and visual halucinations-hearing people talking to me that wern't there (and talking back), seeing fire and smoke in my periferal vision, blackouts with total memory loss, car wrecks, job loss, and on and on.\r\nwhen i finally realized that i had to get stopped, the withdrawal was bad. sleepless nights (after xanax to take the initial edge off), unmitigated terror & fear, agitation, inability to think, physical and mental craving for more. that was  a year and a half ago this stuff might be the panacea for everyone else in the world but it's no good for me.\n\n\n"
}