{
 "title": "Harmine HCL Crystals in 24 hrs",
 "author": "Church",
 "citation": "   Church. \"Harmine HCL Crystals in 24 hrs: experience with Harmine HCL (ID 12978)\". Erowid.org. Jun 25, 2002. erowid.org/exp/12978",
 "substance": "Harmine HCL",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "insufflated",
   "Harmala Alkaloids",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 12978",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2002",
   "Views: 31878",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAt this moment I am looking at my Harmine HCL crystals growing on a plate... I saw this extraction somewhere else on the net, and didn't know If anyone had tried it, but it works... The first time I tried it I didn't get the 4 mm long crystals that I was supposed to get, but the whole extraction process I went through just became a cluster fuck in my kitchen... I hadn't cleaned all my glass properly, and I didn't have what I needed at that time....        \r\nNow I have seen harmine hcl for sale online and in can cost as much as $100 a gram, and you can buy a pound of seeds for less than half that and do your own extraction.... hmmmm\r\nAnyway, here is the process I used to get the beautiful 1-4 mm long crystals growing on my plate... I don't even know who's process this is that I am stealing, but the one I use is for chem idiots like me, no math or any thing involved...\r\nStep one:\r\nTake your harmala seeds and boil 'em ( you can add an acid or not.  I always add a little vinegar, never measure though).  When they have boiled for about 30 mins, strain the water with a tea strainer into a pyrex measuring cup/mixing bowl thing you can get from a grocery store.  Boil 'em again...  strain into the same container.  Boil 'em again...  strain into the same container.  \r\nStep two:\r\nDump the seeds and wash the pot you were using.  Boil some water and add rock salt (important to use rock salt because there is noting add to it, regular table salt fas stuff add to it.  If you have to use table salt, make sure it doesn't have Iodine in it).  Keep adding rock salt to your booiling water 'till  No more disolves, so now you have a super saturated salt-water solution....\r\nStep three:\r\nStrain the hot salt water into you hamarla boilings to keep out the salt rocks, Only adding enough salt water so that you have 2 or 3 parts harmala-water and 1 part Salt-water.  I try to make sure that I have 3 times as much harmala solution as I have salt water.\r\nStep four:\r\nStir it all up, then add a little bit of cold water to aid in the cooling of the mixture...SOMETHING should precipitate out.  That's a good thing: the crystals form when the temp of the solution drops.  Put it in the freezer for an hour.  After that put it in the fridge for a few hours (longer if ya like, but three of four hours is what I did).\r\nStep five:\r\nThere should be a whole bunch of crystals and grunge at the bottom of your container It doesn't matter how big the crystals are just yet.... I could hardly notice that they were actually crystals, the just happened to be about 1 mm little needles.  Now it should be strained again...I used a bandanna to strain, but a t-shirt will work... Put your filter cloth over the top of a big stock pot and slowly pour you crungy/crystal solution through it...  Now you can dump the shit in the pot outand lay your t-shirt over the pot under a fan to dry out...\r\nStep six:\r\nIt should look like you have extracted sparkling dirt from the seeds... Scrape all your sparkling dirt off your t-shirt and into a clear glass container and add just enough methyl alcohol (ethyl should work too though, and you will know when there's enough you'll have yellowish/reddish/orangish alchy with brown shit in the bottom).  The sparkles dissolve and the crunge doesn't... strain again through a t-shirt and into your a flat Pyrex baking dish or onto a clear plate.  Place under a fan or somewhere with adequate ventilation and wait and watch....  \r\nBeautiful crystals\r\nThis is what Legal highs has to say about harmine\r\nHARMINE -- 7-methoxy-1-methyl-9H-pyrido (3,4-b) indole.\r\n   Material:  Indole-based alkaloid found in several places including \r\n_Banisteriopsis caapi_ (from which the South American hallucinogenic \r\nbrew yage is prepared), _Peganum harmala_ (Syrian rue), _Zygophyllum \r\nfabago_ and _Passiflora incarnata._\r\n   Usage:  25-750 mg harmine (see effects) is ingested on an empty \r\nstomach.  In its hydrochloride form harmine may be snorted (20-200 \r\nmg).  Injection dosges are smaller:  SC 40-70 mg, IV 10-30 mg.  \r\nAbsorbed poorly through stomach.  Small doses (20-200 mg) effective \r\nintrabuccally and sublingually.\r\n   Effects:  Harmine and related alkaloids are serotonin antagonists, \r\nhallucinogen, CNS stimulants, and short-term MAO inhibitors (100 x MAO \r\ninhibition of improniazid but lasting only several hours).  Small \r\ndoses (25-50 mg) act as mild and therapeutic cerebral stimulant, \r\nsometimes producing drowsy or dreamy state for 1-2 hours.  Larger \r\ndoses up to 750 mg may have hallucinogenic effect, the intensity of \r\nwhich varies widely with the individual.  Doses of 25-250 mg taken \r\nwith LSD or psiolcybin alter the quality of the experience of the \r\nlatter.  Telepathic experiences have been reported with this \r\ncombination.\r\n   Contraindications:  Harmine is a brief MAO inhibitor.  It should \r\nnot be used with alcohol and certain foods and drugs (see list).  When \r\nsnuffed, harmine may be slightly irritating to nasal passages.  Large \r\namounts may depress CNS.  Since individual sensitivity varies this may \r\noccur with 250-750 mg.\r\n   Supplier:  CS.\r\n   Note:  Notes on other harmala alkaloids:  Different harmala \r\nalkaloids vary in potency.  The equivalent of 10 mg harmine is 50 mg \r\nharmaline, 35 mg tetrahydraharman, 25 mg harmalol or harmol, 4 mg \r\nmethoxyharmalan.  Harmal alkaloids are synergistic (mutually \r\npotentiating) and are therefore most effective when combined in an \r\nappropriate balance.  Tropines (belladonna alkaloids) also potentiate \r\nharmals.  Harmol and harmalol (phenols) in overdoses can cause \r\nprogressive CNS paralysis.\r\nI have snorted it.... it gives good dreams....  makes my mind work in an interesting way (and faster)... Seemes to be an aphrodisiac for me (very interesting effects here).  It is numbing to the tongue; burns like hell when snorted; tastes like an alkaloid (very bitter); It also makes my spit and piss glow in unde Blacklight.  It doesn't cause me anywhere near the nausea that regular Harmala brews and extracts do, and I have not tried it as a MAOI for tryptamines.\r\nI hope this will be somewhat helpful for others.\n\n\n"
}
