{
 "title": "Temporary Insanity",
 "author": "Shuman the Human",
 "citation": "   Shuman the Human. \"Temporary Insanity: experience with Salvia divinorum (5x extract) (ID 13)\". Erowid.org. May 31, 2000. erowid.org/exp/13",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "1999",
   "13",
   "Not Specified",
   " ",
   "Not Given",
   "May 31, 2000",
   "Views: 4080",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had done Salvia a few times before, and after having only pleasant (or at least, interesting) experiences I wanted to try to really 'break through' and take a large bowl of the 5x extract.  It was very large; I couldn't finish it all in one toke, so I exhaled and took another.  I  don't remember putting the pipe down, but I was outside in my backyard with friends nearby, so I felt safe.</p><p>I thought to myself, 'I will wait for it to kick in.  It shouldn't take long, I just need to wait.  Waiting...'  Then the voice of Salvia (coming through my own psyche) spoke, mocking me.  She said 'What are you waiting for? A bus?'</p><p>'A bus?!'  What is she talking about?  Then I saw something: a colorful pattern of colors, culring like a fractal pattern, and I instantly knew what I was seeing:  my own thoughts.  I was looking at the thought, 'A bus?!' (which of course I was still baffled about.)</p><p>As I pondered the notion of the bus-stop further, my changing thoughts changed the pattern that I was seeing, although on more minute levels than at first.  </p><p>I felt a deep sense of revelation:  I can't explain it now, but it had something to do with the nature of thoughts, salvia, the colors I was seeing, and this bus-stop at which we all wait.  This struck me as being very odd, especially the part about the bus-stop.  Then, like a ton of bricks, I realized the utter insanity of it all.  I was totally insane!  I suddenly remembered where I was, in my backyard, and felt good that I had friends nearby.</p><p>There is a story of a zen monk who aspires unity with the Godhead by clearing his mind through meditation at the time of his death.  Then along came tiniest fleeting memory of a beautiful deer he admired as a child.  He was reborn a deer.</p><p>I think that salvia is like this.  A tiny disjoint thought can spawn the basis of an entire trip, and whether it makes any 'sense' or not is irrelevant.  Therefore, choose your set and setting with great care, and always a friend at hand.</p>"
}
