{
 "title": "Fight or Fuck",
 "author": "First time",
 "citation": "   First time. \"Fight or Fuck: experience with GHB, Cannabis & Alcohol (ID 13021)\". Erowid.org. Aug 9, 2007. erowid.org/exp/13021",
 "substance": "GHB, Cannabis & Alcohol",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 cap",
   "oral",
   "GHB",
   "(liquid)",
   " ",
   "5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13021",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 9, 2007",
   "Views: 23345",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I had ever heard of GHB was on a trip to Huntsville with my friends and at that time I was just big into marijuana and shit like that.  I knew this guy from church and he had some cause his dad was a nutrionist and could get the shit for him. He had it cut with some stuff to make it not so strong but it would still fuck you up.  We were riding around after church one night and he had a bottle of it and was selling a cap for 5 bucks and it was cheap so I decided to do it. Well just before then me and my friends had decided to buy a 20 bag of pot to smoke that night to. They told me that it would fuck me up good and bein my size, 5'7', I would be totally fucked up.  I haven't done much drugs but doing this shit totally fucked me up.\r\nI took one capful and the stuff smelled and tasted like ass but i figured hey if it fucks me up I don't care what it tastes like so  I took it.  We then went to go get some pot and I was hyper as hell and wanted to fuck just about anyone.  I felt damn good and sorta was looking to fight someone.  We got to the dealer and got the pot and more people showed up and bought some and we all decided to match blunts and we all rolled some about 5 or so and we started smoking which I got completely blowed off this shit cause it was some fire.  We smoked it and then decided to leave and I decided then I was fucked up.  We drove around and I felt great and was looking to fight someone or fuck the hell out of a girl.  At that time I didn't care what she looked like just if she wanted to fuck.  I felt great for about an hour.\r\nThe Mess Up\r\nAfter an hour I started feeling like shit and I needed to puke. I had had tacos that night and it was tearing into my stomach.  I told my friends to pull over so I could get out but I just started puking all over my friend's car.  I finally made it outside and puked about 3 minutes.  That made me start tripping.\r\nMy Trip\r\nWe went to go smoke some pot after I puked and stopped at this boat dock.  I didn't know where we were and thought we were parked on 12 feet of snow.  I was tripping out hard.  I thought I saw a guy talking to me for about an hour while they smoked the pot.  My friends said I was talking to noone for a long time and kept saying that we were going to fall through the snow.  There was no snow on the ground it was just white pavement.  About that time my eyes started REM (Rapid Eye Movement).  I couldn't focus on anything and I was freaking out.  My friends didn't know what to do.  I got home about 2 hours later and went to sleep.\r\nMy Experience all in all\r\nI liked the feeling I got off of it and would definitely recommend it.  I did it about 3 days after that and had no problem comboing with marijuana.  I had a definite good experience then.  The last time I did it was about a week ago and I smoked alot of pot and did a capful and drunk about half of case of beer and have never felt that great.\n\n\n"
}
