{
 "title": "Brain Drain",
 "author": "Velosotweaker",
 "citation": "Citation:   Velosotweaker. \"Brain Drain: experience with Methamphetamine (ID 13029)\". Erowid.org. Jan 13, 2008. erowid.org/exp/13029",
 "substance": "Methamphetamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   " ",
   "Methamphetamine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 13029",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 13, 2008",
   "Views: 4525",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAhh yes, speed. Speed and I go way back, and have and twisted history. Two years ago I began a year and a half long speed binge. When I first started doing speed (crystal methamphetamine) it did give me the ill euphoric feeling and the ability to get along with anyone, making me seem to be a sick dude with everyone. I started staying up for 4-6 days smoking dope from a light bulb and doing one inch lines. It began to become a way of life. No else I knew really did speed, so it seemed pretty fuckin cool, and it made everything I did seem sicker than it should have been. The comedowns fuckin sucked my left nut, but every time I did it the after effects became less and less gradual.\r\nOnce I got my own apartment in Albuquerque, I became the fastest motherfucker in the world. I could get speed easier than I could food, and it was all free. I began keeping my my brain awake and heart running indy 500's for weeks. My whole body/brain had a total system shutdown, after my 13th day of staying awake and I thought had discovered one of the many secrets of life, I was one tweaked out motherfucker. I had about 2.5-3 true friends, and talked mad shit to everyone because all the happy juice (serotonin) in my brain was drained.\r\nEventually I was doing 1-2 foot lines for no fucken reason. I didnt even want the shit. I was trapped in an evil fuckin speed trap. I had done everything on speed, various drugs, fucked for hours, literally, skated through tunnels, watched everyone of my close friends fuckin wig out and take off, stayed awake reading the same book for hours, drawing, dancing, raving, driving, gone to school, summer school, work, jail, all while tweeeeeeeeking. One my hobbies with a friend of mine was getting new people we met so fucked up that they would flip the fuck out and watch their brains float down the drain. It was pretty fucked.\r\nI suffered from extreme paranoya, thinking that as soon as I left the room everyone would talk their fair amount of shit about me. Many a night I stayed awake thinking I could hear my friends talkin shit about me. My head is still pretty fucked up in a way not even I understand but it is slowly reaparing itself and the healing process will last for a fucken long time considering the fact that I am still smelling speed, just not as fuckin agressively.\n\n\n"
}