{
 "title": "Body High, Headache, & Lots of Sleep",
 "author": "Na Fun",
 "citation": "   Na Fun. \"Body High, Headache, & Lots of Sleep: experience with AMT (ID 13045)\". Erowid.org. Mar 5, 2002. erowid.org/exp/13045",
 "substance": "AMT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "AMT"
  ]
 ],
 "footer": [
  [
   "2002",
   "13045",
   "Male",
   " ",
   "Not Given",
   "Mar 5, 2002",
   "Views: 11098",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI am a 26yo male, 190lbs, 6' tall.</p><p>4:20pm 40mg oral AMT</p><p>4:50pm Definate alerts.  Something is starting to happen.</p><p>5:15pm body temp rise, some light sweating, muscle tension, some LSD-like sensations (nose, back of throat, scalp all feel exactly like they do when I'm on LSD), </p><p>5:30pm body temp increase and sweating slightly more pronounced, LSD-like feelings more pronounced, some fairly subtle waves of 'body-high' colors already seem more pronounced.</p><p>6:10pm I've been having trouble with my contacts for some time, but ever since about 5pm or so, I haven't really been able to see very well. Everything is blurry, like my contacts aren't fittling well or are dried out. Eye drops don't seem to help.  Anyways, definate LSD-like body high. Everything is pleasurable so far.  Nose is cold, rest of body temp is up. Some muscle tension and restlessness.  Still lightly sweating.  Scalp feels 'tight' like when on LSD.  No nausea yet to speak of.  </p><p>9:27pm Never had any nausea.  There was a fantastic body high that last several hours, but seems to have mostly dissipated.  It was very much like an LSD peak on 4-6 hits.  Felt very silly and energetic from about 630pm til about 845pm.  Music and other sounds were at times very disorienting and chaotic (again, like an LSD peak).  Now I feel mainly 'tweaky' quite a bit of muscle tension, hard to get comfortable, restless.  Eyesight seems to have cleared up mostly.  I am definately high, but it's really hard to put a finger on just exactly how I know that I'm high.  The usual symptoms aren't there.</p><p>10:40pm Muscle tension and restlessness seems to have started to die down. Am always thirsty, and body temp is still a little high.  I feel more sensitive to changes in temp in general.  I've been slightly hungry for the past 3-4 hours, but can't seem to bring myself to eat anything substantial (nothing seems appetizing).  Some grapes, a tortilla chip here and there is really all I can manage.  The LSD-like body high seems be coming back.  Music seems to have a bit of a 'speacial' quality to it, but dancing isn't really doing much for me (which is odd, cuz I like to dance A LOT).</p><p>2:00am There are some waves of body high, but not very strong.  The residual muscle tension has leapt to my head (jaws, scalp, etc) with a vengeance, and is now a full-blown headache.  This isn't really that fun anymore.  It's bearable, and I'm awake, but there's nothing really going on anymore.</p><p>7:00am Finally able to lie down and attempt sleep.  Headache still there.</p><p>1:00pm After 5 hours of sleep, I feel like I have a hangover.  That darn headache is still pounding away.  Still haven't eaten anything and not really hungry.</p><p>6:00pm Should I make some food to go to sleep? Sleep.  </p><p>9:00am Wow, I slept for a long time.  At least I can finally eat something. And that blasted headache is finally gone.  whew.</p>"
}
