{
 "title": "A Generally Awesome Ride",
 "author": "Ret",
 "citation": "   Ret. \"A Generally Awesome Ride: experience with MDMA (Ecstasy) (ID 13126)\". Erowid.org. Feb 18, 2005. erowid.org/exp/13126",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13126",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2005",
   "Views: 7962",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy girlfriend had tried MDMA twice and wanted me to join in one night with she and her friends.  I swallowed the pill (a 5-point star) at about 10pm.  We shortly after went outside to smoke a cigarette.  After about 30  minutes i noticed a sudden interest in everything that was going on around me.  I'd never taken 'x' before so I had no clue what to expect.  All of a sudden it hit me.  I had the most wonderful feeling of inner peace, and I wanted everyone around me to be happy.  The emotional stimulation I felt was wonderful.  <br>However, the physical sensations I felt were totally mind-blowing.  My girlfriend put a techno CD into the CD player and turned the volume up as high as it would go.  I started to move my arms, hands, and head fluidly to the music.  It felt as if I was telling a story with my body.  Every once in a while I'd stop just to touch my face.  A couple hours had passed and the euphoric feeling was still going strong.  We decided to go for a drive.  Playing more techno in the car, I started dancing fluidly again.  I felt no sense of boredom, although we drove for about 2 hours.  One of my girlfriend's friends then got a phone call.  Someone wanted us to pick him up and drop him off at a friends house.  Seeing as there were already 5 people in the car, my girlfriend had to sit on my lap.  The girl driving rolled down a window.  I started to get cold, and I think being so squished made me start losing the feeling of euphoria that I was so in love with.  <br>My girlfriend and I then decided to go to my house. When I got in my truck to drive home the feeling slammed me again, and I spiraled back into heaven. [Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't Do It!] After being home for a few minutes, my girlfriend and i started kissing.  Kissing led to the most intense, emotional, intercourse I've ever had.  We then both went to sleep.<br>Well, at least she went to sleep.  At this point (about 3am), I was no longer feeling the effects of the drug at all.  My mind felt very clouded, and I had a lot of trouble sleeping.  Actually, I didnt sleep at all that night.  However, the next afternoon, my brother had some cannibus and wanted to smoke with me.  After we smoked, I started feeling the effects of the mdma again.  I felt like I had taken another pill.  Everything was the exact same euphoria that it had been the night before.<br>After the effects wore off, I felt very detached, some would call it 'strung out.'  I had a complete lack of interest in doing anything.  I still couldnt sleep.  I just had to deal with the misery and wait until night came.  Finally, out of sheer exhaustion, I fell asleep at about 1am, a day after I had taken the pill.  Although I had a lot of trouble sleeping, the effect of the drug made the sleeplessness well worthwhile.  The experience of MDMA is not something that anyone can just describe on paper or verbally.  The only way to know how wonderful MDMA makes a person feel is to actually try it.  However, be careful about using too much in a short period of time.\n\n\n"
}
