{
 "title": "Spiritual Experience (Original, Eh?)",
 "author": "Former Pot-Fiend",
 "citation": "   Former Pot-Fiend. \"Spiritual Experience (Original, Eh?): experience with Mushrooms & Cannabis (ID 13131)\". Erowid.org. Feb 18, 2005. erowid.org/exp/13131",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Mushrooms",
   " ",
   "0.5 g",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13131",
   "Male",
   " ",
   "Not Given",
   "Feb 18, 2005",
   "Views: 9955",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is an account of my first, and so far only, mushroom experience.  Prior to this experience, I had been worried about my social addiction to marijuana, as not a day went by when I didn't yearn to get stoned.</p><p>Anyway, after discussing mushrooms with a friend who had previously tried them, I said that I was curious to try them sometime in the future.  A few days later, I got a call from that friend who told me that we could try them within a day.  After much indecision, I agreed, and headed off to his place, with the company of a few friends.</p><p>That night, I ended up eating a gram, as did my friend and two others.  I only really knew 2 of the other three trippers, and I hated one of them.  </p><p>I guess it was about 15 minutes after eating that I suddenly realized that I was feeling a bit weird.  My feet went numb and I began to feel like I was a conduit for spiritual energy.  I had to move around a lot, because the spiritual energy shifted, and I wanted to stay in the flow.  I also began to see swirling geometrical shapes on the floor.  One of my friends, who was sober, asked me what I was looking at, and if I was hallucinating.  Although it seems odd to me now, I didnt think that I was hallucinating, that the patterns had always been there, I had just never noticed them.</p><p>Shortly afterwards, I had begun to feel energetic, and went downstairs to play the piano.  After a short discussion with the piano, I proceeded to play, and the music sounded so . . . euphoric.  I felt the sensation that someone was laughing just over my right shoulder, although no one was there.  I looked over my right shoulder and saw three spiritual entities, whom I assume to be manifestations of the universal conciousness (god, if you insist).  Oddly, I didnt pay them any attention, didn't attempt communication (I'm still kicking myself), and continued to play the piano.  </p><p>After an incredible surge of energy which blasted me back to reality some 2 hours and thousands of anecdotes later, I had a moment of self reflection.  During the trip I lost my claustrophobia, lost my fear of spirits, lost my fear of dark, and lost my flinching reflex.  (Usually I flinch when someone snaps their fingers two blocks away, but during the trip I was immune to external stimulus.)</p><p>Now here comes my moment of pride:  After the trip I no longer even think about marijuana.  It went from the center of my life to just some waste of time that occasions me rarely.  It is now almost 3 months later and I have only been stoned twice, and only because I am apparently really fun to be stoned with, so my friends talked me into it.</p><p>Aftermath:  More spiritual</p><p>            Lost several addictions (computer games included)</p><p>            Feel more confident, artistic, and creative.</p><p>Overall View on This particular drug:  It can be good or bad, depending on how you use it (recreation vs. spiritual)</p>"
}
