{
 "title": "Floating with the Clouds",
 "author": "The Green Lantern",
 "citation": "   The Green Lantern. \"Floating with the Clouds: experience with Blue Lotus (ID 13179)\". Erowid.org. Mar 8, 2007. erowid.org/exp/13179",
 "substance": "Blue Lotus",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(tea)",
   " ",
   "2 bowls",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13179",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 8, 2007",
   "Views: 19053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After eagerly awaiting my Blue lotus flowers in the mail, they finally arrived today. I opened up the package which gave of a very pleasant 'dried' sort of aroma. I was going to wait till night time to experience this flower but could not wait. So I put about 6-7 grams in my strainer and infused it with hot water, letting it steep and perk for about 8 minutes or more lifting it up and moving it around ever so often to let the hot water circulate around the flowers. It made a very darkish brown looking tea which had a very pleasant aroma. I let it cool so I was able to sip it without burning myself. It had a very strong taste, kind of bitter, so I added some honey and a bit of sugar to calm it down some. </p><p>I got the whole cup down in about 10 min (which really didn't taste that bad), and went to relax in my recline chair, waiting for it to take effect. Then suddenly I remembered that I had also heard that I can smoke the flowers to get similar effects. So I gathered my pipe and the Blue Lotus, and smoked a bowl (it was sour tasting smoke, which wasn't as bad as I thought it would be).  After the bowl I started to feel a bit floaty, as if my body and vision was a cloud yet everything was clear, and crisp. It felt as if my body had little waves of energy in it but not the kind of energy that would make me want to get up hehe...  I was really enjoying this feeling, so what did I do?  I smoked another bowl.   </p><p>After the last bowl I noticed the effects got a bit stronger but then subsided. So I figured maybe if I smoked a cig it would increase the effects. Drags off the cig felt very smooth and pleasant going down, it was extremely relaxing, to puff and exhale. The cigarette made the experience more serene, but it would have still been good without it as well. The whole experience lasted about 2 hours more or less. Overall I was pleased with its effects. I especially liked smoking the cig with it for some strange reason.</p>"
}
