{
 "title": "Nightmare?",
 "author": "ms. vinegar",
 "citation": "   ms. vinegar. \"Nightmare?: experience with Hydrocodone (with Acetaminophen) (ID 13202)\". Erowid.org. Feb 17, 2005. erowid.org/exp/13202",
 "substance": "Hydrocodone (with Acetaminophen)",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Acetaminophen",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13202",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Feb 17, 2005",
   "Views: 85885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Some background: I've done my share of drugs, but tend to stay away from pharmaceuticals, simply because I can usually find better drugs. However, I just had my wisdom teeth out a few days ago, and was looking for something to stop the pain I was experiencing and help me sleep, because I'd already finished off my 'scrip for percacet (oxycodone 7.5 mg). My sister had some hydrocodone left over from an earlier accident, so I took one pill, reasoning that its effects would be pretty mild since they were only 10mg pills, and I'd been taking one, sometimes two, 7.5mg oxycodones with no real problems.</p><p>I dosed at around 1:30am and got comfortable, hoping to fall asleep quickly. Oh, I fell asleep quickly, all right, but falling asleep was the worst thing I could have done.  I started dreaming almost immediately; I was in my house, and thought I was awake and heading down the stairs. I brushed past a shadowy figure that looked/felt like a huge dog. This frightened me, so I ran all the way down the stairs and into my living room, where I caught a glimpse of my mother and father setting up what looked like some photography equipment.  I was very disconcerted, but strangely intrigued. I wanted to see more, but didn't know exactly why.  </p><p>The next thing I knew, I was in my bed again.  I decided to get up and wander around my house, but I felt very drunk; I couldn't walk straight, and kept hurting myself, bumping into things.  I woke my sister up and asked her to come get a glass of water with me. We walked down the stairs, and I began to get the same sick, nervous feeling I felt when I encountered the 'dog' on the stairs.  I began to see people I've never seen before coming up to me and speaking in strange languages. My sister didn't notice them, but I had to shake them off in order to get into the kitchen. Once I got to the kitchen, I was having full-blown hallucinations.  Everything was kind of moving on its own, and I was terrified. I kept screaming 'my god, I'm fucking tripping!' I stumbled around the kitchen for a little longer, still looking for a glass, and then finally gave up, sitting on the floor and letting the world spin around me. I had no control over my body or my mind. </p><p>A second later, lo and behold, I was back in the bed again. My mouth was excruciatingly dry, and all I could do was roll over to my sister and mouth 'help me, help me, water, water' over and over again.  She handed me the glass and I gulped the water like there was no tomorrow, but when I put the glass down, the same amount remained. I was frustrated, and went back downstairs to get some 'real' water. The world was still slipping out from under me, and I had to hold on to anything I could just to stay upright.  I walked back into the kitchen and found that I had awoken my parents with my noisy antics.  I was still seeing strange people and animals coming at me from every angle, and when I saw my mother, I ran up to her and hugged her, moving my mouth senselessly and telling her that I was either tripping or losing my mind. That's when I began to see the needles. They were everywhere; hanging off the ceiling, strewn all over the floor, on the counters and the table... And in my mother's hand. She told me to hold still, that she was going to inject me with some vinegar that would bring me back to normal ('it's an old wives' tale,' she said). I offered her my arm, and she injected the vinegar into my vein. I remember the prick of the needle, and how the vinegar stung as it began to mingle with my blood. She wanted to give me another syringe-full, but I told her that I needed a while to recover from the first injection. </p><p>Then I was back in bed again. This time, when I sat up, I panicked. I thought the vinegar incident was a dream, but I looked down at my arm... It had a band-aid on it and was still stinging from the injection.  I grabbed my sister and woke her up, asked her if she had gone to get a glass of water with me at any point in the night, and she said 'no.' I reached for my glass, and discovered that I had broken it into several pieces, but that the water remained inside. I tried to drink from it, but sucked a sliver of glass down my throat and spent a good while spitting up blood into the glass.  At that point I was completely terrified, and, feeling that I'd had enough, decided to venture back down the stairs to find my mother.  Well, the whole staircase was littered with needles and syringes, and I had to pick my way through them (this took forever; everything was still spinning, mind you, and the odd 'shadowy figure' would pop out at me from time to time).  I went back into the kitchen and found my mother and father standing there, looking very concerned.  My mom said that she was glad I had this 'little episode,' because otherwise, she wouldn't have known that I was addicted to heroin. I tried to explain to her that the only thing I'd taken that night was that ONE hydrocodone, and that it was making me trip my ass off, that I felt like I was drunk and on acid... Not like I was on any kind of opiate.  </p><p>I remember her going into this very detailed explanation of how she was going to analyze strands of my hair for evidence of opiate abuse, and me telling her that she could go ahead; she wouldn't find any regular pattern... I'd just used the oxycodone and hydrocodone for pain this week. </p><p>Then... I was back in my bed yet again.  I woke up and looked around. Nothing was moving. There was no band-aid on my arm. The glass was intact. Only an hour had passed. I woke my sister up and asked her if I had disturbed her at all. She said that I hadn't, and that she was just then attempting to sleep.</p><p>NONE OF THAT HAD HAPPENED AT ALL!!!!  </p><p>Getting stuck in basically the same dream (in my case: waking up, wanting water, going to the kitchen- with some variation) is the single most horrifying experience I've ever had. I can't go back to sleep now, for fear that I'll fall back into the same hell.  This had to be induced by the hydrocodone; I never have dreams like that... Ever.  Not that realistic. Not that torturously vivid.  </p><p>Maybe this experience had something to do with me falling asleep during the hydrocodone's peak. I was also overly-curious at the beginning of my cruel cyclic dream... Remember, I WANTED to see what was ahead when I went down the stairs the first time and passed that dog. I opened myself up to that experience.  Another strange note: the phrase 'putting myself through hell' kept popping into my head throughout the duration of the dream/experience.  Perhaps later I'll be semi-thankful for this whole experience... After all, I faced some of my worst fears, but right now I'm too shaken to even attempt to go back to bed.  I'll also never look at vinegar the same way again. : )</p>"
}
