{
 "title": "Dolby Surround Sound Dreams",
 "author": "Yeps",
 "citation": "   Yeps. \"Dolby Surround Sound Dreams: experience with Piracetam (ID 13205)\". Erowid.org. Nov 6, 2003. erowid.org/exp/13205",
 "substance": "Piracetam",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Piracetam"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1993",
   "ID: 13205",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2003",
   "Views: 25812",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThat was the time I was 19 and since my father as a MD has many books and good friends of a nice pharmacist friend of the family and owner of one of the largest pharmacies in our area it was normal for me, as a naturally curious person, to check out on the 'smart drugs' book I found in his library.\r\nPiracetam was easy to get and cheap, so I give it a try. The effects of this drugs are not regular. I mean, sometimes you dont feel nothing but sometimes you get nice dreams. I never noticed nothing different while conscious.\r\nWell I had this kick ass dream once, that was like being in an action movie. It was very clear for me in the dream that what happened was a 'show' for me, to see how cool it could be. It was like that in the dream: as I was walking down the street everyone was so colorful, shiny and crisp. Objects were so very well defined and movements smooth and fast. Then a bus passed by filled with guys with machine guns and started to blast everywhere, then I could hear the bullets passing by my ears and ricocheting. Also as the bullts hit cars and stuff the sparkles were amazingly realistic. Dont consider it a bad trip or nightmare, that was not the concept of the dream in the first place so I waked with a smile on my face. \r\nI started taking Piractem in order to improve my learning skills and concentration in studying for tests. It never happened for me.\r\nI gave some pills to a friend of mine and he said he completed a test, achieving 100% right questions in just 25 minutes. No difference for me though.\n\n\n"
}
