{
 "title": "Ready to Love and Live",
 "author": "Coyote",
 "citation": "   Coyote. \"Ready to Love and Live: experience with DMT (ID 13214)\". Erowid.org. Mar 13, 2002. erowid.org/exp/13214",
 "substance": "DMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "smoked",
   "DMT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13214",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 13, 2002",
   "Views: 14023",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been looking for DMT for about a year. Found it 5 days ago. I have been holding it, looking at it, scared to take it.</p><p>It is organic DMT, 200 mg of. I split it into four doses and smoked one dose in a pipe. Just to mention I had been waiting for a baby sitter to turn up to watch over me, just thought the right person would turn up but decided to do it on my own.</p><p>First really big draw didn't really do much.  I felt like I was just starting to peak on acid but in a very calm way, so I light the pipe back up heated the bowl for a bit then sucked like crazy.</p><p>Everything changed, aliens came at me, like I was surrounded by these other beings. I thought I was dying, thought this was forever. Freaked out totally, jumped up ran about just thinking I want this to be over, I want it to end. But somewhere I calmed down and they it us started talking to me and I understood everything. It was like no time and all time.</p><p>I was here in my body I was over there and there and there in all time all space all at once.</p><p>And all the time there is all these talking voices going ok your over it now lets play and look and see this and see how it all fits together, then I got really horny mid trip I wanted to fuck. They were going.  No, no, come back you need to see this and I stayed and watched/saw/taughtmyself.</p><p>I came round like going how long was that? It felt like forever and seconds at the same time.</p><p>I jumped about feeling so happy shouting everything and nothing like I knew what it meant and it made sense but as soon as I thought what does that mean I stopped understanding.</p><p>I'm sitting here after the high feeling blessed and renewed, alive, full of choice, ready to love and live.</p>"
}
