{
 "title": "In Her Fields: Ahh",
 "author": "SullenChoirboy",
 "citation": "   SullenChoirboy. \"In Her Fields: Ahh: experience with Salvia divinorum (ID 13211)\". Erowid.org. Feb 19, 2004. erowid.org/exp/13211",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13211",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 19, 2004",
   "Views: 5228",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis will be written in the present tense to preserve a sense of comfortable urgency. It is my 2nd experiment with Salvia divinorum.\r\nSunday, March 3rd, 8p.m.\r\n'Nice timing, assholes.'\r\nMy parents have just come home and it pisses me off but I turn on the fan anyways to mask any embarassing sounds coming from my room. I won't let this stop me. I pack 3 or 4 crushed leaves into my contact solution bottle water bong then a small pinch of 5x extract on top. I relax a little, hyperventilate a little to open up my breathing. I am getting nervous, but my breathing helps. After a while I noticed I kept postponing it. My environment looked ready for me. No music was heard. All lights were off. It's more cluttered than you can ever imagine but fuck it. The only thing that could be heard was my fan, and occasionally my stupid bitch of a little sister making irritating noises behind my wall. Everything is set. I am sitting on the edge of my futon, and pull the bong to my face.\r\n:shhhhh: :fffff: :.pop: :ffffsshhh:\r\nI light it and suck. It's going down relatively smooth compared to the day before. By the time I count to 30 my head feels detached from my body, floating above it like a balloon. It's even rocking back and forth like it has been caught in the wind. I exhale and light it up again. I can feel something coming. My head is feeling even more disconnected. It is somewhat more difficult to hold this hit in, but I did, I think. 30 comes like a friend and I assume I exhaled. Here comes a completing number 3. I go through the routine again but wait, I have to go, what am I doing here? Halfway through my holding in the harsh smoke, the bong was quickly taken from my hands, and I was forcefully pushed to the pillow at the end of my futon.\r\n'What are you doing? We have to go!'\r\nI seem to reply, 'I'm coming, I'm coming.' After speaking to me, this voice turned its attention. It is a brunette female of a somewhat young age speaking to a white haired man. I am pulled up into something. It moves very fast. Immediatly it is known to me that I am with the circus, and we are travelling to our next venue. I can't tell if this is a train, white horses, or just an energy tearing through the night sky. My view shifts and I am now under whatever it is I was riding on. It looks like I am under a white plastic table and the legs are shifting around too quickly trying to solve their own puzzle. It's so colorful, but am I being trampled?\r\n'So many voices, so many voices.'\r\nHmm, I am flying through space now. Well, more like I have the view of flying through space, as I didn't feel like it was me. It's hard to hold on to this image. Everything has been broken up into a million colors and I have never seen space so...so...colorful. This departs and I open up my eyes to see where I am. The first thing I see is an image on my wall that could have been me, with his back turned to me running fast and hard. I have no difficulty acknowledging that this room is mine, or what happened. Despite feeling entities, hearing voices, I think it's time to assess what has happened. I stumble over to my TV, barely able, turn it on, realize how ugly the imagery was, turn it back off, fiddle with my fan since I am aware of how sweaty I am, and sit my ass back on the futon. I lie down once again and force my eyes shut.\r\n'Think what you want of me.'\r\nFace to face with a wall of pixelated rainbow glass. This is all so familiar and common. Hey is that a worm I see through the glass? :giggle: It looks like one of those sandworms from Beatlejuice. Holy shit, it just broke through the glass. I feel separated from him, and calmed, so I am not afraid. I am being judged. These creatures all around me, their whispers I associate with myself. They must be talking about me. Color has been fractured into oblivion, so it is impossible to look at them. So many voices, it is impossible to decipher any voice other than my own. My own voice rises above the others, as I am trying to rationalize the situation to myself. More worms are breaking through the glass. Was that a skull? The glass is shattered into millions of pieces shimmering more colors than I can wrap my mind around. It's stupifying, really. The 'worms' have lost their tails. I see faces. You look so tortured. I must look just like you. They are flying all about my field of view, taking on ghostly likenesses. Faces stretching, whispers seem like orchestrated screams. I stare endlessly into the vacant eyes. What is that behind you? I am approaching a doorway. Light is escaping through the cracks. Flashes of my formless hand meet the door. Nothing? What's next? Did I open the door?\r\nEnd of story\r\nNow, the day after, I think that door led back to reality. Color was still fractured and there were still so many voices, but I was back in my room. I carried just one thing back with me. It is, 'You never listen to anybody but yourself.' Christ on a stick, thats so true! Had I been before La Pastora and simply wouldn't listen? Its possible, but I don't feel like I have been punished. I feel welcome to visit again in her fields. Throughout the whole thing there were 4 things that seemed stronger than anything else.\r\n1) Color. The very idea of it was shattered. It was difficult to see an object without concentrating on all the multicolored pixels it consisted of. It was confusing visual anarchy. Lasted longer than the trip itself.\r\n2) Voices. Also lasted a very long while. They were judging me, impossible to understand. There were many. They sounded like whispers coming from very powerful voices. I sensed enlightenment was distributed by these creatures as they wish. Sometimes I could get a simple feeling out of what they said, and apply it to a new knowledge.\r\n3) Familiarity. Nothing was shocking at all. It felt more familiar than my home, more familiar than familiar. It wasn't anything less than seeing things from memory I was previously unaware of. This familiarity is still with me today. It seems to be a part of who I am now. I now understand that 'now you know' aspect of Salvia divinorum.\r\n4) Relaxation. It was so calm. I was nothing short of happy-go-lucky in my journey. That is still with me as well. After the experience I just lied on my bed for a couple hours almost thinking about what happened, but also thinking my normal thoughts, ie: food, need to defecate. Eventually, I fell asleep doing this. I slept for about 5 hours maybe, waking up at 4a.m. All very relaxed and humble.\r\nI am surprised to see I am capable of insight. Anything can happen now. Only the future will tell.\n\n\n"
}
