{
 "title": "Accidently smoked PCP",
 "author": "Bobalouie",
 "citation": "   Bobalouie. \"Accidently smoked PCP: experience with Cannabis & PCP(?) (ID 13246)\". Erowid.org. Apr 23, 2005. erowid.org/exp/13246",
 "substance": "Cannabis & PCP(?)",
 "bodyweight": "146 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "PCP",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13246",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2005",
   "Views: 50455",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This, is fucking insane.</p><p>I was walking to my first class at community college, and I spotted a half of a joint in the grass.  I hadn't smoked any weed for a month, so I interpreted this as some sort of sign that it was OK for me to break my weed fast just this once.  Well after class me and my friend 'Y' went to meet her boyfriend.  He picked us up and we smoked the joint, which tasted funny, in his car.  I began to feel fucked up very fast, wow I thought, my tolerance has gone WAY down, then a little bit too fucked up.  My whole mouth and face felt numb.  I felt like yelling, and we both were laughing about how weird we felt.  Well at this point they dropped me off at my car because they had to leave and I still had another class in an hour.  So I'm at my car, alone, totally twacked out of my head.  </p><p>I drive to my friends house which is down the street from school.  I can only look straight forward, looking left or right while moving forwards confuses the hell out of me.  Out of some miracle I make it to my friends house.  Walking up to his door I feel like I am walking incredibly strange, my movements are jerky and I feel like my body is really blocky and compressed.  I walk into his house and I start yelling his name, he isn't home.  I feel light headed, like I am about to pass out, and my whole body is numbed out (kind of like nitrous I suppose).  I call my other friend who lives on the same street a few blocks down.  I told him to come over because I think I just smoked PCP and I didn't know what the hell was going on.  </p><p>I made some green tea.  My movements are jerky and sporadic and I spill water all over the stove as I slam the pot down.  I put on Fatboy Slim because I wanted to hear what music sounded like in this state.  It wasn't that great, it didn't seem to make much sense to me.  I danced around a little bit to the music.  I felt like I was floating around and being pressed down on at the same time, gravity was totally distorted.   The beat of the song sounded like it kept slowing down and speeding up.  I pour my tea, and try to drink it.  </p><p>I notice my heart is beating really fast.  I become a little paranoid and call my friend again and tell him I'm going to walk down the street and meet him half way.  I walk outside with the tea cup, spilling tea all over my hand as I walk.  I notice people outside, and I am paranoid that they know I am fucked up.  I feel like I am walking crazily, I have to concentrate really hard to feel like I am walking normally.  I clench my fist, it feels like a bunch of blocks.  </p><p>My whole body feels incredibly strange, like a big moving abstract sculpture, I am totally disoriented.  I try as hard as I can to look normal.  I feel like I am walking really slowly, getting nowhere.  again if I look to the side when I'm moving forward I get extremely disoriented. I think about how I want to hug my friend when I see him.  All of the sudden I see a mass of grey and black squares, it seems stationary, I can't tell if it's getting closer or moving farther away.  It's my friend, and when I see him I tell him thanks for meeting me.  He has a boombox with him.  He tries to tell me some story but I can't make much sense of what he is saying.  </p><p>I tell him over and over that nothing makes any sense and I don't know what the hell is happening.  We walked back to our friend's house, went in and watched tv.  I told my friend to page 'Y' to see if they are ok.  They call back and he tells them I am going absolutely insane.  Then went to school so I could at least sign in to my class. Overall the effects lasted about 3 and a half hours.  Definately one of the craziest experiences of my entire life, as I had never smoked PCP or done any dissociatives before.  The experience definitely wasn't pleasant but I can't say it wasn't interesting and fun in a strange way.  Now I can know what those guys on Cops are feeling when they're running around shirtless speaking paranoid jibberish.</p>"
}
