{
 "title": "Load of Shit!",
 "author": "anonymous",
 "citation": "   anonymous. \"Load of Shit!: experience with Dimenhydrinate (Dramamine) (ID 13274)\". Erowid.org. Feb 23, 2005. erowid.org/exp/13274",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 13274",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 23, 2005",
   "Views: 7451",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well all I can say is...ITS SHIT!! I must say I had a few  closed eye visuals, but other than that it felt like I had the flu.</p><p>I bought my pack of dramamine on Thursday, & I said I'd take it on Friday night.  So on Friday at around 11:15pm I took my 10 pills (it only comes in packs of 10 where I live) chewing the first 5 by accident (which left my tongue all numb & a really bad taste) & swallowing the other 5. I waited for about 30 mins, but I couldn't stay awake so I went to sleep.  I woke up around 1:00am (I think so, I didn't check what time it was) my head was spinning, but I wasn't having any hallucinations.  I went back to sleep for about 10 mins, then woke up.  I kept going to sleep for a few minutes then waking up, this carried on till around 6:00am.  I finally went to sleep for about 2 hours.  I then woke up at 8:00am, & I had to take a piss.  When I got up out of bed & stood up, my head felt really light.  When I tried walking my legs felt like they were made of concrete.  I went to the toilet then went back to bed.  I got up at 11:00am and went downstairs had a cup of coffee & watched wrestling, while I was watching wrestling closed my eyes & I could see stuff like skulls & shit.  I thought that was pretty cool. It all lasted till around 3:00pm, then I felt normal again.</p><p>All in all it was OK, but I probably won't try it again.  also my dick kinda shrinks and that totally scared me.</p>"
}
