{
 "title": "All in My Head",
 "author": "FlyGyrl",
 "citation": "Citation:   FlyGyrl. \"All in My Head: experience with Cocaine (ID 1329)\". Erowid.org. Nov 4, 2000. erowid.org/exp/1329",
 "substance": "Cocaine",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1329",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 4, 2000",
   "Views: 28679",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI recently began using cocaine on what has become a frequent basis.  My boyfriend introduced me to it, and the two of us regualarly use, but our usage is not based on addiction and we still go about our responsibilitys and live full lives. I had always had a mindset that cocaine was an addictive drug, and always thought of it as one of the worst drugs, ranking it with heroin.  Once I did it though, my thoughts have completely changed.  I initially worried about addiction, and overdosing, and can understand how a person might find themselves in theses situations, because it makes you feel good, and who doesn't want to feel good?. I believe though, that when used as a reward for a hard worked week, or a stress reliever to unwind, the idea of an out of control addiction is not a possibility.  This drug cannot just take over your mind, unless you let it.  \r\nI have found it to be wonderful in my relationship with my boyfriend.  We talk for hours when we use, and wherever we are, or what were doing, the cocaine makes it enjoyable.  We do use frequently, but limit our use to weekends and special occasions.  Used in this manner, it becomes an enjoyable experience, and something to look forward to.  The reason for the existance of drugs such as cocaine, is for enjoyment.  When they are used for enjoyment, and you set your mind up to understand that they won't last forever, you can use and still live life to the fullest.\n\n\n"
}