{
 "title": "Just Majestic",
 "author": "robd",
 "citation": "   robd. \"Just Majestic: experience with Mushrooms (ID 13290)\". Erowid.org. Feb 21, 2005. erowid.org/exp/13290",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 13290",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2005",
   "Views: 4624",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFrom around 12pm to 3:30am we sit around in the basement listening to music, setting up a play list for the trip. I was happy that I was finally gonna do this. Around 3:30am I go upstairs to the kitchen. I get some bread, some sparking cider, bring it down. We make a shrooms sandwich with the bread :) and wash it down with the sparking cider. Crunchy. Not a bad taste at alljust crunchy bread. We split an 1/8 but oh well first time. Forman puts on my red far rock sweatshirt hood thing b/c he's cold. We shut off the light and watch the lava lamp and electro hang thingy. About an hour later were talking about how nothing has happened yet and were starting to get disappointed.but.it begins..: it is pretty dark in the room and im looking at forman and I notice that I can't really see him anymore. All I can see if the outline of a trapezoid when I look in his direction 'do you feel anything?' 'yo man your a trapezoid!' 'really?' 'oh wait or is it a rhombus?' after that we just start laughing hysterically for no reason other then that sentence for 15 minutes. Literally. Then I put on the music and the trippy winamp visualations. It was amazing. <br>For us, we went from sober to tripping very unexpectably... Around 5am or 6am I think we were peaking.. we listened to 'Shine on You Crazy Diamond (Parts 1 - 7)' by Pink Floyd and it was amazing, when the drums come in at 4minutes its orgasmic. Or when the voice starts at 7minutes. Wow. Just wow. Even so. It was not the musical highlight of the night. I was reading about good music for tripping, and recommended was 'Terry Riley - In C.' this just blew us away. 42:01 minutes of sound. When it ended the world felt empty, it felt cold and bare. The song brought warmth to the time. Speaking of time, during the trip, what the fuck was it? No clocks in the basement.we did not look at the time except for when the trip started, and when we went to bed. (3:30am - 8:45am) it felt like lifetimes had passed, and I had experienced so much within this. However, I did not see little gnomes talking to me or fairies flying in the sky. I did have close eye visuals. Whenever I closed my eyes I was in a different world. I remember curling up in a blanket in the corner with the headphones while A stared into the visuations on the screen (felt like actually riding with the waves of the music or the designs on the screen). I had the headphones on max, in c playing, floating away, and I was stairing into the red light on them. <br>My little world under the blanket glowed red because of the darkand put my eye up to the light and shut them. I saw mountains and valleys that shined red trees and leaves. It was so amazing. Also, as I said before, A was wearing my red hood thingy with the hood pulled over his head, and it didn't seem like himself anymore, it seemed liked someone familiar, just not him..also, the pool room was the blue room because it glowed a dark green color and the main part of the basement we named the red room. It seemed evil and dark and we didn't go in there.it glowed redit feels weird saying red, or blue, because the colors seemed so different from what your going to think about in your mind when I say a color. The colors had so much more character and detail to them. Maybe its always there and we just don't realize it and it was now brought to light.the colors seemed too amazing as well. You could just stare at anything and examine it and see how beautiful it actually was that you overlook 99% of your life.<br>Another funny thing was that we realized something about life that we never realized before and was like 'man I never thought of it like that!' and I was like 'were not even going to remember what this thing is' and were joking about how we wont even remember 'the thing' in the morning.. we didn't. actually, we forgot it about 5 minutes after we said it. We'll never know what the thing was.Also, other then visualations, I could basically make my whole body feel orgasm whenever I wanted it to be. And whenever I watched the light show on the computer or the amazing songs.. it automatically went off. <br>What a night.so many amazing things, and im probably not even remembering some of the things. Basically everything we did was amazing. The night was just majestic. The next morning, I felt great. Not depressed, not pissed off, not angry about life, not angry about society, not angry about my family. Everything fit, everything was just great. What an incredible night.\n\n\n"
}
