{
 "title": "The Worst Feeling Ever",
 "author": "Jammy99",
 "citation": "   Jammy99. \"The Worst Feeling Ever: experience with Citalopram (Celexa) & DXM with CPM (ID 13339)\". Erowid.org. Sep 20, 2007. erowid.org/exp/13339",
 "substance": "Citalopram (Celexa) & DXM with CPM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   " ",
   "600 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "13339",
   "Male",
   " ",
   "Not Given",
   "Sep 20, 2007",
   "16729",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]  </p><p>I have been experimenting with DXM for a long time, and am very familiar with it. Used mostly in the form of coricidin. Then I started taking an ssri called celexa, which is *strongly cautioned when used with DXM. One particular night after being on celexa for about 4 months and never going past 360 mg DXM, I decided to bump it up and do 600mg.</p><p>Onset was regular for this dose. I felt very disconnected, loose, giggly and intrigued. I felt fine for the first hour, when nausea set in so bad I went into an uncontrolled vomit. I have never had that before. This is when things turned for the worst, the fun feeling was *gone. My skin crawled, my brain ached, I couldn't tell if I was coming or going. The feeling was insane, I could not escape this tingling, stinging sense that was pulsing through my back, upper neck and head. I felt like I needed to peel my skin away to escape myself. Needless to say, it was insanity. My nerves tremored and my body shook out of my control a lot. Half the time was spent complaining to myself and trying pointlessly to catch my breath which was very weak, the other vomiting while in and out of VERY unpleasant lucid states of mind.</p><p>Had I not the willpower to retain some fragment of control, I would have easily killed myself (not thinking of 911). The worst effects were gone within 4 or 5 hours, the lingering hangover, headache, and  body tingle remained for the next day.</p>"
}
