{
 "title": "The Good, The Bad, and The Ugly",
 "author": "Revelati0n",
 "citation": "   Revelati0n. \"The Good, The Bad, and The Ugly: experience with Amphetamines (Adderall) (ID 13348)\". Erowid.org. Jul 15, 2005. erowid.org/exp/13348",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "13348",
   "Not Specified",
   " ",
   "Not Given",
   "Jul 15, 2005",
   "27413",
   " "
  ]
 ],
 "report": "</p>\nIt all started when I was prescribed Adderall for attention deficit a little while back. I found that when I took it regularly it had miniscule recreational effects.  I soon started double-dosing to 20 mg. This had a nice little buzz. Soon after, I decided to try something new, and I was blown away. I took over 80 mg of my Adderall. Soon after, I started repeatedly dosing at this level. This is a sample experience, which is basically the way it plays out every time I high-dose on Adderall.</p><p>T+0m- I gobble down my Adderall and blare some music, while I try to prepare mentally for what I will soon encounter.</p><p>T+15m - Mild effects start to be noticed (palpitations, increased awareness, increased concentration, and increased mental clarity).</p><p>T+30m - This is where pretty much where the Rush comes on. It's a rush of pure energy.  Everything is good. I feel as if I can take on the world. It reminds me ALOT of that adrenaline rush you get when you are extremely angry, only the vibes are good.  Dancing, running around, doing ANYTHING WHATSOEVER is fun. This includes homework! I smoke a TON of cigarettes, even that feels SOOOOO good.</p><p>T+1h - Effects start wearing offthis is usually around the time I take a look at myself in the mirror.  My pupils get so dilated that there is no longer color in my eyes, it just goes from black to white. negative effects start kicking in.</p><p>T+2h - The CRASH - I don't experience what most people typically describe as a crash from Adderall. I get horribly confused, NOTHING makes sense. Everything is dull. I still feel horrible palpitations, but they no longer feel good.</p><p>T+4h and beyond - Usually around now I'm trying to sleep. People say things like 'If you take lotsa speed you'll be up for a week!' for some reason that seems to imply that you'll be high for a week. You WILL be up but extremely lethargic, depressed, and at repeated high-doses hallucinating. I get bad hallucinations after the crash, and every negative effect you feel get compounded 1,000,000 times over by your lack of sleep. My arms might be flushed for 3 days after I took the Adderall, my skin gets all dry, and the WORST feeling in the world is being cold. I'll often find myself shivering at 60F.  </p><p>I soon found myself addicted to Adderall, I realized that I had lost control of myself.  I promptly stopped, withdrawal was a bitch, it can best be described as the CRASH lasting about 2 weeks. I feel a LOT better now that I stopped. This is one drug I do NOT recommend to anybody in high doses, in retrospect the Rush was definitely not worth feeling like shit whenever I wasn't high.</p>"
}
