{
 "title": "Open Your Eyes",
 "author": "kjat",
 "citation": "   kjat. \"Open Your Eyes: experience with Mushrooms & Cannabis (ID 13367)\". Erowid.org. Feb 22, 2005. erowid.org/exp/13367",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 13367",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 22, 2005",
   "Views: 4158",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nNever before in my life have I experienced anything so awing and humbling.  The simple existence of life boggles the mind.  Tripping can really put me in my place.  We are nothing, absolutely nothing with no power or say in the scheme of things.  We are but minuscule fragments of an infinite, mysterious universal.  The way things work, the particles comprising everything fascinated me for hours.  Time warped into something unreal and immeasurable.  \r\nWe each ate an eighth at 11:40 in peanut butter sandwiches and started to play monopoly shortly after.  It was then the laughing started.  Drew was destroying us with his luck so we decided to stop the game.  We went down to the weight room to hit it, by now it was 12 and Erics had totally kicked in.  He described as the carpet in the living room seemed to ripple like a puddle and the bathroom floor changed colors.  As we started to hit it, though, Caitlin called and pulled Eric away for what seemed years.  It was then everything started to kick in for me.  To my right, next to the water dispenser, theres a dirt stain on the floor.  The floor is black with tiny, turquoise triangles dotting it everywhere.  Twice, when Id look at the stain really quickly, it would morph into an array of colors and shapes, for a second.  After finishing two bowls, Eric finally came back.  We were all fully tripping now, laughing our asses off for no reason.  Then Caitlin called back and pulled Eric away again.  It was then I noticed the floor was moving.  \r\nFrom what I could tell, it appeared that there was a layer of ice over the floor and the black became the murky depths below.  It looked as if water were flowing freely under the ice and moving the turquoise triangles in its flow.  There was a pattern to the movements of the water, swirling, making shapes, or sometimes just going in one direction.  It was beautiful.  It was everything I had hoped to see and feel, and it was just beginning.  Drew and I talked for a little while, deciding that since we would never be able to share hallucinations, we should venture outside and share all we saw.  We then tried to get up and out the door, but were stopped in the living room.  Eric was still battling with Caitlin and he didnt appear to be doing so well.  Drew and I would randomly break into laughter and he thought we were laughing at him.  While we were waiting for him to get off the phone, I began to notice the wood changing shapes.  The designs of the wood were constantly in motion, looking like waves or spinning in circles.  The green carpet was like the life of a forest, years and centuries seen in the blink of an eye.  \r\nI watched in awe as the pieces grew exponentially, crawling over and under each other in a living wave of what looked like plants.  There was a picture, or a photograph on the wall, I dont recall of what exactly, but it appeared as if it were covered in a bubble or glass dome.  The pictures all around the room seemed to stare at us, except one baby picture of Drews sister that wouldnt take her eyes off of Eric.\r\nWe finally got Eric off the phone and started our journey outside.  We had rolled an L of Jamaican for our journey to the outside, but it was broken in the throws of the trip.  As we ventured into the backyard, we realized it was raining.  The trees, having collected drops of rain, were refracting the moonlight sending rays of brilliant colors everywhere.  To me, it appeared as if the trees were being x-rayed as their skeletons were outlined in the yellowish glow of moonlight.  After that, we wandered to the street where we lit the two halves of the L and puffed away.  I think they forgot about me because I got my half to myself while they passed the other one back and forth.  \r\nIm not really sure what happened after this point, because it was the height of our trips.  It was around 2:30 and time seemed to stand still.  From 12-2 seemed to fly by unnoticed, but from 2-3, especially around 2:30, time really appeared to stop.  Wed be talking and Id look over at the clock and it was 2:32.  What seemed like 20 minutes later, Id look over again and it was still 2:32.  The distortion of time was quite strange.  As 3 oclock came around, time sped up and it was 6 all of a sudden.  While tripping, it seemed reasonable to talk about the trip in sections of time.  We used terms like, remembering during 2, or man 3 just flew by.  \r\nWe started to play Halo, on Xbox, seeing things we never imagined.  The symbols on the floor would fade into nothing and then come back stronger and brighter than before.  The walls were unreal, never stationary, as if alive.  It was unbelievable to think about my brain telling my hands to press buttons that made the man on the screen\r\nmove, jump, and fire.  I remember coming around a corner and seeing Erics guy running straight into a wall for a good 10 seconds before I killed him.  As Eric relinquished the controller, he began to become nervous.  He repeatedly told us to turn off the Xbox as if it were hurting him.  We finally did and I dont remember exactly what happened next.\r\nBy now, the constant laughter had ceased and thoughts barraged the brain. I was caught up in the idea of existence.  The incredible greatness of being.  It amazed me to think that we were all made up of tiny individual particles comprising greater and greater things.  It was a real humbling effect to think how unimportant we are in the scheme of things.  How what seems like years to us, an eternity, is nothing but a fleeting moment in the vast universe.  I wondered how electrons, protons, and neutrons worked together to make up the nerve cells in our brains, responsible for movements, thoughts, and feelings.  The entire ordeal was quite confusing, yet I feel it put me in my place.  I have always thought of the human race as some sort of infestation, destroying this beautiful planet.  But, after tripping, I simply awed by unbelievable probability that somehow resulted in us.  No longer do I look to my brethren as a plague, but rather I look at them with sadness, a deep sadness that weve let such a gracious gift go to waste.\r\nI returned to the living room and found Drew in one of the chairs watching TV.  Eric was on the couch, huddled over the garbage can, crying, drooling, spitting up, and laughing hysterically.  He kept saying that he couldnt stop thinking, I can only imagine what was going through his head.  My prediction was that he was feeling helpless in dealing with Caitlin, confused and angry, and it all lead up to him not knowing what to do or how to handle the feelings.  I tried to assure him that it was all just the drug and nothing was real, and that he must remember that.  I hope it did something to help, because after that I realized the ceiling was alive and became transfixed on that.  While Eric was bugging out, Drew began to get nervous as well.  He was worried that we were going to get caught by his parents and began to clean up.  He would walk around cleaning, unplugging, sorting anything he could find.  He continued repeating these actions, even on the same objects, until finally I asked if he wanted to hit the last bowl.\r\nSo we ventured back down to the weight room to see if the floor was still moving and hit the bowl.  It still was, but differently.  It didnt appear to be a river anymore, although the hallucination was still the same.  Instead, the triangles seemed to be moving in distinct patterns, the water pulling them in hexagons and other wild shapes.  Drew finally came down and we started talking again.  It was then we started to play with a tennis ball.  I was playing with it like I usually do, rolling it over the front and back of my hand without it leaving the skin.  The sight seemed to captivate him.  I then started to toss it up and down in my hand, catching it.  As I did this, a ball of energy seemed to form around it.  The energy ball was about the size of a soccer ball and as long as my hand and the tennis ball stayed in the energy field, I would always catch it.  As soon as the either left the field, it felt as if a magnet would pull the ball away and it would fall.  We only hit it once or twice, we must have forgotten about it.  He had already cleaned up the bong and it was a waste to take it out because he just had to pack it up again.  As he cleaned up I spilled the remainder of the bowl all over my pants.  He went back upstairs and I stayed a little longer to chill with the moving floor for the last time.\r\nWe went back upstairs to check on Eric, he was doing much better, watching TV in a chair.  Drew took the other chair and I lay down on the couch.  As I looked up I saw the moving ceiling that I had forgotten about.  The ceiling was done with a white sand paint, and the little particles of sand seemed to be alive.  In a way similar to the green carpet, the particles seemed to move and reproduce like bacteria over a long period of time.  I would look up and there would be almost none on the ceiling, but the ones there would wiggle around and separate, forming more and more.  This process would repeat itself every time I opened my eyes.  I drifted in and out of sleep as the two of them talked from about 3-6.  Every time I woke up, I felt normal, as if I werent tripping, but one look at the ceiling would change that notion, as it continued to move.  It seemed almost impossible to focus my eyes on the moving creatures, because I think the trip was ending.  Anyway Eric finally set up one of the air beds and fell asleep as Drew and I played a few more games of Halo.  We all went to bed and thus ended my first night of tripping.  Im pretty sure it wont be my last.\n\n\n"
}
