{
 "title": "Two Trips Down Different Lanes",
 "author": "eos",
 "citation": "   eos. \"Two Trips Down Different Lanes: experience with Mushrooms & Cannabis (ID 13372)\". Erowid.org. Feb 22, 2005. erowid.org/exp/13372",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13372",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 22, 2005",
   "Views: 4394",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A while back a friend of mine notified me that he and a friend were growing some magic mushrooms in his friend's apartment. I had never done them, nor any drug other than marijuana. He asked me if I would like to come up for a weekend and try them out. I obliged and made the trip up that saturday morning. When I got there, he told me that he had already tried them with a group of friends the night before, so he wanted to wait until the next day to try them again. He had read reports on the internet saying that the trip is not as intense if you consume mushrooms two times within a 48 hour period. The next day we decided to try the mushrooms as a group, we went to a friend's dorm room and invited a few people over.</p><p>At this point it was about 7 o'clock in the evening. When everyone had arrived, we packed a bowl of marijuana and passed it around a couple of times. We each took our doses of mushrooms and mixed it with orange juice in a blender. About 25 minutes after drinking the concoction I began to feel the first effects. At first I thought I was just really high, but no... Something was definately different. I felt more high than I had ever felt before. My body felt heavy and my hands felt sweaty but they werent. Interesting, I thought. After a few more minutes had passed I began to see very vivid color patterns in front of my eyes. Several different types, sequentially. I was surprised, I didnt think that a trip would be this overt. I looked at my friends arm and it looked like it was a mosaic, made up of hundreds of little blocks. I could make it go away, I could make it come back. It was amazing. </p><p>About a half hour later, after smoking some more pot, which didn't seem to effect me, the RA of the dorm knocked on the door, and my friend answered it. I was looking over at them talking in the doorway and how he said that someone had smelled smoke. I remember thinking for some reason that he was an armed guard. Suddenly I was scared that he might shoot my friend and how terrible it would be to lose him. He told the RA that we had incense burning (which we did) and thats where the smell was from. He told us to put it out. About a half an hour later two more people arrived and wanted to try some of the 'shrooms. There was no more orange juice so my friend and I decided to go to the store across the street to pick up some more. As we entered the store something wasnt quite right. Everything felt intense and as though it were building up to something. A minute or two later as we were walking past the register, bam! A gradual change to slow motion and then quickly back to normal time. I can remember watching people walking in front of me so slowly but my mind was still going full blast. It couldn't have taken more than a second in its entirety. That must have been where I peaked, from there on out the effects were just a mixture of moving shadows and weird noises. I went to bed with colors swirling inside my eyelids and woke up feeling a little high but wonderful otherwise.</p><p>I decided that it was a great experience overall and that I definately wanted to do it again.. soon. I bought 2 grams of mushrooms from my friend and brought them home with me. I waited until next sunday to trip again. I decided that I wanted to trip during the daytime so I consumed the 2g of mushrooms at around 1 o'clock in the afternoon after running some errands. I did not have any marijuana at the time, and consequently, I did not smoke any for the duration of the trip. I ate the mushrooms this time, I crushed them up and then swallowed them after holding them under my tongue for a couple of minutes. I watched the remainder of a very funny movie which I found to be particulary amusing. I shortly became very high, within a half an hour and had a particularly interesting heavy feeling. Everything felt damp. No matter what part of my body I touched it with. Everything looked as though it were far away. I felt a connectedness to the earth on a very emotional level. I sat down at my computer and started looking at some incredible digital paintings on the internet. I looked at them one by one and they all filled my field of vision and immersed me in a unique world. </p><p>Later, the wood grain pattern on my desk caught my eye. I looked at it for a moment or two and then it looked like  there was a very organic texture moving by underneath the wood. I could see it through the black stripes in the wood grain. I remember thinking to myself that it was the spirit of the wood trying to escape. I reminded myself that it was compressed particleboard and that the wood grain was not natural, it was a finish. I snapped out of it, and went outside for a short walk. Standing at the top of the stairs, it looked like they went on for miles. Outside there were conspicuous people everywhere. It seemed that almost everyone on the street was looking at me. I tried to ignore it, and walked to the corner store and bought a soda. I drank it on the way back because of the incredible cottonmouth I had. After that I just felt high for a few hours and became really immersed in a video game.</p><p>The interesting thing is, the trips were so different the two times I experienced them. The first was much more visual, while the second seemed more perceptual. It was the same exact mushrooms, from the same crop, and the same dosage. I'm not sure if it was the cannabis that gave me a much more visual experience the first time or if it is simply different every time you do it. I suppose the only way to find out is to do it again.</p>"
}
