{
 "title": "Cocaine As A 2C-T-7 Amplifier",
 "author": "Genuflect",
 "citation": "   Genuflect. \"Cocaine As A 2C-T-7 Amplifier: experience with MDMA, 2C-T-7 & Cocaine (ID 13374)\". Erowid.org. Nov 21, 2002. erowid.org/exp/13374",
 "substance": "MDMA, 2C-T-7 & Cocaine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:30",
   "20 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   "  T+ 7:00",
   "1 line",
   "oral",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 13374",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 21, 2002",
   "Views: 15778",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAs multiple experiments with 2C-T-7 and other substances have proven to me, it seems as though Cocaine dramatically increases the effects of 2C-T-7.</p><p>The first experience on this was one night, at a club, when one of my reliable sources introduced me to the world of 2C-T-7. Similar to LSD or 2CB (which I have had some experiance with; a dozen dosages of each), it felt yet quite unique. The dosage was about 30mg of 2C-T-7, and comparable to a mild- strong acid trip. Definitely a lot less paranoya however. The effects lasted about 5 hours, and build up/come down were similar in length and feel to 2CB or MDA. I was very excited about the experience, and couldn't wait to do it again.</p><p>Two weeks later, that same club, I had gotten there a lot earlier than last time (arrived at 10pm), dropped 2 tabs (MDMA) and enjoyed the first part of the evening. At around 2:30am I was finally able to get ahold of another dose of 2C-T-7. I was told by my dealer that it was only 20mg instead of the 30, because people thought it was too strong. In any instance, I ingested the caps quickly, and awaited my destiny.</p><p>At around 5am (just after we had left the club), I had grown to the suspicion that either I got bunk 2C-T-7, or had some kind of a delayed reaction due to some other chemical factors I was not aware of. Disapointed we finally arrived at my friends house at around 6:00am. Giving up all hope I decided to crash on the couch. Shortly after laying down, my friend passed me a little 10 sac of Cocaine, and told me to dip my pinky in it (so I would feel better about my disapointing evening). I had only tried Cocaine once before, but didn't really like the effects too much, however figured I could give it another try.</p><p>This is where everything started tourning around. About 10 minutes after ingesting it orally, I started noticing how much more colorful his computer room looked. Then about another 10 minutes after that I noticed a tremendous change in color if there was music or any sound. The louder the sound, the stronger and more vivid the colors. This was definitely a lot more extreme than my first experience with 2C-T-7. After about another 10 minutes my mild to strong trip had turned into a full blown acid trip. And yet still only mild signs of paranoya. My mind was incredibly active. 2 Hours after ingesting the Cocaine, I was absolutely engulfed in color and sound, and almost incoherrent to anything else that was going on.</p><p>My mind (so to speak) had a mind of it's own. Another significant difference to LSD (that I noticed) at a high dose, the fact that after 13 hours I still didn't get moody or aggravated with the trip, like I would have been on an LSD trip. I realize this may not apply to some of you, but I usually get tired of trips after about 10 hours (just like anything I continuously do for 10 hours: school, work, driving, sex... you get the point). </p><p>So the 2C-T-7 trip really felt incredibly amplified (even though I had taken a lower dose) through Cocaine. Scientifically, does it have a connection? I better hope so... or else I'm crazy.  I enjoyed it but wouldn't have done it as my first 2C-T-7 experience.  I could immagine it to be really easy to overdose on this substance combination, so be careful.</p>"
}
