{
 "title": "Group Therapy and a Crash",
 "author": "SPECIALEFFECT",
 "citation": "Citation:   SPECIALEFFECT. \"Group Therapy and a Crash: experience with Methamphetamine (ID 13422)\". Erowid.org. Apr 16, 2007. erowid.org/exp/13422",
 "substance": "Methamphetamine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 13422",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 16, 2007",
   "Views: 6451",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am someone who can be very much taken by drugs when i try them.  After trying about all there is to try, I realize that what I love most is Meth and Coke.  Obviously, then I am a speed freak.  There is nothing better than snorting lines knowing that a world of euphoria awaits you.  Sometimes I think that the action of snorting is one of the heavier parts of addiction in drugs that require it.  That, of course, is just my opinion.  The thing everyone says about these type of drugs is that it makes them feel good.  Well, the best part in my opinion is the way that it seems to make others good in your eyes. There are so many things i could babble on about (which also goes along with the drug) that everyone else has already said, but I am going to tell a negative experience I had.\r\nI had been  friends pretty much exclusively with three other people.  It had been just the for so long.  One thing we all liked to do together is get fucked up.  To make a longer story shorter we parted and didn't speak for a few months.  A summer passed, and we went back to school, and saw each other for the first time.  \r\nInterestingly enough, one of our friends had moved into an apartment over that summer that a couple meth dealers lived in.  Skipping pointless details, we end up wanting to patch things up with all of us, so we planned a trip to some nearby camp grounds to sit, snort meth, and speedily discuss our problems.  We couldnt have asked for a better or weirder day.  Although we were at a camp ground, they had these condos set up for visitors, and we all pitched in to get one.  We all sat on the same bed in a tiny circle and talked, talked, talked, talked and talked.  We left no stone unturned and the only time not spent talking was spent snorting more crystal, or drinking about a million giant size bottled waters we had brought.\r\nWe were all a little shocked when we realized the whole day had passed and we were running out of meth.  So we all cut out our last lines, and looked at thim with almost a disappointment.  Anyone whom, that day, might have been outside the door would have heard an endless montage of jaw-clenched-talking, and sniffing.  We reached our final high, and surprisingly enough, it was the best one yet.....we all babbled and fought over whose turn it was to speak.  It was so nice to be so honest with friends about hurtful issues that have hindered the relationship.\r\nTHEN DISASTER STRIKES\r\nAlthough no one was having a good time coming down, I took it particularly hard.  Everything that had happened that day was something I had waited for for a while.  As we were coming down there was one last issue I wanted to apologize for to one of my friends.  As I started to apologize, I burst out in tears and became hysterically upset.  I was pouring out anything and everything my racing mind could think of.  All the time this is going on i was coming down more and more and more.  the coming down, in combination with my physical hysterics (bawling out crying), caused me to become pretty much disassociated from what was going on.\r\nOut of no where I looked at my friend, whom I was apologizing to, and for the life of me could not remember what I was apaologizing for, or what it was that I was upset about.  The friend I apologized to, as well as my two other friends, sat and comforted me for a good forty five minutes.  The friend I was apologizing to then drifted off to sleep.  After he was sound asleep I sat up with my other two friends completely confused about what was going on, I was, in my mind, somewhat understanding everything, but when I'd try to speak a jumble of nonsense came out of my mouth.\r\nI regret everything about the end of that night.  Although the other three found closure with a lot of issues, I had caused a wreck with my over emotional coming down.  I went from settling an issue to being so incoherant that to this day my apology is still not sincerely accepted, although I cant sit here and say there is any type of grudge against me. That is the worst part of meth, coke, or any other 'upper', just as soon as youre thinking everything is on the up and up, it all comes crashing down.\n\n\n"
}