{
 "title": "The Performance",
 "author": "Derek Qai",
 "citation": "   Derek Qai. \"The Performance: experience with Caffeine (ID 1343)\". Erowid.org. Feb 12, 2001. erowid.org/exp/1343",
 "substance": "Caffeine",
 "bodyweight": "79 kg",
 "header": [
  [
   "DOSE:",
   "3000 mg",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1343",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 12, 2001",
   "Views: 15780",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started my day rather normally, i woke, shaved, showered, and grabbed a cup of Starbucks on the way to school.  Nothing much, just a small latte.  It kept me going for the morning and by the afternoon i was tired because it worked its way through my system.</p><p>I was on the technical staff of the school's theater department and we had a show that evening around 7:00.  I was tired and offered to make the dinner/drink run for the group.  I stopped at some fast food restaurants and the local supermarket.  There i made the 2nd best decision of the day (the first was getting a date for the weekend):  I bought 3 6-packs of Jolt and 3 Red Bulls.</p><p>Because of the small size of a Red Bull, i drank all three before the drive to the school was finished (less than 5 miles).  I was thinking, 'Hey, this is great, i'm awake, I'll be back early, and life will be good.'  Unfortunately, I was going 85 in a 35 and ended up with a hefty ticket.  (I told the officer that i'd give him a free seat at the show if he let me off with just the ticket.  Good thing that he liked high school theater.)</p><p>I made my way back to the school, carefully going the speed limit and avoiding the Jolt in the back of the car.  Upon arriving, i cracked a Jolt and then another Jolt and then another and a fourth.  The first 6-Pack was down.  I don't remember much of the next 10 minutes, only that the set was fixed from a massive injury to it the previous night, it was rebuilt and back up.  The rest of the crew was also looking at me strangely and asking if i needed any 'help.'  I said no and went on my hyper-whacked way.</p><p>I started feeling tired a few minutes later and it was back to the car. In 5 minutes i downed 7 jolts and was back in the theater.  Curtain was 10 minutes away and i had just finished 12 cans of Jolt and 3 Red Bulls in about 45 minutes.  I was pumped.  Everyone around me was going, 'Calm down, it's just a show.  Calm down.'  Needless to say, the set changes that normally take 1-3 minutes, i did almost single-handedly in about 30-45 seconds.</p><p>I was dropping around intermission and finished off the last 6-Pack.  The show finished early and my crew chief was worried about letting me drive him home.  He asked for my keys and i just walked back to my car in a hyper-stupor and left him there.</p><p>I arrived home earlier than normal (i didn't know an 85 Accord could go THAT fast) and by the time i arrived home i was seeing spots. I couldn't get to sleep for nearly 19 hours and after that I passed out almost immediately.  i don't remember any of the next 36 hours, but i do know that when i awoke there was a small amount of blood on my pillow and it was a day and a half later.  I don't know if i actually woke during that period or not.</p><p>To make a long story short, we had a great show, and that's about all i can remember. The caffeine helped immensely, and i'll be sure to have more the next time i work on a show.</p>"
}
