{
 "title": "Lucky To Be Alive",
 "author": "The Eagle",
 "citation": "   The Eagle. \"Lucky To Be Alive: experience with Alprazolam (Xanax), Alcohol, & LSD (ID 13435)\". Erowid.org. Feb 10, 2003. erowid.org/exp/13435",
 "substance": "Alprazolam (Xanax), Alcohol, & LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(gel tab)",
   " ",
   "3.0 mg",
   "insufflated",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "9 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 13435",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2003",
   "Views: 42993",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA seemingly inexhaustible supply of green geltabs was available to me in the spring/summer of 1999. Me and my friend whom we'll call 'Jesse' each dropped two hits of acid on an incredibly humid summer night.<br>A lot of people who have done acid (in any form) and like to drink beer know that you can drink countless beers when you're tripping. Alcohol in general seems to have no effect on me if I'm tripping (although it does taste very good)! That's where I got too cocky and made a HUGE mistake that I am still learning lessons from to this day.  Also, many people who have mixed alcohol with a tranquilizing drug (in my case, Xanax) know the extremely pleasurable feelings it can bring as long as it's not overdone. My brother had given me a bottle of Xanax because he had stopped taking it. The bottle contained twelve .5mg pills, six each for me and Jesse. We crushed them up and started snorting really huge lines when the acid began to peak.  When the Xanax kicked in, I couldn't fully explain the sensations I was feeling. My tongue was numb, my eyes were watering, and i had almost a 'tunnel' vision. It was weird. On top of that, I was tripping my balls off. <br>Me and Jesse start wandering around the streets down by the tracks for awhile when we decide to head up to Twelfth Street, where my friends were throwing a kegger. So we go to this party, tripping our balls off and feeling completely twisted from the pills, laughing like crazed lunatics. We got to the party and made our way to the keg in the back. We both start drinking like a couple of fishes. That's when the trouble started.<br>By about my sixth beer, i began to feel even stranger than before. The numb feeling in my tongue had taken over my entire body, and soon I dropped to my knees, unable to stand. But I was still tripping so I was still laughing and having a good time. I figured that the acid I took would keep me awake, which it did, but I soon lost touch with reality when I started on my ninth beer. <br>I don't remember anything after that. The next thing I knew I was lying in the alley with rain pouring on me. It was dawn when I woke up. I had to have been out of it for at least six hours. I thought that I had just passed out, but when I went back upstairs, there was a savage scene: broken beer bottles everywhere, smashed keg cups, ashtrays dumped on the floor, and my best friend Jesse passed out on the kitchen floor with a bloody nose, covered with broken glass. I already knew the story before it was told to me: apparently when I blacked out, I had gone ballistic and started destroying the place. Jesse had tried to stop me and supposedly I cracked him in the face with a beer bottle, knocking him out cold. About twenty minutes after that happened, I had left the party (but of course I didn't go far, because I woke up in the back alley).<br>Know this: I am not a fighter. I have never been the violent type. If you look at me, I'm tall, skinny, and certainly not tough- looking. The whacked-out combination of drugs I took had sent me into a vortex I'd never visited before and NEVER want to visit again. Since then I'd never taken any more acid or downers. <br>The moral of the story is: Even if I am on a drug that keeps me wide-awake (such as acid in my case, or meth), mixing alcohol with downers can be lethal. I consider myself lucky. When I finally did go to sleep, I could've never woken up. I had taken an amount of chemicals in overdose proportions.  Sadly, it took this kind of experience for me to be more responsible with drugs and alcohol.\n\n\n"
}
