{
 "title": "A Binge User",
 "author": "Sunshine",
 "citation": "   Sunshine. \"A Binge User: experience with Methamphetamine (ID 13495)\". Erowid.org. May 4, 2007. erowid.org/exp/13495",
 "substance": "Methamphetamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "97",
   "ID: 13495",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "May 4, 2007",
   "Views: 10677",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There are 3 parts to my experience with dope....</p><p>Part 1</p><p>My first experience with crank was when I was 16.  My cousin Tina was moving here to get away from her speed freak life. The morning she arrived I had class. When I was finally done we both sat alone on my friends couch. When my friend left the room. She looked at me with wired eyes, and mouthed Ive got crank, please do the rest of it with me and that will be it. So I did the rest with her, but that was far from it.</p><p>I started sending her home several times a month to get us small bags of the shit. And yes that is what that drug is, shit! This went on for about 3 months before she finally said, enough is enough. She saw how much I was beginning to like it. I knew she didnt want me to turn into her. Tina was a tiny anorex looking girl. When she stopped using the drug she beefed up again and just looked normal. So we were both sure that was the end of it.</p><p>Part 2</p><p>A year later, when I was 17, after I had already dropped out of high school. I said it was lack of interest, really it was lack of friends, I started using dope again. My long time best female friend Shelly called me. She wanted me to try it with her. So I did. But trying is not what we did. We bough a $20, and did it all in one night. We spent most of that night and morning picking dog hair out of my carpet, and talking about how much we liked the feeling of the drip in the back of our throats. </p><p>So once again I was hooked. I started spending every little bit of money I could to get it. I had been trying to study to get my GED, I put that on hold to pursue my new first love. Crank. I spent 2 months away from my house, spending most of the nights at my friend Shellies house, and the other nights at my dealers house. Even though our dealers house was a motel room, he seemed to always make room for me in his king size bed. Thats all I will say about that. I lost weight, lost hair, and began to notice the bags under my eyes, and the red marks on my face. I would spend hours sitting in my car with my rear view mirror faced towards me, picking and picking. I am not sure what I was picking at. I had perfect skin.</p><p>Finally after a half of a year wasted away. I decided enough was enough. I was still just snorting it, but when I started meeting people who where slamming (shooting) it I had to get away. I packed up my things and said by-by to my speed freak buddies. By this time Shelly and Shellies older brother Eric were completely addicted. </p><p>Part 3</p><p>My cousin moved back in. She had been clean for 2 years, when we decided that just one night of tweaking couldnt hurt either of us. I called Shelly who I had heard was still into it.  We had our $35 bag within an hour. Shelly had began smoking it. We had always said that only the true crankies slammed, and smoked it.  But that the people looking for a fun high snorted it. Tina and I snorted while Shelly dumped pile after pile onto foil and smoked it. Finally I had to try it. The high was the same, though it helped me to not over amp myself.</p><p>I began smoking it. Though I didnt do it the way I had before. I would go weeks with out doing it. Then I would decide it was time for a few days of staying awake. The funny thing is I didnt realize this was its own form of an addiction. I went in to take my GED tests on no sleep, 3 lines, and 2 strips.  I decided I wouldnt do it for awhile. And I didnt. Until the checks started rolling in. My family wanted to congratulate me on a job well done with the GED. After just a month and a half I had spent all of the $500 I had received in congrats cards.  So I decided I was doing it a bit too much and I would lay low, almost quit you could say. (though I never realized till now that I decided to quit when my money ran out)</p><p>So a month passed, I hadnt done any. Then my 18th birthday came, and I decided to celebrate with a bag. I got my trust fund too.  $8000 my parents gave me. Of course they had no clue of my addiction. I decided to celebrate with a ball. (3.5) the largest amount I have ever bought. By this time I never snorted it, I only smoked it. I had bought a pipe too. Though I told myself that I wouldnt spend any more of the money on it. That was a joke. $20.......$30........$30.....and then another $80 ball. </p><p>On the night it ran out I laid in my bed in the dark picking at my face and legs, when I woke up. I had to huge bumps on my face where I had picked my skin so raw it was swollen. There was blood under my finger tips, and my legs had huge bloody marks where I had picked away skin.  I knew I had a problem and I  was setting myself up to waste all the money on dope. Then I was lucky. When I started reading the description for a binge user, I knew that was me. I didnt do it every day, I did it once or twice a month, but when I did I would use for days at a time. So once again I quit.</p><p>Though last night, after my cousin left to move back home. I found myself driving in the direction of Shellies house.  I had even grabbed my bag of dope items.  AKA...razor, pink cut straw, smashing card, and pipe, and of course miniature torch and butane. I had a million excuses last night about why it would be okay for me to do it. When I got to Shellies house.  I took a long hard look at her. Her tiny little body, sunk in eyes, and her spotless room.  I didnt even say by, I dropped my bag and ran out of her house. By the time I was at my car, I was crying, and shaking. I cant tell you for sure I wont ever do it again. But I can tell you this, dont fool yourself into thinking you arent addicted because you dont do it every day. This drugs addiction comes in lots of different shapes and sizes.  I wake up every morning hoping I wont fall into temptation!</p>"
}
