{
 "title": "Waking From Reality Into a Dream",
 "author": "PyroKryo",
 "citation": "Citation:   PyroKryo. \"Waking From Reality Into a Dream: experience with AMT (ID 13504)\". Erowid.org. May 15, 2002. erowid.org/exp/13504",
 "substance": "AMT",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "AMT",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13504",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 15, 2002",
   "Views: 9072",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nHaving previously attended raves, normally without the use of drugs, I was unaware what I was in store for after buying an approximately 30mg capsule of AMT (sold to me under the name 'Matrix').  I will list for you a recount of my experiences on AMT in chronological order as I attended 2 of the greatest raves of my life, Ultra 4 and Sasha/Digweed.\r\n0 hr:  Paul Van Dyke is starting a set on the main stage as my friend and I (we'll call him K*dd) purchase 4 AMT capsules (only one of which we will use each that night)  We took these pills orally and began to do what any courteous candy kid would do, give light shows to those who were already feeling it.\r\n15 min:  We give our arms a break and sit to watch Van Dyke spin, my friend is fine, I begin to experience mild nausea.\r\n30 min:  My friend, having significantly more experience with hallucinogens, is still unaffected, whereas I am beginning to be overwhelmed by a strong sense of paranoia and fear.  Trees start to bend and other party-goers seem to be moving unnaturally.  I lay back and try to cope, hoping this phase would pass.\r\n45 min:  We leave the first rave and continue to the after party.  I am overcome by an overwelming sense of sourceless fear and I begin to vomit and shake.  My friend is beginning to experience a feeling of euphoria.  One comment I make stands out in my mind, 'Am I going to die? Is someone going to hurt me?'\r\n1 hr:  We are traveling the streets of South Beach on the way to the after party and I am beginning to come to terms with the drug and its hallucinations.  My friend is beginning to experince mild fear and strong nausea as he vomits by the side of the road.  After this point there seems to be no other negative effects of the drug.\r\n1 hr 30 min:  Stronger hallucinations set in and all traces of nausea and fear are gone.  While traveling, I ask for directions to the club from a passerby.  Receiving no response,  I ask another person who doesn't respond to me either.  This goes on for another few minutes until I end up yelling 'CAN ANYONE HEAR ME?!?!' which yeilds no response either, from ANYONE.  My friend tries asking and we receive directions to the party.\r\n1 hr 50 min:  We locate the club and approach it.  When we arrive at the place the club should be, we find it has moved 2 blocks away from us.  As we approach the club a second time, it has dissapeared and reappeared behind us at twice the original size and reversed.  We enter the club.\r\n2 hr 30 min:  Having danced for about 30 minutes, we realize that the rolling/tripping seems to be hitting us in waves, light trails become significantly longer, and we are both experiencing medium to strong hallucinations and a sense of empathy, love and fellowship among the other ravers.\r\n2 hr 45 min:  We exit the actual rave and enter the concession area.  As we enter, the entire area seems to be filled with dense clouds.  We feel as if we have entered a dream which seems more realistic than any other we have ever experienced.  We feel a slight tightening of the joints (which could be attributed to the 15 hours of dancing we have already committed ourselves to).  Over the course of this experience, we find we have been sweating perfusely (although we are not physically hot).  We drink water regularly for the remainder of the night.\r\n3 hr - 6 hr:  The trippy/rolling experience continues to hit us in waves usually hourly and overlapping.  We feel more capable of feeling the music and flowing with it as we dance to the dark trance sounds of Digweed and Sasha.  The experience has been overly enjoyable and hallucinations and ecstasy-like effects of love and friendship continue more strongly through the night.  Visuals coming from the DJ booth are beautiful and soothing.  During this time, I close my eyes and instantaniously I encounter a type of visual story being played out and narrated by the music.  Sweet tastes such as Sprite and hard candy taste incredible.  Tactile contact with others feels incredible and sex is unbelievable.  \r\n6 hr:  We have to leave to catch a bus home.  The before described effects of the AMT are still as strong as ever.  On the way to the station, we stop by a gas station to pick up drinks.  While we walk, we notice the time is passing by extremely slowly.  We encounter the same realistic hallucinations as we did while trying to approach the after party originally (building moving around)\r\n7 hr - 14 hr:  We catch our bus and the effects seem to dissapate in much the same way as they came, in waves.  It is a very easy, peaceful and enjoyable comedown.  The bus ride seems to move very quickly.\r\nThis was one of the most incredible experiences of my life and AMT seems to have both aspects of ecstasy and hallucinogens.  Highly recommended.\n\n\n"
}