{
 "title": "Sigma",
 "author": "Shamen",
 "citation": "   Shamen. \"Sigma: experience with Morning Glory & DXM (ID 13508)\". Erowid.org. Aug 12, 2002. erowid.org/exp/13508",
 "substance": "Morning Glory & DXM",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "8.0 g",
   "oral",
   "Morning Glory",
   " ",
   "708 mg",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13508",
   "Male",
   " ",
   "Not Given",
   "Aug 12, 2002",
   "Views: 19499",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOk, My name is Shamen.  I had been planning my last DXM trip for weeks.  I'v had the life threating EXP on a hard 4th, I've done Sigma twice.  Sigma is a great place to learn about ones self.  I learned alot that I will never forget.  So I decided I want a LSD DXM exp I wanted to max it out.  I let my system flush for 1 month clean.  It's March 12th 2002, time is 6AM I just woke up. we grind up 21grams of Morning Glory Seeds 'MG' and my friend went out and got 2 CVS tussin Max streng 'Dextromethorphan' bottles. We put the MG in gelcaps.  Each gelcap had 2grams in it, I washed the gelcaps down with the tussin and finished the bottle after that, everytime I drink tussin I wash my mouth out with Backwash which helps alittle on the taste.  At this time it was 8:15AM we had just done the caps and the tussin both of us, so Saint and I walked to my house.  We went downstairs to my room I looked at the clock it was already 9AM and I was kinda feeling weird.  So before getting set I put huge blankets over the windows to keep the lite out, I put on Black lites and put all my posters backwerds on the blackwalls 'back of the posters r white.  So everything else in the room was black and barly able to see the posters stook out.</p><p>So we went outside for cigarette before going downstairs to trip I looked at the clock it was 9:45AM.  Came back in and noticed it was 10AM and I was still just feeling weird so I relaxed and waited.  11AM came and it finally kicked in 'While feeling weird and waiting for it to kick hard I find that medating is a good method to blow time if you know how to do it right' I then opened my eyes to the blue/purple room.  I then put Aphex Twin on and closed my eyes and kept medating as I was in a 3rd plateau the LSA hadn't done anything differnt.  I was feeling the taste in the back of my mouth and I was very dissociated 'I perfer to medate in this state I find you learn the most about yourself as the time lags.  I thought to look at the clock it was 11:25AM, so I then just kept medating.  I have never blacked out while medating I have opened my eyes then blacked out but never while medating.  I closed my eyes and went to my peaceful world and then just noticed I was laying on the floor and could'it relize if I was dead alive or just floating in tussin space but it was 5PM at night and they're were mild visuals everywhere, along with strong eye candy I thought had missed my whole trip.</p><p>As much as this suchs I got up with no problem then blinked and rewoke from my medation.  I had never felt something that real and wack, I looked at the time it was 12:30PM.  I didn't believe it so I went outside to and it was bright out, Amazed in shock I felt very differnt as I had never tripped on this much LSA before.  I went back downstairs perfectly calm.  As Saint had passed out but was still talking about life on earth as angels.  He's eyes were blinking fast but he's eyes were stairing str8 at me. I then blinked again and noticed I was still medating but I looked at the clock and it was 3:30PM.  The DXM was starting to fade and the LSA was starting to peek I felt very confused and very scared, not sure what was going on.  I went outside to smoke but didn't have my smokes but I was outside smoking as I remember it.  There was snow everywhere and I was looking at it as it was kind of gushy, I looked at the sun and somehow just knew that the time was 5PM.  I went downstairs and passed out on the couch.</p><p>I woke up 2 days later with a message on my answering mechine saying I was fired, and my landlord saying I wanted he's money.  I saw saint still lieing there, I then blinked and noticed I hadn't fallin sleep and I was very scared because I was laying in the middle of the floor again.  I looked at the clock and it was 10PM and I felt dissocative state and not like I was on LSA but I knew it was there as if it was apart of me.  I then just blinked and woke up the next morning and new what the world was in a differnt sence of my life.  It is now March 25th I still feel very differnt and still see tracers.  I have learned that even when life gets very confusing I should never give up and try run.  I should try to understand it even when it makes no sence and when it runs from me I should follow because it's a guide and the guide always knows whats best.</p>"
}
