{
 "title": "A Productive State of Mind",
 "author": "007",
 "citation": "Citation:   007. \"A Productive State of Mind: experience with Coca (ID 13568)\". Erowid.org. Oct 7, 2002. erowid.org/exp/13568",
 "substance": "Coca",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   " ",
   "Coca",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13568",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2002",
   "Views: 19525",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFeeling rather tired after awakening after only 4 hours sleep, knowing that I had to clean my old flat before giving the keys back to the landlord. I decided to chew some colombian coca leaves to help relieve my fatigue. The brand of tea that I was using was called 'Te De Hayo' and the writing on the box was in spanish. I tore open one of the tea-bags and mixed around 50mg of lime with it and put it in my mouth. The taste was not too pleasant at all. My mouth salivated immediately after I tasted the lime and it went a little numb. I chewed for a couple of minutes and when the numbness from the lime went, I could taste why Coca Cola added Coca extract to their drink. About five minutes after I first started chewing, my tounge went noticabley numb, this now only due to the freebase alkaloid being released from the leaves. Around 10 mins later, I noticed a subtle warmth in my chest and a feeling of stimulation in my body. Having left my rubber gloves back at my other house, I would normally have felt reluctant to be cleaning the toilet and bathroom walls with my bare hands, mainly because I hate the feeling of my hands going crinkley like dried prunes. But I didn't mind at all! I felt calm, yet very industrious and motivated and was in a very productive state of mind. Now I know why the Andean people could work through such poor conditions and face extreme cold. The main effects lasted for about 1 hour and even 7 hours later, my fatigue is less than it would have been without the Coca.\r\nQuite often, for a couple of days after drinking Coca tea, I usually crave pleasure and think different thoughts and want to do more pleasure orientated activities. The feeling is subtle and passes after a couple of days.\r\nI wouldn't take Coca for recreational purposes, only for its medicinal qualities. Oh yeah, Coca is great for head colds!\n\n\n"
}