{
 "title": "My Four Months On It...",
 "author": "angelsigh",
 "citation": "   angelsigh. \"My Four Months On It...: experience with Tramadol (Ultram) (ID 13574)\". Erowid.org. Jul 24, 2003. erowid.org/exp/13574",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "13574",
   "Female",
   " ",
   "Not Given",
   "Jul 24, 2003",
   "59374",
   " "
  ]
 ],
 "report": "<p>Last december I had the luck of gaining access to a fairly consistent supply of tramadol (ultram), and thus began my love affair with the substance.  I've always been a fan of drugs in the opiate vein, but tend to have trouble aquiring them in any manner other than a sporatic one.  So, when I stumbled across this find I was overjoyed.</p><p>The first time I dosed I took about 200 mgs, which was enough to sedate me quite adequately for much of the day.  I guess not many people know about this drug as of yet, and it doesnt seem to be taken as seriously as other pain killers (vicoden, percocet, etc...) But dont let that fool you.  The effects are quite similar: a strong sense of well being, sleepiness, lack of inhibition (particulary sexually), etc...  Just be careful with dosage.  I take it on a full stomach.  Otherwise, i'll most likely vomit, and it tastes like shit comming back up.  </p><p>I began to consume ultram on a weekly basis, sometimes every day, all the while rapidly raising my tolerence.  I got to the level of taking about 400 mgs at a time (which I dont recommend anyone do!) At the same time trying to keep my using on the DL.  Occasionally, I would vomit from taking too much, or just get insanely tired and nod off at odd/inconvient times.  My boyfriend (who wasnt informed of my problem) was growing quite concerned/confused at my increasingly narcoleptic state, but at the same time I quite enjoyed the euphoric rush that the pills gave me and was relatively unfazed...  Guess narcotics will do that to me.</p><p>Things got kind of screwed up when I began forgeting large chunks of my days (and nites).  This became particularly startling when I started to OD one nite and had no recollection of it the next day.  Apparently, my boyfriend was sleeping and informed me the morning after that he had witnessed me having a seizure.  He said that I was spitting up saliva and my eyes completely rolled back in my head while I shook intensely, all in all lasting for about 20-30 seconds.  He said that when I came to I had no idea who he was for a few minutes and was discombobulated to the extreme.  </p><p>Since that, I havent taken any more pills, although I have quite a hefty stash left and am frequently tempted.  Just because a drug is relatively unknown or not considered 'hard', dont let that lure you.  I know my situation could have been far worse, and I mean no disrespect to those who have suffered from addictions of much greater severity.  I simply wanted to share my story with others and hopefully prevent someone else from getting carried away in the same manner I did.</p><p>Have fun, experiment, just be careful.  Please.  </p><p>I wish everyone out there the best.</p>"
}
