{
 "title": "A Pleasant Sleepaid....In Small Amounts!",
 "author": "drug explorer",
 "citation": "   drug explorer. \"A Pleasant Sleepaid....In Small Amounts!: experience with Buprenorphine (Temgesic) (ID 13581)\". Erowid.org. Nov 26, 2002. erowid.org/exp/13581",
 "substance": "Buprenorphine (Temgesic)",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "Pharms - Buprenorphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 13581",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 26, 2002",
   "Views: 57739",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI could not find any reports on erowid about this substance so I wanted to share my experiences. English is not my first language so I'm sorry for any bad spelling in this report.\r\nSome background info about this drug and how I got it:\r\nBuprenorphine is a synthetic opiate, developed for pain relief.\r\nSome info I found online suggests it's only avalable in the US as injection fluid for hospital use, but I am not sure about it. I got it in Europe (Denmark  -I live there), where it's available under the name 'Temgesic' as tiny white 0,2 mg tablets for sublingual use (inactive if swallowed). It's a prescription drug against strong pain, and a family member of mine was prescribed a 50-tablet package, but he actually never used any of it, left it in a closet and forgot all about it! I decided to try it out and got the package...\r\nIt was late one night and I had sleeping troubles as usually. I decided to try the buprenorphine, it could help, perhaps even be interesting.. I read the package insert carefully, it said the effects would come on in about 15 min and that you could use 1-2 tablets up to 4 times pr day as a max. I started out with one, and put it under the tongue. It took a lot of time and quite a bit of bitter taste to dissolve it. I sat down in front of my computer and did some surfing on the net.\r\n+1 hour: I didn't feel any effects, was disappointed and decided I could do another tab. Waited a bit more... There was perhaps a slight change now, I slight buzz in my head but nothing special and then I did something foolish: I slowly started taking some more tabs. I thought it would be ok based on the info I had read, but it turned out to be way too much for me...\r\n+2 hours: finishing tablet nr 5, I suddenly felt that something strong was happening to me. 'Uh oh, maybe I should not have done 5' was my very first thought. There was tingling in arms and legs and I suddenly felt very dizzy and light-headed. My breathing seamed slightly depressed but my heart was pounding. It became impossible to concentrate on my internet-surfing and I turned off the pc. I tried to get up but I was too dizzy to stand up for more than a short time. Nausea was near and threatening and the situation was basically not that pleasant.\r\nBut at the same time I started to feel a rush of some sort. It seemed to come in waves in which I felt very light and tingling and intoxicated and almost a bit euphoric. I had a 'wow' feeling and almost wanted to laugh. But then the nausea and intense dizziness would hit me again full strength and I decided to lie down on the bed. The drug was quickly making me extremely tired and I felt that I was being sucked towards a big black hole of deep sleep. The very intoxicated feeling of a 'high' still hit me in frequent waves and that was the real interesting and pleasant part. I felt like I was floating. The bed seemed to disappear under me and I could hardly feel my body, there was only a strange and dizzy, but very pleasant sensation of floating. And I got some frequent sensations of happiness and feeling very good. It was strange and rather strong. Eventually I fell asleep, it was unavoidable.\r\n+8 hours: I actually didn't sleep for that long but woke up feeling extremely ill. I stumbled to the bathroom feeling more dizzy than ever (could barely walk), and vomited over and over again. There was no doubt: my body was rebelling after those 5 tabs. I noticed in the mirror that my pupils very unusually small. I spent the whole day in great illness and thought about seeking medical attention but my condition slowly improved as the hours went by so I never did. I felt ok in the evening, but my appetite was completely gone. I was ok the next day but my appetite did not return until even one more day had passed. I was a bit shocked. I had only taken 5 of those tabs, a total of only 1 mg! Buprenorphine seems to be extremely potent, and I also suspect I have a very low tolerance for it since all this happened. \r\nI got interested about this substance and read about it and it's said to be very safe compared to other opiates, and with a low addiction potential.\r\nI have since taken the rest of the 50 tablets... But only one at a time! And that has been nothing but pleasant every time! I found it to be kicking in slowly but surely in about 1-2 hours time. After that I got slightly dizzy and felt light, fuzzy and relaxed. And in a better mood. \r\nBuprenorphine mostly gives a pleasant body sensation, but there is surely a psychological effect too. After about 3-4 hours it made me very tired in a very pleasant way and I was able to sleep as soon as lied down. So I used it much as a sleeping aid and found it to be perfect for it whenever I really wanted a good long sleep (sleep was longer and deeper than usual). \r\nThere wasn't really any hangover effect next day if I allowed myself enough sleep time. And the best thing was that there seemed to be no real physical addiction developing, at least not very fast. There was surely a psychological feeling of wanting more, but I had no physical withdrawal at all even after using it more than 10 days in a row during a holiday. But the effects did seem to loose their strenght a litlle bit if I took a tablet every night for more than 3-4 days in a row.\r\nNow I'm all out of this drug, but I often miss it! I have also used Ambien (zolpidem) as a sleep aid and like it very much as a recreational drug (gives me strong visual distortions among other things, I might write a report on that...) But actually I sleep much better on buprenorphine, and I have found Ambien to cause withdrawal symptoms when I want to take a break from it.\r\nI suspect buprenorphine works very strong on me, stronger than it's said to on the package! Other people may need more than me to get the same effects, I have no idea. But I recommend starting very low on dose and wait it out. For me it comes on slowly but then gets surprisingly strong.\r\nPS: Driving on a dizzy buprenorphine high is probably a bad idea, even though motor skills are not impaired the way alcohol does\r\nTake care.\n\n\n"
}
