{
 "title": "Jewel",
 "author": "Hokulea",
 "citation": "   Hokulea. \"Jewel: experience with Mushrooms (Copelandia Cyanescens) & MDMA (ID 13584)\". Erowid.org. Apr 9, 2002. erowid.org/exp/13584",
 "substance": "Mushrooms (Copelandia Cyanescens) & MDMA",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "MDMA",
   "(capsule)",
   "  T+ 0:45",
   "2.0 g",
   "oral",
   "Mushrooms - C. cyanescens",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "1995",
   "13584",
   "Male",
   " ",
   "Not Given",
   "Apr 9, 2002",
   "15007",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIts been thirty years now since my first encounter with psychedelics and since the beginning I have found them to be true allies; worthy of great respect and care.  Ive been blessed with many wonderful and enlightening days and nights, enriching my whole life in many ways (and plenty of good clean fun, lest I sound too serious).  Its meaningless to try and say which was the best,  how much better than perfect can you get?</p><p>If asked, though, which was the most singular and affecting I can say.  Its quality has remained since, both in my ordinary life as well as occasional subsequent journeys.  I hesitate to even attempt a report on this evening, for I cant possibly do it justice, yet I am moved to try anyway.  </p><p>Setting: </p><p>1995, my home in Kona on the island of Hawaii.</p><p>Set: </p><p>I am spending a week alone until my sweetheart (J in my report the gods make love) arrives from the mainland.  Its a good season, I am well and happy and feel the time is ripe for a session; sometimes there seems a call from within and Ive never regretted answering.  There are no particular questions or issues on my mind to confront, I just know its right.</p><p>Materials: </p><p>I have a bit of pure crystalline MDMA obtained through a trusted friend from the experienced chemist who synthesized it;  the mushrooms are Copelandia Cyanescens (psilocybin/psilocin), personally gathered from a pasture near here and carefully dried.  Some very good buds of cannabis round out the menu.</p><p>The plan is simple, start with the MDMA, then the shrooms.  Once Ive decided on a session I can feel myself getting ready for a day or two, Im not really very disciplined, but I dont take these things cavalierly.</p><p>On the appointed day I tidy up the house a bit, set out a candle or two, select some music, shower and dress comfortably.  Ive also prepared a pipe with some primo ganga, a puff or two at the right time really works wonders without dulling the experience.  As sunset approaches a calm anticipation within confirms the choice, tonight at twilight.</p><p>T=0</p><p>100mg. MDMA in a small clear gel cap, with 6 oz. of water.  I just sit quietly in the fading light, feeling no apprehension; I trust my old allies, all is well.</p><p>T+0:45</p><p>2 grams of ground up dried Copelandia Cyanescens in gel caps, a fairly strong dose for these potent fungi.  Another glass of water.</p><p>T+1:00</p><p>As reliable as clockwork the MDMA state arrives, as if Ive crossed in an instant through a unseen door.  The suddenness of the transition and its gentle yet profound character is unlike any other material I know of.  Soon the mushrooms become evident as mind and heart join in expanding delight.  Unlike taking them alone (which I have done more often, both before and since) the rising is seamless and devoid of any strange bodily feelings or yawning.  Ive noticed that this calm spirit is more evident when I come on to the shrooms alone since, with no feeling of apprehension, just a little bodily transition.</p><p>T+1:30</p><p>Time for a toke on the pipe, one is plenty for now.  As always, the ganga potentiates the psychedelic beautifully.  I decide against any music for now and go up the hill behind the house to our small retreat shack.  </p><p>The evening is exquisite, clear and just a little cool, with myriad stars sparkling above.  God, I love this place, this hillside, this sweet Hawaii.  Waves of gratitude sweep through my whole body, washing away any residue of dissatisfaction or reluctance; all around me is blessing. The night air breathes itself into me, through me and beyond, my chest feels almost transparent in some physical way that expands slowly to fill (or empty) my entire being.  I have to sit down, lotus style, as everything lets itself go; the thought occurs (is it mine?), this is slipping into a ++++.  I look up at the stars, am the stars on shimmering velvet sky.  Immanent perfection is all around me, flooding me, there is nothing to hold on to as all is laid bare.  </p><p>now lying down on futon all sky all breath all life even the idea of separation dissolves layer by layer weavings of personal selves fall away like layers of onion one by one no center no thoughts no intention no game left at all stars piercing naked heart no self everywhere aware unbounded overflowing emptiness</p><p>silent ocean fleeting thought droplet in still water ripples out astonishment wonder beauty no thought knowing all still water still </p><p>all whole all broken joy sorrow root bliss heart beating breath joining wind earth sky all hearts aching ever still water tender ripples passing </p><p>ever passing</p><p>The night breeze sliding down from the mountain, the rustling leaves of grass and trees, the smell of earth and its life, the wide eyed figure lying on the futon are all one, self is nowhere and everywhere centerless center. </p><p>T+5:00</p><p>Slowly, very quietly and gently the circles of identity begin to gather themselves up one by one, in no rush, trusting somehow all is working perfectly.</p><p>Am i still here? What does it mean, here, i?  Am i this overflowing heart, is all heart my heart all heart?  How is there all this when i disappear, how is everything left, so clear and aware.  All thinking and feeling, striving and personality take place at the surface of this great ocean of awareness; their mechanisms run themselves, i dont have to make it all work, to hold myself into being.  Do i stop breathing if i forget to think about it?  </p><p>This naked heart feels so deeply, is pierced so readily, no wonder we weave such shields around it; yet if we let the cut all the way through we are still here, alive and made whole even in breaking.  This is our great treasure, the deepest well, bottomless, inexhaustible;  we are not just ourselves.</p><p>I get up and drink some more water, guess Im really still here.  Another puff of ganga and I pull my legs in to sit up straight.  My body has never been more relaxed, completely motionless until I slowly feel into it and remember how to move.   The threads of my personal being are at ease and and in no hurry to be somebody even as they regain their functioning.  The oceanic clarity and tenderness is too delicious, they love it too; after all what else am I, personally and specifically?  I am perfectly happy to sit here with these quiet thoughts, and the deep ocean that underlies them all.  I realize that Im hopelessly in love, I have no objection.</p><p>The soft animal flesh, the longing heart, indeed all life is intrinsically vulnerable and contingent.  Love and hate, joy, sorrow, affection, fear, anger etc. all arise, personally as well as evolutionarily in response to this fundamental vulnerability.  All forms pass. We live and die.  It hurts.  Things dont go the way we want, and were pissed.  Its only natural, life elaborating itself in the intertwining lives and deaths of countless trillions had to struggle, to reach, to know pain and pleasure.  </p><p>When you *really* get this, not just as an abstract idea but as inescapable experience you lose your fundamental objection to the conditions of existence. Of course in your day by day life as a human being you may well (and rightly) object to any number of things, yet you are reconciled to the ultimate way, knowing it in your bones, and perhaps realizing that you always knew, but for the veils of desire and aversion.  How else could you see it in a moment, as many do; after all this is not a complicated, esoteric knowledge.  It seems so simple that it should be virtually obvious to any normally intelligent person, indeed it may sound almost stupid when first heard in words.  The struggle to avoid pain and death, to get what we want preoccupies us, narrows our vision and conditions us against seeing beyond our noses, our personal concerns.  Ironic, but perfectly natural, even as liberation is perfectly natural.  Its so simple, yet the challenge is to make a life of it all.</p><p>I realize this has all been said many times before, and more eloquently, in brief its the Buddhas noble truths.  </p><p>T+6:30</p><p>Time for bed, back in my room I slip quickly into deep, dreamless sleep.</p><p>In the morning I awake at my usual time, glad to have a few days left without any outside obligations, though I know it wouldnt really be a problem.  My heart and mind are still deeply resonant with the previous evenings singularity as I go about my day, a quiet fire burning within.  In the days to follow a poem begins to form in my mind, compelling me to write it down.  This is very unusual for me, it doesnt seem as if I composed it, nor did it come from somewhere else.  Ive carried a copy of it with me ever since, I include it at the end of this report.</p><p>Although I didnt come to any really new beliefs or concepts as a result Im amazed at the unqualified totality of immersion.  The experience was virtually devoid of any imagery or intellectual insights.  For about three eternal hours there were essentially no thoughts or sense of personal identity at all, but an oceanic clarity of awareness, a kind of abiding in knowing without thinking.  I was utterly transparent, with an overflowing of emptiness flooding up through my heart, deeper than any specific emotion, a kind of ground state of heart and mind, before differentiation into the arising and flow of thoughts and feelings.  </p><p>At no time did I lose awareness of body, place or context, all was subsumed into this vast, timeless ocean.  Only later did I begin to reflect on it all.  This state was not unknown to me but never before so extended and complete, perhaps thats why the essence has not left me or faded with time.  Of course Im still a human being, capable of sorrow as well as joy, anger and upset as well as love and tenderness; yet the deep ocean is always there, as close as my breath, a day doesnt go by that I completely forget.  I know my way home and am profoundly grateful.</p><p>Before I go Ill hazard one bit of advice for my fellow explorers: </p><p>Wherever and however you journey dont forget your heart.  We go through our lives with the sense that theres some mysterious secret to uncover, some way to beat the game, never quite realizing that we are the game and the secret sings in us, all around us everywhere.  Theres nothing to beat.  Your heart already knows everything that matters.</p><p>Aloha Nui Loa,</p><p>Hokulea</p><p>JEWEL</p><p>jewel on velvet</p><p>trembling black</p><p>diamond needles</p><p>pierce my soul</p><p>pinned to the stars</p><p>slit open and spilled</p><p>out like water</p><p>i am undone</p><p>still as death</p><p>naked as birth</p><p>heart laid bare</p><p>to every breeze</p><p>overflowing yet</p><p>with emptiness</p><p>heaven shudders</p><p>and i am gone</p><p>broken and mended</p><p>with one stroke</p><p>the flood loosed</p><p>flames consuming</p><p>skin to marrow</p><p>breath and bone</p><p>the sky my body</p><p>i am no more</p>"
}
