{
 "title": "Everything is Dancing!",
 "author": "Vercingetorix",
 "citation": "   Vercingetorix. \"Everything is Dancing!: experience with Morning Glory Seeds (ID 13593)\". Erowid.org. Apr 10, 2002. erowid.org/exp/13593",
 "substance": "Morning Glory Seeds",
 "bodyweight": "142 lb",
 "header": [
  [
   "DOSE:",
   "16.5 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13593",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2002",
   "Views: 12018",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWell considering I've never tripped before and the only other stuff I've done is cannabis a few times and nutmeg once; this was pretty intense.</p><p>It was my second time trying this, the last time I just felt really high (I smoked some good weed with it). Interestingly enough both times I didn't get sick or paranoid although I was obviously tripping since my pupils were the size of quarters. The first time I had just eaten 5 packs of Martha Stewart Heavenly Blue Morning Glory Seeds. I got some weird chills down my spine and some shadow visuals but that was about it. Now here's what happened the second time. </p><p>7:00 PM: Picked up 2 1.5 g packs Heavenly Blue and 9 1.5g packs Pearly Gates from the local K-Mart [I don't think Martha Stewart Morning Glory's have pesticides on them to stop kids from eating them.]</p><p>7:30 Chewed up all the seeds. The Pearly Gates Tasted Like Shit but the Heavenly Blues tasted a bit like pine nuts. I would reccomend them over any other strain.</p><p>9:30 I started thinking nothing was gonna happen even though I figured it would be an hour before they kicked in. Figured I'd wasted 10 bucks.</p><p>10:30 I started feeling really heavy like I wanted to just sink into the floor. A lot of ppl don't realize LSA is a sedative, it's actually officially listed as that.</p><p>11:00 Started watching the curtains in front of me they seemed to be moving ever so slightly. I at first thought it was the heating vent under them but I was wrong.</p><p>12:00 AM: Shit started happening. The tiles on the floor looked like they had little hands on them and when I started to read the newspaper I kinda half expected the people's faces to turn around and look at me.</p><p>1:00 Things started moving around before my eyes,looked like things were dancing.</p><p>2:30 This was when it started peaking. It got really insane at this point. An interesting fact was that my mind stayed clear the whole time. You know how in the original Nintendo version of Mario 3 all the trees dance in stuff when you're picking a level? It was a lot like that.</p><p>I sat in my bed listening to some Loreena McKennitt music ('The Mummer's Dance') everything was  dancing with the music, like the whole house was alive, things dancing on hte wallpaper and crazy shit like that.  It seemed like eyes and ears were popping out've everything too. I remember looking at a mirror and my reflection looked like some symmetrical psychedelic poster, then it looked almost cartoon like. If I dimmed the lights the shadows would get crazy and I'd be really disoriented. They were kind of like really souped up weed visuals when you take a walk at night.</p><p>I also couldn't sleep cause when I closed my eyes it was like I could still see. It got really boring after a while and the peak lasted a couple hours. I was still feeling the effects a few days later. In fact the next morning I could barely move or think so I pretty much slept the whole day. I imagine it was from the sedative qualities of the LSA combined with the fact that I'm sensitive to medicine/drugs, it takes  along time for me to metabolize everything. I'd recommend doing it, although I might not do it again (lasts to long and you can't sleep though you just want to lie down). I doubt it fries your brain unless you do it all the time.</p><p>Having never done acid I can't really compare them. However I'm sure it's similar, friends that have done both told me it is. For instance everything looks like it's breathing. Ultimately I'm glad I've experienced this. It was nothing like I imagined. Nothing like weed. I didn't gain any insights so I was a bit dissapointed.</p>"
}
