{
 "title": "I'd Rather Be Gas Huffing",
 "author": "Special Mike",
 "citation": "   Special Mike. \"I'd Rather Be Gas Huffing: experience with Inhalants: Gasoline (ID 1361)\". Erowid.org. Sep 10, 2000. erowid.org/exp/1361",
 "substance": "Inhalants: Gasoline",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1361",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 35929",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>Me and my friend went through a period of gas huffing that lasted about a month. Let me start by saying I have tried alot of drugs and never in my life been as messed up as gas huffing gets me. It is horribly dangerous, tastes disgusting , and leaves a huge hangover. We would hold our mouths to the rim of the open gas can and inhale the fumes for about thirty seconds each, passing the can back and forth. after about five minutes we would completely lose ourselves. The first thing that hits you is a wave of the most powerful dejavu you will ever feel. (I have recently heard that the feeling of dejavu is associated with some forms of mental retardation).</p><p>Every single noise echoes endlessly and audio hallucinations are extremely prominent especially outside. Car horns, helicopters, dogs barking, mothers calling for their children. I heard all these thing echoeing in an endless loop through my head but don't know which of them were real and which were hallucinations. Strangely every time I huffed I would hear the same sounds echoing through my head and they would form a sort of song. I enjoyed the song so much I looked forward to hitting that peak just so I could hear it. I could almost make out words amidst the echoing noise, and would drive myself to the brink of lunacy trying to discern these jumbled beautiful lyrics. I even went so far as to try and write them down at the peak of my 'huff' and was ecstatic when I thought I had done it. Finally put in writing this strange song that teased my mind for so long. But when I finally came back to reality all that was on the paper was black scribbles. I gave up on the song. </p><p>Another time I was huffing on the side of my friends house with him, and suddenly realized I was in Australia. I knew I had always been there and it was my job to catch boomerangs thrown from America and translate the messages written on them. It sounds idiotic but at the peak of a gas huff anything goes and you take what you can get. My friend has reported being taken into a cartoon version of the world, and a room filled with silver confetti where a huge eyeball floated in fromt of him and a deep voice laughed from the distance. I was once transported back to my childhood where I stood in a park on a summer day, I could see my friend but he seemed older and I thought for a second that it was my friends older brother and I had known him as a child and had dragged up some old memory since that feeling of dejavu was overwhelming. I have never been scared or had a 'bad trip' I guess it's that dejavu feeling that smoothes everything over so it feels like your just reliving old memories even though your standing in a garage completely out of your mind. </p><p>Gas huffing is bizarre.   I really wouldn't advise anyone to try it. It is fun at the time but after it wears off you taste gasoline with every breath for about two days, and are left in a sub-human funk of depression and lack of motivation. For as fun and strange as it is it's completely uninformative and unenlightening. I don't think it's worth the hangover since it only lasts for about 5 minutes, and your hangover will last for a whole day.</p>"
}
