{
 "title": "Vasopressin Vs. Alcohol",
 "author": "Renwick",
 "citation": "   Renwick. \"Vasopressin Vs. Alcohol: experience with Vasopressin & Alcohol (ID 13614)\". Erowid.org. Dec 4, 2003. erowid.org/exp/13614",
 "substance": "Vasopressin & Alcohol",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7 glasses",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 1:00",
   "3 hits",
   "insufflated",
   "Vasopressin",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "13614",
   "Male",
   " ",
   "Not Given",
   "Dec 4, 2003",
   "17294",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A while ago I read in a book that Vassopressin was able to counteract the intoxicating effects of alcohol. Recently I was able to procure some Vassopressin over the internet so I decided to test this theory. My friend Ramielrising and I paid a visit to Simones beverage store and got some hard cider and Yukon Jack. We headed back to my house and began drinking. We tried to call otheres to join the festivities but  couldn't get ahold of anyone else. I had a couple shots of Yukon Jack in Ginger Ale followed by four bottles of hard cider.</p><p>Then it was time for the Vassopressin. I took three inhalations of the drug from the spray bottle. I immediately felt a little rush of my brain kicking in, similar to cocaine but much more mild. We decided to go for a walk. Everything was much funnier than with alcohol alone, I couldn't stop laughing.  I felt more coordinated yet more intoxicated than I had felt before drinking. I had the room spinning effect normally present with high doses of alcohol but with none of the nausea.</p><p>I woke up this morning and had a hangover, I rarely get hangovers. I wonder if the hangover was caused by the Vassopressin or just dehydration. Over all I did have an enjoyable time but I don't know if it was that much better than alcohol alone. My next expereiment with Vassopressin will be using it while on marijuana.</p>"
}
