{
 "title": "A Beautiful If Somewhat Confusing Night",
 "author": "Sugarpuss",
 "citation": "   Sugarpuss. \"A Beautiful If Somewhat Confusing Night: experience with MDMA & Cannabis (ID 13665)\". Erowid.org. May 1, 2002. erowid.org/exp/13665",
 "substance": "MDMA & Cannabis",
 "bodyweight": "118 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:45",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:30",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13665",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 1, 2002",
   "Views: 18812",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSetting: Easter night.  My father is out of town and my mother has been asleep for a few hours.  I was planning to take them yesterday, but I ended up having to take care of a friend on a large dose of LSD instead.  I have never really rolled by myself before, and decided it?s time to try.</p><p>11:30pm - I ingest one pill.  The pills are large and thin, domed on both sides.  They look like they?re white with brown spots sprayed on them that seem to smudge if you lick them.  I tested it with a kit that gave a positive reaction for MDxx.  I have heard these pills referred to by several names, including chocolate chips, cookies and cream, and salt and pepper, but most commonly I?ve heard them called pressed mollies.  I?m feeling a bit anxious because I dislike the ?coming up? part of taking ecstasy, but I know that eventually that feeling will give way into a wonderful sensation.  For now I?ll just listen to music and read while I wait and try to keep my mind off of my anticipation and anxiety.  (I notice that as soon as I take a pill, I have a psychosomatic reaction and think that I am already feeling physically different, although consciously I know that it?s all in my head.)</p><p>11:46pm - Already feeling noticeably different.  A bit of a ?rushy? sensation - sort of like when you feel very nervous or excited - throughout my chest/and stomach.  I?m also noticeably warmer.  Things seem different, but in a way that defies explanation.  I feel like I?m typing more quickly and making more mistakes.  Pulse is noticeably elevated.  This is the come-up, the part that I don?t like.  I?m listening to music and talking to some friends on the computer to keep myself occupied.  Concentrating is a bit difficult because I feel like the inside of me is going faster than everything outside of me, if that makes any sense.</p><p>11:51pm - Effects have increased a surprising amount in just the last five minutes.  I feel fuzzy-headed and warm, and the ?rushy? feeling is subsiding a bit.  I feel sort of like I?m moving through water and it?s beginning to turn into a pleasant feeling.  My hands feel cold, in a very interesting and nice way.  I?m still a bit nervous and jittery and I hope that will pass soon.  I know it will eventually; it always does.  I feel slightly queasy, but it?s not as bothersome as it would be if I were sober.  I turn on some happy cheesy progressive trance and continue to wait for the feelings to level out.</p><p>11:56pm - Effects still steadily increasing.  Mild visual distortions; things seem very clear yet blurry.  Slightly nauseous.  Still rushing a bit, but this is getting better.  Talking to people is slightly more difficult but at the same time I?m much more interested in doing it, and in being in contact with people somehow.  (Well, it?s called the love drug for a reason, right?)  Music is wonderful.</p><p>12:01am - Noticeably harder to concentrate and type, but I?m going to follow this report through somehow!  Alternately hot and cold, still rushy but the nausea has passed.  I?m clenching my jaw a lot; perhaps I?ll try smoking a cigarette.  I lit one and it?s a bit hard to smoke because of the clenching and jaw shattering. I shoulf probably find a pacifier or something to chew on or my jaw will hurt badly tomorrow.  Cold, but too lazy and happy to do anything about it.  I feel like I could write beautiful poetry in my head that could never be transcribed to paper.  Music is seriously wonderful.  </p><p>12:09am - All of the negative effects have passed except for the jaw tension.  Listening to music and chatting with people online very openly.  Definitely a good experience so far.</p><p>12:14am - It feels like a LOT more than five minutes since I made my last entry in this.  I am very intoxicated and loving it.  I need the pacifier so I don?t hurt my jaw.  The clenchines in the only annoying part right now.</p><p>12:20am - These pills feel like MDA to me.  It?s a slighty different body high and it?s very very strong. Perhaps the pills contain both?  Perhaps another cigarette.  I think perhaps in a little while I will take the other pill I have.  I want the experience to be intense, and over at a semi-reasonable hour.  I plan to be in bed by 6am at the latest.</p><p>12:24am - It definitely goes in waves.  Sometimes I feel very clear and level and then it washes over me and I?m totally gone again.  Wonderful!</p><p>12:33am - Heh, this is a pretty detailed trip report.  Touching things feels wonderful and my body temperature keeps fluctuating.  Having a wonderful time just talking with people on the computer.</p><p>12:55 - I can?t believe it?s only been twenty minutes!  Time is going really slow.  </p><p>1:13 - I just took another pill.  This should be interesting.</p><p>2:24am - I totally forgot I was writing this.  Typing is nearly impoissible now.  Major visual distortions, very strong body high.  I also smoked a bowl with a friend which seems to be intensify the experience.  That took almost 5 minutes to write.</p><p>3:25am - Still doing pretty well.  Effects are noticeably diminished bit but I smoked a large number of pot (which I almost never do) and I am quite stoned.  Typing is still virtually impossible and I have to close one eye to read things.  I?m greatly impressed by these pills.</p><p>3:45am - I am noticing less empathy and cuddliess and more of a psychedelic feeling is taking over.  I am really feeling the amphetamine effect and a whole lot of pot.  I still feel pretty damn good, though, and surprisingly I have manged to stay grounded the entire time.  That?s pretty good, especially considering I can TOTALLY see how people lost reality on these pills.</p><p>5:25am.  Just about time for bed.  Still feeling residual effects from the ecstasy; they were definitely quality pills.  I smoked an ungodly amount of marijuana and now it is difficult doing much of anything at all, and so I think I will close this report.  Definitely a rewarding experience; loved-up, happy, bonding.  The jaw clenching was pretty bad, and I think that might be my only complaint.</p>"
}
