{
 "title": "Romance of Rap",
 "author": "Lilmikey1217",
 "citation": "   Lilmikey1217. \"Romance of Rap: experience with Methylphenidate (Ritalin) (ID 13666)\". Erowid.org. Aug 21, 2006. erowid.org/exp/13666",
 "substance": "Methylphenidate (Ritalin)",
 "bodyweight": "114 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 13666",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 21, 2006",
   "Views: 5925",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At age 16, I was prescribed Ritalin 20mg tablets, for an ADD condition and behavior. I have a long past of drug use, my doctor knew this, and felt it was self-meditation using amphetamines to concentrate, I was aware I can become addicted to this drug, if I misuse it.</p><p>Well I was the stupid one, as of this moment, 8:31am, I am under the influence of ritalin, as hearing I could snort this drug, I tried it, I woke up at 8am, crushed the tablet with a lighter, ground it down very powdery, took a dollar bill, took in the two big lines I got out of the pill. As I sat there, my nose began to burn, eyes started to water, felt a warm intense shock all in my chest and stomach, a quick 4second anxiety feeling, I knew to myself, Im hooked this stuff is great!</p><p>At about 8:05, I went downstairs onto my computer, turned some Rap music on, music was greater, I liked music more, I began to doze off into space (kind of like marijuana) but with stimulating effects as extreme happiness, like nothing bothered me, and it was all good, I loved talking to my friends online, I felt a connection with them, I almost told my teacher I liked her. This great buzz Im having, is almost identical to Cocaine, just a lighter buzz. I thought it as, wow I got my own cheap coke legally, Right now Im still buzzing, listening to music, enjoying it a lot, I am looking forward to doing this again.  As my buzz is decreasing, I feel irritable, a little anxiety, and a craving to snort some more lines.</p>"
}
