{
 "title": "Enjoying Opioids",
 "author": "NeoHippy",
 "citation": "   NeoHippy. \"Enjoying Opioids: experience with Oxycodone (ID 1369)\". Erowid.org. May 18, 2001. erowid.org/exp/1369",
 "substance": "Oxycodone",
 "bodyweight": "175 lb",
 "header": [],
 "footer": [
  [
   "2000",
   "1369",
   "Not Specified",
   " ",
   "Not Given",
   "May 18, 2001",
   "148911",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have never experimented with any opiates or opioids stronger than oxycodone and hydrocodone.  But these I have much experience with.  I have dosed oxycodone about four times in my life, hydrocodone about 10, ODing on it once.  I almost always take my dope orally.  I tried administrating the drug by snorting a few times but concluded it wasn't effective, considering both hydrocodone and oxycodone come w/ about 100 mg of aspirin or tylenol per pill.  That is a lot of material to snort--hard on your nose.  I have never attempted to ingest either drug by IV.  I believe using a needle to administer opiates, opioids, and stimulants is solely a tool for addicts to make the drug more effective.  Believing myself to be no addict, I never use a needle.</p><p>Approximately twenty minutes after ingestion the old familiar warmness, itchy, euphoric feelings set in.  The euphoric feelings began to intensify until reaching a plateau for about three hours 50 minutes after ingestion.  At this point, speech was slurred considerably, but nothing a little concentration couldn't handle, coordination was very impaired, the body is very relaxed and at peace, and small but pleasant, vertigo-like feelings were felt, however, nothing nearly as strong as 4th-plateau DXM trips or even Acid.</p><p>On opioids, no visuals are seen nor desired to be seen.  Little interest is taken upon the world--no fascination with pretty flowers, or a blue sky; Its more of an oblivious, 'spaced out' feeling high.  Mental cloudiness is present, making thinking hard.  But this proves to be no obstacle--talking is very easy.  Talking intelligently isn't however- but can be achieved with a little willpower.</p><p>The duration of these opioids are about 3-5 hours.  When completely down--a very relaxing sensation is felt through out the body--leaving you with no desire for more.</p><p>It can be ultimately said that while acid makes you use 80% of your brain, opioids make you use 1% of it.  Opioids and Opiates truely narrow your view and interest to think about things--to sit back and just philosophize.  This is why I do not abuse these drugs.  I enjoy thinking and pondering the origins of anything from the universe to a molecule of dirt for hours on end.  But a rare change from this never hurt anybody.  Opioids are very pleasant, but not life changing and profound.  Not as spirtual--more physical and numbing.  Yet enjoyable.</p><p>There are many things I notice w/ the recreational usage of opioids--</p><p>POSITIVE:</p><p>~those you are close to seem even closer, I dare to say the feelings may be somewhat similiar to minute doses of E</p><p>~the old familiar euphoric feeling you get on pain killers: pleasant drowsiness, pleasant intertia, comfortable itching, and intense, strung-out, euphoria</p><p>NEUTRAL:</p><p>~pupils don't always diliate- my pupils become very small, but seemed to blend in with the color of my eyes.</p><p>~nearly impossible to reach orgasm until at LEAST 24 hours after heavy doses</p><p>NEGATIVE:</p><p>~sensitivity to light, loud talk, and music.</p><p>~the feeling of annoyance is always lurking amongst those you even dislike the least bit.  I suggest being alone or in close company of those you truely love and like.</p><p>Anyways kids, that is my two cents.  Opioids are cool, as are Opiates, but abuse can be very dangerous and damaging.</p>"
}
