{
 "title": "I Took 30 Seeds and Nothing Happened!",
 "author": "The Ladies Man",
 "citation": "   The Ladies Man. \"I Took 30 Seeds and Nothing Happened!: experience with H.B. Woodrose Seeds (ID 137)\". Erowid.org. Oct 4, 2000. erowid.org/exp/137",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "30 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 137",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 4, 2000",
   "Views: 22121",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n[Erowid Note: There is quite a bit of confusion around Hawaiian Baby Woodrose vs Hawaiian Woodrose seeds.  These are two different genus/species of plants, and it is HBWR which is most often consumed for its psychoactive effects.  The following report is somewhat unclear about which type of seeds were consumed.]</p><p>I purchased these hawaiian woodrose seeds from a website and I am beginning to wonder if I was ripped off. The seeds had no white coating, but were a solid light brown color (does this have something to do with potency?). I heard that you'd never want to take any more than 10 seeds or you'll be sorry, so being the ballsy bastard that I am I ate 15. I chewed them down to nothing while swallowing the juices. I retreated to the comfortable confines of my bedroom, closed the door, got a pad and paper reading to record the experience, turned on the TV and put on a Wu-Tang CD and just waited for something to happen. </p><p>Hour 1 - Nothing.</p><p>Hour 2 - Not a damn thing. Not even any nausea.</p><p>Hour 3 - Gone through two Method Man CD's and a Redman CD and notta. </p><p>Hour 4 - Only thing I'm feeling so far is hunger. (I hadn't eaten since that mourning) I'm starting to get a little pissed.</p><p>Hour 5 - Not a god damn thing. I think those bastards at peruvian journey ripped me off. I'll send them a flamer they want soon forget... ( I was pissed, I really did write that down.)</p><p>Hour 7- Pissed and dissappointed so I smoked three blunts. Now I'm really hungry. I think I'll get some japanese food from teriaky express...</p><p>Hour 8 - Well this concludes a very dissappointing first experience. I suppose I'll try again later but I want more info. But for now the night is over for this bad boy...</p><p>Now I'm a pretty solid, muscular guy. I'm only 6'0' but I weigh 190lbs plus tax. When I asked around on the internet, people were telling me that off of 15 seeds I should have been temperarly insane and puking my guts out. I took the ingestion tips from this site and crushed up 20 seeds this time and soaked them in water over night. I drank the green liquid first thing in the mourning and even swallowed the seed mush just to be sure. I didn't record anything this time because I was a little doubtful that anything would happen. And as it turns out, my doubts were justified. Once again for 7 hours nothing, not even any nausea. </p><p>On my third try I ground up 30 seeds this time and instead of soaking them, I boiled them. I boiled them in 2 cups of water and one cup of lemon juice for 20 minutes, then I turned down the heat and let it simmer for an hour. The liquid was a dark green and the seed mush was practically non existant. I cooled it in the refrigerator for 2 hours and then drank the bitter fluid. Once again nothing. No nausea,no dizziness, nothing. </p><p>What gives? Someone else that posted here said that taking HBWS was like playing russian rullet, 3 out of 4 people will have a trip. So what gives? Am I just really unlucky? Or am I doing something wrong? I only got a few seeds left and I want to make this time count. Somebody help me out here!</p>"
}
