{
 "title": "Suicide Plant",
 "author": "kilogram",
 "citation": "   kilogram. \"Suicide Plant: experience with Datura (ID 13741)\". Erowid.org. Apr 7, 2002. erowid.org/exp/13741",
 "substance": "Datura",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "1.5 tsp",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 13741",
   "Male",
   " ",
   "Not Given",
   "Apr 7, 2002",
   "Views: 27386",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nEverything started when me and my girlfriend were in a bar drinking, and talking about drugs, and we decided on a drunk head that we should do a psychedelic on that night.</p><p>So I called a good friend of mine that i knew that always has something, and we went and took whatever he gave us, he just told us that this is a plant that produces hallucinations.</p><p>So after a couple of hours me and my girlfriend took a 1.5 tsp each and in 30 min we where so HEAVY so restless so sleepy... and we took the cab and went home, we realy wanted to go to sleep, no talking, no hallucinations so far...</p><p>So we are in the bed and every 5 min we were going to the toilet, but none of us could do anything, and back to bed where we could not sleep.  THen it started.</p><p>I remember that the first thing I saw was steel bugs coming out of the carpet in the restroom... while I was trying to do something... Than I was in the bed and realized that my girlfriend was not in the bed.  In the restroom was no light on, and I began seeing dark siloutes coming from the wall with a lot of big and small bugs.  Than all of the sudden I saw a bunch of guys that where looking at me and in the house everysingle light was on.  I remember that I was in a dark room where I could not see a thing and I was trying to go somewhere and I was just hurting myself cuz I was hitting invisible walls, and had the feeling that everybody else was looking at me,where I went I was hiiting walls with my head realy hard.</p><p>I got up in the morning still on Datura.  I looked for my coat to go to the college and my girlfriend was and at the same time was not there.  My coat was actualy somewhere where i never thought it would be (in the garage).</p><p>So i thought i was realy late for the lessons... and i took a cab... because my instinct told me that I could not drive in such condition (I was not seeing anything at my watch and could not read anything).  I was trying to smoke so I was smoking and then I realized that I had no cigarette in my hand I was just imitating smokin with my hand.  I saw a lot of familiar faces as I was walking on the street saying 'hi' and in reply they where disapiring, an so on...</p><p>The most terrifying part is that when I came home my girlfriend had a black eye full of blood and you almost couldn't see the eye at all.  I thought that this was a hallucination too, but was not.  Actualy the bummping into invisible walls at night had been real.  Flailing around without seeing anything my girlfriend hurt her eye by falling face first into the corner of the TV.  I'm surprised she didn't lose here eye.  She is OK now but for a month she couldn't see and here eye was horrible.</p><p>It turns out my friend did not know the real effects of Datura since he got it the same night we got it from him (so he never tried it).  We told him what happend and after what almost killed him because of what he gave us and because of my girlfriend.</p><p>So everybody there that wants to try this plant.... GO FOR IT if you really don't care about your life... and if you decide to do it then do it in a field that has no trees no nothing that might hurt you or take small doses that will just make you delirious.  This is a devil's plant that I wish I had never tried.  There are so many other psychedelics that are more interesting and safe.</p>"
}
