{
 "title": "Candy Cane Fans and Gelatin",
 "author": "*Wisdom*",
 "citation": "   *Wisdom*. \"Candy Cane Fans and Gelatin: experience with Cannabis & Hydrocodone (ID 13850)\". Erowid.org. Jul 19, 2005. erowid.org/exp/13850",
 "substance": "Cannabis & Hydrocodone",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:15",
   "2.5 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 1:35",
   "7.5 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 4:20",
   "3.75 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 13850",
   "Male",
   " ",
   "Not Given",
   "Jul 19, 2005",
   "Views: 7025",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Setting: Mostly in my room with deep trance music playing, room lit by candlelight. Some of the experience took place outside (night) at a scenic park near my house.</p><p>Previous drug experiences: a lot of pot, LSD, Shrooms, Mescaline, Coke, DXM, E, Dimenhydrinate (Dramamine), hydrocodone many times (though this was only the second time I had combined it with pot), Darvon, Nitrous, etc, etc, the list goes on</p><p>Anyway, I had been sober for while and I was really itching to get completely blown out of my mind and I had remembered that my dad had recently gotten a bottle of hydrocodone. I was having a friend spend the night that night who had never done hydrocodone before but was really interested in it, so I hooked him up with some as well. It was only about 6:00 and luckily my older brother decided to come over, and man does he always have the finest herb, so of course, we were all going to smoke that night too</p><p>T+ 1:00 - We all decided to go for a walk to the park near my house to smoke a joint and enjoy the scenery. Having being really good bud it only took a few hits to get all of us fucked over. After about 20 minutes of walking around the park completely stoned off our asses, I got lost in the park that I know so well, don't know how, but I got lost. Finally after the other two found me, we decided to go back to the house to take the hydrocodone. </p><p>T+ 1:30 - We got back to the house and went straight to my room to avoid having to talk to my parents. As I walked in I instantly turned on the stereo and put on some mellow trance music and lit some candles to set the mood for the sedative effects of the hydrocodone. My brother told us to wait until we just start to comedown from the bud to take the hydrocodone and to take small doses at first and work our way up to what we think we can handle. Little did I know that I was going to have one of the most unforgettable experiences of my life.</p><p>T+ 2:15 - I broke one of the many hydrocodone 5/500 tabs in half and took it, while 'B' took half of one as well. We had two different kinds of it: 5/500 and 7.5/500, and about 25 pills of each. (5/500 simply means 5 mg of hydrocodone cut with 500 mg of acetaminophen.)</p><p>T+ 2:35 - I got tired of waiting for the effects of 2.5 mg of hydrocodone to take its small effect and decided to take the other half, plus one whole 5/500. 'B' decided to only take another 5/500.</p><p>T+ 3:20 - I was starting to feel the effects kicking in. I had felt as if some sort of sphere of heat and numbness was expanding from my stomach outward throughout my entire body. I felt great, like nothing could hurt me or nothing could go wrong in the world. Around this time 'B' told me that my ceiling fan blades were candy canes, and sure enough they were morphing into candy canes and back to the normal blades, back and forth. This was also the last time that my brother and I heard from 'B' for almost the remainder of the night. The rest of the time he spent passed out on my futon.</p><p>I decided to lay down and listen to the music I had put on. This is where the amazing stuff started to happen. I could actually see the music as it was playing. Its really difficult to explain, but it was VERY similar to the effects of LSD, but more intense and beautiful. I had intense closed eye visuals, not of geometrical patterns like LSD, but of colorful non-existent lands covered with beautiful multicolored landscaping. I could actually wonder off into my visuals and 'walk' around viewing in amazement. One of the best 'interactive' visuals I had was were I was walking around in this bright green, psychedelic field full of crosses that stood about 12 feet high and melted into swirls of bright elegant colors, kind of like a candle melting slowly</p><p>----Passed out for a while----</p><p>T+ 5:20 - I awoke to find myself mysteriously lying on the floor in my living room with my brother watching some cartoon. For some reason I felt the need to eat something, so I went and cooked a hot pocket. I strongly recommend not eating while on hydrocodone, as the hotpocket I had cooked tasted like dirty gravel and I almost puked from the taste. Anyways, I ended up going back to my room and woke 'B' up to give him the rest of the hotpocket. Sure enough, he ate it, mumbled some gibberish, and passed back out. At around this time, my brother and I decided to split half of a 7.5/500. Shortly after downing the pill I realized that I shouldn't have taken it; for I was sitting on the floor petting a dog that didn't exist. I thought there was a dog there, I could see it and hear it, but there was no dog. (Later I found out it was a laundry basket).</p><p>For the rest of the night I spent my time lying in the middle of the floor of my room listening and 'seeing' music (and many other strange non-existent animals/objects). I ended up falling asleep somewhere around 6:00am and awoke the next day feeling like I had gotten the best nights sleep in my life. I woke up refreshed and full of energy. All in all I felt great and the experience was extraordinary and spiritual. Since my experience I have quit all other drugs for this wonderful combination of pain killers and some smoked herb, for it has won me over. :)</p><p>--Wisdom</p>"
}
