{
 "title": "Overdose on Rue? You Better Believe It.",
 "author": "BigShroomMan",
 "citation": "   BigShroomMan. \"Overdose on Rue? You Better Believe It.: experience with Syrian Rue (ID 13870)\". Erowid.org. Apr 12, 2002. erowid.org/exp/13870",
 "substance": "Syrian Rue",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "25 g",
   "oral",
   "Syrian Rue",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 13870",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 12, 2002",
   "Views: 25281",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA friend and I had recently decided to try and grow our own shrooms. While waiting for the syringes to arive in the mail, I decided to do some research on substances that would elevate our experiences. I found some info on Syrian Rue and after reading everything and finding out that I could easily buy seeds off the internet for a good price I jumped at the chance to try a new thing.</p><p>I bought 100 grams and when they came in the mail I went directly to my friends house. We crushed up 50 grams worth of seeds, boiled it with lemon juice and filtered out the junk. We then sat down with our cups and tried real hard to drink the solution, which by the way was the worst smelling and worst tasting stuff imaginable. After drinking the concoction, gagging and almost throwing up during this process, we sat down and put on some tunes. </p><p>At first I felt a real nice body buzz and a mild euphoria. Then it got worse. Everything began to move around, and I couldn't sit up straight. I went outside where my friend was smoking a cigarette. He had drank his a lot quicker than me, yes I'm a pussy, and he said he wasn't feeling well. I told him I was beggining to feel sick also. He then rushed off to the bathroom, threw up and then laid on his bed. I last a few minutes longer and was then hugging the toilet too.</p><p>I finished hurling and sat on the couch. I had intense open eye visuals of people walking through the room and people sitting in the chairs and the couch around me. Unfortunately it was not long before I had to hurl again, this time however I had a really hard time walking to the bathroom. I could not control my legs and my eyes could not focus on anything. I stumbled to the toilet and spent about 2 hours there throwing up and trying to throw up(and having my reflection in the toilet make faces and talk to me). </p><p>My friend was also now throwing up in a seperate bathroom. After that hurling spell was over I crawled, still unable to walk, and laid on the floor of my friends bedroom. I was stil having intense visuals, open eyed and closed, and I had to keep trying to wake myself up from my 'dreams' because I thought I was dying. The rest of the night was spent lying on the floor, trying to stay alive, trying to not throw up, and asking my friend if he was still alive.</p><p>All in all the experience was intense and frightening, and should never be duplicated. The whole night I had a loud buzzing sound in my head. My friend also claims he talked to God while laying in bed. This act was done by professional idiots, Please do not try this at home!</p>"
}
