{
 "title": "Myriad Trip",
 "author": "gotrocks",
 "citation": "   gotrocks. \"Myriad Trip: experience with LSD & Cannabis (ID 13873)\". Erowid.org. Sep 22, 2008. erowid.org/exp/13873",
 "substance": "LSD & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:40",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1984",
   "ID: 13873",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 22, 2008",
   "Views: 5067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am writing this in hopes that someone else may have experienced something similar during one of their trips. A very important aspect of this experience that sets it apart from your average lsd/marijuana experience is the intensity of fear and terror involved, and the 'realness' of the so called hallucinations. </p><p>Dosage and timing information: The 'hit' of LSD I took seemed to have slightly more than a single hit by a thin tear across another hit. May have been the corner, or bottom of the page. This coupled with the thickness of the paper made we wonder from the beginning just how much lsd was on the blotter. Start time=10:40pm on a Friday night. McDonalds, a quarter pounder with cheese and a coke, I hold the acid on om tongue for a breif moment, minutely dissolved, then swallowed after the meal. Drove to pick up friend from work, arrive home 1/2 hour later, nothing, no effects. 1 hour and 40 minutes later, thinking that the lsd was just paper, started smoking party bowl size hits of marijuana, good quality mexican seedless spicy smell, type ii. Me and friend devour about 1/2 oz of this weed within I'd say about 45 minutes or less. (which I thought was odd, usually we don't smoke quite so much, and especially so fast) My friend had taken his slightly smaller hit upon my arrival to his work to pick him up. Neither of us seemed to be high, just mildly which after smoking all that, seemed very strange to us both. Then slowly after well over a 2 hour delay, this lsd and weed mixture hit us both very powerfully. The first visuals were that of the gold fleck on the white kitchen counter and in the bathroom seem to be appearing onto the white background like small blooming gold flowers. Then doorways in the other rooms in the house seem to have strange unfamiliar dimensions. My friend appeared to have very strange dimensions and proportions, and now spoke a higher pitched voice. We were watching cable tv and every channel seemed to be way out of date. Everyone looked like they were from the 60's. They all had these colored sunglasses on and hippy clothes, tie die, patches etc. Even the news people looked like that. We we very impressed with this effect. Sounds were very fluid and seemed to come from every direction. My friend began to become frustrated with me because he doesn't like classical music, only heavy rock. We both like the rock, but he doesn't like classical, he thinks it's strange, or weird, or perhaps even a tad gay.</p><p>Anyway, this is how it all started. His face appeared to take on a much different look. very elongated and more stretched between the nose and the eyes. He bagan by insisting that we turn off the classical music. He made this happen from accross the room without a remote. My stereo was old and had no remote controll access at all. I tried to get another radio station and there was nothing but dead air.  It seemed that either the stereo tuner had failed, or worse, my friend would not allow it. I say this because when I accused him of somehow interfering with my stereo tuner reception, he seemed to behave as if he was in controll of much more than that stereo. He decided that we should listen to Led Zeppelin's 'when the levee breaks' and 'no quarter'. We listened to no quarter several times in a row, and then I wanted it to stop, so he walked to the stereo and turned it off. His appearance was beginning to look even more frighteneing by his expressions. I said to him, 'I think I'll call and see how my mom is doing, (this is because I was very much in fear at this moment, but I was trying to hide it) I called her and she answered and she soon understood where I was and told me to just be calm. Then her voice seemed to be getting more quiet until I could hear nothing on the telephone, when she came back on her voice was lower pitch and she and my friend both wer laughing at me. Not like it was funny, but more like 'do you realize what is happening to you?, we don't think you do.' They were saying that I should not have come around 'here' again, and that I had been warned by my 'friend' more than once about this. I quickly realized that what ever was happening seemed to be very, very real. My friend was saying things to me that he could not have known. Things I have never told any person, ever. It was like he knew 'everything' about me, and everyone else for that matter. My friend could also controll/turn on and off. The tv, telephone line, and stereo tuner reception. while sitting accross from me with both hands in plain view on the arm rests of the chair he was stting in. We were alone in the house. He had a $20.00 bill that he was 'stretching' like rubber! While he said to me, this is pretty stretchy stuff huh? he handed me the bill and it seemed to be just a paper 20 dollar bill, until I stretched it too! Other objects also took on strange and sometimes threatening appearances. Things seemed to have a clorfull slime covering random things.</p><p>Some people came by and their faces had patches of color in strange patterns on them. They also scared me. I thought that I had passed away but was still animate in a spiritual sence because I could no longer feel my body. My friend kept saying, have some water and lay down. I was afraid that if I layed down I would go somewhere else. Somewhere people went after they died. This experience seems to have more to do with the LSD making the marijuana have a much more intense effect. Infact, in such a way that it was almost as if the combination created a whole new type experience that is unattainable when both drugs are being used seperately. Also, on two other occasions I encountered other friends who's facial structure resemdeled in no way each others', until we were both  on this lsd/marijuana mix. They had that 'stretched' area between the bottom of the nose bridge and the lower baginning of where their eyes become visible on their face. This is the best way I can describe it. Much of what else happens while I had been around these particular people under this checmical combination seems to have been forgotten. I have taken the lsd with no marijuana and everything was fine, even while driving at night with another friend who was tripping, and then towards the end of the trip, after smoking some marijuana, my tripping friend seems to take on the same appearance as the above mentioned with a strange shaddow pattern all over his face, like that chrome flat metal on steel sidewalk covers, alternating embossed thick rectangular lines arranged in a grid cris cross pattern. Without sounding like a loon, it seems that these particular people while we are both on the lsd/marijuana combo, and are in the company of no others, (alone) become inhabited with some kind of what I would call 'bad, or malicious spirits' The drug combonation would not only suggest that this 'preception' came merely from the drug, but also from the fact that the other person was under this same checmical influence. It almost seems like some kind of psychic radio antenna inside us both brings us to a place where things are very alternate to what they are in normal consiousness. Things and people are all only negative, and no optimism exsists in this place. The remarkable thing about all this is that the other person seems to be almost completely unaware both durring, and certainly after these events have occured. Deniying that anything like the such had ever happened. Some were even aggresively defensive, or acted like I was crazy when I tried to explain to them what had happened, and what exactly I had seen, and experienced. These were a set of lsd experiences I had up until about 1989. Since then I have only experienced very blissfull trips in which I feel very safe, calm, and have much controll over the visuals. I feel very 'hindu-like' when I have these trips. I would call my last trips, 'beautiful' I'm not sure what was happening before with those other trips, but they were something that I would not wish on anyone.</p>"
}
