{
 "title": "Bleeding, a Sign to Move",
 "author": "Moe",
 "citation": "   Moe. \"Bleeding, a Sign to Move: experience with Methamphetamine (ID 13881)\". Erowid.org. May 22, 2007. erowid.org/exp/13881",
 "substance": "Methamphetamine",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 13881",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 22, 2007",
   "Views: 4220",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is of the first time and the last time I did speed, I was respectivly 14 and 17 years old. The first time I was about to jump in front of a bus. A guy jumped out to save me, as we walked down the street, he asked me if I wanted to get some meth, I said I'd never tried it, he smiled. We got the meth and smoked it in a garage we broke into. For twelve hours we engorssed ourselves in the most amazing conversation. All I could think of was how much I fucking loved this drug, as I played piano on my leg, as he told his entire life story. I spun around in circles, never getting dizzy, never getting enough of this magnificent high. All I wanted was more and more tweak. </p><p>I realized then that suicide was not the answer, as cliche as this is, there had to be good times for there to be bad. I saw pinwheels in the sky, the clouds were like giant lolly pops. My leg started bleeding out of now where, but who cared, it was my soul bleeding out into the world, I have to bleed before I die anyway don't I? There were about twelve hours like that, I couldn't eat, but I didn't care. The cramps were the bad that had to happen for me to have such a good high. I lived with this philosophy for almost four years. </p><p>The last time I tweaked. I was 17 years old, living with the guy who saved me, times had changed, but the bad had to be there for there to be good, selling belongings and drugs over food was the bad part of a damn good high. There was this little girl, 13 and her boyfriend. Their first time trying speed. At that point in my life I noticed facial expressions, like Americans notice high speed chases. They thought they were so cool, trying to speed, they tried to impess us so much. With them was their older friend, a homeless scavenger who died a long time ago. It was my normal high, it didn't feel like much, but the adrenaline of knowing that I was going to get more tweak. That was unexplainable, it was amazing, to this day I have found nothing like it.</p><p>My friend and I went outside to hang out, to go walking. We went running around like the hyper border line skitzo's who hadn't slept in weeks that we were. Watching car chases that LCD type watche numbers turned into, watching shadow people dance in behind trash cans and play pica boo. We went back inside. The speed was gone. Where was it? The little girl claimed she dropped it. I skavenged the carpet, but no little crystals were to be found. I knew dead guy had taken it. I was pissed and so was my friend. A fight began outside. My friend beat the pulp out of the dead guy. Blood laid on the white picket fence.</p><p>I realized, my dream of happy life with a picket fence, it was bleeding for no reason, just like I was that first time I tweaked, because it was alive. The little girl and her boyfriend helped take the dead guy away. I went into the bathroom to get a wet rag. The bathroom smelt like death, I looked in the mirror, I tried to find myself in the face looking back at me, was I dead too? My friend and I went for a walk, a plastic bag was stuck in a tree, just like with American beauty, but my plastic bag was stuck it didn't fly free. I was stuck, and I knew it. I wouldn't let the bag go and every time my friend tried to I wouldn't let him, why should the bag go if I can't?</p><p>We went back to the house, and tried to sleep. I could only think of speed trips from the past, how great they were and why this one was so bad. After three hours of visuals, the smell of death, and the sound of my heart trumpeting, I went outside and I watched the sun rise. There was an alagator in the sky, the world had died and been reborn. I haven't gotten high on meth since. I didn't need Jesus, I didn't need rehab, I don't hate drugs, I just had to remember that I'm alive and sometimes we get stuck, and that is when the fun is gone and it's time to move on.</p>"
}
