{
 "title": "Seemingly Non-Toxic, but Potent Deleriogen",
 "author": "3MX",
 "citation": "   3MX. \"Seemingly Non-Toxic, but Potent Deleriogen: experience with Amanita muscaria (ID 13888)\". Erowid.org. Apr 15, 2002. erowid.org/exp/13888",
 "substance": "Amanita muscaria",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "9.0 g",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13888",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 15, 2002",
   "Views: 84657",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFirst off, I apologize for not being able to provide a detailed, step-by-step, timed account of my experience, as my memory of the time is hazy and the many notes I scribbled on little post-its are quite unintelligible, testimony to fly agaric's mind-scrambling power.</p><p>FYI, I've had experience with caffeine, alcohol, MJ, ephedrine, yohimbine, kava, valerian, wormwood, tobacco, DXM, salvia, and blue lotus. Amanita was unlike any of the above, though I noticed limited similarities w/ DXM and ephedrine; in fact, this shroom gave me the most powerful experience yet!</p><p>The amanita was dried, A-grade from WA state, ordered from a web-based seller. I consumed a bright red-skinned, bread-plate sized cap and a few smaller fragments, which I estimated to be 8 to 10 grams out of the 14g package; I ate no stems. The shroom was easy to take down, as it tasted like chicken, was soft, and [surprisingly] produced no physical discomfort whatsoever (I wish it did, so I wouldn't have eaten so much :-P). [NOTE: if you eat amanita and feel no discomfort or initial effects, resist the urge to eat more! People aren't kidding when they tell you to start small!]</p><p>I ate the amanita around 12:30 PM in my college dorm, having finished the day's classes, feeling 'ok' besides having minor drainage due to a receding cold, and under the influence of caffeine and nicotine alone. I had eaten a small meal around 10:30 AM. The first, brief* (see below) phase of effects began between 1:00-1:30, abruptly changed thereafter and gradually strengthened until it peaked around 4:45, then plateaued until around 6:15, gradually fading-out thereafter. I was sensible enough to leave the dorm at 8:00 to eat with friends, though mild after-effects [weird-head feeling] were still around when I got to bed at ~1:00 AM. [NOTE: do not eat amanita if you have responsibilities to attend to, which I didn't]</p><p>(Effects below in rough, chronological order of appearance)</p><p>PHASE ONE: </p><p>*persistent after-images, such as those created by staring at the computer screen and quickly looking away.</p><p>*active, noticeable hypnagogia (I see these naturally, high 'activity' is a sign of sedative or hallucinogen presence for me)</p><p>*stared-at objects seemed to shift around slightly</p><p>*pronounced sedation, which made me attempt to take a nap</p><p>*ceiling seemed to shift up slowly, then down slowly (double-image over actual) as I stared at it</p><p>PHASE TWO:</p><p>*pronounced wakefulness, stimulation (this foiled my attempt to nap w/in 10 minutes of lying down)</p><p>*basic, fever-class delirium (irrational thought which I recognized as being wrong, which I kept thinking anyways)</p><p>*powerful, full-body analgesia. I felt almost no pain, some nerve-desensitization. This property makes me buy the berserker-amanita theory. I walked about VERY carefully.</p><p>*racing, 'pulsing-fragmentary' mental process. My mind seemed to have sped up greatly, going in series of three rapid and repeating 'pulses,' split-second appearances of geometric, nonsense images in my 'mind's eye' that were not actually seen; each pulse was accompanied by an undiscribeable change in head-feeling.</p><p>*delirium like never before, which gave me the impression that I had 'two minds,' a delerious one and a sane one, which tried to push-around the delerious one in order to be productive and keep a cool demeanor (my 'inner sitter'). I managed to confine myself to the dorm, bathroom, and a friend's room, though I almost walked into the wrong rooms twice.</p><p>*lack of attention-span and inability to write coherently. Talking was easy, though I was occasionally at loss for words and I had difficulty relating ideas to words around the peak. Most basic activities required concentration.</p><p>*3-pulse 'inner beat' shortened to slower 2-pulse scheme. former images replaced by a field of hypnagogic 'swirlies' that shifted from swirling left to right, then back, with each pulse (~1 second). </p><p>*exceptionally good physical state, w/o feelings of hunger, thirst, fatigue, nausea, aching, or congestion. I did not notice pronounced salivation or perspiration. I drank water frequently out of precaution. 'bathroom' stimuli muffled, though apparent and answered with a BR trip consistently. [body good, mind icky]</p><p>*some emotional 'distancing'/'disassociation', feeling of being 'out there.' However, I still retained some humor and could socialize fine. Watching a friend play computer games kept my attention occupied for awhile. Lack of engaging, external stimuli in my dorm led to periods of boredom during which 4 minutes seemed like 20.</p><p>LAST ENTHUSIASTIC THOUGHT: 'this is what DXM should be!'</p><p>PEAK AND DECLINE:</p><p>*feeling that world was spinning vertically; did not make me dizzy or nausous.</p><p>*marked speed-up of 2-step 'inner beats'</p><p>*feeling of pulsing, inner-energy (no tachyardia)</p><p>*increased mental-skill debilitation (as above)</p><p>*strong delirium persisted, though distinct, nutty thoughts not evident (as they were for a couple hours prior). Briefly 'vegatized' me to the point of dumbly staring at the computer screen and doing nothing.</p><p>*pronounced introspection of the petty sort (noting how nutty I was and prodding myself to do something)</p><p>*continual desire for experience to end</p><p>*gradual return of attention-span, writing ability</p><p>*gradual decline of body-effects; pain/fatigue back</p><p>*quick disappearance of delerial images</p><p>*gradual return to normal mind-set, head-feeling.</p><p>*slept ok, felt 'ordinary' the next day</p><p>In summary, I underestimated the shroom's potency and got a weird, mildly-disturbing trip of the type I'll try to avoid in the future. Thankfully, the bodily ills that afflict many agaric-eaters did not affect me. I plan to smoke agaric in the future, and maybe eat smaller quantities. Tales of this shroom being deadly are horsesh*t, but it must be treated with utmost respect. </p>"
}
