{
 "title": "The Night I Fell Off The Toilet",
 "author": "Britton",
 "citation": "   Britton. \"The Night I Fell Off The Toilet: experience with Hydrocodone (with Acetaminophen) (ID 13897)\". Erowid.org. Mar 21, 2005. erowid.org/exp/13897",
 "substance": "Hydrocodone (with Acetaminophen)",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   " ",
   "650 mg",
   "oral",
   "Acetaminophen",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 13897",
   "Female",
   " ",
   "Not Given",
   "Mar 21, 2005",
   "Views: 70119",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>When dealing with a new drug, regardless of how tolerant they believe themselves to be, (due to weight, height, age, sex) some people are at a relatively high risk of overestimation and, subsequently, having a really shitty experience. I fell off the toilet.  No, really...I did. And while I was down there on the cold, slimy, trodden path-du-pottie, I began to think that the whole thing was something of a metaphor. But then again, I was doped off my ass, so you tell me.</p><p>The manner in which I came into possession of a handful of Hydrocodone tablets is not so much the issue as that I HAD THEM.  And I was going to take them. As many as I could, in fact, without killing myself. (Brainiac that I be...) </p><p>At exactly 10:43pm on a wednesday evening, I loaded my eager little palm with two 10 milligram tablets of Hydrocodone Bitartrate...better known to her friends and family as 'Vicodin' [10mg/325mg, Hydrocodone/Acetaminophen, respectively]... and set off on a pharmaceutical journey through the nether regions of Hell. </p><p>At 10:57 I was feeling a slow, creeping relaxation. A curious expression for the sensation, considering that it was very much THERE and very much THERE TO STAY and, moreover, was sort of unapologetic about all this. Not a very relaxed relaxation. But there it was, spreading through my blood. I decided to enjoy this as a perk of the drug. I've heard many do the same. </p><p>At 11:15 I was giggly and off-kilter. I was having moderate difficulty controlling the direction of my walk and I attributed this, perhaps not so shockingly, to the fact that MY MUSCLES WERE BEING TRANSFORMED INTO A SHIVERING MASS OF GELATIN. </p><p>Oh. I forgot to mention: I work the graveyard shift at a publishing company as a digital imaging specialist...and I was due at the time-clock in approximately five minutes. I judged it would take me that long to get there, so I started *walking*.  </p><p>By 11:45 I was reeling from several effects of the drug in question. To list: nausea, headache, confusion, drowsiness, and difficulty maintaining focus. The last not being a particularly praised attribute for one such as myself to have in this career field. However, the worst was the nausea. I'd heard that the drug made some sick to their stomachs, but I reasoned that if I didn't eat anything (haha! Another genius move!) I'd be perfectly fine. I also figured that someone of my stature, physically, could hold up to any frou-frou pharmaceutical that was out there. See all this reasoning, figuring, guessing, speculating, well-perhaps-just-maybe-ing?  This is dangerous. This is where I caution those of you who have not experienced Hydrocodone, other opioids, or any drug for that matter.  Don't hunk around with your own screwed up logic in this category. It's not safe, and besides, bad trips suck and some are bound to have one if they do all the estimating and none of the research. </p><p>So...after spending about four hours trying to sluck my way through digital jobs, I FIGURED I'd better try to vomit whatever was in my stomach that was making me sick. Stuff stays around inside you for just about ever and you can pretty much always throw up SOMETHING if you try hard enough.  Not that I'm advocating this...Anyway, on the way to the bathroom (this took a century, mind you) I forgot why I was GOING to the bathroom and when I got there, I FIGURED I was there to pee. So I sat down on the toilet, propped my druggie head in my hands and urinated to the tune of 'ohhhhhhhh jeeeeesus heeeeelp meeeeee'.  Well, about halfway into the first chorus, I had the sensation of falling forward...</p><p>When I hit the floor, panties in a knot at my ankles, forehead soaking in the putrid microscopic life of a community shit-house floor, hair stuck to all sorts of interesting places that were not my head...I thought deeply to myself, 'This is deep.' I fell off the toilet of careless drug use...I toppled onto the icy speckled tile of reality...I became ONE with the nature of opiates. And the scraps of bathroom tissue that didn't make it to the toilet, either.</p><p>After I vomited up the remnants of a few skittles and a sip of cherry coke, I felt INTENSELY better...though still very confused and disoriented. The nausea began to pass quickly after the retch-sesh and I was able to duh-duh-duh my way to my desk and finish the goddamned folder I had been working on for, like, two million years. However, all throughout the experience, (and culminating somewhere in the middle, say, four o'clock a.m.) I was extremely slow moving and felt disconnected from the entire world outside my own flesh. At one point I was aware that I had lost all ability to perform the simplest of tasks in my particular job, (pressing a button on the keyboard) and was both exceedingly amused and rather horrified, (and also totally disregarding) at this fact. That's the beauty of opiates: I'm afloat in a toilet-bowl sea of tossing emotions.  Okay. I believe the metaphor has, in fact, ended. But you understand. Or maybe you don't. Either way, opiates screw with my whole mindset in relation to the world. I'm like, 'Oooh eggo waffles!' and simultaneously 'Eggo fucking waffles?' and then 'Eh. Waffle-shmaffle'. You know?  You KNOW??? </p><p>If you're going to do what I did, make sure you don't do what I did. For many reasons.  The least of which being that bathroom floors are gross and the most of which being that life is exceptionally pleasant sometimes and you might like to stick around and enjoy it from standing-height. -thank you and happy tripping!</p>"
}
