{
 "title": "very mild smoke",
 "author": "disposition8",
 "citation": "   disposition8. \"very mild smoke: experience with Blue Lotus (ID 13917)\". Erowid.org. Apr 15, 2002. erowid.org/exp/13917",
 "substance": "Blue Lotus",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13917",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 15, 2002",
   "Views: 34419",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\ni decided to try out dried lotus flower that i had bought a while ago. i had bought it on a whim and decided to try it one night when i was extremely bored. \r\nI ended up smoking it through out the night and found that while mild it was extremely relaxing ( the exact reason that people drink the tea). similiar in a way to marijuana but absolutely no body load. while nothing special it can be nice on a lazy sunday when you have nothing to do and just feel like sitting around reading or watching television. I've had no problems accomplishing things after smoking but there is a definite preference for not moving. \r\nmentally speaking i found that smaller things that were bothering me seemed very unimportant, major problems were still present but not as dominant as before smoking. there were no bursts of creativity, no real inspiration to write or express myself in any other fashion. if anything i felt more withdrawn from the world, not in an anti social way but quiet.\r\nas a side note i also tried smoking it after drinking for a bit and it coincides well with alcohol. at the very least it seemed to intensify how drunk i was, and also prolong how long it took me to sober up. \r\nover all an interesting experiment, and definitly worth giving a try if your looking for something to relax you a bit. don't expect any miracles though.\n\n\n"
}
