{
 "title": "Kava Bar",
 "author": "Kathy",
 "citation": "   Kathy. \"Kava Bar: experience with kava (ID 13960)\". Erowid.org. Apr 15, 2002. erowid.org/exp/13960",
 "substance": "kava",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3 shots",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 13960",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 15, 2002",
   "Views: 23951",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n      A couple of my friends had been talking about this drink made with the roots of some plant that gets you a relaxed chillin high.  Well it just so happens that about 20 minutes from where i live is the only kava bar in north america, and since its all ages me and a couple friends drove down there just to try something new.  We get to the place (called nakamal) and the whole bar has thing like zulu tribe voodooish vibe to it.  The one guy workin there explains to us what it is (a root made from some plant) what it does and that is is completely safe unless mixed with alcohol or anti depressants.  He elaborated by telling us a story about how a girl had mixed xanex (bars) and kava and ended up in the hospital with a 107 degree temperature. He also told us that since our bodies weren't used to it to have at the most 3 shots of it your first time.  There were little cups of candy laid out all across the bar and he told us to open one up and have it prepared for after we drink the kava because it wouldnt taste good.  I have a very high tolerance so i decided to order three shots and my friend ordered one, they were about 3.50$ a shot and the candy was free :o).  Then we quickly downed the first shot and popped the candy in our mouth.  Damn that stuff tasted god awful, it was like skim milk mixed with dirt and sand.  After i had taken my last two shots i asked the bartender how long it would take to kick in and he said about ten minutes.  We left and began making our way home when my friend (who was driving) said she felt the effects and that it made her feel very relaxed and comfortable. I, on the other hand, felt nothing.  I waited and waited to feel something but never did.  Maybe its just me because the other people i know that have tried this have said good things about it so i guess it varies greatly from person to person.  I would go back and try a higher dosage but most likely that would just be another waste of money.\n\n\n"
}
