{
 "title": "First Use of San Pedro a Mild Success",
 "author": "Torque",
 "citation": "   Torque. \"First Use of San Pedro a Mild Success: experience with San Pedro & Cannabis (ID 14135)\". Erowid.org. May 1, 2002. erowid.org/exp/14135",
 "substance": "San Pedro & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "13 in",
   "oral",
   "Cacti",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14135",
   "Male",
   " ",
   "Not Given",
   "May 1, 2002",
   "16388",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLast night I had my first rendevuez with San Pedro.  The results were a bit dissapointing, considering that a good amount of anticipation had settled upon me during the hours it took to prepare the drug for ingestion.  Surely, I thought, by following the shaman's procedure described on this site (which involves boiling sliced cactus pieces, then drinking the resulting 'tea' and consuming the remaining plant matter), the 13 inches of cactus which I used would provide a wonderful trip.  However, the experience was mild at best, at least when compared to the shroom trips with which I am very familiar.</p><p>Perhaps most surprising was the length of time that it took for the effects of the mescaline to set in.  Besides having not eaten for several hours before consuming the cactus, I had abstained from meat products for two days.  Nevertheless, it was a full two and a half hours before I felt anything which I would term psychedelic.  This is not to say that there were no effects before that; the slightly 'off-kelter' feeling associated with such chemicals was present at 30 minutes, but then receeded for the next couple of hours.</p><p>At around T+2:15 there was a slight loss of motor control and colors became somewhat more pronounced.  Shortly afterwards, some friends and I smoked a very large bowl of weed out of their shisha.  The synergistic effects of the two drugs intensified my trip quite a bit, so that the world became distorted and very pleasant.  There was a strong sense of euphoria.</p><p>I felt an extreme urge to be in a natural setting, and succeeded in dragging two of my friends to a very nice park near our home, where we sat under a wooden bridge and smoked a large joint (almost a blunt).  It was well into the night at this point, and the environment of the quiet bosque was beyond soothing.  I say 'quiet,' meaning that there were few sounds emanating from man-made devices, but in fact it was not silent at all, for the crickets and frogs and trees swaying in the breeze created a prominent and beautiful lullaby.  We awed at the complexity and duality of existence, discussed the infinite nature of God and the universe, and otherwise contemplated the larger questions in life.  That was undoubtedly the highlight of my trip.</p><p>While the cactus gave me nothing remotely as strong as a shroom trip, it was still exceedingly pleasant, producing a definite 'body high.'  My suggestion to anyone doing San Pedro would be to include a few smoke sessions in your plans.  Weed worked very well in conjunction with the mescaline, so much so that I believe the trip would have been an almost complete failure without it.</p><p>One more thing: While coming down from both the cactus and the mary jane, I was able to achieve an unusually deep meditative state.  Inner travel is highly recommended both before and after the main portion of the trip.</p>"
}
