{
 "title": "Stupidity When Driving",
 "author": "R",
 "citation": "   R. \"Stupidity When Driving: experience with Alcohol, Cannabis & Police (ID 14149)\". Erowid.org. Mar 29, 2007. erowid.org/exp/14149",
 "substance": "Alcohol, Cannabis & Police",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "8 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "6 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 14149",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 29, 2007",
   "Views: 8078",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI don't like to type much, so I'll keep it brief. I'm 17 years old and like most 17 year olds I thought I was invinsible. I 'had' a 1996 candy apple red CAMARO w/ground effects loaded w/ power, t-tops, and 18inch lexonis-worth-$13,000. Bought by mommy & daddy. I loved this car but I drove stoned and drunk just about everyday and it was only a matter of time until something like this happened.\r[Erowid Note: Driving while intoxicated is dangerous and irresponsible because it endangers other people. Don't do it!]\r\nMy friend and I were fishing in the afternoon one day and when we fish we'd get sloshed. I drank about 8 beers in 2hrs. This day we didn't shit except for a buzz. On the back to my friends brothers house being the crazy asshole he is asked me to stop at a bar-he goes in and comes out 2min later w/ a bottle of 100 proof beefeater Gin. He said he snuck it off the bar when the bartender turned around. We go to his brothers and the 3 of us finish the bottle in an hour. By now I've drank, including beer around 14-17 drinks in 4hrs-I was beligerent, couldn't talk but I could walk so I thought I could still drive - I've drove buzzed on alcohol and weed 100's of times and never was stopped by Tampa cops even in a fire red CAMARO.\r\nAgainst my better judgement I drove to a convenience store about 5 miles from my house. My friend was going to 'grab' a 20-pack and flex. This was not normal we needed it for a party on 4/20/02-and we were broke as a jokes with no hopes. So I parked on the side and he comes running out as planned no clerks chasing him and gets in the car. BUT there was friends of the clerk in the parking lot in a 2002 CAMRY that decided to be good samaritains. They ran up to my car and started kicking and banging on it my license plate was covered so I figured I'd blow these assholes away. Later I found out a 2002 camry has almost the horsepower as my car. I stepped on it damn near ran one of them down and I was off.\r\nFor short I ran a couple red lights (stopped first) until I was on a long subdivison road I thought this is my chance I pinned the in 4th gear and was going 120mph in a 35mph zone when I came to 90 degree right turn it came up on me so fast I hardly had time to hit the brakes I slammed on the ABS system and hoped to fish tail slide the corner-the momentum was to great at some 75 mph and the car continued straight into a median and then into oncoming traffic which I thank god to this day was stopped at a red light. I plowed an innocent 41 year old woman at 50mph in the left rear quarter panel of her car. I realized I was waisted and was going to get a DUI.\r\nSo with every disregard for human life possible I took off because my plate was still coveredback across the cement/grass median keep in mind my car is 3.6 inches off the ground and so is everything underneath. I was driving STRAIGHT down the road and my steering wheel was cocked 90 degrees to the right, when waisted can be confusing. The camry was still cahasing me from the beer run so I once again tried to outrun them but now it was hopeless because I couldn't steer. I still was running 105mph with all the damage. Anyway I made it to the front entrance of my subdivision where patrol was sitting w/ his lights off---I saw him from a mile away and I knew I was fucked.\r\nHe pulled me over and arrested me and my friend for petty theft, poss. of marijuana, poss. of alcohol, leaving scene of accident, careless driving, refusal to subit to a breath test, poss. of a pipe, I'm luck I didn't get reckless endangerment. Before this happened I had never had a ticket a never really went more than 10mph over the limit. I thank god everyday that I didn't hurt or kill anybody because I could'nt live w/ myself. This story how alcohol when takin in large amounts clouds judgement beyond reason and logical thinking. So monitor your buzz. When I didn't, shit I never thought I'd do, I did.\r\nI hope this story will serve as a reminder that drinking and driving is one of the most selfish things you can do. As of now no license for 1 year, 500 hours community service, 3 years probation W/ piss tests. I got off easy because I had no prior record - they said if I would of injured someone I'd be doing hard time. Oh yeah not one company in florida will insure me. I'm gonna walk to the store now, remember what I said it might save your life.\n\n\n"
}
