{
 "title": "Mushroom Heaven",
 "author": "Chodo",
 "citation": "   Chodo. \"Mushroom Heaven: experience with Mushrooms (ID 1414)\". Erowid.org. Feb 12, 2001. erowid.org/exp/1414",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2000",
   "1414",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 12, 2001",
   "8573",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was at one of my best friend's houses and his parents were gone for the weekend.  It was the first time we had decided to do shrooms during the day.  What a fantastic idea.</p><p>Anyway, my friend and I had just shy of an eighth each.  We munched 'em down and chilled, as the typical body buzz began to creep.  About 20 minutes into the trip, I started to get intense visuals which mostly consisted of melting.  This was the first time that I had gotten melting visuals, so I stared at all the wonderful oddities in my friend's house in pure awe and amazement.  After about an hour of colors shooting out of paintings, wrinkles in leather couches undulating, and mounted fish coming alive, I began to hit my peak.</p><p>At this point, things were getting so intense, I couldn't even get a hold of myself.  Every time I looked at anyone, or my own hands and arms, the normal skin seemed to be covered with a strange membrane (kind of like a baby mouse type skin).  I could barely keep my eyes open the entire time, for everything was completely out of whack, and I couldn't make the visuals cease.  They just kept getting stronger and stronger.  My friend's kitchen floor is made up of concentric octagonal tiles and as I walked through the kitchen, each tile would be of a different height as they shot up from the ground like pillars.  I laid down back in the TV room on the carpet, with the side of my face on the ground and watched the fingers of the carpet grow as they waved like the stalks in a wheat field.  Slowly, a white smoke, like that from dry ice, floated over the carpet enveloping everything, including me.  It was kind of hard to handle such an intense feeling of...I don't even know, maybe falling too far into a trip, so I went outside.</p><p>It was the most beautiful day.  The sky was clear with scattered lines of clouds.  I sat in a lawn chair mesmerized by the foliage and sky as I drifted into a visually tantalizing trance.  My friend called my name and as I looked at him, his face had small silver BBs in each corner (the tear glands of his eyes, corners of his mouth, around his nostrils, etc.)  Soon enough, his entire head was made completely of sliver, shiny BBs, and I basically sat there speechless, not knowing what the hell was going on.</p><p>The rest of the day was awesome.  I didn't explain much of my experience of being outside, but I most urgently suggest that y'all try shroomin' during a nice, warm day in the summer.  Boomin' at night and during the day seem to me as two totally different things.  Anyway, nice boomin', keep it real, peaceout.</p>"
}
