{
 "title": "Intense is an Understatement",
 "author": "Revolt666",
 "citation": "   Revolt666. \"Intense is an Understatement: experience with Melatonin, Valerian & Vitamin B-6 (ID 14164)\". Erowid.org. Apr 18, 2006. erowid.org/exp/14164",
 "substance": "Melatonin, Valerian & Vitamin B-6",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Melatonin",
   " ",
   "  ",
   "oral",
   "Valerian",
   " ",
   "  ",
   "oral",
   "Vitamin B-6"
  ]
 ],
 "footer": [
  [
   "2002",
   "14164",
   "Male",
   " ",
   "Not Given",
   "Apr 18, 2006",
   "14338",
   " "
  ]
 ],
 "report": "<p>I occasionally have a major insomnia problem. I tossed and turned for 2 hours, until I got pissed. I remembered some combinatrion off of this section for getting some sleep. </p><p>T+0: 12:35 AM Attempted to sleep</p><p>T+0: 2:30 AM Got pissed and decided to take justice in my own hands.</p><p>T+1: 3:30 AM As soon as I hit the pillow, I was in between wake and dreaming yet aware. The body buzz was comparible to a high dose of heroin...I kept reaching semi-awake with all of the laughter I found from within. I was laughing my ass off in a hypnogagic state and had no control over it. I was too nodded out.</p><p>T+2: 5:30 AM After floating in this nexxus for 2 hours I finally reached a dreaming state...for the last thing my REAL eyes saw was the time. </p><p>My dreams were so vivid I Cannot believe they were only dreams. I traveled a lot. All 6 senses were intact. I could predict what people were thinking. In one instance I was in an orgy with two females that had colored hair. As soon as we were finished I felt a bigger presence. I saw a shadow from behind us, and turned around. A very tall man with a weird high-tech outfit who claimed to be the devil commanded me to leave. I told him to go to hell, and he said this wAS hell. I laughed as he made flies cover me. Next he grew in size and was almost transparent in the scenery like he was superimposed. The whole realm blew up as I awoke.</p>"
}
