{
 "title": "Dusting Off",
 "author": "IowaPunker",
 "citation": "   IowaPunker. \"Dusting Off: experience with Inhalants (Duster) (ID 14167)\". Erowid.org. Apr 16, 2007. erowid.org/exp/14167",
 "substance": "Inhalants (Duster)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "0.25 ",
   "inhaled",
   "Inhalants"
  ]
 ],
 "footer": [
  [
   "1997",
   "ID: 14167",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 16, 2007",
   "Views: 7770",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] </p><p>Inhaling toxic gases/substances to get high falls right into the category with overdosing on OTC drugs (such as Dramamine)--stupid. But I will admit I did have some fun with it back in my naive days. When I tried Duster I had no idea about the dangers of huffing. This was over five years ago.</p><p>3:00 P.M. Driving around town smoking a bowl and my friend 'B' suggests that we go to the store and buy a can of Duster. I had no idea what Duster was but I was about to learn.</p><p>3:30 P.M. He comes out of the store as we wait in the parking lot and produces a tall, yellow can that just simply says 'Duster' on it. I remember laughing at how generic it looked.</p><p>3:40 P.M. 'B' huffs first. He takes two huge breaths, holds them, then exhales. When he talks it sound really deep and muffled, like the way Charlie Brown's teacher talks. We laugh hysterically for a good ten minutes.</p><p>3:50 P.M. The can comes to me. 'B' suggests that I take two deep, long breaths. I do just that. My voice gets all weird too and now everyone's laughing at me. At first I think, 'Is this it? What a waste.' Then a huge, almost overpowering headrush engulfs me. The world spins for a good ten seconds, colors become very bright and intense, and everyone's voices have an echo. I almost feel nauseous, because I've never huffed before. But then I learn to like the feeling and do some more.</p><p>We huff for about two hours straight, between four of us, till the can is gone. When the can was all gone, I remember thinking thank god, because I had a terrible headache and it left a taste in my mouth like I had been sucking on a propane torch. Yuck.</p><p>Huffing can be fun, but if you've got half a brain, you'll grow out of it. Some unlucky individuals never catch on, and by the time they do finally stop huffing, they've already lost half of their brain power. What a waste.</p><p>Stick to beer and cigarettes.</p>"
}
