{
 "title": "Intense is an Understatement",
 "author": "Revolt666",
 "citation": "   Revolt666. \"Intense is an Understatement: experience with Melatonin, Valerian Root, Vitamin B-6 (ID 14163)\". Erowid.org. Apr 23, 2002. erowid.org/exp/14163",
 "substance": "Melatonin, Valerian Root, Vitamin B-6",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "600 ug",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "1.0 g",
   "oral",
   "Valerian",
   "(roots)",
   " ",
   "500 mg",
   "oral",
   "Vitamin B-6",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14163",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2002",
   "Views: 65685",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[Erowid Note: The author of this report stated that they took '600mg Melatonin', which we have changed to 600 micrograms.  600 milligrams would be around 200 high dose pills.  Some preparations of melatonin have been sold with 200 or 300 micrograms, so we have made the assumption that the 'mg' meant micro- instead of the standard milli-gram. It is possible the author is describing taking an enormous quantity of melatonin (more than 100 times a normal dose), but fails to say this explicitly.]</p><p>I occasionally have a major insomnia problem. I tossed and turned for 2 hours, until I got pissed. I remembered some combination off of this section for getting some sleep. </p><p>T+0: 12:35 AM Attempted to sleep</p><p>T+0: 2:30 AM Got pissed and decided to take justice in my own hands.</p><p>T+1: 3:30 AM As soon as I hit the pillow, I was in between wake and dreaming yet aware. The body buzz was comparible to a high dose of heroin... I kept reaching semi-awake with all of the laughter I found from within. I was laughing my ass off in a hypnogagic state and had no control over it. I was too nodded out.</p><p>T+2: 5:30 AM After floating in this nexxus for 2 hours I finally reached a dreaming state...for the last thing my REAL eyes saw was the time. </p><p>My dreams were so vivid I Cannot believe they were only dreams. I traveled a lot. All 6 senses were intact. I could predict what people were thinking. In one instance I was in an orgy with two females that had colored hair. As soon as we were finished I felt a bigger presence. I saw a shadow from behind us, and turned around. A very tall man with a weird high-tech outfit who claimed to be the devil commanded me to leave. I told him to go to hell, and he said this wAS hell. I laughed as he made flies cover me. Next he grew in size and was almost transparent in the scenery like he was superimposed. The whole realm blew up as I awoke.</p>"
}
