{
 "title": "Work and Play",
 "author": "D. Darko",
 "citation": "   D. Darko. \"Work and Play: experience with Mushrooms - P. cubensis & Cannabis (ID 14170)\". Erowid.org. Jun 23, 2007. erowid.org/exp/14170",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 6:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 14170",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 23, 2007",
   "Views: 6602",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n It was a perfect spring day during my sophomore year of college. Perfect for mushrooms. It was me, Jimbo, and Sideburns. We had 3.5 grams each and a master plan. Jimbo would drive me to drop off my term paper at 4:00. We'd feast on our mushrooms at 5:00. Then we'd go shopping for pipes until it was time for me to unlock the microphones for the film festival by 6:00. No problem. <br>First let me explain that I was a projectionist at a major university. Their annual film festival was starting that night and it was my job to unlock the microphones for the pre-movie announcements. The people that put on the festival had their own projectionists, so I figured I'd be in and out in five minutes. I figured wrong. I was on my way out when I was cornered by my boss. I didn't see him very often, and he was somewhat scary even when I was sober. He kind of reminded me of a troll. Short, round, and gruff. <br>'How's it going?' I asked.<br>'Quite a turnout so far.' he responded.<br>'So I come back at 10:00 to lock up, right?' I asked.<br>He looked puzzled.<br>'I'm here just to unlock the microphones. Right?' My voice was a little strained. <br>'No, you're working the short films.'<br>My stomach felt like it was sinking. My mind was racing. I told him I had plans. I begged him to let me leave. There were no bargains with the troll. I went outside to explain the situation to my friends. They looked at me with concern, then they laughed. They tried to convince me to just get in the car and go, but I knew I'd get fired. I needed my job, but how badly? I was faced with a most difficult decision.<br>A. Leave now, get fired, have fun. Live for the moment!<br>B. Stay, ride out the storm, keep job. Be responsible for once!<br>My friends wished me luck as I headed out of the beautiful sunlight and into the dank dungeon that would be my home for the next four hours. I was just starting to get visuals when I was approached by the festival chairperson. She introduced me to my 'assistant' Jason. He was just a volunteer and didn't know anything about projectors and what not. I was a little agitated by this. I didn't want to be stuck in a dark booth with this guy. He was all creepy and nervous-looking. It looked like he was tripping! I tried to make conversation with him so I could get some insight as to what he was all about. It was tough. He was the most sober person I'd ever met. Best not to tell him I'm tripping, I thought to myself.<br>Things were getting more intense as it approached show-time. I got everything set up quickly because I knew I'd be a drooling mess very soon. It was 1 hour since ingestion. The first movie was actually a fun experience. It was some weird animated flick. Couldn't tell you what it was about, as the sound gets very muffled inside the booth, but it was fun as hell to watch. It must of been around the 2nd or 3rd short film when- BOOM! I was hit.<br>My senses became all discombobulated. The motion of the film winding through projector was hypnotizing. It looked like some kind of serpent working its way around and coiling itself back up on the take-up reel. Suddenly, the screen went black. Oh, the movie is over. Better start the other projector. It was kind of hard to find the start knob in the dark, swirling dimension I was in. Upon my success, I breathed a sigh of relief. Everything was cool again. Then suddenly, some weirdo came banging at the projection room door. 'Can you fix the focus?' he asked in a very demanding tone.<br>This was not going to be easy. I was seeing 3 layers of simultaneous moving pictures, none of which were real. Better go to plan B. <br>'Jason, do you think you can do the focus? I left my glasses at home.' I don't even wear glasses. He bought it and became the official focuser for the night. It's a good thing this guy is here after all, I thought. The mushroom gods work in mysterious ways.<br>Things were going fairly well at this point. I was amused by everything around me except the short films. I couldn't really see them and the soundtrack was just a droning noise that my brain eventually decided to take creative liberties with. It would make up words to go with whatever I was looking at. So in turn, the movie on the screen was about things inside the booth. It seemed that the audience was inside my head watching my thoughts on a big screen. What a weird feeling. I continued on this kick for awhile, when I started to see people turning around and looking at me. It was freaky. Then, there was banging at the door. This startled the living crap out of me because I was so tripped out about why these people were looking at me.<br>'Um, hello-o, there's no sound.' It was a different weirdo this time, but his condescending tone of voice made me want to smack the shit out him. Besides, I could still hear the sound. Or could I? We now had crisis on our hands. I stopped the film, turned on the booth light, and sent Jason to go get help. He brought back some tech guy from the festival committee who tripped me out even more. He stuttered when he talked, and his hand mannerisms stuttered at the same time. It was like his brain was skipping and it made him seem very dumb, even though I knew he wasn't. We used our combined powers to figure out the problem and the show went on. <br>The rest of the night was fairly smooth. I would take frequent breaks to go outside and be at one with nature. The air smelled like the sweet, sweet essence of spring and the moon looked like a glowing goddess watching over the flickering, diamond-studded sky. It was unbelievably amazing. Especially in contrast to that dark, stagnant booth.<br>Finally, after what felt like eons, I was done with my shift at the Gulag. I thanked Jason for his help and ran outside. I tore off my shirt, threw my hands in the air, and hollered my victory call. I felt like I had conquered hell, machines, my brain, fear, everything. I was glad that I still had a job. I was excited to see how Sideburns and Jimbo were doing, and I still had some trip left to spend however I wanted. I never felt so free in my entire life. <br>Upon my return to the dorms, I was greeted by my friends as if I'd been gone to war for 20 years and returned victorious. We exchanged about fifty hilarious stories in about five minutes, then we had one of those trip telepathy moments. We all stopped talking, looked at each other and said 'Time to smoke a bowl.' We went to the woods to finish off our trip and tell more stories about that night's events. It turned out that Sideburns was tripping so hard at one point he couldn't figure out what day it was and could barely speak or stand. I guess I was lucky that I maintained even some level of control.<br>Overall, I'm very glad I decided to go to work that day. I wouldn't recommend it to everybody, but the contrast of work (bondage) to play (freedom) all in one trip was invigorating. It was weird sacrificing the moment for my future benefit. It's not something I would normally do on psychedelics. Oh, and my boss thanked me for doing a good job the next Monday. If he only knew.\n\n\n"
}
