{
 "title": "Darvon at its best",
 "author": "XcASt1",
 "citation": "   XcASt1. \"Darvon at its best: experience with Darvon (ID 14206)\". Erowid.org. Jun 23, 2007. erowid.org/exp/14206",
 "substance": "Darvon",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 14206",
   "Male",
   " ",
   "Not Given",
   "Jun 23, 2007",
   "Views: 27276",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have used Darvon many times, the first being the best, so I'll share it with you.</p><p>It was early afternoon, around 1:00, when my older brother asked me if I wanted to take some darvon with him. I didn't know what it was so I was sorta cautious about it. He told me it was a pain killer similar to Vicodin. I, being a very big fan of hydrocodone (vicodin), took his offer on the darvon. There was nothing to drink so I had to build up the saliva to get it down. We decided to go walking around town for a while having enjoyable conversations about psychedelics and where the best place in town to trip would be, so we did some exploring looking for such a place. </p><p>About an hour and a half later we both got hungry and decided to go to the mall to get some food. I noticed that the darvon wasnt hitting me yet and asked him for more. He told me to wait another hour and if nothing happens he would give me another. I agreed to it and we went and bought some pizza. As I was leaving the line to go find a table my stomach started feeling like its was filling up, but I hadn't eaten anything. I told my brother about it and he said it was normal, and that the darvon would take away my appetite, so I quickly tried to get some food in my stomach. I got up to get some napkins, since I forgot them earlier, and right when I reached for them it hit me.</p><p>All of a sudden it was like I was 20 feet tall. I couldn't feel my body anymore, and with every step I took I floated higher and higher. It was one of the most enjoyable feelings I've had on any drug. I sat down at our table and tried to eat my pizza. I noticed that I couldn't concentrate worth shit no matter how hard I wanted to. I wanted to tell my brother how good I was feeling but it was like I forgot how to talk, I couldn't move my mouth. After about an hour of eating my slice of pizza, we decided to go walk, or 'fly' around the mall to see what was new. I felt so good it was unbelievable. Absolutely nothing could've bothered me during my 'flight'.</p><p>At one point I even started moving my arms up and down in a bookstore because it made me float higher each time, and I'm sure I looked like a complete dumbass to someone else, but It was so cool and felt so good that I couldn't resist. Everything was so beautiful. I was at peace with everything in the world, similar to a good acid trip.</p><p>Anyways, the darvon wore off very quickly, about 2 hours after kicking in, and the comedown wasn't bad at all, no side effects, no after effects, just pure 'ecstacy'. I loved it. But to anyone who wants to start using darvon recreationally, be careful; my brother got hooked on them for a while and almost overdosed many many times, and now has an irregular heartbeat.</p>"
}
