{
 "title": "An Introspective Odyssey",
 "author": "Dr. Greenthumb",
 "citation": "   Dr. Greenthumb. \"An Introspective Odyssey: experience with 2C-I & Cannabis (ID 14239)\". Erowid.org. Apr 26, 2002. erowid.org/exp/14239",
 "substance": "2C-I & Cannabis",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 0:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14239",
   "Male",
   " ",
   "Not Given",
   "Apr 26, 2002",
   "7943",
   " "
  ]
 ],
 "report": "<p>\nI recently acquired a small amount of this, and tried it out for the first time on 4/20. I will try and put my experience in the form of a coherent trip report:</p><p>I dosed 25mg, +-1mg, weighed on a laboratory digital scale. Erowid lists the dose for a 'strong' experience at 20-30mg, and judging from my stature (about 6'5' and 220 lb) and my metabolism, I figured I'd better aim a bit on the higher side of the 'strong' scale for a nice experience, which I definitley wanted due to the limited nature of the supply (and it was 15mg short at that).</p><p>I took the powder in a gelcap at about 11 P.M.</p><p>t+:00 I take my powder, and two friends take a hit on 'geltabs'. We roll up a blunt, and walk from the house to a nearby park.</p><p>t+:45 We are at the park, and have smoked the blunt. I am naturally high, but still feel no real tangible sign of psychedelic activity. Meanwhile, my friends can't really decide if they are tripping or not. They get into a rather lengthy discussion on whether or not they are tripping. I try my best to convince my friend he is tripping balls. Theres no harm in a little placebo, and I dont wholly trust any irregular spurts of LSD. But I steer the topic towards the profound, and fool him, if only for a little while.</p><p>t+:1:20 We are still in the park, when an SUV full of quite obviously drunk loud people comes tearing several hundred yards across the grass, past the school, and climbs up onto the top of a steep prominent hill. Once at the top, intermittent flashes from a lighter indicated marijuana consumption, presumably from some sort of 'bowl'. This is an extremely bizarre occurance, to say the least. Yet I just stood there, occasionally commenting on the idiocy or some such. I remember thinking that if I were on something such as LSD or mushrooms, I would probably be doubled over in laughter, or at the very least giggling and with a perma-grin on my face. At the time I interpreted this as a lack of activity, but I recall a general lack of grinning, with respect to more traditional psychedelics. I also start to notice the first signs of oncoming activity, through an odd olfactory sensation, or at least thats the best I can best describe it.</p><p>t+:1:30 We are back at the house, and much to my dismay, the others opt for - of all things - watching a video. From the beginning of the video things built rather slowly, I remember feeling fairly sober a full 2 hours after I ingested the gelcap. As the movie went on, my two friends concluded the acid had, indeed, been bunk. One drifted off to bed, and me and the other went to smoke a couple bowls. Once I moved from the futon, it was very apparent that I was affected. There had been vague OEV's and patterns in the dim light, but moving my own body seemed unusually light and alien.</p><p>Comparing pupils by the mirror as we smoked, it was very apparent just how bunk that acid had been. The bowls may or may not have helped, but my friend announced he was going to bed, and I, tripping heartily, dug in for the finale of 'Being Joh Malkovich'. I felt a good degree of empathy for the characters sharing mainly their euphoria. I beleive 2c-I may induce a substantial serotonin release. The body buzz was phenomenal, and unique in its own right. Much more pronounced for me than mushrooms, but with a softer side than LSD. Visual imagery could be acertained with little effort, and included among the standard fractals, rug patterns, and celtic-knot style visuals andother type which I've not seen on any other substance that looked like elaborate Spirograph drawings.</p><p>I found this substance to be very tactile, but since I have not tryed 2c-B I cannot compare it.</p><p>After the movie, I spent a few enjoyable hours in self-exploration and discovery, as well as discovering a few other things, such as the futon (I beleive I may actually have discovered it on several occasions). I found myself gnashing my teeth a few times, but more because it felt good than due to an uncontrollable compulsion like with MDMA. Like I said, this substance is quite tactile.</p><p>I was bona fide awake until at least 6 AM (t+:7:00) at which point I was still trying to figure out what the hands on my watch meant time-wise (I was able to figure it out ex-post-facto). I may have slipped into sleep for varying periods, but I dont really remember falling asleep or waking up. My friend awoke at about 9:00, and I was still feeling a bit affected and sluggish. Considering my limited sleep, the hangover wasn't bad. all that disappated rather quickly with a short nap in the afternoon.</p><p>Well, thats it. My first 2c-I experience. This is definitley an interesting material, and I will certainly covet the remaining portion. I think this substance could offer much more in a more stimulating setting, but at least this session offered me a glimpse of the power and depth of this substance.</p>"
}
