{
 "title": "Perceptions Alive",
 "author": "Perceptions Altered",
 "citation": "   Perceptions Altered. \"Perceptions Alive: experience with LSD & Cannabis (ID 14259)\". Erowid.org. Dec 17, 2004. erowid.org/exp/14259",
 "substance": "LSD & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(liquid)",
   " ",
   "  ",
   " ",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14259",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 17, 2004",
   "Views: 4610",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nReality continued to spin. An invincible spider wove an intricately sculpted web in the nighttime sky. A web connected from star to star glimmering brightly as ever against a back round of the blackest black. A black void dotted with golden grains of sand.  Stars whom litter the night and find it of the up most importance to hint us in on their existence billions of miles away. \r\nHoly Shit!  Evan whispered in the lightest of tones. A tone hinted by the pure awe involved in the current situation. A situation of confusion combined with a new understanding. An event of escape which led us all on a journey so real that it made reality look a cartoon episode of the Ghostbusters! \r\nA shooting star had caught all three of our eyes as we stared in utter amazement. The shooting star was so vivid it was almost as if our vision was imitating the exactness of a powerful telescope. The spacescape, though appreciated and acknowledged previously, was now being seen with my eyes as if it were the first time. A freshness flooded the emotions of the situation like I had never felt before. This view of the nighttime sky which kept my eyes peeled was one of a universal stimulation. A universe of endless possibilities! A universe in which everything is connected in some mystical way. A universe in which I live! A universe which sometimes lives separate from my occasionally wandering mind.  \r\nWe stood there thoughtless in a rational sense, but the force behind the horizon was thinking for us. Idle thoughts became theories and a deluge of glowing life took control of our vision. Questions were answered as fast as they were asked. Time became meaningless and unrestrictive. Our spirits had escaped their regular limitations and exceeded earthly trivia. Those thoughts that usually occur silently in the privacy of ones mind became elevated to take on a deeper meaning. A silence loomed over us and everything grew clearer. Everything became crystal clear as if my eyes focus had finally been adjusted correctly. I felt awakened from a previous state of sleep. Awakened from a life of bondage. The valve had been opened allowing my existence a peak at the intense realness of life. The very mixture of atoms that ultimately composes the universe and infinite galaxies beyond. For one night we were let loose to run upon the clouds and jump casually from star to star! It was truly an awakening. An awakening so strong it forces one to ask in recollection of times past, Why have I been asleep for so long?\r\nKevin Spaceys face is all over the place!  Mike proclaimed ending a 5 minute period of silence that felt more like a decade. We were back inside watching American Beauty on Evans 62 inch television screen. Evan and I turned to Mike and laughed in unison. The laughter which commenced was a fit of laughter so free and unrestrained that its echoes vibrated in the heavens. We laughed harder than if we had just caught an episode of the Simpsons following a smoke down! I felt like a new born absorbing my surroundings in awe and confusion at the same time. For we were reduced to mere babies staring at the world with wide open eyes and not quite knowing what to make of it. This feeling of smallness in comparison to such a vast universe is a feeling that I had felt before at certain times, but not nearly as strongly. For life was opening up to us, and only us during that night. Life was understood and at the same time still all too mysterious. We didnt know what to think or what to believe anymore. Our minds were blown away and forced to start from a new perspective. We were in the state of confusion in a heightened consciousness of pure bliss. A bliss so central to our spirit that it screams out Answer my calls, for I am here and I can be accessed with an open mind. Indulge in my essence and you will not be disappointed! Our adventure with LSD was over in effects but its spirit would live on forever. \r\nBe knowledgable, Be sensible, Know your true priorities. . . . . . . .\n\n\n"
}
