{
 "title": "Hendrix Trippin'",
 "author": "NSU",
 "citation": "Citation:   NSU. \"Hendrix Trippin': experience with 2C-I (ID 14265)\". Erowid.org. Apr 29, 2002. erowid.org/exp/14265",
 "substance": "2C-I",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14265",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 29, 2002",
   "Views: 8449",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had tried 2ci before this but the set and setting of this journey allowed for a different, more relaxed experience.\r\nOne sunny saturday afternoon,I arrived at the house of a friend J, who's the girlfriend of my best friend in this world, M, who is also present. Beatiful, large house, with pianos and gardens and nice places. Also, a place I have always felt good and relaxed in, so it was a perfect setting.\r\nI brought along the 2ci previously measured and safely store inside a gelcap and my friends were having AMT, their first experience with this compound and they were curious and somewhat aprehensive about it. I wasn't in the mood for a long AMT trip but felt my presence there would tranquilize them a bit and the 2ci certainly did help calm myself...\r\nWe downed our gelcaps at about 2pm and sat outside in the beatiful garden to wait. The 2CI is very, very gentle coming up while the AMT is slightly more boisterous so J and M were starting to take off\r\nearlier than I did but I felt relaxed and happy, listening to some Jethro Tull playing in the background.\r\nT+1:00 J is feeling a very strong buzz from AMT, M is still coming up and I begin to notice the first signs of 2ci working its way into my mind...On the physical side, a slight muscle tension, particularly in the left leg but real minor, and on the mental side colours begin to gain brightness and smoothness.\r\nT+2:00 J is tripping very hard, very energized and rolling around, M is still coming up but feeling good and 2ci is full on. Beatiful waves of colorful patterns, some strange yet gorgeuos figures, resembling childern's toys, all very funny and producing a very warm and nice effect...Strong synesthesia and now we pop up some good old Hendrix in the cd player.\r\nI know this sounds old fart stuff, but if you have never done this, do yourselves a favor and trip while listening to Are you Expericed, by Jimi Hendrix...I sat right in front, both speakers at an equal distance and loud, but not blaring. Just loud enough...the senses are enveloped by the spectral music, a very hard to describe feeling of being part of the notes and musical structure as if every sound was twitching and twisting every single cell, all very happy to conduct this chemical-musical orchestral feast...\r\nT+4:00 Still riding high on the 2ci, we decide that Hendrix is definitely the way to go and watch the Live at Woodstock DVD on a 60' tv...What an effect!!!!the music and images intertwine, blending seamlessly into our eyes and ears and skin...I turn to look at my friends who are tripping very hard on AMT and I have many visual distortions, most notably one where I see them blending in with the couch, the walls, the floor, just like if they were an extension of those and their souls were commanding the whole house structure...Very weird but nice.\r\nNow, dont get me wrong, I never felt 'too high' or like I'd lost it. 2CI seems very clean and smooth and it never disables you from doing ordinary stuff. But it makes you appreciate all the little details built in every single thing.\r\nT+7:00 Noticeably down a notch, I pack my stuff to go and leave the AMT-explorers free to explore some carnal delights...I feel great, enjoying every scent, every sight, wondering why normal reality cannot be like this...alas...Another hour (T+8:00) and I am completely back to baseline, with real effects having lasted like 5-6 hours, plus 1or 2 hours of coming up and down.\r\nI have grown very fond of this compound and feel this deserves a try by any serious psychonaut out there. It has avery gentle,soft and slow come up and come down but it is really worth the wait. It never screws your thoughts like high-dose LSD nor it gives you the rich visuals of acid. But it is a marvelous trip, with a nice body buzz and warmth, and easy rolling. By the way 2CI and LSD make a great combo, to which I will refer to at a later date.\r\nMy final comments on this report: This is a wonderful compound, one to be carefully and safely researched by anyone who wants to enjoy a great physical AND mental stimulation, made all the more special by the incredible interaction with music. Have great music around, sit back and roll into it....\n\n\n"
}