{
 "title": "Everything Went Wrong",
 "author": "Schizochic420",
 "citation": "   Schizochic420. \"Everything Went Wrong: experience with Diphenhydramine (ID 14270)\". Erowid.org. Apr 28, 2002. erowid.org/exp/14270",
 "substance": "Diphenhydramine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1000 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 14270",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 28, 2002",
   "Views: 40891",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI've been using Diphenhydramine for awhile, usually taking doses ranging from 250 mg. to 1,500 mg. I had done it enough times that on 500 mg. I could act completely normal, I did a take home test once on this much and got the highest score in the class. This weekend was different though, my parents had searched my room and discovered over 100 Diph pills, DXM products, and Ephedrine tablets two weeks earlier and I hadn't done it since then. They had taken my money but I found enough quarters when my friend was over to get one box of 32 50 mg. gelcaps. We bought it and I took 20, she took 12. This was at 9:00.<br>It kicked in around 9:30. I remember being extremely confused, I kept asking my friend to go downstairs which was stupid since my parents were there and we couldnt even stand up. This is the last thing I remember. The rest of the story is from what my parents and my friend told me, and the small parts I do remember. My friend told me she wanted me to go outside cause she wanted a cig. I got up and fell the floor. My eyes closed and I started to shake really hard. She was hallucinating at this point but still did everything she could to help me, she tried waking me up and got to the point of slapping me. Then my eyes opened and foam and blood starting coming out of my mouth.<br>My brother came into the room to check on us and found me looking like this. He woke my parents and told them to come look at me. My mom freaked, she wanted me to go to the hospital but my dad and brother decided i needed to get in the shower so they threw me in with my clothes on and realized I was really really screwed up.<br>I spoke of nothing but a sound kind of like 'Eh uhhh huh me maa do' Just weird words. They brought me to the hospital, I was in the emergency room with 5 nurses all trying to hold me down and figure out what I was on. My parents left because they remembered my friend was still at my house. I got my stomache pumped, I ended up throwing up all over myself during this time. And they gave me charcoal and a drug to help flush it out of my system. I also had a tube put in me so I could pee.<br>This is when I began to speak, my first sentence was to turn the tv off, which it was. My mom came back with my friend and they asked me if i knew who she was, I said her name and just stared at her for about 10 minutes until they decided to leave.<br>I woke up the next morning having no idea I was even at the hospital, I noticed the tube between my legs and tried to pull it out but realized whatever it was wanted to stay there. They came in to give me breakfast and it all began to sink in. I ate everything they gave me, and went back to sleep.<br>This was Friday night, I had to stay there till Sunday. I have to see a therapist every week and I'm soon going to see a therapist just for the drug use. Im on anti depressents which is really stupid since the only reason is because my mom believes it was an attempted suicide.<br>I have no idea what caused this, I had taken the pills so many times in higher doses with nothing going wrong. I guess It was because I had waited two weeks and then took the entire dose in about a minute. Im not sure, but I'll hopefully never want to take them again. I never thought this would happen to me, but It did. And now I know that it can, I hope everyone that does this realizes it could take their life...and they have to be willing to realize that can be the consequence.\n\n\n"
}
