{
 "title": "So This Is How It Feels To Be Born?",
 "author": "Hillbillie",
 "citation": "   Hillbillie. \"So This Is How It Feels To Be Born?: experience with Salvia divinorum (extract) (ID 14291)\". Erowid.org. Sep 23, 2005. erowid.org/exp/14291",
 "substance": "Salvia divinorum (extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.25 tsp",
   "oral",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:12",
   "1 leaf",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14291",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 23, 2005",
   "Views: 5783",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Methods:\tOral Extract (homemade, about a quarter teaspoon)</p><p>\t\tSmoked (About a large bowl)</p><p>Setting:\tAt home, in the morning by myself. A little sleepy, but feeling good.</p><p>It was about 7:00 in the morning. I placed my home-made 'black tar' extract under my tongue after aggressively brushing my teeth (to get the blood vessels dilated in my mouth). I waited 10 to 15 minutes and because I had used salvia both in quid form and smoked (and never got a trip), I decided to load a bowl with a large, healthy-looking leaf. I lit and inhaled calmly and mellow, but pacing myself. I held the hit for 10 or so seconds and exhaled. I took another, yet smaller, hit and exhaled. I decided that I probably wasn't going to trip, so I went outside to clean the bowl.</p><p>As soon as I opened the door and stuck my head outside I had a paranoid feeling of someone watching me from the street, so I hurried up and then it hit me like a ton of bricks. It's very hard to explain this, but I felt as though I wasn't tripping yet but I knew I was about to in the next moment and knew exactly how it was going to feel.</p><p>Then, BAM! I was tripping. I no longer knew who, what, or where I was, nor did I know how I got there. I didn't even know what life was. The only way I can think of explaining this is like I was just born  like, what I was feeling was how I imagine it feels when you are born, just as you exit your mother's womb and enter the world. We forget how that moment felt because it was so long ago that it happened, but that's how I felt right when the trip hit me. I felt as if I had just been born or something.</p><p>The weird thing is I felt like I had been in this state of mind before. It was all familiar in a sense, but I didn't know what it all meant. Thoughts were flying through my head a thousand fold. There were too many thoughts to comprehend. But then, I felt something. I felt I had to go put up the thing that I was 'holding' (the bong). I didn't know why I had to do this or how I knew, but I knew I had to go take it into my room, so I did. It was almost like a natural instinct. When I came into my room, I looked at the trash can. It amazed me. I didn't know what it was. I felt the energy of the trash can; I saw the life of the trash bag and the curves and creases of it folding over the edge of the trash can. It was completely insane, and I loved it. I then remembered I had put something into what I assumed was my mouth (even though I didn't know what a mouth was at the time), and I had the instinct of needing to get it into (what I now know as) the trash can.</p><p>After I set the bong down, I left my room. As I left and was walking, I remember feeling like I was burning up and was on fire. I was burning alive, but I didn't know why. I looked down at myself and saw the jacket I had on. Another instinct told me to remove the jacket, so I did in a hurry. Immediately I felt better. But then, I felt as though I had to sit down, so I did. I laid down on the couch and tried to tell myself I had taken a mind-altering drug and that I should just relax and let the trip do its thing. As I realized this I started to feel better, but I still wanted the trip to end. It felt like forever. I felt like I had been tripping my whole life and that I was never going to stop tripping. I felt as if I was lost in another realm of reality, and not that I was never coming back, but that I had never left  this was the place I was all my life, I just never realized it until now.</p><p>I got up and walked back into the room where I smoked. As I walked it felt as if I wasn't in my body, but I was. I felt as if I was in a 'control room' somewhere controlling my body via remote control or something, however the 'remote control' was my mind. It was a powerful realization. It was fun to walk also. I played like this for a couple of seconds and then proceeded to the couch in the room. I sat down and realized that I had just tripped on salvia. It blew my mind. I was ecstatic that I had finally tripped and that I was okay.</p><p>After that, I came down for the next hour and listened to techno, and it was absolutely mind blowing. The music was awesome and 'made sense' to me. I was feeling good all day after that.</p><p>Looking back at it, the trip wasn't a bad one as it might seem in this report, but it was definitely a difficult one to handle at the time. Now that I have tripped on salvia, I think the next experience will be friendlier since I know what to expect. That's the part that I think hindered me  I didn't know what was about to happen.</p>"
}
