{
 "title": "Self-Medicating Anxiety and Depression",
 "author": "TheSlaveFlower",
 "citation": "Citation:   TheSlaveFlower. \"Self-Medicating Anxiety and Depression: experience with Pseudoephedrine & Clonazepam (Klonopin) (ID 14320)\". Erowid.org. Mar 12, 2003. erowid.org/exp/14320",
 "substance": "Pseudoephedrine & Clonazepam (Klonopin)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "120 mg",
   "oral",
   "Pseudoephedrine",
   "(pill / tablet)",
   " ",
   "1.0 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14320",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 12, 2003",
   "Views: 39441",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was diagnosed with having Panic Disorder in seventh grade and have been on variety of medications since, and still have not found the right med/combination of meds. First of all I'd like to say that I don't recommend using Klonopin daily for more than a week because it is very addicting and withdrawal is not pretty. In fact, it mimics alcohol withdrawal and it's possible to have a seizure, so don't get hooked. \r\nI've been looking for a 'cure' for my Panic Disorder for years, realized that there is no magical medicinal 'cure', and am searching for a medication/herb to tame it; keep it under control. When I was off medication for a two-month period, I took some pseudoephedrine for a stuffy nose. My nose is always stuffed up due to allergies. I assumed it would be speedy (as it is related to ephedra) and I was right. I liked it for a while, but any stimulants make me get heart palpitations and a lot of the time Panic Attacks. So I ran to my Klonopin and took a 1mg tablet. I suggest using a 0.5mg tablet of Klonopin if you do this because 1mg may very well knock you on your ass, as it is equivalent to a full 10mg of Valium on a benzodiazepine equivalency chart. \r\nThe Klonopin kicked in after about 20 minutes, and I started to feel absolutely wonderful. I was not euphoric or 'high', but relaxed with energy. And NOT nervous energy. It was very nice. Downers and uppers seem to work very well together. Of course I can't say that for all mixtures of downers and uppers, but this specific combination was excellent, and put me in the perfect mood and state of mind. I did this for about a week until I ran out of pseudoephedrine, and didn't get more because I decided to try yet ANOTHER prescription medication. *sigh* Hope it works.\n\n\n"
}