{
 "title": "Slow and Mellow All the Way to Bed",
 "author": "Big Jim",
 "citation": "   Big Jim. \"Slow and Mellow All the Way to Bed: experience with Carisoprodol (Soma) (ID 14387)\". Erowid.org. Jan 28, 2003. erowid.org/exp/14387",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "700 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14387",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 28, 2003",
   "Views: 42736",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n+8:00 pm PST</p><p>After a week of back pain I finally broke down and wanted to try some of my friends pills. This was the first time I have tried this drug and I wasn't sure what to expect. So I watched some TV and left the pills on the counter. I just wanted to look at the pros and cons of taking a pill I knew nothing about.</p><p>+8:30 pm PST</p><p>That's it!!! I couldn't stand it anymore. I had to numb this pain. I am a regular user of MDMA and just like everything else you should know your source and your body. So I split the pill and took half.</p><p>+9:30 pm PST</p><p>No adverse reaction no pain relief either. I take the other half and go down to the spa hoping that the pill might kick in. Damn there were some hot chicks in the spa......</p><p>+10:00 pm PST</p><p>Out of the spa and walking back to the house I felt a little out of the norm. Almost like a mild drunkness but not anything that was worth noting.</p><p>10:30 pm PST</p><p>These pills suck they don't do much. Or so I thought. So I took my second pill. As I was watching TV I suddenly realized that I was going into a dreamy phase. Things were still normal. I would say that they reacted very slow.</p><p>11:00 pm PST</p><p>Second pill is going pretty well. I am feeling no pain and I feel totally relaxed. I got to the point where TV was no more fun so I left for bed. I was out in a flash.</p><p>The only other thing I can compare my experiance to is taking two shots of nyquil. I mean I felt more relaxed and less drowsy but overall it was the same affect. I would recomend that you take the prescribed amount and if you are getting some from a friend start off with one and split the second tab. Better to be safe than sorry.</p><p>PEACE OUT..................</p>"
}
