{
 "title": "Several Months With Sceletium",
 "author": "PuristLove",
 "citation": "   PuristLove. \"Several Months With Sceletium: experience with Sceletium tortuosum (ID 14384)\". Erowid.org. May 20, 2005. erowid.org/exp/14384",
 "substance": "Sceletium tortuosum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Sceletium tortuosum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14384",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 20, 2005",
   "Views: 36975",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThere still isn't a lot of information about this wonderful herb.  </p><p>I recieved my 2 grams of it sometime late last year and have been using it on/off since.  I've still got about a quarter of the material, and have used it quite a few times.</p><p>My Notes-</p><p>Oral ingestion seems to be the weakest method of administration.  I've taken up to 100 mg orally with little to no effect.</p><p>Smoking it produces the smoothest effects.  It comes on quickly this way, produces more body buzz, and seems to be more sedating.</p><p>Snorting it- I can get effects from snorting this material with 20 mg or less.  It's less physical, more mental, and more euphoric.  It tends to cause me to go into sneezing fits and sometimes burns quite a bit.  This may have something to do with the alkaline properties of either the active itself, or the chemical that is supposedly eliminated during fermentation.</p><p>With Cannabis- Extremely small amounts of cannabis produce heavy stoning when smoked in combination with sceletium powder.  I am unable to distinguish the sceletium effects from the general cannabis effects, but this may be because I smoke cannabis so rarely.  It could also be that the synergy is just too smooth to notice the different effects.</p><p>With Opiates- I've snorted it on hydrocodone and after having consumed poppy tea.  Both times my body flushed, I felt intensely euphoric (more than I would from the opiates alone) but grew extremely overheated and had a racing heart.  Lying down generally took care of the problem and as long as I didn't try anything too active I'd be ok.  This isn't something I intend to experiment with further, and there may be health risks.</p><p>Tolerance- I have found it to be much more difficult to achieve effects when used two days in a row.  Three or four days seems to eliminate effects of tolerance.</p><p>Habituation/Addiction- I find myself getting an urge to use the sceletium from time to time.  Especially if I've used it recently.  After several weeks of abstinence this urge usually goes away.  I'm not sure if it's a property of the herb, my psyche, or just me being bored, wanting to get high, and liking the effects.</p><p>Anyways, wish I had more to add but it's not a very complicated drug.  Just a mildly enjoyable one.</p><p>I read the report of the fellow snorting a gram of it.  That's a pretty high dose.  Everywhere I've read has reccomended doses from 20-100 mg when snorted.  I don't know if that's a dangerous dose, but it certainly wouldn't be easy on the nasal passages.</p>"
}
