{
 "title": "New York City Was Talking To Me",
 "author": "narituba",
 "citation": "   narituba. \"New York City Was Talking To Me: experience with Cannabis (ID 14405)\". Erowid.org. Jul 19, 2005. erowid.org/exp/14405",
 "substance": "Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "0.8 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14405",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 19, 2005",
   "Views: 3461",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n I came back from work last Friday and I begun to think about what the festivities where going to be, considering at midnight it would be 4/20. At around 8 pm I receive a call from my friend Lacto who claims he got a hold of some 'killers' Always skeptical about these 'killers' I still found the idea of smoking some quality marihuana very enjoyable. As I arrived at Lacto's apartment I was shown a VERY nice blunt that was sitting on a desk, this thing deserved to be framed, ladies and gentleman. The contents were about 2.5 grams of weed that were finished on 3 heads. As midnight crept closer, Lacto, Mucus and myself hit the streets of Manhattan and sparked the monster in synchronicity with our digital watches beeping the midnight cue. As Lacto exhaled the first hit which was absolutely obscene, he said to me 'you better watch out boy, this is the shit that killed Elvis' The duration of this ceremony was long since the size of the blunt demanded it. \r\nAs I got rid of the roach, I realized my hands were shaking. I got into an intense conversation about the September 11 attacks with Lacto (brought up by the fact that we were supposed to see the twin towers from the spot we were standing on) and Mucus walked behind lost in thought. Around 15 minutes after smoking I realized that this was going to be different. There was no giggling or laughter whatsoever. We usually are very ridiculous and stupid while stoned, but there was something different this time. About an hour after smoking, I parted ways with Lacto and Mucus who had to attend a gas mask party.\r\nThe sounds of the city became crisp and detailed. I began thinking in terms of Megahertz and Kilohertz, attempting to estimate the frequency of every prominent sound that appeared. My head felt heavy as if it had been inflated with propane. I realize that I had not taken any decisions regarding what to do or where to go.\r\nSnap back to reality, I was lost in deep thought of universal transcendence and cosmic flow. An hour and a half passed from smoke time, but I'm going strong as a mammoth. As I realized I had just walked around 40 blocks I decide to go into the subway system. Upon entering one of the village subway stations I see a gentleman dressed in a glittery Elvis outfit, a very amusing little 'random' event.\r\nSubway station. Things are really hard-core right now. There are these metal columns that support the roof of the station. While focusing on them, I would move my head slightly to the sides and the whole background began to move (To get an idea, focus on an object at arm's length range. Now move your head from side to side and keep focus on the object while paying attention to the background) Suddenly I was aware of a presence. I was alone in the station, but there was a presence I could feel. I noticed little movements all around me, a succession of 'random' events. A brown water drips off a pipe. A rat runs into a hole in the wall. A piece of paper flies in front of me. A light tube flickers. Another drop of water. At that point, while seeing all these events as a complete group and not as separate, I realized that I was in the bowels of a living breathing being. Still focused on the column I saw the concrete breathe. (This was absolutely UNLIKE the breathing effect I've experienced on Psilocybe, where the breathing objects match my breathing.) There was now a very deep rumbling sound in the background, and it was impossible to unfocus from the column in front of me. The amount of little events coming in was overwhelming, but it was all driven by this rumble, this power that was behind it all. New York City was talking to me.\r\nIn the blink of an eye the spell was broken and I went back to 'normal'. I felt I was suffocating and I realized that I had been holding my breath the entire time. I got up quickly and left the station and I could say that I was afraid and confused. I have never felt anything like this in my life. As I waived a cab I realized I was still in deep thought but the cold sweat was leaving me as well as the tachycardia. As the cab left Manhattan through a bridge I stared at the last buildings and saw them as cold and silent sentinels, guardians to a complex living creature. \r\nI think my underestimation of the 'killers' was what Didn't allow me to control this experience. I think if I would have known what I was getting myself into I could have had a blast with it. Certainly my defenses were down since I was ready to be a stoned goofball and got into a whole different realm. This was way beyond hash fellas, I'm talking LSD intense here, but with no visuals. As far as the experience or 'encounter' itselfI HAVE NO IDEA.\n\n\n"
}
