{
 "title": "Coma White",
 "author": "Lain",
 "citation": "   Lain. \"Coma White: experience with Rum, Cannabis, AMT, 4-HO-DET, N02 & Calea (ID 14478)\". Erowid.org. May 7, 2002. erowid.org/exp/14478",
 "substance": "Rum, Cannabis, AMT, 4-HO-DET, N02 & Calea",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 bowls",
   "smoked",
   "Calea zacatechichi",
   "(plant material)",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   "(flowers)",
   "  T+ 0:00",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 0:00",
   "30 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   "  T+ 1:00",
   "20 mg",
   "oral",
   "4-Acetoxy-DET",
   "(powder / crystals)",
   "  T+ 1:00",
   "  ",
   "smoked",
   "Calea zacatechichi",
   "(plant material)",
   "  T+ 1:00",
   "  ",
   "smoked",
   "Cannabis",
   "(flowers)",
   "  T+ 2:00",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 3:00",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 4:00",
   "20 mg",
   "insufflated",
   "4-Acetoxy-DET",
   "(powder / crystals)",
   "  T+ 4:00",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 6:00",
   "20 mg",
   "insufflated",
   "4-Acetoxy-DET",
   "(powder / crystals)",
   "  T+ 6:00",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14478",
   "Male",
   " ",
   "Not Given",
   "May 7, 2002",
   "26118",
   " "
  ]
 ],
 "report": "<p>\nGood lord...</p><p>T-00</p><p>Setting is a darkened bedroom prepared for madness.  Music on loop is Kidney Thieves, Shpongle and Down.  The perfect mix of industrial, entholectrical and heavy southern madness.  </p><p>First off I smoke 3 bowls of calea to lower the static in my head to a tolerable level.  Than some cannabis to even out the edges and finally a tank of N02 knocks me right in the right headspace.  Thus, I ingest the amt without a seconds glance.  No broken dossages in shot glasses, full amount in one capsule.  </p><p>T-1:00</p><p>Typical amt come on, feeling very happy.  Permagrin in full effect, Im watching the simpsons and homer is hopping backwards down the street at midnite on a ladder.  I can only hope ill be doing that soon.  Ingest 20 mg 4-ho-det and smoke some more calea mixed with cannabis to kill the oncoming nausea. Det does that too me every time, its nothing painful but if i were running or dancing id know puke would be just round the corner. </p><p>T-2:00</p><p>Amt and det are now fighting for control in my mind.  I though something like this would happen, so i let the 2 bastard children brawl for a while.  Finally I have to put my foot down and take in a balloon of N02. I scream shut the fuck up children! and they sort themselves out for a few minutes.  Extremely similar to 3 hits of clean acid at this point.  Visual hallucinations in full force, than it switches to a more mushroom feel as the det takes hold.  Where amt is a energy field that erects itself to allow you access to the logos, det spreads its jelly goo on all of it and lets you slip and slide through the madness.  Somewhere in between my electric goo is burning  quite well.  </p><p>T-3:00</p><p>Allright success!  They have blended to create not exactly the tryptamine partnership i was hoping for but definitely something.  My head feels like a frissbee.  More N02 proves once again that oblivion is only a breath away, det is the only one that can stand up to this monster.  OEV's prevail even in the depths of the nitrous world.  I can feel my tolerance building up though so i decide to head back towards cannabis.  Im able to step just to the edge of lightheadedness with a few hits.  Whatever is beyond that edge holds the secret to what information is truly being conveyed.</p><p>T-4:00</p><p>Without thinking twice i snort 20 mg all at once.  The burn is barely even there as my field of vision fills up with shimmering swirls of color.  The spectrum starts to seperate itself from blue to red while the drip goes down my throat.  Some nausea but its worth it.  Back into nitrous land to check the edge.  Finally im able to jump over for a few seconds and access some kind of information desk.  I think i could have anwered any question in the universe for a few seconds there.  Unfortunately i am pulled back to a swirling chaotic field of hallucination within minitues.  Amt is trying to take over for some reason, so i take 2 shots of captain morgan to shut it the fuck up.  </p><p>T-5:00</p><p>Time for breathwork and meditation.  Its hard to get into due to the edgy feel of these tryptamines but if you can find a backdoor your in for a ride and a half.  Entities of gold shimmering likeness enter from every direction,  I AM SHPONGLE!! hahaha.  good stuff.  Aqua teen hungerforce steals my attention and i cannot stop laughing for 3 hours straight, I have never had the giggles like this ever.  Nothing tops the undeniable glee that is bestowed in these few hours.  </p><p>T-6:00</p><p>Time to get serious, snort 20mg more det, and take in 2 balloons. After the balloons are out i immediately smoke some calea/cannabis.  I imagine there are 300 or so drugs fighting for control of the situation in my mind, but stepping back its a beautiful war.  Sometimes they all flow as one, other times I feel a shift towards the dreamstate.  I think that would be amt and calea bonding into some alpha wave mindfuck.  Time to zone out for a long time.</p><p>T-9:00</p><p>Just spent some time in the lower levels of hell.  The hallucinations are sicker than acid.  I mean twisting rotting demons crawling out of hell to lick your eyelids off.  Imagine lord of illusions mixed with 200 motels (must see movies kids...).  There was a playful manner to these demons, as if the dmt elfs had played dress up and were putting on a show.  Which is a good metaphor regarding the substances consumed thus far.  </p><p>T-12:00 I start a disco nap and the calea is actually working.  Anyone who gets exausted on amt knows that sleeping is more like a coma than anything.  May i suggest some calea to make your mind work even when your sleeping.  My dreams werent completely clear or anything but I could still bring back the trip if so desired.  At this point meo and dmt must be flowing in somewhere to allow me to dream...so this is quite a bender ive been on.</p><p>In conclusion, fuck amt! seriously its pointless.  i would have been just as high with just det, the amt just added an empty feeling that i couldnt deal with sometimes.  if your going for something truly fantastic, learn from this and take 50mg det at once with some cannabis waiting to fight the nausea.  The level of clarity it gives blows away any other synthetic except maybe 2ci.  This combo is worth a try, but there are easier routes to getting off in the cosmic realm.  Good luck in your travels, and play it safe.  I consider myself a moderate gauge, if your questioning dosages, cut them in half.  Better safe than dead. Always.</p>"
}
