{
 "title": "Wrists & Ankles Held Me Down",
 "author": "L",
 "citation": "   L. \"Wrists & Ankles Held Me Down: experience with Dipehnhydramine (ID 14471)\". Erowid.org. Feb 7, 2003. erowid.org/exp/14471",
 "substance": "Dipehnhydramine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 14471",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 7, 2003",
   "Views: 21457",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had heard stories of people experimenting with benadryl, DXM, and coricidron, even a few of my friends had tried it.\r\nAt first I was nervous because I could not get over the idea of taking so many pills at once.  The week before i tried diphenhydramine, one of my friends tried taking eight pills of dramamine and had a pretty strange trip. I forgot what happened though.\r\nI took about 400 mg of generic brand benadryl at around 5:00.  I started feeling the effects about an hour later when my friend came over.  I did not tell him that I had taken the benadryl.\r\nThe first thing that I really noticed in the trip was the added weight to my arms and legs.  It did not feel the same as when I am high and my arms and legs feel heavy, this felt like i had weights tied to my wrists and ankles and were pulling me down.  My mouth was very dry.  I would then look at the wall, and it seemed as if there were many tiny dots on it, and it looked very grainy.\r\nI got another call from another friend who was having a party, we went over there and I had a little trouble keeping my balance.  When I was there at times it seemed as if I was spacing out, and it would take me a few moments to respond.  No one figured it out that I was on anything but I did not really like the trip. After awhile I felt very sleepy and was able to fall asleep almost immediately that night.\r\nIt wasn't as great of an experience as I was hoping for but it was not too bad.\n\n\n"
}
