{
 "title": "All The Colors",
 "author": "Psychopsilocybin",
 "citation": "   Psychopsilocybin. \"All The Colors: experience with Morning Glory (ID 14490)\". Erowid.org. Jul 20, 2005. erowid.org/exp/14490",
 "substance": "Morning Glory",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "225 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   "  T+ 1:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 14490",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 20, 2005",
   "Views: 11855",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWhen I first heard about the psychedelic possibilities of morning glory and LSA, I was quite skeptical and intrigued. It took me a good 6 months to build up the guts to try the little suckers. So the day finally came and my friend J and I purchased 10 packets of flying saucers to split between us. Time was not a problem, so we counted out 225 seeds between us and proceeded to wash them in a spaghetti strainer with dish washing liquid. The seeds were thoroughly cleaned and all soap was removed. J and I knew that our stomachs would be in great peril, but we decided that no matter what, we were going to hold them down. (1:00am) We chewed the seeds to a paste, and with each mouthful, we took a shot of lemon juice to ease the taste and to extract the LSA. It took us approximately 20 minutes to down all of our seeds. I decided to take a couple tablespoons of emitrol to ease my stomach, but J declined because the taste made him feel sick. The report that follows documents the next nine hours.\r\nT+0:20: My head is feeling extremely light and floaty. Muscles are cramping and my stomach feels unsettled. Meanwhile, J is lying on the floor doing everything he can not to puke.\r\nT+1:00: All of the seeds are still in our stomachs and we decide to smoke a fatty. I am not feeling nearly as sick as J who will not stand up because he is afraid of puking.\r\nT+2:00: Blobs of light are starting to circle everywhere. Uncontrollable laughter runs through both of us. Cramps are slightly decreased. Pupils are mildly dilated and focusing on random things constantly. J's pupils are the size of quarters.\r\nT+3:00: Tripping moderately hard, but more of a mental trip than visual. Colors are extremely bright and everything begins taking on a color pattern.\r\nT+3:30: Decided to hit my bong. J only takes one hit and immediately lays down and becomes unresponsive for several seconds. I take a hit and become totally catatonic for 3 minutes while J tries to get my attention. Visuals are extremely intense. Colors and light everywhere. Things are melting and rippling.\r\nT+4:00: J has been staring at my Hendrix poster for the last half hour constantly repeating 'Jimi wont stop rippling'. Visuals are extreme, to the point where I cannot tell if my eyes are open or closed.\r\nT+5:00: J and I can barely speak to each other anymore. Strangely enough, we don't need to. It is like we are psychically connected and one good look into each other's dilated pupils is more than a thousand words. I begin to explain to J how psychedelics can be used to do seemingly impossible things such as walking on hot coals and such. I hold a lit lighter to my finger for approximately 10 seconds without any sign of physical damage.\r\nT+6:00: Still tripping. Attempted to hit another bong pack, but after the first hit, all my senses blend into one and I lay back on my bed. I'm tripping harder than I have ever tripped in my life (I have occasionally used LSD and Psilocybe). J is standing in the middle of my room staring at me motionless.\r\nT+7:00: Beginning to come down. J and I speak very philosophically to each other about our lives. We come to the conclusion that drugs should be more of a hobby than a lifestyle and that they are beginning to consume us.\r\nT+9:00: J and I sit in my driveway completely exhausted. We smoke a whole pack of cigarettes while trying to gather together the events of only several hours ago.\r\nConclusion: Morning glories are extremely intense. They are physically and mentally tiring. By themselves, MG's give more of a mental trip than visuals, but with cannabis, visuals are intense. Tried to hold it in no matter what, the nausea went away when we start tripping.\n\n\n"
}
