{
 "title": "Pure Delerium...My First Time With Dramamine!",
 "author": "DXMTRIPPER",
 "citation": "   DXMTRIPPER. \"Pure Delerium...My First Time With Dramamine!: experience with Dramamine (dimenhydrinate) (ID 14507)\". Erowid.org. May 7, 2004. erowid.org/exp/14507",
 "substance": "Dramamine (dimenhydrinate)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "14507",
   "Male",
   " ",
   "Not Given",
   "May 7, 2004",
   "12906",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Seeing all the Datura reports that have been posted I decided that I would share my first experience with Dramamine.  Although different chemicals the Dramamine and datura trip are pretty much the same except for datura being a great deal stronger and scarier...just read the reports.</p><p>I first heard about Dramamine from a friend of mine.  He told me that if I took all 12 of  the pills that came in the container I would trip and see stuff.  Being unaware at the time of what I was getting myself into I went and purchased a container of Dramamine.  There were 12 pills that each contained 25 mg of the drug dimenhydrinate.</p><p>Before I began my mindset was pretty happy because I thought that I would get a good euphoria and see beautiful colors or at least that is what my friend told me.  It was about 8:00 pm when I took all 12 of the pills.  They tasted absolutely horrible and left a nasty aftertaste in my mouth but nothing a quick swig wouldn't take care of.  I hadn't had very much experience with drugs except for alcohol and pot so I didn't really know what to expects.  I sat down on the couch and started to watch some TV.  </p><p>After about 45 minutes I got really sedated and it felt okay for about 15 minutes but after that I just get getting more tired than I had before. Whe I say I got tired I don't mean like tired when you take a prescription tranquilizer,  I mean the kind of tired when you stay awake for 2 or 3 days in a row.  Not too fun.  After I was about an hour and a half into the experience I decided to go in and get a shower.  I literally stumbled into the bathroom and could see spots and stuff moving out of the corners of my eyes.  I became very paranoid and looked around expecting someone to jump out at me...it was pretty freaky. I finally got to the shower and I turned on the water and even though I was alone I could have sworn that I heard my name being called over and over again.   It was pretty scary because it sounded like my little sister's voice and she was 200 miles away.  </p><p>I finally made it through my shower and decided I had had enough and it was time to go to bed.  I lied down and got the worst muscle twith in my right leg...it was so bad and uncomfortable that it kept me awake and for the next two hours I watched spots and movement on my bedroom wall.  Eventually after the drug went through my system I just fell asleep.</p><p>Overall,  I would say that Dramamine has some recreactional value...if you like delerium and being very tired.  I won't lie I did see stuff but it wasn't what I had expected. While on a Dramamine trip one isn't able to discern what is real and fake either.  It is pretty strange.  If I were to repeat the experience I would take a stimulant along with the Dramamine to keep me awake but I don't think that this would be very good for the heart.  Well,  I just thought I would share that with ya'll.  Take care.</p><p>DXMTRIPPER</p>"
}
