{
 "title": "A Refreshing Journey",
 "author": "Shaman-Shadow",
 "citation": "   Shaman-Shadow. \"A Refreshing Journey: experience with Syrian Rue & Melatonin (ID 14505)\". Erowid.org. May 22, 2002. erowid.org/exp/14505",
 "substance": "Syrian Rue & Melatonin",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "500 ug",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "3.0 g",
   "oral",
   "Syrian Rue",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14505",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 22, 2002",
   "Views: 22371",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI needed a refreshing cleanse of my psyche and qi (chi). I spent the entire weekend sleeping like shit and over-exerting my body. I decided to experiment. My previous experiences with melatonin alone were too sketchy. Since I had a notion Syrian Rue enhances, or mutates a chemical reaction I was all game.</p><p>I popped a few melatonin pills, and took three grams of Peganum harmala. I ground the harmala seeds in a coffee grinder. I then boiled the seeds with part water and Emergen-C (vitamin C extract) for 2 hours. I filtered and boiled till I had a yellow-brownish liquid. I poured the solution in a cup and added a lemon to make it go down. It tasted rather pleasant. </p><p>T+0= 9:30 PM-Drank tea with Melatonin Capsules.</p><p>T+1= 10:05 PM-Felt a massive body wave similar to heroin and ecstasy. As I watched TV my dreams and reality morphed. I had visions mixed with what I saw in real life. </p><p>T+2= 11:00 PM?- I kept shifting states of consciousness in seconds. My body felt like it was floating in a warm pool of vibrating water. My body kept making weird jerking motions to weird voices in my head. </p><p>T+3= 12:00 AM- I decided to lay in bed so when my roomates came home they wouldn't see how fucked up I was. As I lay in bed the twtiching got more intense. I had weird conversations in my bed with a female my age who was not even there. But she was. I don't know what we said to each other, but it was more rhythnic than logic. I could feel her lips and skin and we had an exchange of sexual energy. I cannot recall intercourse but an intense orgasmic electrical surge that left me breathless. We then cuddled in a weird vibration and I was carried to a different realm. There were people walking all around, none I ever saw before. They taught me things I can hardly remember. At that point there was no way to determine how long the trip went. I was shown pieces of my current life and where I succeeding and where I was failing. </p><p>I woke up at 9:00 AM feeling revitalized and really peaceful. I may experiment with dosage levels to see what this constitutes. It was very spiritual.</p>"
}
