{
 "title": "Liquid LSA from HBWR seeds",
 "author": "Tony A.",
 "citation": "   Tony A.. \"Liquid LSA from HBWR seeds: experience with LSA (ID 1450)\". Erowid.org. May 19, 2001. erowid.org/exp/1450",
 "substance": "LSA",
 "bodyweight": "180 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1450",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 19, 2001",
   "Views: 140920",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been trying many new ways of getting high on legal drugs, but none of them seemed to work. So one day i went to my science teacher who i knew smoked bud, and i asked her to help me make some lsa...well here's how we did it...<br>Items needed:<br>150 hbwr seeds<br>a 50ml bottle<br>non-polar solvent (Coleman's white gas)<br>190 proof bottle of everclear<br>small funnel<br>2 small jars with lids<br>coffee filters<br>Steps:<br>Grind the 150 seeds in coffee grinder. place the seeds into a jar, and add just enough white gas to cover the seeds. Put lid on, shake for five minutes, and let sit for one hour. then poor the solution into a funnel with a coffee filter in it, discard liquid, and let the seed mush to dry. once it has dried, place the DRIED seedmush/powder into a CLEAN jar, and take the Everclear and put it into the 50ml bottle to messure it out. then pour the 50mls of alcohol into the jar. close the lid and shake. let sit for 3 days, shaking a few times a day. then pour the liquid into a funnel with a coffee filter, and save the liquid. discard the seed mush.<br>Poor the liquid into the 50ml bottle and let it sit for 2 hours, after 2 hours any remaining seed power will settle to the bottem. Once that as happened pour the liquid into the jar, and was out the seed mush in the 50ml bottle. pour the alcohol back into the 50ml bottle, there should be some alcohol missing, so take some more Everclear and fill the 50ml bottle to the top. you now have 50mls of drinkable LSA-liquid extract from 150 hbwr seeds.normal dosages for hbwrs is 4-6 seeds. ONE ml of this liquid is equal to 3 seeds!!! drop 3mls into your mouth and its the same thing as 9 seeds, and you wont get sick at all!!!  My trip lasted about 9hours with 4 hours after effects...im not going to go into it, cuz this post is long enough.\n\n\n"
}
