{
 "title": "False Assumption",
 "author": "DazedPorkypine",
 "citation": "   DazedPorkypine. \"False Assumption: experience with Herbal Ecstasy (Ephedrine) (ID 14522)\". Erowid.org. Mar 28, 2005. erowid.org/exp/14522",
 "substance": "Herbal Ecstasy (Ephedrine)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "6 tablets",
   "oral",
   "Herbal Ecstasy"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14522",
   "Male",
   " ",
   "Not Given",
   "Mar 28, 2005",
   "Views: 34835",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was looking for something to experiment with about two weeks ago, when my friend (let's call him Greg) comes up to me and offers me six gray pills. I wasn't quite sure what they were, but according to him they were a stimulant, which i had never tried before (i prefer hallucinogens myself). After a little reassurance from him that they wouldn't harm me physically, I took all of them with a bottle of water (I do NOT recommend taking a drug without having a certain amount of knowledge concerning it. Looking back on the whole thing I realized I was being pretty stupid). I assumed that since he said that they were legal that they couldn't be that bad. I was completely wrong.</p><p>The ephedrine began to take effect about twenty minutes later, with nervousness and increased heart beat. Also I found that I couldn't concentrate on anything or keep still, which caused problems since I was in the middle of a Spanish test. As the effects became more pronounced I found that I could feel every heart beat throughout my body (especially in my fingertips) as if my heart was a fist beating on my chest. If I could manage to keep still, I experienced a warm tickling sensation throughout my body, which felt extremely nice. I felt as thought I had a soft wool blanket covering my body. I began to feel the desire to go outside and run.</p><p>I had PE next, which was convenient since I had a huge amount of energy. I ran out of the Spanish room and ran all the way to PE. In the locker room I found that I couldn't really articulate correctly. I tried to describe what I was on, but my brain just wouldn't put together complete sentences. I managed to get the message across that I had taken some unknown stimulant. My friend (let's call him Pete) decided that I needed to be punched for being such an idiot and socked me in the shoulder, which felt extremely good. It was like a small orgasm in my arm.</p><p>In PE I completed my exercises in record time, and began playing bad mitten. I can't really remember too much, but I know that My mouth wouldn't close, and I felt the urge to chew on something. It was a little like a level 1 trip on mushrooms without visuals. About half way through the class I had to run to the bathroom and hurl, but it wasn't as unpleasant as vomiting usually is. The nausea felt like little pangs of anxiety.</p><p>Next I had Social Studies, but by that time I had completely crashed. I couldn't sit up at all, and when I felt like talking it came out slurred and slightly unintelligible. We were reading about the Holocaust too, and I remembered being hugely affected by the stories I heard. I started crying halfway through one of them.</p><p>After school I walked back to the place where Greg usually hung out, and was told that I had just done herbal exstacy or ephedra. I liked the herbal part (I'm a big believer in those natural drugs), but the exstacy part scared the crap out of me.</p><p>After they all laughed at my stupidity for a while I went and fell into a semi-dream state in the middle of the field. I snapped out of it three hours later.</p><p>All in all I would say that I had a pretty good experience, but it was really stupid to take a drug which I didn't even know the name of. Also the dosage was way to much for someone my size (Greg is easily a foot and a half taller than me and uses four pills for recreational use). I think from now on I'll stick to the psychedelics with the occasional joint.</p>"
}
