{
 "title": "Synergy at its Best",
 "author": "DXMTRIPPER",
 "citation": "   DXMTRIPPER. \"Synergy at its Best: experience with DXM; alcohol; ephedrine; diphenhydramine (ID 14556)\". Erowid.org. May 7, 2004. erowid.org/exp/14556",
 "substance": "DXM; alcohol; ephedrine; diphenhydramine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "354 mg",
   "oral",
   "DXM",
   " ",
   "  T+ 1:30",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 3:00",
   "25 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 3:00",
   "25 mg",
   "oral",
   "Ephedrine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 14556",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 7, 2004",
   "Views: 34750",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At 7:30 PM one Friday night, I ingested 354 mg of DXM (dextromethorphan HBr).  I really did not anticipate doing any other drugs due to the fact that I had stayed up late the night before and was pretty tired.  About 8:30 the first effects of the DXM were felt and I got into a pretty good mood while using the internet and listening to music.  </p><p>After about 1 hour and 30 minutes after taking the DXM I remembered that I had roughly five shots of Tequila stashed away.  My mood was lifted as I quickly downed two shots of the liquor.  Beacuse of the DXM I could feel the alcohol move down my throat and into my stomach, it was a pleasant feeling and I was soon greeted by more disassociation and a care-free mood that left me feeling like I was on type of the world.  It was more of a mental eupohoria than that of a body one like an opiate would produce.  </p><p>After three hour of this same feeling I realized that the alcohol had made the DXM last a lot longer.  I forgot to mention that I had a cold and after about 3 hours of ingesting the DXM and alcohol I also took 1 Benadryl for my nose and just for kicks.  I knew the Benadryl would make me a little drowsy so I also took 1 yellow jacket that contained 25 mg of ephedrine.</p><p>These two pills were washed down  with the remaining 3 shots of Tequila and by the time all of the drugs kicked in I was feeling great.  I experienced the effects from all of drugs at one time.  I could feel the disassocitaion of the DXM, the drunkeness of the alcohol, the sedated feeling from the Benadryl, and the sped up feeling from the ephedrine.  The mental effects of this synergy were amazing but my motor skills and ability to walk straight were highly uncooridinated.  I do not believe I could have walked straight even if I had tried to.  After a while of this I decided that I would go to bed and get a full nights rest...it was about 12:00 am and I needed the sleep anyway.  I drifted off peacefully to sleep.</p><p>Overall this was a good experience and I would repeat it.  The only thing I would change is the amount of Benadryl (diphenhydramine) that I took.  I would take 4 or 5 next time.  Benadryl in high doses is a 'recreational drug' if you could call it that...except it makes you too tired to enjoy the high.  I believe that the 1 yellow jacket would take care of this.  Also, ephedrine, for me, is only good at lower does (under 150 mg), anything above this and I become very agitated and just plain shaky due to over-stimulation.  </p><p>I just wanted to write this to tell about my experience and show how fun synergy can be but I wanted to say that moderation is the key.  Keep cool and stay safe.</p><p>DXMTRIPPER</p>"
}
