{
 "title": "Blue Curaco",
 "author": "John",
 "citation": "   John. \"Blue Curaco: experience with Alcohol (ID 14574)\". Erowid.org. Mar 8, 2007. erowid.org/exp/14574",
 "substance": "Alcohol",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 cups",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 0:10",
   "1 cup",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14574",
   "Male",
   " ",
   "Not Given",
   "Mar 8, 2007",
   "4720",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a report of my first and only time ever getting drunk. It was about 11 pm when I started drinking. I had never gotten drunk before so I just wanted to see what it was like. Being underage (I'm 19) I was not able to buy my own, but we have a liquor cabinet full of booze in my house. Well, this stuff is pretty old, and pretty nasty tasting, so I just picked the best looking one. It was something called Blue Caraco or something. Well, let me just say this stuff tasted horrible. I tried mixing it with orange juice to make it go down easier and it helped a little but not much. I'm not sure if the age of it had anything to do with the taste or the effects the alcohol had on me.</p><p>Being only 125 pounds, it didn't take much for me to get totally smashed. About 10 minutes after the first glass, a small teacup filled about half full, I started feeling 'buzzed.' Not much, though. So I went and filled the cup up and guzzled that. Now, after a little while I started to feel pretty drunk. My vision was blurry and it was hard to walk straight. I was stumbling and swaying, laughing at myself. I tried to walk in a straight line (walking the tiles of the kitchen floor) like the cops make you do.</p><p>I could almost do it but in a few minutes I wouldn't have been able to at all. During this time I was on the computer chatting with people and making a lot of typos, which cracked me up, as did just about everything everyone was saying to me. I do believe I'm a funny drunk. Well, after maybe 45 minutes I thought the stuff might be wearing off, so I had one more drink. That was my last one. I drank all 4 cups in about an hour's time.</p><p>The first hour of being drunk was very fun. I found things funny and kept laughing at myself, and I was not depressed as I often am. I felt heavy. But then I started to feel nauseous, while still very drunk. I didn't know it would happen that soon; I thought the hangover would come later. I got off of the computer and crawled heavily up the stairs and fell into bed.  I think I just layed there and watched a little tv, wishing the feeling would go away. It was very intense. I don't exactly remember what happened next. I puked at least once, but I don't remember if I fell asleep before or after I puked. I just remember puking and not caring that it got all over my face and clothes and floor. Then I think I just passed out.</p><p>I woke up the next morning around 11 feeling quite hung over and not being able to get out of bed. When I tried I just felt too dizzy. So I basically layed in bed and watched (or listened) to the tv for about 4 hours. I finally forced myself out of bed, not being able to stand the smell of the puke anymore. It smelled like the liquor. I still felt dizzy and nauseous and had to lay down a lot. I slowly recovered, but the effects didn't go completely away till about 24 hours after I stopped drinking.</p><p>So, to sum it all up, getting drunk was about one hour of fun and 18 hours of misery and a few more fully recovering. Definitely not worth it. I honestly can't comprehend why people like to get drunk (unless my experience is different that others'). I'd advise anyone like I did. I was completely wasted and didn't know what to expect. And drink something that actually tastes good, and have something ready for when you vomit. And plan to spend the entire next day recovering.</p>"
}
