{
 "title": "A Small Taste of the Action",
 "author": "John Diss",
 "citation": "   John Diss. \"A Small Taste of the Action: experience with Morning Glory (ID 14576)\". Erowid.org. May 11, 2002. erowid.org/exp/14576",
 "substance": "Morning Glory",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Morning Glory",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14576",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 11, 2002",
   "Views: 15285",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n I will go by the moniker of John Diss for purposes of this report. I recently developed an interest in hallucinogens. Acid is hard to find where I live, and shrooms are too expensive, so I decided to go for Morning Glory seeds. \r\nI went to k-mart and bought 3 grams (2 packs) of Martha Stewart brand Heavenly Blue seeds. WHen I got home, I rinsed them off in watter, stuck them in a bag, and crushed them up by pounding them with a wrench. I then stuck them in a glass with some water and microwaved them for 1 minute.\r\nI drank the potion, which wasn't really as horrid tasting as most people describe it. I then ate the remaining seeds out of the glass and waited for the effects.\r\nAbout 20 minutes later I started to feel a little shaky with slight stomach discomfort. ABout 15 minutes after that I found that everytihng was absolutely hillarious. I'd sit around looking at pictures and things and just crack up laughing.\r\nI felt like a kid again, but I had the experiences of a 16 year-old. I was able to look at anything and see beauty and life in it. I remember thinking that all the little things we don't think of contain the very essence of life itself.\r\nAt about 9:45 pm I was peaking. At that point I started thinking deep, philosophical thoughts. I learned a lesson from my trip, and that lesson is as follows: no matter how stressfull and complicated life is, it can always be broken down into simpler things that are easier to deal with.I came off of my trip spmewhere around 2 am. I had trouble falling asleeep untill about 3:30 am when I finally took a few swigs of robutussin.\r\nAll in all, the experience was VERY worth it. It only cost me 2 dollars, and I see life with a cmpletely different outlook.\n\n\n"
}
