{
 "title": "A Strange but Wonderful Goddess",
 "author": "The_Minds_I",
 "citation": "   The_Minds_I. \"A Strange but Wonderful Goddess: experience with Banisteriopsis caapi, Psychotria viridis, Mimosa hostilis, & Syrian rue (ID 14587)\". Erowid.org. May 11, 2002. erowid.org/exp/14587",
 "substance": "Banisteriopsis caapi, Psychotria viridis, Mimosa hostilis, & Syrian rue",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "85 g",
   "oral",
   "Banisteriopsis caapi",
   "(extract)",
   " ",
   "75 g",
   "oral",
   "Psychotria viridis",
   "(extract)",
   " ",
   "25 g",
   "oral",
   "Mimosa tenuiflora",
   "(extract)",
   " ",
   "4.0 g",
   "oral",
   "Syrian Rue",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14587",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 11, 2002",
   "Views: 18187",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI feel I should explain the dosage.  These are all measurements before I extracted and encapsulated.  Actual ingested amounts were much much lower.<br>PREPARATIONS<br>To extract I used a big pot filled half with water and ground up the psychotria(DMT), banisteriopsis(MAOI), and mimosa(DMT) with a coffee grinder until they turned to a rough, chunky powder.  I then added 2000mg(1g)(500mg vitamin C pills) Ascorbic acid and about 3/4 cups (prox. 180mL) lemon juice.  Through it all together and cooked it for 3 hours, let sit for 8, cooked another 1 hour.  I then strained the water (While still hot) and I let if simmer (very light heat) in a skillet until almost all the water evaporated (but not quite all).  I then put the mixture on a cooking sheet and evaporated the rest of the water.  What was left was a dry powder.  I scraped it up with a razor then grinned it up again with a coffee grinder and encapsulated them in '00' gel caps.  The syrian rue(MAOI) was bought extracted and simply gel capped.<br>EXPERIENCE<br>I HATE the taste of ayahuasca.  It's terrible as a tea or otherwise.  So I decided to put them in gel caps, probably about 30 caps in all including peganum harmala (syrian rue).  This being my 3rd experience with the stuff.  After mixing the rue with water and drinking or simply spooning the wicked stuff down and then drinking a mild-to-disgusting tasting ayahuasca tea the times before. <br>So I downed 2 rue caps and 1 of the mixed.  Immediately I felt the rue (it being slightly psychoactive itself), a lethargy a perceptual change, but nothing more.  So I downed 2 more mixed caps, still nothing, not even a stomach upset occurred.  I started contemplating what I did wrong and took a couple more pills.  Maybe not enough MAOI action, so I took about 3 more harmala pills and a couple more mixed.  By now I have taken about 10 or so mixed and 5 rue in about a 2 hour span, watching TV and waiting.  My anticipation turns into disappointment.  I take 5 more mixed in a last attempt still nothing.  I go for a walk and return, oh well, I started to get hungry, there was 1/2 a subway sandwich in the fridge.  So I ate it.  Then BANG all of a sudden my world falls apart (Apparently the DMT can get stored in the gall bladder and liver.  When you eat something that contains fats it gets released.  At the time I didn't know.  I thought I ate something that mixed with the MAOI).  My vision quickly went to 2 to 3 dimensional OEVs & CEVs (open eye, closed eye visuals).  Sound was astounding.  Time stood still.  I felt all my chakras open.  An instant channel of intuition opened.  All was PERFECT in this world.  Thought streamed by almost before I could comprehend it.  WOW, I thought, I am stoned!<br>An interesting thing you must watch is where you focus your attention in this state.  I had this thought about aliens taking my body over, quickly I turned my attention to the TV and turned the sound up.  Sitting became difficult, so I laid down.  There was also a peculiar washing or swishing sound that didn't go away.<br>All in all it was a 'good' trip.  Excellent visuals, enhanced sound, and touch.  I was amazed I didn't purge this time.  All the ayahuasca was digested before I tripped which worked out nicely.  It was probably 90% sense enhancement and 10% mindf*ck (or less).  Ayahuasca also has a tendency to make me examine my psychology.  My beliefs and my goals.  I would suggest ayahuasca to any psychonaut, but it should be used more as a medicine to clarify your life than for it's properties.  WARNING-This drug is the only one that seems to have it's own personality!\n\n\n"
}
