{
 "title": "Stops Anxiety and Depression",
 "author": "stranger",
 "citation": "   stranger. \"Stops Anxiety and Depression: experience with Kava (ID 14609)\". Erowid.org. Apr 1, 2005. erowid.org/exp/14609",
 "substance": "Kava",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14609",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 1, 2005",
   "Views: 46937",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn order to quit a long term MJ habit, as well as curb my generalized anxiety disorder and depression, I turned to Kava Kava. In the past I have been on Zoloft, but found that it left me anxious, and changed my personality.  Having been over the illegal drug scene for some time now (I have experimented with hallucinagens, painkillers, MJ), and having some long lasting effects from previous trips, I now want to live a life that is drug free (except for occasional alcohol, various herbs, and caffeine).\r\nI have found Kava to be a very helpful herb.  I have read many reports about kava from people that seem to think Kava does nothing.  I believe that these people either a) don't prepare it properly b) are using weak pills c) are just not noticing this sometimes subtle substance.  Once I noticed the effects and found a way to prepare it properly, I have found much improvment in my life.\r\nPreperation: I use wild crafted Kava Kava root from the local herb store.  2 parts Kava to 4 parts water.  Bring to a boil.  Boil for 5 minutes.  Strain through wire strainer.  Push down on the root to extract more.  Pour into cup, let cool enough to drink.\r\nDrinking:  I love the taste of this tea.  I drink it straight.  It has an earthy taste.  For some reason I find it very pleasant.  If my mouth is numb from the first swallow, then I know I have made a good batch.\r\nEffects:  When I breath in I can smell the Kava in my nose, much the same way with MJ, and I know it is starting to work. A warmth envelopes my head. It is at first similar to a mild head change from pot.  I will feel slight euphoria that then settles to a calming, peacful effect.  Kava closely mimics the effects of clonazapam (in the valium family), though I find it to be stronger.  My limbs become a bit heavy, my entire body relaxes.  My head feels clear.  It often gets me in a 'nostalgic mood', and I like to just sit and think, or go for long walks and think.  I feel very creative and like to work on art and listen to music.  Unlike the paranoia, apathy, laziness, and anxiety I get often with MJ, Kava seems to have no negative side effects.\r\nConclusion:  I have read that long term use of Kava results in liver damage and dry skin, so I use it in moderation.  When I do use it I tend to drink a few cups, by myself throughout the afternoon and night.  I usually have wild, vivid dreams on Kava, and I wake up feeling very rested.  Kava mixes well with MJ and valerian root, but not so with alcohol.\r\nI think of Kava as the 'grown up' drug.  Now that I am a bit older and wiser, and am not looking to get 'fucked up', I have found Kava to be a nice friend.  I believe that all the reports I read of people feeling ripped off from Kava, are people who are just not ready for what kava has to offer.  It is not something to get tore up from, it is something to help one meditate, relax, and enjoy.\r\nFor people who suffer from anxiety and depression, I strongly urge them to try Kava.  I find it is legal, natural, and very effective.\n\n\n"
}
