{
 "title": "2 Days with 5-MeO-AMT",
 "author": "Tobins",
 "citation": "   Tobins. \"2 Days with 5-MeO-AMT: experience with 5-MeO-AMT & Cannabis (ID 14638)\". Erowid.org. May 14, 2002. erowid.org/exp/14638",
 "substance": "5-MeO-AMT & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7.5 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)",
   "  T+ 6:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(flowers)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14638",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 14, 2002",
   "Views: 19407",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n     After talking with a friend via AIM, I decided to purchase us 50 mg of 5-meo-amt.  I received the package and dissolved the off white powder with 10mL of 190 proof ethanol alcohol and used a syringe to measure doseage for I did not have a balance capable of measuring to the nearest tenth of a milligram.</p><p>     I ingested 1mL (5mg of 5-meo-amt) of this solution around 11AM on a Sunday morning.  I had not eaten anything for at least 12 hours.  I started to experience stomach pains about 15 minutes after ingestion.  It felt like I ate way too much greasy food.  It intensified until around 1 pm (2 hours after ingestion) and it started to let up.  It took another hour for it to disappear completely.</p><p>    I was then left with a tingling kind of buzz similar to what one feels if they smoke a cigarette.  I was suprised I was not seeing major visuals or having altered thoughts.  I decided I was sober enough to go about my daily chores so I went to the hardware store to pick up some weed eater string.  I found it difficult to recognize objects for what they were, but had no coordination problems.  This feeling persisted a total of 13 to 14 hours after ingestion.</p><p>     Around 11PM, I smoked a bowl of nice marijuana with a friend and noticed that the usual slight visuals I get after smoking were instensified.  I also noticed that I had much greater couchlock.  Euphoria was much more intense as well.  Also, after the marijuana wore off, I still felt quite euphoric and still had subtle visuals (long afterimages).  That is about it for that trip.</p><p>     One week later, I ingested 7.5mg of 5-meo-amt with the same technique as described above.  I ingested around 3pm.  I felt no nausea at all this time.  I believe this is because I ate a couple finger sandwiches an hour before ingestion.  The same effects proceeded during my day but they were slighlty stronger.  Before, the buzz I had was barely there.  I could easily forget I ingested anything.  This time the buzz was slightly stronger and I could not ignore its presense.  After trying to clean my room for a couple hours, I grew very sleepy and decided to take a nap.  It was 5 pm when I tried to sleep.</p><p>    I don't know if I actually fell asleep, but it felt like I was dreaming and conscious at the same time.  This trance was easily broken by moving around and blinking my eyes some.  This was a nice experience if I could lie around all day...  Anyway, the nap refreshed me slightly.  I still felt lethargic.</p><p>    Around 9pm, I smoked a small bowl of some nice marijuana I had.  Almost instantly, my afterimages started to bleed and last longer.  The euphoria from every hit of the marijuana seemed to grow stronger and stronger.  I found that I had what I thought was better tactile and visual acuity.  After the marijuana wore off, a couple friends came over and we went out for coffee.  I still had a euphoric buzz until around 3am that early morning.</p><p>    I never had any hangovers other than slight after image effects, which persisted most of the next day.  They were completely gone the day after that.</p><p>    I may smoke 5mg of 5-meo-amt to see if there is any difference between the two ingestion types.  As for anyone interested in this drug, based solely on my experience it is not worth the possible unknown side effects for the ever so slight buzz I felt.</p>"
}
