{
 "title": "My Great Trip",
 "author": "Experienced_Tripper",
 "citation": "Citation:   Experienced_Tripper. \"My Great Trip: experience with Morning Glory (ID 14642)\". Erowid.org. May 14, 2002. erowid.org/exp/14642",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14642",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 14, 2002",
   "Views: 30713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe reason I am writing this is because back in Febuary 2002 I\r\ndecided to experiement with Morning Glory seeds. I accidentally\r\ncame upon this website and actually researched the seeds before\r\ntrying them. You guys gave me so much good information that I\r\ndecided I should give back.\r\nHere's how it all happened for me. On 1 afternoon I went up to\r\nthe local K-Mart to look for MG:HB seeds. While in there I found\r\nMartha Stewart brand MG:HB seeds. I proceeded to buy 4 packs\r\n(6grams, roughly 240 seeds). Then I came home and prepared the\r\nseeds. I washed them with dish washer soap, then dryed them on a\r\npaper towel, then ground them up in a coffee grinder.\r\nAt 9pm I poured the seeds into a cup of water. Then drank the\r\npotion and ate the remaining chunks of seeds. It was pretty\r\nnasty but definetly wasn't that bad. At about 20 minutes the\r\neffects started to kick in. But these were mild effects. Also\r\nthough, my stomach started to hurt and my limbs became very\r\nheavy. So i drank some pepto to help my stomach. At about 1 hour\r\nthe effects really started to kick. And once the trip began to\r\ntake over all stomach pain just left. At 1st I began to think of\r\nit as just a mild acid trip, which I was happy with. It wasn't\r\nuntill about 2 or 3 hours into it that the MG trip REALLY began\r\nto kick hard. Then it felt exactly like an acid trip. Walls were\r\nrolling and breathing. When i walked around the house the floor\r\nbegan to slant. It felt like the world was tilted. Once I turned\r\nthe kitchen light on I was very light senstive. It felt as if\r\neverything was glowing around me. Best way to describe it is,\r\nimagine walking out into the street in the middle of the night,\r\nstanding directly under a street light, you can feel the light \r\nbeaming down on you. Honestly, the peak lasted from about 11pm\r\nto 5am. It was very intense and lasted for a very long time. and\r\ni mean peaking, I'm not counting the 'afterglow', which as\r\neveryone knows goes on for many hours after the peak is gone.\r\nIn conclusion, I highly recommend it, it was fantastic. I've\r\nread many negative reports on here, and I've come to many\r\nconclusions. Maybe they had to low a dosage, got bad seeds, or\r\nweakened the seeds during the extraction process. My advice,\r\nget at least 6grams, clean them, dry them, grind them, drink\r\nthem. And don't forget the pepto.\n\n\n"
}