{
 "title": "Electric Soma Retrospective",
 "author": "Che Guevara",
 "citation": "Citation:   Che Guevara. \"Electric Soma Retrospective: experience with Carisoprodol (Soma) (ID 14649)\". Erowid.org. Jan 28, 2003. erowid.org/exp/14649",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 14649",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 28, 2003",
   "Views: 79877",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n I come from a very medical family, and drugs are happened upon quite often.  Note that is a summary of past uses which occured a while ago.  Last February or so I 'happened' upon some soma (350mg) tabs.  I was very dissapointed that they weren't the soma/codeine compound, but hey you make do with what you have.\r\n   At that point I had never tried them before, so I started off with experiment level doses of 1-2 tabs in different settings.  With one pill, 350mg, if my stomach is empty within about 15 minutes I feel very relaxed, much more so than with one Valium.  But there is also a sloppyness present not seen with benzos.  \r\n  After a few more of these experiences I seriously bumped up the dosage to between 4-5 pills per hit.  To me soma is VERY fast acting.  Usually I would open a beer or ready a glass of wine to sip after having chugged the pills with water, but I would always awake from my Soma slumber having not even nearly finished the weak spirits.  \r\n            -----------ELECTRIC--------------------\r\n    Almost immeaditely (on empty stomach) I would get very, i dont know how to describe the feeling, its kinda like alcohol, kinda like sedatives, kinda like something entirely different.   The one thing that competely seperates a Soma high from highs produced from other drugs (legal or illicit) is the 'charged' feeling.  Its like Whitmans' I sing the body electric.  Ive never felt like this on MDMA, so in my opinion the body buzz is quite unique.   The only thing is, for me to get the 'electric' feeling Id need to take such a high dose that it was for me impossible not to pass out.  Dont worry though, its not a frightening passing out, its just an uncontrollable urge to sleep. \r\n      WARNING\r\nI read another report where somebody took 5 somas, and they were spaced out over a few hours and they ended up in the hospital.  We all have different blood chemistry, so always start with the prescribed dosage for any drug, then slowly work up.\r\n  In  Conclusion\r\nI find soma to be an enjoyable drug, it also has a sexual side to it in high dose, its even stronger than THC.  You just get that feeling that u have to......\r\n   I never mixed it with anything save alcohol, so i think if you get the chance to aquire some do it. I think somas mixed with Cannibas could make for some amazing body buzzes(and also take away paranoia), not to mention make for some killer sex/j.o. sessions.\r\n  Have fun kiddies!\n\n\n"
}