{
 "title": "My Great Trip",
 "author": "Experienced_Tripper",
 "citation": "   Experienced_Tripper. \"My Great Trip: experience with Morning Glory (ID 14642)\". Erowid.org. May 14, 2002. erowid.org/exp/14642",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14642",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 14, 2002",
   "Views: 30713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe reason I am writing this is because back in Febuary 2002 I<br>decided to experiement with Morning Glory seeds. I accidentally<br>came upon this website and actually researched the seeds before<br>trying them. You guys gave me so much good information that I<br>decided I should give back.<br>Here's how it all happened for me. On 1 afternoon I went up to<br>the local K-Mart to look for MG:HB seeds. While in there I found<br>Martha Stewart brand MG:HB seeds. I proceeded to buy 4 packs<br>(6grams, roughly 240 seeds). Then I came home and prepared the<br>seeds. I washed them with dish washer soap, then dryed them on a<br>paper towel, then ground them up in a coffee grinder.<br>At 9pm I poured the seeds into a cup of water. Then drank the<br>potion and ate the remaining chunks of seeds. It was pretty<br>nasty but definetly wasn't that bad. At about 20 minutes the<br>effects started to kick in. But these were mild effects. Also<br>though, my stomach started to hurt and my limbs became very<br>heavy. So i drank some pepto to help my stomach. At about 1 hour<br>the effects really started to kick. And once the trip began to<br>take over all stomach pain just left. At 1st I began to think of<br>it as just a mild acid trip, which I was happy with. It wasn't<br>untill about 2 or 3 hours into it that the MG trip REALLY began<br>to kick hard. Then it felt exactly like an acid trip. Walls were<br>rolling and breathing. When i walked around the house the floor<br>began to slant. It felt like the world was tilted. Once I turned<br>the kitchen light on I was very light senstive. It felt as if<br>everything was glowing around me. Best way to describe it is,<br>imagine walking out into the street in the middle of the night,<br>standing directly under a street light, you can feel the light <br>beaming down on you. Honestly, the peak lasted from about 11pm<br>to 5am. It was very intense and lasted for a very long time. and<br>i mean peaking, I'm not counting the 'afterglow', which as<br>everyone knows goes on for many hours after the peak is gone.<br>In conclusion, I highly recommend it, it was fantastic. I've<br>read many negative reports on here, and I've come to many<br>conclusions. Maybe they had to low a dosage, got bad seeds, or<br>weakened the seeds during the extraction process. My advice,<br>get at least 6grams, clean them, dry them, grind them, drink<br>them. And don't forget the pepto.\n\n\n"
}
