{
 "title": "Disorder",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Disorder: experience with Tramadol (Ultram), Fluoxetine & Venlafaxine (ID 14674)\". Erowid.org. Apr 13, 2005. erowid.org/exp/14674",
 "substance": "Tramadol (Ultram), Fluoxetine & Venlafaxine",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " ",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " ",
   "  ",
   " ",
   "Pharms - Venlafaxine",
   "(daily)",
   " ",
   "  ",
   " ",
   "Pharms - Fluoxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 14674",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 13, 2005",
   "Views: 16825",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a big opiate fan, and really wanting some percocet or tylenol #3 but having none, I decided to try ultram, which my mom had but never took. The first time, I took two 50mg tabs, and after about 30 minutes I could feel it taking pleasant effect. I've taken ultram maybe 15-20 times, but here is the most significant event.</p><p>(n.b.-- I also take ssri antidepressants, effexor and prozac.)</p><p>[Erowid Warning: Tramadol has been associated with seizure activity, especially when taken at high doses, when taken for multiple days in a row, and in combination with other pharmaceuticals.  The FDA has warned that there is an increased risk of seizure when Tramadol is taken with SSRIs, Tricyclic anti-depressants, other opioids, MAOIs, neuroleptics, and other drugs that reduce seizure threshold.]</p><p>Wednesday. The past few days I had been taking ultram here and there, and apparently I got a little excited and by that evening I had taken 24 50mg tabs (1200mg). I had a codeine-like mental effect, but at the same time it was like being on speed. I was shaking like a bitch, itching, and most of all I noticed I *could not* keep my eyes still. Couldn't look in one place for more than a second or two. I was still kind of fucked up in the morning.</p><p>Thursday evening. Sitting in the car in the parking lot of a grocery store while my mom is inside. I had taken four ultram earlier and was feeling kinda buzzed, so I decided to take two more. Everything was okay for a few minutes. I put on one of my favourite cds and turned the volume up. It was still light outside, but getting dark, a little twilighty.</p><p>Suddenly my right leg started shaking really bad, and I couldn't stop it. The feeling spread up to my right arm which also started spazzing out of control. It was such a scary feeling, like being paralysed, but worse. My neck got tight, I couldn't move my head, and the entire right side of my body was out of my control. This all happened within a few seconds. I remember thinking, oh fuck, I'm having a seizure. And really, that's the last thing I remember.</p><p>Later. I wake up. I am still in the car. It is completely dark. I don't know where I am or how I got here. I look around and truly believe I am in a different city I've never been to before, even though I have lived around here my entire life. It felt otherworldly, like a dream. Thinking back, judging from where the cd was when I regained consciousness, I was out for maybe 20 minutes. I just sat there with a very simplistic one-track mindset listening to my music for a while before I start to wonder what the hell happened. Slowly (very, very slowly) I began to piece it together and come to the conclusion that (oh shit) I've just had a seizure. However, I still have the codeine-like mellowness going, so it doesn't really sink in.</p><p>Just then my mom comes out, she gets in the car. I wanted to ask her where we were and why we were in another city... Thankfully, just in time, as we were leaving I realised that we weren't in a different city at all. Then it hits me. Ohhhh fuck. This really happened. I am so screwed. And I was still pretty high, so I was afraid of it happening again. As soon as I got home I drank a ton of water constantly for about an hour and laid down on my stomach. This seemed to help to take a lot of the edge off of it, but I was still shaky, and every time I twitched I had this terrible fear that I'd lose control of my body again. Thankfully, I didn't.</p><p>I don't know why 6 ultram gave me a seizure and 24 didn't--- maybe it was the buildup of it in my system. Maybe my antidepressants had something to do with it. In any event, it was not fun. In fact, it is shite having a grand mal in a fucking grocery store parking lot and then not knowing where you are.</p><p>Other than the seizure (yeah), ultram is okay. Just okay. It really doesn't work incredibly well for pain, not like a real narcotic, though it does have a narky feel you also get that speediness with it if you take more than 200mg or so. I much prefer oxycodone or codeine, it's much more pleasant and I haven't ever had any bad side effects from those. And if you take ssri antidepressants-- beware. They did not mix well.</p>"
}
