{
 "title": "I Don't Know What To Think",
 "author": "Joe",
 "citation": "   Joe. \"I Don't Know What To Think: experience with Paroxetine (Paxil) (ID 14714)\". Erowid.org. Feb 21, 2004. erowid.org/exp/14714",
 "substance": "Paroxetine (Paxil)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Pharms - Paroxetine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14714",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2004",
   "Views: 14349",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was originally prescribed the drug for severe depression.  It sure helped me, allright, a little too much!  It put me into a manic state, which got higher and higher with each day I was on it.  The mania made me feel invincible, so energetic, non-stop talking/ moving/ laughing.  It felt great, especially after being so depressed for so long.  It made me feel like I can accomplish anything.  I would get up early and not even be tired from lack of sleep.  I would go out and exercise like running (like a maniac lol) without hardly getting tired.  </p><p>The problem is that it just made me too crazy and I was bound to get into trouble with it.  So they took me off it and it faded away quickly.  But I thought, what if I just took a smaller dose than they gave me?  Wouldn't it energize me without making me manic?  So a couple years later (now) I decided to find out.  So I took some more and sure enough this is just what it did.  I felt happy, confident, energetic, optimistic, etc.  It was great.  </p><p>But after a while it seemed like it was fading away, like it was all a placebo or the effect was just in my mind.  So I raised the dose but still no effect.  So I really don't know what to think of the stuff but I'm now going off it to see if I feel any different.  Another person I know who took it for depression also said that it made him manic.</p>"
}
