{
 "title": "Man As Nature",
 "author": "mind_milk",
 "citation": "   mind_milk. \"Man As Nature: experience with Salvia divinorum (10x extract) (ID 14725)\". Erowid.org. Apr 13, 2005. erowid.org/exp/14725",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE:",
   "0.75 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14725",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 13, 2005",
   "Views: 3713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me start off by saying that I don't believe salvia in itself has the power to teleport my mind to new realms, worlds etc.. I am a christian and I believe that nature is in a constant state of praise and worship of God. I believe that salvia has shown me that the essence of nature has tremendous respect for the divine even though man has brought it into an imperfect state of being. On my first time to listen to the teacher plant, I was too confused and afraid to know what really happened, but the second time I took a stronger dose and I made sure I remembered the details as much as I could. But if I truly wrote down 1 true glimpse of what I saw, this expeience report would go on for eternity. <br>Here is a short version of my 2nd experience: I went to smoke outside to experience nature and salvia. I took one pipe full and inhaled the hot fumes, by the third puff (and the end of that bowl) my ability to hear grew by 100 times. I heard sound of what I thought were miles away. I smoked another bowl. At this time I had forgotten where I was and I didn't dare to walk about. The sounds I heard became meaningful, I could now understand the speech of the birds, the trees, the ground and the wind. At first they were all saying 'Christ is risen, Christ is risen'. I caught the attention of these forces and creatures and they began to talk about me as if they were unhappy I could understand them. Perhaps they were confused that I was now able to understand them. I stretched out (what I think was my leg) and I noticed the the chirping of the bird to my right increased 100 fold with every movement. The bird was saying 'hey hey hey what is that???' Another type of bird to my left said as I moved 'He's moving he's moving is he come to destroy us?' the wind calmed these animals with wisdom and the birds knew what I had done. I felt as if I didn't belong here and as if my egotistic vain person should be ripped from such a marvelous place. <br>I closed my eyes to escape the chatter... There I saw that there were even creatures in the darkness, not evil, but wise... I saw mounds of sand flowing over a cool evening in a desert.  those mounds formed into sideways eye lids and they opened! Orange cat eyes of fire! A wise beast growled not with anger but as if I had awakened him from slumber. I saw many other things, a door that opened up into an electric garden, a lamp (\n\n\n"
}
