{
 "title": "Story from a Nonbeliever",
 "author": "Scott",
 "citation": "   Scott. \"Story from a Nonbeliever: experience with Salvia divinorum & Carbamazepine (ID 14766)\". Erowid.org. Mar 28, 2005. erowid.org/exp/14766",
 "substance": "Salvia divinorum & Carbamazepine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Pharms - Carbamazepine",
   "(daily)",
   " ",
   "3 bowls",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14766",
   "Male",
   " ",
   "Not Given",
   "Mar 28, 2005",
   "5726",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Sunday morning 4am </p><p>Smoked about 3 big bowls of Salvia D regular leaves thinking nothing would happen. </p><p>Boy was I wrong!!!!</p><p>32 year old male, 200lbs</p><p>Have seizures for 12 years now</p><p>Medication - Tegretol 200mg twice a day</p><p>I just came back from doing salvia about 30 minutes ago, and I am in total shock. First off I have no idea how I am going to be able to describe this. I did this in my bedroom with my wife as a sitter. I had no lights except for the light coming from the TV. I played my music (Pink Floyd Comfortably Numb) on my kids playstation one. It has these different background images you can choose from and they move to the music. I picked the darkest one, and even covered the tv with a blanket so I could barely see the light from it. I also had some incense burning. I experienced 3 trips or what seemed like 3. </p><p>First hit nothing, second hit things started to move 3rd hit, and I was on my back again as if some force pulled me there. It seemed as if the whole room was spinning round and round. I laid there silently and noticed that I must need a little more, since I was a little afraid I didn't pack a very big tight bowl, so I had already instructed my wife to have it full If I happen to ask for more. I asked for more, and I remember saying aloud 'Salvia I am going to try this one more time, and turn myself over to you so please show me what you would like me to see' At this point I then took one long hit from the water pipe and I then noticed what seemed to be doors or windows falling from the corner of my closed eyes. Things seem to always come at me or towards me from the corner in 3d. I made myself take two more hits without even lighting and there was still plenty smoke in the pipe. It was these two that threw me into what I believe was the real starting point of the trip. I seem to always be forced to lie down, no matter what i cannot control it, and always end up on my back. </p><p>I seen these great tall green walls that looked like paint being poured from the ceiling and that wrapped me tightly. It seemed that everytime it wrapped me I had this cold, warm, clammy feeling all over my body. That was the weirdest. I mean I could feel something, sweaty feeling i guess. That part of it was totally weird. I always had this sense though that everything was going to be fine, and I was very comfortable. I never seen a person or entity, but felt that there was one there and I was not able to hear them or see them, but could feel that 'IT' was somehow communicating with me saying 'Everything is fine, Relax' So i did. I can't believe how calm I was this time as I was so nervous the first time. I then remember thinking my wife is going to move or say something and it is going to end, and I wanted so bad for it not to. I also seem to always feel my eyes wanting to open, and I know these visions will be gone, and I try so hard to keep them shut, but they open anyway. I then start to somehow be able to notice that tiny bit of light from the TV that was not noticable before, and my eye's open even though I try so hard to keep them closed, and it's over. </p><p>I was so freaked out by this that I told my wife that I just had to do it again. I just had to. I filled the pipe again, and this time saying the same prayer as mentioned above. This time the same thing, I seem to just fall back on my bed really slowly (I also advise a sitter cause I can tell had it not been for my wife I would have just dropped the water pipe on the floor or bed). This was a little different this time I can't recall exactly what I was seeing but it seemed like doors were falling from the corners of my eye, always from an angle, and thats the way it starts for me (at least on this occasion) I am able to see something start to lean towards me and thats when I always begin to lay back really slowly. I remember thinking as I was falling back that i thought I still had the pipe in my hand and took one last toke. My wife said she had already taken it though, but like I said I thought I took one more toke, and remember holding my breath as if I was holding in that hit, and I remember finally exhaling really loud, and my wife also reminded me of this. </p><p>I was being brought into salvia's world slowly like something formed under and around me, and took everything in the room except my wife. I can't say what the form was as it seemed to move really fast, but it was so beautiful, and moved in this circular motion, like you were taking a pen and drawing a cloud on a piece of paper......thats how it moved, then I was there. In the same state of mind as before but this time it's like everytime I moved my head from side to side patterns and images would follow the movement of my head. Like I could see so clearly with my eyes closed anything that was there in this weird place. I didn't actually remember to much of this until my wife told me my head was moving and I kept reaching for something with one hand. You know how you make shapes with your hand on the wall (the shadows) well she said my four fingers were closing together with my thumb up and down like I was making a talking motion with my hand or reaching for something. I had no idea that i was even doing that and still don't remember it. I seen all kinds of shapes and patterns that I just have no idea what they were, and just wish i could describe them to you all, but can't. I then get the feeling again that my eyes are trying to open again, and I feel that this must be when I am coming down from it. They open DAMN!!!!! and it's over again. </p><p>This time I had to piss really bad, and went to the bathroom and pissed what seemed like forever. Funny thing is I tried to pee before I started and nothing but a few drops would come out. Well at this point I am still not ready to give up. I wanted so bad for this to happen the first time I did Salvia about 4 days ago, and I think that's why it didn't because I was so anxious. So i decided to take one more bowlfull. I said the same prayer as mentioned above and sucked down a huge lungfull. I should mention that this time I turned my back to the tv hoping that little bit of light wouldn't interfere this time. Took about 3 hits and here it comes again some shape out of the corner of my eye, (eyes are closed already at this point) like doors falling down on me (always from the left side too). It does the exact same thing...as they are coming down this is when I start to fall back on the bed. Once I am laying all the way down that circular motion starts again and takes everything in the room except my wife, and then I am there. This time I feel a little nervous when the spinning stops and I seem to be laying very still. Then I see something yellow and black moving towards me, it is huge, but I can't make out what it is. I know it has humps, one right beside the other, 3 on each side of the body. </p><p>Later I was able to recall that this was a spiders legs or so I believe. I remember being scared this time (not real scared, but freaked out by what I was seeing and not too comfortable this time), and wanting to go back to my room, cause I sure as hell wasn't in my bedroom anymore. The reason I say this was a spider was because I felt myself rolling over, and actually did roll over, all the way to my stomach with my face real tight in my arm, like I had wrapped my arm around my face to smother myself, and do remember gasping for air. My wife said I made some noise, and I also remember making a noise, but didn't think nothing of it. At this point the cd was switching songs I believe, cause I said out loud what happened to the music, and I had already instructed my wife not to speak at all, and when she didn't answer I thought oh my god, I'm still there.......Take me back, so I'm still lying there and the music starts to play again, and I say aloud there it is. I then feel my eyes wanting to open again, and they do, I see the clock and it's over. I sit up and talked to my wife about this for over an hour, because we both believed that it was just weird for anything like that to really happen (meaning what we had read in other folks trip reports) and I just had to convince her that i was just totally freaked out by this, and convince her it was so real. </p><p>I really felt like I had left for a short period of time, and had no way of explaining to her where I went. This was only maybe 15 minutes from the 2nd trip where I had already emptied my bladder, and can you believe that I had to go again, and again seemed like I pissed forever. Weird. </p><p>This was the most awesome thing that had ever happened to me, but I have to admit that i loved every minute of it. I felt so safe there, and was constantly being comforted by something except in the last part about the spider. I felt as if it was wrapping me up in a cocoon. I didn't like it *LOL* It was so real. I just can't begin to say how real it felt. I must mention that all things I saw were in bright colorful patterns and designs, 3 dimensional. Always so big, and stretched out so far, like there was no end to it. Some of the patterns and designs moved so fast it was hard to tell what they were. I don't know much about the trip scale but in my mind I would rate this a 3 or 4 cause it was just out of this world. I never believed after reading others trip reports that I would be sitting here writing this. I just didn't think it could happen I will surely do this again, and all I smoked was plain leaves. Hard to imagine what i might see and feel off of some 5x. Think I will just stick with this for now, the leaves that is. I will never forget this for as long as I live.</p>"
}
