{
 "title": "Empty Stomach a Must",
 "author": "Gumby",
 "citation": "   Gumby. \"Empty Stomach a Must: experience with 2C-T-7 (ID 1478)\". Erowid.org. Oct 6, 2000. erowid.org/exp/1478",
 "substance": "2C-T-7",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1478",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 6, 2000",
   "8372",
   " "
  ]
 ],
 "report": "<p>\nWhere my first two attempts failed, my third came through in an incredible way.  I have used acid and shrooms on a number of occasions, but experienced dissapointingly mild visuals even at high doses.  I still chose to approach this new (legal) drug with caution.</p><p>My first try was at 20 mg - no effects.  My second was at 40 mg - mild loss of coordination.  My most recent time, I fasted for 36 hours, drinking only water, and then took 60 mg, leading me to the most visual trip of my life.</p><p>12:30 I came home from work just after midnight and weighed out 60 mg powder and ate it.  The nasty mediciny taste washed out after about 30 minutes.  I throw in 'Lolita' on DVD to kill some time because it takes about 2 hours for the trip to start.</p><p>2:30  This movie is seriously weird.  I think part of it is due to the effects of the 2C-T-7 coming on. Bits of color start splashing on the black and white screen. The ceiling fan starts morphing.  I feel very pleased inside because I'm finally getting this stuff to work.</p><p>3:00 The movie ends, and I get up to go to my room and get some cigarettes.  There's a good stagger in my walk, but I make it.  When I take my hand down from the light switch, I start seeing some mega tracers.  My hand and arm leave an 8 inch trail behind them.  I venture outside to go for a walk and have a smoke.  The nicotine gives me a serious buzz, numbing my feet and fingertips.  I can tell I'm walking weird.  The trees are moving all over the place and taking the shapes of mysterious animals, waving me on.  My hearing is very acute.  Everything is disproportionate, seeming too close or too far away, including the ground, but I manage to stay upright.</p><p>3:30 I get a bit overwhelmed and head back inside.  The bathroom is incredible. The shower curtain is like a work of 3-D art, enhanced with flowing colors.  The toilet paper designs bubble in and out as if boiling.  The floor swirls all around, and even the white walls bend, and are covered with bright little specks that fly around.</p><p>4:00 Leaving, the walls of the hallway bend and twist. As I head into my bedroom and notice some whippets.  I crack one open and blast with good feelings.  Not like a normal whippet, just intensely good physical and mental feeling.  The textured ceiling flows like a river as I lay back.  Specks of color are flowing everywhere.</p><p>4:30 The trip is still going full blast, but I am exhausted, and I try to sleep.  My mind fills with dissociative thoughts, and any time I open my eyes, the visuals are instantly there wherever I look.  I'm able to pleasantly fall asleep while still riding the plateau, and have no bad dreams or any problems getting to sleep.</p><p>In conclusion, this stuff works in a serious way on someone who has had a hard time with other hallucinogens. I think it is extremely important to have a very empty stomach.  This may have been the reason I didn't go the first two tries. I had no nasuea or neck/shoulder pain.  I never had a hint on any negative feelings, or felt any potential for a 'bad trip' to happen. I'm dissapointed I had to sleep, but I had worked for 13 hours that day and was very tired. I'm confident the trip will last much longer, and I will definitely do it again.  The most unbelievable part is that it's legal, for now at least.</p>"
}
