{
 "title": "Are Small Amounts the Answer?",
 "author": "The Senator",
 "citation": "   The Senator. \"Are Small Amounts the Answer?: experience with Salvia divinorum (5x extract) (ID 14796)\". Erowid.org. Mar 28, 2005. erowid.org/exp/14796",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "260 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14796",
   "Male",
   " ",
   "Not Given",
   "Mar 28, 2005",
   "5359",
   " "
  ]
 ],
 "report": "<p>The other night, a friend and I decided to smoke some Salvia. It was my second time, and I had not smoked it in nearly a year. My first experience was a breakthrough one, and I had no doubts as to the strength and power of Salvia. My first experience had been somewhat overwhelming and although fascinating, left me with no desire to repeat the experience any time soon. I had gone the whole nine yards, and had fallen into the classic 'trance', had seen/heard/felt some kind of beings, and felt the pulling sensation. Additionally, I had felt lingering after effects, such as a new empathy and appreciation of plants and trees. I never used to conciously notice trees, but now I can almost feel their presence and energy.</p><p>In any event, my friend and I decided spontaneously to smoke some Salvia. Actually, it was the same batch of 5x extract from the previous year. We sat on my bed and loaded up the bong with a small amount. It barely covered the screen. We then proceeded to inhale deeply and hold. What I felt I can't really describe. I didn't slip into the trance, or close my eyes or anything, but I definitely was aware of a change of conciousness. My friend, whom I outweigh by a quite a bit, felt the effects much more strongly. He didn't slip into the trance either, but he described the strange pulling sensation as a 'forklift' that was stuck in his head and was lifting him up.</p><p>All in all it was a pleasant experience and I've felt the same lingering after effects as my first time. Although this time, I've also felt an emotional change as well. I was in a depression for several weeks prior to the experience, but since then I've been very happy and have felt a feeling of peace. </p><p>All of this got me to thinking that perhaps smoking small amounts of Salvia is the answer. With this experience, I've gained all the beneficial after effects of Salvia, without the jarring, bizzare voyage to 'never-never land'. Perhaps moderation is indeed the key, just like momma said.</p>"
}
