{
 "title": "420 Journey",
 "author": "Zackmann",
 "citation": "   Zackmann. \"420 Journey: experience with 5-MeO-DiPT (ID 14836)\". Erowid.org. May 22, 2002. erowid.org/exp/14836",
 "substance": "5-MeO-DiPT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)",
   "  T+ 1:30",
   "10 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14836",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 22, 2002",
   "Views: 6383",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n9pm - While an hour from home (and not finding any swag green), me, W and R decided to take a 5-MeO-DiPT. The dose was approximately 12 mg's each. It was 4/20 and getting fucked up was the plan, so the late time was not going to discourage us from tripping. I was driving, and very confident any effects felt before we got home wouldn't cause me to drive badly. <br>10pm - Arrive at home, with all 3 of us feeling minimal effects, maybe a +1 or almost +2, but not very intense at all, although the light tryptamine feeling was felt. We walk into the house finding me and R's, other roommate, BJ, with his girlfriend. They have smoked very little on the national holiday and were very disappointed that we didn't come through with more swag green. Both BJ and his girlfriend, L, were inexperienced trippers. They have both taken 10 mg's of 5-MeO-DiPT twice before, resulting in a very mild trip. They also wanted to trip, but with a higher dose this time, to maybe bring on more effects. I talk them into taking 10 mg's now, and 10 mg's in an hour, so to keep the 5-MeO-DiPT from kicking in too hard for them.<br>1030pm - Me and W wish our trip was more intense at this point, so we also take a supplemental dose of 10 mg's each. R had to work on Sunday morning, so he was fine with his initial dose. <br>11pm - After smoking on the little swag we did have, the 5-MeO-DiPT really took hold. All 5 of us were at a +3, and fully tripping. Marijuana sure does have nice synergy with 5-MeO-DiPT. After every hit, I can feel the trip get stronger. At this point me, R, and W are laying down listening to good music and enjoying the CEV's. <br>For the rest of the night the 5-MeO-DiPT trip went like most all the other 5-MeO-DiPT trips we had embarked on, a little body load, deep, deep thought, increased auditory perception, and lots of CEV's with little in the way of OEV's. <br>BJ and L finally got a 5-MeO-DiPT trip that took them to a +3. They were both very fucked up, with L having the most body load, as she puked a couple of times. I think this is because she is a girl. Girls seem to have the worst body load with 5-MeO-DiPT (birth control pills?)<br>Me, R, and W have taken 5-MeO-DiPT probably over 50 times each, so I thought I would write an overview of our thoughts on this substance. <br>Overview - 5-MeO-DiPT sure is a subtle drug. The dose-response curve seems to be very steep, with higher doses (20 mgs +) giving a very high body load, but increasing the OEV's. <br>At low doses (around 10 mgs) 5-MeO-DiPT seems to be the most fun with the littlest body load. For inexperienced trippers, they may think they that a low dose is a waste of time, but for those of us who know how to manipulate the trip, 10 mgs is just right. The CEV's can be amazing and music is greatly enhanced. The combination of CEV's, increased auditory perception, and the short acting nature makes 5-MeO-DiPT one of the best psychedelics around. <br>I suggest experienced trippers to try 5-MeO-DiPT at low doses and work on taking the trip where you want it to go, not go where the trip takes you. The worst mistake to make with 5-MeO-DiPT is to take a large dose at once, for the body load may be too much to handle. Take it small and don't try to make 5-MeO-DiPT a LSD substitute.\n\n\n"
}
