{
 "title": "Centering Smoking Mixture",
 "author": "Dr. Intense",
 "citation": "Citation:   Dr. Intense. \"Centering Smoking Mixture: experience with Damiana, Hops & Lobelia (ID 14843)\". Erowid.org. Nov 29, 2004. erowid.org/exp/14843",
 "substance": "Damiana, Hops & Lobelia",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Damiana",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Hops",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Lobelia spp.",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14843",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 29, 2004",
   "Views: 34199",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPrefatory Remark:  I haven't used any mind altering substances aside from alcohol in over a decade.\r\nI recently began researching easy to find herbs and plants that could provide the opportunity to sit, reflect, and center myself.  I found Damiana, Hops, and Lobelia.  First, I bought Damiana Leaves and Hops Flowers at a local natural foods store.  I mixed about 4 parts damiana leaves with 1 parts hops flower to create about an ounce of plant material.\r\nFirst attempt:\r\nI didn't have any paraphernalia, so I bought some cigarettes, emptied out most of the tobacco from two cigarettes, mixed the tobacco with the damiana/hops mixture, and then refilled the empty cigarettes with the mixture.  I smoked two cigarettes and the effects were noticeable yet mild.  I then sat with a very clear mind for over an hour.  I did feel an upset stomach, but that was because I did not eat dinner before smoking probably.  I went to bed and slept quite well.  The next day I felt a general calmness.\r\nSecond attempt: \r\nOn the following evening and realizing that cigarettes are perhaps an inefficient method of delivery, I purchased a water pipe and smoked three bowls over a period of 45 minutes of the damiana/hops material on the following night.  The effect was more pronounced with a general calmness and opening of my mind.  I don't want to overstate the effect, but I felt a greater unity with my surroundings.  Wanting to take advantage of this opportunity, I went outdoors and sat to enjoy the sites and sounds of late Spring.  I contemplated the cool air that filled my lungs as I sat outdoors for about an hour and read Steinbeck's 'In Dubious Battle.' I remember with some pleasure the black-capped chicakee that sat nervously on a vine nearby.  We regarded one another, and he flew away.\r\nThird Attempt:\r\nOn the third evening, seeking to deepen the calmative/centering properties of the Damiana/Hops mixture, I added 100 drops of Lobelia tincture to the 1 ounce mixture of Damiana and Hops.  I thoroughly stirred the mixtured and allowed it to sit for about an hour.  I then smoked one bowl of the mixture.  The effects of the one bowl were stronger than the three bowls of the previous night - probably because of the CNS depressing properties of Lobelia.  My eyes became heavy but the effect was not soporific.  I sat on my couch with no desire to move for about 30 minutes.  I felt very calmed but not sedated.  There were very minor visual alterations, but the best characterization would be detached, calm, and dark.  I did notice the respiratory depression of the Lobelia, but an hour after smoking the effects were closer to just the Damiana/Hops smoking effect.  I happened to receive a call from a sibling who is in the theology business just before I went to sleep.  We had a two hour discussion about human sexuality and religion, and I found upon reflection that I was better able to listen than is normally the case.  \r\nThe next day I felt very relaxed and oddly a mild sense of pressure/numbness in the area just below where my fontonel would have been on top of my head and in the parietal regions of my cranium/brain - perhaps the CNS aftereffects of Lobelia.  On the whole, I found smoking this damiana/hops/lobelia mixture to be quite effective in calming and centering my thoughts; however, I might lower the amount of Lobelia added to about 50 or 75 drops.  Anyone considering using this should be very aware that while it's hard to smoke too much of Damiana and Hops, high doses of Lobelia can cause extreme nausea and respiratory failure, so be careful.\r\nI am considering trying Salvia divinorum to explore its entheogenic properties.  As I feel one probably needs to be centered and calm before using such a strong substance, I might try to smoke a bowl of the damiana/hops/lobelia mixture as part of a centering ritual before using Salvia.\n\n\n"
}