{
 "title": "The Infinite Source of Life",
 "author": "wharf rat",
 "citation": "   wharf rat. \"The Infinite Source of Life: experience with Amanitas - A. muscaria (ID 14886)\". Erowid.org. Apr 23, 2003. erowid.org/exp/14886",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Amanitas - A. muscaria",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 14886",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2003",
   "Views: 26608",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hi all you spirit seekers. I have read many of the reports about A. M. Many of the people that have disconnected from reality on this mushroom have not remembered their total experience. For most people I believe this to be a good thing because what I have seen on these mushrooms is not for the weak minded. </p><p>A friend of mine had come across some of these and invited me over. After arriving I was in aw of the size and color but thoiught that they must be alright. I proceded to ingest one fat cap (about 7. 5 - 8g). I waited around for about 30 mins and started getting a strange rush similar to a cubensis trip. I walked to another friends house which was about a half hour away. </p><p>After sitting there for about a half hour I felt that I was beginning to plateau already and was gonna get nothing more from it. I decided to eat a little more (another cap smaller than the last). About ten minutes after this I started to actually trip). My vision was blurred as though I was drunk and I felt a small tinge of the psychedelic mind. Some girl that was there ended up givin me and a friend of mine a ride back to my house. </p><p>By this time I felt very uneasy about how my trip was gonna go. Reality seemed to be shifting into whole new dimensions. Lots of heat coming from my body and drenched in sweat. But I just layed down to try to get the queasiness in my stomach to go away. After a while my symptoms cleared a bit so I decided to go in the other room with my sister. At this time my vison of this world started to slip. I started to feel like I was being sucked in to another world. I dont really know how to explain all that. Then there was a point of total darkness but I was aware of EVERYTHING. Time began to have no meaning and seconds seemed like eons. For every second that passed I experienced life through everyones eyes. And I do mean everyone. It was as I was stuck in that dream where you're falling and yo know youre gonna hit but you never do you just wake up. But when I hit I felt like I became one with God (I was God). </p><p>I was God and I was looking in a mirror judging myself,my creation: the whole of existence. This was the end of time and I was sublimely happy with life and everything I had done. And as soon as I realised all this I got sucked back through time to the infinite source of life (the beginning of time). The key to life was sound (the word of God). Interestingly enough it was the letter I. Though I think it was more the meaning than the actual sound. </p><p>So I was bouncing through time from front to back and each time it was different. But everytime there was a middle point which was my physical death. Thers so much more that I cant type here because there arent words for it. But if youre thinking about doing theses mushrooms be warned that I found all these visions really terrifying. After looking back I am really glad that I ended up doing it. </p><p>                           Peace.</p>"
}
