{
 "title": "Straight to the Dome",
 "author": "Paco",
 "citation": "   Paco. \"Straight to the Dome: experience with Methadone (ID 14943)\". Erowid.org. Mar 22, 2006. erowid.org/exp/14943",
 "substance": "Methadone",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Methadone",
   "(pill / tablet)",
   " ",
   "10 mg",
   "insufflated",
   "Methadone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "14943",
   "Male",
   " ",
   "Not Given",
   "Mar 22, 2006",
   "Views: 59467",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, I would like to start off by saying that methadone is like Heroin, Opium, or any other strong downer.  It has a certain leaniance to it, users can easily commindear.  But it is still almost as bad and almost as addictive...</p><p>I have been experiencing methadone pills for about 2 years now.  My belavent escapades down to the boons to my well-known accomplice, crippled, in a wheel-chair with a certain perscription to methadone, percs(ES), valium, oxy's, etc.  Me and my dome buddy, Larry, decided to drive down, one evening, and purchase some pills(like usual) because we decided to start experimenting with pills and downers.  We arrived at 'his' house, with a little irrelavent confusion.  His house is a typical shithole combined with nursing equipment, due to the fact he is crippled.  Immeadiately he started to talk are damn heads off, slurring every second word(understand that he is a heroin addict and is always doped out on something).  The room temperature was around 100°F, and, with the sweat pouring down are heads, interupted him with our request.  I had purchased two 10mg methadone pills, snorted one and ate the other. </p><p>We soon left with all these pills in our system, he required us to pop, snort, inject, whatever, in his house in order to keep us from leaving with anything(shady).  Since I snorted one pill the rush hit me in about 5-10 mins.  It took us about 30 mins to walk to our required destination, the trolley stop.  It was around midnight  and me and my friend were sitting... watching... waiting... for this damn trolley.  The whole time we were bathing in a sea of tranquility.  One thing different from methadone, as opposed to heroin and most other downers, is that it triggers random allergic effects from my liver as it is being dissolved.  My whole body began to heat up intensly and itch in spots that mad contact with anything.  Pain was out of the question.  I could've been puched in the face and not feel a thing.  </p><p>It began to rain hard, but nether of us cared.. we were too gooned out to care about anything.  We finally arrived on the trolley and I had a weird experience that I had acquired a few times with methadone.  My friend would try to bullshit with me and there were times when I could hear him, and there were times when I couldn't.  Let me put it this way, my hearing was like a wave-  I could hear for about 10 mins and then it faded for about 10mins.  At this point everything I heard was faded so much I could barely hear anything.  As time progressed, the pill I munched started to take effect intensifiying everything.  Now, I couldn't concentrate at all.  For the next 4 hours all I saw was double.  And there was great distance between the two identical pictures.  For the rest of the night I couldn't feel anything, hear anything(periodically), or see anything.  All I cared about was my thoughts.  I chilled with Larry for the remainder of the night. SI never experienced any nausea or alcohol hangover like effects afterwards.  Larry took about 20-25mg of methadone and puked about 5 times later on that night whereas I didn't expunge a drop.</p><p>One thing that is good about methadone is when I take it orally, the effects last between 8-12 hours, strong at first then very mild the day after parsay.  Smoking chronic will make the effect more recognizeable for the day after when I'm only experiencing about 10-20% of the pill.  I will notice the significant jump in conciousness if I smoke a joint while in this state.</p>"
}
