{
 "title": "Hallucinogenic Nutmeg Experience",
 "author": "BC",
 "citation": "   BC. \"Hallucinogenic Nutmeg Experience: experience with Nutmeg (ID 1494)\". Erowid.org. Oct 25, 2000. erowid.org/exp/1494",
 "substance": "Nutmeg",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "24 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1494",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 25, 2000",
   "Views: 20333",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMindset/Setting was youthful vigor and good unclean fun; music and wandering around outdoors were intended.</p><p>No psychological or spiritual preparations were made for the experience.  However, the inherent pomp involved with grating vast amounts of nutmeg in a specially-obtained grater was great fun, and so we were very amused when we consumed it.  (Took with friends.  I report only on myself.)</p><p>Dosage was 24 nuts for myself (200lb, age 18), consumed at one time, perhaps 7pm; I had awoken at about 8am that day.</p><p>I didn't notice any particular effects that evening; I went to bed and slept unusually well.  Upon awaking, I had a marked sense of well-being and of time having not passed since falling asleep.  I could not say that I felt very 'high' during the day, but periodically I became very...engaged with visual or auditory phenomena.  As I spent the day in classes at college, I was not particularly inclined to try to just 'trip out' the entire time; while I was able to conduct myself normally throughout the day, I had a feeling of 'strangeness' which persisted the entire day and part of the next.  I experienced one exaggerated visual hallucination which felt quite different from any other hallucinogen I have experienced, since I did not recognize it as a hallucination.  I was mentally alert and did not seem disorganized or intoxicated to the people I talked to that day.  During the course of the trip, I experienced changes in perception (sight, sound) and sensation (I felt especially relaxed and comfortable).  I was 'mellowed out' quite a bit; I felt really comfortable and pleased the whole day (not euphoric, but noticably happy).  I experienced no appreciable or memorable side effects, either during the course of the drug or in the days after taking it.  I had a decreased appetite during the trip.  Attempting to summarize my experience, I would say that it was a casual and mild experience with a very different nature from other hallucinogens.</p><p>I was taking/using no other medications/drugs at that time, and was somewhat overweight but in decent cardiovascular health (skiing etc).  It was winter in a northern climate (65 degrees N), temperatures pleasant (0 F).</p>"
}
