{
 "title": "Field of Consciousness",
 "author": "fairnymph",
 "citation": "   fairnymph. \"Field of Consciousness: experience with Ketamine (ID 14967)\". Erowid.org. May 28, 2002. erowid.org/exp/14967",
 "substance": "Ketamine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "45 mg",
   "SC",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14967",
   "Female",
   " ",
   "Not Given",
   "May 28, 2002",
   "Views: 70171",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nDose: 45 mg, injected subcutaneously (ketamine taken from a bottle of Ketalar soln)</p><p>Relevant info: I am sick (earache, sore throat) and a little tired, I have had one drink (screwdriver) approximately 30 minutes prior to injecting the ketamine, but I am not feeling the alcohol much</p><p>Experience with ketamine: Three times insufflated (at doses of 30, 50, and ~250 mg), twice SC (at doses of 25,and 15 mg), once sublinqually (at 20 mg). Only one 'k-hole' at 250 mg insufflated. Much experience with most other drugs and psychedelics.</p><p>Setting: I am alone, in my room. I have just taken a shower and get into fresh clean sheets. It is 2 am. My mindset it pretty good, I am thinking I will not go to school the next day because I need to rest and try and get over my cold.</p><p>duration of high: Not known. My estimate was 35-40 minutes, though I think it 'seemed' longer while I was experiencing it.</p><p>I set up the needle and set it aside, and put away the rest of my gear. I put a trash can near my bed in case I feel the need to vomit, though I have never vomited or had nausea on ketamine. I get into bed and inject the ketamine slowly, allowing some of the soln to diffuse through before injecting more. It stings a little but I have done this three times now so it's not so bad.</p><p>I don't feel anything after I finish, so I dispose of the needle, turn off the lights and get under my covers. Over the course of a couple of minutes I begin to feel some of the effects setting in. I begin to hear a subdued/mild 'buzzing' sound, similar to what I heard while on 25 mg SC ketamine, or on nitrous. I feel the strange warmth of the body high and I realize that I am no longer in complete control of my limbs; I have to concentrate to be aware of their existence. I look over to my alarm clock on the ground to see what time it is -- and I realize that the power has gone out temporarily, or something REALLY weird has happened, because my clock is no longer set and the time (which says like 12:08 or something, as the clock automatically resets to 12:00) is flashing. I find this really strange because I clearly remember setting my alarm so that I would be able to get up in the morning if I felt better. Throughout the course of my trip I look at this clock and think about how it could have possibly been unset.</p><p>I am definitely feeling the effects quite strongly now. I run my hands over my body and both my hands and body parts feel weird, and disconnected -- they do not feel like me. I have experienced this before with ketamine (and it was especially pronounced when having sex on ketamine) but it still strikes me as very interesting. </p><p>I realize that I have to really focus on the existence of my body and my physical state in order to be aware of them. Otherwise, the entirety of my energy and consciousness is mental. I feel like I am on another plane. It feels similar to my time on 250 mg insufflated, but I wonder how much my trip that time was affected by my very different setting (in a well-lit room, with about 5 other people, most of them tripping as well). I think that being alone allows me to enter this different 'plane' (or dimension, or whatever you want to call it) more fully. It's like I can focus entirely on my consciousness and I dont' have to divert any energy to social interaction.</p><p>A few days ago I had finished a book on SRV (scientific remote viewing) and ET (extra-terrestrial) life. As I am tripping, I think about these ETs and I tell myself that possibly this trip may open my consciousness more to them (if they exist, of which I am not yet fully convinced). I feel a little afraid (for most of my life, the idea of aliens has terrified me more than anything else, perhaps except death) but I tell myself not to be afraid, that being afriad will only make things worse. This psychological sense of fear is accompanied by a 'tight' feeling in my chest (similar to the feeling of a panic attack, though milder). I succeed in convincing myself to be calm and (for the most part) unafraid.</p><p>At this point, my awareness of my physical body has lapsed almost entirely. I do not move my body at all (not even my head). But I feel that even though I have limited my consciousness to the mental state, that I have expanded, or that somehow I have access to more of the mental state. I don't quite know how to describe this; but it is like normally my mind exists in a room, or perhaps a collection of rooms, and now my mind has been unleashed and placed in an wide open field expanding in all directions. This 'field of consciousness' is dark, though, so I am still not fully aware of its boundaries, or its contents. But I am aware of its vastness and its infinity. I feel a little like I am stumbling around in this FOC semi-blindly.</p><p>At this point, my eyes are usually closed, though I open them periodically. I try to determine which way -- eyes closed, or eyes open -- will allow me to 'see' more. I use the term 'see' very broadly in this context -- thus 'sight' refers not only to PHYSICAL sight but also mental, psychological, spiritual insight. Throughout my trip I will return to this dilemma -- eyes open or eyes closed? For about 65% of the time, though, I decide to close my eyes, believing that this will allow me to explore more mentally.</p><p>I consider this -- the fact that there is more to explore without my body, without my eyes, just within my own mind/consciousness -- a very fascinating concept. It's as if there is a completely different dimension, and possibly many different dimensions, which can only be accessed through the 'portal' of my mind.</p><p>I think back to the aliens/ETs. I am very curious about them and I consciously make an effort to sense their presence or somehow communicate with them. I have previously in my life, not while high, and most times during my early childhood, 'sensed' the presence of other beings even though I was physically alone (from what I could tell). This 'sense' that I am not alone, and that I am sharing or somehow linking my consciousness with other beings (quite possibly ET) develops during this trip. But I can only barely sense this presence; it is as if the connection between my consciousness and these other beings is a 'bad line', or there is a lot of static, or something like that. I am aware of them, but only very vaguely, and though I try to make the connection more clear/obvious, I fail. Throughout the trip this connection fades in and out, and I never actually feel like I get a clear line.</p><p>I will note here that the trip seems to last for a while, while I am in it; there is definite time dilation but I do not find it disturbing/unsettling as I often do with other psychedelics.</p><p>My thoughts turn to death, which is somewhat a common concept for me when I trip, and a concept that I have thought about with previous ketamine use. When I am sober, thinking about death typicaly results in a mild panic attack -- extreme psychological terror, hyperventilation, a tight feeling in my chest, heart pounding etc. This type of reaction was especially pronounced when I was younger. When I am tripping (either on ketamine, but also on acid, shrooms) I tend to be able to think about death alot more calmly, and with greater perspective. This is also the case now. I still feel some sadness/fear at the thought of 'no longer existing as Julia, as me, as an individual' but I feel removed/detached from these emotions and I feel a sense of acceptance, that whatever comes after death will be a valid state of consciousness/existence, in its own way.I understand this intuitively, but having it presented to me again consciously (or semi-consciously) is oddly comforting.</p><p>I begin to feel as if I am emerging from my deeply introspective state; I move my arms and legs around a bit, and think that if I really needed to, I could get up and walk a short distance (and I find this thought comforting). I am gaining awareness of my body again and feel some sadness that I am leaving the FOC, although I still feel somewhat connected to it (the FOC).</p><p>A few minutes later, I almost abruptly emerge from the FOC and feel about 80% sober. I am slightly surprised by this, but not terribly as I have heard that the effects wear off quite quickly. Again, I feel sadness and a desire to return to the FOC. I think to myself (on a more practical level) -- wow, I like this drug -- and -- wow, I can see how this drug can be addictive. Even WHILE I was in this FOC I wanted to explore more, I wanted to shed more light on the dark expanses. I feel as if I am returning to a much more limited existence and state of consciousness. I feel that I haven't learned or experienced enough and I want to go back to that 'place', that FOC, and experience more.</p><p>I tell myself that this drug can be a great tool, but I need to use it wisely and cautiously. I then roll over onto my side, and tired from my day and my journey, I quickly fall asleep.</p>"
}
