{
 "title": "Just Another Benzo",
 "author": "desox",
 "citation": "   desox. \"Just Another Benzo: experience with Flunitrazepam (ID 14963)\". Erowid.org. May 27, 2002. erowid.org/exp/14963",
 "substance": "Flunitrazepam",
 "bodyweight": "77 kg",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "Pharms - Flunitrazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 14963",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 27, 2002",
   "Views: 28916",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMy experiences with the benzo-family so far had covered diazepam and alprazolam while I prefer the latter as it doesn't last as long and I somehow like the effects more, even though they're pretty equal.\r\nAs I'm always loooking for drugs I haven't tried so far I was happy when I had the chance to get ahold of some 1mg flunitrazepam pills - Rohipnol, the spanish version of the roche brand. The pills are oblong, have a deep green colouring and a '542' imprint on one side. They came in the original blister so I could be sure they were real.\r\nI ingested one pill at 10:20pm and felt the first effects kick in after about 15min. The typical benzo feeling most of you might know, you're feeling relaxed, don't care much about anything and tend to forget what you've just done. What makes Rohypnol different from other benzos is that is it stronger, and not only per mg but per unit. I'd say a single 1mg flunitrazepam pill can be compared to 2-3 1mg alprazolam pills, so even when taking a therapeutic dose you'll feel pretty wasted if having no real tolerance while with other benzos you have to take more than one pill.\r\nWell, the point is, that's all about flunitrazepam. There's been such a media hype you would have thought there is something special about it. It isn't. If you go by street value you can better stick to Xanax or Valium as you get more for your money and will archieve the same effect. That's just my experience with it of course, but from what I read on a.d.h. most people feel the same.\r\nWhat I personally dislike with flunitrazepam is it long halflife, nowhere as long as diazepam but still too long for me. I don't like waking up the next morning and still feel stupidified. So my conclusion is, if you feel like taking some benzos ingest a couple of Xanax and you'll miss nothing as compared to a Rohypnol pill.\n\n\n"
}
