{
 "title": "Coricidin Paranoia",
 "author": "JackieC",
 "citation": "   JackieC. \"Coricidin Paranoia: experience with DXM, Chlorpheniramine Maleate (Coricidin) (ID 14993)\". Erowid.org. Aug 20, 2004. erowid.org/exp/14993",
 "substance": "DXM, Chlorpheniramine Maleate (Coricidin)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "12 tablets",
   "oral",
   "DXM",
   " ",
   "12 tablets",
   "oral",
   "Chlorpheniramine Maleate"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 14993",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 20, 2004",
   "Views: 18109",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>  Of all drugs I've taken Coricidin tops them all. I have done drugs from marijuana to as strong as coke and crystal meth. Surprisingly, Coricidin was by far the most intense.</p><p>  My best friend and I were at a party one night and our other really good friend was there and she said she took 12 pills of Coricidin. She looked fucked up and her eyes were huge. So my best friend and I decided that we were going to take 12 pills the next night. We went to the local drug store and got 2 packages of Corcidin D. We each took 12. This was *VERY* stupid because if we would have known what we were getting into we would have never done it. </p><p>My best friend and I were bitching  because we thought our friend was lying (shes known to) about how 'cool' Coricidin was because the effects took so long to come. About an hour and a half later, we were like fuck this and we got on the highway because we wanted to take a 'roadtrip.' (We do this a lot) About 20 minutes later, all of a sudden, i started to feel weird. My chest felt as if it was caving in. I told this to my friend and she said she felt like waves were going through her body. Then we decided to get off at some exit. And then it hit us. Both of us. We pulled over at a local dairymart. Then we couldn't talk. We thought we were dying. I felt like my legs were wrapped in pillows and I couldn't walk. I literally could not move my legs out of the car to even walk. </p><p>We decided to go into dairymart to buy some water because our mouths were so dry and we were going to use the bathroom to throw up to get the DXM out of us. Some how we made it out of the car and I felt like I was 7 feet tall and that the ground was rubber. I was pretty much dragging my friend to the bathroom. When I got to the bathroom I felt as if I was going to pass out standing up. I decided to throw up because at that time I felt like I had an overdose and I was going to die that moment. I threw up loads of red shit. (Coricidin) My friend also threw up. I felt a lot better and I bought some water. (Thank God the lady at the cash register was a little slow because she would have totally known we were fucked up.) When we got out to the car we thought smoke was pouring out of the engine. (In reality there wasn't) We were too afraid to get into the car because we thought we were dying and that the car was going to blow up) I called my friend Tiff from a cell phone and asked her to pick us up. She got there and she started to cry because we hardly could even talk, walk, see, or move and she was scared for us. It felt like the world was spinning around me. Everything looked like a cartoon and peoples' features on their faces were enormous. She took us home and what I did from there is all a blur. The next day, I couldn't move. I called off school and slept all day. Everything was still blurry and colors were distorted. </p><p>I just thank God that I'm okay. I have taken Coricidin again, but not anything near 12 pills, and I have not ever had the same horrifying effects that I had that night. Just be careful when you take these, and DO NOT take them in a car!</p>"
}
