{
 "title": "Food is Medicine (Acid Cathedral)",
 "author": "TITAN",
 "citation": "   TITAN. \"Food is Medicine (Acid Cathedral): experience with LSD, L-Tyrosine, Cannabis & Food (ID 15019)\". Erowid.org. Apr 9, 2005. erowid.org/exp/15019",
 "substance": "LSD, L-Tyrosine, Cannabis & Food",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15019",
   "Male",
   " ",
   "Not Given",
   "Apr 9, 2005",
   "Views: 5469",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had an incredible experience with LSD at an electronic music festival.</p><p>I had 2 triple stacks of liquid LSD (Thats 3 drops on an Altoid, I call them triple Xs(3X)) that I bought last summer that I was saving to take with. I knew the 3Xs were very potent and I had some more LSD on sweet tarts. Whenever I suggested dropping no one was interested in taking so much LSD so we ate up all of the weaker hits by the end of December. The 3Xs sat in a drawer, virtually forgotten for months. I was trying to find a job with my degree in a bad economy and making ends meet working at a restaurant. I was not in the mood to trip at all or do any other drugs for that matter for months; I didnt even go to the bar. </p><p>In the interim I was beginning to learn more about neurochemistry and depression. I had been depressed for most of my life and was determined to solve the problem without taking psychiatric drugs. I was already beginning to feel much better after I had eliminated dairy, alcohol, red meat and wheat products from my diet. I have become so happy and comfortable with myself that everyone I know has said something about the change. My mother was practically crying she was so happy that I was beginning to feel like I had power and control over my life and that I was starting to believe that I was worth something.</p><p>In the last few weeks I have been focusing on eating foods that provide omega-3 fatty acids, niacin and b complex vitamins, as well as Tyrosine (which I respond very well to). I personally feel that the best solution for optimum chemistry is through food and I usually avoid taking manufactured supplements. I believe that food is living medicine.</p><p>The week leading up to the festival was trying for me, I got stood up by 2 dates. In addition someone that I work with who I had been dating developed a crush on someone else that we work with and started acting very strangely. Most of my other friends were flaking out on my in very bizarre ways. The people who I was supposed to go to the festival with had left without me and I couldnt get ahold of my backup. I honestly felt like no one liked me anymore because everyone was jumping ship on me all at the same time. I had bought a camelbak HAWG in preparation for the long weekend of dancing and tromping around hart plaza. The HAWG is a 1200 cubic inch daypack with a very well designed 3-liter water bag hydration system. The backpack was something that seemed invaluable to have with you when you plan on spending 2 days dancing and running around with your friends. In addition I had gone out and bought trail mix, apples, peppers, oranges and clif bars to have as snacks. </p><p>Having done so much preparation I decided to go down to the festival anyway and see if I could run into the people I was supposed to go with. After all I had done all this preparation and taken time off from work and set this time aside to go to this festival. I had to at least try to find them. If I didnt I would go back home and go to my folks house on Sunday instead of on Monday. I put my 2 triple Xs in my bag and left for the festival.</p><p>I was at the festival for about 30 minutes before I ran into the people that I was supposed to meet. I was fantastically happy to see them after such a shitty week socially. There were the 2 girls that I work with and about 4 of their friends whom I had never met before. I was a total outsider to this group. It was important to me that we all get along and like each other so we could all have a great time. So I began making friends with them. One member of the party, Lynn, was a very pretty whirlwind of energy and smiles, she never stopped moving and always had something nice to say. This mix is very attractive to me; I had to flirt with her. All this time I was wearing my backpack with the hose running out of it. From time to time I would put the nozzle in my mouth and take a sip from it. Now everyone in the group was a little wary of me, I have presence. I have intense strangely colored eyes. I stand up with correct posture after learning the disastrous consequences of slouching. I once had back problems so bad that I had to go to a physical therapist to get things corrected. I practice yoga now and breathing and I stand up straight. Add to this the laconic, impacting, to the point style of my speech. When I say something it has weight and relevance. None the less I love people and had already decided that I liked these people, I knew that it was just a matter of time for them to accept me.  </p><p>I especially wanted to earn the trust of our little fireball. Lynn saw me drinking from the hose in my backpack and asked me what it was. I told her that it was water and asked her if she wanted any. She was cautious and wasnt sure if she could trust me. But she was curious. I looked her in the eye and smiled and said I promise you on my life that it is just water. I smiled again and said You can trust me. Cautiously she took the hose and I told her to bite down and suck. She drank. Her eyes lit up and she smiled. Thats SO cool. Oh my god that is so awesome. Hey, you guys. Look. She looked at me and asked coyly if she could have some more. She was so attractive. I told her that she could have as much as she wanted whenever she wanted, thats why I brought it.</p><p>Eventually the conversation came around to drugs. They said that they were buying some pills and I told them what I had but I was reluctant to use it and I was not going to sell it to them. The problem was that the altoids would be really hard to cut in half. There were 5 of us who wanted to drop as well and I really didnt see the point in only taking a hit and a half and leaving someone out. Besides we were at a huge festival full of people who were into drugs. Surely we would be able to find some drugs sooner or later.</p><p>Eventually we did. Someone found a gel tab dealer and we bought 10. We waited until a little after sundown and ate the geltabs. Part of the geltab deal was that I would give a 3X to the guy that fronted the money. I had no problem with that because I would have one left to take later this summer at the beach. The hitch was that the geltabs were bunk. No one was getting off. I was getting irritated and it was getting late. I was tired of horsing around with shit drugs. Im not one to fuck around. We waited to see if the LSD would kick in and and for our group to come together. I snacked on the food I brought.</p><p>So by this point I had eaten a salad and a bunch of fruits and nuts all day. When everyone showed up we went back to the hotel. My drugs were not kicking in so I said to myself. Fuck this, Im going to trip tonight. I got to the hotel first and went to the room of some friends who bought drugs from the same dealer. I asked them if they had taken any yet because mine were bad. This was 2 hours after I had eaten them. This was plenty of time. They got anxious and said no they hadnt. They ate some immediately. I hung with them until everyone else showed up and we went up to our room.</p><p>As soon as I got there I broke out the LSD and took it with the guy who had fronted the cash, Ray. I tore the baggie in half, giving one half to my partner we licked it clean and waited. We hung out with our friends and then it occurred to Ray that we should take some vitamins. He got out some multivitamins and L-Tyrosine which we took. We dropped at 12:30 Saturday night. Around 1:15 I felt the first indications that I was finally getting what I wanted. It was the standard LSD reaction for me: elevation in mood, confidence, intensity of colors. We started giggling a lot. When I drop I fall madly in love with myself. Not narcissistically but I find that I really truly like myself. LSD turns me into my ideal person. I feel confident, friendly, compassionate and strong. The ultimate expression of the person I will become in my sober existence. During this particular experience this feeling was extended and expressed much more than it has been before. I attribute this to the changes in my diet and the resulting differences in my psychology. </p><p>We were asked to leave the hotel room by our friends who wanted to go to sleep. On top of that Rays cousin showed up with an entourage of 12 people. We went outside and sat on the patio behind the hotel, which was right on the river. Nice view but it was too cold. The entourage was not really mixing with us too well, they smoked in the elevator and one of them introduced herself as Rainbow Brite. I was not so happy at this point. My friends just wanted to sit there and their conversation was inane, on top of which we had the raver parade hanging around. I wanted to walk around and see the sights LSD had to offer me. That or have a real conversation about concepts and ideas. Eventually the raver parade left sensing that we were not really that interested in them. </p><p>I was starting to trip very hard by this point. Ray got a call on his cell phone that some other friends of ours were out in the car in the lot so we went to see them seeking shelter from the cold. At this point I was with Ray, another guy who was a really whiny weenie and a girl who never said anything. There was only one seat in the car so we got into a Jeep that belonged to one of the people in the car. It was still cold. Everyone wanted someone else to get the keys to start the Jeep from the other car. Annoyed by the laziness I said I'd do it and got into the other car. As soon as I did I didnt want to leave and I never got the keys. It was warm and comfortable in there. They were playing some kind of hip-hop that I experienced with my body in a really interesting way. I was beginning to trip very hard at this point. I could not focus on anything and I forgot what I was trying to say as I was saying it. I was having a lot of hallucinations and my perceptions were getting very distorted. I thought I was peaking but I was wrong. It felt like I was peaking on any of my other trips I had been on. </p><p>I will take time now to define part of our vocabulary. When I take LSD there are moments where I feel completely sober, as if Im not high at all, or at least Im very clear and focused for a few minutes. When one of these moments occurs we call it a click because you feel like you just snap into them. One second you are spaced out staring at nothing, the next you are totally there and coherent. So as I was saying the trip was getting pretty intense and I thought I was peaking. I spaced out for a bit and then I clicked. The other occupants of the car were rolling a joint and packing a bowl, which I noticed for the first time. I started talking with them and made a few jokes and we smoked some pot. Then I started to go back up, faster and higher than the last peak. I felt premium. The pot had relaxed my body and smoothed out the few small kinks in what was already a very smooth and clean trip. I laid back and relaxed entirely. I was euphoric. The music was massaging me and sounded so interesting. Everything was fragmented. I told everyone that I had never felt this good in my life, which was true. Eventually Rays friends left and he joined us in the car so I had to move. As a joke I compressed my body down as much as I could and tried to make myself as small as I could, which I think I did to a greater degree than I normally could. I dont know. </p><p>At this point I was hopelessly gone, swept away by my LSD. I was tripping so hard that I couldnt talk. I felt like I was a little sane man that was sitting in a chair in the back of my mind. Everything I sent out got hopelessly distorted and everything that was coming in was so warped that I decided that there was no point in trying to interact with anyone. I found this to be only mildly frustrating, and at the same time utterly hilarious. After a couple of attempts to speak which I am sure came out as incoherent gibberish I decided that it would be best for everyone if I just shut up and enjoyed myself. I dont know how long it went on but I clicked again. This time I clicked down to about where I was at the last peak. Still riding hard but functioning a little better. I could talk if I was very deliberate and careful about it. I picked up a notebook and began doodling in it. Totally pointless stuff. I tried to trace the shadow cast by my hand knowing that it would move when I moved my hand. I was just drawing spirals and circles. Kind of tracing out the patterns and objects that I saw. I peaked again. I was doodling and at some point I stopped and just stared at the paper for I dont know how long. I was enthralled by the most beautiful spiral I had ever seen. </p><p>I was still getting higher and I was getting scared. I didnt want to freak anyone out so I said very matter of factly.  I have to get out of the car. I got out. I was out of my mind. I turned around and I was standing in an immense acid cathedral. I have never had a hallucination of this magnitude. I didnt see even a resemblance of anything that was actually in the alleyway where the car was parked. The walls of the cathedral were mainly a grayish purple, with blue and cream colored highlights. The walls crawled and those colors swirled on them. They had tendrils and windows grew and disappeared. Details on the walls were constantly evolving. It was a symbolic representation of LSD and it had a commanding authority. It had a conciousness and a personality. It was not impersonal, hostile, or compassionate. But I cant say what it WAS exactly. It was LSD. The cathedral was utterly overwhelming and it owned my ass. I remember thinking that I didnt want to go on with this and that I didnt want any more. I was beginning to fight it. My resistance was making things worse. </p><p>I remember the sensation of being in a windstorm. I felt a psychic storm raging all around me. Clouds of the same hue of purple as the cathedral walls were roiling all around me, but the clouds were thoughts. I was standing on a point of rock in this storm. I was my soul, I had been stripped of everything except my utter core. I was everything that I believed I would always be and would be destroyed if I lost. I was clutching to my personality. I saw it flapping madly like a handkerchief in the wind. My soul (me) was unaffected by the storm but the storm was pulling my personality like a kite in the wind. Since I was holding onto it, it was dragging me off of the rock. Suddenly I laughed at myself in the middle of all of this. I told myself that I didnt have any choice. I HAD to let go. I had to surrender myself to the LSD completely. Otherwise I would be destroyed. I had to ride it out and let it be what it was going to be. I remember looking down at my shoes and seeing my feet only half on the rock I looked past them at the chaos and oblivion beyond them. I looked at my hand holding the flapping tatter of my personality and I told the hand to let it go. I had no reservations about it. It had to be done and so I watched it fly off flapping into the maelstrom. </p><p>As it went the storm went with it and I was standing in the alley. Ray was there and he was peering at me oddly and saying Hello, are you there? Hello? I was very proud of myself and filled with confidence that I had been tested and found worthy. I knew that things were going to be weird for a while, but I could handle anything that came. I gave Ray a huge grin and said something to the effect that I was still unable to talk. We got back into the car. Our friends were all getting sleepy so we went back to the hotel room. Ray and I were tripping very hard and nowhere near being able to sleep. We turned the TV on. Ray and I wanted to run our damn mouths constantly. He kept making me laugh. I was still really out there and couldnt trust my perceptions. I knew that I was unable to function, and was glad to be in a room full of people who would take care of us if we needed it. I felt like it was my responsibility to not wander off, make too much noise, or do anything to worry or bother them. Ray kept making lots of noise and I remember telling him often that we needed to keep it down so that they could sleep. I told him that we would need these people in the morning to take care of us, and that therefore it was important to have them well disposed towards us. Wow, logic. He saw the truth in it and we were not terribly loud. </p><p>Eventually though it was obvious that everyone was out pretty cold and we could talk normally. Later some of the people told us that they would wake up now and then and listen to us. They said that they didnt mind and that they thought we were pretty funny to listen to. I was glad; you might as well be entertaining. Ray began to peak. He was getting a bit freaked. I remember him reciting some Korn lyrics: falling away from me, its falling away from me He was looking for guidance. I could tell, I think. Im not sure if I hallucinated him saying Its only acid, its only acid. I was having a grand time and he said that he wished he was handling it as well as I was. I said to him. Just let go. You have to let it flow through you. Later he told me that this saved him. By now he seemed quite impressed with me and made comments to that effect occasionally for the rest of the trip. We talked and joked around for the next few hours. I made up a game with the TV. I would click through the channels and the game was to call out the first color that grabbed your attention. This was great for getting Ray turned around when he got anxious. We were through the heaviest part of the trip by about 5 AM. </p><p>Ray was making very complimentary comments about what kind of person he found me to be. I was very flattered. I found him to be young and in need of experience, but I think that he is a very good person. I very much forced him to trip in my way and he told me so. I asked him if he enjoyed himself and he said that it was incredible. At 5 I knew that my body needed food. The sun was starting to cast light into the atmosphere and the sky was lightening. I picked up my bag and went to the window and we looked out at the Detroit River. Recall that I had a backpack full of water that we were drinking through the entire night. We had the water and I broke out the red and yellow peppers and trail mix. I ate my last Clif bar and we got into the food. He was wary of food at first, but seeing me eating without a problem he tried it. He was delighted. Suddenly our mood was buoyant. The food was doing wonders for us. It revitalized us and we had a positively delightful time tweaking the flavors in our mouths by adding one morsel or another into the mix. We ate everything. As the sun came up we talked quietly and philosophized. We had some good visuals looking at the clouds and the river. We were beginning to click more and for longer periods of time. This was funny because we would be talking and then all of a sudden one of us would space out, or we both would.</p><p>I dont know about anyone else but I always break a sweat about ¾ of the way through a trip and this happened. I clicked and started sweating. I told Ray that I was sweating and he told me that he didnt know what I was talking about. 30 minutes later he said Wow, I just got my sweat. It was hilarious. We laughed. After eating and sweating I wanted to freshen up. My eyes were tired from so many hours of use. I went into the bathroom and ran a towel under hot water and wiped off my face and head. That was the cherry on my sundae. Everything was great. I recharged the towel for Ray and gave it to him. We were coming down and in good spirits. I needed to lay down and so we did and played the color game and joked around for a couple hours. Jen woke up for a while and smoked some pot with us and went back to sleep. While we were talking with her we began using the past tense to describe our trip. Eventually Karen woke up and started getting her stuff together. Just when she got up my stomach growled horribly. I poked my head up from behind the bed and said Please tell me you are going to take us out to get breakfast. She looked at me and said Lets go. </p><p>After breakfast, the sun was up. Ray convinced me to go and sit down by the river instead of going back to the room. We talked coherently for a few hours and allowed our friends upstairs to rest some more. The sun was wonderful and we continued to be in a good mood. The only problem was the gas and cramping in our stomachs. They worked themselves out eventually. We talked until we clicked again at about 10 and went upstairs. Everyone was up and happy to see us smiling and OK. Around noon we went to the supermarket and bought some breakfast and supplies for the day. We took more L-Tyrosine and vitamins. The afternoon rolled along and somehow it got to be 4 PM before we knew it. We went back down to the festival. It was a gorgeous afternoon. We went down by the river and chilled on the grass. I was very tired, but in good spirits. We broke out the strawberries and whipped cream and everyone really enjoyed himself or herself. Everyone felt good and we all agreed that it was the food. No one ever got cranky or tired because of the way we were eating and drinking water. I dozed in the sun for an hour or so. </p><p>When I woke up I was in the best mood I have ever been in. I got up and danced with Lynn. I was smooth and flowing. We all snacked on fruits and drank water until 9 or so. Ray and I had lost our concern about the horrible crash that we felt was inevitable. We had just floated back down to reality and kept on going like nothing had happened. We were astonished because we had tripped so hard and so long. By 11 he and I were ready to go back to the hotel. I had been up for 40 hours by this time. I was tired, but only as a natural consequence of losing an entire nights sleep.  I was beginning to get cramps in my body. When I boosted myself up onto a ledge my pectorals and triceps cramped up immediately. I ate a banana for potassium and felt better. But I still needed to rest. </p><p>Back at the hotel I was at the end. I needed sleep. I crashed at midnight and everyone else stayed up on exstasy. Before I crashed I remember Ray saying that he was a convert to healthy eating. He couldnt believe how wonderful he felt. They wanted me to party with them of course, but I had promised my parents that I would come home on Monday if I didnt Sunday night. I woke up once or twice while everyone was partying. My throat was thick from all of the cigarette smoke. But honestly I was so tired that I slept right through it all and they were being very loud. I remember Lynn covering me with a blanket and telling me that she wished that I was up having fun with her and I said I felt the same and then fell back asleep. </p><p>I woke at 7:30. I got up and wrote a thank you note stating that I was sorry to leave without saying goodbye but I needed to go home and clean up so I could go see my parents on memorial day. I drove home, called my folks and told them I was on my way. Had breakfast and went to my parents place. I washed my car and my mothers and then fell asleep again until dinner. Had a lot of fruit and veggies again for dinner. Went home and slept all-night and got up for work today early.</p><p>I am astounded that I didnt crash. I made a point of making sure that I was taking care of my body and feeding myself regularly. Only Ray and I had taken any real hard drugs but everyone was commenting on how much better they felt because of the food. The people who were not eating like us were having trouble. I think I can almost totally avoid the horrible acid hangover if youI do maintenance through the experience. Make sure you keep your brain chemistry balanced. Stay properly hydrated and fed. Omega 3 fatty acids are important for brain cell health. This is why we ate the Tuna. Vitamin C and B complex in the oranges and peppers. There is Tryptophan in bananas as well as potassium which is good for your muscles. Our diet was geared towards psychological health and it worked very well. I felt normal all day today. I was in a great mood I have been in a great mood ever since. I never crashed. Remember that food is living medicine. Please learn as much as you can about the chemistry of food and the ways it can enhance your life.</p>"
}
