{
 "title": "Retrospective",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"Retrospective: experience with 2C-I, MDMA, 2C-T-7, & Methylone (ID 15012)\". Erowid.org. May 9, 2002. erowid.org/exp/15012",
 "substance": "2C-I, MDMA, 2C-T-7, & Methylone",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-I",
   "(capsule)",
   " ",
   "  ",
   "oral",
   "MDMA",
   "(capsule)",
   " ",
   "  ",
   "oral",
   "2C-T-7",
   "(capsule)",
   " ",
   "  ",
   "oral",
   "Methylone",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2001",
   "15012",
   "Male",
   " ",
   "Not Given",
   "May 9, 2002",
   "Views: 26630",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>2C-I is definitely good material.  Nothing to complicated, just a nice gentle psychedelic.  Not very sensory (visual) really at all, at least compared to other closely related materials I have tried.  It is for me, a very introspective experience, and sometimes a very thought provoking one.  I personally prefer lower doses (sixteen milligrams orally) to larger twenty-plus milligram doses.  Ive gone as high as twenty-six milligrams.  In my experiences, larger doses don't *usually* do anything smaller ones can't do.  All I notice is more general stimulation, which I dont like, and only a moderate rise in visual effect.  The mental effects are generally pretty similar.  This is a psychedelic where less is more.</p><p>2C-Is nature seemed remarkably similar to 2C-T-2 in many aspects, other than the absence horrible body load and nausea of T2.  I saw little in common with 2C-T-7 other than surface similarities (Both have that 'phenethylamine' look and feel.)  As of this date, I have not taken 2C-B so I can not compare the two.</p><p>It is hard to put my finger on what is particularly magical about 2C-I.  To paraphrase Shulgin, who was speaking of the closely related 2C-E...'you know it's a good one, but you can't exactly say why.'  It is very easy on the body.  None of the severe nausea or body load that 2C-T-2 and 2C-T-7 have, which I am glad for, although I have experienced a headache, as I often do on 2C-T-7.  It seems both substances may raise blood pressure.  2C-I was definitely a wonderful sex enhancer for me, but then what psychedelic isn't?</p><p>I have had some very unpleasant experiences mixing 2C-I with other substances.  I once combined fifteen milligrams of 2C-I with one hundred-twenty milligrams of MDMA.  I took the 2C-I four hours into the MDMA experience and it was not a good combination.  Rather it was very mentally confusing and carried a very uncomfortable body load with it. The body load was extremely odd because straight 2C-I has proven to be one of the smoothest synthetics I have tasted. My girlfriend took the same dosages of both substances with me and also did not find it to be agreeable.  Both of also found it difficult to connect with each other, which was extremely odd.  We are quite a close couple.</p><p>Another time, I mixed eight milligrams of 2C-I with eight milligrams of 2C-T-7.  Each substance was swallowed in the same capsule. The main problem was the significant amount of 'mind fuck' experienced, which is something I normally dont associate with the phenethylamines. While the trip was only perhaps a +2.5 in strength, the state was very distinctly psychotic-like. I felt like the combo had set off my own personal brand of schizophrenia. There were a lot of noises in my head that one just shouldn't hear, and my thoughts just wouldn't make sense to me. I truly felt crazy for a few hours. There was also a lot of anxiety, but not as severe as the anxiety tryptamines and LSD can sometimes cause. Around three hours into the trip, things settled down and I started to actually enjoy it.  The visuals were nice and unique, different from that of either substance alone. The trip was also much stronger than sixteen milligrams of either substance would have been alone.  </p><p>Finally, I once took one hundred-fifty milligrams of methylone one-hour into a twelve milligram 2C-I trip.  As the methylone came on, I felt great for about twenty minutes but slowly I started to feel horrible (general feeling of illness, strung out feeling) and for some reason the methylone seemed to cover up the 2C-I completely.  Even the visual effects of the 2C-I disappeared. Odder yet, I really didn't feel high on the methylone either. Perhaps it was a 'beth' state, as described in PIHKAL. </p><p>Around three hours into the experience, the methylone let up and the two materials synergized nicely leaving me in a very clear, useful, and quite profound psychedelic state. It reminded me a lot of MDA. I was with a friend who also had taken 2C-I, but not methylone. We connected very nicely and enjoyed many deep and insightful conversations, and both of us had several spontaneous, but sadly short, out-of-body experiences throughout the night. Wonderful experience but not worth the initial discomfort I experienced getting there.  I will never mix 2C-I with other psychedelics again.</p>"
}
