{
 "title": "Blood and Colors",
 "author": "wesangsin",
 "citation": "Citation:   wesangsin. \"Blood and Colors: experience with H.B. Woodrose (ID 15024)\". Erowid.org. Apr 12, 2005. erowid.org/exp/15024",
 "substance": "H.B. Woodrose",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "11 seeds",
   "oral",
   "H.B. Woodrose",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15024",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 12, 2005",
   "Views: 17424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMushroom season is nearly five months away here in Washington, and with my addiction to pot finally defeated I had gone in search of some new substances to play around with. Here's a brief summery of an experiment I conducted using Hbwr seeds. I very carefully scraped all the fuzzy coating off twenty two seeds with a razor blade then ground them to a fine dust in an electric coffee grinder. I divided the pile into equal halves and poured them each into a shot glass. One glass of powder was left dry while the other was filled with acetone; the both were then covered with cling wrap. I used the acetone on one and not the other so that I could test the validity of an extraction method claiming that a nonpolar solvent will extract from the seeds all the 'stuff that makes you sick' leaving the 'good stuff' behind. Acetone is nonpolar, easier to get then Ether and less disgusting then lighter fluid. The shot glass with the acetone was then left to sit for a week, during this time I shook it daily. After the week was up I removed the cling wrap and let the acetone fully evaporate. then I filled each shot glass with 151 proof ethyl achohol, coverd with cling wrap and again let stand for one week. the seed powder was strained out with a very fine mesh coffee strainer and the liquid was poured into two seperate bottle to store in a cool dark drawer until I had a free weekend. \r\nSo when that weekend came I drank non-acetoned potion first. I should interject here that I am an experienced tripper and can handle my shrooms, acid and salvia. I don't have bad trips anymore. That being said I mixed the shot with oj and stirred it --down the hatch. about a half hour latter, back up the hatch it came.  I was relieved in a way to have the sickness over with and started a shower to ready myself for the evening. About five minutes into my shower it started. I felt removed in a pleasant way and my body looked frail and alien. I was surprised because I didn't think that I'd kept it down long enough to get any effects. I't was deffinatly psychedelic but not in the undulating sensual way of mushrooms, nor in the catapulted into an electric world way like LSD. It was tranquil and floaty and removed and colorful. I sat down and stared at my legs. That's when I noticed that I was getting stuffed up, felt like a sinus infection. \r\nAfter about ten more minutes I got out of the shower and began to rub myself dry. Still feeling stuffed up I blew my nose and to my astonishment the tissue was full of blood. That made me uncomfortable, I don't get nose bleeds not even when boxing with friends, I don't do crank or coke so what could it be? I recalled a report about a HBWR OD where a girl and her boyfriend vomited blood all night, possibly because of the cyanogenic glycosides in the seeds (same stuff as apple seeds). There are some that say that those C.G.s are just in the coating. I spent all night coughing and spitting blood. It could have been much worse though. Thank god I didn't keep that shot down I'd have been flipped and probably hospital bound.\r\nSo some weeks latter, crazy as I be, I decide to try the acetoned potion, after all this one's supposed to be safer. Well this time I drank half the shot in OJ and didn't feel sick. An hour later: no effects, I take the rest, three hours after that: no effects. I proceeded to have a few beers and fall asleep content with these conclusions:\r\n  Polar and Nonpolar solvents extracted both the good and the bad.\r\n  I know of no easy way to make these seeds safe.\r\n  The poisons in these seeds aren't just in the fuzzy coatings.\r\nAll in all I didn't like 'em, to much for too little, however Morning glories work real well, I just let 'em soak in a shot of 151 for about a week and Zang! I'm off. No sense in riskin' it on these big ones when the little ones are so fine.\n\n\n"
}