{
 "title": "Now I understand",
 "author": "LemonLime",
 "citation": "   LemonLime. \"Now I understand: experience with MDMA (Ecstasy) (ID 15055)\". Erowid.org. May 30, 2002. erowid.org/exp/15055",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15055",
   "Male",
   " ",
   "Not Given",
   "May 30, 2002",
   "Views: 9118",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAfter much eager waiting, my usual pot dealer, who's also a very close personal friend, finally scored a tab each for us. We decided to get together on Friday night and roll together, as she had experience with this before, and it was my first time and was fairly nervous. So at around 8pm we met at her place and got ready for the night, having bought snacks, water, etc. We smoked a little bit of weed while we waited for the pills to arrive, which they did a couple hours later. We both dosed at around 10pm. </p><p>Having never taken E before, I had only a vague idea of what to expect. Within 30 minutes of dosing, I began to feel a real rush, like everything felt good, and was good. Within an hour I felt the full effects. My friend's sister, who's also a close acquaintance was there in the room, although not rolling with us, as she does not drink or do any drugs.</p><p>Relaxing on the couch and watching tv, my attention started to be drawn to her. Her hair looked so beautiful, so perfect. I was so drawn to her, yet she had no idea what I was feeling. I kept staring at her, and she eventually asked me what was the matter. I told her she was so beautiful, that I never had any idea how beautiful of a girl she was. I became obsessed with the thought of running my fingers through her hair. These thoughts consumed me, although not in a sexual way. I finally asked her if I could run my fingers through her hair, and she agreeed. Waves of pleasure pulsed through my body as my fingers glided through her long silky hair and I stared into her eyes. </p><p>A while later, my friend who was rolling and I decided to move out on the lawn onto a blanket. Lying on the ground, the shapes of the trees and the brilliance of the stars seemed to take on a whole new meaning. Everything was significant. Everything had meaning, and it all made perfect sense. I told my friend how glad I was that we were friends, and how much our friendship meant to me. I was real emotional about his, and very grateful for her presence, our presence, together in this wonderful world.  About 3 hours had passed. I began thinking of sex, and soon became overcome by the idea. My friend, who is also a regular sexual partner, seemed to feel the same way, so we decided to have sex on the blanket. Everything seemed hightened, more sensitive. </p><p>Later, we became cold and decided to go back inside. She began to get sleepy, but I was still wide awake. We had sex again, then she went to sleep and I stayed up and watched TV, not the least bit tired and feeling great. My thoughts returned to her sister. That beautiful hair, that smile. I knew I was in love. Just too bad the person I chose to fall in love with at the time was not high with me. That would have been interesting. I stayed up watching television until about 6am, then slept for a couple hours and drove home. </p><p>Looking back, it was a wonderful experience, although I may have been slightly disappointed. Not really knowing what to expect, and hearing things from my friends, I'd assumed it would feel like an 8-hour long orgasm. That just wasn't the case. What I felt was a brilliant sense of one-ness with nature, the world, my friends. I realized that true love is in us all and what really unites us together, even if we never speak of it. Now I undersand why ecstasy is sometimes called the 'love-drug'. The funny thing is, that feeling of love I had for my friends is still present, even a week later. I'll probably always have those feelings, and am glad that I do. I'm looking forward to doing it again.</p>"
}
