{
 "title": "Fun, But Take it Easy",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Fun, But Take it Easy: experience with Oxycodone (Oxycontin) (ID 15054)\". Erowid.org. Jul 1, 2005. erowid.org/exp/15054",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   "  T+ 3:00",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15054",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 1, 2005",
   "Views: 66796",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having read the other Oxy experiences posted on this site, I felt it important that I add my own. I was surprised at how few reports have been posted, as this is the new drug on the scene. </p><p>Recently Ive been getting into pharmies a bit more. Mostly Xanax and Klonopin. But Id heard of Oxy in the past and new I wanted to try it. So, while at a festival over the weekend, I picked up two OC 80s. The damn things cost 70 bucks a piece! I still cant believe that price. Ive done lots of drugs and had a serious E habit a few years back; so dropping big cash for pills isnt a new experience. But 70 beans is a lot to pay for a pill and I think I probably got ripped off. Luckily I had just found over a hundred dollars on the ground, so it wasnt such a major issue. </p><p>I waited until I got home and broke one of the 80mg pills into 20mg quarters. At about 5:00pm I snorted one of the 20mg pieces. I didnt know how to get the time release coating off so I just cut it up very fine and sucked it up with everything else. </p><p>My nose is used to abuse but I dont think snorting this pill would give anyone any trouble. When I did it my nose went numb pretty quickly and the drip, although not the best tasting, was not particularly unpleasant. The only down side to snorting is the sticky feeling it creates in ones head. My ears felt full of goo and whatnot. Next time, I might try just grinding and eating my dose. </p><p>Over the next half-hour my body got more and more relaxed. I felt warm and mildly euphoric. Eventually standing became difficult. Breathing got shallow. </p><p>For the next few hours I did not want to stand. When I did, it would be fun to move for a few seconds, and then I would get dizzy and nauseous feeling. At times I felt as though I might want to throw-up. For that reason, I would recommend doing this drug on an empty stomach. </p><p>For the most part, I just wanted to lie down and feel great. My skin felt good all over, although I was feeling itchy. I would drift in and out of consciousness and have short dreams, like E dreams (if youve never had them theyre great). By and large I felt really good. This drug produces an amazing rush. Unlike E, its not a hard push into feeling super great, you really just melt into a more mild all-over-good feeling.</p><p>After about three hours, I snorted another 20mg. This just made the feelings more intense. If youve started to come down, doing even a little bit will push you way back up again. </p><p>But the main thing I noticed after an hour or so was the shortness of my breathing. Once in a while it would seem as though I hadnt taken a breath in too long. I felt that I needed to think about breathing. That can be a bit scary. I decided at that point that it would be best to stay awake until the effects dropped off. Staying awake isnt too hard.</p><p>Around 1:00 am the strong part felt as though it was mostly gone. I still felt really good. My body and skin both felt very sensitive to touch and internally wild. I cant think of anything to compare this drug to. It feels like some aspects of several others that Ive done. Ill just say again, it feels great. I didnt feel okay to stand but as long as I was lying down I felt great. </p><p>The next day I had a bit of a headache and was feeling out of it until about noon. Nothing too serious, but I wouldnt do this drug on a work night. </p><p>Overall, OxyContin seems like a fun drug. Although it is stupid expensive, I does seem as though you get what you pay for. Ill get two strong doses out of one 80mg pill. And each dose is good for about 7 hours of fun. From my experience I would not recommend snorting more than 40mg in a sitting. As I said, I was a little concerned about breathing, and as we all know, breathing is important.</p><p>Have fun. Be safe. Cheers!</p>"
}
