{
 "title": "MDMA Long-term Effects",
 "author": "Paulie",
 "citation": "   Paulie. \"MDMA Long-term Effects: experience with MDMA (ID 15056)\". Erowid.org. Aug 1, 2002. erowid.org/exp/15056",
 "substance": "MDMA",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 15056",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 1, 2002",
   "Views: 36361",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nE was the best and worst thing that ever happened to me.  I was rolling every few months or so for a few years and enjoying it responsibly, but as I became more connected into the whole scene I came into contact with a dealer where if i bought 50 or 100 pills i could get them for $12-13 apiece, being that I really enjoyed doing E and had many friends I could sell them to, I started purchasing large quantities, believing it was an investment to make a little money and get free pills.   I continued to purchase large quantities about once a month for several months and would sell enough of them for $20 a pop to make a little money and get a free head stash.  The only problem was it was constantly around and when boredom would set in on a weekend the urge to pop a pill was irresistable.   </p><p>I was doing it 2-3 pills a time usually once sometimes twice a weekend, and was having a ball.  Ever since I took my last pill over a year and a half ago I've been suffering terrible insomnia, confusion, memory problems, difficulty concentrating, depression and just a 'sick-headed' feeling.  I can compare it to a terrible e hangover that simply never ends,  I noticed towards the end of my time with e, that the hangover affects were more pronounced and would last longer until finally i overdid it and they have never gone away.  My body was sending me a message, but I got my lawyer on and was saying well I'll stop taking it after this time, i can do it once more, I'll survive it if I just stop doing it for a few months.  I couldn't have been more wrong. </p><p>I have been taking remeron, an anti-depressant since then which has mitigated the symptoms slightly, but I fear I am now a permanent 'e-tard'.   I feel the worst damage was sustained when i would take e and as I was coming down would sniff some crystal meth to keep my high going.  I think that that when my system was depleted of serotonin by e and I ingested a Dopamine releasing agents such as meth, the dopamine in my system was extremely neurotoxic to my serotonin neurons.  </p><p>I danced with E and wasn't careful.  Now I've lost it all.  It wasn't worth it.</p>"
}
