{
 "title": "Any More And It Will Turn Inward",
 "author": "Starvoyager",
 "citation": "   Starvoyager. \"Any More And It Will Turn Inward: experience with Mushrooms (P. cubensis) (ID 15133)\". Erowid.org. Jul 11, 2002. erowid.org/exp/15133",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "15133",
   "Male",
   " ",
   "Not Given",
   "Jul 11, 2002",
   "8113",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had recently received about 8 grams of Cubensis Mushrooms from a friend of mine who had been growing them in Colorado.  After sitting on them for a while, I decided to make a short trip to San Francisco (I live in Santa Cruz so it was only an hour drive north) to see a friend (henceforth known as 'T') and munch the mushrooms in an attempt at a friendly afternoon trip.  The day was windy, partly cloudy, and we were in good spirits.  We were both experienced trippers.</p><p>T- 15 minutes:</p><p>I start cutting up the mushrooms (all 8 grams) into tiny bits with scissors.  Because I'm not a fan of the taste of shrooms, the way I like to ingest them is to cut them into little bits and swallow them (without chewing) with some orange juice.  Once I had the whole lot cut up, I measured out 3 piles; 2 piles weighing 3 grams each, and 1 pile weighing 2 grams.  The two gram pile I put away for another day.</p><p>T+ 0 minutes:</p><p>We each select one of the 3 gram piles and swallowed the mushroom bits with orange juice.  No nasty aftertaste in my mouth at all.  It's 1:30 pm.</p><p>T+ 8 minutes:</p><p>T and I are relaxing listening to some music, making a plan to hike to the nearby park and go for a stroll.  I decide it would be a good idea to see how things turn out before making a public jaunt, so we decide to hang back for a little while in his apartment.  I'm beginning to get my first alerts that something is happening.</p><p>T+ 15 minutes:</p><p>Definitely kicking in now.  In fact, quite a bit faster than usual.  I'm starting to feel a bit nauseous, but nothing to bad.  The whorls in the hardwoood floor are beginning to swirl and dance.  I'm thinking, 'Ah, mushrooms.  Gotta love it.'</p><p>T+ 24 minutes:</p><p>As I'm sitting at the table watching the wind blow the trees outside back and forth, I can feel the intensity build to a level I'm normally accustomed to feeling at the +2 hour mark.  I comment to T, 'If this gets any heavier, I have a feeling my trip will turn inward.'  He just smiles.</p><p>T+ 30 minutes:</p><p>I excuse myself to the bathroom; the nausea is building and I'm thinking that a good purge session might be in order.  Once in the bathroom, though, it doesn't happen.  By this point the whole world is full on 'Waking Life' style, with every object in my vision moving and floating independantly of other objects around it.  I'm get a little worried at this point.  I stay in the bathroom for a little while rolling around on the floor, I didn't know what else to do.  The trip turns inward.</p><p>T+ 40 minutes:</p><p>I exit the bathroom, my vision is completely askew at this point, trails, sparkles, and lights are everywhere, my field of vision is drawn with a set of crayons.  I look at T and say, 'I think I'm having trouble.'  He looks a bit concerned and says, 'Do you need anything?  Water?  Music?'  I just reply that bed would be the best option at this point.  </p><p>I crawl into the bed and the world shatters.  Complete fear now.  I can barely see, ghostly wisps pass before me and I can't tell the cabinet from the closet, things are floating around the room, I'm seeing double and triple vision, and rainbow lights shoot everywhere.  Momentary blackouts.  All I can hear is a 'ffffff' noise (similar to the noise you hear on DMT).  I can't deal, so I close my eyes, and my ego decides to leave.</p><p>T+ 60 minutes:</p><p>I'm rolling around on the bed in complete psychic agony.  The philisophical magnitude of my cultural definition is destroyed; I have no idea where I am, who I am, why I'm here (WHERE even?), I even forgot that I had eaten mushrooms.  I think T might be talking to me, the voice is lost on the air.  Did someone actually say something, or did I just think someone did?  Complete loss of time perception now.</p><p>I feel my understanding of common knowledge leaving me.  Concepts of 'self', 'cities', 'love', and 'life' lose meaning, and when that happens, confusion begins to mix with the fear.  My soul is torn asunder, my spirit laid bare.  The intensity is mind boggling.  Imagine falling from a cliff, and imagine the feeling you might have 1 second before hitting the bottom.  That is the feeling I had for about 3 hours, coupled with vision ripping hallucinations and mental hysteria.</p><p>During this time I think T had decided to go out to the park, but came back in soon after as he too felt the shrooms take hold.  He said he was in full on survival mode, and even typed in '911' on his cell phone, all he had to do was push the 'send' button, just in case.  At one point I also had that feeling: 'What if we need to call for help, then what?'  That thought vanished as quickly as it came.</p><p>T+ 4 hours, 30 minutes:</p><p>This went on for several hours, and at last I thought I had a grip.  Vision was still very colorful and swirly, but at least I was beginning to rebuild my ego.  I turn to find T on the bed next to me, also slowly regaining conciousness.  We start talking about the experience a bit at this point, and try to relax as the afternoon sun warms the room from the open window.  It's about 5:30 or 6 pm.</p><p>T+ 6 hours:</p><p>Almost completely back to baseline, still a bit fuzzy, but much more clear than before.</p><p>Summary:</p><p>Now, I've taken 3 grams of mushrooms before, but nothing ever happened like that.  It was, bar none, my ultimate psychedelic experience (DMT notwithstanding).  What was originally planned to be a moderately recreational dose turned out to be a psychic reformation.  It was extremely cleansing in the end; to completely break down and rebuild can have a very refreshing effect, despite the horrifying glimpse into the nether realms.  It's a bit like sweeping the cobwebs from the mind.  I also realized how blessed I was in life to have a loving girlfriend.  Being on the verge of nothingness made me re-evaluate the things I truly appreciate and love in life.</p><p>It's a good example of a time when the dose was unknown, despite previous medium strength trips with a similar amount of mushrooms in weight.  Be careful about these things, as different batches of mushrooms can vary GREATLY in strength, by weight.</p><p>Peace.</p>"
}
