{
 "title": "Don't",
 "author": "Lord Rex",
 "citation": "   Lord Rex. \"Don't: experience with PCP (ID 1513)\". Erowid.org. Sep 12, 2000. erowid.org/exp/1513",
 "substance": "PCP",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "PCP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1513",
   "Male",
   " ",
   "Not Given",
   "Sep 12, 2000",
   "86258",
   " "
  ]
 ],
 "report": "<p>\nAfter a few drinks, I went downtown to the dance clubs with friends.  An hour was enough for me...  I've never been into the dance club scene... so I decided to walk home.  My town is a hippy town, and I decided to buy a joint to entertain me for the walk home.  I approached the nearest cluster of hippie-kids to buy a joint, and a girl offered me some PCP.  Stupid mistake number one.  The only thing I'd heard about PCP was from an aquaintance who was a jail-guard in the Canadian prairies...  told me of a guy who was on PCP in one of the cells and said he'd rip his eye-ball out if someone didn't give him a smoke...  nobody gave him a smoke...  enough said...</p><p>So I bought a dose...  it was cheap enough...  and I walked a few blocks to a 19th century graveyard.  I settled down against an old tombstone, and tried to figure out how to do the chunky white powder.  I didn't have any rollies, so I sniffed it.  Mistake number two.</p><p>Everything after that is a blur.  I have only two recollections from there on.  The first was a car stopping and two guys getting out asking, 'Dude, are you alright'.  I seem to remember they were cops, but if they were, I would have been hauled into the station.  My second memory is being in a grove of trees, and thoroughly believing they were people.  It was quite a paradox, knowing they were trees but believing they were entities..  I think I was talking to them...  How I got to those two locations is a mystery.  How I got home safely is even more of a mystery.</p><p>I remember a severe dissociative state, and that's about it.  I guess you could call it a black-out.  My only advice is to avoid PCP like the plague.  I could have done anything on that drug, and not remember it.  It robbed me of my judgement,memory, and free will.  It is, therefore, a very dangerous drug.</p>"
}
