{
 "title": "In the Tub",
 "author": "Spaced Experiences",
 "citation": "   Spaced Experiences. \"In the Tub: experience with Red Rock & Cannabis (ID 15148)\". Erowid.org. Jun 28, 2007. erowid.org/exp/15148",
 "substance": "Red Rock & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Red Rock",
   " ",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 15148",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2007",
   "Views: 4782",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>These are two linked events that happened earlier this year.</p><p>I want to say that this happened during the fall of 2001, but it could have happened a little earlier or later. Anyway, I had been hearing from a few friends that they had bought some opium and described it as 'weed times ten'. I was skeptical at first but after a while I decided to go to my friend's house and see what it was all about. So I packed a bowl of decent weed into my pipe, and on top he set a few small red rocks. It was new to me, since my only experiences had been mainly weed, and alcohol a few times. </p><p>We went outside to smoke it, and it tasted/smelled a little more like paint than flowers, but I can see how people think it is flowery. After a while I knew it wasnt my typical weed high, which Ive experienced oh so many times in the past few years. This was a little more numbing, yet I was still quite clear headed. We smoked most of the bowl (the opium stayed smoking the whole session, eventually covered all of the weed and inner pipe). I put the remaining opium covered weed in a baggy (I assume it was only a few hits worth) when we were done and we discussed how we felt. He thought it was more of a physical stoning than anything else and I agree. </p><p>Soon I was on my way home and felt good. I went into my garage and played drums and it was a surreal feeling I had, I did not feel like I was moving as fast as I was. Thats pretty much all I can recall of that day, but nothing else major occurred.</p><p>Appox. a few days later a different friend of mine came over and we packed a bowl of much better weed. On top of this bowl I put the small opium weed piece/s plus some small opiate matter I had been able to scrape out of my piece. I put this on top of the bowl, and it was quite intense. We smoked that bowl, and I believe one or two more, and there was a profound difference. I could really taste the opium in the first bowl, even through the next two, a bit weakly. We went in a hot tub and it was one of my best experiences with mind-altering substances. W</p><p>We were very high and quite relaxed, a bit from the tub of course, and substantially from the weed and opium. After an hour or two we got out and went inside, and when I got up I felt all of the blood rushed to my head, or a sensation like that. I went into the bathroom and looked in the mirror, and I was very fucked up, as I have felt only when smoking much larger amounts of weed. Some feelings of paranoia occurred but it was not major it was just something I remember. We went to sleep and all was good. The Opium was a very good addition to the cannabis, and made for two very fun days in my life.</p>"
}
