{
 "title": "Never Understood Control",
 "author": "Scrambled",
 "citation": "   Scrambled. \"Never Understood Control: experience with Cocaine, Crystal Meth (ID 15146)\". Erowid.org. Jun 3, 2002. erowid.org/exp/15146",
 "substance": "Cocaine, Crystal Meth",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "3.55 g",
   "insufflated",
   "Cocaine",
   "(daily)",
   " ",
   "500 mg",
   "insufflated",
   "Methamphetamine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "15146",
   "Male",
   " ",
   "Not Given",
   "Jun 3, 2002",
   "Views: 34444",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n     When I hear the words 'drug addict', I conjure up thoughts of a crusty old man on a street corner, living in a box, with a needle dangling out of his arm as he whistles with his one tooth, begging one to stop for a donation of a dime. But as I look in the mirror, I'm reminded of what a friend of mine told me the day he kicked his coke habit. He said sometimes you just have to look into the mirror and be honest. He saw a drug addict and stopped. I see a drug addict but can't stop. Here's how this all came into being.</p><p>     My first dip into cocaine came about 6 months ago. Met the wrong girl, she slammed the wrong thing in my nose, and I fell in love. Not with the girl, but with my new little mistress. I didn't touch it again for 2 weeks but it was always on my mind. Then one day, I told myself I wouldn't go into work until I got some. I spent 4 days away from work, trying to track down a suitable dealer. Now, I'm a professional with tons of money, houses, cars, and women. Yet, they didn't matter those 4 days. Once I got connected, I immediately bought an 8 ball. I didn't know how much was in it. It took me 2 days to finish it up. Every time I would do a line, I would cut up another one for later. Usually, I would finish that line before I got up from the first one. </p><p>     Almost immediately, my coke habit started in the am before work, frequent bathroom breaks during work, and a stop off by my dealers house after work for another 8 ball. I had only been doing this stuff for 2 weeks and was doing an 8 ball a day, almost every day. A few months later, I knew I had gotten out of control when I got up 2 hours early for work, and did about 6-8 rails. I drove to work sweating, shaking, pale, and an out of control heart. My co workers were pushing me to go to the ER but I stuck it out... by simply doing more coke during the lunch break and bathroom breaks. I got through the day alive. My initial partying coke habit, sharing with friends, had become a solitary habit to sustain me throughout the day. It took me 1 time to get hooked on coke and 2 months for it to become my only fun. Parties and bars didn't matter. I sat at home on the weekends enjoying my coke buzz. I would have the occassional woman over to share it with but that was it. </p><p>     I continued doing coke for another 2 months, a total of 5 months for those playing along at home. And then it happened, coke stopped working for me. No matter how much I did, I did not feel any different. An 8 ball in an evening did nothing...it made me feel sick and nervous about my health. Then someone had me do a few lines of crystal meth. I had just found my new love. Work became easier...i didn't have to take frequent breaks, my nose wasn't always running, and it was a sight bit cheaper to do. Within 3 weeks of sampling crystal meth on a weekend basis, I started using it every day. Soon, I was working up to 10 day binges of no sleep (except for sleeping pills), little food, and the most kick ass work I've ever done. I was the most productive person alive even after 10 days...but then it came crashing down.</p><p>     Somewhere after 10 days, I got paranoid. On my way to work, everybody was after me...everybody was a cop. Even the poodle in the car next to me was a fearless K9 dog that could smell the residue in my nose from 3 cars back. I got to work okay that morning. But then I got a headache that wouldn't go away. I thought a blood vessel had popped. I immediately thought I was dying and started researching the internet for warning signs of dying from too much speed. Then, I thought every security guard in the building could tell i was high and was there to arrest me. I ran from floor to floor. I even researched local lawyers and the local law penalties for drug possession. I had 3 lined up for my defense because I was also convinced that my house was being raided while I was at work. </p><p>     I somehow made it through the day. I got home, hid my stash in a room other than mine. I spent the rest of the night looking out the window. I heard every door slam, saw every car drive by, heard every dog bark...it was senseless. </p><p>     That paranoia lasted another day, but not near as bad as that day. I took a hiatus from town and flew away for 8 days to get away from it all. I almost took some on the plane with me I needed it that bad. I am now on my 8'th day without any drugs and I am totally depressed, emotionless, and sleep an average of 12-14 hours a day. I can't get out, I have no motivation and no desire to do anything but sleep. I can't eat like I used to. I have lost a total of 50 pounds over the last 6 months doing these drugs. I don't feel like myself and I'm struggling to get back my reward system that has been so tainted by, I believe, crystal meth.</p><p>     I looked in the mirror again this morning. Still an addict even when not doing any drugs.</p>"
}
