{
 "title": "Childhood Memories Relived",
 "author": "Jordan",
 "citation": "   Jordan. \"Childhood Memories Relived: experience with Inhalants - Gasoline (ID 15153)\". Erowid.org. Jun 6, 2006. erowid.org/exp/15153",
 "substance": "Inhalants - Gasoline",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15153",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 6, 2006",
   "Views: 7704",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I've only used drugs for about a year now. Weed, opium, dxm, lsa, ritalin; gasoline has been my favorite.  </p><p>Anyway, my first experience was in my garage, I would take the gas can, hold it to my mouth and inhale.  After a minute or two, I would hear every sound echoing, then I would begin to make out robotic, high pitched voices out of rustling leaves.  For some reason in every inhalent experience I have, my paranoia comes out in the form of extremely realistic hallucinations. My mother, for example, would come to the door of our garage and peek in, and on a couple of occasions, I would throw the gas bottle down, spilling it, only to realize my mom wasn't there.  </p><p>Once I hallucinated a queen/fairy stepping down the stairs behind me, saying 'I have arrived, my royal duty is to crown you king'  very strange almost deja vu-ish feelings.  Somehow, I felt like I knew this queen, or that I had met her, somewhere sometime, in a dream far away.  When I was 5 or 6, I remember playing in my garage, and I almost wonder if I had accidentally inhaled gasoline fumes then, and met this queen in a trip long ago.  </p><p>Sometimes, if I would inhale too much gas, I would enter a strange world, almost cartoonic, where bright orange and yellow creatures would play tricks and pranks on each other. Somehow, I would ALWAYS have a feeling of permanentness, not that I would be permanently in this hallucinigenic state, but how long the universe has been in existance, and if my life was real, or if it was a dream.  One time I entered this world, and all of a sudden snapped out of it, feeling scared it would have been permanent.  </p><p>After a few trips, I would begin to have hallucinations inside my body; that I could feel. It felt as if there was an air bubble running through by bloodstream, and that my heart was beginning to turn inside out. This freaked me out, and I stopped huffing.</p>"
}
