{
 "title": "Bad Cops in South Carolina",
 "author": "Smokey",
 "citation": "   Smokey. \"Bad Cops in South Carolina: experience with Cannabis (ID 15178)\". Erowid.org. Jun 4, 2002. erowid.org/exp/15178",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "15178",
   "Male",
   " ",
   "Not Given",
   "Jun 4, 2002",
   "30130",
   " "
  ]
 ],
 "report": "<p>\n*This is not about a drug experience but a bust experience.*  </p><p>I was pulled over for a simple moving violation in which I was going 10 mph or less over the speed limit.  The officer wrote me the citation and then asked to search the car.  I had a real problem with this because there was no probable cause.</p><p>I would describe myself as a typical high schooler, honor student, well dressed, and short clean hair cut.  I had not been smoking at all and there was no erratic behavior to my driving.  I said that I did not consent for him to search my car.  He said that I could either consent or he could call the drug dogs to search my car.  I said that I still did not consent for a search.</p><p>He called for a drug dog to come and asked me to step out of the car and immediatly started grabbing both of my front pockets.  I had my half a QP (I left the other half at home thank God) in my pocket.  He noticed the bulge (it was a fat brick) and reached into my pocket and pulled out my crown royal bag, which was sealed.  He preceded to open it and pull out my stash.  I luckily had it in one bag.  The officer asked me why I was selling dope and I replied that I just smoke a helluvalot.</p><p>I was put into handcuffs and put into a cop car while they searched the rest of my car.  They didn't find anything else.  After they were done searching they took the handcuffs off and told me to drive to the police precinct which was a few blocks away.  Looking back now, I should've known something was funny.  I was followed by two black and whites.  When I got there, I learned that I was not being charged with distribution but only simple possession.  That should've been the second clue that hit me in the face.</p><p>I told the police that my fourth amendment right had been violated not to mention a whole lot rules that the officer broke.  I was told that I could either go with the simp. poss. charge or try to beat a possession charge, and would go to jail until trial.  I went with the simple possession charge.  Luckily I got PTI so I never had to go to court.</p><p>I just want to warn people about tricks that the police use to trap you.  Police can not search a vehicle for a moving traffic violation unless they have probable cause.  Furthermore they can not call a search dog unless you were driving erattically or they smelled marijuana.  Otherwise the evidence they collect will not hold up in court.  I hope that this will help if anyone is ever in the same situation.  If I would have known then what I know now, I wouldn't have been in the same situation I was in.</p>"
}
