{
 "title": "Too Much of the Green",
 "author": "Slinky",
 "citation": "   Slinky. \"Too Much of the Green: experience with Absinthe (ID 15187)\". Erowid.org. May 3, 2006. erowid.org/exp/15187",
 "substance": "Absinthe",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "15187",
   "Male",
   " ",
   "Not Given",
   "May 3, 2006",
   "21124",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had gotten some real absinthe from a 'friend' over the Internet.  As I do with all things concerning such matters I read up on the subject of the substance.  I learned that if I have enough, maybe I can see the so-called Green Fairy.  Well I had my chance at a party of mine to imbibe more than one shot.  After five in a relatively short amount of time I was feeling great.  Not feeling Drunk, like drinking 5 shots of Bacardi 151. I should have been drunk but the wormwood in the absinthe counteracts that feeling, which can be really dangerous.  </p><p>Well I had to go to the bathroom, and when I was done, before I opened the door, I shut off the light.  And to my amazement, there it was, a damn green box moving around the damn room.  Now in my state I did not really believe it, so I went out to party some more.</p><p>So after 3 more shots in around an hour, I started to feel real flush.  I went to sit down and the ceiling started flashing colors.  Like Blue then green, then purple and back to normal.  That repeated for a little bit, then all of the sudden I started feeling super worried, I could not breath.  I was hyperventilating.  I started breaking out in hives and getting really super hot and pale.  So I went and laid down and tried to relax.  I kept my eyes closed because I could now feel the alcohol power through the wormwood.  Super drunk.  So I kept my eyes closed and I was watching flashing colors, just like before.  It was far more preferable to spinning room.</p><p>I have drunk absinthe many times after that, I just know my limits now...Four shots are fun, 8 is hell.</p>"
}
