{
 "title": "Tried it, Liked it!",
 "author": "budster",
 "citation": "   budster. \"Tried it, Liked it!: experience with Morning Glory Seeds (ID 1518)\". Erowid.org. May 29, 2001. erowid.org/exp/1518",
 "substance": "Morning Glory Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "14 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1518",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 29, 2001",
   "Views: 25480",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOK--read all the accounts on here, the extraction FAQ and was all primed to try this myself...I had tried ingesting seeds, ground in my electric coffee grinder (washed, dried first!)...using the table (light, medium, heavy doses) as a guide.  I believe I tried 100 seeds, then 200 seeds..the second time, I noticed the nausea, eventually the dry mouth and dilated pupils, but that was all. (I do not recommend soaking them in water after grinding--very unpalatable).\r\nDid the extraction twice using naphtha and 151 proof rum using roughly 8 then 10 grams of seeds--noticed nothing.  Finally ingested 15 grams of seeds, grinding them in my grinder and mixing the seeds in with apple sauce--went down very well!  Had some nausea, very tolerable and ultimately that went away after eating a full meal... several hours later found myself sitting at a performance of Tibetan monks who chanted (I did NOT drive there)...I was on the edge of a flat out trip, almost having visual changes, but the auditory part was intense!\r\nWell, buoyed by this sucess, I ground up >13 grams of seeds, ate them with apple sauce and washed it all down with a big ol' can of LaBatt's Ice beer... when the nausea kicked AND the pupils dilated, I ate again and the nausea abated.  I did that at 2pm, by 5pm, I had the slight tremor and was pretty sweaty... by 7pm, things around me appeared to 'breathe' in sync with my breathing, had handlable visual changes and listened to Enigma's 'Cross of Changes' CD with mindblowing results.\r\nThe beauty of all this was that I was in control the whole time, if I needed to be with the moment, I was...coherent, lucid...if I let myself go, then the visual changes would go and my vision would 'swim' and other cool effects.\r\nOne method that works:  grind up in excess of 10 grams (rinsed and patted dry with paper towels) using the Pearly Gates variety and use apple sauce as a vehicle.  Wash it all down with a can or two of beer or other moderate amount of alcohol, wait until pupils dilate before eating and plan on actually tripping 4-5 hrs after you eat it.\r\nIt was very enjoyable for me, and while it seems like a little bit of work (it really isn't, compared with the extraction), it is legal.  Happy voyaging!\n\n\n"
}
