{
 "title": "Discovery...",
 "author": "Noirceuil",
 "citation": "   Noirceuil. \"Discovery...: experience with Cocaine, Alcohol & Cannabis (ID 15225)\". Erowid.org. Apr 27, 2005. erowid.org/exp/15225",
 "substance": "Cocaine, Alcohol & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15225",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 27, 2005",
   "Views: 21570",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my second encounter with the infamous white devil and, since the last experience dispelled all of my fears about the drug, I looked forward to this with some giddy anticipation.</p><p>I did two small lines, which affected me almost instantly. There was a slight burning sensation in my nose afterward (which is to be, obviously, expected), an unpleasant taste in the back of my throat, and an almost instantaneous numbness in my lips, tongue and gums. Within minutes I experienced euphoria and intense stimulation. My thoughts were racing and my body felt invincible, as if I could fly. My muscles hardened, and I felt as if I could barrel through the thickest brick walls with my bare fists. An indescribable surge of emotion, physical pleasure, mental clarity, paranoia and apocalyptic sorrow hit me in one lump some and I felt as if I was experiencing all that could be experienced by a human being in one grand, glorious instant. Several more lines were snorted, and we ventured onward.</p><p>As my friends and I made our way to a restaurant, I found my appetite completely absent, and the thought of eating brought waves of intestinal resistance (nausea?). I kept telling my friends how much I loved them, and was overcome with the urge to embrace them all.</p><p>As the evening wore on, more lines were snorted and I seemed to remain at a state just below that of the peak until the coke ran out and we moved on to the alcohol and marijuana. </p><p>I could distinctly feel when the cocaine euphoria transitioned into the marijuana euphoria, the former heightening my standard experience of reality and 'sharpening' my mind (though, when in this state, it is very difficult to concentrate on one thing for a long period of time) while the latter 'thickens' my mind, slowing my thoughts and disconnecting them from each other and from the reality I perceive. Cocaine increases my rational and emotional range, while marijuana decreases the rational and heightens the emotional. I associate giddiness and escape with weed, and cold, powerful understanding with cocaine. I prefer the latter drug, which, ater my last experience, I have deemed the 'god' drug, for it imbues me with such feelings of stength and brilliance. It is truly an egoist's substance.</p><p>I could not really differentiate the alcohol (which takes much longer to affect me than the other said substances) from the marijuana, a drug which this time as always, gives me a profound feeling of disconnection from time and my environment. I feel 'lost' while on it, as if floating in some great oblivion while retaining consciousness (an impaired consciousess, one of a child / animal) a base consciousness in which the magnified emotions, which I believe are triggered by what is perceived and filtered through the rational mind, seem to be ddoing the thinking. This was a far cry from the very 'connected,' 'living-in-the-moment' feeling of cocaine.</p><p>Doing both together made for an interesting mental journey, one that seemed to last for days (because of the contrast of states), and, throughout my sourjour, I experienced the most intense love and compassion of which I think I am capable, the most overwhelming despair and the most glorious anger and arousal.</p><p>Alcohol, which I did not feel during this particular journey, is the opposite of cocaine, for it allows me to remain connected to that which I deem 'reality,' but it slows my thoughts and dulls my emotions. It provides a great remedy for the horrible coke come-down (prepare for despair if unarmed with some liquor). Coke brings me up, alcohol then brings me down, so that attaining the median (sober) state is more enjoyable (for lack of a better word).</p><p>That is really all I have to say. I recommend all three drugs highly, to be employed for specific purposes.</p>"
}
