{
 "title": "Long Night",
 "author": "Hank the Hustler",
 "citation": "Citation:   Hank the Hustler. \"Long Night: experience with 2C-T-7, MDMA, GHB, Methamphetamine, & Ketamine (ID 15227)\". Erowid.org. Jun 6, 2002. erowid.org/exp/15227",
 "substance": "2C-T-7, MDMA, GHB, Methamphetamine, & Ketamine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 0:00",
   "2.0 ml",
   "oral",
   "GHB",
   "(liquid)",
   "  T+ 1:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:00",
   "2.0 ml",
   "oral",
   "GHB",
   "(liquid)",
   "  T+ 4:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:00",
   "2.0 ml",
   "oral",
   "GHB",
   "(liquid)",
   "  T+ 6:00",
   "2.0 ml",
   "oral",
   "GHB",
   "(liquid)",
   "  T+ 6:00",
   "20 mg",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)",
   "  T+ 6:30",
   "25 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   "  T+ 9:30",
   "30 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15227",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 6, 2002",
   "Views: 28156",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nIt was my birthday.  I was excited to be going out to one of my favorite dance clubs.  I was very much in a great frame of mind; very happy and content.\r\nI consider myself an experienced (about 7 years) user of MDMA.  I have used GHB, Crystal Meth, and Ketamine for about 1 year.  It was my third experience with 2C-T-7.  The previous 2 experiences were very good, but they involved using 2CT7 without any other substances.\r\nThe night was going very well using MDMA and GHB.  I was dancing alot and enjoying myself immensely.  After the club closed, my friends and I went to an after party.  There, I decided to do 2CT7.  I had tried 2CT7 twice before by itself and had glowing experiences.  I was curious to see how 2CT7 would be in combination with other drugs.  \r\nAbout 1 hour after I took the 2CT7 orally, I began to 'ramp up' and feel excited.  At this point I began to see some visual effects and definite color enhancement.  I had taken a dose of GHB approximately 30 minutes prior to taking the 2CT7.  After about 2 hours of taking the 2CT7, I began to get slightly disoriented and extremely nauseated.  I should note that I almost never vomit when taking drugs: until that moment.  I proceeded to vomit and dry-heave for approximately 1 hour after that point.\r\nI think my friends were getting bit concerned with me at that point and took me home.  We then sat around my place for a few hours.  I was well into the trip at that point.  I was seeing visual effects such as tracers, closed-eye visuals, and color enhancement.  I was still unable to keep anything in my stomach during this period.\r\nI was feeling very agitated during this period also.  I was getting a bit frightened because my pulse was getting a bit rapid and I was getting very dehydrated.  I was also seeing images and hearing sounds that were not actually present.  I was getting very tired at this point as it had been a long night of partying.  I basically wanted the trip be over at this point, but I knew I was only about half-way though at this point.  I just kept telling myself that I had taken a lot of drugs and eventually it would end.\r\nMy friends were snorting ketamine during this time, so I thought some K might help to relax me.  I snorted about 5 bumps of K in about 30 minutes.  The K changed the trip.  It was hard to explain, but I was now hallucinating in pools.  This was cool, but failed to relax me.\r\nI decided at that point just to ride out the trip without any other drugs.  Gradually, I was able to drink some water and my pulse became normal.  About 8 hours after I took the 2CT7, I started to come down.\r\nOverall, the experience wasn't all that bad; except for the nausea.  I think the GHB in combination with the 2CT7 caused the vomiting.  I definitely won't do those 2 in combination again.  The ketamine mixed with 2CT7 was pretty cool, though.\r\nI wouldn't recommend doing all of these drugs in combination.  I think 2CT7 is a drug best enjoyed by itself (or maybe with some K) during a time when you can devote 12 hours to the experience.\n\n\n"
}