{
 "title": "Imaginary Friends",
 "author": "BiGenderous",
 "citation": "Citation:   BiGenderous. \"Imaginary Friends: experience with Dimenhydrinate (ID 15277)\". Erowid.org. Aug 13, 2005. erowid.org/exp/15277",
 "substance": "Dimenhydrinate",
 "bodyweight": "156 lb",
 "header": [
  [
   "DOSE:",
   "26 tablets",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 15277",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 13, 2005",
   "Views: 13040",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis happened last year, I wanted to try something crazier then just Mushrooms or Pot but nothing too serious, so my friend suggested trying Drammamine. We went to a store and bought a pack of Gravol, because my friend had heard that Gravol had it for motion sickness. So anyway, I put 8 pills in my mouth at once, and then I took 2 more and then a few more, and then even more pills until I realized that the pack of 30 only had 4 pills left in it. \r\nIn about 20-30 minutes, my legs began to feel VERY heavy, like i was wearing weighted ankle braclets, and i was becoming sort of sluggish and tired, my friends just told me that it was starting to kick in. We all went behind a fast food resturant to hang out and some of my friends started to drink. While sitting there, I noticed a sewer grate in the ground and as I looked at it, I began to hear shouting/whispering/crying/talking coming from the sewer, it was all in jibberish but it sounded real. I tried to tell my friends and they began to laugh, my speech had become too slurred to make any sense at all, and after 30 seconds of talking, I wouldn't remember what my point was in the first place. \r\nOne of my friends then suggested that I had Spiders crawling up and down my legs. I thought it was a joke, but after they said that, I began to feel little pin pricks crawling up and down my legs and I started to smack my legs and roll around on the ground to get them off. After I had gotten the spiders off, my friends decided to move to a different location. I can't really remember all that much, but my friends told me that had told them that I could see dead rotting corpses tangled up in wire fencing along with my Gym teacher from grade 9. \r\nAlong the way, a group of girls walked by us, when they had passed, I leaned in close to my friends ear and whisphered 'They look like wasps'. I also walked up to a poster in a bus stop and began to act as if I was using a computer to draw the picture on the poster. I started screaming that I couldn't find the Undo button cause I thought I had made a mistake. My friends began interviewing me and aparently I had said that I 'didn't trust napkins' and I kept telling people that I would 'Break their sockets'.\r\nWe walked around for a bit longer and finally went inside a fast food resturant. Everyone ordered something and I had asked for some 'Natural Spring Water'. When I got the drink, it tasted like Orange Pop to me and it looked like it too. I put the drink down and started searching on the ground and under the table for the Natural Spring Water that I ordered. I then spilt my 'Orange Pop' all over the floor and that is when we all got up and left.\r\nMy friend suggested that I hang out at his house while I sobered up. I could hear conversations going on but I could only see that one of my friends were there. Every once in a while, I could see one of my other friends in the room as well. When I thought I was sober enough, we walked to my house to drop me off. While we were walking, we passed by some bushes and trees and I could see little naked children with big eyes peeking out behind the bushes and looking at me and then hiding away again. Also, my friends took pictures of me (which are very funny looking pictures) with a camera that I thought that I was holding, but I had given it to my friend at the beginning of the night.\r\nThe first thing I did when I got home was try untie my boots. Everytime I untied them, I would look at them again only to realize that they were still tied up. I 'untied' them about 4 times and decided to give up and leave them on. I went into the bathroom to wash my face. I had turned on the tap and started to wash my hands, I grabbed a bar of soap and placed my hands under the flowing water and began to wash. I could feel the water on my hands as well as hear it, I looked at myself in the mirror and then looked down and noticed that the tap had stopped running and my hands were completely dry. The tap probably wasn't even running in the first place.\r\nI went upstairs to my computer room. When I stepped inside, one of my friends who walked me home was in there sitting on the couch, we had a conversation for about two hours and then he said he had to leave, but he had left his bag behind, I decided to ignore it and then bring it to him the next day. \r\nThe next day, I had little to know short term memory, so I stayed in front of my computer all day. Everytime I was going to leave the computer, I couldn't remember what I was going to do so I just sat back down again. I talked to my friend (the one who had been in my computer room) and he said that he was never in my house and that he had not even had a bag with him that night. That is my experience, all in all, it was pretty fun, but scary at alot of times. I recommend trying it once, but always have a sober trip-sitter with you.\n\n\n"
}