{
 "title": "Euphoria",
 "author": "gravol",
 "citation": "   gravol. \"Euphoria: experience with Ginger & Nutmeg (ID 15287)\". Erowid.org. Apr 23, 2003. erowid.org/exp/15287",
 "substance": "Ginger & Nutmeg",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 Tbsp",
   "oral",
   "Ginger",
   "(capsule)",
   "  T+ 0:00",
   "1.5 Tbsp",
   "oral",
   "Nutmeg",
   "(capsule)",
   "  T+ 0:36",
   "0.5 Tbsp",
   "oral",
   "Ginger",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 15287",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2003",
   "Views: 44879",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was typed as it happened:\r\ningested: 2-3 tblspns of ginger, 1-2 tbspns of nutmeg, 11:45pm\r\n12:34am: a nice, fuzzy, mellow buzz takes hold of me. watching Black Dog on tv; smile comes to my face, kinda like beginning of alky buzz\r\n12:40am: euphoric feeling im experiencing is obviously from the ginger... very nice, a head rush/warm fuzzy feeling; slight tracers from nutmeg starting - very upbeat, wonderful feeling.\r\n12:47am: i go out and smoke a cig; while looking up at the mysterious night sky, i start to hum that old song from the Lipitor/Life cereal commercials: 'are the stars out tonite/is it cloudy or bright/i've only got eyes for yooooouuuu'...walk around, feel uppity; stimulant feeling taking effect; when i get inside i remark to myself 'i'm feeling good as fuck' and decide to pack up more capsules of ginger\r\n12:55am: i pack another tblspn of ginger but decide not to ingest it yet. Event Horizon on next.\r\n12:57am: experiencing music euphoria, feeling emotional sorta like how music grabs ahold of your emotionjs when you're tripping.\r\n1:05am: nose feels tingly, i scratch it and oooh, feels so good; considering changing station - no tolerance for subplots, slow-moving movies.... decide to watch a comedy - okay fuck that nothing is on tv as usual, i go into my room to listen to music\r\n1:12am: on the radio: 'don't go out tonite/there's a bad moon on the rise'\r\n1:14am: the way music ahold of me it feels like i'm tripping; still slight tracers from nutmeg.\r\n1:16am: i eat another half tblspn of ginger\r\n1:33am: time moving quickly; i eat the other half tblspn; music becoming more intense; starting to sweat slightly around the temples... everything growing more intense. if i had alcohol it would definitely intoxicate me beyond all recognition, i know this for a fact because i had a shot or two of vodka a few hours ago and the feeling as a whole feels slightly intoxicating in its own rite:\r\n'A hot infusion, called ginger tea, was once highly popular for its diaphoretic (having the power to increase sweating) effect (very good for colds i presume). Alcoholic extracts of ginger, termed essence of ginger, have been used as intoxicants'  Plus I read online that ginger is a good cardiovascular agent and good for the heart and migraines, along with nausea/motion sickness. I believe it, too.'\r\n1:53am: well, coordination is definitely affected.\r\n2:18am: okay, i feel the second wave kicking in... a warm feeling in my chest... i keep zoning out, listening to music on the headphones... visualization is hard, my thoughts keep staying in the present, hard to think about the past, but everything has a certain dramatic flare to it. it's definitely a stimulant but at the same time i feel mellow and relaxed... no sign of headache or stomach ache.\r\nEpilogue: I went to bed around 3am and slept well, though I frequently woke towards daybreak with a stomach ache which may or may not be from the ginger.\n\n\n"
}
