{
 "title": "I Wasn't in the Photograph",
 "author": "Jupiter",
 "citation": "   Jupiter. \"I Wasn't in the Photograph: experience with LSD (ID 1533)\". Erowid.org. Nov 1, 2000. erowid.org/exp/1533",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1533",
   "Not Specified",
   " ",
   "Not Given",
   "Nov 1, 2000",
   "Views: 7574",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt was the last day of my junior year in high school. A bunch of us went to the park outside of town on the hill for a picnic. It was a lot of fun, romping around the playground equipment and picnic tables and playing in the grass. After a while, we split up into two groups. Five of us, me included, went exploring at a man-made stream at the edge of the park, where a cement wall created a little waterfall. The other half of our group, which included about six people, took a van to buy some food and drinks, and cigarettes if they could find someone who sold to kids under eighteen. They were gone for about two hours.</p><p>During this time, my friend R and I roamed away from the pretty waterfall. We were going to freak out our friends my pretending to down a few pills of acid. After she went back to the waterfall, I did two hits of acid I happened to have with me but I didn't tell her about. When I came back to the waterfall, she kept asking if I really took some. I didn't say anything.</p><p>I kept watching the water in this little creek. It was very hypnotic. And this is where it got really strange. I THOUGHT I had been watching this water the whole time, kneeling in the grass. As it turned out, I had been on one hell of a trip.</p><p>I thought I was still watching the water when someone shook me and asked if I okay. I sat up and realised I was lying on a park swing at the OPPOSITE end of the park, almost half a mile away from the man-made creek and the little waterfall. My pant legs and shoes were soaked. The people in the van had returned. </p><p>They told me they'd been looking for me for over an hour, that they had panicked and were fighting and crying over whether or not to call the police. R had told everyone what she thought I did. They also said that, before I ran off in what they called a fit of ecstacy, everyone had gathered together for a group photo. I was later shown the photo, and I was in it, right in front, a big smile on my face, but I'll be DAMNED if I can remember posing for it. I still swear, to this day, that I was never in the photograph.</p><p>I'm a fan of acid, but I still think you have to know your body well enough before trying anything. I'd done two hits before, and was confident I could handle myself. It's not that I had a bad trip or a train wreck. I simply lost ALL sense of reality. What I thought was just an hour of hypnotic staring at a stream turned out to be an hour of running around like a wild child, and eventually disappearing. I could have run onto to the highway and gotten flattened by a semi and would never have known.  I have scars and scratches and tears in my clothing from that very weird afternoon, and I don't remember getting any of them.</p>"
}
