{
 "title": "Guidance",
 "author": "t.",
 "citation": "   t.. \"Guidance: experience with Morning Glory Seeds, Alcohol & Nitrous (ID 15359)\". Erowid.org. Jun 13, 2002. erowid.org/exp/15359",
 "substance": "Morning Glory Seeds, Alcohol & Nitrous",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  seeds",
   "oral",
   "Morning Glory",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15359",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 13, 2002",
   "Views: 13023",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nLet me start out by saying this was by far the best journey I have ever taken.  I have read some bad reports on MG's, but I believe one can have a truly enlightening experience. As always, set, setting, and frame of mind play an important role.  I have got so much good advice from this site; I wanted to try to give a little back.<br>  My previous experience with entheogens: eaten lots of acid, shrooms, DXM, ketamine, nitrous, MDMA, Salvia D., and Cannabis.<br>  My intentions were to gain a greater understanding of the multiverse, adventure, and just to see.  I have always felt that psychedelics can really help put my life into perspective.  My girlfriend K. and I eat mushrooms once a week for our own personal therapy, and we wanted to try something new.  If I ever stop learning or having a good time, then I'll quit, for a little while anyway.<br>  The reason why I enjoyed this trip so much was due to the clear-headedness and revelations. I was not at all distracted and could easily reduce tension w/in my body.  I would compare it very closely to MDMA.  I believe MG's are a great alternative to some unknown chemical; cheap, natural and easy to find.  K. and I are definitely going to do this again.  I'm not a doctor, but I would suggest it to any experienced Head.  I had a very heightened sense of awareness and good mood.  I also found a great level of problem solving abilities and creative enhancement.<br>  To prepare I ate fruit, grains and tea for the day.  I meditated by staring at a candle and focusing on my breathing, also chanting Om (long a, oo, m), I had found my 3rd eye earlier this week.  I had also been reading more than usual and drinking Yerba Mate?.  So I go to the local store that rhymes with Day-Fart and buy 8 packs of 1.5g 'Flying Saucers'.  I thought 6gm. Would be the perfect dose.  First I washed the seeds in a water bottle with Fit vegetable soap and shook vigorously, then dried w/ paper towel and let sit for 10min, when completely dry I used a coffee grinder to get a very fine material.  Next I poured boiling water over the powder in a small glass and added Emergen-C (vitamins), and swallowed a Milk Thistle, and a multivitamin.  In hindsight this probably wasn't such a great idea, since I puked them all up anyway.   K. added some ice cubes.  I put in down in two drinks, not bad.  7:00pm.<br>  Kicked back to watch a movie.  Halfway through the slightest vibrations were intolerable, so I went outside to puke.  Be prepared, you will puke too (pepto helps).  I really think that this is a vital part of the cleansing process.  Well-being was restored soon after this.  I had been trying to hold it off for about an hour, feeling very dizzy, like I rode the Zipper at the fair one too many times.  I used this time to let go of anything that was bothering me.  I know Cannabis would have helped, but I did not wish to add any confusion or paranoia.<br>  Throughout the night I was amazed how well my brain was able to adapt to these conditions.  It was very similar to acid, but w/o the cramps, stiff back, or sore muscles.  I felt Super!  Conversation was a lot of fun; we tried to eat but found it near impossible due to the uncontrollable laughter.  10:00pm.  We live in a mountainous area and have very few neighbors, the fireflies were the only light to be seen.  Dick?s Pics Vol. 13 CD one (the Grateful Dead) never sounded so good.  I could move and dance with ease.  Lately I've been trying to induce an Out-of Body Experience (OOBE) and I felt that I could leave very easily right now.  I finally realized that I have the power to bring what I want into my life and that I create my own reality by using suggestions, just like in our dreams.<br>  Since it was only 11:00pm we decided to get some beers.  I know all too well not to combine alcohol w/ psychedelics, but I can drink 3 and stop, I'm a professional.  When we got back home I could see that the stars had finally come out to play.  So we tailgated in the driveway.  Summer is finally here!  Since we reserve the right to put whatever we choose into our bodies, we did 3 nitrous chargers, it was all we had left, thank goodness.  These proved to be extremely intense.  I was encased with static.  The internal dialogue stopped.  True bliss.  I was no longer afraid of death.  I have heart problems on both sides of my family, K. told me that when I move on, she would stuff me and leave my body in my chair, and I found this very amusing.  Then we got stoned; I always wait to the end of a journey.<br>  I really enjoyed these MG's; they allowed me to expand my ideas with ease.  I find that while on a journey I can easily focus if I let myself, and I stay happy for longer periods of time than in my waking life.  I realized how precious and yet meaningless every moment is.  All that exists is one continuous cycle repeating itself, but what we chose does make a difference. Every thought is an evolution.   We had been listening to Lynyrd Skynyrd and when Free Bird came on something happened.  The crickets went silent and it seemed as if the fireflies were really digging this tune, so I told K. to check it out.  For each part (or note) of the song there was a corresponding group of lightning bugs that would light up, they were merging with the music.  I felt as though we were all one, just a small part of a greater whole continuing into eternity.  Here's what K. experienced\n\n\n"
}
