{
 "title": "Adderall Without the Side Effects",
 "author": "Oldskool",
 "citation": "   Oldskool. \"Adderall Without the Side Effects: experience with Desoxyn (Methamphetamine) (ID 15361)\". Erowid.org. Jun 12, 2002. erowid.org/exp/15361",
 "substance": "Desoxyn (Methamphetamine)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Methamphetamine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15361",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 12, 2002",
   "Views: 133608",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI was prescribed Desoxyn 4 months ago to treat ADD. When I was first diagnosed, I was prescribed to 10mg Adderall XR (time release capsule). I had bad reactions to the Adderall (blurry vision, eye tic) so they changed my prescription to 20mg Metadate (time release ritalin capsule). The ritalin didn't give me the bad reactions but it also didn't give me the good effects that the Adderall did. After my psychiatrist changed the medications around on me so many times I felt I had the right to explore different medications.</p><p>Being an occaisional a recreational user of stimulants, I learned about Desoxyn (prescription methamphetamine). I brought this medication up in my meeting with my psychiatrist and pretty much said something along the lines of 'If Adderall worked better for me then Ritalin, what is to say that Desoxyn won't work better then the Adderall?'. When I brought up Desoxyn they didnt know what it was so I had to inform them. They prescribed it to me to try.</p><p>I had some trouble finding a pharmacy that carried it but I finally found one and they order me(the only one that has a prescription to it there) a supply every month.</p><p>Desoxyn is not prescribed much anymore because of it's misuse, addiction potential, and cost. It's effect is different from that of street meth in the way that it is less recreational. It burns uncleanly when smoked and is weakly active insulflated. When I take a larger dose of it (20+ mg) it has the effect of a large dose of Adderall with less of the negative feelings.</p><p>I started using 10mg of Desoxyn daily last month (2 5mg pills in the morning, Monday through Friday).  When I first got the prescription, I binged with the pills a little, but then found that unsatisfying and prefer taking them more regularly. It has made my life better in the way that I have more motivation and energy to do things such as homework and work in general. I like it better then Adderall because it's effects are more clean. I feel more in control of the speediness and my thoughts are clearer.</p><p>I had read somewhere that Desoxyn was discontinued, but this is only halfway true. It isn't Desoxyn that was discontinued it was Desoxyn Gradument (a time released form of Desoxyn).</p><p>Sometimes it can get to be too much and I can't compose thoughts as well for things such as conversation. When this happens, my words seem not to flow with ease, but at other times it enhances my conversations in the way that it makes me feel as if you need to make conversation. While I'm up on Desoxyn it makes me feel mentally sound, like everything is ok and I find the crash is much less harsh than that of Adderall. </p><p>As far as recreational use of stimulants goes, I have nearly completely stopped my recreational use of stimulants. Meth especially has much less of an appeal when you're prescibed to it. I no longer look at such stimulants (i.e. meth) in a recreational way. They are a tool and not made for recreation (if I would have to place Desoxyn on a level of recreation it would be the same as Adderal). As far as Desoxyn's addiction potential I would have to rate it higher then that of Adderal, but it is controllable if I don't let myself talk myself into taking another one when I'm on the down. </p><p>All pharmacuetical stimulants (including Desoxyn) can make your life better or worse, you make the choice.</p><p>Oldskool A-town Indiana</p>"
}
