{
 "title": "Electronic Opiate",
 "author": "fict",
 "citation": "   fict. \"Electronic Opiate: experience with 5-MeO-DiPT & DXM (ID 15375)\". Erowid.org. Nov 3, 2004. erowid.org/exp/15375",
 "substance": "5-MeO-DiPT & DXM",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)",
   "  T+ 0:12",
   "150 mg",
   "oral",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15375",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 3, 2004",
   "Views: 11411",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was nothing too terribly spectacular, but since the combination was fairly novel, I felt that it would warrant submission to the experience vaults.\r\nLast night at around 10:42, I weighed out 10 mg (+-2mg) of 5-MeO-DiPT onto a jewel case, cut the pile in half, then cut one of those piles in half again.  I set aside the larger pile for another time, and insufflated the two 2.5 mg bumps.  Ouch ouch ouch ouch OUCH.  Let it be known:  5-MeO-DiPT BURNS.  Furthermore, the post-nasal drip is beyond horrid, and leaves a terrible burning, cutting sensation in the back of your throat.  Gah.  So, why snort 5-MeO-DiPT?  The body load is cut back on dramatically, almost to the point where the buzz become enjoyable.. but not quite.\r\nTypically when I use 5-MeO-DiPT, I combine it with pot to ease the muscle tension and general feeling of weakness.  Tonight, however, I wanted to try something just a bit different.\r\nWithin 5 minute of snorting the 5-MeO-DiPT, the effects were coming on very nicely.  There weren't any visuals, per se, but there was a definite visual change, along with the typical 'psychedelic static' that I get on virtually any tryptamine.\r\nPerhaps 10 or 15 minutes after doing the bumps of 5-MeO-DiPT, I measured out 150 mg of DXM, which was immediately consumed.  \r\nAbout 45 minutes later, I found myself in a nice, warm place, with a body buzz that I would describe as a cross between MDMA and oxycodone.  Wonderful.  There was an almost electronic 'humming' around my body, as pleasent tingles of energy flittered around my skin and warmth enveloped my chest.  I lied down for a while, and found myself lolling about in a state of opiate-like dreaminess, but never actually falling asleep.  When I got up, I found that my body had a tremendous amount of energy, and movement felt wonderful.\r\nPerhaps 4 hours after consumption, I tried to go to sleep, but found it completely impossible.  With the lights off in my room, my vision began 'strobing,' and with my eyes closed, patterns overtook my vision.  I got back up, chatted with a few friends, bummed around on IRC a bit, and finally got to sleep around 4:00 AM, about 5 hours after first doing the 5-MeO-DiPT.\r\nPlease take note that I kept the dosages on both substances very, very, very low.  When dealing with combinations, especially those involving research chemicals, excercise caution.  At no point in time did I feel uncomfortable during this experience.  There was slight jaw tension, but nothing like MDMA or even Adderall for that matter.  3 out of 4 stars recreationally, 0 out of four spiritually, educationally, etc.  \r\nI guess that about wraps things up.\r\nPeace.\n\n\n"
}
