{
 "title": "Hobbies: School Work",
 "author": "LoxNoRE",
 "citation": "   LoxNoRE. \"Hobbies: School Work: experience with Amphetamines (Methylphenidate) (ID 15392)\". Erowid.org. Nov 28, 2003. erowid.org/exp/15392",
 "substance": "Amphetamines (Methylphenidate)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  drops",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "15392",
   "Male",
   " ",
   "Not Given",
   "Nov 28, 2003",
   "10973",
   " "
  ]
 ],
 "report": "<p>Over the course of three years in the drug scene, starting at age 13, until now, at the age of 16, I have become trapped into the blackhole of Amphetamines.</p><p>When I first had an expierence with Ritalin, in particular of the Amphetamine family, I was prescribed 20mg of time released Ritalin, releasing 10mg every 4 hours. I was lifted, euphoric, FEELIN GREAT! Legally too! As the 'side effects' wore off, I became sad, wanting the REAL ME BACK, I took matters into my own hands, I worked my tolerance up to 80mg's just to get a good high off of it.</p><p>Which brings it to right now, I am currently high as of this moment off of 85mg of ritalin, feeling a good buzz. I enjoy doing my homework,feeling the flow of my cursive writing, its like my best hobby ever, and listening to music (a music is a MUST FOR ME). Everything in the world makes so much sense, I feel at a higher level than everyone, I pass final exams with 96% averages,my shyness in me goes away, and I make more friends..It's just the most wonderful and euphoric drug to me (more euphoric than cocaine, in my opinion. Time does go by very fast let me add.</p><p>But you all know what? when your out of Ritalin, you turn, LITERALLY, let me repeat, LITERALLY, insane, crazy, syco. The reason for this is, my ritalin was made up of SMALL beads, I would spend hours looking in my rug, scraping up little beads, knowing I wont achieve anything, over and over I would do it (proper definition of insane; repeating same process, knowing it has no difference). Also, when I have no more of this drug, I will start to have mild hallucinations (ex. trees wobbling at night), faint hearing of music, noises etc..SEVERE depression (I had thoughts of suicide)...</p><p>Ritalin has changed my life in the most BEST way, and the most FUCKED UP way ever..I regret 55% of it, and dont regret the other, I hope you all don't make my mistakes. if you do, don't be surprised.</p><p>Now I understand why Ritalin is Schedule II Substance, as addicting as cocaine, both in the same class, both stimulants. All these have a SEVERE potential for addiction.</p><p>BE SAFE</p>"
}
