{
 "title": "Very Enjoyable",
 "author": "Yoggybear",
 "citation": "Citation:   Yoggybear. \"Very Enjoyable: experience with Nutmeg (ID 15408)\". Erowid.org. Mar 27, 2008. erowid.org/exp/15408",
 "substance": "Nutmeg",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 4:45",
   "20 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15408",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 27, 2008",
   "Views: 6835",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have avidly followed the reports on Nutmeg for a few years now. Last night whilst doing the shopping I thought fuck it I'll buy some. I bought a 42g bottle of ground nutmeg:\r\n8:00pm - Weighed out 15g of ground nutmeg. First tried spooning into mouth and washing down with water, tasted extremely unpleasant. In the end, I ended up mixing it into a glass of water and drinking it - Even more unpleasant. \r\n8:45pm - Starting to feel slightly light-headed and distant. Not sure if it the nutmeg or a placebo effect.\r\n9:00pm - Ate large dinner, I now feel completely straight.\r\n10:00pm - Starting to feel light-headed and distant again. But no prominent effects to speak of.\r\n11:45pm - Feeling very relaxed and chilled, I just want to lay on the couch. Also feeling extremely tired.\r\n12:00pm - No effects to speak of. Pretty disappointing really.\r\n12:45am - 'Think fuck it I'll have some more.' Ingest 20g of ground nutmeg. Only just as I'm in the process of spooning it into my mouth I'm starting to feel something. Washed nutmeg down with lemonade, it got rid of the flavour surprisingly well.\r\n1:00am - Give in and go to bed.\r\nA night of very odd dreams then insued, although cannot remember any of them.\r\n10:32am - Woke up, all the colours of my bedroom are extremely intense, my vision is extremely skippy, my mind is cloudy and I'm experiencing a large body load. It's extremely hard to keep my eyes open and I have a very pale complexion.\r\n11:00am - Shower - effects are becoming more intense, they are very enjoyable, similar to being very stoned. I now also have red eyes and am very hungry.\r\n11:30am - Eat breakfast. Still feeling the effects there is no drop in intensity.\r\n1:00pm - Listening to music and writing this report. The music is very enjoyable, it's sending tingles down my spine. Still feeling very stoned, there is no drop in intensity. Writing this report is quite difficult. The Drum 'n' Bass I'm listening to is really making me feel fucked. \r\nI am of the understanding that I should go into a trippy stage soon. Even if I don't this is still a good and cheap buzz. I am aware of the dosage for nutmeg that being 1g per 10lb. And so it appears I have taken far too much, but I don't feel any signs of an overdose or unpleasantness, maybe I've just got a high tolerance.\n\n\n"
}