{
 "title": "Dance with Salvia",
 "author": "Flux",
 "citation": "   Flux. \"Dance with Salvia: experience with Salvia divinorum (ID 1541)\". Erowid.org. Jun 4, 2001. erowid.org/exp/1541",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.8 ml",
   "sublingual",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:45",
   "25 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:50",
   "25 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:55",
   "25 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 1:30",
   "25 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1541",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 4, 2001",
   "Views: 6770",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI was excited and somewhat aprehensive about the long awaited use of salvinorin...I expected it was going to be a very amazing day. I had cleared my mind and worked on becoming as peaceful as possible and before I was about to go ahead and take the dosages some freinds of mine (experienced tripper/hippies) called and I invited them down to share the experience. On arrival of my friends we lit some incense and even more friends came in....in the end there were seven people in the room...which was quite not the desired amount...but I was going through with it anyway. ( I was an extremely experiencd with transcending time/space and am very loving of nature and the earth, though at the time was not completely balanced and was somewhat of an escapist).  <br>I took 1.8 mL of the liquid extract and held it in my mouth for about ten minutes. I then spat and layed back and listened to some Autechre playing lightly in the background. My friends took various dosages and layed down on the floor.  After a minute and a half, I noticed increased ecstatic energy flow in my body and felt an increasing surge of clear mental thought and insight, but nothing amazing. After about 15-20 minutes I started to feel that there were little plants growing in my cells and they were producing sexual responses, like my cells were having sexual intercourse...This lightly resided over the next 10 minutes and I was left with only a mild buzz and increased mental capacities.  <br>I decided to smoke the standardized 'extra strength' leaves at a pre-measured 25 mg, as I liked it so far, and figured I'd go all the way.  I packed the first 25 mg dose in a pipe and smoked it, holding it in for a VERY long time. I didn't feel that much different than last time though, but the ecstatic feeling wasnt really there as much, just a slightly trippier feeling replaced it. After it went down in only a minute, I decided that other's stories were exaggerated and smoked two more 25 mg. doses.  The same effect was noticed and went down quickly. It was very trippy, but well.....no Tibetan Book of the Dead material like I was used too....soo...oh well. <br>After waiting till I was pretty much back to normal I walked around for a little while and laughed and went outside for abotu 20 minutes.  When I came back I said hi to all the people in my room who were talking, quite noisily, and I decided to take another 25 mg dose. I held in the hit for a long time as usual, but right when I exhaled it, I felt and extremely strong force pulling me backwards...and I felt as if I were literally falling of the edge of the universe. I was so caught off-gaurd by the quickness this that I fought and looked around quickly. My reality appeared to be made up of layers upon layers of multi-dimensional energy, and I was peeling all the these layers like an old skin that I didnt need anymore as I couldnt ware them where I was going. I however was COMPLETELY lucid and completely aware while this dimensional shift was going on.  My friends had no clue I was so gone and were talking noisily amongst themselves and to me occasionally though I could barely talk.  <br>I was frightened by their talking and stood up.  I could barely walk and my sense of gravity was shifting to different spots which almost caused me to fall on one of my friends.  I quickly left the room and went to a quite one.  I then decided flow with this new dimension, but douldnt until I peeled this skin of reality I was wearing.  I felt an extremely wise knowing presense in the room that was very hard to describe...very familiar...like a parent or something, but also a wise old friend that knew me better than I did... All of a sudden I heard talking in my mind that said 'Your song will bring me again someday, I will come then and you will be shed of this old skin and we will dance then, old friend. I know you well, your dance brings much more than you know'. <br>I felt this prescence expected much from me that I wasnt  capable of at the time and I felt that I wanted to not have this fear anymore of this peeling skin of reality.  I promised myself that I would not forget this and one day would be free of these old fears and old energy and would be able to dance with who ever it was that was there that day....  <br>NOTES:have ONE person present to watch over you, but have him/her be silent. DO NOT have lots of people present, as it WILL freighten you. RESPECT salvia, it is not for getting high or even for getting visuals, it is for the person who understands ascension and has a deep love of the earth and its inhabitants, and is willing to look at the HORRIBLE ASPECTS of himself with love and knows how to bend paradigms...PERIOD.\n\n\n"
}
