{
 "title": "A First Trip Gone Right",
 "author": "Cosmo",
 "citation": "   Cosmo. \"A First Trip Gone Right: experience with Mushrooms (ID 15426)\". Erowid.org. Jul 11, 2002. erowid.org/exp/15426",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 15426",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 11, 2002",
   "Views: 8846",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had dabbled with the idea of tripping on mushrooms ever since my close friend had returned from Europe full of positive input regarding his first trips. \r\nI had everything perfect, setting, people, mood, but there was one small problem, obtaining the shrooms themselves. My location is in a place that is awash with grade A weed, but not a single soul has heard of shrooms. Not to be deterred by the small things, my more resourceful friend mail ordered them, and to all our disbelief, they arrived 5 weeks later, nicely packaged, straight from Holland. \r\nI had been apprehensive about taking them because of all the old wives tales and rumors that tend to circulate about these substances. I decided to set the record straight for myself and did in-depth research, talked to my more experienced friends, and decided that this was an experience which I too wanted to take part in. \r\nWe had a house with a large pool across from a private beach and the beautiful Atlantic ocean, immense, quiet, serene, and perfect for enhancing the effects of psilocybin. A date was set, and the trippers, three of us, agreed on a time to ascend into the realms of the mushroom gods. \r\nOn the lucky day, we met and decided to pop them on a little secluded beach right down by the water, with waves running over our feet. I had my packet, and was appalled by the horrible smell, and couldn't imagine how anyone in their right mind would be willing to actually eat these little fuckers. Slowly, I put one in my mouth, let it stick to the roof of my mouth, and inhaled through my nose, trying to posses the full body and aroma. I swallowed, noting the unpleasant after taste, and reached into the pouch to retrieve another. I continued this procedure until the entire three grams of Mexicans were happily in my belly. \r\nWe decided to walk the coast a little and catch the sunset while we waited for our trip to start kicking in. We amused ourselves, and I was contentdly on my back when an airplane flew overhead, right into the setting sun, and that's when I knew I was tripping. It was exciting to know that I was finally experiencing the notorious trip which I had been hearing about for weeks. I had heard stories of people becoming paranoid and nauseous. Not me. I felt excellent, vibrant, and full of energy. And this was just the beginning. As the evening progressed we migrated up the coast and lay on the beach during the strongest portion of our trip. We popped them at about 6 PM and were at the peak at night, under a starry sky, at bout 10 PM. That was 4 hours from the initial time taken, fairly standard. It was interesting that I had taken 3 grams of Mexicans, while my 2 friends had each taken 1 gram of Hawaiians, yet we were always all on the same page in terms of where we were at in our trips. We coincided with one another amazingly, always ready to move on and do something else at the same time. It was an ideal match, because if someone in the group is unhappy, then his, and possibly everyone's trip, can be ruined and turned into an unenjoyable experience. \r\nI did not have intense visuals. My visuals never extended past seeing the starry sky sort of bend and twist, as if wanting to pull apart. After all of us saw a shooting star, we decided it was time to head back into the house and start the hash session to prolong the effects. Unlike many other drugs, with shrooms, when the effects begin the weaken or wear off, you dont feel depressed or sad because there is still so much to think about and feel. We had a 2 disc changer in the room, and stuck Cypress Hill Black Sunday in one tray and Temples of Boom III in the other and just rolled on the psychadelic beats of DJ Muggs and B-Reals tight flows. I highly recommend these two CDs for trippers, although I'm sure you have your favorites. While kicken to these beats, I'll call him Method, started rolling large hash joints, using a special technique he learned in Rome known as backrolling, where the joint is rolled backward and the excess paper is torn off, leaving you with the minimum amount of paper left so you can truly enjoy the hash. I recommend smoking at the end of the trip, preferably hash or real chronic weed, but not during the trip. I felt that during the trip you should experience the effects of the shrooms alone and not introduce foreign substances into you body at that time. We called lights out at about 4 AM, having enjoyed a 10 hour trip. I fell asleep listening to the Hill and feeling absolutely wonderful. \r\nI did not dream, but woke up feeling like shit. After conferring with my compadres about this, they concurred that this is weird and not normal, and that people always wake up feeling energetic and refreshed. Oh well, not everything can go perfect.\r\nIn closing, I would HIGHLY recommend trying shrooms. I suggest an oral dose of 3 grams of Mexicans to start. Some might say 3 grams is over zealous, but the one major complaint trippers have is that they wished they had taken more the first time. To avoid being among those numbers, 3 grams will be plenty. Also, be sure to enter the trip in the right mindstate. Dont be pissed about something that happened, or worse pissed at someone in the trip circle. This is a sure fire way to fuck things over, for everyone. Shrooms put you in touch with Mother Nature, so the mindset is critical. Other than that, eat, wait, and enjoy. \r\nNote: I experienced no, repeat NO, adverse negative side effects during the days after my trip. I was quieter than usual, but then again, I had a lot to think about.  ENJOY RESPONSIBLY!\n\n\n"
}
