{
 "title": "Sex Drug? Upsides and Downsides",
 "author": "ProzacKid",
 "citation": "   ProzacKid. \"Sex Drug? Upsides and Downsides: experience with Amphetamines, Sildenafil (Viagra) & Cannabis (ID 15432)\". Erowid.org. Mar 15, 2007. erowid.org/exp/15432",
 "substance": "Amphetamines, Sildenafil (Viagra) & Cannabis",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "Amphetamines",
   " ",
   "  T+ 0:00",
   "100 mg",
   "oral",
   "Pharms - Sildenafil",
   "(pill / tablet)",
   "  T+ 6:00",
   "1 hit",
   "oral",
   "Amphetamines",
   " ",
   "  T+ 0:00",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15432",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 15, 2007",
   "Views: 30354",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience of phet (UK based, so dextro I believe) was in an unusual setting, in the sense that it was after a party where I stayed behind and ended up having a sexual experience with a swinging couple (who are friends previously). Anyway, we were in the small hours when the couple suggested I try 'a bomb' of phet to keep me awake. I declined, and opted for a dab instead which seemed to do the trick, although I probably didn't have enough to make any serious effect obvious. </p><p>Two weeks later, I met them again and this time decided to go along with the ride for the whole night. I took a bomb (wrap) at about mid-night and about 20 minutes later suddenly became aware that I was wide awake, despite being draped across an armchair with my eyes half closed! I also became aware that the conversation, which was good anyway, was reaching another level - I ended up talking about a myriad of topics with no concern for the time or the level of 'philosophising' that was happening. I also became acutely aware of the feeling of being 'sexy' - this is part may have been due to the situation but I noticed that any remotely suggestive thought I had sent shivers through my body (pleasurable) and raised my level of excitement and anticipation far higher than when sober.</p><p>After a couple of hours we all ended up in various states of undress when I realised one of the negative side effects of the drug. Despite feeling incredibly turned on I just wasn't getting remotely hard. Normally, I would put this down to nerves but not this time as I was incredibly relaxed and felt ready for just about anything. Luckily the male half of the couple pointed out that this did happen which put me at ease, however it was a strange sensation...feeling horny and desperately wanting to do something but losing all faith that I would be able to.</p><p>This particular state led to a couple of interesting observations. Apart from discretely stroking myself to try and get hard (in vain) for a lengthy period of time, almost without the ability to stop doing it, I also realised I was moving my knee from side to side as I sat. This movement wasn't totally beyond my control however it seemed to be. No sooner had I noticed and stopped, I started doing it again. My conclusion was that phet must leave the body in a situation where it is doing *something*. I can't just sit there and relax, no matter how relaxed I am. Something has to be happening.</p><p>The unexpected penile disfunction was addressed by taking a 100mg viagra pill. Normally this works well whenever I have tried it before (in a sober state) but it didn't seem to be having a great deal of effect this time, perhaps because my body was more used to V than Phet. The male in the couple seemed to noticeably improve and he hadn't taken V before. Or it may have been due to the dope I had previously smoked. Just to clarify, years before I had a bad experience after smoking a lot of cannibis when I was left temporarily impotent and this seems to have left a psychosematic reaction when it comes to smoking weed. </p><p>At around 5.30am, with the effects of the phet wearing off and the V still in my system I was able to function more normally, although I was not as hard as when sober. My next observation was the sheer length of time it took for me to reach orgasm. I am normally fairly quick, but the playing went on for several hours and my obsession with reaching orgasm (and I was STILL feeling incredibly sexy) meant that I was still going even though I realised I was getting sore. Incidently, during this play session I dropped another bomb (at around 6am) to not only 'up' the pleasurable sensations again but to ensure I stayed awake for the long drive home later!</p><p>The feeling of touch on my entire body was increased, each touch sending me into heaven. My hairs seemingly standing to attention everytime something new happened.</p><p>When I did eventually orgasm, it was a total body orgasm and probably the best I have ever experienced. I must have been cumming for what seemed like minutes rather than the usual seconds, and found myself still orgasming to a lesser extent 5-10 minutes later. Afterwards, rather than the usual feeling of sexual disinterest which generally follows orgasm, I felt 'tingly' and still highly sexual, despite my knowledge that it was over and I wouldn't have physically been able to continue if I wanted to. </p><p>The lovely wave of tingles and shivers, the responsiveness to touch, the hightened awareness of feeling 'sexy', the lessened inhibitions and the mind-blowing orgasm would lead me to conclude that this is the best sex drug available, if it wasn't for the negative effect of the actual penis.</p><p>Later that day, still tingling I took a hot bath which felt amazing and the feeling of being 'sexy' lasted most of the day. I didn't need to take a third bomb as the daylight had allowed me to catch my 'second wind' and I wanted to fall asleep at normal time the following night, which I did incidently and had a sound 8 hour sleep and woke feeling refreshed.</p><p>Since this time I have experimented a little with dosages and my conclusion, from my perspective - I guess everyone is different, is that taking a higher dosage didn't seem to have a noticably increased effect however I felt far rougher the next day and encountered a very sleepless night when I did go to bed. Taking two-three bombs each night for two nights (as opposed to one night) worked well but I noticed the 'come-down' far more, which can be quite unpleasant.</p><p>The come-down I have found doesn't happen straight away but seems, for me, to kick in two or three days after taking it. I notice an increased level of anxiety and little things that wouldn't normally worry me, play on my mind and I become quite miserable. Normally this isn't too much of a problem as it only seems to last for an evening but on the occasion where I used phet for two straight days I noticed myself becoming quite depressed, and this un-nerved me somewhat.</p><p>I now only ever take phet on a weekend, and usually for only one night and usually only two wraps. This seems to work best for me and the infrequency of use seems to keep my tolerance about the same level. I can easily see how taking it more regularly could lead to all sorts of problems, both physically and psychologicaly - although, as a caveat I will add that I have quite a responsible job, and if that wasn't the case then the temptation would be quite strong I think.</p><p>For a drug that maximises weekend 'awake' time, and if taken in moderation and with other people, this can be an exciting, sensual, social drug with very few negative effects. I guess its a case of all things in moderation.</p>"
}
