{
 "title": "Indifferent to It",
 "author": "Obi",
 "citation": "   Obi. \"Indifferent to It: experience with Cocaine (ID 15460)\". Erowid.org. Jun 25, 2007. erowid.org/exp/15460",
 "substance": "Cocaine",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "15460",
   "Male",
   " ",
   "Not Given",
   "Jun 25, 2007",
   "2380",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I tried coke, I couldn't wait to do it.  My friend B came over to my house solely for the purpose of letting me try it out.  What he had was, according to him, 'some good shit', which I know can be pretty subjective sometimes, but I know that he's fairly experienced with this sort of thing so I believed him.  It was almost brownish in color, and had a sort of 'chunky' texture to it, even the moderate humidity in the room wouldn't allow for it to be cut up easily.  So anyways, B cuts up a line and shows me the whole duck & sniff routine and then it's my turn.</p><p>By this time I'm already pretty psyched and feeling jittery, so right after I do a pretty fat line that he's cut up for me, I sit back and try to notice any discernible effects.  I couldn't feel anything at first, but then after about 5 minutes I could sense a slight 'speeding up' of my body and mind, but that was about it.  There was no sense of euphoria like I've heard described by so many people, I just felt a little hyper.</p><p>So we go downstairs where I'm working on a computer for my friend S who's there also and I sit down to finish doing whatever I'm doing when I realize that I can't concentrate very well.  So I tell S 'I don't think I feel like doing this right now, maybe you should come back later' and he agrees and B and I go up to my room to mess around on the guitar for awhile.</p><p>By this time I suppose I'm pretty much peaking, and while I can't say that it was euphoric, it wasn't unpleasant either.  Playing the guitar or even watching B play was very interesting, although it was hard for me to play because I noticed that my hands were sweating, which they don't usually do.  We continue taking turns playing around on the guitar for about 20 minutes, and then B says he needs to go pick up his car since he rode over with his girlfriend.  He asks me if I want to come so we can do another line and I say sure.</p><p>We get to his car and do another line, about the same size as the first, a pretty generous one, and it's still pleasant but again, there's no sense of that elusive euphoria that I hear so much about.  Then it's time for B to head out so I thank him for the present and his girlfriend drives me home.</p><p>About two months passed and I was having a party at my place when my roommate A gets the idea to call B and get some coke, so we call up B and get 2 grams off him and he comes up to chill with us and do some coke.  I'm guessing each of us did about a 1/4 gram at least that night, I'm not even sure if that's a lot or not, but at any rate it still didn't have much of an effect on me.  And there was no time when I ever felt like I just had to have another line, I just couldn't think of any compelling reason why I'd want to do more.  </p><p>Overall I was starting to feel let-down by the whole cocaine experience, especially since this time I'd paid for it and done more than I had last time and it still wasn't giving me much effect.</p><p>Maybe I'm just one of those lucky types who isn't bitten by the coke bug, or maybe it's got something to do with my personality type, but coke just doesn't do it for me.  I read all the horror stories online and wonder how people could fall so far with this drug.  My roommate A feels the same way about it, he wasn't particularly struck with desire by coke either.  Of course we're a lot alike and don't harbour very addictive personalities, and try to approach situations as objectively as possible.  And it could be that the stuff we had just wasn't that good, but A's girlfriend really seemed to like it, and so did B, while A and I were all the while fairly indifferent.  That's not to say that I didn't enjoy it, the stuff just never lived up to what I thought it would be.  Hell, the shit was too expensive anyway.</p>"
}
