{
 "title": "Blast off to Nowhere",
 "author": "InSaNe",
 "citation": "   InSaNe. \"Blast off to Nowhere: experience with 5-MeO-DMT (ID 15494)\". Erowid.org. Jun 25, 2002. erowid.org/exp/15494",
 "substance": "5-MeO-DMT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15494",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 25, 2002",
   "Views: 15588",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWe shall start out with some backround information.  I weigh 165, have smoked weed for a year or so now extensively, have used morning glories and HWBR seeds(though not resulting in much pleasure), and have done an 1/8th of mushrooms once.  We've also tried nutmeg, which did absolutely nothing for me.  It is Thursday June 13th, 2002 as I write this.  I am 15.  No emotional or mental issues, would definitely call myself grounded.  Out of all my friends, I deal with hallucinogens the best so far.  I have no problems with 'letting go' and having control of my mind taken from me chemically for a brief while.</p><p>I recently purchased a gram of 5-MEO-DMT for $175.  The first chance we had, my two friends tony and todd came over.  We measured out 10mg (which wasn't particularly bright, tony has used HWBR seeds once and threw up, never really used shrooms or any other psychedelic) using an electronic scale that is relatively sensetive; then poured it on top of some weed in a bowl.  Tony took one big, continuous, deep hit.  He sat up for a few seconds, then laid back calmly on the bed, blew the smoke out; then sat up, and began throwing up all over my bed, the floor, and himself.  He didn't look unhappy or frightened while throwing up, in fact afterwards when he came back to reality he didn't even remember throwing up.</p><p>After he finished throwing up, he was moaning 'Oh my god' very loudly and garbled.  By this time, todd had run out the door and gone home(leaving tony, his brother, here throwing up).  My mom was still in the bathroom, and came in; fortunately tony had stopped throwing up.  At this point, he was laying on my bed with a huge smile on his face, his eyes closed, his legs were shaking and his jaw was chattering, and he kept moaning 'oh my god'.  After 7-10 minutes or so, he was able to sit up, still completely doped out looking and smiling big time.  He, over the period of another ten minutes returned to complete coherency and began helping my mom clean up the throw up.  He then gave her twenty dollars for the DMT he had just used, since she paid for it in the first place.  My mom asked him if he would do that again, he hesitated (due to it being somewhat of an awkward situation), then said 'yes'.</p><p>Shortly after this all this, my mom had to go.  Todd came back over after having heard about tony's incredible experience.  My turn to try it came next, so we again stupidly placed roughly 10mg in a bowl with some weed.  I sat in my computer chair, and had my friend hold the pipe.  Not wanting to launch myself into a different reality my first go at it, I took a small brief hit and only held it for 10 seconds or so.  I started feeling it, but nowhere near descriptions, so I took another hit.  This time I had a much quicker come on, with my whole body tingling (particularly the genital area) and my thoughts quickly having to be focused on handling the intense whole body rush.</p><p>It wore off shortly, but the experience was awesome.  We knew we would have to perfect the smoking technique, and next time be prepared in case tony threw up or has built a tolerance for it at this point.</p><p>This time the location is todd/tony's basement.  They have a sound proof booth that is perfect when we need to do stuff that may result in loud noises.  This time, we used about half(5mg) of the dosage tony had done.  My friend created a pipe using aluminum foil, I wasn't there when he made it but as described he wrapped the foil around a pencil to form a tube, then at the end bent it into a bowl shaped design.  We tapped the DMT into the bowl.  We were all sitting in the sound proof booth on the floor, with a pillow behind whoever was tripping and plenty of blankets.  A speaker inside was playing the only two soft songs he had on his computer, Blue Oyster Cult -- Don't Fear the Reaper, and Dave Matthews -- Crash.</p><p>Todd held the pipe up to my mouth, and held the lighter under the aluminum bowl for a while.  I began sucking after he had been heating the aluminum for 10 seconds or so.  I took a much better hit than I did earlier in the day, and it began coming on very quickly, very hard, and very sudden.  I closed my eyes as my whole body dissolved, no longer able to distinguish the individual parts of my body.  I felt as if I was just my mind floating there, looking out at everybody else as if they were in a different reality.  This feeling passed after what seemed like a few short seconds, and I began coming down.  The coming down was just a light glow, my body was still numb and vision was still altered.  But the rush, that is amazing; indescribable.</p><p>We did it repeatedly off and on throughout the night.  The next night, we did it again all night long.  Overall, in two days, we had each done it 7-10 times.  This left us, or me at least, somewhat physically and mentally exhausted.  My two friends did it again a third night(the night I write this), but I abstained.  </p><p>5-MEO-DMT is an amazingly intense substance, with a feeling that is hard to describe or compare to anything else.  Although I would definitely suggest you don't go on a two day DMT binge, we at least are fine with no noticeable after effects, but you never know.</p>"
}
