{
 "title": "First Psychedelic Encounter",
 "author": "Jman",
 "citation": "   Jman. \"First Psychedelic Encounter: experience with LSD & Cannabis (ID 15505)\". Erowid.org. Jul 2, 2002. erowid.org/exp/15505",
 "substance": "LSD & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "0.25 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15505",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 2, 2002",
   "Views: 28368",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI have always taken an interest into exploring the many facets of human consiousness, so naturally when I came upon the opportunity to experience LSD in a safe and controlled environment, I took advantage of it.  Seeing as how my only prior drug experiences were with marijuana, I decided to take what I thought were necessary precautions to prepare myself for the trip.  A few days before, a friend and I, who was also going to trip for the first time, conducted some research on Erowid to gain an unbiased perspective towards LSD.  We both knew the power of this psychoactive, and decided to take a low dose, so as not to induce any negative occurences.  We had also decided to abstain from marijuana until we had ingested the LSD.\r\nAnticipation ran high as we met up with two other trusted friends early in the morning on the day of the experience.  My friend and I were the only ones who would trip that day.  We all sat in the basement in a circle, then we proceeded to ingest half a tab of LSD.  Approximately 15 minutes had passed, and we all decided to smoke a bit of marijuana; apparently it is supposed to quicken the onset of LSD, but I remained skeptical.  A game of chess had started between two of us, and I watched intently.  I shall attempt to spare some of the minor details from now on, as quite a bit time had passed before I noticed anything significant.\r\nNearly 1 hour had passed since the ingestion, and my friend and I concluded that 'something' within us was different, yet we couldn't put our finger on it.  It was reccommended that we ingest another quarter tab, and so we both did.  I could feel this strage feeling escalating, as if I were riding upon a roller coaster at very slow speed.  I mostly figured that this was growing excitement, but I was unsure.  Nearly 2 hours had passed, and the trip had commenced.  I stared at one of my non-tripping friends, and could start to make out a purplish aura surrounding his body.  I then shifted my glance towards another of my friends, and a smaller, less pronounced aura could be seen encircling him.  It was at this point that I knew I was under the influence.  I felt awestruck and exclaimed my visions to everyone with excitement.  My mind was clear, my rational and logical thought was still intact, and I came to the early conclusion that LSD was not as powerful as I had thought.\r\nUnknown amounts of time had passed; I was feeling quite pleasant, despite the bizarre undulating feelings within my stomach.  I felt very connected to my friends, yet somewhat isolated at the same time.  I knew that I was on my own with this substance, and only I could guide myself through it.  It was at this point when my friend suggested that both of us trippers concentrate on something around the room; visions on LSD have to be induced according to him.  My tripping friend and I, who was also feeling the effects of the drug by now, proceeded to lay down and gaze toward the stucco ceiling.  I regard this vision as the most significant event in my trip.  Before I could utter the words 'Nothing is happening', the ceiling appeared to be shifting, cascading over my head.  This was an amazing sight, and I felt like the most privilaged person in the world.  It reminded me of a waterfall, and soon enough, waterlike textures could be seen upon the ceiling.  \r\nJust then, it hit me; I felt as if I had 'figured out' the workings of LSD.  I was under the impression that visions had to be mentally induced; that the user simply does not 'see things'.  LSD is a very intellectual drug; in my opinion, the more imaginative and cultured the user is, the more profound the experience will be.  Continuing on, I was still staring at the ceiling, and some Pink Floyd was put on, perfect music for the occasion.  I used my imagination in conjuction with the music to produce a sunset background upon the ceiling, then I could see what I thought were thousands of birds superimposed upon the sunset image, all flapping rhythmically with the music.  \r\nThis was just so profound, I had ceased all movement and talking for an unknown amount of time, my tripping friend was doing the same.  I was snapped back into 'reality' when my non-tripping friend asked us if we needed anything to drink.  It felt like quite some time before I tore myself away from the vision; I could have spent my entire trip gazing upward to the ceiling.\r\nI was unaware of how far into the trip I was at this point, time seems to mean very little.  We all position ourselves in front of the television, and one of my non-tripping friends asks us if we wish to watch the Fantasia DVD.  We all agree, and the disc is played.  He proposes that we not talk throughout the show, that we experience this video on our own.  To shorten this up, the Fantasia DVD was incredible.  Never before have I openly cried during any sort of movie.  I was very enthralled by it all; various emotions kept springing up at different times during the movie; exitement, sadness, longing, isolation, fear.  Sometimes it was as if I was feeling more than one emotion at a time.  I concluded that one's emotions are very unstable on LSD, and one must be very sound of mind so as to control this.\r\nThese were the highlights of my trip, which did not even occupy half of the total time I was under the influence.  My tripping friend and I left the house during the afternoon, and slept over at another friends house for the night in order to be completely baseline when we returned to our homes.  The trip was definately tapering off after we left in the afernoon, but we were still considerably altered.  I did not have any more visuals after this point, and my friend and I became very tired and lazy during the final portion of our experience.  Getting to sleep was very difficult for me; nearly totaling 3 hours before I could finally overcome the effects of the drug.  My entire trip was estimated at 15 hours, however the comedown occupies a lot of this time.  I do not think that the marijuana altered the trip very much, nor did it encourage the onset of the LSD.  It may have, however, lessened the effects of the undulating feeling within my stomach, which accompanied me throughout the experience, but was fairly insignificant for the most part.\r\nLSD is an incredible substance, in my opinion.  I never had one negative occurence, and recovered quite safely from the experience after a couple of good nights sleep.  I must say that I underestimated LSD earlier on into my trip.  I was unaware of how gradual the intensity was.  It is very mind altering, and I can see how easily it can be misused.  However, when used properly, and with very good friends that understand you and the drug you are taking, I believe LSD can be used as a tool; helping one to delve into the outer reaches of human consiousness.  I feel there is still much to be learned from psychoactives such as LSD; hopefully further study will unlock the mysteries associated with these substances, and mankind will take a different stand upon the usage of these gifts.\n\n\n"
}
