{
 "title": "I'd Like to Go Home Now",
 "author": "Vagus",
 "citation": "   Vagus. \"I'd Like to Go Home Now: experience with Salvia divinorum (ID 1558)\". Erowid.org. Jun 4, 2001. erowid.org/exp/1558",
 "substance": "Salvia divinorum",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1558",
   "Male",
   " ",
   "Not Given",
   "Jun 4, 2001",
   "7325",
   " "
  ]
 ],
 "report": "<p>\nLast night I smoked 1 bowl of homemade 5x salvia divinorum extract through a water pipe. The resultant experience was probably best described as humbling. Here's how it went down.</p><p>I am not an experienced salvia user by any means - I only first heard of the plant a few months ago. In that time I have read as much as I could about it, including perhaps 60 trip reports, begun growing my own plant and experimenting with sublinqual quids, and latterly, creating extra-strength</p><p>extracts for smoking.</p><p>Having used salvia sublingually, and only ever reaching a very tentative level 2 on the S A L V I A scale, the power of last night's experience took me completely off-guard. It shouldn't have in retrospect - I'd read plenty of trip reports stressing 'Use with care' etc etc, but I guess the mild effects that I have experienced orally, combined with the repeated emphasis people give on using salvia in dark, quiet conditions in order to bring out the full effects - or the effects at all - lulled me into a false sense of</p><p>security.</p><p>Not that I wasn't a little nervous prior to packing the bowl, mind, you. I had watched previously a friend smoke salvia and pull out of his trance after only a minute or so, visibly shaken. But I guess I figured in my arrogance that, going by previous psychedelic experiences, I was steady enough to ride through pretty much whatever salvia was going to throw at me. How wrong I was.</p><p>My first mistake, then, was to underestimate my extract's potency. I had used an acetone extraction that had seemed to me to be a rather botched effort, for it had appeared that plenty of the precious solute had been lost during the extraction through my rather slap-dash approach. To make matters worse, on drying the final mix in the oven, I became distracted with other things, and when I finally remembered my salvia - after 4 hours at 150 degrees C, it was rather black, crisp and pathetic in appearance.</p><p>My second mistake was ask my sitter to wait outside my room, rather than be inside with me. From my experience, sitters can in fact become the opposite - freaky anti-sitters - especially inexperienced ones like my sitter last night. So having prepared a snug little nest to lie down in, and ushering my sitter outside, I prepared for business. The Setting included nice warm lighting thrown off by a little orange-shaded lamp in the corner, combined with the soft, gentle sounds of Riley Lee's 'Oriental Sunrise'. All potential hazardous instruments and obstacles were removed, including candles, and a prominent note was posted on the door 'You have just smoked Salvia Divinorum' - together with the current time. Set was a relaxed, if a</p><p>little apprehensive mind. I meditated a short while before packing the bowl - waiting for an inner 'I am ready signal' and generally making my peace with God in case it all went horribly wrong.</p><p>Holding the lighter to the bowl and inhaling, it soon became clear that even the small cone I had packed was far too large. With lungs full of smoke, I watched with that dismay I'm sure many others have experienced, as the</p><p>bright orange globe of the resinous core burned on and on and on - with me helpless to stop the waste. But within scant seconds my attention was completely elsewhere. Holding that lung-full, I felt myself race up the S-A-L-V-I-A levels almost too quickly to individually distinguish. </p><p>Soon, after perhaps 30 seconds, I felt I had to exhale or I'd end up going so far I wouldn't even make it to the bed to lie down - which is saying something since the bed was a low-level futon about 3 feet away. At this point, my open-eye visuals began to take on an increasingly segmented appearance - as though the white walls were papered with a fine, repeating, paisley pattern.</p><p>Quickly putting down the pipe I spun onto the bed, faced the ceiling and started letting the smoke out.</p><p>At that point my memory of events vanishes - but for only a short while - about 30 seconds, maybe. I don't remember letting all the smoke go, for example, nor the subsequent breath. My memory returns with me, face up on the bed, and wide eyed at this incredible state that had come upon me.</p><p>Visually I saw zip - no elves, no tunnels, not bright lights - just the beams on my roof. But they were far away - inconsequential - the entire room in fact seemed alien and remote. And in this alien room I felt isolated from everything I knew and loved. All contact between my old reality and this new one seemed to be lost. It was as if I was the only human standing on a totally new continent, whilst the rest of the human race went about their business in lands so remote I feared I'd never see them again. This</p><p>incredible, alien sense of isolation awoke a powerful fear within me.</p><p>Meanwhile, some kind of force was literally ripping me further and further away from the comforting realm of consensus experience. The strength of this force was staggering. If I had a roof, it would have been peeled off -that's how it felt. Like I was being skinned - not physically, but mentally. And with this experience rose the fear of losing all I had known - of being unable to return to my loved ones - of forever being lost within an alien</p><p>mindset.</p><p>So, after perhaps 1 minute of this experience, I did what I well know you shouldn't do under these circumstances- that is, I fought to reground myself - to return to my home land, to return to a place of familiarity, of safety. I began a sort of hyperventilation, forcing large volumes in and out of my lungs, attempting to clear the salvia whilst my mind scrabbled for control. But still the force was too strong. I found myself speaking, staring open eyed at the ceiling and addressing whatever it was that I felt was in this strange land I so uncomfortably found myself. I  addressed entities I could not see but felt quite sure were there none the less. I told them I was just a little creature, living in a small world, who would like to go home now. Writing this, those kind of statements sound quite pathetic, but nonetheless, they were what I said. Within a short time, perhaps 4 minutes, the pull of the alien force against me had weakened to the extent that I felt I was 'back', and no longer in danger of losing my mind.</p><p>My first instinct was to throw myself into the arms of my sitter for love and re-grounding. If she had been in the room with me, perhaps she could have offered a few comforting words to settle me whilst I was still within</p><p>that ineffably weird place that was right here and now, and yet strangely not here, and not now. Maybe then I would not have tried to struggle free, maybe then I would not have felt that love-less alienation that sent me scrabbling so desperately back home.</p><p>Speaking with my sitter, perhaps 15 minutes after smoking, I noticed subtle open eye visuals, as waves of coloured light swept back and forth across the darkened room. This light also appeared to dance upon her skin, as a kind of intermittent auric field - or at least something to that effect. The analogy I presented her in describing the experience was this:</p><p>Here we are, these little creatures, snugly, and indeed smugly going about our business within our own little sardine-tin world. Thing is, we don't even realise we are all packed together inside this consensus reality. What</p><p>salvia had done was to unceremoniously rip the lid off the tin. And that was something I simply wasn't ready for.</p><p>Writing this, with the experience still fresh in my mind, I feel like a little bug; beetling around its little world, in complete ignorance of the larger sphere in which countless entities, large and small, ever so strangely roam.</p><p>    vagus, May 23, 2000</p>"
}
