{
 "title": "Finding Out Why They Call It 'Laughing Gas'",
 "author": "Kitten",
 "citation": "   Kitten. \"Finding Out Why They Call It 'Laughing Gas': experience with Nitrous Oxide (ID 15635)\". Erowid.org. Apr 23, 2003. erowid.org/exp/15635",
 "substance": "Nitrous Oxide",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2002",
   "15635",
   "Female",
   " ",
   "Not Given",
   "Apr 23, 2003",
   "Views: 7139",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few friends and I were sitting around trying to decide on something to do. That's when the subject of whippets came up. It sounded like fun, so we took a trip to the local porn shop and bought a case of 24 nitrous oxide 'bullets', and a pack of punching balloons. One of us owned a cracker, so we were all set. </p><p>We then all sat around in the bedroom, and began. Friend #1 took one first. I watched as she leaned back and began laughing quietly to herself, about nothing in particular. She then handed me a balloon with 2 bullets cracked into it. I had never done it before, so I was a little nervous- afraid I would make a fool of myself or something. But I proceeded to exhale all of my oxygen, and take a deep breath of the sweet cool gas, hyperventilating into the balloon. I started feeling very detached and heard a strange reverberating noise which for some reason made me think of an alien space ship or something. I continued to try and breath in more nitrous, but I was no longer able to keep my mouth on the balloon in order to exhale, and I began laughing hysterically. Suddenly, I got an intense feeling that I had lost something. An entire movie played in my mind at top speed, in what felt like a few seconds, and I started thinking 'I have to go find it'. What 'it' was I still have no idea. But I thought I was walking somewhere in my mind, and I could feel my body start to slowly sink to the bed. </p><p>When I realized I was laying down, I sat up and rubbed my curiously numb face, and noticed everyone looking at me. They asked if I was okay, and I said I was great, why? To which they replyed 'you just fell over'. We all were sent into peals of laughter, until the affects of the wonderful gas wore off. After that, we did whippets at least once a week, each time more exciting and interesting than before.</p>"
}
