{
 "title": "Need a Strong Stomach For This Stuff",
 "author": "Snuffy",
 "citation": "   Snuffy. \"Need a Strong Stomach For This Stuff: experience with Leonotis leonurus (Wild Dagga) (ID 15642)\". Erowid.org. Jun 27, 2002. erowid.org/exp/15642",
 "substance": "Leonotis leonurus (Wild Dagga)",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Leonotis leonurus",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15642",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2002",
   "Views: 76289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nHi, all! I thought I'd share my first experience of smoking Wild Dagga. \r\nThe package arrived in the mail this morning, and though I was exhausted from having worked the night before, the sound of the postman knocking at the door woke me, and I was unable to get back to sleep. 'Ok, let's see what this stuff is all about...' \r\nI'd read the reports on this substance on this site, and was sufficiently curiosified (wow, new word) into ordering it online. As I measured out 1 gram of the very fluffy mixture (-shredded leaf and flower material; Looks like something you might find in a pillow), I noted the rather icky, weedy smell, and wondered if it really might be as disgusting a smoke as others on here had said it was...\r\nI stuffed the puffy stuff into my little, grey marble pipe, shoved it in tight, and lit it, inhaling a rather tentative first hit...\r\nTo quote a previous poster: 'BLARGGH!'. This plant is, indeed, quite gross. I did begin to notice some mild effects, however, as I struggled through the 1st bowl, and after downing a couple of glasses of wine (to distract from the taste), I packed and smoked a second bowl with the remaining 1/2 gram. \r\nAllow me to clarify: I am definitely not a 'psychonaut'; My experiences have been limited to the rare joint of grass and the odd bit of hash (Ahhhhh!) in my teens. I never wanted to risk acid or anything else, due to a lifelong tendency towards  anxiety, which, even on hash, sometimes resulted in hallucinations. I could just imagine what heavier drugs would do to me..!\r\nIt is only in recent months that I've felt like gettng high once again. Enter 'psychotropic herbs', which I discovered when I actually read a 'junk' email message (which I normally never do). I then waded through tons of reports on Erowid's excellent site, discovered an online supplier, bought a pipe and scale, and some Wild Dagga (and Salvia for a different kind of trip), and voila: All set for an experience. \r\nToo bad I didn't have one. In smoking 2 bowls of Wild Dagga, all I noticed was profuse drooling/spitting (about 1/2 cup's worth - Yum!), a sloppily relaxed mouth (re: stupid grin), the occasional wave of slight giddiness, which would pass quickly, a 'floppy' upper body sensation, and mild dizziness. \r\nMenthol cigarettes came in handy for this forray; The minty smoke helped soothe the burning-throat sensation I'd quickly acquired. After the 2nd bowl of Dagga, I'd had enough, and was pretty nauseated at the idea of smoking any more of it then...\r\nWhile the stuff does have a smell/taste that is a bit reminiscent of grass, it's effects are much, MUCH less potent, if you're hoping to compare the two at all. However, I'm going to continue experimenting with it, since I still want to get high, and prefer to do it without risking charges... ;p \r\nI've heard I might be able to make a hash oil out of it - Definitely an idea; Anything that might taste and work better that this did!\n\n\n"
}
