{
 "title": "Lila",
 "author": "Anna",
 "citation": "   Anna. \"Lila: experience with Ayahuasca (B. caapi & Psychotria viridis) (ID 15727)\". Erowid.org. Jun 30, 2002. erowid.org/exp/15727",
 "substance": "Ayahuasca (B. caapi & Psychotria viridis)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "5 oz",
   "oral",
   "Ayahuasca",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15727",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 30, 2002",
   "Views: 26509",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAfter several years of reading about entheogens, I finally decided to experience one firsthand & attended a Peruvian shaman ceremony. I decided to fast beforehand, but once I arrived at the designated farm, people were eating lentil soup and so, rather hungry,  I joined!  After about an hour of discussion, we meditated and drank from paper cups.</p><p>I went there prepared to vomit and that never happened.</p><p>I went there expecting to 'see' snakes &/or cities in the flow of vomit and that never happened, either.</p><p>So slowly as to be nearly imperceptible, all the cells in my body lit up and after traveling through what I call the fractal tunnel, my consciousness expanded wide enough to encompass first the galaxy and then the multiverse. </p><p>An inner dialogue began and at every stage, I was asked repeatedly if I wanted to 'see' more, of course, mentally I answered: 'I'll follow you wherever you wish to take me'. I saw the birth and death of entire galaxies as though they were an endless dance of spiraling flowers. An immense consciousness permeated the center of everything & I was part of it. Rather like an individual filament of light encoded consciousness whose single strand continued and was all strands. I was dead and this was the samadhi I had read about. And the universe was inside and yet, I could feel the floor and hear the other people moving and having their own experiences. Everything was so painfully beautiful that I wept in love and then I perceived the words 'manifest me in love, daughter'. I swam in that all encompassing ocean of love until I could hardly contain it all and when I was sure I couldn't take it all in, I'd use what chi expanding techniques I know. There seemed to be no end to the depths of consciousness, only to my capacity to share and perceive.  </p><p>The end was as gradual as the beginning, that expanded intelligence retreated step by step and at each level, it reassured me that it was still present. The connection is always present, we are usually just too distracted to notice....</p><p>In total, I drank the decoction inside three small paper cups... somewhere around 150mm (?)</p><p>I am planning to fast and keep a 2-3 day fast before attending the next ceremony. This experience felt too sacred to approach in less than a traditionally respectful manner.</p>"
}
