{
 "title": "That's Another Story",
 "author": "Skully",
 "citation": "   Skully. \"That's Another Story: experience with 5-MeO-DMT (ID 1576)\". Erowid.org. Sep 8, 2000. erowid.org/exp/1576",
 "substance": "5-MeO-DMT",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1576",
   "Not Specified",
   " ",
   "Not Given",
   "Sep 8, 2000",
   "7426",
   " "
  ]
 ],
 "report": "<p>\nI am  a big supporter of hallucinogensbeen doing since I was about 13 when a buddy gave me six hits of acid and told me to put them on my tongue, but thats another story.  This is an account of 5-MeO-DMT, so I will stay focused.</p><p>After reading a lot about 5-MeO-DMT, and I got a hold of a good amount. I was at home with my dad, who happens to be the hippest dad in the world, and we debated who was going to be the first to smoke the strange chemical. We decided because of my intense interest I would be the first of my clan to venture into the other world. We measured out a good dose of about the size of a matchhead, put it on some good herb, and said a few prayers to the gods so that my journey would be safe, and I would find my way back home. </p><p>Standing in my kitchen, and inhaling deeply from the pipe I anticipated the effects with some nervousness [Erowid note: Standing while doing 5-MeO-DMT can be quite dangerous as many people lose the ability to stand almost immediately]. I had read a lot about it and I have to admit there was this thing in the back of my head saying you're crazy. My adventurer spirit won out though as I took a couple more deep inhalations. At this point I could feel the initial rush coming on so I walked over to the couch and sat down, again, taking another deep inhalation. This is when it all came on with the rushing of all the rivers in the world. </p><p>My bodily attention seemed to ascend from the bottoms of my feet, up my spine, and up into the top of my head. An incredible pressure built as I felt the top of my skull split in half, and shatter. Attention now was free to roam into the great Mystery. This took place as attention was paradoxically spread out into infinity, at the time it was being pressed into the smallest atomic structure imaginable. During this experience I had lost all sense of myself as a separate entity. The I had been utterly smashed into the infinite. My words have no meaning when describing such a feeling. It is beyond the spatio-temporal functions of mind and language. </p><p>At some point there came the sense of being inside a gigantic dome structure with an extremely bright purple light suspended high above the infinite field of attention. At this point there was a sense that this place of  was an immutable realm prior to our world of experience. There was a strong sense of familiarity as well, like there had been this experience before.</p><p>Soon I came back to this world. My hallucinations were incredible! I saw atomic events before my eyes. I had this thought that al atoms have a black hole inside them that somehow destroys and re-creates matter an incredible speed. The plant next to me got real big and strated talking in some plant language, and my microwave turned into a large robot and bounced away through the kitchen cabinets.</p><p>InicidentlyI think the atoms vibrating has something to do with thalamic pulses occurring at around 400Hz or somethingbut thats another story.</p>"
}
