{
 "title": "Quite Third-Eye Opening",
 "author": "Lysergia",
 "citation": "Citation:   Lysergia. \"Quite Third-Eye Opening: experience with 5-MeO-DiPT & Cannabis (ID 15783)\". Erowid.org. Dec 7, 2002. erowid.org/exp/15783",
 "substance": "5-MeO-DiPT & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 15783",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 7, 2002",
   "Views: 9412",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMy friends and I have all frequently experimented with 5-meo-dipt. While I don't believe that I would mess with this stuff if LSD was still available in my area, I do enjoy the visual effects it provides.\r\nThe first time I experimented with 5-meo-dipt, I took 12mg dissolved in ethanol. It was the most horrible thing I've ever tasted. (Now I usually evaporate the chemical and scrape it into a capsule) The visual effects were nice, but not as strong as I was used to from LSD. The whole trip lasted about 6 or 7 hours and left me quite restless and unable to sleep.\r\nLater on in my experiences with 5-meo-dipt I learned that marijuana increases the visual effects of the drug and makes the trip more mellow and enjoyable. The colors seem to be brighter when hydroponic herb is used. The funny part is I enjoy pot much more on 5-meo-dipt and I smoke a shitload more than I would ever do normally. It seems to boost the trip instead of make me stoned, which contrasts with my experiences with pot and acid. \r\nThe most 5-meo-dipt I've ever ingested was about 20mg, which after the rush of intensity, was quite third-eye opening. I didn't begin smoking hydro until after I started to come down.\r\nIn enjoy 5-meo-dipt as a fun chemical when used responsibly, but I fear that one day, after it hits the drug mainstream, uneducated morons will die after taking 300mgs and ruin everybodies fun.\n\n\n"
}