{
 "title": "Think Thrice Before Mixing Downers.....",
 "author": "Phoenix Moonrise",
 "citation": "   Phoenix Moonrise. \"Think Thrice Before Mixing Downers.....: experience with Alprazolam, Diazepam, Hydrocodone (with Acetaminophen), Paroxetine,  Metaxalone & Caffeine (ID 15810)\". Erowid.org. Jan 28, 2005. erowid.org/exp/15810",
 "substance": "Alprazolam, Diazepam, Hydrocodone (with Acetaminophen), Paroxetine,  Metaxalone & Caffeine",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE:",
   "4.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 5:00",
   "7.5 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 5:00",
   "40 ug",
   "oral",
   "Pharms - Paroxetine",
   "(pill / tablet)",
   "  T+ 9:00",
   "6.0 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   "  T+ 9:00",
   "400 mg",
   "oral",
   "Pharms - Metaxalone",
   "(pill / tablet)",
   "  T+ 9:00",
   "12.5 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 13:00",
   "  repeated",
   "oral",
   "Caffeine",
   "(liquid)",
   " ",
   "  ",
   " ",
   "Acetaminophen",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "15810",
   "Female",
   " ",
   "Not Given",
   "Jan 28, 2005",
   "Views: 71667",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a relatively inexperienced recreational drug user.  I have tried marijuana, alcohol, and then stopped because of drug testing in my workplace and lack of satisfaction with these experiences.  But when I began having genuine back and anxiety problems, I found myself with a hefty supply of pharms on hand and a doctor willing to prescribe often. I took Xanax with Vicodin and Skelaxin successfully before, feeling a happy calmness and the pains (physical and emotional) far away from me.  I've taken 80 mg of Valium alone, with similar effects.  I've never been sedation sensitive, so none of these drugs made me non-functioning.</p><p>This particular story begins at 10 a.m. when I took 4 mg of Xanax.  I enjoyed a functioning high day, and at 3 p.m. my teeth were hurting from braces.  I took a Vicodin that had 7.5 mg of hydrocodone and 750 mg of acetaminophen and my daily 40 mg Paxil (anti depressant)  dose.  I continued in a happy haze, still coherent but high and physically and emotionally better.  But at 7 p.m., my anxiety was high, my back was hurting, and I decided to do something very stupid...add Valium to the mix, even though I had NEVER taken Valium with any of these drugs. I took only 6 mg, a light dose for me.  Thank God.  I also took 400 mg Skelaxin (a muscle relaxant but not a HIGH getting one like Soma), and two more Vicodin...one with 5 mg of hydro and 500 mg of acetaminophen and the other with 7.5 mg of hydro and 750 mg of acetaminophen.</p><p>At first I felt a very strong haze, and became slowly detached from reality.  What happened after 9 p.m. and until noon the next day I do not remember, and must report from my roommates' experiences:</p><p>They returned around 11 p.m. concerned because I had not answered repeated phone calls (my phones were on)  They found me barely breathing, with a weeping pet by my side running in circles.  They contemplated calling 911 but got me to respond and awaken, though I was apparently slurring, glassy eyed, tripping over my own feet and almost comatose and definitely incoherent.  They poured caffeine into me and kept me awake until I was again halfway normal, and returned me to bed under close watch.  I did not have a hangover or other adverse effects the next day, just upset friends.</p><p>I know it was throwing Valium into this mix that caused the blackouts, and what is  warned is so true...Valium is a great drug, used ALONE and without any other downers.  The other drugs combined before did not cause any problems.  No alcohol or other substance was involved.</p><p>Please use these drugs responsibly, and don't repeat my mistake.  Xanax does wear off fast, but that does not mean it is out of your blood.  don't mix tranquillizers, don't mix Valium with Vicodin, be careful with Xanax and Vicodin, and just play safe.  Also, another error I made was doing this new experiment alone except with my pet.  I could've died.</p><p>I will not stop using these drugs as prescribed (and occasionally as not) but I will never do this combo again.  The haze was good enough with Valium or Vicodin.</p>"
}
