{
 "title": "Joy, Love, and Seeing God",
 "author": "Sugar_Daddy_O",
 "citation": "   Sugar_Daddy_O. \"Joy, Love, and Seeing God: experience with Mushrooms (ID 1582)\". Erowid.org. Jun 26, 2001. erowid.org/exp/1582",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "0.2 oz",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 1582",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2001",
   "Views: 9630",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI visited Puerto Rico for 10 days with my girlfriend, and took along a bag of shrooms hidden in my underwear.  The precaution was somewhat uncomfortable, as well as thoroughly unecessary.</p><p>Anyway, after several days of meeting my girlfriend's extended family and blissing out on Puerto Rico's astounding natural beauty, we decided to take our stuff and visit a rainforest.  We ate the shrooms straight (chasing each bite with onion rings from Burger King - it was a GREAT combination), and began feeling the effects about half an hour after dosing.</p><p>By this point it was nearly inconceivable to navigate further with the use of a map, so we bailed on our plans to find El Yunque (the rainforest), and instead ended up driving about fifteen miles past it, by this fabulous public beach in the town of Fajardo.</p><p>It had been raining earlier in the day (and would later rain again), so the beach was pleasantly deserted.  We were, in fact, the only two people to be seen.  WHen we first arrived, I sat on the hood of the car while my girlfriend went to use the bathroom, and watched several layers of clouds move discernibly across the sky.  There was plenty of stuff to look at in the sky (i.e., clouds, drifting paisleys, etc.), all of which was fascinating.</p><p>Here comes the transcendental part....  So we walked into the water and splashed around a bit, and then came out and sat down under a palm tree.  I lay my head in my girlfriend's lap and stared up into the sky while she buried me in the sand.  We talked about our relationship (4 years), how happy we each are to have the other in our respectives lives, our mutual happiness at our recent career attainments, yadda da yadda da yadda....  I felt an intense sensation of belonging and joy.</p><p>After my girlfriend returned to the water, I rolled over, face down in the sand, and lay my head on my arm for perhaps 15 minutes.  I prayed, thanking God/the Force/whatever for Her unfathomable blessings, and actually ended up crying my eyes out in sheer gratitude.  Words cannot describe the depth of my thankfulness, nor the effect it had on my emotional state.</p><p>We ended up playing in the water for literally four hours afterward.  It rained again, and we had the immeasurable joy of experiencing it with no noise or distraction to detract from it.  Rain on the sea, believe it or not, sounds like a chorus of tiny bells.  Even stranger, the rainwater stays distinct upon hitting the sea; the drops coalesce into little beads and all run straight out away from the beach...as if they knew where to go before landing.  And the surface of the water when the drops hit was itself fascinating.  Not only where there countless ripples, but the entire surface of the water shimmered in the afternoon sun - which colored the sky a breathtaking series of reds and oranges to the west, gradiating into a placid violet to the east.</p><p>Topping off the whole experience was the fascination of exploring the various plants beneath the water.  The beach extended for perhaps a quarter mile, and there were several distinct areas in which different kinds of plants were growing, not unlike underwater forests.  The afternoon cultivated a strong wish on my part to take up SCUBA diving.  If it's beautiful and calm on the surface, I cannot fathom how wonderful it must be underneath.</p>"
}
