{
 "title": "Staggering Blindly Through the Chaos",
 "author": "Lsded",
 "citation": "   Lsded. \"Staggering Blindly Through the Chaos: experience with Cannabis (ID 15843)\". Erowid.org. May 6, 2006. erowid.org/exp/15843",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "  ",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:30",
   "  ",
   "inhaled",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "15843",
   "Male",
   " ",
   "Not Given",
   "May 6, 2006",
   "3846",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It somewhat started a day before the fourth of July. Raz and I had the idea to hook our computers up over at his house because his parents would be gone. Then we could play Warcraft 3 for all hours of the day. Then, the fourth of July rolled around, and I went to bed around four-thirty. The next morning I awoke around one to the sound of the vacuum. At first I became disoriented, thinking that it was Thursday, we no longer had cleaning ladies, and my mom should have been at work. I let it pass and went back to sleep.</p><p>Then, I finally rose from bed at roughly three p.m. and walked outside my room. Chaos abounded. My mom was cleaning the house for some unknown reason before it clicked that it was the fourth of July. She sees me...first thing I get instead of a 'good morning' or whichever greeting applies was, 'Weren't you supposed to do this?' I tell her I was going to clean the house tomorrow (Friday), and ask who ask coming over. She replied to me with, 'Charlie and Cynthia....your dad invited them...' I asked her why I hadn't been told this and she gave me this trip somewhere around the lines of, 'You knew damn well they were coming over...' and I laid things out for her. Simply, I did not know. I asked her several times before what her plans were, hoping they would leave the house. Everytime I got the answer, 'I don't know, nothing yet.' Apparently, she recalled differently. I gave her the usual rounaround: 'Whatever...I didn't know anything about it and I planned on cleaning tomorrow.' Then, very pissed  as I was, I went back to my room.</p><p>I got online and IMed Raz with a message that went something to the effect of, 'Let's get this bitch started.' He then told me to get my computer rounded up because he'd be there shortly. I quickly got off, unhooked it all, tossed it into my bag, and prepared to wash my face and bursh my teeth. I had not time for a shower, so I merely tossed on my hat and wore exactly what I had on the day prior. As I was getting ready I noticed all sorts of items lying around that pissed me off to all extents. Crazy fold over calendars containing biblical references and passages. Pictures that had been thrown in am obscure drawer for ages, toiletries in the bathroom that I did not know we posessed. </p><p>I then had it in my mind, that I would never become this. Scurrying around, cleaning things, throwing up items that would hopefully give others a false impression of myself (be it one I hoped to obtain). This simply would never be me. I then had it set in my mind that if my dad told me to either clean up my room or possibly take the Grateful Dead sign from my door, I would begin a speech that would rival that of the Gettysburg Address. A monolouge so compelling it could be contained in a coming-of-age movie staring Colin Hanks or Josh Hartnett. I had it all planned out in my head, the entire scenario, it was so rivveting I actually began to hope he would request these things of me simply so I could give this performance. My mind was reeling: 'Dad...I'm not going to do such things. I'm not going to run around the house picking up every magazine and shoe so it appears that we live a way we do not. I'm not cleaning my room or taking the sign off my door. That's who I am. Most of your other friends know who I am...to varying degrees. I'm not going to hide myself in a lie that will hopefully please your co-worker and his wife. If they don't like that my room is dirty, tell them to close the door. </p><p>Also, if I find out that you took the sign off my door, and I will be able to find out if you did...I will lose a great amount of respect for you that I doubt will ever be regained.' It was incredible. But sadly, it did not happen.</p><p>All I got was, 'Do you want steak or hamburger?' My reply to him was the news of the LAN with Razgard. He then told me to be careful if we got fireworks. I said we wouldn't get them...and then the doorbell rang. I opened it to find Razgard's smiling face ready to kick off and play some games. We loaded up and left for his house. We got there, set it all up, got a game ready to go, and then decided it was time to smoke some fat bowls. We grabbed the supplies and headed out to the backyard. Mind you it is no somewhere around 4:45 and 5:00 and I had not showered or eaten since the day previous. </p><p>We smoked two...maybe three large bowls of hydro, and we were toast. This is the kind of high many people experience let alone with someone else. We began to walk back to his room for a rousing game of 'stoned WarCraft 3'. As we go inside I feel the cold air blast me with a nova strictly aiming for the heat arising from my body. My body is sent into a minimal form of shot. The El Nino of temperature combined with the lack of food sent a straight overkill to my brain. Instead of my stomach screaming and crying for sustance my eyes go out. It works just as that. A small pixel of black suddenly swells and amasses an army of grey and black squares that engullf my vision, very similar to a fire diffusing through an entire forest. Now, instead of seeing the home and furniture that was before me, I saw a swirling and caccophany of light greys, dark greys and blacks impairing any vision I may have once had. I was not scared though. It was somewhat entertaining and it had happened once before, so I knew the procedure. I was hot..then cold...and hungry beyond any feeling I have had before.</p><p>I debate myself for lingering seconds that tick away like hours. Then I decide. 'Dude...I'm fucking blind.' I comically exclaim. Raz is somewhat worried. I can sense it. They say that when people are blind their other senses become heightened. I can attest to this. I then tell him that it would quickly pass, because it was beginning to. </p><p>The darkness was not as searing and it was leaving in the same form it arrived: A raging torrent collapsing upon itself. I then sat down and we began to play some WarCraft 3, stoned out our skulls. Then, as I slightly lean forward to find the nearest gold deposit, the hatred returns. My vision dies once more and I slightly turn to where Raz was at and I say, 'Dude...I need something to eat.' So, I feel my way around, looking out of what little splotches of vision that still remain and make myself to the kitchen. He points out to what they have, and I reach for the Simpson's Pop Tarts. Little did I know, I had actually grabbed a packet of popcorn. He laughs at me, as do I as I slightly read the words 'Pop-sec --' on the package. He then exclaims, 'Fuck man! Are you going to be alright?' out of pure worry after discovering the true magnatude of my condition. </p><p>I relay the story of last summer with my brother when the hunger and heat teamed up to deliver a finishing blow to my sight. I also make sure to point out the comedy of the situation, because my brother's friend's father was there and told his so to, 'Stay away from that stuff,' that he, 'better not be doing that stuff.' We both laugh at this as we go to sit down in the living room. My vision is still greatly fucked for lack of a better word. We watched a little TV but I still noticed I was hungry. I was at approximately this moment that Razgard brings up, 'Hey...do you still want that Pop-Tart?' I, having totally forgetting about it in the thirty seconds since we last saw it exclaimed, 'Fuck yea! I forgot.' We both laughed at this for what lingered on to be five, maybe ten minutes. Then, we went to get the Pop-Tart. I asked him if I could have it toasted, as a warm, gooey Simpson Pop-Tart tasted much better to my mental senses than a cold, not cooked Pop-Tart. We put it in, and he heads back to the living room. I, awaiting for my proverbial 'knight in shining armor' lean against the counter staring down the heated death coils of the toaster, fearing for my snack's life. </p><p>I contemplate whether or not I should save it from the metal and spring coils of death and simply eat it as it was. I then realized that it actually enjoyed being in there. The toaster was what a sauna is to us. I then smiled for him, and let a small tuft of noise pass through my lips as I nearly began to talk to it, before noticing Raz standing by the kitchen entryway, laughing at my giddyness for a Pop-Tart. Had he only known the connection we had. I was staring at him, totally oblivious to the Pop-Tart that once engrossed my every braincell, before *CHINK* the toaster exploded the toasty Pop-Tart back to it's original position, as I too exploded in a fit of fear, anger, and chaos as I did not expect the noise. My partner began to laugh at my antics, as I said, 'Fuck man...I'm going to enjoy this fucker.' I then stepped out into the garage of his home to claim a drink for myself. A Diet Lemon Coke. My meal was complete, and my blindness still intact mainly in the center of my vision. </p><p>I could see the outer edges of my periphriel vision, and I used it to my full advantage. I then made the journey back to the living room to fulfill my stomach's every fantasy.</p><p>We turned on the TV as I ate what was the most delicios Pop-Tart in my life, complimented perfectly with diet coke, hinting slightly of Lemon. Now, being the stoners we were, we both knew very well of the odd coincedences that happen when we're stoned and watching TV. The most fucked up programming is available to us. Things that would never claim the television cables had you not been stoned. So, flipping through the channels we notice several of them, somewhat distant from each other were showing very similiar images, the kind that accompany 'breaking news' or 'top stories'. </p><p>After we both noticed this and decided it was possibly something of importance, we searched frantically for one of the several stations carrying the images. After we had finally arrived on the scene of the news program, we slowly learned of the shooting at LAX airport. The caption read, 'Three dead in shooting incident.' Not sure what to make of it we watched, and then, as wrong as it may have been, laughed until we were very short on breath. The comment taking blame for these fits of laughter? 'We believe it was nearly a personal problem, nothing more than that, although we have contained all those that were in the airport.' I am still not sure why this was so humorous as it was, but I believe it was due to the conversation we had about Grand Theft Auto III days before. </p><p>An incident very similiar to the one that occured in real life, happened to my friend in the game. He was running around the third island (the only island with an airport) when he found a few people walking around. He nonchalantly pulled out his shotgun, shot them both dead, and then ran for a random truck. After this had taken place I began to talk about how things of this nature would never happen in real life. One man would not randomly go somewhere, shoot two people, attract all manners of the cops, secret service, SWAT team, and any other law enforcement agency. As I was saying this, he ran into a woman who, before being shot, screamed, 'Do you have a diet soda?!' So, naturally, as everything I had mention the night before was present in this news story, I took it upon myself to yell through the house, 'Do you have a diet soda!?!' in my best woman voice. Again, we both died of laughing fits.</p><p>Deciding that this news story was not the best thing to watch, we set out in hopes of finding something far more entertaining. Not until I stumbled upon FOX that we saw what would become the most fucked up episode of Fresh Prince ever. We were in the middle of the episode, having missed the first half, but provided we were deeply invovled in the dialouge, we slightly caught on the what was happening. Apparently Will and Carlton mad a bet where Carlton goes into the hood for a while and tries to survive. To cut a very long, drawn out, insane episode short, Will goes to get Carlton out of the hood fearing for his safety. When he (Will) arrives there, Carlton is dressed up in all sorts of 'fly' gear, with a bandana over his shaved head, and some gold on. He then spouts out some of the usual gang/hip hop terminology, containing, but not limited to 'homey' 'Sup?' 'fronting' and many others I fail to forget now. This had set us both into a primitive state of shock, confusion, and humor all at once. Not sure to laugh or say 'What the fuck?' we simply did both.</p><p>Next we opted to see else became of the shooting at LAX and I continually mashed buttons on the remote, hoping to press the correct combination that would give us a news channel. I finally opted for merely typing in '4-1', '4-2', '4-3', etc... I then began to debate with myself why I did this instead of pressing the 'channel up' button. Still unsure of my actions, I continued to climb the channels in this manner. We were unable to find the correct station, although we did find some Junkyard Wars. Thankfully, we were slightly descending from out mental mindfuck of a stoning, and we were able to watch and concentrate on the show. Between laughing and watching we made many references to what a team of stoners would do had they been involved.</p><p>Provided you're unaware of the premise to the show, they take two teams of three, give them a certain challenge, then give them an expert in the field. Of course, the tiwst is that everything they use to build must come from the junkyard the provide. The challenges range from boats, to hovercrafts, to wind-powered cars, to tools of destruction. Luckily for us, the episode we were watching was the finals of the season, so they had to destroy a hundred foot concrete wall. </p><p>Anyway, back to our jokes. Many times we told tales of how the stoner team would just weld a bong to their contraption, or simply make a scrap-heap pipe instead of what they were supposed to make. Then, Raz pointed out that on their white board for ideas and model designs, they would just have pot leaves and 4:20 scrawled all over the place. I then added that one of them would say something along the lines of, 'Dude...do you think they have anything I can eat around here?' and another one would say, 'Wait...weren't we supposed to be doing something?' Naturally, we decided it would be the best rated episode ever. Finally, the show was over, and we headed back to the room for WarCraft III. We began to play several games, each getting our asses handed to us by the insanely difficult computer opponents. We laughed and cursed and mainly blamed it on the drugs. Suddenly, things took a turn for the odd. A knock on the door could be heard, then the opening of said door. We knew very well who it was, but we weren't ready for what they had in store. We were playing and who comes through the door? </p><p>It was damn BMF (Bad Mother Fucker) and a damned Ox. Naturally, both of their nicknames were changed to protect identities and/or possible misconceptions about their nature. One of the first things to come forth from BMFs mouth: 'Hey...you guys want some tabs?' Jesus Fuck! Why must they have dealt us these cards? Of course we wanted tabs damn it. We'd do tabs any time of the day. So, we had a short conversation, gathered up money, told the orders, and then waited. At this point that the two friends that just joined us were on Crystal Meth. So...we weren't too sure what to expect. I was debating whether or not to do the tabs that night, but after I found out that others would be and it wouldn't be me alone, I went for it. Just then, two other friends showed up, these two of the opposite sex. Sicily and Fuck-Up walked in for reasons I'm still not sure of. </p><p>I don't think anyone knew why they came over or how they knew we were there, but nobody cared either. So, we all sat around talking before Ox claimed he wanted to take another 'bump'. We then all went to the kitchen, because to put it frankly, you don't see someone rail some Meth everyday. Everyone took their turn, sans Raz and I, he too afraid he would like it more than he should, and I...well I don't know why. Ox then told me that I could have some if I wanted, but that would be the only time he would ask. He also filled me in that no matter what he had, if I wanted some I could ask and provided he had enough, he's share. </p><p>Ox is a really nice fucking guy. Raz and I went back to finish up our WarCraft III game, got our asses kicked, then went back to the living room. We all sat around talking some, then a few went outside to smoke while BMF and Sicily left to go get our rolls.</p><p>Previous message was not received because of error (8:24:14 PM): Your message was refused by the AOL Instant Messenger server, probably because the message was too big. Try making the message shorter and send it again.</p><p>Raz and I yet again play some WarCraft III before deciding we should just hold it off for now and get some music ready. We begin to set out our musical collection for the roll. We also picked up the room some so we wouldn't break shit. Then we headed out to the living room to watch TV and chat with those still around. Finally, BMF and Sicily finally came back with the goods. Just like one of the three wisemen, BMF sat down, opened his little baggy, and showed us the sixteen rolls he had gotten a hold of, as well as the relatively larger amount of hydro. Splitting them up into baggys and passing them out, BMF then told us that he was going to someone elses house to hang out for a bit, as was everyone else. Minutes later, Raz and I were the only ones around again, but we still had a friend on the way. About half an hour later, maybe a full hour, Grunge showed up with his girlfriend. His prime motive for the visit was to play some WarCraft III, so I got it set up for him and watched him play. Then, quickly and quietly one o'clock stopped by, and we got a phone call. The others had dropped their pills. It was now our turn. Taking a cue from Fear and Loathing in Las Vegas I turned to Raz and said, 'As your attorney I advise you to follow me into the bathroom.' It was not one-oh-five, and we were going to digest our disco biscuits.</p><p>We did the deed and went back to the room to watch our friend play our game, when shortly, another person showed up. Track (I just gave her the name...she runs track, no allusion to heroin, something none of us did) stopped by to hang out with us for a little while because nothing else was going on. Soon enough BMF came back while the others stayed where they were for a while. Around this time Grunge left because his girlfriend was tired and he thought her better off sleeping at home than around a collection of people she didn't know. </p><p>So, now it was just Raz, Track, BMF, and myself. Again, another twist comes up. Having a few extra X's left, BMF attempts to coerce Track into rolling with us. Her only real reason for not wanting to was having to work the next day at four and being tired, but BMF still tried. I even threw in a little taste of my own, simply because I like peer pressure. I know, it's twisted. But I laid off, because I only wanted to make one little comment. Soon enough I found myself back with the computers playing some excellent toys I had downloaded. Then, I began to get restless. We had our supple of straws and water, which I carried around with me most of the time because I like water. Of course, I made the mistake of setting them down several times and losing them for extended periods of time. I would walk around the house with a stride of determination, spouting off lines like, 'Where the fuck is my goddamned water!' or Jesus Fucking Heral Christ....I just want my cursed water!' Track told me to get another glass and it would be alright, but I prefer to have what I started out with. </p><p>If i just gave up on the first one I had, what would stop me from losing a second? A third? Hell, soon enough I'd have lost all the glasses. Aside from that there was this pestering tingle in the back of my mind just wondering where this amazing hiding spot was. Soon enough I found it by the TV from when BMF and I tried to get some music going in the DVD player. Having wanted to go outside for what seemed like hours, I finally said fuck it to everything, took a leak, and went outside to smoke with BMF, notebook in my hand. I had it in my mind that I would roll and draw and/or write. I had a great cigarette and talk with BMF about just how cool I thought he was, his reciprocated comment, art, clothing, people, all the usual. Then I started to talk and draw, and he told me that he wanted to go inside for a while. I told him that I'd stay out there for some time, and that he could join me again if he wished. </p><p>As he walked off I asked him for another cigarette incase I wanted one, and out of generosity he gave me the rest of the pack. Granted it was only three, that's still real fucking nice. He also ensured me that if I ever wanted any more that I could ask him and have as many as I liked. I'm no a big smoker, but that's just damn nice of him. So, there I was, on a trampoline, out of my mind, with a notepad and minimal light.</p><p>Previous message was not received because of error (8:45:51 PM): Your message was refused by the AOL Instant Messenger server, probably because the message was too big. Try making the message shorter and send it again.</p><p>We did the deed and went back to the room to watch our friend play our game, when shortly, another person showed up. Track (I just gave her the name...she runs track, no allusion to heroin, something none of us did) stopped by to hang out with us for a little while because nothing else was going on. Soon enough BMF came back while the others stayed where they were for a while. Around this time Grunge left because his girlfriend was tired and he thought her better off sleeping at home than around a collection of people she didn't know. So, now it was just Raz, Track, BMF, and myself. Again, another twist comes up. Having a few extra X's left, BMF attempts to coerce Track into rolling with us. </p><p>Her only real reason for not wanting to was having to work the next day at four and being tired, but BMF still tried. I even threw in a little taste of my own, simply because I like peer pressure. I know, it's twisted. But I laid off, because I only wanted to make one little comment. Soon enough I found myself back with the computers playing some excellent toys I had downloaded. Then, I began to get restless. We had our supple of straws and water, which I carried around with me most of the time because I like water. Of course, I made the mistake of setting them down several times and losing them for extended periods of time.</p><p>I first began to draw what I had imagened the other day. It's something I want to possibly paint out of whatever provided I get back into art (I had told BMF the entire story about how I felt out of interest with art and hoped to maybe get back into it all). Realizing that low light and trying to draw while speeding didn't work, I settled for my true enjoyment. Writing. Now, I'm not too sure how the rest of the writing went out. This was all done in the dark, on a trampoline, speeding, with possible effects of the X taking hold. I present you now with the writing: \r'Jesus...did I fuck up? No inhibitions left. My affidavit of responsibility chewed up and digested in pill form. What have I done to myself? Is this me? Or did I forge an alternate being in my thoughtless actions? Will I ever get the chance to figure it out? So many goddam questions....Do answers exist? If I did lay my ignorance to waste, would they be true? Is it possible that the knowledge I learn is only crafted by a cunning orator greater than myself? Impossible. There is no being greater than a mind. If truths are revealed it's simply due to my own intelligence. Fuck! My perception has been torn from its sanctuary. In its place a beast so powerful....I am unable to tame the godforsaken spawn of synthetic evil. Goddam...creatures lurk in every crevice my mind is aware of. Fucking bats and wolves --' \r</p><p>This is as far as I got before my mind went blank. When I write I prefer it to flow and entangle rather than forcing myself to get something to work. At this time, I headed back inside.</p><p>Once returning inside I found Tracks sleeping on the couch (sleep is something she did often), and the others back in BMF's car with the heater on and Things Fall Apart by NIN pounding the speakers. I joined in, trying not to disturb them too much, spill my water, or drop the cigarette from behing my ear, but the latter wasn't working for me. I pulled out a lighter in hopes of finding it again, but wasn't able. Not until I got out did I find it and place it behind my ear again. I went back inside, then to the trampoline to jump. Somewhere around this time I went back to the computers to search for something to do, although I was inevitably unable to find it. I then went and laid on the floor as I always do when the others came back in. We conversed wondering if anyone was feeling anything, but nothing came about it. We tried everything in our desperate measures to kick in the roll but couldn't find anything sufficient enough. </p><p>Somewhere around this time we decided to join the others at Monster's place, sadly, they too were unable to roll. Track left for her apartment, I imagine it was to sleep in her own bed, and we gathered up our things and went to Monster's. The drive there seemed like it took hours while in reality it was merely ten, maybe fifteen minutes. I nearly smoked the cigarette I had behind my ear before losing it on the floor again. NWA was rapping throughout the car as I blindly searched for the lost cigarette, again my obsesive-compulsive similarities kicked in. Finally we made it to Monster's to find Ox and Sicily in his truck blasting the heater. I on the other hand went to the house door, tapped it a few times, then walked in. </p><p>I looked around at Monster and Fuck-Up, the only two inside now, and exclaimed my well rehearsed line in the car, 'So...this is where the mighty [name here] resides.' He laughed a bit, then concurred with my statement before I set in for my next line of dialouge (also well rehearsed), 'So...I know I just got here, and not wanting to come off like a dick or anything, could I use your bathroom?' Once more he ind of laughed and directed me to the second door on the left stating, 'It's a trailer, not too hard to figure out.' I then, once again, went to the bathroom, pissed off because I was still going to the bathroom. </p><p>If only I was rolling, my ability to drink massive quantities of water and not urinate would have been intact. I then stepped outside and sat next to Spin (For lack of anything better to call him, merely the first part of where he works) and started talking to him. He took was on one of the pills we took, but like the rest, wasn't feeling anything. I smoked a few bowls with him and talked a bit before going back inside. After Sicily went back outside I claimed a spot on the couch next to Fuck-Up and began talking. Fuck-Up was waiting to roll the next day with some others in a big city, but after she saw how everyone else faired, she was thinking about not doing it. Monster on the other hand....he was pretty fucked up from the shrooms he ate. We sat around watching VH1-Classic while all manners of friends came and went outside. We had a small conversation about what we dubbed the 'bunk ass pills.' We had two tips and six people attempting to roll. </p><p>We all started off with tryign the same one because it was rated the better roll. By this time though, pretty much everyone had one of the first, and then had just taken one of the others. Raz and I split ours up. A few of us decided to go back to Raz's place, because Monster needed some sleep and we just wanted to roll. I rode over there with Ox, smoking a cigarette on the way, while listening to the godlike Mr. Bungle. I suppose the half hit me a little as I felt good and the music was excellent. Then, just as the first, the minor feeling was gone. Ox told me he felt the exact same way. We finally went inside and were bitching about the bunk ass pills. By this time it was about 4:15, maybe 4:30, and none of us could sleep. In the house was Sicily and Spin, Ox, BMF, Raz, and Me...the six that took the rolls. </p><p>Ox was real fucking bored so we decided to watch some of NIN And All That Could Have Been. I got up a few times to go back to the computers, humoring myself with google searching such as 'kicking in a roll' 'making myself roll' 'bunk ass pills' 'I took some bunk ass pills and I'm not feeling shit right now'. I found one crazy writing from someone, highlighted a passage about dancing pink elephants, and left it there for someone to see. I then went back out to the living room, where apparently everyone was talking a turn running off the shower.</p><p>By now, we all knew we weren't going to roll at all, and started to watch movies. It was something like 5:30 all of a sudden, the sun was up, and we were all pissed about the bunk pills. BMF ensured us that things would be taken care of and we would either get the money back for the pills or we'd get new ones to replace those. This made us all happy. We then began to watch Hackers, and about halfway through, I went to go join BMF on the trampoline to just lie there. We talked about how it was really pretty outside and smoked a few bowls to further enjoy it. I then went back inside, caught the end of the movie, and sat there while Ox selected Eyes Wide Shut for out next DVD. By now Raz was in a back room, BMF was still outside, and Spin was sleeping for work. Ox, Sicily, and myself were going to watch the movie. </p><p>I had seen bits and pieces of it on TV and thought it was fucked up, but I was never ready for the shit they put in front of me. It got very fucked up, then Ox (He had seen it several times before) went to smoke a cigarette while Sicily sadly exclaimed, 'Dammit...right when it gets really fucked up I have to wake up Spin for work!' So, now I was alone, trying to comprehend the shit that was flcikering before my eyes. It ended, and I dug it, although it was so insane. Now, BMF was inside, Sicily and Spin had left, and Raz was sleeping in a room. Ox and I were the only ones left up, me by a miracle, and him by a bump of Meth not too long ago. He surprised me by putting in an unknown cassette that turned out to be old school Tom Green Show when it was still in Canada. Boy did that blow my mind. </p><p>Tom Green is a fucking moron, but he's funny about it. Somewhere into the video BMF sauntered out to watch with us. It ended, and another one was put in. A second hour of madness. After all of that the time was something like eight o'clock in the damn morning.</p><p>When the videos finished, BMF went back out to the trampoline and Ox but in an Xbox game and played. I watched him for a little bit, then went out to the trampoline. I laid there for a while, having some very weird closed-eye visuals that I can only claim to be from the lack of sleep. I mean, the rolls would have worn off somewhere around four or five, but it was eight in the morning. So, I just layed there for a while, then got kind of hungry and went to make some more Pop-Tarts. I made my poptarts and ate them while Ox did something on the TV that I don't recall. It was either still the game or just some show, I wasn't paying attention. </p><p>After I finished my poptarts and helepd BMF look for his phone some...not some...we looked for the better part of half an hour, maybe forty-five minutes. I finally found it when I went to go get my notebook out of his car, noticing his phone crammed into his boots in the back. I gave it to him, he checked his calls or whatever, and then we went back out to the trampoline. We laid there for some long length of time, and the next thing I noticed was BMF going inside. I then realized I must have fallen asleep, but for how long? A minute, an hour? Six? I went inside to talk to BMF about it and he said that he had just gotten up to go inside and told me, but figured I was alseep. I image my slumber as somewhere near ten minutes. Then I laid down on the couch to watch some more game playing by Ox and BMF. </p><p>I watched about the second round before dozing off and coming to at what I imagine to be the third round or so. I look at the clock in the kitchen and it's 1:00 p.m. I then fall asleep again, this time when I wake up it's 1:30 and I notice Monster sitting there in front of me. I shout out, 'Jesus Fuck! I fall asleep and wake up with fucking Monster in front of me...that's insane.' I then fall asleep for a little longer, waking up when they're leaving to get some food at a place where they can sit in a booth and smoke. </p><p>I tell them I'm going to stay there, as it's 2:30 already, and they leave. I then look at TV and see the paused game showing they played a total of twenty matches...I was asleep for a long fucking time. I almost started to doze off when Raz walked in, kind of asleep. I relayed the message about them going off, and how it was now 4:30 and we both slept a bit. He had to go meet up with Grunge later to go talk to some guy, and I needed to get home anyway. By the time we finally got around to it and got everything packed up it was 5:30. We then headed back to my house where he dropped me off with all of my stuff and headed out to see Grunge. </p><p>I hauled everything inside, found a note saying my parents were gone out to eat, then I noticed my hand was all inked up. I searched my pocket and found out a pen had busted. I now had ink on everything in my pocket, including my hand. I don't know what it could mean, but I thin I'm owed some fucking Karma for this fourth of July.</p><p>Previous message was not received by because of error (9:29:38 PM): Your message was refused by the AOL Instant Messenger server, probably because the message was too big. Try making the message shorter and send it again.</p>"
}
