{
 "title": "Velcro Ears",
 "author": "LuUdis",
 "citation": "   LuUdis. \"Velcro Ears: experience with Cocaine & Heroine (ID 15863)\". Erowid.org. Jul 10, 2002. erowid.org/exp/15863",
 "substance": "Cocaine & Heroine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Heroin",
   " ",
   "  ",
   "IV",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15863",
   "Male",
   " ",
   "Not Given",
   "Jul 10, 2002",
   "Views: 46419",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMe and my friends threw in some cash, and wound up with a few bundles of heroin and an 8-ball of coke. This coke, by the way, was the purest I had ever tried, it was practically a solid ping pong ball.</p><p>I do a quick rail before the ride home to keep myself interested, which by the way my face went completely numb, worked well. An hour later, when the coke finally gave me its last remnants, we got to my friend's house. I had done heroin once before, so I had a basic idea of what to expect. How amazingly wrong was I.</p><p>He cooked it up while I had a quick cigarette, I tied myself and braced for the ride. </p><p>I was nervous for a second while looking for the vein, but once I saw the syringe turn red, I knew it was good. The plunger was plunged, and it began.</p><p>The h hit first, a warm, fuzzy, calm rushed through my body, and i was completely relaxed. Then the coke hit. Every sound that I heard was melded with a high pitched buzzing sound, that I cant describe quite well, but reminded me of when the neo has the mirror melt onto him in the matrix. Then my stomach said no, and I ran to the toilet, thinking I was about to puke. It subsided seconds later, and was able to enjoy myself once again. </p><p>After about 10 minutes or so, the buzzing left, and I was in a completely mobile, yet euphoric state. This lasted for about an hour, while I had some cigarettes and had some great conversations. Then the battle began.</p><p>First the h kicked in like it was a new shot, almost like a full body orgasm. Then the coke came back and it subsided. Then again. This kept happening for about 30 minutes. Then the coke completely disappeared, and a strong wave of h hit, causing me to break out in a cold sweat, but that ended quickly.</p><p>I went back home, laid down, and went to bed.</p><p>Will I ever do it again? Maybe. It was possibly one of the most beautiful feelings I've felt in my life, which honestly scares the shit out of me though. The way I see it, is that if you have the opportunity, but will have a very hard time finding, do it. But if its something in constant supply, I now know that it could ruin your life.</p>"
}
