{
 "title": "1 Blotter, 2 Nutters and a Telephone Call",
 "author": "Anonymous",
 "citation": " Anonymous. \"1 Blotter, 2 Nutters and a Telephone Call: experience with LSD (ID 1590)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1590",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "",
   "1590",
   "Male",
   "",
   "Not Given",
   "Jun 20, 2000",
   "4267",
   " "
  ]
 ],
 "report": "<p>I have had acid a number of times before, and since, this night but this was probably the most intense experience. I was between 16 and 18 years of age and already experienced in taking acid. </p><p>A few friends and myself had procured some acid from a friend of a friend. They were delivered to us by the friend with the notion that they were 'double dip' and would therefore cost more (around 4.50 rather than 3), however I was told that they would not be double the strength but still stronger than a single dose. As it turned out I have had 3 1/2 blotters and not tripped out to this degree.</p><p>One of my friends parents were going away for the night so him and his sister threw a party.  Myself and a few other friends took the acid in a nearby house and then headed over to the party straight away. Now Ive had acid that has taken 3 hours to come up, but normally it takes an hour or two. However this time it felt as if we were coming up on the walk round, which was only 10 minutes at the most.</p><p>We arrived at the house to find that the Parents had not yet left. We were invited in and handed drinks. The father of the house was sitting watching a chess tournament on tv. By this time I was definitely feeling the effects and struggling to hold on. Glances at the rest of the group confirmed that they were feeling the same. My friends father started talking us through the game explaining how the two players had played each other fifteen years before and had replicated the first ten moves of that match in some kind of elaborate mind game. This was just a bit more than I could stand. After a while (god knows how long, I certainly dont) the parents left and the night progressed. The party filled up and became very hectic. </p><p>Its a haze now but I remember laughing constantly and uncontrollably for a long while. After a point I wanted to phone home and tell my parents that I would be staying out tonight because like a fool I hadnt thought ahead and made excuses. Being apocalyptically tripping I didnt want to use the phone in the house as I thought that people would play pranks on the other extension and there was no way was my mind flexible enough to cope with such high jinks. The idea came to me to walk to the nearest phone box, which was at the end of the street outside a string of shops. I asked for volunteers for my journey but none were forthcoming. After a period of trying to string enough sentences together to convince someone to go I decided to make the walk alone.</p><p>Reaching the payphone was suprisingly easy however it was already taken. This small setback seemed like a huge blow to my ambitions of making a phone call. Not wanting to hang around outside the shops, due to intense feelings of self-consciousness bordering on paranoia, I decided to go into a shop to waste a few moments of time. Stumbling into a off-licence I was hit by the bright fluorescent lights. I walked in squinting to see the local nutter in there being served. The man had hassled myself and a friend previously, after another acid night, on the walk home. He didnt seem violent at all but was random, insistent and intrusive (at least last time he was).  Putting my head down pretended to be intensely interested in some crisps. The nutter left and I managed to stagger out of the shop with a drink.</p><p>I returned to the payphone to find it still full. It seemed like a long time in the shop so thinking that it was getting very late, and being a bit on edge from dealing with the ! experience alone, I decided to walk even further to another payphone which was at a junction of 5 side roads. </p><p>I headed of down the road peering into the distance. I could see the first 20 or so yards reasonably clearly however after that it was a bit of a haze. As I focused it seemed as if the road repeated those first 20 yards endlessly into the distance. I had been walking now for what seemed like a long time and still couldnt see the end. Suddenly I was standing at the end of the road. It opened in to a concrete clearing on which 5 roads sprang from similar in design to a cannabis leaf. I had walked down what I though  was the diagonal road second from the right, When I emerged however I was on the horizontal far right road. This confusion shocked me deeply. I just couldnt get my head round the juxtaposition of which road I thought I should have merged from and where I was standing. After what felt like an eternity I managed to map the area in my mind and convince myself that I hadnt flipped realities or teleported or whatever I thought was going down. </p><p>I then proceeded onto the telephone call home. I struggled to recollect the number but finally managed to punch in something I thought was a close approximation. A womens voice answered and I didnt recognise it. Rather than explain wrong number and hang up, I was so disjointed I made a couple of inarticulate sounds and hung up. As soon as the phone disconnected I realised that it was my mothers voice that I had just hung up on. Now in some kind of panic I struggled to find any small change and just flung in the first coin I had. I managed against the mental randomness to explain to my mother that I was staying out, I was very drunk, it was me on the last call I and had dropped the phone.</p><p>Task done I headed back to the party. As I walked back my mind, which had been taken up completely by the logistics of the phone call, began to truly wander and I realised that I couldnt remember How old I was, what day it was, whether I was in school, sixth form or whatever. I couldnt recollect if it was the holidays or just a normal weekend. When I tried to think of my life up to this night it seemed like abstract templates and half notions that wouldnt stay still and definite. Through a Herculean effort I managed to sweep aside such concerns and returned to the party.</p><p>The difference between the dark and still night outside to the party inside was quite extreme. A constant background murmuring of noise, activity in almost every square inch of my visual axis, and random detached snatches of conversation drifting across my consciousness. The contrast wasnt helped by a prank it seemed everyone in the party had decided to play on me, which was to shout my name at me as I walked in to the main lounge. The sight of dozens of faces all pissed some tripping looking at you and shouting your name while tripping yourself was not pleasant, but it was a surprise.</p><p>I managed after a short while to get back into the rhythm of the party and enjoyed myself for the next few hours. However the drama had not finished yet. I was sitting outside with a few friends in the back garden. One of their friends, who I hardly new, was a bit of a ruffian. He had also had the acid and was going a bit mental. He was talking constantly to the group pacing the garden. The group listened to him and laughed occasionally. I laughed along with the group politely while looking for an excuse to leave as it was obvious that this guy was losing it and could turn violent. Whether he could sense my uncomfortableness  or just didnt like the look of me I dont know, he suddenly stared at me and asked what I was laughing at. Were there was laughter it fell into intense silence. It is hard to explain the sudden dropping feeling that came over me as he made his challenge. There was laughter and a warm fuzzy feeling, then suddenly a deep dropping sensation, silence, a sudden sharp coldness, and a feeling that I was on the spot and had to respond as a failure to could result in violence, to me by him. This sudden flip of events shocked me so severely that I could only manage that I was laughing at nothing. This didnt help matters much and it was only the intervention of mutual friends which calmed the mad fucker down. I left the garden and went inside. I managed to brush of the confrontation and enjoy the rest of the night. The ruffian later apologised for the outburst.</p><p>Sorry for the length, it has actually been quite cathartic typing out the experiences. It is hard to truly recall the feeling of being on LSD.  Even recalling this night, which is one of the clearest memories I have on LSD, seems like telling the story of the story and not the actual events themselves. </p><p>\n"
}
