{
 "title": "WHOA!",
 "author": "yasmapal",
 "citation": "   yasmapal. \"WHOA!: experience with Cocaine & Crack (ID 15909)\". Erowid.org. Jul 10, 2002. erowid.org/exp/15909",
 "substance": "Cocaine & Crack",
 "bodyweight": "128 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Crack",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15909",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 10, 2002",
   "Views: 71642",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was on vacation visiting a friend, and one of his friends had repeatedly been mentioning cocaine, so we decided to try a bit. At first we bought a half gram for about $25, I immediately took a small key bump. After about 5 minutes I began to experience a mellow rush. I became a bit sweaty and euphoric. I needed to get up and walk around. I paced for a bit and talked to my friends nonstop. After I came down only one thought popped into my head 'I need more'. So I did more. The sack was soon gone and we decided to purcahse another gram for the night. After doing a few lines we both agreed to cook some crack.</p><p>I had read how to do it online and seen it done once, I took about 4 large line's worth of coke and put it on a spoon with about 4 drops of water and half as much baking soda, heated it for 10 seconds and the dried it under a lamp. After it became fairly hard I loaded it onto a screen and took one LARGE hit. After holding the hit in for about 5 seconds I began to feel the effects take hold. My vision began to fade and I heard a slight ringing in my ears. My vision went worse and worse until it finally just went totally black and the ringing so loud it was the only thing I could here. My vision and hearing came back after about 20 seconds and I just sat in the same position, motionless for about 3 minutes. I wouldn't even decribe the feeling as euphoric, but I knew it was good because all I felt was a desire to do more. I know that sounds kind of weird but I think that's the problem with crack. </p><p>Over the course of the next two days we snorted and smoked 2 more grams of coke. I got a few cravings  after we were done, but nothing too intense. Now let me tell you, overall coke is not that great of a drug. The effects are only 'OK' and when weighed against the price and addiction factor it just isn't worth it. Same thing with crack, which has such a short duration the fiend factor is exponentially larger. I would do it once just to try it if I were you, not worth getting addicted though.</p>"
}
