{
 "title": "Heroin and MDA",
 "author": "The Trout",
 "citation": "   The Trout. \"Heroin and MDA: experience with Heroin & Ecstasy (ID 1595)\". Erowid.org. Jun 27, 2001. erowid.org/exp/1595",
 "substance": "Heroin & Ecstasy",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:00",
   "0.06 g",
   "insufflated",
   "Heroin",
   "(powder / crystals)",
   "  T+ 2:30",
   "1 tablet",
   "oral",
   "MDA",
   "(pill / tablet)",
   "  T+ 2:30",
   "  ",
   "insufflated",
   "Heroin",
   "(powder / crystals)",
   "  T+ 2:30",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1595",
   "Male",
   " ",
   "Not Given",
   "Jun 27, 2001",
   "68413",
   " "
  ]
 ],
 "report": "<p>\nA couple of years ago I got off work and went home to the apartment me and my three roommates shared. I walked in and noticed two things: First that my roommate T's girlfriend was not there, which was unusual since she had been living on our sofa for the last couple of weeks. This annoyed all of us (except T) because she didn't approve of drugs. Thus we tended to keep our partying to a minimum whenever she was around. The second thing I noticed was that there was someone I had never seen before on the sofa. </p><p>'P, this is S' My roommate A explained to me. I said hello and chatted with S for a couple minutes to be friendly, but I really wanted to take a shower and feel clean again so I excused myself pretty quickly to go do my business.</p><p>I got out of the shower and put on some fresh clothes, because it was Friday and I had just gotten paid. That and the fact that T's girlfriend was gone meant that tonight was a good night to go looking for love, fun and drugs. It turns out I wouldn't have to look too far.</p><p>Going back out the living room I chatted it up with S, A, and R for a while, until finally I brought up the subject of what to do that night for entertainment.</p><p>They suddenly all got quiet and looked at me thoughtfully. </p><p>'You wanna do some packets?' A finally asked me.</p><p>'What; you got some heroin??' I asked in disbelief. We did heroin VERY infrequently, but we all liked it pretty much the same.</p><p>R and A nodded at S, who smiled at me. </p><p>'Yeah, S's got some.' A replied. </p><p>'HELL YEAH!' I exclaimed gleefully as I reached for my wallet. S reached for his backpack and I ended up buying five aluminum foil packets of the whitest powder I have ever seen. Seeing as I would not have to go out that night to find my fun, I fired up a bowl of sensi to celebrate this wonderful occasion. We sat around bull-shitting and spinning records for a while to pass the time until it was late enough to start partying.</p><p>Around 10:30 pm I got out the mirror and dumped two of the packets out. There was a very, very tiny amount of powder inside, and I politely asked S if this was right. </p><p>(Note: Guesstimate each packet contained one 32th gram (.03 grams) of Heroin. And it was VERY pure...)</p><p>'Don't worry,' he replied,'Three of those will have you fucked up like you wouldn't believe'</p><p>My worries assuaged, I snorted two of the packets and sat back to wait. About 30 minutes later the itching began ('I got so high I scratched 'til I bled...') ~ Nirvana.  And thus I knew that this was the Real Deal. </p><p>Soon a feeling of primal well-being filled my body, like a warm, bubbly pink liquid. It was almost like taking a high dose of Valium, getting an expert massage, and then stepping into a hot tub. It was the epitome of 'Chill'.</p><p>I am not a molecular biologist, but I think that drugs that affect serotonin and dopamine act at a very high level in terms of the body's mechanism. Heroin seems to work at a much more fundamental level, which short-circuits pain right at the source and provides a sense of pleasure that is very basic and uncomplicated. Unlike the cosmic consciousness of LSD (or the profound empathy of MDMA) Heroin works at a simpler level, somewhere back in the primitive brain structure left over from our evolution. It is very powerful and very overwhelming, to say the least.</p><p>We all sat around, H-ed out and too messed up to think about moving. About 2.5 hours later there was a knock at the door. It was our friend J, who I really liked. My other roommates were all great djs who had been spinning for years, but J was still learning the ropes just like me. We got along great and I could relate to him on many levels. I was happy to have him there.</p><p>J has a very pleasant surprise for us: He had just purchased a large quantity of Gold Nuggets for a great price. Gold Nuggets were a great pill, very long lasting and powerful. I think they contained MDA, because they did not produce the warm, lovey feeling of MDMA but rather contained a heavy body buzz.</p><p>J was feeling generous, so he gave each of us one and to say 'thanks' I smoked a couple of bowls and then snorted the rest of the packets of H with him.</p><p>Ladies and Gentlemen: What followed after eating the MDA could only be described as the most insane pleasure I have ever experienced. The mellow, wholesome well being of the Heroin, combined with the contentment and slight euphoria of the weed, added to the potent pleasure of the MDA simply melted me.</p><p>In all honesty, if my arm had caught on fire during that heroin trip, it would have taken me several long minutes before I would have become concerned enough to ask one of my friends to grab a fire extinguisher and spray me down. I bonded with the couch and only dynamite could've dislodged me. </p><p>J, A, R, S and myself all sat around for two hours experiencing what I could best describe as 'simply unreal'. I have never seen three drugs with such a glorious synergy. To say it was like 'Being sucked back into the womb' would only denigrate the experience. Never would I have imagined that such pleasure could exist. </p><p>Irving Welsh once said of Heroin: 'Imagine your best orgasm multiplied by 1000, and that doesn't even come close.' Well, Mr. Welsh was talking about injecting heroin, which I will never be able to tell you about; but as far as what I felt that night, the phrase 'Two hour long whole-body orgasm' is more than adequate. Again, it was unreal.</p><p>Despite numberous experiences with sex, marijuana, MDMA/MDA and any combination of the previous I could not have imagined such pleasure to exist before I tried Heroin. And I am not looking for 'converts' nor am I bragging about my 'vast' experience with drugs, but I must say: If you are looking for the ultimate in hedonism without regard to spiritual enlightenment, this I would heartilly recommend. Trust me: You will not be disappointed!</p><p>The only thing I can say bad about it was the each of us was so content to do nothing that no one spun any music. But I wasn't about to get up, either! </p><p>If you attempt to recreate this experiment, keep in mind that the three ingredients used are highly illegal.</p><p>Furthermore, Heroin is a VERY addictive drug. NEVER use it more than two days in a row: The withdrawal symptoms include physical sickness and an emotional distress that makes your worst depression look like a birthday party (This is not an exaggeration: I was once hosptialized for depression, but NEVER considered suicide, despite strong envirionmental stressors. During Heroin withdrawal from a 3 day binge I seriously considered suicide, without ANY external stressors.) There is no doubt in my mind that Heroin withdrawal is what caused Kurt Cobain to do what he finally did...</p><p>If you respect Heroin you can do it safely, but it is best to keep it to one night stands. I was not taking any prescription drugs or herbs at the time; only multi-vitamins once a day. </p><p>Personally I limit myself to four uses of heroin per year, and I frequently fall short of that number because I am extremely careful about who I get it from. The heroin scene is filled with desperate people who are generally non-violent but never the less desperate. Don't end up like them!!!</p>"
}
