{
 "title": "A Walk in the Park at Bonnaroo",
 "author": "kirby",
 "citation": "   kirby. \"A Walk in the Park at Bonnaroo: experience with Mushrooms (ID 15953)\". Erowid.org. Aug 2, 2005. erowid.org/exp/15953",
 "substance": "Mushrooms",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 15953",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 2, 2005",
   "Views: 6698",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was just beginning one of the most fun weekends of my entire life. After a fourteen-hour drive, my friends and I had arrived at Bonnaroo. Anyone who knows anything about it knows that it was huge. A lot of people and a lot of different things to do. The day before we left I prepared shroom tea.</p><p>I took about five grams of shrooms then chopped them up into almost a powder. I then boiled them in water for about ten minutes, added some tea flavoring, and funneled it all into a one liter soda bottle. When we got to Bonnaroo I filled a cup with ice and poured the one liter bottle into the cup (yes, I made cold tea, it was VERY hot).</p><p>Over the next three hours I walked around the festival grounds sipping from the cup.  It only took about twenty minutes of sipping for me to start feeling the effects. At first, just walking around, I started to feel kind of edgy. In the past when I have shroomed I normally just sit down in a dark room with some friends listening to music. The festival grounds at Bonnaroo were packed, with people still coming, so at first I was worried that I would tweak out with so much going on at once.</p><p>I was worried about nothing. After twenty minutes, the first affects were the normal weird feelings. My body felt like it was going up a mountain, the way you can feel the pressure squeezing you in and making your ears pop. It wasnt a bad feeling, just weird. I also started to get the giggles, to me, it was funny that I was starting to shroom in front of thousands of people.</p><p>Shortly after is when things started to sound differently. It sounded like all the people around me walking and talking were actually in a large empty warehouse. There was a hallow, echo effect. Every now and then someone would yell something or make some other sound that is otherwise normal, however it would make me do a double take, like, What was that!</p><p>After an hour of sipping on the tea, the visuals started to kick in. Normally, I don't get very strong visuals, and if I do, it's cause I've been sitting still for a while. While there was five grams of shrooms total, after an hour of sipping on it I was only one-third done with the cup. Over the next hour I had fun walking around looking at the different statues, artworks, and scenery. I also had a blast walking around the vendor tents looking at glass pieces. Everything seemed to be glowing and moving in slow wavelike motions, even while I was still walking around.</p><p>After two hours and I was two thirds done with the tea, I found myself at the movie tent. At the time they were playing the Phish DVD. Normally I try to avoid watching movies or TV while shrooming because its not as affective as looking at still objects, but this tea was some very potent stuff. The movie itself didnt give me many visuals, but the trees, tents, and people you could see just beyond the screen gave watching the movie a very surreal feel. The audio effects while watching the movie were amazing. The music had a different sound to it. The interviews with the band members, combined with the people around me talking, made me hear some very funny and strange things. </p><p>After an hour of watching the movie I finally got bored and decided to move on. Three hours into my trip, I had finally finished the tea, and the entire world seemed to be flipped inside out. All around me, everything looked different. The grass looked grey instead of green. The sky looked more like a hazy light blue-grey instead of blue. Everything seemed to have a new shade to it.</p><p>Next are the three highlights of my first day and shrooming experience at Bonnaroo. It may sound weird or even funny, but this next experience was simply amazing and its something I would probably try again. I had a moment with a porta-pottie, a thirty minute moment. I simply went into a porta-pottie to take a quick piss and continue my walking tour, however, once I got inside, the textures on the inside of the stall sparked a very strong visual trip. I stood in the stall for thirty minutes, watching the walls make circular, wavelike motions. After a couple minutes of that, I started to see shapes appear. After approximately ten minutes of this, finally a girls face appeared in the wall. I spent the next twenty minutes having a conversation with this face.</p><p>After I left the porta-pottie, I met back up with my friends and we went back to our campsite. The next highlight of this trip was the sunset. I've seen a lot of sunsets but this one was the most beautiful and surreal one ever. The combination of the setting sun and all the tents, cars, and people, made for a very strong visual setting. Once the sun was gone, is when people starting launching fireworks. Four hours after finishing the tea, and seven hours after starting it, I was still shrooming very hard. The sounds and visuals from the fireworks are unexplainable, at least through text.</p><p>I continued to shroom for another six hours, the visuals stopped nine hours after I started the tea, the changes in sound stopped after ten hours. The next three hours I had the nice after shroom buzz, where I feel very stoned and still have the giggles. Im sure the whole experience would have lasted longer than the thirteen hours it did, but I was spent. All the walking around and activity had taken its toll on me and I went to sleep.  The next day I had to re-walk the entire area to learn where things were. What can I say, when Im shrooming, I dont get a good sense of direction, especially in a new place as large as that was.</p><p>Bottom line, if I wanna shroom and shroom hard, I make tea. :)</p>"
}
