{
 "title": "Hell to Nirvana",
 "author": "Psychoholic",
 "citation": "   Psychoholic. \"Hell to Nirvana: experience with 5-MeO-DiPT (ID 15959)\". Erowid.org. Jul 8, 2006. erowid.org/exp/15959",
 "substance": "5-MeO-DiPT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15959",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 8, 2006",
   "Views: 3034",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I tried Foxy was also my first time tripping, and I had only smoked weed and tried nitrous up until then, so it was a pretty remarkable experience.  Me and my friends were down at the beach for several days.  They all tripped the night before, but I was too tired and just slept.  The plan today was to take the pill at 6pm and catch the 4th of July fireworks at 9pm, during the height of the trip.  </p><p>At this point, we had spent most of the day on the beach and was pretty tired and to be honest, weary of taking the pill.  Having never tripped before, I didnt think fireworks were the best time to do it.  Putting aside all reservations, I took the pill, which contained about 10mg I think.  </p><p>At first I was fine, but after about 40min started getting sick.  At the same time, a  storm broke out, and we had to leave the beach and get into the van, which only heightened my anxiety.  The sickness and nausea soon passed, but I started freaking out.  It didnt help that my friends left me in the van while they went to a gas station.  I basically remember feeling as if I was going insane, having no idea how long this would last, and wanting it to end something I probably just mindfucked myself into.  I also remember getting out of the car and people giving me pretty weird looks.  </p><p>Eventually my friends came back, and one of them talked to me for a while to comfort me, which helped a lot.  After hi reassurance that this would all be over by next morning, I felt much better, and we went to watch the show, since the storm had ended.  All I gotta say is that it was amazing.  The show, coupled with the lightning from a  distant storm over the ocean made for an amazing sight anyway, and tripping must have enhanced it, because of all the tracers I was seeing and the vividness of the colors.  The great thing was, I was feeling pretty sober, and completely fucked up at the same timea bit hard to explain I guess.  We watched the show, and then swam around with glow sticks which was awesome.  </p><p>After this we just walked around, smoked some weed, chilled on the beach, and continuously played with glow sticks.  I didnt see any real hallucinations:, but as I looked at something, I would eventually see it changing shape or waving back and forth.  Music also sounded different, as if I could speed it up or slow it down by will.  Finally, sleeping was hard, and even thought I was very tired, I didnt fall asleep till like 5am.  All in all, after the horrible beginning, I found tripping on Foxy to be a wonderful experience, though I did not feel any of the body stuff.</p>"
}
