{
 "title": "There Is Someone Else Here!",
 "author": "Lavaman",
 "citation": "   Lavaman. \"There Is Someone Else Here!: experience with Nitrous Oxide & Oxygen (ID 15957)\". Erowid.org. Sep 15, 2003. erowid.org/exp/15957",
 "substance": "Nitrous Oxide & Oxygen",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 15957",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 15, 2003",
   "Views: 14645",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a experienced nitrous user.  I have free access to it at work, (self control was something that I learned soon) so developing better ways of delivery was only natural. As the ballons seemed to just not be large enough anymore, large garbage bags with a tube were filled. This was cumbersome so THE MASK was developed. 100% nitrous is fun (and dangerous),   but if I wanted to go deep,  I needed to supply at least SOME O2 to keep from diving too fast and not remembering anything.  Also,  my most profound experiences were usually after getting good sleep, eating light, and on nitrous ONLY.  \r\nAs for my expeiences (there are many - from real scary to beautiful beyond words)  I was sceptical at first,  but as I learn more about my own subconsious and the 'astral plane'  I have come to believe in that world (and myself) more deeply.   At first I thought what I was seeing was simply hallucinations that my mind created.  As I had more experiences, I learned that although the experiences were diverse,  they were all connected in some way.  The people I saw and communicated with (I called them Nitrous Ghosts at first) were possibly spiritual guides (some may call them guardian angels).  I am now seeing that I may have been astral projecting myself all these times.  \r\nDescribing my experiences is real hard as most of them defy words. But the most memorable ones were of white walls and spackle. (memorable  meaning just that - they were by far NOT the most profound)    Not the walls themselves but the patterns that seemed to grow over them like vines.   Strange machinery that is used by the 'Nitrous Ghosts'.  Golden spirals -  the spiral is a very prevalent figure in my experiences (and others').   I could try to be more detailed than that but I think words seem to cheapen the experiences.\r\nI am still trying to figure out what all this means.   Maybe I'm not supposed to,  but it is the questions that are important - not the answers.\n\n\n"
}
