{
 "title": "A Porn Star with Magic Powers",
 "author": "Rockstar",
 "citation": "   Rockstar. \"A Porn Star with Magic Powers: experience with Cocaine & 5-MeO-DiPT (ID 15987)\". Erowid.org. Jul 14, 2002. erowid.org/exp/15987",
 "substance": "Cocaine & 5-MeO-DiPT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  ",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "15987",
   "Female",
   " ",
   "Not Given",
   "Jul 14, 2002",
   "77548",
   " "
  ]
 ],
 "report": "<p>\nWell, it was a birthday present to the person I was with, and no one there at the party had ever tried it before. No one knew what it would do to us - and I was concerned becuase I had done what, for me, was a lot of coke, which was not actually a lot at all - but I am not a regular user and have no tolerance. </p><p>We both did VERY SMALL lines and sat back to see what it would do.</p><p>It comes on relatively quickly, and no trepidation. Things just start to become more vivid and interesting, and brighter, and you do too...</p><p>at first I was very relaxed and layed down, realizing how high I was. VERY. After about 15 minutes.  Body high - not visual, but sensual and stimulating. Then a beautiful french girl that everyone was intimidated by came over to check on me and I told her 'Je besoin de beaucoup de practice avec mon fracais - mon vocabulaire ce'st merde, y les numeros me confuse completment' - which is damn good french for me - and it was on. </p><p>She made me dance with her and I have never felt so wonderful in my life. Well, maybe - but it was truly transformational. I love to dance and do it to engage in physical release and have reached spiritual levels with it - but this was unprecedented. </p><p>Not only was I bonded to this girl emotionally - the fact that we were using our bodies to communicate to music was absolutely transcendent. Everyone watching us - no self-concsciousness - only bliss. joy. My body naturally engaging in spontaneous art, performace, and communication. The boys said we looked completely hot - they were riveted. They asked me what it felt like and I announced proudly that I felt like 'A Porn Star with Magic Powers' - and I was. </p><p>And I guess I am.</p><p>Completely comfortable with my sexual power in a healthy and positive way. </p><p>Some drugs that make you feel sexy will make people do things that they regret later - engaging in intimacy with people that at the time seems meaningful - later a let down. risky behavior. When this same stunning girl came onto me later (I swear to god - she showed me a dildo in her backpack and said 'I want sex - come downstairs with me' I did not go.) I was looking forward to a real friendship with her - possibly turning into the third my male partner and I had been 'sort of' shopping for - but was not tempted to rush things just because I felt so sexy.</p><p>Anyone who really understands sex can tell you that it is far more than physical - and sexy as I felt - I had the wherewithall to get her number and save such a potentially amazing thing for a more intimate and controlled setting. </p><p>I never got the chance - as she was just high too and never came on to me again- but I do not regret the choice I made.  Our friendship continued.</p><p>I would happily do the stuff again in a minute - perfect for social occasions. I felt like talking to everyone- about interesting things. I hear overdosage is easy and fatal - so a carefully measured dose is critical. don't take it lightly.</p><p>Foxy is a perfect name for it. Perfect. Unless we start calling it 'magic foxy'. I felt my own power in a positive and loving way - and it ruled.</p>"
}
