{
 "title": "The Illiterate Degauss Function for the Third Eye",
 "author": "latcheye three",
 "citation": "   latcheye three. \"The Illiterate Degauss Function for the Third Eye: experience with 5-MeO-DMT (ID 16000)\". Erowid.org. Jul 14, 2002. erowid.org/exp/16000",
 "substance": "5-MeO-DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16000",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 14, 2002",
   "Views: 20165",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nINITIAL MINDSET : mild tension / anxiety attributed to the trial of a new substance. mild tachycardia before dose..calmed using deep breathing.</p><p>SET & SETTING : dark, alone, lying on a couch</p><p>PHASE TIME RANGES</p><p>up=20 seconds max after initial inhalation of vapors, coming up 1 min.</p><p>1st phase=5 mins (+/-) 1</p><p>2nd phase=10 mins (+/-) 1</p><p>residual effects= 45 mins (+/-) 1</p><p>OEV </p><p> in initial stages, the open eye visual aspect seemed to reflect the pulses of energy felt, and the visual noise seemed to be a\tmonitor\tfor the static heard throughout the trip </p><p>CEV </p><p> minimal. hardly any materialization. most CEVs could be attributed to normal brain interference.</p><p>AUDIO </p><p> heavy audio manifestations throughout the initial heavy phase , and still noticeable throughout as a high range static varying \tin hz frequencies drastically.</p><p>VARIOUS DESCRIPTIVE WRITINGS </p><p>assumably the relatively little amount of time that seemed to pass was relevant to the vast amount of time that actually passed. the percieved notion of time seems almost completely irrelevant given this new reality. This must be the equivalent to dreaming in the constraints of time. seems as if every second suddenly took on new meaning and was enveloped by the sheer ferocity of the energies. at first, the scent of the chemical took on a great meaning, and as i held the smoke in my lungs, the formalities and whole concept of humanity seemed to dissolve, leaving behind a mist of insight and wisdom that washed over the soul, breathing on it's own, and self-sufficient. great waves of energy seemed to flush the dirt away, leaving a clean slate for one to ponder the great realities and the nature of mankind. This tool could possibly be a safe tool for the exploration of the self. It's as if reality now has a reset button, the illiterate degauss function for the third eye.  Suddenly, out from behind this new wall of insight and wisdom, came the cessation of effects.</p><p>The walls of energy suddenly came to a peaceful slumber,and the true light of reality diminished. a hard experience to define using language, but one that can be well understood through trial.</p><p>However, In retrospect, i'd caution those individuals with a weak stomach or heart away from using this new, intriguing substance for the risk of tachycardia might be contrindicated with certain heart and stomach conditions. Also, make sure to breath deeply in a meditative fashion to keep yourself in good shape during this, and to expel the waves of energy flowing within.</p>"
}
