{
 "title": "Meeting the Tank",
 "author": "Futon",
 "citation": "   Futon. \"Meeting the Tank: experience with DXM (sold as Ecstasy), Mushrooms - P. cubensis & Amphetamines (Adderall) (ID 16031)\". Erowid.org. Apr 25, 2010. erowid.org/exp/16031",
 "substance": "DXM (sold as Ecstasy), Mushrooms - P. cubensis & Amphetamines (Adderall)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 mg",
   "insufflated",
   "Amphetamines",
   "  T+ 0:30",
   "3 g",
   "oral",
   "Mushrooms - P. cubensis",
   "  T+ 1:00",
   "2 tablets",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16031",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 25, 2010",
   "Views: 11123",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading many glowing reports, I had decided to try mixing MDMA with P. Cubensis in the warm and earthy environment surrounding a close friend's apartment. The outing was planned as a typical 'back to nature' forest trek that usually brings me home and centers me as an individual in a large metropolitan area. Unfortunately, my rustic foray took a decidedly unopportune turn for the worse...</p><p>I went into the experience as calm and prepared as possible. I had packed water, snacks, flashlights, and other supplies in a light backpack suited for hiking. Inside one of the inner pockets was nestled two tablets of what was sold as MDMA, three grams of mushrooms, and one twenty milligram prescription dosage of Adderall. Prior to saying farewell to my friend and promising to return in four or five hours, I had taken a long bath, dressed warmly, and finished my preparation rituals with twenty minutes of meditation. Right before leaving, I snorted forty milligrams of Adderall for extra energy, hoping to find the right balance between the lethargy of the mushrooms and the joyful bouyancy of the MDMA. Full of vigor and ready for eye-opening natural wonder, I skipped out of the apartment and into the ajoining woods at 5 in the evening.</p><p>Earlier, I had decided to take the mushrooms first, deal with any nausea, and then eat the two MDMA tablets. I had hoped that the light lunch I had eaten beforehand would cut down on any stomach pains, as I am unfortunately prone to cramps and vomiting after ingesting mushrooms. I ate the three grams of mushrooms at around 5:30, washed them down with water, and decided to wait out any possible problems in the secluded glen I had found close to where the forest began. After waiting thirty minutes, I felt safe enough to ingest the two tablets, noting a funny taste as I chewed and swallowed, but ascribing it to the 'shroom residue. For a lark, I threw in the remaining Adderall, reminding myself that I would want to stay awake and write down my experiences after the trip.</p><p>Within an hour I realized I had not taken two tablets of MDMA. It was nearing 7 o'clock, and the mushrooms were fading the edges of the world a little, but from the synthetic tryptamine corner not a peep. I tend to metabolize MDMA very quickly, and so I wondered what else I might have foolishly ingested on blind faith from a dealer I knew and thought I could trust. MDA, with its slower onset, was my first guess, and I felt no particular need to turn back and find a sitter. I am normally very confident with my own ability to handle a trip.</p><p>By 8 o'clock the sun had set and I realized that I had not ingested MDA or a derivitive. The boomers were going strong, the Adderall was adding a harsh paranioac twinge to the forest, and on top of these two dark buzzes was a third that seemed to both intesify the psychedelic apparitions and space everything out. No feelings of openness or natural bliss. Just a trippy alien forest-scape, lying dangerous and restless in its own shadow. Things got weird...</p><p>I had found a small creek in the forest.. 'found' being relative considering how hopelessly and dismally lost I had become. I sat on the creek-bed and stared at a huge sea turtle swimming against the current. The hallucination was open-eyed and captivating. At this point I lost much of my conception of linear time. I could have been staring into the creek for seconds or minutes. Movement was slow and choppy, less flow than normal mushroom intoxication. Concentration could be both irritatingly lacking and painfully overdrawn. The amphetamine was pretty well snuffed by the other chemicals in my system at this point, except for the effects on my heart. All through the trip my heart was beating like a turbine. </p><p>While there were many strange and discordant themes during the trip, the most interesting for me were the bewildering conversations with people that weren't there and the overwhelming feeling of a conflict between good and evil. I would begin feeling as if the forest was a dark haven of evil and that I was a sort of white knight who had been sent to destroy the powers that had infested nature. People I knew would appear in order to offer advice or just talk about the nature of good and evil. I would continue talking to them for minutes before realizing that they could not, would not, and should not be in the forest with me. At that they would dissapear only to be replaced by another phantasm. The last of these apparitions was what I can only describe as some kind of tank/armageddon image that seemed a manifestation of the evil around me. I finally realized at this point that I was losing control, and sat down to breathe and meditate until the visions passed, which they eventually did.</p><p>By this time it was around midnight, and the 'shrooms had lost most of their kick. I was mentally fatigued but somehow able to summon up enough rationale to find my way back to the apartment by one in the morning. I looked a wreck when I stumbled into the foyer of my friends' loft, and he was able to take my picture before I stumbled into bedroom to rest. My eyes were ridiculously dilated, and my hair was covered in leaves and dirt from when I decided to go look for the turtle in the creek by submerging my head and peering around. After another two hours or so of tossing, turning, and talking to very vivid hallucinations, the DXM wore off enough to allow me to rest peacefully.</p><p>About two days later Dancesafe had posted the two tabs I had bought and informed me that what I had taken really was DXM. The experience was one I would not care to have again, but did reenforce to me the benefits of sitters and meditation. DXM and 'shrooms is a dissociative whirlpool... VERY spacey and threatening. Interesting as all hell, but make sure you ground yourself in the right setting.</p>"
}
