{
 "title": "Incompatible with Gravity",
 "author": "Splatt",
 "citation": "   Splatt. \"Incompatible with Gravity: experience with Salvia divinorum (ID 16043)\". Erowid.org. Jul 15, 2002. erowid.org/exp/16043",
 "substance": "Salvia divinorum",
 "bodyweight": "115 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16043",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 15, 2002",
   "Views: 7168",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nSet: Feeling okay, feeling rather good actually since I just had a cone of some potent aussie hydro.\r\nSetting: Friends room, no lights or sound\r\nExperience: Having tried salvia one time before this, and not really going by the 'rules' (we had music and alot of light), 8 cones of the stuff didn't seem to do anything near as much as the following experience. The first time all I felt was lagged, and drunk. Lights seemed different and I had some warpy hallucinations and so on. Nothing great though.\r\nThis trip was not timed at all, as I basically just forgot to.\r\nMy Experience:\r\nI had a straight big cone of some nice weed we were told was Skunk. Was pretty good, and hit me hard since I hadn't smoked in a week (being pretty much an everydayer). My friend asked me if I wanted the salvia left over. Well, seeing as I've been wanting to try it properly for ages and it's going to be illegal in Australia in June, I said yes \r\nWe switched off the lights and Lord of the Rings VCD that was playing. I got handed a packed bong. I ripped the burning salvia leaf through the cone, into my lungs. Held in for about 10 or so seconds, exhaled. The exercise was, 3 cones of salvia leaf without normal breathing, the only oxygen was from the miniscule amount that would get pulled through the bong along with the smoke. I handed the bong to a friend, he re-packed it. I smoked the second cone, then the third. I think I handed the bong back, since I thought the salvia was all gone now (I was told about 3 cones were left).\r\nI sit there, on the lounge chair in the dark, noticing some marijuana patterns, only they were getting bigger, and moving around more. The room was silent, except for a buzzing sound that I thought sounded a bit simular to the sound on nitrious. I start to get very, very weird body sensations, and the feeling of something spinning around me.\r\nI shut my eyes, I felt like I was sucked into another place. My two friends didn't make a sound, they just sat there in silence (that was a rule the owner of salvia/room made). I then felt like i was warping, warping through a tunnel. I saw the tunnel getting more visual, and making lots of wooshy noises. I then think, for some reason, I am on a boat fo some kind. Because I feel what I am in is rocking sideways, like a boat in the ocean. I sense thunder, and a storm. This scares me, so I open my eyes. I am not sure what time has passed, I guessed a few minutes, although it did seem alot longer.\r\nI shut my eyes again, this time I was taken to a place of open-ness. Nature surrounded me, grass, I could see a gap in the background, I ran towards this gap, I have no idea why. Then suddenly, I felt someone watching me, watching over me even. I feel that presence people sometimes talk about, and it really did feel like a female presence, I yell out 'Sally D!!!!' As soon as that happens I get sucked out of my dream trip, and get sucked back against the couch. This is when a very weird, and sometimes scary ride started.\r\nIt felt like gravity had just rejected me, because I had smoked the salvia and was on a different level of rules. Gravity then pulled me left and right, and sucked me to the right for a few seconds. I try to stand up but no, gravity put me right down on my arse again. I couldn't even stand up, it wouldn't let me. I notice alot of warping and weird patterns, which reminded me of acid. Then for a while, the couch I was sitting on was being pushed back and forth, by some sort of force. It felt like it had wheels, which it doesn't.\r\nI felt very weird, and sometimes tense. It was a really rushy type of tense though, and didn't bother me too much, there was only one small time when it became too much, but I got over it easily. Then all of a sudden, I felt the alien gravity again, it pushed me, nearly off the couch. I sat back and tried to secure myself so the evil gravity couldn't fuck with me anymore. At this time I was seeing alot of different faces, some unreal and fantasy or cartoony, and some normal faces, mostly in pattern/static overlays. I then said a few words like 'So this is salvia' or something, and then laughed a bit. I got no reply from my friends, they must of thought it was best they didn't say anything, although in a way, this made me feel uncomfortable. I was thinking stuff like 'I'm never going to do this again' (Although now i really want to ofcourse ), and even the whole 'Drugs shouldnt be messed with' thought. Then I snapped out of it and said something I cannot remember. Then someone said (not sure who) 'Ya back yet?'\r\nI then tried to explain what had just happened, and found it extremely hard (I still do find it hard to put in words, and had to skip alot of things that happened because they are really unexplainable by words). Then all of a sudden, that gravia (stupid name for it ) kicked back in, and pulled me forcefully to the right. The room started spinning and my couch started moving back and forth again.\r\nMy other friend saw there was some salvia left (around 2 cones or maybe 2 and a half) and he tried it. Still in my trip-world he did the cones without breathing like me, but reported he didn't get much from it, besides a headache and a brief feeling of weirdness.\r\nThe lights came back on and they put the Lord of the Rings back on. As I was talking to a friend, his outline became blurrs, especially his face, that kind of morphed and looked very bright, almost cartoony. Things around the room still warped a bit every now and then, and the lounge chair would still roll back and forth when I thought about it, even up to an hour later.\r\nConclusion: Very weird experience that I did enjoy, although I would not say it was 'fun'. It is hard to explain, but the salvia ride is pretty intense, and although I can say I enjoyed it, and I even laughed a few times. For some reason I can't say it was like a 'fun time' like smoking pot or dropping acid can be like. It's way more of an unpredictable, intense ride.\n\n\n"
}
