{
 "title": "Cosmic Joke",
 "author": "Explorer",
 "citation": "   Explorer. \"Cosmic Joke: experience with Salvia divinorum (5x extract) (ID 16088)\". Erowid.org. May 4, 2005. erowid.org/exp/16088",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16088",
   "Male",
   " ",
   "Not Given",
   "May 4, 2005",
   "17234",
   " "
  ]
 ],
 "report": "</p>\n(Author's Note:  The split writing in this section gives you an idea of what the experience actually felt like.)</p><p>Remember the movie/book 'Contact?'  Its already here, bro.  And it's...</p><p>What a great 'Cosmic Joke,' it would be to have something 'disguised' as a drug that would split the 'reality' of the user up into little bits, like magazine rack slats, oh, about an inch wide, set these slats a-spinning, and have the user fall through these 'cracks' to be re-combinated, re-integrated, pulling themselves together in another 'reality' where some other user just happened to have torn their reality to shreds in some sort of relationship with yours and the user suddenly finds himself in a completely different world than he was, moments before when he took the drug.  And the overwhelming feeling like your taking this 'drug' was anticipated, there in this shuffling of Dimensional Combinations -- and anticipated with none too pleasant intent.</p><p>...nothing like what my studies prepared me for -- it is far more 'mechanical' than 'spiritual.'  Yes, you may have read recounts of the experiences, but even experiences recounted only a few hours after the event still have key details only hinted at.  'A splitting of consciousness' is how some have put it.  I'd put it as, 'When you go to 'sleep,' how can you be sure you'll 'wake' up as the same 'person?''  And if you happen to like yourself, respect all the effort you've put into this 'life,' how would you feel about...</p><p>Oh, sure, there's a few minutes disorientation as you get used to the new combination of realities, but hey, you just took a drug, right?  You're 'supposed' to be 'Divinely Inebriated,' right?</p><p>...trading it in its entirety with another?  Salvia D. is not a drug -- it is a TRANSPORT mechanism that wouldn't be out of line to think of as the machine depicted in Contact.  And as such...</p><p>Well, this 'Inebriation,' is not being slowed mentally in the least, your balance is off because you're rocking from the influences of all the different dimensional combinations (more on this in a bit) pulling at you as you pinball into your new reality!  Hey!  There you are!  You're a new someone!  You're 'driving' a brand-new body, complete with memories, and consciousness resonance.  Sure, there's to be a little disorientation to be expected upon re-integration, but that'll fade... as the memories stored in your new body's biomechanical construct known as a 'central nervous system' filter into you, filling you with the memories of your new life... And your 'Babysitter' reminds you of your new identity (not new to them, and unless they've done this themselves, to them they have no clue what just went on) by telling it to you again and again.  And someone else just slotted into your 'old' body.</p><p>...startlingly little information is available to actually brief newbie 'travelers' on what they are getting themselves into.  And besides, who would believe it?  'Initiates' would just nod knowingly, smiling their private joke.  Those hungry for what they believe will be a 'visionary' experience won't pay attention to these kinds of warnings anyway... right?  And although, in retrospect, I understand the subtle undertones...</p><p>Suppose you forget the experience, the details of it, and it turns into this collage of memories, and you feel like you've 'lived a whole other life' (as some of the online literature tells you may happen -- in addition to visiting other times, planets, dimensions, etc.).  Suppose you just chalk it up to a very wild concoction of a drug-experience.  Suppose then you try it again.  Wha-bam... You do enough to 'fall through the cracks' again and you're someone new... Only this time, you remember a bit more about what happened...  Pretty soon, you're skipping into new bodies in new places for kicks, hanging out in the 'Holding Areas,' waiting for a good body to come along, ('Hey!  We got another one!')...  Inter-space/dimensional travel?  Possibly, but at least be straight about warning the 'traveler' about it before you send him out of his life and into another's.</p><p>...of the language used in cautioning people on their first experiences, I feel it should/could be spelled out, in plain language, and let the individual make the decision for him/her-self.  After all, how easily can you cope with your 'consciousness' existing within more than one 'reality' at once?  And how quick would you be to trade 'bodies,' 'brains' and all that they contain with someone else -- you may not be all that keen on your current personal set of experiences, but you've at least worked very hard to attain them.  Would you be OK to just 'wake up' as someone else?</p><p>...</p><p>Here's a little background theory, developed many years before the experience:  The 'stuff' of the 'Universe' is all the same 'stuff,' it is only measured based on different combinations of the Vectors we think of as, 'Length, Width, Height, Depth, Time (a Scalar for our physical bodies -- a one-dimension vector), etc.'  Say in 'the next dimension over' (which may only be the 'next one over' within a complex pattern of shifting variables, and so is not always 'the dimension next-door'), what we measure as Height is what they measure as Time, and what they measure as Time, we measure as Depth.  This is an expansion of the 'Grain to Space' theory one can explore using the Schrödinger's Wave Equation.</p><p>In this theory, because this 'stuff' of space is still the same 'stuff,' only re-combinated and measured differently, occurrences within the other 'dimensional combinations' would still affect our own, and one could measure it, if one knew what to look for... Patterns.</p><p>The search for patterns and their relationships have been a strong part of nearly all 'ancient mystery schools.'  Shamen looked for 'signs,' or 'omens.'  Qabbalahists explore the relationships of things as varied as holy texts and grains of sand.  Wicca is all about creating a 'pattern,' (ritual) in the 'world of form,' waiting as it does what it needs to do in the 'unseen world' and then re-manifests back here in the 'world of form' as what?  As Patterns, specific to a desired outcome: e.g. Rain, good harvest, protection from a bad happening, etc.</p><p>I have no idea of _exactly_ what others have experienced on this 'drug,' but I find the 'coincidences' to be startling.  And from what I can tell from my research, my experience was similar to what others have experienced.  And I'll do my best to 'tell it like it is.'</p><p>I'm a Visionary.  I'm a Spiritualist.  I'm a Scientist, Artist and Author.  In short, I'm an explorer.</p><p>I had been told about an interesting experience a friend of mine had had with this Sage plant, native only to one part of Mexico.  It has been used by Mexican Indian Shaman for centuries for vision questing, healing and other sorts of spirit-questing.</p><p>I never jut leap off into things, I find out as much as I can about a thing before I even set a toe in the water.  For this particular experience, I researched for the better part of ten months.  I read experiences written from other's accounts.  I sought out visual art inspired from experiences.  I read FAQs, User's Guides and every bit of information, comment or conjecture I could find.</p><p>My packet of the dried Sage arrived in the mail today, something I'd long prepared for... Cleansing and Blessing mind, body, spirit and surroundings, I lit incense and sweet-grass and said Prayers to four directions, to Great Spirit, to my personal Deities and to the Universe.  I then meditated on the deep, spiritual visions I expected to have.</p><p>After an hour of meditation, the Native American flute music of R. Carlos Nakai set to loop in the background, I lit the carefully measured, recommended dose of 1/8th of a gram.</p><p>The smoke was harsh, hot, and stung my mouth.  I estimated I had taken 1/3 of the sage in the bowl.  It didn't have the 'cough reflex' common to Marijuana, and I was a little surprised, considering how harsh the smoke was.</p><p>I had read that I was supposed to take the whole thing in, deep, hot and fast, assimilating all of the sage in under a minute.  Ten seconds from my first 'hit,' pipe and lighter poised to draw the second third of the sage, my reality exploded.</p><p>(I suppose, that if my perceptions on the experience are correct, this goes a great distance to 'proving' my Recombinating of Dimensional Vectors theory.)</p><p>It hit.  It hit all at once.  It felt like my perceptions of reality split apart at the 'seams.'  It was an instantaneous shredding of my Local Combination of Dimensional Vectors.</p><p>'We got another one!' I felt, more than heard what must have been more than one, none-too-pleasant voices, shouting in unison.  There was a deep, base-string vibration that seemed to emanate from the Universe itself.</p><p>My Local combination of vectors that formed my accustomed 'reality' was a small cube of what I could immediately measure around me, and the cube began to roll... to tumble.  I found my head forced down into this rolling, like I was being seam-rolled into the floor.  </p><p>'Up' changed.</p><p>In my peception, I was someone else who had just smoked Salvia, and I felt the resonances within the biomechanical 'hard-drive' of their brain of their own, similar worries concerning the experience.  I did NOT want to leave my body 'un-attended.'  (I am well aware of the practices of 'Astral Travel' wherein you ALWAYS leave a part of your focus as a kind of 'path' back to yourself.  You do this not only to have a 'trail of breadcrumbs,' to follow, but also to keep your body from 'thinking' it has nothing left to do -- without the important task of providing a 'physical' vessel for the Soul -- and shutting down.)  I did not want my body to be 'out of my hands.'  I fought to get it back.</p><p>I was back in my 'own' Combination of Universe-defining Vectors for about 1.5 seconds (timed later based on my remembering of the experience).  Realities 'tumbled' inside this 'cube' of my own perceptions, leaving me about 1.5 seconds in each different set of Dimensional Vectors.  A certain point of my perception was in the 'center' of this 'cube' was conscious of many of the myriad, different possible lives currently at a point that would be receptive to my consciousness docking with them.</p><p>There were a great many of these 'open-receptor' lives (think of it like Cosmic 'Swinging'), that in itself was startling.  I do remember knowledge coming not from myself (and yes, having a definite 'female' feel to it) that whichever of these lives/bodies I 'chose' (by agreeing to believe in that set of Vectors), that I would 'wake up' from the experience, continuing on, living that life.</p><p>Many possibilities 'tumbled' through my measurements of 'reality,' like cards flipping in a Rolodex.</p><p>There was the (British?) teen-ager, also un-prepared for the 'truth' of the experience, laying on his bed, hoping at first to get a quick 'buzz' from this 'new weed.'  Now, he hoped desperately to regain himself before arousing the suspicion of his the other family members still at home in the rather immaculate house (as only British houses can be).</p><p>More realities tumbled.</p><p>I was pulling myself up from the dirty floor of a bus, 'friends' pretending they didn't know me, and other riders staring in disgust at the blatant and open drug-use gone bad.</p><p>My perception of my own consciousness was splitting, just like my perception of my local dimension was.  Six to 24' sections of reality had become un-seamed and were flipping and shuffling themselves about.  I perceived my face, my focus was also part of the materials that made up sections of this dirty bus.  I tried to pull myself up from this segmentation, but I had to gather all the shifting pieces of 'me' as the shifting patterns slid along the unfamiliar dimensional combination.</p><p>I felt myself being sucked irrevocably into this 'reality.'</p><p>I did not want this.</p><p>I felt voices, 'conscious,' none-too-kind, and ready, waiting for something, but I did not like the feeling of what... Helping me to get sucked into the cracks between realities, 'helping' me to agree that this was indeed my reality -- perhaps that would leave my body entirely free of the Consciousness I had though of as 'me' for all that body's life.  ...and probably free to receive another 'traveler.'</p><p>Summoning all the 'mental,' spiritual and 'physical' strength I could, I flung my physical body up from where I had prepared to lay on the floor.  A part of my mind hoped that through physical movement, by a constant, bi-directional flow of nerve-impulses to, from and through 'my' body, that I could keep my place in this madly flipping Rolodex of dimensional realities.  </p><p>There was one problem, however.  And that problem presented itself to me in the form of what I perceived Locally as 'Up' (+Y) wasn't the constant I had come to take for granted.  I found myself laying on the wall at the far side of the cabin as one would lay on a floor.  My hand was clutching the holy symbol on my necklace so hard that it hurt.</p><p>(And here, I recall musing about the 'power' we humans attribute to our 'deities.'  It felt like God/Goddess had nothing to do with this; it felt that this was the inner-workings, the machinery of the Universe at work.  It felt like what it must have felt when steel began shattering the Enchantments on bronze blades.)</p><p>My own Local +Y was shifting erratically, feeling as if it were moment-by-moment, randomly exchanging itself with any of available, possible Vectors.  Parts of the room had split along the 'seams' the little sliding, flipping bits of 'Dimension,' allowing it to flip like a 'Quantum Rolodex.'  The floor had become the ends of these 'Quantum Rolodexes,' and shifted and gave under my weight, and I fought to keep from falling in, being sucked 'down'(?).  I felt like I was balancing on mad palm-fronds.  </p><p>I had to keep moving.  I had to keep changing the 'playing field' around me so those who seemed interested in my 'slipping through the cracks,' couldn't calculate a way to tip me off-balance.</p><p>I hit the door to my cabin and flew through it, barely touching the ground.  I was nearly 50 yards down the gravel road, (the ground, the trees, everything still splitting along Dimensional Combination Axes), when I realized that out in 'public' is not where you want to be with this personal, 'reality crisis' going on.  </p><p>I halted, dropping a hand to the ground for a moment to pick up a stone that was seeming to split and flip along its dimensional seams.  In my hand, its flipping slowed, until staring at it, it assumed 'harmony' with my own dimensional patterns and 'synched' to being perceived by me as a single, whole stone.  (Always the explorer, it seems -- taking time to experiment and evaluate even amid an experience that could easily be classified 'Highly Traumatic.')</p><p>I live on the edge of no-where, which in terms to relating to some-where, is about fifteen miles from said, 'some-where.' 'No-where' is right next door.  Still, I ran like the dickens back to my cabin, and into the part of my yard my dogs call their home.  </p><p>The dogs, conscious entities themselves, didn't appear to exhibit the same flipping/splitting along dimensional tears that all 'non-sentient' things appeared to be doing.  I cowered in the soft, wet mud (only noticing now that I was barefoot, and had run no short distance on a gravel road), next to one of my dogs, asking him if he were OK, asking him if his world was still OK.  (This communicating with a dog isn't a 'delusion' brought on by the Salvia -- I am an 'Animal' Communicator.)</p><p>I stayed there, in the mud with my dog (who is very spiritually evolved for 'domesticated' dogs of this planet,) for some time, working together to help draw strength from his presence and from being out-of-doors.  Finally, I cautiously went back inside.</p><p>(The sensation of walking on upturned rolodexes wasn't helped by the fact that I was walking barefoot on wood-chips along the path back to my cabin.)  Inside, most everything had settled down, the 1/16-inch  'seams' between reality segments had shrunk back to seemingly contiguous perception in most areas.</p><p>I paced.  </p><p>I thought.</p><p>I couldn't believe what I had just experienced.  Already, the memories of the intense splitting and shifting of 'reality,' the shifting and being sucked into the cracks between dimensions, the knowledge that 'agreeing' to one of those other dimensions would mean that is where my focus would stay, all this had begun to fade.  I began to 'rationalize.' </p><p>I didn't feel 'high,' 'buzzed,' or in any way light-headed, (and hadn't, through any part of the 'trip,') except for the pulling at my sense of balance by the still wildly shifting 'Up Vectors.'  </p><p>I couldn't believe that such a precise, 'mechanical' hallucination could have taken place.  This indeed had been nothing like the etheric, inner-journey of any other hallucinogen I have ever experienced.  This was much more the completely predictable, machine-like breaking apart of reality into definable and mathematically re-definable patterns.  This felt much more like something as provable and definable as linoleum than some 'inner-dream' projected outward.</p><p>And the memories of it were fading.  </p><p>Was there some sort of neurotransmitter released that inhibited the formation of memories during the experience?  Or was it more simple than that... Do our Central Nervous Systems really do serve as 'Hard Drives,' recording everything so our Un/Conscious has something to define its existence?</p><p>I was loosing belief in what I had experienced.  I had to measure it again before the memories faded.</p><p>1/4 of that 1/8th of the standardized gram (1/32nd, for the arm-chair mathematicians :) was what I carefully selected and sifted into the pipe.  I did not want to get swept away.  I did not want to risk loosing myself.  I just wanted to measure even a small part of that experience again -- for analytical purposes.</p><p>It was a relatively tiny 'hit.'  The smoke still stung my mouth.  I laid back on the couch this time, not the floor.  And again, ten seconds after the hit, there was the same, instant disassembling of my dimensional reality.</p><p>It didn't feel quite as intense this time.  There were no waiting voices saying, 'here he is again!'  (Though, suddenly, having achieved the same mental state as before, I knew what those voices had been waiting for.  They had been waiting for me to disconnect from my reality.)</p><p>Up Vectors began shifting again.  The arms of the tiny couch seemed to keep me from sliding as what was once 'down' became 'left,' then 'back...'  The sensation of actually being on the wall or ceiling as my local 'reality' tumbled in that rhythmic roll felt as empirically sound as any other measurement I've ever made.</p><p>The rolling wasn't as intense as the first time (which in memory, seems like a horrific version of Fred Astaire's stunt of literally dancing 'around' the room).  And in this lack of 'shock' the other dimensions were much more subtle in their 'approach.'  Only after having found myself piecing together from sliding slats where the dimensions fit together to form a natural wood wall, did I realize that I was again, a 'Traveler.'</p><p>I knew that were I to slip into any of the other realities, Dimensional Recombinations, that there I would be.  And the memory of hundreds of these combinations passing under and around me on the first 'journey' scared the heck out of me in this second experience.</p><p>Would I die here if I did allow myself to get 'sucked into the cracks?'  Intuitively, I sensed that, no, I would not die.  I sensed that the 'Spirit' that 'drove' the 'chassis' known as 'blah' would fall into another at a similar state of dimensional 'tumbling.'  And that (hopefully) someone would 'tumble' into my chassis.</p><p>Even with the small amount of sage I took that time, my world's Local +Y was far from constant.  I pulled myself slowly up into a sitting position, feeling the cracks in the couch's dimensional patches shifting underneath me.  I stared in disbelief at the floor as the same patterning of sliding like a huge, number-puzzle with extremely elongated pieces shuffled itself about before my eyes.  I could look down between the pieces, seeing how they interconnected with each other when perfectly 'seamed.'  It was uncomfortable to watch, so I focused outside, where the trees were exchanging branches. (As open-minded as I am, I found this even harder to watch.)</p><p>Returning my focus indoors, I noticed that though this 'trip' was not as reality-fragmenting as the first one, it was still quite powerful, and without warning, found myself pulling my consciousness from the patterns that made up a desk in some sort of school or holding area for 'travelers.'  'Its OK class... Just give him time to adjust...'  I swear, that's what the disembodied voice said as I struggled with pulling bits and pieces of my consciousness back as they slid and shuffled along their unsettling conveyer-belt pattern.</p><p>I yanked myself up from this 'reality,' and found myself dropping too easily into a reality where I was on my knees, outside, in a wet, dimly lit, narrow city alley.  Some girl had her arm over my back and was asking me if I was OK, what it was I was seeing.  A pipe split and shifted along with everything else 'inanimate,' momentarily forgotten on the asphalt glistening with a kind of neon I've never seen before reflecting from its surface.  (I'll give the girl credit.  She began reminding me who I was, just as the 'sitters' are instructed to do.  I fought away again.  I didn't want that life.</p><p>Several other focal points, bodies, lives...</p><p>I had to remember which direction was my 'Up.'</p><p>I had to remember which direction my own 'Up' was... I had to remember how much I enjoyed my own world, my own friends, my own canine companions, my own family...</p><p>'This is my 'Up.'  I said aloud.  Remembering and forcing through sheer ascertain that what I had once knew as certainly as night and day was indeed still, my 'Up,' and that lead to a settling in of the other Vectors as well... Depth, Width, Time, i, -i, etc.</p><p>Now, I was pissed.  (I was also more than a little scared, but I channeled that fear into indignance.)  </p><p>'Don't fight it.'  I remember reading in several 'guides' to Salvia.</p><p>On idea is to have a 'sitter' present, and have them repeat to you who you are if you start to 'freak out.'  (Or, as they DON'T tell you, if you find yourself as someone else, or if someone else finds him/her-self as you.) Have the 'sitter' keep you from wandering if you 'disassociate' from reality (as in what Salvia 'experts' have classed a 'Level 5' experience).</p><p>My approach is not to start with small bits and work my way up, but to jump right into the deep end and learn to swim... (close paraphrasing)  ...I won't be afraid of the milder experiences and never have a Salvia 'Breakthrough.'  (Now, funny that no one actually came out and said exactly what that 'Break-through' actually was -- or what it was one was breaking through.)</p><p>You may see patterns, visit other times, worlds, planes or planets...</p><p>You may feel like you've lived other lives...</p><p>'My wife reported that I was saying 'help me, help me, this is not my life.' ... She says I asked her 'where am I...who am I.''</p><p>...It felt as if everyone who has ever done Salvia was there...</p><p>...It was like Jody Foster's journey in 'Contact.'</p><p>It's not like any hallucinogen you've ever tried...</p><p>It is not like anything else you've ever tried...</p><p>You may find yourself merging with a wall...</p><p>...found only in one small part of Mexico... rarely produces seeds, even when carefully hand-fertilized...</p><p>Not a party drug...</p><p>Don't do it in public...</p><p>All I could think in response to these bits I'd read from research on Salvia was, 'Yeah.  No shit.'</p><p>To me, it seemed that others had experienced varying degrees of what I had experienced (and bear in mind that I had only done a tiny bit of the 'recommended' dosage).  To me, the entire experience seemed to be far more... 'mechanical' (for lack of a better) than 'organic.'  It seemed much more than an hallucination an organic mind could create, and re-create.</p><p>The second 'trip' helped me to remember what had happened in the first, helping to solidify conjecture by more-or-less exactly following the patterning of the first experience.</p><p>But what really helped, was to call a friend also schooled in the ways of Physics, and Metaphysics, and rant to him for a few hours. From what I've been able to piece together from re-combinating old research, shining the new light of this correlating experience upon it, I can put forth these theories:</p><p>Salvia is a tool that while it has no known receptor in the brain, disengages the primary focus (spirit) from its chassis (body), whereupon it can/may find itself drawn to a similar resonant experience (someone else in that 'moment' of the Salvia experience) and can (semi-permanently) 'dock' with that other chassis, until Salvia is used again to cause the Soul's linkage within Dimensional Recombinations to break, allowing it once again, conscious access to the people and pathways linked by Salvia usage.</p><p>In this view, Salvia could indeed be seen as a transport for the Consciousness (perhaps more?) between unknown distances.</p><p>Would I recommend it?  Only if you are OK with the possibility of being someone else -- perhaps never again 'finding your way' back to the you, you lived up to this point (not to mention what of the 'holding areas,' the feelings of those waiting to slip into me when I 'fell through the cracks.'</p><p>And yes, there are warnings all over about Salvia being used responsibly, by intelligent adults, having read and understood the FAQ, and the User's Guides.  And if this little 'trip' was simply my little abhorrent experience pieced together from my science background, then there quite possibly could be little left to 'warn' folks about.</p><p>However... If my experience is common to folks who haven't rationalized the experience into visions, colors and patterns...  (I keep thinking about the admonition that you might feel like you've lived entire other lives -- what if that was the 'you' where your Spirit 'came from' and you're only buying into the information stored in the Local brain's databanks, reinforced and aided by the 'sitters' as you dock with another body!)  Then a lot more prep for 'travelers' needs to happen.</p><p>I look at it this way:  If this experience is 'off the wall,' then cool, it makes great fiction, an interesting read, and perhaps a screenplay somewhen down the line.  If it is 'straight up,' then... Someone's got to prep folks about possibly finding themselves actually traveling (being forcibly and roughly sucked) to another plane TO LIVE AS ANOTHER PERSON UNTIL THEY USE SALVIA TO 'ROLL THE DICE' AGAIN.  (And to make mention of the physics that theorizes that in another Combination of Dimensional Vectors, the 'stuff' of the Universe you know as 'you' in this Combination, could very well be anything at all, 'animate' or otherwise...  It would take the edge off of finding one's self existing of Dimensional Pattern (slices?) that exist and flow through 'inanimate objects.'  ... That is until (or if?) you find a new Salvia-cleared body in which to 'Live...')</p><p>...</p><p>And concerning the experience... what does it matter if what I perceived IS 'real?'  What then?  How can that information about Dimensions and 'reality' and how our consciousness 'docks' with these 'chassis,' be practical?  Or is the 'reality' of it relegated to the pile of 'unused science,' that is a nifty parlour-trick, but that has no practical application.</p><p>I suppose Max Plank, Niels Bohr, Hiesenberg, Schrödinger and the other great minds wondered the same things when they spent long years trying to disprove their mathematical models that pointed toward a vastly different view of the 'Universe' than Euclid jotted down.  </p><p>But what of it?  </p><p>I now feel like 'religion' (organized or otherwise) is pretty darn silly, in the light of the actual 'fabric' that binds 'physical' laws we don't yet comprehend.  (And yet... had my own 'beliefs' and practices in my own ways made me strong enough to stay the 'me' I grew-up as -- and did I really?)  This felt much more 'physical, measurable reality' than kneeling beside a bed with hands clasped fervently before a bowed head.  This felt much more actively measurable than 'praying' to a faint resonance impression within a collective unconscious.</p><p>And what of it?</p><p>(It's like the phrase, 'OK.  So?  You're Enlightened.  So what?')</p><p>With memories all we have to hold onto to define our 'reality,' if your Consciousness finds itself in another vessel with a complete set of memories, do we ourselves change?  What defines, 'Us?'  Is it our 'Conscious?'  Is it our 'Un-Conscious?'  How do these interrelate as they move this bio-machine we call a 'Living Being?'</p><p>It sure seems that a lot of experimenters with this singular sage have had similar experiences.  And so, I can only conclude that either this mysterious chemical, 'Salvinorin A' (which has no known neuro-recptor) can elicit similar (if not startling identical) experiences (I sincerely hesitate to call the experiences, 'hallucinations').  Or, this is a tool, 'conveniently re-discovered' at an approaching time in our planet's evolution where all the pointers hidden within ancient beliefs say that something 'big' is going to happen.  What is its purpose (aside from enabling people to be 'cosmic swingers')?  Is it really a 'transport' device between Dimensional Conbinations?  Is there a way for a 'traveller' to retain his 'original' memories and sense of self for the benefit of the world he now inhabits, or are memories simply the perks of having a brain?  (I get the feeling that through learning to focus one's Un/Conscious that one may be able to retain 'past-life' data well -- certain practices of Buddhism advocate practicing, through focused meditation, 'dying' so that when the soul doesn't get 'lost' through the process of 're-incarnation.')  </p><p>What will its careful, intelligent and ethical study reveal -- on the personal-reality level, and on the global 'hard and fast facts' level?  Will explorations of consciousness lead to being able to explore with physicality?  Will 'travelers' who can retain their 'other lives' help us with math/physics that are currently beyond our scope?  Will we do the same?  Or is this, as in 'Contact,' simply a way, through traveling only with one's Consciousness, to make the vastness of the Universe not seem so empty?</p><p>It will be interesting to see what happens.</p><p>--Explorer</p>"
}
