{
 "title": "Metro Hearse",
 "author": "CountVonCrap",
 "citation": "   CountVonCrap. \"Metro Hearse: experience with 5-MeO-DiPT (ID 16087)\". Erowid.org. Aug 7, 2006. erowid.org/exp/16087",
 "substance": "5-MeO-DiPT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "13 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16087",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 7, 2006",
   "Views: 2899",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>This experience happened out of the blue in my suburban town in Jersey. A good pal called me out of sleeping state at about 1030 in the morning to ask me if I wanted any Foxy that his good pal had recently acquired. 20 bucks for a 20 milligram pill. </p><p>At ten in the morning I had no money to my name because of a night on the town the evening before. However, come lunchtime, the mail came and I had gotten my tax refund check from the government, worth about a hundred and twenty bucks, destiny I suppose. So I called up my friend and arranged a purchase of 40 milligrams of this truly exotic chemical.</p><p>I called up my drug friend of choice and told him I got two of these pills. He jumped at the opportunity to try it, unfortunately he had one of his friends over who also wanted to try it. So the forty milligrams we had was divided amongst three of us, and than ingested at approximately 530pm, I ingested at about six because I had to drive and didnt want to get pulled over as the foxy was about to kick in.</p><p>We were experiencing our first foxy-trip in a not-so-sleepy college town. The three of us went into the woods where we used to smoke a lot of pot. When I first noticed the effects, I was one of the first to feel them surprisingly enough, I hated them. I felt like pure shit, I felt like I was gonna puke every ten seconds. I repeatedly turned down the marijuana that was being passed to me, every hit off that pipe brought me further to a very unpleasant pre-vomit feeling. </p><p>After the sickness feeling was over, we went for a walk to a field that was about a hundred yards away. The walk seemed like an eternity, as I began to feel a very prominent, indescribable feeling. This feeling was amazing, superior to most of my first times on psychoactive substances. Minor visuals took place at the peak of my experience, mainly the clouds were spelling out words, and I saw some weird colors that I had never seen before in the trees on the other side of the field.</p><p>We walked around New Brunswick aimlessly, obviously 'fucked' up to anyone who might have drove by us. Under the influence of Foxy, we all got this intense craving for food. It was the worst(I lie, one of the worst) cases of the munchies I had ever encountered. So we went and got something to eat at a fine little pizza establishment. </p><p>All of the sudden, it was about 10 at night, and we went to my friends work to smoke a few bowls with him(at this point smoking pot did not upset my stomach like it did in hours past). Smoking Pot made me feel much better now, it helped the feeling, previously mentioned, in my body intensify. At about 8 hours or so after dosing, the feeling was gone, and I drove back to my house to go to bed.</p><p>All in all this was a fine experience for us all.</p>"
}
