{
 "title": "Basically Normal, Except Extremely Good",
 "author": "MToDaS",
 "citation": "   MToDaS. \"Basically Normal, Except Extremely Good: experience with Mushrooms (ID 16082)\". Erowid.org. May 2, 2005. erowid.org/exp/16082",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2.3 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16082",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2005",
   "Views: 3636",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI will try to give the most complete description I can give about me first mushroom experiance. I'm 16 years old, female. My friend Jane is also 16 years old.  I have experimented with only alcohol and pot before.  I would call myself very inexperianced with psychoactives. At the time, I was taking St. John's Wort just because I had been feeling crummy lately.\r\nMy friend ran over to my house at around 1.  I whipped out the bag of shrooms (an 1/8 of an ounce) and we simply ate then plain, Chewed on them and swallowed. The mushrooms, I suspect were of poor quality. The caps were very small and most of the bag was composed of crushed caps and dust. Oh well. We both found the to be fairly good tasting. I ate about 2/3 of the bag and she ate the rest. Looking at our piles it was very clear to see that I had much more than she did. I was really excited, expecting an incredible experiance.  My friend was tired from the run over, and didn't seem as apprehensive as I was.\r\nWe began to walk to her house which was two miles away. We had no idea what to expect at all.  Every couple minutes we would check for eye dilation or anything physical signs out of the norm because her parents were at home. \r\nWhen we were almost there, she was telling my how heavy she felt.  She said her hands and feet felt like rubber.  She kept staring and moving her hands around. She told me that they were huge. I wondered why nothing was happening to me yet.  We approached the base of her hill ( my friend lives on this huge hill!) We looked up at it in awe.  It seemed so big, and the trees on top of the hill seemed so tall and old and wise.  It looked like a fairy tale picture. \r\nBy now, I felt different. I'm positive I wasn't tripping but I felt different in a way I couldn't explain.  I was mush less aware of my surroundings, just walking. The walk to her house seemed to take no time at all.  My friend could hardly walk up the hill and she said it took great effort.  When we got to her house, we manuvered by her parents fine and went into her basement to watch a movie. We both sat on the coach and watched a movie. It was really funny and I felt like I was laughing in slow motion, but I didn't really want to watch the movie.  My friend completely stopped talking to me.  I looked around the dark basement at different objects, and everything, the walls the furniture, looked like it was breathing. ( if that makes any sense) \r\nAfter the movie we went out side. It was BEAUTIFUL! It looked like a story book. The colors were so bright, the sky, her lawn, the flowers, everything was so pretty. \r\nJane said me 'I figured it out! I couldn't quite tell what it felt like, but it's like we are on tv! See the screen!'  (and I just laughed at her. I thought it was so cool how she was tripping.  But I really didn't feel anything special. I was felt relaxed, everything was good) so I asked her where the screen was, and she pointed into the sky, and I just laughed at how cool the idea seemed. But she thought I was making fun of her and she got really depressed.  We just chilled on her lawn, honestly I was happy just sitting there with her.  She got very depressed though. I wanted her to explain what she was going through. \r\nShe said that, we were all in big domes. And she got mildly upset that I couldn't see the domes that were so apparent to her.  She said that there were people outside of the domes that were controlling us and laughing at us. Then the people turned into robots.  She said she couldn't actually see them but she could feel them.  Her 5 little bothers and sisters kept running up to us. We were supposed to be watching them.  They kept demanding things, and she said she felt powerless.  When they talked they did seem very powerful, and it was like we couldn't do anything about it.  Her youngest sister, who is four, went up to jane and said something. Jane stared back at her for a couple minutes and said, 'are you god?'. To me, her sister seemed very evil, and she kept laughing, but it was very entertaining to hear her laugh and talk about nothing at four year olds to. \r\nI ask jane what was happening now and she said that half her lawn turn black and white.  I asked her what half. Then jane drew a line in between us, saying that on my side it was colorful, and on her side it was black and white.  She seemed very depressed. So I said 'get the fuck over on my side!'  We went up to her pool deck and lied down in the sun (it was a gorgeous day) and she was crying and telling me that the domes were getting small, she said that the dome was around her house now. And pretty soon, it would only be around her family, then only around her and me, and then eventually only around her.  She was crying, so I told her...'well damn, I'll be in the dome right next to you, you can call me anytime!' and she said she couldn't.  \r\nI couldn't believe how hard she was getting hit.  I felt basically normal, except extremely GOOD! So I talked to her and tried to make her feel better.  We talked about her family and alot of things she had on her mind. At no point was she tweaking out though. When we were coming down she apologized for not talking to me before, and telling me to go away. She said that she couldn't talk because she had no control, and talking was just so overwhelming for her at the time. \r\n I went to the dentist at four, still tripping a little. My mother picked me up and I had no problem talking to her.  One thing jane and I talked about was our mothers. It made me cry thinking that my mother hated me and then jane told me she didn't and somehow she showed me that my mother didn't hate me. Since then I haven't had negative feeling about me mother and I talk to her much more now.  I feel like our relationship is better.\r\nWhen the dentist gave me novacaine, I started cracking up (laughing) I thought it was histerical. After I went back to my friends house, as I promised I would, and we just chilled.  The come down was awesome. After it totally wore off, I felt great! There was no hang-over effect at all!!!  With pot, I had gotten extreme depression and mental cloudiness for 2-3 days after being high.  It left us both with a sense of wellbeing. \r\nI was surprised when jane told me that she loved the experiance and wanted to do it again, because it seemed like a miserable time for her.  We both are in love with this drug, and are so glad we found it. We don't have the desire to drink anymore, and we both hate smoking weed.  We decided it is the 'best drug in the world'. I can't wait to do it again.\n\n\n"
}
