{
 "title": "Heart Pounding and Blackout",
 "author": "Chris",
 "citation": "   Chris. \"Heart Pounding and Blackout: experience with Cannabis (ID 16095)\". Erowid.org. May 2, 2005. erowid.org/exp/16095",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 16095",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2005",
   "Views: 5046",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been smoking pot for almost a year now. I am experienced and usually have an enjoyable time when I'm stoned.\r\nMy first bad experience with pot was on a friday night. I waited for my parents to go to bed and I snuck out to my porch and smoked about 1 bowl of medium quality weed from a bong. At first I felt very pleasent and very euphoric. But when I walked inside everything went into a downward spiral. My heart started to race. I put on the band 'Phish' on my cd player. The music just made me confused and made me panic even more. I got very disoriented and I couldn't sit still. I started to walk around my house aimlessly. I felt my heart rate probably every couple minutes. It was pounding so hard I could see my fucking chest go up and down. I thought I was going to die. From here on it only got worse. I don't realy remember much. I must have blacked out because I woke up laying down in my bathroom with my sister asking me what I was on. Then I kinda just came back into reality after she asked me that. The rest of the time I was stoned I just chilled and listened to some tunes. This all took place over about an hour and a half. \r\nThat was a wierd experience because I have never gotten that paranoid when I'm stoned. But now that I have started to smoke more it seems like I get paranoid more often instead of a nice euphoric feeling. What the hell is this all about?\n\n\n"
}
