{
 "title": "Sexual Side Effects? Woah..",
 "author": "Skipper Zipp",
 "citation": "   Skipper Zipp. \"Sexual Side Effects? Woah..: experience with Paroxetine (ID 16113)\". Erowid.org. Dec 8, 2004. erowid.org/exp/16113",
 "substance": "Paroxetine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Paroxetine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 16113",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 8, 2004",
   "Views: 27849",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSeveral months back, I was with a girl who had found that Paxil worked well for her particular imbalance. She and I were and are both habitual potsmokers, usually smoking on a daily basis whenever possible. I've experimented occasionally with other things, such as acid once, and a few other antidepressant/antianxiety drugs (seems like most of my friends are on scrip meds). Zoloft made me uncomfortable and gave me a headache. Welbutrin was a funny story in itself, but that's for another time.... <br>We had a very loving relationship, and this was probably midway through the year that we were (mostly) happily together. We've since separated, but from now on i'll take the 'sexual side effects' comment on all of those medicine ads a lot more seriously. <br>The story goes as such.. One day, I forget exactly how, she convinced me to try one of her paxil (it wasn't difficult). She/we probably reasoned that since I am relatively balanced, it might give me some sort of high. Well, that was not the case, or the dose wasn't right anyhow. We were probably high on grass for at least part of that day, but I can't remember specifically.<br>However, a few hours later I discovered my sexual side effect of paxil. We were fooling around as usual, and all seemed normal for a while. I don't recall any special difficulty or ease in becoming aroused.. Things seemed normal. Being a mostly healthy young guy, getting and sustaining an erection wasn't a problem. What was unusual was my inability to achieve orgasm. The sex was still pleasurable, and the duration was unbelieveable. The spirit was willing, and flesh far from weak, but still no dice. <br>Try as we both did to remedy the questionable problem, we eventually gave up to (less) frustration and (mostly) fatigue. This effect was also noted to diminishing degree over the next two or three days. Since then, things have been more or less normal. I've not since repeated the experiment, but have considered keeping a few paxil around, for future research. <br>As i've said, i've never been prescribed anything aside from the occasional antibiotic or codeine cough syrup, and have never messed with things like MDMA, so for all intents my brain chemicals shouldn't be too abnormal. I don't know if this would work for most or even many others, or even again for myself, but I thought I'd throw this out there.\n\n\n"
}
