{
 "title": "Different Methods",
 "author": "mycophile",
 "citation": "   mycophile. \"Different Methods: experience with Mushrooms (ID 16126)\". Erowid.org. Sep 12, 2005. erowid.org/exp/16126",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 16126",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 12, 2005",
   "Views: 18018",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSome may say that smoking mushrooms will do nothing to you, but my friends and I have definitely experienced the opposite.  Though smoking them is nothing like having a strong trip from eating. Mushrooms have a taste that is fairly tolerable when eaten, but when smoked they create a nasty viscous smoke.  After a few smokes, however, I hardly notice; especially if using the correct device. A particular friend of mine is somewhat of an exhibitionist with this sort of thing, and for a period of time we were smoking mushrooms every weekend.  We had 4 devices from which to smoke, and they were the following:\r\n1. An average glass pipe,\r\n2. A light bulb with the end knocked out,\r\n3. A 2 chamber acrylic water pipe,\r\n4. and a 3.8L bubbling gravity bong.\r\nOf course, we tried them in the pipe first.  Though my friend's basement wasn't exactly a romantic setting, the 3 of us had previously made a habit of ingesting hallucinogenics there, and it was a fairly comfortable atmosphere.  We knew the mushrooms would taste horrible, but we set in anyway to see if it would work. My first impression was coughing and gagging, but I learned how to roll the smoke over my tongue, and take measured tokes.  After a while (and this is strange to say, but it will make sense to those experienced in hallucinogens) the smoke had a nostalgic and remarkably *purple* flavor.\r\nThe next weekend we decided to try the light bulb, which we had previously used for vaporizing herb.  This was quite an efficient method, but since the vapor collected in the bulb and stagnated as we tried to suck it through a tube without gagging, it wasn't much of a pleaser.  On one occasion, my friend took too large of a rip and ended up vomiting during a coughing fit.  I don't recommend this at all.\r\nThe next was our most usual method of smoking; the acrylic bong.  This gave smooth, measurable hits and never caused anyone so much as a coughing fit.  Although the smoke doesn't taste nearly as (i hesitate to say 'palatable') purple, it is easier to manage.  \r\nHere's the doozy.  The 3.8 liter bubbling gravity bong we fondly dubbed as 'Grav' (how creative).  When fully loaded with a healthy, heaping mound of spores, Grav could easily fell an average Pro Wrestler.  We had to resort to 'halfsies.'  However painful the coughing fits, however grody the taste left in my mouth, this method is entirely worth it.  While the glass pipe and acrylic bong gave a mild, cerebral high, not unlike coming up onto a mushroom trip, Grav kicked me into something like the subsiding of a full-on trip.  \r\nSmoking mushrooms is definitely not like eating them, but it was definitely worth trying.  The high lasted 2 hours at best, when I first started.  There's nothing like a few spores on the top of a bowl, but it is definitely an acquired taste.\n\n\n"
}
