{
 "title": "A Vacillation from Seclusion to Normality",
 "author": "Kool-Aid",
 "citation": "   Kool-Aid. \"A Vacillation from Seclusion to Normality: experience with AMT (ID 16168)\". Erowid.org. Jul 21, 2002. erowid.org/exp/16168",
 "substance": "AMT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "AMT"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16168",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2002",
   "Views: 6536",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis was my first experience with any psychoactive substance.  Being blessed with stubborn, innate characteristics I feel that AMT's will not be able to effect me.  Around 4 PM, my two friends and I decide to orally ingest 25 mg of AMT.  We wait around for about 2 hours, hanging around my friends house listening to music and watching tv.  Shortly after, we go outside and smoke a blunt on his patio.</p><p>All of the sudden, BAMM!, im looking up at the sky watching the clouds coalesce into intricate and insanely convoltuted patterns.  This was the first sign that I was truely tripping. Along with these visualizations, I was inundated with an 'MDMA-like feeling' which was characterized by a very powerful rush. I continue to feel the intense effects of this crazy, wild, and somehow drug.  Around 8 pm, a few of our friends come over and I feel as if I can't trust any of them, and that their motives are sinister and malicious.  I feel that they cannot relate to my two friends and I because they are not tripping.  They are in fact 100% sober, and are just beginning their alcohol inebration for the night... (wow, big fucking deal compared to this highly potent, virulent, psychoactive chemical that is mind-fucking my brain.)</p><p>It is analagous to a computer hacking another, only the drug is hacking your brain.  The social disturbance gets so negatively prevalent that I must 'get away.'  I decide to venture out across the street to chill out and tell myself that it is, 'just the drug' and that I am in fact normal, and in control. I guess this has a lot to do with the fact that it is hard to remain still, in a claustrophobic, confined environment when you are on these drugs.  After this, I go back to my friends and chill on his couch outside. We continue to smoke blunts, where I find that I am sweating profusely.  This scares the shit out of me because my teeth are chattering uncontrollably, and my skin is 'snake-like.' About a half an hour later, the trip gets better and for the rest of the night I enjoy it. I am not going to bore you with more details, but throughout the night the trip gets a lot more pleasant, and I start to see more visuals.  The level of consciousness attained via this drug is mind-boggling.  I still honestly feel that I cannot relate to people who have never induced any psychoactive substance.</p><p>My downsides to this drug include:  inability to sleep, nausea, aversion to people who are not tripping.  I recommend that people try this drug because you will realize a lot about yourself, but certainly be responsible and know your limits.</p>"
}
