{
 "title": "Look Before You Swallow",
 "author": "Mouth",
 "citation": "   Mouth. \"Look Before You Swallow: experience with LSD (ID 162)\". Erowid.org. Aug 9, 2001. erowid.org/exp/162",
 "substance": "LSD",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "9 hits",
   "oral",
   "LSD",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "162",
   "Not Specified",
   " ",
   "Not Given",
   "Aug 9, 2001",
   "Views: 25420",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is an account of what was the worst trip of my life. I went to a rave with a friend. On the line to get in, we were chatting with this kid from Ohio who had geltabs for sale. I indicated that I wanted to purchase, but should wait until we get inside. After we got in, I found my new friend and paid him for two black gels. This kid wasn't very slick, he sat down in a corner and took out a rather large sheet of geltabs. Having never taken geltabs before, but having used paper 9-10 times, I thought that I could handle two. All of a sudden, a cop started walking straight in our direction.  The dealer, who was tripping freakin' nuts, rips a good amount of that sheet and shoves it in my hands. I immediately threw it into my mouth and swallowed it. </p><p>After about 20 minutes, it started coming in heavy. REAL heavy. I went to the chill area to eat a pretzel and drink an iced tea. I couldn't swallow the pretzel and would spit it out into my hand. I was then talking to this guy from NYC named Vic, who asked me how much acid I took. I said that I probably took about 9 or 10 doses at once, and that I was freaking out hard.</p><p>After that, I went to the stands and had a seat, eating a giant pixy stick and smoking a cigarette, because I was tripping far too hard to be dancing or anything. I then blacked out.</p><p>The next few hours are a muddle...I don't remember much other than screaming 'Kill me' to the nurses, taking a leak, or knocking over some no doubt expensive piece of machinery.</p><p>It turns out they had to sedate me.</p><p>I awoke the next day still tripping. This time is still a muddle...I don't remember much because it was so fucking wierd and beyond my comprehension. I don't know whether I was dreaming or conscious. I stared at my hands for what seemed like hours, and the doctors and nurses made fun of me. </p><p>Next memory was me awakening in a different room a completely changed person. I could tell.  My mom had to drive an hour and a half in late June to come pick me up from the hospital. I have never seen her so angry in my entire life.</p><p>The Tuesday after, I had appendicitis and went to the hospital, where I stayed until Friday.</p><p>The flashbacks never stopped until about two months after that bad experience. Everything triggered them, from just staring at my hands in a certain way to hearing certain phrases.</p><p>I will never take acid again, and I am glad for this. I was (and still am, after five months of psychotherapy and antidepressant medication), at least a little, cut off from reality.</p><p>The moral of this story is to ALWAYS look at what you buy before shoving it in your mouth.</p><p>peace.....</p>"
}
