{
 "title": "A Very Interesting Potion",
 "author": "Bogbubble",
 "citation": "   Bogbubble. \"A Very Interesting Potion: experience with 5-MeO-AMT (ID 16213)\". Erowid.org. Jul 23, 2002. erowid.org/exp/16213",
 "substance": "5-MeO-AMT",
 "bodyweight": "207 lb",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "oral",
   "5-MeO-AMT"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16213",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2002",
   "Views: 14157",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWhen one comes across a substance such as 5meo-amt, or any chemical which the dose is in the 1-50 mg range. One must be extremely careful about how much they ingest. </p><p>I received 50mg 5meo-amt, of this amount I was sure as a friend had measured it exactly. This 50mg was then dissolved into 10ml of 190 proof alcohol, and drawn up into a syringe to be dosed in 5mg increments.</p><p>It was a friday and there was a widespread panic show that a friend from out of town was on their way to see, so I decided it would be a good night to try the 5meo-amt. I dispersed 1cc(5mg) of the solution onto a Honey Made graham cracker and ate it.... I had not eaten anything all day.</p><p>Not knowing much about what I would experience, I developed a bit of that anxious feeling deep in my gut, it was nice. Within 10min I was feeling a small energy creep up my spine... I thought this was unusual at first, but have now decided the alcohol aided absorption.</p><p>About +30 min I am really beginning to feel the drug come on. I could feel it throughout my nerves, much like stimulants such as cocaine, meth, mdma, or even adderall. Only my heartrate was semi normal for me at 105 (other stimulants send my pulse much higher).  Morningloryseed suggested a bowl of cannabis, so I began to load the bowl.</p><p>At about +110 min I look up and realize I havent been loading the bowl I've just been playing in the weed tray, I had a very distinct feeling now throughout my whole body. Mental effects were hardly noticeable. </p><p>When I finally hit the bong, it definatly changes the whole trip. The typical visuals were present, slight warping and letters began to trail away. After about five min I have to get up from the computer as looking at the screen causes a very intense vertigo at this point.</p><p>At 140 min I find myself clearing my entire house top to bottom, I feel like I'm coming off of acid, like the next day after a trip when your still going but nothing to do. Not so much like meth cleaning where you just cant help yourself. I simply didnt feel like being entertained at the time.</p><p>By now it was getting late and I had still not heard from my friend, so I called his girlfriend to see what was happening. Well he was arrested for possession of less than 2 ounces in a small Texas county, and had to go back to his home town, considering he was well over his concert budget, he called it quits, and so did I.</p><p>I took 100 mg diphendramine, and 3 Shiner Bock beers. was asleep at +7 hrs....</p><p>The Next day I placed 8~ of the solution onto a bowl of marijuana.</p><p>My best friend and I each took a hit after it had dried.</p><p>We both decided that we felt somewhat intoxicated for just one hit of weed, but it was a failure.</p><p>I look forward to further experimentation with this chemical, it is very promising as I did not experience any side effects the entire time. and its nice to be able to go to sleep.</p>"
}
