{
 "title": "Best Visuals I've Ever Had!",
 "author": "_-Seven-_",
 "citation": "   _-Seven-_. \"Best Visuals I've Ever Had!: experience with DXM (ID 16239)\". Erowid.org. Oct 27, 2002. erowid.org/exp/16239",
 "substance": "DXM",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "710 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16239",
   "Male",
   " ",
   "Not Given",
   "Oct 27, 2002",
   "Views: 9316",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI think this one is worthy of post. Some of you may remember me from my DXM Overdose report, well I guess that didn't teach me, aye? I did DXM again for the first time in a long time, since my overdose. The times are estimates.</p><p>1am: I drank a 12 oz bottle of Robitussin DM which contains roughly 710mg of DXM, strait down in one shot on an empty stomach. The experience was great and had, no shit, LSD like (but somewhat more interesting) visuals, which i had never experienced from DXM before!</p><p>1:45am After about 45 minuetes of drinking it, it began to kick in, heavily, so I got off my computer and went to lay down with my eyes closed... </p><p>2:30am I got up and managed to get back on my computer and chat on IRC, but with one eye closed considering I was seeing 2 of everything. By this time I was dexxin, but the best was yet to come</p><p>3am: I lay back down... I don't remember alot, but I sunk deeply into a dreamlike state of mind... but was not sleeping. I moved very seldom, could, but didnt wish to. By this time it was standard (high dose) dexxing as I remembered it. The night went on and I moved very little, and did not fall asleap once, but was in a very very deep state of conciece dreamlike thought!!! It was completely amazing. I thought about everything that was going on in my life in more ways possible than with the sober state of mind. </p><p>Time is irrelivent now: I came out of my dreamlike state for a while, and went to the bathroom. My god I was obliviated!!! the real world was bearly here for me, and my motor functions were bearly there, i felt like a robot. I came back to my room and lay back down. This is when I began to realize the hallucinations! at this point they were controlable by me, and in my new form of thinking I began rearanging the objects in my room, and replacing them with new alien ones! I closed my eyes and began designing web sites in my head, extremely vividly! And the HTML code as well!!! </p><p>As time progressed and I realized morning was coming I also realized I was anything but myself. Disassembled and waiting to be reassembled! I had done alot of automatic soul searching and came to realize alot of things! As I became reassebled(sober) I took in my environment, slowly become aware of where I was living, who i was living with, and people i needed to show thanks to. Throughout the night I became completely convinced that I need to start 2 computer stores, 1 in my hometown, and one in pittsburgh. I cannot express how vivid this was! Everything started becomeing mapped out in my head, how i would get the money to do it, everything! even what specific stock i would carry, all in this obliviated(or not so?) state of my. People tend to think of high doses of DXM as non-thinking, but i beg to differ, my brain was most deffinatly operating on more intence levels of thought, at much rapid speed, than normal.</p><p>I got up a few times unable to function physically so I lay back down. When I finally got up at ~9-10am is when, as i started to sober and physically function normally, I began to realize how amazing the open eye visuals were!!! I experienced swarms of warm color that would drift toward me, and an amazing cyclone of unexplainable vivid color in the most amazing cosmic shapes!!! a complete 3 dimentional hallucination, whereas most LSD hallucinations for me tend to be 2d, these were 3 or 4! I attempted swatting some of them and some would particalize and break away beautifully! Most hallusinations would materialize distant, and warmly come closer to me. The neat thing about them was that I felt completly at home with them, not bothered, as if they were completely normal, or even more normal than the 'real' things i was seeing. </p><p>I had taken no other substance within 7 days of this experience, and i would like to note that for those seeking visuals with DXM, to wait a LONG time, then use a high dosage, although dangerous perhaps, very well worth it. If you are inexperienced with DXM do not try this! work your way up and gain familiarity with the substance then give it a try. Ive never experienced visuals like this in the past! Scratch that, I have, but not open eye, and not so colorfull. Ive had great fun with closed eye visuals, and even worlds, but as soon as i had opened my eyes it was same old double vision. I loved this, and choose the experience over LSD.</p><p>Enjoy and be carefull and safe!</p>"
}
