{
 "title": ".3 PPM of Our Air",
 "author": "just footsteps",
 "citation": "   just footsteps. \".3 PPM of Our Air: experience with Nitrous Oxide (ID 16291)\". Erowid.org. Aug 5, 2005. erowid.org/exp/16291",
 "substance": "Nitrous Oxide",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "4 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16291",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 5, 2005",
   "Views: 20961",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I used nitrous when I was about 15, for several months, because it was the only drug I was cool enough to get my hands on.  I thought it was amazing then, but was scared off by reports of oxygen deprivation and had only done it once, whisking an LSD trip into the far-space for the first time in my life.  Since discovering salvia, mushrooms, the mescaline cacti and many other amazing and useful tools are legal and readily available, I decided to reinvestigate those things our crooked laws WILL allow me in the exploration of the cosmic unconscious.  I recently read up on nitrous enough to allay my fears, and embarked on an adventure that has been refreshing.</p><p>The problem I always have when I try to talk about my experiences inside is that, no matter how adequately I describe my visual content, my state of mind, my insights even, there is some central point, something else that's going on apart from my interactions with the others, that I am incapable of capturing.  I used to call it 'the thing about acid I can never quite remember.'  It's some little learned skill, some thing I do with my third eye, that acts as an invitation which the universe immediately answers... To take it a level deeper... To notice another connection between things and have the connection be as real as the things... And it's connected to the breath, unhooking the breath and relaxing enough to notice it instead of trying to notice it... Like I'm calming down enough to pay attention to the wisdom that's always already built in, getting closer to understanding the point... To grasping the plot... It's just so hard to describe, but I feel it when you do it, and it's how I move off baseline, how I just AM if I take salvia or dimitri or something... If you know what I'm talking about, um, hi, nice to see you again, I love you, you're doing great; if not, don't assume I'm crazy, it's belittling and hinders us both.</p><p>Anyway, nitrous comes back to me at a wonderful time in my life.  I've been travelling all year and reached a new level of integration of all that I've learned in the midst of having an amazing, life-altering string of adventures.  My happy switch is permanently flipped and I feel very good about my life, my friends, my development, and what lies ahead.  I just returned from the gathering, made and remade many amazing friends, and was introduced to potent salvia extracts, which are the most awesome, challenging and beautiful experience I can imagine.  </p><p>I used the first nitrous containers alone, after 1 small bowl kind, lying on the grass on a warm day.  As I did the first one, I felt the pull to remember before the balloon was half-inhaled, felt myself inflating with spiritual energy to take another run at it. I bobbled my balloon and laid back, focusing on the 'train sound' feeling tones, picking them apart and putting them back together, until I felt myself pulling fast, the 'death' feeling, towards that higher self.  I opened my eyes out of concern (when I have no eyes to open, I get a little bit of the fear... Like maybe I really have died, no way of knowing at first...) And was very gently set down, laughing, in my body.  I did several more, each time remembering a little better what I was trying to do there, how the process works every time, until it reached a point where I was doing it automatically for short bursts, getting much farther than I usually do even off shrooms.</p><p>Later, I took the box over to my friends' studio and reintroduced them, to their delight.  MY delight was that I'm getting better at riding the freebie - when I'm physically close to other psychonauts, I turn on, even if I'm sober.  Whee!  (you can do it too, you just have to stop being cynical)  it feels like I can sort of see it out of the corner of my eye all the time, and if music catches me just right I can do it for a second, whatever it is I do, that little flick of the third eye over to the real-ness of what I'm observing... Etc... Is that tracers?  I think that's tracers...</p><p>My abiding impression is that this compound is the spiritual water, the prana, the good air of our universe... We have H2O for our bodies and N2O for our spirits.  If I focus during nitrous, I can ride it for several minutes and remember it for minutes after that.  Without an oxy-controlled gas mask, I won't be able to reach the outer limits, but I can go quite a ways, and it's very lucid in my experience.  The potential for abuse, especially among really enthusiastic psychonauts, is enormous.  It's over too soon and doing 'trip breath' correctly doesn't just feel great, it's amazing; my desire to go back straight-away is intense, and setting a 4-per-day limit is wise.</p><p>The effect of nitrous during a strong trip on another substance will definitely be of primary interest for the forseeable future.  I believe I could have your trip sitter give me a balloon of nitrous if I knew to expect it beforehand, even under salvia, and the results could be stellar.  Nitrous is a great reminder, a 'reality check,' and in that capacity is good for me, a valuable vitamin in our war against the robots :P   just don't lose your head!</p>"
}
