{
 "title": "Watch Your Ticker!",
 "author": "Shaft",
 "citation": "   Shaft. \"Watch Your Ticker!: experience with Methamphetamine (ID 1637)\". Erowid.org. Jul 16, 2000. erowid.org/exp/1637",
 "substance": "Methamphetamine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4 lines",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1637",
   "Not Specified",
   " ",
   "Not Given",
   "Jul 16, 2000",
   "Views: 40477",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI did meth twice.  The first time it was nearly the best drug experience of my life, for the first few hours.  It later devolved into the absolute worst, far and away.</p><p>I did a couple of little lines at about 11pm.  I thought it would be more or less like coke, but much more intense.  Shortly thereafter I was feeling awesome.  I talked and talked, feeling superintelligent all the while.  Everything seemed great and I was having the time of my life.  My buddy and I went to a nightclub where I eventually did two more little lines.  The euphoric feeling went on for several hours.  I eventually went home and went to bed at around 8am.  I knew that I wouldn't be able to sleep but I just wanted to lay down and relax for a while.  I was still feeling pretty good.  </p><p>Soon it occurred to me that my heartbeat was extraordinarily rapid.  I could feel my heart thumping in my chest without even putting a hand over the area.  When I did put my hand there I was quite alarmed.  I didn't take my pulse but I would venture a wild guess of about 200 beats per minute.  I became rather concerned but I did not panic.  Then things took a turn for the worse.  The steady, fast beat turned into a sputtering, irregular mess.  That got me scared.  Soon after that I found my self sweating and I had respiratory difficulty.  Then I felt something really scary, a pain in my left arm, accompanied by pain in the chest when breathing.  I reminded myself not to panic but this was really scary.  </p><p>I tried to ignore the problem all day long but the pain persisted in the arm and in the chest.  Breathing wasn't that easy, either.  I finally went to the emergency room at about 2 am, a little more than 24 hours after doing those last 2 lines.  I told them about the pains but I didn't mention the meth.  They gave me an EKG and told me that I didn't have a heart attack.  If it wasn't a heart attack than I certainly don't know what the hell it was!!</p><p>I didn't do meth again until years later.  I only did it one more time and I probably took less than a quarter of what I took the first time.  Crystal meth is no longer high on my list of things to do.</p>"
}
