{
 "title": "Sudden Rushes of Euphoria",
 "author": "metroid",
 "citation": "Citation:   metroid. \"Sudden Rushes of Euphoria: experience with 5-Methoxy-Tryptamine, Cannabis & Alcohol (ID 16396)\". Erowid.org. Jul 14, 2013. erowid.org/exp/16396",
 "substance": "5-Methoxy-Tryptamine, Cannabis & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "5-Methoxy-Tryptamine",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16396",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 14, 2013",
   "Views: 592",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWondering about the psychopharmacology of a substance with little known about it, I obtained a sample of 5-Methoxy-Tryptamine from a chemical supplier. The only scientifically known use for this material is as a radiation protectant.\r\nWith all trials, there was some body discomfort, specifically in the lower intestine and heart (increased blood pressure and heart rate). Most discomfort disappeared after 30 minutes.\r\nThe setting was at various apartments and also 2 hours on a train observing the sky and trees and buildings.\r\n(with 5mg, oral) No observed effect.\r\n(with 15mg, insufflated) Just above baseline. I observed a very slight increase in my base mood and found conversations to be more entertaining. Appreciation of color and detail also slightly enhanced. After consumption of Cannabis, the mood elevation was marked.\r\n(with 40mg, insufflated) Similar to 15mg dose. However, the effects lasted about 8 hours, with sudden rushes of euphoria and slight visuals. There seems to be a synergy between this substance and Cannabis, acts as a subtle enhancer for other chemicals. Like tea compared to Arabian coffee in strength. Very gentle. The 'drunk' feeling of Alcohol was also enhanced.\r\n(with 150mg, insufflated) Possibly up to a plus 1 (+) or higher. Lasts a VERY long time. Become slightly tired at this dosage level. Sleep at 12 hours was very easy. At this dosage, comparable to Melatonin in drowsiness. Enhanced the effects of Cannabis to the point where 8 hours after smoking 2 bowls, I still perceived a 'stoned' feeling. Had several friends assay 10mg doses, but only minimal observed effects. A female remarked that the sky was very beautiful and it was strange that she was noticing that fact.\r\nIn summary, this appears to be a chemical with no known human experimentation that is producing above baseline effects. Future reports will follow...\n\n\n"
}