{
 "title": "Eat your Greens",
 "author": "The Dean Joe Green",
 "citation": "   The Dean Joe Green. \"Eat your Greens: experience with Salvia divinorum (ID 16435)\". Erowid.org. Jul 27, 2007. erowid.org/exp/16435",
 "substance": "Salvia divinorum",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   " ",
   "  repeated",
   "sublingual",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "  repeated",
   "sublingual",
   "Salvia divinorum",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16435",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2007",
   "Views: 9038",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>PHILOSOPHY</p><p>First, Salvia Divinorum is a most wonderful herb -- it is a friend to humans: the fresh leaves aid in digestion, at just above threshold doses it can stimulate lucid dreaming, and at higher doses it can give its acolytes the ability to experience plant consciousness ( -- or could it be that we are merely vessels by which Salvia experiences animal consciousness?)</p><p>It is a very religious herb. It imposes its own order on the human mind, and that is very un-nerving. It can instantly reduce the very fabric of human perception into a swirly multi-dimensional floormat upon which it wipes its multi-tendriled feet before entering the 'room' to say hello. This is uncomfortable at best, and pure-terrifying at worst.</p><p>It is human catnip. In fact, some humans (and 1/3 of all cats) have no reaction whatsoever to their respective herb. I've gotten into pleasurable/annoyed hissy fits at simply the smell of the dried herb, just like my cats. My cats are mildly interested in Salvia Divinorum, and I keep my stash locked up. </p><p>It is nootropic -- ask the goddess a question, and she will re-tool my mind-mechanics to best help me obtain an answer. Not a study aid, per-se, but in the course of life, the #1 lesson I've learned from Salvia Divinorum: the universe is fucking magical and all things are connected in twisted and wonderful ways -- the inertia of collective human culture mires us from this fact, as does our own ego's desire to stay put at all costs. Salvia Divinorum cuts to the chase, and this too, can be frightening for those not ready to get on with the ill-defined act of living in the present.</p><p>Salvia does not seem to like being a diversion, a salve for the boredom/dissatisfaction affliction that plagues western society like a new fangled gout. Maybe it will show you pretty lights, suck you into the void for a brief moment, but most likely, the yerba will pass you over, instead revealing her ancient pixie/old man/woman self to those who give themselves wholly and humbly to whatever this ally wishes to teach them.</p><p>EXPERIENCES</p><p>My smoking experiences (6x enhanced leaf): The come-up feels like passing out, my extremities are numb and tingling. Salvia has its own tempo, its own rhythm. The distorted visuals pulse and dance in a joyful way. There is an intense gravity that doesn't always pull straight down, and varies from locale to locale. It feels so god awful familiar. I am reminded of childhoods I am not sure I lived. I feel bristly, like I'm being scrubbed all over by a boar's hair brush. I get angry and disappointed for some yet unknown reason -- its as if, my entire perception is torn to shreds and I'm thinking to myself 'is this all there is to the experience?'</p><p>My sublingual experiences: I bought a tiny plant which for the life of me I can't get to grow. It sheds its tiny leaves which I collect and chew on. I feel cool glowing spots on the inside of my mouth where the leaves are touching my gum. I can get a fairly subtle and buzzy reaction combining tiny leaves with my friend ganja to the point of beautiful geometric CEVs in blue and green and gold. I also become aware of energy pathways throughout my abode that twist like tree roots.</p><p>My quid experiences: a bag of dried leaves. I first try making a water extract, repeatedly boiling the leaf juice down to a tablespoonful. This doesn't work. I then stumble upon the eating experience: me and some friends smoke copious ganja, then proceed to shovel the dried leaves into our mouths like some kind of chewing gum. Yuck! It's like eating leaves out of a hefty bag in the autumn. You can really taste the medicine in the leaves! Eventually I've got a big quid going, and I eat more and more, and in the darkness, subtle patterns enfold my being, and for a couple of hours I become an old lichen covered rock in a field of oak trees -- oh how lovely to be an old rock!!</p><p>My tinture experiences: got a bag of dried leaves, and a bottle of tincture. The tincture is impossible to work with -- pure grain alcohol stings white-hot, and watering it down seems to dull the effect. So with 1/2 oz of tincture, and a couple of dry leaves, I created my own enhanced leaf which was so strong that it could be rolled into a joint (with ganja of course!) and still get me to a V or an I state.</p><p>CONCLUSION</p><p>I am of the opinion that the very BEST way to commune with the Yerba is to grow your own and quid the fresh leaves. The smoking experience, although it is very intense, does not provide the necessary context for integration. I've had some very lucid and powerful experiences with most of the methods, but my peak moments were with quid.</p>"
}
