{
 "title": "Sore Throat Reaction",
 "author": "baz",
 "citation": "   baz. \"Sore Throat Reaction: experience with Morning Glory (ID 16431)\". Erowid.org. Nov 29, 2004. erowid.org/exp/16431",
 "substance": "Morning Glory",
 "bodyweight": "13 kg",
 "header": [
  [
   "DOSE:",
   "50 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16431",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 29, 2004",
   "Views: 11509",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am completely inexperienced in regards to drugs as have never tried anything before, not even a puff on a spiff.</p><p>I've always been intrigued by LSD and decided I wanted to try it, so I asked 2 friends that are drug dealers and a friend that is quite a big time dealer that supplies to all the local drug dealers and none of these people could get hold of any LSD, so I decided I would try morning glory. I visited all the gardening shops in my area and only one sold the seeds but they only had one packet which contained only approximately 50 seeds. I had intended to try at least 200 seeds for my first time so asked the shop if they could order me 10 more packets, the trouble is they said they don't get any customers buying seeds so they will not order any more. I decided to phone the company and order some packets but they refused to supply seeds to a home address, they would only supply seeds to a business. I was quite worried about poisons so I asked the company if their seeds were coated in any anti fugal chemical or any other chemicals and was told they used no chemicals on their seeds.</p><p>I decided to buy the one packet from the shop and then ate them, I didn't swallow whole I chewed them first. I know 50 seeds wasn't much and I wanted to try a larger amount but there was only one pack so I thought 50 is better than nothing and gave it a try.</p><p>I found they tasted like nuts and didn't find them unpleasant to eat.</p><p>After 30 minutes: Developed a cough and my throat felt slightly uncomfortable.</p><p>After 1 hour: Still had a cough, my throat felt very uncomfortable and slightly sore. I started to feel light headed and slighted drunk.</p><p>After 2 hours: Slight drunk feeling still, slight stomach upset which lasted for about 5 minutes, lots of coughing, sore throat still and my throat felt swollen, I looked inside my mouth in a mirror and the back of my mouth looked very red and sore. </p><p>After 3 hours: Same as above apart from my second stomach upset lasted for 10 minutes.</p><p>After 5 hours : Drunk feeling gone but still had a cough and sore uncomfortable throat for the rest of the night.</p><p>next morning: Throat didn't feel sore or swollen anymore but still had a cough but not as bad.</p><p>Maybe I had an allergic reaction to the seeds, so I'm lucky that I only took a small dose, who knows, if I had taken a lot more my throat could have swelled up until I couldn't breath.</p>"
}
