{
 "title": "In the Arms of the Uncontrolled",
 "author": "Caspar",
 "citation": "   Caspar. \"In the Arms of the Uncontrolled: experience with Ibogaine (ID 16466)\". Erowid.org. Aug 1, 2002. erowid.org/exp/16466",
 "substance": "Ibogaine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "350 mg",
   "oral",
   "Ibogaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16466",
   "Male",
   " ",
   "Not Given",
   "Aug 1, 2002",
   "21847",
   " "
  ]
 ],
 "report": "<p>\nIn January of 2002 my friend who uses heroin and crystal meth on a regular basis(and is a full time student, how he does this I have no idea) decided that he wanted to be substance free for the second semester of school but didn't want to attend a de-tox center. We had heard things about ibogaine being good for these kinds of circumstances so we went searching. </p><p>About two weeks after we had made our decision he showed up at my door with what looked like greyish/yellowish crystals. He told me to take 350mg and considering how he has never led me astray before I agreed. He took the rest, maybe 2-3 grams. We made it to a friend's room and informed her that we would not be moving all that much for the next couple days. We arranged for friends to get us notes from class and all that good stuff. She arranged for someone to be sober and present in the room at all times.</p><p>After about an hour I started to feel a great pain in my heart, not unlike the pain you feel when you attend a funeral or hear of someone's death. This feeling spread like fire all over my body and engulfed my vision. Soon, I was lost in a world of visions that were taking place far away, in many different parts of the world. The eyes of a million people were on us as we tried to function normally. Ibogaine seems to come over like waves of consciousness. We would attempt to get some water and find ourselves unconscious on the floor of the kitchen several hours later never having reached the sink. About 3-6 hours after ingestion I was starting to come down and I was welcomed back into reality in the comforting arms of a good friend. My friend was gone for two more days. We watched him carefully and he was sick often, sometimes screaming at the top of his lungs for hours on end. The pain in his voice was intensly evident with each outburst. After his experience, he told me that he really appreciated that I had done it with him, as if I had in come way, absorbed some of his pain through the experience. He didn't touch heroin or crystal for the remainder of the semester and what's more, we had many great experiences in a world we were somewhat unfamiliar with: reality. His words after coming down: 'I'm just starting to find my place. I think I want to live.'</p><p>1 love for this world,</p><p>Caspar</p>"
}
