{
 "title": "Different Settings / Doses",
 "author": "collapsedhole",
 "citation": "Citation:   collapsedhole. \"Different Settings / Doses: experience with Salvia divinorum (12x extract) (ID 16539)\". Erowid.org. Feb 2, 2005. erowid.org/exp/16539",
 "substance": "Salvia divinorum (12x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 16539",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 2, 2005",
   "Views: 6885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'd first like to say that I have never done salvia before, and don't actually *know* it was extract x12 ... thats what I was told.\r\nDose: One hit, salvia extract x12, held in for just under 30 secs, smoked through a bong\r\nSetting: friend's house with 2 other people\r\nEffects: Began to laugh in about 10 seconds after exhalation as I felt a very quick coming up. Felt as if gravity shifted, I fell off my chair, feeling that gravity pulled my to the floor. I couldnt get up as I was laughing the whole time at the effects and felt pushed to the floor. After I was able to stand, effects decreased. \r\n- - -\r\nDose: 2-3 hits, smoked through a bong\r\nSetting: same as before, about 4 hrs later. \r\nEffects: same quick coming up, took a 2nd hit after exhaling the first. Took another smaller hit which cleared the bong of smoke. Began to feel like I, or everything else, was spinning. Feeling became so intense I stood up and started spinning down the hallway.. had to hold on to the frame of a door to stop. The only coherent thoughts I had were of me spinning, and trying to stop several times and failing. I was laughing a good bit of the time to as I saw the ridiculousness of the situation. My friend who had done 3 hits said that he felt wet.. like he was dripping water.. maybe this was because it was kinda humid in his apartment.\r\n- - -\r\nDose: smoked 1 bowl hydro, appox 5 mins later smoked salvia = 3-4 hits, smoked through a bong\r\nSetting: alone, in my dimly lit room \r\nEffects: 1st:  I had on the first track on the mauthausen orchestra raising vapours cd  bad choice.. there is a long high pitched noise and it began to feel like millions of sharp needles stabbing me, was actually a bit painful. (note: music was quite loud and I was close to the speakers). After I turned off the music the feeling quickly disappeared.\r\n2nd:  I put on another CD, and layed back on the bed. This turned out to not matter as I didnt even really hear or pay attention to the music. I began to feel disoriented, and felt that the floor, walls, and ceiling were switching places.. its hard to describe. Got up to find a pen to write down what had happened because it was pretty interesting.\r\n1:45am: approx 10-15 mins later, attempt to smoke again.. smoke one large hit, and one to kill the rest and clear the bong for a total of about 6 hits in about 15 mins. Returned to laying down. \r\nThis next part was quite intense. As I was laying down, I began to feel, think, and believe, that I was being woken up from a dream that my entire life had been one of my dreams and I was waking up. There was several people around as well. At one point my mom [I was being paranoid and thought what would happen if she came home and saw me like this], and another friends [very briefly thought of earlier that night], and at another doctors. I think I saw doctors in my mind because the feeling of waking up was similar to that of waking up after the anaesthesia is wearing off from an operation. None of this was visual, it was all in my mind. Sense of touch was effected as well.. everything felt like it was filled with sand, including the air. I began to start coming down around 2:10, so it was about 25 mins after I smoked the second time. \r\n2:25am: Still tripping but the most intense part was over. I was able to for the most part think clear again and was able to distinguish what happened. My sense of touch was still altered the blankets on the bed felt very thick.\r\n2.45:am: still feeling a bit pleasantly disassociated & mellow. Eyes are pretty bloodshot tho. Normal mindset again. \r\n*Ive noticed the comedown both times was a disassociation similar to the come down of DXM.\r\n- - -\r\nI dont think I will smoke that many hits again, it was a bit to intense for me. Ill def finish what I have left though, taking 1 or 2 hits at a time.\n\n\n"
}