{
 "title": "My Entity Being an Extension of Others",
 "author": "Child of the Matrix",
 "citation": "   Child of the Matrix. \"My Entity Being an Extension of Others: experience with Mushrooms & Cannabis (ID 16536)\". Erowid.org. Jul 4, 2007. erowid.org/exp/16536",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 oz",
   "oral",
   "Mushrooms",
   "(fresh)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16536",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 4, 2007",
   "Views: 2891",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was the second week of May 2002.  Two of my friends had the hook-up from a guy on campus.  He told them that he would have our order on Friday, which was a perfect day.  There were five of us total who were going to be tripping, two of my friends had two oz and the rest of us had one.</p><p>I had to take one of my friends to pick up her boyfriend at the time and we decided to trip around 5:30pm so it would kick in just in time for sunset.  I had never taken shrooms before, but everyone else had.  There is a big hill in front of the dorms where my friends were living and that 's where we decided to trip.  I was really stoked about the experience because I like to learn new things and from them.  I just knew that I was in for a really stellar mental experience.</p><p>The day was truly perfect.  I hadn't eaten anything of substance the day before and had only eaten some cotton candy that day, so my system was pretty empty.  The effects didn't start kicking in until about an hour after we had eaten them.  It first started with my legs feeling wierd, kind of tired like and I didn't want to move them.  One of my friends was breaking up some bud for us to smoke up in her room, but was having some slight problems as the shrooms started to kick in.  Once she had broken it up, we packed a pipe and went down to the grass where the others were.  We sat in a circle and passed the pipe, and that's when the effects really started to take hold.  It was all beautiful.  </p><p>One of the members was  my ex-boyfriend, whom I was still in love with.  I watched him for the majority of the time.  As I watched him, I started thinking about things he had told me and the ways others had acted when we were in the same vicinity.  As I did this, my mind started on taking the impression and belief that I was just a part of his imagination - an extension of him.  I convinced myself that I existed in his mind and, therefore, in the minds of the others.  Once I came to that conclusion, I started to think about the Force and the Matrix.  That since we lived in such a realm, he actually projected me and that is how I became another entity that others could see and interact with.  </p><p>We were in the grass at that point, just laying on our backs watching the clouds and colors.  As I stared at the clouds, they took on a kaleidoscope effect and I found that I could make them stop moving and start back up.  It was then that I thought of the matrix and the force.  That would also explain how my ex could project my image and being into existence for others to see and interact with.</p><p>So, I decided to start testing my abilities.  At one point, a plane flew overhead and I tested it to see if I could make it stop in midair and then resume flying.  I could.  The effect grew stronger when we went back into the rooms once the sun had set.  I walked into the room where everyone was, which had rave flyers and moving christmas lights on, and everything just freeze-framed.  It was as if somebody had pushed pause and nothing or nobody moved from the position they were in at the precise moment.  I experienced this on and off as we sat there talking.</p><p>Back to the grass during the sunset:  As the trip grew stronger, I began to see images in the clouds.  As they became more distinct, I realize that they were demons that resembled gargoyles.  As I watched them, they grew in numbers; just peering down from the clouds.  </p><p>As the colors faded from the sky when the sun had finally set, we went up into the dormrooms and I became bored with them.  So, I sat in speculation of what I had concluded throughout the trip, that I was an extension of their minds.  As I speculated, I had to type.  </p><p>I concluded that this life is really like us being an extension of everything around us.  We don't know anyone or anything exists until we come in contact with them or it.  So, what we hold to be true in our minds is true in reality.  During the trip, I realized that everything we percieve and see is in fact controlled by our minds.  When people overcome the encumberments of physical limitations and so-called impossibilities, they can truly make anything become a reality.  That's the gift given us by the mind.</p><p>It is something I have always believed, but hadn't known how to make it be until that day.  I am still able to make things stop moving and become a kind of freeze-frame.  That is something I have held on to.  Once the doorways of the mind are opened, it's up to the person to keep them open.    </p><p>The events and discoveries that I made while on that fabulous trip still stay with me.  I haven't looked at the world the same way since and keep wondering what other mysteries I can unlock.  To me, shrooms are a key to opening the mysteries of the impossible; making them very possible.  They  open up pathways in the mind that lay otherwise dormant, just waiting for something to activate them so one can grasp the full capability of the mind.  I can't wait until my next trip.</p>"
}
