{
 "title": "Out of Touch",
 "author": "Paul",
 "citation": "Citation:   Paul. \"Out of Touch: experience with Carisoprodol (Soma) (ID 16533)\". Erowid.org. Mar 18, 2010. erowid.org/exp/16533",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1400 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16533",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 18, 2010",
   "Views: 9415",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy experience with carisoprodol began around 10:30am on a damp summer day. I was surfing through the medicine cabenit looking up brand names and effects for the various antidepressants and muscle relaxents which are found in my home. Upon finding a whole script of 350mg tablets of carisoprodol and researching all I could find on them I decided to dive in. \r\nAt about 11:15 I chewed 4 tablets and chased them with water untill all of the disgusting powder was out of my mouth. I then sat in my living room to watch TV. After fliping channels for about 25 min I found nothing to watch, and decided to put in a movie. As soon as I stood up I felt an amazing rush as though all of the weight in my body had shifted forward to a center of gravity which was about 4 inches in front of me. My knees bucked and I took a few steps forward to regain my balance. I experimented with my physical limitations by lifting my arms (which seemed to follow a few seconds behind my thoughts) and by walking a few circles in my living room. \r\nAfter putting 'snatch' in the VCR I stood and stared at my hand which was resting on top of the vcr for no apparant reason. after sitting back down I discoverd that I hadn't pushed the tape into the vcr so I was forced to go back over and push the tape in and press play. I grinned with pride as I returned to the couch. I seem to remember looking at the clock at about this time but I have no way of remebering what it said. I watched snatch for aprox 35 min when I realized I had lost the plot of a movie I have watched a dozen times, and became annoyed by the british accents.\r\nI decided to stop the tape but instead of doing so, I walked out of the room almost angry that it hadn't worked out. I then logged on the internet and tried playing tetris for a while. It was about this time that I became very aware of my inability to do anything. I lost 3 or 4 games of tetris on the first level, after giggling a bit at this I became restless and returned to the living room. The clock read 1:15 which I realized before I became infatuated with the blinking lights on the digital clock. My vision became very accute and sharp, while my hearing diminished. I felt somewhat out of touch with my limbs, for they responded very slowly to anything I wanted to do. My actions were about 2 seconds behind my thoughts which disturbed me.\r\nI'm not sure how long I sat on the couch, but I remember feeling restless and wanting to move before deciding against it, multiple times. Then gradualy my hearing returned to normal, I could hear the neigbors mowing their lawn, and I even got up to have a short conversation with him at about 2:30. Gradualy but somewhat abruptly my senses returned and I was able to form coherant thoughts and my limbs responded to my commands, though I had no desire to do anything untill about 5:30 that night.\r\nOverall it was a positive experience. Carisoprodol left me completely out of touch with myself and anything around me, though pleasant I was more concerned with my inability to do anything.\n\n\n"
}