{
 "title": "Very Relaxed",
 "author": "Hypersphere",
 "citation": "   Hypersphere. \"Very Relaxed: experience with Cyclobenzaprine (ID 16584)\". Erowid.org. Feb 10, 2004. erowid.org/exp/16584",
 "substance": "Cyclobenzaprine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "insufflated",
   "Pharms - Cyclobenzaprine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16584",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2004",
   "Views: 105855",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI was bored out of my mind and dying to try something. I haven't done many drugs before (only Tylenol 3s) and was curious. I knew we had these pills (cyclobenzaprine) that helped relaxed muscles and I was curious.<br>So I took one...<br>An hour later I feel a little tired. Nothing else different. Well experiment one failed. About a week later I got the idea to crush the pill and snort it. What a great Idea I thought, we learned in school that it gets to the blood stream 100 times quicker that way. So I crushed it up and was left with a shitload of powder that I divided into a couple lines. With a rolled up bill I snorted 2 lines in one nostril and 2 in the other. Fuck it burned. This was not a good idea. Did it ever burn. I drank a couple cups of water, still burning. Shit, I'll just sit on my bed and listen to music.<br>So 5 minutes later I sat and listened, and listened and listened. What seemed like a period of only a couple seconds was actually an hour. I have never been so at peace before. Swaying and sitting and smiling, the heavy techno music echoing in all corners of space and time. I lied down on my bed and the world spun around me. No pain, no feeling, no cares, no worries. Everything was as it should be, peaceful. Then I fell asleep. 16 hours later I wake up. Nose hurts a little and still a little tired and nothing else.<br>While at work the next day all I could think about was doing it some more and getting more of the feeling. Wait, this is how the people who come to your school talking about their drug addictions begin. I have never used it since, but have wanted to very badly. So let this be a lesson for all you, know what your getting yourself into before you do it.\n\n\n"
}
