{
 "title": "More or Less Disgusting",
 "author": "T-Bone",
 "citation": "   T-Bone. \"More or Less Disgusting: experience with Poppies - Opium (seed tea) (ID 16591)\". Erowid.org. May 20, 2005. erowid.org/exp/16591",
 "substance": "Poppies - Opium (seed tea)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 lb",
   "oral",
   "Poppies - Opium",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16591",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 20, 2005",
   "Views: 114883",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been drinking poppyseed tea pretty regularly for almost a year now and I've discovered that the method of preparation that most people seem to recommend is DEFINITELY not the best one for me to use.  On the plus side, poppyseed tea is cheap, every bit as effective as poppy tea, and available all year around.</p><p>The reports I've read all suggest covering the seeds with hot or boiling water, stirring them, and then steeping them for anywhere from ten minutes to a half hour or more.  Many reports also suggest adding lemon juice, sometimes as much as the juice of three lemons to a pound of seeds. After extensive experimentation, I've determined that the following method is much better.  For one dose for myself, I take a pound of seeds and cover them with cold water.  I have to stir them quite a bit to get them all wet, and try to make sure that there's at least an inch of water over the seeds once they're all good and soaked (i.e. no dry ones floating on the top or stuck to the bottom).</p><p>I leave out the lemon juice because I find it has no effect on potency whatsoever and really doesn't taste good.  Then let the seeds soak for 15 to 20 minutes, and strain them out.  I should end up with roughly 500 ml (or two cups) of brownish liquid.  If I use hot or boiling water, the seeds all swell up and absorb a lot of the water and I have to do a second extraction to get a good dose out of a pound of seeds.  Also, the hot water extracts oils from the seeds so, instead of a clear brown liquid, I have to drink a cloudy, oily, yellowish emulsion that tastes like ass and totally coats my mouth so I'm still tasting it an hour later.  The clear tea from cold water tastes pretty bitter, but it's not nearly as disgusting as using hot water.  If I chill the tea in the fridge before drinking it, the flavour is easy to ignore.</p><p>This gets me very nicely high.  It only takes about twenty minutes to half an hour, on an empty stomach, to set in.  It peaks about an hour after that, and starts to tail off about four hours after setting in.  A couple of times I've puked, but usually it's a nice clean opiate buzz.  I'm still a little slowed down the next day, especially if I have more than one dose in a day.  Some seeds work much better than others, and it's usually way cheaper if I can find a source for bulk, rather than prepackaged seeds.  If I pay any more than $4 for a pound, I'm paying too much.</p><p>Two words of warning, though.  This makes me seriously constipated so I never do it more than once or twice in a week.  Also, I read a medical report about a baker in the UK who checked into a detox centre with a four-kilo-per-day poppyseed habit.  Poppyseed tea can be just as addictive as any other form of opiate use.  Personally, I'm an ex-junkie and I'm totally afraid of the addiction that always follows using pills or junk.  I find that the constipation that goes with the poppyseed tea naturally keeps me from using it often enough to get physically hooked, but the high is good enough to keep me from using anything stronger so I think of it as my personal maintenance program.  I hope that by sharing this I won't introduce anyone to the horrible hell that is addiction, but that I might give some folks a viable alternative to using the harder stuff.  I WOULD SAY STAY AWAY FROM NEEDLES AND PILLS! I know from personal experience that they only take me one place.  The only variable is how long it takes to get there.  By the time one starts to suspect that one might have a problem, it's too late.  And yes, it CAN happen to you!!!</p>"
}
