{
 "title": "Surprisingly Enjoyable Plus Headache",
 "author": "Gnostikoi",
 "citation": "   Gnostikoi. \"Surprisingly Enjoyable Plus Headache: experience with Amanitas - A. muscaria (Smoked) (ID 16596)\". Erowid.org. Dec 14, 2003. erowid.org/exp/16596",
 "substance": "Amanitas - A. muscaria (Smoked)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "smoked",
   "Amanitas - A. muscaria",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16596",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 14, 2003",
   "Views: 18282",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter reading about Amanita Muscaria, I got curious and ordered 28 grams from an online supplier.  It arrived a few days ago; what I received was about ten large (5-8' diameter) red and white caps (no stems) wrapped in newspaper.  Since they arrived in the middle of my work week, I haven't been able to invest the time to try eating them yet, but last night I took a small piece of a cap, peeled the red skin from it, and packed a wooden pipe with the flesh from directly underneath the skin.  \r\nMy mental state was not the most appropriate for a visionary plant, which is another reason that I haven't wanted to eat them yet; my girlfriend just recently had a baby and things have been a little tense lately.  I meditated for about ten minutes before smoking in order to clear my mind, but it was only partially effective.  I also offered up a short prayer to the mushroom immediately before partaking.\r\nThe taste of the smoke, surprisingly, was not bad.  I had heard that it was very harsh, but it seemed manageable to me.  I did notice a slight headache after about three or four hits, but it was gone quickly and I suspect it was due to combustion by-products and not the mushroom itself - it was sort of like the headache you can get from standing behind a car that's running.\r\nThe effects of the mushroom came on quickly, and I found them very pleasant.  As I said in the title, it reminded me very much of cannabis, with a few notable exceptions: although I felt euphoric and I quickly became tired (and fell asleep about an hour after smoking) my mind remained sharp, or at least it seemed that way.  I had distinctly strange, irrelevant trains of thought, which I don't remember clearly now, but what pleased me was that I was able to follow these trains of thought to their logical conclusions, unlike with cannabis where my thoughts bounce from one subject to another.  I was able to hold intelligent conversations with sober people, and my girlfriend said that it was unlikely that anyone who didn't already know that I had taken a drug would guess that I had from talking to me.  I will not try this out, but I suspect that I could even function adequately at work under the influence of this substance - work being a busy medical office.\r\nOverall, it was a very positive experience, and I am looking forward to further experimentation with Amanitas.  I know that eating them is significantly different, and I will try it when I have the time to spare, but I have a feeling that I will find smoking them more enjoyable - from what I've heard the body load is pretty unpleasant when eating them, whereas I had no negative effects from smoking them except the headache, which only lasted about five minutes.  I highly recommend smoking Amanitas to anyone who enjoys cannabis - while it is not the same and is not really a substitute, it is an enjoyable experience in itself.\n\n\n"
}
