{
 "title": "Contrasting Three Tu Seas",
 "author": "Erica.Smerica",
 "citation": " Erica.Smerica. \"Contrasting Three Tu Seas: experience with 2C-T-2 (ID 16645)\". Erowid.org. Aug 8, 2002. erowid.org/exp/16645",
 "substance": "2C-T-2",
 "bodyweight": "109 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "2C-T-2"
  ]
 ],
 "footer": [
  [
   "2002",
   "16645",
   "Female",
   "",
   "Not Given",
   "Aug 8, 2002",
   "11877",
   " "
  ]
 ],
 "report": "<p>\nJuly 2002</p><p>It was Saturday and I woke up early, after a late evening out, for breakfast with my old lady friends as I do each weekend.  Upon arriving back home, around noon, I saw that my roommate J was out for the evening and M had already been up and about too.  He spent the morning with our very spiritual, although somewhat paranoid schizophrenic, friend; he is one of those types who regales us with stories of hitchhiking across the desert, tripping on mescaline, back in his glory days of late nineteen-sixties.  Being in his presence is pretty intense, and M was full of his energy that morning.  Although we had not planned on tripping, it was a beautiful afternoon  it was warm and the sun was shining - so what better to do than walk about our little mountain town on a mild dose of the brand new 2C-T-2 that we had just been surprised with?</p><p>This was my first encounter with 2C-T-2, although I am familiar with both 2C-T-7 and 2C-I, each of which provides a very different and unique experience.  For me, 2C-T-7 has been extraordinarily visual, and most electric in its display of colors and lights.  I have only taken it twice, and both times I vomited profusely.  On the other hand, although 2C-I is less visual, it is quite spectacular in its own right and for me has been much more introspective.  I can easily wander about town on a mild dose, and most notably, this particular 2C doesnt cause any nausea for me so long as I eat lightly or fast.  Both of these substances have provided warm inner feelings of oneness with my environment, but the differences are so subtle that they are a bit difficult to describe.  I was especially eager to see what 2C-T-2 was going to offer. </p><p>Although M had tried it twice before, I knew very little about 2C-T-2 and was not nearly as prepared, educated that is, about what I might expect.  Personally, I always recommend knowing a fair amount about something before putting it into the body.  However, in this case I was excited about trying something new that would not be biased with expectation.  Whether we like it or not, previous knowledge tends to creep in and may unduly influence the direction of the journey.  So it was nice to be a bit nave in such trusted company.</p><p>We each took a 16mg capsule at 1:30.  I hadnt eaten much today, just a piece of toast and a glass of juice, although I had a couple of margaritas the evening before.  My stomach was already feeling a bit strange from the alcohol, and the 2C-T-2 definitely didnt help.  Approximately 30 minutes after ingestion, I felt like I needed to vomit.  Because I have such an aversion to vomiting, my mind often interferes with my ability to get the job done, but finally after about 30 minutes of trying I threw up enough to make myself feel mostly better.  M had no problems; he fasted all day but drank a lot of water.  Physically, both of us were feeling fairly well so we decided to go for our walk.</p><p>The walk was delightful, despite the fact that I wasnt feeling quite up to par.  I still had an upset stomach, like at any moment things could go awry, but only 1 hour after ingestion I was already beginning to peak from this material.  Initially I experienced feelings of inner warmth, but slowly the atmosphere grew increasingly brilliant and began to really sparkle.  The trees seemed to be alive; leaves blowing in the wind deceived me into believing they were birds.  Colors were lavishly rich and bright, much more so than with 2C-I, and I had a wonderful appreciation of nature and the town in which I live.  I see the mountains every day, and Ive seen the mountains countless times while in an altered state of mind, but 2C-T-2 made the mountains more beautiful than I had ever seen them.  Once we made it to the base of the foothills, we sat by the mountain creek listening to the flowing water and watching it run over our feet.  All sensory information derived from the world around me was transformed such that my surroundings became fantasy-like and oneiric  almost cartoon-like.  </p><p>For me, 2C-T-2 was similar to 2C-I in that it was remarkably introspective, although I really enjoyed simply letting my mind go clear as to relish in pure existence.  In addition, like 2C-I, 2C-T-2 was very mentally clear and non-intrusive, but produced the beautiful spectrum of color and extravagant visuals that I typically associate with 2C-T-7.  In fact, in many ways I felt that 2C-T-2 seemed to mimic certain qualities that I find with both 2C-T-7 and 2C-I, but didnt really offer anything unique. </p><p>I suppose at the peak, I reached a +2, maybe even a +2.5, on the Shulgin scale.  Strangely enough, my eyes never dilated, and my eyes always dilate quite a bit, and neither did Ms.  During the peak, which lasted approximately 2 hours, my motor abilities were slightly impaired and I found it difficult to walk, as my coordination was poor.  Despite the fact that I had an absolutely lovely experience, minus the nausea, there is little motivation for me to return to this one, especially with things like 2C-T-7 and 2C-I around.  However, if I were to try this again I think a higher dose taken in a quiet setting may change my mind about this one.</p>"
}
