{
 "title": "I Sleep the Body Electric",
 "author": "W Parker",
 "citation": "   W Parker. \"I Sleep the Body Electric: experience with Melatonin (ID 16654)\". Erowid.org. May 5, 2006. erowid.org/exp/16654",
 "substance": "Melatonin",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Zolpidem",
   "(daily)",
   " ",
   "18 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16654",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 5, 2006",
   "Views: 13925",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been batting chronic insomnia for over 10 years (25/M).  I have been using Ambien for 2 years and found that it has been the only prescription sleeping medication that works consistently.  Although I don't appreciate the hangover-like effects the next morning, I can justify just about anything in order to get a good 6-8 hours of sleep per night.  I have settled on 5mg per night as an acceptable minimal dosage to put me to sleep.  <br>That having been said, taking more than 5mg can be a great deal of fun.  In fact I have recently been ingesting 30mg per night in order to feel the euphoric effects before finally falling asleep.  Effects at 30mg are similar to taking Ativan for surgery (memory loss, euphoria, loss of inhibition).  My perscription is for 30 pills and can only be refilled once per month so I am now confronted with an unwanted and unintended situation - having 20 days to look forward to without the medicine that I have counted on every night for 700+ consecutive nights to lull me to sleep. <br>I have taken 30mg Temazepam (a benzodiazopene, Restoril) given to me by a friend, and it works rather well, but like most benzos one develops a tolerance relatively quickly (\n<br>I have come to the conclusion that perscription sleep meds can work if they are used correctly but in the hands of casual drug users like myself they can be easily abused.  As much as I want to get f'd up and enjoy myself, better judgement wins in the end and I need to rid myself of this potentially damaging habit.<br>There are a number of 'natural' sleep aids available and I have tried all of them.  Valerian root did absolutely nothing.  Kava Kava had the same results.  Valerian + Kava Kava = waste of $$$.  Time to give melatonin a try.<br>The first time I tried melatonin was the last night of my ambien prescription.  One 10mg ambien pill + 9mg of melatonin resulted in sleep with a few interesting dreams but nothing that stands out.  The next night I knew that I had no ambien left so it was up to the Melatonin and sheer willpower (or the suppression of brain activity, ironically).  <br>Initially I took 9mg with 2 12oz beers.  I felt a little sleepy especially because I stayed up a bit past my normal bedtime (11pm) to ensure that I would be nice and tired (1am).  I also worked out extra hard that afternoon so I would be nice and tired.  After I began to feel sleepy I took another 3 pills (3mg each for a total of 18mg) to ensure that I would fall asleep and stay asleep (often a problem).<br>The result was a dream more lucid than anything I have ever experienced.  I have found that describing the contents of dreams never quite translates - I won't try.  Let me just say that the dream I had was completely cohesive - it was like dreaming an entire movie in sequence that actually made sense.  It reminded me of Paul McCartney dreaming the entire chord sequence of 'Yesterday.'  It was one of the most profound experiences I have ever had and I am more than excited about repeat the same experience tonight.  I intend to take 24mg tonight and will continue to adjust dosage slightly up and down until I find a good level.<br>Hopefully I will be able to realize my goal of using Melatonin to ween myself from my prescription sleeping aid habit.\n\n\n"
}
