{
 "title": "My Vividly Colored Nightmare",
 "author": "vegan girl",
 "citation": "   vegan girl. \"My Vividly Colored Nightmare: experience with Mushrooms & Cannabis (ID 16658)\". Erowid.org. Aug 28, 2005. erowid.org/exp/16658",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "0.25 oz",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16658",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 28, 2005",
   "Views: 5532",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA couple days ago, my boyfriend, one of our friends, and I bought a sizeable amount of shrooms and decided to trip.  My previous three experiences with shrooms had been beautiful beyond words, and this time, I wanted the experience to be as intense as possible, because I assumed that such a breathtaking experience could only get better if it were stronger. So instead of eating an eighth, like I had before, I decided to eat a quarter of an ounce. I smoked a bowl of decent herb, loaded up a sandwich thick with shrooms, and somehow managed to choke down the whole disgusting thing.\r\nThe three of us went to a park which we thought would be a good place to trip.  Already on the way to the park I could feel myself coming up, and by the time I got to the park drinking fountain, I was tripping.  The last thing I remember clearly is lying facedown in the earth while claiming to be buried and seeing bright patterns when I closed my eyes (at this time, my friend and boyfriend were only starting to come up.)\r\nAfter this my memory is a huge gap, despite the fact that I've been told we spent more than an hour at the park.  \r\nMy memory of that day returns at the point when I vomited violently all over the grass.  I had horrible stomach pains even after throwing up everything, and was still tripping hard, so I didn't remember I had eaten shrooms.  I just kept thinking about how horrible my body felt, which led to thinking about how horrible the park looked, which led to thinking about how horrible life was and how I was a lousy excuse for a person. . .soon I was stuck in a frightening existential crisis, thousands of time more intense than anyone could possibly experience sober.  \r\nMy two companions somehow got me in the car to take me to a friend's house to calm down.  By that point I was seeing full-blown open-eye hallucinations--the world had been transformed into a vividly colored nightmare, with strange yellow spotted buildings and a purplish sky.  I felt an uncontrollable paranoia--not of being caught or harmed, but a fear of myself, of the possibility that these thoughts about the disgusting unbearable nature of my life would keep multiplying, trapping me in my skull and driving me insane. . .I felt some spare change in my pocket and, only vaguely aware of what it was, decided to kill myself by swallowing it and choking to death.  But then I was afraid that maybe death was an illusion and my consciousness would somehow survive.  That scared me, so I decided to live.\r\nWhen I finally started coming down--hours later--I was in my friend's bed, where my companions had put me hoping to calm me down.  I had been tripping so hard, though, that I hadn't even been aware of their attempts to comfort me.  I had only been able to experience the overwhelming inner world of despair and hallucinations.  Even coming down was awful, since my recent aversion to reality made it hard to return to it.  But when I finally did come down, everything was fine--I didn't have any residual paranoia or depression, which I'm thankful for, and in retrospect it's probably a blessing that I can't remember most of the trip.  \r\nSo, the moral of the story is: as someone relatively inexperienced with shrooms, I'd stick with eighths;  won't eat twice the normal dose.  It was a really stupid idea.  An eighth of an ounce is fun, but doubling the amount does NOT double the fun.\n\n\n"
}
