{
 "title": "The World Was Crying",
 "author": "Lucy",
 "citation": "   Lucy. \"The World Was Crying: experience with Mushrooms (ID 16681)\". Erowid.org. Apr 24, 2003. erowid.org/exp/16681",
 "substance": "Mushrooms",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "2 cups",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16681",
   "Female",
   " ",
   "Not Given",
   "Apr 24, 2003",
   "7102",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>i had just gotten home from being at my dads house and my friends had come to pick me up at the airport. My friend Al suggested that we should do shrooms so we went and found another friend and went to his house and made some tea. I had 2 cups of it, we put sugar and a tea bag in it and drank it. i was very happy and hyper before i started to get the effects we were all talking in the livingroom when i started to see things i took off my glasses cuz i felt like i could see with out them and i started to see things like in boxes which eventually changed to spiders they all fit together like an MC Easher piece. </p><p>From there on everything seemed sorta like a dream. I was talking to this boy Josh and his eyes kept shaking andpoping out of his face and turning pure black and they were very clear as apposed to everything else that was blurry with spiders then he got 3 more noses one on each cheek and on his chin. Then somehow i got in to this room and saw a face on the ceiling and it looked very sad. i got out of the room and started walking around and i went into the computer room where i saw a face in the curtains that i though was my grandma i knew it wasn't but it really seemed like she was there and she looked like a hippy with flowers in her hair and stuff, it made me wanna cry because i missed her so much. I kept going in and out of the room to see her. </p><p>Nothing seemed real anymore. People would ask my questions and i didn't know the answers to them like have you had sex, or you said you've done this before have you. I knew i had but i though it was fake like my past was totally fake. we went out side and i felt VERY clean and it felt really good so i was being like a little kid if felt great. i wanted to go on a walk and they wouldn't let me which really pissed me off so i just staied in the drive way because i though the road was a bad place so i was looking at the trees and such and i saw another face which looked like it was crying too like the others. the people i was with kept trying to convience me to do things i didn't want to do, like go swimming and i just didn't want to.</p><p>At this point someone said something like they didn't like the way i acted when i was tripping and that hurt me really bad and i was talking to them saying how i though that was fucked up and how no one liked me and i just got into this who big thing about people not likeing me and how i was a loser then he said i had low self esteem and it was all in my head which now i realize it true it never phased me till that moment. Anyway we finally went in the pool the water felt great it didn't really feel like water either, anyway, our sitter suggested making a whirl pool with it so we started and my feet felt like they were sinking in to the ground which really started to freak me out  so i sat on the side and i was talking to other people. </p><p>them boom out of nowhere i remebered (i never forgot) that i was raped as a child and it started to really get to me like it never has before i could usually blow it off and not think about it but i couldn't then and i started crying like mad. so we went back inside and we just decided to sit and talk for a while and my ideas were just flowing and i finally came up with a good reason of why i am a vegatarian and why i don't believe in god. Over all the experience was great and made alot of things clear to me. i didn't see that many crazy visuals but i just felt alive it was one of the first time i totally felt happy and not depressed even though everything around me was sad.</p>"
}
