{
 "title": "Surprised to Feel So Good",
 "author": "Murple",
 "citation": "   Murple. \"Surprised to Feel So Good: experience with Methylone (ID 16692)\". Erowid.org. Jul 11, 2002. erowid.org/exp/16692",
 "substance": "Methylone",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Methylone"
  ]
 ],
 "footer": [
  [
   "2001",
   "16692",
   "Male",
   " ",
   "Not Given",
   "Jul 11, 2002",
   "Views: 17193",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA close friend of mine is getting ready to leave for a 6 month trip to Bolivia. This being his last weekend here, we decided to throw a party for </p><p>him. He and another friend had both expressed some interest in trying </p><p>methylone after I had discussed it with them, and this seemed like the </p><p>perfect opportunity. Although I'd done it the past weekend, I decided to </p><p>join them, so I measured out three doses of 150mg each and brought them to </p><p>the party. I had considered bringing higher doses, but I figured it would </p><p>be better to start them low and see how they respond. The setting of the </p><p>party was at a friends house, with at most 20 people present, a DJ playing </p><p>music, party decorations, snacks, etc. A typical social gathering. </p><p>At around 9 PM, I told my two friends that I'd brought the </p><p>methylone and asked if they were still interested. They mentioned some </p><p>mixed feelings, worried that this would be another 'shitty internet drug' </p><p>that would leave them feeling poisoned (as some tryptamines and 2C-T-7 </p><p>had), but they decided to give it a shot after I reassured them this </p><p>wasn't another pukefest trip. We all dosed together at around 9:15. The </p><p>first friend is a male, age 22. I don't know his weight, but he's kind of </p><p>large. The second friend is female, also 22, weighing probably around 110 </p><p>pounds. Both are very experienced psychedelics users, having used LSD, </p><p>psilocybin, MDMA, mescaline, DPT, 5-MeO-DMT, DMT (ayahuasca), 5-MeO-DIPT, </p><p>2C-T-7, and perhaps a few others. While both like psychedelics in general, </p><p>the nausea of ayahuasca and 2C-T-7 and the hideous experience of snorting </p><p>DPT has left them somewhat skeptical about many of the currently available </p><p>analogues. I can certainly understand this position. </p><p>At around 9:45, we all began to feel initial effects. The girl said 'I </p><p>feel good 'several times, sounding almost surprised. The guy said it felt </p><p>like the initial phase of a psychedelic. By 10 PM, we were all more or </p><p>less at peak effects. They both described the effects as being similar to </p><p>the initial phase of MDMA, but toned down and subtly different. We went </p><p>for a short walk outside under the full Purim moon, which was brightly </p><p>illuminating the large yard. It was pretty cold, but this didn't seem to </p><p>bother anyone.  </p><p>Socializing was definately enhanced, but there was none of the </p><p>emotional outpouring of MDMA. It was a nice friendly evening. All of us </p><p>felt that it was a very relaxed and happy state of mind. By around 11:30, </p><p>we were all coming down. Smoking some cannabis seemed to diminish most of </p><p>the remaining effects, though it seemed to enhance some aspects. By 12:30 </p><p>AM, the guy was feeling a little tired and decided to go home. I stayed </p><p>until around 2 AM before I felt comfortable driving home. </p><p>Both my friends expressed a willingness to do it again, but at a </p><p>higher dose. </p><p>Personally, I found no noticable difference between this 150mg </p><p>experience and the 120mg experience of the past weekend (less than a week </p><p>elapsed - Sunday afternoon to Friday night). I wonder if tolerance played </p><p>a role? Probably. Were it not for the fact that my friend was going to </p><p>Bolivia, I would not have taken it again so soon. I think taking this drug </p><p>more than once a month would be a waste... not to mention an unnecessary </p><p>risk, considering the highly experimental nature of this chemical. Taking </p><p>this drug in a social setting was much more rewarding than taking it by </p><p>myself - the exact opposite of MDMA. I would like to try it in a situation </p><p>such as a nature hike with 2 or 3 friends... I suspect that would be the </p><p>optimal use for this material.</p>"
}
