{
 "title": "Surprised to Feel So Good",
 "author": "Murple",
 "citation": "   Murple. \"Surprised to Feel So Good: experience with Methylone (ID 16692)\". Erowid.org. Jul 11, 2002. erowid.org/exp/16692",
 "substance": "Methylone",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Methylone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 16692",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 11, 2002",
   "Views: 17193",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA close friend of mine is getting ready to leave for a 6 month trip to Bolivia. This being his last weekend here, we decided to throw a party for <br>him. He and another friend had both expressed some interest in trying <br>methylone after I had discussed it with them, and this seemed like the <br>perfect opportunity. Although I'd done it the past weekend, I decided to <br>join them, so I measured out three doses of 150mg each and brought them to <br>the party. I had considered bringing higher doses, but I figured it would <br>be better to start them low and see how they respond. The setting of the <br>party was at a friends house, with at most 20 people present, a DJ playing <br>music, party decorations, snacks, etc. A typical social gathering. <br>At around 9 PM, I told my two friends that I'd brought the <br>methylone and asked if they were still interested. They mentioned some <br>mixed feelings, worried that this would be another 'shitty internet drug' <br>that would leave them feeling poisoned (as some tryptamines and 2C-T-7 <br>had), but they decided to give it a shot after I reassured them this <br>wasn't another pukefest trip. We all dosed together at around 9:15. The <br>first friend is a male, age 22. I don't know his weight, but he's kind of <br>large. The second friend is female, also 22, weighing probably around 110 <br>pounds. Both are very experienced psychedelics users, having used LSD, <br>psilocybin, MDMA, mescaline, DPT, 5-MeO-DMT, DMT (ayahuasca), 5-MeO-DIPT, <br>2C-T-7, and perhaps a few others. While both like psychedelics in general, <br>the nausea of ayahuasca and 2C-T-7 and the hideous experience of snorting <br>DPT has left them somewhat skeptical about many of the currently available <br>analogues. I can certainly understand this position. <br>At around 9:45, we all began to feel initial effects. The girl said 'I <br>feel good 'several times, sounding almost surprised. The guy said it felt <br>like the initial phase of a psychedelic. By 10 PM, we were all more or <br>less at peak effects. They both described the effects as being similar to <br>the initial phase of MDMA, but toned down and subtly different. We went <br>for a short walk outside under the full Purim moon, which was brightly <br>illuminating the large yard. It was pretty cold, but this didn't seem to <br>bother anyone.  <br>Socializing was definately enhanced, but there was none of the <br>emotional outpouring of MDMA. It was a nice friendly evening. All of us <br>felt that it was a very relaxed and happy state of mind. By around 11:30, <br>we were all coming down. Smoking some cannabis seemed to diminish most of <br>the remaining effects, though it seemed to enhance some aspects. By 12:30 <br>AM, the guy was feeling a little tired and decided to go home. I stayed <br>until around 2 AM before I felt comfortable driving home. <br>Both my friends expressed a willingness to do it again, but at a <br>higher dose. <br>Personally, I found no noticable difference between this 150mg <br>experience and the 120mg experience of the past weekend (less than a week <br>elapsed - Sunday afternoon to Friday night). I wonder if tolerance played <br>a role? Probably. Were it not for the fact that my friend was going to <br>Bolivia, I would not have taken it again so soon. I think taking this drug <br>more than once a month would be a waste... not to mention an unnecessary <br>risk, considering the highly experimental nature of this chemical. Taking <br>this drug in a social setting was much more rewarding than taking it by <br>myself - the exact opposite of MDMA. I would like to try it in a situation <br>such as a nature hike with 2 or 3 friends... I suspect that would be the <br>optimal use for this material.\n\n\n"
}
