{
 "title": "About Last Night",
 "author": "Rose",
 "citation": "   Rose. \"About Last Night: experience with Cocaine - Crack (ID 16703)\". Erowid.org. Jan 17, 2005. erowid.org/exp/16703",
 "substance": "Cocaine - Crack",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Crack",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16703",
   "Female",
   " ",
   "Not Given",
   "Jan 17, 2005",
   "Views: 8925",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been trying to stay away from crack since February of this year but it still seems so hard.  Yesterday my younger sister invited a couple of guys she met at the club over to our town so we could drink and talk and shit.  I was buzzing on beer and weed so we started talking about drugs and they asked if we had ever tried speed.  I'm not really scared of much so I said I wouldn't mind trying it so then we headed to their hometown to get some shit and we ended up renting a hotel room.  They took out a foil paper and a hollow pen.  I was thinking this doesn't look like speed so they took out a small rock and immediately I started inhailing that rock as it burned on the foil paper.  It din't bring back that head rush that I used to feel when I was a crackhead and i just stayed with the cravings of hitting up some more rock.  But there wasn't no more.  </p><p>I don't recall much about last night and my sister told me that I was tripping hardcore.  She said I was cussing at the guys and driving very fast on the way home and I even forgot where I lived.  I think my body is just trying to recover from those  crack days but I don't seem to be helping much.  I'm not even hungry and my head feels so light today.  I wish I had more crack but I don't want to fall again.  I'm never the same.  I always think of crack and remember those 'good old days'.  Well to me that's what they seemed, my younger sister doesn't like for me to do that she says i'm scary and violent.  I think I reacted that way because there was no more crack last night and I wanted some more.  Damn I went on a trip.</p>"
}
