{
 "title": "Something Happened...",
 "author": "NickP",
 "citation": "   NickP. \"Something Happened...: experience with Catnip (ID 16735)\". Erowid.org. Apr 11, 2011. erowid.org/exp/16735",
 "substance": "Catnip",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "0.75 g",
   "smoked",
   "Catnip",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16735",
   "Male",
   " ",
   "Age at time of experience: 13",
   "Apr 11, 2011",
   "Views: 8562",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am 13 years old and have been into drugs for about 6 months. I used to smoke a lot of weed until I got caught. I am now in weekly drug testing and I am not willing to risk flunking it by smoking weed, so I have been trying to find a legal alternative. I've been wanting to get something strong like Hops or Salvia Divinorum, but I don't have anywhere to ship to without the possibility of my mother finding my package, so that is not a possibility in the near future. Then I heard that catnip could give you a good buzz so I went to the grocery store and picked up 2.1 oz for $1.50..</p><p>The first 2 times I smoked catnip, I got a mild buzz, but that was because I only took about 2-3 small drags every time. I wanted much more, so right now I just smoked some more, but I had much more, and I took huge, fast drags. My throat hurts like a son of a bitch, but I have noticed effects never recorded by anyone I have ever heard of. This is probably because I am young and have a small body weight. </p><p>Like I said before, the first two times were very mild buzzes, except for the fact that when I talked to my brother, his voice seemed telephone quality, but I just had some right now.. at first, everything seemed much more sharp and my eyes seemed to be working much better than usual. Next, I started noticing flashes of light in the streets, and this began to scare me quite a bit. At this point I was noticing mild paranoia. After I finished, I decided to go inside. On the way in, I noticed some things that were very unimportant, like a spider web hanging from a tree. When I looked in my front yard, it looked much emptier than usual. I noticed that now the living room was brighter, cleaner, and smaller. Right now as I am typing, I am feeling fine, but I have noticed that it works best where there is a lot going on, like traffic moving.</p><p>Most experiences from other people were generally extremely mild buzzes, but I was shocked today, to find out that this worked for me as a mild visual & audio hallucinogen. In my case, it was definetely worth $1.50, if not more.</p>"
}
