{
 "title": "I Hate It!",
 "author": "Becky",
 "citation": "   Becky. \"I Hate It!: experience with Pharms - Paroxetine (ID 16746)\". Erowid.org. Nov 10, 2003. erowid.org/exp/16746",
 "substance": "Pharms - Paroxetine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16746",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 10, 2003",
   "Views: 13205",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nIn the start of my freshman year I started to feel really sad and angry at the world. I stopped going to school, and spent the days at home, playing the playstation, sleeping and watching TV. I never really connected with my classmates and was always an outsider anyway, but after living like this for a bit, I stopped seeing the friends I had and spent alot of time on my own. </p><p>Normally I'm really adventurous, hardworking and outgoing, but at that point I started to question where my life was going and wonder if it was worth the effort. Nothing mattered anymore. My parents found out I rarely went to school and decided I must be being bullied. This wasnt really true, but I wasn't happy at my school, and being a new yorker, thought Scotland was a real drag. They let me stay off school for a couple of weeks and looked into new schools, but they saw my mood wasnt improving they took me to the doctors. The doctor decided that I was depressed, and perscribed me 20 mg of Paroxetine. I thought this was a bit hasty, but I took it anyway, anything to make me feel better. </p><p>After two weeks it started to work, and I had a more positive outlook on life, much improved by the fact I'd moved to a selective private school which I had lots of friends. The weird thing was, I had a big manic type episode around that Christmas time; shoplifting, overspending, being arrested, drinking huge amounts, and eating so much cannabis resin that I had hallicinations and went completely nuts. I also never needed to sleep or eat, and felt permanantly full of energy. My dad noticed this and took me back to the doctor who decided I was a manic depressive?! Our family had to go to this fucking shrink who made tons of stupid comments so my parents blew them off and walked out. I started acting much more like myself by January, so they decided to take me off Paroxetine. </p><p>I thought it would be easy, but I was very wrong. The first time I tried was in march, and I felt dizzy, neaseous, weak and really really sick. I went back on them on a reduced dose. It is now august, and Im in the middle of the withdrawl. slowly Im starting to feel better, and I've not taken paroxetine for over a week. I felt  awful and spent the whole week in bed. I also did some research and found that many medical professionals have found that a number of people find it very difficult to stop taking this drug, and experience jolting sensations, dizziness, lethargy and neasea. It took a long time to battle through this withdrawal, and the drug was badly prescribed as changing school seemed to help me alot more. From now on, Im going to think very carefully when picking up a prescription, and I'd urge everyone reading this to do the same.</p>"
}
