{
 "title": "Pleasant Opiate-Like Sedation",
 "author": "Gnostikoi",
 "citation": "   Gnostikoi. \"Pleasant Opiate-Like Sedation: experience with Amanitas - A. muscaria (ID 16748)\". Erowid.org. Dec 12, 2003. erowid.org/exp/16748",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "1.5 caps",
   "oral",
   "Amanitas - A. muscaria",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16748",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 12, 2003",
   "Views: 12521",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few weeks ago I received 28 grams of WA state Amanitas from an internet supplier.  I tried smoking the caps, which I found very enjoyable, but I wanted to wait until the right time to try a full dose. I prepared 1.5 caps in a tea; I boiled some distilled water and a few tablespoons of lemon juice, then turned the burner down so that it was just simmering and added the caps, broken up into small pieces.  I let them simmer for about fifteen minutes, until the water was a dark brownish-red, then added a few bags of Assam tea (a variety of Indian black tea).  I had hoped that the tea would mask the flavor, but unfortunately I suspect that it made it worse.  I ended up drinking a large glass (probably about 12-14 oz) of incredibly foul-tasting liquid - I had thought when people reported that it tasted like shit it was metaphorical.  I was wrong.  It also made my entire house smell like a sewer while I was cooking it. </p><p>I started feeling a little queasy about halfway through the glass, so I smoked some cannabis and felt better almost immediately.  The last part was the hardest to get down because of the sediment. </p><p>I started feeling the effects of the mushroom within 20-30 minutes.  It was a heavy, heavy body buzz at first, with very little mental impairment.  I used to be addicted to opiates, and it reminded me very much of morphine - needless to say I enjoyed it.  I laid next to my girlfriend and just sort of spaced out for a while.  She and the kids were watching some sort of fantasy movie, but I could make no sense out of it.  I kept having odd, irrational thoughts.  I recognized that they were not logical, but it was almost as if my mind was split in two; for example, I would ask myself 'What if ducks could fly?', and the other half of my mind would answer 'Ducks CAN fly', but the illogical part of my mind paid no attention.  Although I don't remember vocalizing it, my girlfriend told me that I asked her several times over the course of the night whether ducks could fly.</p><p>I have read that this sedative state is usually followed by a state that is considered more 'psychedelic'.  I never progressed beyond the initial state, which was fine with me because I found it very pleasant.  I took the tea at about 7:00pm and fell asleep at about midnight, so maybe I just slept through it, or maybe I didn't take enough, or took too much.  Or maybe I react differently to Amanitas than most people.  I'm leaning towards the idea that I didn't take enough, simply because a lot of people complain about the unpleasant body load of Amanitas and I felt almost no physical side effects aside from a LOT of salivation.  Since I enjoyed the state produced so thoroughly, I may or may not experiment with higher doses - I don't really subscribe to the 'More is better' theory ;)</p><p>Also, the next day I felt slightly hungover - nothing extreme like with LSD or other harsh psychedelics.  I had a headache, which is very unusual for me, and also some back pain, but both had gone away by 11:00am or so.  Overall it was not what I was expecting from Amanitas, but it was fun and I will do it again.</p>"
}
