{
 "title": "I Couldn't Stop Smiling",
 "author": "Napoleon",
 "citation": "   Napoleon. \"I Couldn't Stop Smiling: experience with Mushrooms & Cannabis (ID 16761)\". Erowid.org. Nov 22, 2004. erowid.org/exp/16761",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2.2 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16761",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 22, 2004",
   "Views: 5311",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend had brought back some mushrooms from out west and I decided to give them a try.  Mushrooms have always been fun for me because I go into a state of bliss, laughter and happiness.  These shrooms were fun, but they were a little different.  </p><p>I usually eat about an eighth of the shrooms I get around here, but he warned me that these shrooms were very strong so I took less.  About a half hour after I ate the shrooms, I felt I was getting high.  I went over to my friends house to watch The Patriot.  The visuals I got off these shrooms were much harder than any other shrooms.  What I saw was everything having it's own defined space, very defined borders if that makes sense.  Then I started tripping harder.  </p><p>About and hour into the trip, I was tripping so hard I actually thought that a wrinkle in my black coat was a cobra talking to me.  I didn't speak out loud to it, but had a conversation in my head with it for about 10 minutes or so.  Then I noticed that everything on the tv looked like it was from the Matrix, numbers running up and down, I shit you not.  For the next hour or so, I felt like I was dreaming, but I was able to remember all the details of my dream.  My friend told me my eyes were rolled back into my skull.  I would describe the feeling as euphoric, which must have been when I was peaking.  I am glad I went into this state because I was not seeing things right before I got to that state.  People's faces looked like the Umpa loompa's from Willy Wonka, and it kind of freaked me out.  </p><p>After the movie, I helped them do a chore.  I had no concept of time whatsoever.  5 minutes could have been an hour to me, I had no idea.  In fact, my friends played a trick on me when I went to the bathroom.  They ran and hid in the hall and shut all the lights off, I had no idea if I had been in the bathroom for hours and they had left me or what.   Turns out that they were just messing with me and I had only been there for a minute or so.  </p><p>With mushrooms, as with any drugs, make sure you are in a comfortable environment.  I was comfortable and I had a lot of fun.  Sounds seemed very distorted and it was one of the few times I've tripped pretty hard visually with mushrooms.  My motor skills were not good at all.  I didn't imagine things that weren't there, it was more like colors and shapes were very distorted to me.  That went along with being very very high the entire night.   I will also say this, mushrooms make everything 'funny' to an  extent, I couldn't stop smiling.  The only negatives I'd say associated with mushrooms are loose stools the next day and a little bit of fear that came from the thinking when I was high.  I started thinking about things in my life that were painful that were there but I hadn't really thought of before.  Shrooms give me some perspective on my life if I take my trips that way.  I've shroomed about 20 times or so and I'd say 90% of the times have been fun. They can be scary but only in high doses from what I've found.</p>"
}
