{
 "title": "LSA Brownies!",
 "author": "sparr0whawk",
 "citation": "   sparr0whawk. \"LSA Brownies!: experience with Argyreia nervosa seeds (Hawaiian Baby Woodrose) (ID 16767)\". Erowid.org. Aug 15, 2002. erowid.org/exp/16767",
 "substance": "Argyreia nervosa seeds (Hawaiian Baby Woodrose)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "12.5 seeds",
   "oral",
   "H.B. Woodrose",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16767",
   "Male",
   " ",
   "Not Given",
   "Aug 15, 2002",
   "55545",
   " "
  ]
 ],
 "report": "<p>\nThis is by far the most intense trip I have ever experienced.  Though I must say, I am fairly new to using drugs as a spiritual guidance and development.  It hasn't even been a year since i first smoked cannabis, and of course I hadn't try anything else before then.  Since then I have tried morning glory seeds a few times and baby woodrose seeds a few times also. </p><p>The first time I tried the woodrose seeds, it was a spritual awakening for me, I had never even felt spiritual things before then.  I was driven by thoughts alone.  As I have been reading all of the morning glory experiences and woodrose experiences I kept wondering to myself: there must be another way to ingest them. Or at least, I wanted to experiment in areas I had not read about and could not find any information about.  I have not read of any experiences with seeds involving cooking experiments, so I decided to make some brownies with the seeds.  </p><p>Ok, this is very simple.  </p><p>I merely put the seeds (25) in a coffee grinder and spun it up until they became a mix of fine powder and a few chunks.</p><p>I put this mix into water before I added it to the brownie mix, just to make sure it got extracted a bit. It was actually only a few minutes before  I added it to the brownie mix.</p><p>Choose a brownie mix from your local grocery store and add the (1/4 cup or so of seed mix) </p><p>That's it! Bake some brownies... and you're good to go. </p><p>As I write this I am currently still tripping.  So, this is the first time i have tried this. </p><p>I must say, it is the hardest I have ever tripped, and with the least side effects of nausea and such. I have never had full blown hallucigenic effects until this day (and I have also tried a few grams of mushrooms before, but for some reason I never experienced true hallucinations) </p><p>Ok, as far as the amount, I ate about half the brownie mix... I really wanted to trip, as I never truly have before.  So I figured half the mix (roughly half the seeds, or maybe more depending on how evenly it was spread throughout). </p><p>I was sitting in front of my computer, waiting... waiting.. an hour or so had passed. I was starting to feel a little something if I concentrated.  Then about two hours after I ate the brownies, I was listening to the usual selections (some final fantasy, absolutely beautiful, peaceful music) and I was entering another world.  I stared at my hands and tried to become completely still, a practice in stillness to harness the energies within me.  My hands begin to blur together and it was as if I truly did leave my body.  I am not too experienced, so I'm not really completely sure what an OOBE is like.  But this sure felt like one.  I was one with the music, and my environment.</p><p>I had many, many visions.. geometry mostly. But they were all completely amazing.. every time I closed my eyes.. I was taken to a new world.. and when I opened my eyes.. the world before me was ever morphing to whatever I chose. </p><p>Eventually I was getting restless.. and all these visions caused me to become rather nauseated.. I decided to take a shower.. and it was a wonderful cleansing.. I sat down in the shower realizing that the water would come strongest closer to the ground for the first time.. (the water pressure is horrible, it basically drips out).. all my shame and pride.. spinning into the drain.. near the end of the shower.. I was really feeling my stomach getting ready to launch itself.  At first, I had fear but then I calmed myself and prepared myself with three big heaves it was over.  </p><p>After sitting there for quite sometime, I finally got up and took pictures.. and all of a sudden I had more energy then I had ever known in my entire life.. I am normally a very, VERY mellow.. laid back person.. and I rarely talk much.. so I lazily go about my physical tasks from day to day.. but then I decided to brush my teeth.</p><p>This is a very interesting note, my teeth feel cleaner than they ever have.  It's like I wasn't thinking about it.. I just let my body furiously brush my teeth.. nothing like I would normally do... because I thought about it so much.. I never used my body like it was meant to be used... my muscles were stronger than they had ever been... I also think it might be something to do with the lsa covering my teeth.. that combined with the toothpaste might have had some kind of chemical reaction.. but I also brushed very hard.. there used to be plaque... but there is no longer.. </p><p>Ok, I really should wrap this up.. </p><p>This has been the most amazing spiritual, physical, mental, emotional trip I have experienced.. I did take a bit too much.. but I don't regret it. </p><p>Take what you can from my words.. as I am now a part of you. </p><p>Farewell! </p><p>~sparr0whawk</p>"
}
