{
 "title": "On Top Of The World",
 "author": "MeTaLHeD",
 "citation": "   MeTaLHeD. \"On Top Of The World: experience with Oxycodone (ID 16787)\". Erowid.org. Sep 17, 2002. erowid.org/exp/16787",
 "substance": "Oxycodone",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16787",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 17, 2002",
   "Views: 65708",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA bit of a background. I'm 16 years old, in pretty good shape and health, and I consider myself a frequent user of cannabis and very curious in the world of drugs and self-introspective work. And, hell, everyone needs some fun now and then. My drugs of choice would have to be hallucinogens, and analgesics. A list of the drugs I have tried? Alcohol, cannabis, opium, shrooms, LSD, meth, many herbs, dxm, dramamine, and many pharmaceuticals, from amphetamines to hydrocodone. <br>I have never done an opiate harder than codeine, nor an opioid harder than hydrocodone. For an idea to my tolerances to these drugs, 25mg of hydrocodone is all I need for a very nice, itchy euphoric buzz.<br>Ah, now for the report. This is my first time with oxycodone, so I want to start the dosage low to prevent any kind of overdose. My mood before taking the pills was generally peaceful and happy, but kinda anxious, for I was waiting untill today to try them out. I'm also kind of excited.<br>5:00min-<br> I eat a good dinner, and take my daily multivitamin.<br>5:10pm<br> I cut up a 40mg Oxycontin pill into 4 almost equal portions, and crush one portion into a fine dust. Rolled up a dollar bill, and sorted it. Wow, almost no burn at all.. much better than meth was, argh.<br>5:40pm<br> Ah, very familiar to the onset of a vicodin buzz. Slight, pleasant ichyness in hands and feet, and my stomach. Slight drip, so I drink a glass of orange juice. Slight perception changes.<br>5:55<br> Nothing new, aside from growth of intensity from last entry.<br>I can compare the overall effects to a nice bong rip of some decent MJ.<br>6:10<br> Wow. I can see the addiction potential already, (un)fortunatly I have only about 4 pills at my disposal. My vision has slowed down and changed, very similar to that of the effect of THC. My body feels pleasantly warm, and has the general feeling of floatyness..<br>Very nice. My thoughts seemed slowed, but at the same time clear and very alert to the world. I feel like talking, so i'm gonna see what my little bro's up to. <br>6:30<br> I would imagine that this is near the peak. I feel amazing body buzz, similar to what I think 40mg of hydrocodone would be like. <br>I feel very, very confident in myself, and mellowed-out, no discomfort at all. I suffer from generalized anxiety disorder, and was on Paxil for about a month before I quit it by myself, as I was getting bad withdrawals. I really like the boost in self-confidence. I am chatting with some friends on AIM, just talking about stupid shit but they haven't ignored me yet. I would call this state quasi-euphoric, almost on top of the world. I would discribe my mind as spaced out, yet aware of my surroundings, but not giving a damn about any of it.<br>7:00<br> Things are still the same from that of 30mins ago, I almost feel as though it's starting to comedown. The thought of another dose comes to mind, but is easily dissuaded with a cigarette. The cigarettes picks up some the peaking effects, mellowing me out even more, and clearing my mind. Some decent bud would be great with this drug, I wonder about any synergy between them.<br>7:30<br> Wow. I'm just left with this content state, not wanting nor needing anything but some music; and by the way, music sounds great, and I can somewhat feel more connected to the songs. I would imagine this is what heroin would be like. <br>Conclusion<br>I really like oxycodone. As I stated before, I really can see an addiction possible, but I have very strong will power. I can see it as a great complement to a saturday afternoon with some friends, smoking some nice buds and just hanging out, enjoying life.<br>And thats what we should do, enjoy life, and not let drugs consume it. I had no negative effects other than ichyness and very, very slight stomach discomfort, which was easily countered with some ginger. Thanks erowid, for all the information and help you've given me and so many others.<br>Peace.<br>Dan.\n\n\n"
}
