{
 "title": "Too Loud",
 "author": "Zach",
 "citation": "   Zach. \"Too Loud: experience with Mushrooms (ID 16821)\". Erowid.org. Jul 22, 2005. erowid.org/exp/16821",
 "substance": "Mushrooms",
 "bodyweight": "117 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16821",
   "Male",
   " ",
   "Not Given",
   "Jul 22, 2005",
   "3384",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At the time, I was 15 and just getting into drugs. I am in a band called [deleted] (properly named after a slang term for LSD). WE were having a sleep over at my lead singers house, and we were able to get our hands on an eigth of shrooms. Since my singer and my guitarist had already done it before and me and the other guitarist (mike) havent, we decided that me and mike should split the eighth. We smoked so weed first, and then we split the 8th into halves. I ate my half and drank some beer to wash the terrible taste. I looked at the clock, it was about 11:30 P.M. I was sitting in a chair under 3 multicolored lights, and I was wondering when I was gonna start feeling it. I became slightly lightheaded and I was stoned. Suddenly the 3 multi colored lights became much more intense and colorful, and they began almost doing a dance. I looked acroos the room at my bandmates. I could tell mike was feeling it because he was waving at the air and giggling. Suddenly he stood up, he had this amazed look on his face and said to me 'Zach! Try standing up its soo messed up.' </p><p>So I stood up, and the entire floor of the room turned pitch black and I felt like I was standing on air, and the room filled with muli colored fog. My singer yelled at me to shut up because I was yelling how cool it was and his mom was sleeping upstairs. But I had no clue what the meaning of 'shut up' was, and I didnt know how to speak lower if I did. I sat down on the floor next to the bed and I got this tingly feeling from everything I touched. For some reason this feeling led me to believe that the floor was eating me...but it felt strangely good and I thought it was nice. I looked over at mike again and he was holding a halloween mask that was laying around. We had joked around before taking the mushrooms that we would scare each other with it. I wanted to tell mike not to put the mask on but I had no clue how to go about saying it. He put the mask on and jumped on me. When I landed it felt like a million particles were shifting under my weight and it felt so good that I began to cry. Jon, my other guitarist, started saying something about how I was really tripping hard. Mike was laughing and I felt shitty because everyone was laughing at me. I opened my mouth to speak but couldnt. Jon said 'Just leave him alone for now and let him trip, he's REALLY fucked up'. I felt like a caged animal and they were all laughing at me. </p><p>I apologized and asked for some music. Greg (my singer) gave me his discman with our bands demo in it and I put it on. I closed my eyes and the second the music started I saw these amazing visuals. They were all abstract and were amazingly colorful. I couldnt even hear the music, but I heard some kind of beautiful noise ringing in my head. I took off the headphones and opened my eyes to find myself lying under gregs desk with a giant smile on my face. Mike was walking around the room. We suddenly heard a noise upstairs and Greg told me and mike to shut up cause we were being very loud. WE thought his mom was up and greg turned out the lights. I was sitting on the bed, mike was sitting on the floor in front of me. When the lights went out I saw 12 poles surrounding me, each with skin from a face hanging on it. They were all whispering the number 12 to me. It was a scary visual, but it didnt scare me. I heard Mike scream in the distance and suddenly the lights came on. I saw mike standing by the switch breathing heavy, rambling about some jumping shadow. </p><p>Greg and Jon were at this point really pissed off at me and mike because we were being loud. Jon told me I was being an asshole and I got very offended and hurt by this, even though normally I wouldnt have cared. I wanted to go outside where I could be as loud as I wanted to be. But I couldnt tell them, so I just sat there. I realized I was being strangely quiet and everyone was staring at me. Mike was now quiet to except mumbling about being on the same wavelength as me. Jon said 'okay. You two are quiet, now we can smoke' and he packed a bowl of weed. When it was my turn I walked over to get the bowl and the trip to the window seemd to take an hour, although it was only maybe 5 seconds. I took a hit and sat down. I looked at the clock, and it was 11:46. How had so much happened in such a little amount of time? I stared at the clock in wonder. I took another hit and sat down after what seemed an eternity. It was 11:47. I was amazed how slow time passed and this continued for 5 minutes. Finally I said something like 'Wow. Time must have taken long on the mile'. Jon said 'what the fuck are you talking about?' and I shut up. </p><p>Finally, Mike said 'I want to go outside.' I was so relieved he wanted to also and I agreed. Greg didnt want us to go upstairs but jon convinced him to let us go as long as we stayed in mikes car. So me and mike walked down the dark hall to the stairs, a journey that seemed to take a long time. The next thing I knew I was outside walking towards the car. But we walked past the car and kept walking. We decided to walk to 7-11. On the way there we smoked a few bowls and were just feeling very good. We got to 7-11 and we each spent about 10 minutes figuring out how to pour a slurpee and we went to go pay. Mike took out his wallet and couldnt figure out what to do next. The cashier was staring at us, he had to have known. I dont know how much money mike gave him but we left. We got outside with our slurpees and I said 'where the fuck are we?' and hes like 'I dont know' and I saw a sign for a store that I recognized, but I couldnt remember where it was. Finally it snapped and I realized what road we were on. This realization made me overcome with joy and made me feel like I could figure out anything. I said 'shit. We have to cross the road'. </p><p>I ran across the road, then I realized that it was empty because it was now almost 1 in the morning. We got to a parking lot across the street and I started to realize that everything was just an illusion. I fell down on the concrete and pointed to a little rock. I said 'Hey mike...see this rock? Its not real' and I went on about how everything was an illusion and was there just for our entertainment. We kept walking and I soon forgot my theory. I started to think of some memories, mostly of my deceased grandfather. It seemed like he was alive again and was living in my memories. This made me very happy and before I knew it we had made it back to mikes car. We sat inside and put on Ozzy Osbourne. The song 'Mr Crowley' came on and I looked at my reflection in the window. My head started to grow bigger and turn colors, and my ears got pointy and I grew horns. I felt like I was some kind of medievil monster that you find in a fantasy book. This gave me almost a feeling of power and I realized that my foot was playing with my shoe that I had taken off, it wa giving my feet that tingly feeling. </p><p>Suddenly mike shouted 'CAT!' and pointed out the window. There was a cat standing there and I saw it grow big and run away. Then behind us a truck was passing by and I saw the headlights change colors and fly through the car. I looked over at mike to find him sleeping. I did the same too, and I woke up in the morning back to reality, and a major headache.</p>"
}
