{
 "title": "A Night In Heaven",
 "author": "Bakers Dozen",
 "citation": "   Bakers Dozen. \"A Night In Heaven: experience with Cannabis (ID 16851)\". Erowid.org. Jan 17, 2009. erowid.org/exp/16851",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16851",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 17, 2009",
   "Views: 3650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well it was during the middle of summer vacation my friend paid 60 dollars for an eighth of this really good smelling marijuana from a guy that usually doesnt get the best stuff. But he claimed that this was really bomb ass dank. So we bought it expecting to get the same stuff that we usually get and to be high for about 1 hour. So I stayed at my friends house that night to smoke it and he had already been caught by his dad once so we had to be careful about how we did it. We started at about 11:00pm and we had an awesome glass pipe I had just bought from my friend with a nice size bowl packed into it already. My friend since he paid for it got the first hit. After it got passed to me about 10 times I was done and ready to trip out. We had smoked in all about 2 bowls and then couldn't even inhale smoke anymore so we were forced to quit.</p><p>After that I don't really know what happened we listened to a mix of songs I had made especially to make u trip out. There was lots of techno and weird stuff like English guys singing. Then we got to the techno song called Marijuana In Your Brain this is when all the weird shit started happening. My spine felt like it was moving up and down through my back making it tingle, my head felt like it was flying off of my body into heaven, and my feet stayed on the ground which sort of scared me because I'm afraid of heights and looking down from the clouds was pretty high up, and I could see myself going through the ground all the way to the core of the earth. It was the craziest thing I have ever felt.</p><p>Then we realized that we had a huka party poster that reacted to a black light that we haven't even looked at yet. So we turned on my blacklight and I looked at the poster and listened to the music again. I was laying on my friends floor staring at the poster when all of the sudden there were 4 mushrooms in the corner that started moving in a circle, and all of the sudden I was sitting in this park and all these kids were yelling and I couldn't figure out what was going on. But luckily then I realized I didnt like this and it was the song doing this to me so I jumped up and switched the song.</p><p>Then I laid back down on the floor looked up and closed my eyes. When I opened them it was morning but I was still feeling a little high so I got up and then decided we were going to go out for breakfast so we smoked another bowl and went for breakfast at the same place we work. That was a mistake because when we came back the high was pretty much done ,it had been about 3 hours and his dad had came home early, he ran into my friends room after us and opened my friends dresser and pulled out all of our weed, pipe, and a methadone pill we had just got. My friend was grounded for month and his dad never told my parents. My friend that I had got the pipe from was pretty mad because he had smoked about 4000 times out of it and now it was gone. I now have quit because this whole time I have been getting piss tested by my parents and if I fail another one I have to go to rehab.</p>"
}
