{
 "title": "Sweeping Calmness",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Sweeping Calmness: experience with Alprazolam (Xanax) (ID 16880)\". Erowid.org. Feb 10, 2004. erowid.org/exp/16880",
 "substance": "Alprazolam (Xanax)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "0.25 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16880",
   "Female",
   " ",
   "Not Given",
   "Feb 10, 2004",
   "Views: 57355",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've recently begun to have problems with anxiety attacks in addition to depression. Cannabis usually helped to calm me when I had attacks, but it wasn't always available when one was triggered. </p><p>One morning before I left for work I noticed the usual symptoms of an oncoming attack, but I knew that it would be difficult to function at work if I smoked. I decided to look through our medicine cabinet to see if we had something, anything to get me through it. I came upon a nearly full bottle of Xanax, and took a .25 mg dose at 7:45 a.m. The onset took about 20 minutes, and I was feeling better, almost normal. At 30 minutes I was extremely calm and the symptoms of the attack were gone. Once I arrived at work I found it was somewhat difficult to concentrate, but nothing extreme. I also noticed that I was speaking more slowly than usual, but I was too relaxed to try to sound normal. </p><p>Around 10 a.m. I was getting pretty lethargic, but I was completely enjoying it. I wanted nothing more than to just sit at my desk and stare out the window. This relaxed state lasted throughout the day, and I went home and slept the best night's sleep I had had in 3 months. </p><p>The symptoms of Xanax reminded me of Valium, but without the difficulty moving and thinking I have with Valium. It is definitely a good drug to help with anxiety/stress/sleeping trouble, but I wouldn't recommend taking it before driving.</p>"
}
