{
 "title": "Psilocybin Abatement",
 "author": "Notseinfeld",
 "citation": " Notseinfeld. \"Psilocybin Abatement: experience with Cluster Headaches and Mushrooms - P. cubensis (ID 16882)\". Erowid.org. Nov 8, 2007. erowid.org/exp/16882",
 "substance": "Cluster Headaches and Mushrooms - P. cubensis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16882",
   "Male",
   "",
   "Not Given",
   "Nov 8, 2007",
   "7530",
   " "
  ]
 ],
 "report": "<p>As a chronic sufferer of cluster headaches for the past year I was desperate to find a way out of the random pain prison. I lost 2 businesses, a commercial building, and countless nights of sleep. Preventatives dealt with symptoms (miserably I might add) and I needed to get to the cause. The following is a brief report of limited success with psilocybin mushrooms.</p><p>Ordered spores and bag for sterile growing. </p><p>Harvested and dried.</p><p>Detoxed on all medication for 2 weeks prior to ingestion.</p><p>Began with 2 grams dried and got slight hallucinations with a mild attack at the end of the evening. This was unusual since all attacks for me are severe and last >20 minutes. After this first dose I was H/A free for about 6 days with minor shadows. From my reading I decided to do a follow up dose again with 2 grams. Almost identical response occurred with a mild attack at the end of the trip. </p><p>I got a typical severe attack about 5 days later. Being chronic I attempted to raise the dose as 2 grams provided some relief perhaps 3 would provide a bit more. Basically, I was looking to break the cycle and find the least amount of discomfort (the ride) in amount of mushrooms as possible. The 3 gram trial went on week after week for about 4 consecutive weekends with similar patterns of end of trip Headache and shadows between dosing. </p><p>Finally I tried a 4 gram treatment about six weeks ago and have only had a handful of attacks with the same characteristics as before the mushroom treatment. That would be an attack almost every day the very second my eyes opened in the morning. </p><p>In summation I have had mixed results with psilocybin treatment as a chronic sufferer and will re-visit this therapy if/when I detect a change in the manifestation of the headaches. Clearly this therapy has a direct effect on the neurophysiology of our condition and I'm very grateful to those who have helped to amass knowledge on this subject.</p>"
}
