{
 "title": "The Beach Fairy Tale",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The Beach Fairy Tale: experience with 5-MeO-DiPT (ID 16949)\". Erowid.org. Jul 7, 2006. erowid.org/exp/16949",
 "substance": "5-MeO-DiPT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "12 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)",
   "  T+ 1:00",
   "12 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16949",
   "Not Specified",
   " ",
   "Not Given",
   "Jul 7, 2006",
   "6123",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>BACKGROUND</p><p>I had tried 12mgs three days prior to this event, went on a pretty hard and BAD trip concerning my heartbeat/pressure (all in my head) but that had been left behind.</p><p>SETTING/LOCATION(S)</p><p>On a Saturday, I decided to go to a club. The club is a small relaxed light museum in Florida with a DnB room and a chillout/trance room, both with cool art displays on the walls with trip intended purposes. I had promised myself never again to take '5' after what had happened to me earlier in the week, but the place was empty as hell and I had four 12mg capsules with me, so me and my friend both take a 12mg cap. After about an hour, my friend starts going all crazy (excited) about the mild visuals hes getting since cid has been dry for so long and the last time he could recall having visuals was nearly 2 years ago, while I'm like no big deal, I got the visuals last week and really thought of them as lame at first. On the way back to Miami we decide to drop another 12 each, since we plan on keeping the night alive.</p><p>AFTER THE BOOSTER DOSE</p><p>So we decide to go to another club to enjoy our trip and hopefully find some beans (my friend was fiending them shits so bad it was killing the vibe, but!) we end up waiting in line at Space, when we start to come up.</p><p>THE COME UP</p><p>Damn! It was nothing like the previous 2 trips. The melting visuals were UNSTOPPABLE, confusion ruled with the movements of the crowds. Voices, conversations, sounds, all created a pretty annoying moment, although not enough to cause a bad trip. We just wanted to get inside and enjoy. It had been about 45 minutes since we had taken the booster dose and the trip was getting harder and better every second. While we were coming up, the door man announced it was now $40 to get in, so we just said F'this and went for the car. </p><p>THE PEAK TRIP</p><p>Here's were the bad ass trip starts. By this time, visuals are at full blast. Better than any LSD visuals I can remember, the contrast b/w dark and light just shined and bursted, patterns melted, the reflectors on the road smudged off the pavement, whatever I saw looked distorted but convincingly REAL and there was no way any thought would make me think otherwise. The music was just sickening, just like when I'm on LSD. We had some hard house on, I believe DJ Brian he told me. My friend is driving down the causeway that connects downtown Miami with South Beach. We're crossing the causeway, just hypnotized by the huge cruise ships lined up after each other with their huge colorful flags and catchy deco's. The Palm trees looked like jewels from God. Huge palm trees, just waving their leaves in the air in slow motion. I felt like I was in a giant beautiful world. We get to a road, where to trip hit it's peak. </p><p>The A/C was blowing just right, the temp was so cold/comfortable it felt like a dream. Looking down Ocean Drive from south to north, each beautifully designed building, each neon sign, exotic car, palm tree, cloud, everything was a fairy tale. Life was perfect. Everything seemed like it couldnt look any nicer, impossible. I couldnt believe what I was seeing. I would say to myself, this is so much better than acid, this is so much better than acid! The hallucination was not only visual, it was mental, (audio?), and emotional. </p><p>Way better than LSD and MDMA to me now. I remember lights looking so pretty on MDMA, the glowsticks, the vicks. '5' has proven to be better in that area. The body buzz was better than MDMA as well (maybe equal to early MDMA experiences, just not equal to the current MDMA effect I get now), I was blowing myself up giving myself face massages, and put myself in a state of happiness I had only experienced with MDMA my first 2-3 times (aka magic) and once with 2C-T-7. But the happiness and pleasure generated by '5' was much stronger and clearer. </p><p>It felt pure. I couldnt stop smiling for such a long time. Happiness rushed into my body, a happier happiness than that of MDMA. Definitely 12mgs is enough to cause some visuals and mind trip, but Im going to dose with at least 20mgs and then maybe boost with 12. I felt he body buzz from the booster dose intensified the mental/visual hallucinations and it was this buzz what pulled me into beautiful closed eyed worlds almost identical to T7. When I closed my eyes, I'd see colorful sparks just burst out of everywhere, nonstop. </p><p>So far, its been the closest thing to T7, as CEVs are my favorite and the happiness state (magic) of MDMA has been completely lost for me now. '5' is a true and total hallucination. I am completely immersed by a different reality, not like AMT where its confusing and crappy visuals. '5-land' is a beautiful fairy tale. Its a different reality, just as convincing as acid.</p><p>I dont think I had ever gone on a better trip than this one. I feel T7 was almost this good, but the visual effects of '5' are better than anything I have ever tried. '5' is definitely more toyful than LSD, AMT, shrooms or MDA. Rates #1 in fun.</p><p>P.S Walking was a hard task, as it was hard to actually feel my legs. Not that they were numbed out, but the walking process just came like second nature I got all freaked out when I thought of the voluntary action of walking, too much.</p>"
}
