{
 "title": "Beware the Salvia Spirits - They're Pissed Off",
 "author": "Arthur B. Goodwill",
 "citation": "   Arthur B. Goodwill. \"Beware the Salvia Spirits - They're Pissed Off: experience with Salvia divinorum (ID 16954)\". Erowid.org. Dec 12, 2003. erowid.org/exp/16954",
 "substance": "Salvia divinorum",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 16954",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2003",
   "Views: 8582",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy friends and I had heard of, and used, Salvia long before it gained sudden popularity at one of the two head shops in my small Central Valley town. However, our experience with this strange drug had been limited to its use as mild, relaxing additive to marijuana joints. Salvia exploded with popularity when a head shop began selling it by the gram and letting its customers sit right there in the shop with a glass hookah to use.  \r\nMy curiosity for an intense Salvia trip was aroused, but I was also weary from a friends description of his own trip, when objects in his room became personified and his lighter was definitely against him.  This from a man whom I trust an incredible amount, especially dealing with hallucinogens.  \r\nAlas, the heart wants what it wants so very soon I found myself in the shop, ready to have a go at it.  My friend Matt had purchased a gram of the Salvia earlier that day, and we wasted no time packing a healthy bowl of the dried leafy material into a two-hosed glass hookah. We set torch to leaf and inhaled a mighty hit.  While we held it in, I packed another bowl that was ready as soon as we exhaled.  The next hit was bigger and we made sure we held it in as long as was humanly possible. \r\nI felt the effects almost immediately.  An impossible to describe gripping sensation pervaded the top half of my body, and I could feel its effects strongest on my chin.  I felt that if I opened my mouth and stretched out my jaw, it would melt off of my face and drip to the ground. My hands felt connected to the table.  I could see that they werent, but my mind knew that somehow, someway, my hands had bonded with the heavy wood of the tabletop.  My legs, wrapped around the legs of the table, also seemed to morph and bond with the tables material.  The effects lasted not more than a full minute.  I felt a clammy, uncomfortable sweat and I was still a little off, but the gripping, twisting sensation that I had felt was completely gone.  \r\nWe decided to smoke some more, using the same method.  This time, a single hit was only necessary and the gripping sensation wasnt present, but the table top appeared to be moving  underneath my hands as if it were a conveyor belt. People were moving around me, talking to the shopkeeper, looking at glass pieces and I found it incredibly funny that they couldnt see that the table I was sitting at was in constant motion. This caused a contagious, uncontrollable laughing fit that finally started to wear off when the Salvia did.  \r\nWe decided to give it one more try, mostly just to finish off what Matt had bought. I think we had already decided that we both werent very big fans of the stuff; it was interesting, but it lacked the poignancy and power of our longtime ally psilocybin. This time I made sure that I took quite a few heavy hits and held the smoke in for an extra long time.  The effect was immediate and strong.  That gripping, twisting sensation was back, but this time I realized that friendliness was not behind this force. I felt the sudden violent presence of Salvia in my mind, a countless number of nasty voices mocking my decision to use this drug as if it were a safe activity fit for recreation. I suddenly knew that if the gripping sensation that was rapidly moving from my face downward was to completely engulf me, I would be at the mercy of these unhappy spirits. I staggered up from my uncomfortable chair and shuffled a few feet back from the table, in my mind a safe distance from a piece of artwork on the wall that in my mind represented these unhappy spirits. \r\nMy friend Matt, meanwhile, was describing the effects of Salvia to a few interested observers, selling the idea to them in a way.  For half a second he was a figure to be feared because of his association, and apparent endorsement, of the drug. Then I remembered that he wasnt dealing the stuff, only describing it, so my fear ran into a brick wall. A few seconds later I was somewhat levelheaded again, and all crazy thoughts had subsided. The real heavy fear and voices might have lasted a good 45-60 seconds, but it was an impossibly long time full of immediate, in-my-face realities. \r\nAll in all, the Salvia was not a very friendly companion. I am still interested in the drug, but that mocking anger and anxious paranoia that I felt still rattles me a little.  Also, the stuff doesnt exactly taste great, and I dont like the accompanying cold sweat.  If further experimentation were to occur, it would have to be done the right way, in a dark room with good music blasting.  Until then, Im happy to keep up a constant companionship with the always helpful and mostly friendly mushroom.\n\n\n"
}
