{
 "title": "Curiosity",
 "author": "Neil",
 "citation": "   Neil. \"Curiosity: experience with Chlorpheniramine Maleate (ID 16957)\". Erowid.org. Oct 4, 2004. erowid.org/exp/16957",
 "substance": "Chlorpheniramine Maleate",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Chlorpheniramine Maleate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16957",
   "Male",
   " ",
   "Not Given",
   "Oct 4, 2004",
   "22007",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Erowid reports of DXM in combination with CPM carry warnings; CPM-alone health risks unclear.]</p><p>My pills are called 'Allergy Relief Tablets'.  They come in a box of 30 uncoated pale yellow pills, each containing 4 mg of CPM maleate. I experimented with various dosages, gradually increasing my dose as I went along.  The largest dose I have taken in one day is 60 tablets, or 240 mg; doses were generally spread over a 15-20 minute period.  </p><p>The effects are as follows:</p><p>* Sleeplessness - the stuff can make you sleepy, but large doses keep me awake.  I feel like I have lots of energy as well.</p><p> * Tremor - in combination with caffeine this can make my hands shake quite badly.  Other parts of the body tend to twitch.</p><p>* Exaggerated startle reaction - loud sounds make me jump far more than usual after taking CPM.</p><p>* Vivid hypnogogic / hypnopompic images - like diphenhydramine & scopolamine, but not as intense.  The most pleasurable aspect of the drug.</p><p>* Increased vividness of images.  This seems to be more prominent with paintings and drawings rather than photographs.  The real world doesn't seem any more vivid than usual.</p><p> * Nicotine craving - An odd one.  I guess the anticholinergic activity of CPM might create an imbalance, and the body wants it rectified by a cholinergic agonist like nicotine??  But that's a rather woolly explanation.  Nonetheless, I do feel the urge to smoke cigarettes when I have taken CPM.  Which leads to the next effects:</p><p>* Elimination of coughing reflex </p><p>* Elimination of nausea</p><p>Together these mean that I can smoke cigarettes as heavily as I like under the influence of CPM, without (immediate) penalty.  This is probably the worst aspect of it for me.  Normally I'm protected from smoking cigarettes by my tendency to cough and feel sick from them, but this is absent with CPM.  But I can't blame my behaviour on the drug.  </p><p>* Erection and horniness.  Seems to go together with the nicotine craving.  </p><p>* Emotional volatility.  A general feeling of 'cosiness' or warm comfort can change quite quickly to a short bout of depression, lasting up to half an hour.  Then the comfortable feeling returns.</p><p>* Odd taste in mouth.  My saliva seems to have a strange metallic taste.  It's not particularly unpleasant, but it is unmistakable.  This is one way of knowing when I'm under the influence.</p><p>* Visual flickering.  This is subtle compared to datura, scopolamine, or diphenhydramine, but definitely perceptible.</p><p>CPM has a long half-life -- I have seen figures of 28 and 40 hours.  The subjective effects seem to last 3-4 days after a large dose, and I am protected from hay fever for about a week.  There is a withdrawal effect which is, not surprisingly, intense sneezing, runny eyes and runny nose (lovely...)  Avoiding this withdrawal has lead to repeated administration, a sort of addiction.  Tapering the dose over a month is an effective method of preventing this, and does not even require any willpower.</p><p>I have not noticed any long-term effects from my experimentation.  So I can say that repeated administration of >100 mg CPM to myself has not resulted in any perceptible health problems.  The only problems have been coughing and phlegm from smoking, which goes away within a few days.  Perhaps CPM + DXM is a problematic mixture.  However, in my DXM-using days, I sometimes used cough medicine containing CPM, with no unusually negative effects.  I did have a mildly negative experience with pseudoephedrine-containing medicine, though -- felt stiff all the next day.  </p><p>Caution, though -- it's been OK for me, but it might not be fine for you.  Don't take pointless risks.  Oh yes, you shouldn't take it with MAO inhibitors.</p><p>Summary: I took this as a possible substitute for diphenhydramine, but it is only a pale shadow of that drug.  It is not particularly pleasant, nor unpleasant.  Some of the effects are mildly interesting.  This trip report is probably the most useful thing to come out of my experiences.  Hopefully anyone who was curious about CPM can read this and not waste their money or time on this drug.</p>"
}
