{
 "title": "Three Trials",
 "author": "Skandre",
 "citation": "   Skandre. \"Three Trials: experience with Yohimbe (ID 16974)\". Erowid.org. Nov 11, 2002. erowid.org/exp/16974",
 "substance": "Yohimbe",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Yohimbe",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 16974",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 11, 2002",
   "Views: 21076",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI recently started experimenting with some of the legally obtained natural herbs available online. There were many conflicting reports that I read on the substance yohimbe. I chose to order a liquid extract. The extract has a bitter taste, but is not difficult to ingest. My first three experiences with this substance have all been very positive. I will briefly describe each experience.</p><p>My first experience: I tried the extract on it's own. The bottle recommends 30-40 drops of the substance. This turned out to be roughly two dropper-fulls. About 15-20 minutes after ingesting the extract, I began to notice effects. I felt very stimulated. My energy was increased. It felt similar to a large dose of caffiene or nicotine, without the harsh side effects. This lasted for approximately an hour or so.</p><p>My second experience: I used about 4 dropper-fulls of extract on it's own. I felt really wired, but not in an unpleasant way. I can't really say that I felt 'horny' (since this substance is rumored to be an aphrodisiac), but I was really enjoying the effect. A friend and I went to an amusement park. I purchased a small bottle of Jagermeister and drank nearly half of it before entering the park. The alcohol seemed to have no effect! It was very strange, but the yohimbe and the alcohol seemed to 'cancel each other out'...but I still felt great. The effects lasted a couple of hours.</p><p>My third experience: I decided to combine yohimbe with a light marijuana buzz...wow! Usually, marijuana can make me anything from lethargic to hyper, depending on the strain and the situation. With about 4 dropper-fulls of yohimbe, I always felt 'on top' of the buzz rather than consumed by it. I had sex on this occasion and it was awesome! I didn't feel 'hornier' than usual, but once stimulation began it was a great time. I think this stuff would help people who have a hard time 'getting it up'. For me, it greatly enhanced my control and stamina...I was able to last for nearly an hour! It took a longer time to come down from this buzz, maybe a few hours.  </p><p>In conclusion, Yohimbe is one of the best legal substances that I have experimented with. I would not consider it a 'psychedelic' type of drug, as its effects are that of a stimulant. I enjoy the effects, and have had no negative side effects so far. It seems very non-addictive (it's been nearly two weeks since I have last used it). I would have to recommend this substance...just be sure you are in good health, since it definitely increases the heart rate.</p>"
}
