{
 "title": "Not Very Impressed With Betel Nuts (So Far)",
 "author": "Skandre",
 "citation": " Skandre. \"Not Very Impressed With Betel Nuts (So Far): experience with Betel Nuts (ID 16976)\". Erowid.org. Sep 23, 2002. erowid.org/exp/16976",
 "substance": "Betel Nuts",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "sublingual",
   "Betel Nut"
  ]
 ],
 "footer": [
  [
   "2002",
   "16976",
   "Male",
   "",
   "Not Given",
   "Sep 23, 2002",
   "21028",
   " "
  ]
 ],
 "report": "<p>\nWhen looking through experience reports on the web, I read some reports on Betel Nuts. Most of the reports seemed to be positive, so I decided to give them a try. I found an online vendor that sells them and ordered a 100 gram bag. When the package arrived, I decided to try them immediately. Inside the bag of nuts was a packet of mineral lime and instructions on the preparation of the chew. </p><p>I used roughly 2 grams of sliced and dried nuts. I moistened them with saliva, then powdered them with the mineral lime, as instructed. I placed them into my mouth, between the cheek and gum (similar to chewing tobacco). After a few minutes, I began to feel a buzz coming on. It gradually increased to become quite pleasant. Unfortunately, it was very short lived...I felt normal again in about 10 to 15 minutes. I would relate the buzz to be almost identical to the first time you smoke a cigarette or chew tobacco, though I felt no nausea. </p><p>The reason that I am dissappointed with Betel is that this first experience is the one and only time I got any real buzz from it. I have tried it many times since and have felt pratically nothing. In addition, the taste is not especially pleasant and the texture sucks...it is almost painful to keep them in your mouth. When I chew the nuts, they break up into small pieces that are hard and gritty. It is almost impossible not to swallow the small chunks (which you are not supposed to do). </p><p>My bag of nuts is gone now, and I have no desire to purchase them again. However, being the true experimenter that I am, I would like to try an extract of the substance...perhaps this would work better. Also, I have seen a product online that offers these nuts in an activated and flavored form, with enhancing ingredients added. I might try these alternative methods of ingestion at some point. If I find that these work better, I will submit a new report stating my experience. So far, however, I am not at all impressed.</p>"
}
