{
 "title": "Scopohuasca",
 "author": "Neil",
 "citation": "   Neil. \"Scopohuasca: experience with Scopolamine, Syrian Rue & M. hostilis (ID 17087)\". Erowid.org. Aug 25, 2004. erowid.org/exp/17087",
 "substance": "Scopolamine, Syrian Rue & M. hostilis",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.6 mg",
   "oral",
   "Scopolamine",
   "(pill / tablet)",
   "  T+ 0:20",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "(extract)",
   "  T+ 0:30",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "(extract)",
   "  T+ 0:40",
   "3.0 g",
   "oral",
   "Mimosa tenuiflora",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17087",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 25, 2004",
   "Views: 23389",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been using ayahuasca recently, and have been wondering how to relieve the dreadful nausea that mars the first half of my trips.  With this in mind, I decided to try scopolamine, bought as a travel-sickness remedy at a pharmacy.  </p><p>Ingredients: </p><p>   2 scopolamine tablets (0.3 mg each)</p><p>   4 gms syrian rue/peganum harmala seeds</p><p>   30 mls previously-made mimosa hostilis brew (~ 3g)</p><p>I boiled the syrian rue seeds in a small pot with some vinegar, turning on the fan as high as possible to vent the awful smell.  At the same time I defrosted some frozen mimosa brew.  The brew was made from 28g of mimosa root powder; I estimate that I used about ten percent of it, i.e. 3g of mimosa.  The timeline here begins at about 8 PM on a Tuesday night.  I had had a quiet day at work, the weather was pleasant, and my grandmother had phoned with good news.  The auguries were favourable.</p><p>0:00 Take a scopolamine tablet.</p><p>0:20 Take a hefty sip of syrian brew through a straw, immediately chasing with orange juice (freshly-squeezed, the best!) to mask the disgusting flavour.</p><p>0:30 Take another hefty sip of syrian brew.  Wonder whether taking it as an enema might be rather more pleasant...</p><p>0:40 Drink the mimosa brew.  This isn't too bad.  Usually this is where I start to feel sick, but I seem to be OK.</p><p>1:20 Wondering whether I'm tripping and whether I should drink more mimosa.  After all, I usually have twice as much for a mild to moderate trip.  There's a vague sort of 'trippy' feeling, but not much more.  I feel a slight discomfort in my abdomen, but nothing that could be described as nausea.  I decide not to drink any more for now.</p><p>1:40 OK, I'm tripping.  More than I would have expected to on 3g of mimosa.  The difference between ayahuasca with nausea and ayahuasca without nausea has to be experienced to be believed.  The idea of accepting the nausea and going along with it and welcoming it as part of the experience is fine, if there is no way to avoid nausea.  But if you can avoid it, do so!  There is no virtue in undergoing unnecessary pain.</p><p>1:50 Go for a walk around the block.  Normally I would have to forgo this as I would be scared of vomiting violently in public. I am full of energy, and the world is quivering with excitement.  </p><p>2:00 - 3:00 Do various standard trippy things like gaze at my plants, listen to music (Ambrosian chant by the female Italian choir 'In Dulci Jubilo' -- absolutely heavenly, whatever one's state of mind), read, look in the mirror, get to know the back of my hand, grin widely, etc etc.  No great mystical revelations or ontological crises, but a lovely flow of love that makes you adore all of creation.  I cry, as I cry on almost all trips.  It's not connected with feeling sad; it's an expression of the overflowing abundance of life.  I won't go into all my experiences in detail here -- they were wonderful to me, but there are much more florid and fascinating trips written up by other people.</p><p>I realize that although I am tripping quite lightly, in terms of alterations to my thought processes, the visual effects are very strong.  I experience visual distortions that usually require double the dose.  Wondering whether the scopolamine is responsible, I take another tablet. Unfortunately, the DMT is wearing off at this point and nothing much comes of it.  I would like to re-dose, but I have to go to work the next day.  </p><p>3:20 - 4:00 Lying in bed experiencing the luxuriant relaxation of my body in the DMT afterglow.  I feel myself to be a curious little monkey. Everything seems wonderful. The only discordant note is the slight thirst caused by the scopolamine.  Not a problem.</p><p>I woke up the next day (i.e. today) feeling a little dehydrated, but otherwise fine.  I slept well, and my dreams were not particularly unusual.  Today I feel fully mentally competent, and the world looks luscious.  The combination of scopolamine with ayahuasca succeeded in its purpose of eliminating nausea.  There do not seem to have been any negative effects (apart from a dry throat) resulting from scopolamine+ayahuasca at these doses.  I would like to explore the possibilities of combining scopolamine and ayahuasca, trying the effects of different doses.  As I have a few (ok, 3) datura plants growing, I may one day experiment -- very carefully! -- with using those instead of scopolamine.</p><p>All in all, it's something that an ayahuascanaut ought to at least think about trying.  If your idea of ayahuasca is bound up with 'la purga' this may not be for you.  But if you like tripping in this particularly curious way, but you don't like feeling so sick you want to die, or puking your guts up, this may be worthwhile.</p>"
}
