{
 "title": "Can't Bare Children",
 "author": "Kalieldriel",
 "citation": "   Kalieldriel. \"Can't Bare Children: experience with DXM with CPM (ID 17136)\". Erowid.org. Jan 12, 2007. erowid.org/exp/17136",
 "substance": "DXM with CPM",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17136",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jan 12, 2007",
   "Views: 16465",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]  </p><p>I started tripping off of Coricidin when I was 13 years old. I had been really sick with a cold and all we had in the house was Coricidin. I took the recommended dosage and forgot about it. Later I took 2 more, and I wasn't feeling much better, so I took 2 extra.  I figured that taking a few extra pills couldn't hurt.  </p><p>I was on the computer at the time that I started to experience the first symptoms. At the time I had absolutely no clue what tripping was. At that time I hadn't even smoked pot, nor did I want to. [note: the first few years of doing coricidin I never had one negitive symptom] I began to feel confused, the room started to blur. I was scared because I didn't understand what was going on.  </p><p>I heard my parents come home so I got up to go to my room and found that I was too heavy to walk and ended up having to crawl to my room.  I spent the rest of the night on my bed, watching the lights flash and things walk through my room. I thought that I was going to die.</p><p>I went to school the next day and told a friend what had happend to me.  She told me all about how people 'trip' off dextromethophan, or DXM, the active ingredient in many cold medicines.  I felt relieved in knowing that it wasn't as bad as I thought it was.</p><p>A few months later my parents began going through a divorce and no one was ever at my house.  I all of a sudden had a life of freedom. I didn't need to worry about parents anymore.  I started smoking weed, and tripping at least twice a weekend and during the summer at least 4 times a week. I found some other friends that did it with me just as frequently and loved it as much as I did. When school came back around I would go to school on Coricidin.</p><p>That went on for two years.</p><p>The dose I normally took was 8-12 pills, it was all I had ever needed. But that dose just wasn't cutting it anymore-- it would hit me like I had smoked a little weed and then disappear. So I started taking the whole box, which is 16. </p><p>I continued the same tripping pattern with my friends for another two years or so. However, towards middle of the third year I began to throw up at the begining of my trips.</p><p>To make a long story short, my husband and I had been trying to have a baby for a little while. I went to a doctor and found out that I am unable to have children.</p><p>I find it odd that I and all other girls in my trip circle are unable to have children. The years I spent doing coricidn had a price? I still trip on it to this very day. I have nothing to lose now.</p>"
}
