{
 "title": "Time Is So Slow",
 "author": "saRah",
 "citation": "   saRah. \"Time Is So Slow: experience with Mushrooms - P. Cubensis (ID 17132)\". Erowid.org. Jun 10, 2005. erowid.org/exp/17132",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5 capsls",
   "oral",
   "Mushrooms - P. cubensis",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17132",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 10, 2005",
   "Views: 3315",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nSo I finally got round to taking mushrooms myself.\r\nIt was a totally spur of the moment thing. This was good in the way that if it hadn't have been I probably wouldn't have done them but bad in the way that I hadn't prepared at all. Also, I did what I think a lot of people do on mushrooms and dropped them with too much emphasis on the just wanting to get high bit and not enough on wanting to use them in a positive way to actually think.\r\nIn all, I took an oral dose of five capsules of Psylocybe (Psilocybin) Cubensis.\r\nId smoked a bit of pot and had some laughing gas and poppers already so I was pretty relaxed. previously, I had been quite sure of the fact that I wasn't going to take them cos of the issues with serotonin so in the back of my head before I took them was the worry that Id start to fuck myself over on the trip by stressing out about being stressed out. oh I love my head. but I didn't think about it once I took the mushrooms.\r\nI took three capsules of dried mushrooms at 8pm. an hour later, when things felt a bit weird but not that weird, I dropped another two. The first thing I noticed, and this was when Id only taken two, was my sense of perspective being heightened. everything seems sharper and more pronounced on mushrooms. rob was sitting on my lap and I was very conscious of him being very close to me, (more than usual when someone is sitting on your lap, obviously ) there were people behind him and they all seemed to be in layers. you know when u see some scenery in a play? everything is in layers, sea in background, then green hills, some trees etc etc. but it was with people this time. and rob seemed darker than them too.\r\nI was in the bathroom a little while later and the patterns on the carpet moved a bit. They were swirls so I think they just swirled a bit more than usual.\r\nAfter I dropped the 4th and 5th capsule, things started to happen. I had got the impression from other people that it was a gradual thing and the effects would come on slowly. I think I felt more different than I realised but by the time I was conscious of feeling different, they were really starting to take effect. It felt very sudden. This is what weve christened the hang on moment.  Where you suddenly realise that youre really not that straight in the head all of a sudden.\r\nMy chronology probably isnt that hot so Ill do my best.\r\nI was sitting on the floor surrounded by my friends. I was pretty hyper and happy. Someone put Tool on, which obviously would have blown my head off to a degree anyway. Loz had a book with a shiny cover, which he was moving in my line of vision, towards the left hand side. He said himself that he wasnt trying to do it in time to the music, but it looked like it was rippling in time to the music. Then I could see over on my right side of my vision John E tapping his fingers, I think on a basketball so I started drumming out some beats on my knees. This was at the end of schism (where there is a substantial amount of drumming.) I didnt take my eyes off lozs book at any point but Johns hands in the background completed it for me.\r\nThen, the main light got switched off and the u.v light got put on. That was incredible. Gingerdave had a bong that turned out to be u.v so that went a purple-blue colour. The water was doing fun stuff inside it too, just being a different colour. There was ice in it which went yellow. Something interesting from other trips I have witnessed is that trippers perceptions of colours are dominated by yellow. I saw the ice as yellow but loz and other people not on Shrooms saw it as more green. Then when he said he could see it was green, it looked green to me. Thats another thing about Shrooms, you are very suggestible. \r\nThen KT, who by this time was already tripping out on the same dose as me, started swinging the bong from side to side because it seemed amazing. She had this look of total joy on her face which caused me to nearly piss myself laughing. I laughed for quite some time. Then I calmed down a bit but everything was still weird. When I laughed at stuff on mushrooms, it wasnt because I found it really funny, I was laughing because it seemed like the most amazing joyous thing ever.\r\nThere were other people around not tripping but at that time I wasnt conscious of being at all affected by them on any level.  Then me and loz talked a bit about music. He was talking about the effect it can have on you so I agreed and described the feeling of the bit and he said he didnt think Id get what he meant and that was it exactly.\r\nThen something else wonderful happened (no idea what) which made me go argh, followed a second later by the bit where parabol becomes parabola so it was a veritable explosion of joy. I cant describe the total elation I felt at that point.\r\nThen all of a sudden, I started crying, really hard. Id been laughing and then it just changed. I was amazed. I was there wondering what the fuck was happening, how did it change so fast? Id seen Rachel cry on mushrooms and I just hadnt understood how it was possible to go through such an extreme change so fast. I remember saying at the time but Im not even upset. And I wasnt. I felt everything so intensely. Then Id get flashes of sadness, really intense sadness. But so fast I wasnt even sure if it had happened. Fells walked past me and I made him sit with me, because at that point, it was the most important thing in the world that I was near him.\r\nJohn E was sitting opposite me still, and both of us started improvising drum beats for the song lateralus. I used KTs arm as a hi-hat and the beat really impressed both me and john e, which seemed even more amazing. He is one of the people I have to thank for that night because sitting and listening to the latter (ho ho ho) part of that song, he made me hear some hi-hat work that Id never noticed before. This would have blown me away normally but that night, it was enough to make me cry hard again.\r\nGreendave had been making several failed attempts at getting toilet roll to stream across the room in the u.v light so I picked some up to have a look at it. I nearly came off, I tell you. The texture and intensity of colour was incredible. I moved it closer to my eyes and it got even more vibrant. I was looking over a green pool, like a swimming pool when lit up at night, just in another fucking dimension, man. I was imagining being at some sort of control panel for something, I remember at the time talking about a space ship, but not in the traditional X-files beam me up way, it felt like a swipe of my hand across this would do something and because I had the light so close to my eyes, everything surrounding me was darker. I got the impression of loads of people around, in the shadows, on a lower level, stretching out for a long distance. Maybe like some huge warehouse or something? I dont know. I can still see it now, a week later, without closing my eyes.\r\nI was really elated, I felt so good.\r\nI was in the middle of this when my mind suddenly jumped to something else. It does that. Everything seemed so important and had to be acted on but it was so easy to totally change your direction of thought. I looked next to me, where KT was still sitting and asked her if she was ok. She said that she felt really paranoid. Again, a total change of emotion for me. I went from feeling fantastic to wanting to press myself as low into the ground as I could. Other people can have such a huge effect on your mood. Mushrooms are such an internal drug so its weird that stuff like that happens. I can only liken it to a huge wave breaking on my head. That feeling of sadness Id had earlier came back magnified. I was sitting cross-legged with her to my right. It felt as though there was a wall, running right through me. On the one side was KT, and it was dark and there was a noise like the one you get underwater, a rushing noise. Then to my left, there was light. But my head was turned towards KT ad I actually had to make a huge effort to be able to look away, back into the light, like something was holding my head.\r\nShe knows I dont mean anything by this, making it seem like she was the thundercloud that temporarily burst my hallucinogenic bubble. It would have been the same if anyone I am close to didnt feel good. Its like you take on their sadness and it gets magnified. Because mushrooms strip all the shit away and you look at what is truly there, I was telling her my wall visions, which probably didnt help her mood any. Lol.\r\nAs soon as I looked back to the light, the room returned to the previous u.v-lit state. I looked back at KT and didnt feel anything but the usual concern you feel if a friend is upset. In that other state, it was as if Id hooked up with her head and I felt everything she was thinking and it was horrible.\r\nWe went for a wander at that point, because I get urges to do that. Greendaves house has wallpaper straight out of the 60s and 70s so watching it on mushrooms can be seriously rewarding. The room we sat in had brown green orange and a beige-ish colour scheme of wallpaper with flowers. I was expecting some movement from them but all I got was the flash of a pattern in bright light every so often. Closed-eye visuals were more insane. They centred on what looked quite like the side angle of cartoon stairs, repeated infinitely, crossing each other and moving. Escalator-like in a sense. Colours were predominantly blue and red.\r\nI went back downstairs at some point and ended up doing fire-poi. There was a time where I thought I was going to pass out; my arms were just working without me being in control and the noise of the fire rushing past my head was so rhythmical and intense. Everyone in the garden was amused by the moment that I was trying to pass the lit poi to KT and for a second neither of us were too sure whether we wanted to be holding them. We realised this when we had one each. This moment was gloriously short however and we continued in a safe fashion. My ability to do fire poi did not suffer at all; it was all in the attitude, which is how it is generally. I fire-breathed shortly afterwards but the results did not please me. It was like I didnt have sufficient control over my facial muscles to do it.\r\nI took a wander back into the room where the u/v light had been. Now, there was a normal light on and the room was full of people I didnt know that well. It was horrible. Your logic tells you that theyre not thinking derogatory things but youre not too sure in yourself. The atmosphere seemed charged and I felt out of place.\r\nI ended up back upstairs in the room of the particularly intense wallpaper, this time in the dark. I dont remember what exactly we spoke about but what I do recall was that every time I thought something, it seemed that for the first time, I was really considering things and not just on a surface level. I gained new insight into situations and people. I got a strong urge to speak to emma so I phoned her on Martinas phone. I got through to the voicemail, which did something really strange to me. I was in a dark room but it felt vast when I started to leave a message. My speech felt faltering and I imagined emma and martina in the darkness of the room, watching me and listening to me. It felt very much like I was being judged for something I wasnt aware of.\r\nPeople were fire-breathing in the back garden, which was overlooked by the room I was in. every now and then, someone would fire-breathe and for a split second it would light up the entire room. It was incredible. But now, I was conscious of a lot of strangers being in the house and the general atmosphere and feel of the house was very important to me. I just wasnt comfortable. Rob came up and spoke to me and KT and that calmed us both down quite a lot. However, I think by that time it had become apparent that the trip would not end well if I stayed in the house. Thats a big regret for me. I should have tripped somewhere that I would be sure of only coming into contact with people I trusted. You feel so open and exposed you dont want strangers around.\r\nI was very conscious of other people using other drugs. I was fixated with levels in everything; Levels of consciousness, levels of understanding. \r\nI didnt want to be around people on other drugs. The people on E were too edgy and fast and the people smoking pot just felt too slow and stupid. I felt when I was tripping that I was finding areas of my head that had been dulled by pot and it annoyed me. I tried to smoke when I was on the trip but found it horrible. If I had remained in that frame of mind I never would have smoked pot again.\r\nI decided I wanted out of the house so I went downstairs to find mine and KTs stuff. I had to stop for a while to have a nose bleed. That was seriously weird. I felt a rush of heat in my nose and looked down at my hands. When the first drop of blood hit my hand I jumped at the sensation of extreme heat. That was the only time I was conscious of heat other than an occasion when I felt cold, although I cant remember when exactly that was in the trip for the life of me. I leant over the toilet and rested my chin on the seat, feeling the blood run down my lips and chin and watching it hit the water. My sense of time that night was so screwed. It felt like an entire day had gone by when I was only in the house until about half 1 so it was six hours at the most. Everything was so slow. I was totally wrapped up in the time it took the drops of blood to leave my chin and hit the water. Blood in water looks pretty damn cool anyway but it was fantastic to watch. I couldnt connect the blood I was feeling and seeing to me having a nosebleed. Didnt make sense.\r\nThe tension of downstairs hit me again as soon as I was halfway down the stairs. Fells was a huge help in finding my stuff and Tim and JamJar both really helped me to calm down. Rose offered to be a surrogate Jewish mother to me, which I hugely appreciate it although I couldnt react to it at the time. A taxi got ordered and I spent the last few minutes in the house talking to Fells, JamJar and KT, which did really calm me down. I wasnt hysterical. I was calm. Just not happy. I was uncomfortable. \r\nIn the taxi home, KT and I talked very abstractly about the night. I stopped after a while and with the aid of subtle hand signals asked her what she thought the taxi driver thought of the conversation. I got a very aggressive vibe off him but because I was more at ease having left the house, I wasnt in tune with it so it didnt affect me. \r\nBy this point the more obvious effects of the drug had gone. I could still feel something different but I would almost forget until my head launched off on another great thinking session. I had another nose-bleed when I got to KTs house and one a few hours later. By this point, they had become more like nosebleeds and more of an annoyance than something to interest me.\r\nWe talked at length about a lot of things, mostly about what wed learned from the trips and our bad moments from the night. We made a lot of lists, including people we will never trip with again and productive things to do. I think it was about 5am when I last looked at a clock. \r\nThe next two days were crap, the first being terrible. The serotonin deficiency was really fucking with me. Now, I feel ok. But this has changed me. I doubt Ill trip again. I feel I probably got most of what I can get out of mushrooms that night, aside from getting more paranoid and upset. \r\nFrom this, Ive learned a lot about attitudes to drugs. Its not enough for me to take them to get high and have a laugh. Theyre so valid as ways to open yourself up to new experiences and thought processes. The drugs debates just seem even more irrelevant and frustrating. You cant blanket term drugs. Its totally misunderstood. \r\nI think thats it.\n\n\n"
}
