{
 "title": "The Hard Road",
 "author": "Soultell",
 "citation": "   Soultell. \"The Hard Road: experience with Datura (ID 17154)\". Erowid.org. Sep 3, 2006. erowid.org/exp/17154",
 "substance": "Datura",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Datura",
   "(roots)"
  ]
 ],
 "footer": [
  [
   "1998",
   "17154",
   "Male",
   " ",
   "Not Given",
   "Sep 3, 2006",
   "6383",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experience began at the local community college I was attending, right before my art history class.  I had obtained the baby plant from a nursery the day before. Hating my life and wanting desperately to change it, and to become more powerful over others, I ate the root raw, which I had already torn off the rest of the plant.  It was a baby plant, but extremely potent nonetheless.  I took too much, which was evident when my mouth first became dry then became extremely dry, and then I started to choke. I couldn't breath.  I thought I might die this time for sure. I was still directly outside my classroom, and unfortunately, directly across the path from the campus security office.  I began trying to vomit, but nothing came out, the poison was in me and taking hold quickly.  I began trying to call for help. A janitor approached me and said he could tell that I was going through alcohol withdrawal, and that he'd been through those shakes before.  I must have drifted out of consciousness, because I was suddenly in the school fountain with my socks and shirt off.  </p><p>A teacher I had once had, who I later heard was an ex-DEA agent, tried to calm me down.  Someone had apparently called the city police, because next thing I knew three of them were surrounding me.  They asked me what I took but I didn't tell them. They said they knew I was on speed.  I was arrested, put in the back of the car handcuffed, and I lost consciousness, waking up next handcuffed to a table in the police station.  My blood was taken, and I was fingerprinted and put in a cell to sober up.  I began to pound on the door violently screaming, and someone came and told me to settle down before they'd let me out.  So I sat down in a squat and waited.  I then saw on the concrete slab a demon lying in a death posture with sharp teeth, eyes closed, wicked grin.  </p><p>After that disappeared, I suddenly saw my younger brother, and I could not recollect how he was in there with me.  I felt so bad that I had gotten my brother involved in this.  I concocted some story in my head to explain to myself how we had ended up in jail, as I suddenly had almost no recollection of what had happened.  My brother's perfectly realistic image with purple eyes did not speak, despite my questioning.  I turned around and he had disappeared.  </p><p>Also, I would periodically see a TV with the news on outside my cell door on a shelf as I looked through the cell door window.  I watched to pass the time.  I was let out of my cell a couple of hours later, still a bit delirious, but sober enough to see the TV I had been watching was all along just a cardboard box.  I must say, I know I almost died that night, the dosage was almost too much for my body to handle.  But once I got through the initial convulsions and stuff, the trip commenced with no ill physical effects.  The evil power I had tried to achieve may or may not have been imparted to me, though to this day I'm still not fulfilled spiritually inside.</p>"
}
