{
 "title": "Summer's End",
 "author": "Matt Himself",
 "citation": "   Matt Himself. \"Summer's End: experience with 2C-I & Nitrous Oxide (ID 17151)\". Erowid.org. Aug 30, 2002. erowid.org/exp/17151",
 "substance": "2C-I & Nitrous Oxide",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 4:05",
   "2 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17151",
   "Male",
   " ",
   "Not Given",
   "Aug 30, 2002",
   "13713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nExperience  Second time</p><p>Setting  my house, solo</p><p>The end of the summer was drawing near. I had had a lot of great times with my friends. Many of my friends though were preparing to leave for college. It was a sad time, as well as an exciting time for all of them. My girlfriend was also preparing to leave. This saddened me greatly. I had been with her over 8 months and I did not want to see her leave. I knew deeply that this was all part of growing up though.</p><p>I had wanted to have another psychedelic experience before the summer ended. I felt that using the proper tool I could bring some closure to all that was going on around me. After spending a night with my girlfriend I decided to take 25mg of 2C-I hoping for the powerful inward trip it provided me last time.I was in a great state of mind before ingesting the 2C-I. I was happy from spending such a wonderful evening with E. I decided to take it in a mixture with a little grape soda.</p><p>12AM  I put 25mg of 2C-I in a shot glass with grape soda. There was no reaction noticed. I had expected some fizzing but none was seen. I stirred it with my finger which I then licked clean in case any had stuck to it. The taste was quite foul. I ignored that though, and took the shot down quickly.</p><p>1215AM  My stomach feels a little strange. I had eaten around 4 hours ago. The feeling is more of a tightness in my stomach. It is not unlike the last time I used 2C-I.</p><p>115AM  Effects which seemed to be slowly creeping up on me take full effect. I feel very warm. There is a noticeable brightening of lights. Also, my sense of touch is quite heightened. I log on to IRC and begin typing. Using the keyboard feels very interesting.</p><p>130AM  I notice the curtain in the room begins to shimmer. It seems to have a slight ripple to it. I notice that the door to the room seems to be doing the same. I am always amused by this breathing effect. It always seems to be the first visual hallucination I notice. My mind feels pretty clear at this point. The trip so far seems to be mainly just effecting my senses and not my mind.</p><p>2AM  My mind is definitely effected at this point. I am feeling quite happy. I am talking to people on IRC still and I feel happy to be part of any conversation. It was around this time I noticed the floor though. The carpet in the room is blue. It almost looked like water. It seemed to be rising and crashing like waves. I stared at it for some time. It was quite interesting.</p><p>230AM  The carpet waves have ceased and have turned into patterns. I cannot begin to describe just how intricate the patterns were. They were large tribal looking geometric patterns. They were sliding across the floor. They maintained the same structure but they just slid back and forth. I had never seen such a pattern on a psychedelic before. I remember thinking How is my brain thinking this up? I watched this for quite awhile.</p><p>315AM  I am at the peak of the experience now. The problem is however, my mind is thinking TOO much. I cannot complete a thought. As soon as Im almost done another one begins. It becomes really confusing. I get off the computer and go down to my basement. I walk around and turn of the black lights and lava lamp. For some reason, the lights seem to be adding to my confusion. I leave and go into my bed room.</p><p>330AM  Im still having trouble thinking, but its starting to calm a bit.</p><p>4AM  My mind is once again functioning in a way I feel comfortable with. Although the past hour had not been bad, it had been confusing and frustrating.</p><p>405AM  I decide to do some nitrous before things start coming down. I get my cracker and 2 cartridges. I fill up 2 balloons and inhale one immediately after the other. I finished both balloons before I felt the effects.</p><p>Things happened fast and they were intense. The world dissolved away. There was a loud twanging noise ringing in my ears. With my eyes opened a strange shape took form. It was a triangle composed of smaller triangles. The smaller triangles shimmered with brilliant purples and greens. The corners of the large triangle had glowing lights. I looked at the one at the top. But then my head jerked to looking at the bottom right. And then, it jerked to the bottom left. And it kept going in the same sequence. I felt as if each light was its own reality, and I could only exist in one at a time. I could not control where I looked at this beautiful image. Slowly the triangle faded, and the world presented itself again.</p><p>410AM  I am almost overwhelmed by the nitrous experience. I dont know exactly what to make out of it.</p><p>430AM  I put on headphones and listen to Dark Side Of The Moon.</p><p>5AM (or so)  I lose interest in the CD. This has never happened before. I have never grown bored of Pink Floyd while tripping. I put the headphones down. I then turn all the lights in the room off. I lay back looking at my ceiling. Even in the darkness I can see its contorting. I sit back and ponder everything that has been happening</p><p>I think about my life and how it has been going. I am disappointed in the grades I had gotten the previous year in school. I stop and think about where I am going in life. I have goals and dreams, but I know if I do not work for them, they will disappear. I swore right then that I was going to do good in school. Not for my parents or girlfriend, but for myself.</p><p>I also stopped to think about all my friends who I had just said goodbye to. I realize this isnt an end. Its just a new beginning. Although they are all away, we will all return home someday. We will all meet again. Even though they are temporarily out of my life, I know they will be back.</p><p>I also think about my girlfriend E. E is leaving for college in less than a week. I dont exactly know how well I am going to handle this. I want to stay with her, despite the difference in location. She wants to same. I decide that whether we stay together or not, I still feel fortunate for all we have shared. I realize that even though she may move on and we may part, we will be together forever in my memories and my heart.</p><p>730AM  I drift off to sleep 2 hours of deep thought</p><p>130PM  I wake up. I am happier right now about everything than I have been in awhile.</p><p>----------------------------------------------</p><p>This experience gave me everything I could have ever hoped for. I went into this trip hoping I could get some closure on things, and I was successful. Although the first half was just eye candy (which is entertaining to say the least), the 2 hours in the dark just thinking was truly a very beneficial experience. All my worries seemed to be gone. I had accepted things as they were rather than just wishing things werent happening.</p><p>This trip held immense meaning to me. I can only hope that someone out there has had an experience as wonderful as this.</p>"
}
