{
 "title": "Space Traveler....",
 "author": "Sau Vong",
 "citation": " Sau Vong. \"Space Traveler....: experience with Unknown (sold as Ecstasy) (ID 1717)\". Erowid.org. Sep 12, 2000. erowid.org/exp/1717",
 "substance": "Unknown (sold as Ecstasy)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Unknown",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "1717",
   "Not Specified",
   "",
   "Not Given",
   "Sep 12, 2000",
   "10983",
   " "
  ]
 ],
 "report": "<p>\nTried a new E pill ('Pure Love') that my local E dealer had picked up and went on a trip so horrible and so amazing that it still has me spooked. I now believe the pilled contained PMA. Inital effect was uncontrollable excitement and body movement. My hands were shaking and I can feel my eyes lock straight ahead. Now heres the good part. The hallucinations...I have seen things that I have never thought possbible for a human being. I saw things manifest right before my eyes. Dead bodies scattered throughout my room, bodies with arms and legs ripped right off. I saw my buddy poked his eye out...saw him turn into pinochio, a female, and many other things. </p><p>Now remember these things manifested right before my eyes, blinking did not bring them away. At this point in time my mind was rocked, it was screaming to set things right, it was processing and trying to registers things that could not be possible, how can I see my buddy poke his eye out and see the blood fly all over the place yet he is still alive right before me.</p><p>I also felt like as space and time traveler a person from another world. Visiting Earth, I felt wise and extremely old, that I have been on this Earth for millions of years and that I have seen all and know all. I remember my friends asking me questions and I would answer as if I was a guru, a wiseman. This was the only good part about the drug. All the others I still have nightmares about. This pill called Pure Love which is still around the Sacramento area...I advise to take with caution for you will be taken on a trip that you have never taken before...oh and by the way...duration is 6 hours...of sights..sounds...and nightmares...only the brave need apply...as for me I am spooked...</p>"
}
