{
 "title": "The Angel's Trumpets Sound The End",
 "author": "kid_oblivion",
 "citation": "   kid_oblivion. \"The Angel's Trumpets Sound The End: experience with Brugmansia (ID 1718)\". Erowid.org. Jul 16, 2000. erowid.org/exp/1718",
 "substance": "Brugmansia",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 flower",
   "oral",
   "Brugmansia"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 1718",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 16, 2000",
   "Views: 52505",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHaving little information on belladonna a few years ago a friend and I decided to try ingesting a flower each in a tea infusium.  I was like 16 or 17, rebelious, and not all that concerned with my own health.  The flowers were about eighteen inches long and from what was later alleged to be a 30-year old tree.</p><p>The infusium was red, and slightly oily.  I remember commenting to my friend that it tasted like blood, and toasting it as such.  'This is my blood,'  I remember saying, 'Do this in memory of me.'  It was the last words I would speak that night.</p><p>My friend's glass was the first one poured.  I remember pieces of vegetable matter in my glass.</p><p>About two to three minutes after drinking the glass, I started feeling an intense body 'high,' similar to dramamene/benedryl overdose, due to the anti-cholanergic properties of both.  I realized that there was something wrong, as I could not believe that digestion was significant enough to merit such a level of intoxication.  I found myself having slight difficulty breathing and walked towards the bathroom to force myself to vomit.  By the time I got there I was unable to remember why I was there or even why I was, and was unable to walk or respond within another minute or two.</p><p>A friend then stopped by, coincidentily.  He carried me back to his place and put me in his bed.  My fellow psychonaut (who had not consumed to pulp) left at this point.</p><p>About three hours later, after I had repeatedly stopped breathing, my friend decided that he didn't know what to do and begin contacting people.  About another hour passed before I was taken to a hospital.</p><p>The hospital pumped my stomach and administered charcoal. After a long period of incoherence (another eight hours) I was released later the next morning.  </p><p>I am told that in the period after detoxication, before the regaining of metal capacity, I was incredibly aggressive, so much, in fact, that I had to be tied to a table.  This is very much interesting, as I am a very non-violent person, not just by philosophy, but by inherent demeanor.</p><p>Now here's what happened to my friend.</p><p>After leaving he began to walk home.  He acquired a screwdriver somewhere.  A few minutes before he arrived at his house he stopped to eat grass clumps and hurl them at passing vehicles.  The police were called in, and they attempted to arrest him, as he was in obvious mental and physical distress.  The first officer to arrive on scene was a female officer and he, not only also a passive person but a very, very, skinny man, attempted to stab her with his screwdriver.  Other officers arrived, two men, both well over two hundred pounds, one an ex-marine, and my friend had no problem throwing them over his head.  He was arrested eventually, and coincidently, ended up in the same room of the hospital that I was in.</p><p>I was in a really dark point when this occurred, and was consuming massive quantities of barbituates and opiate.  I don't know if there was anything active in my system at the time, but I don't think I was.  </p><p>After the experience I felt as if I was alive for the first time ever.  I have seen mythical ties to belladonna [though this report was originally submitted as a belladonna report, the description of the plant makes it clear that it was brugmansia and not belladonna] and the moon for two reasons.  The first is the extreme property of atropine to dilate the eyes.  The pupils expand to such a point that even the whites of the eyes were gretly diminished.  This lasted for about five days, long after any psychoactive probperties disapeared.  Oddly enopugh, I was completely sober about three hours after regaining short-term memory.</p><p>I have read that some plants contain irregular amounts of alkaloids and that two analagous specimens from the same plant taken at the same time may have wildly different amounts of active ingredients, and that the plant cycles and amounts change based on the time of day.  We picked the flowers in the late morning, if anyone cares, around 11:00 am.</p><p>Atropine should not be consumed unless : 1.) You are doing you will, and cannot accomplish it any other way and 2) You use an extracted and measurable amount of atropine.  The drug is not particually pleasent, for a similar effect that is unlikely to kill you I recomemmd taking any of the various anti-cholenergics such as dramamine.</p><p>Invoke the One Together</p><p>So Both May Dissapear</p>"
}
