{
 "title": "Amazing Despite Close Call",
 "author": "Spinzter",
 "citation": "   Spinzter. \"Amazing Despite Close Call: experience with MDMA (Ecstacy) (ID 17182)\". Erowid.org. Dec 20, 2012. erowid.org/exp/17182",
 "substance": "MDMA (Ecstacy)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17182",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 20, 2012",
   "Views: 955",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Up until a couple of days ago, my only psychoactive experiences had been with marijuana and alcohol. I had never rolled or tripped in my entire life. I decided that I was ready to try something new. A friend of mine had been talking about some amazing rolls he had just gotten in. They were called Orange Omegas. They were pretty big rolls that were about half MDMA and half MDA. I decided I had to try one.</p><p>A good friend of mine, O, (who has way more experience than I may ever have) decided to do them together. We finally got them around 11 that night, and swallowed them almost immediately. We rode back to his house in another friends car. The onset was coming really slowly. It had been about an hour and we weren't really feeling anything other than a few bowls of bomb ass hydro we had smoked. Nothing was really going on, so we decided to go hit a party before the things hit us.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>Four of us piled into my Prelude (not easy to do) and we started driving out to the party. Everything was going fine, I drive stoned just about every day, and I am quite used to it. We were listening to some Bone Thugs and everything was going great. Then, it hit me. I was doing 40 mph on a narrow road, and I had just started rollin my nuts off. For my first time. I swerved and hit a curb...at 40 mph. The car jumped 3 ft, blew a tire, fucked a rim, and the airbags deployed. Amazingly, we all kept calm, pulled the car over, and let the two people who weren't rollin change the tire. We decided we had pushed our luck enough, and just drove the thing back to O's house.</p><p>Once there, everything settled down. We all went into O's room and turned out the lights and put on some techno. I just layed there and let the X take over. I wrapped myself in about 12 blankets, and watched O rave. He got right up in my face with his lights and I saw trails long enough to where I saw pictures in the light. I couldn't believe how good my entire body felt, I didn't want to move a single muscle. And I didn't, for at least the next few hours.</p><p>About 3 or 4 hours into the experience was when things got really interesting. We both started tripping. We lied on our backs, completey mesmerized by the ceiling. I remember it started with little patterns and colors catching my eye, but it got better. I found that if I focused my mind on them, they would start transforming into more and more vivid pictures. It was like a little show that was put on for me. I saw all kinds of different images floating around the ceiling, and I couldn't even begin to imagine what they meant. I was completely overwhelmed with it all. I had never rolled OR tripped, and to be doing both at once was beyond belief.</p><p>That's when I started thinking. I remember feeling some kind of revelation, like my eyes had just been opened to some kind of hidden truth. I began thinking about God, and I am not even a part of any religion. I remember thinking that psychedelics were God's way of showing us what the world was meant to be like. It was his way of reminding us what we were meant to have. I couldn't decide if it was Heaven or Eden, but I couldn't stop that overwhelming feeling of new-found knowledge, of being in touch with something I had never before imagined. It was truly amazing.</p><p>The rest of the night was spent just chillin outside on O's balcony. I went through about a pack and half of Menthols that night, and I'm not even a habitual smoker. Cigarettes just seemed like God's gift to man that night. It was great to just sit out on the porch and talk. A lot of times we would just be quiet for a while and stare at things. I remember being especially attracted to the railing on his balcony. It's held up by a series of vertical supports that are evenly spaced. Staring in between them caused some crazy stuff to happen. It was like looking at a picture that had been cut into vertical strips, and the strips were all out of alignment. Cars would be split in half and all kinds of crazy things.</p><p>Around 8 or 8:30 am, I finally passed out. I didn't crash or anything, I just felt really really weird the next day. Not necessarily in a bad way either. Just weird. It was definitely an experience I will never forget, and I look forward to my next time.</p>"
}
