{
 "title": "My Flashforward",
 "author": "ilukas",
 "citation": "   ilukas. \"My Flashforward: experience with LSD, Cannabis, Methylphenidate (Ritalin) & Nitrous Oxide (ID 17195)\". Erowid.org. Jul 20, 2005. erowid.org/exp/17195",
 "substance": "LSD, Cannabis, Methylphenidate (Ritalin) & Nitrous Oxide",
 "bodyweight": "67 kg",
 "header": [
  [
   "DOSE:",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)",
   " ",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "5 tablets",
   "insufflated",
   "Pharms - Methylphenidate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17195",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 20, 2005",
   "Views: 3975",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, this night was the most intense night of my life. The inner secrets I discovered about myself and about the world. I found out that there are more things in the world than what science can prove.\r\nMy horoscope on the day that I had this experience stated that something would happen that would change my life, and if I did not follow through with my plans I would spend the rest of my life wondering what would have happened. Well I didnt really think much of it other than my cynical view that horoscopes were a bunch of generic crap that could apply to any situation. This night did change my outlook on life. This might go on for a while but keep in mind this was a non-stop 20 hour trip. It can be divided into three parts: the show, the transition, and the party.\rThe Show\r\nThis is where it started. There were three of us to start with. Me, Matt and G. we decided to start our trip at a fair with rides, sideshows, etc., and then progress to my friends party. Im not going to cover what happened at the show in detail because that was more just for visual kicks of going upside down and being around spinning lights. At this point I didnt realise the true nature of LSD. We got there straight, but psyched up. I had been tripping three times previously but not with such a high dose (I planned to do two trips against others advice. Apparently, with trips the experience of 1+1=2 is not true. Two trips are a lot stronger than simply a double dose), Matt had been tripping four times before and was planning to do just one because of his cash flow and G was a first timer. We managed to talk him into doing a half and then if he had it under control, the other half.\r\nBy the way, these were strong trips (atoms). On the advice of a friend, J, whom we met later at the party we decided to have a trip clock. My watch had both analogue and digital settings so I set the digital to 00:00 at the time of dropping. The digital was also good because it went in 24-hour time. Well, that was the start. We dropped the Ts in a public toilet in the show, I dropped 1, Matt dropped 1 and G dropped half. As soon as we stepped out side it started raining. We then had some interesting experiences with animals and learned that on some level, they can identify trippers. My friend G tried to pet an alpaca that a child had just done the same to and it freaked out and ran in an opposite direction until it smacked its head into the opposite wall of its pen. It then collapsed and made some strange noises. G didnt even touch it. We decided that we would avoid animals and have some fun.\r\nIt was still raining but who cared. G wanted to try his other half so me and Matt waited outside for him. I looked at my trip clock. It was 01:00. This was when the trip took off. Me and Matt were playing with our inflatable hammers which squeaked. We did this until we realised that we had made a song with the pattern of squeaks. We looked around and everybody was staring at us. We cracked up laughing, as is the trademark of coming up in acid. The show was great, we went on rides, watched stuff in the main arena, and stared at out hands because they were morphing/melting and started laughing. 2.5 hours into the trip and I already realised this was the hardest I have ever tripped. And I hadnt even peaked.\r\nOur next major event was in the childrens petting zoo. We were sitting on a park bench watching people watch the animals who were watching us. We were trying to figure out who was the zoo exhibit and who was the visitor. We realised that, because we were watching everybody they were in our zoo. We tried to discuss it normally but it kept on rhyming! So we wrote it down in Matts trip book. It was written as such:\r\n Whos in whose zoo? Is it me? Or is it you? Is it what we mean or what we do? Is it Matt, is it Luke or is it gru? YOURE ALL IN OUR ZOO! WE HAVE THOUGHT IT THROUGH! BECAUSE WE ARE LOOKING AT YOU!\r\r\nWe made such a commotion over what we had figured out that everybody was looking at us. We were now in their zoo. It was so much for us we had to leave.\r\n\rThe Transition\r\n\r\nWe left the show at about 04:00 on the trip clock. On this walk we discovered some things that could never be retold and understood without a very open mind to new ideas. Our goal was to meet J and Brendan. They were straight but J was planning to do an E at the party. He first wanted to check out the situation. Our walk from the show to our meeting place was about 1.5 hours, I guess. Its hard to tell because we stopped, did Nitrous, and talked a lot. Its hard to retell but what we discovered about life was amazing. We tried to write it down but Matts pen leaked and broke. Obviously we were never meant to know this. We met J and Brendan at about 05:30 on the trip clock. We somehow read a map and caught a bus to get to the party.\r\n\rThe Party\r\n\r\nFrom about 07:00 to 14:00 on the trip clock we were at this party. The actual time we got there was about 10:00 and we stayed until 7:00 the next morning. As soon as we got there the first thing I noticed was an E. triglochidiatus, a cactus that supposedly contained 5-meo-DMT. I rushed around the party with it looking for Matt until I realised that I was stabbing drunk people with its spines! I decided that it would be safer to put it outside, which is where I found Matt, G, J and Brendan. Me and Matt decided we would split my last tab and each do another half. We sat on the front balcony and had lots of nos. as well as that we blazed up two spliffs and each drank a bottle of Thai red bull concentrate. It was great!\r\n\r\nAfter about an hour of this I did a Nitrous. Just a single, but it kicked off the most intense experience of my life. I did it and just sat back as it was a normal Nitrous. I knew that they lasted for longer on acid and stoned but after about twenty minutes of a full on Nitrous I thought something had gone wrong. I was still nossing as much as when I took it! I thought that my brain couldnt cope with the amount of drugs I had taken and that my brain was permanently fucked. I tried to talk myself down from it but I couldnt. After about half an hour I was really scared. I was breaking out into a sweat and my heart was racing. The red bull concentrate I suppose. I got out of my chair and stumbled to the balcony edge and collapsed. Matt ran up to me with wild eyes, I thought he was worried about me but it seemed he was going through exactly the same thing. He was scared too. This made me feel a bit better but I told Matt what I was thinking. I told him I thought I had overdone it. The rush going through my body was indescribable but it was fucking scary. Matt looked at me sweating and said the words that I should have been thinking the whole time. In fact I felt stupid that I did not think of it.\r\n\r\nMan, youre tripping. What youre feeling is the trips. Just flow with it.\r\n\r\nI had completely under estimated the effect of acid so when it hit me it was overwhelming. There is absolutely nothing in the world that you can compare it to. As soon as I heard this I felt better. I was in a more positive mind set. I got up and instantly felt on top of the world. I walked around the house checking out everything. Walls were not even in existence, they just melted into pools of liquid on the ground but they were still taller than I was. People were morphed creatures and when they spoke small digital pieces of data shaped like fish swam out of their mouth. I wasnt listing to the sounds I was watching and reading them. I thought I better find a nice place to sit.\r\n\r\nThe guys whose party it was (a fucking legend) had set up a chill out room. It was a small room with a couch a recliner arm chair and the floor was covered in Mattresses. He had a hookah set up in the corner and this light thing that spun coloured lights around the room. Ambient music was being played over the soft bubbling of the hookah. I chose the armchair and didnt move for about four hours. In that time the light maker fell a couple of times and exploded into a spectrum of pixilated colours. Somehow they pieced it back together and got it in working order. My vision would distort into cartoon form and for short bursts of time everything would look like drawing. To be accurate it looked like when you turn a photo into a drawing in PhotoShop. It was great.\r\n\r\nAfter about four hours of this I was down to a level where I could move again and talk to people who made sense. I found Matt and discovered that he had the exact same experience as me. During this time I drank a lot of water. I was walking around when I discovered my flash forward. It was similar to a flash back but it was a glance of the future instead of the past. I was in a situation where I looked at a sign on a door and the two people came out. At that point in time I thought it was deja vu but then I remembered where I saw it from. The exact same thing happened in one of my dreams about six months ago. I was flipped out. My brain had replayed one of my major experiences before I had ever done it. Then I went on to think what if I was in a flash back? For the following half-hour I expected to wake up in a street, forty years old with people all around me saying that I passed out. It didnt happen. I was still sixteen. \r\n\r\nFor the rest of the night I walked around and checked stuff out. I fount a guy who did a human beat box for about an hour straight. He was great. I found a chick who was a friend from school who pulled out a knife to show me and then admitted that she was revving on meth. I was frightened. She was a dangerously spontaneous and violent person. I found the guy who sat next to me on the couch for about six straight hours not moving. I learned that he had taken about five points of speed. About now I was coming down. I decided to take the five pills of Ritalin I had in my possession. If you are ever in this situation do not do it. It was about six in the morning. My body had had it. I did about two lines of Ritalin. My mind was so hyped up. My brain was working overtime but my body was fucked. My body couldnt move. As I did my Ritalin my friend J decided, that at six in the morning, was the time to do his E. He was happy with the party so he did lines of his E. that was about it. At dawn we all walked into the city and went and saw the movie signs, which had an uncanny resemblance to the previous night. \r\n\r\nMy Conclusions\r\n\r\nI do not underestimate the power of acid. I make sure that I have water, a nice relaxing place to chill if I need and some good friends on standby. If I am going to do more than one trip I am prepared. Two trips equal the power of about three.  Also, I do not get freaked out. I have the power in my own mind to turn it into a good trip or a bad trip. This is why I need friends to talk to. It gives me a sense of well being. Last but not least, I do not go into any drug with the attitude it will be a bit of fun. Most drugs have a very intense spiritual connection to the world and are much more than just a recreation. They are an insight. At one point I was crying. I have not cried since I was 9 and I am now sixteen, but they were tears of joy and understanding. Remember this and be careful.\n\n\n\n"
}
