{
 "title": "Serotonin Syndrome",
 "author": "Matt",
 "citation": "   Matt. \"Serotonin Syndrome: experience with Paroxetine (Paxil) & 5-HTP (ID 17197)\". Erowid.org. Jun 8, 2007. erowid.org/exp/17197",
 "substance": "Paroxetine (Paxil) & 5-HTP",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Paroxetine",
   "(pill / tablet)",
   " ",
   "100 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17197",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 8, 2007",
   "Views: 18159",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I once believed that a person could not have too much serotonin, and that the more serotonin a person has, the happier they are. I learned that this is not the case, the hard way. Below is my account of the events and medical problems I had when mixing the pharmaceutical drug Paxil with the griffonia bean extract 5-HTP. I am not intending to ward anyone away from these drugs/supplements; apart they are good products, however when mixed, the results can be disastrous.  </p><p>At about 2:30 am I took 30 mg of Paxil (paroxetine) along with two 50 mg pills of 5-HTP (l-5-Hydroxytryptophan). I thought this might be a good mixture because 5-HTP is a precursor to serotonin (assisted by vitamin c and B6) and Paxil is a selective serotonin reuptake inhibitor, meaning that it prevents breakdown and reuptake of serotonin levels. I just figured I would be in a better mood and it would be fine.</p><p>One thing I should mention here is that I did not sleep much that night. I am not sure if it had to do with the pills, because generally I tend to get tired after taking either one. </p><p>At around 8:00 am my body had a slight general discomfort, but nothing that made me worry. The thought of breakfast crossed my mind but my appetite was non-existent, and I quickly threw that thought away. I began to watch the early morning news shows and cartoons (what are days off for?).</p><p>I did not realize that I had drifted into a light sleep and awoke at around 10:00 am. However, upon awakening I felt a sharp pain in my stomach. I felt extremely uncomfortable and decided to try and keep lying down and wait it off. I finally concluded that it was probably because I had not eaten anything that day and my body needed food. So I got up and started making some chicken noodle soup, all the while feeling a very acute pain in my stomach, not worrying, figuring it was just hunger. After I poured the soup in a bowl and began to sit down, I got a strong smell of the soup, which immediately made me feel extremely nauseas. I stood up, fearing I would vomit, having the most profound disgust for all forms of food. Enforcing my initial thought about my stomachache, I forced a few spoonfuls and it tasted like poison in my mouth. I decided to go and lay down again to try and chill out and stop panicking.</p><p>Moments after I had lain down I felt a powerful flush of heat come over my entire body. I figure I probably had a fever of about 101 at this point. Whenever I would look into a light I would feel more heat sweeping over my body. Then I began to have a very intense panic attack, which caused a terrible tightness in my chest. My mindset was of sheer panic, I thought I was going to vomit for sure and managed to get in the bathroom. At this point I was hyperventilating and panicking thinking that I would die. I knelt over the toilet but nothing needed to come up.</p><p>As I raised my posture the hotness I had formally felt turned into an intense wave of cold sweats all over my body. I looked in the mirror and saw that I was sweating bullets (air conditioner set at 68 degrees central air) and my face was very pale. At this point I decided to take a couple of deep breaths and try to gather my sanity. Finally I calmed down enough where I could eat the soup, which made me feel a little better. I then staggered to my room and passed out for about six hours.</p><p>This experience taught me a very important lesson: too much serotonin can make you have panic attacks (the reason I take Pail in the first place) and decrease your appetite to an unhealthy low. I later realized that what I experienced was serotonin syndrome, which can be fatal in certain circumstances. I was pretty lucky to come out all right. Anyone thinking about mixing drugs should do extensive research on the combination and make certain that they will not interact in a bad way.</p>"
}
