{
 "title": "Nothing Existed To Me Anymore",
 "author": "Chemix",
 "citation": "   Chemix. \"Nothing Existed To Me Anymore: experience with Mushrooms (ID 17209)\". Erowid.org. Jun 13, 2005. erowid.org/exp/17209",
 "substance": "Mushrooms",
 "bodyweight": "67 kg",
 "header": [
  [
   "DOSE:",
   "0.125 oz",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17209",
   "Male",
   " ",
   "Not Given",
   "Jun 13, 2005",
   "Views: 4071",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My previous first time affairs with drugs had always been troublesome to say the least. My first Ecstasy experience was very negative yet after using the drug more often and learning from my negative experiences I always thought I had a tight grasp on reality. However this was my first Mushroom trip and I was determined to show myself I could handle it. With a mind set of ignorance and arrogance, I assumed after previous frightening experiences with loss of reality and such, I could take anything that came my way.</p><p>In a friends attic bedroom myself, him and another friend sat looking at these strange alien objects that were growing out of a pre-made grow kit ordered from the Internet. We decided to eat four reasonably dry mushrooms and then a fresh one that we plucked from the grow kit at round 9:55 PM. They tasted very distinctive and unpleasant and a glass of water each was necessary to be rid of the lingering taste. Apart from the water and the mushrooms everything else was unprepared, we had no idea what do with no main focus for the night accept getting high. This probably played a large factor in the following events.</p><p>After an hour of ingestion (in which time we had ventured the shops to pick up some chewing gum and some spare clothes for my friend) we were back in the house where we first ingested the mushrooms. Firstly, I remember distinctively the way in which my body felt different. Almost as if gravity was gently pushing and pulling my body this way and that. This was followed by some very pleasant euphoric rushes, which reminded me of those experienced from coming up from ecstasy pills. We all began to feel very humorous, laughing randomly for no reason at all.</p><p>What followed over the next thirty minutes was perhaps the most amazing experience I've had using drugs. With these constant rushes which changed and varied in intensity came the most fantastic visuals. The whole room came to life, colors and sounds became intensified in time with the music, lights and objects took on new dimensions which made them so interesting I almost felt as though I had entered a different world. I felt childlike once more, taking pleasure in even the most simple objects and patterns. I almost felt reborn, into a much more beautiful world filled with the most amazing lights, sounds and colors. I distinctively remember tribal patterns with Aztec-like faces covering the walls. Objects, materials, patterns all started to sway gently. I felt a new brilliance in life, I could go on forever discribing the things I saw however I'll just say that it was completely unreal and at that point the saying 'A brave new world' took on a very real meaning.</p><p>Soon I felt complete ego death, I felt part as though my body was now just another part of this new world. I was lying on a bed and I honestly thought that I had melted and merged with it and was now just a consciousness within the room. The room seemed infinitely huge, my perception of distance and time was altered. I remember sitting on a chair and looking down at the carpet, which seemed to far away inducing the feeling that I was a bird, perched on a ledge high up looking down upon a unfamiliar world.</p><p>After around two hours which seemed at the time like much longer, we decided to go down stairs and watch TV. At this point the visuals had worn off, and the trip completely altered its path. Now I felt more awake, wired almost. However my body was completely different, especially touch and hearing. As I sat in the chair, watching the TV I still felt very happy and almost as if I was part of the chair itself. However, we decided to venture out to my house to pick up some money for cigarettes. The walk which soon turned into a paranoid and very unpleasant experience started to worry me. I felt extremely paranoid and anxious, this is when the trip started to become bad...</p><p>As we walked, I started thinking about my altered senses and in that I had a horrible realisation that nothing was really how I had always imagined it. The world which I saw all my life was simply fake - it only existed to my physical senses and with that I entered a disturbing train of thought about how the world really was, I was obsessed with this thought - what was objective reality really like? Nothing existed to me anymore, I completely stopped trusting my senses and this was perhaps the worst part of the trip. My metal state started deterioting, I was now in this awful train of thought and started wondering whether I could ever get out off it again. Would I be like this for the rest of my life? Always questioning everything and trusting nothing, not even my own senses. Would I be insane forever I wondered...</p><p>After walking up to the Tesco shopping center to buy some ciggies. I started trying to realign myself with reality once more, trying to keep positive thoughts. I keep running through my head that it was all simply the effects of the drugs taking control and falsifying my senses. Once I managed to pull myself out of my mad patterns of thought I decided to leave my friends, who where much in the same mind set as myself and walk home on my own. Things started getting better, although my senses were still incredibly inverted I kept reassuring myself that once the effects of the drugs wore off I my senses would realign back to their natural configuration. Yet there was still that question in the back of my mind that perhaps now I had entered and experienced this insane state of mind, that I would never again return to normality.</p><p>At around 3.00PM after watching some wildlife programmes (which were very interesting I might add) I came down back into my normal state of mind pretty quickly. I contemplated the trip as a learning experience. A lesson that things may not be as they seem, and after everything is done there is no truth, only perception.</p>"
}
