{
 "title": "Voyage To The Stars",
 "author": "The Cyanide ChrYst",
 "citation": "   The Cyanide ChrYst. \"Voyage To The Stars: experience with Salvia Divinorum (ID 17228)\". Erowid.org. Jun 13, 2005. erowid.org/exp/17228",
 "substance": "Salvia Divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17228",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 13, 2005",
   "Views: 4675",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI was starting to get bored with marijuana, wanted something different than mushrooms, and something easier to obtain than acid. My friend had recently told me about Salvia Divinorum, and after a few months of studying it, I was prepared to try. I read that many users didn't achieve desired effects with the plain leaf, so I bought a gram of 10x through a card-holding friend of mine from an online vendor. I received it about a week later and decided to wait until that weekend to try it. </p><p>I mentally prepared myself that entire week for a life changing experience...thinking I was prepared for salvia's awesome power. I had a dream the night before I used it, that I was working in a south american endangered animal reserve in the jungle, (I live in southern california, mind you) and I had a dying plant in my hands. I was obviously pretty emotionally worked up over it, because I asked an older woman (judging by my tone of voice when I spoke to her, she was my boss, or some respect-demanding person) what to do with the plant, crying. She said to me, 'Give it to us. We will care for it.' Though there was only one person there. </p><p>The next morning I decided was the day. I chose only to smoke a very small amount of the leaf in a water cooled bong I made from objects found around the house. I loaded the small dose, inhaled with the proper lighting technique, and held for what seemed around 30 seconds. I exhaled and got a strong headrush, not unlike that of a weed buzz. I leaned back, felt nothing for nearly a minute, so decided to take a slightly larger amount. </p><p>I added about twice as much salvia as the last hit, which I had easily cleared with room to spair, and lit. By the time I had exhaled, I felt a very powerful headrush, leaving me temporarily senseless and staring blankly. My body felt as though a thousand tiny hands were firmly, but gently massaging me everywhere. This made me somewhat uncomfortable, so I took off my shirt. I glanced at my clock and not even two minutes had passed, so I chose to add twice as much as the hit I just took. </p><p>It took me a lung-busting 25 seconds to slowly inhale all of the dose. Before I even finished inhaling I tried to suppress a growing irritation in the back of my throat (the smoke is rather harsh, even in a bong). I leaned back onto the loveseat in my livingroom, holding it and sipping on a nearby glass of water I had set just for the occasion. I reached to the floor to set down the bong...only the floor was nothingness; a gravity-defying void that was so beautiful, yet so terrifying all in it's simplicity. I immediately coughed out all of the smoke, forgetting I had even done any salvia. </p><p>I felt as though I had no earthly limitations, no gravitational pull and no mass. I layed onto the material of space that held me in place while I collected my blossoming wonders. My ego was completely silenced, and I now found myself getting completely undressed. Why I was compelled to do this, I have yet to recall. The couch shifted into a staircase, descending into the beautiful blackness of the universe; a never ending pitfall into oblivion. I was compelled to walk down these stairs...Everything inside me yearned to reach the bottom. </p><p>I must have walked for eternities, but time mattered not. I gazed around at the beautiful stars and felt emotions I thought I had successfully suppressed and forgotten. I have never felt so human before. There are certain unspoken pains one can only run from in life, but on the salvia, they stood in the middle of the road ahead of me. I could do nothing but break down and cry, knowing I could not lie to myself any longer. Lady Salvia had caught me in the act, and knew that I was only doing more damage by sweeping these things under the carpet. </p><p>I was awoken by the sound of my own breathing...I found myself laying on the carpet in my mom's bedroom. I stood, examined my surroundings, which seemed so fake to me, because I knew the truth. I knew exactly what the universe sees when we create this fake existence to pacify our sorrow...only to live day by day. Salvia showed me how truly simple life was, and a few more personal things I'd rather not discuss here. But it comes down to me being a completely and permanently different person. My perception allows me to not just walk on the path and examine what lies ahead, but to rather step off the path, and see farther ahead in both directions.</p><p>And I know that somewhere in my mind, I am still descending those stairs into nothingness.</p>"
}
