{
 "title": "Nirvana has been Acheived!",
 "author": "silverfucked",
 "citation": "   silverfucked. \"Nirvana has been Acheived!: experience with MDMA (ID 17237)\". Erowid.org. Sep 5, 2002. erowid.org/exp/17237",
 "substance": "MDMA",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 0:30",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17237",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 5, 2002",
   "Views: 8281",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSo, i've dropped pills before but theyve all been the equivalent of maybe a half dose.. I never actually got the full on feeling..</p><p>Anyway, I aquired an igloo pill... I went home and tested it with my newly recieved marquis reagent and it turned black.. I decided that i was gonna take it at a large event coming up.. I also had a euro pill left ... I had aquired 3 euros a year ago and dropped on two occasions with effects, but less than satisfactory..(BTW they also tested black)..</p><p>So, the night of the event (jam band kinda thing,  but pretty massive) comes and I'm stoked... I take the igloo and the euro with, just in case the igloo isnt strong enough.. I'm determined to have a 'strong experience'.. Sadly, i go by myself, but given the nature of ecstasy, i figure ill make friends.. I always see people rolling at concerts.. I also pack up with some blue glowsticks with ropes, and a vix inhaler..</p><p>When I get to the event, I have to sit there in painful anticipation for a few hours..  I decide to drop after the first band, so that my peak will wear off right as the event ends(If all goes as planned).</p><p>When they are finished, I drop the igloo.. tastes bitter, good sign. I go and sit in the grass and wait.. I start noticing some perceptual changes.. Like the tendency to notice things more. Nothing strong.. When the band comes on i feel the come up.. Theres this warm sensation that encompasses my entire midsection.. Its that feeling you get when you desperatly want to be held.. My mood lifts and i go and dance with some pepple i dont know, but dont talk to them.. this pill isnt very strong.. in fact these are the same weak effects i got with the euros.. So after 30 min i pop the other pill and keep dancing.. Up tot this point im feeling good, but not rolling.. I would have this little peaks of excitment that went along with the peaks in the music.. I was at a ++.. Then the second pill hit..</p><p>When, it hit all i could so was 'Oh shit'.. To describe the feeling is like decribing the color green to a blind man.. So this is what everybody's talking about.. So this is ecstasy..</p><p>It hit in a mindblowing rush.. It feels as if every nerve in my body has been electrified.. This invisible 50 pounds that id been carrying all my life, was lifted off my shoulder.. I floated from place to place.. Colors were brighter, but more noticably richer.. </p><p>I felt the imeadiate need to socialize.. </p><p>Its amazing, when I'm on E, people seem to come up to me.. every single person that approached me, i felt was my friend.. The cheesy love that expected was not, but filled with a deeper sense of kindred,  more of this feeling of unity.. how we're all in this together.. Most of them were drunk.. I listened to this one guys drunken story about shrooms for 10 mins., and i was amazed at how well i listened and connected with him.</p><p>The body rushes were so insane at one point that i had to sit down and just watch.. i could definitly not drive in this state. Everything, looked crisp and defined.. my voice seemed to come from deep within me.. I had a bit difficulty talking, as in forming the words that i wanted to say.. After this flooring rush wore off, the speedy effects came on, and i danced my ass off, with the glowsticks.. I didnt care if I looked like an ass.. In threat to my ego became non existent..</p><p>I normally am socially introverted, and have difficulty initiating conversations with people.. X eliminates any embarassment, social hangups, and fear of rejection that you may have with strangers, escpecially girls for me (I was even rejected once, and i just shook it off as their loss).. Talking essentially came with ease and my mormally poor self image was boosted by 1000%.. When i looked in the mirror i notcied my attractive qualities, instead of dwellling on the negative.. My eyes were the coolest things in the world. Girls would come up and hug me, cuz they knew the E feeling, and it was the most postive reinforcement ever.. Warm energy flows thru you and you see people as genuine beings instead of just people..</p><p>Thruout the night, I hung out with probably 7 different groups of very accepting people.. I was given a light show, and figured what all that was about.. Just waving it in front of my eyes made them vibrate wildly and make me go weak in the knees and almost fall of.. Interesting phenomena.  When the concert ended on that final song, and the crowd was going nuts, i felt a part of human kind.. A part of some great benign energy flowing thru us all.. </p><p>Amazingly, my peak wore of over 20 minutes after the concert.. I hung around and had some even better conversations.. I think the final hour of X is the best for therapy, because you are empathetic and you social barriers are still down, but you arent rushing so hard your mind is clouded.. you feel very lucid.. I had a nice conversation with a girl from alabama, and she talked with me until i was sober enough to drive.. The final comedown wasnt even as bad as an amphetamine comedown! I even got to sleep easier. The next day i still felt a connection to people and i felt happy and energized.. I think prozac on the comdown helped alot.. </p><p>In conclusion, i think MDMA is a wonderful tool to show how we should interact with people .. It lets see a person for what they are and not just a pretty or ugly face. Ecstasy is the drug for me!</p>"
}
