{
 "title": "Another Plane Three Feet Above The Floor",
 "author": "dj that bumps techno",
 "citation": "   dj that bumps techno. \"Another Plane Three Feet Above The Floor: experience with Salvia Divinorum (ID 17260)\". Erowid.org. Jun 13, 2005. erowid.org/exp/17260",
 "substance": "Salvia Divinorum",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17260",
   "Male",
   " ",
   "Not Given",
   "Jun 13, 2005",
   "Views: 3382",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night I ran into a friend who had happened upon a bit of Salvia.  Having read about its effects for years, I promptly ran back to my house and grabbed McKenna's Archaic Revival to present to him for bestowing this gift upon me.  </p><p>He had obtained about 1g of finely crushed leaves.  A few people were lounging around with Cannabis/Salvia D. mix in a pipe, and seemed pretty buzzed.  A nice smell floated about the room.  Since I need to be clean for drug tests for a CDL, I couldnt use that pipe, so I grabbed my old one hitter from home an cleaned it out.  I had heard its a great method anyway...so it was time to see.  </p><p>I sat down in a 'sling' type of chair...very comfy, and hard to get out of even when sober.  The friendly neighborhood shaman stood to my side and loaded one up.  I put the flame to that toot constantly until my lungs were full.  Held that for about 45 seconds and then he handed me number 2.  No buzz yet.  Coughed while choking down hitter 2.  I remember him asking if I was OK, and since I was full of smoke, I just gave a thumbs up (well Im a scuba diver, came naturally lol)</p><p>I think I felt a slight effect from this, and I immediately got another tooter.  I began to smoke it, and at some point it made me cough violently.  The hitter was EXTREMELY hot, but I remember that I stopped caring midway through this one.  I had handed off my cigarette to my woman before beginning, and I am glad I did.  I dont remember how the toot left my hand.  </p><p>'Ohh boy...Im in for it yeaaahhhh'</p><p>First thing I did was start running my hands through my hair.  I had been working in a hot machine shop all day, and my mop was a mess.  That plus the sweat from the hot room made it feel REALLLLY good.  Then I got a laughing fit; started cackling insanely, which I remember.  This came with a sensation of color flashes.  Not anything visual though...just a feeling...pretty wierd.  Just now remembered it after thinking about the laughing.  At this point, I remember my friend saying 'you sound like a cartoon!'  So then I started laughing like MY idea of a cartoon laugh, and that scared the ladies.  Opened my eyes in a 'moment of sanity' to mess with my girl by laughing and staring at her.  My body was definately heavy at this point.  My toungue was frozen in a slight upward angle in my mouth, with a puddle of very thick slime on it, which was very nice feeling also.  (gross eh?  Hehehahahahaa)</p><p>At this point, I remember laying back in the chair at a strange angle.  People were talking, which didnt really stick in my brain.  Eyes constantly closed.  Then the strangest thing happened.  I noticed that there was a black-and-white tile 'plane' floating above the floor at about 3 feet.  There was a ladder leading up to it, but I think that was just me being a smartass in my vision.  I knew it was in the room because I didnt need to open my eyes to see the room.  Then I started messing with my hair again, and I remembered the cartoon thing, and decided that I need to make my hair into a ramped spiral like my little cartoon guy I had thought of a second before.  I sat combing my hair around in a spiral for a while, fixed on the vision of this guy.  Complained that I need more hair.  Then I flashed my eyes open for a second, and noticed that my eyes could take pictures and superimpose them on the tiles.  Highlights went to white tiles, shadows and darker colors to black...so the picture was kind of scrambled.  I realized that that was how I could see without looking.  After a while, a dark evening sky and clouds appeared above the tiles, and I wryly thought that that was a really stereotypical hallucination.  Must be the media influence I thought.  At this time I came down from it, and felt a bit spent.  Noone else got this far, partly I think because of previous exposure to the substance in the night, partly because they weren't smoking it hardcore enough, and partly because they weren't exhibiting the right attitude to experience this.  </p><p>Example- A girl in the room tried to smoke it.  I told her exactly how to do it, and she proceeded to smoke the first slowly.  She was busy gossiping, and the second went up slow also.  The third was a waste.  This was the theme of the night, and it made me pretty bummed that others wouldnt take the plant seriously enough to put some effort into experiencing it.  </p><p>I was unsure if the trip lasted 30 seconds or 20 minutes, but the group said about 10 minutes. Effects completely gone and I felt sober within 20 minutes of coming down.  Very powerful, and I plan to seek more to experiment with.  </p><p>The gram cost 20 dollars, which seemed like a huge markup to me.  But I can see to where people would pay that much.  Must find a better source.  </p><p>NOTE:  This is SERIOUS STUFF!!!  Dont play around, and be very very careful.  Have sitters around...it is a must as you are COMPLETELY out of your mind.  This is no kid stuff like LSD or shrooms...much more powerful in my opinion.  </p><p>Have fun and be safe.</p>"
}
