{
 "title": "I Couldn't Think, Only Feel",
 "author": "termite",
 "citation": "   termite. \"I Couldn't Think, Only Feel: experience with Mushrooms - P. cubensis (ID 17291)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17291",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.7 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17291",
   "Male",
   " ",
   "Not Given",
   "Jun 14, 2005",
   "3672",
   " "
  ]
 ],
 "report": "<p>My first trip (and only trip to date) was perhaps the strangest experience of my entire life.  I acquired about 1.7 grams of 'killer' mushrooms from my friend...I was skeptical about the amount but trusted him anyway.  At about 9:00 I ingested the mushrooms, I had heard they tasted bad but I kinda dug the earthy flavor.  I was feeling very antsy and decided to play the piano to calm me down.  I remember the first thing I noticed was a wave of transparent neon colors flowing through the carpet...green, pink, yellow, and blue.  I started to loose interest in playing the piano, and began to sway back and forth saying 'weeee'.  I realized how scared I was to trip.  I had no idea what to expect, I wasn't ready for it.  I called my friend and talked to her for a few minutes, trying to find reassurance.  It was about 9:45 when I got off the phone with her.  I decided to take a bath.  I remember looking at the bubbles and admiring how sparkly they were...then I noticed that my perception of my body was very frightening.  It's hard to explain the feeling I felt, I just felt like a very grotesque and strange creature.  I went up into my room and I started to trip a little harder.</p><p>I noticed tracers when I moved my hands.  I was listening to The doors and the music put me on the edge...i felt annoyed by it.  To calm down, I decided to pop in Fear and Loathing.  It was probably about 10:15.  As I watched I noticed that there were large colored squares that seemed to be part of the movie, and the characters were bold and a little bit more 'real' if that makes sense.  I remember looking at someone's nose and it started to grow like a witch...and that's when things got really scary.  The tv room stretched and looked to be about twice as big as it really was...I ran back into my room and laid face down on my bed.  At about 10:40 or so I was tripping.  The fear I had manifested itself into devilish figures, I started to travel through an amber colored root system...I couldn't think, only feel.  My mind wasn't wondering, I was stuck inside this dark place.  Figures began to pop out of the roots, and they were coming up to me and exchanging this feeling with me, I couldn't explain it.  It was almost like we were having sex.  I remember seeing snakes with the scariest faces I have ever seen.  I knew I was freaking out, that's about the only thing I could figure out.  This is when I started to trip NUTS.</p><p>I couldn't think, I was in this place that cannot be described in words.  I stayed in this somewhat scary but somewhat amazing place for my peak.  I was still scared, but I don't think that really meant anything to me.  god if I know, it seemed like hours.  I started to let go into the trip because I knew it wasn't going to help me out in the least to keep fighting it.  I started to 'figure out' tripping.  I came to for a few brief seconds, and decided to let go...everything from here on in is in bits and pieces.  There were loud noises I imagined which I started to control, and cut the sounds up into little blips.  I remember opening my eyes.  I have a comforter that has an african jungle theme, and the elephants and zebras were walking across it, the vines were swirling and intertwining.  Everything had a geometric outline to it, like a white outline that was slighly bigger than the original shape.  My bearskin rug looked magical, sparkly.  I imagined my pain as a white ball that started out large and eventually shrunk into nothingness...I was free.</p><p>I decided to smoke a cigarette out of my window.  I highly recommend smoking a cigarette while you're tripping, it was the most amazing feeling to inhale the smoke...it felt cool, electric.  Everything outside was curved like a bubble, I felt very 'whishy washy'.  I layed back down in my bed and the patterns of light that came through my window danced, I felt like I was laying on the floor of a jungle looking up through the leaves.  I remember saying, 'this is a beautiful way to exist'.  I guess it was about 2 in the morning when I stopped hallucinating, and fell asleep without even thinking about it.  I woke up the next morning, and I felt incredible.</p><p>Overall, I realized that tripping is something you can't do without preparation.  I know from now on when I trip I'll want to be with somebody, somewhere besides laying on my bed (even though it became entertaining, I can only imagine what it would be like to go somewhere else).  I regret I couldn't enjoy my first trip more, when I look back on the experience I know that it could have been beautiful if only I would have let go of my fear earlier.</p>"
}
