{
 "title": "Before the Storm",
 "author": "Kyla",
 "citation": "   Kyla. \"Before the Storm: experience with 5-MeO-DMT (ID 17378)\". Erowid.org. Sep 10, 2002. erowid.org/exp/17378",
 "substance": "5-MeO-DMT",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17378",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2002",
   "Views: 6969",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHe told me to inhale as much as I could, breathe it in, breathe it in deeply. I held it. Something happened, and I remember saying 'Woah', and hearing people around me say something like 'Haha, she said woah!' - except I couldn't hold on to the voices, they swam around my head and echoed through every part of myself and the universe. </p><p>Then, blackness. Later I was told it was blackness with a smile. </p><p>When I finally regained control of my head, I was floating, I was one with the universe, and my vision returned, giving me images of what I was floating within, blue sky and thick cotton ball clouds. They were almost digital, warping in to each other and myself. I had no awareness of my physical body. Things were good, briefly.  Not that I knew this at the time.  I recall no thought process, I wasn't thinking at all, just simply experiencing. </p><p>Then something snapped, perhaps the return to the physical realm. I became aware of my breathing, it was heavy and uneven. I looked down at my hands and somewhere along the way I had dropped what I was holding and my fists were clenched. I tried to lift my head but it felt like a weight, it felt un-naturally heavy. I lay back and told myself to enjoy the ride, I knew what I was doing, and I should appreciate the experience while it lasted. It didn't work. Panic and terror set in. I knew that I was messing with a chemical released in the brain when you die, so I somehow convinced myself that I wasn't going to survive. </p><p>I was so hot, so very hot. It took me a long time to figure out that that was what was wrong. I looked around and apparently had held a captive audience, including my best friend who had not been there when I first inhaled. She looked worried. I thought about speaking, but it was like my mouth wasn't connected to my brain. I knew what I wanted to say, and it was simple enough - water, water - but nothing came out, until I said 'I don't like this' without realising. I said it a few more times, and then asked for water. </p><p>It was then I started to feel the worst nausea I have ever felt. I ran to the toilet and vomited everywhere, and felt immediately better. Emotionally though, I was broken. After a good cry I looked up, and those cotton ball clouds I had appreciated earlier had formed into looming dark storm clouds. </p><p>I felt the storm coming. And I was reborn. What a perfect beginning.</p>"
}
