{
 "title": "So Crazy",
 "author": "Lutesium",
 "citation": "   Lutesium. \"So Crazy: experience with Alprazolam (Xanax) & Alcohol - Hard (ID 17398)\". Erowid.org. Apr 1, 2006. erowid.org/exp/17398",
 "substance": "Alprazolam (Xanax) & Alcohol - Hard",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "280 ml",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17398",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 1, 2006",
   "Views: 13351",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ohh so crazy. Yeah so crazy. Combining that much with a bottle of whiskey is equal to commiting suicide. I did this not because I didn't know this I knew this well but I did this because I just wanted to DO.</p><p>I was alone in France. (I live in Turkey but I went a vacation to France) I was so bored because I dont know French and I can not commucinate well with French girls even I speak superior English :).  This made me drink everyday and I brought 50 - 1mg Xanax tabs with me because I was depressed sometime a few months ago and the doc prescribed them.</p><p>I saved some of the tabs and wanted to combine them with alc. just to see the effects. I started drinking whiskey and when I came to the half of the bottle I popped 8 tabs of Xanax at once (the side effects didnt even come to my mind). Then after 1 hr I started to feel ultra Euphoric. I was light and heavy at the same time.</p><p>I laid to the carpets and started to roll. I was eating the carpets. My friends said that I was saying very strange things at the same time and laughing. I can't remember the experience very much because I was blacked out by combinining that much benzodiazepine w/ alc. They took me to billiards then to a bar to dirnk a coke. But I can only remember 2-3 scenes of these places. I was totally blacked out. They said that I went to bed at 2 o'clock and I woke up at 15. Whooa.! I slept for 13 hours not waking even once.! When I woke up I was totally dehydrated and I wanted to urinate. I would nearly explode. I urinated for a minute and then drank a great amount of water (3 lt) in 10 minutes. Then I went to bed and slept for another 5 hours. When I woke I felt like a giant rock had fallen on my head. It was 20:00 and all my day was wasted by sleeping. I was so sad.</p><p>So in conclusion I can say that I can only remember the start of the experience (40-50 min) being ultra euphoric but the rest is blacked out.</p>"
}
