{
 "title": "Tripping Amongst The Slot Machines",
 "author": "mastak",
 "citation": "   mastak. \"Tripping Amongst The Slot Machines: experience with Mushhrooms (ID 17406)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17406",
 "substance": "Mushhrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2.3 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17406",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2005",
   "Views: 3002",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having read and heard so much about the importance of being in a comfortable setting, away from people, obnoxious noises, and certainly clanging slot machines, I decided to attempt a trip in Reno. Part of my goal was to experience a mild 'Fear and Loathing' type journey, but the overwhelming reason was to take these shrooms in the antithesis of the 'proper' environment (at least from most accounts).</p><p>My friend (we'll call him dude) and I took a semi-quick drive to Reno, checked into our room at the luxurious Sands (same number of stars as the Super 8 motel) and prepared to ingest. This was dude's first trip and he took 2 grams of Mazatec, while I took 2.3 grams of PF. Considering that dude gets ill when he smells mushrooms; it was impressive to see him down his 2 grams almost immediately. I followed suit so as to prevent embarrassment. I felt the uneasiness that I usually feel after ingesting shrooms. After about 15 or 20 minutes, the TV started bothering me, and the psychedelic colors of the sheets on the bed began to make me feel uncomfortable. At about 30 minutes, we decided to go for it, and headed out to the casino floor. The walk down the hallway, and elevator ride made me feel that I was tripping, but it can be hard to tell considering the strange colors and patterns of the carpets.</p><p>When the elevator door opened, we were overwhelmed with the sounds and smells of the casino floor. It didn't bother me at all; rather, I found the excessive sensory stimulation to be fascinating. Every person that I saw looked unreal, like mannequins with strange distorted faces. I felt as though I was wandering through an amusement park ride with automaton people and shiny, flashing, clanging machines.</p><p>For some reason, I felt cold, and wanted to go outside where it was warmer. When we finally found an exit from the casino, we ended up in an alley that didn't seem very familiar. We decided to circle the casino until we found where to go...and eventually we did. Unfortunately, we were trying to cross four lanes of traffic, and it seemed impossible to look both ways and try to assemble the information in my mind. We wandered down the sidewalk until we saw a bus stop and decided to sit down. Since we weren't too far into the trip, we contemplated the idea of jumping on a bus. But, thinking better of it, we continued on our walk. Passing the end of the hotel, we saw the swimming pool that was lauded as the 'best in Reno'. It looked like nothing more than a backyard pool with lots of scary looking old people and children.</p><p>We had been walking down the street with the intension of reaching a patch of trees that I had seen in the distance. As we wandered down the street past abandoned business and bars, I realized that we would never reach the trees. Suddenly, I noticed a beaver dam sitting in the back of an old parking lot. We walked toward the alleged dam, which turned out to be a pile of old, sticks (I guess that's a dam). An old man walked out of a nearby bar and looked at us strangely. I suddenly became anxious as I had the feeling that we had done something illegal.</p><p>We walked back to the hotel. In the parking lot, dude noticed how beautiful the trees were in comparison to the cement and asphalt. I agreed wholeheartedly, and we stood there for some amount of time just staring and commenting on how cool plants are and how they keep their beauty in spite of the shit we place them in. Finally, we entered the hotel again, thru yet another entrance that seemed wholly unfamiliar.</p><p>Suddenly we were back in the casino, surrounded by the noises. It had been about an hour since we ingested and I felt the need to attempt to interact with the craziness of the casino, so I sat at a video poker machine. The animated cards kept me interested for quite a while, and luckily I only lost a few quarters. Eventually, I stopped playing and just watched the moving lights and characters. The jacks seemed particularly amazing at the time. I had the impression that I was near a peak as because of the intensity of the lights and noises and people. We decided to leave again and to try and cross that four-lane street. It seemed like the right thing to do.</p><p>In the end, we were successful crossing the street and railroad tracks. I asked dude where he wanted to go and he indicated that we should head to the biggest casino around. So, we headed. Suddenly, dude says, Oh my god, it's the lizard version of my boss! I stopped, looked at the billboard, agreed with him, then leaned against a lamppost and watched the sidewalk start to breath. I must have been staring at my feet and the sidewalk for several minutes while dude mumbled something about lizard faces. The people walking by must have thought we were insane, but we certainly didnt care.</p><p>When we finally mustered up the courage to move along, we wandered into the pull through area of this large hotel. For some strange reason, there were no cars or valet people standing around. We walked into the hotel and there was no one around. It was the strangest feeling, like the rapture had occurred and everyone in Reno had gone to heaven. After looking around for a while, we realized that the hotel was under construction, but for some reason all the doors were open.</p><p>We wandered down the street and I suddenly had the feeling that we were in some otherworldly semi ghost town. There were a few cars and the occasional person, but there was a feeling of desolation. At some unknown point in this story, we fell through a door and into another casino.</p><p>Dude saw a boxing match on the TV at the bar and wanted to sit down for a minute. I staggered to my seat and leaned my head on the bar. The large Budweiser sign started breathing heavily, getting really tiny, then taking up my entire field of vision. Things around me seemed closed in and were almost entirely breathing. While the sensation itself was relatively enjoyable, I had the feeling that the people around me could tell that something was amiss. When dude got tired of watching the boxing match, or couldn't focus on the TV anymore, we left the bar. We decided that it was about time to get back to home base. Walking was getting a little more difficult, and the prospect of rolling around on a casino floor was somewhat daunting.</p><p>Walking seemed to get us out of the depths of the trip. While it was difficult to focus on anything, we made it back safely. There was a group of kids in front of us that suddenly disappeared, but that's the norm for a Reno tripper. We entered our casino with the single-minded goal of getting to our room. It had been two hours and we needed someplace quiet to relax. The wax-faced casino clientele were getting in my way, but we finally found an elevator. Someone said something to me, and I mumbled some sort of response. Neither dude nor I remember what I said. I hope it gave someone an entertaining thought to ponder. When we stepped out of the elevator, I had two revelations. We weren't in the right place, and the carpet is moving...a lot. It was my fear and loathing moment, and I basked in it for a few minutes, wandering down the hallways and staring at the floor. Since we had apparently jumped into the wrong elevator, we went back down and I was lucky enough to have a fellow resident speak to me again. Same result.</p><p>We eventually found the right elevator and room. I fell onto the bed, feeling relieved to be away from the noise, smoke, everything out there. Lying there, we realized that this was the trippers room. The wall was a bluish tile that had become the ocean. The bed had psychedelic sheets and the artwork was insane. And everything was breathing and moving. We must have been about two and a half hours into the trip and I couldn't believe how intense the visuals were, like nothing that I had experienced before. I basked in the craziness of it all, enjoying every moment. I gathered all the energy and gumption in my system and called my friend to tell her about the trip. I believe that I mentioned the visuals, but I can't remember much more than that. I do remember hanging up because I had to go to the bathroom. I also remember spending a good portion of the rest of the trip in there.</p><p>While sitting on the toilet, I could see myself in the mirror. It was somewhat disconcerting to see my face morphing and melting. Much like the main room, everything in the bathroom was moving. I was confused by the person I saw in the mirror. He looked familiar, but I knew it wasn't me. There were questions flying through my mind. Where am I? Why am I here? How did I get here? Am I really a goddamn Asian? I could hear dude outside saying something about snakes and bats, but I was contained in my world. There were random thoughts about my family, friends, my feet, my cock. I looked at myself naked. It seemed like a bad idea. I looked so ugly and strange.</p><p>Eventually, I left the bathroom, and lay to experience more swimming, breathing, and moving. As we started coming down, we had some interesting discussions about personal traits, all the good things we should do, and the evil and stupid people that inhabit this earth.</p>"
}
