{
 "title": "Two-Day Nutmeg Binge",
 "author": "The Lone Stroker",
 "citation": " The Lone Stroker. \"Two-Day Nutmeg Binge: experience with Nutmeg (ID 17414)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17414",
 "substance": "Nutmeg",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "22 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   " T+ 8:30",
   "22 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   " T+ 22:45",
   "22 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17414",
   "Male",
   "",
   "Not Given",
   "Jun 14, 2005",
   "13135",
   " "
  ]
 ],
 "report": "<p>OK Nutmeggers, try this hella-huge trip on for size....heh heh</p><p>Now, the first place I heard about Nutmeg was here, I was looking for crazy experiences and saw Nutmeg as a drug catagory all its own...'what the hell, nutmeg?' I thought....I had heard rumors about it, but didn't think it was true, so I mounted my bicycle and rode off into the bright clear day seeking a lot of nutmeg, I got four 22 gram (.8oz) things of it and decided I'd try half of one the first time, I did, a little buzz and so I ate the other half...again, a small buzz. At this point I thought the foul tasting saw dust I was eating wasn't worth it the thought, 'wait a second, I still got 3 bottles....heh heh heh, maybe I'll have some fun....or kill myself, I'll take a chance', and downed one whole bottle at 11:00 the next morning. Here's the whole story</p><p>11:00-Downed the nasty shit, 22 grams of it, I don't understand how it's supposed to make food taste better....</p><p>12:00- rummaging through the medicine cabinet looking for my triliptal for my bi-polar \n</p><p>1:00-Now this is about the time I started feeling it all kick in, mostly just the pills though, I was sitting at my computer reading trip reports because I had nothing better to do while I waited when I noticed I could feel my blood rushing through my body and I thought I'd eat something to calm me down, just thought it was my hypoglycemic thing (where your blood-sugar level drops and you need sugar-opposite of diabetes) but when I got up to get food I realized I was kinda light headed, getting food was a pain in the ass because I was so tired</p><p>2:00- pills started wearing off, didn't like the buzz anyway, and I thought the Nutmeg would never work</p><p>3:00-my sister got home from school, I was barely feeling a buzz, kind of like when I ate the half of one before</p><p>4:00-started feeling like I was high, like I had just taken a heftily sized hit from a bong, just like one or two hits though, I fealt like I was falling a little and when I'd close my eyes I would realize I was starting to trip a little, seeing things when my eyes were close, got more tired</p><p>5:00-felt like I was pretty high, not exactly like smoking pot but similar, I felt like I was falling and music sounded fuckin awesome so I put on my headphones and lie back on my bed listening to dirty Vegas's crazy techno song repeat over and over while I spaced out and had very real dreams that I could control, I had a dream about hiking up a mountain, the scenery was beautiful, I was with people but I don't know who they were, just friends, then went into another dream of just cruisin through traffic and was rudely awoken by none other than.....mom, I had to be at volley ball by six...SHIT!</p><p>6:00- I made it on time to volley ball, but I was only half conscious the whole time, it was the best game of my life! I just felt like I was in a dream the whole time, the sand was really trippy to play with when I wasn't on the volleyball court, the only bad part is that I could barely move</p><p>7:00- volleyball ended soon after 7, I fell asleep in the car but nobody expected anything, they just thought I was tired....dumb fools....got home and dug out the other nutmeg container, I smiled and broke out laughing at its sight, 'what a cool substance' I thought, 'but why's it so damn funny', I just continued laughing, I didn't care why it was funny, it just was and downed it as quickly and painlessly as possible....'one mans baking goods are another mans drugs'....hmmmm</p><p>8:00-dosed off for about an hour or two.</p><p>9:00-(still dosed off)</p><p>10:00-when I woke up it was already starting to kick in, the other sooner than it did last time, but that's because I was already ripped as hell from the last dose, I turned on my TV and saw the white fuzzy's common in Cableless televisions, I just watched, at first they resembled fast growing flowers, then a huge explosion, I turned on a video game and pulled on my head phones</p><p>11:00-still playing my game, dozing off</p><p>12:00-left all my lights on and I thought I'd take a small nap with headphones and lights to keep me from sleeping all night, unfortunately I just awoke to a big surprise the next morning</p><p>---</p><p>7:00-I woke up, I was still really, really gone like I'd smoked a hefty amount of pot and passed out for an hour and woke up to a fading but still clearly intoxicated, 'Shit' I thought, I had to go take a test for my GED at 9, and I could barely walk straight, it was still working!! </p><p>8:00-got dressed and thought I'd take the other thing of nutmeg so dropped it in my pocket for later and around 8:30 left for the test</p><p>9:00-I won't explain the whole situation, but know I could barely operate....If I didn't get a 470 or better on the test I would have to take every test over again and do a minimum of 12 hours at the GED place all over again, that is...if I didn't pass, I was shitting my pants and stinkin the place up, I didn't realize it was this huge a deal and I was in no state of mind to take the test</p><p>10:00-finished the test, as the lady graded it I went to the restroom and poured the last 22 grams down my throat with the aid of some good ol' Pepsi blue, I came back, I had only missed one! a 680! holy shit! Maybe this shit makes you smarter...???</p><p>11:00-nothing, I came home and took a nap</p><p>12:00-still asleep</p><p>1:00-woke up and pulled on some clothes and got ready to go ice skating.....tired, but sounded like fun because I was just starting to feel it kick in</p><p>2:00-left the house but had to pick many people up so we could go, went to my old school to pick up my sister and what do you know? a hot chick gives me her number and asks me to go to a car show next week, holy shit! I was like, maybe I should have stayed in school....</p><p>3:00-finally got there, it was crazy, I felt like I was falling the whole time but at the same time I could control the direction I fell in, ice skating is fun while your fucked up :)</p><p>4:00-finished up skating and got another girls number, nutmeg makes your day a damn good day, passed a hard ass test, got 2 chicks' numbers and went ice skating at the same time</p><p>5:00-got ready for class, this was gonna suck...</p><p>6:00-went to class and just spaced out the whole time, I couldn't concentrate on anything, just stared into nowhere, my professor asked if I was ok, I said yeah, and that I was just tired, I felt like the whole class was a huge dream, it was a peaceful loving place, it was crazy, falling through your chair in class and everyone not knowing a damn thing, what a day</p><p>7:00-still in class</p><p>8:00-class finished and as I waited for my mom to pick me up I fell asleep outside looking at the crazy ass stars that had just popped up in the sky</p><p>9:00-went home and went to sleep, had a shit load of dreams but I can't quite piece them together yet</p><p>Every time I downed another and it kick in I was trippin harder and harder each time it did its magic</p><p>Nutmeg is an amazing substance and I plan to use it again, wish it didn't take so long to kick in but oh well, and fellow Nutmeggers, MEG ON!!!</p>"
}
