{
 "title": "Blank Primordial Fear",
 "author": "JSLS",
 "citation": "   JSLS. \"Blank Primordial Fear: experience with Salvia divinorum (5x extract) (ID 17428)\". Erowid.org. Mar 21, 2005. erowid.org/exp/17428",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17428",
   "Male",
   " ",
   "Not Given",
   "Mar 21, 2005",
   "4446",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I did a lot of reading when I first came across the plant Salvia Divinorum, I was fascinated by all the trip reports and how much the plant was talked about. So I decided to take matters into my own hand and bought some extract off the Internet. I read all the precautions and warnings, and I used good judgment in all but onemy first experience was with 5X Extractyeah right 5X and its legal, like thats going to do anything serious, people I cant stress this enough, I am not inexperienced with drugs, and there is not one word in any language that can describe the power of this plant. If you want to experience this ethnogen, than please use caution, respect, and try the straight leaf first.</p><p>A few days after it arrived in the mail, I invited a friend to come and sit with me during the experience and keep an eye out for me, even though I felt like I didnt need a sitter. He was also excited about the prospect of trying this new plant, so I packed a glass pipe and decided that I would try it first. I put the lighter to the bowl and inhaled deeply while counting to 20. Before I could let the smoke out of my lungs, there was a feeling of falling one frame at a time downwards, and the last thing I remember saying is, This isnt a drug? My friend thought that I was handing the pipe to him so he took it, but I was frozen still. What I remember is slightly vague, but it felt like I was turning back and forth for an eternity, I didnt know where/what I was and everything was green, then my body felt like twisting Saran wrap every time I turned back and forth, as soon as things were coming into focus there was some one there (my friend) but I had no idea who this person was, their lips were moving and I couldnt understand anything, it was just his face and everything else was green,then this stranger was holding what I thought was a tube, and for some reason I thought I had to connect something to it but I couldnt control anthing. </p><p>The tube ended up being the pipe that he just took from me. My body then felt like it was, for lack of a better word, a fruit rollup being peeled off my couch. It was the most disturbing sensation I have ever felt. As soon as I regained enough of my consciousness to think, I jumped off the couch and ran towards the door, then stopped and looked down the hall, and then turned around and looked at my friend who was ready to grab me, I kept saying is this real, is this real, what just happened. I couldnt grasp the fact that I wasnt still tripping and I felt as though I would go back under any minute. I was scared shitless.</p><p>I sat back on the couch and couldnt believe what just happened, I had the worse headache ever. So I asked my friend how long I was gone and he said 4 min, I was like WHAT?!! It felt like an eternity, the only thing that I could understand if you can even call it that is that nothing, and I mean nothing, was familiar, and the feeling that it was never going to end, its hard to describe and sounds like a contradiction, but I knew of nothing and felt that it wasnt going to end, all at the same time. I looked back at the pipe, and the top layer wasnt even all burnt. Then my friend proceeded to tell me that the look that I had on my face made him decide that he would not proceed to try it, his words were an expression of blank primordial fear. He also said that I got up and turned around twice, which I have no recollection of, and would explain why it felt like I was turning back and forth for eternity, it must have gotten stuck in my head and that repeated over and over again.</p><p>This was by far an experience that I never hope to repeat, or as I have come to call it a grotesque time loop of epic proportions. I have not touched the 5X since and dont think I will be doing that ever again. I just received some unadulterated leaves, but even then the taste of the smoke sends chills down my spine, in fear of another endless episode. So far the straight leaf has been pleasurable, but that extract has burnt something in my mind that I could have lived with out, absolute pure uncontrolled fear. There is no reassurance, no comfort, damn you dont even know you exist, and that my friends is no fun at all.</p><p>Please be careful if you plan on trying this truly amazing plant, start slow and have a sitterbelieve me, you will be glad you did, or truly sorry you didnt.</p>"
}
