{
 "title": "A Place In The Universe",
 "author": "BOXCAR",
 "citation": "   BOXCAR. \"A Place In The Universe: experience with Mushrooms - P. Cubensis (ID 17447)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17447",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17447",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 14, 2005",
   "Views: 3164",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I began the night thinking that the mushroom gods might not be favoring me on this particular evening, and if they weren't they soon changed their minds. My fellow trippers and I ate the mushrooms as soon as we got them. I ate three grams, as did my friend Kancer. This was at about 11:45 pm. Betty and Veronica(not their real names) each ate one and a half grams. The mushrooms kicked in really fast, I could feel them starting within twenty minutes. At the half-hour point I was well on my way, as was everyone else. We decided to make our way downstairs to smoke some herb. We smoked a bowl and sat listening to 'We Can Dance' by David Bowie. We noticed that Veronica was missing, it turned out that she went out somewhere. We went upstairs and tripped out a bit, and Veronica returned fairly soon, She went out with another girl and picked some flowers. We went back downstairs to smoke more pot, now joined by two more people. We smoked a bowl while we sat their with our thoughts, spiraling through the universe and its fantastic possibilities. I remember having a discussion about colors, and if black and white are colors, and if there's such a thing as an anti-color. </p><p>I realized how good it was to do mushrooms with a group of people, lately all the trips I've gone on have only been with one other person. It felt better this way, like the circle was complete. I noticed a peculiar phenomenon while we sat there in the dim lighting, I noticed that I could see my fellow trippers very clearly, but the two people who weren't on mushrooms sort of faded into the shadows. We finished the bowl and went upstairs we tripped out for awhile and decided to go to my house. We went upstairs and slowly got our things together and got ready to go. Once we left, at about 2:00 am,we went down to the riverbank right by Betty and Veronica's house and started on the path towards my house. We talked about mushrooms and told stories as we walked. We talked about my first mushroom trip, which both Kancer and Betty participated in as well. It was good thinking about things like that. We soon came to a place where the paved path went one way and a dirt path started. We decided to follow Robert Frost's advice and take the road less traveled. As we made our way along the path it started to go down into a sort of ravine, the ground was muddy and it was slow going, but we got to the bottom and found a small stream that ran into the river. We crossed it and climbed up the other side. We continued on for awhile, in silence. I felt a cool breeze on my face and breathed in the fresh night air, and I felt extremely peaceful.</p><p>Eventually, not too far away from the train bridge near my house, we sat down to rest. I packed a bowl and we looked at the sky. There was a lot of stars visible that night, and northern lights as well. We sat looking at them for awhile, and I felt very privileged that the powers that be felt us to be worthy of witnessing this spectacle. It was one of the most beautiful things I've ever seen. We were mostly surrounded by nature and it was easy to ignore the city and, for awhile, I was able to forget or pretend that human beings never existed and never fucked up the earth and never did all the bullshit that we as a species have done. It seemed like the northern lights were surrounding us like some kind of protective aura, generated by our heightened energies, and I felt like I had a place in the universe.</p><p>Kancer sat and beat-boxed, while I thought about myself and how I can better my life and the lives of those around me. I realized that I need to stop being so serious about pot, and LSD, and mushrooms and harmalines and whatever, and not be so spiritual about it all the time. I realized that I need to enjoy things more and have some fun. We soon decided to continue, right after a train crossed the bridge. We continued in silence until we got to the bridge and started to cross it. We slowly made our way across, stopping frequently to admire the water or the sky or the city stretching out before us. We eventually got to my house just a few blocks from the bridge, and it turned out the journey only took half an hour. We went downstairs and smoked out of my hookah and talked about all kinds of subjects while we listened to the 'Aqualung' album by Jethro Tull. Eventually, my girlfriend got home, at about 4:00 am, and we gave everyone else a ride home. Once we returned home we smoked a bunch of weed and listened to Jimi Hendrix's 'Are You Experienced?' album, before going to bed. I woke up the next day and began writing about what might have been the best trip I've ever had.</p>"
}
