{
 "title": "Wonderful Soft Nothingness",
 "author": "FirstTimer",
 "citation": "   FirstTimer. \"Wonderful Soft Nothingness: experience with Hydromorphone (ID 17459)\". Erowid.org. Sep 13, 2002. erowid.org/exp/17459",
 "substance": "Hydromorphone",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "4.0 mg",
   "IV",
   "Hydromorphone",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17459",
   "Male",
   " ",
   "Not Given",
   "Sep 13, 2002",
   "Views: 61695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have done several opiates over the past two years, both orally and nasally but I've never injected them before. I had acquired two 1ml/4mg ampules of Dilaudid / hydromorphone a few months ago and as I was told that orally used hydromorphone is quite weak I open one of the ampules and let the liquid dry which yielded 4-5 nice crystals. I snorted the crystals but didn't feel anything special. Of course I felt the typical opiate effects, but not as strong as I had hoped.</p><p>So I decided that I would inject the other ampule one day as snorting seems like wasting this powerful opiate. I forgot about it more or less but a few days ago it came to my mind again. I ordered some 0.5ml insuline syringes over the internet which surprisingly arrived right the next day and so I decided to try the Dilaudid the coming weekend.</p><p>At first I wanted to do the hydromorphone i.m. but then I thought that this would probably be the last time I'd ever get a Dilaudid ampule and that I should make the best out of it. That means I would do it i.v. I cleaned my arm with some isopropylalcohol and then I broke off the head of the ampule and loaded the first syringe. Unfortunately I accidently had ordered 0.5ml syringes but the ampule was 1ml, so I needed to load two syringes. I sat down on my bed feeling a little nervous and very curious on how it would be like, I was told the rush of i.v. hydromorphone would be close to heroin.</p><p>I'm often donating blood so I wasn't afraid of the injection and since I had pharmaceutical injectable hydromorphone I also needen't be afraid of infections. Anyway, I had the two syringes loaded next to me, my arm cleaned with alcohol and was ready to inject. Carefully I put the needle in my vein and slowly injected the liquid. Right after that I quickly took the second syringe and injected again. The effects came up fast but I was a bit disappointed, nothing like what I had expected, no rush that was better than any orgasm and no feel like being in paradies...</p><p>But of course it still was very nice, everyone who has taken stronger opiates before will know the nice, relaxed, careless feeling they give you. I just layed on my bed staring blankly out of the window and was simply feeling ... fine. Empty headed but not in a negative sense, not the dull feeling benzos give you, but a wonderful soft nothingness. You can see, the experience definitely was nice, but I missed the rush feeling you always hear of. I fear my tolerance has grown a bit high over the past 2 years, so the 4mg were not enough. I stood up, noticing walking was a bit difficult and went to the bathroom to see if my pupils had become smaller. Then I just stood there in front of the mirror and did nothing... :) I was just being there, not careing about anything and was just feeling fine while standing in my small 4qm bathroom that hardly deserves that name. Yep, Dilaudid i.v. has its powers...</p><p>Dilaudid also gives you a very clean high as compared to other opiates. It's hard to describe, but just think about codeine, it is not as clean as morphine and morphine is not as clean as hydromorphone. Heroin (which I only did nasally) also has this clean feeling and Dilaud really is quite equal to heroin.</p><p>Every opiate when done i.v. wears off rather fast and especially hydromorphone is short-acting. The effects gradually decreased and about 1-2h after injection I was pretty much base-line. My mood was still lifted up but I was not really high anymore.</p><p>I feel like I should give this warning at the end: You should never inject any drugs besides pharmaceutical ones and I don't mean dissolved pills but only ampules. Anything else is dangerous for your health and it also keeps the frequency of usage very low as at least for me it is nearly impossible to get ahold of injectable opiates.</p>"
}
