{
 "title": "One Toke Over the Line",
 "author": "words0fw1sd0m",
 "citation": "Citation:   words0fw1sd0m. \"One Toke Over the Line: experience with Cannabis (ID 17451)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17451",
 "substance": "Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17451",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2005",
   "Views: 3668",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me start off by saying that I have been smoking cannabis and using many other substances off and on for about 6 years of my life, and I have yet to come across any bud that was this potent ever again, and maybe for the best.\r\nIt started on a Thursday night at a friends who I had agreed to sit for while he took a pretty high dose of DXM and Dramamine tablets (somewhere around 700mg DXM and 20 tablets of Dramamine). Well about two hours after taking the combination he wanted to go across the street to a friends and chill with some people. To my surprise he could actually walk without any problems whatsoever. Anyways, when we got over to A's house, there were 5 other friends over and they were all passing around a blunt and about to pack a bowl. They asked me if I wanted to smoke a bowl, so I agreed and went to sit down with them. I was the first to hit the bong, and I didn't want to get really high so I only took 1 hit. 'Only 1 hit, what could that do?', I mistakenly thought and later found out. Close to 10 minutes after my hit, I was feeling it come on pretty fast, thought it wasn't the usual cannabis high, it had a *weird* vibe to it.\r\nSo, I decided to stand up (usually helps when I'm feeling ill) to get rid of the nausea that had suddenly swept over me, and sure enough, it went away with no problems. I was coming up VERY fast and it was VERY intense. I wasn't really comfortable with the surroundings I was in so I asked my friends to watch B, my friend who took all the DXM and dram., while I went for a walk to clear my head. Well, I ended up walking home. The whole way home I was hallucinating all sorts of weird bugs and animals all around me. At one point on the way home, two old men standing next to a truck asked me if 'I was in the bar tonight'. I don't know if this had really happened so I just ignored it and kept walking my usual route home. About halfway home, every little spec on the road looked like a bug running around in the street, and I kept seeing bats and strange birds flying through the air above me, all making very strange noises similar to cars passing by on the highway. When I finally got home, I started fading in and out of consciousness, without knowing it until my body would 'jerk' and I would awaken.\r\nI suddenly got nauseous again so I stumbled to the bathroom to vomit, but nothing came out. While I was sitting at the toilet, still fading in and out of consciousness, I thought I was standing in my friends backyard drinking malt liquor and kept saying 'I think I need to start heading home in a minute, the rice cakes will be ready soon.' Then I kinda 'popped' back into reality still feeling very nauseous. I never actually threw up, but came very close. Then next 40 minutes or so were spent sitting down at the toilet, falling in/out of reality, and falling over and hitting my head against the bathroom wall. When I finally came down enough to get up and move, I looked into the mirror and saw myself wearing a GIANT orange sombrero; very strange. When I moved into the living room, I collapsed on the couch and passed out until the next morning. And yes, I got a very good nights sleep.\r\nFor all of you who read this and think, 'cool', its was everything BUT cool. It scared the hell out of me. The whole time I had this overwhelming fear similar to the fear you get when on acid. On top of that, the stomach pains through the whole experience were terrible. And the friend who I was supposed to be sitting for, freaked out that night and went running naked through the neighborhood looking for his 'necklaces'.(it still amazes me that he could walk with no problems) But I hope this report helps those of you out there who think that there is no such thing as 'one hit shit', cuz there is, and this was by far, the most intense experience I've ever had with cannabis. \r\nPeace,\r\nWisdom\n\n\n"
}