{
 "title": "Hell Hath No Fury",
 "author": "Angel of Syn",
 "citation": "   Angel of Syn. \"Hell Hath No Fury: experience with Hawaiian Baby Woodrose Seeds (ID 17477)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17477",
 "substance": "Hawaiian Baby Woodrose Seeds",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "9 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17477",
   "Male",
   " ",
   "Not Given",
   "Jun 14, 2005",
   "Views: 5184",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Alright, lets start from the beginning.. I've used many a drugs in my life and though most people hold marijuana as a favorite in their regular use pattern, I've always favored hallucinogens and opiates. So one day while roaming the internet just basically bored off my ass I found some info on Hawaiian Baby Woodrose seeds and the experience was said to be LSD-ish and what not and hey, I'm not one to pass up new experiences, so I ordered some from an online botanical company.</p><p>Jump ahead - yesterday as I impatiently wait for the mailman *as usual really as I order alot of things from the net* he finally arrives with a little brown package. *YAY!* it was the seeds! Being nice and excited and ready for my new experience of the day I opened up the package and found the little bag of seeds. I did my best to remove all of the brown fuzzy shit on them and at about 2pm I flopped down on my bed and chewed up 9 of them. I figured 'heh, 9.. what the hell.. thats not much at all! but since its my first time using these why not stay at that..' I regret ever thinking such a thing as '9 isnt much.. hahaha.. I spit in the face of such pityfully small amounts!' that was my basic idea on it but ya, right.. I'm not sure if 9 is too much or not for me but I have no desire to ever try again and find out.</p><p>They took a while to kick in, and when they did I had what seemed to be maybe 15 minutes or so of 'lost time' the first thing I knew of the experience was a sick feeling so I got up and started to walk to the bathroom, only made it about half way though before my legs gave out and at least seemed to be in serious pain so I had to drag myself to the toilet.. nothing though.. I got a grip on myself, stood back up, and walked back to my bed. Once I got back on my bed though the next phase of it all kicked in. It was very much like the film Trainspotting when the guy is locked in his room to break away from heroin. Basically curling up, writhing around in pain and generally fucking up my bed sheets and what not and all through this I was having 'strobe like' hallucinations which reminds me of the scenes in Natural Born Killers.. Strange and colorful, fast moving insane hallucinations blinked in and out of my sight. Passing minutes seemed like days.. At one point through this I heard the phone ring and knew who it would be calling so I picked up the phone and tried my hardest to hold to what small amount of reality I could and told her to come over.. ASAP.. I tried to talk like I was A-OK and she didnt know anything about what was going on. I just knew in order to make it through this horrible experience I needed someone there that I could trust and help hold my ground somewhat in the real world.</p><p>*note* yes, I know that your always supposed to take things with someone so instances like this do not happen but I figured I've done enough other things in my life and even during bad trips or what not I've been able to keep myself together entirely.. I guess ignorance is bliss *but not for long* and I've definitely learned my lesson as far as this kind of shit goes..</p><p>When she showed up she was high, my mysterious freaking out and expressions of pain kinda killed her buzz but the fact of her being there helped me out a LOT. I tried to explain what I could of what was going on and then off to the toilet I went. I puked.. layed down on the floor.. puked.. floor.. then just kind of crossed my arms and put my head down over the toilet.. I'm not sure since I was still REALLY out of it at the time and dissasociated to the max, but what I was throwing up seemed mighty pink and then red.. perhaps it was blood, I couldnt tell at the time, I had worse things to worry about.</p><p>At this point I have to extend a great thank you to some person *dont remember who, or what drug* that wrote a report about going to the hospital and then like right after that he was fine and felt like an ass for not waiting it out.. I was very glad to have read that because around this point in the trip (curled up on the bathroom floor no less) I was in so much pain and so fucked up that it took everything I had to not just yell to someone 'CALL FUCKING 911'.. and sure enough, after about 5 minutes (or what seemed like days) of that feeling - I was fine.</p><p>About 8pm it was all over.. I dont think I'll ever be so happy to come down from a drug as I felt at this point.. For the rest of the night and up untill I got up in the morning today and showered I remained very dissasociated and generally 'out of it'.. Now I believe I'm all here but I still have a lingering feeling of being 'gone' at least a little bit.</p><p>What I have learned from this experience and what I would want to warn people of are thus-</p><p>1.) With the trip I had - major trip experience is needed and being perfectly cool in the head.. more than once during it my mind was crossed with a thought (though seemingly not my own thoughts.. hard to explain really) that the only way out is suicide, but my *reality mind*  kept up with me at least somewhat and I knew better.. this isnt a 'first try on drugs' thing to do for ANYONE!</p><p>2.) Drugs are illegal for a reason - they make things illegal because there is a potential for abuse, therefore, LEGAL things such as this are probably not expected to be 'abused' or used repeatedly.. THERE IS A REASON FOR THIS!.. I will definitely stick to the ILLEGAL drugs from now on.. I have 99% positive experiences with those, the legal drugs, no.. diphenhydramine is legal, that was somewhat interresting at points and not too horrid at all yet I've still only brought myself to do that twice in three or so years.. Take the words of the wise, dont do legal drugs.. damn.. </p><p>Lastly, I would like to thank the person that was there for me through this experience.. *you know who you are*.. it is one of the most appreciated things I could possibly think of..</p><p>~Never Again...</p>"
}
