{
 "title": "Absence of Knowing the Time",
 "author": "diman",
 "citation": "   diman. \"Absence of Knowing the Time: experience with Mushrooms & Salvia divinorum (ID 17499)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17499",
 "substance": "Mushrooms & Salvia divinorum",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17499",
   "Male",
   " ",
   "Not Given",
   "Jun 14, 2005",
   "Views: 3852",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The very first time salvia smoke entered me after mushroom tea on the docking deck by the frozen river open to snowy shores and lit by stars above Georgian Bay in Ontario. The fungi worked mildly, creating slow vibrations of inner thoughts, presenting colorful and dynamic texture of wooden walls revealing their multi-layered composition. Slow series of events at the cottage gently forced me to drift to the deck filled with evening silence. With the last dark red glow of burning dried leaves in a pipe I had a feeling seeing sparkles from stars sliding into it. In the next few moments I discovered that the texture of air around me, being darked, was made of bands of moving tiny tri-color masks with outlined eyes and mouth. Concentrating on them made me feel increasing skin rush and escaping sense of time, with increasing audio vibrations in my ears. </p><p>I heard sounds. Distinctively they formed the word which my ears easily recognized. Slow and loud, androgynous, a bit demanding, passionless, hissling with high frequency noise, almost unnoticably re-echoed and unexpected : 'ASK!'. The sense of the immense rotating column of blurry images was in front of, almost within me, with up and down directions. Strong doubt raised within me in the authority of the other side. I needed proof how deep can I trust it and how sincere could be by possible query. Before my next breath I saw, heard, felt all of them at once. Long gone, they used to confuse me with their weird choirs of voices and landscapes and strange light sources when I was too small to write a word. Who else but me could know my dreams? The presence of the column has become more obvious, clear, filled with forgotten but known experiences of voices, sounds, images I could not recollect and reconstruct. Few seemed unfamiliar, streaming along the column downwards. My lips were whispering, repeating the question. I did not have the one ready. </p><p>Several attempts caused a feeling of hearing, sensing the laugh or frustration of the other side of its limited time window for me to be able to grasp an answer. And I asked what I was trying to ask myself but seemed like still having no clue about it. For years. The answer was overwhelmingly short and simple : my dreams. I just remembered it being unable to connect it with the question. Though time flow was blured, irrelevant and almost vanished still I could recognize breathing as a long process. Ice cracked and the vision of column started to darken, sounds and choirs fading away. The feeling of intense desire to comprehend exhausted me and somewhat frightened. My reward was instantaneous and overwhelming. Looking up and seeing the river of stars flowing softly without changing their positions was heavinly awesome. Everything was overwhelming and friendly. I felt the greatest comfort, compassion and warmth of the best friend. Perhaps I smiled and star river slowly became still. The cottage door opened and my friend called my name in the darkness. Walking back I was hit that all my years of computer programming were spent in order to prepare me for login to myself where I felt at home, with something knowing me, keeping my thoughts, and pointing me out the portal to it. Communicating with me through the game where I could not lose. </p><p>It took minutes perhaps but absence of knowing the time felt wonderful.</p>"
}
