{
 "title": "Clarity - Out of  Body Experience",
 "author": "Crispy",
 "citation": "   Crispy. \"Clarity - Out of  Body Experience: experience with Hash (ID 17510)\". Erowid.org. Dec 7, 2004. erowid.org/exp/17510",
 "substance": "Hash",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis - Hash"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17510",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 7, 2004",
   "Views: 13703",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nYesterday I were smoking with a friend, we sat in a park like environment, behind a hill so no one would see us. At the time I was in good mood, my life was just normal at the moment, no big downs or ups lately, physicaly I were in normal condition as well, and I had not done nything special that affected me the last time.<br>This was my 5th time (maybe 6th) I smoked over a period of 1 year, but only my second time smoking joint. We had 2 joints each, 2 grams in total. The first joint was badly made so I didnt get much effect, but after the second joint I started to get high, but not extreme in any way. It took about 20-30min to smoke the joints because we first made one each, then had to make two more cause we needed more. I reckoned I wouldnt get more high then I was, and we left the place, heading home.<br>Then, after we had walked for 5-10 minutes I started to get realy dizzy, my brain was working slower, it felt like my brain was lagging. The 'refresh rate' of my eyes was realy low, so each time I got a new picture loaded to the brain I had moved a few metres. I stumbled quite a bit, I assume the 'lag' was the reason. While we were going down to the city I started to feel something that can be described as my soul kinda growing bigger then my body, so lot of my soul was outside my body, this was realy confusing because it was so new to me. But after 5min I started to get used to the feeling and could concentrate on the real world again, then I was totaly shocked.<br>Suddenly I could sense everything in the area, every little noise, every little movement, every detail. I could sense two cars coming out of a tunnel behind us, and I knew exactly how far it was between them. I could see the movements of every leaf on the trees. It felt like I left my body, and became one with everything else, you could say there was no me, as the human I am. This lasted for 30 minutes, and it was a realy wonderfull feeling.<br>When I started to return to my body I got the same feeling as when I 'left' it. With bad coordination, and the brain was once again 'lagging'. It felt just as weird as the first time. When I finaly came 'down' I called another friend and met him at a little party. I was basicaly lost when I got there, in the meaning that I was sleepy, slow in reaction, not very smart, didnt realy understand what was happening. So after sitting there for 30 minutes with drinking wine, I was getting to be more aware of everything. We went out on a pub later, and drank lot of beer there, before I went home in the night sometime.<br>Through the evening I never got sick, and the next day I was totaly fine.<br>I cant see any special reason for the high I had. But my experience with hash is that every high can be very different.  And this one was definately my best one ever. There were no real downs during the trip, well there were one small down, I was kind of scared by cars driving by, so if I had to cross the road I ran over, but that didnt last very long because I went on that party.\n\n\n"
}
