{
 "title": "My Will and My Trip",
 "author": "Tool N. Die",
 "citation": "   Tool N. Die. \"My Will and My Trip: experience with 5-MeO-DiPT (ID 17540)\". Erowid.org. Jul 7, 2006. erowid.org/exp/17540",
 "substance": "5-MeO-DiPT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "13 mg",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)",
   "  T+ 1:30",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17540",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 7, 2006",
   "Views: 3097",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI decided to try insufflating 5MeO-DiPT because I like relatively short hallucinogenic experiences. I have found that a drug like LSD which lasts for hours does not make a good social experience. In contrast, my experience is that insufflated substances generally come on and subside more quickly than their ingested/smoked counterparts. So insufflated it was to be.<br>I was at a friend's house at a fairly relaxed party. Most of the people there were friends or acquaintances, and a large number of them were sober. Probably ~10 people there were tripping on various experimental chemicals. I had just eaten a large meal, and I was sober and happy.<br>10:30 - Our host served the 5MeO-DiPT to two of us - 13 mg for myself. Snorting was a little unpleasant. The snorting itself was not so bad, but the aftertaste was bitter. We fortunately had some grape juice that was strong enough to kill the aftertaste in the back of the throat.<br>10:45 - I felt a definite change in my visual perception very much akin to the feeling of 'coming up' on other hallucinogens. However, the feeling did not really intensify as time progressed. I felt mildly disoriented and happy, not at all paranoid. I had a few conversations with friends, feeling not at all impaired by the drug. I do not think that most of the people I talked to even knew that I was tripping.<br>12:00 - I had two drinks. WOW! all of a sudden, the psychedelic effect of the 5MeO really kicked in (shimmery vision, closed eye visuals, etc). I didn't drink any more. In this stage of my trip, I became loud and boisterous, akin to drunkennes but more lucid. Lots of fun. By then, I was already peaking, and my pupils were dilated wide, so my intoxication was quite noticeable.  <br>1:30 - I went to sleep. Just 3 hours after insufflation, and I could drift of safely to sleep, with mild closed-eye visuals ushering out the nicest trip I've had in a while. <br>In summary: This was not a 'tripping balls' experience. It was a great enhancer of interpersonal interaction. It lasted about as long as I wanted it to, and did not incur any unwanted side effects other than the general discomfort of sticking a straw up your nose and inhaling bitter powder. I guess it could've been a little more intense, but I think that perhaps my next attempt will not seek to remedy this by upping the dose of 5MeO-DiPT. A better plan might be, for me, to take more alcohol earlier in the experience.\n\n\n"
}
