{
 "title": "Alkabitius Dominko Loves You",
 "author": "Psychotria",
 "citation": "   Psychotria. \"Alkabitius Dominko Loves You: experience with Salvia divinorum (tincture) (ID 17580)\". Erowid.org. Sep 18, 2002. erowid.org/exp/17580",
 "substance": "Salvia divinorum (tincture)",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   "3.0 ml",
   "sublingual",
   "Salvia divinorum",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17580",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 18, 2002",
   "Views: 12281",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFriday the 13th, 2002</p><p>Alkabitius Dominko Loves You</p><p>WARNING: The lesson which I learned from Salvia may be considered offensive. It is politically and socially incorrect. You are reading this report of your own free will.</p><p>SUBSTANCE(S) : Salvia divinorum (tincture)</p><p>DOSE : 4 droppers straight / sublingual, 15 mins.</p><p>BODY WEIGHT : 126 lb.</p><p>GENDER : Male</p><p>PREAMBLE</p><p>This is an account, as nearly as I can describe it, of my fourth experience with S. divinorum. It is an account of the results of the Sage Goddess Emerald Essence tincture manufactured and sold by Daniel Siebert. It has been divided into a preamble, an introduction, two chapters, my conclusions, and a lesson from the S. divinorum collective. This division is for organization and convenience.</p><p>I must make it clear at the outset that, as of this writing, I am still a neophyte psychonaut. Never have I ingested any recreational or spiritual psychoactive of any sort, other than S. divinorum. Being in full awareness of the intensity of the experiences which are often evoked by this psychoactive, nevertheless, I freely and willingly ingested S. divinorum.</p><p>INTRODUCTION</p><p>On this particular expedition, for which I again chose to forego the bother of a sitter, I became so daring as to ingest such a large ammount for my sensitive faculties that I passed through the second highest doorway and entered the dissociation of the immaterial existance of Salvia level five. It is also possible that I momentarily experienced the amnesia of Salvia level six, for, as the careful reader will note, there is no account of how I moved from the experiences in chapter one to those in chapter two: I have no memory of what happened during the moments between these points.</p><p>CHAPTER ONE</p><p>Cornpone pig-huggers on the mud farm.</p><p>Pacing back and forth, flanked by my couch on one side and my entertainment center on the other, I struggled to hold the four straight dropper-fulls of S. divinorum tincture in my burning mouth. My house was quaking wildly, but, strangely, my balance and muscular control remained intact.</p><p>From somewhere close to the ceiling manifested an old and revoltingly folksey lady with her idiot husband standing behind her. The lady was three-dimensional, but her husband was a plastic, two-dimensional image. They were visible from the shoulders up. Both of them were living cartoon paintings hanging in the air without a canvas: they were transparent and painted on space, or rather, the space of my mind hanging in the air.</p><p>My sense of identity was no longer what it should have been, and it was becoming even stranger. Overalls and a straw hat clothed my body, and I was growing fat and dumb, as I began to bob my head and sway back and forth with each step of my pacing. The man smiled silently, and the old lady loudly coached me to fall deeper up into the experience, yelling at me as though I were a pig in a race: 'Come orn, boy, keep it in yer mouth! Thet's the way! Bob yer head!'</p><p>I was fast becoming one of the folks. Sacred corn husks decorated my overalls. I was the Kangaroo God. I was the Corn God. I had the unnerving desire to walk into my mother's bedroom where she was sleeping, and announce my divinity. Fortunately, I did not do that.</p><p>I was traveling to the big extradimensional cornpone farm, with barns and tractors and picket fences, where hokey cartoon farmers grow mud and hug their pigs. The transformation of reality was banging and swaying inside my head, coming from somewhere higher up, some place I couldn't identify.</p><p>I succeeded in holding the tincture in my mouth until I lost all control.</p><p>CHAPTER TWO</p><p>God's name is Alkabitius Dominko.</p><p>I was one of the race of Giant Machines. I had all the advantages and limitations of a machine. I thought machine-thoughts, and knew only machine-pleasures and machine-duties. I was not human in any way. I did not remember having been human. I didn't even know what humans were.</p><p>Unified in mind and purpose, we, The Giant Machines, worked The Gardens. We preserved the Robot-Flower and Flower races, our relatives and helpers. Work was our existance, it was the Highest Purpose, it was all we knew and cared about. We worked and clipped and processed and danced in this colorful garden of labour under the Work Director, Alkabitius Dominko. An exhalted robot and The Great Giant Machine, Alkabitius Dominko was our master, and we served under Him, as the Aeons passed and passed away. And we were happy.</p><p>Awareness of my surroundings slowly began to return. I witnessed one of The Giant Machines towering over my body as I lay on my couch. It was being run by some unearthly creature which I cannot describe. The Giant Machine was clipping the fractal grass growing out of space, and I watched in a dreamlike stupor.</p><p>Believing that I was still waiting for the fifteen minute oral ingestion period to pass, I jumped up and wondered aloud, 'is it time?' I discovered that somehow, at some point, I had turned off the hanging lamp in my living room. I turned it on again, to discover that I'd lost so much muscular control that, in so turning on the lamp, I inadvertantly slammed it against the wall. Looking at the clock, I realized I had been disassociated from myself for only ten minutes. It had seemed like an eternity.</p><p>Everything was rolling and quaking in the rocketing spaceship which was my house. I struggled to remain upright so I could turn the light off again. My mind was sloshing and waving, drowning under the waters of dimentia, and my identity began to slip once more.</p><p>A Giant Machine Work Director from the factory-funhouse next to The Gardens had come to meet me, and was coaxing me to return. 'That's right, turn off the light. You must come back to work. Alkabitius Dominko wants you to come back to work for him!' To so deviate from our machine-natures and machine-duties as I had done, was to defy our Natural Existance as Giant Machines.</p><p>The desire to fulfill my sacred duty to Alkabitius Dominko and The Giant Machine race was overwhelming, but I recognized that my true nature was as a human, and I did not wish to return. But the S. Divinorum experience was overpowering, and I remained on the planet of the Giant Machines to have sexual intercourse, another form of work, with one of the Robot Flower race, who was far happier about the banging, bouncing, monotonous experience than I was.</p><p>The S. divinorum journey faded within ninety minutes, and I returned to earth. The rocketing spaceship had landed. I returned from the dimentia. It was good to be myself again.</p><p>I discovered a stain of tincture on the collar of my white shirt the next morning.</p><p>CONCLUSIONS</p><p>A powerful dissociative.</p><p>It had not been my intention to have a full dissociative identity transformation. But by the time I was bobbing my head and wearing sacred corn husks and thinking I was still in control, I definitely did not know what I was doing. I'm glad that the whole experience lasted only two hours.</p><p>S. divinorum is not a substance to take lightly. It is a powerful dissociative. High doses could place an individual in physical danger and psychological emergency.</p><p>If you are considering S. divinorum, I would caution against it. My experience with deep meditation may be the only thing that is responsible for my preexisting ability to cope with extradimensional space. I do not and cannot recommend high doses of S. divinorum to other first-time psychonauts.</p><p>LESSON FROM THE S. DIVINORUM COLLECTIVE</p><p>Alkabitius Dominko loves you.</p><p>People are happy to be dead-minded, following the demon Alkabitius Dominko without question or cause, revering leaders as though they were gods. Those people who awaken or are revived out of the collective trance to become human, are treated as though they need Correction. They must return to their mindless machine-state and be like everybody else, because Giant Machines are What We Truly Are. Enlightenment is given lip-service in our society, but to truly and honestly enter a higher state and become a higher entity is deviation. And deviation from the direction of Alkabitius Dominko is An Unnatural Thing.</p><p>If you want to be unique, then you are permitted to be unique, but only within a socially accepted context: you must be unique only in The Accepted Ways that everybody else is allowed to be unique. If you want something, then you are permitted to have it, but only within the social normalcies: you can have what you desire only in The Accepted Ways that other people are permitted to have that same thing, and only if it's commonly accepted in some circle. If you want to evolve, then you are permitted to evolve, but only along the path of the social collective: you must evolve into greater Giant Machines only.</p><p>This is the disease of restriction we call Culture. Many people believe they are above this problem and do not participate in it, but mindlessness is mindlesness. People who think they are above it for what ammounts to nothing more than being mindless in a different way, are the most ignorant of the slaves in The Gardens of Alkabitius Dominko.</p><p>What happens to those of us who refuse to be machines? My experience has been that we are cut off from life and pleasure as and because people discriminate against us. This is a new form of the very old fallacy of excommunication: if you're not a part of the high-tech mindlessness people refer to as Culture, then you're an idiot, or something to ignore, or another neurotic in need of treatment. You just can't handle life.</p><p>There is nothing evil about The Giant Machines, and they do their work very well, but these people are not interested in facing the truth about evolution and enlightenment. Why should something which is essentially a machine, want to evolve into a human? Machines don't even know what humans are. Machines cannot receive enlightenment.</p><p>This is what people are today. There is no logic in them. You cannot reason with the dead-minded Giant Machines. In the past people would make-up excuses for things, but people are so mindless today that excuses for staying mindless are irrelivant: you simply do not deviate or become unique, because those are things you simply do not do. And should you do them, you are wrong, and you should return to your previous state and way of thinking. This is the only way to please Alkabitius Dominko.</p><p>If people cannot or do not want to ascend, then let them stay at the lower levels. Perhaps the rest of the world is not meant to be anything more than Giant Machines. As for those of us who have awakened, we have no need to return to the lower levels.</p>"
}
