{
 "title": "Jolted Awake",
 "author": "Kilgore",
 "citation": "   Kilgore. \"Jolted Awake: experience with Salvia divinorum (leaves & 10x extract) (ID 17639)\". Erowid.org. Aug 20, 2007. erowid.org/exp/17639",
 "substance": "Salvia divinorum (leaves & 10x extract)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17639",
   "Male",
   " ",
   "Not Given",
   "Aug 20, 2007",
   "2423",
   " "
  ]
 ],
 "report": "<p>My friends Todd, Stephen and I decided to purchase some salvia divinorum. We purchased a quarter ounce of dried salvia leaves and a gram of 10x enhanced salvia leaf. We smoked two bowls of the dried leaves on Stephens back porch. Immediately after smoking, Stephen and I experienced a very dizzy, laughing, euphoric high that lasted for about 10 minutes and Todd experienced nothing. We went back into Stephens house and took our places, Todd on a chair, me on a recliner, and Stephen on a couch. I then packed a bowl of 10x on top of the cashed bowl we had previously smoked, to prevent the rather fine plant material from falling through the bowl, and took a long deep hit, keeping the flame on the bowl the entire time I inhaled.</p><p>Immediately upon inhaling I was sucked into what I can only describe as another dimension. I have no recollection of passing the pipe to either of my friends or even exhaling my hit. It began with a violent spinning of the room until I had no consciousness of ever having smoked anything or ever having heard of anything called salvia or ever having heard of anything called the planet earth for that matter. This dimension I entered was, at the time, my only concept of reality so to call it a hallucination would be a bit of an understatement.</p><p>This reality took the form of a huge, spinning, merri-go round-like room in which I was laying down on a long table similar to those in doctors offices. Behind me, a woman approached me and put her hand on the table next to my shoulder saying something to the effect of I am salvia, I want you to come with me. At this point Todd said something to me which woke me out of the trance I was in. This was the worst possible thing that could have happened. Him awakening me into this unknown reality (which was actually real reality) was the most shattering, terrifying thing I have ever experienced.</p><p>For the first minute or so after he woke me, I was not sure which reality was real and I was struggling to choose which one to join. I was being pulled between two dimensions. I jumped out of the recliner wildly and tried to run as fast as I could away from the merri-go round dimension, afraid of what the woman was going to show me, even though I sensed that it was something benevolent she wanted me to experience. At this point Todd and Stephen, whose trips were much less intense, tell me that I was saying No, not now, Im not ready, this has to stop repeatedly before falling back into the chair.</p><p>When I was back in the chair it suddenly dawned on me that I had smoked salvia divinorum and was hallucinating. This was incredibly reassuring and I relaxed a bit, trying to enjoy the last part of what I now realized was my trip. By then, however, my trip was over and I came back to full awareness in a few short minutes, the only effect remaining being a slight stoned feeling. </p><p>I believe that the terror of my experience was caused mostly by set and setting. The room was two noisy and bright and full of interruptions. If I had never been awakened from my initial trance I wouldnt have realized that I was hallucinating and I could have enjoyed the experience. The hallucination was not scary, what scared me was coming back to reality in such a jolting way.</p><p>As I have read repeatedly but never really understood until now, salvia is not a recreational drug. The experience I had was the single most terrifying event of my life. However, after the terror had worn off, I realized the far reaching, unexplainable significance of the visions and sensations I experienced. Despite my fear, I definitely wish to continue my relationship with this complex plant, albeit with much more care and caution.</p>"
}
