{
 "title": "Does Not Mix with Mental Illness!",
 "author": "N/A",
 "citation": "   N/A. \"Does Not Mix with Mental Illness!: experience with LSD (ID 17644)\". Erowid.org. Jul 22, 2005. erowid.org/exp/17644",
 "substance": "LSD",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 17644",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 22, 2005",
   "Views: 10186",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>While in college, I experimented with a multitude of different drugs.  Most familiar to me was cannabis.  I had been a pot-head even before I got into highschool.  The effects were amazing, and I NEVER had one bad experience with it, other than the occasional overdose followed by regurgitation and dizziness.  About midway through my second quarter in college, I had my chance to experience LSD for the first time.  I had not done any research prior to my trying it.  It was kind of a spur-of-the-moment situation when my neighbors just happened to be selling it.  I bought one hit to test it out on myself.  I had no idea what sort of drug it was, and which part of the brain it affected, so I decided to go along with the seemingly incredible experiences my roomates told me about while they, themselves were tripping.  </p><p>Needless to say, none of them told me about the potential problems that could have occured, and I had no idea that I was supposed to have been in a comfortable place with people I felt comfortable around.  My roomate and her friends had always bothered me and made me feel very uncomfortable in a sort of hidden way since I met them.  I could not explain it, but I just felt it.  Not to mention I was under a heap of stress from class projects and work, which I subconsciously buried.  </p><p>Aside from the outside stress creators were the inside stress creators; the secret hell that lurked beneath the darkest recesses of my own mind, which I also had forgotten about at the time.  I have struggled with mental illnes all my life.  My diagnosis were bipolar disorder, manic depression, and severe anxiety disorder.  I had also been weened off my previous medication because I had made outstanding progress, and was able to control these horrible demons.  Upon ingestion of the first hit of LSD I felt nothing for the first 2 hours, understandably. After hour 5, though, my world flipped upside down.  I felt like I was in a bad 80's movie that I couldn't get out of.  My hands had begun to shake uncontrollably and my anxiety skyrocketed beyond the point of human tolerance.  The worst part was yet to come.  My roomate and her friends were trying to support me and help me through the situation, but they, themselves were in their own bad trips.  Everybody was hopelessly fucked up in their own way, and I was aware of that.  </p><p>I then remember two of them wanted me to come with them to get some food.  I really wanted to get out of the apartment, so I accepted the offer without hesitation.  They told me they were going to get the car started and go talk to this dude next door, and they would come back to get me.  Again, I said that was cool.  The truth of the matter was that they both simply forgot to come back for me.  My one roomate was very forgetful sometimes, and on any given day, I wouldn't have given it much thought.  But the drug had hit really hard by this time, and things were getting worse.  My mind started to play tricks on me.  I began to think that they never liked me in the first place, and that they were just too cowardly to tell me up front.  Then I began to think that they, and the rest of the world were all against me from the very beginning, and I was some sort of earth-bound reject that seemed to serve the purpose as 'thorn in the side' to every human in existence.  I begain to feel like I was the lowest creature on the planet.</p><p>When the two came back, I had gone so mad, I had a knife in my hand, stringy cassette tape wrapped around my neck, and bloody wrists from where I had a sorry attempt to slash them with an exacto-knife.  I was really in hell.  Definately at the bottom.</p><p>They both ran like crazy next door and locked me all alone in the apartment.  My mind wouldn't stop.  It only got worse.  I had begun to reason that they were conspiring to set me up to make me look like a 'bad guy' for their own purposes of hurting me.  The entire world all the way from the air I breathed seemed to dislike the fact that I was taking up space and that I was unwelcome to breathe air.  My roomate's friend (who was also a good friend of mine) came over to my apt and tried to comfort me.  I desperately tried to tell him that I was sorry, and I wanted this all to stop.  He sympathized.  I tried further to explain to him that I could not control myself, but all that seemed to come out were words to make me sound even stupider.  My own mind was against me and on a mission to make my life as miserable as possible.  It wouldn't let me die.  Each time I tried to committ suicide, my mind haunted me about how painful and agonizing it would be.  </p><p>My roomate later came in to see me crying my eyes out in sheer disgust at myself.  I don't think she fully understood the agonizing horror that I had suffered, but she sympathized.  We made up, and just the two of us joked around about kit-kat bars until morning time.  My trip was mellowing out a little, but my health was declining.  I began to sweat and freeze.  I later passed out on the sofa.  For a slight minute, I was so at peace as I welcomed the comforting hands of death embrace my soul.  I had had enough.  I began to think of my horribly abusive childhood, and all the pain I had gone through my entire life, and figured that I would never die;  almost like my curse was to live forever and never get that chance to finally rest.  I was literally willing myself into a peaceful death, or so I thought, but woke up later from a well-deserved nap.</p><p>There was one more time in which I tried acid.  It was a little later.  The same things happened, but not to the same extent.  That was because I was alone most of the time writing poetry and playing music.  I had one quarrel with someone, but that was it.  It wasn't very pleasant;  in fact, I was downright angry when my comment was ignored, and I had the door slammed in my face.  I nearly killed that person trying to get the message across that I wouldn't tolerate anymore abuse from anyone.  And that those who hurt me would soon pay, and if I were going to suffer, the rest of the world who punished me would suffer with me, or something like that. But trust me, the moment was VERY brief, as I lost my attention span, and went back into my bedroom to watch some TV.  I remember fearing that if I slept with the lights out in my room, that my fears would materialize, so I slept with the overhead light on.   </p><p>These experiences were during my most stressful moments in my life.  A lot was going on, adn I had a lot to reassess.  I eventually dug down into the deepest recesses of my soul to solve some of these problems that were seemingly non-existant until now, and have also begged to be put back on my medicine.  I think back now to how powerful LSD was to me and how one tiny hit took complete control and turned me into my worst fear.  This is not a drug I recommend to anyone who isn't at peace with themselves, or has the same mental illnesses as I do.  I still sometimes have flashbacks (very rare though).  From now on, I stick to what I know.  Marijuana seems so innocent compared to LSD.  In fact, I still smoke it, but unlike LSD, it is a very pleasant experience.</p>"
}
