{
 "title": "A Heightened Sense of Awareness",
 "author": "Kitchen Witch",
 "citation": "   Kitchen Witch. \"A Heightened Sense of Awareness: experience with Belladonna (berries) (ID 17696)\". Erowid.org. Jan 21, 2007. erowid.org/exp/17696",
 "substance": "Belladonna (berries)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bry",
   "oral",
   "Belladonna",
   "(plant material)",
   "  T+ 0:30",
   "1 bry",
   "oral",
   "Belladonna",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17696",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 21, 2007",
   "Views: 24621",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've harvested my first batch of berries, my plant is in its 3rd season.  It's a gorgeous plant that didn't go without some problems, potato beetles found it quite delicious and I was made to spray it with Trounce once every two weeks during the peak of the bug's season (the berries were well washed/rinsed before ingesting).  The berries matured quite nicely, varying sizes and I still have many more coming.<br>Being in the medical profession I know exactly what belladonna does and how we use it in both emergency situations and more often in ophthalmology to dilate the pupil for surgical and diagnostic procedures.<br>I ingested a small berry, blueberry size.  Quite bitter, nasty aftertaste.  I took the second, one about the size of a dime in diameter and quite plump about a half hour later.  Again, horribly bitter.  <br>The heightened sense of awareness fazed in slowly within 10 to 15 minutes.  Some tachycardia, no worse than my near lightening hit, max about 150bpm for about 5 minutes at its worse.  <br>It was much later, about an hour when I noticed the dry mouth, insatiable thirst, and hardly quenchable (my bladder is nice and flushed).  Still experiencing the awareness, everything was brilliantly clear and the auras were resonating.<br>I began to be bothered by what my eyes might look like.  I had a heightened awareness of them being in my sockets.  I began to experience some photophobia, yet my pupils were dilated to a max 3 or 4 (and I was in a light muted room).<br>The rest of the evening fades since I fell asleep during a rather wicked storm, but the effects on my eyes lasted for a about 36 hours.  <br>KW\n\n\n"
}
