{
 "title": "Light Doses of Datura as a Dream Aid",
 "author": "Trippernaut",
 "citation": "   Trippernaut. \"Light Doses of Datura as a Dream Aid: experience with Datura Inoxia (ID 17738)\". Erowid.org. Sep 29, 2002. erowid.org/exp/17738",
 "substance": "Datura Inoxia",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "0.5 flowers",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17738",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 29, 2002",
   "Views: 15181",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nRecently, I was at the dentist, and I was going to call somone to give me a ride home.  But I decided to walk home for some reason, despite it being a pretty long walk.  During that walk home, I stumbled across a beautiful Datura Inoxia plant.  I immediatly picked a thorn apple and a few flowers.</p><p>I tried smoking some Datura flower with Cannabis.  At First, I noticed nothing but the Cannabis high.  Then as I walked around, I relised that I did feel different, when I walked, my body moved a little more drunkenly, and colors seemed alot brighter, especially the sunset, and plants.  I also seemed to have an extra mood lift that made me want to act strange, or laugh.</p><p>Then just before bed, I boiled a half a flower in a cup of water.  It wasn't very bad tasting at all.</p><p>What an amazing night of sleep, I had tons of dreams, some I don't remember, others I do.  And I remember several times during the night, somone opening my door and walking into my room, but apparently, noone ever opened my door.  Most of the dreams I had took place in my house, so maybe it was an OBE.</p><p>Extremely Light Doses of Datura before bed are perfect for inducing lucid dreams or OBE's.  I was amazed at the results I got.</p><p>I've read that some people wake up in the morning with a Datura hangover, and just feel like crap.  But I guess that's only when you take high doses, cause I felt fine this morning.  In fact, I feel great this morning.</p><p>Just remember don't take too much, cause it can kill you.</p>"
}
