{
 "title": "My Life With Opiates",
 "author": "Pseudopharmacist",
 "citation": " Pseudopharmacist. \"My Life With Opiates: experience with Opiates (Propoxyphene, Oxycodone, Vicodin, etc.) (ID 17757)\". Erowid.org. Feb 9, 2005. erowid.org/exp/17757",
 "substance": "Opiates (Propoxyphene, Oxycodone, Vicodin, etc.)",
 "bodyweight": "135 lb",
 "header": [],
 "footer": [
  [
   "1995",
   "17757",
   "Male",
   "",
   "Not Given",
   "Feb 9, 2005",
   "69678",
   " "
  ]
 ],
 "report": "</p>\nI would like to share with you fellow recreationalists my up and down experience with prescription opiates.</p><p>It all started when I was 17. A friend of mine broke his foot, and was prescribed vicodin 5/500's. I was passing him in the hall, and he just handed me two, so I put them in my pocket not really sure what to do with them, not really knowing what they were. Afterall, It was 1997 and the drug really hadn't gained much popularity around here.</p><p>So I waited about a week, still unsure about taking them. I had only smoked weed for a year previous to this. So one late night, I popped them. Soon I felt those magical euphoric opiate effects come upon me. I waited for good old mom to go to bed, got my guitar and watched Lynyrd Skynyrd's Behind The Music, noting that it was much more interesting than usual. Then I began playing guitar, noting creative thoughts coming more freely and rapidly than usual.</p><p>I absolutely loved this brand new feeling. Better than weed I thought, and much harder to get caught with. I was happy, happier than I'd been in quite sometime. I have had depression problems since childhood, choosing only to self-medicate, as I dont want to lose my personality, originality, and creativity.</p><p>Well, needless to say, I wanted more. So I asked my friend, and no go. I was disappointed. Then, I realized my mom was getting some painkiller called Darvocet. I thought, hmmm.....maybe since it's a prescribed painkiller, it will have the same effects. Sure enough it did, and I was back in euphoria land. I began doing them every night. For years, I reserved it as a nite-time social drug. It allowed me to be myself, to talk intelligently and extensively about anything with anybody.</p><p>I began taking it 15 minutes before smoking weed, then by best friend and I would draw, write, and play music for hours creatively.  The synergy with opiates and cannabis is purely amazing to me.</p><p>Then, about three years into my habit, it got really bad. I was taking them as soon as I got up, then all throughout the day. By this time I had dropped out of school and grandma, who lived with us, was also getting a steady script. I was numb most of the time for about two more years, during which time my family had caught on, and began hiding them, although I could always find them. I no longer felt normal without darvocet. My tolerance was rising, I generally needed 5-8 100/650 pills to even get close to the feeling I wanted, and needed for that matter. I was getting worried, too.</p><p>Then about a year ago, my mother started getting 7.5/750 hydrocodone tablets. I was ecstatic, which is ridiculous as I see now. I immediately established a consistent routine of 1.5-2 on the way to work, one at 10:00 break, 2 more at lunch, and any given number after work depending on how many I had and could steal.  I discovered that if I took mom's xanax or klonopin with it as a supplement, the synergy was almost that of pot/hydrocodone, and made the work day fly by, which was great as i hated my job.</p><p>Soon, I began having trouble getting up for work, but was ready to go as soon as I had taken my combination. Then my performance started slacking. I didn't want to even be at work usually, and would frequently leave early. I eventually quit the job.</p><p>I still kept taking whatever I could get, vicoprophen, T3's, percocet, oxycontin, whatever was there. Not being able to score left me very mad and extremely miserable.I was getting very tired of this 'rollercoaster' and decided I would be a lot better off to just quit. So I did.</p><p>My girlfriend was there for me the whole time, I took a lot of hot baths, which really help because I got so many chills.  I was always cold during withdrawals, not to mention the miserable aches and pains, diarrhea. It was absolutely the worst week of my life.</p><p>It's been a month now, and I have found out I have real problems that could require prescription painkillers. I might have cancer too.</p><p>I still keep a reserve of T3's and hydrocodone for partying and when my pain gets too bad. I'm only 22.....</p><p>My advice is, don't get addicted in the first place, learn from this story. I didn't wreck my life, but I came awfully damn close.  I hope my little bit of info on how I quit helps some people, I know how horribly hard it is to quit. Some may need rehab. Please, please dont be like me and keep a reserve of pills after you quit if you think it will cause you to slip back into the habit. I'm a different person now, and with the help of my beloved Karly I can control when I want to take them. Please learn from this story. Stick to popping them once in a while to relax or party if you have to. Love to all of you, and don't ever give up on yourself.</p>"
}
