{
 "title": "Enjoyable but Not Worth the Taste",
 "author": "Gnostikoi",
 "citation": "   Gnostikoi. \"Enjoyable but Not Worth the Taste: experience with Heimia salicifolia (ID 17761)\". Erowid.org. Apr 23, 2003. erowid.org/exp/17761",
 "substance": "Heimia salicifolia",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Heimia salicifolia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17761",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 23, 2003",
   "Views: 21214",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently I became curious of Sinicuichi.  There isn't a whole lot of information that I could find on this plant, but I researched what I could and then bought an ounce from an internet vendor.</p><p>Please note that I tried far less than the recommended starting dose, because with any new substance I like to start out slowly.  I mixed what I would estimate were about 2 grams of dried leaf into about six ounces of water in a glass bottle, capped it, and set it for two days in a warm windowsill.  I then rubberbanded a coffee filter to the mouth of the bottle and poured off the liquid into a cup.  </p><p>The liquid was bright, transluscent green and smelled exactly like a freshly cut lawn.  Not the most appetizing smell in the world, but it was nothing compared to the taste.  I had read some reports, and so I was expecting something difficult to drink; in truth, I found it nearly impossible.  My method was to take a large swallow, then immediately bite into a hard candy and chew it as fast as I could.  I still ended up shuddering and gagging with every swallow, but I managed to get it down in three large gulps over the course of about fifteen minutes (I had to take a few minutes between gulps to steel my nerves).  I have imbibed some pretty disgusting concoctions in my time, but this was the worst (even worse than Valerian root, my previous worst).  As someone else mentioned on this site, it wasn't that it had a strong, unpleasant flavor or anything, it was just unbelievably bitter, like chewing aspirin.</p><p>Anyway, enough about the taste...I got it down, and began noticing effects almost immediately.  Even with the small dosage that I took, the effects were quite pleasant.  To me, it felt something like a small quantity of alcohol - I was very relaxed, mildly euphoric, and although my internal thoughts seemed clear I had a very difficult time paying attention to anything for very long.  There were a few other people around me (who had not taken the drink) and when one of them would talk to me, I would look at them and listen to what they were saying, but my brain could not process their words and I ended up having no clue what they were talking about.  This was true even of relatively simple statements or questions.  It was as if I could hear each individual word, but was incapable of stringing them together in order to form concepts.</p><p>That was the only effect I had from my dose of Sinicuichi.  I didn't have any hallucinations, aural or otherwise, but that was not surprising since the dose was such a small one.  The 'drunken' effect lasted for about two hours and then faded off cleanly.  This morning (the day after) I woke up feeling particularly refreshed and awake, even though I did not get a lot of sleep last night.</p><p>Overall, it was enjoyable but not worth the hideous experience of downing the tea.  I plan on experimenting with some of the other suggested ways to use Sinicuichi, but I will probably not make the sun tea again.  Making a crude extract will probably be my next step, or possibly just making tea and boiling it down until I can swallow it in one gulp, as one post on this site suggested.  I can see that this plant has potential, but if one is going to experiment with it I would NOT recommend the traditional sun tea method.</p>"
}
