{
 "title": "Salvia-Induced Dreams?",
 "author": "E.A.",
 "citation": "   E.A.. \"Salvia-Induced Dreams?: experience with Salvia divinorum (extract - 5x) (ID 17796)\". Erowid.org. Aug 2, 2005. erowid.org/exp/17796",
 "substance": "Salvia divinorum (extract - 5x)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17796",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 2, 2005",
   "Views: 3457",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn my readings of Salvia reports, I didn't encounter any relating to dreams induced by salvia. The following accounts a possibility that the sage may indeed have this effect. Some basic info: Age 18, Male, stable mentally and physically. Drug experience to date: Cannabis, Alcohol, Ether, Adderall, low-dose Ketamine, and Mushrooms.\r\nFor my first encounter with Salvia, I prepared my room for an evening of experiences. After declothing and meditating to Bach's Goldberg Variations for an hour or so, I started with a small dose of the extract and gradually increased the size as the evening progressed. My last and largest dose (3 very large hits) left me extremely hot and sweaty, and unable to move under the pressure exerted by the drug. After this last trial, I felt a great desire to sleep. I felt no physical fatigue at all, but I could think of nothing other than settling down and closing my eyes. Immediately upon doing this I went into a deep sleep. The next morning I recalled a vivid dream I had and transcribed it as follows:\r\nIn a forest, there is a Haven. This Haven has no physical enclosures, but nevertheless provides safety to all creatures inside. A male deer of the Haven wishes to leave, and manages to convince a female deer to go with him. They do this knowing the Haven will attempt to follow them - the punishment is unknown but understood to be severe.\r\nOutside the Haven, the deer experience unpleasantness for the first time. An invisible third party, myself, chides the male for sweating and disliking it. For the remainder of the dream, it is hot and sticky. The two deer are extremely paranoid of the Haven. They are constantly running into construction of sorts - bulldozers, caterpillars and other equipment. The workers do not interfere with the deer, but it is clear they are watching them closely. It is supposed they are spies for the Haven.\r\nAt some point in the dream, I cease to be the invisible third party and become the male deer. I vainly attempt to navigate with a compass I seem to have. As the escape progresses, our manifestations as deer fade and we become human. I become myself and the female deer becomes a friend of mine (an ex to be exact), 'S'. I decide we should smoke some salvia, which we do. 'S' takes a hit on the pipe as if it were cannabis, to which I instruct her to take more sustained hits of thirty seconds. The escape seems forgotten and with this the dream ends.\r\nPerhaps the question mark of the title could be omitted. The degradation of deer to humans literally smoking salvia is overt enough, but influences of salvia can be found in most of the dream as well. The deer feel warm and sweat a great deal, much like a salvia high. Personally, I would argue the 'escape' from the 'Haven' into a sweaty forest is analogous to my own escape from the haven of inexperience into the exploration of enhanced consciousness; in this case, salvia. The construction seems to be my mind's creation of a deer's worst enemy - representations of civilization and 'progress' intruding on the natural desire to achieve altered states. I could analyze further. At first I am a third party who chides the deer, but later I actually become the male. I, too, used to be skeptical of drugs and highs. Now I embrace the ability of medicines (yes, medicines) to teach me valuable lessons. The vain attempts at navigation could be symbolic of human's inability to truly understand what their minds are experiencing. \r\nLucid dreaming is not new for me. I usually recollect my dreams three to four times a week with much detail. Neither is having personal friends present. (Rarely do I have dreams that are void of people I know intimately.) However, this dream stands as one of my most vivid and meaningful to date. I remember that while smoking the salvia I was disappointed that I didn't achieve too much. I felt its physical effects but didn't have any 'visions' or anything of that sort. It's clear to me now that my body's instruction to sleep was wise. The 'Haven' of the dream is really no haven at all. Safety at the expense of inexperience is no way of life - salvia has helped reaffirm this for me. I look forward to my future encounters.\n\n\n"
}
