{
 "title": "Maybe I'm Not a Coke Head After All...",
 "author": "KC",
 "citation": "   KC. \"Maybe I'm Not a Coke Head After All...: experience with Cocaine (ID 17790)\". Erowid.org. Sep 29, 2002. erowid.org/exp/17790",
 "substance": "Cocaine",
 "bodyweight": "122 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17790",
   "Female",
   " ",
   "Not Given",
   "Sep 29, 2002",
   "Views: 63207",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is a poem that I wrote directly to myself as a teenager. It takes a look into a coke user's life, who is not yet addicted and has a carefree outlook on using drugs but who also has fear of addiction and ruining their life but in the end decides that they can't stop the inevitable, and should enjoy themselves for the time being.  </p><p>You think you're on you're way to a problem, an addiction, you're going completely insane.</p><p>Have lots to do, a life to live, but you can only think about cocaine.</p><p>Psychologically addictive, illegal and deadly, of course all these things you already know. Your grades are dropping because it's hard to pay attention when you would much rather be snorting blow.</p><p>Crushed, layed out, bills already rolled... now follow that 2 inch white powder trail. Nose all clear, head in the right state, close a nostril, relax and inhale.</p><p>Euphoric, powerful, perfect, talkative and smart. Now you'll want to chase that high you know, why'd you even start?</p><p>Look in the mirror, what do you see? That's definately some sort of drug under your nose. Please don't end up like a needle using addict and shoot that stuff up in between your toes!</p><p>You snort two more, you're partially high again... those two rails were for Kurt Cobain. But if like him too you want to do heroin, snort, don't shoot, otherwise just stick to cocaine.</p><p>Now your high's definately back but not as good. Hmmm... how about another line? Wait... doesn't all this cash spent on an hour of fun seem like a big waste of money and time?</p><p>The coke's gone, in your system, you crave more already. Just call the drug dealer dammit! You want more coke! $40 is all you have left though dear! After this half-gram you'll be pathetically broke.</p><p>$3 for a gram in Columbia! Going there is all you think about. Those lucky people could overdose whenever they want. But till you're there, your broke-ass can pout.</p><p>You might just have this drug thing under control. Hey! At least you're not smoking crack! And until you stop being deathly scared of needles, snorting's the only option you have for smack.</p><p>So why not make adolescence deliciously fun, after all you only have this life to live! Plus you don't have the finances to get very far. The coca industry's a huge money sieve.</p><p>You've got control on whether or not you end up homeless, addicted and possibly on the street. Just keep that control and you won't have to ever worry about beggin for money at other people's feet.</p><p>You'll be fine if you trust yourself and listen to friends when they say you should stop getting high. Just set periods of when you don't touch the stuff, stick to it, and you'll do more than just simply get by.</p><p>So what, you're broke, you have a sinus infection, the drugs have made all these years ridiculously fun! Enjoy it now before it catches up with you. You'll be sad when your snorting days are over and done.</p><p>So, my advice to myself is to snort, smoke and rub that bittersweet powder on my gums and tongue. I should experiment with all the coca plant product I can while I'm still healthy, supported and fairly young!</p>"
}
