{
 "title": "Whispers in the Dark",
 "author": "Hrethic",
 "citation": "   Hrethic. \"Whispers in the Dark: experience with Kava Kava (ID 17818)\". Erowid.org. Feb 7, 2003. erowid.org/exp/17818",
 "substance": "Kava Kava",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Kava",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Kava",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17818",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 7, 2003",
   "Views: 22306",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One Saturday night, without having drip of alcohol, a leaf of weed or a hit of anything but many caffeine pills, a friend of mine and I decided on trying a bit of some natural substances.  After pursuing the aisles at our local convenient store, we stumbled onto something we knew might help relaxation.  We decided on Kava Root, a $10.99 bottle with 400mg per pill, 100 pills.</p><p>We didnt expect the effects that we got.</p><p>After one hit out of a bong, we could feel the effects. It was a high not unlike pot, but ended almost immediately afterward. What we were left with was a sensation of relaxation and peace. We then proceeded to take down 3 pills orally with some Gatorade (his drink) and water (mine).</p><p>Through the course of the night we smoked 3 more bowls of the stuff out of a bong and took orally 7-10 more pills.  For the most part, aside from a minor hallucination that I saw (the fan and TV were smiling at me for about 5 minutes out of the corner of my eye) the feeling of peace and relaxation we encountered from smoking stayed constant through the night, that is, until I went to bed.</p><p>With the lights off and my Walkman on, I tried to fall asleep.  This happened for about an hour, when I woke up because I heard my door from my other room open.  This was most likely because my friend was going to sleep.  I turned my Walkman on again and started to drift back asleep when I heard something outside my room.  I couldnt make out what it was saying, but it was a definite hallucination of someone whispering into my room.</p><p>This happened for about 10 minutes, with the voice turning into voices of different pitch and variance, until I finally got up to see what it was. I opened the door and saw nothing out of place, no monsters or daemons at my door, and certainly not my friend.</p><p>Content with the effects this experiment, I went back to a very restful nights sleep.</p>"
}
