{
 "title": "The Earth was About the Size of a Dime",
 "author": "B",
 "citation": "   B. \"The Earth was About the Size of a Dime: experience with Salvia divinorum (ID 17822)\". Erowid.org. Feb 10, 2003. erowid.org/exp/17822",
 "substance": "Salvia divinorum",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   " ",
   "MDMA",
   " ",
   " ",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17822",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2003",
   "Views: 7713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI smoked salvia for the first time last night.<br>Wow.<br>I had recently been trying to get ahold of some opium, becuase I had heard about O-dreaming. This sounded awesome. However, there was no good Opium, anywhere.<br>At a house rave last night I heard someone talking about Salvia. I intrestingly jumped in the conversation, proclaiming stories of people stabbing thier friends or just flipping out completely. I was told what salvia does. How it puts a person in a dreamlike state. My friend told me how he meditates on it. I've been meditating for a few years. Once he told me that it breaks him of his concept of reality and places him in another counciousness, I knew had to try it.<br>I was beginning to come off my roll on a mercedes and wanted to do it once I was down some more.<br>The guy said he'd do it with me and we found us a trustworthy sitter. We went into a room and lit a candle. There were four of us.<br>First, I watched my best friend trip. We remained quiet as we watched his silent facial expressions on the couch. It looked like he was having a good dream. At one point he came out and tried to tell us what he was experiencing. The sitter, who had smoked salvia before, told him to be quiet and enjoy your trip. Once he came to he told me of a journey, where in the end he was given the choice of any life he wanted to live. He chose not to change, he chose his own life. Finally I'm up.<br>I'd decided I was going to meditate while I was tripping. After my three big hits, I had to lay on my back. What I experienced can not be easily explained.<br>To sum it up, I would say it was a spiritual journey of my mind in a state of lucid dreaming. There were some points where I was playing around, attempting to fly in some alternate universe. At one point I was simply jumping up and down so high the earth was about the size of a dime under my feet. I was enjoying myself. Then suddenly I was talking to an entity. I must admit I was lost for a while trying to figure out what exactly was going on, but it didnt really scare me. The entiety told me not to worry. He said that I had to leave and go 'find myself.'<br>I soon came to. My friend told me at one point I looked at him with my eyes closed and said, 'I'm glad you're here, your my link to sanity.'<br>Salvia is awesome.\n\n\n"
}
