{
 "title": "A No-No for Repeats",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"A No-No for Repeats: experience with 2C-T-7 & LSD (ID 17851)\". Erowid.org. Sep 30, 2002. erowid.org/exp/17851",
 "substance": "2C-T-7 & LSD",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-T-7",
   "  T+ 1:00",
   "1 hit",
   "oral",
   "LSD",
   "  T+ 0:00",
   "35 mg",
   "oral",
   "2C-T-7",
   "  T+ 1:00",
   "1.5 hits",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2000",
   "17851",
   "Male",
   " ",
   "Not Given",
   "Sep 30, 2002",
   "8582",
   " "
  ]
 ],
 "report": "<p>\nThere isnt much to this report, but I figured it would be interesting and important for me to share my experiences with others that may be thinking of trying this combination.</p><p>I have mixed 2C-T-7 with LSD twice.  The first time I took 20 mg of 2C-T-7 (orally) and one-hour later I ate a hit of 'average' potency LSD.  The idea was to have them both peak at the same time (2C-T-7 takes much longer to get going).  There didn't seem to be any particular synergy between these two materials.  At first, it seemed just like a powerful 2C-T-7 experience (similar to perhaps 30 mg orally) but gradually the trip became more LSD-like.  All in all, the experience was very pleasant and I spent the evening in a small jazz-club listening to some fine live music with a friend. </p><p>The second time I took 35 mg of 2C-T-7 (orally) and one-hour later I ate 1 1/2 hits of the same LSD I took the first time.  I don't remember much of the experience.  I was very cloudy mentally, and at times was even mildly confused as to what was going on.  From what I do remember, it was a very confusing and unpleasant trip.  I experienced some difficulty walking at times, but no other negative side effects besides the usual nausea from the 2C-T-7.  In the end, it was a waste of two fine materials for a night that was completely pointless and unpleasant </p><p>I will never take LSD and 2C-T-7 together again.  I found no special synergy between the two and, at high dosages, the experience (for me) was one that included amnesia.  That tells me the combo is a no-no for repeats.  Proceed with caution if you plan to experiment with a combination of these two materials.  Start with very low dosages.</p>"
}
