{
 "title": "The Night I Lost Control",
 "author": "Chong",
 "citation": "   Chong. \"The Night I Lost Control: experience with Cocaine (ID 17862)\". Erowid.org. Aug 20, 2007. erowid.org/exp/17862",
 "substance": "Cocaine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "4 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17862",
   "Male",
   " ",
   "Not Given",
   "Aug 20, 2007",
   "20233",
   " "
  ]
 ],
 "report": "<p>I was going to a club on the night of this situation I found myself in.  I have done coke about a dozen times before, so I knew what to expect.  Usually, I feel a feeling of euphoria, followed by a state of alertness/talkativness/wittiness.  I like coke alot, but I would say that I can control myself for the most part.  The most I've ever had at a time before this was two lines.  Thats it, although sometimes I get the urge to snort some more, I say to myself 'That's how people get addicted.'  I'm already addicted to cigarettes, but coke, thats a whole new ballgame.</p><p>Anyway, the night we went to this drug friendly club, or so I thought, I was a having a pretty good day, and I was filled with excitement and nervousness.  I had never done coke at a club before. Myself, and three of my fellow coke-using friends snorted three lines each before the club, just in case we chickened out when we got there.  My friends are definately more experienced than I am, and use more often.  So three lines for them is just a starting point.  However, this was the most I had done in one sitting, and I was pretty talky, and I even started feeling aggressive.  </p><p>When we got to the club, it wasn't empty, but it wasnt too crowded.  Well, I wasn't feeling as paranoid as I usually do, so, I decided to be the first to break out the coke.  I cut four fat lines and snorted them up in quick succession.  Now I was a fucking god.  I started flirting with all the girls, and one of them, a very sexy one, caught my eye.  Well, I offered to buy her a drink, not long before her god damned boyfriend interuppted.  Now usually, I would walk away from a situation like this, however, I was feeling as strong as four guys, so I decided to get rowdy with this guy.</p><p>I brought him outside, and started talking shit about him.  He was getting angry, but he was being pretty level headed, saying he didn't want any trouble, he just wanted me to know his girl was taken.  Well, I picked up a bottle from the ground, and smashed him in the head with it.  Immediatly, he fell to the ground.  I went back into the club.  I was ready for another few lines.  I went back to our booth, and cut three more lines.</p><p>However, before I was able to get one down, a big guy dressed in black came up to me.  He said he was a cop, and he would like to talk to me.  So I went with him to the outside of the club, and he said 'give me the coke.'  Well, there was no point in arguing with him, he'd seen the coke already.  I gave him what was left of my bag, and he said he'd be right back, he had to bring it to his squad car.  Well, I'm no damn idiot, I gathered my friends who had been standing by, and we hopped in the car and drove away.</p><p>We never did get in trouble, and I don't even know if the guy was actually a cop.  The guy I hit with the bottle, he was picked up by the ambulance, but he was conscience when they picked him up.  From what I heard, he needed a couple of stitches, no big deal.  I've never been back to that club, and I haven't snorted coke since.  If I had went to jail for assult and possesion of cocaine, who knows.  I'm lucky.</p>"
}
