{
 "title": "A Family Thing",
 "author": "Boomer",
 "citation": "   Boomer. \"A Family Thing: experience with Mushrooms - P. cubensis (ID 17876)\". Erowid.org. Jun 10, 2003. erowid.org/exp/17876",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17876",
   "Male",
   " ",
   "Not Given",
   "Jun 10, 2003",
   "Views: 16930",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It started of at 11:00 PM when my cousin and I split the 1/8 of mushrooms, we had some stem and one large cap. After the eating, we sat down and waited to feel the fun, this was my 1st real trip although it was my 2nd time eating mushrooms the first i only had two old small caps that did nothing but give a mild stoned feeling, these shrooms must have really been dried properly. We were playing video games when we started to feel the effects. I was eating a pizza and realized i was starting to feel it. Eating the pizza began to feel like a chore, I didnt feel like the benefit of eating the pizza was worth the time it took to eat it! So at this time I remember walking downstairs quietly because my cousin and i thought we were being far too loud, and risked waking my aunt. </p><p>When we got to the basement I suddenly burst into uncontrollable laughter. I was laughing about how my cousin resembled a mushroom while I was tripping on mushrooms. He has a large redish 'fro and pale skin, and is skinny, so he actually did look like the mushrooms we had just injested which had a dark red cap and bright white stem. At this point we decided going upstairs was the thing to do, and then i took a shit in the toilet, by the time i was done i looked up at the wallpaper which was green vines. All the vines looked as if they were growing upwards, I was so happy I was finally really tripping. After that my cousin and I sat on the couch and talked about everything for hours and hours. Every so often my cousin would tell me he had to walk around but i would grab him and say NO! We cannot handle your mom right now sit down, the best thing is to stay stationary. Thats what kept us from getting caught the whole time we had an amazing trip but we remained stationary on the couches. </p><p>We talked about amazing things like the meaning of life, and our fucked up family lives. I saw objects change color and shape and saw a cow on the ceiling and the udders were the symmetrically placed lights. At about 3:00 we decided we were coming down. We realized this was a life changing experience and nothing would top this night. I got a bowl of cherrios and sat at the computer while my cousin chatted with the kid who hooked us the bag of shrummz. I was amazed how this whole experience was in my pocket earlier that night. All in all I loved my experience, I awoke with a greater appriciation for life and I felt truly renewed. I highly reccomend eating shrooms every once in a while with a close family member. My cousin and I were very close before, but it feels like we share something greater now.</p>"
}
