{
 "title": "Cocaine In Columbia",
 "author": "David Ashley",
 "citation": "   David Ashley. \"Cocaine In Columbia: experience with Cocaine (ID 1796)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1796",
 "substance": "Cocaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1996",
   "ID: 1796",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 14, 2000",
   "Views: 137988",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few years back I went on a trip down south through Mexico, Central America, and then to Colombia and Ecuador. It was great fun, and a very rewarding experience.</p><p>In Guatamala I met an English guy named Nigel that had been in Colombia. He said that he had traveled from England, going to Brazil, then through various countries, and ending up in Colombia. Nigel told me that along the route he met locals that became his friends, and often they used Cocaine. Nigel said he had been afraid of Cocaine, having been brought up in the typical 'drugs are bad' environment. He was afraid that if he tried it he'd become addicted. Eventually he saw that although his friends used it, they were not addicted. He tried it, and he liked it. He told me that he used it daily for a couple of months. I asked him if it was hard to stop. He said it wasn't.</p><p>Now I left him and I kept heading south. He told me of a place called the Hotel Miramar in Santa Marta, Colombia. It's east from Cartegena. He said it's a place where gringos can go and use cocaine, and not really be hassled. Somewhere along my trip I decided I wanted to try cocaine if I had the opportunity.</p><p>I made it to Colombia and ended up in Santa Marta. The Hotel Miramar was a fantastic place because it's a gringo hangout. My spanish was decent but I could never get close to the natives because it was too cumbersome talking in their language, and very few Latins speak English. Colombia has a reputation of being unsafe so not many tourists go there, so if you're travelling around the country you feel like you're the only gringo.</p><p>So it was nice to meet up with other travellers in the Hotel Miramer. There were people that stayed there for months or years, and then the others that would come for just a day or two. I ended up staying there for a month. I was waiting for mail from home, and also I was enjoying the company of other travellers.</p><p>During this time I tried cocaine, and decided I liked it. I would snort the cocaine only. I'd typically use it with other travellers, then a bunch of people would get together and just talk or hang out. I'd usually start using it in the early evening, continue over about a 6 hour period, then I'd stop and go to sleep. I never used it as a pick-me-up in the morning. I got in the habit of only using it when I already felt pretty good.</p><p>There were other people that used it a lot more--they would keep going for more than a day or two. I thought this was silly because even though you don't feel sleepy, you know your body wants to sleep, and I didn't want to push it. Also there's not much point in using it for longer periods, as the effect seems to diminish. I would build up a tolerance so that as the time wore on I'd have to take it more and more frequently (over the 4 or 6 hour period in the evening). As I say, I'd usually be with other people when using it and we'd sometimes go out in the night for walks. While in the Hotel you feel perfectly safe using it, it's not a good idea to carry it around town with you--you never know.</p><p>I figure that over the month I used the cocaine maybe 15 or 20 times. I liked the feeling it gave me. It completely eliminates any feelings of inhibition, so you feel comfortable talking about anything. You also feel fascinated by what other people are saying, although I would prefer to talk. You feel really good, like the cocaine is tickling your pleasure center. You feel energetic. You wouldn't get hungry.</p><p>After a month I decided that the surroundings were getting stale, so I left to go to a neighboring beach called Park Tayrona. It's a really beautiful place and a lot of gringos hang out there as well. I didn't do any cocaine while here but I didn't miss it either. There was no feeling of dependency. Cocaine was more of something I did when it seemed like a good idea--not because I felt I needed it. It was something that you'd use when you're already having a good time--it would kick you up into the next level of enjoyment.</p><p>There was immeasurable pot available also in Colombia. I used to smoke a little but didn't really smoke enough to get over the munchy/can't concentrate stage. Other people constantly smoked the stuff. I never really understood the allure. I figured that the best time to use it was when you were hungry and wanted the local food to taste like a king's banquet :^).</p><p>The only problems I had with the cocaine was frequent pain in my nose. I was told this was because it wasn't pure, or that it was amphetamine and not cocaine. Over my trip I tried cocaine many more times and it seemed always a variable experience, depending on where I got it. Also my opinion of what 'good' cocaine was never matched anyone else's. One guy gave me some of what he said was the best he had ever used in his life, and it had no effect at all on me. I later decided that what I had called cocaine before was some kind of amphetamine, and what this guy called cocaine was really cocaine (pure), and that for some reason it didn't work on me. This guy used to smoke it also (freebasing) and I tried that several times but never once had any significant effect, although he was flying. After several times when someone would tell me 'try this, this is the best' and it did nothing for me, I decided that the substance I had liked before was no longer available and I stopped testing.</p><p>At no time did I ever feel any withdrawal symptoms. Also I never used it every single day--I would stop for a day or two after each day or two of use. And I never used it for a period longer than 6 hours.</p><p>I feel my experience with the drug hasn't been harmful at all. Instead it destroyed a lot of myths I had absorbed in the United States culture. I learned that the substance had absolutely no addictive qualities at all. Then I decided that the biggest problem was since it was illegal down there as well (at least if you got caught you'd have to pay a bribe to make the cop go away) you never knew 'exactly' what you were getting. The danger of the drug was never the pure part but what you ended up getting that was called 'cocaine'. I believe my experience with the cocaine has improved me, and I believe everyone (provided they're adults) should have the same option to experiment. The only improvement I could suggest would be fixing the situation so you know what you're getting every time, instead of it being a crap shoot.</p><p>Since Colombia is the source of this stuff, it's certainly going to be cheaper. I never paid more than $4 or $5 a gram, and typically paid $3. Of course I believe it wasn't quite as pure because I'd use a gram over an evening, and from what I've heard about stuff in US that's A LOT. Since Colombia I've never used any of the stuff. My thinking is I've heard prices in the US are $100 per gram. At the time I was taking it I felt that it was barely worth the $4 a gram. There's no way I'll pay 25 or 33 times what I could get it for down there.</p><p>Pot was also much cheaper. I saw a guy buy perhaps a half pound for something like $7.00. It's truly a weed, and isn't really illegal. Pot is so cheap you never have to buy it--it just gets passed around by people that keep their own supply.</p><p>Wages in Colombia are so low compared to wages here, the locals have to pay almost the same proportion of their income to buy cocaine as Americans would have to in the US. I never really saw any evidence of massive drug addiction in Colombia. Almost 100% of the drug use seemed to be by the gringos that were visiting.</p><p>I've decided that I believe drugs should be legalized. I believe that we've all been victims of a horrible propaganda campaign. I believe it would be much better if drugs were legalized, regulated (for purity), and also perhaps taxed a little to cover costs of chronic abusers. I believe it is a good idea to travel, because you find out interesting things, like perhaps the USA isn't really as free as you might have thought. In Colombia the police don't really care if you use illegal substances--they just use it as an excuse to sweat a bribe out of you. They're not interested in throwing you in jail, they just want some of your yanqui $$$. Yes, the system is very, very corrupt.</p><p>Colombians were probably my favorite people. The country is beautiful and the people are very friendly. Although Colombia has gotten a bad rap in the news, this is unjust. While a few drug kingpins control a lot of the politics in the country and are ruthless murderers, the Colombian people are almost entirely very warm, intelligent, friendly people. It is truly a great country.</p><p>When I came back up through Mexico and went through the border crossing at Tijuana, I told the officer that I had just flown up from Cartegena, Colombia. He then checked me out a little more thoroughly than he would have if I'd only been in Mexico--he checked my drivers licence and then looked at my backpack in the xray machine. I don't think he had me unpack it. But the guy said that Colombia wasn't a good place, and the people were screwing us over. His statement simply is not at all true.</p><p>One other interesting point: As I understand it if I'm outside the US I am no longer bound by US laws, but must obey the laws of the country I'm in--but that country enforces them and the US doesn't care anymore. I was told by Germans that their laws are binding on them no matter where they are. For example if they get caught in Colombia using drugs and are punished there, the Colombian government will inform the German government, and send them home, and when they get to Germany the German government will then pushish them again. I thought this was rediculous. </p>"
}
