{
 "title": "The Long Road",
 "author": "Jaded Prophet",
 "citation": "   Jaded Prophet. \"The Long Road: experience with AMT (ID 17984)\". Erowid.org. Oct 6, 2002. erowid.org/exp/17984",
 "substance": "AMT",
 "bodyweight": "161 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "AMT",
   "(capsule)",
   "  T+ 4:00",
   "25 mg",
   "oral",
   "AMT",
   "(capsule)",
   "  T+ 6:00",
   "25 mg",
   "oral",
   "AMT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 17984",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 6, 2002",
   "Views: 8242",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nOk..here's the rendition of my AMT(aplpha-methyltryptamine) experience. <br>Those involved: subjects a, b, c<br>T-0: A & B ate ~50mg. AMT. subject C decides not to and goes to work.(4PM friday)<br>T-0:45: feel a slight discomfort. Nothing like 5-MeO-DiPT (foxy).<br>T-1:20: So much about the 2-3 hours to come on.  Maybe there was no cut so when the capsule dissolved, there we go...<br>T-2:30: I feel like I've been on some kind of speed for a while.  I want to do something but the focus with amphetamines simply isn't there.  A&B are actually bored.<br>T-3: It really only feels like an hour.  really I'm not sure about times after the first 2-3 entries.  A&B are now convinced that they are on MDMA(although they know they aren't).  Subject B grabs pacifier and cleans the house.  A giggles and sighs.<br>T-4: The tripping begins.  Still have a somewhat rolling feeling, but there are definitely pronounced tracers.  A&B take ~25mg more each. (total = ~75 ea.)<br>T-4:45: The strong rolling feeling in the gut comes again along with a teeny bit of discomfort, presumably from the second dose.<br>T-5:30: Tracer are intensifying.  Pupils have overtaken the eyes (esp. of subj A), subj A is annoyed by frequent urination/dehydration (not as bad as DXM however).<br>T-6: subj C returns.  the previous plan of her driving elsewhere is nixed due to numerous reasons, ~50mg is ingested via capsule.  A&B take ~25mg more, putting their total up to ~100mg. (partially to stay awake with subj C, who has excess energy as it is).<br>T-7: Subj C has thrown up twice.  She tends to throw up at least once on every drug.  subj C (a shorty) is already getting the rolling effect.<br>T-8: Wow.  Has it really been 8 hrs?  how many times has subj A gone to the bathroom by now?   it must be in the hundreds.  luckily no one else has this problem quite as badly.  Subj A is still compalaining about his fast food burrito dinner. It was simply gross.  Also, Agenda Suicide (The Faint is played repeatedly by the overly dorky Subj A) For the past while, Subj A has been lost in a room filled with tracers.<br>T-10: Still tripping strong.  Subj's A, B, & C spend lots of time talking, in various couch piles, subj. A on bottom (always!)  Subj A&C are now staring intently at a pillowcase covered in blue and yelow stars.  It is also covered in lots of electricity, sparkles, snowflakes, etc.<br>T-12: Still talking, but subj B loses ability to participate in convos or even remember how sentences started.  Perhaps it was mean, but Subj B&C play with this for a few hours as they ramble on and tease him about not remembering.  He forgets.  ('I have this condition you see'...)  <br>T-14: numerous observations/insights are made using some twisted sense of logic, but still valid.  ie, If someone has cold feet, then they are dead.  if they are dead.  and dead is as goth as it gets.  others are made, most forgotten. ('I have this condition you see'....)<br>This continued, with the minds of A&B becoming mushier until the trip ended at somewhere between T-22 to T-26 hrs.  It was difficult to tell when one was done due to the sleep dep/mental exhaustion.  This is something that all subjects will probably do again, but probably leave the dosages around 50mg to avoid the brain mush experienced afterwards.\n\n\n"
}
