{
 "title": "Daemon Journey",
 "author": "k|m",
 "citation": " k|m. \"Daemon Journey: experience with Mushrooms (P. cyanescens) (ID 17988)\". Erowid.org. Oct 7, 2002. erowid.org/exp/17988",
 "substance": "Mushrooms (P. cyanescens)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.5 g",
   "oral",
   "Mushrooms - P. cyanescens",
   "(dried)",
   " T+ 0:25",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17988",
   "Male",
   "",
   "Not Given",
   "Oct 7, 2002",
   "20476",
   " "
  ]
 ],
 "report": "<p>\nThe following is the chronicle of a night spent under the influence of 'magic mushrooms'. It was to be my second journey with the mushroom in a period of two weeks. I had taken the substance many times before, and felt I knew what to expect on this evening. </p><p>Part I: The Journey    </p><p>It was around 8 Pm on a late summer evening when we first started out. It was dark already, and a light rain was coming down. My brother and another friend would be joining me. We gathered all of our provisions, a baggy, some crackers to down the mushrooms with, and water. We had been psyching ourselves for this trip for over a week. We ventured to a spot that we had agreed was a suitable place to begin our journey. It was a large, rectangular field lined with trees and wire fence, and it had a path crossing diagonally through its middle. It was approximately 200 x 100 meters, and there was a small baseball diamond on one edge. Parallel to either of the longer sides there was a street, and opposite that were rows of houses. Again on the shorter sides were parallel alleys, and houses. We were in a residential area and this field had many purposes such as sports and family outings ... or eating psychedelic mushrooms. </p><p>On this journey, one sober friend (a fellow who had joined us on the previous trip, but had opted to observe this one) was accompanying us. We gathered around at a row of stands behind the baseball diamond and soon the half ounce of mush was divvied out and slowly being munched. I personally ate approximately 4.5 grams. In about 15 minutes, I had consumed my share with the help of a candy bar. After that, began the waiting process. I paced back and forth in front of the cage surrounding the baseball diamond; I knew what was to come. As usual, the come up was an anxious one. After another 15 minutes or so, I began to feel the very first effects, which I can only describe as butterflies. This is a very faint feeling in the stomach, one of uneasiness or excitement. This is indicative that the mush is probably working and my trip is on its way. </p><p>At this point I was beginning to feel a great deal of pent up energy so I took a quick jog around the diamond and, by the time I came back to the stands I could definitively and clearly feel the effects beginning to take shape. It is here that I had not yet experienced any changes in perception, but I realized something was distinctly different. It is a feeling only experienced mushroom users can identify. I like to think of it as a crossover from one world to another -- from the non-mushroom world to the world of mushrooms. It is an extremely subtle crossover and, it may happen without me even taking notice. Sometimes it feels as though a wave suddenly washes over me, and there it is. This is usually associated with butterflies, as well as a great deal of what feels like anxious energy. It is so subtle that, it is comparable to first looking through a clear window, and then through one which is being rained upon. I was now in this world. After I have entered it  things begin to change drastically and that rainy window becomes much different  there are very few ways that allow me to leave, except by traveling through it. </p><p>---</p><p>I was the first of our group to cross over. The other two followed in about ten minutes. We now wandered our way over to the far side of the field, where there stood a row of trees. We chose a tree and gathered under it where we passed around a joint. In my experience, cannabis and mushrooms mix well. Not only does cannabis calm my anxious energy, but it also seems to add a wholly different dimension to the visuals, and the overall trip. We sat quietly talking, smoking and waiting. After we finished the joint, it was time to begin our journey. The basic idea of this journey is to wander around. We go wherever you are pleased to go; we enjoy the sights, the sounds and the feelings of the world. We do this in a group so we can explain to others what we are experiencing. It makes for a very interesting and enjoyable peak. </p><p>We made our way back across the field and, as we crossed, I began to pay special attention to the field itself. There was a seemingly symmetrical and consistent pattern in the grass wherever I looked; this was caused by the lines where the mower had been. These patterns stood out very subtly if I stared at the entire field, almost like a 3D image. This is nothing special, but it was an exciting familiarity. Another thing of nature that is consistently interesting in this world is trees. As I pass a tree for example, the abundance of items and objects it can represent is amazing. The layers of branches and leaves intertwine and move behind one another, making shadows and shapes of all sizes and kinds. </p><p>Now, approximately 30-40 minutes after ingestion, we left the field. We began our journey down no street in particular, although all of the streets in this area were familiar to us. Our sober friend, who had been accompanying us on his bike, left us. We had agreed to meet with him back at my place later, so that the group could enjoy our journey alone. This was a mistake. When taking any psychoactive substance, it is a very good idea to have a person who is not on that substance with you, someone to keep you in check, but more importantly, someone to keep you in touch with reality. </p><p>Essentially, what we were doing was killing time before we returned to the safety of my yard. Now, the mushrooms were truly beginning to come into effect. Once I have crossed over, the effects quickly accelerate and become more and more pronounced. We strolled along lightly, enjoying the relaxing high, as we turned down a new alley or street. Something I have learned about being on mushrooms is that communication becomes somewhat difficult. I find that I have a tumult of ideas, thoughts, and emotions blazing through my head at light speed and yet I cannot articulate these things to the other people in my party. It may be that everything is going so fast I simply do not have time to discern one thought from another; I am too confused and focused on the experience at hand to relate to other people. Once I have come off the peak, it becomes much easier to do so. </p><p>We were walking down one particular alley when I saw what seemed like headlights of a car coming up behind me. There was a loud shout; I swirled around to see my sober friend speeding up on his bicycle. I later asked him if he had any type of light but he declined. I thought this was interesting that somehow I was given a warning by seeing a light come up behind me. There are many occurrences like this on mushrooms. Our sober friend stayed with us for a few minutes and soon went home again as we continued on our way. By this time, we had been walking for what seemed like a long period, but realistically was only 10 or 15 minutes. We could not seem to decide which way to go, or how to get where we wanted to go. This is frustrating when, as I said, I have difficulty describing my ideas. As well, we were all becoming increasingly aware of a very large storm coming in. We could hear the thunderclaps every other second like a warning. BOOM... BOOM... BOOM... BOOM! I distinctly remember hearing a succession of four or five uniform beats, as if someone was pounding on a drum. This was the loudest kind of thunder, the kind that shakes you. Traveling down the same alley, we were confronted by a very aggressive dog in its yard. On any other occasion, I would have walked by without thought, but I had the most unsettling thought that the dog was literally in my head. His eyes shone yellow, reflecting a streetlight behind us. I look back on that instant and it feels like the dog was cautioning me. He smelled the mushrooms on me and wished me luck. By now of course, the mushrooms had taken a firm grasp on me, and I was lost in the world of mushrooms, searching anxiously for some place I 'had to get to'. </p><p>We came to the end of an alley where we turned, crossed a street and came back to where we had started. Somehow, we had traveled in a loop that brought us back to this place. Loops, circles, and 'deja vu' seem very common on mushrooms. We had made a number of random turns down random streets; none of us had made any conscious thought about it. Yet here we were. Perhaps telepathically we had all agreed on the route. I remember having that thought as we approached the baseball diamond. From the time it took us to get from the alley to the field, the storm had swept in. It (the mushrooms?) was now in full force. What seemed like every few moments there was a flash of lightning so bright it lit the entire grayish sky as if on canvas. There we were, the three of us in the middle of an open field, staring up at that massive storm. I had not yet experienced a great deal of visualization, as most of my focus was inward. Nevertheless, here I was given my first glimpse of the potential of mushrooms to turn anything into a maelstrom of color, texture and sound, rhythm and movement. I must have had a wide-eyed smile as with each searing white flash I felt like leaving my body; with each whip-crack, I felt a great surge of energy throughout my self. We were gods at the edge of some windy abyss, facing down the Daemon before us. This all seemed to go very quickly on the whole, yet in each aggravatingly slow moment I remember having thoughts of energy and power race through my head. </p><p>At some point, we left the field. With images of bright light resonating within me, the thunder was going strong. It is at this point, where the three of us began losing contact with each other. I like to think of a mushroom high as a confrontation with a Daemon, good or bad. Facing this Daemon can fill me with beautiful awe, or it can frighten and confuse me. It depends on which path I choose. Having those frightening and confusing times where we stay together as a group and weather the storm, face the Daemon, serves to pull us closer together. Unfortunately, we succumbed to our personal inner tumult, and as a group, we failed. The Daemon had won. However, our journey was not over. </p><p>---</p><p>We ended up sitting on a bench in a small field in front of my house, trying to decide where to go next. It was extremely loud, or it seemed that way. In reality, it was probably not so bad, but I remember having to shout to hear myself. Later, both my brother and friend told me they could not hear me, or each other. I wonder now then, how it is we came to any decision, but we did end up going to my yard, at least momentarily. As we made our way through an alley toward my house, my brother began complaining of not feeling well, and he convinced himself that he needed to go to bed. I agreed with him, telling him to do whatever he thought necessary to feel better. I was so utterly stoned under the mushroom; I am not sure whether my own actions thereafter were not somehow controlled by it. </p><p>We reached my yard. After a few moments, my brother stumbled inside the house. I was beginning to feel great paranoia about being in my yard, with the slightest chance of someone seeing me. It is important to note here that, under any type of setting, I think one should be prepared for this type of paranoia in advance. It does not matter if someone sees you, for all they know you are just another person, and for all you know he/she is on mushrooms too. It is important to realize that regardless of what happens while on mushrooms, you will come out of it alive and unharmed. This is an important lesson I learned on this night. It was now up to my friend and me, to tough it out. At this point, I had not made any drastic decisions; I was still committed to lasting the night on these mushrooms. We both agreed at this time that it was not a great idea to be sitting in my yard, and we left. </p><p>The very moment I left my yard, was the moment I was no longer participating in my body's actions. I was a mere spectator. I could still feel my body, however, it was just an empty shell walking. And me, I was watching as all this was happening, as we made our way from my yard, to the alley, and toward a main street. It was as if I were watching a film on widescreen. I was no longer a physical part of my body. It truly felt as if I was watching from an outsider's point of view; like someone else was giving my body commands and I observed them carried out. Now, we had no idea where we were going, and both of us were completely ripped from reality with no idea of what to do. It was at this time, that I too convinced myself I needed to go home. Very bad idea. Somehow, I realized that the mushroom had too much control over me, when it should be the other way around. So, I quickly explained this to my friend, for whom I felt terrible for deserting. I said my goodbyes, left him to the storm, and walked briskly home.</p><p>Part II: Daemon Dream</p><p>When I reached home, I felt surprisingly satisfied. I thought to myself, 'I just need to go to bed, yep, bed...' I continued with this thought as I made my way inside to discover that my mother, aunt, and uncle were on the front porch. I said hello-goodbye to them as quickly as I could, while avoiding eye contact, and made my way to my brother's room to check on him. He was lying in bed looking ill. I said good night to him, and went to my room. At this time, I could hear my mother, aunt and uncle now in the living room talking. For some reason I cannot explain, I felt I needed to 'check in' on them, and tell them I was going to bed, as well as ask them to quiet down. I poked out of my door, called to them and asked, 'Is everything alright? Is everyone ok? I'm going to bed.' Later, my brother told me he heard me do this several times, and that I sounded increasingly agitated each time. I do not remember this. In my mind, I was being very courteous and respectful each time I came out, although how many times I did go out I cannot say. </p><p>Of course, it must not have been difficult for them to decide that I was 'acting strange'. Luckily, both my aunt and uncle are relatively cool with things like this and the three of them were stoned. Most likely, they thought I was drunk. My aunt knew I was messed up and she asked me to take a shower. I now wish I had not, for that is where my true nightmare began. </p><p>Upon my aunt's request, I made my way to the bathroom. In a moment, I was in the shower with warm water streaming down my body. This sensation was very pleasant. It did not take long though before I started to hear some very strange things. I could have sworn on my life that I heard a voice in the bathroom, but each time I ripped open the shower curtain with dilated eyes, searching warily from one end of the bathroom to the other, there was no one. This brought me to a new level of paranoia. Before long, there were so many voices, either in the room or in my head, I literally started clawing at the shower walls, and thought (or spoke aloud?) 'I just want to go to bed!' </p><p>After a few minutes of this, I decided to sit down in the tub and try to contemplate my thoughts. I remember as I sat I heard a phone ringing, and I heard a dozen other sounds that I cannot quite put into words, but can only describe as 'emergency', like bells and ringing. There were 'people' saying things like '...Oh my god they went and did mushrooms...' and 'he's on mushrooms' or 'hospital...mushrooms...no! Why?' all intermingled with the sound of emergency. This was very startling and somewhat frightening. Then, as this thought faded, I knew it was time to leave the shower, which is what I did. I left the shower running, the fan on, and the mat sopping on the floor. I did manage to turn out the light as I left the bathroom, and quickly tip toed across the hallway naked, after checking that everyone had gone to bed. </p><p>Again, I was in my room, ready to sleep, or so I thought. I figured before I slept I should set my alarm, so I leaned over on my bed to check the clock. I began pushing buttons to set my wake time, but the numbers would not change. This was extremely frustrating. I stared at the clock from probably an inch away and yet the numbers were inert. Again, I said aloud (or was it a thought?) 'I just want to go to bed!' It seems that during the peak of a mushroom high, thoughts and words spoken aloud are hard to distinguish. There would be times when I would think that I was thinking something, but I would be saying it. As well, there would be times when I thought I was saying something, but I was really thinking it. This contributes to the idea of Extra Sensory Perception. I have had several friends and acquaintances swear that they felt something similar to this like some sort of telekinesis. It is as if you get vibes from certain people, thoughts and ideas. You feel these 'vibes' and then interpret them into thoughts. Sometimes, more than one person in a group will have the same thought at the same time. One person says something, and everyone roars in laughter because that is exactly what he or she were all thinking as well. I can personally attest to having experienced such thought 'connections'. Perhaps the chemicals in the psilocybin mushrooms trigger some sort of ESP mechanism, I do not know. </p><p>After about ten minutes of trying in vain to set my alarm, I decided it was time to return to the shower. My thoughts and rationalizations are extremely skewed and confused on mushrooms, but at the time, it seemed to me very sensible and acceptable to go 'continue' my shower. When I got there, the shower was still on, so I just hopped into the tub. This time the lights were off, and so visuals became very common. The extreme one was when I peaked warily out of the shower, and saw my good friend who lived down the street from me. This was quite impossible because I knew he was out of town. I found it highly unlikely that he was there, in my bathroom suddenly speaking to me. On some deep level, I knew this was impossible and yet I was seeing him, almost as if a hologram and I could hear his voice in echoes. Despite my reasoning, I listened and watched with intrigue. He seemed frantic and upset, which caused me to be as well.</p><p>He was explaining to me that I was at his house, and that I was on mushrooms. Apparently, I had been wandering the neighborhood, too high to know reality from mushroom. Slowly the consequences of that thought dawned on me. I asked him 'What? No! There's no way... What?', and he kept replying 'Yes! Yes! You are on mushrooms, and you are at my house man!' at which point I saw his parents standing behind him. I saw this all now as if I were at his front door, his parents behind him in his house. I took a look around and quickly realized I was naked and then the dreadful thought came to me. I suddenly thought that I was truly at his house, running around the neighborhood a naked mushroom fool! Everyone would know... Of course, I was really at my house, in my shower, tripping tremendously, and it took me a few minutes to come back to that realization. </p><p>He must have heard me fumbling around in the shower, when my brother came to rescue me. Suddenly there was a light as the door opened and he stood there looking at me, writhing, twisted and contorted with the shower curtain wrapped around me. He moved quickly and fastidiously into the room and, suddenly his face was in mine. Like with tunnel vision, his body was about ten feet away, his neck stretched out to me and his eyes were directly in mine. Shortly, the image flickered as his head went from the left of my head to the right, and then back. 'Tell me what to do,' I begged him, and like wind blown branches scratching at a window, in whispers his voice became slowly audible 'Go to bed...bed...bed' and it echoed off into silence, 'Go to bed'. I complied quickly. With resolution, I said 'Okay'. My brother was now on the scene, and he had saved me from horrendous thoughts through his somewhat sober direction. Again I padded across the hall and back into my domain. </p><p>For the next four hours, I lay in my darkened room perplexing over anything and everything. At one point, I thought I felt hair growing on my tongue. I could not focus on any one thing, and so I was constantly scanning everything, which can make for a long four hours. I was at the point where I could not tell fantasy from reality. I was all over my room tearing pieces of paper and ripping leaves off plants, touching walls, you name it. I just needed something to prove that I was still tangible, real. It felt as though I was caught in a time loop, or a bubble. Every time I looked at the clock, it was the exact same time. To add to that I kept hearing the same sound outside my door. It was the bell on my cat's collar, and about every minute, I would hear a 'ding!' outside. This seemed to emphasize to me that I was caught, unmoving and unchanging forever in this time loop. I was searching frantically about my room for any sign that time was passing. Realistically, this 'time loop' was an instant of about thirty seconds, but that thirty seconds I experienced seemed to go extremely slowly, and it seemed to repeat multiple times. It took me about half a dozen times of experiencing that thirty seconds until time finally moved on. </p><p>I carried on like this in my room through the night. I remember one particular instant as I was tossing in my bed, holding a pillow. As I tossed from side to side, I moved in slow motion, and I could hear the pillow as it rolled with me from side to side, toppling on my body. It created a sound of deep resonant bass, and I could see little waves rippling out each time the pillow hit. It reminded me instantly of the special effects movie producers used in The Matrix. Near the end of my dreamy state, I slept fitfully, and awoke soberly. With fresh curiosity, I ventured warily from my room. </p><p>Part III: Return to Morning</p><p>As I woke, I had a familiar grasp on reality. I felt tired, exhausted from the energy the mushrooms had caused and used in me. That night, I had been a tool for the mushroom. It had expressed its Daemonic energies through me, and I had seen the energies through the mushroom. When taking the mushroom I agree to a mutual relationship, and am One with the mushroom for a time. </p><p>I rose from bed, anxious to see the morning outside. I made my way to the back yard where my brother was waiting, sitting next to an unlit fire pit. There we recounted to each other the experiences we had gone through in the night. We laughed, and it was good. Still we were filled with the resonating tremors or jitters that are characteristic of coming off, or leaving the world of mushrooms. We jittered with excitement at the profundity of the past evenings events. We were unaware of what had happened to our other companion, and in moments, we had contacted him. He was waiting for the call. He and our sober friend arrived at my yard, and soon we all exchanged our tales. He had wandered home as well, having had nowhere else to go. He ended up having a confrontation with his father, in a dark, foreboding and then Daemonic house. He sat in his room much of the night trembling in fear, and his father would pass the room looking in with a bleeding face.  He told of gremlins and daemons glaring at him from objects in his room. Until our sober friend arrived at his house late in the night, his night went no better than mine did. </p><p>In my open yard, we sat in the middle, around an empty fire pit, drunken with laughter and utterly exhausted. I marveled at the beauty the morning brought. Above us, the sun was shaking off the sheets of night and rising, naked, to the world. All around me was tapestry. Every leaf of every branch on every tree swayed in pastel color, as if on canvas; the teal blue sky behind, the color of Deep Ocean. It was just another morning in my city, and yet the simple beauty of it, the breeze, the pinkish glow in the sky, the harking birds, stunned me. On any other morning, I would likely not have noticed, but today I was glad to be alive, glad to be home. </p><p>~</p><p>One must proceed carefully with the mushroom. One of the most difficult aspects of the mushroom is that during the high, for the most part I still seem to be thinking and reasoning clearly, which I am. However, I are thinking and reasoning differently than I would be if I were not on mushrooms. I may think that there is something wrong with other people who are sober, and look at me with curious eyes. I simply smile at those people, and realize that they cannot comprehend the level of perception I  have reached.</p><p>In addition, I try not to look at the mushroom trip as merely a 'trip'. Certainly, I enjoy it. It is a very beautiful experience in all aspects. Even if I have an extremely negative trip, that is good too because I will have learned something from that, and I will then truly see the positive under a new light. When I embark on a Journey, I look at it as a spiritual test also. If I focus my thoughts inward, and try to ask myself my biggest questions, I am amazed at how creatively the mushroom will answer. </p><p>Mushrooms are by no means a drug for just anyone. During the majority of my experiences with the mushroom, I have taken them unaware of their power. If anything, during my Daemon Journey I learned that the mushroom is to be respected and revered. Regardless of how many physical preparations you make, nothing can prepare you for the psychological distortions you will encounter. However, if you take mushrooms with a clear intent on what you wish to get out of the trip, you will experience them on a level unreachable under any other circumstances. The mushroom is also a thing to be viewed with awe and beauty, for it truly is a beautiful thing, experientially. I believe that it is here not for 'recreation', or a night of wild, 'fucked up', 'trippy' visuals and perceptual distortions, but a spiritual catalyst. It is a link put here for just that use. We are given the opportunity to cross over, to enter a different world; the same world from another angle. There you can see the world from a different perspective. Your thoughts lead you to new conclusions about life and at some point fill you with the most ecstatic inner peace. You come to simple realizations and, for a time, all is well.</p>"
}
