{
 "title": "Oops, That Didn't Work...",
 "author": "Strange Philosopher",
 "citation": "   Strange Philosopher. \"Oops, That Didn't Work...: experience with Cacti - M. geometrizans (ID 17983)\". Erowid.org. Aug 17, 2004. erowid.org/exp/17983",
 "substance": "Cacti - M. geometrizans",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "16 oz",
   "oral",
   "Cacti - M. geometrizans",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 17983",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 17, 2004",
   "Views: 12373",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm an eighteen year old Ecuadorian American guy. I am a very liberal philosopher/photographer/mediator/student.  I am 60 and weigh about 160 lbs  Im a lightweight and I am rather sensitive to substances like alcohol and marijuana.  I consider myself intelligent, creative, ambitious, and curious, and only recently have I tried to expand my consciousness with mind-altering substances.</p><p>In my pursuit for altered mindstates, I discovered online info about cacti.  After extensive research, I decided to try and find a San Pedro cactus or something similar to that.  None of the nurseries around where I live carry San Pedro or any Trichocereus for that matter.  However they did have a medium sized Myrtillocactus geometrizans (Blue Flame) which reportedly contained mescaline.  Im writing this report to dispel that rumor.  While it may contain trace amounts of mescaline, it doesnt come close to producing the amazing visuals that San Pedro does.</p><p>The cactus I used weighed close to a pound and a few weeks previous to this, I fortified the soil with tyrosine and dopa.  I had even been taking 12 mg melatonin supplements for the past week.  So I honestly tried to make the most of the experience</p><p>I started by removing all the spines.  Once that was done, I painstakingly peeled off all that waxy skin on the outside.  I removed the core and then chopped the cactus up into itty bitty pieces and boiled it for close to 1 ½ hours.  I then poured the water into another pot (not aluminum) to boil down.  I refilled the big pot and boiled the cactus mash again.  I did this process for 5 hours.  To filter out the last of the floating debris, I poured the final batch through a tshirt.  By the time I was done, I had about 16 oz of a dark greenish brown, rank smelling liquid which I put into the fridge to cool down for the following morning.</p><p>This morning I choked down the terrible sludge for breakfast.  Prepared for a mind blowing trip.  Heres what actually happened</p><p>11:30 AM</p><p>Yuck, that tasted terrible</p><p>12:00 PM</p><p>Hmm nothing so far.  I decide to go out with friends to a Flea Market.</p><p>12:30 PM</p><p>Shouldnt something be happening now?  Slight nausea.</p><p>1:00 PM</p><p>I feel better now, but no visuals or body high.  Nothing at all.</p><p>1:30 PM</p><p>Colors seem slightly more vibrant.  Could be placebo.</p><p>2:00 PM</p><p>Yup, it was placebo.  Damn it!</p><p>2:30 PM</p><p>I sit down to write up this report.  Feeling very bitter about the whole ordeal.  Oh, well at least I didnt puke.</p><p>So what went wrong?  I did add 500 mg of tyrosine during the extraction.  That might have somehow affected the mescaline.  I dont know.</p>"
}
