{
 "title": "The Emerald Princess",
 "author": "Kheophex",
 "citation": "   Kheophex. \"The Emerald Princess: experience with Absinthe (ID 18)\". Erowid.org. May 31, 2000. erowid.org/exp/18",
 "substance": "Absinthe",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE:",
   "2.5 glasses",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 18",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 31, 2000",
   "Views: 43680",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nCheers to the World from Portugal ;))\r\nBefore discovering absinthe, I've had few experiences regarding alcohol. I've drunk many kinds of shots and even got more alcoholized that what might be considered 'proper', but that was all.\r\nI've went with my friends to a discotheque in the early afternoon (kinda of a matinee). I've been wanting to try the famous 'green fairy' for some time. I ordered my absinthe simple, with one ice cube; I almost knew what I was in for when I smelled the drink... it smelled almost like pure ethanol! The liquid was a beautifull yellowish green...\r\nThe taste was bitter, strong and rather oily. The imediate warmth one gets from tasting a strong drink, soon spreaded to every fiber of my being and for a few moments I felt like I had something wonderfull, something magical inside me... my every muscle relaxed and I felt great... just imagine when you're in a warm bed and it's cold outside, and it feels so warm and comfy that you don't wanna get out... that is the feeling one gets by drinking the first absinthe glass...\r\nSadly, that feeling doesn't last much, and you only get it from the first glass of the day (or night, ;)). Afterwards, I felt much more 'connected' to the music and to the 'ambiance' and my sense of touch was a bit erratic, sometimes it felt like I was on painkillers, sometimes it felt like it had been slowed down somehow. There were no other particular distortions of the senses.\r\nSuffice to say, I got very drunk that day, because I drunk another 'pure' absinthe glass and half of another (a friend of mine, said it was too powerfull and he couldn't handle it), but I didn't get much of a hangover afterwards (light headache, some drowsiness...).\r\nNowadays, I try to enjoy my absinthe without getting too drunk. Sometimes I drink it diluted (tastes great with apple juice). I don't know how much of it's effects can be attributed to alcohol rather than the Artemesia Absinthium, but my experience tells me that it... enhances alcohol somehow, it betters it! It doesn't kill your energy like plain vodka or whatever... it gives a lot more energy!!!!! And it doesn't foul up your gut like whisky, nor give you a hell of a hangover comparatively to other strong drinks.\r\nBeware, though, the quality of the absinthe is *very* important, some of the stuff that is selled as absinthe, is just some foul homemade stuff with wormwood extract oil and vodka. Once I drank one shot, just one shot, of an 'absinthe' that was so foul, so badly tasting; it wasn't even strong, it was rather weak when compared to say...goldstrike! The only 'effect' it gave me was sudden urge to vomit!\r\n'Night's beauty's fade at dawn, and the children of wine are oft disowned in the morning light'-- George R.R. Martin (in 'A Game of Thrones').\r\n\n"
}
