{
 "title": "Beyond Words",
 "author": "Thgilenin",
 "citation": "   Thgilenin. \"Beyond Words: experience with DXM (ID 180)\". Erowid.org. Aug 15, 2001. erowid.org/exp/180",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "661 mg",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 180",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Aug 15, 2001",
   "Views: 19205",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've roboed seven or eight times so far, with each experience being slightly different from all of the rest. Lately, however, things have started to change (for the better!), as I've been studying and experimenting with various out-of-body states (while I'm sober). Additionally, I've been experimenting with alpha/theta stimulation CD's that influence your body to fall asleep, while your mind stays alert. Last night, I ingested 661 mg of DXM, and the journey began. Here are the two 'key moments':</p><p>- While in a different state of existence (unlike physical reality), I began to summon every person that I've been in contact with throughout my entire life -- family, friends, enemies, people I've passed on the street, etc... It took a lot of mental effort, and quite a good deal of time before they were all present -- I could see each and every one them as a small glowing 'orb' of light; they all looked physically identical, yet somehow I knew who each one of the orbs was... I had an additional sense of perception -- I could look at any one of the orbs and I would immediately be flooded with that person's physical appearance, thoughts, feelings towards me, etc... Quite an overwhelming experience, considering how many people were present! Anyway, I decided that there was no way I could directly communicate with all of them, so I decided to 'emit' love and understanding to each and every person present, regardless of past disagreements or misunderstanding. A bright, golden light began pouring out of me and enveloped everyone who was present.</p><p>- Not too long after, I found myself traveling to a realm that I could sense was much 'higher' in significance than any of the other places that I had visited. I ended up in the middle of an endless mass of silver/golden light -- I could feel every single particle of my being disintegrating and becoming part of the light-mass; indescribable sensations bombarded every part of me -- far greater than any pleasure that I've experienced here on Earth.</p><p>All of these experiences were unlike any that I've ever had before. During my past robotrips, I always enjoyed myself, but all of my experiences were nothing more than hallucinations. As real as they seemed, I always knew that they weren't real. This time was -VERY- different; these experiences were as real as anything I've experienced in this life. As real as the cup of coffee sitting in front me. As real as the raindrops falling outside.</p><p>I could write for hours, detailing all of my experiences last night, but, unfortunately, there aren't many words that I can think of that would accurately describe such experiences! It's like trying to describe an emotion (love, jealousy, etc.), without using other emotions in such description.</p><p>I'm going to keep working very hard (without disassociates) on my out-of-body travel 'skills' for the next few weeks, and then I'll robotrip again and see how much farther I can go.</p><p>!!! Wow !!!</p>"
}
