{
 "title": "Seeking Unconsciousness",
 "author": "Adele",
 "citation": "   Adele. \"Seeking Unconsciousness: experience with Diphenhydramine (Benadryl) (ID 18017)\". Erowid.org. Jun 19, 2007. erowid.org/exp/18017",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18017",
   "Female",
   " ",
   "Not Given",
   "Jun 19, 2007",
   "5262",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been diagnosed as bipolar, and like most bipolars from time to time, I had gone off medication.  I'm in the habit of taking more than the usual amount of Benadryl to get myself to sleep.  In the storm of emotions that threatened to overwhelm me as my illness returned, I found it impossible to sleep at all, so I went to the store and bought a bottle of 100 of these pills I had come to love.  They are so easy to swallow, even by the handful, or at least the brand-name coated Benadryl are.</p><p>20 Benadryl didn't 'knock me out' right away any more than 5 had.  I still had to wait for sleep to gradually come over me, but once it had, it didn't let go for a long time.  I slept for about 15 hours straight, got up to pee, and found myself barely able to muster the coordination needed to walk to the bathroom, and definitely unable to do anything but return to bed.  My sleep after that was in segments about six hours long, full of disjointed, jarring dreams; each time I woke up I was a bit less shaky and a bit more nauseous.  When I finally got up for good, I felt positively ill - for three days after I couldn't look food in the face.  I ate anyway, and it stayed down, but that was pretty iffy.</p><p>Even after all that, I still repeated the process a few days later because I so intensely desired to escape by 'turning my mind off' this way.  There weren't any noticeable differences in the way it worked.</p>"
}
