{
 "title": "Neurotin at Higher Doses",
 "author": "K-PAX",
 "citation": "   K-PAX. \"Neurotin at Higher Doses: experience with Gabapentin (Neurontin) (ID 18039)\". Erowid.org. Nov 13, 2002. erowid.org/exp/18039",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "2400 mg",
   "oral",
   "Pharms - Gabapentin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18039",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 13, 2002",
   "Views: 13363",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've been given Neurontin for a few months now, for anxiety. It's not marketed for it, but apparently a lot of people taking it for their mood and whatever else they had noticed they felt less anxious.</p><p>Well, at 1000mg at once, I can say I felt pretty hazy. I'd definitely up the dose gradually before taking higher doses.</p><p>Today I took 2400mg at once. It's okay for 3600/day, but that assumes you spread it over three times in the day. Oh well, it's nicer to work at once. </p><p>After two hours, all of a sudden it kicked in. A sensation is felt in my brain that lets me know it kicked in. I couldn't describe it except to say it's a soothing sensation in my head. Everything's very calm and relax.</p><p>Blood flow seems to feel different, especially my brain. It causes my blood vessels to contract and expand occasionally, which is odd but considered normal.</p><p>My thoughts seem slower, and a foggy haze seems to go through my head. It's best to take a little less than whatever dose this does to you at. Next time I'll take 1600.</p><p>I'm social on it, even though I might appear slow. I can definitely pull off appearing 'sober' from it.</p><p>I use this a lot to sleep when I am coming off Adderall all-nighters and need to re-teach my body what sleep is. The only problem with it is that it takes 2-3 hours to kick in and leaves after 5-6 hours. Besides that and a brain fog, it is a very soothing drug.</p>"
}
