{
 "title": "Doggy Trippin",
 "author": "Road Tripper",
 "citation": "Citation:   Road Tripper. \"Doggy Trippin: experience with Mushrooms (P. cubensis) & Cannabis (ID 18053)\". Erowid.org. Oct 17, 2002. erowid.org/exp/18053",
 "substance": "Mushrooms (P. cubensis) & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)",
   " ",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18053",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 17, 2002",
   "Views: 7558",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMy good friend D just got back from Idaho with some (quite a bit) shrooms he baught for me (with money I gave him).  I took the day off from work so we decided to trip.\r\nWe decided to make some tea, I usually just eat them.  So we got out probly 5 grams (mabee a little less) from the huge ziplock bag and put them in some boiling water.  The shrooms swell up with water and we smashed them a little with some forks to get the juces out.  Then we added a bag of apple cinimon tea to the mix.  We were talking wile making the tea and we decided to offer his dog Buddy some.\r\nBuddy is an average/medium large sized dog, about 60 to 75 lbs and about two and a half years old.  He's a mixed breed rottweiler/black lab with long black hair with golden patches.  He's a very kind playful dog, kind to strangers, very smart, and mentally stable, I know him very well.  He likes to get high with us when ever we smoke, we blow out our hits and let him brethe them in.  A great dog with a great personality.  This would be his first trip.  We figured a MUCH smaller dose would work for him. Concidering weight and the fact that we didnt really know how dogs react to shrooms I got a small cap out about the size of a nickle (about 0.3 grams I would estimate) and held it out to Buddy.  He came and ate it and we drank our tea. The tea actually tasted great.  I highly recomend making tea, no stomach problems, and the taste is very mild.  Psilocybin is very water soluble and almost none of it is left in the shrooms.\r\nJust after we drank the tea we went to wash D's car.  After a half hour you could feel the scoobs coming on.  Clasic aprehention, sped up thoughts, and a medium body load.  We got done washing the car and smoked a bowl of some good herb.  It's great to smoke on the come up of shrooms, it really puts me in the zone and relaxes me a little. I definitly trip harder and it can be intence but if I am familiar with both substances I can feel their distinctions.  We decided to go back to D's and see how buddy was doing.  He was happy to see us when we got there.  It was an awsome day out side so we went out and sat on the grass.\r\nI could definitely tell Buddy was tripping.  His pupils were big and he had that special twinkle in his eyes.  He would look around at every thing and tip his ears at any noise.  At some parts of the trip he was very playfull and energetic rolling around in the grass and he loved to be scratched, he LOVED it.  We tossed his bone for him and he would fetch it and munch on it for a wile.  At other times he was very calm and looked thoughtful.  Me and D both felt a new conection to Buddy, we could feel his mood and his thoughts better.  Mushrooms can open your mind to other forms of comunication.  Dogs comunicate mostly with body language, facial expressions and eye contact and some vocally but not as much as we humans depend on vocal language.  All three of us definitely bonded on a new level.  We all had a great trip.  The sun was out and the leaves in the mountains are just starting to change color, a cool breeze made things just right, fall is a great time to trip.\r\nSome after thoughts.\r\nBuddy was definitely tripping hard, mabee a litte harder than me and D.  A little bit goes a long way.  Just one small cap and he was trippin hard.  If you are ever going to trip with a dog or other animal I would suggest a few things.  Concider the dogs age.  I would not recomend any age less than about two and a half years (about 15 or 16 in dog years).  Even that may be young.  Basicly make sure they are out of the crazy puppy stage and are fairly mature.  Never force a dog to eat something that is going to have such strong efects.  If he had a bad trip I imagion he would be pissed at us for giving it to him.  We offered the shrooms to Buddy freely and let him decide.  If he had not eaten them we would not have forced him to.  Second make sure they know and are comfortable with every one they are going to come into contact with. A stranger might upset a dog, potentially more if he's trippin.  Also know their personality, shrooms are not for every person, or dog.\r\nOver all this was one of my favorite trips.  Totally Awsome!\r\nI hope this may help some one.  Be carefull and smart.  Mushrooms are very powerful and can have very good or very bad efects.\n\n\n"
}