{
 "title": "Datura An Ally",
 "author": "Paul Rossouw",
 "citation": "   Paul Rossouw. \"Datura An Ally: experience with Datura Leaf (ID 1812)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1812",
 "substance": "Datura Leaf",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Datura",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 1812",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2000",
   "Views: 59238",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The interesting thing about Datura is the power of the experience. Ketamine is the only other drug that creates anything remotely like this (but I haven't tried DMT). Unlike K, which is very otherwordly and downright bizarre, Datura is very earthy and familiar. Nonetheless, both can be used as tools to explore reality.</p><p>It's difficult to explain the difference in a few words. So, I'll give an example of a typical Datura trip (stage 2).\r>></p><p>I'm propped up in bed, reading an amazing book. The topic is really fascinating and resonates with my interests. When I get to the bottom of the right hand page, I try to slide my hand behind the page, to turn it over and continue reading. But there are no more pages, and I flip fresh air. In fact there is no book (ie, I'm propped up in bed, with my empty hands, palms up, lying on my lap).</p><p>I'm surprised and irritated that there are no more pages. But, the topic was so interesting that I decide it's worth reading again. When I start reading at the top of the left hand page, the book is about a totally different topic. Which is just as fascinating, so I quickly read to the bottom of the right hand page, and try flip over the page to continue the story. But, there are no more pages.</p><p>So I start reading from the beginning again. And, wow, another totally different yet fascinating topic. I read eagerly and come across an amazing sentence. I decide to read it again. My eye scans to the beginning of the sentence and I start reading. But the topic has changed again. And so it goes. Basically, any hesitaion on my part, any break in the flow, would switch the topic. Always great reading though. So I languished in bed for a few hours reading my endlessly fascinating, Infinity Book.</p>"
}
