{
 "title": "Psychodelic Twilight Zone",
 "author": "Rod S.",
 "citation": "   Rod S.. \"Psychodelic Twilight Zone: experience with Salvia divinorum (5x extract) (ID 18134)\". Erowid.org. Apr 25, 2005. erowid.org/exp/18134",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18134",
   "Male",
   " ",
   "Not Given",
   "Apr 25, 2005",
   "3999",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I would like to share my first experience with salvia. I decided to try it to help me overcome blocks in my life. After I had read as much as I could on the subject, I informed my wife how to sit for me. She and I took the extreme advice of one website and put away all knives and such as we prepared our little apartment.</p><p>We lit some candles, put on a meditation cd, started the recorder and began our experiment. I sat in our bed with my legs beneath the blanket, stated my intent once again and took a hit. As I exhaled, I felt a slight pulsation over my body. Images were outlined with flourescent coloured dots in the dark room. To be safe, I told her to load up the bong again. I held the second hit for almost 45 seconds before exhaling and lying back.</p><p>As she tucked me in, her voice seemed distant and booming and she appeared to be a long ways away. The tassels on the blanket seemed to flap slowly in the breeze that wasn't there. The tassels became dancing legs, like the Rockettes as I closed my eyes and passed through them.</p><p>Soon, I found myself moving through multi-coloured paiselies that were swimming in the air before me. I opened my eyes and saw that every detail of everything was made up of dots of colours and I thought, 'Oh yeah, like psychodelic art. It's always like this' Then I closed my eyes again and continued in the journey.</p><p>I felt heavy and had an intense prickly sensation all over my body. I thought, 'This is like anesthesia, I hate anesthesia.' I found myself in an E.R. awaiting surgery, an actual surgery I did have. I said, 'I don't like this.' And I was taken from there.</p><p>I was aware that I was lying on a bed, being surrounded by my wife and three other beings. I thought the room was the size of a stadium. I pointed to a wall just inches from me and asked my wife if there was someone there. She said no. I said, 'I mean waaaaay over there.' I opened my eyes and everything seemed distorted. For some unknown reason, I told my wife that I needed one more hit.</p><p>As I exhaled, I saw that my wife and the beings were having a party. They kept telling me to relax and go with it. Something like a blackhole formed near my head and it was pulling me and the bed into it, warping everything. I closed my eyes and found myself at a wall made of stone blocks. I felt afraid as I was being pulled into it. I opened my eyes and I saw my wife and the three beings. I called out for help as I was now back in the room but becoming part of the bed. I remember thinking, 'This is how it always is, I go to a party and become part of the bed and nobody notices.'</p><p>I tried to get up, but my wife wisely kept me in bed. I tried very hard to look at her face, but it was very difficult to do when it felt like having a finger stuck in my eyes. She looked like a polarized photo with the light areas appearing really bright and the dark being very dark, and the colours were silvery. I wanted very much to be back in her world. I was sorry I went here as I found myself terrified, (though my wife would later tell me I seemed relaxed, my breathing and heart-rate were normal). Then the effects just faded. Total time was 30 minutes.</p><p>After my wife and I recounted the experience, I realized the wall made of stone blocks was what I needed to go through, and believe it or not, I tried it another time. This time was more peaceful, but I still have not yet gone through the wall, nor do I know who the three beings were. What I do know is that in the past week, I have been more creative.</p>"
}
