{
 "title": "Here Now Forever",
 "author": "freedom",
 "citation": "   freedom. \"Here Now Forever: experience with Calea zacetechichi (ID 18141)\". Erowid.org. Nov 19, 2003. erowid.org/exp/18141",
 "substance": "Calea zacetechichi",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Calea zacatechichi",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18141",
   "Female",
   " ",
   "Not Given",
   "Nov 19, 2003",
   "13366",
   " "
  ]
 ],
 "report": "<p>Lately I have been going through many emotional problems dealing with my reality. I was once very fascinated with and one with nature, but I got lost during a big change in my life. My second time smoking zacetechichi got me back to where I was in life. </p><p>I had rolled a cigarette of it and sat on the back porch late one night. I suppose you're supposed to smoke it as a cigarette, not a joint, but the only thing I smoke is pot, so naturally I held the smoke in. It was very dark. I could see only the 3 dark trees in my yard and a few stars once in a while when the clouds passed and there was an open space of sky. After 4 hits or so I started to feel a bit different. I thought I was getting high, but I just figured I was only imagining this b/c it was dark and i was smoking. And then all of a sudden there was peace. My mind wasn't worried or stressed, I wasn't thinking at all, I was just here, here on this earth plane, in this life, no past, no furure, just now. And there was always now. It felt so great. After I finished smoking, I went and lay the yard. I lay there, looking at those 3 trees above me, there with me with such love, and a few stars, it was how, I feel, life is supposed to be. No concern with yourself, or others, or money, or the future or anything. </p><p>I nearly fell asleep laying there in the grass. And my dreams that night were not lucid or any more interesting then my dreams on other nights. I am now at peace with myself and am very content with things. I am very thankful for this plant. I don't know what hell I'd be in if I never smoked it. I still smoke zacetechichi and it's helped me find things I never imagined finding.</p>"
}
