{
 "title": "Come Into Life",
 "author": "Oz",
 "citation": "   Oz. \"Come Into Life: experience with MDMA (Ecstasy) (ID 18168)\". Erowid.org. Oct 14, 2002. erowid.org/exp/18168",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "  T+ 0:05",
   "0.5 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18168",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 14, 2002",
   "Views: 32390",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before my first MDMA experience, I had only smoked pot and salvia... nothing too mindblowing. I had never really felt the need to try anything more, though I did have some curiosity about MDMA and LSD.</p><p>However, my interest really started when my friend D came to college one day and told me that he had taken his first pill the night before, and that it was the best experience of his life (D was relatively inexperienced with drugs as well, having only smoked pot and unsuccessfully tried LSD as the tabs were crap) He began to tell me about his experiences, and gradually any anxieties I had were washed away with the shear beauty of what he was describing to me. I agreed to try it with him at a club the following Friday. I was pretty excited about this, so when D said on Wednesday that he was going to do it again that night, I jumped at the chance to have my first major drug experience.</p><p>So that night, I set off with my ex-girlfriend C (who I had split up with a few days before) and my friend M. Having told them that I was going to take a pill that night, they were generally supportive (M had been interested in them for a while, though he had never gone ahead and experimented) C said that she would look after me if anything went wrong so I was all set for the night ahead.</p><p>As we approached the club I met D and his friends (who were very experienced with pills.) 'Are you ready for the most amazing experience of your life?' asked D, I said yes and he sped off to a nearby pub to get the two supermen from his friend. He returned and we stood in line outside the club, at this point C was telling me that she was worried about me, but at that point I was single and was using this opportunity to try a new drug without ruining a relationship.</p><p>So we entered the club. It was very early and the place was virtually empty and boring, so D and me decided to drop straight away. We bought water, and went into the toilet to drop. D handed me my pill and swallowed his with a gulp of water. By this time another friend, T had arrived and was watching my first pill taking experience. I bit the pill in half and took a swig of water D and T smiled.</p><p>I had decided to take half a pill and then take the other half about an hour later. But when I went and sat down to wait the anticipation was too great, and within five minutes I had taken my other half. I then spent the next half hour or so walking around talking to friends, quietly pleased with myself and quite excited. After about 25 minutes D told me that he was coming up and asked if I was, I said no but at this point I had felt virtually nothing and was wondering if pills were really as good as they were made out to be.</p><p>Well, I was standing at the bar with C and M and a few other friends when suddenly it all kicked in. First thing I noticed was however hard I tried, I couldnt stop smiling. I was experimenting with my facial expressions for about 30 seconds when C asked me what I was doing this seemed to act as a catalyst for me coming up. My whole body suddenly buzzed and I was overpowered by an amazing feeling of pure happiness, I bent over and moaned in a quietly orgasmic way. M was the first person I walked up to, because he had been interested in taking E for quite a while. He saw my face and immediately smiled, 'are you peaking man?' he asked. I nodded and said that it was the most beautiful thing I had ever felt.</p><p>It was, because it was nothing at all like I had expected. I thought I would experience something like an intense cannabis buzz, but with extra happiness. I realized that when people drank alcohol or smoked cannabis they were getting a buzz off the fact that their minds are clouded and they dont have to worry about making decisions because they're too drunk or stoned to care if they do something stupid. Ecstasy is different, and to me this was one of the most beautiful and mind-blowing things about it I was completely aware of everything during the trip. Everything seems so utterly clear for a few hours, and at the time my mind was pretty clouded up with various fears and worries. The pill really helped alleviate the depression I was feeling to the point that it changed my whole outlook on life.</p><p>Anyway, after a while the club got packed out. The dance floor was impossible to navigate for somebody who didn't really care, so I spent my time walking around speaking to random people and hugging my friends. I met a lot of Ds friends who were heavily into pills, and with each new greeting D would say, 'it's his first pill.' 'Aww, you're loving it' they'd say, or something similar, and give me a hug. Before this, I was quite a shy person and wouldn't go up to anyone randomly. But now this whole ecstacy thing seemed quite brotherly and it was clear to me that everyone felt exactly the same way. It was a revelation.</p><p>By this point T had taken a pill as well, after seeing how loved up I became (although he is quite experienced with pills himself) Now, me and T had a bit of tension between us for a number of reasons one being that I was in a band with him, which meant a lot to him, and pretty much screwed him over by ignoring his phone calls and pleas to get together and jam. But he came up to me, put his hand on my shoulder and spilled his heart out to me telling me that nothing matters at all apart from what we have now, and that's friendship. He also said that I had to sort out whatever was going on with C, because he knew that we loved each other very much. Most of the time, I found T quite hard to understand and seen him as a bit of a druggie. But at this point I really felt I understood and I connected with him on a deeper level, now we have lost any bitterness that was there.</p><p>Throughout the night I was walking around pondering my experience. To me it felt like this is how we should all feel, and the way I was feeling at that point is how we were made to think any other feelings that make you depressed and anxious such as jealousy and hate are something that humans have developed and we are taught by our parents and peers to feel these emotions. The way I was explaining this to people was to tell them to 'come into life!' Although the majority of sober people I spoke to just looked confused, D understood me completely (what a surprise) and we talked about our feelings and hugged each other for a while. It was an intensely liberating experience. Now 'come into life!' has become a phrase used by me and D to describe the pilling experience.</p><p>With my newfound clarity of mind, I realized how much I did love C. Touching her was just incredible and when we kissed it tasted like the most beautiful thing in the world. She said that I was saying it all because I was on pills but by the next day I felt the same and we were a couple once again.</p><p>Because I took the pill early on in the night, I was pretty dead by about 1 o'clock, so C and me headed off home. Although it was tiring, the come down wasn't half as bad as it had been made out to be, and the afterglow from my experience lasted for days and days. M was saying that I was a completely different person, really happy and spaced out. And it was true, because I felt like a different person too. M has now decided that he never wants to take pills.</p><p>That was almost three weeks ago. I took my second pill two days ago and had an even more intense experience than my first. This time the club was much larger so I had more space to dance around etc. I also experienced visuals for the first time, on Cs ceiling when we arrived home, which was kinda funny. But basically from my two MDMA experiences it has been a very, very fun drug which the media have turned into some kind of devil's pill. However I plan to use it mainly as a therapeutic tool, take one whenever I get down or depressed, because I find it is very effective for this.</p>"
}
