{
 "title": "Shroom OD",
 "author": "EB",
 "citation": "   EB. \"Shroom OD: experience with Mushrooms (P. Cubensis  & P. Cyanescens )  & Cannabis (ID 18169)\". Erowid.org. Oct 14, 2002. erowid.org/exp/18169",
 "substance": "Mushrooms (P. Cubensis  & P. Cyanescens )  & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms - P. cyanescens",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 18169",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 14, 2002",
   "Views: 29125",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOur story begins in the beautiful canal laden streets of Amsterdam. I've been living in the netherlands for over a year now and this is the story of one particular trip where I pushed it a bit too far. The day began nicely enough going from coffeeshop to coffeeshop getting ripped out of my mind. The next stop was to a smartshop where various psilocybin mushrooms and other such psychoactive drugs can be purchased. I decided to up my personal and eat to boxes of fresh cubensis. 1 box is considered a high dose. Then I ate another 2 grams of cyanescens. This is by far the most mushrooms that I've ever eaten. </p><p>The trip started out nicely enough. Walking around the streets of amsterdam tripping out of my mind and still breaking no laws. 3 hours later however I found myself in the Bluebird coffeeshop smoking a fat spliff in a corner. I was beginning to get incredibly high. I was on the second story of the shop and looking out over the street which appeared to be moving back and forth, closer and further. I started getting nervous at this point. I was beginning to get pain in my stomach and I thought I would puke. And inside of a coffeeshop was not the place to be doing that. I stood up turned around and headed for the door. I took about 2 steps and blacked out. It wasn't just a blackout though. I completely passed out. Standing on my feet. I just collapsed on the floor in the middle of the place. I remember that the blackness was pleasent. </p><p>The next thing I knew I was looking up at a bunch of faces I didn't know. Then I was in a corner sitting on the floor and I was drinking a sports drink. I have no recollection of recieving the drink, but it was already half gone. The owner had given it to me along with a candy bar. I was unable to talk for half an hour. I just couldn't form the words. They just wern't there. I eventually got up and left. I am curious if anyone else has experienced a loss of conscienceness from an incrediably high dose of mushrooms. Comments?</p>"
}
