{
 "title": "Recreational and Not Very Entheogenic",
 "author": "Chemical Name",
 "citation": "   Chemical Name. \"Recreational and Not Very Entheogenic: experience with 5-MeO-DiPT (ID 18175)\". Erowid.org. Oct 14, 2002. erowid.org/exp/18175",
 "substance": "5-MeO-DiPT",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18175",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 14, 2002",
   "Views: 7640",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis weekend R and I tried the N,N-diisopropyl-5-methoxytryptamine for the first time. It's always a bit exciting and a bit scary trying a new chemical for the first time. We were lucky to have G there as the sober sitter. I recommend this to anybody trying a new chemical or new method of ingestion. You don't want to become the crazy naked person running up and down the street that is picked up by the cops.</p><p>We put the chemical in to little gel cubes, I thought that this would be the best way to insure accurate and repeatable dosage. We added 250 mg of the 5-MeO-DIPT to 200 ml of gel mixture and divided this into 64 doses of approximately 3.9 mg each. I initially took 3 cubes, which gave me approximately 12 mg of the 5meo-dipt. R took 4 cubes, for a 16 mg approximate dose.</p><p>Initial effects were felt at around T+30 minutes. We went into the spa for the initial come up phase. The first effects felt were a bit of a stony feeling, then minor distortions to my vision. There was an increase in sensuality, touch felt sooo good. After we got out of the spa, R and G went and took a shower together. I went back to my room and laid down. I felt so alone, being there by myself. I started to experience more body load, my muscles tensed up. My heart started to beat faster, I estimate at around 105 BPM. I didn't really feel like taking my blood pressure, but I will have somebody do it next time so that I can see the correlation. I put on Nine Inch Nails - Rusty Nails II. It seemed an appropriate album, but it was very dark and it didn't help my mood at all. I was soooo relieved when R and G came back, as I had started to irrationally worry about R, him being tripping and all. Once they got back all became happy again.</p><p>I don't recommend taking this drug alone. I really don't think it would be fun, be with your friends. I took lots of pictures and spent some very special time with R and G. This substance seemed to be very recreational and not very entheogenic at the dose level that I took. I wouldn't have a hard time interacting in a public place, concert etc. I plan to try this substance again, probably at around the 20 mg range.</p>"
}
