{
 "title": "Much Too Much Too Much Too Much Too...",
 "author": "f",
 "citation": "   f. \"Much Too Much Too Much Too Much Too...: experience with Cannabis (ID 18192)\". Erowid.org. Oct 15, 2002. erowid.org/exp/18192",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18192",
   "Male",
   " ",
   "Not Given",
   "Oct 15, 2002",
   "22016",
   " "
  ]
 ],
 "report": "<p>\ni used to burn herb a few times a week.  It went up to every day plus for a month or two, then over the last year it's been a steady once a week just about every single week.</p><p>Looking for something a little different, i decided i would make herb cookies since i hadn't done that in a while.  i ordered a bag of delivery-service regular grade mediocre cooking herb and poured it into a half-stick of butter or so in a pan.  After cooking that for a half hour, i poured it directly into the cookie batter and made 2 really big cookies (1 for me, 1 for my friend Brian).</p><p>Saturday night at 5:00 we got all geared up and each ate a cookie.  They were, of course, delicious.  i realized that something was clearly amiss when at only T+30 min i noticed i was already high.  Very high.  And hungry despite having eaten a large large volume of cookie with high butter content.  For now i wait and have some of Brian's salad.  He is still eating his (remember i said they were large).</p><p>Another half-hour goes by of steady, steep climbing in height and i begin to get a little nervous.  To sort of snap myself out of the anxiety/worry phase, i make light of it and suggest we get pizza, though i am starting to fear the potentially scary world at this point.  We make it out and back with pizza, i eat some and soon have to go lay down because i'm too high.</p><p>i concentrated on not fighting the drug and riding it instead, and this helped a lot.  i managed to calm myself down enough to be receptive.  i began to get significant visuals as soon as i lay down, akin to the strength of my first time taking mushrooms (see report labeled 'Resurrection') but without the mental intensity.  i remember the open-eye and closed-eye visuals started to be essentially the same thing, so i couldn't always tell if my eyes were open or not.  Mostly a lot of geometric patterns and things being made of liquid and flowing.  Nothing event-oriented at this point.</p><p>Some time went by, and i eventually managed to tell Brian i was going to the bathroom.  i made it downstairs, but passed out on his bed instead of making it to the bathroom.  i had several vivid dreams in this period about differing versions of the end of the world (or at least of the world as i understood it).</p><p>At 11:30, Brian woke me up and had me sleep on his floor so he could have his bed.  i set an alarm for the next morning and succumbed to the herb again.</p><p>--------</p><p>Seconds later (real life : eight and a half hours later), i wake up to the alarm at 8:00 am.  i'm thinking about how weird i feel, but ascribe it to fatigue until i remember the cookies and the fact that i'm in New Jersey and not at home.  i realize i'm still high.  Still spun off my fucking wheels, in fact.  And that i have to go play piano at a church service, immediately.</p><p>i try to lace my shoes, fail, sit down and retrace my steps, and avoid freaking out.  'just relax' i tell myself as i fumble through an action i could do the last seventeen years or so with no trouble.  i mean, just because i can't tie my shoes shouldn't mean that i can't maintain order in public, play an instrument accompanying a whole congregation of people as well as a singer, and deal with the hierarchy of the catholic church, right?</p><p>i made it to church on time and awake if not aware.  i cut down on all human interaction, but there is some minimum.  i basically avoided talking as much as possible and tried to stay out of the way.  Putting on the robe for the mass gave me some trouble, but i got it together ok. The singer and i went upstairs to the main part of the church, and he asked me what i had done the night before.  i mumbled something (presumably) semi-coherent about staying out late playing a session, and he says 'You sure you didn't take acid or something?'</p><p>i told him i was sure.</p><p>Despite the fact that the music wasn't standing still, i managed to read through the hymns and solo ok and book it the hell out.  Came home, had an apple, passed out on my bed.  This was at about 12:30 pm the next day, now T+19 or so.  i was asleep until 12:00 am, T+31 or so, and i was still high when i woke up.  i ate some munchies and staggered back to bed again.  woke up at 8:30 am, 38 hours after ingestion, still a little dazed, a little depressed, but at least functional again.</p><p>i spent Monday in a semi-haze all day and didn't really feel normal until like 7:00 pm, or t+49 hours.  i got a lot more than i bargained for on this one.  i'm glad it turned out ok and that i didn't do something outlandish in the middle of a catholic church service or get lost in Jersey (or the city for that matter).  This was unfortunately not much a growth experience due to the fact that i was asleep for almost all of it.</p><p>However, lesson learned : two grams of herb is really rather too much for a recreational Saturday afternoon herb cookie.</p><p>f</p>"
}
