{
 "title": "These Don't Trigger Migraines for Me",
 "author": "Tribe Priest",
 "citation": "   Tribe Priest. \"These Don't Trigger Migraines for Me: experience with Morning Glory, 2C-T-7, Mushrooms -  P. cubensis (ID 18201)\". Erowid.org. Feb 2, 2004. erowid.org/exp/18201",
 "substance": "Morning Glory, 2C-T-7, Mushrooms -  P. cubensis",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Morning Glory",
   "(seeds)",
   " ",
   "  ",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18201",
   "Male",
   " ",
   "Not Given",
   "Feb 2, 2004",
   "Views: 11987",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been suffering from migraine and cluster headache for about ten years now. I could also be categorized as person with a chronic headache. I have regular seizures at least twice a month. Usually it can be stopped whit ordinary anti-inflamantories in the early state of pain. So it is usually the case that if I get even the slightest feeling of headache it will manifest itself to migraine seizure in a period of time if not treated somehow. As a result of the hell-like experiences I have developed quite accurate and sensitive sense which I can use to determinate that the seizure is coming.</p><p>I have few experiences with morning glory seeds (dosage of 100-290 ipomea tricolor seeds), 2c-t-7 (5-10 mg up the nose) and psilocybe cubenis (Mexican) of dosages of 1-3 dried average? size mushrooms orally or shared a joint of half a average size mushroom shared with someone. All these substances have the same charestiristic concerning headache. I really feel that there is no possibility for a headache or migraine under the influence of these substances. It is something that I feel. Even the smallest dosages of these substances have this effect.</p><p>Usually migraines are also mood related and stress (Low serotonine levels) causes to trigger migraine seizures.</p>"
}
