{
 "title": "Woozy With A Slight Headache",
 "author": "Kevin",
 "citation": "   Kevin. \"Woozy With A Slight Headache: experience with Inhalants (Aerosol Engine Starter) & Rubber Cement (ID 18206)\". Erowid.org. Sep 21, 2005. erowid.org/exp/18206",
 "substance": "Inhalants (Aerosol Engine Starter) & Rubber Cement",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1994",
   "ID: 18206",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 21, 2005",
   "Views: 15447",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I started huffing in my H.S. art class...of course rubber cement.</p><p>As I huffed with rubber cement I started to have auditory distortions like the sounds(voices,T.V. whatever)around me were pulsing and echoing at the same time. Then I got lightheaded,dizzy and almost like I was drunk. There is a little nasua and I could taste the chemical in my mouth. My mouth also POURS watery saliva. The high lasts about 5 min. then fades quickly.</p><p>I did this chemical for about 2 weeks 2-3 times a day.</p><p>Then I got a job at a wharehouse place. One night I noticed a can of areosol engine starter (you spray in in the carb aka ether). I read he can and it warned against inhaling the fumes(huffing). So I had to try it...VERY stupid. </p><p>I went to the bathroom and folded up one end of an empty toilet paper roll and put some t.p. in the bottom of it. As I sat on the toilet I sprayed the aerosol into the tube onto the toilet paper and started huffing. It was INTENSE,the auditory distortion of the MUZAC and the ceiling vent was very trippy. I was huffing for about 1.5 minutes with slow steady breaths through my nose. I remember saliva pouring out my mouth onto the floor between my feet. I was so out of it I almost fell of the pot...the next thing I remember my boss was beating on the bathrooom door.</p><p>I woke up on the floor with the tube about a foot from my nose.</p><p>I stood up very woozy with a slight headache. My boss said I had been missing for 4 hours...I had no explanation and was fired.</p><p>The memory of the whole episode with my boss is a blur but I can remember pieces.</p><p>I still think about what would have happened if the tube had landed closer to my nose after I had passed out.(DEATH) For the next couple of weeks(especially the next day)I felt dumbed down and not as sharp or 'smart' as I was before this experience. Eventually my memory of my level of brain 'sharpness' faded and the mind I have now is all I know...but I do know that my mind was once different.</p><p>I did not know HOW serious huffing was until that experience. I NEVER have huffed and never will again. I know I killed many brain cells. It's NOT worth it,smoke a joint or have couple of beers.</p><p>Huffing is SERIOUS. PLEASE don't ever try it.</p>"
}
