{
 "title": "Temperance versus Indulgence",
 "author": "Moonraker",
 "citation": "   Moonraker. \"Temperance versus Indulgence: experience with Cannabis (ID 18205)\". Erowid.org. Oct 16, 2002. erowid.org/exp/18205",
 "substance": "Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18205",
   "Male",
   " ",
   "Not Given",
   "Oct 16, 2002",
   "11361",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFirst of all let me say that I started using cannabis approx 5 years ago.  I now only smoke homegrown organic stuff, the strongest I can find.  This stuff is pretty much the chronic (bubonic chronic that made me choke, this ain't no joke).  Usually I smoke 3-4 bowls and I'm good to go.     </p><p>It is possible to achieve CEVs with this substance.  I have never experienced OEVs even while being phenomeally blitzed by brownies (much higher dose than attainable by smoking).  I would describe calypso as being a meditative tool.  Ideas and social interaction each flow more freely.  It's also a great muscle relaxer and adds to the appreciation of art, especially in music where layers become more distinct.  I find that the details of surfaces tends to increase while high, though they increase in graininess (I almost see a cyan and magenta 'pixels' underneath surface appearance).</p><p>After a variety of usage schedules (once per week, daily, etc), I found I prefer not using cannabis more often than every other day.   This keeps the experience fresh and vivid every time, and doing it any more often will inevitably raise my tolerance (and reduce the intensity/quality of the high).  </p><p>I look down somewhat on daily users, since sooner or later what they're buying isn't worth the experience.  One needs to exert a little willpower, but I think this pretty much guarantees a great experience everytime. </p><p>I also would like to report that the health effects of smoking have been lessened by taking large quantities of antioxidants, specifically Vitamins C and E.  My lungs recover much faster and I've found I can go every other day and not accumulate crap in my lungs.  Even pouring a little Odwalla (Mo Beta Antioxidant) in the bong can notably lessen the irritation of taking a hit, so I can take a slightly bigger hit.  Even orange juice helps a little.</p><p>The only thing I find cannabis to go well with is opium, and only then a little opium (opium by itself is kinda boring).  This MJ+Op combo is particularly intense sexually (delays and extends the big O).  I just don't do anything that requires fine motor coodination ;).  </p><p>Cannabis is a great, mind-opening substance that is great as long as I respect it and have the self control not to use it every day.</p>"
}
