{
 "title": "Strapped in Some Strange Machine",
 "author": "The Drummer",
 "citation": "   The Drummer. \"Strapped in Some Strange Machine: experience with Salvia divinorum (Oaxacan) (ID 18218)\". Erowid.org. Oct 17, 2002. erowid.org/exp/18218",
 "substance": "Salvia divinorum (Oaxacan)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18218",
   "Male",
   " ",
   "Not Given",
   "Oct 17, 2002",
   "Views: 7078",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSitting in a big high-backed upholstered chair in a dark room.  Have five previous break-through experiences with this plant.  Took 1/2 gram of Oaxacan Salvia Divinorum in one lungful out of a large glass pipe.  Held it in for probably twenty seconds before exhaling.  Closed my eyes.</p><p>Everything's black except for something grey in front of me, which starts to move and after a few seconds I can tell that it is some sort of windmill-like object, with about a dozen flat blades turning together.  It's composed out of the same material as everything in my surroundings which is some sort of featureless black void.  </p><p>I think 'What is that?' and it feels the same as it would have if I'd said it out loud.  As soon as I ask the question I feel myself being pushed forward but remaining in a seated position.  I glide forwards for a few seconds and then take a turn sharply to the right.  I look down and realize that I'm on some sort of a track that's being powered by the rotating blades I'd seen before.  I'm speeding up and I ask 'Who's doing this?' in the same sort of strange think-speech as before and immediately receive a response in the same non-verbal style, but it doesn't translate into language when I hear it.  All I get is the sense of an obviously feminine presence who is laughing LOUDLY into my head from just behind me.  I receive a strong mental image of a skinny black figure with long rubbery fingers and no facial features save two large round white eyes doing the pushing.</p><p>The track slows down and reverses direction.  The thing behind me is gone, presumably because I'm moving backwards now.  It goes like this for a while - forwards, backwards, left, right, sometimes going in one direction for a long while and sometimes changing direction pretty rapidly.  Then I started to get a physical sensation equivalent to being dragged facedown in loose gravel.  Very unpleasant.  I immediately identify the source of this discomfort which is a male presence who is similarly laughing at me.  He's dressed in some strange clothing but he's all squiggly black ink underneath just like the first one.  </p><p>I figured I had a pretty good idea what was going on at this point, so I put an end to it.  Brought the weird trolley to a stop by willfully manipulating and reducing my sensation of movement so as to slow down and then stop entirely (just seemed like the natural thing to do) and then made a fairly loud mental statement which had no words but I think attempted to convey the statement 'Get out of my territory, this is my house, you're not welcome, don't make me angry' and waited in silence for a few seconds while they slowly receded until I couldn't sense them in the room anymore.</p><p>Strange stuff.  No benevolent feelings at all from anything around or anything useful taken out of this experience - have a weird kind of feeling like I was waylaid while looking for a teacher by a couple of delinquent entities.  I did show them who was boss around here, though, which I'm sure I'll keep as a point of pride for a good long while to come.</p>"
}
