{
 "title": "History of E-Devotion",
 "author": "phot",
 "citation": "   phot. \"History of E-Devotion: experience with MDMA (ID 1824)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1824",
 "substance": "MDMA",
 "bodyweight": "150 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 1984",
   "ID: 1824",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2000",
   "Views: 3293",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I hope so too because here I go...</p><p>OK so here's my experience with doses of MDMA. I am a 150 lb male:</p><p>125mg is the best for interaction with others. Warm and cozy. Sometimes abit of anxiety on the comedown.</p><p>140mg OK for solo. I tend to drift in and out.Easy to loose the thread of concious thought. Tendincy to be empethitic with the suffering of the human race through out all time. Now that is a *deep dark space* with no end. A downer for sure, but can be valuable to know non the less.</p><p>160mg Very spacey! Drifting into dream space reaching for phantom objects that apear before me. Vast volumes of printed material scolling by, content hard to keep as I read it . Faces floating in the air. Main problem: *Hard* comedown with anxiety verging on paranoia.</p><p>180mg Confusion with the feeling something is about to or has already gone very wrong!  Coming down into more coherent anxiety and paranoia. I did not find much I wanted in that place.</p><p>I usually allowed at least 2 weeks between sessions. Most people I know that claimed to like doses of 200mg or more dosed every day or every other day and seemed to build a tolerance.</p><p>I was quite devoted to E in those days and turned on many friends. The fact the it was not illegal made for an opening to some otherwise straight people. And I think it did some good for them. Unlike most of the plant teachers favored on this list, MDMA is really dangerous at too high a dose. Its valuable to talk about. I don't want to see anyone dying for lack of knowledge!</p><p>\n"
}
