{
 "title": "Pulled Back From the Abyss",
 "author": "Duncanash",
 "citation": "   Duncanash. \"Pulled Back From the Abyss: experience with Salvia divinorum (5x extract) (ID 18249)\". Erowid.org. Oct 17, 2002. erowid.org/exp/18249",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "251 lb",
 "header": [
  [
   "DOSE:",
   "0.4 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18249",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 17, 2002",
   "Views: 7320",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWOW!!</p><p>  My first experience with Salvia, and what an experience.  I had read a great deal of information about the 'Lady', and felt I might be ready to give her a try.  Let me also say, that while I am not as experienced as some that I know, I have tried several psychedelics including LSD and mushrooms more then a few times.  I am also known to have an extremely strong will and have never been out of control.  </p><p>I had ordered some 5x Salvia over the web, and was quite excited when it arrived.  I had smoked a little weed several hours earlier, but unlike the normal relaxed feeling that I get from 'Mary Jane', I found myself feeling wound up and a little nervous.  The setting was around 8:00pm in my house, with my wife and two other friends as sitters.  I took a quick shower to help relax, but still found myself a little tense.  I turned the lights down, lit several candles (in retrospect, not a good idea if you do not have a sitter), turned some relaxing music on and let everyone know I was about to smoke.  I packed my water bong, took a deep hit and held it for about 30 seconds.  I immediately took a second large hit and held it in for another 30 seconds.  </p><p>Now, every other substance that I have taken has given me some sort of warning before the effects start to take hold.  NOT SALVIA!  I went from stone cold sober to really messed up in a matter of milliseconds.  I also was not expecting the extreme physical feelings that overtook my body.  I guess I had expected the experience to be more in my head.  I was wrong.  The entire room (and me with it) begin to rotate counter-clockwise, and my vision slanted with it.  My body felt pulled and quite uncomfortable, sort of like my insides were being pulled along, but the shell of my body did not want to follow. I was aware that I has smoked Salvia, but felt a little embarrassed in front of my friends and did not want them to know how strongly it was affecting me.  My sense of ego did not want to let go.  I managed to get out a few coherent words to them that I was fine (not true) and they decided to walk back home, leaving me with my wife.  I felt relieved when they left.  </p><p>I found myself leaning to the right to fight the strong pull that wanted to spin me downward and to the left out of control.  CONTROL, that is what I wanted.  I found myself sweating profusely and fighting with all of my will to remain in control.  I felt that I was winning the 'battle', but my insides felt uncomfortable almost to the point of pain. I stood up and found myself to be a little dizzy but able to walk, although still leaning to the right to compensate for the pull.  Now here is the weirdest part to me.  All of the sudden I was really listening to the song playing softly on my stereo, but the words were different and they were speaking directly to me.  This is also the most unpleasant part of my journey.  While I cannot recall specifically what was said, I do remember that it was warning me that I was about to go somewhere that was very unpleasant.  I felt it was said with a leering attitude and wanted me to continue my journey so it could enjoy my discomfort.  I exerted my force of will as strongly as I can ever reember, and the pull left my body.  I still felt a little wobbly on my feet, but knew I was now in total control.  However, I felt mildly bruised on the inside, and continue to feel agitated for another 5 minutes.  </p><p>The entire trip only lasted about 15 minute from first hit until the agitated feeling left my body.  I immediately told my wife that this was an incredibly strong substance and I would not be taking it again.  However, several hours later I had changed my mind.  I will experiment with Salvia again when I feel the time is right.  </p><p>In conclusion, this was a very intense experience.  I think that had I been more relaxed and let myself experience the trip without resisting it would have been mind-blowing.  I am very interested in what our conscience minds do not perceive, and I am well versed in psychology and philosophy.  Be prepared and have a sitter.</p>"
}
