{
 "title": "Selection of Perfection",
 "author": "selektah",
 "citation": "   selektah. \"Selection of Perfection: experience with MDMA (Ecstasy) (ID 18251)\". Erowid.org. Oct 17, 2002. erowid.org/exp/18251",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 18251",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 17, 2002",
   "Views: 7573",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have been experimenting with MDMA and MDA for about 4 years. I consider myself to be fairly well-educated on MDMA, how it works, why it works, etc. I have recently began compiling technical data on the subject and was motivated to share the best time of my life ever.</p><p>The date was sometime in late October or early November of 2001. If you really need to know the exact date, look up when the Leonid meteor shower happened last. My friends and i decided to throw a party in the house that we live in at a Big 10 University in honor of the shower. It was the most planning I have ever done for a party in someone's house ever. We booked 3 DJs, 2 of which agreed to play for free. We set up what sound engineers would consider perfection in our sizable basement. We had equipment for the DJs, We flyered non-stop for a week. I personally visited about a quarter of all of the dorm rooms on campus. We (through some act of god) found a dealer to front us about 75 pills. I include this information for a very important reason. On of the biggest reasons I rolled so hard that night was because all of the hard work that we had done paid off a hundred-fold, making the positive energy level go through the roof.</p><p>We charged $5 dollars at the door. I know this sounds shady when you consider that we only provided water and candy. My friend aptly refers to our success as 'The biggest fuck-job ever.' To the best of my knowledge, no alcohol was present in our house that night. Tension was running high at the beginning of the night (10p) because of all the money and energy that had been invested in 'our baby,' and things were starting off slow. People came and went for the first few hours as they realized that this was the closest thing to a rave they had ever seen, and most freshmen didn't want to be a part of it. Around 11:30 i started selling pills downstairs. We were making amazing cash at the door, and i wasn't doing too bad myself. The first DJ was good, the 2nd was so good i thought a Tiesto mix tape was playing for a while. By 12:30, the dealer was paid off in full. People who would later become sober monitors were compensated for their help, and by 2:15, my friends and i were rolling for free on two pills each.</p><p>Everything was going so well i did not have a single care in the world. Around 3am, my friend and i experimented with meditation and transfer, and our minds were blown. I began to really get a sense that the sum of the parts is greater that the whole, and i have believed that ever since. Once you find people that you work well with, stick with them. Together, there is nothing that you can not accomplish.</p><p>Guests were having a great time dancing to phenomenal DJs downstairs, people were all over our couches and chairs with stupid grins on their faces. Anywhere that darkness could be found was sea of glowsticks and mist of Vick's Vapo-Rub. If you have never used Vick's i can not recommend it enough.</p><p>4am was the scheduled time we were going to head to the top of a local parking garage to watch the shower, but when i went outside, thick clouds had almost instantly covered a previously clear sky. Everyone was back inside. People who weren't rolling left. Our house was filled with about 50 people, most of them strangers to me, and all of them were rolling. People that I have known to each other since the dawn of time were spilling their guts while giving each other back rubs. Just being around so much positive energy was the most healing experience of my entire life.</p><p>We didn't really stop partying until about 7am, and even then we needed to smoke a little to get to sleep.</p><p>I will never forget that night. I have since been made familiar with the term 'Chasing the Dragon' and i have never understood it more than now. Everytime i have rolled since then, about 7 times, i have compared to that night, and the sad truth is i dont think anything will ever compare. But I will never forget how my friends and I, against all odds threw a hugely successful party in honor of something that never even happened, and it didn't faze us a bit.</p><p>one more thing.........</p><p>THERE IS A LOSS OF MAGIC</p><p>WHEN IT HITS YOU - MOVE ON WITH YOUR LIFE AND REMEMBER AND RESPECT THE AMAZING TIMES THAT YOU HAD</p>"
}
