{
 "title": "Tips for Withdrawing",
 "author": "Graham",
 "citation": "   Graham. \"Tips for Withdrawing: experience with 1,4-Butanediol (ID 18264)\". Erowid.org. Jan 20, 2004. erowid.org/exp/18264",
 "substance": "1,4-Butanediol",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "1,4-Butanediol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18264",
   "Male",
   " ",
   "Not Given",
   "Jan 20, 2004",
   "Views: 13085",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nBDO use had escalated to 1.5-2.0ml every 3 hours during an illness for about 2 weeks - using excessive amounts before that too. Decided to quit cold turkey  - not a pleasant experience. Found the following useful:</p><p>1. Valerian and scullcap (aka skullcap)in herbal remedies for insomnia. Tried 2-3 times recommended dose as needed. Don't get too carried away as valerian can cause restlessness in huge doses. Valerian acts on the GABA system as does GHB and valium. Scullcap is a good antispasmodic and helps reduce the twitching and muscle spasms.</p><p>2. Beta blocker - propranolol - prescription only, tell your doctor you are getting a racing pulse from stress, don't want to use tranquilizers but have heard that beta blockers can help. They slow down the racing heart that GHB withdrawal precipitates. Highly recommended.</p><p>3. Melatonin helped the insomnia but not the first couple of nights.</p><p>4. Marijuana helped me with the dopamine surges (extreme alertness) making them a bit more bearable. Reminding myself that people pay for the sort of stimulation I was getting for free helped too.</p><p>5. Listening to self-hypnosis tapes helped a lot, surprisingly, as a distraction.</p><p>I'm on day 4 since quitting and still snapping awake at 5 in the morning, but no cravings and feeling otherwise OK. First couple of days were pretty bad, no sleep for 48 hours or more. Never again will I become dependent on any substance.</p><p>Good luck!</p>"
}
