{
 "title": "Comparing Two Brands",
 "author": "curious george",
 "citation": "   curious george. \"Comparing Two Brands: experience with Absinthe (ID 18274)\". Erowid.org. Oct 18, 2002. erowid.org/exp/18274",
 "substance": "Absinthe",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3 glasses",
   "oral",
   "Absinthe"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18274",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Oct 18, 2002",
   "Views: 13545",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAs someone who had drank absinthe I spend a lot of time attempting to convince people that it's not a hallucinogen; most people aren't willing to believe the unpleasant truth, and insist i wasn't drinking real absinthe, but from what i gather i've had the best i could get short of finding vintage pernod. it's not hallucinogenic but it definitely intoxicates one differently than alcohol. Here i go:</p><p>I was always curious about absinthe, and spent a while looking around the internet for a company that would send it to america. I found a spanish company that would and ordered a bottle of deva 70% absinthe. not long after i contacted a swiss company and also purchased a bottle of bootleg absinthe (the swiss was 200$, the spanish 50$). I got them in the mail at the same time and sampled them.</p><p>Spanish - This was the first that i tried. I mixed it about 1 part absinthe to 3 parts ice water, drizzling the water over a cube of sugar. The louche was quite amazing to see for the first time, and then, with great anticipation, i drank. I sipped the glass slowly while reading a collection of kurt vonnegut short stories (the idea of watching TV while drinking absinthe seemed classless in some way). I wasn't sure if i was feeling absinthe or if i was having a psychosomatic experience, but i seemed to feel lighter and clearer. The best comparison i can think of is when i quit smoking cigarettes. after an initial period of hell i began to feel energetic, healthy, light, and clear headed, much more alive. But like i say, the effects weren't that pronounced.</p><p>Swiss - this time i was sure it was the absinthe. it was said to have a higer thujone content, and i believe this to be true. soon after finishing half of a glass i felt almost speedy, though very clean, not jittering or unsettled at all. I wanted to talk above all else, but not in the sort of verbal diarhea way I've gotten from speed and coke. it reminded me in many ways of the first few times i drank, when my body would seem to feel the alcohol before my brain. I was loose and social but i didn't feel drunk.</p><p>Since then ive experimented with the two kinds of absinthe over and over and have come to a few conclusions.</p><p>1. the Swiss brand was definitely definitely stronger. (the other was good too, i just needed to drink more, and it's not as tasty. the Swiss brand is delicious).</p><p>2. after drinking half the Swiss brand bottle in one night, i determined that it was not by any means hallucinagenic, at least no more than any other alcohol. It gives very little of a hangover, though.</p><p>3. it combines wonderfully with marijuana. if you want to see the world through a absinthe-Van Gogh filter drink up and get stoned. The pot makes the effects more vibrant and adds a visual element. </p><p>4. Don't drink it if your belly is really full, you'll just dillute the very expensive effects.</p><p>5. this is merely a personal taste observation, but i think absinthe is best drank on the rocks mixed 1 part absinthe to 4 parts water, in company. it's a great after dinner drink, but heed #4 and don't overeat.</p><p>And please, don't put wormwood extract in vodka. i've tried it, and it's about as much like drinking absinthe as taking ten shots and smoking a cigarette is like smoking a joint. it sure won't impress anybody...</p>"
}
