{
 "title": "Soma Journeys",
 "author": "Hunter&Me",
 "citation": "   Hunter&Me. \"Soma Journeys: experience with Carisoprodol (Soma) (ID 18335)\". Erowid.org. Jan 28, 2003. erowid.org/exp/18335",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "Pharms - Carisoprodol"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18335",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 28, 2003",
   "Views: 59713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'd never done Soma before a couple nights ago, id heard a bit about them seeing as how a majority of my close friends have done them so i felt prepared when i did them. </p><p>I was given 3 white tablets with a strange design imprinted onto the top of each. I was told they were purchaced legaly in mexico. The mg amount of each pill is unknown, I didnt ask. Rather, I sought to see if it would hit me as hard as the 1 1/2 valium id taken recently. I have experienced several drugs (marijuana, lsd, psylocybin mushrooms, cocaine and the pills; valium, methadone & hydrocodone and codine.</p><p>Smoking a blunt of rather potent B.C.-like bud about 30 minutes after the ingestion of the soma seemed to bring it all on at once. A great sensation of feeling drunk but without the stomach nausea and head crazyness. We decided to walk up a hiking trail into a canyon that was 1.5 miles long. The walk was incredible. I remember little more than the intensly lit sky from the sunset that was occuring and the conversation between my friend hunter and I. We talked about appreciation of natural beauty and so forth (very nice indeed because there are few people i know who i can really talk to about such thing in life.) Just a feeling of really being FUCKED UP but always having a drive o make it quickly to the end of the trail. Walking was great at this point.</p><p>We arrived at the end of the trail and sat on a rock and i just felt every muscle in my lower body relax and unwind seemingly. I experienced the so called 'soma shuffle' at this point joyly circling and circling in place. The walk back was wonderfull, very rewarding (albeit dark now and in the remote desert) all downhill to the trailhead, very nice. The moon had risin out of the east, the direction we were going back, and it seemed so vibrant, even thought i could feel the effects wearing thin. </p><p>All in all a great first time with somas. Definately something i'd do agian but also could get hooked on as well, so be i'd carefull.</p>"
}
