{
 "title": "Sick to my Stomach",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Sick to my Stomach: experience with Ephedrine (Ma Huang extract) & Cannabis (ID 18342)\". Erowid.org. May 14, 2003. erowid.org/exp/18342",
 "substance": "Ephedrine (Ma Huang extract) & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Ephedrine",
   "(daily)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18342",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 14, 2003",
   "Views: 26141",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I began taking an Ephedrine based product to help me with strength and muscle endurance while rock climbing.  I noticed that the substance did give me added endurance and a general overall feeling of excitement throughout the night after each workout (it is a stimulant after all).  </p><p>I was taking the substance for about a month when out of nowhere one night, after smoking a few big bong rips I felt extremely uneasy.  The feeling was of extreme disattachment from my body, but I could think in an extremely lucid manner.  I also felt really really sick to my stomach.  (I should point out here that I was a daily smoker all summer long and into the fall without any problems whatsoever.)  So, after this nauseated feeling came onto me, I returned to my room, and lay on my bed, eventually, I went to the bathroom and threw up a few times.  </p><p>After I took a day or so to recouperate, I smoked again.  At this point, I hadn't taken the Ephedrine for about 48 hours.  It was a good high with minimal problems.  After a few days, I began to take the Ephedrine again, and once again, when I smoked, I threw up.  I also took the Ephedrine one day and didn't smoke, and felt somewhat sick to my stomach as I worked out, but didn't acutally throw up.  It took me about a week of nausea to realize that it was the Ephedrine that was making me sick. </p><p>I talked to my doctor and he informed me that Ephedrine rips away at the lining of one's stomach, causing a nauseated feeling.  He told me to take some antacid until the feeling went away, then maybe I could try taking the Ephedrine with the antacid.  I discovered eventually that I was taking more than twice the healthy daily dose of Ephedrine that I should have been.  I am 19 and only 5'5'.  I'm a pretty small guy and I realized that continuing the use of Ephedrine was probably a really bad idea.  My theory is that the substance built up in my system over the month I was taking it, causing my stomach lining to deteriorate.  In combination with the weed, I threw up because, generally, weed increases physical and emotional feelings.  It was obvious that the weed was increasing my feeling of nausea each time I smoked while I had the Ephedrine in my system.  </p><p>It has been about two weeks since I took any Ephedrine and towards the end of the first week, I could smoke almost normally without any problems.  That weekend, however, I ate a huge italian meal that my mom cooked with plenty of tomatoes and wine, which I think momentarily weakened my stomach.  I had also stopeed taking the antacid.  That weekend I had trouble smoking again, I assume because the lining of my stomach still was not back to normal.  </p><p>My advice: DO NOT TAKE COMMERCIAL EPHEDRINE.  I talked to a friend of mine and he had the same exact problem I was having with nausea.  I don't think I'll ever take commercial workout supplements again.  I like smoking a whole lot more than I liked the Ephedrine, so I discontinued its use.  If someone is planning on taking any sort of supplement, I would advise them to take an herbal one, such as extract of Ma Huang, which will be much easier to control and much more gentle and natural on their system.  Also, read up on anything you're going to take first, don't be an idiot like me and spend two weeks not being able to party because of it.</p>"
}
