{
 "title": "Careful With MAOI's...",
 "author": "Azmodeus",
 "citation": "   Azmodeus. \"Careful With MAOI's...: experience with Syrian Rue & Mushrooms (P. cubensis-Ecuadorian) (ID 18351)\". Erowid.org. Oct 22, 2002. erowid.org/exp/18351",
 "substance": "Syrian Rue & Mushrooms (P. cubensis-Ecuadorian)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Syrian Rue",
   "(seeds)",
   " ",
   "1.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18351",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 22, 2002",
   "Views: 17967",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is to report a strange and scary 'sensation?', that i and my girlfriend experienced on our first major syrian rue experiment.</p><p>We had been trippin for a good 3 hours or so, having not eaten 12 hours before and only lightly the previous day.  Obeyed all the food restrictions, but the trip had a very low feel.  I got up to get us water and was up for about a minute when, bringing the water back, my vision slowly filled with black from the bottom up and i suddenly felt very dizzy.  I quickly put the water down and said to Kc (my girl) that i was very dizzy and quickly sat down.</p><p>Just as i sat down i had a strange pulling feeling almost like a HUGE!!! headrush, but what happened next is what is really startling.  As the headrush increased my mind fragmented into complete and utter confusion?, panic?, negativity? I though holy shit it's happening, what? im not sure but something bad. I then visualized infinity and with deep calming breaths brought my mind back before I was completely lost.</p><p>An hour or so later my girl got up to take a pee and i heard a loud crash in the bathroom, I ran in to see kc on the floor with the towel hanger ripped off, and she was lying in the corner with a look of confusion equal to what i had felt and i knew it was happening to her too!  I went to talk to her and she wasn't responding, she then started to twitch a little (looked almost like a seizure?) and I immediately held her and whispered things like 'it's ok im right here' 'it's not really happening' 'concentrate on my voice' and in a couple of seconds recognition dawned on her face but it took a while for her to recover but after a while we went back to the couch.</p><p>One thing i forgot to mention is that we both vomited about 5min after the experience.  So in conclusion I would say it was almost what a seizure would be like although both me and kc have never had seizures and there's no record of them in our families, so i can't say for sure.  But what i learned from the whole experience is: MAOs OR WHATEVER THEY ARE, ARE THERE FOR A REASON SO UNLESS PREPARING AN AYAHUASCA BREW DONT USE SYRIAN RUE TO ENHANCE SUBSTANSES LIKE MUSHROOMS....JUST EAT MORE MUSHROOMS!</p><p>Syrian rue really ruined the whole experience with what felt like a chemically induced depression....maybe from harmaline? But after the mind fuck incident i went inside and came out with a sense of enlightenment that brought a inner calm to counterbalance the confusion of the whole trip.</p>"
}
