{
 "title": "Kappa Opioid Activity? Similarity to Enadoline",
 "author": "37H4N",
 "citation": "   37H4N. \"Kappa Opioid Activity? Similarity to Enadoline: experience with Salvia divinorum (ID 18350)\". Erowid.org. Oct 22, 2002. erowid.org/exp/18350",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2002",
   "ID: 18350",
   "Male",
   " ",
   "Not Given",
   "Oct 22, 2002",
   "Views: 7904",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThis is not a personal report, but an interesting observation I made.</p><p>In your recent announcement about Salvinorin A's Kappa Opioid activity (http://www.erowid.org/plants/salvia/salvia_info5.shtml) you linked to a paper by Walsh which investigated the pharmacodynamic effects of Enadoline, a selective kappa opioid agonist (like Salvinorin A). [full text of the article]</p><p>Only two of the nine test subjects received doses high enough to be labelled psychotomimetic.  One of the reports of this dosing, for a 'Participant no. 6' reads very much like my personal experiences, and published reports, of Salvia:\r\rParticipant no. 6</p><p>This volunteer received enadoline 160 µg during his ninth session; he had already been exposed to all of the other doses of enadoline up to 80 µg/70 kg. Within 10 min after receiving the injection, he reported unusual sensations, including the floor moving and his skin prickling. He became agitated, began swearing, mistrusting others, and accused staff of seeking to harm him. He removed the physiological monitoring leads and left the session area with staff accompanying. His gait was noted to be swaggering and unsteady. Within 2 h, the effect had resolved. Afterward, the subject reported that he had seen and felt waves, for example, as a part of the floor. He had felt that his body was blending with these waves. He reported he had felt others were conspiring against him in a desire to ruin his mind. That evening he was cooperative and pleasant; recalled the earlier events and expressed embarrassment and remorse for his aggressive behavior and foul language.\n(from Enadoline, a selective kappa opioid agonist: comparison with butorphanol and hydromorphone in humans, Walsh SL, Strain EC, Abreu ME, Bigelow GE Psychopharmacology (Berl), 2001; 157(2):151-62.) [full text of the article] </p><p>This is all very fascinating.  I hope to hear more about Salvinorin A research in the near future!</p><p>-e</p>"
}
