{
 "title": "A Few Notes",
 "author": "NutJockey",
 "citation": "   NutJockey. \"A Few Notes: experience with Betel Nut (ID 18372)\". Erowid.org. Oct 22, 2002. erowid.org/exp/18372",
 "substance": "Betel Nut",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Betel Nut"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18372",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 22, 2002",
   "Views: 19488",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Due to a general lack of info on the 'net I've decided to submit my few pence worth as a regular user of these friendly little nuts known as Betel Nuts:</p><p>The nut itself is the fruit of the Betel palm (Areca Catechu), and comes fresh from the tree in a fibrous husk, which must be stripped off (ideally) before consumption. The nut inside, when fresh is quite soft and chewable (although it causes a real jawache doing this), and hardens as it dessicates (it finally turns brittle and powdery once completely deteriorated). The nut is also hard and fibrous, with a marble pattern running throughout the entire kernel. The surface texture is normally a light to dark brown and smooth, with a slightly mottled texture.</p><p>The effects of betel nut are comparable to a medium dose of ephedrine / ephedra in my opinion, but without the prevalent stomach tension I normally get. It has a nootropic effect, that is, it promotes a more acute memory, and a more perceptive frame of mind. I find that I can work more methodically and efficiently under its influence, as well as having a lot more energy and vitality. Users tend to generate a copious amount of saliva as well, especially if mineral lime has been added to the preparation. I've found myself drooling huge puddles of deep red saliva everywhere and I have to admit it's quite entertaining. It also constricts the user's pupils considerably.</p><p>I find the effects last between three and five hours, and begin to taper very subtly: It's hard to notice that the effects have diminished.</p><p>There are several betel nut preparations available commercially, these being pan masala, gutkha and betel mukwas.</p><p>Pan masala and gutkha is the most prolific of these products. The preparation normally consists of betel nut chunks dusted with lime and spices, and normally flavoured strongly with menthol (gutkha also contains flavoured tobacco, and is at present being banned by the authorities in India after a multitude of oral carcinomas being presented to Indian doctors). The products are normally used as a 'freshener' after meals, but as with any other habit this tendency has spread to use throughout the day. The participants will normally stuff a few of these 'nuggets' between the cheek and gum and allow the essence to infuse into their saliva. The saliva and the quid are expectorated, rather than swallowed (swallowing normally leads to nausea or heartburn, especially if lime is added).</p><p>Betel mukwas are normally aniseed flavoured sweets presented in bowls as an after dinner sweet in many indian restaurants. Although the taste is quite strong, it's also pretty sweet, and generally too much so for many people's liking.</p><p>Whole or chopped betel nuts can also be prepared as a quid, wrapped in the leaf of a betel pepper (piper betel). The leaves are supposed to have a mild stimulant effect in addition to the betel's stimulation. The nut, before being wrapped in the leaf may have spices, tobacco and lime added.</p><p>Now the bad news: Firstly, and most obviously, if betel nuts are overused, they can cause agitation, heart palpitations, insomnia and most of the other side effects of stimulant abuse.</p><p>Secondly, there's been an increasing correlation between Pan Masala / Betel use and oral carcinomas (mouth cancer). There have been cases in which the inner lining of the mouth (the cheek) of many habitual and long-term users has hardened, preventing these people from opening their mouths properly. It's not inevitable that it'll happen to all users, but there's a simple preventative step: MODERATION. Don't overdo it and you'll find that, rather than craving the drug, you'll learn to enjoy the sensations derived.</p><p>Peace</p>"
}
