{
 "title": "Lesson Learned",
 "author": "Steppenwolf",
 "citation": "   Steppenwolf. \"Lesson Learned: experience with Cacti (T. peruvianus) (ID 18374)\". Erowid.org. Oct 23, 2002. erowid.org/exp/18374",
 "substance": "Cacti (T. peruvianus)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 g",
   "oral",
   "Harmala Alkaloids",
   "(capsule)",
   "  T+ 0:30",
   "27.5 g",
   "oral",
   "Cacti - T. peruvianus",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18374",
   "Male",
   " ",
   "Not Given",
   "Oct 23, 2002",
   "Views: 31574",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHere is my experience with the Peruvian Torch Cactus:</p><p>I purchased thirty grams of torch cactus from the internet.  Following the recommendation of a veteran torch cactus user from experience vault of Erowid, I grind up the dried cactus and fill roughly 80 gel caps.  I set a weekend aside and decide to trip and camp at a local state park.  However, when I get there, there are no more camps sites available.  Since I have done Peyote and San Pedro with minimal effects, I decide to continue with the experiment even though I have concerns over how I will get home should the trip hit hard. </p><p>I take one capsule of harmala (1/2 gram) on an empty stomach.  About a half hour later, I find a secluded place to ingest the cactus.  I consume approximately 70 of the pills.  Nausea starts to kick in.   I curl into fetal positions salivating and spitting, suppressing the volcano inside of me, reinforcing to myself 'This is my medicine.'  As the nausea lightens, I sit up and go into a meditative position knowing that there is nothing in the cactus that can hurt me.  About an hour and a half latter, I feel well enough to stroll around, enjoy the outdoors, and take a swim in the river.  I feel the breeze hit my spine in a way that tells me the drug is coming on.  </p><p>I walk up towards the parking lot and go into the bathroom.  I look in the mirror and there is no question about it, I am tripping.  My face is distorted, strange colors are coming into view, and the wa wa wa feeling is all about me.  I start to walk towards my car and the nausea kicks back in.  I go into the bushes and vomit.  It was very painless and seems as natural as coughing.  I hop in my car and drive to the beach area.  Driving is not difficult and I take my time.  At the beach, the river is beautiful. I go in the water.  I let the current carry me as dragonflies hover on the waters surface and I am happy.  I get out and lie in the sun and listen to my discman. Then I get up and run.  My body feels slender and healthy, I feel like a child.  Time starts to pass and I know I should get going.  </p><p>I go back to the parking lot and get into my car.  I start driving the forty miles back to my apartment.  It has been over five hours and believe the cactus should be wearing off, but do not recall having a peak.  I tell myself, 'Maybe you don't peak on mescaline', but I know this is naive.  As I start driving, I am having more and more trouble understanding the roads and where I am.  It was like 'boom!' and I would not know what street I was on or if I was lost.  Other traffic starts to jump at me and jump away.  Everything is flashing, and it is frightening.  I realize the flashing is related to my eyes blinking and I feel the panorama view of my vision, even though my eyelids are over them.  I pull over near a hotel and debate about getting a room.  I speak to someone they tell me I'm five mile from my home.  I believe I can make. </p><p>I get back on the road.  I feel like I am losing it.  My entire body is shaking.  I am screaming out, 'God help me.'  I am suppressing the peak and it is so I hard.  I know if I go over the top bad things will happen.  It is like holding back a roller coaster at the top of its largest hill.  Finally, I get to my apartment.  I explode with tears, wailing out as I collapse onto my bed.  I lose sense of time and space.  There is nothing now except knowledge of my existence.  I eventually calm down.  Make some phone calls and bike around town.  I stay up most of the night and feel the drug eventually dissipate after about three days.</p><p>This drug hit way harder than anything I expected. I want to apologize to everybody out there because it might as well have been you or your family that was on the road with me that day.  I still get shaken up knowing that I could have destroyed my life or worse yet, the life of someone else.  I beg everybody to take these drugs seriously and plan ahead.  Needless to say, I will never take a chance like this again.  </p><p>As a side note, I have used psychedelic drugs for several years now. For those who are inexperienced with drugs, I recommend the using naturally occurring substances such as shrooms or cactus.  I would never do E because you never know what your really getting and even if you were getting pure MDMA there are still questions about its use effects on the brain.  I have used LSD over a dozen times and I have had my fill. In actuality, I am really afraid if I used acid again they would have to come get me with the butterfly nets.  But whatever, good tripping everybody.  Peace:)</p>"
}
