{
 "title": "Fantastic Experience With a Catch",
 "author": "SickGirl",
 "citation": "   SickGirl. \"Fantastic Experience With a Catch: experience with Heroin (ID 18403)\". Erowid.org. Jul 21, 2005. erowid.org/exp/18403",
 "substance": "Heroin",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18403",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2005",
   "Views: 113336",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis summer I finally did heroin. Ever since I saw Trainspotting, I wanted to do heroin. I'm not a heavy drug user - I'm a pot smoker, but apart from that, I had only done hash a couple of times, opium twice and ecstasy once. But when the opportunity presented itself, I quickly took advantage of it. <br>The guy I did heroin with was recently out of rehab but wanted to do it once 'for old time's sake'. We agreed that he'd get the gear and come back to my apartment. He showed up with everything necessary including two needles. He suggested that I either smoke or snort it, but I insisted that if I was going to do heroin, I was going to do it right - intraveneously. I've never had a problem with needles. At approximately 9 PM, standing at the table in my kitchen while he was sitting, I rolled up my sleeve, squeezed my bicep and allowed him to insert the needle. I had requested a smaller dose than his, figuring that a former addict would probably have a much higher tolerance. As it was, the instant the heroin hit my bloodstream, I felt my knees buckling, and was filled with the most intensely relaxing physical feeling of my life. At the same time, my heart was racing, and I could barely see. I managed to sit down, realizing that I was on the brink of just phasing out. After a few seconds, I forced myself back up and managed somehow to put some music on, after which I collapsed on the couch. My friend was seemingly much less affected, although after a short while he went to the bathroom to retch.<br>In the entire experience on my part, the most frightening moment occurred shortly thereafter when I realized that I wasn't breathing and had to concentrate on breathing. At the same time it felt great, and there was nothing strange in that. The other side-effects were that I couldn't swallow at all, and although I tried drinking water, I couldn't get any down for a while, and I was also itching profusely at some point. I threw up two or three times, but unlike normal throwing up, it felt good. The high lasted for several hours, although the intensity diminished after the first hour, and I was more able to walk and swallow. My main sentiment was that there were negative side-effects, but while I was on heroin they felt great and didn't bother me at all. One important thing is that nerves are dulled, since heroin is an opiate, and opiates are pain killers, and the scratching could even lead to drawing blood since senses are dulled. I kept watching myself to make sure I didn't scratch too long or too hard.<br>The more scary part of the evening came later on, when I was becoming slightly less affected. The guy I was with had shot up twice more, and I noticed that he was lying on the floor of my living room in a ball, taking quick, shallow breaths, unconscious. In my altered state of mind, I thought only of my safety and of the risk of calling the cops, especially since I wasn't even able to pick up a telephone. I ended up leaving him on the floor and going to bed, and thankfully he was all right the next day. But it did provide a sobering warning as to the potential risks of heroin that helped make my experience slightly less wonderful and helped discourage me from doing it again. <br>I was wracked with guilt as to what might have happened through my negligence in that altered state - heroin made me care about nothing but me and heroin and that is where the psychologically addictive part, at least for me, would lie.<br>Since then, I have not done heroin. I have smoked weed a couple of times, and done shrooms once, but for the most part have stopped doing drugs. It is hard to beat the relaxing feeling of heroin, and for me, that was the one drug that I had always aspired to do. Having done it, I can now retire from the drug scene.\n\n\n"
}
