{
 "title": "I Will Meet Her One Day",
 "author": "Anonymous",
 "citation": "   Anonymous. \"I Will Meet Her One Day: experience with Salvia divinorum (ID 18436)\". Erowid.org. Aug 3, 2005. erowid.org/exp/18436",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2002",
   "18436",
   "Male",
   " ",
   "Not Given",
   "Aug 3, 2005",
   "3834",
   " "
  ]
 ],
 "report": "<p>I tried her again last night. I can sum it up in 2 words. </p><p>Holy shit. </p><p>My experience before last night was very cool. I had done it only once, but it was amazing. I went with a friend and smoked a total of two bowls before the full effect hit me. I inhaled, held, closed my eyes and leaned back. 'Shit, this stuff doesn't work,' were my first thoughts, then I was suddenly on a beach. I reached for some sand, and while it slipped out of my grip, the single grains turned to stars and then somehow I was morphed into the beach, feeling the grains of sand and the cool, damp feeling of sand that is deep beneath the surface. I faded back, and felt nothing more. It was a great experience. </p><p>The day began as a normal day. School, lunch, school. When I finally did complete my daily journey I got home and started fucking around on my computer because I was bored and had nothing else to do. My friend M calls me up a little later and tells me that the package arrived. Sweet! I've only been waiting a week and a half with a curious desire to try her again. My friend and I went to go buy a bong for this experience, and found a cool glass one with a dragon on the front that I like to think of as 'Puff: The Magic Dragon.' </p><p>We drove out by the canal and decided to try it out. I went first, and after I inhaled the first bowl I felt extremely high. I passed it over to M after I was done and he took a bowl down. He didn't feel shit. Passed back over to me, I took another deeply in and tried to hold it. The second hit didn't feel any different then the first. I passed it back to M and he took another bowl down. He still didn't feel anything. I tried taking another bowl down, inhaled, and felt extremely weird with a body high I had never felt before. M took it and took another bowl and said he felt like he was high. Cool. Pretty good stuff for a legal high. We drove back home after the effects wore off and I waited till later that night to try it for a third time. </p><p>After I had taken my shower and my parents had gone to bed, I prepared for my journey. Had the bong washed and cleaned thoroughly, prepped the tin foil to keep the salvia in the bong, and decided to take another go at it. </p><p>The first bowl is always the hardest. I took it down, and almost immediately started coughing up my lungs. I felt totally high, like I had 6 beers that night in a 30 minute time period. Loaded the bowl again and took it in deeply. Held it for about 8 seconds, and started coughing up again. Suddenly I was up on my ceiling, watching my body on the ground. I watched as I saw myself load a third bowl, take it down, but I didn't feel the smoke and was able to somehow hold it in for a good 15 seconds then slowly let it out. My body became frantic and began cleaning everything I had used. I washed the bong, put it away, put all the materials away and spray the whole room so no smell would be present, all within a 45 second time period. During that time I talked to myself about the weirdest stuff, like what dirt does and how it kills people. Dirt is mean. About 30 seconds later I felt a weird presence. I knew it was the Goddess Salvia, calling me, beckoning me to join her in a fantastic journey. I told her 'I will, but not this time, not this time.' She let off and told me that I would be great, that somehow I will change the face of Salvia forever. I am the one that she has been waiting for like in 'The Matrix.' She then told me she would show me a fantastic journey and to go lay in bed.  </p><p>I obeyed. I found a comfortable position on the pillow and closed my eyes. I saw gears spinning, out of control, in a 3-D environment. It looked a little bit like a computer game. The whole scene was made of tiny symbols, all alike and connected somehow. They were shaped like stretched diamonds. The pieces pulsated a lime green and a Barney purple color with my heartbeat.  </p><p>Suddenly I was talking to Carson Daley and I was somehow going to be a contestant on a game show for MTV. Ok, I agreed. The other contestant was a girl, which I would meet later on. </p><p>We walked on stage and I met her, a girl from one of my classes that I was totally in love with. Her name was Liz and I had fallen love with this girl when I first saw her the first day of school. I knew she had to be mine, but I'm too much of a shy guy to really talk to her. Anyways she was the other contestant and our task was to drive a little car around in some Atari game and get points and whoever had the most wins. Liz went first, and totally kicked the games ass. Points came up very easily to her. My turn was up, and I thought this would be a piece of cake. I was so far from right, the game was a total pain in the ass and I had to keep starting over and over and over, and I had no points. So my time was up and I put my name in the machine. I put in Romey, and I had a total of 3 points. Well it showed Liz's scores above mine, and her name was entered as 'Less' and she had 43 points. I wondered why she put in Less, but none the less she won and the competition was over. So after that we started talking and she told me she knew I was on a journey and that it was so cool that I had finally gotten past the typical life and found the alternate reality within us all. She told me that our mind is the biggest virtual reality simulator and that we can have anything happen within our mind. Then she asked me what I wanted my mind to do for me and I told her 'I want to wake up next to you.' She laughed and then said something like 'Then make it happen,' and I decided to. </p><p>Next thing I know is I am in a crazy ass place, with a totally comfortable bed and this beauty next to me. I realize that it's Liz and she begins crawling on top of me. I go along with it, and pretty soon were both naked having the best sex of our lives. I could taste her lips when I kissed her, I felt her warmth on my skin, I heard her moans and could tell she was loving it. We continued all night long, trying all different positions. No role playing though, Liz said 'that's for the next time you visit. But babe you have to go back now.' I told her I didn't want to, but she said everyone does eventually. </p><p>I woke up. It was bright in my room. SHIT I'M GONNA BE LATE FOR SCHOOL! I hurried and got ready and ran out the door.  </p><p>At lunch I tell my friend about my experience, but nothing close to this amount of detail. He thinks it's cool. We get Chinese food, and in my fortune cookie I get a fortune that reads: </p><p>Luck will visit you on the next new moon. </p><p>I can't wait. One day I will met the Goddess and she'll tell me everything, and then maybe I'll visit Liz again. </p><p>This experience gave me some courage and I talked to Liz today. It was weird feeling because I just had sex with her last night and I thought it was completely real. But it was about time, and I don't know what I was so worried about. Maybe I'll even ask her out on a date. :-)</p>"
}
