{
 "title": "The Magic of Japanese Temples & Shrooms",
 "author": "Takuan Soho",
 "citation": "   Takuan Soho. \"The Magic of Japanese Temples & Shrooms: experience with Cannabis and Mushrooms (tea) (ID 18449)\". Erowid.org. Oct 28, 2002. erowid.org/exp/18449",
 "substance": "Cannabis and Mushrooms (tea)",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms",
   "(tea)",
   " ",
   "  ",
   " ",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18449",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 28, 2002",
   "Views: 16188",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSo Zenlike:  the Bad Tryp is attained through wanting to have a Good Tryp, or, wanting anything at all, really.  One must give up.  A friend of mine insists that the Zen Koan, 'Fuck it' is the most useful thing.  </p><p>But I also like Japanese Temples and Shrines.  </p><p>I have been experimenting with cannabis (taima- 'the great hemp') and psilocybin here in Japan, and I have found the Temples and Shrines to be very instructive.  </p><p>They both have the same basic layout, and the parallels to Trypping I have found to be EXTREMELY handy in difficult situations.  (Including one large dose of something that was billed as peyote, but which fit the PCP trip reports far too closely.  I locked myself in my room, breathed, and sang like a Native American until whatever it was wore off.)  </p><p>First off, as you approach the temple grounds, you see two Guardians.  Sometimes these are the Nio-sama, the fierce warriors; sometimes the heavenly dogs.  Warriors or dogs:  one with mouth open, one with mouth closed.  </p><p>A picture is worth a thousand words, so much more a statue, but a simple meaning gives you Open Desire on one side, 'Give me food!' and Closed Fear on the other, 'Get that natto away from my mouth!'  </p><p>You want in?  Walk the Center Path to Wholiness.  </p><p>You want a Bad Tryp, keep banging your head against the Nio-sama of Desire.  That wooden fist hurts, doesn`t it?  </p><p>The Tryptamine Elves guard the Inner Sanctum jealously.  If you bet Fear or Desire, they will see you, and raise your bet with Insanity.  </p><p>But if you back off, and sincerely tell them that you are prepared to be Serious, you will be shown the Path in Between.  (This is also practice for doing the same thing in emotionally and intellectually trying spots when you are not trypping, as well;  giving rise to the institution of the Useful Flashback.)</p><p>So much for Centering along that axis.  </p><p>Often there is the outer court where you may purify with water, the outer hall, where offerings are presented, and the usually-sealed inner sanctum. This helps you center within the dosage thresholds.  Where am I? The outer court might be two mushrooms.  The outer hall, three or four.  And the inner sanctum?  Well that would be the Five Dried Grams.  </p><p>I noticed that Terence McKenna once said that he 'use[d] cannabis to navigate' on shrooms.  In characterizing this process, I feel the female cannabis flower to be maternal and the phallic shroom to be stern and fatherly.  </p><p>The father is stricter by the gram, wielding the Logos impartially, producing a knife's edge path at high doses between the kami of desire and the kami of fear.  </p><p>To introduce the maternal into the difficult situation is to comfort one, bringing in the Erotic principle Terence offered a lecture on, wherein unrelated things mix.  </p><p>I refer to smoking like this as Turning Up the Weird Dial, difficult in its own way, which is where the two sides intermingle, producing a state that I have found teaches one to be skeptical creatively, which is beautiful, and infinitely useful, as opposed to common nihilistic skepticism.  It piques the intellectual appetite, and descending out of the trip often leaves me with the dog of my curiosity straining at his leash.    </p><p>Skepticism is Key, because so often things are neither what I would hope for or fear.  They turn out to be some third option I could never have guessed.  The tension of waiting for that truth to appear just about kills me, but the mushroom and the flower have given me patience to hold out for it and the insight to know that it must be there, again and again.  </p><p>In closing, I hope this template proves useful to some people.  And remember that breathing evenly is indispensable to the centering process.  </p><p>Furthurmore, using these ideas, I have managed to handle the mushroom so that I could learn A LOT from it, and not be put off by its tendency to guard its Knowledge from frivolous inquiries.  </p><p>And anyway, aren`t the Fungus and the Flower so Wonderful?!  As inexperienced as I am, I hope this helps some people to appreciate them more.</p>"
}
