{
 "title": "God's Finest Creation",
 "author": "Twisty",
 "citation": "   Twisty. \"God's Finest Creation: experience with Mushrooms (ID 18442)\". Erowid.org. Jun 20, 2007. erowid.org/exp/18442",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18442",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 20, 2007",
   "Views: 2322",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n[Erowid Note: Unless you can either explore with a mycologist or knowledgeable and seasoned mushroom hunter, or take the time to learn the careful process of mushroom identification yourself through reading books and preferably joining a mycological society...we would strongly recommend not eating mushrooms you pick yourself. See Wild Mushroom Identification Warning]<br>I live in a small very small town. Pot is fairly easy to get a hold of its just finding other Psychoactives that is hard. When I was in school I could come by acid once in a blue moon, but once I got some that was poison I think, it just gave me a stoned feeling and it felt like my spine was being twisted apart, but know acid I just a myth in my area. It was being introduced to magic mushrooms that I am truly grateful for. I was waiting at a local supermarket for a friend to get back with a bag of some killer nugs when I ran into a friend that I owed some money to for some pot he fronted me (I wasnt trying to stiff him he's just hard to get a hold of). So I paid him his money and talked to him for a few. He asked me if I wanted to go out to this music fest with him, I told him I was waiting on some herb and thats when he whipped it out! The biggest bag of shrooms I have ever seen. <br>He told me I should have spent my money on that. Never having the opportunity to do shrooms before, I really wanted some and he told me that he would sell me a dose for $10. Needless to say I was all over that deal, he hooked me up with about 12 shrooms and told me that he picked them himself. I got sort of nervous when he told me this, but I had no doubt when I watched him down a handful, and indeed as he promised I tripped my balls of that night. I went to him after that to get them because they had become my favorite drug after just a few doses. <br>Out of all the acid I have done(and loved) shrooms had a certain effect that acid didnt, massive visuals for one. I never really caught that many visuals on acid. I recall one time lying on my back in someones yard watching this little star zip around my path of vision and it would explode then reform, and it felt like the visuals were just sitting on my face, but now I'm getting off track. I had been begging this dude to show me where to pick these for myself, and he never would, greedy bastard just wanted all my money. But on day he told me he was leaving for the army and would tell me where to find them. Its by a College. I live only like 35 mins from this college. Armed with this information we set out for this small college town it hunt for magic fungi. <br>We parked beside this wooded area, got out of the car and sure enough as soon as I walked into the woods I found a nice big cap, and we have been going there starting in may all the way up to mid July. Now I could write a book on all the mushroom trips I had but this one is truly the best. The first time we went down this season (of 2002) we just got enough for all of us to trip. So a friend and I head out get down there bright and early and get 2 very big bags. We divide the bags by the size of the caps, one bag with all the really big caps(1 1-2 to 2 inches around) and the other filled with smaller caps. We call a friend when we get back tell him of our score and tell him to come get us. The one friend and I evenly split the bag of really big caps(about 16 each) and eat a few handfuls of the smaller caps(about 16). Our friend arrives and we give him as much as he wants I think he only ate about 15 total compared to our 32. Then we set out for this old train tunnel. We ate them at about 5, for me the come up was pretty bad. Pressure kept building in my head, but after I started to trip I felt a lot better. <br>We get out to the train tunnel at dusk. As soon as I got out of the car my trip hit me 1000 times harder. I was surrounded by so much green plant life and I had an overwhelming feeling that I was going to die. After being reassured that I was going to live I took a short walk in the woods by myself while the other two sat by a peaceful littlestream (it actually was a perfect outdoor setting for a shroom trip). The only way I can describe the feeling I had being in those woods is MYSTICAL or very SPIRITUAL for some reason I want to say like an Indian. <br>After hugging a tree I returned to the group and we sat and explained what we were feeling. A part of what made the trip so good was that I felt like I was on the same level as the other two. My level of thinking had risen, I was no longer concerned with anything I had been 2 hours ago. We decided to make the trek down the very steep hill to the train tunnel before it got too dark. <br>As we get down to the tracks, I see the tunnel, which looks like its a mile down the tracks(in actuality its like 50 yards away). By the time he make it down to the tunnel it is completely dark, and pitch black in the tunnel. We enter I looked down at the end of the tunnel and saw just a little bit of light but the exit was bouncing all over the place I wasnt sure if we would be able to get out and visuals hit me like a ton of bricks. They were everywhere. Dripping from the ceiling on the wall I mean everywhere. It was just a kaleidoscope of every color. <br>We lit a lighter and the flame was cartoonish. We just kept walking through it and got to the other side and when we exited it my eyes couldnt adjust to it not being pitch black so all I could see were visuals, and I just felt the most intense trip ever. We pretty much spent the rest of our trip sitting in the tunnel observing the visuals. <br>As it got later and colder we walked back to the car, we knew the area we were in but were so very lost just walking through the black woods like zombies. We finally made it back to the car where there was still a half bag of shrooms that I start munching on until my one friend grabbed them and threw them out the window and told me I had enough. I after we split up for the night it felt like part of my trip had 'broken'. I caught some more intense visual thanks to the shrooms I ate in the car but it just wasnt the same without the other two.   As for the shrooms, I have no idea what kind they are or if they are just wild shrooms that just happen to make me trip and it sucks I have to eat so many of them but they are free and thats all I care about\n\n\n"
}
