{
 "title": "What Have I Done To Myself?",
 "author": "Sadie",
 "citation": "   Sadie. \"What Have I Done To Myself?: experience with Amphetamines ( Adderall),  Diphenhydramine & Zolpidem (Ambien) (ID 18450)\". Erowid.org. Mar 15, 2006. erowid.org/exp/18450",
 "substance": "Amphetamines ( Adderall),  Diphenhydramine & Zolpidem (Ambien)",
 "bodyweight": "142 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "Amphetamines",
   " ",
   "  T+ 4:00",
   "75 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 5:00",
   "25 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18450",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 15, 2006",
   "Views: 36273",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend and I had tried to go to a rave so at about 10:00 pm I took two adderals. I was tired and wanted to be pumped up for the nonexsisent rave. After we found out that the rave didn't exist we drove around town for awhile we went back home.  We stayed in her room until about 1:30 then went back to my apartment. Did some stuff on the computer and then I tried to go to bed but to no avail. So I thinks to myself 'I'll take a couple sleeping pills' not the prescription ones, just the over the counter stuff. </p><p>At that time (about 2:00) I took 3 sleep aids (25 mg each). I climbed back into bed. No sleep. None at all. So after about an hour and a half of laying there thinking of stupid things like 'what would happen if the apartment caught on fire.' </p><p>I decided to take another one. I think it was 3 in the morning by now. By this time I was feeling kinda weird. Like my skin had shrunk around my bones. Yeah, my skin was too small for my bones. I kept trying to stretch my skin out.  </p><p>Okay so I stayed in my bed trying to will myself to sleep for a while. No still no luck. So being the smart cookie I am. I take an Ambien. I get back in bed for a while. After about 20 minutes I had to pee so I got out of bed. I tried to get out bed. It was as if my muscles decided not to work anymore. I was totally wobbly and shit. Kinda scary. I had to grasp on to things to make it to the bathroom. I felt like I'd been on a boat for years and this was my first steps onto solid ground.</p><p>Then for so reason only God knows I decided that I need to go to the computer lab. Wow, that was a fun walk, not, it felt like it took tens years cause I kept having to grab on to things. I think I decided to look up 'ambien' 'adderal' and whatever the generic sleeping pills were to see if they possibly reacted badly w/ each other. </p><p>Hmmm, when I was walking back up the stairs to my apartment the stairs started to look all jiggly and wavy.  I was very disoriented. I got back into bed finally, and closed my eyes. I had snippets of dreams. They were more like hallucinations I think cause they were really vivid with bright colors and shit and I was totally convinced that they were happening. They only would last about a minute and then I'd wake up to a totally dark and grayish light that was in my room. in one I remember I was laying on my bed and two of my friends were also sitting there with me.  I remember talking to them and trying to reach out for them.  Then I came back to reality and saw that I was just grasping air.  no one was there.  But I still felt like it was real. I would look over at the wall and it would start rippling. It was slightly scary.  </p><p>I think I finally fell asleep at 6 am.  When I woke up I felt like I had had a night of hard drinking, headache and nausea.   I don't think I'm be trying that combination again.</p>"
}
