{
 "title": "Capsule Dosing",
 "author": "_-Seven-_ (Sigma-7)",
 "citation": "   _-Seven-_ (Sigma-7). \"Capsule Dosing: experience with DXM (ID 18464)\". Erowid.org. Oct 27, 2002. erowid.org/exp/18464",
 "substance": "DXM",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "425 mg",
   "oral",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18464",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 27, 2002",
   "Views: 31729",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nOctober 12, 2002\r\n11:14pm: I placed what I believe to be between 350 and 500mg of DXM into a capsule that previously contained 1000mg of another substance since I am unable to find empty oo capsules like my previous experiments. I believe these were oo capsules by the looks of them, and from what I remember of my experiments 2 years ago, I could efficiently place 250-350mg of DXM into a oo capsule. I packed the larger half pretty full with DXM, and much as a really could. I just consumed the capsule, and plan to document the experience. I should soon know where about the dose is from the effects. Im not worried about overshooting my desired dose, Im prepared to take what may come, yet I dont believe the dose exceeded 1g. If the dose was as expected 250-500mg (most likely 350ish) I will repeat this by filling another capsule after an hour or so has passed, to reach my desired level. I would also like to note that I had a piece of chocolate pie and a small cup of chicken noodle soup, so my stomach isnt empty, but its not full.\r\n11:33pm: Feeling first body effects. Perhaps the DXM is reaching my brain already, slight daze. Listening to some music, System of a down, etc, bit more enjoyable than usual.\r\n12:00am: Slightly uncomfortable, mild head discomfort headache like mild nausea, nothing unbearable.\r\n12:08am: Discomfort subsiding, I feel more comfortable. This is the turning point.\r\n12:18am: Sinking, not dexxin, sinking into dextromania.\r\n12:30am: Beginning to come on.\r\n12:24am: I defiantly just got hit with a brick, gonna lay down to let it subside.\r\n12:40am: I defiantly just puked, I dont know why I puke with powder. Oh well...I dexxin\r\n2:00am: \tNot sure what happened in the last few hours I lay on my bed drifting in and out of DXM sleep like state. Now going to take another equivilent dose which  I now believe to be around 500mg\r\n2:30am:\tAdditional pukage, im so ddexinf I can bearly use this machine. I see square patterns. Very lethargic. Visually distorted.  Im now going to lay on my bed and stuff..\r\n2:45am: There is no doubt I am dexxing. Im in drug mode, thats what the voices are saying in my head. Lots of random voices.\r\n7:33am: I Definitely recall several Out Of Body Experiences. Interesting, I was able to manipulate where I would go, total conscious of it being an OOBE. At some point I deliberately returned to my body after flying around the room (more like slithering). I couldnt peee and I had to(not uncommon when guys do DXM, I havent heard this complaint from females.) , so I drank some water to get some fluids.\r\n3:22pm: Ive been sleeping pretty much consistently since my last entry. Im still dazed the fuck out.\r\nA few weeks later:\r\nMy main purpose for writing this is to give DXM users an estimate on how much they can place in a OO capsule, giving an easy way to measure doses. After experimenting further on and on, ive come to conclude that you can fit around 500mg in a OO capsule by packing the larger side. The experience above seemed like 500-750mg to me tho, Im not sure.\r\nEnjoy! And be fuckin careful! Especially with the pure shit, Im not kidding, if you dont believe me read my overdose report from almost 2 years and a month ago. Have fun with this shit, but be safe. Im not the only stupid fucker who has overdosed on this shit, the high school in my area kids are dropping left and right, on the news, in the newspaper, etc. Dont let DXM get scheduled, thats why I want you to be careful, we dont nee more idiots running around, Heres my OD report (thanks erowid for posting this ;-) http://www.erowid.org/experiences/exp.php3?ID=3547\n\n\n"
}
