{
 "title": "The Power of Nitrous Oxide",
 "author": "Bcakes",
 "citation": "   Bcakes. \"The Power of Nitrous Oxide: experience with Nitrous Oxide & Psilocybin (ID 18493)\". Erowid.org. Jan 18, 2005. erowid.org/exp/18493",
 "substance": "Nitrous Oxide & Psilocybin",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 g",
   "oral",
   "Mushrooms",
   " ",
   "  T+ 2:00",
   "4 hits",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18493",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2005",
   "Views: 18406",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nIt was a strange night. I had a fight with my girlfriend. We made up, but I was still left with that feeling like we had a lot more to really work out. I was generally happy, but my mind was not clear.<br>Since this report is really about the Nitrous, I'll make this part short. I first ate 4 grams of homegrown P. cubensis mushrooms to start the journey, followed by about two hours of laying motionless, face down on the floor listening to music. I wasn't feeling very happy anymore and I already knew it hadn't been a good idea to take the mushrooms, but I thought I could make a bad situation better. I had never had a bad experience with Nitrous.<br>I had four cans of whip cream at my disposal. The first was nice, as were the second and the third, but the fourth one...<br>As soon as I inhaled the cool sweet gas I knew something was wrong. I was instantly slammed into a completely black and empty world as if someone had put a bag over my head and beat me senseless. I saw short bursts of bright white light above me and I felt like thousands of volts of electricity were passing through my brain. I wanted to scream, but i couldn't even remember what happened to my body...or where I was. The ordeal only lasted about a minute, but it was pretty scary. I didn't think a bad experience on nitrous was possible! Well, I learned that one the hard way...after the mushrooms had worn off I was able to remember the details of what had happened very clearly and it still scared me.<br>Since then I have overcome my fears of nitrous oxide, although it was nearly a year before I felt comfortable even being around the stuff. I have even developed a love (and respect) for it, and it has taken me places nothing else ever could. I will never forget what happened to me that night and I will never take this substance so lightly again.\n\n\n"
}
