{
 "title": "A More Primitive Way of Thinking",
 "author": "wrath",
 "citation": "   wrath. \"A More Primitive Way of Thinking: experience with Mushrooms (ID 18521)\". Erowid.org. Aug 14, 2005. erowid.org/exp/18521",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18521",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 14, 2005",
   "Views: 3177",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This trip started like any other. It was a Friday afternoon, and after school dismissed around 2:00 a couple of friends and I decided to pick up a half ounce of mushrooms for the evening. (My original plan was to eat them in school that day and trip in class, but I wasn't able to get them from the dealer soon enough). </p><p>We picked up the mushrooms around 2:30, bought drinks from the store to wash them down with and went for a trek to the nearby Indian reserve that would provide us with a good natural setting. My mood had once again turned to the wonderful and familiar 'mushroom hype' feeling as I had had nothing but great experiences with them. We entered the reserve and settled on a high ledge that provided us with an expansive view of the landscape below and began munching....</p><p>As usual, I was the first one to start feeling the initial effects. By 3:00 I had eaten about six grams on an empty stomach and it didn't take them longer than fifteen minutes to kick in. My head felt like it was slowly being pumped with air and I was getting slightly nervous and agitated. I felt like conscious and logical thoughts were slowly seeping away from my brain and leaving me with emptiness. It was getting harder to keep up with the conversation of my two friends and even harder to express my own thoughts into words. All that came out my mouth was a goofy laughter, and my friends knew I was feeling it. I suddenly realized how cold it was outside and unconsciously tucked my hands into my pockets. I looked at the landscape below and it was somehow different than before. The red and yellow colors of fall leaves were more brilliant now, but there was less detail, as if everything was covered with a layer of mist.</p><p>We made our way into a nearby forest for a more interesting setting. When I got up I felt weightless, and walking there seemed to be a more challenging task mentally than physically. The forest was eerily quiet and made us all uneasy. My hearing became more acute and I started to notice every little noise around me, even the tiniest rustle of leaves and branches. When there was absolute silence my ears rang with a strange, quiet buzzing noise. All the while it was getting colder outside and clouds had started to thicken. I felt uneasy in the forest, the branches looked cold and bare and somehow menacing. I looked at my friend and his lips were pale and a little blue from the cold. My mind immediately conjured morbid thoughts of all of us dying there in the forest (from poisoned mushrooms), and our pale, blue-lipped corpses being found half-decomposed weeks later. This must be what a bad trip is like, I thought. We decided to leave the forest and head to my friend's house.</p><p>Walking there seemed to take forever. By this time my perception of reality was greatly distorted. I was looking at the world around me with wonder and awe. Crossing the streets with oncoming cars stopping and going was a terrifying concept. I looked at the confusing traffic lights and signals like someone who just got teleported here straight from the stone age. My mind embraced a more primitive way of thinking. </p><p>The most vibrant visuals came from looking up at the clouds. They were constantly shifting and molding together in a bright blue soup. I had to force my eyes away from the clouds and look down, because I think could have stared at them mesmerized forever. When we got to the house around 3:30 everyone's mood rose considerably. We got comfortable and my friend turned on the TV which immediately put me in a trance. The screen seemed to be a window into another reality, and it was starting to blending into the real world in the living room. Periods of uncontrollable laughter came and went. Someone asked what time it was, I looked at my watch but it made no sense to me. The tiny chrome lines were dancing around and vibrating in a most comical way, and I couldn't tear my eyes away from it. Time was a concept I couldn't begin to understand. It was nothing, it didn't matter at all. After another half hour that seemed like eternity my friend P (who's house we're at) announces that he must leave for work. </p><p>We reluctantly return to the outside world which my mind now remembers as a cold and unfriendly place. In a short alley we spot a smashed up computer with all the electronic boards ripped out and marvel at the utter complexity of their design. It seems like some bizarre, hi-tech alien artifact. At 4:30 we part with P (who believes he is fit to go to work on mushrooms, granted he had less than the two of us.), and me and J find solace in a fast-food restaurant where we had an hour-long conversation spanning nearly every conceivable subject we could think of, and the world made perfect sense.</p><p>At this time I was starting to come down and sober up. My friend, however, had been munching on the remaining mushrooms the entire time. I was no longer confused or disoriented, though I still felt the effects of the mushrooms. For the next 3-4 hours I felt like I was on top of the world. Everything made sense and nothing could stump me. I understood who I was and thought seriously about where I was going in life. I was comfortable with myself in every way and felt somehow wiser about everything. The feeling was gone the next day, but my respect for mushrooms once again grew considerably.</p>"
}
