{
 "title": "Where Are We Going?",
 "author": "Willow777",
 "citation": "Citation:   Willow777. \"Where Are We Going?: experience with Salvia divinorum (5x extract) (ID 18520)\". Erowid.org. Jun 2, 2003. erowid.org/exp/18520",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18520",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 2, 2003",
   "Views: 6318",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBefore salvia, I smoked weed quite a bit for over a year. I wanted to go up a level and 'see' things, but couldn't get a hold of any shrooms or acid- then I learned of salvia. Well, having never done hallucinogens before, I thought I knew what to expect by reading about other people's trips, but I was sadly mistaken. Now, over a year later since my experiences with salvia, not a day goes by that I don't think about it, and the aftereffects linger on -- not anything bad, just strange...like, I'll see things that aren't there -- if I stare at something and then look away, I'll still be seeing a white outline of the object in my field of vision. This happens more when I'm tired. Also, things will appear to fly by every so often. It used to scare me, now I'm used to it. Also, when I look up into the sky on a clear day, I see hundreds of white things moving amongst one another..molecules, atoms, I don't know for sure what they are? \r\nAnyway, I had no luck at all with the regular salvia leaves. Smoked 'em in a bong but nothing happened. So I ordered the 5x and my first trip blew my mind. I had the radio turned on low volume with some classical /opera music. No sitters, just me sitting down in my apartment. Started toking, and after 2 hits off the bong I began to sort of feel as if I was drunk. However, I had the feeling that I was beginning to spin around fast, with my cordination getting so bad I could barely keep taking hits -- but I believe I took about 4 hits in all, but I was getting more and more disoriented by the second so I can't say for sure. I wasn't too worried, just excited that something was happening, but happening really fast. Next thing I know is that I have the urge to lie down, but trying to crawl past my chair and onto my mat is not an easy task...I felt like I was being pulled away from the direction I was trying to go in. \r\nOnce I lay down, my head was still raised up cuz I was feeling these odd sensations..I remember thinking that it felt like a train was running me over..it was as if I was on some tracks and a train was just running over me, feet first, then body, then head. It was weird, and very intense, but I tried not to dwell on it although the sensations were powerful. I didn't realize the trip would also be so physical -- I thought it would all be in my head or something -- not the case at all. Then, I truly began to hallucinate. I don't remember the order the hallucinations were in, it was all so fast. I believe I saw myself from outside myself somehow, only I was looking at me not in my apartment, but I was looking at me in a strange yellowish force field similar to a matrix. I felt like I was about to go somewhere, and there were many people with me but I don't remember what they were doing. I think we were boarding a bus or something. Also, the radio was sort of keeping me a little bit in reality, but not really, cuz at this point I didn't know who I was, where I was, or what was going on, and it seemed like a voice was speaking directly to me. \r\nI felt a female and a male near me.. don't know why this is so common in salvia trips. I kept thinking, 'this is salvia?', and then, 'what is salvia?', and I was also either thinking or saying, 'so where are we going?'...then the trip faded out and I didn't know if I had said those things or thought it cuz it seemed to be the same thing. I saw a windmill type thing that was above me, that looked like this thing on megaman that happens when you start a level -- it's like the screen is vortexed -- weird, cant explain it really...also felt like the whole room was rotating around me, but very choppy-like, and there were orange-green colors on the edges. Well, that was it...my other trips were not as good as I was extremely paranoid about the fact that I was in a spiritual realm that was off limits to me. Be wary, this stuff can change your reality for GOOD!\n\n\n"
}