{
 "title": "The World On Its Head",
 "author": "Ed Head",
 "citation": "   Ed Head. \"The World On Its Head: experience with DMT & MDMA (ID 1857)\". Erowid.org. Jun 15, 2000. erowid.org/exp/1857",
 "substance": "DMT & MDMA",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "1 hit",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 1857",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 15, 2000",
   "Views: 51550",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After a period of some months, (This drug, like so many hallucinogens, is very hard to get hold of in Britain) We had finally managed to get hold of the substance we had heard so much about.</p><p>Could the stories possibly be true? I have to admit that I was sceptical, and, not having done much research on the matter, expected a very fast, intense LSD hit, but nothing too out of the ordinary.</p><p>Previously, when we had discussed this moment, my friends and I had promised each other that when we finally had the drug, we would head for the hills, as far away from civilization as possible, to something more aesthetically pleasing than our rather shabby student house, so we stashed it away safely for future reference. However, being unable to stifle our appetite completely, the four of us each took two ecstacy pills, and spent the evening listening to music, planning the details of our forthcoming trip to the English countryside.</p><p>Inevitably, however, me being me, and my friends being my friends, about four hours into the ecstacy trip, as the rushes had died, one by one we cracked, and decided that we were unable to wait any longer for this drug that we had already waited so long for.</p><p>The DMT had already been divided into, what we were told by our supplier were more than sufficient hits for one person, so we put three into the pipe between the four of us.</p><p>I was, a little to my consternation, the last in line for a hit, but I needn't have minded, as my friends all took what turned out to be rather shallow lugs from the glass pipe. Determined not to make the same mistake I inhaled deeply in time to see the rather deranged looking figure of my best friend Phil slouched back into the armchair. Still he's not the sanest of individuals at the best of times and so I put it to the back of my mind as I took a deep breath of this rather noxious chemical, and cleared the pipe fully of its contents.</p><p>I had just the time to place the pipe back on the floor when an invisible hand, with some force, pushed me back into my seat. I became aware of travelling very fast indeed, at the same time in the knowledge that I wasn't moving at all. The room seemed to fold in on itself and became completely unrecognizable from the one that I had left only a few seconds before. It sounds almost cliche, but I really felt that I was at the helm of some great interstellar space ship, and this thought of being in control, helped me regather at least some of my sense, from a trip that had a minute ago, threatened, to completely blow my mind.</p><p>I glided out to the back garden, unaware of the floor beneath me. I passed the kitchen on the way through, which had the look of a Van Gogh painting, staggering in its own right, but nothing compared with what I found on the other side. </p><p>The Garden was beset with a shimmering beauty, the likes of which I had not seen before nor since, and probably never shall again. The grass, which was neglected, and a foot long, was full of beings, manifestations of an energy that I had noticed while under the influence of LSD, all performing their dance, especially for me, swaying from one side to the other. I began to sway with them, as they really did look like they were having a great time. As I swayed, the single most incredible experience of my life took place. The entire Earth swayed with me, not just what I could see, but a force so strong as to be unimaginable to my sober mind, yet utterly, totally benevolent.</p><p>My gaze wandered to the giant oak at the foot of the garden. It's leaves formed a giant, ever changing picture, starting with a vivid representation of the Christians being thrown to the Lions, then taking me on a history of warfare through out the ages, and ending with a gas mask, face up in the Flanders mud, before the visual facet of the trip began to fade, I guess 10-15 minutes after smoking.</p><p>I sat down on the ground and lit a cigarette, feeling absolutely at one with my surroundings, still feeling the ecstacy like rushes through my body for at least another quarter of an hour, as my friends, who had inhaled nowhere near as much as me, came out to check that I was O.K.</p><p>O.K would be an understatement. Before this trip, I had a very real fear of death. No more. My ego had been replaced with something much more substantial, an understanding of my place in the cosmos, insubstantial as it may be. I understand that DMT is by no means for everyone, and for a while there it threatened to be a very different trip. However it had an incredibly beneficial and life affirming effect on me, and has done on every occasion I have used it since.</p>"
}
