{
 "title": "A Tryptamine Expedition",
 "author": "Gracie & Zarkov",
 "citation": "   Gracie & Zarkov. \"A Tryptamine Expedition: experience with DMT & Mushrooms (ID 1858)\". Erowid.org. Jun 15, 2000. erowid.org/exp/1858",
 "substance": "DMT & Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "smoked",
   "DMT",
   "(powder / crystals)",
   "  T+ 2:00",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1858",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 15, 2000",
   "Views: 163965",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nCopyright August 1985 by Gracie and Zarkov Productions. We believe that in a truly free society the price of packaged information would be driven down to the cost of reproduction and transmission. We, therefore, give blanket permission and encourage photocopy, quotation, reprint or entry into a database of all or part of our articles provided that the copier or quoter does not take credit for our statements.</p><p>Introduction</p><p>This paper is about the strangest trip that we have ever had. Furthermore, in our discussions with other experienced heads it became clear that this trip was one of the more peculiar trips that we have even heard of! That in and of itself might not warrant an article. However, the possible implications of this trip are such that we have decided to write about our experience to add to the store of 'stubborn empirical fact' that make up psychedelic phenomenology.</p><p>We are also aware that this trip was outlandish enough that its retelling may cause our readers to believe that we finally have either lost it or are resorting to creative writing. We would like to assure our readers that what you are about to read happened exactly as described (within the limits of our powers of observation).</p><p>In this paper we give a description of the trip, our beliefs concerning the phenomenology, and our tentative conclusions regarding our experience. It seems impractical to reproduce the entire trip narrative written right after the experience since it runs to twenty typewritten pages. Therefore, this paper is a highly condensed version of the trip narrative.</p><p>Backqround</p><p>The weekend prior to our strange experience, Grace had decided to take 5 grams of potent stropharia mushrooms by herself. While it is common practice for us to trip together, Zarkov's high dose mushroom trips have been uniformly negative ever since he established contact with certain insectoid creatures who claimed to have engineered the mushroom for their own purposes. (See, High Frontiers, Issue no. 2 and Note no. 8). Gracie was going in alone to perform reconaissance. After about an hour and one half of arguing with the voice and being unable to see any visions, she began to 'interview' the voice which seemed quite amenable to questioning. Gracie called in Zarkov and together we interviewed the voice in Gracie's head for about two hours. One of the raps was that Gracie had trouble entering the vision state because she hadn't practiced enough visualization and was afraid to leave her body.</p><p>Now it is true that despite how much talk there is about how hard it is to get into the far-out mushroom states, Zarkov would just 'fall down the rabbit hole' on any dose over 3 grams without knowing how he did it, while Gracie had much more elusive contact with the mushroom vision states even at doses in the 10 gram range. However, given Gracie's consistent ability to see the 'visible language' on DMT (which Zarkov has so far only briefly glimpsed) and her other visionary experiences on DMT, this rap seemed rather unlikely. </p><p>But, the mushroom voice held out hope. Gracie should practice building a fantasy world in her head and maybe, if we both took mushrooms together, she could 'show' her fantasy world to Zarkov. Zarkov was extremely skeptical of the whole rap. It seemed very enticing and very unlike his experiences with the mushrooms. That week Zarkov went to the East coast on business and left Gracie to work on her fantasy world.</p><p>Upon Zarkov's return on Friday, Gracie announced that she had worked diligently on her fantasy world and would like to show it to Zarkov that weekend using mushrooms. The only description she gave of the world was that it was a barbarian bronze age planet run by Goddess-worshipping group of priestesses and that he was cast as a high-tech off-worlder.</p><p>Zarkov was apprehensive, since he didn't want another 'alien space wars' trip on the mushroom. The experimental protocol that we agreed on was to do a DMT shot at noon on Saturday and if the experience seemed positive, to take the mushrooms later in the day. The first shot was inconclusive because Zarkov didn't get off but he did get a terrific case of the tryptamine giggles. He decided to take another dose. The visions in the noontime sunlight were exquisite. Over the next half hour, we each consumed betweeen 100 and 150 mg of DMT in four separate 'trips'. The experience for Zarkov had been glorious. His relationship with the DMT over the last four months of regular usage had been uniformly positive even when it had been terrifying. The idea had came into his head (from where?) that by presaturating himself with the DMT, his previous problems with the mushroom could be avoided.</p><p>We had fasted since Friday night and had been especially careful with our diets all week. At 2:00 PM, we both took 5 gms of potent stropharia mushrooms. We washed down the 'shrooms with ginger ale. We stayed in the bright sunlight until the closed eye visions began to come on strongly (about 30 mlnutes). We then went into our darkened trip room.</p><p>The Trip: Content and Comments</p><p>The basic phenomena of the trip were as highlighted below.</p><p> Gracie saw none of the visions described below. In fact, she saw no visions during the trip. She was high and the trip room took on a beautiful jewelled quality. She had no tendency to drift into a trance even though she had taken the same dosage of DMT and mushrooms as Zarkov.\rZarkov could not resist the trance. Strangely, he could talk with ease but could not maintain any other semblance of contact with reality. Any attempt to do so resulted in overwhelming stomach cramps, full body shivers, vertigo and throbbing headache. All of these body symptoms went away if he paid attention to the trance state.\rZarkov's first vision was a stadium full of hostile giant insect creatures that he was familiar with from previous mushroom trips. However, immediately the DMT 'banshee' creatures floated in and sang this message, 'Aren't they a dull and pompous bunch! But don't worry, they can't get at you because we are here.' These 'banshee' creatures were a common occurance in Zarkov's DMT trips.</p><p>[picture of two smiling banshees]\rThe next series of visions were of various aliens that seemed to be trying to sell Zarkov various visions. The banshees continued to accompany the visions and offer comment.\rAt about the chemical peak of the trip (one hour), the house had a rash of poltergeist phenomena that were jointly observed by both of us. Furthermore, the cats noticed them and followed them as they made their way through the house. The banshees advised Zarkov not to worry about them because 'things like this happen.' This was the last point in the trip where Zarkov could maintain contact with ordinary reality.\rThe banshees formed a gate next to an alien selling visions indicating that Zarkov should 'buy into' this vision.\rBy 'going' through the gate, Zarkov found himself someplace else.\rThis some place else was another world. It no longer seemed like a psychedelic vision, but rather it seemed like a real world. The sun felt warm; when it went down Zarkov felt cool. To move around it was necessary to walk. Wherever he looked, there was a realistic amount of detail. No insubstantial visions, just a real world wherever Zarkov looked. He could eat, walk, swim, fuck and talk to the other characters.\rThe world was Gracie's fantasy world. Even though she couldn't see it, Zarkov's verbal description matched her world. She could give instructions to Zarkov that he could follow to get around.\rThe world was a bronze-age city. In the background were green and fertile mountains. The architecture was of massive granite blocks with a poured concrete look about them. The style was neoclassical crossed with Minoan with a touch of Jack Vance. The mise-en-scene made sense and did not appear contrived. The aesthetic sensibility, while of the wretched excess school, was coherent. It was the most beautiful place Zarkov had ever seen, in shades of pink, mauve, purple and gold.\rThe story line was that of the wierdest heavy metal video ever designed. There were barbaric artifacts and luxury items all over. The world was inhabited by buxom, bottom-heavy, voluptuous nymphos. Zarkov found himself in an elaborate caped outfit, somewhere between Darth Vadar and Ming the Merciless. His entourage was a group of cretinous, long-haired sleazos in heavy metal dress and carrying guitars. The trip consisted of a tour through the city from the wharf to the main temple where a three-day orgy took place.\rThe world somehow seemed like an isomorphic metaphor to Gracie's personality structure.\rThe world was coherent and consistent. It had internal rules as inexorable as the 'natural laws' on earth.\rIt had its own linear time. Subjectively, Zarkov spent three days in the world. Yet this voyaqe was encompassed in a normal six-hour mushroom trip. Furthermore, any attempt to reestablish contact with earth left huge gaps in the story since the world proceeded at its own pace, even if Zarkov wasn't paying attention.\rIt did not seem like telepathy or a projection from Gracie's head. Rather, we believe that somehow the fantasy world was lifted from Gracie's head and placed in the tryptamine 'library of all time and space' where Zarkov 'read out the diskette .\rThe only psychedelic aspect to the world was the continual presence of the DMT banshees, albeit they were 'disguised' as a sort of observer/chorus as bats, orchids, etc., throughout the experience.\rThe DMT acted as a tuner of some sort for the mushroom experience. Certain aspects of the vision seemed characteristically DMT, like the banshees, the extreme time dilation, and the bejewelled colors. The mushroom contributed the epic quality, the exfoliating details and the practical joke quality of the whole set-up.\rSuch an experience, if controllable, would be extremely useful to a shaman trying to treat mental illness. He could walk through the streets of his patient's mind without the verbal filter of analysis. It might even be possible to make changes in the landscape to effect a cure. The demons lurking in the shadows would be a constant danger, 'You might not come back.'</p><p>\n\nConclusion</p><p>Zarkov has not attempted to repeat the experience. Gracie, however, has used the DMT predose before a lower dose of mushrooms (3 grams) and found herself in an irresistible trance with a series of faint visions. This was outdoors at night with a friend who did the same mix and also found herself in a trance, although her visions remained state-bound.</p><p>We don't know what Zarkov's vision means or how he got there, but we encourage anyone with visionary tendencies to try exploring these modes.</p>"
}
