{
 "title": "Discovering A New Life",
 "author": "Josh V.",
 "citation": "Citation:   Josh V.. \"Discovering A New Life: experience with Salvia divinorum (5x extract) (ID 186)\". Erowid.org. Aug 7, 2001. erowid.org/exp/186",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 186",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 7, 2001",
   "Views: 13315",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nToday was about my 5th experience with Salvia Divinorum. Might I say it was the most wonderful.\r\nI have tried Salvia Before and had wonderful experiences,but they were in such a flash. A rush that it was a bit confusing. A few days ago I recieved my own cutting of Salvia. I've felt a connection with her.Its almost as If I can feel her spirit. I feel that is part of the reason that my most recent experience was as wonderful as it was..Ok :)\r\nTotal darkness, sitting in my room as I focused on the sound between the sound of nothingness. I was ready. As I smoked the first bowl I started to feel the familiar feeling of pressure starting at my feet and rising to my head. I held in the entire bowl in one Hard inhale. I held it in until I felt it was no longer possible. (I have found this to be one of the keys to discovering salvias wonderful light.) I was in her world.\r\nI loaded the second bowl and after the first hit I was gone. The pressure became so tremendous that it pushed me out of my body. About the first 5 mins of the Salvia Trip had been somewhat the same each time. I feel the universe. I AM the universe and all that is within it. I begin to spiral downward. I become the galaxy, the earth, the land, the city, the house, my room, my wall, my floor, me. While on this journey I have no concept of comming or going. I dont know if I am, if I was, or if Im about to be.\r\nI saw two beings of light. I became lost in the energy that surrounded me. I had no concept of a 'self.'I simply was. IT wasnt until my roomate walked past my room and spoke that I realized what I was doing. I was knocking everything off of my shelves and couldnt stop because I didnt know If I was doing it or if I was about to do it. It is an amazingly incredible experience.\r\nI ran to my telephone and called a friend of mine to describe to her what was happening. Until that point the trip had been the same as the others but only a little stronger.\r\nAs I heard her voice,I closed my eyes. Within my minds eye..I saw a large screen. With every sound that she spoke I saw a wave of color. The wave moved according to the pith and length of the sound. As I became aware of what I saw, it went away. I started to remember what I had just experienced. The feeling of 'unity' with the universe is so wonderful. Its truly beyond any words that could come close to describing it. But it flashes by. Its similar to a roller coaster. Theres so much to experience and so little time. Imagine..experiencing the entire universe in 5 mins.\r\nAs I spoke to her the feelings began to rush through me again. I connected with my higher 'self'. I saw the true purpose of life. Before this lifetime, we ARE the universe. We know and experience All of every moment. Beyond the 'idea' of space and time. With that in mind this life is a part of that universe that is our (higher)self. So through the experiences of this life that is our (physical)self, We are discovering the deeper realms of our'higher'selves. In the higher realms there are no boundaries,we are simply everything,but we cannot percieve because we are. So within this lifetime we are given the gift of restriction. Our body..We can experience all that there is but with a sense. It is so important that we remember that this life is only a mere fraction of the entirety of eternity. Dont get lost in the physical,thats not why were here. But thats my experience. I dont know that I can explain much more of this experience with words,I can only hope that you will 'know' what it is I am trying to say.\r\nSalvia Divinorum is one of the most wonderful things on this earth that I have ever experienced other than life itself. But not because its a wonderful drug, because its not. ITs not a drug at all. If you could imagine a life of blindness, never knowing the light of day. Salvia removes that blindness. She is not the light, but simply a means of helping us percieve it.\r\nPlease do not abuse this amazing plant.\r\nShe is here to help us learn.\r\nWe are nothing in her presence. She is the one taking us on the incredible journey. So treat her with respect and she will give it in return.\n\n\n"
}