{
 "title": "A Low Dose Got Me Deep",
 "author": "The Philosopher",
 "citation": "   The Philosopher. \"A Low Dose Got Me Deep: experience with 5-MeO-DiPT (ID 18610)\". Erowid.org. Dec 12, 2002. erowid.org/exp/18610",
 "substance": "5-MeO-DiPT",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "7.0 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18610",
   "Male",
   " ",
   "Not Given",
   "Dec 12, 2002",
   "Views: 11103",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLast night a few of my friends, P and R, came to visit me and we decided to take some 5-MeO-DiPT. I have a small stash of it dissolved in some alcohol. I've used the substance two times before, the dosages were 4 mg and 10 mg. 4mg didn't do wonders, a + on Shulgin's rating. 10 mg however was a definate +++, but I had some problems controlling it. I vomited soon after ingesting the 10 mg, even though I haven't eaten in at least 15 hours. I felt fine afterwards and it seemed that the trip was getting really intense, but I had trouble relaxing and a general uneasyness took over me. Well, that's enough about the earlier experiences.</p><p>So, P and R came to my place a little before 21:00 and we almost immediately ingested some. I took 7 mg, 'cause I thought that the 10 mg felt a bit too much. P, who has tried the substance before with 5 mg wanted to take 10 mg and R, who didn't have former experiences, took 6 mg.</p><p>Our setting was quite good, it was dark outside and I've got a comfortable place. I was on a good mood, since I got some important work done last week. Oh, by the way, I study philosophy at the university. So, we drank a few ml's of the liquid, which contains 1mg/ml of 5-MeO-DiPT.</p><p>T+20min</p><p>We all start to feel some effects, we're listening to music and watching a cool plasma on my computer's screen.</p><p>T+50min</p><p>The humming of my computer starts to get annoying and we decide to turn it off and just put on some music; my lava lamp is on as well.</p><p>T+1h</p><p>Well, now the stuff is really working, all three of us are laying with our eyes closed and listening to Ozric Tentacles (an album named  Erpland), that's just about best trip music in the world!</p><p>T+1,5-3h</p><p>We mostly trip on our own and every now and then we smoke some herb mixture that I recently purchased (not intoxicating), there's also some incense burning.</p><p>I'm getting some visuals with my eyes closed, but not really any patterns or anything. To me, it's a bit like the 'holodeck effect' on DXM, some resemblance to LSD as well, but not as intense, not with 7 mg's anyway. As with all psychedelics, I try achieve a state very close to lucid dreaming, only a lot more intense and euphoric. I had some very good time with my mind and especially the music sounded great, I was all in to it. The herbs and incense created an interesting odor in my room and P suggested that it was the smells which created the music we heard; have to admit, it really felt that way when I gave some thought to it.</p><p>T+3,5h</p><p>We're all coming down now, but still feeling quite strange. The really intense part of the experience lasted only for 2,5h or something, but I was quite content with it, I achieved a most comfortable state of mind.</p><p>T+4,5h</p><p>Unfortunately, P and R had to leave though they were definately not sober, I guess they had an interesting bus trip...</p><p>T+5,5h</p><p>I fall asleep quite easily, feeling comfortable. I had some interesting dreams too. I had some trouble falling asleep on my two earlier experiences with 5-MeO-DiPt, but too serious though.</p><p>In conclusion, last night was a success. I haven't spoken with P and R yet, but they really seemed to enjoy it too, we didn't have any nausea and it seemed that the body load was minimal as well. I think that none of us had any great insights, but a really good time still. It seems that 5-MeO-DiPT can be quite a lot of fun at low dosages. I'll probably try it with a higher dose as well, but I don't believe that it get's more profound than this.</p><p>By the way, I really enjoyed using it with some friends, since when I tried it alone, I really was in need of some company although I usually enjoy taking psychedelics by myself.</p><p>I don't really see why some people have suggested that 5-MeO-DiPT would be fun only if you're on the move: outside, dancing or something. No doubt it would be fun to dance or walk somewhere outside with low doses, but at least for me it was just as good inside, just laying and tripping in my mind. Then again, that's really what I enjoy doing with all psychedelics. </p><p>I enjoyed sticking to a relatively small dose and and just diving into my mind. With a little practise I really didn't need a high dose to get an intense experience. I'd really hate to read another story about someone ending up to the ER with 50mg or more of 5-MeO-DiPT.</p><p>By the way, I'm not a native english speaker, so please excuse any errors.</p>"
}
