{
 "title": "Blasting My Illusions To Infinity",
 "author": "Trotsky",
 "citation": "   Trotsky. \"Blasting My Illusions To Infinity: experience with Mushrooms - P. cubensis (ID 18622)\". Erowid.org. Aug 4, 2005. erowid.org/exp/18622",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18622",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 4, 2005",
   "Views: 3437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI ordered a magic mushroom grow kit from a Dutch company earlier this Fall. The kit promised 20 - 25 dried grams of Psilocybe cubensis mushrooms. Two hardy flushes made good on this promise. God bless the Dutch. \r\nDays later I set off to my friends college with a jar chock full of crispy dry magic. \r\nTwo friends and I sat down to five dried grams and peanut butter each at 6:30 pm. \r\nMy mushrooms come on strong. Within twenty minutes I decide that Stalin, Lenin and I are unstuck in time. The three of us are very giggly. I remember going into fits of laughter and writhing on Stalins bed. There is intense euphoria and I assume strange, contorted postures that are somehow comfortable. I remember lying on the bed with my limbs splayed out like a broken G-I Joe. Our pupils dilate within half an hour. \r\nAt this point the giggling subsides. We watch Simpsons after Simpsons and zone out to pleasant music. Everything seems warped and bloated. Stalin's ceiling bulges and swims like a thing alive. At this point I start to lose touch with reality. I see dripping blood everywhere at about 7 pm and I love it. At this point visuals are very intense. Both comrades are seeing streamers and the like. Stalin and I decide to go smoke a cigarette. Lenin remains in bed in a pleasant delirium. As we walk down the flights of stairs the dorm room becomes a sort of Aztec temple complete with crazy friezes, wall motifs, and a sense of mystery. I have a cigarette in hand but absolutely no idea what to do with the damn thing. To me every little human action is absurd. I have no idea what this piece of fabric they call a coat is. I have no idea how this piece of fabric is draped on my left shoulder and around my left arm. I have no idea where to go from here. Is this how a normal person wears a coat? How do I get this damn thing on? It all seems so absurd. So it went that night.\r\nWe watch Simpsons after Simpsons until 7:30 pm. I say that we should go to a party over and over again. Finally I am convinced that this is a terrible idea.  \r\nWhy go outside this room, this room is our spaceship.\r\nStaying put is a great idea. At about 8 pm I am lie on the bed and experience death after death after death. My mushrooms are strong.  I am in bizarre dream world of shades and shadows. Quite intense, but I somehow keep my cool. This is terrifying but the feeling doesn't last. \r\nAt about 9 pm I feel great and get back to watching Simpsons after Simpsons. Existentialist that I am I constantly point out how absurd and meaningless human existence really is. I surf the web and show my comrades pictures of Yao-Ming the absurd Chinese basketball star. I rant and rave for hours about the hopeless condition of man and the bizarre relationship he has with his vast network of machines. Stalins computer does a lot of crazy stuff and really makes my points. At 12 we calm down. Even I stop spouting off ridiculous philosophies and tirades against the machines. We are still tripping.\r\nAt 12:30 we all come down but watch Simpsons upon Simpsons late into the night. It's hard to sleep on mushroom after-effects. What a night We retire at 4:30 in the morning. What a time.\r\nTripping allows me to blast my illusions to infinity and see life for the absurdity it is. Mere hours later I can get back to life and change this imperfect creation.\n\n\n"
}
