{
 "title": "A Day with Bob",
 "author": "Stropha",
 "citation": "   Stropha. \"A Day with Bob: experience with DOB (ID 1862)\". Erowid.org. Jun 15, 2000. erowid.org/exp/1862",
 "substance": "DOB",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "DOB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "",
   "1862",
   "Male",
   " ",
   "Not Given",
   "Jun 15, 2000",
   "17886",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday, I arose at 8am to the sugary sweetness of one sugar cube injected with 1mg DOB. After letting the whole thing dissolve in my mouth, I hopped back into bed for about an hour. Upon opening my eyes, I became aware of a very pleasant and lively feeling of energy welling up inside my chest. I got out of bed, invigorated, clear, and full of energy; I put on some energetic music, and began the mornings meditation session. I found it quite easy to move in and out of states of emotional tumult, and each successive wave of psychodynamic tumult was followed by a state of peaceful rest, similiar in nature to that often felt on either MDMA or 2-cb.</p><p>After a bit of meditation, and some morning net-surf, I decided to go for a walk to the botanical gardens; the state was not overwhelming as psychedelics can often be, and 'clarity' is a good word in describing the state of semi-detached introspective thought process. The walk was nice, but not as emotionally stunning as the same walk has been on 2-cb. After a salad--eating is very plausible once established within the state--I went to a CD listening bar and tried some music out. Strangely, the most appealing music to me was not my typical celtic, medieval chanting, or ambient, but the more mellowdramatic ballad types like Fleetwood Mac, James Taylor etc. I was, at this point T+4, quite established in the peak state, and would categorize the experience as + to ++ on the Shulgin scale. Probably more +.</p><p>Visually, it was somewhat akin to 2-cb, and at T+6 I added 20 mg of 2-cb onto the mixture. This made for a very interesting combination, that carried quite a body load with it, though quite pleasant and ripe with possibilities. After a wonderful bath, and some more meditation and music, I settled into a very peaceful and satisfied state; much like the exhaustion one feels after a days work. The decent was slow from about T+8-T+12 hour--by 12 hours I was completely down, and could've gone to sleep pretty much anytime after T+10. All in all, an interesting material, no where near as 'speedy' as I was expecting it at this level, though the amphetamine backbone did seem to become more apparent with time.</p><p>Physically, at this level it was gentler than 2-cb has been with me in the past, excepting some very mild gi discomfort that may not have been due to the ingestion of the material. It made for a nice day, with alot of time to focus and work on personal issues that arose--it seemed strangely detached and impersonal, but highly workeable...Very interesting</p>"
}
