{
 "title": "Mental Clarity",
 "author": "Bob",
 "citation": "   Bob. \"Mental Clarity: experience with DOB (ID 1863)\". Erowid.org. Jun 15, 2000. erowid.org/exp/1863",
 "substance": "DOB",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.5 mg",
   "oral",
   "DOB"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 1863",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 15, 2000",
   "Views: 20254",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well we finally took the plunge. My partner and I swallowed 1.25/1.5 mg respectively of the magic material at 10 am. My first comment was, 'I have the feeling that I just did something to myself.'</p><p>I've been eating a meat free diet for several years now and have found myself to be quite sensitive to any materials that I introduce into the body. I can feel the resonance of a material fairly quickly. Within 15 minutes I noticed a change in my proprioceptive sensation of my eyes. By 1 hour I already was well into it, so the typical long latency seems not to be the case for me. The complete transition into the full effects did take about 2 hours and was particularly unpleasant. A lot of physical effects were noted, particularly muscle tension. My eyes became a source of great discomfort that stayed for most of the day. My partner also developed a tension headache with the material. Amphetamine derivatives typically don't sit well with us and this is definitely the case with DOB. There are heavy visual effects that preclude practical activities, especially driving. At one point I was reading aloud a section from Reviving Ophelia: Saving the Selves of Adolescent Girls by Mary Pipher, Ph.D. (highly recommended) and my partner later commented to me that she literally saw my face morph into the faces of about 20 different men. So the visual effects are quite pronounced with this material (please do not drive when under the influence!).</p><p>We did have a long and wonderful conversation on the material, but the somatic effects were a bit much at times and we frequently wished for it to be over. The after effects, however, are quite pleasant and we both feel calm, clear and refreshed after a long day's journey (its about 1 AM as I write this). The signature of this material is a marked mental clarity, but not much of the heart that we love so much in the bees could be found with DOB. You can look at issues with that mental clarity without being shadowed by excessive emotion and this material might be useful for that kind of work. You can go in and out of zones of suffering/difficult issues with relative ease. As a therapeutic tool, it may hold much promise for working through difficult issues. In all, I'm most grateful to have had the chance to look into it, but I prefer the phenethylamines/tryptamines to the amphetamine congeners.</p><p>A brief observation on the aftermath of DOB:</p><p>A nagging sense of anxiety that hasn't stopped for over two weeks. Although it may be in response to persecution occurring elsewhere in the world, the clinical impression is that it is principally biochemical. DOB just doesn't agree with this particular neurochemical process. Intervention was applied on the biochemical level by administration of one dose of Inderol, which quickly transformed the anxiety at the base and it has not returned.</p>"
}
