{
 "title": "A Paranoia Suppressant",
 "author": "Spence",
 "citation": "Citation:   Spence. \"A Paranoia Suppressant: experience with Blue Lotus & Cannabis (ID 18654)\". Erowid.org. Sep 15, 2005. erowid.org/exp/18654",
 "substance": "Blue Lotus & Cannabis",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 bowl",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(plant material)",
   " ",
   "3.5 g",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18654",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 15, 2005",
   "Views: 14753",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis isn't meant to be a holy-shit-I-was-stoned report, rather just a noticed side effect of The Sacred Lotus that has proved to be more functional than the actual lotus buzz.\r\nFor about a month I've been drinking and smoking lotus everyday 2-4 times a day, I find that the mellow aura and smooth vibrations are a very positive experience. However, because the high is so subtle, I have never mixed any other substances (aside from alcohol) with the lotus for fear of overpowering it... until two days ago. I bought a plastic stash grinder for $7 at the local head shop and went home to grind some buds and do a bowl. After grinding about half a gram I spotted the bag of lotus on my shelf across the room, thinking 'Oh, what the hell...', I threw an equal amount of lotus into the grinder with the pot. I took three or four hits and started to feel the subtle buzz of the lotus, followed shortly by the much stronger Cannabis buzz. At this time it is important that you understand that I am naturally a person who is very paranoid, even when I'm sober. So when I'm high, you can imagine that I get very shady. The Blue Lotus totally nullified the paranoia. I was 110% comfortable and unafraid of being caught or anything like that. \r\nI went to the kitchen and put three or four grams of finely ground lotus in a coffee filter and ran it through my coffee maker, then I took the tea and ran it through again, to make sure I got all of the essential lotus energy. I drank it over the next hour or so, and on top of being totally free of paranoia the high lasted a good four hours.\r\nI can't be 100% sure, but I've tried this again twice and I believe the lotus really helps mellow out the Cannabis high and lengthen it.\n\n\n"
}