{
 "title": "An Incoherent Spiritual Message",
 "author": "VK Jones",
 "citation": "   VK Jones. \"An Incoherent Spiritual Message: experience with Mushrooms (P. cubensis) (ID 18655)\". Erowid.org. Nov 5, 2002. erowid.org/exp/18655",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "0.125 oz",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18655",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 5, 2002",
   "Views: 7147",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nPrior to this experience, the only substances I used were alcohol, marijuana, and opium. Some other background information: if I smoke way too much weed, especialy if I hadn't smoked for a while, I tend to trip out (the visuals are nothing like a mushroom trip; much more subdued and far less depressing).<br>About 2 days before my first mushroom experience, I ended up injuring my hands and my knee with very deep cuts that cause me pain daily, especially when I walk.  Due to lack of research on my part, I didn't realize that this fact would play so dramatically into my first trip.<br>Going into the experience I really underestimated how powerful mushrooms are (I expected something akin to a powerful weed trip).  At about 3 in the afternoon on a saturday, I left my dorm room and my friends after eating about half the bag a half hour before, and I brought the rest with me.  I walked through the buildings and trees in my college heading towards a forest on the edge of campus.  On my way there, I walked through a small park, and began to notice mild visuals, like the common effects people see on mushrooms (i.e. The ground is breathing, trees are breathing, the ground is like a wavy pool).   I continued reaching into my pocket and eating whatever caps and stems my hands grabbed.<br>By the time I passed the football field and entered a dense forest, colors were intensified, and the trip was starting to set in a bit more.  I walked along a path and as I passed under a canopy created by a huge broken branch, I reached into my pocket and found that all of my shrooms were gone.  Then, I heard a strange sound as if I were wearing a bike helmet and a raindrop fell on it, but it was a sunny day; oh well, probably my imagination, I thought. <br>I descended deeper and deeper into the forest and came upon a river, where I sat on a rock and observed my now vivid visuals.  The earth now was breathing heavily, and the fall leaves that covered the ground would shift around, form patterns, spin, etc.  The water was not as impressive as I expected it to be, but the sunlight through the trees was magnificent.  I was so glad I shroomed in the fall because the leaves on every tree were like spots of paint:red, green, yellow, orange, all glowing through the light of the sun.  If I stared long enough, these colors also shifted and changed beautifully. At this point, if I blinked, I could restore my regular vision, but the moment I stared too long at something, I would be thrown back into trip-mode.  A patch of grass looked normal at first, but after fading into trip-mode, a certain pattern emerged as the blades shifted in unison.  At first it was a compass, then it twirled and became a sun.<br>The trip got way crazier later when I jumped from rock to rock until I sat on a boulder in the middle of the river and observed a more violent part of the flowing water.  From the middle of these rapids rose a small rock, which, if you use your imagination, had two green leaf eyes and a yellow leaf mouth.  After spacing out for a while staring at it, I became aware that it was, as crazy as this sounds now, communicating with me.  It was more angry than anything I have ever seen.  It hated me because I was human, and wished I would die so that the nutrients in my body would feed the earth.  I know this must sound completely retarded now (it seems stupid even to me), but at the time, it was completely real.<br>I mean, it was without a doubt communicating with me at the time.  Imagine what you would do if water rapids were telling you they hate you and wish you were dead.  This kinda freaked me out, so I returned to the shore and continued down the stream to this dead log covered in moss and mushrooms.  As the sun set, the moss turned into an almost neon color, and the mushrooms shifted around on the surface of the bark in a random pattern.  The sunset was absolutely beautiful through the silhouette of the red, green, and orange trees. <br>Suddenly I saw a glove appear at the base of the log.  This immediately compelled me to take off the bandages of my injured arm, which suddenly started hurting intensely.  I saw the scab underneath, and my hand turned pale white until I could see the threadlike arteries and bigger veins underneath.  My entire hand then, within a couple seconds, decayed completely; it looked like I was watching a movie because the blood and gore was so realistic.  <br>This and the darkness scared me enough that I started wandering through the woods frantically trying to get out.  Instead of exiting as I came in I ended up in a huge open field, where people were walking their dogs.  There was more light here, so I was less scared.  By now, my trip was getting incredibly vivid, so much so that I got intense visual distortions even while I was walking.  The grass looked beautiful, and the remnants of the sun shone through a black silhouette of trees in the far distance.  It looked like a red water color bleeding into a blue, and then black, sky.  <br>I looked to my left and saw a dog staring at me.  This is wierd, I thought; its almost like it knows that I'm on shrooms, or that I can communicate with it.  We maintained eye contact for a while and then the dog went berzerk.  Without any provocation from me, it started violently barking and growling at me, spitting hatred at me.  I was so scared I literally jumped up into the air and shuddered violently in fright.   Luckily the owner came and took the dog away, but before I could prepare, another dog came walking by with its owner trailing behind a bit.  This dog also maintained eye contact with me, but seemed somehow more timid than the other one, almost as if it were frightened by me.  Both dogs continued to look back at me as they disappeared into the distance of the field.  <br>As I ran around on the streets trying to find a familiar road, I became more and more horribly disoriented until I finally found my way.  I fell into deep deep introspection as I walked down the street.<br>By now my trip reached a higher intensity and I could hear every object communicating with me, along with the visuals.  Sometimes the visuals too would say things to me. I hurriedly walked  trying to ignore how insane I was getting.  I wished desperately that I brought a sitter with me, and I just wanted to find my friends.  I felt like I was about to either die or go permanently insane any second, and that the only way I could avoid this fate was to find my friends, who could hopefully pull me out of my madness.  My mind began wandering: <br>I started to notice contrast in everything: the sun rises and then sets, there is light over the earth, then darkness, the leaves on trees die and then grow back with the seasonal changes, humans (and all forms of life) die and their bodies feed the earth, which uses these atoms to feed whatever else lives.  I started to feel like I was no different than a plant, or a rock.  I felt like even inanimate objects like the road, or a fence, or streetlights were alive because they were no more than a collection of atoms just like me.  And when I die, my atoms will disperse into the earth. Part of me will be soaked up by trees from the soil, and used in their internal chemical processes.  Therefore, I will be a tree when I die.  The minerals within me will solidify into rock and therefore I will also be a rock when I die.  But the list is endless.  I am 60% water, so when I die, I will be rainwater, part of a river, an ocean, coca Cola, etc.  <br>WHOOSH!! Suddenly a jogger ran past me so quickly that I tripped something horrific, and like with the dog, I jumped up into the air with fright and violently, uncontrollably shuddered.  After realizing it was just a jogger, I sped up my pace, and uncontrollably fell into trip mode again.  The introspection continued as if uninterrupted:<br>So, everything is everything.  My existence now is merely a conversation of atoms that collected together randomly from the creation of mother earth.   Form this argument, we can deduce that I, and everything else in the world (or the infinite universe for that matter) has always been alive and dead at the same time.  Life and death are illusions that humans constructed.  Much of our existence is based on this idea, but who is to say that it is true?   A rock is definitely not alive in the same sense that a human being is alive; rather, a rock is alive in a completely alien sense that humans will never understand.  A rock exists; it is a conversation between a collection of atoms just like us; it thinks on a level that humans will never understand, just like how a rock will never understand the way humans think.  Suspend disbelief for a moment, and put yourself in the rocks's shoes.  Who is to say that the rock doesn't perceive mankind as being dead and itself as being alive, just as we percieve ourselves alive and the rock as dead; therefore it lives.  <br>Everything I just said was a realization, half of it through introspection, and the other half through infinite conversations I had with every object I encountered on my journey back to my dorm.  I felt, I knew, that it was all true, and that there was a continuous train of thought that linked all of these ideas together in a convincing religion of sorts, but now I cannot remember the true scope of the vision I was given at the time.  I also could not figure out if this truth made me happy or sad. If this is  the truth of our existence then I will never exist again after I die. Instead, a rock will exist because of me; water will exist because of me, fruit will exist, and then when some guy eats the fruit, a human being will exist because of part of me. <br>While this idea was running though my head, I finally made it back to my dorm, and was thoroughly relieved to find my friends.  They were watching t.v. Completely oblivious to the madness I just lived through, and I couldnt decide if I wanted to cry in the most deepest depression of laugh in pure mania.  I started to try and relate my ideas to them through metaphors, but I continually failed to say anything coherent that they could understand, and the frustration of this was horrible.<br>While I lay in my bed, my leg turned into a pile of rocks for a period of time, and I had a mental conversation with what I thought to be God when I looked up at the light in my room.  I outstretched my hand towards the light and found that it was severed or possibly decayed from before, and from my mouth came the words: 'I feel like the only person who understands me is god and all he does is laugh at me.' <br>The trip eventually tapered off, and I felt kinda high for the remainder of the night until I slept it off.  Luckily, no bad dreams, or none that I can remember.\n\n\n"
}
