{
 "title": "Reality Laid Bare",
 "author": "SkiBum",
 "citation": "   SkiBum. \"Reality Laid Bare: experience with Nitrous Oxide, Salvia divinorum & 5-MeO DMT (ID 18664)\". Erowid.org. Jan 15, 2008. erowid.org/exp/18664",
 "substance": "Nitrous Oxide, Salvia divinorum & 5-MeO DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "0.3333 g",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "4 carts.",
   "inhaled",
   "Nitrous Oxide",
   " ",
   " ",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "30 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18664",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 15, 2008",
   "Views: 3170",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA good friend and myself had for some time been getting together regularly to share in the Nitrous experience. Let me say that a little marijuana is an incredible catalyst for the effects of Nitrous Oxide. I had been exposed to Salvia previously but had always found the initial effects physically uncomfortable; hot flashes being the main problem. Nitrous it turned out to be the perfect solution for my initial physical discomfort. The key is also a little mental preparation; breathing and some meditation. \r\nThe experience of being stretched into the Salvia space can be quite strange. The Nitrous allowed me to simply settle into the experience and enjoy the view, so to speak. The Salvia experience always tells me something if I let it. The vortex I had experienced in some of my earlier Salvia experimentation now crystallized into an entity which seemed completely benign. I felt drawn, almost stretched out toward it. The entire experience was so beautiful and strange that I found myself laughing. When I finally felt myself receding from the space of the Salvia and sliding back into my normal state my trusted friend loaded a small water pipe with a nominal hit of the 5-MeO-DMT. \r\nThe effect was startling. I found myself racing into the most lucid dream. I was at the gentle center of creation, seeing the reverberating energy such subtle chaos everywhere around me. I was a super-string vibrating with the same frequency as the most fundamental forces in the Universe. I am sure I experienced the core, it seemed completely and unpeakably beautiful. I saw a glimpse of an interconnectedness that defies any description, literal or mathematical. I was in the holiest of moments, I simply was. \r\nIn essence I realized that heaven does exist on Earth. I came to the conclusion that perhaps God (or god if it makes you feel better) would probably have given humanity a substance with which to better experience his divinity. A direct call so to speak, the creator's cell-phone number, the hot-line. After some of my experiences I believe that is what the pot and nitrous combination may be. It is the antithesis of Adam's apple in the sense that you bite and are returned to Eden. It allows me to go as far as I want within my mind, where creation and creativity are one and the same. The sensation is of a singularity, a point of infinite richness. I am drawn to some wonderful event horizon where I catch a glimpse of the truth , but can never cross into true under-standing. All this for about 10 bucks, two beers worth of cash. \r\nI can see a religion where instead of some vacuous wine and wafer ritual you sit in a circle meditating as you inhale the true soul of god. Spirituality could be more then a commodity, more then a Chicken Soup for the Soul paperback. It could be an experience available to anyone, unfiltered. Just use some common sense and some restraint. I use a balloon and limit myself to less then five cartidges per useage. I always inhale from a balloon. I trust the quality of the nitrous I am inhaling. Anything else is just asking for trouble. People have died and people have developed permanent nerve damage due to vitamin deficincies associated with excessive nitrous inhalation. I learn from their mistakes and use a trusted sitter. These are important experiences and can be safe. Peace out.\n\n\n"
}
