{
 "title": "Rollin on the Mellow Side",
 "author": "Neuro",
 "citation": "   Neuro. \"Rollin on the Mellow Side: experience with 5-MeO-DiPT & Clonazepam (Klonopin) (ID 18681)\". Erowid.org. Sep 1, 2006. erowid.org/exp/18681",
 "substance": "5-MeO-DiPT & Clonazepam (Klonopin)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "2.5 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   " ",
   "  ",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18681",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 1, 2006",
   "Views: 5525",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On this particular late autumn day in upstate NY, I felt the cool air against my skin while the low grey cloud ceiling tried to keep us in suspense as to whether it would drop the inevitable pure white snow it was holding...or just wait and tease. </p><p>In between my classes, I was sure to savor the moments.  I decided that a nice compliment might be some Klonopin for this lazy day.  I took 2mgs at about 1 o'clock and felt it in a short time, a light airy slow feeling, and at about dark, 4:30, I took another .5mg.  I had a 2 and a half hour personality class ahead of me in which we were to watch the movie 'The Fisher King' of which I knew nothing about.  The classroom has a giant projection screen and great sound.  I was rather tired and sluggish from the Klonopin by then and I figured I might snort a little 5-meo-dipt to pep me up, when the opening credits appeared and I saw that it was a Terry Gilliam film, I made my decision. </p><p>In the dark of the classroom, I (irresponsibly) eyed out half of a cap I had made at 12mg and did a little less. Very soon, I was torn into the movie, it was so strange, all the emotional upheaval and awkwardness reverberated through me in some collective empathy.  It was such a twisted movie, but Im not sure how much of that was the drugs, but the experience was great, this combo of Klonopin and foxy feels a bit like MDMA, not as intense as when I first began to do E, but better than it treats me now.  </p><p>Im writing this about 45min after the movie, my leg is shaking a mile a minute, but I feel great. I have done a few more miniscule lines and then cut myself off so as not to build toxicity.</p>"
}
