{
 "title": "Lost and Found",
 "author": "Mary Jane",
 "citation": "   Mary Jane. \"Lost and Found: experience with Amphetamines (Adderall) (ID 18715)\". Erowid.org. Aug 24, 2005. erowid.org/exp/18715",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Pharms - Buspirone",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18715",
   "Female",
   " ",
   "Not Given",
   "Aug 24, 2005",
   "Views: 12452",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hi there.  I want to share my experience in as few words possible.  I never abused drugs in high school and was an academic/athletic oriented student.  The week before I went to college I entered a world of bulimia which continued through my drug abusing in Jan of 2000.  I began going to clubs and 'rolling' on XTC with friends, doing coke (snorting), and once I did crystal meth.  At this time I also began smoking pot and taking xanax, klondopin, or valium as comedown tactics from the uppers.  I was attempting to trade one addiction (bulimia) for another (drugs) but continued binging and purging on the side as well.  </p><p>In August of 2000 I visited a doctor in Florida and he diagnosed me ADHD (among other disorders BPD and GAD) and prescribed me RITALIN (plus prozac and buspar which I continue to take).  I hated taking Ritalin orally so me and my boyfriend would snort some every weekend instead.  This continued until early 2001 when I began to hate everything to do with the evil drug Ritalin.  I had a baby in October 2001 and was drug free and bulimia free during my pregnancy.  In March 2002, I visited the doctor in Florida and he prescribed me ADDERALL for my ADHD and told me that it is less potent than RITALIN.  I later learned this untrue.  I took ADDERALL the first time and felt like I could go conquer the world.  I was truly higher than I had ever been, even from crystal meth.  The first day I took five because every time I would come down I would take more.  I continued taking it (as prescribed) 40mgs two times a day for two months and then ran out for four days.  I began horrible withdrawal, comparable to schizophrenia psychosis.  I couldn't even go to work much less focus my mind on any one thing, not even my baby boy.  It was petrifying.  </p><p>I got the next prescription filled and ten minutes later I felt 'PERFECT' again.  I realized I was dependent on a drug for the first time in my life, and would need to think about getting off of it with the help of a professional.  I was frightened for myself and my health.  I continued taking the ADDERALL from March 2002 until today (Nov 7).  Soon after I realized I had a dependency for AMPHETAMINE (which, for those of you who don't know, ADDERALL is composed of amphetamine salts and is highly addictive) I began experiencing tremors in the early part of the day that only pot would help subside, depression, heightened anxiety, picking at my eyebrows, leg hair, scalp hair, and skin, heart palpitations, and the feeling that bugs are crawling under my skin when I lay down to go to bed at night.  One night I was going to trim my long beautiful hair and ended up cutting it all the way to where you could see my scalp.  This was when I took action and committed myself to a nearby hospital.  At the hospital the doctor recommended a tapering dosage of Adderall with nothing to replace it.  I experienced insomnia with the lesser dosages, and as soon as I was discharged, slipped into another dark hole of depression.  </p><p>I was discharged a month ago, and am down to  10 mg of ADDERALL in the morning.  I feel less depression (but it's still looming behind me) and I have slept OK the last few nights.  10mg is an eighth of what I took to begin with.  This constitutes quite an accomplishment (thus far).  Luckily, I am immersed in another joy of my life which is distance running and writing poems.  I am also beginning composure of the book I plan to write, from which I hope to earn enough money for donation toward 10-fold research on the psychology and pharmacological treatments to assist those addicted to amphetamine and amphetamine bi-products in getting off of the evil, deadly, brain-damaging drug.  Speed kills for cheap thrills.  I haven't experienced much withdrawal yet, but am prepared for tomorrow when I take NO amphetamine.  I'll do what It takes to stay away from amphetamine (and all drugs - except pot) for good.  My mission is to devote time, knowledge, learning, research, and money to assisting others who are experiencing psychological and physical complications from prolonged use of amphetamine.  My goal is to make a difference so I may give back to my beloved Mother Earth.  </p><p>I hope that my short story helps someone see the light at the end of the tunnel.</p>"
}
