{
 "title": "I Might Be Fucked Up for Life",
 "author": "Retz",
 "citation": "   Retz. \"I Might Be Fucked Up for Life: experience with DXM, Cannabis & Alcohol (ID 18723)\". Erowid.org. Feb 10, 2011. erowid.org/exp/18723",
 "substance": "DXM, Cannabis & Alcohol",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 3:00",
   "300 mg",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 6:00",
   "900 mg",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 7:00",
   "1200 mg",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol - Hard",
   " ",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "18723",
   "Male",
   " ",
   "Not Given",
   "Feb 10, 2011",
   "Views: 3849",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is going to be a rather long report, but I think my experience is worth telling as it is a rather disturbing one of the darker sides of the substance. And it also shows how differently it acts on different people and that it can be a very dangerous drug contrary to many reports.</p><p>First a little bit about myself. I am 20 years old and I have been using alcohol (extensive amounts) since I was 15 and weed since I was 16 although weekly only for the last year. My smoking buddies and me had been looking for a psychedelic to use for a few months and we decided to use aminata muscaria, but be were unable to find any. We heard from a friend of us about Dexofan, a cough syrup that had psychedelic effects. This is a non-description drug in Estonia, where I live and so we got two 600 ml bottles of it with 30 mg/ml for the four of us.</p><p>Having drunk half a bottle per person for the four of us we waited. The results were very different. One of us had no effects except a terrible itch, two us puked like hell and had heavy visuals, but due to the nausea they have not tried it again. I on the other hand had no ill effects but got great visuals and felt euphoric like never before. It was great!</p><p>After the experience I tried to learn about the substance, found the DXM FAQ and found out that DXM is rather safe and great for recreational use. And I used it A LOT. I changed to pills (30 mg/per pill) and took 20 to 40 pills almost daily. I guess I dont have to mention that all other life stopped. The after effects in the mornings were far too great to ignore, I was unable to attend university and I had to either drink vodka or take the pills to get over them.</p><p>It started in the middle of September and now it is November already. My addiction culminated four days ago when I went to my cottage with 11 bottles of Dexofan (3300 Mg), 1 Litres of Vodka and 3 grams of cannabis. I had decided to experience the sigma plateau. I followed the advice I found on the net with 600 mg first on, followed by 600 after 3 hours and then 900 after another 3 hours. Perhaps my tolerance had already built up sufficiently, but I took the rest of the 1200 after another hour. I also had a lot of vodka down the way and smoked weed. And then it started!</p><p>I was barely conscious and saw only size distortions and had no thoughts. My mind was clear. The aliens came and were very real. But they ordered me to commit suicide, as I had seen them and it was unacceptable. If I dont commit suicide now, they will kill me slowly and painfully. That was all I could think. And I must say that I was very close to actually doing it.</p><p>Then my brain reset itself in a very weird way. I no longer saw the aliens and I was not drunk, although I must have drunk at least ¾ L of vodka. All I could think was What the fuck have I done? I went to the seaside and threw away my pipe. Then I again had the thoughts that I should kill myself, as I am insane. Somehow I managed to get home, tell my parents about what has happened and go to psychiatrist in the next morning. I am still not sure if am mad or not, but I definitely have some brain damage as everything looks new and strange to me.</p><p>I never had any of the more visual and vivid visual hallucinations while using DXM, but the world definitely seemed strange to me and I had intense closed eye visuals. And the euphoria was also intense. I also never puked while using it.</p><p>I hope I will be normal again some time in the future, but all I can say is that it does cause addiction in some people and I personally wouldnt recommend it to anyone. Ever.</p>"
}
