{
 "title": "Week From Hell",
 "author": "anonfrog",
 "citation": "   anonfrog. \"Week From Hell: experience with MDMA & Zoloft (ID 1874)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1874",
 "substance": "MDMA & Zoloft",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "oral",
   "MDMA",
   " ",
   "25 mg",
   "oral",
   "MDMA",
   " ",
   "  ",
   " ",
   "Pharms - Sertraline"
  ]
 ],
 "footer": [
  [
   "1999",
   "1874",
   "Female",
   " ",
   "Not Given",
   "Jun 16, 2000",
   "21294",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had the week from hell.  A week ago Friday, I took MDMA (75 mgs and a 25 mg boost).  At the time, I was torn about some major life decisions - I could not decide where to live in the fall, I was packing and crying non-stop for the 2 weeks before, and I decided to try the therapy route of MDMA to try to get me through and make a decision. I took it alone; I hung online for a bit, talked to A and F, and then spent quite a bit of time simply meditating on things.  Everything became clear - how I worked, how I would react to the situation, the right thing to do.  It was very productive.</p><p>I have a tendency to get very depressed after MDMA, so instead of 5htp, I took Zoloft to counter the crash.  Very quickly I had a six hour anxiety attack. At the time, in the midst of X forgetfulness, I forgot that I had taken zoloft. I then hung out, very strung out, but was able to sleep that night. I was fine until the following evening, when I took 50mgs more of zoloft.  Within 2 hours I felt all warm and arms and chest ached and worried and anxious. This persisted all the way into the next day, until finally, at 6pm, I took myself to the hospital. While there, I talked myself down, finally realizing I was not sick, that this was simply anxiety. I was fine again til the middle of the night and then I woke up after 1.5 hours of sleep, extremely anxious.  The next day, I collapsed at work, crying in tears in my bosses office and then went to my doctor.  I did not tell her about the MDMA however, so they prescribed more zoloft and then trazodone. Talking to people online, I had a full-fledged panic attack, and showed up at my doctors in tears, struggling for breath with a racing pulse.  She told me the trazodone was the best they could do for me.</p><p>So I started taking the drug, trusting the doctors. It didn't really help the sleep or the night panics (where I'd wake up from a dead sleep after 1.5 hours in a panic, and then need hours to recover from the adreneline surge and pass out again). By Friday, when I dosed, in about 2 hours, I'd get suicidally ideated for about 4 hours til the dose would start expiring from my system.  The panics continued all weekend; though sunday night, I stayed at mom's, took some sleep ninjas, and although I slept interruptedly, I did sleep.  I was actually fine - a little worrisome, but that was more my natural worrisome feeling - until about 2pm. At that point, I woke up anxious again; I went to work to distract myself and I lost emotional control again, once again crying in my boss's office. I had a conversation then online that I'm trying to let go; that felt slightly destabilizing.  I initiated it; as if to fuck up what seemed to be going well in my life. Perhaps that's overly harsh.  But it was good, because it made me realize there was far more going on than just drug-drug interactions in my system.</p><p>My friend and I went to my home; we sat down with a pad of paper and a pen, and we listed all of the things on my mind; set aside action items for now; action items for later; things I could work on; things that needed time.  It felt very relieving - like 'well, is that all. That's downright maneageable.'</p>"
}
