{
 "title": "Another Abuse Story",
 "author": "tollla",
 "citation": "   tollla. \"Another Abuse Story: experience with Ecstasy (ID 18744)\". Erowid.org. Nov 8, 2002. erowid.org/exp/18744",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18744",
   "Male",
   " ",
   "Not Given",
   "Nov 8, 2002",
   "Views: 12673",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nAfter reading the MDMA addiction stories here, I decided to write mine... I Wouldn't call it an addiction story... Just a short abuse story. </p><p>It all started in my birthday. I was doing E for about 1.5 year, but only once in a while. I had no trusty dealer to get my pills from, so I would get them through friends. Needless to say  that the quality was often very low, but that day it changed: a great friend of mine introduced me to a guy who had always excelent quality pills. I bought 2 pink motorollas and had an AMAZING night, these were probably the best pills I had ever taken till that day. The next friday night I called this guy and said I wanted 50 of these pills. I went to meet him, payed 150 and got them. I took 4 pills during the night, got higher than I ever had and had another amazing night.</p><p>I wanted these 50 pills to last for months, but it was summer and since I had no school, I would go out to a bar with my friends every night, and go out for clubbing every friday and saturday night. The first nights I decided to drop a pill or 2 to socialise and have fun, and promised myself It would be just the first nights, and them I would stop and do it only on weekends. But I was having so much fun that I gave up this idea and decided to do E every night. First it was 1-2 pills per night because each pill would last for about 3 hours, but after 4-5 nights I would take one every 1.5h. The effects didn't got weaker, just lasted a lot less time. One night I went to a all-night party at a friend's house and dropped 8 pills during the night. The next day when I went to bed, I thought I would die. I don't know if it was my blood pressure, but some times I felt a very strong pressure in my head, it seemed like my head was about to explode... A terrible feeling, as you can imagine. It would pass in about 10 seconds, and them it would come back. </p><p>I had this feeling for 4 hours, but this didn't gave me a lesson: the next night I was out for clubbing. I double dropped and felt NOTHING AT ALL. I realised my serotonin level was really low and decided not to drop any pill during the whole week. Obviously I wasn't able to do it, and Wednesday night I took a pill just to see if it would do anything to me. It did, so I dropped 3 more that night.</p><p>This went on until all my pills were gone. I had that 'pressure in the head' thing again after going to a big party and doing 10 pills.</p><p>I had little experience with E and did 50 pills in TWO WEEKS! I stopped doing pills during the week, but continued to do 4-5 every saturday night until the summer vacations ended. When school started again, I decided to focus myself on studying and since then I just dropped 1 pill last weekend, and the effect lasted for more than 3 hours :))). I don't crave it, I don't feel any side effect and I'm doing very good at school. I realised that my problem with E is different from everyone else's: i can't control my usage if I have pills, but if I don't have them, I don't really care that much. Thanks God I'm like this, It could have been a very ugly situation. And I'm also glad that my brain is so resistent to E's neurotoxicity, because a lot of people I know have memory problems due to It. </p><p>I still think alot about E's amazing effect, it is my drug of choice along with cocaine, but as with coke, I learned to save it for special ocasions.</p><p>Peace, Love, Unity, Respect :) Be safe [[]]</p>"
}
