{
 "title": "Now is the Transition to the Dark Time",
 "author": "Amitabha Buddha",
 "citation": "   Amitabha Buddha. \"Now is the Transition to the Dark Time: experience with DPT (ID 1875)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1875",
 "substance": "DPT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "IM",
   "DPT"
  ]
 ],
 "footer": [
  [
   "",
   "1875",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 16, 2000",
   "11384",
   " "
  ]
 ],
 "report": "</p>Participants: 7 people (A, B, C, C2, D, J, me) \rSetting: A&B's apartment \rSet: have not eaten anything since lunch, have a slight headache</p><p>4:00am Notes</p><p>Onset was reminiscent of DMT, with rapid visual distortions. The changes altered proportion and color. Everything was very asymetric, unlike the symetrical geometries of DMT. Very physically uncomfortable. I'm concerned that this is not happening within a sacred context. Should have created a space to contain the energies. Rapidly overwhelmed with sensation and perception---lots and lots of sensory data---drowning in the noise. Body is hot and cold and sweating and feeling very sick. Can't sit still, keep moving from place to place. Difficult to keep it together. Must breathe. I'm not okay. D says I'm fine, but I'm not. </p><p>Everything feels wrong. C is lying unresponsive on the floor; somewhere else. I lie next to her and she startles at my touch, eyes wide and pupils dialated. She is completely altered. Blood. Undead. Pale skin, sucking the life out. Has she turned into a vampire? This is the dying time. Now is the transition to the dark time. One moment reality resembles something I might once have known. The next moment everything is completely different. Puking my guts out all over the table and floor. Moving around the apartment, lying on the yoga mat. More puking on the floor. I'm being washed away by waves of overload. We've all poisoned ourselves. Heavens Gate all over again. Imagery of the cops finding the seven of us sprawled all over the space in weird contorted positions, pale white, dead. No I want to live. Breathe. I am. Losing focus. More puking on the floor. Missed the oriental carpet. Where is all this puke coming from? I haven't eaten in over 12 hours. B is walking C around the apartment. She is very non-responsive. Took him five minutes to get her to stand. She moves very slowly, her muscles are very rigid. C standing in the middle of the room, hands together in namaste, staring off into another reality. He takes her around the apartment and into the bedroom. Jealousy. Why does he get the girl and I get sick? Am I being betrayed by my friends? Somewhere in there I wasn't sure of anything. Hard to associate breathing. Rolling around on the floor, flailing my limbs. I have limbs. Lying on the carpet in the Osiris Slain posture. Trying to hum the notes of the theme to the 4th movement of Beethoven's 9th Symphony. Aum. Aum. Aum. Slowly reality begins to settle down. Multiple images in my visual field. Sparkly colors. I'm going to be ok. J is sitting up again, looks like he made it. If he pulled through and he's much older than I, I guess I'm going to live. Things are getting more settled. Easier to communicate with people and move around the space. C is still very very far away. Sitting on the couch, eyes wide open, still very rigid. C2 is talking to her for awhile. She responds in slow motion. Seems very frightened, starting to perform actions but not following through. I'm feeling very shaky, but going to be ok. Slowly returning to baseline. C is still way out of it, slow to respond even after the rest of us are returning to consensus reality. I manage to get a smile out of her and I feel her muscles relax ever so slightly in my hand. By 1am we're all mostly back to normal.</p><p>At one point, 'I am', was too hard to hang on to. I thought of the Endless Light and for a brief moment the illumination shone down upon me, but it was fleeting and I couldn't hold on to it.</p><p>The sensations became so confused that it was difficult to differentiate things and make coherence of anything. On top of that I was getting major circuit I alerts which made it difficult to pay attention to anything else going on. A lot of the trip was wrapped up in circuit I issues.</p><p>It hit me very hard, knocked me around a bit, chewed me up and spit me back out. Way too intense. 100mg was definitely too much. J seemed to have a perfectly fine trip on only 50mg. C2's onset was more slow resulting from the several tokes from the vaporisor. He was up and back down before the rest of us, a more gentle trip. I would try it again with the lower dose and more preparation.</p><p>Chronology was about 2 minutes to first alert, half an hour to full blown +3 experience. Peak lasted about an hour and a half. Things started becoming normal after about 3 hours. Back to baseline in 4 hours and one eternity later.</p>"
}
