{
 "title": "Dipropyl Holy Ghost Spirit",
 "author": "Toad",
 "citation": "   Toad. \"Dipropyl Holy Ghost Spirit: experience with DPT & Moclobemide (ID 1876)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1876",
 "substance": "DPT & Moclobemide",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Moclobemide",
   "  T+ 1:00",
   "140 mg",
   "oral",
   "DPT",
   "  T+ 3:15",
   "150 mg",
   "insufflated",
   "DPT"
  ]
 ],
 "footer": [
  [
   "1998",
   "1876",
   "Male",
   " ",
   "Not Given",
   "Jun 16, 2000",
   "Views: 37600",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The Great Connection with the dipropyl holy ghost spirit</p><p>With all the latest flight control efforts I found the current tentacle of dpt exploration beckoning. Wanting to further push the envelope of known variables I decided to travel huasca style.</p><p>With suitcase in hand, appropriately empty bowels, and a good luck kiss from the doodle bug I began the first phase of the journey. Before giving my evening massage I pre-dosed orally with 150mg of moclobemide (T) and waited an hour for it to manifest full effect. I like moclobemide, it's very clear substance, a no-frills baste in your own juices sort of thing. After the appropriate mao inhibition time was allotted I ingested 140mg of DPT (T+1h) and reversed roles to the receiving end of the way station. Effects of the DPT were noted within 45 min and progressed upwards for another 15-30 minutes followed by a solid plateau for another hour (T+3h). The effects of the brew were very seductive, much like a little peck on the cheek just to let me feel the good intentions of the holy ghost spirit. It was clearly active and quite pleasurable at this level, but I wanted more! This rather emaciated toad required a more nourishing full bodied psychedelic meal. Belly up to the bar boy, up the nose it's got to go. With launch indicators screaming green I prepared 150mg of DPT for insufflation with an excited trembling hand. </p><p>Shhnorkling the DPT was really not as bad as I had anticipated. Little bumps up the snooter provided a minimal burn factor, and once I was underway it seemed to numb the area in general. There was also some shall we say *interesting* tasting post nasal drip that was part of the deal. The effects came on strong and fast and within 15 minutes I was blasting (T+3.5h). The nature of this spirit is of higher caliber and definitely warrants first class seating. The overall drive and color was very user *friendly* to me and allowed for an overall lazy boy relaxation effect. I felt as if I had totally relinquished control of the ship, and yet I did not feel threatened or fearful in any way. There was no *rub* like I get with DMT. The rub can best be described as having your Big Brother repeatedly slam dunk your head in the pool and holding your head underwater while simultaneously laughing at your lesser power. But the evil is another story... </p><p>The holy ghost spirit is richly shaded with aquamarine color tones and cool blue asymmetrical splashings. I found myself spontaneously contracting my pelvis and perineum in ecstacy during certain periods of the trip. It was if my human essence was concentrated and pushed into an orgasmic ball in-between my genitals and my anus. Hips wide open, life force thrusting, feeling the music move me. I never knew fucking Jesus could be so good. Meanwhile to my immediate stage left, the doodle bug drifts along in a soft slumber with her pussy hanging out. What a setting... can ya dig?</p><p>The insights that poured forth during the viewing were of great value to me and they clarified some aspects of my data program and life input station that I tend to loose touch with and create stress around. The healer archetype was again issued, and the eternal greeting card of the now was printed, signed, and sealed with a kiss. I can see who I really am. To see myself truthfully in totality is immensely stress reducing. When the whole gift package of unique manifestation is fully experienced by the experiencer, the human being awakens to it's own inherent creativity. In such an awakening the input/output terminals are no longer in conflict and selectively cut off the stressful projected mental fantasy of ones own self interpretation . With such a truthful revealing one knows where one stands in the creation game and no longer needs to propagate the 'what I think I am' stress machine. It's a fine sense the full potential which translates into a feeling that everything is just perfect the way that it is. Hallaluya Praise Jesus Amen </p><p>In summary this stuff rocks!</p><p>The effects of snorting were pretty full on for an hour followed by 2-3 hours of trailing down. Physically it felt very clear and I did not have even a hint of nausea or somatic problems other than the 'revival vibration'during or after the experience. I'm very much looking forward to trying the IM route, as I can clearly see why it is most likely the route of choice for the true believer. </p><p>I feel utterly blessed to have contacted the holy ghost spirit</p><p>Amen</p>"
}
