{
 "title": "Possible Energy Detection Method?",
 "author": "Xantryper",
 "citation": "   Xantryper. \"Possible Energy Detection Method?: experience with 5-MeO-DiPT (ID 18761)\". Erowid.org. Aug 20, 2004. erowid.org/exp/18761",
 "substance": "5-MeO-DiPT",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "21 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18761",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 20, 2004",
   "Views: 4998",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night I decided to try the 5meo-dipt again. My last experience was not that good, mostly because I didnt really want to trip that night. Accidental trips are not always the most fun. For this trip I took 21mg 5meo-dipt along with 3 grams of potassium gluconate. I am not sure if the unique effects that I experienced were due to this combination or not. Further research will be necessary to verify or disprove this. It was awesome to see goodygrrl again. She most defiantly added a great positive effect to this experience. The 5meo-dipt was in dry gel form. The drug took almost an hour and a half to kick in. </p><p>At around T+3 hrs I started to notice that I could feel an energy field from the person that I was touching. My brain was somehow able to tune into this energy and have some type of communication with it. It was surely a most interesting experience that these words in no way convey, but I will try. There was an intense magnification of sexual energy. I was intensely tuned to this. I could feel this energy in waves, and its ramping effects. It was amazing. As I started to practice tuning into this energy I got better and more consistent. At first I needed to be in direct contact to feel the energy, but after I became more aware of this energy I was able to sense it at a further distance, but being in direct contact had the strongest signal. I am not currently in a place to speculate the origin of this energy or even its possible transfer method. After I became aware of this ability I started to try sensing the energy of different things. Being in this energy communication mode was extremely euphoric, and I could see it becoming quite addictive. </p><p>While in communication with a tree I was able to leave by body for a short amount of time voluntarily, and transcend to the other dimension where the great collective unconscious resides. I have never transcended voluntary before, but I have been thrown there by the mushrooms before. I feel the reason that I was there for only a short period of time 15 seconds max, was because I was scared. I am beginning to understand. Thank you.</p>"
}
