{
 "title": "The Path is Not Clearly Signposted",
 "author": "Ant",
 "citation": "   Ant. \"The Path is Not Clearly Signposted: experience with DXM (ID 1879)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1879",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 1879",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 89317",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAnd all the reflective surfaces, all identifiable elements within my field of view, that impinge upon my consciousness, that insinuate themselves within my psyche, began to dislocate. They separated from, and lost the frame of reference that reality normally provided, they lose context and become surreal elements in and of themselves - they exude their inherent Huxleian 'isness'. Although my field of vision has discernibly narrowed, I have a growing awareness of a great region of possibility, a field of as yet unrealised probability existing within my peripheral arcs - I need but turn my head to look, to trigger the transformation and selection of a new reality, to determine life or death for Schroedingers cat with the merest glance, but do not for fear of disturbing my current reverie (1).\r\nColour drains from all I survey, and an alien mechanical tone replaces it, a washed out shade of no discernible flavour. The pseudo-colour takes on a texture, and all of the randomly dislocated objects now revelling in their isness take on a carpeting of this grimy foreign tone (2).\r\nMy field of view continues to distort and diminish and before final disintegration, the sharp right-angled thing (that and the fan shaped thing dominate the scene) takes on an incandescent glow prior to vanishing completely (much like the final glimmer at sunset appearing ephemerally brighter than the light that had faded moments before). My eyes close, I enter the internal realms, and am immediately confronted with the electric blue aurora borealis of the inner antipodes. Hazes of neon bright flora dance across the textured black distance in a perfectly choreographed harmony to Jean Michel Jarres Zoolook. I perceive motion, not just as a result of the movement before my eyes, but I can feel the gravitational ebb and flow that accompanies acceleration and changes in the directional vector throughout my being, and the movement and visuals are completely and integrally linked to the music swirling throughout (3).\r\nI determine to do more than smell the flowers and enjoy the ride, I would attempt to travel the road within that inner realm wherever it lead, whatever the outcome. I could feel the tension building, particularly in my jaw and neck, and sweat bead across my back as the intensity climbed. My body judders and teeth chatter - drugs may facilitate entrance into this cerebral nether world, but the grasping of answers is still bloody hard work! With the greatest, most objective amount of concentration I can still muster, I grapple with this new reality, try to force the myriad visions to reveal the path (4) - it is difficult to find, and easily lost within the fractured crystalline opalescence that surrounds me. The colours continually change and swirl within the nebulous organic mist (5), and that aspect of self that retains some semblance of detachment visualises travel along the contorted and convoluted synaptic pathways, through nerve ganglia and neural links that exist within the human mind, all the while being driven by the sounds around me.\r\nThere was something that I was tracking - I became aware that there was indeed a goal toward which I plunged, an answer within to an as yet unarticulated question, only I was too weak, became distracted and lost my way. The path is not clearly signposted, it is in fact incredibly difficult to even identify, and there is so much to see and experience on the way to an unknown destination. Weathered stone tablets of a modern glyphic rather than the expected cuneiform, and tripartite sculptures of rippled black slate and electric blue-white glass were my downfall! (6).\r\n1. Movement is difficult. All of my limbs and components feel incredibly heavy and 'compartmentalised'. I know still that I could move, but the energy required to break the inertia of my current state would be enormous, and besides, I'm very comfortable as I am. Over time the state of dissociation accompanying this experience increases - I know that I have an arm, and I know that there is an arm above my head, but whether there is anything more than a coincidental link between those two statements is not known.\r\n2. The carpeting effect reminded me of a faded, dry, cricket pitch, green - not that it was, but it felt 'green' without necessarily being of that colour.\r\n3. Many drugs affect the electrical messages sent to and from various parts of the brain, primarily those pertaining to visual information. Messages from any of the senses can be perceived as merged together, creating a sensation known as 'synesthesia.' This most commonly is represented as 'hearing colors' or 'seeing sounds.' Definitely what was occurring.\r\n4. Much like within a lucid dream. As a child I would have lucid dreams quite regularly, and quickly learnt to manipulate the dream state, much like directing your own movie. It was sometimes hard work then, and it was definitely hard work this time. The internal landscape roils and twists to escape the shackles of comprehension and ones mental grasp, it is not easily subdued, and its secrets are not easily won.\r\n5. There were other inhabitants within this realm occupying the very edge of consciousness. Many cloudy, dissipating faces were seen during travels, inner demons that would tear substance from the aurora with which to form themselves and then just as quickly dissolve back into the background swirls. Skeletal horseman within a flowing, golden, gelatinous river, contrived and constructed of the very liquid in which they existed, and only discernible in profile, against the darkened distance.\r\n6. My concentration lapsed, and the question of art entered my mind. I got caught up in thoughts of object d'art that were weathered stone tablets, very old, very much damaged by wind and sand, fractured, broken, reminiscent of the Rosetta stone, but containing 'valid' texts from Hunter S. Thompson, or the chemical data and molecular structure of LSD 25. Along with this was the tripartite sculpture...Three large slabs of black textured slate of decreasing width, but constant height and depth (maybe 9 feet high). The major pillar had a non representational swirl of electric blue-white glass melted into its surface, an abstract form but with inherent significance. The swirled form overlapped partially onto the second, smaller, and stepped back slab, and then only a few vague lines onto the third. (I think I may have to actually make these items - maybe...can glass be melted and merged with the surface of black slate?)\n\n\n"
}
