{
 "title": "Juice of the LOGOS",
 "author": "Vercingetorix",
 "citation": "   Vercingetorix. \"Juice of the LOGOS: experience with Datura (ID 18810)\". Erowid.org. Nov 11, 2002. erowid.org/exp/18810",
 "substance": "Datura",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Datura",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18810",
   "Male",
   " ",
   "Not Given",
   "Nov 11, 2002",
   "Views: 9603",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: When I experienced the trip just prior to Holloween of this year I had already used alcohol and Cannabis extensively, Hash, many Morning Glories, (see 'Everything is Dancing'), Nightshade, Jimson Weed, dimenhydrinate, Nutmeg, Mushrooms, nearly all prescribed opiates, around 6 or 7 SSRI's and mood stabilizers, Nitrous, Kava Kava, DXM and some unmentionables which I fail to recall. I'm  not exceedingly reckless since I'm more of the shamanistic mindset. </p><p>This was the third [or fourth (arguable)] time I have investigated the qualities of a datura trip, regardless this time was the most intense. It was also the most monumental trip I ever had. Hence I wrote this report. </p><p>Datura-induced insanity is in essence a schizophrenic experience. I dream while I am awake, (I believe it has something to do with its effect on the cerebral cortex). It is shamanistic and as I described to a friend earlier today Datura is 'psychedelic period.' It teaches me to appreciate my sanity. </p><p>Preparation Ingestion and Onset</p><p>For this trip myself and two friends A and B steeped many very large dry Jimson Weed leaves. This took some time as we allowed excess water to evaporate leaving a dark near black ichor. To this we added Mint tea and sugar which nearly masked the nasty part of the taste. Friend B couldn't take the taste so I additionally drank her dose rationalizing I was of strong enough mind. It was the juice of the LOGOS.</p><p>20 minutes after dosing I was VERY apprehensive with the foreknowledge that this trip was to be beyond insane. I was already datura stoned, by that point toked on good herbals, and sinking with a heavy feeling into my friend's bed. I was worried because I knew that this time I would trip balls. Not a good mindset. </p><p>1 hr had rolled by when I started tripping. [The trip is best described more qualitatively at this point] </p><p>The Trip In Summary</p><p>I didn't plan to write a report for this so it is disjointed. Most of the time I spent sitting in my friends' apartment after A and B passed out shortly after dosing. While other friends drank a shitload of beer and went crazy I maintained a surprising amount of sanity and more importantly control. You have to steel your nerves when tripping on datura. I kept looking down at my lap to see different objects in my hands. I must've smoked 7 fake cigarettes.</p><p>All the while everywhere I looked I would see people that weren't there. The most memorable hallucination was when I took a break from the sanity of my friends' music and TV. I looked down to see my hands rapidly playing a Fender Stratocaster, possibly a fat strat (it was that detailed and the memory still is here today).</p><p>While tripping on datura I do not notice the hallucination to be a hallucination till after it occurs. I realized while tripping that I could tell fantasy from reality by taking an object or person in question and physically look away from them/it. When I looked back, the hallucination if it were that, would be gone.  Before tripping I had hypothesized that by utilizing methods of lucid dreaming, meditation, and ways of awakening from a dream I could control my own mind. It worked. </p><p>Datura is a dramamine trip with less baggage that can be more extreme. Though words can be used to express accurate details they misconstrue, alter, and leave out, many of the broader more subtle messages of thought.  </p><p>My friend who drove me back to the dorm that night gave me a ciggarette which I gradualy proceeded to forget was real, believing it was just another of a endless stream of fake ones. While heading back I dropped it in my lap regarding the issueing smoke as a hallucination. It wasn't till my friend asked about the ciggarette that I realized it was real. That was about 5 minutes later. Luckily I didn't catch on fire. When I returned to the dorm I continued seeing ppl that weren't  in my room in my room. I also had several conversations out loud, one was to a makeshift bong. I wish it were on tape. It was an entity when I talked to it. The trip got me thinking a lot more in the philosophical and theological sense. Looking back I ponder If I was talking to my ancestors? or spirits? Maybe Datura shows another dimension of concious, a plane where spirits reside inside our own personal reality. That started me reading a lot of Descartes, Berkely, Hartshorne and Whitehead. </p><p>Later on in the trip while looking into the mirror in my dormroom I saw someone else mimicking me. Then I recalled it as a common effect, like the fake ciggarettes. That laid the matter to rest. The aftereffects of the trip was a cleansing feeling of catharsis, and pupils which were dilated for a week. As an aside to the wise, one must realize before taking datura that there is no going back. It is like acid in the sense that it lasts so long and won't stop. I wanted the trip to stop with Datura. In the case of acid where I wish my closed eye sight to be 'painted black' to get away from the colors preventing sleep, with Datura it's a whole new ballgame since I'm trying to get away from voices in my head and those things I see. Ultimately it's amazing our minds have so much potential. When I trip I discover what I already know (Socrates in the Meno?). Whether it's of the LOGOS or one's singular subconcious at this point it is anyone's call.</p><p>I think Datura research could provide answers to many of questions scientific and spiritual. I noticed I was left handed while under its influence and have circumspected why. I will continue to examine Datura's psychedelic effects in the future, to me it is deeper then any other psychedelic. To close remember; never abuse drugs, respect them. Do your homework and enter a trip with an introspective mindset otherwise you may come to harm or fall into a pattern of abuse that could leave you impaired or dead.  </p><p>Notes, Extended Background and Words of Advice:</p><p>Read up on this entheogen and once you've decided you can take it do not take it for a week. </p><p>Make sure you know the dosage.</p><p>Have a sitter, you could die.</p><p>No sharp objects, or fire (NO CIGARETTES!)</p><p>Watching TV gave me a break btw tripping. It calmed me down.</p><p>I actually prayed as a sign of respect when I took the leaves from the Datura. According to the Chinese when you pick the leaves the feeling you experience at that junction in time will be what you feel when you dose. I kept this in mind and was at peace throughout the trip. Self-fullfilling prophecy? Placebo? </p><p>Respect Datura as you would any religious sacrament. It is one and has been used for thousands of years, probably by your ancestors as it is universal. The Pascataway Indians used it ceremonially in puberty rights to talk to their ancestors. The leaves I procured grew in the middle of a field on my grandmother's farm; the land was an old indian settlement and one easily finds artifacts dating back an easy 6 thousand years. That means there's an interesting and damn good chance those Datura plants were descended from a long line of plants used shamanistically. I wonder who used them between us and the Pascataway. And what did we see.</p>"
}
