{
 "title": "DXM Contemplations",
 "author": "Ant",
 "citation": "Citation:   Ant. \"DXM Contemplations: experience with DXM (ID 1884)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1884",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "DXM"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 1884",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 12067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe world is indeed full of men leading lives of quiet desperation (to paraphrase some unknown contributor) and there are only two ways in which to make a contribution to the grand scheme of things...one can procreate and thus ensure survival of the species, or one can make an addition to the vast reservoir of human knowledge (this also includes all of the fine arts - they help to illustrate and explain the human condition) - some do both, and some do neither, but in the final wash, these are the only ways in which to leave a permanent mark, to have broadened the horizons and expanded the sphere of humanity.\r\nCuriosity is one of the fundamental survival traits imbedded within our hard wiring. The major one being of course the driving sexual urge, the prime directive for continuation of the species, but then a close second comes curiosity. The only way to ensure that individuals survive long enough to complete their genetic raison d'être, is to provide enough diversions and distractions to keep the greatly expanded human intellect constantly challenged and amused. The removal or even diminishment in the intensity of this itch would no doubt result in widespread malaise and serious mental disorders resulting in stagnation and eventual disintegration of the species. Curiosity is essential to the human condition.\r\nGen X (personality type rather than year set (born '60-'76) - there are baby boomers being conceived even as we speak)- indelibly cynic, a generation in crisis. We were born knowing that something fishy was going on, we already knew there was a joke being played upon humanity - an innate generational knowledge? - we grew up on tenterhooks, we just gotta know...\r\nThe Cosmic Joke: The Universes whole intent is to just quite not let you know! (now having pondered and solved that timeless question, what's next for our intrepid band of philosophic trekkers as they journey throughout the realms of endoreality? What region of the human condition do we next explore?)\r\nThe feel rides smooth through you, and you get that taste in the brain, reminiscent of previous times, a recall trigger as powerful as the aroma of childhood summers - but this is similar to conjuring up memories upon the first inhalation of a new scent....how does one recall a sensation yet to be experienced? It all feels like rain stained images crowding the subconscious windows...hard to specify the detail but essentially familiar.\r\nAll the words have been used up - we are destined to be derivative, something that jangles at the very essence of this generation.\r\nPainted into a corner where non-style becomes a style - there's nowhere else to move.\r\nPotential becomes meaningless unless coupled with opportunity.\r\nAll I write, all I think, becomes too trite, too quick - it had more meaning a minute ago! None of it will appeal to what we would generally refer to as the masses. Is it not bizarre that we must hope that logic catches on like any other popular craze? Is it's inherent truth not defiant enough to demand respect? They won't quite grasp the aspect we have envisioned, and Lara is enthusing a conspiracy theory linking the acid tests and rave cultures - she's most likely onto something - we live in the era of conspiracy and social doubt but it's not simply the domain of those in power, rather an echo of the great Cosmic Joke...life itself is an incarnation of the greater conspiracy. The cosmos gives us sentience, a great intellect and the faculty of curiosity, knowing all along that the answers we seek to the fundamental questions the universe poses are unattainable - this is the greatest conspiracy of all...The Universes whole intent is to just quite not let you know!\r\nIs it cheating God to reach enlightenment without suffering for your cause? Can the worth of art be judged by the level of suffering endured throughout its production?\r\r\n'Is suffering an obligation or something lyrical?' -- Jean Cocteau\r\n'The road of excess leads to the palace of wisdom' -- William Blake\r\n\r\nDoes the ends justify the means if the only victim is oneself. Is the sacrifice of oneself justified upon the altar of knowledge?\r\nThere have been too many lost concepts. What happens to those answers almost but not quite grasped by the searching dilettante - do they simply return to the aether, awaiting a more dexterous mind to pluck them down and confine them to paper.\r\nCall me the Gen-X aphorism man - a vitriolic social commentator (although not exactly a satirisist).\r\nWe need not to be 'them'. Weird is the only way to determine you're not them.\r\nFlippancy is simply a disguise for distance.\r\nLife is simply what occurs between birth and death. Life is simply the formula bound within the parenthesis of birth and death. There is no greater truth than this.\r\nCynicism cannot be a passion. Cynicism is, and must be the antithesis of passion.\r\nMuch scarier to be fucked up in daylight. The dark is warm and maternal, and the daylight contains so many jagged edges. The solar searchlight leaves nowhere to hide other than to retreat inside, behind the reflective masks society has taught us to so deftly wield.\r\nCassady becomes the hinge for the whole beat/hippie thing - the linchpin (and who the hell was Linch anyway?), the catalyst, the essence - and the essence don't stop to write. He's a not quite known until those he infects, the slower missionaries, take time to tell the rest of us. How do we identify the Cassady's of now? Can a catalyst of this type only be determined in hindsight?\r\nIs DXM a synergistic drug? It produced a state of technophobia, fear of the dichotomous brash dyslexic music. A triangular grey limbo plane defined by it's three points (sometimes a line determined by two, a point determined by one - does the square determined by four exist?? Is there a fourth point that would twist the space of endoreality to suit the other three and thus define this new plane. I visualise the Merry Pranksters as having define a sphere of multiple points.) with psycho telephathic nuances. All points could feel the surge and ebb, the rise and fall of the cerebral tides - we just knew, but could neither define the mechanism nor carrier of this knowledge.\n\n\n"
}