{
 "title": "The Universe Falls Apart",
 "author": "Dankman",
 "citation": "Citation:   Dankman. \"The Universe Falls Apart: experience with Salvia divinorum (5x extract) (ID 18848)\". Erowid.org. Aug 15, 2005. erowid.org/exp/18848",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18848",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 15, 2005",
   "Views: 4084",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI ordered some salvia extract from a source on the internet and it was delivered to me on Halloween.  I was very anxious to try the substance but still had to go to one more class before I was done with school for the day.  I had been reading many trip reports  in order to try and prepare myself for the experience, and I felt confident my previous encounters with psilocybin, marijuana, DXM, and LSD had prepared me for any drug I would try.  \r\nAfter class, I returned to my dorm room with my girlfriend (also my sitter for the trip) and my salvia.  I turned all of the lights off except for a small lamp in the corner, put on Dark Side of the Moon, and loaded my bong.  I also placed a chair next to my window in case I couldn't make it back to my bed after smoking.  At this point I was beginning to get a little nervous about what I was going to experience, but at the same time I felt very curious about delving into the salvia universe.  I had no medications, herbs or supplements in my system whatsoever, I was ready to see what salvia had to offer to me.  I opened the window and lit up a medium-sized bowl of the herb with a butane lighter.  The extract produced a large amount of smoke which quickly filled the pipe and then proceeded to enter my lungs where it stayed for about 20-30 seconds.  As I exhaled the first hit, there was a slight change in my perception of the world, it can only be described as a 'fakeness' to everything around me, which I found both funny and interesting at the time.  Soon I had taken two more huge tokes and the real trip had begun.\r\nBefore describing the trip, I should emphasize that my physical body had a mind of its own throughout the entire trip, although this didn't come to my attention until the effects had worn off.  After I describe what was going through my mind, I will describe the actions of my body as noted by my girlfriend.\r\nAs I exhaled my third hit, the effects of the salvia were in full force.  There is a building across from my room and as I stared at it, visuals began to appear in harmony with the Pink Floyd.  From my experiences, music is the most important factor in the Salvia trip, and this was no exception.  I became engulfed in the music, and in the wall a translucent outline of a human hand formed.  From this one hand, thousands of others arose horizontally across the building and they then cascaded down the building.  Looking back on the trip, I am not sure whether or not what I saw was actually hands, or just some basic form of matter, almost like the atom.  I can clearly recollect having the vision of the hand at some point, but it is likely that it transformed into these atoms as I began to see that the entire world was composed of them.  It was no longer just the building, but also the ground, the sidewalk, the trees, and even the sky.  Also, as I saw objects decompose into thousands of atoms, they would begin to fall downward with great speed until they were miles below me, and even then they kept falling.  \r\nWatching these events was very interesting to me and once the outdoor world had decomposed completely, objects in my room began to do the same.  I watched my desk, my TV, my stereo and everything else in my room disintegrate and I knew I was next to fall apart.  Let me remind you that Dark Side is still playing and is the basis for everything else that is taking place in the trip.  As I came to realize that I would soon be torn into millions of atoms, the trip went bad.  Up to this point I had been content with watching everything, but knowing that I would soon no longer exist and not being able to do anything to stop it was too much to handle.  But as I said, I couldn't make it stop and I felt and saw my body fall apart into a heap of matter which mingled with everything else.  Once my body began to fall apart, my point of view changed to third person and I could actually see myself fall into nothing but these atoms which now comprised the entire world.  After this point, there was a period where there were no longer visuals, but nothing in my room looked at all familiar.  Soon, the salvia completely wore off and I was left completely mind-blown.  \r\nI felt I should post this experience because it is unlike any others I've read and it made me see how valuable this herb can be.  Salvia made me see that I am no different from the earth, the sky, or anything else in the world.  Everything is composed of the same basic matter, and no one has the right to think that they are better than anyone else.  I'm not trying to sound like a damn tree-huggin' hippie, but it really is true.  In addition to the trip itself, I found the come-down to be amazing because some effects were still present but the mind could comprehend the thoughts more easily.  It is during this time that I came to all of my conclusions about what the trip meant, and it helped me see how insignificant our everyday concerns are.  I just feel it is a shame that some people never stop with all their material worries to see how beautiful life really is.  \r\nWhen I came out of the trip, I realized I had spilled the bong water and had a big cut on my head.  My girlfriend said I dropped the bong right after I finished smoking, I was just looking out the window and it fell out of my hands.  I got the cut on my forehead from falling into the window sill (I think this happened when I saw myself turn into atoms and fall apart).  She said I looked horrifed and she never saw me blink throughout the experience.  I think the only reason the trip ended was because she turned off the music.  She told me that I started to get really wierd and mumbled all kinds of noises after I fell so she turned off the music and turned on the lights.  She tried salvia the next day and had an amazing, although completely different type of trip.\r\nIn conclusion, I would like to caution anyone before they try salvia--it is stronger than I imagined.  I have had some extremely strong mushroom trips in the past but nothing I've ever done can compare to the strength of this herb.  Just because it is legal doesn't mean it isn't powerful.  Although my experience lasted only five minutes (seemed like an hour) I can honestly say that I learned more in those five minutes than I would normally learn in months or even years.  Thanks for reading!\n\n\n"
}