{
 "title": "Out of My Head",
 "author": "Jon Riley",
 "citation": "   Jon Riley. \"Out of My Head: experience with DXM (ID 1885)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1885",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1885",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 14887",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter reading all the messages on experiences with cough syrup, I decided to try it for myself. Last friday, a friend and I went down to the local supermarket, read the ingredients on the back of the cough medicine boxes, did some simple dosage math, and settled on a 20 pack of Drixoral Cough Liquid caps. We took them at around 10:00 that night, and had a pretty good time. <br>Here's a log of what happened. We were writing it as it happened while we could.<br>10:03 Both: Took 300mg(10 capsules) each of Drixoral Cough Liquid Caps... might have been a bit much for a first time try, but we were feeling daring...(and we wanted it to be good) :)... <br>10:47 Both: Think we're starting to get a general 'nice' feeling<br>10:57 Jon: Colors seem to be getting brighter. Listening to Nirvana's Bleach album, music seems kind of 'thin' but it's pretty easy to get into.<br>11:16 Jon: Colors realy bightening.<br>11:22 Jon: Gettin into it... Kurt does'nt seem to be having much fun yet..<br>11:53 Both: Went outside to have a smoke and walk around.<br>12:07 Both: came back in, Jon: Things seemed to realy be setting in. I first noticed it when I walked back up the stairs to come back into the house. I felt very bouncy, as if I were going to keep floating up... I also felt it when I stood up from a chair. Around this time I also started to knotice things bouncing around a bit when I tried to fix my eyes on them.<br>12:20 I'm definately getting weird, Kurt still is'nt getting anything...<br>12:26 Turned off the lights and the monitor, stopped writing this log as things happened. Listened to music in the dark and had a pretty good time singing along. Now I popped in Nirvana's Nevermind. It was more melodic and cooler to listen to. I thought the more psychedelic parts of the music would be more stimulating, but it was realy basic song structure and melody that got me going... Time started to get distorted. Couldn't keep my eyes from wandering.<br>1:00(or so) Jon: Time getting realy distorted. Songs seem to last for hours, still nothing realy for Kurt.. We just lied around and listened...<br>Things realy hit around 1:30... All I can say is that I was FUCKED *UP*!!! My memory from then on is realy screwed up, but I remember realizing just how fried I was when I found myself sitting up on the bed with my legs shaking, and asking kurt if they were shaking. He told me to stop shaking them (By now he seemed pretty fried too) and when I stopped (It was fairly hard, I couldn't quite remember 'how' to). It felt weird stopping, so I just let them shake (They stopped when I laid back down). Standing up was hard and so was talking (although that didn't stop me). Just laying down, talking and listening was actually quite enjoyable.<br>Things I noticed:<br>These things are DANGEROUS! I almost choked trying to swallow one of the pills :) (Realy though, Make sure you have something to wash them down with)<br>We were VERY heavily stoned. I remember Kurt remarking 'This is what retarded people must feel like' :). I just couldn't think straight at all...<br>I seemed to instantly verbalize most of my thoughts. According to Kurt, I talked almost the whole time about absolutely nothing... I wonder if I would have talked so much if there weren't anyone there with me...I found myself contradicting myself often. 'I want to try and go outside. No I don't.' I also said completely senseless things He would ask me a question like 'Do you want to try and stand up?' and I'd say something like 'No, because you'll try to kill me, and the windows can't handle that.' Weird...<br>Part of our talking was telling each other all of our deepest darkest secrets. I can only remember a few of the milder ones, but I know I told him things about myself I wouldn't tell ANYONE normally... Luckily our memories of the experience are very bad, and many of the things we told each other were absolute hogwash (I distincly remember 'Hey man, I gotta tell you something. I have sex with furniture' 'That's ok man, I have sex with guitars...'). The next day however, we both felt like a tremendous weight had been taken off of our chest, and I think we're much better friends.<br>I didn't seem to hallucinate as I thought I would. In fact, I realy couldn't imagine anything visual at all. When I closed my eyes, I just saw kind of a slightly more intense normal-closed-eye pattern, and I just felt a general 'swirling' feeling in my mind. Kurt, however, reported seeing Sonic the Hedgehog come running at him a few times. :)<br>I noticed my body seemed generaly numbed, and severely in my mouth and face. The numbing of my mouth added to the difficulty of talking, and I think I had cottonmouth, but it might have just been the numbness.<br>At one point, for some reason I told Kurt to make sure all of his fingers were still on because DXM can me bad for them. He started nervously tugging on them to see if they were loose.I really freaked him out :-).<br>Moving around and dancing was REALLY cool. I was very disoriented and had a bit of a hard time standing up, but I diddn't get motion sick or anything, and moving felt great. Looking back, I'm glad nobody sober was watching me dance, I pretty much made a fool of myself :)...<br>For part of the most intense part of the trip I seemed to be just 'Out of my head', Like the rest of my mind just wandered off and left me to just kinda lay there and stare at things. I also had a few 'waking up' experiences. It's hard to explain, but it was if I were dreaming, and then woke up to find things exactly as they were in the dream.<br>MIZ only got nauseous twice for short periods, and it was very mild. <br>Sometime around 4:00, Both of us decided to go so sleep (I wasnt realy tired, it was a decision we just kinda made) No weird dreams or anything...<br>The next day, I didnt feel down after the trip, probably because I was still feeling the effects quite a bit. My memory was'nt doing to good, I felt mildly stoned, and I still got that funny feeling whenever I got up.<br>For the record, I'm only around 130 pounds, and Kurt is... Ehh.. I don't know, but he's 6'2 and slightly overweight.<br>Overall, this was quite an enjoyable (and weird) experience, and I plan on doing this again this weekend with maybe a few other friends, a higher dose, and some more appropriate music (although as the trip realy got intense, I realy just ignored the music). At around 10 bucks for 20 capsules (30mg each) it's fairly cheap (It would have been cheaper if I had been willing to down all that nasty syrup), and from what I've seen so far, it seems to be legal.<br>Well, my fingers are tired, and so am I, so I guess I'll stop now :) It should have only Dextromethorphan Hydrobromide (and maybe a little alchohol) as an active ingredient). Just make sure you don't have anything too important to do the day afterwards, you'll still feel it the next day, and might not sleep very well.\n\n\n"
}
