{
 "title": "My Last Time Smoking",
 "author": "Mike",
 "citation": "   Mike. \"My Last Time Smoking: experience with Cannabis (ID 18852)\". Erowid.org. Aug 11, 2005. erowid.org/exp/18852",
 "substance": "Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18852",
   "Male",
   " ",
   "Not Given",
   "Aug 11, 2005",
   "Views: 4948",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the past two or three weeks I have been smoking pot about once or twice a day. It kind of became not a way of life, but a call of gathering for my friends and I at college. For some reason I have been getting incredibly, INCREDIBLY high from the weed we have been smoking, whereas everybody else seems to be just giddy and laughy. I generally just feel like I have a power running through my body, but I cant do anything with it.</p><p>For a while now I have been trying to hallucinate, but have been unsuccessful. I have tried salvia on multiple occasions, trying the dried leaves, the 5x extract and the 15x extract, all times I have been met with disappointment. The salvia didnt make me see anything, all it did was make me really, really laughy and it made me feel like I was 100 degrees and sweating, even though I wasnt. I also have tried opium and 2C-T-7. The 2C-T-7 didn't make me see anything either, I just became really relaxed from it. Having tried three hallucinogens and having none of them being successful I decided that I was going to try shrooms. Me and my friends here made preparations to grow them here on campus, something which I think I will no longer be a part of.</p><p>Last night we went to this kids room named B. Bs roommate R sells weed, so we bought an eighth off of him between five of us. B and Rs other roommate, J, made a gravity bong the other night which they said was amazing, so we decided to try it. I was the fourth person to go, and to say that the thing was milked was an understatement. Each bowl would last about two hits, and this was the freshest, stickiest weed I had ever smoked. I wouldnt have been surprised if it had been picked less than three days prior (but I have no idea what to base that on). I took my first hit, but there was nothing in it, just a tiny bit of ash, so I got a tiny little resiny hit, about seven seconds later I began to already feel it working in my system, as is every time Ive smoked recently.</p><p>They packed me another, full, fresh bowl, and lit it. As they raised the gravity I saw the 2-liter bottle begin to completely fill with the richest, darkest, most perfect white smoke I had ever seen, so I hit it, and cleared itsomething which no one thought I would be able to do. Well, I did it in two tries, so I guess I didnt really do it. Anyway, I immediately sat down and just felt the effects of the weed build in my system. Within five minutes of smoking I looked at the clock and saw that it was 8:13 pm. With every breath I just got higher and higher. As I looked around I saw things in frames. People would skip frames on me, thats the only way I know how to describe it. Its like I was watching a movie and they had cut frames out of the film. Everybody was skipping beats in motion. I kept my head moving, trying desperately to appear normal, and not fucked up, which I was. As I moved my head around the room I passed Bs desk. On it as I turned my head some more I saw a post it on his desk begin to leave a trail. Everything left trails. I said to myself, This is it, Im hallucinating. I had read that if you smoke a lot of weed you can hallucinate, but it had never happened before. Ive been to the point where I could tell that if I had smoked more I could hallucinate, but we never had more.</p><p>People were taking second hits off of this and my friend J, not the one whose room we were in, another JJ2. J2 I feel was pretty fucked up, but not nearly as bad as me, and he hesitated a lot before taking his second hit, and I knew that if they went that hard on him they would never let me live down that I passed on a hit. I did though. I would not have been able to handle any more. I would have died if I had taken any more. I felt like I was going to die last night. I also had ain incredibly hard time moving.</p><p>As I sat there on the ground I looked up at my friend D. D and I were from the same town and coincidently came here, and weve been hanging out nearly every day. I saw him walking around the room, or maybe just standing next to something, Im really not all too sure. Anyway, when I looked at him he seemed to almost not be real, or maybe he was the only thing that was real. As I looked at him the background, the room we were in, looked like it was just some giant backdrop and that D was like super-imposed on it like a bad special effect from a movie.  It almost seemed like a cartoon cell, but drawn to real life. Lie a flat image of him was placed three feet over a flat background. It was interesting, something real was jumping off of the page.</p><p>After that I just kept moving my head around, trying to appear normal some more. By this point I knew that I was incredibly fucked up. I looked at the clock again and it read 8:26. Those had been the longest thirteen minutes of my life. I then, somehow, managed to get up onto a chair once my friend S got up to turn on the TV. It was a cheap thing for me to do, but I felt that if I were to move a little it would help me come down. It helped a little bit, but I didnt do enough moving for it to do anything noticeable. I had done some talking before the moving and that seemed to help too, but Im quiet when Im high, so I didnt really say too much. At one point some people came inside and said the hallway really smelled, so I told everybody, and was serious when I said to stop smoking. I did more than said it though, I ordered it. I was paranoid as fuck. I could barely move. If security came in I would have been fucked.</p><p>There was one person with us who doesnt smoke. Not anything, in fact, all hell do is drink, and generally, not even that much. He as playing GTA Vice City, and doing a horrible job. We all watched him playing. My back was to the TV so I slightly turned my body in that direction and turned my head as far as it would go. As I watched the game I heard something whisper into my left year. Mike, it said. Mike. I would turn around and nothing was there except for my friends. I went back to watching the game and the voice told me to stand up. I tried to ignore it but it just kept talking to me, probably another half a dozen times.</p><p>At probably 9:45 my friends wanted to head back to their room to play halo. I was still in no condition to walk, but I tried to anyway. Standing in place was a chore, I have no idea how I was going to walk into an elevator, down 11 flights, walk all the way to another building, give the person at the door my ID card, and back up another eleven flights. I guess they noticed this and because of that a few of them stayed behind, which I was gracious for. I knew they were trying to make me pay attention to what they were doing cause they kept making big deals out of what they were doing. They decided to play a racing game and they purposely lost to me when it was my turn to play. Well, they only lost once. They were trying really, really hard to lose, but I just kept doing shittier and shittier. Eventually they all got bored of it and we decided to put on a movie. We put on Boys in the Hood and watched that. Watching the game made me nauseous because of the crashes and jumps. Watching the movie calmed me down a little cause they actually had steady camera shots, so I welcomed that.</p><p>Every time I thought about weed I became sick to my stomach. I had to either close my eyes or focus on the ground in order to calm myself.</p><p>Finally, three hours and fifteen minutes later I felt well enough to go back to my room. I was afraid of running into people so I walked down the three flights and into my room.</p><p>I felt as though I was going to die that night. They all told me that I looked green, from my neck up. A noticeable green. And everybody saw it. So when I got to my room I collapsed in my bed and ate some cereal and drank some water to try and help me come down some more. Then I fell asleep to Austin Powers, it was on TV.</p><p>The reason I think that I had such an intense experience was because I have been smoking Djarum special clove cigarettes a lot lately, probably about five minutes before smoking the weed that night. I dont know if it had anything to do with it, but since Ive been smoking them my experiences have been getting more and more intense. Im not a doctor or anything, so its just an assumption that I made. Its validity is completely unknown to me, but I am really curious as to what made me trip like that.</p><p>Bottom line: I didnt like it, and Im done with it</p>"
}
