{
 "title": "DXM Psychosis",
 "author": "Anonymous",
 "citation": "   Anonymous. \"DXM Psychosis: experience with DXM (ID 1886)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1886",
 "substance": "DXM",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1886",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 9340",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI am very tired, as I have had a long night of insomnia, but my sleeplessness was caused by reasons that I need to start to alleviate now. I am seeking, first and foremost, any and all information anyone may have on a Dextromethorphan Hybrobromide 'psychosis'. There is a long story to this, but I will do my best to summarize.\r\nLast night, while I was tripping, 2 of my 3 companions for the evening decided they'd get in on the excitement a bit with some handy Robitussin. The third was a) not interested, and b) the requisite sitter/driver. Anyway, At some time in the chronological blur of last night, the Tussin user at whose house we were decided that he wanted to try to astrally project. After this, he started acting strangely, and in a very disturbing manner.\r\nIt took awhile for my effects to wear off to the level at which I could be certain that it was he and not I who was behaving strangely, but this morning's happenings have ultimately confirmed that. It was ten hours ago (from now, 8:30 AM) that he capped off his cough syrup, and since he tried to project, he's been speaking in a very monotone, broken speech. Very precise and inarticulate. He sounds like a robot, and very noticeably. He cannot think straight or focus on objects that are far away, says he 'doesn't know' when asked how he is, and cannot specify where his limbs are unless he looks directly at them.\r\nThis matches nothing I have experienced, nor anything that anyone I have read of has experienced, with the exception of an individual that mentioned a friend with a 'manic' response to DM and LSD that has required hospitalization for up to a week. My friend, however, has used LSD a handful of times with no undesirable effects during or after the trips. Indeed, he tends to love the stuff. This experience, too, was thrilling, and he found it very amusing until his speech was decaying. Well, to be fair, he found the speech amusing for a couple hours, and recorded himself before getting bored/disturbed with it.\r\nAlso, I was amazed that he wasn't tired. DM _should_, in my understanding, produce a sedating effect. He couldn't fall asleep, though, and didn't know whether or not he wanted to. He eventually did, with the help of the Valerian root that is kept around to cushion the 'ride back down'. The only problem is that he awoke in seemingly the same state. Through the entire drive to get me home, he seemed very disturbed, crossing his eyebrows and looking around alot, sitting in a contorted position. The other person in the car, [Driver's name here], asked if I was used to it lasting this long. I wasn't, and I reminded them that even if I was, I wasn't used to any of the other properties of his experience. The only thing any of us could think of was getting me home without causing alarm, and probing for information, specifically on the 'net.\r\nI'm somewhat frightened, honestly, and I do not find an uninformed, frightened state to be acceptable for the situation, in which SOME action seems necessary, and perhaps with relative haste.\n\n\n"
}
