{
 "title": "The Blue Sky",
 "author": "Themadhungarian",
 "citation": "   Themadhungarian. \"The Blue Sky: experience with Tramadol (Ultram) (ID 18871)\". Erowid.org. Jun 24, 2007. erowid.org/exp/18871",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "255 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 1:30",
   "150 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 2:30",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 18871",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2007",
   "Views: 19114",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me start off by saying that this was not my first experience using Ultram.  I had been using Tramadol Hydrocloride (Ultram), on and off for about two months, in doses between 100mg. and 250 mg.  I have always found the effects to be that of the 'typical' opiate high, euphoria, mental relaxation, and a nice all around contented feeling.  I know from research that Tramadol is not a opiate, but rather it binds to the same receptors as opiates do, and therefore acts in much the same way with one exception, it lasts quite a bit longer than most of the commonly available pain pills.  </p><p>With safety in mind, I started my use slowly and worked up to my max so far which was five 50mg. pills.  I didn't want to be the idiot who overdosed because he did not know what the risks were.  The only ill effects I ever experienced was some slight nausea, easily taken care of by lying down and smoking a small bowl of everyone's favorite herb.  </p><p>One day not so long ago, I found myself in possession of eight 50mg. pills.  I had no real possibility of getting more.  So I thought, because I had already taken up to five pills in a day I wonder what taking all eight would be like.  I wanted it to be a kind of celebration for the last of my supply. (Some people will party for any reason).  I knew from previous research that 400mg. was the maximum amount allowed per 24 hour period per the manufacturer. I felt safe taking this high of a dose due to the fact that I had good past experiences, and had built up some tolerance to the substance.  </p><p>I began my day at about 8:30 am by taking 150mg. and waiting for it to set in.  Ultram takes about two hours for peak effects so I played some computer games to pass the time.  When I began to feel a bit floaty about ninety minutes later, I dropped another 150mg.  </p><p>About an hour after the second dose, I began to feel quite nice.  The day was beautiful, as is usually is in So Cal, and I found myself staring out the window at the deep blue of the sky.  I could see depth in the sky that I had not noticed before this day.  The different shades of blue and other colors in the sky I was perceiving was truly amazing.  I was daydreaming as well as feeling as if I was part of a dream.  Of course I realized I was awake, but everything began to take on a soft and muted tone.  All colors were brighter, and edges of objects appeared rounder.  My surroundings took on a 'foggy' kind of look, sort of like a bit of early morning haze had crept into the room.  </p><p>I decided to lay on my bed to chill out for a bit and oh my god was my comforter soft!  It felt sooo good to just lie on top of the bed.  Around this time I also noticed that it felt great to touch my skin.  I sort of had that feeling like at the come up of an MDMA trip, when everything feels good to the touch and clothes brushing against me is pleasurable.  I still felt fairly aware, so I decided this would be a good time to walk to the corner store and get something to drink.  Walking felt supreme.  I felt tall, strong, and walked with a purpose.  Dealing with the clerk presented no issues, though I did notice my voice came out lower than my normal tone.  Upon returning home, I took the last 100mg.  This was about one in the afternoon.  Since my roomates were not home, I thought watching a movie would be fun.  </p><p>As the last two pills began to creep up, my feelings of euphoria increased greatly, as did the contented feeling.  In fact, I was so completely comfortable, that I caught myself slipping into short cat-naps throughout the movie.  I did not understand until later that I was catching the classic 'nod' that so many herion users strive for.  All I knew was that I just getting a bit sedated from taking so many pills, and starting to fall asleep.  The good feelings continued strongly for the entire day until I decided to go to bed.  Upon waking in the morning, I still was feeling the effects a good deal which kind of caught me by surprise, but it was Sunday and I had no obligations, so I didn't worry about it.  </p><p>I finally came down about four that afternoon.  Total trip time was about 30 hours.  This experience was so satisfying that it felt as if I had taken a short vacation.  On Monday morning, I felt renewed and happy to be who I was and where I was.  Because of my experience with other altered states I knew this feeling was what one calls the afterglow.  It is fun to take drugs.  But it is even better when what I take allows me to step back from myself for a bit and appreciate the little things in life.  That blue sky will remain with me forever.</p>"
}
