{
 "title": "Robo Fun",
 "author": "Cory Johannsen",
 "citation": "   Cory Johannsen. \"Robo Fun: experience with DXM (ID 1887)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1887",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 1887",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 4858",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I robo-ed for the first time in months this weekend. Did more than I ever had before, here's the story:</p><p>8:15 pm: Friend and I each take 5 Robitussin cough caps, and rinse them down with 4 oz of Robo DM syrup. Taste is worse than I remember. Wrigley Spearmint really helps kill the taste.</p><p>8:30ish: begin feally a little funky. Stomach is a little bit uncomfortable. Friend says she feels a little nauseous also. We ate before hand, so the stomach discomfort was not as bad as before.</p><p>8:45ish: Very light headed. Tracers begin showing up on just about everything. We get to another friends house, and sit down to watch tv.</p><p>9:00 : Seriously feeling effect. Head spinning slighty, not bad. Stomach discomfort gone. Limbs feel unconnected to body. I notice that I have been watching tv for 15 minutes, and have no idea what I am watching. TV sound is turned off and stereo is truned on. I find it very hard to concentrate on anything for more than about a second. Music, which I normally get into, I can't really listen to. Repeated attemps at conversation fail because I can't remember what I am saying as I say it. total inability to grasp concept of time. A friend's sentence take forever to finsh, and I completely forget what is said as soon as he is done. When I close my eyes, all sorts of incredible hallucinations kick in. When my eyes are open, I see everything as normal, but have NO idea what I'm looking at. </p><p>10:30ish Friend gets pizza. I am totally unable to eat. Wierd, seeing as how often I get the munchies. I can no longer move my head without totally losing contact with reality. As long as I am talking, I'm fine. Time flies and crawls at the same time. Truely wierd.</p><p>Evening progresses until I have to leave(couldn't take beeing on that couch any longer)</p><p>Midnight: Go back to friends house. Have to catch a ride because I am TOTALLY unable to operate an automobile, assuming I had driven in the first place. Lye down on floor. Carpet, which is normally uncomfortable, is quite nice right now. Close my eyes, and trip like a motherfucker. All sorts of weird shit flies through my head. It is suddenly half an hour later. I decide(for some stupid reason) that I need to walk home now. Normally about a mile, I can walk it in 15 minutes if I really take my time. As I walk, I realize that I don't feel connected to my legs, I'm just 'floating' along, above the ground. I feel as if I'm going to fall any minute, but never do. I make it home, and down the stairs into my room. I make it into my bed, where I close my eyes, and trip out for another three hours, when my phone rings, and I end up explaining how to use Tlenet to one of my friends. After a rather lengthy conversation, I slip into unconsciousness completely.</p><p>Next day: I am still totally out to lunch, and am still unable to grasp time. Things just fly by unnoticed. Kinda cool, kinda strange. I like it, but it better be gone by tommorow.</p>"
}
