{
 "title": "Dreaming Awake",
 "author": "Benn Burton",
 "citation": "Citation:   Benn Burton. \"Dreaming Awake: experience with DXM (ID 1888)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1888",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1888",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 5731",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nNow for my description of the trip. Hopefully it may help other would-be first time experimenters of DXM. I can't vouch for the experiences of my two friends who also made this their first DXM experience but will include some of their observations where necessary. All three of us decided that 300mg was the best dose and consequently downed a 100mL bottle of Robitussin DM at 3mg/mL. I'm not sure about in the States but here, Robitussin DM also contains Guaiphenesin which apparently causes vomiting and/or the shits. Well admittedly I did get the shits once but any unpleasant effects (of which there were next to none for the whole duration) were vastly outweighed by the pleasant effects which, to me at least, were numerous. I didn't eat anything all day and so, had a completely empty stomach. Both of my friends had eaten a couple of hours beforehand. One had the shits quite a lot and the other vomited once.\r\nWe downed the whole bottle around 7pm and half an hour later, started to feel 'intoxicated'; similar to alcohol intoxication. About fifteen minutes later, we shared a joint and then all lay down on our matresses and put some good music on, Miles Davis' 'Bitches Brew'. Soon, the effects began to become noticable. I just felt very comfortable lying down with my eyes shut. The best way I can describe how I felt was that it was like dreaming except that I was awake ... something like lucid dreaming. At this point and indeed for the reat of the trip, I'd be thinking of things and then I'd be 'virtually' acting these things out in my head. Closed-eye visuals weren't very common nor were they vivid, though I imagine at a higher dose they'd be far more obvious and intense. Despite this, I could visualize in my mind's eye what I was thinking. After a while, I decided to change the music and went to stand up. I just soared into a standing position and then lurched about a little but felt very light. The music I chose was some hard trance. It went down well and by now I was beginning to notice the amazing effects of the music. I can't really say how long into the trip I was because I simply didn't think of time but it was probably two hours since ingestion. At this stage, I decided another smoke was in order so I packed a few cones (bowls) and one of my friends joined me. The other appeared to be asleep. After this, I changed the music to Enigma's second one and this is when the really intense and pleasurable aspects of the trip reached their highest point.\r\nI lay down as usual and returned to my dream-like state. The music just felt superb and flowed right through my body. I'd lost quite a bit of sensation in my body and it seemed to merge with the music like pure energy. I find it a most difficult, in fact, impossible thing to describe. It was at this point that I decided the porcelain bus needed a visitor. However, I was so utterly comfortable and the sensations felt so superb that I just didn't have the desire to get up and go. Eventually, I arrived at the conclusion that if I did go, I'd be a lot more comfortable when I returned. I was a little annoyed that I'd have to leave this dream-like state and probably not be able to return to it. Not so! When I returned from the toilet, I was very pleased to discover I could just go straight back to the dream-like state I'd been in ... including all the merging, like energy with the music. When Enigma finished, I spent about ten minutes trying to decide what to put on next before realising that nothing in my collection could possibly match the superb sounds and sensations of Enigma so I whacked it straight back on. After it ended for the second time, I put on a compiation CD of mellow trance and began my decent into real sleep. The trip wasn't so much wearing off (though it probably was physiologically) my dream-like DXM state was just merging with the approaching sleep that was to overtake the experience. It may have been about 1am. \r\nI awoke at 8:30am in the morning feeling absolutely fine. No hangovers and no ill effects of any other kind. About half an hour before I'd drifted off the night before, my head had been pounding, like a bad hangover. Still not bad enough to become unpleasant, but noticable all the same. In the morning though, there were no ill-effects whatsoever. We all went for a skate a few hours later and I've felt nothing untoward since. \r\nIn conclusion, this first experience with 300mg was superb and has ensured that I'll do it again soon, probably with 450mg. It was definitely a second plateau trip though most likely at the beginning, in other words, far from nearing a third and still leaving much in the second to be discovered next time. My recommendations based on this first experience are these:\r\n1. No food on the day you intend on tripping with DXM. I had the fewest unpleasant effects and my two friends had eaten that day.\r\n2. For first time users: Start with a small dose; no more than 300mg. I imagine that if I'd taken any larger a dose (400-600mg) I would probably have freaked a little bit. A few times during the experience, some sensations were difficult to explain to myself but owing to the relatively small dose, I was easily able to deal with these. At a higher dose, it would most likely have been more difficult to do this.\r\n3. Set and Setting are very important as far as I can tell. I'd made my loungeroom very homely with coloured lights, comfortable surroundings, and most importantly, a good stereo with speakers in different corners of the room. I imagine headphones would be even more brilliant but there were three of us and only one stereo. I tried a variety of music styles but by far the most superb was Enigma. Electronic music with plenty of deep bass felt the best.\r\n4. Smoke some herb some time after ingestion. The three of us agreed that smoking the joint half an hour after ingestion was too soon but the cone/bowl maybe two hours into it really brought on the enjoyable effects and added to them.\r\nAnyway ... This first experience with 300mg was all good, IMO. Next time I'll be trying 450mg as I've decided to go slowly so as to minimize the likelyhood of having to deal with too much at once. One of my friends thought the experience was good enough at 300mg and that he probably wouldn't bother with a higer dose as a result. Sorry for the length of this post but I thought it might help those interested in trying DXM for the first time. Thanks again for those who emailed advice my way over the past week.\n\n\n"
}