{
 "title": "A Trip Into the Unknown",
 "author": "Father Of Secrets",
 "citation": "   Father Of Secrets. \"A Trip Into the Unknown: experience with 2C-B (ID 18897)\". Erowid.org. Nov 15, 2002. erowid.org/exp/18897",
 "substance": "2C-B",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "2C-B",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18897",
   "Male",
   " ",
   "Not Given",
   "Nov 15, 2002",
   "Views: 13954",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFirst I want to excuse for my bad English, hope that I could make myself understood!  Recently so did I send in a Bad trip report with 2C-B, but I didn't write that I still use it and probably will continue until my death. </p><p>The first time I took 2C-B was when I where alone at home, for a long time had I felt myself not to belong anywhere.  My mood was very blue, and I must confess that I didn't even know what 2C-B was, just heard that it was good but no one I know have tried it.</p><p>Anyway I just swallow the pill and wrote down the time 18.41, just before this have I eaten a big meal food.  At about 19.20 so did I call my friend and tell him what a crap this substance was, then suddenly things started to happen.  I was looking at a Steven Seagal movie, and I saw how his head suddenly looked like the elephantman....didn't understood anything and when I looked around all things started to be morphed.</p><p>I quickly ended the communication with my friend, and now things really started to happen, I put on some music, which took me quite a while because everything was morphing and my sights zoomed in and out.  When the music started, I felt like an explosion inside of me and I could see my aura, and everything I looked at was so incredible beautiful.  And even the simplest thing like pouring up a glass of water was incredible to watch.</p><p>It's so hard to describe, but let me say like this...it was like being in paradise.</p><p>Then my mind started to think ' who am I?  'What am I?' and believe me when I say that I found out a lot of answers, in this trip.  I dont believe in god, but after this trip I believe that everyone is their own god.  And I believe that there is a life after death, I been there as far a man can go with the chance to come back (but this is another story..Dont know if I should write it down).</p><p>Don't remember who wrote it but ' 2C-B is a tool, rightly used it is a wonderful substance.  Used wrongly and it is your worst nightmare, I must say to you how important it is with a good friend that could help you if it went wrong in your trip.</p><p>I myself had a real asshole of a friend on one trip, because instead of talking me down he started to fuck up my brain and told me that I gonna die and that he was God and so on (had a real hell to get back to senses)....but believe me one day will he get what he deserved because what comes around goes around.</p><p>Anyway, even when I closed my eyes beautiful colours passed by and must say that never had music been so good.  A WARNING though, dont play music that take you down because 2C-B has a naughty side that could make you feel so depressed that its frightening.  And don't take a shower like me, for in some way 2C-B had make my body real sensitive and my hearing had increased so when I started to shower it felt like needles all over my body...now can I laugh about it but I remembered that I ran out naked in the garden.  Just to get away from the pain and the sound of water pouring down.</p><p>Everything felt for the first time in my life, WONDERFUL!  I strongly recommend this drug, because it can take you to dimensions that I haven't reach with other drugs.  And please instead for pleasure (because 2C-B is incredible to have sex or masturbate with) use it to discover new dimensions... </p><p>Here come some tips to reach beyond with 2C-B:</p><p>1. Turn off the telephone, Put on music that you like (on random)</p><p>2. Turn off the lights (just light a candle)</p><p>3. Sit down and relax, Focus on the candle</p><p>4. When the ride starts...focus and feel yourself wander away into the unknown (this may not work the first time, but you soon will have the outside body experience)</p><p>'Better to wander into the unknown than to crawl in reality'</p><p>Father of Secrets</p>"
}
