{
 "title": "Dis Ain't No Psychedelic",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Dis Ain't No Psychedelic: experience with DXM (ID 1890)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1890",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "450 mg",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1890",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 6261",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI consumed 450 mg DXM-HBr in the form of Drixoral cough medicine (15 pills, 1.5 boxes, active ingredients 30 mg DXM-HBr per pill only), my first experience involving this drug. According to the FAQ, 450 mg will produce a second-plateau dose. Since the red pills were ingested whole, the effects took well over an hour to first manifest.\r\nFirst of all, dis ain't no psychedelic. Obviously. It was definitely psychedelic-like, and I can see why some people might enjoy experiencing this drug, but it didn't really seem like my cup of tea. The dissociative high was like existing as a point suspended in infinte space with no memory of my body or external reality, which was an interesting sensation and could be considered euphoric under the right conditions. Or, rather, that's how I would imagine, say, an IM dose of ketamine to be. My dosage was not sufficient to provoke a complete dissociation, although there was a definite feeling that my mind was *here* and my body was *there*; it was easy to lose track of the location of my limbs, for example, and I picked up hints of the fully dissociated mindstate, making me more than a little curious about ketamine experiences. But all in all, it seemed to me like a sort of escapist (in the pejorative sense of the word) version of the psychedelic high, although I do not mean by that to assert anything other than *my own* opinion of its usefulness *to me*. Your milage will vary.\r\nClosed-eye visuals were fairly muted and vague, but did tend to have more of a hallucinatory (seeing 'nonexistent' things) rather than a psychedelic (geometric patterns) character.\r\nSide effects were pronounced and definitely unpleasant. I had trouble getting my eyes to focus on things. Getting the LED display of a clock to resolve into numbers was a chore. The visual sensation was of trying to focus on something when having just gotten off a merry-go-round. Walking (or anything requiring muscle coordination) was extremely difficult in my dream. I felt like brain and body were, well, dissociated. :-)\r\nThe next day, I had a *terrible* hangover that lasted well into the afternoon. I felt like brain and body were now 'misaligned' after their separation. I could function, but I felt stupid, clumsy, self-conscious, and altogether uncomfortable. Food was tasteless and artificial.\r\nInteresting experience, but not something I'm enthusiastic about repeating.\n\n\n"
}
