{
 "title": "Worked the Second Time",
 "author": "Brass Monkey",
 "citation": "   Brass Monkey. \"Worked the Second Time: experience with Leonotis leonurus (ID 18928)\". Erowid.org. Oct 26, 2003. erowid.org/exp/18928",
 "substance": "Leonotis leonurus",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Leonotis leonurus",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18928",
   "Male",
   " ",
   "Not Given",
   "Oct 26, 2003",
   "Views: 9687",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had tried this stuff the night before but with no effects (you'd figure sumfin wud happen off 3 cigs and 1 bowl!). I decided to give it another shot the day after and rolled up another cig and smoked away. Definately a harsh smoke but it wasn't as bad tasting as it had the night before for some reason. I didn't really figure it was going to do anything but I thought I might aswell mute the TV and crank up some music to relax a little.</p><p>The effects slowly came on, about 5 mins afterwards. By the time they where 'noticeable' I had decided that perhaps they weren't actually the effects of the dagga. I was staring at the TV, listening to the music but also thinking about something else all at the same time. Nothing extremely different thats for sure. Then I realised I had been staring at the TV and listening to the music and thinking about random things at the same time for about 20 mins . Possibly not a 'true' effect but it was sorta cool anyway.</p><p>As I was dwelling on these 'effects' i realised that my arm (which was just lying across my stomach) felt as though it was part of my abdomen. With every breath it moved as though it was a part of my chest. Then as I was thinking how cool this feeling was, i saw that everything in my vision other than the TV was sorta white and out of focus slightly. As I was focusing on the 'fuzzyness' of it, everything turned fuzzy and white for a few seconds, but it quickly passed.</p><p>After all this my experience was calming down and I was returning to a normal feeling. Reflecting on it I think that the effects where noticeable because I wanted them to be, sort of 'voluntary effects' in a way. I had read that smoking it gives a mild marijuana like experience. In my opinion it isn't at all like marijuana but gives an experience quite different and unique, short but unique.</p>"
}
