{
 "title": "The Moments that Didn't Happen",
 "author": "Jack Nilch",
 "citation": "   Jack Nilch. \"The Moments that Didn't Happen: experience with DXM (ID 1897)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1897",
 "substance": "DXM",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1897",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2000",
   "Views: 4508",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nwow. this is definitely the most pleasurable experience i have ever had. i am off now to go do older-brotherly-duties, but i suggest you at least read it. definitely a VERY good experience. nothing but positive out of it. kinda like to hear whate mr. white has to say about the time distortions. those were _weird_.\r\nimpossible. I am going to attempt, for the benefit of myself and others, to describe the experience i had last night. please note, also, that i am as i write this, living down a pretty glorious acid trip, and trying to jump into another day on the job, via 10mg Ephedrine HCl. anyhow, to get on to the task at hand.\r\nSo last night, i bought 2 600mg packages of DXM. (Drixoral Liquicaps!) my friend chugged his pills and dosed 1 tab (if you figure he had about 2 _good_ tabs around 125ug each, thats ~250ug LSD) about 730pm. (we will referr to him as 'D' now) This was D's first experience on the drug, i think. We each weigh in the neighborhood of 120kg. so the 600mg was a fairly low dose, ~5mg/kg. I was going to be driving someone around at 1030, so i refrained. D then smoked a little marijuana (i think about 4 grams of some pretty good stuff). He was enjoying it (it probably being the acid) at 930, and at 1030, but wasnt really noticing the effects of the DXM. at 1030, i called the friends i was supposed to be driving, and plans didnt work out. so at about 1045 or 1100, we went to the school next door to my house. I took all my pills fairly quickly, and then played with my two tabs. Eventually, D started rolling around on the ground telling me how good it felt. i explained to him that there was avery high chance of that being DXM. he told me he liked it a lot. in the meantime, i would guess it was around 1125 or so, i was beginning to feel a bit sick to my stomache (which is unusual, i usually dont have problems with the pills that way), and i guessed that smoking a little marijuana would stop that. it did, but i took a very small amount of it. i took about two hits off of the plant that D was smoking in the hours before 1100pm. D was really enjoying things by about 1145, and he decided it would be fun to play with the computer and listen to music (specifically Pink Floyd -- it seems that its right for almost all occasions, all drugs). When we got to my house, D didnt agree with Pretty Hate Machine after a while, and it was quickly replaced with Pink Floyd. At this point, he was calling various bulletin boards and talking to people while th effects of DXM washed over me (and thats a good description, too. thats what it felt like. as if the effects were washing in on me with a tide). When i stood up and felt the very typical DXM-ish movement feelings (people who have used this know exactly what im talking about), i decided that it would be fun if i got in on the modem games, too. So i posted a couple of pretty unintelligible messages and bothered a few people, and then D and i got to talking.\r\nThis would be the peak.\r\nThe best way to describe how i felt at that point would be ... ripped out of time. i was having INTENSE feelings of 'waking up' at one moment, when i had very vague memories of another moment, and i was asking questions like i wasnt sure it had actually happened. D indicated after a while he wanted to leave, and i kept saying 'Did you just say you wanted to leave?' over and over. it was very much like i couldnt believe that that moment, which had passed through my senses a second or two ago, actually existed. This lasted for quite a while. i have no real concept of time, and in fact dont remember much in that period except that it was STRANGE. Exhillarating, yes, STRANGE. Vague memories of looking at myself in the bathroom mirror thinking that i would just walk out of there and it would be a sunny afternoon and i would be sober (i think D was making me anxious at this point ant i had a sense of urgency for it to end. unwise, i think.) and just walk around. the sensation seemed so far off, like i could never possibly be sober again if i didnt get the exit from the bathroom just right.\r\nLeading up to and descending from the peak of the trip.\r\nwell i noticed some weird things that i didnt notice normally on a usual DXM trip. Note that i usually take 900mg+ and this was a much lower dose than normal. First was that i really didnt feel pain at all. i felt pressure. i even went as far as to demonstrate this to D by repeatedly punching my arm. I have a bruise there and thought that i was stupid for doing it later, but i think its important to note that you shouldnt deal with anything that could be painful. period. you could really hurt yourself and not even know it. i also had the fun stuff from DXM and pot, but i didnt think i should be feeling as 'laughy' as i was for the amount of THC i ingested (perhaps D's plant was much stronger than i thought, or perhaps under the influence of LSD, DXM becomes much lighter, and more... 'fun'). Playing around with the mac-vcr thingy was fun, and i was pointing out to D the girl on a cassette that i had recorded -- repeatedly. which almost brings up this one, too. i always felt a need to be fixated with something on this drug. it was like after D left my house, i had to find something to center my attention on. it wound up being the vRave. (then of course, D showed up and that was great). Ah yes. and toes. i discovered my toes. i will never EVER look at feet the same way. my toes were wiggling the entire duration of this experience, and it was great. intensely pleasurable feeligns just emenated from my toes. (another difficult thing to explain i suppose.)\r\nComedown....\r\nusually the worst part of any trip. aside from being a little dehydrated, which is to be expected from almost any drug use, i feel perfectly normal albeit a bit tired. before approaching sobriety, (which i dont think im entirely at yet, that is still a few hours off, at 730am, now.) i had a very pleasureable psuedo-dream state for a few hours. it probably started at 530 or so, when i decided i needed to get some sleep. i turned on the CD (Talking Heads this time), and tried to sleep. When you close your eyes to go to sleep, you do it to relax, because there isnt anything there. its supposed to be just black. well i simply couldnt sleep that way, thats why i say pseudo-dream state. it was resting (i feel okay after a couple hours of it and im gonna go tackle everyday life now) when i closed my eyes i had intense colorful, pattern-orinted hallucinations. VERY vivid. not realistic, but VIVID. definitely. I eventually got up at about 715am. about 9 hours total time, with a bit of lag (no black when i close my eyes yet, but its getting there).\r\nit would seem that DXM and LSD serve to amplify th effects of one another. no ill effects except that time distortion. probably would have been a lot more fun if i didnt feel that urgency and lack of control. perhaps it would be a lot of fun watching tv, or playing something easy like tic tac toe. If i had it all to do over again, what i would do is either dose the acid and the DXM at the same time, with an OTHER 600mg of dxm, when the time distortion stuff started going away (a good 4 or five hours in) OR i would let the acid work its magic for an hour or so and then hit the 600mg of DXM, and let it go for the rest of the acid duration.\r\nas it stands, i had a VERY pleasurable time, and i tried my hardest to explain it. i wanted a more intense trip on the way into this thing, and i came out not only with a level i am satisfied with (to stay at for a while) but a more intense trip. i feel i am lucky. also, i would very much recommend AGAINST this for anyone who is not pretty durned experienced with BOTH these drugs. the time thing was very distressing at times, simply because it was incontinuous. the THC... well, it stopped the nausea. anyhow, good stuff!!\n\n\n"
}
