{
 "title": "Induced Paradigm Shift",
 "author": "J.A.C.",
 "citation": "   J.A.C.. \"Induced Paradigm Shift: experience with Salvia Divinorum (ID 18977)\". Erowid.org. Aug 28, 2005. erowid.org/exp/18977",
 "substance": "Salvia Divinorum",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18977",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 28, 2005",
   "Views: 7777",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A friend of mine told me about Salvia Divinorum, a legal substance he had purchased at a local 'head shop.'  I was curious, so he gave me a small plastic bag of it to try.  Now, let me first explain my position.  I am a relatively responsible person.  I don't get high very often, and when I do, it is usually in search of a spiritual experience.  I have tried marijuana, ecstasy, nitrous oxide and acid.  I don't consider myself an inexperienced person in the realm of drug experiences, but I certainly wouldn't classify myself as a 'regular' user or someone who indulges in excesses of this sort.  </p><p>That being said, I would like to share my experience with you.  One sunny Sunday morning I was sitting in my bedroom in my pajamas, lounging and just talking with my boyfriend.  We had not yet had breakfast, so my stomach was empty.  The setting was very comfortable, calm and happy.  I was not stressed out or angry or fearful going into it.  I had a good mind set and was in a comfy setting.   We decided to try smoking Salvia Divinorum.   </p><p>I put medium-sized pinchful into a pipe and took one hit.  (My friend had given me the 10x concentration, although I didn't know how significant that was until afterward.)  I only had time to put the pipe down before I started to feel the effects. </p><p>I knew I was in 'my room' and was with this person whom I called 'my boyfriend' but these comforting facts did not help me.  I was suddenly able to see and feel the dichotomy of what we know as 'real life' and that of the other place.  My physical world, my home, my body, my possessions, my job, my relationships, everything I knew to be 'real' suddenly became a fragile, fleeting illusion.  I saw this black, vacuumous abyss surrounding me.  The physical bonds of reality, every molecule in the physical world including the wall behind me, the bed I was sitting on and my body, were being sucked into this abyss of the unknown.  I literally felt I was being sucked into another dimension.  (My boyfriend later told me I was shaking, sweating and clinging onto him.)  </p><p>Because salvia produces hallucinogenic effects, I could literally see the 'real' world disintegrating into nothingness.  I saw the paint peel from the walls and fly away.  I saw my boyfriend's face sort of melt like plastic and being sucked upwards.  I saw on a molecular level, bonds breaking and atoms flying away into nothingness.  I remember hearing voices telling me just to let go.  They told me to surrender to this feeling and just let go of 'reality' and everything I knew to be true.  I remember fighting the feeling, and literally holding onto the bed and my boyfriend so as not to get sucked away.  The voices of the ones who had already let go, who had already left this place, told me that if I didn't go with them now, I would eventually go anyway.  If I chose to fight the vacuum and stay here, it would only be temporary, because everyone eventually goes where they went anyway.  </p><p>I was absolutely terrified.  I am grateful that the effects of salvia are so short-lived.  Had that 'bad trip' lasted any longer, I don't know that I would have come out of it and been OK.  I now understand what the term psychoactive really means. </p><p>In previous drug-induced experiences, I remember feeling that my 'real' life, my physical life was revealed to be an illusion.  I had seen the unknown blackness beyond this plane and I remember having the choice to stay here or to go there.  This time, I did not have a choice.  The unknown blackness (heaven? enlightenment? death?) was literally taking me away from this Earthly time/space dimension.  I felt that I was only able to stay here because I fought that unknown force.  </p><p>I hope to eventually attain enlightenment.  I would just much rather have it be my choice and have it be a sought-after goal.  I hope I can get there through meditation, yoga, or another gentle, gradual method.  What I experienced that Sunday was frightful and violent.  It shook me down to my very core and turned my paradigm of 'reality' upside down.  I dont like the feeling of not having control over my own life and my own reality.</p><p>Interestingly, when my boyfriend tried it after I did, he had a very nice, dreamy, pleasant experience.  He described seeing a beautiful European streetscape with cafes and beautiful foreign architecture.  His experience was quite the opposite of mine.</p><p>Personally, I will never try salvia again.  It is a very, very, very powerful psychoactive drug.  Smoking marijuana has never felt anything even remotely like this.  I am not submitting this story to deter anyone from trying salvia; I am merely sharing my own personal experience with those who are interested in reading about it.  I hope my story doesnt scare anyone away from experimenting with Salvia Divinorum.  I think it affects people differently, and I hope people DO try it and have amazing experiences while it is still legal.</p>"
}
