{
 "title": "With an Easy Mind",
 "author": "Subterfuge",
 "citation": "   Subterfuge. \"With an Easy Mind: experience with Phentermine (ID 18980)\". Erowid.org. May 8, 2006. erowid.org/exp/18980",
 "substance": "Phentermine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "4 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "  ",
   "insufflated",
   "Pharms - Promethazine",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 18980",
   "Male",
   " ",
   "Not Given",
   "May 8, 2006",
   "Views: 20212",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Beginning this morning with one foot already in inebriation from the night before's use of ganja and codeine, I called up my g/f and asked her what she was up for, and we decided to talk all day.  Well in the first hour of talking I tried to make premade jello absorb vodka... I'd say this was ok... but the purpose wasn't really served... I ended up massively sweetening some peach vodka because I am quite uneasy about shots since I last did them and was unable to pull it off...  At any rate I had about 4 shots worth if that.</p><p>I was relaxed and half drunk talking to my g/f who went about her own ways with benzodiazepines.  I talked to her until becoming bored of my state and could only come up with a bottle of promethazine since all the vicodin in this house has been swapped with excedrin.  I preceded to smash up 25 mg of promethazine... After this process there was only about 20 mg that I wanted to deal with since the rest was too hard to get chopped up and I wasn't ready to sit there with it all night.  I insufflated the promethazine and proceeded with water shots to get it all down.</p><p>So I ended up walking back to my room and being hit like a shotgun had hit me with inebriation.  I suddenly felt dazed and gone.  I was floating sort of part of the time.. The more I faded to sleep the crazier it all got.  I ended up trying to stay awake with my g/f and we were there all of 6 hours and 5 of them had been spent like this.</p><p>Through the course of the 5 hours I felt as if I took way too much vicodin for a brain to handle.  It wasn't dangerous, just kind of spacey.  A definite opiate-like buzz.. So I enjoyed this trying to keep my train of thought, but sooner thinking I said something than actually speaking.  It was like my brain was ahead of my mouth so far that it didn't know when it should start speaking.</p><p>This all eventually wore of pleasantly, it was all quite euphoric... At the moment it is mostly gone but my vision occasionaly jumps around... The only negative side-effect I could find was my pupils being very heavily constricted so as it was visibly darker around me.</p>"
}
