{
 "title": "Ultimate Comfort",
 "author": "Adnarim",
 "citation": "   Adnarim. \"Ultimate Comfort: experience with Mushrooms (ID 18981)\". Erowid.org. Sep 1, 2005. erowid.org/exp/18981",
 "substance": "Mushrooms",
 "bodyweight": "134 lb",
 "header": [
  [
   "DOSE:",
   "0.125 oz",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "18981",
   "Female",
   " ",
   "Not Given",
   "Sep 1, 2005",
   "4304",
   " "
  ]
 ],
 "report": "<p>It took me almost a month to get my hands on some shrooms, and I was excited to take them.  I'd tripped once before, and it had been an awesome experience.</p><p>I took the shrooms at about 7:30 PM, chewing them thoroughly and washing them down with Coke to get rid of the nasty taste.  After ingesting, I hung out in a friend's room and watched a Simpsons episode.  I could start to feel it coming on at about 8. I could see a pattern emerging in the linoleum on the floor, and I started laughing because life just seemed happy and funny.  My friends, who were drunk but not tripping, looked at me funny, then went back to watching a Family Guy episode.</p><p>I got kind of sick of just sitting there, so I got up and wandered back to my room.  I went into the bathroom and placed my hands on the white tile; only then did I notice that it was really setting in.  My body felt incredible, like the deepest orgasm ever, just lasting... I studied my hands against the tile, and I could intricate rainbow patterns around my hands and spreading up the walls.  I wondered why I hadn't noticed before.  My hands, too, were covered with intricacies; all the little lines made fascinating patterns that I just stared at, all the while feeling amazing just being in my body.</p><p>I went outside to smoke a cigarette, sat down on the concrete patio, and leaned back against the building.  There was a lip on concrete pressing into my back, but I was so incredibly comfortable.  I kept putting my hands to my face or sucking on the top of my Coke bottle.  I have never felt better in my own body as I have on shrooms.</p><p>As I sat smoking, I studied the concrete, which was stained, and I saw a lattice, a pattern underlying all the marks and the shadows cast on the patio.</p><p>I felt so incredibly happy, being in my own body and seeing all the patterns and beautiful things of the world that I had previously ignored.</p><p>My evening went on and continued to be simple yet incredible, full of patterns and comfort.  I didn't have any deep realizations except that life is incredible and beautiful, and it's a gift to be in our own bodies and to live.</p>"
}
