{
 "title": "A True Separation of Mind/Body",
 "author": "Matt Thomas",
 "citation": "   Matt Thomas. \"A True Separation of Mind/Body: experience with DXM Freebase (ID 1898)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1898",
 "substance": "DXM Freebase",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1050 mg",
   "oral",
   "DXM",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "",
   "1898",
   "Male",
   " ",
   "Not Given",
   "Jun 16, 2000",
   "8931",
   " "
  ]
 ],
 "report": "<p>I used Bill White's DXM FAQ 3.0 to make up some DXM freebase. The 2 layer naptha/syrup method seemed easier than filtering out precipitates. The result was a nice yield of about a gram of nice white powder. I emptied out a few capsules and put the DXM in to make it easier to swallow. A small meal beforehand seemed to make sense. 2 beers were used to wash them down and help disolve the freebase. It took about 2 hours till I felt the least bit of a buzz. From then on it was getting better by the minute. I was very pleased to find there was absolutely no nausea or itching. Music sounded fantastic and I didn't seem so 'confused' like other DXM trips via syrup-gulping. There were times durring the peak when I felt a 'hot acidic' sensation in my veins. At no time was I ever afraid, I had a deep euphoria and there seemed to be other people around who were reassuring me (there was only me in the room). </p><p>During other DXM trips I had glimpsed a *place* or rather a feeling of a place akin to the *DMT Dome*. I never had a good view of the place until this trip. It's a strange place deep within myself that's very small and holds memories of things that i've never felt otherwise. A DXM trip is a very confusing experience in itself, but one can make sense of the confusion by letting go of the rules that rule our lives. I stumbled on this 'path' that takes me to that place. A word that describes the feeling you feel is 'groove'. It's a groove that, when you're *in it*, you are taken there. I actually saw it. This is a recurring feeling that i've had in previous dxm trips. I've used DXM about 40 times and had a glimmer of this feeling every time. Only now do I see it clearly. </p><p>Once inside this place I am faced with a wonderfully clear picture of the world as a very simplistic whole. As if I was an all knowing creature looking at the world for the first time. There are also other presences there that somehow know me. I know this sounds like the 'death experience' but I assure you I was very alive. The beings seemed only to be there to assure me I was in no danger and left when they conveyed that message. In this place I was free to move in what seemed to be a soup of conciousness. My inner self felt as if it had separated from my skin and body and was moving around loosely within me. I could do spins and move around without moving my body, only by thinking. I once thought that I turned over in bed to my other side to get a new CD and started reaching for my CDs only to find I had not moved at all! </p><p>There was a strange glow when I had my eyes closed and I could focus on the walls of this place as if my eyes were seeing a real image. The walls of the place seemed about 30 feet away from me, my room's ceiling and walls are never more than 15 feet away or 8 feet high... It had a gray-green color and was smooth and glowed slightly. I was either standing or floating in front of this wall and I could move freely. I was very focused and very relaxed as this was happening. The music I was listening to seemed to be coming in through far away speakers and not through the earphones I was wearing. </p><p>A true separation of mind/body had been achieved. The experience IMHO was more enlightening than an LSD trip. Neither is better than the other, both have pro's and con's but I needed something new this time. The next day I felt GREAT! I was expecting to have a sluggish, confused state of mind. Things seemed so peaceful and beautiful and I had a great appreciation to be alive. I also felt very good about myself and was very self assured. The enzyme that metabolizes DXM is also responsible for something serotonin related. This may explain the good mood the next day. A hell of a lot of that enzyme had to be released to metabolize a gram of pure DXM. I don't feel the urge to take more but I would do this again before I take any more acid when I want to trip. Acid is too much of a strain on me.</p>"
}
