{
 "title": "Every Which Way",
 "author": "Ernie R",
 "citation": "   Ernie R. \"Every Which Way: experience with Tramadol (Ultram) (ID 19002)\". Erowid.org. Mar 30, 2006. erowid.org/exp/19002",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "77 kg",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(capsule)",
   " ",
   "  ",
   "smoked",
   "Pharms - Tramadol",
   "(powder / crystals)",
   " ",
   "100 mg",
   "insufflated",
   "Pharms - Tramadol",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19002",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 30, 2006",
   "Views: 26677",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOur party of three genrally take mdma and smoke cannabis, generally nice skunk, here in scotland. Since one of us has an extremely accomodating gp we also have access to tramadol, effexor, diazepam and fluoxetine/prozac.\r\nMy two friends both enjoy tramadol quite a lot but I never really took much of a liking to it. In fact most times I found it hard to discern any effect from it. I also find the same with diazepam. I find it hard to see how people can take either recreationally. I read once that about 25% of people don't get much effect from the standard dose of painkillers. I've always believed that to be true of myself. I don't think paracetamol etc ever help me with a headache etc so I don't usually take them. I don't know if that is why I don't enjoy tramadol, I really don't.\r\nAnyway one night when we couldn't get any mdma or cannabis we decided to take lots of tramadol and see if I could get anything from the experience. So male friend had four 50 mg tablets, as did I and female had two. We washed them down with a little red wine  and sat about and listened to music and chatted, which was nice but really I couldn't say whether the tramadol did anything I could notice.\r\nAfter explaining to them that I wasn't really feeling much we decided to supplement by smoking some, hoping that this would do something. We sliced open the capsules and put about 75 mg in to a two kingsize skin joint. Smoke was pretty unpleasant plasticky and harsh on the throat but none of us really felt much nausea from it. However keeping the joint lit was hard, it kept on going out which was a pain in the ass. We tried playing about with the way we rolled it. We mixed 100mg with a couple of drops of brandy to make a dryish paste which we mixed with the tobacco and then rolled. That smoked a little better but I certainly didn't feel any real hit off of it. Since then it has occurred to me that we might need to convert it to the freebase to smoke it properly and maybe purify it to get rid of any fillers or shit that are in the capsules, luckily female friend studies pharmacology so we're going to look into that. \r\nWe smoked six joints in total but I think that was mainly because I enjoy smoking a lot and the whole rigmarole of skinning up. Male friend and I also snorted two tablets each. Again it was fairly unpleasant but we generally dip our thumb and forefinger in brandy and snort a drop of that after each line to try and get rid of the taste/smell/feeling and hopefully help its uptake into the body. We also do that when we snort mdma.\r\nSince none of us were really getting any effect except drowsiness we decide to knock it on the head and go to sleep. I was a bit worried because we had all taken quite a lot more than we had before, but the only problem was pretty bad constipation for that night and most of the next day. I had a pretty good sleep and felt pretty relaxed. \r\nWe spent quite a lot of the night talking about our other friends and deciding to try and be more honest and open with them about how we feel about the way they act and treat each other. Since the three of us have been taking pills together we all feel we've resolved a lot of issues and behave in a way more in keeping with what we believe. I don't know if the tramadol helped that sort of conversation much but doing it gave us an opportunity to chat in that way when we weren't all taking mdma.\r\nSince then we haven't really taken tramadol in that way again. I sometimes smoke a joint of it if I'm having trouble getting to sleep and I don't have any weed. We might try it instead of diazepam for coming down off pills but I don't intend to try it for pleasure again although female friend stills takes one from time to time.\n\n\n"
}
