{
 "title": "2C-Impressive: A True Psychedelic",
 "author": "RG",
 "citation": "   RG. \"2C-Impressive: A True Psychedelic: experience with 2C-I (ID 19017)\". Erowid.org. Nov 18, 2002. erowid.org/exp/19017",
 "substance": "2C-I",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "2C-I",
   "  T+ 2:32",
   "0.5 mg",
   "oral",
   "Pharms - Alprazolam"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19017",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 18, 2002",
   "Views: 11944",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI awoke at 12pm on a Sunday. I didn't have much to do, and I recently acquired a chemical that sounded very interesting. It was raining out, and I thought that was nice, I find rain to be relaxing. It was cold out anyway. </p><p>I had read everything I could on this chemical, all trip reports, dosage recommedations, forum posts. I was excited and nervous about trying it. </p><p>My previous experience with psychedelics includes mushrooms, LSD, 5-MeO-DMT, MDMA and a few others. I was expecting a gentle, relaxing trip that was fairly mild. I kept a Word document open as a journal for the experience. The following is that document:</p><p>12:05\t15mg taken on empty stomach 10 minutes after waking up with some oj.</p><p>12:20\tSet and setting- rainy outside. House quiet and empty. Stomach hurting slightly. Have headache, probably unrelated. </p><p>12:40\tNo confirmable mental effects, but nausea getting bad. A hot feeling is developing in my stomach and is extending into my body some, not really bad, not good. Slight physical stimulation starting.</p><p>12:45\tI feel something in my head. Nausea bad, going to lay on bed.</p><p>(typing at 3:15)12:55\tThrew up bad, with a few dry heaves.</p><p>1-2:30 full psychedelic.  I am very impressed and should have been more prepared for the experience. Visuals very impressive-tracers, digital like, cev, very interesting patterns, fluid like movement. Multicolored, beautiful patterns formed that looked like ancient writing, when looking at things up close or when I closed my eyes. Very introspective.   Just laid in bed with music playing. There was a point where I was a little anxious, hearing things, like voices, and vehicles pulling up, but my dog was there and she is a good watchdog. Worried about visitors. Wanted to be alone. Nausea gradually subsided. Thought about many things. It was like dreaming in a way. Got notebook to write at beginning of this time, but laid it on my disorganized dresser and didnt feel like touching it.</p><p>2:37\tRealized I had some responsibilities that were earlier forgotten. Feeling was still going intense. Took .5xanax. </p><p>3:20\tRight now, feeling good. This was impressive. Still have some visuals and tracers. Sipping on chocolate milk. I am glad I can pretty much function normal.  I am glad it is raining in a way. Colors very bright, very nice to look at the leaves. Still some jaw tightness, not as bad as before. I think it is a relaxed psychedelic compared to others, making it almost perfect. I can imagine having an experience too intense, but I can't imagine pure panic.  The beginning got scary at first, the stomach twisting was a lot to handle.  I actually felt poisoned for a while.  I wish I would have taken this at night, but outside looks beautiful. The computer just froze I am so glad this program recovered it, lol. I like the body shivers I get in a way. Too bad I have a slight cold during this. I am returning to my normal self after a dreamlike experience. I was laying in bed listening to music and thinking about my life and life in general. My ego was definitely lost some.  I just didnt expect this, and right now, I dont really know what I did expect. I never really woke up today in a way.</p><p>3:55\tListening to pink floyd.  Dont know what to do with myself really. Wanted to fix computer but I want music. I just want to feel comfortable.. I do, but theres some things I first must have to do before I really am. I need to clean my room and get things organized. WOW first time Ive seen snow this season or maybe that was just a visual from the leaves falling.. I dont know. No more magical compounds for a while I need to get organized. I wish I didnt have to take that xan, but I had to. I didnt realize when I took it that it might be too intense for me to do my daily activities.  Great psychedelic,  wow. </p><p>4:05\tI think if I didnt take the xan I would still be pretty calm now. It started getting calmer at 2:30 but I still was anxious about being up and about. Im hungry but my stomach wouldnt handle much. \t</p><p>4:10\tIts quite intense looking at the leaves. The depth of the color is phenomenal. Meditation is more possible. Memory loss of the peak is there, it was like a dream in a way. I can recall specific events and feelings from it though. I should not distribute this chem., only to chosen close others, and to that word I have yet to define who. There are some really comforting feelings I am getting, and then other, negative vibes, originating from other people, and responsibilities, and the unknown. </p><p>4:15-8:45 I am still tripping. I feel pretty good. I clean my room, do some laundry, and play games on the computer.</p><p>9:00\tDepression has set in. I still feel slight effects , slight visuals. I hope I feel better. I havent been this down in a while. I take a multivitamin and some extra B vitamins.</p><p>11:00   Still slight residual effects. Depression lessening, most likely from the vitamins. Watch some TV. </p><p>I fall asleep at about 1am, with no real problems. That was last night, and I feel normal today. This chemical impressed me, and the experience reports, dosage recommendations, and forum posts didn't fully prepare me for this. I believe I am more sensitive than others to this chemical. I have normal tolerance to lsd and mushrooms though. I would like to point out that, if trying this chemical for your first time, start out light. The experience I had was much more intense than I expected, in good and bad ways. </p><p>I look forward to taking this chemical again, at night, in a few weeks. I wouldn't want to do this more than once every two weeks. Overall, it was a great trip, I was very impressed, and I am glad that I ingested 2C-I.</p>"
}
