{
 "title": "Jellybean Brain",
 "author": "neurochemist944",
 "citation": "   neurochemist944. \"Jellybean Brain: experience with Anadenanthera spp. & Syrian Rue (ID 19034)\". Erowid.org. Jul 16, 2003. erowid.org/exp/19034",
 "substance": "Anadenanthera spp. & Syrian Rue",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   " ",
   "1 tablet",
   "oral",
   "Dimenhydrinate",
   " ",
   "  T+ 1:45",
   "9 seeds",
   "oral",
   "Anadenanthera spp.",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19034",
   "Male",
   " ",
   "Not Given",
   "Jul 16, 2003",
   "Views: 16775",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: The term 'yopo' is traditionally used in reference to Anadenanthera peregrina. Recently many people have started using it to refer to both A. peregrina AND A. colubrina. This report specified only 'yopo' so we do not know the exact identity of the seeds used.] </p><p>The first time I tried Yopo and Rue, I took 3 grams of Rue and 4 seeds of Yopo, ground them, and made a lemon juice huasca.  The results were only puking and a difficulty in walking.</p><p>The next time, I Ground up 9 seeds of Yopo and 4 grams of Rue in separate small amounts of apple sauce.  It played out as follows.</p><p>1 pm:  At home, I eat the Rue in apple sauce, chased with gatorade and a chewable dramamine.</p><p>2:30: TV is hilarious now.  In a blink I see a CEV flash, then confirmed by shutting eyes and concentrating on a matrix of shapes.</p><p>2:45: I eat the yopo chopped up in applesauce, during which it's hard to walk.  Feeling stoned.  It is hard to accomplish any task or concentrate at all.</p><p>At 3:30 I puke, after which I crawl into bed.  Respiration is shallow.  I begin to have modest closed-eye visuals, but all related to stuff I usually think about (school, friends, etc.)  None of it makes any sense, and just as I think I'm getting somewhere in thinking about a topic, I start thinking about something else.  This continued for another 2 hours with eyes closed (and I might have drifted into sleep, who knows).</p><p>After this period, with much struggle I manage to get a ride to a volleyball game, during which I'm extremely tired, and it is difficult to converse with any of my friends.  I simply feel dumb.</p><p>Overall I was disappointed, and will shy away from oral ayahuasca in the future (it really hurts to puke when I'm not drunk!)  The experience makes me want to reduce each product to crystals.  If using Rue and Yopo, I'd suggest perhaps grinding and smoking the rue (minus the seed cores), and snorting the Yopo with a basifier.</p>"
}
