{
 "title": "Smart Drug DXM",
 "author": "Joey",
 "citation": "   Joey. \"Smart Drug DXM: experience with DXM (ID 1906)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1906",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "225 mg",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "1995",
   "1906",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 19, 2000",
   "6794",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Would there be many of you who agree with me on dxm being more of a substance to learn from than a physical nonbeneficial experience. The further I experimented with it, the better I started understanding it. Of course, this is probably not the case for everyone, but for the most part, its a neutral unbiased inhibition release(for me). I usually feel rather dynamic and alert while robotiking. It wasnt always like that; when I first started, it was just an alternative for unavailable psychedelics, and comparing it as so, the experience seemed rather wasteful. After a few wastes, I started getting the hang of it. And what started as a heavy\n</p><p>Joey</p><p>========================================================================</p><p>You are first person to affirm my own experience with DXM. I felt like it raised my IQ by 10 points (but I don't believe in the concept of 'IQ' at all). In a low dose, it seems to open dormant areas of my mind, so I can see things more clearly. I thought it might be a fortuitous drug interaction, as I am also taking an antidepressant, Effexor (venlafaxine). What dose were you using? I think about 200 to 250mg is about right. More than this gives too much LSD like effect, and my fantasties begin to seem more real, which can be dangerous. I'm also not sure about the duration of the effect; it seems to be rather prolonged; I'm not sure it entirely wears off at all, which is a good thing for me. It is unfortunate that most of the dxm available is combined with much more toxic drugs (such as acetaminophen, pseudoephedrine, antihistamines, and even alcohol-although in minimal amounts). I think this accounts for some of its bad reputation on the net, as well as the fact that the high doses often suggested make one nonfunctional. The intermediate doses make me more functional. I think it should also be tested as a treatment for dementia, particularly Alzheimers disease, at this dose level. </p><p>Anonymous</p>"
}
