{
 "title": "Rainbow Cartoon Visuals Kick Ass",
 "author": "StuckMojo",
 "citation": "   StuckMojo. \"Rainbow Cartoon Visuals Kick Ass: experience with 2C-T-2 (ID 19061)\". Erowid.org. Nov 21, 2002. erowid.org/exp/19061",
 "substance": "2C-T-2",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19061",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 21, 2002",
   "Views: 8853",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok....just got off work....mail containing the goods in hand.  I arrive home and un-wrap the god-sent 2C-T-2 in a nice tight little baggie which totalled out to be 250 mg said the reputable supplier. I divided that into 10 equally eye balled parts and downed one of them just to be on the 'SAFE??!!?' side of it going for somewhere inbetween light and the strong effects.</p><p>About 45 mins into it I get my first alert....NASEUA....ah sweet naseua. I held it like im used to from my many times holding in the ol' 8oz of tussin </p><p>max but my effort was to no avail....I puked violently....and at that, was the start of the neon color revolution unraveled! I layed on my bed from the body load un-willing to type to fellow friends on irc and the visuals built up....and built up....and built up.... and wow...let me say.  These have been the most beautiful colorfull visuals ive ever seen in my life (ive done 2C-T-7 (low dose), DXM, ketamine, LSD, 5-MeO-DIPT (VERY HIGH DOSE), 5-MeO-AMT, AMT, 5-MeO-DMT) and nothing could compare to the graphical nature of them.</p><p>I could visualize fully rendered animated scenes of billboards with names with vibrant colors streaming on all sides that then disintegrated into chinese lettering fractualizing into infinity (GOOD VISUALS :D:D:D:D). Around the 2 1/2 hour point I pryed myself from my mind movie and got on IRC and told my friends about what I just experienced. They just laughed and called me a 'TARD' :( Oh well....I knew it was all real....I knew that i've been givin a rare glace at beauty very few have laid there eyes on. </p><p>About the 5th hour point my visuals faded leaving me with a fairly burnt out 'AFTER GLOW'.  </p><p>All in all i'd say this substance is 'POWERFULLY VISUAL'.  Not  insanely visual like 120mg of 5-MeO-DIPT....but POWERFUL. I'd only suggest this compound if you're a stomach warrior like me and can sit through some heavy naseua to get to the real pyro-technics, if ya know what I mean ;)</p>"
}
