{
 "title": "Theory: Dehydration + Hot Bath = Problem",
 "author": "shpoffo",
 "citation": "   shpoffo. \"Theory: Dehydration + Hot Bath = Problem: experience with Mushrooms (ID 19096)\". Erowid.org. Feb 3, 2005. erowid.org/exp/19096",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "oral",
   "Mushrooms",
   "(cookie / food)",
   "  T+ 0:30",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19096",
   "Male",
   " ",
   "Not Given",
   "Feb 3, 2005",
   "Views: 6213",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>J and I had each consumed about 2g of psilocybin that had been disolved into two chocolates (each about the size of bite-size candy 'bars').  This tasted like the cheap bulk crap, though it was still milk chocolate.  Each of us weighed about 140 lbs and had eaten a bit of crackers and other semi-snacks beforehand.  </p><p>We started by splitting one chocolate (~1/2g for each of us).  At T+30minboth of us were feeling a bit of a rise, and were more comfortable taking more.  At this point we split the remaining three chocolates (~1.5g for each of us), and the trip slowly built over the next 1-2 hr.  At T+3 we were both quite soaked in sensation and played about, sharing the experience.  The time was very euphoric and filled with pleasent and intriguing though which we communicated and explored.  We laughed and cried and shared a beautiful time.</p><p>By T+6 we were both feeling like we'd come down a bit, though our pupils were still rahter dilated and we knew we weren't completely down.  We were much more mobile now, and took to a homemade cookie, a sip of water and decided upon a bath.  J perferred the bath very hot, and I gave in (against my preference for hot baths) and we soaked together.  </p><p>At T+7 J began to feel very nauseated and began to quickly feel sick.  She stood up to get out of the bath and spoke of dizziness, which I quickly moved on in case she was indeed not well.  She became very unstable standing, but couldn't move from the tub for lack of balance.  I made it out of the tub while still giving her support in time to help out as she almost fell out of the tub. I wrapped a towel around her and she stumbled toward the bathroom door, which I had to prop her up against to prevent her from falling.  At this point her legs gave out from under her and I guided her fall to a sitting position.  At this point she 'faded' for a moment and I couldn't seem to feel her breath or heartbeat - both of which returned a moment later and her eyes were much more alert.</p><p>I helped her to the bed and waited carefully on her and she moved through a 'bad trip' experience (music, light, etc made her uncomfortable).  Her body was very hot during this time as well.  She later recounted not remembering the period of time from standing up until she was on the floor of the bathroom.  During that time she remembered having to make a conscious decision to 'come back' and not 'go somewhere'.  Later in the evening she felt much better and we ordered tofu & vege chinese food and watched some cartoon series - the evening brightened up quite a bit and all felt much better.</p><p>I have read naturopathic medical advice against hot baths, though J takes them frequently, and has done so once before when on a mushroom trip. I as well have bathed while tripping (though not on psilocybin) with no detrimental effect.  Our belief is that the incident was due to dehydration, as neither one of us consumed much liquid prior to the trip and in the 7hr of the trip.  This is purely speculation, and the report is entered here for the general good.  Please be extremely careful of bathing when tripping, and at least be well hydrated and take other precautions if you plan on attempting so.</p>"
}
