{
 "title": "Sinking Through the Bed",
 "author": "clutch",
 "citation": "   clutch. \"Sinking Through the Bed: experience with Morphine & Oxycodone (OxyContin) (ID 19117)\". Erowid.org. Feb 17, 2003. erowid.org/exp/19117",
 "substance": "Morphine & Oxycodone (OxyContin)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Morphine",
   "(pill / tablet)",
   " ",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 19117",
   "Male",
   " ",
   "Not Given",
   "Feb 17, 2003",
   "Views: 38023",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was near Christmas and my choral group was putting on a concert for some local women's club.</p><p>Afterward's a friend of mine asked me if I wanted some OC's.  I said sure.  He sold me the Oxy for 15 dollars and threw in a free 10mg morphine tablet.</p><p>He told me to take them both at the same time, he said the feeling was amazing, almost orgasmic.</p><p>I drove home and at 5pm I took the morphine and snorted the oxycontin.  About 15 minutes later I felt the usual opiate/narcotic laid back feeling.  I am pretty experienced with opiates and narcotics having taken everything from Codeine to percocet to lortab to demerol.  I also smoke top quality marijuana everyday.  30 minutes have passed and I am having trouble walking and concentrating.</p><p>I want to sleep but I know it will be a waste of good pharmaceuticals.</p><p>I get something to eat and try to read a book.  This doesnt work so I just sit on my bed enjoying the body tingle and 'sinking through the bed' feeling.</p><p>1 hour and 30 minutes have now passed and I can barely keep my eyes open.  Finally I pass out.</p><p>I have some great dreams while out but they are hard to remember.  Opiates give me great dreams. Sam Taylor Coleridge wrote most of his poetry under the influence of opitates.</p><p>When I finally wake up several hours later I still have the laid back feeling, but nothing too great.</p><p>Overall I would say it was pretty boring and way too heavy of a dose to enjoy.  All I wanted to do was sleep.</p>"
}
