{
 "title": "Window To My Own Fears",
 "author": "Cramer",
 "citation": "   Cramer. \"Window To My Own Fears: experience with MDE (ID 19141)\". Erowid.org. Nov 24, 2002. erowid.org/exp/19141",
 "substance": "MDE",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDE"
  ]
 ],
 "footer": [
  [
   "2000",
   "19141",
   "Male",
   " ",
   "Not Given",
   "Nov 24, 2002",
   "Views: 15229",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was traveling across the country with a friend and came upon an old buddy of his who had purchased a jar of 'MDE'. I had never experienced this before and was curious to find out what, if any differance there might be from MDMA. After ingestion, the pill kicked in surprisingly fast, aprox. 15 minutes...FULL SWING. The trip lasted around 2 hours. My friend was passed out when I got back to the place to where we were staying. </p><p>After listening to his Carlos Castenada rants so often I decided to take advantage of the time alone, and tried to meditate (by the way as a student of tai chi, and kempo, this wasn't my first attempt at meditating). Almost instantaniously, after closing my eyes, I was no longer in control of where my mind was taking me. I remember having a vision of being in a resteraunt, then moving through it towards the bar; as a former barkeeper, I was naturally comfortable with this experience...however, I had never seen this bar B4, or the people at it. My focus was becoming more and more vivid, for a moment I opened my eyes to confirm that I wasn't dreaming...when I closed them again...I hadn't missed a beat, I was still at that bar scanning through the patrons. I then found myself witnessing an argument between a man and a woman whom I've never met. I felt empathetic towards both of them, recognizing their struggle, he meant well, but couldn't find the right words, she, obviously cared a great deal for him but was doubtful of his intensions. The Argument escalated and I became very disturbed...I had to open my eyes again.</p><p>My heart rate was up, my breathing was heavy, I had found a window to my own fears, to see what frustrates you the most, and not be able to do anything about it. I stopped and wrote down the whole experience, so I would remember, not knowing the side effects of MDE, or weather I even could. I closed my eyes again a few minutes later and tried to go back to the bar, but I had missed my chance. My mind was to shaken, I immagine. I walked around outside for a while and wrote a letter to my girlfriend back home... I took MDE one more time about a year later, the effects were comparible, but nowhere near as, disturbing...round 2 however, did include an inabitity to sleep, intense closed eye visuals, warm and cold spells, jitters, and/or tremors... hope this wasn't a total waste of your time...best of wishes for your research. -Cramer</p><p>Oh by the way, both times, I was in great spirits prior, the enviroment was clean and cozy, the next day wasn't a big deal, I'm sure that I was a lil' fuzzy, but nothing that stands out in my mind. All and all no complaints, although, I too am beyond my flirtations with E, and it's cousins... hope I was of at least a bit of help, good luck!</p>"
}
