{
 "title": "I Was so Alone",
 "author": "Blue Tips",
 "citation": "   Blue Tips. \"I Was so Alone: experience with Mushrooms & Cannabis (ID 19151)\". Erowid.org. Jul 23, 2007. erowid.org/exp/19151",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19151",
   "Male",
   " ",
   "Not Given",
   "Jul 23, 2007",
   "Views: 3841",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok. So Im sitting in central park with 3 friends. One has taken shrooms many times and has had positive reactions. my other friend and I thought, it was our first time. We split 3- 1/8s of shrooms, three ways, but I believe I had more than my other friend but as much as the friend who has taken them before. </p><p>So we ingest the mushrooms on central park west at around 230-300. I sit down near an Alice and Wonderland statue. Nothing is happening so we share a small spliff of some really good bud, but a very small amount. I take around 3 small drags. Im ok, maybe a little high. We are sitting in a filed across form the statue, and all of a sudden. I look at the trees and they look a little funky. I put on my glasses to get a good look, the two different spectrums from the glasses vision from the normal vision was crazy. When I looked under my rims and back to the glasses the things I was looking at would swerve and liquify and it was evensually look mosaic like. Pictures would spread.</p><p>All of a sudden I felt a high feeling of anxiety. I was crazed for time. I was getting so friggin umcomfortable with the people I was with. They were sitting talking ignoring me I thought. They looked like bums to me with their hoods on and their big jackets over hate sweat shirts cause it was cold out. I started to loathe my best friend. I just wanted to get the hell out of the park. Everything felt really hazy. The trip back to get apartment felt like a jounrey that we had been on for hours. The day appaered to constantly change from day to night, then it would be light, then dark. I dont even remember where I was walking or wut I was seeing I just wanted to get back to her apartment. I even tried paying her to run and get me a cab but she wouldnt. I suddenly felt so weird. I just sat down no a bench and took a little nap. That felt like an hour but was 30 seconds Im told. </p><p>We get to her apartment and I lie down on the coach and start shaking and trembling and flipping out. I wanted to go home to my bed. I didnt want to stay and play video games. No one was listenin to me. Suddenly I felt as thought my life was ending. Nothing was worth it. I had fucked everything up. I was a bad person and I was either going to die, kill myself, or stay crazy forever. When I would speak I would stutter and just ramble. I would hallucinate about certain situations thinking crazy things. I thought I was sick and dying. I was so scared and unhappy and I felt as though my world was ending.</p><p>I got on the floor. Rolled up into ad little ball. Trembing, shaking, crying. Yelling and screaming and rambling hallucinating crazy sitautions about my life and everything was fucked up. My friends were just sitting there playing video games telling me to shutup, I might have been hallucinating this. I get on the my phone and call everyone I know. I was like come get me please Im gonna kill myself. Im so scared. Please just come get me, bring them home. I felt so alone. I felt as if I was going insane and I would be like this forever. I came up with a theory that my friends were going crazy too but they didnt know it and thats why they were being jerks. There eyes were crazy with pupils the size of dimes. Thats where I got the idea that they were trippin too. I called the guy I got the shrooms from. He explained to me that I was gonna be alright and not to kill myself or go to the hospital and he would talked me thru it and get me.</p><p>His words were so re-assuring. I kept tripping hard for like an hour after that and just like hugged my friend and weeped. All this time I felt as thought I was in a crazy crack house or insane asylum. Youd see me flipping out running in circles crying on the floor in a little ball. A girl on the coach smoking a bong an telling me to shut the fuck up was just so absored in her world and my best friend playing video games with a her 5 yo brother who was freaking the fuck out by me. I go to the bath room. And my zipper on my pants was like so distorted. And my fingers would double in number. I looked in the mirrors at my face. My pupils were huge and that scared me more. My eyes would drift among their usual space and my nose was distorted. I got scared and went back in the room.</p><p>The walls felt as thought they were huge and my friends looked like elfs or leprahans with green complextions and weird eyes and noses like leprachans. Soon though at around 6-630. I would eventually calm down and start enjoining the shrooms. I felt so relieved I wasnt going to die or be in hell forever or stay insane. All the time I had a feeling that this was just the shrooms but I was in a whole different world and it was so real. It scarred almost to the point of jumping out the window. I started talking fast and having crazy ideas. I played video games and would play and have 4 conversations at one. One on my phone with my friend, one with the kid, and I would be playing the game.</p><p>At around 630-7. I felt so good and relived. I was so happy and everything made sense. My eyes were open wide and colors were so clear and I had amazing vision. I would occasionally yell at pedestrians on the way home to my apt. But it was good. I had so much energy and felt Amazing.</p><p>But in the end, I will never do mushrooms again. I have never been so scared in my entire life. Today has been the first day. I feel fine. A tiny bit spacey but thats just because Im tired. I feel better than before. I feel less depressed and more alive. I feel that my bad trip gave me a crude awakening. But ye. I hate shrooms.</p>"
}
