{
 "title": "Galangal Experiments",
 "author": "Various",
 "citation": "   Various. \"Galangal Experiments: experience with Galangal (ID 1916)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1916",
 "substance": "Galangal",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Galangal",
   "(roots)"
  ]
 ],
 "footer": [
  [
   "",
   "1916",
   "Male",
   " ",
   "Not Given",
   "Jun 19, 2000",
   "27523",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>From: John Anderson </p><p>Newsgroups: alt.drugs </p><p>Subject: Galanga Injestion </p><p>Date: Nov 1993</p><p>> I eat galanga all the time. I was first introduced to it when I started </p><p>> getting into Thai cooking. Galanga (also called 'Laos') is used </p><p>> extensively as a spice throughout Tropical Asia. </p><p>> </p><p>> Forget the dried or powdered stuff, get fresh! It is available in Asian </p><p>> grocerys all over Dallas, so it can't be that hard to come by. It looks </p><p>> much like ginger with a translucent skin. It costs around 2.50 to 6.00 </p><p>> dollars a pound, and that goes a LONG way - it's potent! </p><p>> </p><p>> I often make a spicy chicken soup, and through in about 10 slices of the </p><p>> fresh stuff (the receipe calls for 5). It's DEFINITELY psychoactive! I </p><p>> experience quite a buzz within 10 minutes of finishing a bowl. I agree, </p><p>> it's somewhat like marijuana - but I really like it. I make the soup </p><p>> often for friends and all have experienced the buzz - some quite </p><p>> intensely.</p><p>Excellent, thanks for the tip. I had some last night in my rice, but I didn't use quite enough for the effects to be noticable. For me it takes about two heaped tablespoons to get the effect. (into a cup of rice) Unfortunately any more than this and it gets too strong to eat!</p><p>> If anyone's interested, I post the receipe (apart from the psychoactive </p><p>> properties it's quite delicious!)</p><p>Yes do that! I'm sure there would be heaps of interested parties, including myself \n</p><p>> One final note: I have found other interesting things in Asian grocery > stores, like betel nuts (including FRESH frozen ones at one store), > assorted inhalents, and bizzare bottled herb & vitamin drinks.</p><p>Inhalents?? interesting, I have noticed all the herb drinks but never thought much about them. Ever tried any?</p><p>The inhalents are not as exciting. They're all pungent smelling concoctions based on volatile oils like camphor or eucalyptus.</p><p>Like I said, I'll post the galanga soup reciepe as soon as I get a chance to dig it up. There's also a file on galanga at ftp.hmc.edu.</p><p>=========================================================================</p><p>From: Kenneth23 </p><p>Newsgroups: alt.drugs </p><p>Subject: Re: Galanga experiments </p><p>Date: Feb 1995</p><p>Well, I don't know about brands, but fresh galanga is absolutely DELICIOUS in south-east asian cooking! I once had a Thai friend make me a sort of white curry with chicken and galanga. There wasn't much -- mabye a few 4'x2' slices in the entire (large) curry pot, so I didn't get any sort of 'high.' The flavor, though, was fantastic when cooked, vaguely gingery, yet distinctly different.</p><p>=========================================================================</p><p>From: Bruce Dale </p><p>Newsgroups: alt.drugs,alt.psychoactives </p><p>Subject: Re: Galanga experiments </p><p>Date: Feb 1995</p><p>Gees yeah</p><p>I also was very inspired by the galanga.rpts @ hyperreal.com's archives [http://www.erowid.org/herbs/galangal/] and followed what the instructions on what appears to be 'a modern legend' - that is two teaspoons of dried galanga(l)/laos powder and felt zilch !!</p><p>Tried 4 teaspoons in orange juice 3 days later and still nothing. !!</p><p>Had much better luck with Guarana...</p><p>Might stick to the real stuff in future !!</p><p>=========================================================================</p><p>From: Tommy the Tourist </p><p>Newsgroups: alt.drugs,alt.psychoactives </p><p>Subject: Galanga -Forget it! </p><p>Date: Mar 1995</p><p>I posted a few weeks ago about my experiments with galanga. At that time I had tried both powder and dried roots with no psychoaactive effects whatsoever. Last night I found fresh roots at the local Middle Eastern grocery. I bought about 10oz of roots that slightly resembled small onions with tops. I trimmed off the green shoots saving 8 1-1.5' diameter roots about 2' long. Probably 8oz of solid roots total. I put them in a blender with 24oz of V8 juice and blended until smooth. The mixture wasn't quite as foul as the powder or the ground, dried root, but it was still pretty unpleasant. I waited 20 minutes between halves to let my stomach recover. No psychoactive effects within 3hrs so I went to bed. A minor case of the trots the next morning for all of my efforts. No more galanga for me.</p>"
}
