{
 "title": "Bawling Apes and a Faux Pas",
 "author": "Zonker",
 "citation": "   Zonker. \"Bawling Apes and a Faux Pas: experience with Mushrooms (ID 19195)\". Erowid.org. Aug 29, 2007. erowid.org/exp/19195",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "1994",
   "ID: 19195",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 29, 2007",
   "Views: 3081",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is an account of a night eight years ago; I haven't done mushrooms since, although I want to. At this time I was losing in life in a bad way, but I couldn't see how slowing my drug use would help. Although I used a lot of acid and occasionally did shrooms, I never used a sitter, nor did anyone I knew. This, more than anything, probably, made me one of the more far-out and hard to understand people you'd meet ':| I'd been kicked out of one dorm at the university for possession (of marijuana, not by the devil) and had just moved to a new dorm room. I wanted to christen the room with a shroom trip.</p><p>I bought a 1/4 ounce bag of unidentified shrooms and waited until my roomie left. Then I ate the shrooms alone, and put on Jimi Hendrix's Woodstock Live album. This was probably about eight PM, but beyond that I can't give details on timing. I remember thinking that it would be good to take a shower while I came up, but the stupifying ascent began too soon. I sat down in my bathrobe and began the trip. It started out with a simple visual of a flying saucer, but that seemed silly. I didn't want to trip on UFOs. I lay down and put my arm over my eyes, hoping for some more interesting visuals. I came loose in time, it seemed, and the scope of the experience was awesome. I followed glowing lines making abstracts across infinite planes for what seemed like forever before the theme took hold.</p><p>I considered planet Earth from an objective viewpoint: a glob of God Snot. God sneezed while huffing butane and the grotesque result was the universe: forgotten and unimportant as a tissue filled with mucus. Men and women were bawling apes, ancephalic gorillas desperate for meaning and purpose. A savior arose: Sigmund Freud laid down logic in the shadowy mind of man and It Made Sense. Freud died; then came Jimi Hendrix. Through experimentation with LSD, he rediscovered Freud's magic circuits for creating meaning and programming people. I saw Jimi as a decadent savior, misusing his talent to send Voodoo curses out on the sea of people in the audience ('well I stand up next to a mountain...'). How disappointed I was! My hero did not create meaning, but rather used the Gift to destroy and to gain power. Jimi was his own Wa-wa pedal, riding the Loop of continuous Inspiration, high on himself for all eternity. Useless.</p><p>Then came me. My creative vision of the universe had something terribly wrong with it. I wanted to fix the problem, but I didn't know what it was. I tried to shed my mantle of Godhood, but only became an inmate in an insane universe. I gave up the Gift that would have shed light into the Void, and now I was captive in an insane asylum stretching beyond the stars. I woke up screaming 'I don't want to be God anymore! I don't want to be God!' Someone said, 'Hey, over here!' There, in the doorway, I saw my floormates. One had stuck a plush gorilla under his shirt, so the head protruded through the neck. 'Look,' he said, 'We're all monkeys!' 'Oh my God,' I thought, 'it's true!!!'</p><p>Other classic irresponsible bad trip details of that night: me collapsed and drooling in the hallway, trying to make it to the showers; me accusing an innnocent hallmate of making a gay pass at me; me hugging a random black man who was undressing in his room at the time.</p><p>So what did I learn? Well, primarily and most importantly, visions that occur in a trip are metaphors for my life. I do have a Gift, which at the time I had thrown away so I could get high every day. Most of my ideas about Life came from the first half of the twentieth century at the time, but I rejected all that knowledge (symbolized by Sigmund Freud) and fixated on the Learian/Jungian dream dragon of metaprogramming. In my mind, this idea should have been typified by the Dyonysian crucified hero, Jimi Hendrix. </p><p>Actually, the dark reverse side of my ideal was the single most effective metaprogrammer to date: Charles Manson. What he sent out on the sea of people was much worse than voodoo, and he is still high on himself in prison. The only bawling ape searching for meaning was myself as a child. The insane asylum meant that if I gave up my search for truth, I would forever be ignorant. Nobody can know my truth, and if I search for it outside of myself, I imprison myself.</p><p>The other lesson (which should be obvious) is this: use common sense.  Get a sitter, don't trip in a dormitory, don't drive in the river... you know, practical stuff. I ended up getting kicked out of the dorm the next morning, which really was the pits and the shits. The day after mushrooms should be beautiful. The reason I was ejected so quickly was something I've left out: I committed a faux pas so grievous that I couldn't look people in the eye for months. This trip, albeit frightening and chaotic, should have been a positive experience. It shone light on many hidden elements of my life at that time, and had the potential to turn my life around. As it was, I was so ashamed that I retreated into my bong and dropped out of school. I let doctors convince me I was insane. In general I learned to hate myself, and it's taken me years to process all this. So USE A SITTER!</p>"
}
