{
 "title": "Completely Unprepared",
 "author": "Hrethic",
 "citation": "   Hrethic. \"Completely Unprepared: experience with Salvia divinorum (ID 19190)\". Erowid.org. Nov 27, 2002. erowid.org/exp/19190",
 "substance": "Salvia divinorum",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19190",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 27, 2002",
   "Views: 8729",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nSalvia is unlike anything I've ever experienced, and I was completely unprepared for the world that it launched me into. After the first hit, which I admit was too large for my first time trying a new drug, there was a brief period that I don't remember, which was the head rush. The bits and pieces I remember from the head rush consisted of what could only be described as waves of something absurd/frightening/hilarious and I couldn't help but burst out laughing after the 3rd or 4th wave hit. After that passed, I felt as if I couldn't or didn't want to tell T. about what has happened, and was quite uncomfortable; I felt as if I would be betraying someone or something (the people looking after me while tripping) if I told. \r\nWhen I got up to put the bong down on the table I was VERY encumbered, like the gravity had suddenly increased 3 fold, but only on my head and arms. As I looked around the room it was bending around in a sort of oval shape fitting with the feel of the music (Download); yet I couldn't describe it as a visual hallucination. It felt as if I was on a train of energy or something was rushing past me (VERY loosed translated from what I actually felt). I also had the distinct feeling that the only thing that was real, or that existed was my immediate surroundings, and everything in the rooms adjacent to my living room well they didn't not exist, but they didn't exist either. This feeling persisted for what seemed like a very short time, in which I went into the kitchen to assure myself that there really was something there. This brought me partly back to the real world, when T. and I started talking about what had happened with his trip and mine. We had dinner but I didn't feel like eating right away. It was such an intense experience I was just completely unprepared for what it had in store.\n\n\n"
}
