{
 "title": "Just Like Escher'sAart",
 "author": "Moon",
 "citation": "Citation:   Moon. \"Just Like Escher'sAart: experience with Mushrooms (ID 19229)\". Erowid.org. Nov 27, 2002. erowid.org/exp/19229",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19229",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 27, 2002",
   "Views: 8753",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had taken mushrooms before. Twice before to be exact. The first time was unnerving to say the least, but I had fun trying to float down the stairs head first. The second time I had to stay more aware as I was with someone who had never taken them before. I felt composed as I watched him submerge into a paranoid more 'spicy' version of himself. Maybe the position of experience left me feeling ok.\r\nLast night was different. I have been going through an ongoing battle in my head recently, trying to determine who out of my surrounding peers were actually my friends. I suppose its my own fault, I'm not stupid, I know the effects of psychoactives - I live and breathe the realm of psychology on both a professional and personal level everyday. What I did last night was an immediate intrusion into the deepest depths of my mind. I've discovered this year that I'm perhaps a little too analytical, this character trait will therefore only be magnified if I start meddling with psychoactive drugs. I drew pictures, lots and lots of lines and circles in an interwoven pattern. I tried to to draw other things but got distracted whilst doing so, so my images became distorted by the endless squiggles and swirls. Maybe I actually wouldn't have noticed but I made the mistake of showing my companion my work. Comments were made, comments that would never have bothered me had I not been in such a vulnerable state of mind. Our drawings didn't match, my endless pattern seemed somehow to represent perfectly my analytical and deep nature, and all of those hang ups in my life that I had been desperately trying to address for so long. \r\nWhen I felt a little more like myself I decided to drive home. I could not settle, especially with the paranoia that my friend might think I was some kind of supressing dysfunctional.\r\nWhen I woke this morning I felt this enormous mountain of guilt and self-disgust, what I discovered about myself was not at all what I thought existed. I'm trying desperately to shake off the feeling that this is where I'm here to stay. I need to remember that before I took the mushrooms I was trying to make some pretty tough decisions and was succeeding. I need to learn from the art that I created. That although it scared me, the problems I was faced with I actually knew existed and if I'm strong enough I will take from this experience and learn to deal with those issue and move on. I'm not sure if I will indulge with mushrooms again, I don't think I need to. Its time to wake up, time to get off that lazy rollercoaster that I call my friend's sofa. Stand up for myself, learn to love and to not be so critical. At the end of the day I've learnt that I could (if I let myself) get stuck in an ongoing psychological cycle, one that really need not exist. All I need to do is to lighten up and live for myself, not by an interpretation of what I think others expect of me.\n\n\n"
}