{
 "title": "Insufficient Purity Causes Side-Effects",
 "author": "Butte Rolactone",
 "citation": "   Butte Rolactone. \"Insufficient Purity Causes Side-Effects: experience with GHB & GBL (ID 1924)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1924",
 "substance": "GHB & GBL",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1999",
   "1924",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 19, 2000",
   "Views: 17518",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started using GHB when it was still available from Europe. I then discovered the kits and the money that could be saved making my own -- although I never made my own powdered version. Then, when the kit suppliers all went under, I managed to buy the components separately.</p><p>I have had virtually all of the 'bad trip' experiences described by your other contributors -- and many others as well. This was particularly bad about two years ago with the kits I was getting from Bond-somebody or other out of Florida.</p><p>To sum it up: Everything described, as well as my own experiences, turned out to be from impurities in the Butyrolactone. I follow the writings of the folks at CERI and had their book on GHB. As an experiment, I decided to perform their 'post-purification' step -- even though I was assurred that what I was using was 99.9+ pure. This consists of shaking the finished product in a one liter bottle with a quarter cup of activated charcoal for an hour. I hated to do it, because you lose a considerable amount of the product that just won't come out of the charcoal.</p><p>It's worth it. From that moment forward, I've had none of the problems I encountered before. I was especially happy to be rid of what could often be a severe aching of the extremities and what I can only describe as 'Restless leg syndrome' -- an uncontrollable desire or feeling that, while trying to sleep, that you have to move your legs.</p><p>I also was experiencing what I described at the time as mini-epileptic seizures, visual hallucinations -- and the fascinating feeling that I had just been talking to someone. The latter so real that on more than one occasion I went from room to room looking for them -- even though I knew that it was a hallucination. Fortunately, I've had enough experiences of that kind not to be frightened -- I was just fascinated.</p><p>My strong recommendation is that anyone using GHB or its relatives just assume that it is impure and take the appropriate precautions.</p><p>I have also taken quite a bit of just plain Gamma-butyrolactone. Works well, lasts longer, doesn't involve weighing and mixing, and an eyedropper full is a full dose -- not to mention eliminating the risk of carrying around a scheduled drug. The problem is that, as the body converts it to GHB, it can mess up your systems ph. As a result, I was having to consume a lot of baking soda. Otherwise, you feel slightly ill about 30 minutes after taking it. Pretty soon I started swelling up from all the salt. Still works in a pinch.</p><p>What I would like to know is how to purify 1,4-butanediol and what the actual impurities are. </p>"
}
