{
 "title": "Can Induce Vomiting, Avoid Salty Crackers",
 "author": "J. Doe",
 "citation": "   J. Doe. \"Can Induce Vomiting, Avoid Salty Crackers: experience with GHB (ID 1925)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1925",
 "substance": "GHB",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "8.8 g",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 1925",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 48823",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>i relay the story to you, my friends, to help sway you from the dark path that drugs comprise. drugs are evil; they will never teach you anything. they will kill your brain cells and reside in your brain. theyll make you unemployed, poor and unhappy. so sayeth newt. amen.</p><p>begin story :</p><p>a friend introduced me to ghb in the form of two salts, combined in 100ml distilled h2o. resulting suspension (solution? im no chemist) made 5ml=1g ghb. so, being the intelligent fellow that I am, i decided that 1Tbsp = 5ml (Erowid Note: as mentioned later in this report, 5 ml = 1 tsp, not Tbsp). I took 1Tbsp right out. waited about 10min and noticed interesting effects.</p><p>i was using the Erowid Ghb dosage page for dosing information and decided that, since i weigh ~140kg (yep, im an ogre), that perhaps the 'larger person' dose applied to me. I decided that 3g would probably be an appropriate dose and, hey, i can 'hold my liquor,' as it were, with drugs.</p><p>I promptly took 2 more tablespoons.</p><p>effects started coming on and I watched some sally field/keifer sutherland moving on tv. i noticed some stomach upset, and went to go get some food, knowing i hadnt eaten in about 8 hours.</p><p>i started eating but couldnt bring myself to eat much, and decided i wasnt really hungry. i had been confined to the couch for the last 30min by choice, mostly, because i wasnt sure of the motor skills i would have, as effects were strong. i got up, and it was not walking, really, but more a semi-controlled pointing method, where i would point my body, and my legs would push me around. it was very awkward.</p><p>for some reason intense sexual urges welled up. im not sure... it was rather interesting, actually, how it sort of welled up in me, and came on rather suddenly (please excuse any puns i make make). sex was verrrrrrry interesting. 'stamina' was not increased, per se, but feelings were incredible. it was if i could just stop escalating, and maintain a sexual tension level until i was comfortable proceeding, while still being stimulating.</p><p>definitely worth a few more 'experiments.'</p><p>then the vomit happened. i had sort of spat up as an infant would, my crackers from earlier, before sex. but this was real vomiting. this was unpleasant. all the food in my stomach went into a cup that i was holding to my mouth as i retched uncontrollably for what seemed like 10 or 15 minutes and was really, only in fact about 3. the vomiting ceased, but the food was gone, and the heaves began again.</p><p>im not normally a 'vomiter,' and only dxm has made me vomit in recent history (recent being the last decade). after the vomiting ceased again, i began to calm myself down. i think the vomiting was caused by the fact i was thinking about it. i wasnt nauseated when i was watching tv because i wasnt concentrating on my stomach. i turned some music on, and liked it. i turned it up, and the sick smell of bile/digestive stuff/vomit wafted out the window, which was wide open.</p><p>i curled up on the bed and listened to the music. i found a shirt that smelled like my mate, and held it up close to my face so that i could smell her, and further relax with the music. i very quickly fell asleep. i dont know if it was that 'unrousable' sleep common of ghb use, but i doubt it. i dont remember dreaming, but i woke up fine about 5hrs later when the phone rang.</p><p>now, for those of you who are about to reply and chastise my kitchen chemistry, yes, i realize the mistake. according to my calculator, 1 Tbsp = 14.787ml. so, providing i took 3T, thats 3x14.787ml, or 44.360ml. Now, divide this by 5, thats 8.872g. So, 140kg/8.872g = 63mg/kg.</p><p>according to the above mentioned page (at erowid), and providing your average human weighs 160lb (73kg), 63mg/kg would equal 4.599g, or 'can induce heavy sleep.'</p><p>I would say that that is not true. I only fell asleep after I was done vomiting. :) so maybe the page should be changed to 'Can induce heavy vomiting, increased sexual stimulation, and possibly sleep. Avoid salty crackers.' :)</p><p>The overall 'trip' lasted about 1.5-2hrs.</p>"
}
