{
 "title": "Brief Reflections on a First Time",
 "author": "Mike H",
 "citation": "Citation:   Mike H. \"Brief Reflections on a First Time: experience with MDMA (ID 19255)\". Erowid.org. Nov 28, 2002. erowid.org/exp/19255",
 "substance": "MDMA",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19255",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2002",
   "Views: 7353",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe setting was a Burning Man reunion type party at a place in Dumbo, Brooklyn. I started the night with a raging headache, and decided soon that this was probably not the best time to try a drug for the first time. So I resign myself to a lame night.\r\nI got tired of the music pounding my head and asked my friend for his keys so I could go sleep in the car. But luckily the attendnet at the lot would not allow me to. So I walked back. My friend called me and sounded more blissed than I have ever heard him: 'Dude you have got to try this stuff!'. (At this point my headache had waned). So I went back to the party and tracked him down (it took a while). He had promised me two pills but had only one left 'You're only going to need one' he says, and he was right.\r\nI would say that there's something akin to alcohol in E.  But take away all the nasty nausea and foggy thinking, purify that feeling in a way you never thought possible and then extend it and deepen it.\r\nI have always liked to dance by myself, but the ideas and notions that night were the next level up. The creativity went on and on.\r\nI enjoyed telling people that this was my first time on E, and enjoyed hearing their perspective.\r\nI did not drink enough and lost my voice the next day.\r\nThe guy who provided the pills said this was the best batch he had ever had (and he was experienced).\r\nSometimes, alone, several days later, I find myself repeating those dance moves.\r\nIt is not a drug but an elixir.\n\n\n"
}