{
 "title": "Effects of Heavy GHB Use",
 "author": "Elfstone",
 "citation": "   Elfstone. \"Effects of Heavy GHB Use: experience with GHB (ID 1928)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1928",
 "substance": "GHB",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 1928",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 26456",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nObservations by a professional couple on daily use of ghb over an extended period of time:\r\nUtilizing a single subject reversal design (ABAB), intrasubject replication was observed for the occurrance of auditory hallucinations associated with heavy ghb use, followed by subsidance and eventual cessation of the auditory hallucinations after a short period of abstinence (3 - 4 day).\r\nFollowing 1.5 - 2.0 years of daily ghb usage, approximately 3.5 grams two times per night (4 hours apart), with an occasional 1 day binge, one of us experienced auditory hallucinations. These were not psychotic hallucinations, but apparently the result of activity in the temporal auditory cortex, which was experienced as replaying of auditory memories of childhood songs and music. Any type of white noise would serve to elicit these hallucinations, which after several days became quite distressing. After 3 - 4 days of complete abstinence from ghb, the auditory hallucinations subsided and then ceased. It was noted that if ghb was suddenly stopped, mild physical withdrawal symptoms of muscle itching, sleeplessness, and craving for the substance were experienced. Tapering the ghb off over the course of several days greatly diminished the withdrawal symptoms. Psychological dependence was also noted.\r\nReinitiating ghb after one month of abstinence did not elicit the auditory hallucinations; however, binge usage again elicited the phenomenon, and abstinence again resulted in the subsiding and cessation of the symptoms. Thus, we reliably established that duration and frequency of ghb use can elicit these unique auditory hallucinations in one subject, and that removal of the substance quickly resolves these symptoms.\r\nOther side effects we noted include the following:\r\nGHB induces a hangover. One feels somewhat emotionally vulnerable, insecure, lethargic, and shaky. These symptoms subside as one moves through the day.\rWith increasing usage, a tolerance also develops, and one needs more of the material to induce the desired effects. In addition, the effects last a shorter period of time, and three doses may be necessary to sleep through the whole night.\rBe aware the ghb-trance [short-term coma] state leaves one completely vulnerable to accidents, such as the outbreak of a fire, or a breaking and entering by a thief. One will not respond to alarms.\rOne of us noticed that over several weeks, a general anxiety emerged that was clearly associated with the level of ghb use. Stopping ghb eliminated the anxiety.\r\n\n\nThe use of ghb can be very helpful during occasional periods, like when under stress and experiencing insomnia, or when winding down from intense entheogenic experiences. As with all things when used in excess, ghb does have its effects upon one's well-being; moderation is generally best.\n\n\n"
}
