{
 "title": "1,4-Butanediol Toxicity?",
 "author": "Andro",
 "citation": "   Andro. \"1,4-Butanediol Toxicity?: experience with 1,4-Butanediol (ID 1929)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1929",
 "substance": "1,4-Butanediol",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "1,4-Butanediol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 1929",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 19548",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBegan experimeting with daily dosing(~2.0-5.0g/day) of 1,4-Butanediol (99.9%). After nearly three weeks, I began to experience symptoms of possible 1,4-B toxicity. Upper respiratory congestion/irritation, ocular irration, and pain in upper right quadrant of abdomen. Possible systemic and organ specific toxicity? Getting LFT'S and general blood drawn. I'll report my results and experiences.<br>As promised, here are the results of my lab report. I have an isolated, elevated, bilirubin level. Actually quite high, 2.9(!). This could be and probably is indicative of some liver disfunction. Jaundice is usually apparent at 2.0 with yellowing of the conjunctiva (which I do have). All other LFT's appear normal. However, GGT was not evaluated.(This enzyme is very important as it is one of the only 'liver specific' ones). Getting more tests. Bilirubin (direct,indirect), Iron and GGT. I must admit, I've experienced some hepatic dysfunction in the past. Although my doctor believed it to be transite and not significant. I was a very heavy anabolic/androgenic steriod(AAS)user for more than eight years. I had very heavy use of oral(C-17) AAS, which can be significantly hepatotoxic. Unfortunately, I was also a binge drinker. Heavily abusing alcohol every weekend for over a year and a half. This undoubtly put undue stress on my liver perhaps causing some (subclinical) damage.<br>I believe it is entirely possible that I am very sensitive to many compounds with even mild hepatotoxic potential compared to the average person. So, my experiences with 1,4-B may not be applicable to those with out any prexisting conditions. I will report upon my condition and it's possible/causual link to 1,4-B ingestion in the near future.\n\n\n"
}
