{
 "title": "HBW Revisited with Amazing Results",
 "author": "Anonymous",
 "citation": "   Anonymous. \"HBW Revisited with Amazing Results: experience with H.B. Woodrose Seeds (ID 1933)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1933",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "10 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1933",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 72465",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSome of you may remember that I posted a description of a rather ho-hum Hawaiian Baby Woodrose Seed (HBWS) trip a couple of weeks ago. Last night, a friend and I decided to make another attempt, with an increased dose, though aware of the warning that\r</p><p>'high dosages are not advisable -- beyond a certain level, experience so far has shown a tendency for limbs to get bluish'</p><p>-- Psychedelics Encyclopedia</p><p></p><p>I soaked twenty seeds in hot tap water for two to three hours, then (despairing of ever finding a mortar & pestle) smashed the seeds to a pulp with needle- nose pliers and added more water to the seeds & water in a tupperware container. I then vigorously shook the container. The water (strangely, since the seeds are brown & white) turned pond-scum green, with lots of seed chunks settling to the bottom.</p><p>I poured this mixture into two glasses, being careful to add the same proportion of pond-scum-water:seed-chunks to both glasses. My friend downed the mixture in one big gulp, getting some more water to wash some of the seed chunks from the side of the glass. I took it much more slowly, and returned for water a couple more times so I could get the seed chunks down.</p><p>My friend and I are both tall, thin men in our twenties. I'm about 6'2', he's perhaps an inch or two taller. I weigh about 170 lbs, he is probably in that area -- maybe 10-20 pounds more. I say this for dosage reasons. We're tall fellows -- if you're 5'6' and weigh 130, you probably won't need as many seeds. (Note of warning: If you're pregnant, or think you might be, don't use HBWS or other ergot-type hallucinogens unless you know /exactly/ what you are doing. These drugs can cause uterine contractions and may cause miscarriage)</p><p>To cut to the chase -- the trip was a '10' for both of us. We've both experienced many LSD trips, and between the two of us have sampled the delights of MDMA and psilocin/cybin. The HBWS trip ranked up there with the best.</p><p>It started soon but with a long slope. As an illustration, an LSD trip might be described like:\r</p><p>                ^_</p><p>               /  --___</p><p>              /        ----_____</p><p>             /                  ------_______</p><p>            /                                --------_________</p><p>- t ------------|-------------------------------------------------------</p><p>             30 min.\r</p><p>with a quick peak that's very intense, and then several hours of slowly returning to consensus reality. The HBWS trip was more like:\r</p><p>                              __-____</p><p>                       ____---       -----______</p><p>            ______-----                         -------________</p><p>- t ----------------------------|---------------------------------------</p><p>                             3 hours\r</p><p>Also, the peak was much less intense. Overall, much much less visual and audio and other sensory hallucinations than with LSD. Visuals were mostly forced for diagnostic reasons, audio was great, but not LSD-profound.</p><p>But the mind-food -- the intellectual games -- were amazingly good. And the real bonus is that conversation is very easy (on LSD, I often find that I get lost in that enormous jungle of symbols between the beginning of a sentence and it's terminating punctuation mark, making linguistic communication with other people a real chore at times). I could talk and form sentences and such with no more difficulty than usual (and in fact, I felt that my ability to do so was even heightened -- my friend commented at one point that 'I have an idea, and the words just /come/! It's incredible!'), but I had much more to talk about than usual.</p><p>Based on my previous experience, we expected a short trip with little mind- blowing. We took the brew at about 7:00PM and were up until 4:30AM talking almost non-stop metaphysics with two other people who were completely sober. I'm still feeling the effects now, at about 11:00AM. At 4:30 I settled down to sleep and was pleasantly surprised to find that sleep came easily and that the sleep was deep and very satisfying. (On LSD, I find it very difficult to get to sleep until I have come way down from the trip).</p><p>If you enjoy LSD, I strongly urge you to give this stuff a try. '...of the jungle' sells HBWS at 11 seeds for $2.50, or 100 for $10.00. T.A.E. sells 'em at $25 per 1/2 oz., $40/oz., $110/4oz. and $450/lb. If the ones you get are crusty on the outside, like maybe the inside of a walnut shell, you should crack this pod open and just use the smooth seed inside. I suspect that the outer coating is what causes nausea in some people.</p>"
}
