{
 "title": "Why? What For?",
 "author": "M.Y.",
 "citation": "Citation:   M.Y.. \"Why? What For?: experience with Cannabis (ID 19341)\". Erowid.org. Dec 2, 2002. erowid.org/exp/19341",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 19341",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 2, 2002",
   "Views: 11368",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nSunday afternoon. I met with my friends to play a soccer game. I took some water, so did they - plus some weed. In the half-time we filled one and smoked - it was my first time. Two wrong and two nice puffs. And we started the second half. We play, start laughing and all the good stuff. Then BANG (10 min. have passed).  Something I call RESET. BANG. I'm standing in the middle of the field someone passes a ball. I'm thinking to myself:\r\n - where am I?\r\n - hm, the sports field\r\n - what do I do here?\r\n - ...the ball - playing soccer.\r\n - who am I with!\r\n - oops, goals, which one is mine?\r\n - ok, ok, I got it\r\nI run 15 yards and ... BANG! I pass the ball\r\n - what did I do?\r\n - why? what for?\r\n - oh, soccer...\r\n5 minutes before the end-time I had to leave cause I had an appointment with a girl, we were to go for a movie. I was in a bus. Going. Then I'm thinking:\r\n - oh, I'm getting off on the next one...\r\nDANG!\r\n - where am I? holly shit, I was to get off... \r\nI got off on another one...\r\nWe met, but our conversation just didn't go well. I was thinking too much about each aspect of it and I was almost drowning in my thoughts. I was thinking about things she had said before and 10 other things while she was starting another subject... \r\nLucky me, answering good, actually having nice conversation. BANG! Where am I? Oh, theater, but what the heck are we talking about?? OK, I got it. It seemed to take some 2min to figure out what's happening, actually it took some 5 secs though. Came back to the very movie about 15 min after it began. Ahhh, was nice.\n\n\n"
}