{
 "title": "In Hell!",
 "author": "nos't",
 "citation": "   nos't. \"In Hell!: experience with Nitrous Oxide & Oxygen (ID 19349)\". Erowid.org. Sep 15, 2003. erowid.org/exp/19349",
 "substance": "Nitrous Oxide & Oxygen",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19349",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 15, 2003",
   "Views: 22831",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI would like to share my experience, the time I got my back teeth pulled at the dentist. Previous to this, I probably have inhaled nitrous about 15 times, mostly in whippet form. <br>I arrive at the dentist. It is pretty busy, after waiting about 25 minutes they put me in the dental surgery room. They put the mask on, which they call the 'snoopy nose', because the dentist's office is mainly for kids. <br>I inhale the sweet gas at a normal breathing rate. I sit patiently, nervous about having my teeth yanked out. I start to get staticy vision, and a buzzing sound vibrated in my head. Then, the wood grain wall started bending and swirling around in a spiral. I am enjoying this, my body is comfortably numb. I feel like me and the chair are starting to get sucked into the spiraling wood.<br>My consciousness started to become dissociated, I guess around 10 minutes. I wasn't thinking clearly, and I began to wonder where I was. I looked up at the ceiling. In the room there are shapes hanging from the ceiling, circles, squares and triangles. I looked at these and thought I was in math class for some reason. <br>Then came the dentist. He injected my gums with novocaine. I didn't really know what was going on. I started biting my lip. The assistant dentist said 'hey, quit putting holes in your lip.' I didn't know, but blood was running down my chin and they were putting cloth on it.<br>Then, I have an out of body hallucination. The dentist has a crazy smile, like on Batman the movie when people had those smiles like the joker. I was watching from about 5 feet away as the dentist started to spin my chair around really fast. The assistants also had the smile. <br>I screamed 'I'M IN HELL!' spitting out the gauze, blood spilling out of my mouth. The teeth were pulled, and I didn't realize it happened. An assistant ran over. 'Are you ok??' I heard them say 'We need to give him oxygen now'. <br>I slowly started to come out of the weird daze. They helped me to the waiting room and told me to wait at least a half hour before driving. I sat there, still buzzing. My mouth and lips were so sore, I was holding gauze to my face. It was also in my mouth. I was still bleeding, but they gave me plenty of cloth. I drove home after I felt sober, and got home and took some B vitamins.<br>This is a really unexpected result of nitrous, I think. I never had this kind of trip on whippets. This was a bad trip, but some of it was fun and interesting.\n\n\n"
}
