{
 "title": "Some Public Singing, May Feel Like Zombie",
 "author": "Rev. MeO",
 "citation": "   Rev. MeO. \"Some Public Singing, May Feel Like Zombie: experience with Gabapentin (Neurontin) (ID 19357)\". Erowid.org. Dec 2, 2002. erowid.org/exp/19357",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "800 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19357",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 2, 2002",
   "Views: 58861",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThe idea that Neurontin is second best to GHB may be a bit of a stretch, although that depends on which GHB effects one is focusing on.</p><p>A dose of 400mg. Neurontin went by with very little effect initially, although mild sedation and social enhancement was noted.  A dose of 800mg., however, takes the sociability effect to levels that I feel are superior to GHB! What worked the absolute best for me was the following: 800mg. 2-3 hours before bedtime; 400mg. upon waking; another 400mg. later in the day. It seems as though the effects are much more pronounced if you build up a little bit of the chemical in your system.  However, taking it daily does appear to reduce the pleasurable effects.leaving just the depression and anxiety deterrents.</p><p>From what I've found, the Mexican Neurontin (gabapentina) capsules are typically 400mg., whereas in the US, even doctor samples are large 800mg. tablets.  These are perfect :)</p><p>The effect of Neurontin, in my experience, is extremely delayed.  Expect at least 2 hours before the effects really manifest.  It has also been noted that a single 800mg. dose keeps the sociable effect all day long; the sedation, however, also continues.  Note: take this dose soon after waking in the morning, on a completely empty stomach, and try not to eat for a few hours after taking it.  Feel free to drink lots of water.you will be thirsty.</p><p>I'm amazed about the social enhancements most of all.  I've found myself singing joyfully (in front of people!!!) and could envision this drug as treatment for stage fright.</p><p>Unlike GHB, the sedation effect isn't as profound, but the social effects are even greater.</p><p>Anyhow, recreational value definitely exists.  Especially in that the drug's duration can be so extensive.  Pop it in the morning on an empty stomach and one could expect to be altered through much of the day.  Although it is not a perfect intoxication, there is a zombie feel to it, you feel free to express yourself.  The zombie feel is a crapshoot.  You may or may not get it.</p><p>Neurontin was marketed by Pfizer as a treatment for many different ailments (depression, pain, anxiety, etc...) even though it is only approved for seizure treatment, as far as I know.  This dealing got the big P into some trouble.  However, Neurontin DOES possess many of these abilities! The depression and anxiety relief are especially pronounced.</p>"
}
