{
 "title": "Happy and Harmonious",
 "author": "Eric",
 "citation": " Eric. \"Happy and Harmonious: experience with H.B. Woodrose Seeds (ID 1936)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1936",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "15 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "",
   "1936",
   "Male",
   "",
   "Not Given",
   "Jun 19, 2000",
   "41610",
   " "
  ]
 ],
 "report": "<p>Well, a few days ago I posted my experience with some Hawaiian Baby woodrose seeds, and I mentioned that I would be trying them again. well here are the latest results...</p><p>Joe and i had found that our previous dose, (20 seeds total) was rather week. We didn't know if this was just the nature of the seeds, or if a higher dose would be needed. This time we ground up about 30 seeds and soaked them in some water. Ugghg. This stuff has got to be the worst tasting liquid in the entire world. It was horrible. When we first did it, the taste wasn't that noticeable, and when we did notice it, we just found it 'wierd'. ugghg. I am planning on NEVER NEVER NEVER again ingesting the seeds in this method. Anyhow, after 2 hours, we strained off the liquid and drank. Once again, we felt kind of wierd after 20 mins or so. The two hours were hardly different that the time before, but in the 3rd hour, things got very very cool.</p><p>I would not call it a 'trip'. There were almost no visual effects at all. And the mental effects didnt' seem like acid or shrooms, but almost more like alcohol. We drove (big mistake) to mcdonalds after 2 hours, because we didnt' feel like much was happening. we got drive through and ate in the car. We suddenly started feeling very silly and VERY happy. I mean VERY happy. When we had done acid before we had also gotten very happy and this was the same kind of thing. It was also kind of like pot, except when your high with someone, you tend to ignore them, and they tend to ignore you, and you each bable on about nothing. with the seeds, we seemed very connected. We decided we should drive home before the effects got any worse (better?). While I was driving, my car felt VERY wierd. It seemed much too long and I kept thinking I was too far away from the petals. We managed to get back to joe's house ok, and we talked with his sister and his sister's friend for a while. his sister's friend happens to be a chemist and she gave me all sorts of tips on extracting DMT from various plants. But back to the seeds. We then sat outside on the porch just talking. Everything felt very good. Not good like feeling good, as in sex, but good as in happy and harmonious. Understand that it is very hard for me to express just exactly how I was feeling. I felt as if I really understood the world, and how everything fit togeater. I looked at this plant, and just for a second, I understood the plant. This may seem like a wierd statment, but thats the best way to describe it. I stared at this plant for a while, and then suddenly I stoped thinking about anything, and just looked and watched as a drop of water slowly gilded off one of it's leaves, and right then for only a second, EVERYTHING made sense. It was one of the neatest feelings i have ever had. These effects contiued and we jsut sat around talking. </p><p>The total experience lasted only 3 hours. The 2 hours before and after this we very mild, and not really part of the 'trip'. i HIGHLY recommend these seeds. But dont be expecting acid or shrooms. Its not like that at all, and you probalby wont have any hallucinations. </p><p>Does anyone know of, or can think of any way to do these seeds withough sticking them in your mouth in any way? or at least withougt having to taste them? We thought about smoking them, but were unsure if the compounds could stand up to the heat. any help would be appreciated.</p>"
}
