{
 "title": "Hinting at the Ineffable",
 "author": "Arjuna",
 "citation": "   arjuna. \"Hinting at the Ineffable: experience with LSD (ID 19394)\". Erowid.org. Sep 4, 2003. erowid.org/exp/19394",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 drops",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 19394",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 4, 2003",
   "Views: 10285",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've done a lot of drugs in my life, and i find that the most profound experiences and insights they've given me are the hardest to express.  I believe they're even ineffable in a direct sense, though one can hint at them and convey at least some of the intended meaning.  This is my attempt to share my most 'profound' drug experience for whatever benefit any readers can glean from it.<br>My best friend P. and I had been doing drugs together for a while, usually acid at varying doses.  We learned over past experiences not to enter the trip with a goal, e.g. 'visuals', 'enlightenment', or even 'fun'.  <br>We went to a friend's place to get acid.  Our friend, C., had a dropper full of lsd, and we each bought 10 hits from it. <br>At 7 pm C. measured out the drops into our palms and we licked it out.  The strange metallic taste lingered as it went down but was drowned out by the orange juice we drank to wash down centrum pills.  We said our goodbyes and walked out into the city.  We were both excited but didn't say anything for a while.  The noises of the city were brash but exciting as we sat on the stoop of the apartment building while P. smoked a cigarette.  We decided to walk to a coffee shop about half a mile away to chill out and watch all the people.  I lost myself in my thoughts along the way, and when my attention shifted outward, my inner dialogue stopped.  The lights, people, sounds, and 'vibes' seemed more real than they had ever before.  It was as if the same two dimensional cityscape I passed every day had suddenly gone to 3D as it ought to be.  A thought shot across my mind - its early, not even 15 minutes yet- <br>I looked at P. His face had become a complex interplay of pinks and whites, and an explosion of perceptions and associations of him flooded my mind.  He turned towards me with a depth of sincerity and happiness in his face that people on entheogens, and in zen consciousness tend to have.  I was startled that through his face, i simultaneously saw the universe and a total void.  We talked for the rest of the walk, though I forgot the gist of it.  As we reached the cafe, i pointed out that after only about half an hour I was already higher than at any time in my life, and that we'd be soaring to uncharted heights.  The most acid i'd done prior to that was 6 blotter hits and he'd done no more than 4 or 5 at once.  P. changed dramatically from innocently open and loving life to stricken with terror. He complained a bit, but I talked him down somewhat. I didn't realize I had a harmonious 'flow' of well-being up to that point until P. disrupted it on the surface level like rain on a pond.  <br>I missed the cool night air as soon as I set foot in the cafe.  I shot a look at P. And he seemed a bit tense.  Ordering drinks was fascinating, above all in that I was acutely aware of all the undercurrents of feeling in the cashier and other customers in line.  I desperately wished their silly masks of civility, false confidence, and comfort would be abolished.  I walked with P. to the couch, hyper-sensitive to every sensory stimulus as newly shaven skin during sex.  We sat and talked for a while about the things we percieved from the place and its patrons.  People sat around us, pretending we didn't exist, and the jukebox started playing shitty 90's alternative - it all hit me like lemon juice in a cut. Of one mind, P. and I got up, and left.  we talked about how we'd never learned our lesson that city tripping sucks, and went to a park.  <br>As we walked to the park, my consciousness 'split'; more strongly than ever before.  The 'more real' and 'aware' part was not confined to my body- it spread out, and in dimensions i wasn't aware of. Every detail of every thing held infinity, and vice versa.  There was at once a unity to all, and a dichotomy of spirit and substance, almost as 2 sides of a coin.  The less aware essence of me was talking with P.'s less aware side about people we know, and the way to get there.  P. was becoming fearful, and I was ecstatic - we both felt 'something big' on its way in the near future.<br>We reached the park and lay in the grass on a slope for who knows how long. The usual time distortion I get on trips was stronger than ever.  Deep relaxation spread through me in waves as I looked up at the sky through leafless tree branches.  Orgasmic isn't quite the word for that feeling.  Physically I melted away, and my 'less aware consciousness' melted away too.  after that I percieved what I've only percieved a handful of times in my life (with and without drugs).  <br>Classifications of this transcendant reality can only vaguely be compared to those of mundane life.  Good and evil were irrelevant, there was only a greater good.  Color, sound, etc. were irrelevant as well, just raw perception without limits.  The words 'purpose', 'significance', and 'will' hint at what pervaded everything.  Everything was as it should be.<br>(Describing it like that feels like I just drew a bunch of stick figures and told you that's what the sistine chapel looks like.)<br>As I 'descended'/'coalesced' i realized P. was having a bad trip. The look on his face was unforgettable - 'the pits of hell' - was what it said.  He asked me to take him home and i did.  We walked back in silence.  My 'thought stream' was a sea, too vast and varied to remember.  Deep concern 4 P. was side by side with elation, and a noticeable absence of words from my thoughts.  It was the familiar trippy feeling of an absence of mental static, and being cleansed of the mental impurities that had built up over the course of my life.  <br>We got to P's place and both reveled in the feelings of security and safety he was exuding.  We talked about plato, buddhism, and psychology.  Every insight felt fresh and pure, as if opening new doors.  I told P. about what I saw in the park, or at least tried to, and we calmly shot the shit until dawn, and then crashed. <br>Incidentally, i had the only 'visuals' i've ever had when I was in the park.  The trees danced and melted, and the sky knitted up over a shimmering whiteness as I was coming down.<br>I was reminded on this trip to: <br>beware crowds of sober people<br>beware sensory overload<br>beware the bad trip, especially when you drop 10 hits ;)<br>and i learned why Lao Tse said:<br>'those who speak don't know and those who know don't speak'\n\n\n"
}
