{
 "title": "First and Last Shroom Trip",
 "author": "Denise",
 "citation": "   Denise. \"First and Last Shroom Trip: experience with Mushrooms (ID 19398)\". Erowid.org. Dec 5, 2002. erowid.org/exp/19398",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5 caps",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19398",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2002",
   "Views: 13211",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I tripped on shrooms. It was November 9th and I was depressed as always. I was home alone which is really rare and decided to eat a bag of shrooms I got a week prior. I ate shrooms before, but I split it with 2 other people. The dosage was too small for any of us to feel the effects. Well anyway. Back to the 9th. I was really depressed and I ate the entire bag of shrooms. It was a nice sized dose. I had no idea what the fuck was going to happen to me. I thought that the effects weren't gunna be too bad because I took them before and I didn't feel shit. I guess that since I took a lot more, I tripped hardcore. I ate the fuckin' evil shrooms. \r\nAbout 20 minutes later. I start feeling the buildup. I was looking at my arms and saw them covered in bright tattoos. The fucked up thing was that I was supposed to go pick up my little sister from her friends house. I was totally screwed. I was tripping hardcore and I had no idea how my sister was gunna get home. It was like 10:30pm and I didn't want her walking. That was the start of my fucking Alice In Wonderland Adventure. I called my 'friend' at the time, John, who is like a fuckin' drug master. I didn't know who else to call at the time because I remember telling him that I was going to do them. He was like call me if you're really bugging out. Well I was fucking BUGGIN' OUT. I remember looking at the television and seeing all of the faces covered in tattoos and the colors. omg. The colors where  amazing. I saw colors that I have never seen before. I remember I kept telling him. I hafta go pick up my little sister what do I do?! He's like don't get in the car Denise. I'm like no fucking shit!! \r\nI was seeing colors mostly. Open and closed eye visuals. I was so scared because I never did any hallucinogens before and I had no idea of the effects. I'm tripping. And the 1st rule of shrooms is that you are not supposed to trip alone. Go me. Anyway, I call my sister at her friends house and ask her friends' mom if she can drive my sister home. Thank fuckin' god she did. Well that was the 1st mission accomplished. \r\nWell the next  thing. My parents come home. I'm tripping. Hard. And my parents are talking to me. Yelling at me for not picking up my little sister. I'm trying to play off sober but I'm like bugging out. I didn't look at their faces because I knew that I would have freaked me the fuck out. I go upstairs to my room and I call my best friend, Laura. I'm like. Laura, I ate a bag of shrooms and I'm  bugging out. COME OVER! So she comes over like 20 minutes later. I try to clean up my room a little before she gets here. My mom comes in and is like what are you doing? I was on my hands and knees picking up little pieces of papers off the floor. I tell her that I invited Laura to come over because I need to talk to her about some shit. She's like alright. What  stunned me was that my parents had no idea that I was tripping. Good thing!\r\nLaura gets here. Shes like what the fuck did you do Denise. I'm like I don't know but I want it to GO AWAY. So she comes upstairs and we don't know what to do. I start to get the chills so I go under my blanket. We call John because I was so scared. John was like. Do you want me to come over? I really didn't want him to come over because we got in a fight because he is a fucking drug addict and fucked me over so many times. Well anyway, I was like FUCK IT! come over. So he comes over. It takes like 30 minutes for him to get his ass around the corner to my house. I remember waiting in the bathroom while Laura was waiting for John to come to my front door. I didn't want to hafta face my parents again tripping. I'm in the bathroom. Looking at my arms. Trying to appreciate the visuals. My arms and fingers looked like bones and were green and yellow or some shit. I washed my face like 4 times while I was in there. I remember getting out and looking at the wallpaper in my hallway for like 10 minutes. It was like 3-D and colorful as fuck. \r\nJohn gets here and he is high off of some kind of pills. Percocets or some shit. We are all chilling in my room. I was tripping and seeing amazing visuals. I remember closing my eyes and seeing myself on clouds and whenever John would talk or something they would shatter and I would see empty darkness. I made the connection that he would make my trip a bad one. I remember John telling Laura that this is going to last for like 12 hours. I didn't even care. I knew that it would only last for like 4-5 hours. Acid lasts long. Not shrooms. I didn't want him in my room because he wanted to smoke a cigg and people can't smoke in my house. So me, him and Laura go outside on my front steps. Now John starts bitching that he dropped some of his pills. I just wanted him to GO HOME. He was bugging me out and making my trip even worse than it already was. He went to go look for his pills while me and Laura were on my steps. I got the drug lecture *143 Laura*. NEVER AGAIN. So he comes back. And I'm like John GOOOO HOMEEEEEE. I fucking screamed it. . So eventually he goes home. Then me and Laura go back in my room. \r\nI'm still sooo  scared. I get under my blanket again and I'm like gimmie your hand! It was like I was sooo far away from her and I needed to make sure that she was there. We start talking about EVERYTHING. I realized how much of an asshole John was and always will be and how he used me and all that shit. He calls me and I just hang up on him. But of course the phone wasn't on right and he ended up hearing our whole convo. . Oh well. He was too stoned to remember it anyway. I remember holding Laura's hand and then yelling at her. Don't let go of my hand!! Please!! Don't let go of me!! She's like Denise I'm not!! It was the weirdest  shit EVER. It felt like her hand was slipping away and my arm was going right through my mattress or some shit. Well I'm still having visuals. But I mostly keep my eyes closed. Finally I start to come down from my trip. The visuals start to slow down and things are getting back to normal. I thought that it would never end. So I'm finally sober and I just bullshit with Laura for another hour or two. Finally she goes home at like 4:30am. What a  crazy night. A night that I will NEVER forget!!\n\n\n"
}
