{
 "title": "The Cotton Candy Kiss of Trancendental Bliss",
 "author": "brindley",
 "citation": "   brindley. \"The Cotton Candy Kiss of Trancendental Bliss: experience with Salvia divinorum (5x extract) (ID 19415)\". Erowid.org. Dec 5, 2002. erowid.org/exp/19415",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19415",
   "Male",
   " ",
   "Not Given",
   "Dec 5, 2002",
   "Views: 12633",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAfter reading several trip reports I was very eager to try Salvia.  I ordered 2 grams from an online retailer, received what looked like two grams of oregano, and waited for the perfect day to approach the experience. As far as past experience, I have journeyed several times with Mushrooms, Morning Glory, and LSD, as well as messing around with weed, e, and coke. </p><p>A lazy fall day finally presented itself and I decided to give Salvia a go. After setting up some votives, pillows, and psychedelic music, I loaded up my first bong full. With a great anticipation and a little hesitation, I torched it (made sure to use a butane lighter!) and took possibly the biggest and longest bong rip of my young sweet life. As I sat there holding in the smoke as long as I could, I began to feel a kind of slight disorientation and perspective shift. Sort of like being hit it the head really hard or something. As I let the smoke out, I knew the sails of my ship were at full mast and ready to go; I was only getting started. So I quickly loaded up the bong again (with minor difficulty) and took another huge hit. Whoa. </p><p>Two thousand years later I laid back in my bed and began to re-gain conscious thought in a gradual Manheim Steamroller of consciousness and realizations.  </p><p>My heartbeat begins to pull me in a subtle elastic circular motion. I'm still as a stone, but I feel like I'm rocking back and forth like a buoy; like my heart is beating on a Mobius Strip, an ethereal track, that horizontally permeates my body. This isn't limited to my body, though. My heart is beating in time with a rhythm that resonates in all existence. I'm linked to every other piece of matter in the universe from proton to planet system on a fundamental baseline metronome rhythm that stretches infinitely into the past and future.  </p><p>Slowly I began to recognize the presence of a motherly figure around me. She enveloped me like I was floating in a rain cloud or in the middle of a marshmallow. She was holding me like a mother holds a newborn. I felt such a great love and comfort. This trip was my introduction to her; and she was glad to welcome me into her fray. To show me ancient wisdoms and reorganize my perception patterns.  It wasn't like she was talking to me directly, but persuading feelings in me, which focused themselves into more manifest notions and thoughts. I felt her voice. It was loving and nurturing and had a mother-earth-like quality. Sometimes she would tell me something so incredibly far out, I would think it absurd. Every time I doubted her, though, I felt her say something like, 'Hey, which one of us is thousands of years old and watched the birth of man and the rise of Rome? I watched your birth and I'll watch you die. Just listen.' She had a point. Who was I to argue? (Yes I know mankind is a lot older than thousands of years, but the notion of her age manifested itself in the impressional thought of 'thousands times thousands' or 'thousands to the exponent of thousands' rather than billions or trillions)</p><p>The whole trip probably only lasted about 10 or 15 minutes. Each of those minutes were a lifetime unto themselves. The thoughts and visions that Mother Salvia showed me in this trip were incredible and unutterable. Unfortunately for you the reader, they are mine and would be spoiled on your ears. I couldn't even begin to explain them. Furthermore, though, as highly personal, significant, and profound these thoughts were, they have changed my life thoroughly. I have been able to fully integrate this experience into my daily life, which is absolutely incredible (especially for a first experience).  </p><p>I have approached Mother Salvia several times since this trip. Every time has been incredible. I have gained several more amazing insights and realizations. In comparison to LSD and Shrooms, Salvia is definitely more on level with Shrooms (and maybe Morning Glory seeds too). The similarity is that earthly, connected, chloroform life-force feeling. I think Shrooms, Salvia, and other natural psychedelics allow us to feel the spiritual life-force of all plants and nature. The feeling of spiritual connection is amazingly warm and wonderful with both Mushrooms and Salvia. The experience is nonetheless completely different, though. I have never gotten self or ego analytical with Salvia. Also, I've never had significant visual distortions with Salvia. I have noticed slight stuff, but either it was just really light, or I was just too engaged in other thoughts to really care. </p><p>As far as perceptually, although Shroom trips obviously last much longer, I have never had a complete loss of time consciousness on Shrooms like I have on Salvia. The Salvia trip wasn't long, but deep. It's like a second would pass and I would suddenly realize that that one second had lasted forever. I wasn't per se aware of this during that moment, but just had no thought or care of the past and no anticipation for the future. With no future or past, there is no movement in time. Only now. This. 'Now' was the only thing that existed to me and was therefore infinite. I guess Blake was onto something, 'When the doors of perception are cleansed, everything will appear as it truly is, infinite.'  The feeling you get from this (realizing that you have just been in the same spot for infinity; lived lifetimes in a moment) is impossible to put into words. Unbelievably incredible somewhat describes it. </p><p>Salvia is an amazing thing. Treat her with respect, though, and approach her to learn, not to mess around. Like most psychedelics, this is not a 'fun drug' to use for visuals or a simple high. This is an agent of discovery and realization. Learn about yourself, learn about the universe, discover reality, redefine everything you have a definition for, live an infinity. Listen to her silent voice and let her guide you to a brave new world.</p>"
}
