{
 "title": "An Equation for Bliss",
 "author": "Andrew Ekai.",
 "citation": "   Andrew Ekai.. \"An Equation for Bliss: experience with Codeine & Cannabis (ID 19429)\". Erowid.org. May 23, 2007. erowid.org/exp/19429",
 "substance": "Codeine & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "Codeine",
   "(pill / tablet)",
   "  T+ 1:00",
   "1 tablet",
   "oral",
   "Codeine",
   "(pill / tablet)",
   "  T+ 1:00",
   "6 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19429",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 23, 2007",
   "Views: 21027",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo here's last night in a nut-shell:\r\n10:00-ingested codeine (two tylenol 3s)\r\n11:00-another codeine and started smoking weed (about 6 hoots from a pipe).\r\nPhysical: The two mix very well, but make sure the codeine is taken with food and milk to avoid the stomach ache.  The codeine induces a drunk/stoned feeling.  After I smoked I was extremely relaxed.  I could distinguish to a degree between the effects, but for the most part the feeling was unique.  Physical effects after smoking were fast and intense.  By intense I do not mean there was any rush, but it was a body stone unlike any I've felt before.  Unless I conscioulsy did things at a normal pace, I was naturally moving very slowly.\r\nMind: Thoughts drifted.  Nothing seemed more important than anything else. It seemed easy to totally clear my mind and just sit.  I decided to read.  Reading and comprehension were no problem despite the permeating body stone I felt.  After reading I meditated, contemplating the true self and how it goes in and out towards infintity in all directions.  Everything we do with ourselves will reverberate throughout the infinite emptiness from which all things emerge.  The drug combination didn't induce any spiritual feelings but the meditation did.  After this I put on music and laid down to go to sleep which was very peacefull and enjoyable.  Falling asleep was no problem.\r\nNext day: Today I definitely felt the 'hangover'.  It's a lot like the weed hangover in which your head feels like its filled with foam, but it was through my whole body.  It fades very slowly and I am stil feeling it quite noticably (6:00 pm).  The high was very introverted and after I smoked the weed it stayed even for as long as I was awake.  No drop off whatsoever until I fell asleep.  This is not the thing to do if you have work to do, people to deal with, responsibilities other than yourself to deal with or, as always, a vehicle to opperate.  Definitely worth trying though, if you ever get the chance and have the curiosity.  Very powerful for body and mind, and suprisingly unique.  Will I do this again?  Odds are, yes I will.  Will I try with a higher dose?  I don't think it would be necessary, but knowing me, I will.\n\n\n"
}
