{
 "title": "Anxiety and Heart Palpitations",
 "author": "Arahant",
 "citation": "Citation:   Arahant. \"Anxiety and Heart Palpitations: experience with Ephedrine, Tobacco & Caffeine (ID 19420)\". Erowid.org. Dec 5, 2002. erowid.org/exp/19420",
 "substance": "Ephedrine, Tobacco & Caffeine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "24 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   " ",
   "  ",
   " ",
   "Tobacco",
   " ",
   " ",
   "  ",
   " ",
   "Caffeine",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19420",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2002",
   "Views: 29635",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAlright, well I had been taking the ephedrine for a couple days now, I had purchased a couple bottles of 'Ephedra' and had been using it the last few nights. Now, each pill contains 1000mg of Ephedra, which equals out to 8mg of ephedrine.\r\nThe first night, I took 2 pills (16mg), and it made me feel nauseated for the first half hour, after that I felt very tired so I went to sleep, as there wasn't any greatly noticable effects.\r\nThe second night, I ingested 3 pills (24mg), and basicly the same happened as the first night, though I forced myself to stay awake. The nausea passed, and so did the tiredness. I started to have mood swings, and I felt very relaxed, at no time did I feel any more energy then I currently had, mostly the opposite, actualy.\r\nThird night, I go over to a friends and we both ingest 3 pills (24mg), we start searching around his room, untill we came across 2-3 roaches, which we emptied into a pipe and smoked, it was only a minimal amount and I don't think it made a difference. My friend started getting a bladder movement, followed by bladder pain, and said he urinated some blood, which made me edgy though I wasn't feel to bad at all, quite relaxed.\r\nWe went for a walk and had a smoke, walked around looking for someone to sell us some product. It turns out you 'dont' want to mixed nicotine with ephedrine :| I started feeling sick, and started having anxiety attacks, followed by heart palpulations.\r\nat first I thought I was going to have a heart attack, everytime the anxiety hit I felt as though my heart had stopped, I kept getting a weird body buzz at random locations in my body, which I thought to me lack of blood. The anxiety and heart palpulations lasted 8 hours total, I took some pepto bismal to prevent any nausea and I luckily fell asleep. When I woke up I was feeling better, with just cramps.\r\nIn conclusion, From what I've read Ephedrine can be a very risky drug, combinations with other substances of any kind can most likely have negative effects. I'd never do it again, and because of this experience I am contemplating whether or not taking chems again.\n\n\n"
}