{
 "title": "Powerful Mood Enhancer",
 "author": "BB",
 "citation": "   BB. \"Powerful Mood Enhancer: experience with Sceletium tortuosum (ID 19423)\". Erowid.org. Dec 5, 2002. erowid.org/exp/19423",
 "substance": "Sceletium tortuosum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Sceletium tortuosum",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19423",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2002",
   "Views: 70961",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI would like to relate an account of my use of Sceletium tortuosum, a groundcover plant in the Mesembyanthemum family.  I acquired five grams of this remarkable herb from an online vender, packaged as a dry powdered material.  It was November when it arrived, and as can be common in the winter, my mood had been generally low: not morbidly so, but not particularly high either.  Having read about some of the possible serotonin re-uptake inhibiting qualities of the plant, I decided to try it out.  Besides, alkaloids are fascinating and fun compounds, and Sceletium is known to contain several.  (Check them out; mesembrine carries the phenethylamine skeleton, 3,4-dimethoxylated, too!  Its highly substituted about the alkyl chain, though.)</p><p>I first tasted 200 mg of the dry herb before class one day.  The flavor was palatable, but Ive come to enjoy the taste of foul botanical concoctions (I find that bitterness is a sign of activity!!).  It is most similar in flavor to yarrow root, which causes a mild tingling in the mouth.  </p><p>Although with my first experience it would be difficult to distinguish between placebo effect and that of the drug (being unfamiliar with its duration, and sensations), I can say with much certainty that I felt particularly at ease throughout the day and extraordinarily garrulous.  I would estimate that the effects became apparent after about only 20 minutes.  Oh yeah, and to consumes it, I just swallowed the powder with water.  </p><p>Upon further experimentation, with doses up to 500 mg, the specific bodily effects became more evident.  My body felt light, like I really enjoyed walking, or sitting, or lying down, for that matter.  My head felt very warm and slightly removed, but in no way dissociated.  Perhaps this effect is comparable to the stoning accompanied with a low dose of codeine, or like slipping peacefully into dreams at night.  Another pronounced and interesting effect may be described as similar to a very low dose of MDMA.  I felt grateful for the chemical for pulling me out of the tedium and allowing me to just be content.  However, Sceletium lacks the effusive outpour of emotion like on MDMA, and allows daily life to continue as normal.  I havent noticed any hangover effects or other side effects.  </p><p>I would like to see this plants alkaloids be examined in more detail, both chemically and pharmacologically, as I believe they show promise as treatments for depression, or as a general mild intoxicant.  In fact, as a student of chemistry, I hope to find the resources to investigate some of the properties of these alkaloids myself.  I would be excited to find that any close derivatives have been synthesized and evaluated for activity, as then, perhaps, a structure-function pattern may begin to develop.</p><p>Peace from Berkeley</p><p>BB</p>"
}
