{
 "title": "Comfortable, Motivated Poetically",
 "author": "Austaph",
 "citation": "   Austaph. \"Comfortable, Motivated Poetically: experience with Wormwood (ID 19441)\". Erowid.org. Sep 26, 2005. erowid.org/exp/19441",
 "substance": "Wormwood",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Wormwood",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19441",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 26, 2005",
   "Views: 12030",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI purchased an ounce of dried wormwood from a local metaphysical shop mainly for it's ritualistic purposes but also because of some brewing curiousity I've had over Absinthe. I knew it wouldn't produce effects like Absinthe but I know wormwood has effects all it's own. I let it steep in warm water for about 10-15 minutes and then began taking swigs periodically. Viciously unrelentless flavor. Was like cough-syrup from hell... with the burn of a liqueur... leaving my throat with a bitter, acidic burn. Felt like I had just vomited. <br>About t+5 minutes I began to feel an initial onset. Something deep inside me was simply brewing up. Something I couldn't pinpoint. <br>T+15 minutes the effects had bloomed. It was a very paradoxical intoxication. I was feeling things that could have been linguistically defined yet still bled outside the lines of the basic categorizations. I was intoxicated slightly... yet it was a very uncommon intoxicated. I had full motor coordination, was aware of all senses and my well-being, yet my mood wasn't altered... it mainly affected my thought-process and psyche. It posessed the most beautiful aspects of psychedelics yet not quite psychedelic. No visualizations or intense mind-manifestations, just pure insightful thought-process blooming before a deep-green sea of humility all throughout my body. I was incredibly creative and imaginative. Words just flowed out of me as if they were coming directly from my soul. It was fantastically Zen. All that was was right then. All was now. All that is was alive and able to communicate with me. I was slightly confused and sometimes overwhelmed by simple things. I was on the phone with a friend who was speaking to me... but at the same time I was reading something. I heard him speaking to me what I was reading. It was strange. I had to ask him to repeat himself because of this. I felt as though I was peering through a window into the external world. Through some divine filter. <br>Everything made sense and I was feeling especially poetic. All-in-all it was subtle yet overwhelmingly comfortable. I found if I focused my mind just right the effects would flow through me like a cannon of prana. I give the experience much praise but I hold it in the category of any herbal tea. This is not one to get 'messed up' with... it's more for relaxing and doing a little writing, maybe some introspective thinking. Finished the tea ~2 hours ago and the main effects are gone but there is still this warm feeling in my gut that persists. The creativity and flowing lucidity of visions and insights is definitely still abroad. Still feeling motivated poetically yet feeling slightly dulled in certain areas of my brain... a little slow and dragged down but could be the effects of drowsiness. Definitely will repeat experience with much respect and caution. It most-certainly has the capability to do much good or damage. The key is to start small and truly focus on what is happening within and without.\n\n\n"
}
