{
 "title": "A Perfect Beginning",
 "author": "ae",
 "citation": "   ae. \"A Perfect Beginning: experience with Mushrooms (ID 19457)\". Erowid.org. Sep 25, 2005. erowid.org/exp/19457",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19457",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2005",
   "Views: 4001",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first full on experience with mushrooms, I'd tried them before but to no luck.</p><p>Ive hit a brief dark patch in my life and the day in question I was feeling particularly depressed about the way things were, and despite things I heard about needing to be happy about yourself before going on a trip I felt I needed some way of escaping, and understanding what I was going through. I took 1g of dried mushrooms at around 15:30, washed down with some orange juice, followed by another gram about 20 minutes later. I put Aphex Twins selected ambient works vol 2 and laid on my bed and waited for things to get going. Despite my empty stomach it took longer than id expected for any effects to be noticed, and due to my previous mushroom encounter (where I took 3g dried and nothing happened) I got up to have my 3rd gram and eat a bit of chocolate. About 15 minutes after this, subtle signs that it was under way became apparent. The ceiling (with its cheap spiky/jagged plaster) started slowly swirling, and I thought this would be a good time to switch the lights off. It was fairly dark outside since its winter, and I have thick curtains so the only light was coming from my CD player display. It created the perfect amount of light, and soon I was seeing purples and greens and the ceiling and walls were swirling more. I was feeling pretty cold so I got under the covers, and started seeing cogs turning in time to the music on the ceiling, and patters resembling the textures on 1 and 2 penny pieces.</p><p>After a while my perception of time was deteriorating, and it occasionally felt like my body didnt exist, and I was just a head balancing on my pillow. I found a track on the CD which seemed to suit things perfectly: CD1 track 9. The tribal qualities of the song soon had an influence on me, and my room slowly changed into a jungle. The terrain of my bed cover became foliage covered mountains, and the cogs took on a more organic feel. </p><p>I live in a university apartment, and my room has a small en-suit bathroom, which has just enough room to turn around in, but thats about it. I was fortunate to have my own bathroom, because I wanted this experience to not be interfered by having to deal with other people, and I found myself needing to piss quite often (about 6 or 7 times in the next 2 hours). When I went in to piss for the first time, the light was a big contrast, and the drone of the extractor fan made it seem like I was in some kind of space ship cubicle. The white tiles on the walls glowed in intensity, and changed to shades of peach and orange, through to blues, greens and purples. This is when I really felt I was coming on to near the peak, and it was confirmed when I looked in the mirror and only saw about 1mm of iris around the edge of my pupils.</p><p>I stepped outside, and was thrust into another world. Due to coming from the bright light of the bathroom into the darkness of my room, I could see nothing, and I felt fully immersed in the music, and the leaves and vines that I started to see surround me, still in greens and purples. Once my eyes adjusted and this feeling faded, I went back into the bathroom, just to repeat the experience, hehe. I found myself having fits of laughter and being fascinated by my green hoodie. I came back out into my bedroom to be immersed in the darkness once more and it was just as good as the first time... after a little dancing around, I switched on my computer, which became the focal point for the majority of the trip. I put some Boards of Canada on which sounded amazing -and coupled with the media player visualisation -overwhelmed me. I connected with just one of their songs, and kept it on repeat for a while [Aquarius]. </p><p>By this time I thought I better deal with my personal issues, as that was one of the main reasons why I went on this trip in the first place. I created a text file on my desktop to record this, and named it instructions for the future as I didnt want to forget anything. I felt I finally understood what needed to be done, I felt I needed to stop isolating myself, and start sharing pieces of me that until now I kept for myself, and especially share more things with my girlfriend, as recently she seems to be the one doing all the talking. It also made me realise how lucky I was to be at university, and how I cant throw this away because I havent finished with it, I havent finished creating and experiencing. Id written about 2 paragraphs, and at this point, I broke down crying, out of relief, more than anything. I felt at peace with myself, and I felt everything could be ok. This crying soon turned into uncontrollable laughter, and I decided to make a second text file, called instructions for right now which is basically a play list of songs which just sounded and felt so amazing. I became interested in the desktop image I have, which is basically just an abstract blurred tropical ocean blue kind of thing I created a while ago. The layers were moving and glowing, and I saw some cute skeleton people looking at me, and then what seemed to be an Inca congregation of Lego men all in big lines facing a totem style statue. I felt so amazingly happy, happier than I think ive ever been... it felt truly amazing.</p><p>At times the music would envelope me, especially when I put on some Mr Bungle or Devin Townsend weirdness, and the whole room came alive. The plant I have on top of my speaker would wave to me, and my webcam would follow my every move, which made me laugh hysterically. </p><p>The frequent toilet visits broke things up nicely as the glowing walls never became boring. It was like being a little child, interacting with all these things and being amazed and enthralled. This trip had just the right balance of spirituality & learning, and visual distortions & euphoria to be the perfect start to what I hope will be a fulfilling relationship with mushrooms. There was also no nausea, and only a very slight stomach pain throughout the whole trip, which was very nice. Next time I plan on experiencing more than just a computer screen and a toilet, however :)</p><p>I will definitely use mushrooms again, both for learning more about myself on my own, and with close friends to use our stupid antics as a catalyst for various visions and experiences.</p>"
}
