{
 "title": "A Collection of Experiences",
 "author": "Various",
 "citation": "Citation:   Various. \"A Collection of Experiences: experience with H.B. Woodrose Seeds (ID 1946)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1946",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1946",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 25609",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI recently tried a new route of administration for Hawiian Baby Woodrose seeds. Why? Eating works fine, except for the unfortunate side effect that my stomach is so tight I don't want to eat, drink, or move.\r\nI tried the enema method recommended by a previous poster. It was dissappointing. I ground ten seeds and blended them for an hour in distilled water. Then I filtered the sludge out and used a home enema kit to put the brown juice up my ass. I left it there for about ten minutes. About half an hour later, I felt a little something like a trip, but it quickly went away.\r\nSo what is my new method? Chewing -- like tobacco. I chewed six seeds without spitting or swallowing for 15 minutes, then gagged and spit them out. I tripped about as hard as I would expect from eating four seeds, but with much diminished side effects. After the first hour I felt like drinking beer and dancing (the don't-move period lasts three hours if I swallow the seeds). \r\nMy next experiment is to treat them *exactly* like tobacco, using a spittoon. Maybe I can chew them that way for 30 minutes or more. They are fairly cheap, so doubling the quantity is not a problem.\r\n=========================================================================\r\nFrom: Pope Electric Yeti \r\nNewsgroups: alt.drugs \r\nSubject: Baby Hawaiian Woodrose \r\nDate: Jan 1994\r\nI had a really bad trip on these once, good at first, like being drunk with trippy visuals.Then everything started to spin and I got sick. I became really scared and convinced that I was going to die. I had to go to a friends house to chill out when it was all over. Never again...Spend your money on good blotter or 'shrooms, but you *really* might want to stay away from this one....\r\n=========================================================================\r\nFrom: Keith Lewis \r\nNewsgroups: alt.drugs \r\nSubject: Woodrose seeds from T.A.E. \r\nDate: May 1994\r\nTwo different shipments of HBWR seeds from the same source, two years apart.\r\n#1 (then): Seeds were light brown and had concave spots with a very hard shell. ~150 mg.\r\n#2 (now): Seeds are dark brown and *hairy*. They are almost double the size (~275 mg). Convex, with an equally hard shell.\r\nWhat's the deal? Were the old ones immature? What about potency? These new things scare me!\r\n=========================================================================\r\nFrom: William Eleazer \r\nNewsgroups: alt.drugs,alt.hemp \r\nSubject: Hawaiian Baby Woodrose \r\nDate: May 1994\r\nWell I sent off to T.A.E for some Baby Wood Rose Seeds and they convinced me to get the sample kit which consisted of maybe 200 hemp seeds (precooked), about 25 each of Wood Rose and Baby Wood Rose seeds. A friend and I rubbed the hairs off of 8 Baby Wood Rose seeds, ground them to a pulp in a mortar and pestle, split it in half, mixed it with a cup of coffee and drank the mix. We had to spoon out the grit ( the ground Baby Wood Rose Seeds) out because it all sunk to the bottom. When I did this it tasted exactly like what really good blotter tastes like, but the taste went away pretty quickly. There was no ensuing trip. Anyone have any comments?\r\n=========================================================================\r\nFrom: PGuest \r\nNewsgroups: alt.drugs.psychedelics \r\nSubject: Woodrose (What did they do wrong?) \r\nDate: Sep 1994\r\nA FOAF recently received their shipment of Baby Hawaian (sp?) Woodrose seeds. Reading that the normal dosage was 4 to 8 seeds, they took 6 seeds, singed off the white fuzz, ground them in a coffee bean grinder, placed the powder in empty capsules, and swallowed with water (on an empty stomach).\r\nThere was NO effect whatsoever. Did they do something wrong, or is the talk of woodrose overrated?\r\n=========================================================================\r\nFrom: Dominic Blais\r\nNewsgroups: alt.drugs \r\nSubject: HBWR seeds failed... \r\nDate: Jan 1995\r\nA FOAF bought two hundred Hawaiian Baby Woodrose seeds from OTJ... recently. He tried 20 with no effects... then waited a few days and tried 50 with again, no effects. He gave a friend 15 to see if it was just him, but the friend didn't experience anything either. He ended up gulping down the remaining 115 seeds a few days later. Guess what... no effects. [Erowid Note: Warning, This is not recommended. While some seeds may have no activity, or some individuals may not experience effects, 115 seeds could be a gigantic overdose.] The seeds looked like others he had bought (to grow) and he has never had any other experiences with HBWR or morning glory. Any ideas?\n\n\n"
}