{
 "title": "Strange Feelings",
 "author": "storm",
 "citation": "   storm. \"Strange Feelings: experience with Cannabis (oral) (ID 19501)\". Erowid.org. Sep 26, 2005. erowid.org/exp/19501",
 "substance": "Cannabis (oral)",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "3.5 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "3.5 ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "1997",
   "19501",
   "Male",
   " ",
   "Not Given",
   "Sep 26, 2005",
   "10168",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I had been a regular user of cannabis for about a year and was generally considered a hardcore user. My normal experience was the standard giggliness and a perceived widening of higher thought processes which included a heightened appreciation of arts/creative (songs/films etc). My experiences had also included the occasional feeling that my mates were plotting against me and did not really like me but I never voiced or acted on this feeling and it only happened on heavier sessions. If I smoked light I had a good laugh. Id even smoke while I drove and before lectures, hell I would have a joint after breakfast. </p><p>Scene : my 25th birthday, I was relaxed, happy, healthy, in a loving relationship, no history of abuse/depression and not on medication for any illness. We had 3-4 beers at home and the boys in my university house had planned for me to have space birthday cake. They melted an 1/8th of hash into about 12 brownies of which I had maybe 3-4, my girlfriend had 1-2 at about 7pm.  I knew from word that the effects although stronger may take a longer time to kick in so I decided to drive up to get a KFC and get some food. The trip there (10 mins) was normal but the trip back was a little weird. Traffic lights took a lot longer to change and I felt the odd feeling of being blank. Back at home and amongst friend the usual signs of being stoned started kicking in as usual, I laughed nearly all the way through an episode of The Simpsons, felt mellowed out and relaxed. A joint was passed about and I had a few hits on that too. But around 9pm I started to feel a little queasy and had feelings that I hadnt felt before including blank moments. To be on the safe side I went into my room to ride out the high for a bit and get dressed to go out clubbing leaving everyone downstairs to party some more.</p><p>Alone in my room I was suddenly hit by strange feelings I had felt before as a child of 8 years old when I had been diagnosed as having a condition called 'petit mal' (related to epilepsy apparently). Its a very common condition and usually dissapears by age 13 and is widely regarded as small electrical storms inside the brain neurons causing the sufferer to go blank for a few seconds at a time. They come in episodes of 5-6 fits in the space of an hour but it varies child to child. Sometimes the sufferer remembers being blank and sometimes not. Some report strange detached feelings during the blank... Thats what I'd get... With gusto. </p><p>I remember having small 2-3 second bursts of 'unreality pockets' when my normal perception of the world was altered and warped in many forms. I remember words would sound longer and drawn out, time would seem to move slower and the one thing I remember particularly from that age was that I couldnt estimate the size of things... This sounds strange but open your mind to this concept, you see a matchbox, you recognise it as a matchbox and estimate its size to be 4cm by 2cm by 6cm and recognise that it cant harm you. Now take away that recognition skill, you can see the matchbox but cant tell if its a mile high or a pinhead wide, that would be scary right? No wonder my parents had to chase me round the house wondering what was wrong with me while I screamed and cried. My pillow gave me no reassurance as it felt like it was a million miles high. Our doctor gave me tranquilisers and I was right as rain by the time I was 12.... It was a half forgotten bad memory of my childhoof, till of course at this point on my 25th birthday when I had had spacecakes and it was back.</p><p>I recognised the same symptoms as when I was a child, the random bursts of unreality but now they were in amongst the haze of being stoned. And as I had grown up so had the power of these bursts. They were MUCH more powerful than I remember, and scarier and longer. I had heard that LSD can make you feel like Satan is after your soul etc but I never hear these stories associated with cannabis. Trust me, in the next hour or so God turned his back on me and let Satan take me home. </p><p>I feared for my physical well-being because </p><p>1> my heart was beating at around 150bpm </p><p>2> I was palpitating </p><p>3> my movements felt poorly co-ordinated </p><p>4> I was nauseous </p><p>5> I was convinced some foreign substance in the weed had ruined the delicate chemistry of my brain and I was doomed to a life of insanity</p><p>I also feared for my mental well-being because </p><p>1> I knew that my life had changed forever from this moment </p><p>2> I was acutely aware that I had been living in ignorance of the  true realms of human existence and this 'knowledge' would change my perception on life </p><p>In these bursts it seems the world ceases to exist how I recognise it and I momentarily become acutely (and I mean right down to the very core of my being) aware of things for what they really are. Example: My plant changes from a ornament in the corner of my room to an organic life-form which gives me oxygen and poses no immediate threat to my life. The distance between everything also seems to change! Like the wall would be 3 feet away but during the burst it suddenly seems 30 foot away. Or maybe 1 foot, or an inch. The concept of size means nothing. A small thing is the same as a big thing.... Also in these bursts everything seems a little more primal and instinctive, almost like I feel like an animal whose nest is being invaded and Im getting ready to fight. I just sat there staring into space and waiting for the next terrifying pocket of unreality. Each 4-6 second episode would be grimly accompanied by the kind of  adrenalin rush I would expect when faced with certain death. And I knew that death was imminent, and in some ways I would have preferred it to come quick as this was definitely the worst feeling that a human being could have. I rued the thought that through the abuse of substance I may have re-triggered the childhood condition into full blown epilipsy. Staying perfectly still calmed me down and seemed to reduce the attacks but not a lot.</p><p>During the next hour I saw an image of a car in my room, realised (and now conveniently forgotten) the meaning of life! I foresaw the circumstances of my death (forgotten except for there is a traffic cone involved), saw patterns of black and white geometeric shapes in front of my vision that I absolutely knew had significance in my life and psyche, I even recognised some of these shapes as' being' my brother, and one of my father, I also had visions of previous lives (or well it felt like it) realised that I had strobe vision and trails (moving my hand left a set of trails across my vision) and felt fear like I have never felt since. And all of course with a scattering of these pockets of unreality. I do remember crawling along the floor to summon my girlfriends help then its a blank, no memory till I woke up nearly 20 hours later. </p><p>My girlfriend explained that she had come up to find where I was after I had disappeared from my own party downstairs. I was sprawled on the floor mumbling incomprehensively to her explaining I knew why I was who I was and burying my head in her chest to escape the visions. I was also shaking like I was freezing cold. I then apparently threw up huge chunks of space-cake in the bathroom and laid down to bed at about 10pm in the foetal position. Amazingly all my mates went out on my birthday party without us! My girlfriend had rather tactfully told them I had a 'tummy ache'! </p><p>The whole of the next day I felt disconnected from everything and spent it thinking about what had happened and why I had had this experience and if it had been a one-off. 'Perhaps this particular weed had had some other substance in it.' Everyone else had been fine, I was the only one who freaked. I had a feeling that the slightest toke on a joint would regress me back to that night and I was absolutely right. A week or so later I actually tried and had a few puffs and within 1 hit of a pipe I was exactly the same! Not as strong this time but the feelings and bursts did return for a half hour or so. Same thing, back in my room while everyone partied downstairs waiting for it to pass. I tried this experiment a few more times over the next year or so but nearly every time I did I was reduced to sitting back in my room estimating distances and swearing I wouldnt touch pot again, it obviously hated me now for some reason and I would hate it right back. That was 5 years ago and my flirtation with drugs stopped there and then. I dont touch it anymore. </p><p>I spose its for the best as there is no way I would ever take anything class A now and if I had not had this experience I may have by now. And being in the music industry Im confronted with cocaine etc all the time. All my peers take it looking for some alternate reality to explore because they have become bored of their own. When Im offered any type of hit I just say no thanks. I know not all alternative realities are what they are cracked up to be.</p><p>\n"
}
