{
 "title": "Cheap and Easy to Get",
 "author": "Bloodbob",
 "citation": "   Bloodbob. \"Cheap and Easy to Get: experience with Inhalants: Propane (LPG) (ID 1951)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1951",
 "substance": "Inhalants: Propane (LPG)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1951",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 96385",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>A few years ago I heard you can get high from petrol. Not liking the smell of petrol I mixed some aerosol into a glass jar and sniffed them gave me a buzz and made me giddy but burnt my throat. Soon after I learnt you could get high from butane so I powered up a lighter (some adjustable ones you can set very very high and make them spray out liquid butane) I obviously didn't do it right or something because it didn't work. One day beening boared and depressed I thought hey why not try an LPG gas cylinder and see what that does being a long time ago I cannot remember the details but after several breaths I can remember waking up not knowing what had happened b4. I can also remember producing lot of saliva. </p><p>Within the last 6 months I started using LPG Gas again. The main feature of LPG Gas are pulsing of sight, touch and sound and Reduced taste and smell. General you know it is starting to work when you feel a cold chill run across your body and sometimes you feel nauses for a little while. Funny colored dots a bit like noise in a t.v. signal and dark patches begin in your sight. Like most drugs you loose motor skills. Often all you can consentrat on is sucking down the gas. A waring at this point one deep breath can make you pass out on the floor.</p><p>Hallucinations now when I use the Gas it is mostly late at night with the t.v. in a lighted room. As todate I have only used gas I have tried nutmeg but it didn't work. I have experinced serveral audio hallucination of the t.v. e.g. ads about disney crap when the was no ad on and some voices but they were prety crappy and one realistic one I though my mum was up stairs screaming and stamping the floor because here mobile phone bills weren't as good as the ones on the t.v.</p><p>Twice I have exhaled and the air in front of me riggle like i was breath hot air like above a hot plate. My strongest hallunication was when at the top of my stairs there was one of my dogs the big one( it was there) then the other smaller dog can running up around the corner(it wasn't there) and barked at me then it shrank to the size of a new born pup. It body started loose shape and looked like it was made by several spherical objects. Thoose balls look as if the were very shiny. Then it began to float in the air and spun around and stuff. Begining at the top of the stairs and had bad motor skills ended up leaning backwards slight and was loosing my balance. I was try to grab on to stuff but each time was swung the floating dog thing stopped me grabing onto it. I woke up concussed on the titled floor after fall down a flight of stairs went to the hospital and came back clear. Watch out this is dangerous but cheap.</p>"
}
