{
 "title": "God Is an Artist",
 "author": "Krazy Mike 69",
 "citation": "   Krazy Mike 69. \"God Is an Artist: experience with Mushrooms (ID 19524)\". Erowid.org. Jun 20, 2007. erowid.org/exp/19524",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19524",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 20, 2007",
   "2388",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nBefore I begin my report, I must mention that I have done mushrooms one time prior to this.  My friend and I had eaten approximately 3 grams of dried mushrooms each, but unfortunately we only reached a Level 1 trip.  Although it was nice and subtle, it cannot compare to the trip I had recently with some very potent Psilocybin mushrooms.  The shrooms we had before this must have either lost their potency or not been very potent from the start because I reached a very powerful Level 3 trip off of only 1.5 grams of these dried, Psilocybin shrooms.  </p><p>The environment is my house and the time is about 1:00 AM.  Since I was the only one out of my friends able to obtain any mushrooms, I decided to trip alone tonight.  I had always wanted to trip by myself anyway, in order to deeply explore my inner conscience.  I was able to get a hold of 1.5 grams of dried, potent Psilocybin mushrooms and thankfully, this was all I needed.  </p><p>I turned off all the lights in the house and popped in 'Fear and Loathing in Las Vegas' downstairs.  This movie is always a good choice for passing the time while a drug is beginning to take hold.  I chewed up pieces of the shrooms until they were very mushy and then I swallowed them.  They did not taste bad at all really, just sort of bland tasting.  Immediately after ingestion, I noticed a very slight change.  It was similar to the change I get immediately after swallowing an MDA pill, nothing major, just a slight change and a feeling of anticipation.  After swallowing the mushrooms, I drank down a glass of orange juice because I have always heard it goes well with shrooms.</p><p>Next I lay down on the couch and began watching the movie.  The first thing I noticed was that the movie seemed funnier than it ever had been before.  I was laughing aloud at many parts that normally were just somewhat funny to me.  About 30 minutes into the movie, I started to notice some slight changes.  There were two, small green lines that ran across the TV screen that I had never noticed before.  I started to wonder if they were always there and I just hadn't noticed them or that maybe I was beginning to come up on these mushrooms.  </p><p>Anyway, as the movie progressed a little longer I noticed I was becoming very engrossed with what was going on in the movie and the TV screen itself.  It was like I almost being drawn into the movie.  I decided to take my eyes off it and look at something else in the room.  I glanced up and to the left and looked at a medium sized painting of monks that we have on our wall above our fireplace.  The painting began to stretch and shrink and move.  I was in awe.  I realized I was starting to trip.  I started to look around at other things such as the mantle, the ceiling, the curtains, and the carpet.  The mantle began stretching and moving too and so did all of the objects on top of the mantle.  I looked up at the ceiling and it was stretching as well and so were the two air conditioning vents in it.  I then looked over at the curtains and they were breathing as if they were alive and blowing as if there was wind in the house.  I was in amazement at this point because I had never seen visuals so real looking.  </p><p>The visuals from MDA and AMT are pretty incredible, but there is something there that reminds me that they are indeed drug induced and are just 'visuals.'  On shrooms, however, it was different; it was as if everything in the house was really alive, breathing and moving about.  I just hadn't noticed it before.  I glanced down at the carpet and noticed that the colors from the TV were 'bleeding' off of it and onto the carpet and other things in the room.  The carpet had very intricate designs in it and as I looked at it, the designs began shifting to the left, running under the TV, then they would shift back to the right and began to swirl and stretch and they had a very colorful hue to them as well.  It was a very deep purple color.  I then looked up at the curtains again, and the purple hue was now on them and they were still breathing and the more I looked at them, the more interesting they became.  Soon each individual part of the curtain lit up and danced around and then each part looked like pillars of light forming some sort of doorway.  It was really amazing.  </p><p>(T+1:30) </p><p>At this point I also noticed I was thinking on a completely different level.  I felt like I was really alive, living for the moment, living right now for the first time in my life.  It is very hard to describe.  I was finally my conscience, my soul.  I could go anywhere in my mind and think very deeply about anything.  I closed my eyes and pondered God, life, time, and other very deep, philosophical ideas effortlessly for awhile.  At the same time I was getting amazing CEVs.  Colors and colored patterns were flowing everywhere and I noticed sound would cause different patterns and shifts in the colors and patterns.  I suddenly remembered that 'Fear and Loathing in Las Vegas' was still playing.  I looked at the TV and noticed that the colors in the movie took a very different tone.  Also, everything in the movie seemed to have a slight shadow or after image behind it.  I was thinking to myself how cool it was and then I started listening to the sound.  I noticed that everyone was talking faster and everything was moving faster as well.  At first, I thought I was imagining it, but then as I watched more of it, I realized it was definitely not my imagination.  Sounds and images in the movie would speed up and then slow down slightly, at some points the dialogue sounded almost foreign.  Sound in general was also louder and felt like it was right next to me.  It was very interesting.  Soon I was engrossed in the movie again and became very involved in what was going on.  It was very entertaining watching the movie with the new perspective on it.  </p><p>The movie became very intense at some points, mainly during some of the crazy trips the main characters experienced, and I felt like I was right there with them, tripping on the drugs that they were.  It was like I could feel the emotions and the changes that were taking place in the movie.  It seemed very real. \t</p><p>(T+2:00) </p><p>After the movie was over, I just sort of lay there on the couch, in awe.  Thinking about how great mushrooms are and how real they are.  I looked around the room some more and focused on the carpet.  The patterns in it and the things they were doing, were so amazing that it was hard to take my eyes off of it.  I realized at this point that God is indeed an artist, and everything in the world is beautiful.  I never admired and noticed how great everything looks and how deep the colors are until now.  After that moment of enlightenment, I flip back to the TV just to see what was on.  I was fascinated by the new look the movie took on, so I was interested to see what everything else on TV looked like.  I flipped through the channels for awhile, and noticed that everything was still sped up and there was a slight shadow after image behind everything.  I tuned into a basketball game for a few seconds and laughed because all of the players were playing at an amazingly fast speed, almost as if they were on speed or something.  Then I flipped through a few more channels and stopped on a music video channel.  Some rock video was playing, I wasn't sure which one and I didn't care too because the video was very trippy.  It had two images, the left and the right side were a mirror of each other, and it had amazing colors and colored patterns that went with the music.  I was blown away.  The colors were so good looking.  </p><p>I started to close my eyes, and I could still see the colors and soon I was creating colors of my own and they danced and flowed with the music.  I could feel the emotion in the music too, it was great.  I opened my eyes and looked around the room and noticed that even the visuals would flow with the music.  My curtains were blowing around and everything seemed alive and going with the song.  It was breathtaking, to say the least.  </p><p>After the video ended, I flipped through the channels a little while longer, and stopped at a cartoon station to see what cartoons were like.  'Scooby Doo' was on and colors seemed a lot brighter in it and everything seemed almost 3D looking.  The sound effects were really fun to listen to as well and the characters of course were sped up and their voices sounded different, too.  After being entertained by the cartoon for a few minutes, I decided to turn the TV off and go up to my room and just lay down in the dark for awhile.  Before I went up, I looked outside and stared out onto by backyard.  Nature looked amazing, even from inside my house looking through the window.  It looked liked a painting.  However, it was too cold outside to go out so I decided to save the outside world for another time when tripping.  \t</p><p>(T+4:00) </p><p>I climbed up the stairs and lay down in my room.  It was completely dark except for a small amount of light shining on my curtain from the street lamps below.  It added a perfect hint of light for my room just so I could see things slightly.  The curtain in my window, itself, had a very nice orange tint to it caused by the light below.  I looked around the room and everything was still alive, moving and breathing.  I closed my eyes for awhile and enjoyed all the great CEVs I was getting.  Colors were so good looking.  I realized I could make the colors do whatever I wanted them to do and create new patterns and designs as well.  Soon I opened my eyes, and since it was almost completely dark, my CEVs blended into my room and I made the colors dance all around my room, flowing on my ceiling, dripping down my wall, and just making them bounce across my vision.  It was really awesome.  Then I started to get lost in my thoughts again, exploring my conscience, and thinking about many deep things.  After awhile, I started to return to baseline and felt like I could sleep.  I closed my eyes and drifted off into a very peaceful sleep.</p><p>After my trip was over, I came to the conclusion that mushrooms are my favorite drug.  They showed me so much and made me realize how beautiful the world is normally and that often times we just seem to take most of it for granted.  They also helped to show me how much I still have to learn about myself and life.  They seem to be a very valuable tool for exploring ourselves and expanding our minds.</p>"
}
