{
 "title": "Fun with Kava Kava",
 "author": "Lee Preimesberger",
 "citation": "   Lee Preimesberger. \"Fun with Kava Kava: experience with Kava Kava (ID 1953)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1953",
 "substance": "Kava Kava",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Kava",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1993",
   "1953",
   "Male",
   " ",
   "Not Given",
   "Jun 19, 2000",
   "Views: 119661",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This past weekend, I broke down and tried the Kava Kava powder that I got from ...of the jungle a while back.</p><p>I began to make the drink the traditional way (well, kinda traditional) by mashing the powder around in my mouth and spitting it back out into my ARA Houston Cougar mug.  This didn't look very appealing, as you can imagine, so I abandoned this fairly quickly and moved on to a method involving lots of soaking of the powder and a huge number of coffee filters.</p><p>You might think that OTJ are kidding or being melodramatic when they mention all of the face making and such that goes into the drinking of this concoction.  The first sip isn't quite so bad.  The second is loathsome.  The third is worse yet.  I found a few pieces of ice added to the mix helped a great deal.  This is not something to be savored like a fine brandy or such - this is something to be gobbled down like a bottle of Crazy Horse. :-)</p><p>The effects were hard to describe.  I was definitely messed up in a pleasant sort of way - but I didn't seem to be incapacitated at all.  I went into the Kava in a very lousy mood, I was tired, mentally-overdrawn (which doesn't take very much :-) ), and generally in the sort of humor that a disgruntled postal worker falls into immediately before going on a killing rampage.  After it kicked in though - I was, well, relaxed.  I was still aware of all of the deadlines and such hovering over me - but they all seemed to be put in perspective.  </p><p>I spent the evening listening to music, reading, etc. - underneath a sort of umbrella.  The next morning, I was still in a sort of Kava envelope, although I doubt that any of the active ingredients were still working their magic.</p><p>All in all - it seemed to be a very worthwhile experience - much better than say, drinking one's self into a stupor.  I don't know if I'll buy any more root after my current supply is gone - but I'll definitely finish up what I have.  It's well worth a try.</p>"
}
