{
 "title": "Foxygasm",
 "author": "Little Bunny Foo Foo",
 "citation": "   Little Bunny Foo Foo. \"Foxygasm: experience with 5-Meo-DiPT, Mushrooms & Cannabis (ID 19540)\". Erowid.org. Jan 24, 2003. erowid.org/exp/19540",
 "substance": "5-Meo-DiPT, Mushrooms & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "5-MeO-DiPT",
   "  T+ 0:08",
   "1 hit",
   "oral",
   "5-MeO-DiPT",
   "  T+ 0:12",
   "3.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2002",
   "19540",
   "Male",
   " ",
   "Not Given",
   "Jan 24, 2003",
   "Views: 10103",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThe night started around 9:00 pm when me, my roomate, and another friend dosed on foxy.  We'd been smoking pot all day and continued smoking throughout the trips.  I swallowed the pill and went to set up the video camera which taped most of our trip.  About 9:30-9:45 I start to get really happy and can feel slight body effects so I sit down with a guitar and play a bunch of really random silly songs.</p><p>About 10:00 my trip started to kick in and I was feeling really euphoric.  I leaned over to write a message on our dining table and by the time I got done writing, my world had gone insane.  I completely lost track of time and visuals were everywhere.  I felt almost a sort of tenseness in my chest that kind of pulsated all over my body.  The only thing I could compare it to is the feeling you get achieving orgasm.  Only, it didn't die off.  It made me giggly and weird and I wanted to move around and hug things.</p><p>In my mind, I kept going over things that were happening around me.  For example, I was obsessing over why I couldn't attend an all girl party next door.  I came up with a million obsurd reasons like thinking they all hated me and that's why.  Not giving thought to the fact that I was a male.</p><p>Come about 5 am, I took another strong dose, and had a trip slightly less intense and somewhat shorter, although generally the same.  Before I could completely come down, I dosed on about 3 grams of shrooms and had a pretty intense shroom trip.  The trip didn't give me the normal body high, but the visuals were crazy.</p><p>After being strung out for so long on hallucinagens, I eventually just smoked a bowl and passed out for 15 hours.</p>"
}
