{
 "title": "Kava, Nexxus, Diving",
 "author": "Stefan Curl",
 "citation": " Stefan Curl. \"Kava, Nexxus, Diving: experience with Kava Kava (ID 1954)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1954",
 "substance": "Kava Kava",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 cup",
   "oral",
   "Kava",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1993",
   "1954",
   "Male",
   "",
   "Not Given",
   "Jun 19, 2000",
   "14483",
   " "
  ]
 ],
 "report": "<p>Michael Rippe wrote: : </p><p>I had kava-kava once when visiting Ponape island in Micronesia. There they call it Sakau. We went with someone who knew the way to a place in the middle of a residential compound. There was a 'bar' set up with low benches and a roof made of corrugated steel. A teenage girl sat near the side of the area with a bright red plastic bucket near her feet. At the tables sat maybe three older Ponapeans - the place was mostly empty. They were all sitting very quietly gazing into their mugs. We sat down and the girl brought the bucket over and scooped a half coconut's worth of sakau out into our mugs (each mug-full cost about 25 cents). The stuff was very slimey and very muddy. It was sort of like drinking dirty phlegm. After a few minutes of sipping (you don't want to gulp that stuff) our gums and tongue started to get numb, sort of like under novacain. A few minutes more and the numbness spread to the face and throat. After a while the novacaine feeling turned into a feeling of VERY deep relaxation. It was sort of like getting a shot of novacain in the brain. We got very quiet, slowed way down, and sat there gazing into our mugs like the others. I think if we had another mug our minds would have shrunk down to tiny little dots inside a great mass of deep relaxation and numbness in mind and body.</p><p>A pretty good evening all around!</p><p>BTW, while I was there I tried a couple of the other specialties. Betel Nut, of course. Chewing a nut (split in half with a little powdered lime on it and wrapped in a tobacco leaf) is like drinking about seven cups of coffee - it was too intense for me. Besides, it makes your saliva turn a fluorescent red color which then starts to rot your gums. You can tell the Betel Nut chewers (usually all the older Yapese) by their red rotten teeth, and by the little bag of nuts they carry eveywhere. Another beverage I had there was called 'Faluba,' it was made simply by letting coconut sap from the stem where a frond was cut off drip into a jar for a couple weeks. The sap ferments during that time. It makes a killer drink, kind of like drinking hard liquor but without the sloppiness. The locals liked to mix it with Mad Dog 44 (?? it was a while ago). Very festive stuff, it would turn the normally shy polite micronesians into wild banshees.</p>"
}
