{
 "title": "Way Too Much For First Time",
 "author": "Harry",
 "citation": "   Harry. \"Way Too Much For First Time: experience with 5-MeO-DMT (ID 19605)\". Erowid.org. Dec 12, 2002. erowid.org/exp/19605",
 "substance": "5-MeO-DMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "footer": [
  [
   "2002",
   "19605",
   "Male",
   " ",
   "Not Given",
   "Dec 12, 2002",
   "8160",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFirst of all I want to say that my experience with this drug was probably bad because of alot of stress and emotional problems in my life. However, I have never had any problems before (except the time I overdosed on dxm and dramamine). I believe that my overly intense experience was due to taking much more than needed. </p><p>My friends and I coudln't remeber if 10mg was a threshold dose or a strong dose. So we decided to cut it up into 20 mg doses and smoke that. I was the first one to go. We were sitting in my friend, A's car. A held the pipe for me as I inhaled until my lungs couldn't hold anymore air. I tried to hold it in but could only do it for 2 or 3 seconds. Suddenly I was blasted into what I felt was hell at the time. Everything became slow and the world began to shake and pulsate extremely fast. I can remember trying to talk at first but words just slowy mumbled out. I was overcome by fear and all I oculd think was, 'What have I done to myself? I've killed my brain. What if I never go back?' It was extremely painful, my brain hurt and my body pulsated with the worst imaginable pain. After a minute (maybe less, maybe more) I vomitted on myself in the car. My Friend A, ran around and opened the door and I stumbled out (or so he tells me). I remember trying to talk myself out of the bad trip. I vomited several more times and just layed down on the ground. I began to breathe slow and deep breathes trying to calm myself down. But it didn't take away horrible pain that I still felt. I was overcome by fear caused by the drug taking complete control of my body. I had no control over what happend and this caused panic and fear. As soon I was able to mumble words out I told everyone (A, B, C, and D) with me not to do it. I kept telling them that it was hell and that it just hurts. They all did it of course but no one else had bad trips. However no one else took as much as I did cuz they were afraid too. </p><p>Despite my overly intense peak, the comedown was very enjoyable. I felt euphoric and extremely relieved that it was over. I don't think it was worth it overal. I didn't enjoy the complete stop of all brain activity. I enjoy the abstract and flowing thoughts of other drugs (lsd) much more.</p><p>My advice to anyone who wants to try this drug is start out really small, maybe 5mg. And work your way up to higher doses if you enjoy it.</p>"
}
