{
 "title": "Hard Yet Helpful",
 "author": "college kid",
 "citation": "   college kid. \"Hard Yet Helpful: experience with Ayahuasca (ID 19614)\". Erowid.org. Jul 2, 2003. erowid.org/exp/19614",
 "substance": "Ayahuasca",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Ayahuasca",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19614",
   "Male",
   " ",
   "Not Given",
   "Jul 2, 2003",
   "15533",
   " "
  ]
 ],
 "report": "<p>Yesterday was the second and by far most intesnse time I've tried ayahuasca.  I ordered the ingredients offline,  it was suprisingly easy to find and cost me around 45 total,  this made two batches.  I took the first batch about a week ago and felt wierdly connected with the world,  everything i looked at in the outside world mirrored something inside of me.  I took the stuff with a friend who also took 10 hb woodroose seeds.  I live by the woods and was spending a lot of time looking at the trees,  thinking about how similar to the neurons in our brain,  and how we can only see a tiny part of them that reaches towards to the heavens and the rest is underground.  I was trying to come up with the purpose of trees then my friend told me that plants influence our survival and that the history of mankind could be changed by people interacting with plants in a number of ways to change thoughts religions or ways of life.  This seeemed really neat to me.  </p><p>From here we went to my bedroom and played with my hamster.  My friend was really out of it,  he was meditating and kept saying it's going to happen it had to happen.  He kept talking about being able to feel all the energy right on the top of his head,  i could actually kinda see the energy and told him to move to the left a little.  he did and then freaked out and left to walk home.  Well apparently he thought his heart stopped and ended up calling the cops and going to the hospital where he got hooked to an iv and had a catither inserted in him,  although he felt much better the next day and his story cracked us both up.  Not much happened with my trip i took a shower in the dark and threw up all over myself i thought i seen mother teresa in this wierd display of lights then puked like never before.  After that day i've been much more calm can breath better and have been happier.  </p><p>I took mushrooms about a year ago after reading sartre for class and had a wierd out of body experience which changed my faith,  since then i've been trying to be more moral and find god, and real happiness. The 2 trip started by drinking the liquid which tasted like puke i didn't think anything big would happen so decided to meditate for 4 hours and see if that'd help.  I puked about an hour into it then decided to go to sleep on my bed.  I was half worried about choking on my own puke and dying but before i could go to sleep i got sicker than i ever have in my life.  My whole body felt horrible and i just thrashed around on my bed puking all overmyself and my cell phone, which broke.  from here i went and took a bath.  The bath was awesome the water was interacting with my body and i was having this huge struggle with weather or not to take a bath.  </p><p>Well from here i began having all these great memories of my parents which turned horriable as i imagined myself inside my mothers stomach sloshing around in liquid.  I was born with a hernia and undescended testicle and for some reason felt compelled to change positions in the water and felt this thing working on my hernia and testicle.  The pain was really strong and my body was shaking like crazy i was also flooding the house but didn't realize it.  i gradually worked through each horriable thought and was somehow thinking that everything i did in my life was leading up to this moment and i was really schizophrenic and only imagined that everyone else was real and i'd wake up and be at peace with everything in a whole new world, with no one in it.  Everyone time i went through the steps to love someone it felt they became a part of me,  I understood the golden rule and how simple yet great it was at this moment. Turned out i was wrong about everyone only being in my head but i did feel and do feel more love for everyone and can see how i'm more similar to other people now.</p><p>As the experience ended i wanted to just go tell everyone i love them and have my mom hold me and be with my girlfriend.  Since then i've been really sick but feel a lot better emotinally, and physically,  My testicle and hernia pain is gone and the circulation in my hands is far improved also it almost killed my desire to want to be with other women.  All in all a lot of the experience sucked and it felt like the trip was taking me,  but it was really good to work through all these areas in my life,  I recommend ayahuasca, even though it's kinda scary.</p>"
}
