{
 "title": "First Impressions",
 "author": "Trey",
 "citation": "   Trey. \"First Impressions: experience with Ketamine (ID 1963)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1963",
 "substance": "Ketamine",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 ug",
   "oral",
   "LSD",
   " ",
   "  T+ 2:00",
   "25 mg",
   "smoked",
   "DMT",
   "(freebase)",
   "  T+ 0:00",
   "75 mg",
   "IM",
   "Ketamine",
   "(liquid)",
   "  T+ 0:00",
   "1 hit",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "1996",
   "ID: 1963",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 12202",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Originally published in The Entheogen Review]</p><p>Im not sure how appropriate the following report is for ER, given the fact that your primary focus is on botanicals and their active compounds. I too enjoy a higher degree of comfort when dealing with plant-based materials; as McKenna says, when youre dealing with a plant, you can have some confidence that you are dealing with a creature of integrity. However, much can be learned from judicious experimentation with synthetics, although in light of the work of Ott and Shulgin that term has little meaning anymore. Ive seen little about Ketamine reported in the Review, and since I was finally afforded the opportunity to experience it recently, I thought Id share my impressions... </p><p>For my first experiment, I administered approximately 100 mg. intramuscularly. There was about a three minute latency period. My first alert that it was taking effect came as a rising ringing in the ears. This noise was qualitatively different from the DMT carrier tone in that it sounded considerably less electronic and it almost exactly mimicked my natural tinnitus (the musician's curse). This sound grew in intensity until it obscured all audio information in the environment, but it was in no way uncomfortable. Then a most remarkable process commenced. My entire field of awareness, both in terms of my external sensory perceptions and my internal sense of self, began to contract. Are you familiar with the film editing technique of fading out from the edge of the screen inwards until the image is reduced to a tiny dot in the center? This is essentially what happened to my consciousness over a period of a few minutes. First my peripheral perceptions blurred and contracted, then my primary senses, my connection to my body, and finally my sense of 'me'. There was absolutely nothing scary or uncomfortable about this sequence of events; it felt completely natural and benign. At the end of this process, I was nothing but a single, dense, tiny point of consciousness in the midst of a vast, multidimensional, seemingly empty space. Then that vanished, and with it went the last vestige of observer consciousness and individual identity. At this point I felt that I had traveled back to the primordial, undifferentiated oneness of being that preceded the big bang and the creation of the manifest universe. There was nothing to see or interact with; I had penetrated a level prior to any sort of subject/object distinctions. The universe was all one thing, and I was it! </p><p>After about thirty minutes on the clock (although subjectively, earth-side time was meaningless to me), I somehow regained a slender thread of individuality, and I noticed that my eyes were open as objects in the room began to slowly come back into focus. This reminded me that I had a body, and I began to feel it once more from my extremities inwards. This re-entry process felt good, like being born anew. Twenty minutes later I was fully incarnate once more. For the next hour and a half I was woozy, shaky on my limbs, thick-headed, and somewhat nauseous if I moved around too much. Cannabis proved to be a valuable ally in tempering the discomfort of the recovery period. I slept well that night and arose the next day feeling slightly light-headed, but handled a full day of activities easily. </p><p>For my second experiment I decided to do some combination work, with the goal of trying to bring back more specific information from the peak state. I started by pre-dosing with 100 mcg. of LSD. After waiting two hours for that to stabilize, I then smoked 25 mg. of DMT, resulting in a lengthened, extremely vivid and positive journey. The after-effects of the DMT intensified the remaining acid high and left me in an ecstatic emotional state which I figured would make an ideal launching pad from which to enter the Ketamine domain. I then injected an i.m. dose of 75 mg. and had an experience almost identical to the previous one, except that it took slightly longer for my identity to dissolve, and I felt as though I spent more time in the undifferentiated state. Interestingly, it actually took less time on the clock than before! </p><p>The truly remarkable part of this session began, however, when I took a hit of nitrous oxide as soon as I had regaine enough physical control to do so. D.M. Turner's Essential Psychedelic Guide had warned of an intensified recovery period in an L/K combo, and I had heard from other sources that nitrous could be useful in mitigating the related discomfort, so I had a few boxes of cream chargers on hand. Each lungful of N2O sent me rocketing into a unique, utterly complete reality simulation of truly fantastic proportions! These virtual realities were so detailed and convincing that once entered, they were fully accepted as the 'base reality' by what remained of my conscious mind, with all concept of having taken drugs being completely forgotten! The content of these scenarios ranged from riding around the cosmos like a bronco-buster on the tail of an ornery comet, moving through alien landscapes on what were apparently different planets, and conversations in my room with real people from my life who were not actually present. These reality simulations seemed to me a staggering experiential proof of another concept that I'd picked up from Turner's book: that the manifest universe is a construct of consciousness, not the other way around. My companions later informed me that it appeared as though the nitrous blasts sent me back into the depths of the Ketamine state for three to five minutes each, and that my eyes were moving about beneath their lids in a manner identical to DMT REM. After inhaling ten whippets, I arose feeling even better than I had in the after-phase of the previous experiment. Physical control was much improved and nausea almost non-existent, although I still felt rather 'thick'. I spent the rest of the evening and the following few days enjoying a truly sublime after-glow of inner peace and deep serenity, feeling absolutely connected to all that I percieved and profoundly blessed to have been graced with such a beautiful learning experience. </p><p>Upon reflection, I would have to say that nothing short of DMT has yet had such an immediate, deeply moving effect on me as this compound. In contrast to the shocking ontological/epistemological challenges that my journeys with the former represent, these trips have strongly reinforced many core beliefs about cosmology that I've held for quite a while. The notion I mentioned earlier about the universe being all one thing - consciousness - is probably the most gratifying of these ideas to have found validated via K. I also feel that my experiences in the consciousness-contracting phase of the onset have given me a profound and highly accurate insight into the process of dying, although I have nothing but intuition to support this extremely speculative notion. I strongly believe that the experience would be of great value to anyone with a serious interest in the diverse operational modes of consciousness, and it is in that spirit that I submit this report.</p>"
}
