{
 "title": "...When I'm Closing in on Death",
 "author": "Chucklez",
 "citation": "   Chucklez. \"...When I'm Closing in on Death: experience with Heroin (ID 19635)\". Erowid.org. Sep 13, 2004. erowid.org/exp/19635",
 "substance": "Heroin",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19635",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 13, 2004",
   "Views: 23167",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nHeroin... Be The Death Of Me... 'Lou Reed'\r\nI can certainly relate. I've been an 'on again off again' Heroin abuser for about four years. I am now 21 and for the hundreth time I've decided I've had enough. No More Dope. Period. \r\nYeah Right.\r\nThe joys of Heroin are so simple yet so complex. Without Dope I often feel I cannot accept the world for what it is. When sober, I hate everyone and everything. A simple 'Hello' in the morning from  friends or family will be returned with a grunt and dour face. When speaking, the only words coming out of my mouth will be pure negativity. Towards everyone and everything. Any small distubance at work or play will result in a verbal bashing. I will have no motivation. It is impossible for me to be happy about anything while sober. ANYTHING.\r\nWhen I am High... Everything is PERFECT. I have the motivation it takes to be commended at work for pushing myself to my physical limit and getting each and every job finished with speed and precision. I will be able to carry on a normal conversation without becoming annoyed by other peoples personal opinions. I can accept the fact that the world is crooked... that our actions are being dictated by another entity. When High, 'I CAN AND WILL'.\r\nBut that only lasts for so long. After about three months, I start getting paranoid. I start feeling guilty. I start worrying about my health. I start wearing long sleeve shirts in 90 degree weather. I start wondering if maybe I can feel 'normal' without Heroin. \r\nAnd so starts my millionth stab at sobriety... Methadone to silence the scream of the dying monkey. A new outlook on life. 'I can do it... I know I can'. I think, 'I haven't felt this good in ages'. and everything is kosher for about a week. Then I come full circle. \r\nIt's strange. So many people claim Heroin makes you not want to feel. Heroin fills me with emotion. The first couple months I appear as a normal human being with a normal mindset. I have my shit together when I am using daily. Always. When I get clean is when things start to fall apart. I cannot deal with people when I am clean. Heroin gives me patience. Heroin gives me motivation. Heroin gives me the strength to carry on. That is until it gets to the point where I need so much to get high my wallet starts breeding moths. Get High? What am I talking about?... I should call it 'Getting Normal'\r\nI wonder if I will ever be able to quit for good. \r\nProbably not.\r\nThe monkey only hibernates. And when it wakes up... its always hungrier than it was the last time around.\r\n... Heroin: Its my LIFE and its my Wife ...\n\n\n"
}
