{
 "title": "Clear With the World",
 "author": "Ybo",
 "citation": "   Ybo. \"Clear With the World: experience with Ketamine (ID 1964)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1964",
 "substance": "Ketamine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.75 mg",
   "IM",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 1964",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 19, 2000",
   "Views: 4996",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>DOSE : Subject was injected IM (Intra-Muscularly) into the Deltoid of the right shoulder with ~1.75ml of KetamineHCL in a concentration of 50mg/ml</p><p>SETTING : A hotel room occupied by the subject and his spouse (who had medical training and was willing to cooperate with our efforts)</p><p>ANECDOTE : J injected me with the ketamine at about 8:40pm. We had rented a hotel room for the night as a solstice present to ourselves. We got there and unpacked and then went out and had dinner. We got back and showered and turned up the heat in the room (so as to be comfortable in the room without worrying about clothes) We hung out for a while and fooled around a bit (the main reason for the night was to get some time alone since we hadn't had any in quite a while) Then we found a movie that looked interesting but it didn't start till 10:00 so I asked J if she would be willing to inject me and she said sure. I got comfortable and she drew up the dose. I figured that if i continued in the experiment they would give me a full dose later so she just gave me about 1.8ml. i figured that would be just under 100mg.</p><p>Laid back on the bed had the lights on. Started fading out, kept my glasses on, felt like i was sinking into a swimming pool and at the same time climbing the floor and being spun around, in a warm white space. Ended up talking to J through most of the event which kept me here more than i would guess is normal. Memories are vague however i do remember a feeling of being very ...... clear with the world. i knew what was important and what wasn't. Things that i had suspected before i knew to be true. Interesting, i can see how people would want to do it again and again and again. The best comparison i have for it would be liquid N2O (which is interesting cause when i think about what liquid N2O should look like it is like Ketamine) the same buzz, only it lasted about 30-45 minutes. Got a little nausea after it was over but only when i actually moved alot. I think that if they invite me back for the next trial I will ask for a larger dosage.</p><p>NOTE : Subject complained of a sore arm for 2 days afterwards, though this is thought to be due to the amount of liquid placed in the muscle.</p>"
}
