{
 "title": "Deep Inside the Body",
 "author": "Matt Thomas",
 "citation": "   Matt Thomas. \"Deep Inside the Body: experience with Ketamine (ID 1965)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1965",
 "substance": "Ketamine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 line",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1994",
   "ID: 1965",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2000",
   "Views: 5291",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The following is a first-hand account of the effects of 'Ketamine Hydrochloride'. The drug was obtained in liquid injectable form of 100 mg/ml. It's used for pre-surgical anesthesia. One street name for the drug in crystaline form is 'Special K'. Dosage is a line about 1' in length and as wide as a paper match, snorted. Full onset of drug is in 5-10 minutes. Total trip: 20-30 minutes with residual effects lasting up to 1 hour.</p><p>The first effects are a buzzing sound in the ear, increasing in volume over a period of 2 minutes. Then a drunken feeling and a quick numbing of the body. Shortness of breath occurs and is accompanied by a slight fear of not being able to catch your breath. This subsides and a deep numbing of the body occurs. A slight increase in heart rate was also felt. A few more minutes pass and a giddy, drunken stupor overwhelms the mind. Tunnel vision and a feeling of 'being deep inside your own body' occurs. Slight visual hallucinations (trails) are common after 10 minutes. Major effect is the numbness and drunken feeling. No noticeable after-effects or tolerance build-up. All in all, a very intersting trip indeed!</p><p>Ok, enough stuffy talk. I liked it =) The only part I didn't care for is the fear of not being able to catch your breath. It goes away pretty quick. I figure it's because of the numbing sensation. I heated the liquid ketamine in a spoon over low heat on the stove. It quickly turns into powder. Chop it up finely with a razor blade. It takes effect much quicker after the first dose. I especially liked the halluciantions! Complete recovery in around half an hour. I don't recomend drinking while on this, or mixing with other drugs. I wouldn't drive either. Me and two friends got fried on this and drove to get some cigs. We took a turn too fast and did a 180 and ran into the hill next to the road.</p><p>You can tell if it's good if it tastes kinda salty and like powdered aspirin (really bad taste). Burns for a few seconds when snorted too. It's a white powder in pure form, could be cut with anything but I had the 100% pure shit!</p>"
}
