{
 "title": "Ambien Amnesia",
 "author": "Ssue",
 "citation": "   Ssue. \"Ambien Amnesia: experience with Zolpidem (Ambien) (ID 19686)\". Erowid.org. Dec 19, 2002. erowid.org/exp/19686",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Zolpidem",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19686",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 19, 2002",
   "Views: 78190",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe prescribed dosage for ambien is normally anywhere from 5-10 mg. at night & I was on 5 mg. when needed for sleep, because I really do have sleeping problems, but knew you could (ab)use this drug to get stoned. \r\nI read up on it a little bit & doubled up on my dose one night. I have taken anywhere from 10-25 mg. in one sitting, but I can get stoned from just 10 mg. It kicks in really fast (I can normally start to feel its effects in a few minutes) and when it has registered I feel sort of tingly, everything gets a little fuzzy and I have become very relaxed. A bit later I usually get a big urge to eat and end up bingeing on sweets or whatever but the ambien seems to heighten my sense of taste or something, because whatever I am eating tastes so amazing at the time I am consuming it. I feel like I am in a dream but in reality I am awake, walking around, talking, etc. \r\nIt can be scary because I will often times wake up in the morning & not have a damned clue what happened the night before. Try as I might the next day, I cannot remember. I've had conversations with people & I can't even recall what was said. I would never take this drug in an unfamiliar setting with people I didn't know well &/or trust, because I know it would be risky and one could get themselves into a lot of trouble doing that, no doubt. It is now very hard for me to sleep without it, and 5 mg. doesn't help like it used to anymore. All in all, it has been more trouble for me than it has been recreational. However, I continue to take it because it is the only sleep aid I have tried that does not make me feel exhausted and 'hung over' the next day. If you have sleeping problems to begin with I would not recommended taking more than has been prescribed for you.\n\n\n"
}
