{
 "title": "I Thought I Was the Only One...",
 "author": "Crafton",
 "citation": "   Crafton. \"I Thought I Was the Only One...: experience with Datura (ID 19728)\". Erowid.org. Dec 19, 2002. erowid.org/exp/19728",
 "substance": "Datura",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1 glass",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1992",
   "ID: 19728",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 19, 2002",
   "Views: 10256",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've often thought back these ten years to the time I was innocent enough to believe that hallucinating was something one did and remained AWARE that one was doing. Something that made you say 'WOW! Look at that! I'm really tripping out!!! I see strange stuff!!!' Well in the end I guess it was that belief I dreamed up out of thin air. We were in Fayetteville, Arkansas, myself and several others. One of us had heard of this plant called Jimsonweed. If you made a tea out of it you could drink about a glassful and trip for hours. So at about 11:00 that morning we decided to do just that.</p><p>At first I didn't feel a thing. 'Probably an old wives tale..' I thought. So I returned to the kitchen for another glass. After a little while I gave up. I'm not one to pursue intoxication to the point of embarrassment, so I decided that it just didn't seem to work for me. I got up to leave and noticed something odd had happened. Gravity had multiplied to such a point that I was slowly being sucked into the ground. I had to fight to hold on to the chair I had tried to stand from but to no avail. The coffee table offered no support as well, and panic stricken, I surrendered to the floor silently, deciding that the best thing to do was to try and sleep. Which I did. For oh, about 12 hours....</p><p>Fast forward to midnight. Across town. I wake up in my own bed in the apartment I shared with a friend. In the top shelf of my closet there sat the mother of one of my friends. She told my she was watching over the girls who were knelt beside my bed praying. I stood up and turned to see these two young girls I'd never seen before kneeling at my bedside silently praying. I got really quiet and told Edie (the woman who turned out to be a pair of pants I'd left hanging off the top shelf....) that I would leave them in peace and only return to get cigarettes as needed from the top of my dresser. I went out into the apartment and went into the kitchen. I turned on the faucet to get some water and somehow decided that I should leave it running considering how thirsty I was. Little did I know, I had also stopped the sink up somehow... I turned and faced the blank wall on the other side of the room and stared in amazement as the soft sounds of flowing water filled the room. </p><p>After an eternity of this my roomate came in, somewhat dismayed about the water running all over the place. He snapped me back into reality enough for me to tell him I was trying to stay out of my room so as not to disturb the girls praying. I lit an invisible cigarette, took about two drags and watched it disintigrate. (This annoyance repeated over and over for hours.)</p><p>He asked me what the hell I was on and if that was what our buddy from across the complex had taken as well. I told him what I could and then offered to go and get our friend and keep him out of trouble. I found 'mark' lying underneath a parked car in the parking lot. I assured him it was safe to come out and he did, only to promptly crawl under the car right next to it. This happened again for about five cars.(...) Once he got over that he said he needed to flick some pebbles into a circle first and then he would come over to my place with me. So I waited as he made a circle of rocks and then started flipping pebbles into the middle like some combination of table top football and golf. Meanwhile I kept trying to figure out what the deal was with these cigarettes disappearing after two drags. We stayed out there probably twenty minutes or so and then he conceded to joining me at my place. But not until he sought out and found his drink, this container of Lawry's seasoned salt. I remember thinking 'How wierd, I always wondered who drank that stuff.' Then I told him that he needed to crash out like I had and things would calm down for him. I turned out all the lights and closed my eyes. Then I read out loud from this book you didn't have to have your eyes opened to read. </p><p>It didn't take long for Mark to decide he wasn't going to sleep. I took off one of my shoes and turned the lights back on. I noticed that he only had one shoe on too. Then something I have wondered about for years happened. I looked over at Mark, busy drinking his salt, and said 'Hey, watch this!' I put a cigarette in my mouth and lit it. 'Watch!' I took a drag. I took another drag and it dissapeared as usual. That's when mark said 'Where did it go?' 'I don't know!?!!?', I said 'It keeps happening. I thought I was the only one it was happening to!'. He told me one of his smokes had disintegrated earlier too.</p><p>I never told him what I was seeing. I figure my hand movements must have been enough to imply what I was seeing, but in the state we were in I could have been talking about ANYthing. But clear as day he watched my hallucination, and not only that he watched my hallucination disappear. All the while drinking salt.....</p><p>The next day we hooked up with the others who had drank the tea. We found out that almost everyone of us had taken off one shoe. We all were smoking imaginary cigarettes. We all had conversations with people who weren't there. One of us had stripped down naked and ran across the U.of Arkansas campus and spent the night in jail watching a T.V. that wasn't in his cell. But to me the wierdest thing of all has got to be the girls praying at my bedside (who I visited on diffrent occaisions all through the night) and Mark watching my hallucination without me describing it to him. </p><p>I don't condone the use of any one particular drug. I don't believe that what works for one person, one way, is going to ever work for anyone else the exact same way. But most of all I don't think that the drug Datura is inherently evil. I think drank as a tea, in a moderate dose, it can unlock chambers of the ego unattainable by our own subjective measures. If it's possible for two people to see the same thing that usually means it's because something is really there. I know it's probably more common for people to see the same stuff while tripping, but for the last few years I kind of enjoyed thinking that I was the only one that saw such things. I hope that if you use this drug you will exercise a kind of 'Kierkegaardian' subjectivism. It might really be there. You just might be the only one to see it. But that doesn't mean it's not there. And most of all, consume less-enjoy it more. Just be careful.</p>"
}
