{
 "title": "Completely Zoned Out",
 "author": "trent lane",
 "citation": "   trent lane. \"Completely Zoned Out: experience with Morphine & Diazepam (ID 19730)\". Erowid.org. May 5, 2004. erowid.org/exp/19730",
 "substance": "Morphine & Diazepam",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   "  T+ 3:00",
   "5.0 mg",
   "IM",
   "Morphine",
   "(liquid)",
   " ",
   "5.0 mg",
   "IV",
   "Morphine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19730",
   "Male",
   " ",
   "Not Given",
   "May 5, 2004",
   "Views: 73568",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Once upon a time, I was working upon a boat, doing clean up and all that other sort of stuff. I found a first aid kit, and was curious so I looked through it. Much to my surprise, I found a bottle of generic Diazepam (Valium), almost completely full. There were about 58 10mg tabs. I poked around some more, and found a bottle of Morphine sulfate, 15mg/ml.</p><p>Fast forward to a few days later. Me and a friend, David, were looking after a boat over night. Seeing as we had nothing better to do, we both took some valium and morphine. Seeing as my memories of that night are very fuzzy, here is a report that I wrote while under the influence of both those drugs.</p><p>-start-</p><p>Right now I am eating a piece of Jack Links Teriyaki beef steak and it tastes wonderful, as always. A few hours ago, I injected .3 ml of morphine sulfate intramuscularly. It took about 30 minutes to take effect, and I have no other way to describe it but that I felt dizzy and weird, almost like being clear-headedly drunk. Previously in the day,  around 2:40 in the afternoon, I took 2 10mg Diazepam pills. I then went to a dentist appointment to get some fillings done. They froze my mouth and the feeling was very strange, to say the least. This was the second of my diazepam experiments and I have concluded that 20mg or less is not a strong dosage for me, as it produces light effects in me. This is strange, considering my body weight (110lbs) and height (5'4'). Me and David arrived at the boat at about 5pm and prepared ourselves for the night, retrieving food from a local restaurant and some DVDs from a video store.</p><p>We eventually settled in, got the DVD player working, put on the Pearl Harbour action sequence, and proceeded to intramuscularly take the aforementioned morphine. After feeling the effects of that wear off, and starting to get bored with Pearl Harbour, we decided it was time to inject the morphine intravenously. Lacking a proper rubber band or whatever to get the veins visible on David's arm, we used one of those plastic wire snaps that you pull tight and you can't remove without a wire cutter, which we had. Making sure there were no bubbles in the needle, so he wouldn't get an embolism which would be VERY BAD. or something. David immediately had a huge head rush after the injection which he described as 'a cigarette head rush times 10'. I took this to be a good thing. THen it was my turn. We took the same precautions with the bubbles etc and started to pull out the plunger to make sure there was blood in where the needle was. bubbles came out, i got scared, so we switched arms. so we did that, and injected between .3 - .4 mls of morphine sulfate. Immediately I was mentally removed from 'reality', so to speak. David kept saying how I was so out of it, and I was. He thought I was going to sleep, but I just couldn't keep my eyes open cause I felt so messed up. My eyes would look at something, and I would stare at it for a long time, just completely zoned out. eventually I threw up a few times, probably from the Sobe Nirvana that I drank plus the liter or so of water that I drank. It felt good after cause I still feel dizzy and fucked up and I'm not shaking and shit anymore.</p><p>We still have two movies to watch but I'm not sure how that's going to turn out because I'm having trouble focusing on what I'm writing right now, but i can still write reasonably well, abeit a bit messy. that's it, i'm out. peace.</p><p>- end -</p><p>This entire experience was probably from about 11pm until 5 or 6am. I'm not sure if I'll ever do morphine intravenously again, because the next night we had to look after the boat again and I tried the vein route again and after I injected about .4ml morphine into my left arm, it swelled up quite a bit so I'm not sure if it's the morphine, or my inexperience with needles, or what, but it's been a few days since the experience and I still have a large bruise where I did the injection.</p><p>The only thing I wish I could've known was, more things about morphine, and how to administer it. All I could find was things about heroin and I'm not sure how much of that actually applies to morphine injection.</p><p>okay, I'm done. be safe kids, and always do your research.</p><p>-trent</p>"
}
