{
 "title": "Killer Trip",
 "author": "Peter McDermott",
 "citation": "   Peter McDermott. \"Killer Trip: experience with Ketamine (ID 1973)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1973",
 "substance": "Ketamine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "IM",
   "Ketamine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1994",
   "ID: 1973",
   "Male",
   " ",
   "Not Given",
   "Jun 20, 2000",
   "Views: 6287",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Dosage was uncertain. The Ketamine came as tablets that were being passed off as Ecstasy. Half a tablet was used. It dissolved completely, leaving no residue. [Erowid Note: This is an extremely risky thing to do. Injecting crushed pills and tablets is a bad idea as there may be binders used which are better not injected into the body. This along with the danger of injecting the unknown substances that could be in any 'ecstasy' tablet make it an extremely poor choice.]</p><p>Before the syringe was removed from the vein, reality as we normally experience it had crumbled into a different form. It was as though the world broke up, revealing another dimension. The subject was there, and not there at the same time - there was no apparent boundary between the subject and object - the world and I became one. </p><p>I remained rooted at the spot for what seemed like an eternity. When I *did* try to move (not for some time - the experience was too intense to contemplate moving) it seemed as though the whole of my body was a mechanical entity, connected by hydraulics, pulleys and gear systems.</p><p>Just moving an arm seemed to transform the whole universe. As the drug began to wear off, the subject felt like some sort of android - like Robocop. The K wore off in a kind of reverse rush. As the universe initially disintegrated when the drug was injected, so a reverse re-integration occurred as the drug wore off. The whole experience lasted some 20 - 30 minutes.</p><p>Although it was certainly an extreme experience, it was fundamentally unsatisfying. No real insight into the world, or even the experience were gained, and there was insufficient euphoria to make the experience seem worth repeating for pleasure. Interesting, but of little lasting value.</p>"
}
