{
 "title": "A Little Self-Reflection",
 "author": "peterchu",
 "citation": "   peterchu. \"A Little Self-Reflection: experience with MDMA (Ecstasy) (ID 19735)\". Erowid.org. Dec 19, 2002. erowid.org/exp/19735",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "9 kg",
 "header": [
  [
   "DOSE:",
   "  tablets",
   "oral",
   "MDMA",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19735",
   "Male",
   " ",
   "Not Given",
   "Dec 19, 2002",
   "8117",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is the result of a little self-reflection....</p><p>Ive been taking Ecstasy for about 4 months now. During that time Ive taken at least 49 pills, plus on one occasion  a gram of MDMA powder. </p><p>During the first couple of months I was only still dabbling in ecstasy, because I couldnt really find anyone else who wanted to take them with me. My best friend didnt approve, the others werent interested, and a couple more had been taking them for over a year before my first experience, so had gotten bored with them, quit them, or moved onto cocaine.</p><p>But by the end of the second month/start of the third, I had a heavy weekend  with ecstasy (8 pills, plus a little bit of cocaine). This was an awesome weekend, and I think this is when I truly fell in love with ecstasy.</p><p>So, were now into the third month, and this is where I started taking a bit more base-amphetamine (pure speed) until a dreadful experience on my birthday has completely put me off this evil, nasty chemical. I only ever really got base when I couldnt get E, but towards the end of the third month/begginning of the forth, I managed to get some more E-contacts , and found some more people who were up for doing it with me. This was where I really started to use E in excess amounts. I started double-dropping, and started meeting a lot of new people who liked E too, and who were genuinely fun , friendly people to be around.</p><p>About 4 weeks ago, towards the end of the forth month, I started upping my E dosage dramatically. 3 starbursts, a bit of cocaine, and some weed made for a very interesting, if not, psychadelic evening! Since then, Ive been buying about 8-10 pills every Friday, plus some MDMA powder. Ive taken about 30 pills in 3 weeks, and I always double-drop at least once on the Friday session. A couple of weekends I tripple-dropped twice.</p><p>During these few weeks it has crossed my mind a few times that I might have a problem with ecstasy. I usually think this a couple days after rolling, on a comedown. Ive talked to a few friends about it, with mixed responses. One told me that I shouldnt worry about it, your just on your honeymoon still (as its only been 4 months since my first experience with E). Another, whos taken well over 100 pills, and has now quit them, has told me Im fine now, but if I continue like this for a few more months, I might start going downhill seriously. I spoke to another friend (a very experienced one whos been taking E for close to 4 years), and she said shed stop me if I ever started losing control. I didnt bother asking anyone else, but two people have told me this week that they are concerned with my E usage. One was a fairly good friend visiting from university. He said that I needed to stop doing it every weekend, otherwise sooner or later Id end up dead. I dont have any idea how hes found out what Ive been doing every weekend hes been at university, but it might indicate that other people amongst my group of friends are concerned. </p><p>I think theyre exaggerating to be honest, and that comment by him did piss me off. I think I have enough responsibility when it comes to knowing how much my body and mind can take. Yes, Im not denying that my ecstasy useage has become very heavy, but Im fairly sensible when taking lots of E. I spread out the dosage over a 5/6 hour period, I take notice of my hydration levels, I NEVER EVER drink alcohol with it. Sure, I double-drop, and ive triple dropped a couple of times before, but I know I can handle it because I experimented carefully before hand, rather than just going all-out mad. I know this friend just cares about me, which is great, its really nice to know that and have that support and loyalty from a person in life, but at the same time I cant help but feel quite angry. Angry because I know people have been going behind my back talking about my drug use, rather than confronting me about it.</p><p>The second person to tell me at least told me right to my face, when I was on E, in the usual place I take it. I didnt know her, but she obviously knew me, because she looked at me then frowned and said, are you pilled-up again?. I just looked at her grinning for a few seconds, grinding my teeth, then nodded! Then she said something like, Jesus Christ! Sort it out!. Being off my eye-balls, I continued grinning and then said, thats very rude!. The two other people sitting next to me just laughed, they were on E too. After this, she walked off. And that was that.   </p><p>Its only now Ive begun to think about these two peoples comments. Im taking a look at myself, and having a think about my useage. Im the only one who can decide to stop taking it, if I want too, not anyone else.</p><p>After some reflection, I think its exaggeration. Why? Because I only take it once a week, or once a weekend. Ive stuck to that rule like super-glue since day 1. I do love ecstasy like no other drug, yes Ill admit that, but I dont feel Im out of control or anything. Like I said, yes, my usage is heavy, but Ive never been very good with moderation! I used to drink like a fish when I was about 16-17, yet still kept it together, and eventually got bored of it. I figure thisll happen with ecstasy before it becomes a problem. </p><p>But for now, the magic is still there, and the good-times still outweigh the comedowns, the positive outweighs the negative aspects, and theres no real need or craving for the drug.But saying all this, I will be constantly checking up on myself from now on, just to be sure, because I havent been sleeping quite right the past few weeks, and Ive experienced a weird sensation a few days after a heavy session with E. I read a report online that described it as a sort of pressure in the head. My head feels really tense and I feel dizzy for a few seconds, then it goes away, then comes back 15 or so seconds later. This continues for up to ten minutes, but usually only a couple, then dissapears, only to return a few hours later, or when I stand up quickly, or sit down quickly , or sometimes when I lay down. Im going to the doctors Thursday, to get some sleeping tablets to help with the insomnia. But I guess the pressure thing is just a sign that Ive had too much. A warning sign ? Fair enough, I can accept this.</p><p>Despite the insomnia, mild depression and some paranoia lasting 3 or 4 days after heavy sessions, Im not really that worried about my ecstasy use. In fact, its a strong possibility that the insomnia and depression could just be after-effects of an operation I had about 5 months ago, I havent been right since then.  Ive lost a little weight too, Im 9 stone now, but this could also be the result of the operation, I lost a lot of weight after it, though I will admit that the ecstasy probably hasnt helped me gain it back!</p><p>All in all, I dont think ecstasy is significantly damaging my life. My relationship with my parents and family is fine. Ive met loads of new cool people because of ecstasy. Its turned me from being a shy-stoner who wouldnt leave his house much, into a person that loves going out at weekends and meeting some new people. I still have my non-E using friends, even if they are stoners who dont like going out much. I still hang with them and see them during the week and sometimes at weekends. I know they are my best friends who know me best and care the most about me. I wouldnt want to lose that. ever.</p><p>So many benefits have come from my ecstasy use, that the negative effects dont really seem that bad in comparison. So, Im slightly depressed on comedowns and I do get paranoid, but this doesnt last forever! Doesnt everyone get a little down sometimes anyway?</p><p>Ecstasy is still the best!</p>"
}
