{
 "title": "Kappa Opioid Spatial Alteration",
 "author": "dopeman420",
 "citation": "   dopeman420. \"Kappa Opioid Spatial Alteration: experience with Salvia divinorum (5x extract) (ID 19737)\". Erowid.org. Dec 19, 2002. erowid.org/exp/19737",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19737",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 19, 2002",
   "Views: 6986",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've smoked salvia once before with a friend back home, and i got only a slight visual disturbance and a faint trippy feeling for a little while. recently, i decided to give it another chance, having read numerous reports of an intense trip for a manageable time, as i have not had the time to trip anymore (nor the resources). so i set about procuring some online. fast forward a week, and it's here. </p><p>my mindset was one of agitation at my lab group when i entered my room, but then i found a note saying that i had a package. this shifted my mood significantly toward the gleefull side of the spectrum. by the time i was in my room gazing upon the five brown vials, each containing 1.1 grams of salvia 5x extract, i was quite optimistic and ready to undergo a good ego twist. </p><p>so i waited, psyching myself up by relaxing and setting everything up, for a friend, C, to get back. I don't know who else here i'd trust to trip-sit. </p><p>[/background] </p><p>he arrived, and i smoked approximately .11 grams in a 'waterfall' type bong. i held the hit until i felt the effects, some 30 seconds later. immediately there was a change in cabin pressure (really!). the spatial dimensions around me bent, as if there were suddenly more than 360 degrees in a circle. i could feel the power of this substance, with a sense of being blasted into a new space toward a fixed point, but as my inebriation approached this point, i curved back toward baseline. i sweat profusely. </p><p>I was frustrated and decided to smoke another. i felt as if i could learn this substance and break through. another approximately .11 gram waterfall was loaded and fired. this time, i closed my eyes and concentrated on the effects of the drug. pinwheel patterns of fractals formed on my eyelids and spread, as if crystalizing. i notified C of the closed eye visuals. ego is off. I open my eyes to check the situation out there. the bed i sit on is miles wide, yet the window, which is normally positioned a full meter away at least, is right beside me as i listen to some people talking outside. i sweat profusely. but again, i could feel something big just above where my inhalations had taken me. </p><p>C asks me how it is when i am grounded. I describe it as 'strange, powerful, and intense.' he decides to do a small bowl, about .06 grams, just to get a taste. he smokes it in a homemade water bong. for the first 30 seconds or so, he experienced no effects. all of a sudden, he says 'whoa wait...' and looks toward the windows. in about a minute of 'that is strange... but cool' talk, he was fully back to consensus reality. he described the experience: 'i looked over, and the dimensions of the room stretched. the windows were a mile away. 'it felt really weird, but i liked it'. a man of few words, unlike myself. </p><p>i was determined to break through. I liken this idea to the plateaus experienced with DXM, only with salvia, i have only reached two plateaus. i have read of a 6 stage explanation (acronym: SALVIA. coincidence?), but i believe some of the effects that they seperate into categories overlap. </p><p>theories aside, i packed the bong with a vial capful of salvia, i'd say .16 grams. i smoked it all in one hit and held, laid down, and chilled to some very mellow, quiet music played by my room mate, J. I definitely broke through. objects of the room are now the basis for fractal spirals. the music sounds distant, and the sound of an acoustic guitar puts me in the middle of a wasteland at midnight near a fence and wooden house. a girl sits on the fence, and she carries a spiritual quality. she smiles, and her thoughts run like a ticker tape through my stream of consciousness. </p><p>i sit up. The room is fluorescent pink, with the flavor of a 70's movie. a rotating green 2 dimensional fractal (i know, that doesn't make sense, but imagine a fractal of less than 2 dimensions slapped onto a 2 dimensional plane) bisects the room. slightly resembles being on the inside of a box that a magician saws in half. this hallucination disintegrates into a collection of almost pill-looking cartoony single-color units with faces, almost as if the pixels on a screen had jumped off and had personalities within your own. this new room looks like reality, but is also quite cartoony. my friends dissappear in the same manner when one speaks to me: 'are you alright?' but words have no meaning. these pixel creatures flood my view, spiraling and cascading, dimensions flipping, twisting, and stretching. the faint music catches my foot and drags me from the stratosphere as i recover (not really an appropriate term...) and reply with 'what? what'd you say?' back on earth. </p><p>[discussion]it wasn't anything like that, but the best metaphors are the closest thing available to descriptions of the effects. there aren't words in the english language to describe this unique experience, as every trip is. </p><p>Overall, salvia divinorum is the strangest place i've ever been. i had previously described DXM as strange, but the character is incomparable. DXM is a more passive strange, where things are strange in their very being, while salvia produces a more intense strange that flaunts itself in its power. in comparison to other psychedelic categories, salvia hallucinations are quite unique. the eye candy produced by the lower phase (dimensional stretching, CEVs) seemed similar to tryptamines in that the hallucinations were integrated into reality. once i broke through, it was as if reality was integrated into the visuals instead. it's a question of causation, almost.[/discussion] </p><p>anyway, tonight i'm going to try chewing the stuff to achieve a smoother, more workable neurological environment.</p><p>================================== </p><p>heh, i screwed up the chewing experiment last night. after 15 minutes of no effects, i swallowed the stuff, thinking it wouldn't work. i knew that one was supposed to chew it for half an hour, but i had assumed the effects would come on within ten or fifteen minutes. this assumption was wrong. according to daniel siebert, effects are not noticeable until the 20 minute mark or so. after reading this, i decided that i didn't have the grim determination and willpower to keep the stuff, which tastes like strongly bitter oregano, in my mouth and continue chewing for half an hour. also, the amount that must be chewed to feel effects was more than i was willing to sacrifice to the experiment. </p><p>anyway, i have noticed a few unique properties of salvia that deserve discussion, or at least to be pointed out. the first is that right after the more intense experiences, i remembered very little of what happened. for an hour or two, i would be sitting there, minding my own business, and i would keep remembering little things about my trip. when i'd trip again, i would be able to remember everything about my past trips, as if salvia has its own little packet of memory that is only accessible in this state. </p><p>the other property is one i've mentioned, the question of causation. i'm beginning to think that the point i felt myself approaching in my first two trips was the equilibrium point between reality and salvia. before breaking through, hallucinations emerge from reality (like my room mate's hair growing horns... that was cool), but after, reality is secondary, and is dictated by salvia's laws. it's like going from: </p><p>consciousness = r(s(x))</p><p> to </p><p>consciousness = s(r(x)) </p><p>one is always seen in the context of the other, and the breaking point is where the situation flips. perhaps kappa opioid receptors, which salvinorin affects, mediate the integration of thought and sensory data. i'd love to see a map or list of where kappa receptors are concentrated. i'll have to add this idea to my list of graduate study possibilities =). anyway, happy exploring, everybody.</p>"
}
