{
 "title": "Ketamine is Fun",
 "author": "hagbar celine",
 "citation": "   hagbar celine. \"Ketamine is Fun: experience with Ketamine (ID 1974)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1974",
 "substance": "Ketamine",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "60 mg",
   "IM",
   "Ketamine",
   "(liquid)",
   "  T+ 0:15",
   "60 mg",
   "IM",
   "Ketamine",
   "(liquid)",
   "  T+ 0:30",
   "60 mg",
   "IM",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1994",
   "ID: 1974",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 20, 2000",
   "Views: 7893",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Once I was interested in Ketamine so I decided to try it. I injected 3 times 60 mg intra muscular.(100 mg/ml in ddH2O, 15 min. between the different injections). It was a odd feeling. It sort of dissociates you from your live. I drifted trough worlds of other dimensions from inside the cosmos towards the outside of the circular thing which is called the universe. (Sounds strange, but that is what I felt) I also had the feeling that I have learned a lot of spiritual things. It is perhaps truth, there was not especially much fun. But I was satisfied and content as I would be after a long adventure holiday. Preston Landers wrote that he injected it i.v. perhaps this is the reason for his discomfort. Though I doubt it. I think it is important that everything is very relaxed. Do not run or walk around. Do not stress yourself. </p><p>Music recommendation:</p><p>At first something very calm. (self hypnosis music works good). Then something fast (good techno). To bring it to en end I played 'sound of whales'- which was fantastic. </p><p>A very serious 'source' told me that it is interesting to smoke cannabis with it. But it is heavy and can easy be to much. (Drink some hot milk with honey to give your body some energy and rest. (it calms you down and helps you sleep).</p>"
}
