{
 "title": "Nature's Magic",
 "author": "Entho-poet",
 "citation": "   Entho-poet. \"Nature's Magic: experience with Mushrooms - Psilocybe Cubensis (ID 19767)\". Erowid.org. Oct 5, 2005. erowid.org/exp/19767",
 "substance": "Mushrooms - Psilocybe Cubensis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19767",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 5, 2005",
   "Views: 4097",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me start by saying I have had many experiances with magic mushrooms. I particularly enjoy eating them alone, which lets you realize thier full potential. I can say without a doubt, Psilocybin is the best substance made by nature. This is a description of my most magical experiance...</p><p>I aquired a decent amout of the sacred mushroom. They were perfectly intact with awesome blueing reactions and dry as potato chips. I was personally amazed by a single shroom that was perfect beyond description with a stem about a inch in diameter and totally solid(some mushrooms when dried get hollow stems). I waited for 3 days before eating my dose. </p><p>(00:00 hrs.) </p><p>I wake up feeling in a good mood, a must for a good trip of anykind. Being in a bad mindset is asking for trouble. I decided today was the day and didnt eat all morning.</p><p>(4:00)</p><p>I ate the mushrooms plain. I have found that as little preparation you do to these fungi the better so i just struggle through thier taste, which tastes like nasty feet smell. Chewing them thouroughly also helps to speed up the process. </p><p>(4:25)</p><p>I am sitting in my room smoking a joint of MJ.(mixing herbs always has good effects). I noticed my MJ garden seemed very very bright, almost celestial. The lights were starting to get halos and i felt very jittery and uncomfortable. This is usually common when first effects are noticed.I put on some Pink Floyd(Dark Side of the Moon) and relaxed. My advice to anybody doing hallucinogenic drugs is relax. The reason 'bad trips' occur is because either people do too much to start with, or they arent ready for the effects. Mushrooms are not a soft herbal tea, they contain a chemical that is very powerful and overwhelming. Most people aren't ready for the fact that this substance takes control over YOU, you become small and helpless to its effects. So don't take any unless you are ready to relax and let the mushroom take you, you dont take it.</p><p>(4:30)</p><p>I am starting to spiraling into shroomland. The onset of Psilocybin is fast and confusing. It seems at though 9 million things are going on at once, yet i am just laying down. Sleep would be impossible. This is the only uncomfortable part, the part that decides a good or bad trip. I started to ask 'what have i done' but took deep breaths and relaxed. I just let myself go and it was the best thing i could have done. I was thinking of so many things, one particularly interesting thought was about ancient man. I felt like a ancient man foraging for food and finding this strange little mushroom. I was thinking about how they probably thought they did something bad and poisoned themself, laying on the forest floor staring at the canopy sway back and forth, even thought there is no wind. I was thinking to myself that eating mushrooms is just poisoning yourself a little bit, not enough to die. This whole time I was staring at one fractal poster I have on my ceiling. It was swirling and looked like a graphic cartoon moving in odd liquid ways. The leaves on my cannabis plants looked like they were waving to me. Another interesting visual hallucination was the wall breathing with my breathing, a common one with real mushrooms. Time was so distorted everything i just wrote seemed to happen for weeks.</p><p>(5:00)</p><p>I finished a whole Pink Floyd cd and started to write poetry. feeling very creative and like positive energy was emitting from my body. Visual hallucinations are intense and I feel like i am on Cocaine, Heroin, And MDMA without thier negative effects. I tried to visit with family, but felt like they were thinking i was a wierdo. I was grinning non-stop so i went back to my room. Much of this trip was spent on my back almost unable to move. I felt very much like I was acting like Ozzy Osbourne.</p><p>(7:00)</p><p>Still going strong. I have found that Smoking MJ will make it seem like you redosed on mushrooms, so i smoked a bit and listed to more tunes. I starting feeling very productive again so i cleaned my house. It looked brand new, and who said shrooms wont make you function.  :)</p><p>(9:00) Finally coming down. Coming down feels similar to morphine and it would finally be eaier to sleep. Much of this experiance is omitted simply because there was too much happening for me to remember. Or so it seemed.</p><p>My advice again is to Be prepared, know your source, and stay calm. Being anxious would be the key to a bad trip.</p>"
}
