{
 "title": "Histamine No More?",
 "author": "anonymous",
 "citation": "   anonymous. \"Histamine No More?: experience with Salvia divinorum (ID 19786)\". Erowid.org. Sep 28, 2005. erowid.org/exp/19786",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19786",
   "Not Specified",
   " ",
   "Not Given",
   "Sep 28, 2005",
   "16663",
   " "
  ]
 ],
 "report": "</p>\nAlmost 3 years ago I first began experiementing with Salvia Divinorum, I experimented with it in different forms (raw leaf smoked/infusion/quid, extracts smoked, liquid extracts) for about 6 months. Suffice to say as a psychedelic it seems to stand on its own and is certainly at the very least the most encompassing and different of any I have tried. But given how universal the experience is, I'd rather mention a strange correlation I've made with Salvia and allergies. I've never had 'terrible' allergies but generally from October to March my nose is always stuffed up, and for about a week in the early fall my face drains uncontrollably. This has been the case since I was about 13 (I'm 25 now). </p><p>For the last two years I haven't experienced my week-long face drain, nor am I that stuffed up during the winter months. I've been living in the same place for 5 years, and my allergies were the same regardless of different climates I've lived in the past 10 years. When I used salvia even in small doses, I would always feel strange de-pressurizing sensations in my nose and facial sinus cavities. The most intense salvia experience I had completely cleared my nasal passages in the middle of Feb. for a few days. I haven't used Salvia in about 2 years and I still don't have allergies/sinus problems like I used to. I have no idea if Salvia is really related to this, but intuitively I sort of think so, before I noticed that my allergies improved in this larger scale of time, I always noticed that salvia seemed to acutely affect my sinus cavities when I was using it, so now that a couple of years has passed I sense the correlation. I'm wondering if anyone else has made such a correlation, if so it may point to other properties of salvinorin A's already mysterious profile.</p>"
}
