{
 "title": "Lightening on the Mountain Top",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"Lightening on the Mountain Top: experience with 4-Acetoxy-DET (ID 19794)\". Erowid.org. Dec 19, 2002. erowid.org/exp/19794",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "14 mg",
   "oral",
   "4-Acetoxy-DET",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19794",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 19, 2002",
   "Views: 18207",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAugust 2002</p><p>After an uncomfortable and unrewarding experience with 4-AcO-DET indoors, I figured I should give this chemical one more try in a more pristine outdoor setting before writing it off completely.  With that in mind, I jumped at the opportunity to test this substance during a preplanned hiking trip in the nearby Indian Peaks.  I encapsulated two pills, one containing sixteen milligrams and one with fourteen, for my partner and myself.  My partner is a bit of a hard head with many psychedelics, so she elected to take a slightly higher dosage than me.  The drive up to the hiking trails was beautiful as always, involving a nice cruise on a small state highway through the mountains, passing through a few tiny towns along the way.  There were five of us in this group, but only my partner and I took the substance. </p><p>When we got to the parking lot, my partner and I each took our pills.  Because of the drought, we decided to smoke some pot I brought in the car instead of bringing it with us on the hike.  We knew it wouldn't be a smart idea to deal with fire in our altered states.  We took five minutes or so to consume the pot, and then we took off on our hike.  The effects of the 4-AcO-DET were noted in twenty minutes.  At first, I noticed a strong energy surge.  Later, objects in my surrounding visual-field vibrated with energy and life.  Colors began to get brighter, and images abounded when I closed my eyes.  Soon, I noticed impressive trails when I moved my hands in front of my face.  The was no difficulty in walking as long as I kept going but when I sat down to take a break, the intensity of the situation seemed to prevail and I would get swept up into the trip/my mind.</p><p>We finally reached the end of the trail around one and one-half hours into the journey, and at a height of nearly 12,000 feet.  The summit was only a few-hundred feet higher than we were, and there were actually two brave souls who were attempting to climb to the top without safety ropes or harnesses.  There was a small lake at the top, and I sat down on a rock near the shore and observed my surrounding in awe.  By this time, I had reached the peak of the experience, and I was at a very strong plus-two on the Shulgin Scale.  The energy surge gave way to a sense of calmness and even slight sedation.  There was a space between two nearby peaks where you could see the Great Plains thousands of feet below, and it really put everything into perspectivehow small I was compared to it all.  And yet at the same time, I felt completely connected to everything.  I also felt a sense of accomplishment at having climbed so high and experienced a state of strong exhilaration and euphoria.  There was absolutely no sense of fatigue from the long and slightly difficult climb, which given the altitude was rather strange.  Perhaps 4-AcO-DET and other tryptamines have effects similar to coca with regards to altitude sickness? </p><p>We spent around twenty minutes on the mountaintop when a sudden storm moved in.  We were well above the tree-line, so we knew it was necessary to get down fast.  Being on top of a mountain during a storm is very dangerous, and lightening-strike fatalities are not uncommon in my area.  That was on all of our minds, and suddenly we were all filled with a sudden sense of urgency to get off.  There were two moments on our descend that I will never forget.  The first was literally seeing a bolt of lightening flash past my head and strike a tree a few hundred feet below.  The second was feeling a static charge build through my body soon after.  Suddenly the hair on my arms stood up, and I could literally feel electricity in my body.  For the record, those in our group who did not indulge in the 4-AcO-DET also felt this charge, so it was not a result of any altered perceptions I was experiencing.  It is quite a foreboding feeling to feel electricity going through your body when you are above tree line on a mountaintop.  The lightening has nothing to strike but you!  Needless to say we maintained a fast sprint the entire way until we finally made it to the trees.</p><p>When we reached tree-line, there was a major sigh of relief from all of us knowing that there were now taller objects for the lightening to strike.  The rest of the hike down was less eventful.  By the time I reached the parking lot, nearly 3 hours after the start, I was all but baseline.  Only a pleasant awareness in my body remained.  All tactile sensations felt incredibly enhanced.  Both my partner and myself would have loved a moment alone to test these enhanced sensations, but that was not to be.  As with my last methylone experience, I was shown that set and setting do dramatically influence my evaluation of a substance.  My two previous exposures to 4-AcO-DET (once with smoking and once orally) had resulted in a very uncomfortable state of anxiety and little valuable insight.  There was none of that this time, and the only anxiety I felt during the whole experience was related to the lightening and the storm. </p><p>As far as my general impression of 4-AcO-DET</p><p>On the surface I am reminded of psilocybin but there are several important differences.  There is a mushroom-like feel to it, in that I get the yawns and I feel somewhat sedated.  But 4-AcO-DET never lasts any longer than four hours for me, unlike mushrooms that can last up to six.  4-AcO-DET isnt quite as visually rich as psilocybin, and the mental properties seem a bit different.  It feels more chemical-like and seems to offer me less in the way of cosmic revelations, at least compared to mushrooms.  Of course, your mileage can and will vary. </p><p>In conclusion, Id have to say 4-AcO-DET is enjoyable to take on a hike in the mountains, or for an evening in bed with your girlfriend, but I still don't consider it much of a healing substance, or one that I would take when I have serious issues to work on.  Perhaps future exposures will change this opinion.  Either way, its a very interesting molecule and I will definitely work with it again.</p>"
}
