{
 "title": "Fell Over Sideways",
 "author": "Anon",
 "citation": "Citation:   Anon. \"Fell Over Sideways: experience with Nutmeg (ID 19798)\". Erowid.org. Jan 12, 2008. erowid.org/exp/19798",
 "substance": "Nutmeg",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 Tbsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 19798",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2008",
   "Views: 9691",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy friend told that nutmeg can get you pretty high, almost like weed. Having nothing better to do on my Saturday I figured.. why not? We each took 3 *heaping* tablespoons full, around 4 in the afternoon. When we went to some local bars around 7. I was starting to feel some effects, I felt pretty relaxed, almost felt like how it feels right before I start rolling.\r\nAround 10 the effects were still pleasent, but I was starting to feel detatched from reality, I could'nt really concentrate on anything. We went home around 11, I started feeling nautious but was able to crash out on his couch. I woke up in the middle of the night covered in sweat, I felt like I was burning up. I was very confused. I hardly knew where I was, but somehow stumbled into the bathroom where I dry heaved in the toilet.\r\nThe next thing I knew, I woke up with my arm IN the toilet! I have no idea how long I had been passed out. I heard some friends outside on the front lawn. I went outside to say I needed help, but every few steps I took, I would pass out. Whenever I stood up I would get dizzy and fall over. I dry heaved again and finally *crawled* my way from the driveway to the lawn, where my 2 friends were.\r\nI hardly knew which way was up; I fell over sideways on the lawn, yelling at them that I needed help. They thought it was hilarious, but I seriously thought I was going to die. Anyhow they calmed me down and I sat outside with them for a few minutes. My friend who I took the nutmeg with, said he was alright and didn't feel sick. The cool air made me feel a little better, and calmed me down.\r\nI went back to sleep and woke up around 7. I still felt sick and detatched from reality, but knew I was going to be okay. It took me a full day to feel normal again. My friend found his toilet paper holder broken the next day! I guess I broke it when I passed out.\n\n\n"
}