{
 "title": "OK Together",
 "author": "Bob da wack job",
 "citation": "   Bob da wack job. \"OK Together: experience with Cannabis & Methlyphenidate (Concerta) (ID 19807)\". Erowid.org. Nov 29, 2004. erowid.org/exp/19807",
 "substance": "Cannabis & Methlyphenidate (Concerta)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "110 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19807",
   "Male",
   " ",
   "Not Given",
   "Nov 29, 2004",
   "Views: 27156",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I would like to start by saying I think I have a pretty high tolerence level for methylphenidate because I have ADD and have been on it medically  for 9 months (recreationally for at least eight months) have recently come off of paxil (ssri) and am no begginer in experementing, but I dont really stick to any one drug for a long period of time (addiction fear). I have tried marijuana, dxm, extacy, methylphenidate, phenobarbital, Shrooms, and LSD.</p><p>Anyway heres what happened; I'm home alone on the first day of winter break none of my friends are in town and my ADD kicks in and says well lets go smoke your christmas gift. So I get out my homemade bong and start toking in my cheapo way exhale a hit into a balloon and recycle the smoke (Law enforcement is crackin down on all drugs since a stupid kid OD'd on coke so im kinda scared to buy). And I realize that if I even wanna make this last a month I gotta stop. So I was kinda high, wanted more, and I was sorta tired so I took two days worth of concerta. The mj effects were in effect by the time I crushed the pills and it was difficult but I managed. I felt the effects of the concerta getting stronger slightly after the pot reached its peak and although pot makes me sleepy most of the time, I wasn't tired, also the world seemed to be moving in slow motion and my mind seemed to be going faster than my body which going at a relatively normal speed, I had very slight visuals, got really into eating and music, and was physically impared slightly. I had the giggles but could keep an incredibly intellegent conversation for the way I felt. </p><p>Both of these substances give me a very philosophical and at peace feeling and my assumption about combining them was right. Very mellow, more than I have been in months. It wasn't all enjoyable though, I had a paranoid feeling my parents were gonna come home and smell it so I lit incense and worried how suspicious it was but the paranoia was not much worse than weed. I got dry mouth really bad. But the thing that strikes me as the most odd is that I got a tightness in my jaw sorta like extacy but it was a stronger feeling of tightness than I remember (assuming my memory is good). It's weird since I have never heard of jaw clenching from either drugs but I have only talked with one other person who tried the combo but they didnt say anything about it at all. </p><p>Overall I would say its a decent expience but I might not do it again, at least not fow awhile, unless I only have a little of each.</p>"
}
