{
 "title": "The Game",
 "author": "Chronotron",
 "citation": "   Chronotron. \"The Game: experience with LSD (ID 1981)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1981",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "12 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 1981",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Jun 20, 2000",
   "Views: 4824",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So then i took 12 hits of this purebred Octopus blotter, and after the usual leave the body white light communion and birth of the universe-genetic racial memory bit, i found myself (not to say that i had any concept of 'i,' 'my' or 'self') in an unfamiliar space. I was within a multi-dimensional web, somewhat akin to a sphere with a center everywhere and circumference nowhere, being turned in on itself an infinite number of times. The web was boundless in its permutations, copmposed of blue hexa-octa-and decahedral cells and not in linear time. </p><p>I was not alone. </p><p>There were others, distinct, and i believe non-human entities; and they were mildly annoyed at my unannounced visit. They were rather busy, engeged in a game, The Game; i was a pawn, one of many in the 'stable' of an entity called 'Chako,' a '7th-level oversser.' The game took place on many levels, only one of which was our familiar, everyday consensus reality. Apparently, all beings vibrate at certain specific levels of psychic frequencies; by seriously tampering with mine through the ingestion of much dosage, I jumped temporarily to receiving 'level 4' data, and ended up in this 'overseer' domain. Chako 'told' me all this through convoluted yet clear thoughtforms, which i understood only partially, being limited in my wetware. </p><p>The object of the game, while ungrokkable to a level 1 entity such as myself, did not appear to be entirely benevelent. For that matter, Chako was not benevelent at all, and posessed of a rather demonic ambience. Anyhow, as Chako's pawn, i was to face another, someone else's pawn, but whether this other was human, when, where and on which plane was not made clear. At this point, the the effects of the lucidant were waning, and i was pulled out of the web, with no reluctance i must say. </p><p>Unlike many other trips where the revelations are fogotten shortly after emergence, I was left with distinct memories of the events that transpired and an almost engramatic warning of consequences of 'jumping' psychic levels. The strangest of all was the clarity of the name Chako and the concept of humans as psychic pawns in overseer's stables, playing The Game without a clue as to its purpose.</p><p>This happened several years ago, it was neither my first nor my last high mikage experiment, but i have not been to the overseer domain since. Psychomemetics, hallucinogens, fantasticants - call them what you will, this was as real as anything i've experienced, mindset and setting irrelevant at this dosage. I await the encounter with the other, and i have no doubt i'll know when it comes. I hope i will be ready. </p><p>So, gentle people, have any of you ever had a like-minded journey? If so, did you figure out what the purpose of the Game is? I'd appreciate any comments, thoughts and ideas you may have on this matter. </p>"
}
