{
 "title": "Thoughts on LSD",
 "author": "James",
 "citation": "   James. \"Thoughts on LSD: experience with LSD (ID 1982)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1982",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:05",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 8:20",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1990",
   "ID: 1982",
   "Male",
   " ",
   "Not Given",
   "Jun 20, 2000",
   "Views: 4437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having done my share of LSD, I spose I should add my two bits to the heap. I have had over half a dozen sessions with acid, ranging over about 5 years. I have ingested roughly 10 blotter hits in this time. The last time I dropped was Dec 15 (or friday, whichever the date was), and second last was Dec 30 1987. Most recently, I started with 1 blotter at 7:39 am, took a second at 8:45, and a third at 4:00 pm. By 9:00 am the liquid skin disease had kicked in, and the metallic sweats came and there were indications of activity. By 10am mental activities were real white-waterish, if ya know what I mean. It was very pleasant. By noon I was really riding high. After the 4:00 booster, the effect was even more profound. By this time I had taken just below 3 blotter units. Acid insights galore, along with the laughter caused by profoundly realized revelations and humorous social-cultural reflections. Asleep by 3am, my girlfriend and I had a delightful, close, 'bonding' evening such as the effects were so wonderful.</p><p>With me, acid can make me devilishly-mischievous, meditatively reflectful, probingly thoughtful, reflective, serene, joyful, intensely happy, radiant of love....it tends to enhance my understanding of the cosmos. It is a way to travel to reality-prime, where things are not exactly as they appear, and things are really eternal and ordered, assuring. It is a soulful drug, a mind/spirit/soul amplifier of perception, not a body drug like the legals. It allows 'the doors of perception' to be cleansed, it reminds you you are eternal. I once feared LSD cause I thought it would take 'me' away, it would destroy 'me'. Now I know personality is indestructable, at least for those who have found 'identification'. While everything changes, 'I' will remain. Those who have done lsd may suspect it is illegal because it causes thought processes that may threaten consensus reality power, it does not promote their 'authority'. LSD is a long strange journey where you walk with yourself and get to know who you really are.</p><p>I've had some really wonderful trips, and have learned quite a lot from this chemical. Its perspective cannot be wrong, just different. How many times has it been said or implied lsd drives you crazy? Are the Beatles crazy? They have done more, and better, LSD than I ever will. Didn't Rock Hudson (or was it Cary Grant) use it? Didn't the CIA? Why must scare tactics be used to squash anything the gov/power-structre doesn't like? Informed, intelligent adults should have the powers of choice, including choice of chemicals. This current prohibition will be no more successful than the last one, in its stated purpose. It has been very successful in its real purpose. Freedoms must be taken if the WoD is to work, and the typical person is too afraid to stand up and question or comment. Places like this are indespensible resources for dissemination of the real truth, and the real news. I thank NetGod that I need not depend upon the TV for news, or our local slanted rag.</p><p>While I admit a slight possiblity of having a 'bad trip' on acid, this has never happened to me. I do see how one could have a displeasurable encounter with lsd if</p><p>1) in bad environment, </p><p>2) with 'bad' people, </p><p>3) afraid of self, or </p><p>4) unable to laugh and enjoy a good humour mood</p><p>But I think all the krap about emergency room bad trips is exaggerated, dark-age hyperbole. And last time I dropped I looked out my 4 story window, not jumped. LSD's LD50 is evidence that it is no harmful to the body than water is. It is beneficial to the mind and soul when used properly. It simply changes your perspective, shifts your dimensions a bit. Like Alice down the rabbit hole, its a strange, but fun and stimulating adventure.</p><p>It's not like I do it everyday. It's been YEARS since I did it before just recently. And thats fine with me. I was celebrating a 4.00 average for this term in school, and thats for Comp Sci, Math, University Honors and some history courses, not basket weaving. My cums up to 3.54 so I am sitting pretty at school, and work for those who would assume otherwise. Which goes to point out the ole 'amotivational syndrome' is a load of myth also.</p><p>Probably the worse thing about this latest War on Drugs is that it is at best, a hypocritical witch-hunt based on misinformation and one sided propaganda. It is against information, and informed-formation. It would crush those who would excercise their legal rights in the name of the law. It would put the Law over the Individual, a corrupt and unjust law. It demands uniformity of posture and mind, rather than unity in diversity. The Drug Warriors assume Judgment as their own, rather than taking stock in tolerance and freedom. As with the Amercian flag, the symbol has become far more important than that which it represnts. And this is a mistake, a grave and fatal error plagueing democracy --- that the citizenry will be 'taken care of', and then controlled. Legislation can never produce moral change, or anything like meaningful growth. Only personal exerience can teach the lessons of life; laws cannot make one good regardless of number, severity, or penalty. Heaven must be something like a self-governed anarchy, with no laws carved in stone, except 'to thine own self be true', and 'do unto others as you would have them do unto you'. Tolerance IS necessary for growth, laws should be to protect the responsible from the animal-people, not to restrict free movement of freewill citizens. Intolerance is indicative of narrowness, and prejudice. Ignorance and prejudice stand in the way of growth, they are unbecoming of those who would learn, and learn to know. (german: kennenlernen) One day perhaps we will pass out of the era of negative, forbidding laws to a system of positive, helpful laws, the Law of Love. When you love every other person as you can love yourself, and when you seek to do good to them and to do good for them, you will see that this is the best rule to run your life by. Laws (rules of behavior or patterns of response) are every persons duty to legislate for himself. Make the real rules for yourself; find your own moral code and live by it, and be true to yourself. If you find yourself fully self-accountable, you need not fear the trials or the scrutiny of tyranny. A truly self-assured soul need not fear worldly troubles, for the citadel of the spirit is ever unassailable. Drugs or not, find yourself and be yourself, and be yourself fully and unwaveringly, certain of the Truth you increasingly live.</p>"
}
