{
 "title": "Tripping on a Cruise Ship",
 "author": "Joel",
 "citation": "   Joel. \"Tripping on a Cruise Ship: experience with LSD (ID 1983)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1983",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1998",
   "1983",
   "Male",
   " ",
   "Not Given",
   "Jun 20, 2000",
   "4995",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First, let me explain the large dose. I'm some sort of freak, because I had tried LSD five times before this time, going up to a dosage of two good hits without getting any effects other than physical ones. So, I figured I'd try four to see if that would do anything at all. I wasn't expecting much, but I got it.</p><p>I am writing this 8 days after the trip, which was a monday nite on a large cruise ship in the Caribbean Sea. I went to dinner with my family, then went back to the cabin with my younger sister. I had decided I would go ahead and try it that nite. So at 8.30pm, I took the acid into the little bathroom with me into the little bathroom and consumed. My sister and I then left to go met our parents at the theatre on the ship to see a show. The show was a musical impersonater that would have been pretty entertaining even if one was completely straight. My family and I sat in a balcony seat overlooking the lower audience and with a decent view of the stage. I could feel it starting to work physically already by this time, around 8.45 or 8.50, while we were waiting for the show to start. I was actually starting to feel a bit nauseated, with the rocking of the ship and a very full stomach. I reminded myself that I could always leave the show if I got to feeling too bad. The bar service man came by and I ordered a sprite, then headed to the restroom. On my way back from the restroom, The Smilies kicked in. I couldn't help it. I was aware I had a silly grin on my face, but luckily it was gone by the time I got back to my seat where my family was.</p><p>The sprite tasted like blood, but I drank it anyway thinking I needed the liquid in my system. The show was good, the impersonator did a very good job on the singers, so I thought. The show lasted for ever, however, thanks to the time dilation. My sister would look at me during the show and when I looked at her, her form kept jumping slightly side to side quickly. The crowd below.... the crowd looked like someone had taken a picture of it and pasted it onto a sheet that kept undulating. </p><p>We didn't stay for the entire show. My sister began to feel sick and we left I think around 9.45. I wasn't aware of what was happening, I didn't know the show was not over. When I realized what was going on however, I told my dad that I would split and see them later. He said allright, have fun. </p><p>Let me just say now that most of the events of that evening are fuzzy to various degrees. Anyway, after splitting from my family, I wandered the ship, getting deeper and deeper into the A. I made my way to a cafeteria on the second highest deck, one with windows for the walls. Luckily, it wasn't very occupied. Only a few other people sat at one other table there, speaking some other language. Hell, I remember it being Spanish, but it really could have been anything, or nothing. </p><p>I sat down at a table to figure out what the hell was going on. I looked down at my pants and intricate patterns were forming on them and quickly becoming other images. I remember seeing a dog barking at a woman and then these two entities merging and dissolving away. I looked at my arms. The skin was tightening and pulsating, the hairs were being forced out from their pores. I looked out the window. Dark streams of colour were flowing past the window. The other people had left and two crew members were sitting at a table, they looked philipino. I left after sitting there for a few more minutes.</p><p>At this point, I think I went up to the highest deck to sit in the wind and think. I had stuck my discman in my pocket before the show figuring that I would need it later. I listened to the first five songs of Pink Floyd's Meddle. The music sounded better, but I can't remember why exactly. No doubt it had something to do with the fact that I had a milligram of lysergic acid diethylmide surging through my brain. I lied in a reclined chair, listening to the music and taking in my surroundings. When the wind would catch my pants and hold them against my legs in a certain way, it made it look like my legs were wasting away, developing deep holes in them. The stars were bright that night; there were no city lights to deal with or a moon. Every star seemed to have thousands of other stars flowing into them constantly, single stars consuming entire galaxies.</p><p>In the blackness of the sky I saw something that will probably be the most difficult thing to describe in this passage. The image was like a complex geometric pattern of cubes. The cubes were not stacked flat, but were set up so that they had one corner pointing directly towards the earth. Every side of the cubes showed the same design, a design which changed constantly. The design had tessalations of Japanime in it, constantly changing the subject face. I split after seeing enough of the sky show and listening to Meddle.</p><p>At this point, I think I wandered back down into the ship, inside, off the open decks. The next thing I have definite memory is entering the main atrium in the ship, where there are five floors around an open center. As I was walking into the room, a man, probably 30 or so, stared into my face. In recollection, I should have told the guy to fuck off or just ignored him. He held up a camera, wanting me to take a picture of him and his family. However, and this is important, he was Italian. He didn't speak any English nor did any members of his group. I took the camera and waited for the group to essemble to be photographed. However, they just kept standing around in the circle. It gets even more complicated. I had just been walking with my discman in my hand, and now that i needed two hands to take the picture. I had to put the discman in my pocket, but I couldn't find my pockets. So, the logical thing to do at the time was to hand the Italian guy the discman. This caused confusion, he refused to take it and I shook it at him and told him to just hold it for now, which was futile since he didn't speak english. This whole event didn't take much time at all. Also, the guy had small scars on his face and they would jump to whoever I focused on in the group so that they had the scars too. Some other member of their group showed up and took over the job of taking a picture, so I was relieved of that duty. I went up to an outside deck, feeling bad and stupid about what had just happened.</p><p>I leaned over the rail and thought about how dumb that last incident had been. I wished I had a friend there to take care of me, but I was alone, head full of lsd, roaming a huge ship with three thousand other occupants on the middle of the ocean in goddamned nowhere. I watched the waves and continued to think. The waves caused by the ship were entertaining to watch. After a few moments, I stopped seeing waves. Instead, I saw milk. The entire ocean had turned to milk, covered with fruit loops. We were now traveling upon The Cereal Sea. The cereal then turned back into the dark water it had been before, but I was seeing the waves as dark stemed flowers with dark coloured petals. A sea of flowers. I continued to watch the waves, and they continued to evolve into new things. Each stage of evolution was a bit odder than the previous one. </p><p>I saw huge jellyfish, fuckin' big stinging jellyfish. The boat had come into a herd of them crossing the seas (so I thought.) I watched them swim and noticed something odd: their mode of communication was electricity. They shocked each other to convey messages. A new species no doubt. I remember thinking about jumping in with them, meeting an early and painful death. However, the waves didn't stay as jellyfish forever. Oh no, the jellyfish became dinosaur skeletons before long. Large carnivore ones, white bones. I had had enough reflection while watching the waves and walked to the end of the ship, the very back of the ship, so that I could watch the trail that the wake of the boat left. This was the best part of the trip, probably. I didn't see anything in the waves, but I started hearing things. Wonderful ambient techno was being created in my head, just for me. It was perhaps a bit repeatitive, but nevertheless beautiful. The music lasted for quite a while, as long as I looked at the wake. </p><p>By this time, I was growing tired of the paranoia and feeling like I should be hiding from people. If I had known about a small deck I found the next day I could have gone there and no one else would have been around. So, a little after midnite I think it was, I attempted to go back to my cabin. However, this wasn't as easy as it should have been. I entered into the atrium, knowing it was possible to get to my cabin from there, but not quite sure how. I felt like everyone was looking at me, and I probably looked confused or lost. People were beginning to look ugly. I thought about just asking someone for help, which would have been a bad idea. I eventually found the hallway that lead to my room and proceded down it. I felt like I should say 'I'm glad we had this little talk' to the universe. I had come up with the idea of Life being a challenge, and god being the thing that gives the challenge. I've dismissed the latter idea as foolishness since I'm atheistic. But anyway, In the hallway I passed a blonde girl that smiled. I remember thinking 'You are Americana, I want to exist within you.' Whatever the hell that means.</p><p>I entered my cabin and went to take my contacts out. In the mirror, I looked near death. I was sweaty looking and just odd generally. I listened to Echoes from Meddle in bed and then went to sleep. However, the LSD kept me from being able to sleep well at all. I tossed and turned for hours. I should have gone back out since I was still under the influence... </p><p>The next day I felt fine and recounted the events of the previous nite. I felt quite good, actually, like the LSD had put some things into perspective. Was the trip worth doing? sure. Would I do it again? Hell yeah.</p>"
}
