{
 "title": "Fundamental Sensations",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Fundamental Sensations: experience with LSD (ID 1985)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1985",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "1992",
   "ID: 1985",
   "Male",
   " ",
   "Not Given",
   "Jun 20, 2000",
   "Views: 3054",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Here is MY story! It was a GREAT TIME!!!!!</p><p>Back in the 70's I did acid a few times, but in the ten years since then I had no access to the stuff, nor was I particularly interested because of other pursuits. Recently I have been studying cognitive and neural systems, which has revived my interest in issues of consciousness and perception. I was delighted therefore when a friend offered to share two last hits he had saved in the freezer from the days of his own wild youth. I had vague recollections from ten years ago of weird sensations and hallucinations and I prepared for the 'experiment' with a checklist of questions to myself about my experiences. The questions were in the nature of 'How does the visual world look?' 'How do you experience sounds?' 'can you compute 345/15?' and the like. I looked forward to the experience with great interest and curiosity.</p><p>We went to my place that night and made ourselves comfortable, and when things started turning weird, I pulled out my checklist. First of all, the notion of having a checklist seemed at the time to be so hilariously funny that my friend and I were doubled up with laughter for a long long time before I could get to any of the questions seriously. It was a kind of laughter that I havent experienced since childhood, a deep and overwhelming mirth that shook my whole body to the core and tears were streaming down our cheeks as we gasped happily for breath. Each new question occasioned a renewed outburst of helpless laughter until we were thoroughly exhausted.</p><p>When I finally got aroud to the questions I discovered a fact that leaves me astounded to this day. I answered every one of the perceptual questions exactly as I would have while stone cold sober. The reason why this was so surprising was that I was actually feeling very very different. In fact I was feeling exceeding peculiar. In fact words cannot express how strange I was feeling, and yet, my sensations of the world around me were exactly as they are normally. So, I asked myself, what is it that is actually different? Well, the sights and sounds and smells were the same. It was my perception of them that was different. This experience gave me a new appreciation for the word perception. Normally we think that if we observe an object, a pencil in your hand for instance, we see exactly that, a pencil, the real pencil, and nothing but the pencil. It came to me that that is not the case. Even when regarding as matter-of-factual an object as a common everyday pencil, we perceive it through a filter of our own perspective, our own view of things. This perspective is normally so ordinary and unremarkable that we are not even aware of it, but it was exactly this perspective, our view of the world around us, that is altered by the drug. It brought my attention to something that I had been totally unaware of although it has been in front of me all my life.</p><p>It is somewhat like the experience of intently watching some event unfold before your eyes, and suddenly becoming aware of the fact that you are watching it on television. Shifting your attention from the event itself to the glowing phosphor dots on the screen. You are looking at the same thing, and you are seeing the same thing, but your perception of it has altered radically. Well the same thing was happening to my own senses. Suddenly I was aware of the fact that the world around me is not the real physical world, but only a view of the world as it impinges on my senses. That the image of the pencil is not a pencil, but a pattern of neural activity in my visual cortex. Of course this is no new scientific revelation, I knew that all along. But now I could feel it, I could perceive it in a way that has permanently altered my way of thinking about consciousness.</p><p>We went outside for a little walk in the night air, and while walking down the street I got a repeat of that first insight. I had the feeling that instead walking down a real street, I felt as if there was a big spherical screen all around me, with an image of the street projected onto it, and that as I walked the image changed, expanding out in front of me and collapsing back down again behind me. I could look up and see an image of the sky, look down and see my feet pushing the sidewalk backwards. I was stationary, it was the image of the street that was moving. Of course when you think about it, this perceptual 'distortion' is actually more real than the 'normal' perception. My brain, comfortably enthroned in my skull feels nothing of the outside world except through the pattern of activity it receives from the senses. It receives images, sounds, sensations, and pastes each one in its proper place on a sensory sphere that represents the world around me. My perceptual distortion was that instead of seeing the outside world, I was now seeing this sensory sphere, with a sensory image of the world on it. To me this an extremely interesting and exciting insight that I will remember for the rest of my life.</p><p>I would see strangers approach along the sidewalk, at first appearing as a little insignificant dot near the expanding focus of my sphere. They would grow and grow until I could see them in great detail before they passed behind and shrank back down to nothing. It was as if each of us posessed his own sensory sphere, and as we approached the spheres would intersect, and I would appear in his sensory world as he appeared in mine. We played a little ritualistic game as we passed, each in turn taking a good look at the other, then politely averting their eyes to allow the other to return the visual examination without making direct eye contact, before hurrying on down the street. It brought to mind an image of dogs presenting themselves in turn for the other to get a good sniff.</p><p>We stopped at MacDonalds to get a bite to eat, and never did a big mac taste so good, although it seemed to take an hour to consume it, and I was a little concerned that the other customers might notice the enormous effort I was expending in getting it down. I could feel my tongue and cheeks maneuvering the lumps of food into position on my molars, a few good chomps, then it was pushed down the chute where my esophagus began an elaborate sequence of peristaltic contractions to persuade it down to my stomach. I looked up at my friend between mouthfuls, and his face looked so weird, it is hard to describe. Although visually he looked exactly as he always does, I would become aware of individual components of his face, his nose, his cheek, his eyes, which would trigger a strong response to my senses independant of the rest of the face, so that the impression was somewhat like a cubist painting.</p><p>We attempted a few mathematical exercises and found that although we were fundamentally capable, it was difficult to remember which part of the problem you were working on, or to hold interim results in your head. While walking around town I had found it extremely challenging to navigate around the familiar streets of my neighborhood for a similar reason; although I could plan a course, I had some trouble remembering which part of the course we were actually on. We were never in danger of actually getting lost, but we did spend some time discussing where we were and how to proceed. It was a wonderful sensation like exploring a fabled town that you have read about but have never actually visited before. As the hours rolled on by we spent the time playing with a slinky and one of those electrostatic lightning machines, blissfully absorbed in such simple pursuits like two children playing with toys. Our conversation disintegrated to short meaningless sentences. I would say something like 'The quality of light is an etherial essence' to which he might respond 'But the meaning of existance is not comprehensive' and I would reply 'Yes but it is if you want it to be', and it would go on like this, knowing that he had no idea of what I had meant, which didn't matter at all, since I didn't know myself what I had meant. Often we would just break into paroxisms of mirth, laughing and laughing until our stomachs hurt and the tears flowed in rivers down our cheeks. At one point I noticed a luminescent glow on the slinky that I could not account for. I told him breathlessly of my discovery, thinking it was a new form of mysterious energy, on a par with Newtons discovery of gravitation, and it took us at least ten minutes to discover that it was only the reflection of the lightning machine, which triggered another bout of helpless mirth.</p><p>At one point we turned out the lights and looked at the patterns of light cast on the ceiling from the street. I cannot begin to express the deep beauty of those patches of light. I stared and stared with my eyes boggled out muttering 'oh my God! oh my God!' I swore I would never take patterns of light for granted again! I could see fantastically complex latticework patterns in the dark which became very vivid when I closed my eyes. I tried to describe these visions to my tape recorder because I knew I could never remember them in all their beauty and complexity, but the visions rushed by so fast and furiously that I could not begin to keep up with them, even if I could find words to describe them.</p><p>Throughout these experiences I remembered an insight I had had ten years ago when I had last taken LSD. I remember thinking that although the experience is novel and fantastic beyond the wildest imagination, that there is also an element of familiarity to it all, a sense of deja vu, that at some past time I had seen these kinds of things before. After much thought it came to me. Remember when you were a kid, and could see patterns in clouds? I remember seeing things in every random pattern. In the linoleum of the bathroom floor there was a man's head, and a little girl, and a horse. In the trees across the street from the house I could see goofy and the snap crackle and pop characters. When I first learned numbers in school, 6 was a little fat boy with a big stomach, and 7 was tall and straight with creased pants, while 3 and 8 were little girls. Now they are just numbers to me, they have lost their fanciful connotations, but on LSD I see images again, like I did as a young boy. And near the end of the trip when thoughts and sensations become more 'fundamental' (how else can I word it?) and you feel spasms pulsing through your whole body and shaking you to your very foundations, it brings to mind the convulsions of a very young infant, and the boggled eyes with their expression of uncomprehending wonder and fascination. Is this the reason for the familiarity? Is this the way the world looked when I first cast eyes on it?</p><p>If I were an alien intelligence come to visit the earth, to get a taste of life among these primitive semi-intelligent self-important pompous ape men, if I wanted to really know what it was like to be human, to have human thoughts and perceptions and I slipped into a human brain and viewed the earth through an earth mans eyes and ears and body, this is the way it would look. This is the wild distorted narrow visioned perspective on the world as seen from within a human mind, but seen with an alien detachment and objectivity. LSD gives me an opportunity to experience what being human is all about. To step back and see my world from a perspective that cannot be gained any other way. To gain deep insights into the nature of what I am. Should LSD be legal? Absolutely! Would I recommend it for just anyone? Absolutely not! I am an easy-going happy person, satisfied with my life, so the experience has always been a good one for me. But the psychedelic experience forces you to face up to some fundamental issues about your own life and mind, and if you are at all mentally unstable, unhappy with your life or yourself, if you have any unresolved mental conflicts, then the experience could well be disasterous beyond your most horrific nightmares! Anyone who takes this drug does so at their own risk, and it should never be taken lightly or pushed on people who arn't sure whether they want it. For those who are suited for it however the experience can be so rich and rewarding in a multitude of ways, that no man should have the right to deny it to them. It is a truely priceless experience!</p>"
}
