{
 "title": "Toad Sweat Confessional",
 "author": "Mr. Wednesday",
 "citation": "   Mr. Wednesday. \"Toad Sweat Confessional: experience with Toad Venom (Bufo alvarius) (ID 19855)\". Erowid.org. Jan 3, 2003. erowid.org/exp/19855",
 "substance": "Toad Venom (Bufo alvarius)",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Toad Venom",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19855",
   "Male",
   " ",
   "Not Given",
   "Jan 3, 2003",
   "Views: 83418",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI work in as pet shop and I am a reptile/amphibian enthusiast</p><p>a customer of ours (a wild, unkempt sloth of a man) asked to board a 'rare desert toad' and to 'keep it out of sight'. having known of the colorado river toad and seen it on websites, etc., I was excited.</p><p>I waited until we closed, and went downstairs where the toad was kept. I never 'milked' one before so it took a while( and I imagined a lot of lost product) before I got up a good glob of venom.  It looked like a popped zit. I smeared it on to a metrocard(NYC) and put it aside to dry. Then I took a slim cigarette I hand rolled and rubbed the toads glands with it. I then let it sit for a bout 20 min, then lit it.</p><p>I felt nothing, save anticipation.  I let the other clot of venom dry for 3 hours, then came back to my job with a dragon chaser I made (a bic pen, with a bowl of foil suspended from the bottom). I scraped the now flaky white stuff into the bowl, took a moment, and took my hit.</p><p>I felt a warm wave starting in the nape of my neck. My ears got hot</p><p>as my lungs were fitting to burst. I exhaled and got very dizzy. That passed and I was full-on. i could feel the effects still rising, and the hundred or so cages of breeding cockatiels whistling around my head looked like strange ugly aliens all moving and mercurial. One thing I always do to check how hard I am bugging is look at the palms of my hands, they looked clammy and blotchy.  My hands were getting bigger and smaller as I looked at them, and I felt the body rush akin to psilocybin.  I noticed I still had some crust in my chaser's bowl, so I folded the foil over and put it in my pocket. Every possible surface was moving.  I looked at the veneer on a cabinet door and the grain of the wood was moving along as if it were flotsam in strong current. I went outside take in some air, and the world was two colors. The sky was a greyish indigo, everything below it was dyed orange by streetlights.</p><p>By now my trip was going down, so I walked home.  I saved the rest of my hit for whenever. I stil have it.  My only regret is that I was dead sober about 60 minutes after taking the hit. It was very intense, like the potent 'redcap' mushrooms that go around here. Very nice though. Hooray for amphibians!</p>"
}
