{
 "title": "North East US Has a Trip Mushroom",
 "author": "Super Trooper",
 "citation": "   Super Trooper. \"North East US Has a Trip Mushroom: experience with Gymnopilus spectabilis (ID 19865)\". Erowid.org. Dec 26, 2002. erowid.org/exp/19865",
 "substance": "Gymnopilus spectabilis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "Mushrooms - G. spectabilis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 19865",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 26, 2002",
   "Views: 16166",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBig Laughing Gym info...<br>Geography:  North Eastern US (Virgina and north) / Japan <br>[Also found in Western US, however for some reason the western varity is not psycoactive enough to be considered for consumption (besides, you guys out west have enough fun mushrooms growing wild)]  ;)<br>Habitat:  Decaying hardwood logs/stumps, base of hardwood trees<br>Season:  June-November<br>Apperiance:  Rusty orange to pale yellow.  Nice size mushroom, really jumps out at you if you run across them.  Cap has a fiberous quality.  Stem has a 'wood like' appearnace.  Plesent mushroom odor, slightly fruity.  Very bitter taste.  (see images section for some good pictures)<br>Identification:  Spore print is rusty orange.  Also look for the tell tale 'wood like' stem.  There should be a definate 'break' between the stem and the gills.  A 'blueing' effect will take place after a while if you burse the stem.  Nice thing about this mushroom is that it has no deadly look a likes. (Except in Colarado)  Could be confused with the Jack-o-Lantern mushroom, which is mildly poisonous but not deadly.  The Jack-o-Lantern mushrooms gills form from the stem and radiate out to the underside of the cap however, as Big Gyms gills are found only under the cap (not on the stem).  Little danger in misidentifing Big Gym as long as a person have a field mushroom manual (it is pretty distinct).<br>MY STORY...<br>July/sunny day.  Me and some buddys went down to Elkins, WV for some camping fun. (We're from Pittsburgh).  Usually we bring some acid or commercial shrooms along with us, however we couldn't score any for this trip on short notice. :(<br>On the second day we went hiking.  Even from a distance the orange mushrooms caught my eye, and I went over to investigate.<br>There, growing out of the bottom of a birch tree was Gymnopilus Spectabilis (lovingly also known as Big Laughing Gym).  I didn't have a manual on me, however I have read 'Mushrooms Demystified' in its entirety (paying special attention to BLG since it is the only trip mushroom found wild in my neck of the woods).<br>I carefully examined it, then picked all five of them to take back to camp for further scrutany.  After matching up the criteria of these shrooms to what I knew of BLG, and taking a positive spore print (important), I announced to my buddys what I had found.<br>Needless to say they were scpetical of what I was telling them, but after seeing me eat one (3 inch long stem, 3 inch cap) they all wanted some. :)<br>NOTE:  In retrospect this probably wasn't the most intelegent thing to do, considering we were an hour from anything resembling a hospital and I didn't have a manual on me.  However, as noted above, I did my homework and BLG is easily identifable and has no deadly look a likes.  (at least in the eastern US)<br>Out of a group of about ten of us, five ate the mushrooms.  The others just shook their heads and drank beer.  Interesting to note was that one of the participants had never tripped before.<br>30 min. after consumption:  BLG eaters giggleing.  I was releaved that the classic pre-trip symptoms were kicking in (correct identification), because if we didn't trip, who knows what the hell we ate!  Shifty perifial vision, slight nausua, increased noise perception, slight visual distortion.  The virgin was running around asking 'why does everything look so weird?  Why is the stream so loud? ;)<br>Hour after consumption:  Smoked a joint of some high quality weed.  Classic psilocybin effects in full bloom.  Neon plants, breathing landscape, psycological distortion.  I would compare it to eating about 3.5 grams of dried Psilocybin Cubensis.  The virgin was nowhere to be found.  The scaredy cats were now jelouse and went hiking to see if they could find more.<br>1.5 hours after consumption:  BLG eaters and myself went hiking for a change of scenery.  One effect I noticed that was different from any other mushrooms I ever ate was uncontroled laughter, much, much more than from other shroom experiances.  The type of laughter I get from N2O.  Nothing was really comical about the woods, no one was even talking or telling jokes.  We were however all in hysterics to the point that people were falling down.  (I guess this is where the name BLG comes from).<br>1.75 hours after consumption:  We came across a log blocking the trails path.  A white, creamy liquid was running off it.  Everyone when silent for five seconds.  Then all at once we realize where the virgin must have went, and done before.  This caused life threating laughter for the next five min.  <br>2.0 hours after consumption:  We got back to camp and found the virgin sitting there.  We laughed at him and told him that his cover was blown.  He laughed and said, 'you got to do what you got to do'.  Understandable I guess, but on a log!?  hehehehe<br>4.0 hours after consumption:  Shroom effects worn off almost completely with no bad side effects.<br>VERY nice trip.  Never laughed so had in my life.  Have found BLG twice since then (both times in PA).  Effects were simular both additional times.\n\n\n"
}
