{
 "title": "Teabagging Combo",
 "author": "Soliver",
 "citation": "   Soliver. \"Teabagging Combo: experience with Coca & Salvia divinorum (ID 19878)\". Erowid.org. Dec 23, 2002. erowid.org/exp/19878",
 "substance": "Coca & Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "buccal",
   "Coca",
   "(dried)",
   " ",
   "  ",
   "buccal",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 19878",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2002",
   "Views: 34943",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI've been buying coca mate tea in bag form over the internet for a couple years now.  My wife and I enjoy a pot of coca tea after work; it helps us both to relax and share the stupidities of the day.  Occasionally I like to grab a tea bag, snip it open, shake in a pinch of baking soda, and toss it in the gob and chew for thirty minutes or so.  The numbing sensation is fun and it provides a quick pick-me-up that I prefer over caffeine.  \r\nAs it's a few days before Santa Day, I don't have to work.  My wife is not so fortunate, so i get the house to myself.  This would be a rare and celebrated treat except for the fact that the place looks like a bunch of hobos have been using it for a hideout- x-mas preparations and a few constant nights of professional swilling with friends has left our flat a mess.\r\nIn order to give my spirits and body a boost, I decide to drop a coca bag in my grocery-hole before beginning the cleaning frenzy I must whip myself into in order to tackle a job such as this.  \r\nWhile reaching in the cupboard for the Orange box of 'Delisse' coca mate, my eyes fall on a rolled baggie sitting on the lower shelf, with the spices, next to the file' powder and dried Habanero . . . my last bit of Salvia Divinorum.  It's been there for months and months.  My last experiment with Salvia had taught me a lot- mainly not to ask yourself questions if you don't REALLY want to know the answer.  But that had been a rather large, theraputic dose, and there wasn't really a whole lot left.  Barely enough for a few small moments of contact with . . . whatever you choose to call that state of mind, place, etc. (I don't haven't been able to come up with a word or phrase that properly describes it yet) that Salvia provides.\r\nI had about enough Salvia to fill three teabags.  Well, I've always been an intrepid type, so I cut open my coca bag, dumped the coca into a bowl, added the salvia, stirred, and spooned it back into the original teabag with a pinch of arm & hammer.  The bag was much more full than usual (obviously) but the coca bags aren't very full to begin with so it wasn't a problem.\r\nWell, I tossed it in back, rolled it in my mouth, and proceeded to clean . . . nothing happened for a while.  Maybe my mouth was kinda dry, but it took about 15 minutes till I could taste the coca, a bit of numbness, and something else...\r\nAfter the wad soaked up enough saliva so it wouldn't bust into my mouth and spread dry flakes all between my teeth, I took it down from my upper check (with my tongue, as is my custom w/ coca chewing) gave it a roll between the teeth, a bite or two, then parked it back up by my gum for a bit.  When that coca / baking soda / salvia juice spread around my mouth and throat, I didn't swallow it at all but just let it soak.  In about two minutes I was feeling the usual numbness from the coca and with each subsequent chew/park, i got a wave from the salvia.  It's very much a different sensation than with smoking - much more mellow, kind and warm.  Smoking salvia makes me break out in a cold sweat but this chew admixture just makes me feel warm all over (which is nice- it's REALLY cold in the house & outside).  The coca tempers the taste of the salvia, which I think would be bitter and somewhat nasty (at best) by itself.  \r\nFor those who would like to enjoy salvia for its calming effects without turning yourself inside out first, this method is highly suggested.  I kept the wad in my mouth for about 45 minutes and I'd say the euphoria lasted a total of about 1.5-2 hours, at which time I re-upped with another bag (3x total).  \r\nEverything I picked up to put away felt heavier than it should, and when I put it away, it was with more gravity than usual.  When I say 'gravity,' I don't just mean weight, I mean spiritual purpose as well . . . it was as if . . . the can of spray deodorant wasn't just supposed to sit on the shelf right nex to the saline solution . . it was SUPPOSED to sit there, that was where IT NEEDED to be, this spot was the universe's place for the spray deodorant, and my placing it there sort of straightened out a single bent wire in the world, making it (the universe) straighter and more organized, therefore better for all living things including myself, my wife, and our pets.  Cleaning the house seemed like a much more important, universal, needful thing than it had been before-amazing.\r\nDoing the laundry, however, still seemed like a demeaning crap-task.\r\nThe rest of the day and evening were pleasant; I got along fine with everyone, remained productive the rest of the day, and went to sleep with no problem.  I imagine a larger salvia portion or 3x, 5x, etc could be used for a stronger salvia effect, but I found the coca/salvia combo to be quite nice and effective at 50/50.  \r\nNext time I'm in SA, I would like to try a fresh coca chew with a larger wad of salvia around the campfire.  I'm sure it would make for a very interesting evening.  \r\nSoliver\n\n\n"
}
