{
 "title": "Disappointment",
 "author": "PharmPhiend",
 "citation": "   PharmPhiend. \"Disappointment: experience with Salvia splendens (ID 19884)\". Erowid.org. Jan 3, 2003. erowid.org/exp/19884",
 "substance": "Salvia splendens",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "buccal",
   "Salvia splendens",
   "(leaves)",
   " ",
   "5.0 g",
   "smoked",
   "Salvia splendens",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19884",
   "Male",
   " ",
   "Not Given",
   "Jan 3, 2003",
   "Views: 12014",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been reading up about Salvia for a while, sounded pretty interesting.  Me, being a 16 year old guy, and unable to order any salvia, kept searching on the internet and learning about it.  I read that some people had noticed effects after using salvia splendens.  I learned I had some of this in my yard.  Off to the yard.</p><p>I picked many leaves, I estimated 10 or 11 grams total.  </p><p>Immediately I put about a gram of leaves in my mouth, and chewed for 10 or 15 minutes.  It didn't taste bad at first, but about 10 minutes in I was desperate to spit it out.  I must have swallowed some of the juice and chewed plant material, but not much.  I wasn't feeling anything, so I spit the stuff out.  </p><p>I repeated this action, still not feeling anything.  I decided to give smoking it a try.  </p><p>I used a pipe with an incredibly large bowl.  I packed about a quarter of a gram to 3/4 of a gram into the bowl, fairly tightly.  I used a butane torch lighter, and kept the flame going the whole time I was hitting it.  I kept smoking it until it was entirely...  cashed...  and didn't feel a thing.  I packed about three more bowls, and smoked those.  I still didn't feel anything, except mild dizziness, which I assume was from inhaling so much smoke.</p><p>I went back downstairs, chewed some more of that nasty stuff, about two grams.  Smoked a few more bowls, felt mostly nothing, except a little dizzy and off balance.</p><p>Overall, I'm gonna have to say that Salvia splendens does pretty much nothing.  I noticed no effects at all, at least no desirable ones, or ones I would expect from a drug.  The plant was mildly relaxing though, but it was probably just the smoke.</p>"
}
