{
 "title": "A Dramatic Change of Perception",
 "author": "Anonymous",
 "citation": "   Anonymous. \"A Dramatic Change of Perception: experience with LSD (ID 1989)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1989",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 1989",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 20, 2000",
   "Views: 6654",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I ever tripped it was with my brother at our parent's cottage in ontario, on lake erie. a perfect trip setting if ever there was one. It had just gotten dark, and this is a rather remote location so when it gets dark it's DARK. We were just starting to peak, and were in the process of building a bonfire, when I glanced up toward the lake and noticed a light on the horizon.</p><p>Keep in mind, this is my first time tripping, and I'm having a great time--laughing my ass off, digging the visuals, etc.</p><p>Anyway, I see this light and sort of stop and start to examine it and figure out what the hell it is. Often you could see the lights from ships going by way out in the lake, and occasionally there would be an oil rig test drilling. Both these things were sources of light, and considering the warpedness of my perception, I wasn't sure my light wasn't just a ship or oil rig, but it sure didn't look like it.</p><p>As I watched the light, I determined that it wasn't moving horizontally, but it appeared to be getting bigger!! closer, maybe, I thought, still figuring it was some man-made, explainable object.</p><p>'what the fuck is that?' I asked my brother.</p><p>At the time I was a college sophmore in computer science, and my brother was a junior in metalurgical engineering. Neither one of us was stupid or especially drawn toward the super-natural.</p><p>'a ship?' he answered.</p><p>'it's too big to be a ship, and i think it's getting bigger' I said.</p><p>now we were both staring at the thing.</p><p>'a weather baloon maybe' I said, trying as best I could given my mindset to come up with a rational explanation, when inside I ALREADY KNEW it was a messenger from another planet!!</p><p>'no, weather baloons don't glow like that!!' he said.</p><p>By now the thing was getting really huge, and was obviously glowing with it's own light.</p><p>It wasn't a ship.</p><p>It wasn't an oil rig.</p><p>It wasn't a weather baloon.</p><p>'it's a fucking UFO!' I said.</p><p>my brother tends to be even more skeptical than I when it comes to things of this nature, but I think he actually agreed with me.</p><p>I thought to myself, as I watched this glowing disk get bigger and bigger, brighter and brighter before my eyes, this is it. This will be mankinds first contact with an intelligent alien life form. the occupants of that spaceship, which is apparently headed straight for us, will come face to face with humanity, for the first time ever, and we, two tripping fools, will be humanity's representatives.</p><p>I was convinced not only that this was going to happen, but that it would be an historic occasion. I wasn't afraid; rather I looked forward to being my species' ambassador to these weary space travellers. I wasn't even scared that they were going to take me away; I thought it would be neat to see the inside of their spaceship.</p><p>Well, we stared at it for another minute or two, and when it got to the point where it was obvious that we were looking at a half-disk, I blurted out 'it's the fucking MOON!!!!!!!!!!!!'. We proceeded to roll in the sand laughing for about a half hour, then continued with our trip.</p>"
}
