{
 "title": "Strong Feeling of Contentment",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"Strong Feeling of Contentment: experience with Poppies (ID 19895)\". Erowid.org. Dec 23, 2002. erowid.org/exp/19895",
 "substance": "Poppies",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Poppies - Opium",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19895",
   "Male",
   " ",
   "Not Given",
   "Dec 23, 2002",
   "30108",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Though the taste is absolutely noxious, I have found poppy tea to be a pleasant alternative to pharmaceutical opiates.  I ordered a few-dozen of the dried Giganteum pods, which are reputed to be very potent.  Two or three of the large pods (using the heads and a few inches of the stem) are plenty for full effects in my experience.  This roughly translates to fifteen grams of plant material.</p><p>To prepare the brew, I always remove and discard the seeds before grinding the pods in my blender.  Then I add one-cup of boiling water to the finely ground poppy-heads with a squirt of lemon juice to help dissolve the alkaloids, and I let it brew in a covered pot for a good ten minutes or so.  Next, I simply run the concoction through a vegetable strainer to remove the spent pods and I drink.  The taste is foul, and it reminds me of drinking hay with ground-up aspirin in it.  I have tried adding sugar to help with the flavor, but it actually seems to make it worse.</p><p>Effects begin as soon as twenty minutes and will often last up to twelve hours.  Though I do not find the resulting high quite as euphoric as oxycodone, or even hydrocodone, it is none-the-less a very powerful and satisfying opiate-high.  Poppy tea is powerfully sedating and I often have to employ a cup of strong tea to help keep me from nodding off.  In the beginning there is a strong feeling of warmth in the body.  As the hours stretch on, the euphoria seems to grow.  Strong feelings of contentment and ease abound for many hours after drinking the brew.  Other than sleepiness, there are no negative side effects that I notice.  I also seem to experience none of the itching or nausea with poppy tea that other opiates sometimes will cause.</p>"
}
