{
 "title": "Overrun by Intense Numbness",
 "author": "Spike",
 "citation": "Citation:   Spike. \"Overrun by Intense Numbness: experience with Heroin (ID 19898)\". Erowid.org. Mar 28, 2006. erowid.org/exp/19898",
 "substance": "Heroin",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "insufflated",
   "Heroin",
   "(powder / crystals)",
   " ",
   "20 mg",
   "smoked",
   "Heroin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 19898",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 28, 2006",
   "Views: 22399",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt all started when my friend called me and asked me if im doing anything tonight. when I said no, he told me that he has just obtained some heroin, not much, just over a gram, and wanted to ask me over his place to get stoned.\r\nI dont like downers very much, but im always open minded, so I said 'sure'.\r\nI drove over to his place, we sat down, put on some music, and then he started to line up the heroin. when I got back from the bathroom, my friend already snored two lines, and was now beginning to make the tin foil thingy for us to smoke it. my two lines were waiting for me on the table, the lines contained about 30mg.\r\nI leaned forward and snored the two lines. the bitter taste scrached my throat and I began to feel the burn. it burned! \r\n'damn this shit is a lot stronger than the last one!'\r\n'ha? oh..yea..' (he replayed, looking half here half somewhere else)\r\nafter about ten minutes, we began to smoke.I have already felt dreamy and rubbery, sort of half erased, and smoking the last 20mg really kicked me out of my seat, or actually, really glued me back into my seat.we sat there, barely moving, I felt good, half paralysed, as if something just clicked me off. everything was in slow motion, everything was so fuzzy, the whole room fell into a coma. I tried to light a cigaret, and it took me forever just to get the ligher to work.\r\nmy strengh has gone, my mind took a brake, I felt like a brainless zombie who didn't care about ANYTHING. I wouldn't call it 'liborating', but defently escaping from all the bullshit that envovles living. I didn't needed anything, didn't asked or wished for anything, just totaly overrun by intense numbness. numbness of mind, numbness of body, numbness of preception.\r\nI only managed to take two puffs from the cigaret before it burned out, I was that slow moving. for times I just stared at the cigares, without thinking about anything. then I suddenly 'woke up' and remembered that I soppouse to smoke it. 'ahh..later', I said to my self. from time to time I drifted to a dreamy like state. things seemed so detached, with no logic nor interest not use. just..blank.\r\nthere was a full half hour in wich I couldn't talk or move at all. sometimes I forgot to breathe. the irritation that I get from the lack of oxygen was just flushed away. it didn't mind me. it wasn't that important.\r\nI can't remmember when the effect finally wore off, but it held for quite a while.\r\nit was very enjoyable, althow I will probably won't do it again.\n\n\n"
}