{
 "title": "Trip from Hell",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Trip from Hell: experience with LSD (ID 1993)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1993",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 1993",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 20, 2000",
   "Views: 4067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had a trip from hell experience. I was driving up to Milwaukee to see Jerry Garcia over thanksgiving break. Getting there about 5 hours early me and my friend ran into someone in a Van selling jewlery, chains and LSD (GO FIGURE!). I bought four and split them with my friend. We then headed over to the Milwaukee Museam of Art. After going through there for a few hours with great enjoyment we left to walk back to the bradly Center. The building that housed the art was across the expressway and you had to walk over the overpass and through a parking garage. \r\nI was starting to really peak and we ended up getting lost somewhere in leaving the garage and ended up in a construction site. After working our way through that we got hopelessly lost. Finally after getting back near the Bradly center we stoped into a cafe to get something to eat (don't ask me what made me think I wanted to eat) I ordered some screwed up combo like onion rings soup and coffee. This old grouchy lady was the watress and one of two employees. The place was filled with deadheads. I was dressed fairly conservativly in Jeans and a sweater. All of them were really messed up. She constantly bitched about how hard her job was and just in general was rude to everyone.. She looked at me and said 'You are the only normal one in here' at that point I grimaced and burst out in uncontrolable smiles and laughter. She then said 'I don't know whats going on in here, your crazy too.' \r\nI tried to pull my self together and gave my food to a hippie girl who had nothing to eat and was going in some caravan to California. I walked over to the Bradly center and was looking for the entrance, we were waiting up against the wall when two people right up in front of us I guess asked someone for doses, then three guys dressed as dead heads tied thier hands together with that plastic psudohandcuff ties and said , Milwaukee police, your under arrest, operation so and so etc.. this is where the trip went increasingly down hill. \r\nAfter getting into the concert Still shook up and with my asthma giving me problems from being out in the cold so long I listened to I think the first four songs. Then I was overcome with depression and had to walk out.. I sat on the interior stairs of the center and cryed, telling my friend what a looser I thought I was, and how my life was worthless. Then I thought I was going to quit breathing, I wanted to call the paramedics and go to the hospital, but my friend talked me out of it, knowing what a mess that would be.. Finally after about an hour of thinking about everything that was bad and depressing to think about I pulled myself together. Some deadhead was so fucked up he fell down the stairs on top of me and by that time the concert was over. \r\nI then went out to my car, did more mental acrobatics and drove home. I stoped at dennys after getting back to illinois and order more soup, god knows why?... After attempting to eat some and drink a little coffee I looked down at my soup, the carots looked like 'Steal Your Face' logos floating in beef broth... Very Strange... .I really have nothing more to say except that It was a trip to hell... However I did learn alot from it so I guess the pain wasn't completly worthless...\n\n\n"
}
