{
 "title": "A Really Strong Buzz",
 "author": "Raoul",
 "citation": "   Raoul. \"A Really Strong Buzz: experience with H.B. Woodrose (ID 19946)\". Erowid.org. Dec 7, 2004. erowid.org/exp/19946",
 "substance": "H.B. Woodrose",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)",
   "  T+ 3:30",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19946",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 7, 2004",
   "Views: 7764",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>14:15 - 4 Seeds crushed with pliers and placed in about 100 mL of water in plastic container</p><p>14:23 - Ugly water suspension put in mouth with dregs remaining in plastic container.</p><p>14:26 - Ugly water suspension swallowed. Rest of the dregs discarded.</p><p>14:30 - Very hard head buzz. Is this real or is it just my mind playing games with me? I can't tell. It feels very strong. I don't think that my mind could make me feel like this.</p><p>14:59 - Okay. My head is really buzzing hard. I feel very spaced out. Nothing spacially, visually, aurally, none of that. But my head is really starting to fuzz.</p><p>15:31 - Still fuzzing, only a little harder. Slight discomfort in the abdomen. Vision starting to get a little blurred. Colour enhancements? I can't tell. I want to say yes, but again, this whole thing could be in my head. Or is it? I feel like I want to eat some yogurt.</p><p>16:20 - Abdominal discomfort is mostly gone. Feel very antsy, like I want to go out and do something. Vision is more blurred, and I keep on thinking that this is the beginning of something, but I think this is it. I didn't put the seeds in water for that long. I think I would have vomited if this had been a real dose. I want to stretch and smile really big. I'm going to read a book for a while.</p><p>16:44 - I really want to go do something. I'm contemplating smoking a cigarette. (This would, of course, entail leaving and getting some at the gas station.) I'm eating a little yogurt now that I feel comfortable enough putting something else in my stomach. I think I'm going to head out soon.</p><p>16:51 - Bad case of diarrhea. Very uncomfortable.</p><p>17:15 - Back on the road to destination.</p><p>17:48 - Stop at a park to smoke a cigarette while listening to Disc 2 of 'The Wall.' There are very slight distortions in spacial perception, and maybe some colour changes and shifts, but in general, this whole thing has just been a mild head trip. I feel very tired.</p><p>18:30 - I go to the house to have dinner, and it tastes very good. I can't eat as much as I usually do, but it's very good. My head stopped fuzzing after supper. By this point, I taste the metallic-LSD-taste on my tongue. Very weird.</p><p>19:30 - Listening to the Beach Boys - their later stuff. Man, they were so talented. As I listen with my eyes closed, little patterns of light enter my vision screen and dance with the music. Very subtle, though. It's almost as if they just sneaked their way into my psyche and then when I noticed them, they would go away. Music sounds very nice, but then again, I've always loved the Beach Boys.</p><p>21:00 - Back to baseline and goig to bed. Fun, except for the bout in the bathroom. Will try again soon, with a higher dose, and will try not to swallow the stuff, but rather let it sit in my mouth for as long as I can hold it and then spit it out. I will probably grind the seeds better too.</p><p>Retrospective: Overall, it was too small a dose to really enjoy. The discomfort would have been worth it if I had had a more intense trip. I didn't really want to trip hard anyway; I really wanted to test out the waters, and I think I did okay. The next time, it will be more seeds, more finely ground, no swallowing, and I'll be starting the whole process early in the morning. Looking forward to it.</p>"
}
