{
 "title": "Meh... I've Had Better",
 "author": "Joint",
 "citation": "   Joint. \"Meh... I've Had Better: experience with Peyote (Lophophora williamsii) (ID 19950)\". Erowid.org. Jul 13, 2013. erowid.org/exp/19950",
 "substance": "Peyote (Lophophora williamsii)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3/8 oz",
   "oral",
   "Peyote",
   "(dried)",
   "  T+ 0:15",
   "3/8 oz",
   "oral",
   "Peyote",
   "(dried)",
   "  T+ 0:15",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 12:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19950",
   "Male",
   " ",
   "Not Given",
   "Jul 13, 2013",
   "Views: 796",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Just like the first few times I did acid, I didnt feel anything the first time I tried peyote. I didnt believe it was actually real, (people bullshit about stuff round here) but then I got some of it. I ate an eighth of dried crushed up peyote. It was pretty weird looking. A brownish red in color, other parts were brown or tan. And there were white and yellow fuzzie things too. Anyway, a bunch of people tripped off less than an eighth! I ate a whole one and nothing happened. I did take it with hawaian punch though... Maybe that has something to do with it not working. I tried it again a week later, and I ate even more, plus on an empty stomach and didnt drink, nothin but water. Again, nothing. </p><p>Well Xmas came around and my friend really wanted me to see this stuff actually work. He gave me at least 75% of an ounce of this crap. Christmas day, all my plans to see family got fucked up (weather, no one gets along, etc..) So I hadnt eaten since xmas eve, and it was about 4 pm. I proceed to choke down this horrible foul tasting crap. I ate about half of what I had... No, a lil more. I waited about an hour and a half. Nothing yet... Then maybe 15 minutes later I threw all that shit up. I was pissed, cause it was all right there staring back at me. Now it will never work I thought. So I ate the rest of it... It was really hard. After this, I smoked a ton of weed until I felt like I was rolling almost. But I had a bad gut rot feeling, like I ate 16 cough tablets. </p><p>I was floating most of the time. Really euphoric. For the first 7 or 8 hours it was just euphoria, like floating feeling and body high. Drinking plenty of water... Then after watching lots of south park and laughing my ass off, I went upstairs and smoked some more. Then my carpet started turning into 3d textures like snowflakes and stuff. Pretty cool. I turn on the black light and everything looks really cool, but nothing really out of the ordinary. I felt like I took some acid, but not enough. But the body high/euphoria outweighed everything. Then later on, at like 4 in the morning, 12 hours after taking it, my stomach started to hurt really bad. I drank water and smoked to try to kill the pain, but no dice. I didnt feel like I had to puke but I just went over to the toilet anyway. It licked balls cuz the toilet still smelled like the first time I puked, so that made me start dry heaving. The most painful dry heaving you can imagine. Finally I puke, alot more than I thought I had in me. I feel a little better... But by now I'm so fucked up I dont even care I just want to sleep. I got pretty tired of the feeling and it just felt like I ate alot of cough medicine... Nasty. If I get the chance ill do it again, but I want fresh buttons, not the dry crap.</p>"
}
