{
 "title": "Feeling Good",
 "author": "Justin Timberlake",
 "citation": "   Justin Timberlake. \"Feeling Good: experience with 2C-T-2 (ID 19964)\". Erowid.org. Dec 27, 2002. erowid.org/exp/19964",
 "substance": "2C-T-2",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19964",
   "Male",
   " ",
   "Not Given",
   "Dec 27, 2002",
   "Views: 8764",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA friend of mine is fluent in the psychedelic-internet scene and suggested that I should post my experiance with 2ct2 which occured thanks to him. My real interest is in mescaline and this is due to me being an anthropology student. Professors have often spoken about the effects of peyote cactus and their importance in central american shamanish. When my friend told me that the effects of 2ct2 were similar to mescaline it created an interest in trying 2ct2.</p><p>The original plan was to go with 20mg but not being someone who experiments with chemicals on a regular basis I chose to do 10mg. The dose was taken orally and washed down with some mountain dew.  The only negative effect at this point was the taste of the 2ct2. It was just plain horrible. Though my friend said that he's had much worse tasting things then the 2ct2, I find it hard to believe. So if you've never taken it and don't have a lot of experiance be aware that this stuff tastes awful.</p><p>We watched Judge Judy and then the Simpsons. It was during the Simpsons, or about 45 minutes in, that I started to feel some effects. The blinking lights on my dsl modem were very plesant and appealing. Also a general euphoria seemed to hit me and put me into a good mood.</p><p>After watching tv we played 2 games of 7 minute quarter NFL 2K3 on the xbox. During this time I felt nothing out of the ordinary. Though my mood was quite jovial and I was enjoying myself quite a bit. Though the fact that I won both games may have something to do with it.</p><p>My body in general felt good though at times a muscle, though not my entire body, would feel a bit sore like it had been worked out and my toungue had a feeling similar to a cramp for a short period of time.</p><p>As my friend was about to leave we exchanged pleasantries and I noticed that my speech had been mildly altered from normal. I found myself stumbling over a few words though it only occured a few times as we were speaking. </p><p>A few hours later I suddenly felt quite cold and had to turn up the heat and put on a sweater. I also noticed that when playing NFL 2K3 the game seemed to be going at a quicker pace then what I remebered it being earlier in the day.</p><p>Overall the experiance was quite pleasant and enjoyable. Though if I was to use 2ct2 again I would probably use a higher dosage as the effects, while good, were not of that great of an impact.</p>"
}
