{
 "title": "A Tease At This Dosage",
 "author": "Scroumf",
 "citation": "   Scroumf. \"A Tease At This Dosage: experience with 2C-T-2 (ID 19970)\". Erowid.org. Dec 27, 2002. erowid.org/exp/19970",
 "substance": "2C-T-2",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19970",
   "Male",
   " ",
   "Not Given",
   "Dec 27, 2002",
   "9237",
   " "
  ]
 ],
 "report": "<p>\nIt tasted bitter.  Not as bitter as some ecstasy tablets Ive had in the past, a kind of similar taste though, less acidic though.</p><p>First alerts were a nice body feeling, remarkably similar to MDMA.  This was turned up a notch by touch or by stretching.</p><p>I experienced very minimal side effects.  There was some extra burping, no real stomach issues, a little bit of muscle weirdness (no eye wiggles or jaw clenching or anything).  There was also quite a powerful appetite suppression effect.</p><p>There was a definite increased appreciation of music, some minor visuals.  I was very awake.  Strangely, my mindset seemed practically sober, I never once forgot what I was talking about it mid-sentence or anything like that, very on-the-ball.  I may have been slightly more talkative and energetic than usual, but thats about it.  </p><p>I enjoyed it, though it was not much of a psychedelic, mind expanding time, at 10mg anyways.  This seemed about as mind-blowing as a six of beer.  Id call it a feel good hallucinogen (hallucinogen in the most visual/non-mental sense of the word).  There was no really auditory or other senses affected, except maybe my sense of taste, it may have been slightly heightened.</p><p>I could have easily handled this in public, or even around my parents or friends, and they would have had no idea.</p><p>Although it was very enjoyable, it seemed to be almost a tease at this dosage.  I would love to see what 15 or 20mg is like.  On the Shulgin Scale Id rate this trip as a +1 for the most part, +2 around the peak time.  </p><p>I did it at 4pm today.  I came down around 10pm.  I feel 100% sober.  I dont feel sketchy at all.  I am however, noticeably more tired than I usually am at this time of night, my leg muscles are a little sore, but I have done a lot of walking today.  The next day I was fine.</p>"
}
