{
 "title": "Personality Alterations",
 "author": "Dr. Smooth",
 "citation": "   Dr. Smooth. \"Personality Alterations: experience with DMAE (ID 19973)\". Erowid.org. Dec 29, 2002. erowid.org/exp/19973",
 "substance": "DMAE",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  tablets",
   "oral",
   "DMAE",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19973",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 29, 2002",
   "Views: 44169",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I tried DMAE briefly a couple years ago but seemed to get no real benefits and some nasty headaches.</p><p>I tried it again this year, and stuck with it, and have been greatly impressed. While there is a nice stimulation that comes from it when first trying it, the curious factor is that it slowly builds up in my system.  At this point (6 weeks of almost daily ingestion of 80-140 mg) I always feel more or less, stimulated. This is in a way, troubling, but it is so pleasant I have no intention of stopping.</p><p>Yet this is certainly not anything like amphetamines.  I'll go for hours without realizing I'm being affected, I am complete control of myself and while I am predilected toward activity and jabbering, I can certainly sit still and focus, even do nothing, which is difficult on speed.</p><p>Whether or not I'm addicted is hazy, I suppose.  I don't think there would be any negatives of quitting, except the inevitable crash that must come and a return to my pre-DMAE attitude.  I am not eager to test this, however.</p><p>My mood has become incredibly brightened and my mind feels much more alert.  I've become much more motivated and willing to do much more labor, mental or physical. One semi-objective note, my chess game is improved _dramatically_ for about an hour or two following my morning consumption.  </p><p>Still, I think this is more of a mood drug' rather than a more narrowly defined smart drug.  This has personality changes unrelated to simply increased intelligence.'  I do not think my raw intelligence is increasing, but rather my attentiveness to, and engagement with, the world is what would cause higher objective tests.  </p><p>It definitely has a sort of generalized body high as well.  Much more 'fluidic' than speed.  I read somewhere that it is supposed to increase muscle definition.  This appears to be true in that, though I've been exercising more (I have to, or else I burn holes in the carpet) even muscles I don't think I'm working seem to be in a _bit_ better shape.  No cheap way out of earning muscle, though. </p><p>Insomnia is something of a problem, in that I can't force' myself to go to bed, no matter how relaxed I try and make myself, pseudo-meditative breathing exercises or what have you, but when I _am_ actually tired, I fall to sleep quickly.  Naps don't really happen anymore.  Also waking up much more quickly than before using this substance.  Increased dryness of the nasal membranes, though not painfully or seemingly dangerously.</p><p>While not speedy, too much of it will overstimulate me.  this now has been one of the problems, forcing myself to buckle down and pay attention to doing one thing, instead of trying to do three things. </p><p>Still its a welcome change from the apathy I characteristically indulge in. Taking too much also gives me a dull, persistent headache, which is why I quit earlier.  Reducing the usage usually rids me of these, though even a little too much starts to give me a 'dullness.'  Just a sort of vague 'dirtiness' in the brain.  </p><p>Still, the headaches do seem to pass pretty quickly.  I am unsure as to the cause of these, though they were initially unsettling and caused me to abstain for a few days, and then restart at a lower dose, probably ~50 or 60mg, and worked my way up to at least 80, maybe twice a day, with a bit smaller dose later in the afternoon, rather than over 100 all at once, which is how the supplement is suggested.    </p><p>I also think it contributes to some measure with gingko to thin the blood, when I get cuts shaving it takes a bit longer to cease bleeding.  </p><p>Subtle though noticeable increase in libido, but perhaps this is just tied more toward more general energy.</p><p>All in all, I am beginning not even to think of this as a drug, but rather an improved mental existence.  It could be used as an occasional stimulant, but I prefer it as something like a mental tonic.  </p><p>Except for the side-effects from too high doses, I am unaware of any.  Being a precursor to Acetylcholine, a key neurotransmitter, I doubt it is toxic in the least.  Still, anything that makes you feel this good has got to have a price, such is the nature of drugs, but so far it seems a angel's bargain.</p><p>If you're desirous of an enhancement of mood, energy and possibly some intelligence, and don't mind waiting the weeks for the full effect, enduring initial headaches and a vague muscular tension, and don't mind ingesting a substance daily and keeping it _constantly_ in your system, slowly changing your personality, then this is a drug worth trying.  </p><p>I will submit again when serious negatives arise or I willfully quit.</p><p>-Dr. Smooth</p>"
}
