{
 "title": "Panicky with Weird Feeling",
 "author": "Reach The Sky",
 "citation": "   Reach The Sky. \"Panicky with Weird Feeling: experience with LSD, Methylphenidate & Cannabis (ID 19993)\". Erowid.org. Nov 29, 2004. erowid.org/exp/19993",
 "substance": "LSD, Methylphenidate & Cannabis",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 1:30",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 2:15",
   "3 tablets",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   "  T+ 7:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 9:00",
   "100 mg",
   "oral",
   "Pharms - Trazodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 19993",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 29, 2004",
   "Views: 18522",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok Im about to describe my first and only bad trip. It happened on xmas</p><p>when I got ahold of 2 hits of LSD, Im used to tripping alone so I didn't</p><p>care if none of my friends could get out of their home on xmas, I could</p><p>handle this easily....I thought.</p><p>At 7:45 pm I decide to swallow the 2 hits, then proceeded to smoke some pot</p><p>and just generally chill out.</p><p>T+ 1:30 The trip isn't getting very strong so I decide to smoke some more</p><p>weed, the acid is finally coming up. Some nice red trailers, colors being</p><p>brighter etc. I was thinking this wasn't the best cid I ever had though, no</p><p>real intensity, some slight jolts down the spine.</p><p>T+2:15 10 pm, I am high, no doubt, but out of nowhere, I start getting</p><p>sleepy! This was really weird to me, how can you be sleepy on acid, anyway,</p><p>I crushed 3 Ritalins and snorted them, thinking it would just wake me up,</p><p>but that wasn't anything near the truth.</p><p>T+ 3:00  Visuals got stronger, I was happy, gigglin alone while watching the simpsons. Looked promising.</p><p>T+3:30 My parents get home early from their xmas party! I am very annoyed by this for a few minutes then didn't mind it anymore, I got very paranoid they would notice I was seriously looking higher than anything pot could have done. They went to bed, but that's when the bad trip started.</p><p>T+4:00 Visuals getting crazy, at this point, my memories are getting hazy, I remember walking around the house, not quite knowing what to do, sometimes staring blankly, I started feeling weird inside my head an body.</p><p>T+7:00 My condition deteriorated, visuals faded away to be replaced by a</p><p>general feeling of sickness and depression, I smoked some more pot, thinking it would alleviate the way I felt, but to no avail, I started feeling panicky, I got scared of my cat for no reason, thinking it looked at me with contempt. The paranoia was getting out of hand, I didn't know for sure if I was breathing correctly, I felt like my heart would stop, I had a very bad pressure below my left foot and inside my right hand.</p><p>T+9:00 I had enough, I swallowed 100 mg of trazodone with some cereal and</p><p>went to bed, my pupils got back to normal real quick and I rapidly fell into sleep.</p><p>I woke up at 11 am feeling weird still, smoking some pot made the bad</p><p>feeling come back a little, but it went away later in the day. This story</p><p>really confuses me, was it the ritalin ? was it because my parents got home</p><p>earlier than supposed ? was the paranoia caused by the mixture of ritalin</p><p>and lsd? the only other time I was paranoid on acid was my second trip with it, and in no way was it THAT bad. I feel a bit depressed since, and generally tired, seems like this experience really wore me off. Might I recommend not mixing these 2 substances.</p>"
}
