{
 "title": "Euphorica Small High",
 "author": "N/A",
 "citation": "   N/A. \"Euphorica Small High: experience with Anadenanthera colubrina (ID 20008)\". Erowid.org. Dec 29, 2002. erowid.org/exp/20008",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "14 kg",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "insufflated",
   "Anadenanthera colubrina",
   "(ground / crushed)",
   " ",
   "6 seeds",
   "smoked",
   "Anadenanthera colubrina",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20008",
   "Male",
   " ",
   "Not Given",
   "Dec 29, 2002",
   "16735",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Preparation.</p><p>With guidence of other past experiences read online, i thought i'd give this a try to relieve my bordem! I heated around about 10 seeds, which was around 4g's, in a pan, in a way that I would cook popcorn. Other experiences stated to mix the seeds with either baking soda or either lime powder. This has been stated to enhance the effects. Anyway, i didnt have either. So i cooked and crushed my seeds into the finest, dryest powder that i could manage and snuffed them straight, in lines. I made four lines, each consisted of aound 2 seeds each. The rest i smoked straight after i had finished the snuff.</p><p>Experience</p><p>I was very surprised at the effects of this, although i cant say that it is as good as any chemical rush that ive had before but i certainly got a rush. These are the feelings that i got from the snuff:</p><p>Euphoria, not as much as ecstacy but simliar to that of a good session on cannabis with out the heavy headiness. Hyper-activity and sensitivity. I wanted to go walk and talk to people. The trip lasted around about an hour and a half, it was pleasantly surprising and nice.</p><p>Downside to this was the taste and smell. The stuff stinks and to be honest with you and dont think id do it again just because of this. Maybe that describes the trip? It tastes horrible to snuff and to smoke.</p>"
}
