{
 "title": "Visions of Blood and Warriors",
 "author": "Michael",
 "citation": "   Michael. \"Visions of Blood and Warriors: experience with LSD (ID 2001)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2001",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2001",
   "Male",
   " ",
   "Not Given",
   "Jun 21, 2000",
   "Views: 4575",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>LSD is the most amazing physocactive wonder in the entire world. It is a marvel that helps me and many other create a world in there mind that is different from the outside world and one that one can live out all there dreams and nightmares for that matter. </p><p>I had one of the most wonderful experiances of my life on the wonderful drug of LSD. My dosage was 5 liquid hits and I am at shame to admit my age of only 15 years old with such strong drug experiances. Me and a friend of mine named D. Bought 4 sugar cubes two for each of us. My friend in the car put 5 liquid hits on two cubes (2 on one, 3 on the other) at 12:45 AM. I went home and immediately me and D. dosed all of the hits. </p><p>It was a over an hour before I started to take any notice and I didn't even take notice until after smoking a boul out of 'big red' properley titled because of it size and after my favorite football team the Nebraska Cornhuskers. Then we went upstairs and started playing a multi-player game on my Nintendo 64 and then it started to begin. </p><p>I had the most intense feeling to kill everyone in the game. I started shooting anyone and everyone while watching light spectrums on the big screen zooming in and out. I saw tracers fly past every bullet. My heart pounded. After about 25 more mintues I started my very long peak. At which point things got very interesting. </p><p>This is 100% fact and is in no way shape or form made up. It began with seeing players from the game in the house. I was starting to feel as if I was in the game and I had a gun of my own. I then without any reason at all stuck my face to the tv and for about an hour I thought I was in the game. My friend D. told me I was sitting the whole time but in my mind I would fly around corners shooting my bullets with tracers golare. </p><p>When I got hit with a bullet I could almost feel it in my body. I started to get upset and started to go insane. Running all over the map shooting anyone and everyone who opposed me. I begain screaming wildly. I remember once I was being chased so bad I aimed the gun at my head and pulled the trigger four times. Each time I could feel the bullet pierce my skin but when I checked nothing had happened. I turned around fell over and began to throw up humungous chunks. I thought I was dying in real life or at least something bad was going to happen. I came down to my computer and wrote the following lines.</p><p>'As I sit here I feel as if I am going insane. I see visions of blood, god, warriors and war. I cannot escape it and I fear I will be in this world for the rest of my physcotic life'</p><p>I know not all what I went through. I have been through very much for my age. In my opinion, LSD is the drug that will help anyone deal with anything.</p>"
}
