{
 "title": "Bad Experience Mixing with Effexor",
 "author": "DieselGirl",
 "citation": "   DieselGirl. \"Bad Experience Mixing with Effexor: experience with 5-Meo-DiPT & Effexor XR (ID 20055)\". Erowid.org. Jan 24, 2003. erowid.org/exp/20055",
 "substance": "5-Meo-DiPT & Effexor XR",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)",
   " ",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20055",
   "Female",
   " ",
   "Not Given",
   "Jan 24, 2003",
   "21879",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAt the time of my experience I had been taking 150mg of Effexor daily for about four months as treatment for panic disorder.  One other person took the foxy with me, my best friend who was taking no meds at the time.  It started out a lot like an acid trip for both me and my friend (in terms of visuals and mind set), we started noticing the effects at about the same time (T +30 min).  This was accompanied with a lot of nausea.  After about 90 min. I don't remember anything that happened, things were getting more and more intense and my conciousness started to disappear...it's really difficult to describe. My memories from the experience are choppy and similar in quality to memories from a dream.</p><p>Since my best friend was with me and did not experience this effect, she was able to take care of me and fill in for my choppy memories of the experience (which lasted for about five hours).  She said that I didn't really converse with her or respond to my outside environment very much.  I was more in my own world in my head and kept saying random things over and over, one of which was the word cynical.  The one effect I have left over from the trip is that I repeated the word cynical so much that it no longer makes any sense to me as a word!</p><p>Another thing my friend told me about how I behaved is that I had no inhibitions at all, I sat down on a street corner and urinated with no regrets at the time.  After that incident she decided she should take me home, where I ran amuck in my own apartment.  The casualties from my apartment include my toaster and a package of ramen noodles that I decided would be fun to throw around.</p><p>So, my antics during this trip were completely unlike me and lasted quite a while.  I can only assume that my experience was a result of mixing the Foxy with my Effexor, since my friend took the same thing and had no trouble pulling herself together to take care of me.  It wasn't a very fun experience for me since I only remember the first 90 minutes of it, and it wasn't fun for my friend since she had to keep me out of trouble for about five hours.  In short, I highly recommend either not taking foxy at all while on an SSRI or weaning yourself off of your meds before you do because the two don't mix well.</p>"
}
