{
 "title": "New Year's Eve Cocktail",
 "author": "§moke",
 "citation": "Citation:   §moke. \"New Year's Eve Cocktail: experience with Salvia divinorum (extract), Mushrooms, Cocaine,  Alcohol, Cannabis, Hash & Hydrocodone (ID 20088)\". Erowid.org. Oct 13, 2004. erowid.org/exp/20088",
 "substance": "Salvia divinorum (extract), Mushrooms, Cocaine,  Alcohol, Cannabis, Hash & Hydrocodone",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 1:45",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:35",
   "7.5 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 5:10",
   "1 ",
   "oral",
   "Mushrooms",
   "(cookie / food)",
   " ",
   "  ",
   "sublingual",
   "Salvia divinorum",
   "(extract)",
   "  T+ 5:30",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "  ",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)",
   "  T+ 7:00",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 20088",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 13, 2004",
   "Views: 9592",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPrelude: I had previously tried a very minimal amount of both the 5x and the liquid salvia extract to make sure it was ok to give to someone else. In my test I found the liquid extract was made with everclear and burned very much and tasted very foul. So after a few days of thought my wife suggested I use sugar cubes. So I placed roughly 1 and 1/2 droppers on each sugar cube and allowed 4 sugar cubes a person.\r\nNew Years Eve 2002: My pregnant wife and I decide to stay home and entertain a very few of our closest friends. It came to a total of five people, four of us intoxicated to some degree and my wife being the totally sober sitter. I was planning on eating a chocolate bar that was made with mushroom tea extract and a few whole mushrooms so I ate light all day, mainly pudding and crackers. I started to drink grey goose vodka and orange juice around five o'clock. Guests started arriving around...\r\n6:45-   My friend 'Bob' arrives, with a pork roast and hot dogs and sauerkraut in hand. He sat down and cut me a nice line of some fairly pure cocaine. The taste was good, fair quality but high purity. Nice clean, jitter free, crystal clear high. That rode me all the way until 10:30 pm. We then retired to my family room and sat in front of the fire listening to some alternative cd's and smoked a nice healthy joint of some great resin filled sative/indica I had bought.\r\n7:35-  My friend 'Kate' and her boyfriend 'Wally' finally arrive. Kate is drinking screwdrivers and Wally is drinking MGD. We all take a Lortab 7.5 to take the edge off and relax us for our first exploration into salvia. We kick back and drink a little, smoke 2 bowls of pot and talk alot until...\r\n10:10-  I figure it's time to eat the chocolate shroom bar I acuired for this occasion. So I chew thoroughly and swallow. Now I ask if Kate and Wally are ready to try the salvia. I crushed one cube for Kate and 2 cubes for Wally and 3 cubes for myself. We all placed them under our tongues. after a minute Wally took another crushed cube totalling 3 cubes for him and I took another totalling 4 for me.\r\n10:17-Wally's written description of the sugar cubes while holding them under his tongue was: It tastes foul, burns very little but there are still large chunks under my tongue. My mouth is watering this causes a gentle trickle of noxious fluid down the back of my throat.I feel woozy, there are still chunks remaining.\r\n10:20- After holding this foul sugar under our tongues for 10 minutes we swallowed and continued to play golf on Playstation 2. right around the 9 th hole my perception started to change. \r\n10:30- I can feel the salvia really grabbing hold and starting to twist my reality ever so slightly. The only lights on are the christmas tree the decorative lights on the mantle, the tv and a fire but it seems to be as vivid and bright as a sunny day. I'm not hallucinating but I seem to be looking as if I were one step back from reality looking through the eyes in my mask. Then I feel the shrooms start to trickle in. The light little tickle in the throat and the butterfly's in the stomach. We throw about 2.5 grams of 5x into a large bowl for my hooka and take massive hits off of the 2 person hooka. We each took about 3 large hits and killed most of it. Now my focus on the golf game changed suddenly and I found there was no focus, my mind wandered, drifting pleasantly, floating, then snapped back to a blurred reality by Wally to take my shot,drifting closing my eyes and seeing the brillant colors burn through my eylids and flutter around, feeling the bass as a cd I burned plays on the stereo, it's melodic acoustical, live and rare recordings that I found and put together. The song was Metallica. \r\nMy vision started to shift, sliding to the right and snapping back. At this point I can no longer concentrate on the golf, I am in full grips of both the salvia and the shrooms. Wally, Kate and myself find ourselves in uncontrollable laughter, Wally continually talks but to my dismay the words he speaks are jarbled and not words to me at all but mere fractions of what seem to be words (he later explained he was trying to talk but it was as if the sentances passed before his eyes and only managed to speak aloud parts of about one word each sentance). I am puzzled by this for what seems like hours but is merely minutes. Then my mind is shifted again and now it seems as if I'm 2 steps behind reality and my sight path looks like a television half way across a completely black room but the reception is blurry and keeps shifting and twisting to one side then snapping back to center only to twist and contort the other direction. \r\nMy high started to level out and I was thoroughly relaxed so we decided to smoke some hash. My movement over to the couch was very laborious and seemed to take forever. My limbs were hard to move since they responded 2 steps behind my commands and were clumsy when they did move. The hash resin is sweet, smooth and very powerful. It mellows me even further and adds a very clear surreal effect to the trip. The hash oil adds an almost filtered effect to the buzz.\r\n11:45- We start to get ready for the toast and I am starting to see trails, I am at full peak of both of my trips at the same time. They are two very differant buzzes and they compliment each other very well. The salvia is very powerful but not in an intense way, it is more of a gentle persuasion and concentrated mainly in a mental trip, and the mushrooms are a very mellow buzz while being more visual and physical then a  mental trip. \r\n11:52: Time is moving twice as fast as I'm registering it. I struggle to open the champagne everyone is rushing around and moving and yet I can't concentrate long enough to figure out what they are doing. All of a sudden it's\r\n11:59.45- I am just finishing pouring, where did the time go. we toast to the new year, the champagne spills, I clean it up. Slowly  I come back alittle. \r\n12:30- Then another intense wave came and I was carried away again laughing uncontrollably and not quite in tune with everyone else. I was interacting to the best of my knowledge but not sure how this was being done. I was about 4 steps removed from reality now and it was affecting every part of me. My hearing was fuzzy my vision contorted and my body tingling and pulsing constantly. I was loving every minute of it.\r\n1:00 The ride down is gentle and I help it along by smoking a few more bowls of cannabis with my friends. I am still tripping but able to function and communicate. \r\nI didn't use my salvia trip to look for answers like most people, I took it as a vacation from my everyday pressures and followed the ride and let it show me what there was to see rather then looking for what I wanted to see. I had done alot of research into the combination of the drugs I took and research on each of them alone. I respect these plants and drugs as you should.\n\n\n"
}