{
 "title": "Melting Into the Bed",
 "author": "TeeVeeEye",
 "citation": "   TeeVeeEye. \"Melting Into the Bed: experience with Salivia divinorum (ID 20142)\". Erowid.org. Jan 3, 2003. erowid.org/exp/20142",
 "substance": "Salivia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "  T+ 0:45",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "20142",
   "Male",
   " ",
   "Not Given",
   "Jan 3, 2003",
   "16464",
   " "
  ]
 ],
 "report": "<p>Although I had never before tried Salvia I had read enough experience reports and talked to enough people that I was curious.  So on New Year's eve, after much debate, E and myself hung out at his house, played some cool music, and tried some of my 5x Salivia.</p><p>The Salvia came in a black leaf which smelled a bit like tea and had a similar consistency.  I sat down on the bed, filled my pipe about 1/3 full, and took it all in one big hit.  It really didn't do much to me, so after waiting about 5 minutes, I took another 1/3 hit.</p><p>Immediately after the second hit I could feel my heart starting to pulse.  I could feel sense it squeezing and the blood pumping through my chest into my extremities.  I lay down and waves of sensation passed over me, but the predominant feeling was mainly the mild physical discomfort in my chest.  At no time did I ever panic or feel like I was out of control.  I remained quite lucid and aware that I had taken a drug.  Overall it was similar to a bit of a sketchy acid trip though without the fear.</p><p>After about 5 minutes the main sensation wore off, and after 20 I really didn't feel much beyond the Pot I had smoked earlier.</p><p>My friend tried a similar dosage (2/3 of a small bowl).  He really didn't experience much and after 20 minutes declared it a dud.  At this stage, since neither of us had experienced the overwhelming sensations we were hoping for, so we decided to try one more hit with the promise that if that didn't do it we would try again some other time rather then continuing to take more.</p><p>I packed the pipe about 3/4 full this time and took it all in in one enormous breath.  As I put the pipe down I could feel my legs start to melt into the bed.  As I wiggled my feet I could feel waves of sensation travelling through my entire body.  I could feel my feet flowing into the blanket and over the edges of the bed.  My body felt fabulous, and I basically lay writhing in ecstasy while waves of sensation swept through me.</p><p>When the sensation started to fade I moved to the mirror and looked into it.  I could see myself from many different perspectives.  I looked old, with many wrinkles, and then young, with smoother skin.  Gaunt, and then handsome, and then, strangely surreal.  I could also conceptualize the actions in my life from multiple perspectives.  I could see how something I did would look absurd to somebody else, and then suddely how the same thing made sense.  Every time I'd look at an action I could take in my life I'd find ways it could be misinterpreted and have the opposite effect of what I wanted.  I realized that the best thing for me to do would be to do what I though was right without second guessing how people might misinterpret it.</p><p>The strongest sensations lasted about 10 minutes, with residual effects for 45 minutes.  The residual effects were brought on more strongly by smoking some Marijuana.  After about 45 minutes I really didn't feel anything beyond the pot stone.  My friend again got no effect from his second dose although he did report about 30 seconds of weird body load.</p>"
}
