{
 "title": "Stick to Legit, Illegal Drugs",
 "author": "Dandelion",
 "citation": "   Dandelion. \"Stick to Legit, Illegal Drugs: experience with Mandrake (ID 2015)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2015",
 "substance": "Mandrake",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mandrake",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "1994",
   "ID: 2015",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2000",
   "Views: 64131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently i had a day off from work and decided to spend it experimenting with mandrake root. Mandrake contains scopalamine, which is (along with atropine) also found in thorn apple/belladonna. both were commonly used in 'witches potions' to induce out of body experiences, so my plan was to try to leave my body. these drugs are known to cause some unpleasant (but, i thought, hallucinogenic) effects.</p><p>well, because a housemate had tried mandrake last year at a certain dosage with no effects noticable enough to count, i decided to make a much stronger tea with it. it is mind-bogglingly bitter, and because i mixed moleasses with it for sweetness, the tastes are associated for me and i can't stand even the smell of molasses anymore. i made about 1.5-2 pts of tea with around 6 tablespoons of mandrake. drank a bunch, nothing. drank another glass. felt some vague feelings, thought 'maybe it's coming on' and lay down to focus on it. it faded in around ten minutes so i drank more. i played tag like this with vague effects for a while, taking huge gulps in an attempt to get strong effects from it. eventually i quit, and went out for dinner. i felt no effects.</p><p>as soon as i ate a medium-sized meal, my stomach began to hurt. i lay in bed for a while, feeling like i had indigestion. well, that feeling turned into the most horrific drug experience i can even imagine having. it did not involve any alteration of consciousness except that caused by the waves of cold chills, the protracted vomiting fits which dredged up stuff i'd eaten 8 or more hours earlier, and the diaherria which shortly consisted solely of yellowish water. for close to 10 hours all i could do was lay shivering under tons o' quilts, crawl to the bathroom to puke up clots of fairly-well-digested food and quarts of water i'd been drinking to keep hydrated, and shit water. i almost had someone take me to the hospital, even knowing how barbaric they are there about drugs (they tried to help a friend who was freaking out on mushrooms and made the mistake of going there by interrogating her for almost an hour about where she got the shrooms)</p><p>eventually my girlfriend found a reference to mandrake which said it could be used as an emetic, a very powerful emetic, and not to use it since other less dangerous herbs give the same effects. they said, if you were driven for some reason to use it, to make a tea approx. 1/6 the strength of the one i'd made, and sip a tablespoon an hour for four hours. holy shit i drank about two pints of the shit!</p><p>moral of the story: stick to legit, illegal drugs.</p>"
}
