{
 "title": "Clear and Centered",
 "author": "Bug",
 "citation": "   Bug. \"Clear and Centered: experience with MDE (ID 2018)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2018",
 "substance": "MDE",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDE",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2018",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 21, 2000",
   "Views: 20718",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Okay, so we took some of what we were told was MDE, to mark the new year. We are mostly sure that it was in fact MDE, but it's difficult to be sure.</p><p>12:27 am (T+ 0) - We threw down. The tablets were diamond-shaped, fairly small, with brown specks. We were expecting a chance to welcome the new year, and to get a chance to enjoy each other's company in our first on-on-one empathogenic experience.</p><p>1:20 am (T+ :53) - 'Definitely coming up, feeling cold extremities, feeling like i want to stretch a lot.... kind of like a double latte'</p><p>1:42 am (T+ 1:15) - Jittery, definitely on.</p><p>2:15 am (T+ 1:48) - More in the basin, definitely E-ish, lit incense smells good, spool (by Jhno) sounds nice. Grooving.</p><p>3:30 (T+ 3:03) Still feeling waves of new energy, not really coming down. A bit speedy, not that verbal. Why didn't my companion get an effect? Very strange. Very centered-ish, like I don't NEED to do anything, and yet the idea of slowly strolling around appeals.</p><p>Later that night my companion decided to take a bath. Afterwards we retired to the bedroom, me still definitely on but coming over the peak. We lay awake in bed for at least two more hours before finally sleeping. </p><p>Throughout the next day I felt low-power flashes of the same energy as the previous night. Coffee helped re-kindle those, as it does with MDMA.</p><p>I felt throughout the entire experience a tightness in my neck and shoulder muscles. Not sore, but definitely tense. Even at +24 hours or so, they are still tight.</p><p>The down side is not near as draining as mdma. I feel fairly good, though our discovery of a burglary at our house has dampened my spirits slightly. I feel as if this would be far worse had I been emotionally exposed by MDMA.</p><p>This material is often described as more 'stoney' than MDMA, and with that I would agree. I spent most of my time just _zoning_ on a singular, Good feeling. I wasn't particularly chatty, though words came easily when I needed them. I was not WAY UP, but still felt clear, centered, and connected.</p>"
}
