{
 "title": "Holiness, Properness & Good Living",
 "author": "Mescalito",
 "citation": "   Mescalito. \"Holiness, Properness & Good Living: experience with Peyote (powder, chunky tea) (ID 20187)\". Erowid.org. Feb 26, 2004. erowid.org/exp/20187",
 "substance": "Peyote (powder, chunky tea)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "20 buttons",
   "oral",
   "Peyote",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "20187",
   "Male",
   " ",
   "Not Given",
   "Feb 26, 2004",
   "Views: 17574",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just wanted to submit my last submission that I will be making about this medicine.  There was a cermony conducted at my grandfathers home.  The night started around 11 pm with tabacco, cedar and praying.  This is the real native ceremony I can't go into detail about what goes on in this meeting because it is so sacred and holy I'd hate to reveal sacred aspects.  The medicine works on each individual when you are ready, you must have a sincere and open heart.  You eat the medicine and pray, you then can see with the eyes of the great spirit peyote god.  First of all to see, you must live in a holy way, talk and walk in harmony with yourself and mother nature.  This holy medicine will allow you to see all that is possible all that you can do to improve your very own well being.  How to become the best person ever, you must meet this half way, pray and work will get you what you need.  the first few times using this medicine will be a time of cleansing, and purification, vomiting is common at this time.  </p><p>Later, with good stamina, and patience mescalito will bless you with a good strong connection to your very own heart.  You can see what is really bothering yourself, you can fix it, by connecting and thinking with your heart doing all things with your heart in mind allows for great balance along your path of life.  With just the right amount the holy spirits can be seen and felt all around you.  With the right songs and prayers, the ceremony comes alive and blesses you.  you see vivid imagery, real dreams, thoughts come alive, your prayers vibrate and  become a part of the universe intantly.  I saw many holy people last night I was blessed to know that all will be ok in my life.  I speak with sincerety, I am done messing around with life, I will now be holy like the holy spirit medicine likes it.  I love this medicine, in the most reverent and holy way ever.  It is my life, my path, it is the morning star, the breath of life from heaven, it is my road of live, it is my life.  </p><p>Use this medicine in the most reverant way possible, and you too can be blessed, I promise you if you say the right prayer to bring peyote in your life the proper way, than pray for it sincerely, and it will come.  I would not recommend that anyone use this medicine to trip for recreational use.  It is our holy medicine there are people willing to share it with you, peyote will answer your prayer.  </p><p>I wish the best for all those reading this I mean it in the nicest way, I don't wish to offend anyone, just recommend that it be used correctly.</p>"
}
