{
 "title": "Rediscovering My Mind",
 "author": "Cyclic",
 "citation": "   Cyclic. \"Rediscovering My Mind: experience with Cannabis (ID 20191)\". Erowid.org. Aug 31, 2007. erowid.org/exp/20191",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 20191",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 31, 2007",
   "Views: 3264",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As a kid and a pre-teen, and even during my early teenage years, I was highly creative, curious about the world, happy to hang out with friends, etc, but around age 15, for reasons I haven't fully figured out (extreme sleep deprivation may have played a part) my mind effectively shut down, I felt like I'd been lobotomized.  I was unable to write, which was my main creative outlet, or enjoy the things I read, as I no longer imagined or saw anything but ink on paper.  My friendships mostly evaporated; I was suicidal.  That was about 4 years ago and I'm no longer depressed.  I'm beginning to have a social life again.  But the workings of my mind still feel incredibly boring; my introspection from day to day is exactly the same; there's no imagination or daydreaming, just the physical world.</p><p>I'd tried weed 3 or 4 times before this one, but when there was an effect it hadn't been much; I'd simply felt completely numb (mentally) except for the time before this one, that is.  I'd baked in a car with my friend and his older brother and suddenly my thoughts had begun to unfold, leading to other thoughts and still others, a phenomenon that's probably ordinary for most people but that I hadn't experienced in years.  The ossified channels of brain pattern had been temporarily broken, the groove my thinking had been trapped in was breached.  This was incredibly cool, so it was mostly what I thought about: I was imagining a colorful neural model of my thought processes, the processes which were, of course, mostly concerned with generating the model.  Some ulta-recursive fun, but pretty narcissistic.</p><p>This time, I smoked on a whim with some guys I'd gone to middle school with, and hadn't seen much since, outside a party, at 3 AM.  5 minutes later, back inside, there was a complete shift in my inner state; I felt slightly surreal, sort of like I'd stayed up all night but without the fatigue.  I didn't actually hallucinate, but there was a feeling like the air was sparkling, evenly luminous.  I had a couple heart palpitations, which was kind of scary; for a few minutes I sat in the chair and paniked, trying to figure out whether I should get a piece of paper and write last thoughts or whether I was being a hypochondriac (the latter, obviously).</p><p>But I was thinking cool thoughts again.  I'd developed a bad habit, normally, of thinking in a sort of shorthand, without going through all the component chains of logic; now it was like the interal structure of every thought was laid bare; I was thinking in assembly code rather than C++, and parts of my brain that had been unused for years seemed to be coming back into play.  I blurted something I'd just figured to a friend of mine 'Eyelids evolved to keep stuff out of the eye!  That's why fish don't have eyelids!' my friend, who hadn't smoked, gave me a strange look.  I'd heard before that being stoned made things seem profound, but never appreciated why: the thought processes leading to conclusions might be equivalent to what they are normally, but on a low, component level, they're different.  I suppose that's not really an explanation, but it points in the right direction, I think.</p><p>In the car to the diner, I kept thinking cool thoughts.  For example, I decided that one the reasons people sometimes don't remember the experiences they have in altered states of consciousness is that the whole encoding system of the brain has been altered; neurons that normally are a part of one firing pattern are the part of another, and those responsible for memory are off doing something else.  I had a whole 4-D model of the situation in my brain, which I shifted 90 degrees so that time became one of the spacial dimensions and one of the spacial dimensions became time. But I found it impossible to have any kind of conversation with my friend, who was driving.  At one point, I was thinking up a reply to something interesting that I thought he'd said and lost my train of thought, and asked him to repeat the question, and it turned out that he'd just asked what I'd said.  Several times he told me he had no idea what I was talking about.</p><p>I can't remember the chain of reasoning, but I somehow became convinced that no two people could ever understand anything about each other, that empathy was an illusion and conversation consisted only of mutual misunderstanding.  I glanced over, and though I still felt like his friend, he seemed utterly mysterious to me, completely opaque, and I felt completely alone in the universe.  Sorry if that sounds melodramatic, but I can't think of another way to phrase it.</p><p>I'm looking forward to trying marijuana again, this time not at a party but with some friends who might be able to put the experience in perspective.  Though I don't like parts of the way being stoned feels (there's not much clarity, which I don't have enough of in the best of times) I love other parts of it (the free-flowing thoughts) and I'm going to try to get those things to permeate my normal thinking processes.  I feel less like a zombie now than two days ago, and more like myself, the way I was 5 years ago, and the best thing that could happen is for that to continue.  Also, I now appreciate Radiohead's recent albums. :)</p>"
}
