{
 "title": "Prevented a Bad Roll",
 "author": "Bunni",
 "citation": "   Bunni. \"Prevented a Bad Roll: experience with Yoga & MDMA (Ecstasy) (ID 20193)\". Erowid.org. Jun 13, 2007. erowid.org/exp/20193",
 "substance": "Yoga & MDMA (Ecstasy)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "161 mg",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 20193",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 13, 2007",
   "Views: 5331",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOne evening I took a 161 mg pill of MDMA with my boyfriend, and another couple. The setting was relaxing and comfortable, but I hadn't planned on taking the E, so I had a few issues running around inside of my head that I wasn't quite prepared to deal with in the presence of others (tension with my parents). But I had rolled before and read all the research about it, so I am pretty comfortable with the substance.<br>When I started to come down off the first pill, I decided I wanted to pop another pill. An hour later I started to get overwhelmed by the experience. I started to feel a bit panicky and tense. My jaw was clenched tightly and my back and stomach muscles were too tense. <br>When I said something to my friend, he suggested we do some basic yoga exercises. We sat down kind of crosslegged, with our hands to the side and did some deep breathing exercises. We breathed in for 3 seconds, thinking about stretching the back as far up as possible, held the breath in for a second or two and then slowly let it out. We did this for about 5 minutes and immediately I felt wonderful. <br>I unfortunately was not able to deal with my emotional problems that evening, I didn't want to bring other people down. But the pills did make it clear to me that I needed to stop ignoring my problems and through yoga, I understood that I would be able to mentally overcome these problems later.\n\n\n"
}
