{
 "title": "BC Bud Bomber",
 "author": "weeman",
 "citation": "   weeman. \"BC Bud Bomber: experience with Cannabis (ID 20221)\". Erowid.org. Oct 11, 2005. erowid.org/exp/20221",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 20221",
   "Male",
   " ",
   "Not Given",
   "Oct 11, 2005",
   "Views: 6221",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The winter of 2000 was by far the most crucial of my entire life. </p><p>I'm not sure why I started, maybe because of peer pressure, sheer boredom, but most likely because of the bullshit I was supposed to 'learn' in D.A.R.E. What I'm describing to you here is not my first time I smoked weed, because it didn't really do anything for me, but rather I'm describing the first time I got really high.</p><p>My friend called me up when his parents left the house and told me that the house was empty for half an hour. I roller-bladed over, (was 15 at the time and didn't have a ride), and quickly stumbled onto his back patio. He had already prepared a make-shift bong out of a 3-liter cranberry juice bottle. He pulled out his little baggy of sweet, fruity smelling weed, which must've had at least 4 grams in it, and proceeded to pack the bowl. He warned me that this was by far the strongest Sativa he had ever smoked. (Where we live, we're used to getting shitty mass-produced Mexican Indica, which gives you a body high but doesn't lift you up. This on the otherhand, was homegrown and had made it all the way from Vancouver,BC courtesy of a friend...and I believe was somehow related to Thai.) Anyway...We lit this monster bowl up and kept hitting it straight for about 5 minutes. By the time I had finished, I felt warm and tingly..a sensation I had felt with my previous experiences...but nothing could've prepared me for what was about to come. </p><p>I stood in this kid's living room with my roller blades strapped on and was talking to him about something I can't remember...when all of a sudden it felt like I had been inflated with helium. I felt like my head was hitting the ceiling and that I had left my friend a long long way down. This floating sensation was brought down by him slapping me. Apparently I had been ignoring him for quite some time. I began laughing histerically for a few minutes, and it made me feel so good. I finished talking to him, and told him that I had to leave before has parents came. He agreed, and I set out onto the street.</p><p>The journey home was by far the most mystical and enlightening trips I have ever had. My roller blades made me feel like I was floating even more. I was hallucinating mildly, but it was all pleasant. I could've been at 4 or 40,000 feet, I didn't know the difference. In my magical mystery land, time had slowed down to a near screeching halt. I recall thinking and feeling that the world was a beautiful place and that everyone was so nice and fragile. All I felt like doing, was making it mandatory for people to smoke a bowl of weed every morning to be put into a good mood. While I was high, I tackled difficult topics (ie. racism, war, meaning of life etc..), don't think for a second that I'm a hippy, but when I'm operating on a different level, I have perfectly logical thoughts pop into my head, that would never occur to me when I'm straight.</p><p>When I got home I put on some Bob Marley and danced for almost an hour. For some reason I thought that I was at his concert, and at certain moments, that I was in fact Bob Marley. I can confirm the powerful musical connection that weed gives. About an hour later when I was coming down, I went for dinner, and finished off the amazing trip with a good meal and a discussion with my family. </p><p>Never have I had any negative consequence come from it. I am close to a straight-A student in all AP classes, and am also an athlete. I don't encourage habitual use, but smoking a big fatty once in a while, will give me time to meditate and expand my understanding of my purpose here on earth. I have since smoked almost every weekend, and continue to enjoy the benefits of the sacred herb, without going to hell, moving onto any other drug, jumping out windows, funding terrorists, experiencing amotivational syndrome, or even a loss of memory.</p>"
}
