{
 "title": "The Puke Fest",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The Puke Fest: experience with Tramadol (Ultracet) (ID 20234)\". Erowid.org. Jun 23, 2007. erowid.org/exp/20234",
 "substance": "Tramadol (Ultracet)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "450 mg",
   "oral",
   "Pharms - Tramadol",
   "(liquid)",
   " ",
   "3.9 g",
   "oral",
   "Acetaminophen",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 20234",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 23, 2007",
   "Views: 7634",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: this person took 3.9 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]<br>Suddenly realizing I had easy access to a large quantity of ultracet tablets--which I suspected could be some fun to take--I decided to get a decent information on the stuff (as always) before consuming any.<br>The active ingredients in this pain killer are 37.5 mg tramadol hcl and 325 mg acetaminophen per tablet, so I found out what each one does.  Acetaminophen being the active substance in typical Tylenol, I wasn't looking forward to anything unusual from that. Deciding to pop my first pill (I'm more into natural and hallucinogenic-type drugs, not euphoria/feeling drugs of which I consider most prescription pills to fall under) solely for the purpose of finding this out for myself (why do certain people I know and numerous ordinary people enjoy using prescription medication?).  However, I also researched side effects/contraindications and discovered that acetaminophen can damage the liver in even moderately high doses (in certain extreme cases, above at least 4 g, sometimes 6, definitely 10), especially when taken with alcohol.<br>So around 11 in the morning I crush 5 pills to a fine white powder, slip it into a glass of water, swirl, and down the hatch it goes.  I'm not really expecting anything out of the ordinary, even though this is the first time I've ever abused a prescription pill or taken any opiate or non-opiate analgesic.  I'm thinking to myself pills are overrated while I wait for any effects to come on. I go out right after that to go walk the dog, and feel no different than usual a half hour later (I ate a light breakfast with orange juice about an hour ago at this point) except for maybe a slight increase in energy (I walk the dog a little further than usual) or more appreciation of him and a good mood which I'm thinking might get even better now that I should be feeling 'euphoria' any time soon. But I blame these on placebo effects and wait another half hour.<br>So now I pop in 'the big lebowski'--first time watching this one--and start thinking to myself these pills are bs, I'm not feeling anything. So I crush up 3 more pills about an hour and a half after having consumed my first dose as a 'booster', except for that fact that I don't think I'm boosting anything. Keep watching the movie and slowly realize I might be feeling a little different. Not much but just a slight body-fuck, nothing more than a good alcohol buzz would do though. Great, I crush up 2 more pills and take these the same way--I have to know what people taking this crap are supposed to feel I'm thinking to myself. Well, just kind of head fuzzy and body messed, somewhere in between being drunk and being high is the effect I experienced. At times I was unsteady and wobbly like being drunk, but without the visual impairment and the rest that comes with that.<br>But this lasted from about 2 in the afternoon to about 6 in the morning, so not bad time-wise if I want to get messed for a while, which is not something I really enjoy unless I know what I'm getting into and like the feeling, which I can't say about this drug.<br>Now to the side effects: thinking these drugs were overrated and having taken so many, for what was comparatively a low effect compared to just sparking up a good spliff--I got pretty decent side effects.  Around 7 or 8 in the evening I start to get slightly nauseous and things only get worse from there.  I try to puke, realizing that my high dose, even with such low positive effects, would still take its toll in the negative ways--but I just stay feeling real sick until I puke all naturally once in my toilet. About a half later, bam, 1, 2, 3 nice spews in a row in the toilet. Well, that was fun, at least I feel better now. Decide my little roll on this crap is over and slip into bed at 9. Wow did my bed feel good.<br>Slept solid and had some cool dreams, which I can't remember of course, and then woke up at six for some reason. Well, 9 hours of sleep is enough, but that was strange. Just felt real awake and ready to go (no more stomachaches or nausea), but having been doing much of anything since then till 2 in the afternoon the next day (right now). <br>And some of the side effects I read about here and other places came up in my situation. Couldn't ejaculate/reach orgasm, still slightly constipated, and have been itchy at times (nothing uncomfortable or annoying though), but urinating was not a problem. All in all I have to say I'm not going to repeat this experience.\n\n\n"
}
