{
 "title": "Third Times a Charm",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Third Times a Charm: experience with Tramadol (ID 20240)\". Erowid.org. Jul 27, 2005. erowid.org/exp/20240",
 "substance": "Tramadol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20240",
   "Male",
   " ",
   "Not Given",
   "Jul 27, 2005",
   "104211",
   " "
  ]
 ],
 "report": "<p>To begin, I have taken tramadol twice before (100 mg one time and 50 mg another). Both times I also consumed alcohol (5+ drinks) and smoked cannabis. I had terrible experiences, which was primarily characterized the following morning by excruciating headaches, nausea, and dysphoria. These are fairly common side effects (20-25% according to RXlist.com). So needless to say, I was reluctant to try it again. I decided to up the dosage, but refrain from drinking alcohol since Ive heard that it doesnt mix well.</p><p>At 6:00 pm, I consumed 150 mg of tramadol (3 - 50 mg pills). I felt no effects until approximately 7:30 (T+1.5 hrs), which did not peak until after 8:30 (T+2.5 hrs). This relatively slow onset may be a factor in why the drug is not a scheduled substance. Anyways, the subjective experience is hard to characterize. There is a clear similarity to opiates (Ive tried hydrocodone and codeine). However, the drugs tendency to affect NE and 5-HT leaves an interesting effect.</p><p>Physically, I have felt slightly suppressed breathing, and my knees occasionally shook, as though my muscles felt week. My ability to stand was affected, but I was not particularly uncoordinated.</p><p>Mentally, my thoughts were not nearly as scattered and inhibited as they are when I have used alcohol/cannabis. There was a mild euphoria, but there was also a feeling, strange yet mildly pleasant, which is very difficult to describe. No hallucinations, although visual perceptions were interfered with in some subtle way.</p><p>After smoking cannabis at 10:00 pm (T+4.0 hrs), I felt naturally more euphoric. At this point, I was pretty out of my head (much more so than if I had only smoked). For the most part, it was an enjoyable experience. After 11:00 or so, my jaw started to clench very tightly. After the marijuana began to subside, the after effects of the tramadol were present. Again, interesting and hard to describe. I slept lightly, awaking frequently in the night. However, I still felt well rested in the morning. When I did wake up throughout the night, I felt pleasant and relaxed. I had no trouble getting back to sleep. </p><p>I would not drink alcohol while using tramadol. I would smoke herb. I would not drive. I would also avoid taking it if I had serious/important matters to deal with the following day. Its a weird drug. Not mind altering, trippy, or emphatically euphoric, yet its interesting and might be worth trying.</p>"
}
