{
 "title": "An Acolyte's Assertions",
 "author": "Derek Sagan",
 "citation": "   Derek Sagan. \"An Acolyte's Assertions: experience with Ecstasy (ID 2026)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2026",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 2026",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 22, 2000",
   "Views: 3205",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wanted to share my ecstasy experiences so far and hopefully help someone else who is in a position I was in. The context is that I'm a mid-twenties male who just recently arrived at a new city and had found a group who was willing to take me in. I am a club man and the experiences involve the setting of being at either a club or an afterhours with this group.</p><p>I had bought two tabs through a friend and taken one before out at a club and not noticed anything. When I had bought the ecstasy it was the first time I had ever heard of the drug. We were out again next week again at a club and I took the other. This time I felt a little surge. Right when I was coming down off the little boost my friend asks me if I want another. Sure I say. This one's different, a poppy imprinted little orange pill. I take. I swallow.</p><p>Thirty or so minutes passes, totally not thinking about it and having a decent time, when - the rush hits. I mean the RUSH HITS. I felt like the world was opening up to me, I felt like my limbs were screaming out in celebration of life. During the peak I only stood there at the end of the dance floor ... and reveled. I reveled in how my skin felt, how my limbs floated, how incredibly sensuous the dancing bodies around me were. As I start to come down - I start to dance, and I sank into myself while knowing the world at the same time. I want the whole world to dance with me and in some ways it is. The club is closing and we have to go. As we exit it's just me and my friend walking to the car. I explode in excitement. I believe the exact language was something like, 'Oh my god. Oh my god this stuff is incredible!' I have a permanent smile for the rest of the night and I'm in rapture.</p><p>I have used ecstasy about eight or so times since then. I haven't had any real bad experiences all varying levels of really good to excellent but one more has to be mentioned. This was the night I did four tabs. Two were of the same as above and I took those first and was doing very well. I decided to buy another while I was out at the club.</p><p>If the first experience was a rush this was a freight train. My best likening is like that of having every cell of my body engage in a constant orgasm for about twenty minutes. The experience was so strong that I had to sit for the first few minutes and although I knew I was fine I also felt my heart mumbling about the new workload. After a few minutes I got up ... began to dance, and couldn't believe it was possible to feel this good. I took a fourth in halves when I started to come down a little because oh god I wanted nothing more for this high to continue but didn't feel anything. Anything more I should say I was still rolling incredibly hard. I was dancing in ecstasy while watching this gorgeous creature of a girl do the same in front of me. It was the most beautiful thing I had ever seen. She was a blonde haired goddess swaying to the trance around us. </p><p>An officer of the law decided to stop in and the party was busted. All I could say to my friend was 'after party after party.' I wanted to roll and roll and roll. Thank god there is a natural shut off point it seems or even my will power would be tested. However, I was still rolling the next day when I had to get on my flight and was doing little dancemoves down the terminal. I was still rolling when I woke up the next day and proceeded to turn on the house and trance. This was also an incredible time as I just thought and danced, thought and danced alone in my room. </p><p>Ecstasy has changed my life. My experiences with it have been the most pleasurable of my life. This is not to say they have been the best because there is nothing , or rather I should say there was nothing soul fullfilling about my nights, days and weekends with MDMA. But, it has been soul fullfilling in the way it has caused me to examine and live my life after. When I dance I think. Its like my body is in glory while my mind is too. I have carried over this into my everyday life. Since I have started doing x I have done as much research as I can on the little devil. My heart aches because of the fact that long term tolerance is so easily built up and I may be damaging my precious axons. This might be good though as otherwise I would worry about a state of depression a few years down the road from now when the last of my youth is gone - for an atheist its like god saying you get this many incredible times, enjoy. </p><p>One of the greatest things for me is that my experiences have been so strong that the imprinting has been I believe permanent on my brain. I spend hours a day listening to the house and trance music I have discovered and try to dance as much as possible. I know people would consider me some weird freak because I dance around half or completely naked in my room to my music (no drugs by the way) but I consider the alternative form of exercise that most people engage in stepping on the treadmill and turning their eyes to the t.v. above them at the gym a nightmare. Its like they drone their body into a monotony of abandonment while at the same time exiling their mind to the blips of sitcoms. I dance and I think. When I do it I feel like i'm living - I mean actually LIVING. I especially love those peaks in the music where its seems mind and body combine and just scream in ... perfectness.</p><p>Alright this has been pretty trippy I know. I just wanted to end of this long ass experience with a little bit about who I am. I was born pretty damn poor and have worked my ass off such that I'm set to graduate from one of the top ten medical schools in america next year. I'm the type of person who worked a second job to sent money to humanitain causes every month. I am utterly repulsed by the fact that I am considered 'a drugie' and someone who engages in felonies every now and then when I want to get a rush and dance for a night. As much as I love X its definetely not the end all in life - like everything its just one part - and it hasn't hurt me in my career. I don't intend to treat patients high no more than I would treat them drunk. I wish this society wouldn't force me to hide and be ashamed of the fact that yes I use some drugs. I know they do or might have certain damaging side effects I have read the research just like drugs I will be prescribing every day have risks and side effects. I am ... peeved ... and I want change God Damn it.</p><p>Hey if you read this far , wow. I had to vent and I had to celebrate my new little life friend and change. I grew up real conservative and couldn't believe the first time I saw a drug being used , 'bad people' (and some are no doubt but what group doesn't have em). My only advice is THINK FOR YOURSELF, take the time to do the research and make an educated non-propaganda decison. I do think everybody should do exstasy at least once to truly experience life but don't if its not you and if it is don't give up if you don't hit it the first time cause of whatever. If our brains are anything alike and my bio book says they are - it will.</p><p>To all my druggie buddies; don't let it take over your life - but please don't let the spirit of life die so that I'm the only one who wants to let loose (in lesser scale) after settling the kids to bet a decade down the road.</p>"
}
