{
 "title": "My First Time...Again and Again and Again",
 "author": "Anonymous",
 "citation": "   Anonymous. \"My First Time...Again and Again and Again: experience with Ecstasy (ID 2029)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2029",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "",
   "2029",
   "Female",
   " ",
   "Not Given",
   "Jun 22, 2000",
   "6532",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been wanting to experience the effects of X for a long time, but had been to scared to try it, had I only known what was to come, I never would have taken that pill...</p><p>The means by which I came across the dose is unimportant...so it will be left out...</p><p>I took the pill around 3 a.m. at a rave party... I was with a guy, and he sort of pressured me into it, I, fully knowing how hyper-sensative I am to all chemicals, took it anyway to avoid being a pussy for once in my life...at around 3:30 (an unusually short wait) My legs started to go numb, and when I stood up, my knees went so weak I couldn't move... or stop moving for that matter.</p><p>We immediately left the party because I was getting pretty fucked up... The ride home was filled with moans and groans of pleasure, accompanied by seizures, shakes, loss of memory and Lock Jaw and Oral fixations... I don't remember too much about it, because I kept passing out... I had enough sense to know that I was pretty bad off, but I wouldn't go to the hospital because of my mother...she would have killed me... I wouldn't let myself go to sleep, because I felt that if I did I would never wake up again... I kept asking my friend 'please don't let me fall asleep..' again and again, I kept forgetting that I had said that so I kept asking him like every 3 or 4 minutes... he was quite annoyed... but was so scared... my voice was starting to slur really bad.. there was a tingly wet feel to my head, still haven't figured that out yet. I couldn't understand a thing anyone was saying to me because everything sounded so distorted and I was hearing my heartbeating...everything was buzzing.</p><p>I finally fell asleep after my friend left my side the next day... I had the lock jaw for two days... I couldn't move too well, and lay around a lot for two days.. that is about it as far as I remember... There isn't much else to tell...thank you for giving me the opportunity to share my story... I didn't let this get in the way of my other um activities though, I just stay away from X now...</p>"
}
