{
 "title": "Preparation and Take-Off",
 "author": "Z_Hound",
 "citation": "Citation:   Z_Hound. \"Preparation and Take-Off: experience with DMT (ID 20293)\". Erowid.org. Jan 11, 2003. erowid.org/exp/20293",
 "substance": "DMT",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 20293",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 11, 2003",
   "Views: 59733",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAnd now, let me tell you a fairy tale about\r\nhyper-adventures of the Arrogant Japanese Lab Monkey (AJLaM)\r\non the dawn of informational singularity.\r\nAfter numerous failures with DMT synthesis, AJLaM finally gave up\r\nher ambitions and decided to extract from Mimosa Hostilis Root Bark (MRHB), like everyone else. \r\nI would like to mention that giving up the ambitions was hard, considering\r\nAJLaM has M.S. in organic chemistry, - needless to say, her precious ego\r\nwas hurt.\r\nObtaining DMT.\r\n1. MHRB, samples of 100 g were purchased on-line from three different sources.\r\n2. 100 g of MHRB was powdered in an electric coffe-grinder ( resulted in brown-purple powder + some small fibers)\r\n3. to the MHRB powder was added diluted hydrochloric acid (pH 1.1, 500 ml). The mix was left for 24 hrs at room T, and then boiled for 1hr. Powder was filtered through glass filter coated with a thin layer of sand, and then through N1 paper filter. Two more subsequent  \r\nextraction were performed in the same manner. Result - Dark-Red clear acidic solution, about 1200 ml total. This was simmered below boiling \r\nat weak vacuum (aspirator). Final volume ~500 mL.\r\n4. The acidic solution was placed into 1L separatory funnel following addition of 250 mL of warm hexanes. The funnel was shaked; and left for emulsions to resolve. The emulsion mostly cleared in 2 hrs, the remaining bubbles were poked with a copper wire. Aqeous layer was drained into original container, organic layer was discarded. This step was repeated 2 more times.\r\n5. The defatted acidic solution was basified via slow addition of solid NaOH , monitoring pH with an analog pH meter, and stirring with a magnetic stirrer. Around pH 6 the solution turned white-grey, at pH 11.6 the solution changed color to dark red/ black. pH was further increased to 12.2. Strong indole smell.\r\n6. The basified solution was extracted with hot hexanes three times -\r\ntook twice as long for emulsions to settle, compared to step 4.\r\nOrganic layers were collected and evaporated on a rotory vaporizer at 35 degrees C. To the yellow oily residue was added ~ 50 mL of hot hexanes, which were prior dried over CaCl2.\r\n7. The hexanes extraxt was poured onto a small pyrex dish and the\r\nsolvent was allowed to evaporate.\r\nWhite crystals were scraped with a razor.\r\nYields:\r\nSource 1 - 430 mg per 100 g of bark\r\nSource 2 - 620 mg per 100 g of bark\r\nSource 3 - 300 mg per 100 g of bark\r\nFinally, AJLaM had her precious elf-spice.\r\nshe loaded 100 mg of crystals into a glass pipe with a screen and some ash.\r\nAnxiously, she took 2 deep tokes.\r\nAnd.. SYMBIOTIC CRYSTALS .. all around. Always there, since the beginning. They had a lot to tell.\r\nAJLaM was instructed to convey the following information to all\r\nsentients in her reality:\r\nEndosymbiotic crystalls are the breathing essence of consiousness. They are the living builders of the universal MIND.\r\nThey have unique identities and funny names. \r\nTheir language is empathy-based. They can actually speak english ..\r\nVery friendly  toward anyone who wants to PLAY.\r\nTheir socitey is a self-organized dissipative structure -\r\ndriving force of novelty and creativity in the universe.\r\nHalleluia.\r\nAJLaM stepped onto a new path of spiritual evolution.\r\nMore to come.\n\n\n"
}