{
 "title": "Excellent",
 "author": "Psychetool",
 "citation": "Citation:   Psychetool. \"Excellent: experience with 2C-T-2 & Cannabis (ID 20296)\". Erowid.org. Aug 9, 2007. erowid.org/exp/20296",
 "substance": "2C-T-2 & Cannabis",
 "bodyweight": "260 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 0:30",
   "5.0 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 0:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:00",
   "5.0 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 1:30",
   "5.0 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 20296",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 9, 2007",
   "Views: 5115",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAn interesting night with 2-ct-2\r\n Level of experience - first experience with 2ct2. +3 effects noted.\r\n Chemical(s) - 2ct2\r\n Method of administration - Oral\r\n Dosage - 15-20mg\r\n Set  Happy, excited, nervous.\r\n Setting  Home, comfortable environment with some close friends.\r\n----------------\r\nThis was my first experiment with the elusive research chemical, 2ct2. I got it from a good friend who vouched for highest quality. Which I concur. The t2 came in a 32mg baggie, and is a tan color. Not a bad taste, similar to AMT but not nearly as bad. I didn't have a miligram scale on hand, so I decided to go slow and increase the dosage steadily. It was around 11pm when I took the first packet, a peice of rolling paper, in the middle was 3mg 2ct2. Friends were over and no effects were noticed by T+ 30min.\r\nT+30min I eat second packet. A peice of rolling paper, in the middle 5mg 2ct2. No effects noted as yet. Smoking some very high quality cannibus to ease into the trip. Nothing like some THC to help introduce a forign chemicle into your body.\r\nT+1 hours Third packet consumed. A peice of rolling paper, in the middle 5mg 2ct2. Still no effects noted, but a bit of pre-trip anxiety and chills. Feeling very relaxed and ready to ease in.\r\nT+1 1/2hours Fourth packet consumed. A peice of rolling paper, in the middle 5mg 2ct2. Slight effects are noticed, I cannot stop grinning. This feels a lot like LSD, but more enjoyable, more managable. Checked pupil dialation, giant, like quarters. It must be working it's magic. No visuals yet, but I can sense they are coming.\r\nT+ 2 hours Effects coming on nicely. Visual distortions on a lot of colors, music is very distinct. I put in the movie 'XXX' and smoke another bowl to get into the movie. This is really feeling like acid now, patterns shifting, it looks almost like there is a starscape on the blue walls of my room. This is incredible.\r\nT+ 3 hours Heavy effects, I'm really engrossed in the movie. Lots of visual disturbances in the movie, and all over my room. It's like my eyes see everything, but see EVERYTHING with visuals. The whole room is moving.\r\nT+ 4 hours Heavy effects still, I am in a semi-confused state. I am having lots of trouble working the PS2 and loading a new movie. It's like a journey just to find a DVD! Trippin my balls off still and loving every minute of it. I was originally worried about the stomach discomfert, I have felt very small pangs of pain in my lower abdomain, but nothing that painful or intense. Easily managable.\r\nT+ 5 hours Starting to get tired, it's 4AM and I'm still off the walls trippin with some giant eyeballs. Laying in bed under the covers produces many visuals and good feelings of contentment. \r\nT+ 7 hours Dead tired. I'm at the point of wanting to sleep but not being able to because of overwhelming visuals and feelings of euphoria. This is really nice, but I never thought It would go into 7 hours.\r\n-----------------------------------------------------------\r\nWoke up the next morning, muscle tension and jaw clenching is noted. A hot shower and a bowl of cannibus helps alleviate unwanted effects, and allow sleep to kick back in. A most interesting night indeed.\n\n\n"
}