{
 "title": "Time Travellers from Lost Atlantis",
 "author": "Gaseous Vertebrate",
 "citation": "Citation:   Gaseous Vertebrate. \"Time Travellers from Lost Atlantis: experience with Ecstasy (ID 2030)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2030",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2030",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 22, 2000",
   "Views: 3136",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHere's a little story that happened to me.\r\nSetting: a warm night, at home in my house I shared with my partner. Preparation: I had the ecstasy tablet for a couple of weeks, waiting to it felt right to take it. My intention was to have some kind of luminous spiritual experience, but other than that, the only mental preparation was spending some quiet, simple contemplative time with myself, relaxing and trying to clear my thoughts, before taking the ecstasy at sundown. \r\nDosage: one high quality ecstasy tablet.\r\nThis was a few ago now, and mid way though till then revealing uneventful but pleasant trip, spent, till this point, randomly contemplating the thoughts that arose. I was musing on my back verandah at the stars.\r\nSuddenly, I was faced with four entities, whom I could not see clearly, but nevertheless strongly sensed their presence. They were hovering before me at eye level.\r\nTelepathic interchange is notoriously difficult to translate into more mundane language, but here is a rough rendition of what transpired:\r\n'We are from Atlantis, and we have a message. The message is: You (meaning humans of the modern period) now have attained to knowledge and level of civilisation that we attained, prior to our destruction.\r\n'Specifically, your have reached an analogous level of technology, and an essentially identical cosmology.'\r\nI replied: 'How do I know you are who you say you are and that what you tell me is true?', having been entreated from an early age to always 'test the spirits'.\r\n'This is our proof: the theory of cosmology you call 'The Big Bang' we also had discovered. The proof of this is, that when we were destroyed, there were survivors, and our wisdom was imperfectly preserved and transmitted and this is what gave rise to the various religions and mystery schools.\r\n'For, in the Qabbalah's Tree of Life, is not Ain Soph Aur the pre-existent void, and Kether the singularity, and the tree itself a representation of inflation and the expansion of the singularity into the universe.\r\n'So also in China, the void that is beyond was called Tao, and singularity, Teh, and the inflation and expansion represented by the interplay of yin and yang.\r\n'And so for the other philosophies and mysteries: at their heart there is a conception of the nothingness before, singularity, and expansion into matter.\r\n'How did primitive humans know this but by us: before your history there was a civilisation with the technology, as you know have, to look out in space-time, and the mathematics to try and understand what we saw.\r\n'Therefore, you have been this way before. This is where we came ere we were destroyed. But wisdom lies beyond this, we do not know. That is for you and your time, if you don't destroy yourselves first.'\r\nAll this took only a few seconds, I imagine, and then they were gone. I went inside feeling as if I had been touched... by something...\n\n\n"
}