{
 "title": "Alignment of Mind, Spirit and Emotion",
 "author": "experience nature",
 "citation": "   experience nature. \"Alignment of Mind, Spirit and Emotion: experience with Salvia divinorum (ID 20328)\". Erowid.org. Jan 11, 2003. erowid.org/exp/20328",
 "substance": "Salvia divinorum",
 "bodyweight": "148 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 20328",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Jan 11, 2003",
   "Views: 9042",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis was not my first time to smoke Salvia and experience the divinity of its' life.  Previous experiences left me a bit baffled and were ineffable; however, after this experience I felt as though I could describe the whole experience and I felt more at peace with myself.</p><p>I loaded up a metal pipe about half way full of Salvia Divinorum.  I lit the bowl and inhaled a deep breath of smoke; I held the smoke in my lungs for 30-45 seconds.  I then exhaled and hit it again and held it in for the same amout of time.  The last hit I took off the pipe I slowly exhaled as I was projected into another world(if I may call it that)  My friend's voices sounded, 'Why are you blowing the smoke out so slowly?'...as I drifted into my internal state, away from my body...</p><p>I suddenly (within 45 seconds)became part of a whole generating system of minds and souls within this 'machine' that is all connected in a circuitry of all the minds or souls around.  Everything was black around me, but I felt connected and united completely.  As I drifted out of the experience, my friends were asking, 'How was it, what was it like?' I tried my best to explain, but I don't think they could comprehend.  The Salvia didn't affect them in the same ways whenever they smoked it the same night.  I heard that it worked very differently on everyone, and many of my friends that have tried it have all received different experiences from the sage.</p><p>As I came back to my concious mind, I felt as though my body had no place in the world.  It felt as though my emotional and spiritual centre of being in the middle of my chest had been united in this 'circle'  of unity.  My spiritual and emotional being seemed to be unified with my mind inside my head.  However, my physical head meant nothing to me; I felt as though it was just an exterior layer to the circuitry of the mind and spirit, which existed peacefully when aligned in unity.</p><p>After the short core part of the experience(about 20 seconds), I reflected on the experience for quite a while as I became increasingly more aware of my physical form and as my spirit and mind drifted apart.  The whole expereince(including reflection time)lasted about 30 minutes.  If you are using this in the presence of someone who shouldn't know that you are under the influence, then wait about 45 minutes before going to interact with them.  </p><p>This is a very powerful hallucinogen, please use wisely and with good, peaceful intentions.  Until next time, the peace and love align the world in beauty...</p>"
}
