{
 "title": "100% Love",
 "author": "Oldmanweed",
 "citation": "   Oldmanweed. \"100% Love: experience with Ecstasy (ID 2036)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2036",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 0:30",
   "  ",
   "oral",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2036",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 22, 2000",
   "Views: 9551",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'd done ecstacy once before. I was pestering my friend to score me some speed to keep me occupied on a long bus journey but he eventually persuaded me that E was a far better trip, without the rough edges. I found it a pleasureable experience but nothing worth raving about.<br>Two months later and me and my flatmates go along to a private ecstacy party in Leeds. We put in our orders for two pills each and arrange to pick them up at the party. I'm looking forward to my second sojourn into the land of MDMA but have my reservations, on a whole the vibe is expectant and upbeat.<br>We arrive to the sound of frantic hip hop and total strangers with unearthly huge smiles and dilated pupils warmly introducing themselves. Up three flights of stairs we are informed that there's only enough for one pill each. I was hoping for two as my last experience on only one was interesting but a bit too timid for my liking.<br>I pop the pill, grap a beer and sit down next to a friend. Five minutes later I feel a slight rush, my heartbeat is quicker, my palm's sweaty and colour is intensified. I feel restless and decide to go exploring. When I stand up my legs feel weightless, I am not so much descending the stairs as floating down them. In the living room the hip hop beats infuge themseves upon my mind, I am controlled by the music, a once withdrawn and painfully shy individual, I now find myself dancing with maniacal glee. The appearance of a friend causes a huge surge of love to overcome me, I throw my arms around him and we deal out sincere praises of one another, till exhausted, we slump in a corner and begin a continous stream of tripped out dialogue, very little of which I can remember.<br>What may under different drugs have transpired as a bring down merely serves as a superb rush as I find myself vomiting technicolour projections down the toilet. Concerned faces greet me upon exiting the toilet but the status report: 'Buzzing!' reassures everyone and once again hugs are passed around inbetween bursts of laughter.<br>Half an hour after having taken my pill, the MDMA powder arrives. A whole new plane of perception unravels itself immediately upon consumption. Barriers of reservation, constructed in the real world are swiftly knocked down as intense bonds are formed with people met five minutes ago. As evening closes in the manic euphoria is replaced with a calm one. I smile at a friend who's swiftly sinking into the sofa. Closing my eyes, a warm, red glow unfolds itself.<br>Voices fade until all that is left is silence. The red glow intensifies until I percieve my whole consciousness as becoming one with it. I feel love. I am love. 100%.<br>Somewhere from within my subconscious a voice cries out 'God is Love', I realise that I and god am one at this moment, both love and all notions of a merely external deity vanish forever. To say this is a high point in my life is a gross understatement. Mere words can not entirely convey that which is uncommunicable. MDMA is a drug that whilst not leading directly to enlightenment (and of course, it would be unfair to expect this from a synthetic drug) can open doors of awareness not only belonging to a social aspect, yet also to an intensly spiritual one.\n\n\n"
}
