{
 "title": "Been a Minute",
 "author": "Cinnamon Girl",
 "citation": "   Cinnamon Girl. \"Been a Minute: experience with Tramadol (Ultram) (ID 20378)\". Erowid.org. Jun 24, 2007. erowid.org/exp/20378",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "118 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20378",
   "Female",
   " ",
   "Not Given",
   "Jun 24, 2007",
   "3471",
   " "
  ]
 ],
 "report": "<p>I have been taking the non-opiate Ultram for the last year and one-half on a very low dose, maintenance-based program.  I can tell you as one who has loved hydrocodone and other opiates for their effects that this chemical combination has some winning attributes, for one, I can certainly function during the day while this low dose is in my system, and often do not need anything more than to snap one 50mg in half to take me through the day.  I do have legitimate lower back pain, so have obtained Ultram via the doc, but of course caught on to its recreational use fairly quickly.  Had some fun experiences and realized the stuff was here to stay, for me.</p><p>At a dose of 100 mg (2 50mg pills), I feel really good and even euphoric.  My husband is one of those who possesses a ton of serotonin, naturally (Mr Happy), and when he took one for some back pain recently he said, 'Wow - I can see how this could go either way for me', meaning he felt either really warm or really hostile, given the moment and the stimulus.  I think it affected him so immensely due to his incredible natural load of serotonin, he has stated he will not take it again unless it is right before bed (sleeps like a rock).</p><p>I persistently research this drug because I find it fascinating and for me, it works, even on a low dose, to improve the quality of my life.  On a higher dose, it gets me to a lovely high.  I have read others' claims of not being able to pee when necessary and I believe this did happen to me on a higher dose. I personally love this stuff and obviously others do too because refilling has become a big hassle, even for a low-dose person.</p>"
}
