{
 "title": "Visually and Auditorially Astounding",
 "author": "J",
 "citation": "   J. \"Visually and Auditorially Astounding: experience with 2C-T-2 (ID 20429)\". Erowid.org. Jan 19, 2003. erowid.org/exp/20429",
 "substance": "2C-T-2",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 9:00",
   "20 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 20429",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 19, 2003",
   "Views: 9966",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe night I decided to take 2CT2 for the first time I had been drinking heavily since about 3 in the afternoon. When I took the 20mg at around midnight I was already quite smashed. I didnt think that I would get much of a trip out of it ... I just assumed it would heighten my level of drunkenness a little ... But I was way off.\r\nShortly after I took it a few friends and I decided to take a walk outside ... I immediately began to feel more hyper but still somewhat drunk. When I got back inside I had the overwhelming urge to vomit. After clearing some junk out of my system I no longer felt drunk, just the beginnings of getting high. I had a good feeling come over me ... I picked a spot on the couch and planted myself there for a good 5 or 6 hours. At first there were just minor visuals; patterns and lines in the walls and floors ... a slight echoing of peoples voices.  Gradually these both increased ... to the point where I was seeing light beams circling the lamps... the tiles behind the fireplace were constantly changing shape and size... the woodchips turned into tiny creatures that were busy working creating shelters for themselves, the darker spots on the wood would multiply and dance around each other ... \r\nI've never experienced such intense visuals with any other drug and at first it was a bit overwhelming ... but I sat back and enjoyed the effects ... Wondering if anything I was seeing was real anymore ... There were no heavy thoughts going on ... Just wonderment at the surroundings that were all taking on a new life ... even the flowers in the blanket hanging over the chair where blooming and closing up again. \r\nIt became hard to keep up with peoples conversations. I became convinced that I was hearing peoples words after they had already said them. My boyfriend went to bed yet for 2 hours I still heard him talking to me. I heard laughter when everyone was silent and couldnt remember anything said past a 10 second span.\r\nHip hop seemed to be the only thing coming from the stereo... and not being the biggest fan ... I began to wonder if how I was hearing the music was actually how it sounded ... when I started to come down at around 6am I found it very difficult to sleep.  I decided to watch some movies and crack open some more booze to help me into slumber. It worked and about 3 drinks later at 11 am I finally dozed off. I was still tired when I woke up ... And exhausted all of the next day while I was at work.  But overall I enjoyed the experience and wouldnt hesitate to try it again...\n\n\n"
}
