{
 "title": "Breath In Breath Out",
 "author": "Skinny_Stoner",
 "citation": "   Skinny_Stoner. \"Breath In Breath Out: experience with Mushrooms (in Chocolate) (ID 20448)\". Erowid.org. Oct 13, 2004. erowid.org/exp/20448",
 "substance": "Mushrooms (in Chocolate)",
 "bodyweight": "128 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 20448",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 13, 2004",
   "Views: 5583",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been looking to try many diffrent types of mind altering substances for a very long time, since the new year of 2002 actually. I finnaly got my hands on some mushrooms that I was told were very very very powerful. They were prepared in chocolate that was molded into the form of a devil. The 3grams of shrooms had been ground up and added to the chocolate when poured into the mold. I was very anxious to try them as soon as possible since it had taken so long to get a hold of, the only problem was I had mid-terms the following day. I had a long talk with my friend S who assured me I would be well rested although not perticulartly crisp for the following day. Now the next problem, my parents were still home. Well I decided that I was going to take them anyway and just lock myself in my room until my mom went to sleep upstairs. So at around 8 o clock, I called S and grabbed soem O.J. I ran into my bathroom and quickly devoured the entire piece of chocolate. It was now a waiting game. </p><p>It was now 830 and a calm mood had taken over the room, at this point I was just hanging out at my computer in my room listening to Dark Side of the Moon by who else? Floyd, (they would after this experiance be the band of choice for the rest of the night). I called S back and told him I was going to go enjoy the mild stoned effect that was induced on my mind right now, he had tripped before so he knew what I was going through and suggested I listen to the wall and just chill out for a while. I hung up and went to the computer to turn on my downloaded version of the 2 disked 'the wall'. At about 845 I noticed the background of my computer (an acid blotter of tim leary's profile made out of musical notes) had started to pulsate, not so much just constant pulses but more of a breathing motion. I then noticed that the musical notes began to meld in to one and followed the rythmic pattern of the wall. I decided this was the begining and strapped in for a ride of my life. I got up for another glass of O.J. and as I did looked at a closet door of mine and noticed it was also breathing. </p><p>As I noticed this 'waiting for the worms' came on and now the entire room, all 4 walls and my bed plus other furniture was indeed breathing a constant breath. This was a little overwhelming at first but I was able to handle it. I smiled and giggled at the idea of my entire room breathing in and expelling me out in a breath of air. I left the room and went to the kitchen. </p><p>As I arrived at the kitchen I encountered my mom. I took a long breath in and tried to look as normal as possible while I went and got the cat from the room my mom was in. As I was talking to my mom and retreaving the cat I noticed that I was indeed talking very loud. I took another breath and calmed myself and returned to my room. My mom went to bed at this time and the clock now read 915. I laid down on my floor in the dead center of my room as if I was instruced by the room to do so. I stared up at my ceiling which was now bubbling to the beat of 'run like hell'. Everytime a bubble would be formed it would pop and I would cover my face in fear. As it popped I looked back at the ceiling and giggled about surviving this fiasco. I found everything at this point very very funny. The wall ended and I got up to walk around a little. I was very tired and was in no way feeling the so called 'speed' effect of the mushrooms at this point. </p><p>As I went to walk out of my room I noticed the threshold to the door was very difficult to pass. My mind was screaming to me how it was unsafe outside my room, and that it couldnt protect me once I crossed the threshold. I decided I'd go on my own and leave my mind behind to think aobut what to involve myself in next.</p><p>As I returned to the room once again I now noticed that the breathing had stopped for the moment. Again I began giggling uncontrollably to the point where I actually had to cover my mouth with my own hands to keep me from just screaming in laughter. I again sat myself at my computer and talked to a few people online. I looked at the clock and it was 945 now. I was on my way to the other room to use the 3rd phone line as to not wake my mom. On the way to the room I was stopped by my wall mirror. I looked in it as if it was a portal. And at this point in time for me it was. I discovered right then and there that it is 100x easier to talk to myself when I can see myself talking back. I stood in front of my mirror (sat rather) and talked to myself for a good 20 mins. In this 20 mins I discussed where I was heading in life and how I should handle some issues at hand. Its amazing what the mushrooms unlocked in my head. It was like having a conversation with my brain but being able to use my reflection as a person to talk to. This was truely a spiritual situation. I finally wrapped up this convo and told myself that from now on whenever a huge issue comes up I would go to this mirror and very hard think things over before comitting to something. After all was said and done it was 1015. </p><p>At this point the visuals of my trip had slowed down an immense amount and I was feeling a good stoned effect come on. It stayed with me until around 1 am with small amounts of visuals and closed eye hallucinations, I finally got to sleep around 2ish and that was the most intense sleep I have ever had. I slept straight throught the night which I usually dont do, and my dreams were very very real. When I awoke the next day I was still a bit stoned and had a not so bad headache, I went to school and feel I did pretty well on my exams. I still have the very happy state of mind from the trip and everything is still a bit dull. Kinda the same effect after an E trip, a little blunted. But I feel great and I intend  to seek out more shrooms and more hallucinagens, my only words of warning, BE PREPARED!!! There's nothing worse then trippin and not expecting what is going to happen. At a few points I was a little overwhelmed.</p>"
}
