{
 "title": "A Trip to Hell",
 "author": "LsDmT",
 "citation": "   LsDmT. \"A Trip to Hell: experience with DXM & 5-MeO-AMT (ID 20456)\". Erowid.org. Jan 19, 2003. erowid.org/exp/20456",
 "substance": "DXM & 5-MeO-AMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "720 mg",
   "oral",
   "DXM",
   "(powder / crystals)",
   " ",
   "7.0 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20456",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 19, 2003",
   "Views: 15674",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was all set ready for my trip..I've been waiting forever to take my favorite drug DXM in combination with 5-meo-amt. Everyone told me not to. but i didnt care i wanted the trip of a life time.</p><p>i got more then anything my mind could possibly imagine...It was 10 pm my parents just left for work. so i take a shower in preperation for whats to come.to relax myself and be ready for anything.I take the DXM at about 10:30 pm right afterward i take the 5-meo-amt. then wait about 30 mins and go smoke a fat bowl. right after the bowl i got into my house and turn on gorillaz also known as the best tripping music ever. i was talking to my friend at the time.i found myself not really listening to what he was saying.i was off in my own world. i wasnt really that messed up yet but i was feeling weird. for some reason i dont know i noticed my heart was beating really really fast. </p><p>thats when it happened i got scared all these thoughts racing in my head about myself dieing and everyone saying we told him so...then thinking about all this things ill miss. i know how to handle my fear i said.so i tryed relaxing a little it worked for a little. </p><p>the visuals where getting intense. everything i looked at seemed like it would go from where it was to right in my face.i strated getting paranoid everywhere i looked the visuals where going crazy morphing and changeing...then i blanked out what i happened next is what i was told by my friend who talked to me all night and so still frame images and feelings i had...i felt like i remember seeing walls of patterns in my mind,it was a cave patterns dripping off the ceiling,then i heard the loudest deepest darkest voice i.. cant really describe what i felt it was like the devil was in my brain..then i had the feeling like someone came and saved me..took me away somehow i sorta came outta it. </p><p>the visuals still scaring the shit outta me.if i closed my eyes my mind would make up images of people and things.. it was kinda like my mind had been switched to random...i didnt wanna look at my room and i didnt wanna close my eyes so i put my hand over my face. i ended up staring at my hand then it looked like my hand streched back forever. staring into the blackness all of a sudden it rushed forward and i seen an eye in my hand and i flipped out. </p><p>so i tryed watching tv to keep my mind off of the visuals..but nothing worked i tryed playing a game that didnt work eather..the people and things kept entering my mind.i always thought if i had a bad trip i would be able to handle it. i thought wrong..nothing you can imagine in a normal state.its as if your mind is uncapped. you mind has no censore it goes anywhere and takes it to the limit and then some.</p><p>i woke up the next morning not being able to see good and i was still shaken up.i've tryed dxm and 5-meo-amt a few times after that with a lesser dose.. i found out that no matter if your with friends in a good set and setting even with a perfect frame of mind and lots of tripping expericnce.it doesnt matter dxm and amt in combination at almost any dose with create anything and everything you've ever seen that scared you all rolled up into one...in your mind anything goes....</p><p>thanks for reading and remember if your doinging something youve never done before find out about it..but to my knowleage no one has ever taken DXM & 5-meo-amt at the same time...the unknown was my drive</p>"
}
