{
 "title": "Careful With Ecstasy",
 "author": "Dave",
 "citation": "   Dave. \"Careful With Ecstasy: experience with MDA? (Sold as Ecstasy) (ID 2045)\". Erowid.org. Jun 23, 2000. erowid.org/exp/2045",
 "substance": "MDA? (Sold as Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 3:00",
   "2 tablets",
   "oral",
   "MDA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "",
   "2045",
   "Male",
   " ",
   "Not Given",
   "Jun 23, 2000",
   "24936",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First I want to say that if your curious about ecstasy, try it!. Use your head and try it with someone who has before if possible. I've had friendships grow stronger, and real insights that last after the trip is long over. Now for my story.</p><p>I was at a rave with a few friends in florida, having a good time and i bought two hits of ecstacy. I had rolled a lot before so took them both anticipating the effects. It was great. I wont tell about how great it is because thats not my story,and besides you just can't. I bought them at 7:00 in the evening and it was now ten. the night was still young and the best part of the trip was over so i bought two more from a different person. They were 30$ a pill, about ten dollars more than usual in florida. I figured that since i had already taken E that night that i should take both of these more expensive pills to feel the same effect. first of all, the substance turned out to be mda rather than mdma. It feels speedier with less warm feelings and is not as enjoyable by far. 20 minutes after taking them i felt very anxious, another twenty and i started to hallucinate. I've taken lots of acid lots of times and i'd never seen anything like this. A dj's hair grew from his head, turned neon colors and flashed to the beat and along to the lasers and strobe lights. I asked my friend to walk with me away from the tent so i could sit down. As we walked i would see trees that appeared to be right in front of me and they would disappear, also it looked like there were people in the grass having sex all over the place, as i walked on they would disappear. I finally got my head together an hour later, I never bought ecstacy at a rave again. I still enjoy it very much, but I get it from one dealer who also takes E...you would be wise to do the same.</p>"
}
