{
 "title": "Positive stimulation",
 "author": "Black Panther",
 "citation": "   Black Panther. \"Positive stimulation: experience with 2C-I (ID 20467)\". Erowid.org. Jan 24, 2003. erowid.org/exp/20467",
 "substance": "2C-I",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "insufflated",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 20467",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 24, 2003",
   "Views: 9046",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was my first contact with 2C-I, but not first with phenetylamines.<br>22:30<br>I snorted approximatelly 5mg 2C-I. Dose was small, but this method is twice as strong as oral use and many people are very sensitive to 2C-I, so I didn't wanted to risk with all 20mg orally. After about 5 minutes, nose started to burn very strong. This is something totally different than with oral use, phenetylamines aren't destined to be used in such a way. <br>22:45<br>There is something here already. Pupils are strongly dilated, walking is altered in some way. Shadows are moving slightly, walls start to morph, but very lightly and I must concentrate on this. I almost don't feel the legs, they are so light. Over my body, especially in legs there is so strange energy coming. Stimulation is visible, but don't break me up in all sides. I can easily sat in one place, but I feel such a strange energy in my body. <br>23:00<br>I started to watch Human Traffic, everytime I was smiling stupidly. Light jaw clenching is present.<br>23:30<br>Somebody calls me on ICQ :)<br>I created my sentences very skilfully. I was amazed that I type the words so correct. Everytime I smiled widely. Effects was light but very positive. Once I closed my eyes, I saw a moving fluroscent parasite, like on the ancient cavern drawings. <br>24:00<br>With closed eyes I have a mild hallucinations, slow whirls, which changes their shape. I comeback to Human Traffic, laughing widely. <br>Stimulation was significant with this substance and I was able to sleep only after 3. About 2 am I didn't feelt any effects thus. Culmination effects lasting about 1.5 hour. Overall, it was nice, but mild experience.\n\n\n"
}
