{
 "title": "The Most Beautiful Creature In the Universe",
 "author": "Kam",
 "citation": "   Kam. \"The Most Beautiful Creature In the Universe: experience with Mushrooms - P. mexicana (ID 20486)\". Erowid.org. Jul 2, 2006. erowid.org/exp/20486",
 "substance": "Mushrooms - P. mexicana",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE:",
   "3 capsls",
   "oral",
   "Ephedrine",
   " ",
   " ",
   "  ",
   "oral",
   "Mushrooms - P. mexicana",
   "(dried)",
   " ",
   "1.0 g",
   "oral",
   "Vitamin C",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20486",
   "Male",
   " ",
   "Not Given",
   "Jul 2, 2006",
   "Views: 7936",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hallucinogens have fascinated me for half my life. I can remember this fascination began when I was 11 years old, around the time I began smoking pot. I guess this was a little young, but from then until now at 21 I have not been able to enjoy the talkative, chatty side to smoking as often as the introspective, philosophical and somewhat hallucinatory state the weed induces in me. I am known to my friends to shut off into my own little world when stoned. (Inconvenient at parties.) </p><p>However, I was well aware that LSD and mushroom trips are on a completely different level to being very stoned, and so have been trying to get my hands on something to make me _really_ trip for 10 years. Coke, speed, ecstacy and ketamine have always been readily available, and I have enjoyed all of em, quite frequently. So I am fairly used to being in some altered state or other. But while all of them have their time and place, and are usually lots of fun, none gave me what I was looking for. None put me in the state I had almost become obsessed with reaching. And for some reason I couldn't find any mushrooms or acid anywhere. Where I lived, it seemed every other drug was for sale but the ones I really wanted.</p><p>During my search for hallucinogens I discovered Salvia Divinorum. Mainly because it is legal and therefore easy to obtain. Yes, it is -definitely- a trip, a mind blowing one.  I wish to experiment further with it and see what I can learn from it, and I know that it is of  some great importance. But the experience is more educational than fun. All other drugs I have tried merely mess with the human brain. Salvia, I believe, taps into powers far beyond, at least for now, the understanding of modern neurology.  And all this besides, I found the effects to damn short-lived. I still wanted those mushrooms. I wanted to bounce around, laugh a lot, and see things turn into other things, and not have to think too much. I also wanted more time to explore.</p><p>So when my two very good friends G. , D. and I finally got around to planning this trip to Amsterdam we'd been talking about for seven years, the smart shops were first on my sightseeing list. A few beers on the ferry, a few more on the train, we'd had a very pleasant journey. We arrived at Central station and, sick of carrying the bags, checked into the first hotel we saw. Then we headed out and hit the first coffeeshop we came across, and bought a bag of the first weed we saw on the menu. </p><p>This weed was stronger than any weed we could ever have hoped to get at home. Despite being economical with it as we had been advised, within an hour of arriving we were ridiculously stoned beyond belief. Though the gear they sold was strong, unluckily, as we were to find out, that first shop was probably one of the worst in Amsterdam. Later on, after visiting one or two other coffeeshops, we regretted even setting foot in that filthy hole. The atmosphere got to us BADLY. For now, we left, paranoid and distressed, back to the hotel. It was a seriously dodgy place. </p><p>An hour later back at the hotel we'd all got changed and decided to start again. The journey had be long and my two friends were also still tired from a long drinking session the night before, and we all needed to wake up. So I visited the head shop downstairs and bought a packet of 3 Yellow-Jackets.(Ephedrine capsules) However, my friends were weary of these stimulant concoctions as I had once recommended some to them that had made them quite nauseous. (They had been too polite to tell me at the time!)  so I ended up eating them alone. </p><p>Nevertheless, D had woken up anyway so now we would look for shrooms, but a small dose of mild ones, to be on the safe side. We purchased a box of Cubensis Mexicana with one and a half large shrooms and a few small caps. We took em back to the room and decided to eat them a little at a time, as things were already going a little strange.. Before eating the Cubensis, I had already begun to feel the yellow jackets kicking in- a sort of tingly, very talkative feeling, and my heart beating faster - more like a jug or two of espresso than anything else. I suddenly didn't feel at all stoned, which was surprising as it usually takes me a long time to wake up from a few fat spliffs. . I'm not sure to what extent the Ephedrine affected my trip, but I am pretty sure I ended up tripping hardest out of the three of us. </p><p>We sat there chatting and listening to music. We all ate 1000mg of G.s vitamin C, not for any particular reason other than we didn't want to get ill later on. I ate about 1/4 of my share to begin with. I began to fear that the room we were in was not a suitable environment to trip in - the hotel itself was far from relaxed, (ie, a shithole) and the room itself looked like a cell in a psychiatric prison, no more than 8 feet squared for the three of us. The walls were bare white except for the nicotine stains and dents, with a bright, glaring incandescent bulb fixed dead centre of the ceiling. There were no windows - just a small air-vent in the corner. There were two, steel framed bunk-beds, (military stile) with plain, white bedding. The only distinctive feature was an old, battered ceiling fan that didn't work. </p><p>I kept telling myself you get what you pay for, but inside, I was very worried about tripping in this room. Until the effects kicked in, when it all went just fantastic.</p><p>After about twenty minutes, we all commented on how warm it was. We agreed that this was due to the shrooms, and so, assured they were working, ate some more of them. Then, after about another ten minutes,  I looked over at D's bunk, and it occurred to me that it was made of rubber. I felt I could bend the frame with my hands, and so, ever curious, I stood up to try it. D gave me a look as if he was wondering what the hell I was doing. I don't blame him. I knew that the frame was not rubber, but it felt like rubber, and it looked like rubber, it even SMELT like rubber, and I could bend it. I remember saying to him 'It bends! It bends!' G. stood up and said to me 'Kam, I think you're coming up!' I sat back down again and said 'Well, fuck me backwards, I think you're right!'</p><p>We continued to talk. We hadn't seen each other for a long time and had a lot to talk about. However, it seemed more and more that as time went on, our conversation became more nonsensical. While we were still coherent, we were talking absolute rubbish. All the time, I was watching D's rubber bed sway in time to the music and watching palm trees sprout from the steel tubes. The bare white room began to have a lot more colour to it. I began to see the green of the leaves, the yellowy-brown bark.  The music I was listening to was not what was playing on the stereo, although I could still hear the CD. We ate some more of the mushrooms. This was too good to be true. Everything I had hoped for. I for one wanted more of it. </p><p>About another half hour must have passed when I noticed G. was tapping on the walls and say 'woosh' a lot. He told me that the walls were rippling when he touched them, and as soon as he said so, I began to see it too, until they turned into a tartan rug and were billowing in and out like I should imagine a trampoline would were a very fat invisible man jumping on it. </p><p>I lay back against the wall - the wall felt like rubber too and my head began to sink into it. Then I looked up at the ceiling. That old fan was rotating. It was not even wired up, but it was spinning, and suddenly there was another one. And another. Five of them, all spinning, I decided, at precisely 5012rpm. The ceiling began to lift up and move forwards, like the underside of a small airship, with all its propellers. Then it was an airship. Then two airships. Then a whole fleet of them, flying overhead purposefully through the clouds as if on some dangerous mission, dodging gunfire from the artillery below. </p><p>Jesus, I thought. I am seeing whatever I am thinking as if it's really there. This is incredible. I was loving it so much I ate the rest of my share, plus the remainder of D.s, as he was feeling a little nauseous and didn't want them.  </p><p>I can't remember what we were talking about, but while all this was going on I know we were all still managing to talk to each other with fair ease. We were still interacting. Yet I have never felt so in control of my own mind as I did then - I could turn away from the trip to talk to my friends, and turn back to the airships at will. If I became bored of the airships, I would see something else. I saw a million things in those bare white walls that night, but not one I didn't want to. I was in the drivers seat and could take my mind wherever I wanted it to go. It was like my visual imagination had been fitted with power steering, cruise control, and a turbo. Oh, and a DVD player in the back seat. When I closed my eyes I could see in great detail huge landscapes. Mountains, forests, deserts - all populated with animals of every kind. Anything I put there.     </p><p>Then about two hours into the trip the visuals mellowed a little and the laughter set in. We began chanting 'Fuck da police!' and I began to roll around on the rubber floor in fits of laughter. We heard other guests on the other side of the door, listening in and wondering what the hell was going on. We laughed our asses off for at least 45 minutes saying nothing but 'Fuck da Police' to each other, finding it absolutely hysterical. I could still see the airships, but 'Fuck da police' was funnier at the moment. Eventually we stopped, only because the CD  had finished and someone had to change it, 'before the weasels close in', as G. put it.  </p><p>It was then, getting up to change the CD, that I peaked. And here I got more than I expected from these shrooms, yet everything I had dreamed of at the same time.</p><p>I had to sit back down again almost immediately because I began to notice all the little imperfections in the wall, stains and dents, moving around to form many arabic letters. I wanted to read them, and tried for a few minutes, then suddenly remembered I couldn't read arabic. When I realised this, the letters melted away and everything sounded as if we were underwater. I could hear bubbles and whale-song, and waves crashing overhead.  As if pushing through cling-film, the most beautiful creature I ever saw pushed its way through the wall opposite me. It was enormous. The room seemed to have grown in size to accommodate it. </p><p>It was a huge, tentacled sea creature. It's organs appeared to be outside of its body, pulsating and turning. It shone a brilliant blue light that filled the room. It had seven heads, all of them smiling, all with huge, black eyes that seemed filled with love and calmness. The tentacles waved around the room. It continued to smile as I gaped in awe at it. </p><p>An overwhelming feeling of inner peace emanated through my entire body - I felt like this creature was reassuring me of the good in humanity, nature and the universe. It looked like it could have been a boss from one of the Final Fantasy games, but to me, it was the most beautiful thing in the universe. It WAS the universe.</p><p>By now, I was aware that they were staring at me with a little concern. And I couldn't blame them for I can now imagine what I must have looked like. I was motionless, open mouthed, wide eyed, pointing at a blank white wall for what must have been well over ten minutes. They were asking me what I could see, and I was describing it to them, but still not taking my eyes off it. I dont think I blinked in that whole ten minutes. I was still conscious of being in the hotel room, being under the influence of mushrooms, but I did not want ever to stop looking at this. . .this amazing. . .THING. I wanted to communicate with it. It looked friendly. But it had already begun to drift away, back into the wall which had now become a huge, rotating tunnel. I recognised this as the same tunnel I always see when I smoke Salvia.  </p><p>As the creature moved away it waved to me as if to say 'goodbye for now, we'll meet again someday, come and find me' before it finally disappeared from view, giving a final twirl before vanishing completely. I was very sad to see it go, but the indescribable happiness for having met it far outweighed any sadness.</p><p>The tunnel soon closed around it, and the wall became a spiders' web. Spiderman's face appeared in the centre of it, and this was followed by the rest of his body. He began dancing around to the CD playing on the stereo - (I think it was Orbital but it was hardly important) with full disco lights, red green and yellow, with strobes, mirror balls and lasers. I began to laugh - it was a very funny picture. It was almost as if the creature I had met was saying 'Aww, don't be sad that I'm leaving. I know - here's something you'll like!' and throwing the image at me to cheer me up. (I am a big spiderman fan, and somehow it knew.) I got the giggles again, for the first time not being aware of my two friends in the room. </p><p>After watching Spiderman dance for a while, the picture faded to white and I was on the floor. All the visuals had disappeared very suddenly and I felt fairly normal. Very refreshed, still filled with the peace and happiness of the sea-creature I had just met, but fairly sober.  D was looing at me - 'What do you think, shall we go for a walk?' I looked up - no airships. Just inner calm the likes of which I cannot ever remember feeling in y life</p><p>I did not stop smiling for a very long time. I dont think I stopped smiling until we were back on the boat. We continued to have a great weekend in this wonderful city. </p><p>Since then I have not tripped to that extent. I have smoked salvia a few times in the hope that it can shed some light about what I saw, and I have seen that same tunnel, but the Salvia won't tell me anything about the creature. It doesn't believe I need to know just yet. I'm hoping to meet it again some time. Or at least feel the way I felt when I was looking at it. And I have a strong feeling that one day I will. Either way, my experience with P.Cubensis has to be the most pleasant trip of my life. I cannot wait to repeat it, and yet, I know that there is no rush. It will happen when the time is right. </p><p>I was very worried about a lot of things before I ate those mushrooms. I am not very well traveled and was in an unfamiliar place. What if something bad happens to me or my friends? What if we get robbed, ripped off, lost, killed, etc? What if we do TOO many drugs. What, even, if the shrooms wipe us out for the weekend and we waste our long-awaited holiday? Don't they say that you shouldnt trip if you're worried about things? </p><p>Within twenty minutes of eating the mushrooms, all of these worries were wiped away never to return. Along with everything else deep and personal that had been darkening my thoughts. All that was left was complete calm and happiness. I guess cleansed is the word for it. The mushrooms have shown me the inner peace and calm that every human should strive to achieve through life. Buddhism springs to mind, though I know too little of its teachings to draw an accurate parallel. But that creature, in a way, pointed me to a target. When I can feel as I did when looking at the creature, all the time, without the help of the mushrooms, then I know I have achieved my goal as a human being. Enlightenent, if I may say.</p><p>Marijuana, Psilocybes and Salvia have been growing on earth before, I am guessing, mankind. They were put there for a purpose - an important one. And they TELL this to me when I use them.</p><p>After finally experiencing the wonders of Psilocybin after many years of looking for it, I no longer feel the need for those man-made substances peddled out in the clubs. With them, I have always found that after a while the down far outweighs the up. Maybe I haven't been getting the good stuff, but these ones spring out of the ground, ready for consumption, as nature intended. I have learned that if I give these plants and fungi the respect they deserve, they can teach me a lot about nature, about myself, and others.</p>"
}
