{
 "title": "Stimulating, Uncomfortable",
 "author": "RO",
 "citation": "   RO. \"Stimulating, Uncomfortable: experience with Phentermine (ID 20498)\". Erowid.org. Jan 16, 2003. erowid.org/exp/20498",
 "substance": "Phentermine",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "Pharms - Phentermine",
   "  T+ 0:30",
   "1 tablet",
   "oral",
   "Pharms - Phentermine"
  ]
 ],
 "footer": [
  [
   "2003",
   "20498",
   "Male",
   " ",
   "Not Given",
   "Jan 16, 2003",
   "29933",
   " "
  ]
 ],
 "report": "<p>My dad went to the doctors about a diet, and the doctor prescribed him 37.5mg of phentemine and suggested a low carbohydrate diet. So my dad tried some of the pills and went on the diet, but stopped taking the pills coz they made him feel funny, so I tried some.</p><p>I took 2 of the pills and the effects are kinda like taking lots of caffeine but I didnt get hyperactive and my perception sometimes went a bit wierd, on the bottle it simply says:</p><p>phentermine </p><p>dosage as advised </p><p>no alcohol. </p><p>I took one pill at first, I have no idea how much phentermine this is but i think its around 1-2mg. after 30 mins or so i started noticing a slight difference in how i felt, then I took a second pill and about 20 mins after that was when i reached the 'peak' if you will.</p><p>The pills are more accurately described as anti-appetisers, at first sometimes you would look at somthing and it would look out of perportion, like a room would seem incredibly big and you and your chair quite small, i noticed i was feeling slightly like i did on dextromethorphan but not nearly as strong, stomach felt kind of empty but i didnt feel hungry (so I guess they work at what their supposed to do), sometimes when i glanced at things it wouldent look right, like when you look at patters in curtains or seat covers and u see faces.</p><p>Time also seemd to go quite quickly. I went to bed about an hour after taking the first pill but didnt sleep (in fact that was about 2 hours ago), i lay there not really thinking about anything imparticular but i felt very content and VERY cosy. anyway, it felt like i had been there for ten mins or so but it turned out i had been there for almost 50 mins, but that mighta just been a mistake of mine.</p><p>There is however a bad side to these pills, they can make me feel uncomfortable. I tried one before a few months ago when dad first got them and remember feeling uncomfy and he commented it made him feel wierd. I dont know what kind of doses u should take but taking 2 of them was ok, lasted about an hour and twenty mins in total and first started kicking in after about 30-40 mins and peaks after an hour or so.</p><p>Ok its about 14 hours since I tried the 2 pills, im not feeling too great, really hungry but I have no appetite and it just sucks.</p><p>I did some research on the net and came up with this:</p><p>'Phentermine is a sympathomimetic amine, which is similar to an amphetamine. It is also known as an 'anorectic' or 'anorexigenic' drug. Phentermine stimulates the central nervous system (nerves and brain), which increases your heart rate and blood pressure and decreases your appetite.'</p><p>It comes in pills/tablets and the doses are usually one daily dose in the morning or 3 times a day,  30 mins before meals. Most people take it for 3-6 weeks. Phentermine can be habit forming:</p><p>'You can become physically and psychologically dependent on this medication, and withdrawal effects may occur if you stop taking it suddenly after several weeks of continuous use.' </p><p> To prevent side effects you should take it with your meals (30 mins before). I also read you shouldent take a double dose if you missed one (so maybe taking 2 pills was a bad idea). Another thing I will note is I did drink some alcohol a few hours before taking the pills, I had a small jack daniels and a chinese beer at the chinky, and I think thats what made my breath bad. </p><p> You shouldent take phentermine in the evening because it can lead to </p><p>insomnia (when I took mine at around midnight I was quite tired, but I didnt get to sleep till about 6:30am) </p><p>  There are a few side effects but they are not common, worry if they dont go away after a short period of time, if you have a dry mouth or unplesant taste for a long time, diarrhea, constipation or your vomiting. my mouth tasted bad when I woke but its ok now. I am also reading that if u get increased blood pressure you should ring the doctor imediately, but I thought you were supposed to get high blood pressure, so you might wanna check that out yourself, well it says:</p><p>'increased blood pressure, heart palpitations, restlessness, dizziness, tremor, insomnia'</p><p> Well thats about all I can find.</p>"
}
