{
 "title": "Sailing Into Home Base",
 "author": "Scotto",
 "citation": "   Scotto. \"Sailing Into Home Base: experience with 2C-B & MDMA (ID 2049)\". Erowid.org. Jun 23, 2000. erowid.org/exp/2049",
 "substance": "2C-B & MDMA",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "MDMA",
   " ",
   "30 mg",
   "oral",
   "2C-B",
   " ",
   "50 mg",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "1998",
   "ID: 2049",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 23, 2000",
   "Views: 7809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n'that night i swallowed 180mg of MDMA and roamed around, later consuming approximately 25-35mg of 2cb, then later consuming 50mg more of MDMA.'</p><p>That is a quote from my notes concerning my 1998 trip to Burning Man. It should be noted that for most people, a figure along the lines of '25-35mg of 2cb' would not be acceptable. The situation at Burning Man that year was rather insane (as it is every year, presumably), and at one point, someone had a capsule containing 2C-B which she wanted to split, but without easy access to a milligram scale, she decided to simply split it by eyeballing it and handing me the other half of the capsule, with an indeterminate amount of powder in it. I already had a measured amount with me, and since for me, a good dose of 2C-B starts at 50mg anyway, I decided to swallow it. </p><p>I think a fair amount has already been written about the MDMA / 2C-B combination, but what I wanted to add here was the slight modification of boosting with an additional amount of MDMA at the very end, when the 2C-B is wearing off. This was such an amazing and delightful way to sail back into home base. The MDMA initially had been a very profound experience; I had gone out to a piece of installation art that I had helped create, and encountered some people there; our conversation was remarkable, and I left feeling as though I was truly part of something dense and wonderful. As the 2C-B came on, I wound up spending at least an hour and a half completely alone, sitting underneath the Man itself and pondering any number of amazing things. And then, as the sun came up, I took that last boost of MDMA and went on a bike ride around the camp. By the time I got back home, I was exhausted by my many efforts that night and slept peacefully. </p><p>Although I have yet to try this again in a non-crazy-art-festival environment, I think if a person has no particular problem with the physical side effects of MDMA (speediness, jaw clenching, etc.), this technique can be used to good effect. 180mg was a high initial starting dose, which is something I occasionally do if I really want to hit the experience full on, but adding the additional 50mg after the 2C-B was not particularly additive in terms of physical side effects, as the initial dose had clearly worn off by then. As ever, your mileage may vary. </p>"
}
