{
 "title": "I Didn't Miss It At All",
 "author": "John",
 "citation": "Citation:   John. \"I Didn't Miss It At All: experience with Cocaine (ID 20509)\". Erowid.org. Aug 8, 2007. erowid.org/exp/20509",
 "substance": "Cocaine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  repeated",
   " ",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 20509",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 8, 2007",
   "Views: 6229",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI started using coke when I was a resident DJ at a club, me and the other guy would get .5g between us and take it over the course of the evening.  One problem though, far from being the DJ's little helper it actually made my mixing suck, not too bad but not up to my usual level (interesting side note: my mixing improves on pills, maybe because it's dance music and I get into it more, I don't know, but I've listened to recordings of mixes I've done at home or at the club and the pilled up ones are better than the straight ones, which are in turn better than the coked up ones).\r\nThat went on for a while and then I got into pills big time, the other DJ had moved to another venue and my new partner in crime and I would like nothing better than taking a few pills of a friday night.\r\nSo then, after about 18 months I met up for a smoke with a friend of mine and she mentioned that her dealer had just started doing really nice coke.  Now, the reason I stopped doing it in the first place was because the stuff I was getting varied in quality, one week WEEEEEE and the next week ZUP, next week WEEEEEEE, you get the picture.  I scored half a gramme and we cut it up and had a line each and oh my gosh it felt good.  Thing is, during the time that I wasn't taking coke I didn't miss it at all.\r\nI got really into it then;I had the money and it didn't have any adverse effect on my job.  I can afford to use it pretty much when I want without resorting to crime (either stealing or dealing), so I do it about every other day, never in the mornings though.\r\nWhen it comes to addiction I think that either it's all a state of mind or that some people have more addictive tendencies than others.  I really do not believe that I am addicted (I've wondered every now and again).  Why do I say this?  Simple, I often travel a fair bit and don't know (or have any desire to know) dealers in other countries so I go without coke for a couple of weeks at a time every now and then and don't think about it once:no 'mmm, I could murder a line now!' or 'I wonder if I could go out and score some tonight?'.  I think I must be fairly lucky - when I do things I go all out but I don't seem to get addicted.\r\nMaybe I'm just deluding myself, but I don't think that I am.  At the end of the day (sorry!) I know that I can go without it, without craving it for periods of time.  Why do I keep doing it?  I don't think it's because I'm addicted, it's that I enjoy the experience, it doesn't effect my job and I can afford it.\r\nMy beliefs about drugs are as follows:they're not there to get me wasted or to help me interact easier with other people, they're there to enjoy a different experience from 'normality'.  I love the different experiences that I have when I take drugs and I wouldn't have had any of them if I had never tried anything.  Drugs can have a positive effect on my life - if I treat them with respect and take them responsibly.\n\n\n"
}