{
 "title": "All I Had Hoped For and More",
 "author": "Ronny B",
 "citation": "   Ronny B. \"All I Had Hoped For and More: experience with 5-MeO-DiPT (ID 20527)\". Erowid.org. Jan 18, 2003. erowid.org/exp/20527",
 "substance": "5-MeO-DiPT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "2002",
   "20527",
   "Male",
   " ",
   "Not Given",
   "Jan 18, 2003",
   "14772",
   " "
  ]
 ],
 "report": "<p>\nI had been reading about and researching foxy for about 8 months before I finally got the opportunity to indulge in it. Two days prior to New Years of 2003, some sort of magical working placed two 40mg doses of 5meodipt and a desperately sought after ticket to MSG to see Phish's reunion.  Both were most welcomed and unexpected by me and I looked forward to getting to try foxy while seeing one of my favorite bands after such a long hiatus.  Once I found my seat on the floor next to the tapers, I ingested one of my capsules and waited for the show to begin.</p><p>Within approximately 15- 20 minutes there was a definate feeling that 'something' was beginning to start. I wasn't exactly sure what just yet, but it was coming. At about the same time the lights dropped and Phish took the stage for the first time in three years.  As they began to play, elation filled my heart and a smile was plastered to my face.  I started to feel a little jittery, as waves of sensation started pulsating through my body. My permagrin was in full swing and i felt i couldn't stop smiling even if I had wanted too much the same way I'm affected by most psychadelics. Although the light show itself is trippy, I noticed more and more open eye visuals. The light seemed to be somewhat three dimensional with definate prism-like qualities.</p><p>Next thing you know the lights came on and the first set was over. I had been dancing the whole time, but now there was some funk playing over the soundsystem for the setbreak. But funny thing is, i had no desire to stop dancing.  Being a long time hippy-raver, I'm very confident when it comes to dancing, because i do it for me, not to look good but what feels good, and in turn, end up looking good. I felt as i moved to the beat that many eyes in the building were on me since i was the only one grooving in the center of MSG under floodlights.</p><p>I definately caught a few ladies eyeing me up and it felt so wonderful. Now, I had read about the aphrodesiac qualities, but it was not that i was feeling horny per se, but more just turned on in every aspect of the term. I definately found myself coming to a few full haults throughout the night at the sight of various attractive women. I'm a pretty good looking guy and have always done well for myself in that department, but tonight was different.  I felt as if I was emitting so much sexual energy, that somehow, someway, women were actually noticing it. I mean I was on fire tonight. I caught more women sneaking peaks and vibed out with different girls way more so than usual.</p><p>Actually, when the ball dropped, the girl next to me gave me this amazing full body hug and planted a wonderful kiss on me. The sensation of feeling her entire body pressed against mine, matched with this sensual, playful intertwining of toungues was absolutely incredible.  Unfortunately after we stopped, the guy next to her, who I didn't know happened to be her boyfriend, snatched her by the arm and took her away as he was yelling at her. Her eyes were locked with mine as she back peddled as he pulled till she turned and went with him. I never saw her again. But i wasn't upset. After i had a minute to digest what just happened I started cracking up. Poor guy, if my girl did that I'd be a bit salty too. But I was feeling so damn sexy at the moment i didn't really care. The next thing you know, its started snowing in MSG. Not that i thought it was, they were blowing out real snow from the ceiling.</p><p>I found myself in this winter wonderland of smiling faces. This blue lighting was on and they sang seven below, a song about snow. There were also these girls that were part of the show about twenty feet in the air. They must of been on some platform, but they had these dresses that went from their hips to the floor to hide whatever they were on. They had on these sort of white fur tops on with black spots, sort of like the flinstones garb. On their head were these sort of head dresses with ram horns coming out the sides.</p><p>They seemed demonic yet angelic and they danced way up there, grooving to the music as the snowed fell. At this point I was filled with so much happiness and elation I started to get tears in my eyes. Here I was seeing my favorite band, experiencing 5meodipt for the first time, which was all I had hoped for and more. I couldn't help sobbing for a few seconds in tears of joy. I forgot to mention that by this point my visuals had reached an all time high. It was kinda like the visuals of LSD, but without the head trip, and the outgoingness of MDMA, but without the huge effect on my emotions.</p><p>This, to seemed to me was the perfect combination of everything. Plus i just felt so damn sexy. It was, to put it lightly, nothing short of magical. I looked forward to my next experience and hope that I may indulge with a special someone to fully explore what potential I feel 5meodipt has.</p>"
}
