{
 "title": "You Are the Biggest Danger to Yourself",
 "author": "Unbalanced",
 "citation": "   Unbalanced. \"You Are the Biggest Danger to Yourself: experience with Methamphetamine (ID 20548)\". Erowid.org. Nov 13, 2005. erowid.org/exp/20548",
 "substance": "Methamphetamine",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20548",
   "Female",
   " ",
   "Not Given",
   "Nov 13, 2005",
   "5198",
   " "
  ]
 ],
 "report": "<p>It began so long ago that it is really hard to think about. My friend Kass came and picked me up to go party as usual one friday night and mentioned that she had a suprise for me and that I should grab some tin foil. I made up a story about barbequeing corn and took the whole roll. </p><p>We found a shady place to park for a few minutes and she set up the foil. There wasnt very much there but it was enough to get me high as hell. I remember that I didnt realize that I was intoxitcated and that when I held my breath and closed my eyes my entire being seemed concentrated in my lungs. </p><p>After that I didnt use for about 3 months. Then came the beginning of the end. I got about 1.5 grams and went through it in a matter of hours. I found a steady connection who got really good shit and I began using every day. </p><p>Everyone knew that I was using meth, but it didnt matter. It didnt matter that it made my mother cry and kept me away from the girl I love. </p><p>I would smoke in the morning in the shower, in between classes, DURING class, at lunch, when I got home from school and at night after everyone had gone to bed. And that was all in ONE day, everyday. </p><p>My weight was extremly unstable and would swing to 20 pounds on either side of normal. When I ran out of money for a time I gained 25 pounds in 4 days and weighed more than I ever had before and have since. My hands and feet would look almost brown and have no blood going to them. My eyes were always glazed over and I had these horrible red blotches all over my skin. </p><p>I was not a happy person either. I was removed from my best friend and lover. Her father threatened to shoot me if I tried to see her. I was miserable and horribly alone. And there really was nobody I could talk to. My mother was out of the question and nobody at school could relate. </p><p>I started to get violent. It is a funny thing now because I know that I ALWAYS was violent, but it is just easier to blame everything on the drugs. I nearly stabbed a kid to death and I was not in control of myself. We would spend all our money, smoke all our shit, and then go to the atm to drain our accounts, drive across town to the shadiest part of the city and wait two hours to get more. That is a bad thing. I was out of my mind.</p><p>I started to accuse people of irrational things and even ended up scaring my best friend so much that she stopped talking to me. I felt horrible because I could see that she had a problem too and I knew it was my fault; I was the one who should have known better but started her on meth anyways.</p><p>I decided this summer that I needed to sober up. I quit cold turkey for 4.5 months. But it is amazing how fast you get back into these things. The night before my birthday we got just a gram and decided to have some fun. My best friend had since forgiven me for everything and she threw me a little party at her house (she has since moved out of her parents place and has her own house now). We smoked it all, needless to say and I was sick as a dog the next day. </p><p>The most upsetting thing was, however, that before we smoked any at all, just the knowing that I would be soon got me so high. We call that an 'anticipation high' but it is a scary thing. My head was spinning, I couldnt stop smiling, I was talking fast, and my heart had already begun to beat faster. That is the true sign of a fiend I think.</p><p>But it was fun. It still is fun. And when it stopped being fun all I had to do was go to bed for a while and it was okay again. We were never really in denial. Scraping baggies and straws and all that makes it clear even to an addict that there is something wrong. To pass the time after I had scraped all my paraphernalia my favorite hobby was tweezing my leg hair because I refused to let myself pick at my face. </p><p>The day after my birthday I stayed home sick because my best friend called the night before and told me that our friend kevin from highschool had died. I knew that kid since 8th grade and it really hit me hard. It has been down hill at a 75 degree angle ever since. We got a good connection again and went nuts. I was back to smoking every day within a week. </p><p>Then it all collapsed. I got home one day and got the shakiest message on my machine from my best friend saying that I needed to call her and that everything was not alright. She told me then that our friend jason had killed himself and that she needed me there, right then. It was a monday night so blew off school and between the two of us we went through nearly two grams. It was horrible and the next day I was so dead. My heart gave up and I am still numb. I feel no emotion and just have this feeling of hopelessness that has not to this day left me. </p><p>Only last night I was asked if I was a drug addict. My friend Shihomi just wanted to know because she was thinking about her own drug usage. I thought about it very seriously for a while and finally told her that yes, I am a drug addict. It is okay though...for now, I think. I am not going to stop, not just yet anyways.</p><p>I must also must add at this point the small detail that before I ever used meth I had been using a wide variety of drugs for years. Meth was in fact the last drug I started using. </p><p>Anyways...I suppose that is where I shall leave it for now. I am getting more tonight, I am an addict, I am emotionally numb, and I am off to make myself eat something.</p><p>To any of you who think that meth looks like fun...it is. So just be really fucking careful because you are the biggest danger to yourself and from the inside it is really hard to get the whole picture.</p>"
}
