{
 "title": "Never Fast Enough",
 "author": "Jane Dose",
 "citation": " Jane Dose. \"Never Fast Enough: experience with Methamphetamine (ID 2055)\". Erowid.org. Jun 23, 2000. erowid.org/exp/2055",
 "substance": "Methamphetamine",
 "bodyweight": "123 lb",
 "header": [
  [
   "DOSE:",
   "2 lines",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2055",
   "Female",
   "",
   "Not Given",
   "Jun 23, 2000",
   "107632",
   " "
  ]
 ],
 "report": "<p>\nApproxomately 1 1/2 years ago, I unknowingly waltzed into the very intense world of Methamphetamine. I, like many others who 'just want to try something new', did just that. Unfortunately, I was unaware of the consequences of my actions. I am not saying that I did not enjoy my evening, only that it is always a good rule of thumb to be knowledgable about the substance you are taking in order to be prepared for what will come. Many people forget this very important step in drug experimentation, hence, the cause for 'bugging out'. In any event, that was an interesting night.</p><p>Late one evening, a few friends and I were going to a supposed phat party in South Beach. We decided we needed some party favors and went exploring at the appropriate house. While there, someone suggested speed-something I was not experienced with. But feeling my usual adventurous self, I thought, 'What the hell. It's only once!' So we purchased a 20 sack and divided into four lines; one line each. With my trusty bill rolled tightly in my hand, I snorted the line and made 'the face'. For those of you who have snorted meth, you know this face. It's the look of complete surprise from the shear pain and utter sting of the 'bitch'. </p><p>With the feeling of anxiousness approaching fast, we got into the car. On the way to the beach, we all started talking of world issues and debating, etc. I freshened my makeup at least four times, or searched through my purse for nothing at all. We all ate an entire pack of gum. These are all the tell tale signs of a speeded up partier. </p><p>At the club I could feel my jaw start to grind, but it didn't matter of course, because there was a kick ass DJ and all I wanted was an empty dance floor. The whole night I danced...only to come down. </p><p>After the club, we promptly returned to the house where we got it and bought some more to 'finish off the evening'. Althought that night was amazing, and I had many more after that; too many more! It is extremely hard to control the use of speed. It feels more like a tool than a drug. People feel as though their performance is heightened while under its influence. This is the reason that its addiction is SO INTENSE!! </p><p>Please, when using this substance, understand what it's about and discipline yourself with the dosages, and always have someone there to monitor your use. Because a crystal meth addiction is no picnic...I know, because I saw a side of it that I pray no one else would knowingly have to see. </p><p>Be safe and protect yourself!! You're all YOU really have!!</p>"
}
