{
 "title": "My Night on Morning Glory Seeds",
 "author": "Aqualung",
 "citation": "   Aqualung. \"My Night on Morning Glory Seeds: experience with Morning Glory Seeds (ID 2057)\". Erowid.org. Jun 23, 2000. erowid.org/exp/2057",
 "substance": "Morning Glory Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "9.0 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 2057",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 23, 2000",
   "Views: 185655",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading the FAQ and seeing another article on morning glory seeds I got off the news archive, I wanted to try them. Well last Friday night I had nothing to do. My buddy I usually hang out with was out of town and I was looking at a very boring evening. So I decided, 'what the hell,' and I went to the local supermarket and bought five 1.8 gram packs of Heavenly Blue morning glory seeds. I wanted to grind them up and put them in water, but I don't have a pepper grinder so I dumped the five packs into a baggie, took my hammer and attempted to smash them outside on a tree stump. Well, of course, the bag simply broke and seeds started to scatter. I don't think I lost a substantial amount, but I'm not sure. Anyway, I just said, 'f--k it,' and chewed the seeds. It was about 9 pm at this point. As I was chewing the seeds, a friend dropped by with some alcohol. 'Cool,' I thought, at least I'll have some company now. This friend also informed me that he had tried morning glory seeds once and had only gotten sick to his stomach with no psychedelic effect. But no, I wouldn't be daunted that easily.</p><p>Before I go on to describe the effects of the seeds, I feel the need to say that I've never tried acid, but I have eaten shrooms on several occasions. So all my comparisons will be to shrooms. Well, my friend and I made some fairly strong margaritas and were sitting outside on the lawn smoking and drinking. After about an hour and 2 margaritas (probably about 4 shots of tequila) I started to feel really, really stoned. I felt like I'd done a few bong hits of really good kind bud and drank a few beers along with it. My limbs were really heavy, I kind of felt like I was moving in slow motion, you know, a good high. At this point I lost track of time so I can't say how long things took at this point except for the couple of times I looked at a clock.</p><p>After sitting out on the lawn a while more, we got cold and went inside. I lied back on the couch and started staring at the ceiling. At this point it felt like shrooms do when they start coming on. I have really great textured walls and ceilings where I live that produce great effects when tripping. So I watched the ceiling ripple and watched the ridges sway and move about a bit. Let me point out that the hallucinations were very mild. It only felt like the beginnings of a mushroom trip and nothing like I understand acid to be. It was definately pleasent though. Although it was to a lesser degree than shrooms, I got the feeling I always get that everything is perfect and in its place and exactly as it should be. Well it turns out that this would be the height of my 'trip.'</p><p>I got tired of staring at the ceiling fairly quickly, (something that doesn't happen on shrooms) and my friend and I moved into my bedroom where we started watching some TV. After a little TV I felt that I was beginning to come down. I got this incredible desire to watch The Wall, so at about midnight I put the tape in. I've watched The Wall when coming down from shrooms and I know that the coming down period lasts much longer then it takes to finish the movie. But the seeds had pretty much worn off by about 3/4 of the way through. (Somewhere around Comfortably Numb.) It was probably somewhere between 1 and 1:30 at that point.</p><p>Well the rest of the night isn't worth telling. Nothing more exciting happened. Although I will point out two things. I was very restless after the seeds wore off. I was wide awake and ready to go do something. Also, apparently the seeds hadn't completely worn off until I woke up the next day. For right before I finally went to bed at about 7 am, I stopped and looked at my couch intensely for a bit. After a few seconds of staring, lo and behold the fabric of my couch starting rippling and wavering and generally shifting around. So some remnant of the seeds were still in my system ten hours after I initially ate them.</p><p>My final analysis of the seeds is that they were worth doing. The seeds cost me $5. In relation to other drugs they probably don't provide as much bang for the buck. But I haven't been able to get my hands on any acid or shrooms recently. And that $5 provided more entertainment than alcohol or a movie or anything of that sort. What it felt like was a very mild shroom trip. In fact, it was very similar to the time I ate shrooms two nights in a row and the second night was very mild. The main difference from a mild shroom trip was that I didn't get quite the same 'warm fuzzy' feeling. There were a few times of mild anxiety with the seeds. I think I'm going to try the seeds again but I will increase the dosage. I'm a little wary of doing this, though, because both sources I have from the net recommend no more than 9 or 10 grams, which is what I ate. Maybe I'll try 6 or 7 packs next time.</p><p>Oh yeah, one more thing. I suffered no nausia (sp?). The only side effect was some pretty nasty diaharrea (sp?). But even that was short lived, it was gone by the time I woke up the next morning.</p><p>Well, that's all. Have fun. </p>"
}
