{
 "title": "Massive Visuals",
 "author": "Fatsuma",
 "citation": "   Fatsuma. \"Massive Visuals: experience with TMA-2 (ID 20615)\". Erowid.org. Jan 22, 2003. erowid.org/exp/20615",
 "substance": "TMA-2",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "TMA-2"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 20615",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 22, 2003",
   "Views: 20096",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This just happened a couople of hours ago, and I haven't slept for 30+ hours so bear with me on this report.</p><p>Backround: I'm 23 years old, have tried numerous of substances before (Never had the opportunity to try LSD or mushrooms, hallucinogenics I've tried: 5-Meo-Dipt, 5-Meo-Dmt, 2C-I...)</p><p>I consider myself somewhat experienced and fairly calm and stable person. </p><p>This is my second try on TMA-2, the last time I was in a party where everyone used alcohol, some of the people didn't even know that I was tripping. That let me to observe the level of stupidity in some people when drunk. The first time I didn't get any visuals whatsoever and felt just a strong buzz in my body, mindwork was definitely interesting and I seemed to find different patterns of thought during conversations with drunken people. I liked the first trip with TMA-2, and automatically thougt that the second time with a identical dose would pretty much feel the same, how wrong was I....</p><p>I stayed up the night before the trip just smoking some quality-buds, listening to some good music and drawing. At 7 am I had the bright idea of ingesting the 40mg TMA-2 gelcap that I had saved for future use. As the last time the first hour was just waiting for the substance to work, meanwhile I was getting very tired.</p><p>T+ 1:15 - I felt the first effects of the drug, that familiar body buzz that I've had several times before with substances of the similar nature.</p><p>T+ 1:45 - Starting to think that was the ingestion of the TMA-2 capsule was a mistake: I haven't slept for a while, my apartment was not in that order what I'm used to. I think that I hesitated in taking this drug.</p><p>T+ 2:00 - Euphoric feeling, I'm starting to enjoy this lift of mood. Don't think anymore that ingesting that capsule was a mistake, just too busy feeling good. I expected this state of mind to remain during the trip.</p><p>T+ 2:45 - A visit to the bathroom, the walls are all alive now: visuals are ok but not overwhelming. No diarrhea reported by some users.</p><p>T+ 3:00 - Visuals are becoming pretty gorgeus, walls are alive, the ceiling looks like Sahara during a sandstorm. Best visuals ever so far, I'm fairly suprised and very high.</p><p>The following things I saw or happened during T+ 3:00 and T+ 6:00, I simply couldn't keep track of the time when I was too busy watching my carpet transforming into a deep forest:</p><p>- Walls are begining to melt including the ceiling, pretty cool looking stuff I might add :)</p><p>- My TV is trying to transform into a different object, although not recognizable.</p><p>- I just think that I might have a fireplace in my living room, atleast I can see the flames in the corner of my eye.</p><p>- Everything is alive: the room is spinning, TV is jumping up and down, my sofa seems to have a mind of his own, my tv-table tries to walk and my remote controller tries to crawl to me.</p><p>- Had to put the music down, I was getting too deep into the trip and honestly I was getting afraid what might happen next. I felt like I was knocking the gates of ++++ experience and realised that I'm not ready for such a trip yet. I would just lie on the sofa travelling around my brain and imagination.</p><p>- Shadows seems to appear everywhere, looked up at the lamp and saw a face of a woman, that spooked me real good.</p><p>Now it's T+ 12:45 and I'm back to baseline, still wondering my purpose on that trip. So many questions fill my brain and I don't seem to realise the fantastic things that happened to me just a while ago. I may need a few days to process these thoughts...</p><p>Overall it was a very magical trip, what enhanced it more was the fact that I did not expect visuals of such magnitude... everything was so beautiful: deep colours look absolutely stunning. Next time I am tripping I should make sure that my place is in that order that I'm happy with my surroundings, and have some light food and a lot of cigarettes. I think that me being so tired at first brought out the visuals much better, the next time I try TMA-2 (Believe me, I'm willing to do that :) I might even try again staying up late and trip in the morning. This substance definitely needs further exploration to show it's true identity, but as with any drugs (especially research chemicals) you can use this also the wrong way.</p><p>Just keep safe, be careful and the most important thing of all: remember to have fun!</p>"
}
