{
 "title": "A Taste Of Euphoria",
 "author": "TheBlueBus",
 "citation": "   TheBlueBus. \"A Taste Of Euphoria: experience with LSD (ID 20621)\". Erowid.org. Jul 20, 2007. erowid.org/exp/20621",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20621",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 20, 2007",
   "Views: 5779",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It is very difficult to find the words, or metaphors to fully describe my LSD experience. Like many who have experimented with acid, can hardly believe that such a phenomenon could take place in my head all because of a tiny piece of paper. The duration of my trip was very positive, in fact I consider it the best thing I have ever experienced in my entire existance..</p><p>I had wondered about the 'mysterious' LSD for sometime before I actually decided to try it. I had been very into the pyscadelic scene from the 1960s, and in love with the music. Bands that stood for peace, and spiritualism were my cup of tea. I knew that there was a better way of enjoying them, and enjoying life. The answer lied in a tiny piece of blotter paper, no bigger then the size of my pinky, with a picture of spheres imprinted upon it.</p><p>The Experience</p><p>About a week ago I was over at my friend's house on a Saturday night. It was supposed to just be another night drinking to the point of no return, but a buddy of mine told me he could get me a 'double-coded' hit. He came over with what appeared to be a nickel with a bump on it's face. It was the hit wrapped in aluminum foil to the loose change, how clever! We decided since I had to go home that night, that we would split the hit since it was so strong. I got the bigger half and we placed them in our mouths around 9: 30 pm. We walked around looking for a warm place to go, since it was about 20 degrees outside. We stopped at another guys house and sat in his basement. An hour or so had passed and I became frustrated that no effects had taken place. We had declared it a dud when all of a sudden it kicked in.</p><p>pHase 1</p><p>Suddenly everything became humorous, and I became the new comedian in the room. I laughed so hard that I fell off of the couch onto my knees. Colors became intensified meaning they became louder and brighter. I picked up a can of gasoline while no one as watching me and began pouring it out because the smell was so intense, it drove me wild with interest. I ended up drenching my wrist, gloves and cell phone in gas. Some one called my phone and it began to vibrate in the puddle of gas. I could see the vibrations floating in the air and my hand felt extremely lubricated even when wiped clean with a towel. The whole night my hand felt soaking wet.</p><p>pHase 2</p><p>Because I was making so much noise in his basement we had to leave. When I walked outside I felt no different in temperature wise then I did inside. I became very happy and excited. I took a look at the clouds which began to dance in unison. Taking shapes, first a dragon, then an alligator, and then a pelican. These shapes were very defined, and were perfect silouettes. The grass turned neon purple and then neon green. The colors would vibe like a beating heart. Then the landscape took shape. As far as the eye could see, gargoyle type figures emerged from the ground in a perfect patterns for acres. The gargoyles resembled the King himself, Elvis Presely. I became very cautious of stepping on Elvis. As we walked down a cemented path the trees, all at once, warped from oak and pine trees into very distinct Palm Trees with a glistening to them. I thought we were in Florida. We stopped on a bridge over a pretty sad little creek. But after a few seconds it turned into the most gorgeous animated stream like the one in pochahantus. I could barely see an object for what it actually was for more then half a second, and it changed shape, color, or texture.</p><p>pHase 3</p><p>I began to realize that I had to go home soon. My father was going to be picking me up in the next hour or so and I was about as loony as Charles Manson. A little bit of fear began to kick in but more so confusion. This is what I like to call the confusion Era, bc it felt like for ever. All of a sudden everything became confusing. Statements made towards me, or about me became awkward, with no meaning. We had to find another place to get out of the cold. So we stopped at a girls house. Her parents were upstairs so we had to be quiet. But I could barely stop talking. Every time I was told to shut up I wanted to know why. When I was given a reason I became more confused. And I asked why her parents had to be here in a very sincere way. The great thing was that we were in a small art gallery where her father kept 10 to 15 paintings. The paintings were coming alive acting out the scene, or warping, or coming onto the wall. Both previous phases 1 and 2 were going more strong then ever and I was trying to explain to the group of what was happening to me. But I was repeatedly hushed and then kicked out into the cold. </p><p>pHase 4</p><p>Now with all the phases going strong I became SLIGHTLY depressed and sad. I didnt want my dad to pick me up, there was no way in hell I wouldnt get caught. I could barely have a conversation or concentrate on one thing for more than half a second. My dad was on his way and I was screwed. My friends wished me luck as I tried so hardly to act straight. My dad picked me up at 12 am. </p><p>I tried not to converse much, but my dad likes to talk alot. I just mostly said yes and no and looked away from him as I was told my eyes were extremely dialated. I ended up giving him my cell phone telling him the gasoline just appeared on it and that I was sorry. He was so tired he didnt even go further into it. I was lucky! I went into my room very happy about not getting caught. I locked myself in my room for the remainder of the trip, bc of fear of getting caught. </p><p>When I tried to close my eyes, visions of mysterious shapes, and geometric patterns decorated my mind. Physcadelic colors and back drops filled my mind. I put headphones on and listened to about 6 whole albums that night. Pink Floyd, CSNY, Incubus, Jimi Hendrix, and more. I became very lazy! When a cd ended, I didnt have the energy to change it, so I would just let it play and listen to the whole thing again. The images of friends, family, and familiar things danced upon very pyscadelic lights and colors. I had a 5 hour light show in my head. It doesnt let you sleep. The clock seem to slow down. My stomach began to hurt bc lack of eating, but I wasnt hungry. I became dry mouth and thirsty, but had no desire to drink. I had a slight headache. These symtoms were bc of entrapment in my room. </p><p>The next day I felt like I did the night after I lost my virginity, free in some way. I felt refreshed even tho I was walking around without sleep. I felt very happy and was extra nice to everyone that day. I was very struck and excited and felt I had to tell everyone about my experience!</p>"
}
