{
 "title": "A Nice Buzz",
 "author": "Skandre",
 "citation": "   Skandre. \"A Nice Buzz: experience with Amanita muscaria (ID 20645)\". Erowid.org. Jun 3, 2003. erowid.org/exp/20645",
 "substance": "Amanita muscaria",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "smoked",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20645",
   "Male",
   " ",
   "Not Given",
   "Jun 3, 2003",
   "25060",
   " "
  ]
 ],
 "report": "<p>I have long had an interest in the Fly Agaric mushroom. I found a great deal online and purchased 60 grams of a Siberian strain. I have not yet ingested an oral dosage, but decided I would like to try smoking some since it reportedly has pleasant effects. </p><p>A friend and I were playing computer games late one evening. I packed a nice sized bowl (probably about one gram of material). We used dried cap material, including the gills (some reports claim that the skin material is the most potent). The smoke is not particularily pleasant tasting, but it is not terribly harsh on the lungs. After a few tokes, I began to notice some effects. It is somewhat difficult to explain, but it felt like I was 'about' to trip...a sort of apprehension, but in a pleasant way. </p><p>There were no major visual effects and not much of a body load, but there was a very nice buzz. After smoking another bowl of the material, we both became somewhat giddy. It still seemed like we were 'about' to trip, and the buzz was intensified. After about an hour, the effects seemed to taper off a bit. I went to bed shortly after and had some unusual dreams. </p><p>I woke up early the next morning and noticed I was unusually energetic. I also felt calm and happy (similar to the next-day effects I read in another Erowid report). This nice energy boost lasted throughout most of the day. I spoke to my friend about this, but he did not get the pleasant next-day effect that I had. </p><p>I enjoyed my experience with smoked Amanita muscaria. The effects were noticable yet subtle, and perhaps a good introduction to this shamanic enigma.</p>"
}
