{
 "title": "A Morning Glory Travel Log",
 "author": "Deadhead24",
 "citation": "   Deadhead24. \"A Morning Glory Travel Log: experience with Morning Glory Seeds (ID 2067)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2067",
 "substance": "Morning Glory Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "200 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 2067",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Jun 24, 2000",
   "Views: 11334",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading so much on Morning Glory seeds of late, I decided to try it myself. I counted out 200 seeds (~6 1/3 packets purchased at Home Depot), washed them with a little dish soap, thoroughly dried, and ground them up in a pepper mill.</p><p>What a tedious chore that was! The following I did outdoors using ordinary drinking glasses, coffee filters, plastic funnel, and a warming plate. I soaked the ground seeds in ~50ml Naptha (from Home Depot) on the warming plate for ~20min; frequently swirling and never quite reaching the boiling point, and then filtered (didn't dissolve the plastic funnel; I tried that beforehand). I performed this a total of 3 times. The naptha extract (yellowish and slightly opaque), was discarded. After thoroughly drying the ground up seeds again, I extracted them with denatured alcohol (EtOH w/ MeOH, again from Home Depot). I followed the same general pattern; ~50ml with warming not quite to boiling with swirling for ~20min, then filtering. Again, this was performed 3 times. The ground seeds were discarded, and the alcohol extract (also yellowish) in a shallow glass was thoroughly (~4hr) evaporated using a fan.</p><p>Overall, a bit tedious and time consuming; using a real lab would be much quicker (I miss vacuum filtration and rotary evaporators)!</p><p>Here's my trivial log of the experience afer a light breakfast:</p><p>11:45am Dissolved thick yellowish residue in ~2oz rum and swallowed. Nasty, bitter, lingering taste!!! Washed down w/ a little more rum. Yuck!!!!!! </p><p>12:30pm Nuttin'</p><p>12:45pm Maybe some dizziness; definitely not alcohol-related.</p><p>1:00pm Yep. Something here. Kinda like beginning LSD effects. Heavy limbs. With some concentration, able to induce some slight visual distortions. </p><p>1:15pm Feeling dizzy/heavy limbs...kinda dreamy/sleepy, but certainly LSD-like.</p><p>1:30-4:30pm Layed down in dark room, didn't sleep. Compared to LSD, didn't get as hot, less shakiness, much less visual distortions, particulary with closed eyes. Kinda like LSD, seemed like the same negative stuff (although I cannot really account for the sleepy part), and less of the fun stuff. </p><p>5:00pm Tiredness/dizziness virtually gone. Could still 'force' some visual distortions. For instance, while staring at textured wall or bathroom rug they would start getting that wavy, undulating effect. Didn't work with woodgrain though. Actually, felt rather normal.</p><p>5:30pm Went to a sports bar to eat (driving was a cinch). While waiting for food/beer and after smoking a couple cigarettes, I became extremely hot, lightheaded. I went outside and sat on a bench for ~15min, sweating profusely. Finally felt better and went inside. Forced down half my food. I guess the crowd noise got to me (football sunday!). Very unusual, I have to think it was related to the MG seed extract.</p><p>7:30pm Got home; felt absolutely normal.</p><p>Oh, I forgot to mention...no nausea! Overall, an interesting experience; probably worth trying again. I'll might try 300 seeds next time (and not leave the house). Also, I think I'll scrape up the yellow extract residue and put it in an empty capsule; wicked taste! </p><p>Later!</p>"
}
