{
 "title": "The Real Daydreaming",
 "author": "Extatic Blob",
 "citation": "   Extatic Blob. \"The Real Daydreaming: experience with Diphenhydramine (Benadryl) (ID 20765)\". Erowid.org. Sep 9, 2007. erowid.org/exp/20765",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 1:00",
   "300 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20765",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 9, 2007",
   "Views: 14297",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading up on many experiences on diphenhydramine hydrochloride and similar chemicals I decided to try it myself. It was also a very boring weekend on the campus and my day student friend failed to supply me with some weed. So instead, I asked him to take me to CVS to buy some Benadryl and experience something new. My friend told me it was pretty crazy, but the difference was that he combined it with weed. For people who want to try this out be careful that the only ingredient is diphenhydramine HCL, or dimenhydrinate. It is probably necessary to note that the previous day I took four pfizer brand Benadryl's just to test out if I am allergic to it.</p><p>Anyway, my friend dropped me of at school an hour before curfew. I went back to my dorm and checked in with my teacher and consumed 12 pills which equals 300mg. Then I wasted some time chilling with my roomate and a couple of friends and listened to some techno. After an hour or so, I started feeling a little tired and my body started feeling a little heavy. There was also a little euphoria but nothing great. Just in case, I told my roomate to be cautious If I do strange thing at night. Since nothing was really happening I went on reading some more experiences and read that ussualy people took 600mg. This is when I made a big mistake. I procceded to take the remaining 12 pills and then I realized that diphenhydramine 300mg equals 600mg of dimenhydrinate. I took a double dose and was now ready to face a tough night.</p><p>Around three hours of my first ingestion I started feeling so tired that I went to bed. I turned of all the lights, and experienced my first hallucination. I looked into the corner of my room and saw a shadow transform into a cat. It looked completely real, but I was still sober enough to realize I was tripping.</p><p>After that I don't remember much until I woke up around 3 am or 5 hours after ingestion. I looked into the corner and saw a huge black rat. It was so real, and it ran under my bad. I was so scared that I turned around and shiverd in dark for ten minutes. When I turned around there were three rats in front of my door. The problem was I had no idea I was tripping out. I jumped of my bed and they all ran away. I woke up my roommate and told him we had rats in our room. At first he believed me and helped me search for them. But during out search I kept hearing noises he did not and seeing flies that didn't exist so my roomate realized I was tripping.</p><p>I didn't believe him. I even wanted to call the exterminator service to kill the rats. My roommate put me to bed but I kept my flashlight to myself. Throughout the whole night I kept seeing the rats again but as soon as I turned the flashlight on they would disapper. I finnaly fell asleep and woke up at noon with the worst hangover ever. I had the worst cotton mouth ever and was unable to speak properly. My throat hurt a lot. My stomach was very unsettling and I could not eat anything until the evening.</p><p>I do not advise anyone to do this more than once. It is a trully unique experience but is pretty scary because I saw only things that I dislike or are afraid of. Also during the night I took like 20 pisses. Maybe I'll do it again but in 5 months at least.</p>"
}
