{
 "title": "Effects on Sleep",
 "author": "uni student",
 "citation": "   uni student. \"Effects on Sleep: experience with Paroxetine, Mirtazapine & Trazodone (ID 20766)\". Erowid.org. Aug 12, 2005. erowid.org/exp/20766",
 "substance": "Paroxetine, Mirtazapine & Trazodone",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(daily)",
   " ",
   "75 mg",
   "oral",
   "Pharms - Trazodone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 20766",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 12, 2005",
   "Views: 31511",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm an insomniac uni student who is probably wound a bit to tight for school life. Anyways because of my insomnia my doctor prescribed Paxil (20mg) a day. I was unsure of whether I should take it since I read all the paxil horror stories on the net but decided that not sleeping for days on end was screwing my mind up more than paxil ever could. So I started taking the pills and nothing really happened. I've read all these reports about people's personalities changing, but I can't identify with that. It never really happened to me. My sleep got a bit better but still not normal. </p><p>About a month after I started taking paxil the effect it had on my sleeping wore off. So I started getting a bit crazy again. I had periods (panic attacks I guess) where I felt totally out of it and really scared. They came on for no reason at all. I would be reading a book and be totally scared  for no reason. I figured it was because of my sleep so I went to a different doctor who prescribed me Remeron (he also gave me trazodone when I asked for it). I substituted the Remeron (30mg) for the paxil (no withdrawal symptons from the paxil) and after a week I started taking the trazodone (75mg). Now if any of you are hardcore insomniac listen to this...This combinations of drugs is stronger then imovain, starnoc and lorazepam, it put me DOWN. It was great I had never slept so well in my life. Now (four months later) the effect is gone. Remeron and trazodone are like mm's for me. My sleeping is pretty normal (I guess they fixed it). </p><p>I guess the point of this story is that Paxil had very little effect on me (except for the panic attacks, but they might have been caused by something else). I had no withdrawal symptoms, but I did switch to another anti d.</p><p>I hope someone finds my story helpful.</p>"
}
