{
 "title": "From Euphoria to Detachment",
 "author": "sugoi",
 "citation": "   sugoi. \"From Euphoria to Detachment: experience with MDMA (Ecstasy), 5-Meo-DIPT & Pharms - Citalopram (ID 20787)\". Erowid.org. Jan 29, 2004. erowid.org/exp/20787",
 "substance": "MDMA (Ecstasy), 5-Meo-DIPT & Pharms - Citalopram",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Citalopram",
   " ",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:30",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:00",
   "14 mg",
   "oral",
   "5-MeO-DiPT",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 20787",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 29, 2004",
   "Views: 11358",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been taking 10 mg of celexa daily for about six months; before that I was taking 20 mg for 1 year.  The day before this experience I did not take my celexa, so given the half-life I probably had about 5 mg in my system at the time I took the MDMA.<br>I got up, had some coffee and a muffin, and walked over to my friend C's house.  A nice long walk on a sunny day.  Around 10:30 A.M. we each took 1 tablet of MDMA.  Within about 20 minutes I felt the first alert, stirrings of energy and a feeling of light-headedness.   By 12 p.m. I felt extremely good and was rocking back and forth, moving to the music that was playing, smiling.  As usual when on MDMA, music sounded *fantastic*.  I felt very extroverted at this point, talked a lot and took a great interest in what people around me were doing and saying.  As usual with MDMA, my sense of touch was greatly enhanced and everything felt wonderful.  Waves of bliss and joy radiated through me.  For some time I was looking through PLANTS OF THE GODS with C's 4-year old daughter, and it felt great to share in the innocence and openness of a child as we looked at and discussed the beautiful plants and artwork in the book.<br>At noon C. and I each took another 1/2 tablet of MDMA, not quite feeling the effects as much as we wanted.  An hour and a half later, at 1:30 I started to feel noticably hungry and managed to slowly eat a banana, which helped a bit and also reduced the annoying jaw tremors and clenching.  I continued to feel the floaty euphoria of the MDMA.  <br>At 2:30 we each ingested 14 mg. of 5-Meo-DIPT, and it seemed that within about 5 minutes I started to feel a change, though part of that could have been due to the 1/2 tablet of MDMA I'd taken an hour and a half ago.  More energy, euphoria.<br>After that the trip started to change.  I felt more introspective, more of an inward focus rather than the outer focus of the MDMA.  My visual field became quite distorted over the next couple of hours and reminded me a lot of acid, except maybe a bit more intense.  The visual aspect was probably the most fascinating part, with everything flowing and warping in a weird, impressionistic way.  Communication became more difficult and I felt less able and less inclined to interact with those around me.  Also, my thought processes became more confused - it was more difficult to 'put things together' in a way that made sense.  However, I didn't feel like I was getting a lot of psychological insight or that I could do any inner work in this state.<br>More troubling was how my emotional state changed during this period.  I became increasingly detached from the experience and felt very flat emotionally.  I wondered if I was having a bad trip but decided that terms like 'good' or 'bad' were beside the point.  I was just having an experience, wasn't really into it and that point, and was enduring rather than experiencing it.<br>Over the next 4 or 5 hours I manged to eat a little bit here and there, and that seemed to help to some extent.  Eating was difficult though.  Towards the end of the evening I went for a walk with C. and found that interesting - the fresh air felt great, and moving around helped me to feel better.<br>This is the second time I've tried 5-Meo-DIPT, and I think that I'd like to try it again once or twice, but I don't feel altogether satisfied with it and don't feel like I can get a lot of inner work done in that state.  It does seem to have a strong erotic/sensual component, and at lower doses would probably greatly enhance sex.  If I were to try 5-Meo-DIPT again I would probably do it by itself, and not combine it with MDMA.<br>I'm not sure if the negative aspects of the latter half of the trip were due to my brain being too depleted of neurotransmitters, or because of low blood sugar - I've had problems in past trips involving other substances (LSD, mushrooms) in which hunger and consequent emotional detachment seeming to go together.\n\n\n"
}
