{
 "title": "Ego Loss, OBE, and the Other Joys of Woodrose",
 "author": "Alkaloidaholic",
 "citation": "   Alkaloidaholic. \"Ego Loss, OBE, and the Other Joys of Woodrose: experience with Argeryia Nervosa (ID 20802)\". Erowid.org. Jan 29, 2003. erowid.org/exp/20802",
 "substance": "Argeryia Nervosa",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 seeds",
   "oral",
   "H.B. Woodrose",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 20802",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 29, 2003",
   "Views: 20386",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have ingested woodrose on many occasions. With effects ranging from complete ego-loss to complete bliss and euphoria. It is a powerfull psychedelic indeed! Various seed varieties carry different potencies. [One supplier] carried a variety called Tahitian that proved to be very potent. [Another supplier] Carries a Hawaiian variety of equal potency. Effects can be noticed at one seed. \r\nUsually I would ingest one seed for meditative purposes. I would feel very emotional with strong currents of energy shooting through my body. My first experience with the tahitian variety consisted of 5 seeds. I have never had an entheogenic experience prior to this. I ingested the seeds around 10pm at night and went to sleep. I woke up and had the most frightening experience of my life. I had forgotten that i ingested the seeds the night before. As i tried to walk my body felt as though it was mechanical and it was very hard to move at all. I was terribly frightened that I had gone completely insane. Many idea's ran through my head as I tried to comprehend the horrible state that I was in. I had thought that the end of the world had arrived, That I was reincarnated into an alien body, and that i was just completely insane. I started crying and tried to call a friend for help. As i sat and thought I remembered that I ingested the seeds the night before and slowly learned to enjoy the trip.\r\nAfter that experience I was completely infatuated with the idea of ingesting these seeds and experiencing their power. I ingested 3 seeds a few days later and to verify the dosage and effect. It contains a very strong body high. Walking is most enjoyable. I consumed the seeds many times after this. On another occasion I had forgotten that I swallowed a capsule containing 5 seeds, I have a habit of taking any pill that laying around. After completely freaking out on my girl friend I calmed down and realized that I ingested the sacred seeds. I went over to her house and she allowed me to lay in her bed as she cleaned her room. I found myself slowly leaving my body. I tried to get up and wasn't allowed to. My body had been completely seperated from me. I looked up and realised that I was no longer in my body but now inside of hers. Suddenly I began to think her thoughts. I continued to ask her many questions that made her feel quite uncomfortable due to the accuracy(as later comfirmed). This was an amazing learning experience.\r\n\tI find that when I trip in isolation it potentiates disaster. Everything was torn away from me. Everything I had ever known was completely destroyed and I was left alone, bare, scared.... I came to the understanding that everything in this world is completely false and that when you have nothing to busy your mind with your left with only yourself and no comfort.\r\n\tThe seeds can also produce profound euphoria and bliss. Tripping with friends on a nice sunny day usually turns out very nice. The experience usually last around 12 hours and is greatly potentiate with syrian rue or curde extracts thereof. The combination with harmala alkaloids drags the experience out longer, lasting up to 16-18 hours. Woodrose also seems to have somewhat of an accumulative effect, when one ingests more seeds over the course of a trip.\r\n\tWoodrose is a very powerfull teacher. In ayurvedic medicine it is thought to increase intellegence and lower the aging process. Use caution and respect while dealing with this entheogen. Start low. 5 seeds proves to be quite mind warping.\r\n*\n\n\n"
}
