{
 "title": "Zap! The Noise",
 "author": "Anonymous",
 "citation": "Citation:   Anonymous. \"Zap! The Noise: experience with Mushrooms (ID 2081)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2081",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1997",
   "ID: 2081",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2000",
   "Views: 12882",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn early October, '97 I took 5 grams of powdered cubensis mushrooms mixed in a chocolate milkshake. I had just finished the dose at about 7:45 PM when I felt something poking me in the ass. It felt like a staple. I checked, and there was a screen for my pipe stuck to the elastic of my underwear. I wondered how it had gotten there and how long I'd been wearing it around, and then just dismissed it as one of those odd things that happen to you when you're tripping.\r\nI started feeling the effects at about 8:15. I felt I was being pulled into trance, so I got as comfortable as possible in the closet and closed the door. I was having some crazy auditory hallucinations, buzzing and bubbling sounds that produced accompanying visuals. Then I heard The Noise. The Noise was a high-pitched electrical 'zzzzzzzap!', and when I heard it, I felt as if my brain had been lashed with an electrical whip. It was painful and scary. I tried to find its source, but in my condition it was impossible. I couldn't even tell if it was coming from me or somewhere else. I tried to contact the mushroom entities to ask them about it, but they pushed me away. Confused, I pulled myself out of the trance to try to figure out what was going on. When I got out, The Noise stopped. I thought maybe turning off the lights would help, and I decided to try being in another room. I went into my bedroom, put the computer on its grooviest screensaver, got comfortable and went back into trance.\r\nZap! The Noise was back, louder and more painful than ever. I turned off the computer and tried again to contact the mushroom entities. There was no response. I moved again, into the living room. I laid down on the couch and drifted back into trance. The Noise was still there, but I felt I could control it somewhat by changing my thought patterns when I heard it. I also noticed that it manifested itself whenever I started to fall asleep. I felt better and began enjoying the trance. I spent a lot of time thinking about those people that I love, seeing things from their points of view. However, I didn't have much choice as to what I was allowed to think about; I had wanted to try some experiments during this trip and I didn't have the opportunity. I was a little disappointed until the next trance.\r\nThis time the mushrooms were there. I immediately sensed their presence, and was filled with their omnipresent love and warmth. They were happy and goofy and being with them made me giggle. They tried to show me jokes- my mother-in-law's existence, for example, was shown to me as the product of some kind of Cosmic Silliness. I told them that my husband was planning on tripping soon, and they replied that they looked forward to seeing him, but they seemed to find that hilarious too. They also told me that I should apply for a certain job, and gave me the idea that my working there would be highly amusing to them. I didn't quite get the jokes, but I giggled anyways (it was impossible not to). I asked the entities why they had pushed me away earlier and they said, 'You needed to think about that stuff by yourself.' I came out of this last trance at about 11:45 chuckling and full of love and happiness. \r\nThis was a scary trip in some ways- searching for the mushrooms only to find that they weren't talking to me for most of the trip, and I never did figure out what The Noise was or where it was coming from. Overall, I learned a lot about myself and those I love and I don't regret the experience at all. I only hope that next time the mushrooms will be with me the entire trip- it makes all the difference in the world.\n\n\n"
}