{
 "title": "The Matrix",
 "author": "Gutter",
 "citation": "   Gutter. \"The Matrix: experience with 5-MeO-DiPT (ID 20826)\". Erowid.org. Jan 30, 2003. erowid.org/exp/20826",
 "substance": "5-MeO-DiPT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "5-MeO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2003",
   "20826",
   "Male",
   " ",
   "Not Given",
   "Jan 30, 2003",
   "9093",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHaving had quite a keen interest in tripping, particularly new and unexplored compounds, and cid and shrooms being pretty scarce in town, I was thrilled to aquire some Foxy and AMT. The Foxy was in the red capsule (ie. Foxy Lady) and the Amt in the smaller blue caps.</p><p>Set the pre-trip mood very nicely, some matrix soundin shit, well i dont kno which one will send you home, unless you live in fuckin outer space. So i elected to take the foxy first. Let me say i watched the kid fill the caps and he definitly did not have a mg scale or any for that matter. There was quite a bit in there id say it looked to be an overdose for a chemical who's high dose range is 20 mg. </p><p>So at 6:00 on a monday night, at my home i took the capsule. Watched Yellow Submarine hoping to have the trip kick in and enhance the move a bit. Let me say that my expectations were that Foxy would be like E with a little bit of a candyflip feel to it. Well i sure feel sorry for those people who took this thinkin it was E. At about 7:30 i got the feelin that i might be comin on, it felt a bit like the tail end of a roll. I decided to go in my room and play some electric guitar. I began to notice some effects like acid, a little paranoia, trails, very much like acid. I also noticed that it kept rising and rising. Very different from my previous thoughts that I had taken too little, I got the idea that i might have done the exact opposite. </p><p>            I began to trip pretty hard, visuals, and the strangest thing about this substance is the fuckin audio. This is because of the similarity DIPT (right?) and everything sounded a pitch or two low, everyone sounded like aliens. I watched a tv show with my little brothers shortly after and then trip seemed to be coming down a bit, I was almost feeling normal. Not the case for very long.</p><p>I went downstairs at about 9:00 and i was tripping pretty hard again. I went on the computer and the screen and everything appeared to be curved, (fisheye?), like classic LSD kind of shit. It felt like i was on 10 hits of acid, although ive never taken 10, I would assume this is what it would feel like. I started watching the Doors movie and it was scary. All the people in it's bodies would breathe, much like the hotel scene in fear and loathing.</p><p>It seemed like I could only hear half of the audio of the movie, like my ears were plugged up. What i could hear sounded like a fuckin mutant alien or something terrible. It was pretty disturbing. My mom was telling the dog to go outside and she sounded like a robot, I thought Oh my God.I began to feel I had gone insane, I would get up to do something and forget what I was doing and just be standing there. I kept thinking to myself 'come on man stay here maintain dont go crazy its alright'.</p><p>This feeling wore off after awhile but i was seriously fucked up. The body load from this shit is the worst i ever experienced on anything, rivaling even some DXM trips with Corcidin. I went upstairs to try and get some sleep at about 2 still tripping heavily. I felt like i was dying from the inside, my fuckin stomach was very angry with me having hit it with a raw research chemical. I would burp occasionaly and it would taste absolutly horrid.</p><p>I lay in bed and listened to music all night, I wanted to listen to every cd i owned with this 'effect' still on. It wasnt the music it distorted, although it sounded especially crisp like from a record or something that acid mkes tunes sound like, but the voices would go a few pitches low and it was amazing. I did not sleep for 1 sec that night. I recall a visual I was staring at this street light I can see from out my window and i focused and everything around it disappeared and millions of stars surrounded it and it was the biggest one, the fuckin bible star, (David?).</p><p>I was awakened for school at 6:45 the next morning, still tripping very heavily. I had trouble doing normal things, like bathing, I just stood there with soap in my hand for a few min thinking what the fuck do i do with this? Getting dressed was a 20 minute adventure, ok next step, socks, I knew i was pretty fucked up if I couldnt get that shit right.I couldnt wait to get outta the house, I didnt want my parents to see me like this, It was very strange becasue i was talkin to them like as I was peaking the night before and now I was so fucked up I couldnt possibly maintain a straight conversation with them.</p><p>My ride arrived, and I was so happy. Smoking a ciggarette was a task I couldnt complete, I barely knew what to do with the fuckin thing. Got to school,still fucked up as hell, my stomach felt like it was melting, I was extremely sketched out during school. I was worried the resource cop might see me walkin all sketchy and say something. If a teacher was to talk to me I would have been fucked. I managed to make a plan, get to the class, put your head down, shut the fuck up, dont draw attention. It worked pretty well. </p><p>Sometimes I was alright like I could just relax for a minute and was still trippin, but not for long. This started to come down a bit by the end of the school day , although the stomach discomfort was still there. It was not until I woke up Wednesday morning, more than 30 hours after ingestion, that I felt completly normal again. </p><p>    I know its not just me, but when you take this shit, you gotta keep checking if you shit yourself (hahahha), its fucking true though. I am glad I got to try this substance once but that was certainly enough for me, I dont discourage anyone using this but maybe try to figure out your dosage and start low. This is not Acid!!!!!.................PEACE..Gutter</p>"
}
