{
 "title": "Snakes Below, Dragons Above",
 "author": "Waking Lifeform",
 "citation": "Citation:   Waking Lifeform. \"Snakes Below, Dragons Above: experience with AMT (ID 20824)\". Erowid.org. Jan 29, 2003. erowid.org/exp/20824",
 "substance": "AMT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "AMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 20824",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 29, 2003",
   "Views: 9286",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBackground: Over the course of the past 6 years, I've done a wide array of drugs compared to most of the drug community, but nearly all in hopes of gaining knowledge and experience through the use of these various substances. Regarding AMT, I've had a low dose experience (10-20mg) once before which was really more of a side-effect trip (queazyness, etc.) with a plateau of some open-eye visuals than a psychedelic journey. Still, starting with low dosages is good to familiarize oneself with the substance at hand. And with a potent chemical such as AMT, I'd like to be familiar as possible.\r\nNOTE: These timings are all approximates; I didn't write these times down until writing this report.\r\nT+0:00 - 10:30 AM - Along with my two friends, A, J, injest approximately 50mg of AMT-HCl. Fasting is a great method to prepare for many drugs; I thought this trip would be no different. Unfortunately, it turned out that fasting wasn't such a good idea for me and my psychonautic buddies.\r\nApproximately T+0:15, I began to feel queazy, but decided to hold back on vomiting so as to get more of the AMT absorbed. Feeling the onset already coming on, we hopped into A's car to head to Santa Monica Beach to arrive before we REALLY started tripping. Soon after, we had to make a stop: I couldn't hold the queazyness back any longer, I had to vomit. I knew I should have eaten something.\r\nT+0:45 - Arrived at Santa Monica Beach. It was a nice day to be at the beach, especially with good friends A, J, and AMT. As I got out of the car, the queazyness immediately returned, and I vomited again. I saw a good amount of white powder inside my mucus, which means the AMT didn't absorb fully. Damn. Still feeling the onset of the trip, I knew some of it had absorbed, so I decided to make the most of the day and go with the flow. Shortly after I vomited the second time, A and J vomited, also regurgitating much of the AMT.\r\nNOTE: [The 50mg dosage listed at the top was therefore not quite accurate; what we experienced was from my guess about 30mg, but I don't know exactly how much I vomited up, or how much was absorbed in my system, so anyone's guess is as good as mine].\r\nWe walked along the beach toward, well, we didn't really know where we were going. At this point in time, my trip was becoming like that of a 2nd plateau DXM trip in terms of not feeling like I could walk normally. Walking through the sand was like walking through a thick swamp of mud. Then the open-eye visuals started kicking in. I began noticing how the sand swerved and shifted with the motion of a waterbed, but with the texture of a rug. J  commented on how it was as if snakes were slithering underneath the surface of the sand, and I couldn't agree more.\r\nThe next thing I saw blew my mind completely.  Looking up into the sky, I saw a dragon! It was made up of the clouds above, staring at me right in the eyes, breathing cloudsmoke through its nostrils. This seems like a scary thought, but for some reason I wasn't afraid at all. I just stared at the dragon, shifting around in the sky.  J, and A, laying next to me in the sand, were tripping themselves. One of them later commented that he saw two people ballroom dancing in the clouds. What a sight to see. The AMT took our imaginations to new heights.\r\nAt this light a dosage of AMT, I can't say that time was nonexistent, as I've experienced on LSD and LSA, but I can say that time was meaningless to me (moreso than usual). From about \r\nT+0:45 on, its almost useless to give times, but still I'll try. We probably spent a good two hours just laying in the sand, staring at the snakes beneath and the dragons above, though I'm not at all sure.\r\nThis was without a doubt a smooth trip. We were walking to the pier when I urged J and A to go on without me. I spent the next 10-15 minutes walking along the shoreline by myself, experiencing euphoria the whole time.  This reminded me heavily of previous DXM trips. The song 'Shiver' by Coldplay kept playing in my head (so much so that I could ACTUALLY hear it) while I walked, and this only added to my sense of euphoria. Life was beautiful. When I finally caught up with my friends, I was feeling ecstatic. There was no paranoia in the trip, either. We passed by many families, and simply allowed them to enjoy their own worlds while we enjoyed ours.\r\nWe decided at this point to go back in the car and drive back to Westwood. I was in the back seat, and this is where my trip paralleled another drug, Ecstasy. My DXM-type euphoria now transitioned into MDMA-euphoria (you may disagree, but I feel there is a strong difference between the two). I think many have experienced what E-euphoria is, so I won't go into any more than that. Needless to say, I was still having a great time.\r\nWhen we returned to J's room, we spent the next hours visually and mentally stimulating ourselves with things around the room and thoughts within us. Although we understood that the trip would go on, we returned to reality a few times, each time going back up the AMT-rollacoaster of fun, with the trip slowly tapering off each time.  I don't know how long we were in that room for, but when we came out it was already dark.\r\nAfter A left for home, myself and J continued to chill out until about 3:30AM, which is about T+17:00, tripping minorly until we fell asleep.\r\nREFLECTIONS: AMT is a diverse drug within itself. Within one light dose, I tapped into DXM/MDMA/LSD/Mushroom realms, and I'm sure there's more to add to the list. Within the next couple of days, I noticed the world in my eyes changed forever, quite literally. My vision is now slightly different (I don't want to scare anyone, it is ever-so-slightly) in the sense that trees seem a bit more green and frosty, to give one example. Imagine having a very VERY thin cataract over your eyes. This may classify as a mild case of HPPD, which I myself may argue against, but even if it is, to tell you the truth, I prefer it. And as far as AMT goes, the next time I ingest, I'll remember to eat something a couple hours beforehand.\n\n\n"
}