{
 "title": "Solo Shroom Trip Log",
 "author": "M.M.",
 "citation": "   M.M.. \"Solo Shroom Trip Log: experience with Mushrooms (ID 2083)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2083",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.53 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "",
   "2083",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 24, 2000",
   "Views: 4424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[Post-trip comments are in brackets, like this sentence] </p><p>May 16, 1994 </p><p>6:01pm Began ingesting 1.53 grams dried mixed with 1 can of tuna. Ick! sand! Chewing pretty well.. would do better but the sand is annoying Getting OJ to wash everything down with... Put some Yes on, and finding a ds9 episode to watch.</p><p>6:14 Completed ingestion. Watching ds9. Or not. recorded it wrong. Drank a glass of OJ. Put cool music video on instead ;-)</p><p>6:20 Maybe +1. A couple alerts. Chill. Bzzt on left eye. A little body effect. </p><p>6:25 A little buzzing in ears... some body energy perhaps.</p><p>6:28 Unignorable effect... buzzing, heavy limbs arms seem kinda long... neat! Feeling some more body energy.. like restlessness....</p><p>6:32 Massive energy.... really rushy actually. Realized I don't have to write EVERYTHING into here. this is just a little log... I can go anywhere or do whatever, and it won't show in this record....! </p><p>6:38 Played with the flashlight for a little while. We're here! Seriously +2!!!!! Fairly equivalent to [previous very mild 1st experience]... i think... but not sure. Still seems to be building.</p><p>6:41 Urge to take a walk. Some nausea. But really zinging, all in all!</p><p>6:46 Wouldn't even think of driving at this point... thoughts are lucid but there is so much more stuff interesting than this need to type.... </p><p>6:49 Can't beleive how much energy,. neat idea for an sf story... drug which makes the safety curcuit in your head go... so you can get into infinite loops!!! </p><p>SO MUCH ENERGY.... A little interested in open eye visuals but can't get them going CEVs are somewhat interesting...pink and white brain coral things... </p><p>Called M&K. </p><p>(Post Call) Okay to talk to but things are really moving faster and faster right now... arms seems a zillion miles away. the keyboard is so amazingly small, this is cool! I wonder if my blood pressure is up, cuz I can see things popping out on my hands a bit... interesting... should really have medical equipment so SOMEONE can figure out what this does to your body... mind you, right now I don't mind what's going on. But I can imagine being in a state where I WOULD!</p><p>7:12 ENERGY CITY! Standing is fucking hilarious! I keep over amping my motions.... like overcorrecting would casue a fall... this is REALLY COOL. </p><p>7:28 +3!!!!! It's too much to do to keep typing!</p><p>7:44 Music is wonderful.. the energy is a pleasant if a little demanding. The urge to let the mind wander into all sorts of interesting places tends to be very strong but the urge to write everythng down so I can look at it while I am striaght. Also overwhelms I am aware of all the viens in my hands and the speed with which I am tyyping is terribly intersting... the veins are really wierd... But the music and everything is the GREATEST... plus the tenetion in my arms from the awkard way I am writing.</p><p>7:55 I can see how this can be overwhelming.. the energy is amazing.. you just have to let it go, and hang with everything.... it's so pleasant. but you can't force it ... just hang tight and enjoy the RIDE!!!!! wow.</p><p>[Ate a chocolate truffle... Was very sensual. Drank some water. Wandered around, petted the cat, etc. ]</p><p>8:34 REVELATION! I have many many expectations and aways of looking at people which express the inherent negativity of the situation. But, why don't I look at things instead with an air of HOW MUCH THEIR CURENT SITUATION IS VIEWED BY THEM AS PSOSITIVE.... AND PERHAPS BY LOOKING AT THINGS FROM THE 'THINGS ARE FINE' PERSPECTIVE, I CAN GET SOME INSIGHT INTO HOW I MIGHT DIRECT MY OWN LIFE TOAWARD A SIT</p><p>Stop expecting everyone to share your perspective of how miserable their existance is. Nah. its not that dramatic... but I have a flair for the bold... huh. way from this... look at how other perceive things as positive,... and stop epecting everyone to share your perspective of how miserable their existance is. Nah. its not that dramatic.,.. but I have a flair for the bold... huh.</p><p>8:37 Typing this is SOOOOOOO neat I can disconnect my mind from the method of expression which is the words coming out of the fingers on the ends of my hands... I wonder if what am typing makes any sense? wowowowowowowow</p><p>[ I think I typed straight for about 20 minutes at this point. ]</p><p>Must try to record some of this.</p><p>My face in the mirror. My hands RIGHT NOW!</p><p>The warmth of the notebook on my lap. the focus and every with which I interract with everything I wish I knew this keyboard better because it is a limited way to express myself because I know I am not hitting the correct keys all of the time. Howver, I am getting better, I beleive with every passing second. I know I am working harder to hit the correct keys, and it seems easier than before to do the right thing and let my hands wander over the keys but how to harness this kind of energy... not really any way... its just something you can experience. but then you have to let it go. Intersting as hell. So many inhibitions completely gone. I can type this and know I WILL BE ABLE TO LOOK AT IT LATER... BUT PARTS OF MY BRAIN ARE WATCHING THE REST OF THE WORD (Damn!) Or rather, are watching what I am doing instead of just GOING with it.... there's always this 'EGO' observer of what you are doing and making sure it's okay. Somehow part of that is somewhat disconnected when I type like this because I can just let everything go and keep things going... the hands are now the observer recording wherever my mind is (just closd my eyes) however the world pulsates... a fish swimming.. silver... angles jumpsuit THIS IS SO FUNNY TO REREAD EVEN NOW!!!!!!! heheheheh! it will be nice to rest thgouh.. the effort that must come into taking an LSD trip where you are on the road for HOURS AND HOURS. I am somewhat exhausted by all this... but it's ok. The lightening outside is VERY surreal... the light from the notebook demands attention but the outside clouds swarm by the two trees (I couldn't write this way straight, because I wouldn't be able to suitably let go of that ego thing I WAS THINKING ABOUT EARLIER.)</p><p>NOTE THAT MY TYPING IS MORE OR LESS EXACTLY IN SP(AJHGRGHRG!) [I mistyped and was annoyed, I think. Speed?] with my thoughts. I can slow down or I can type fast. There is a need to be fast becaise I know this state won't be here forever... but there might be something to bring back with the looking at things positively thing... It's amazing tht I can make my hands be this disconnected organ capable of typing whwtaever I send at them... never protesting but knowing when things are a litle too much and de,amdmg tjay tjeu ne et slow down so tjeu cam ne accirate agaom [demanding that ??? slow down so they can be accurate again] Wow.</p><p>Not accurate at all. Much easier with the eyes open. This will be so STUPID to read later... but its fun right now... which IS the point, isn't it? WHO DO I expect to judge me? Or do I judge myself,.. this is silly... but this is getting at something important I think I am understanding this whole trip thing now... it really lets you look at things in a straightforward way,... the music is fine... but the ability to type and to reflect on what is being thought is FACINATING!.................. I can't abstract too much. I feel this need to type evething. </p><p>If I ERASED THISS I WOULD NEVER KNOW WHAT I WROTE!!! But, would I even remember that I had wanted to rease it. This ability to type is cool cool its just so connected and tight just typing away while everything in the world fors on my[roars on by?]... I can keep my head on several different levels at the same time! Do I do this all the time? Do I always hear the music, look at the window, see the lgithing, focus on what I am doign, type and write? This is like a catharsis thing?!! Everything just pooring out. </p><p>I mustn't erase. But that's just a weird 'going home' craving. I've THGOUHT these things, but I can get them on paper(ish) now. This is pretty amazing. And there is NO FEAR that what I took is something besides what I think it is.... CUZ I grew it! I made it! My work my time my effort... this need to share is ammzing... the cat ... where is she... </p><p>(I am aware that I am rambling. I AM aware that things are going VERY VERY fast, and that I'm doing the stream of conciousness thing. Abstract appropriately... I'm aware that I'm aware and so forth.)</p><p>I want to share this. Must erase that bit. heh. This will be interesting later. I know what it was, but the rest of you won't. I can't really even tell you that.</p><p>I keep typing because this will be so am(saved)azing to read later. But its tiresome to type, but the recordning is just part of this experience... other experiences will be different (ITs getting dark now) Do we always have this much going on in our hgeads... awareness of the windows my feet the time te [the?] my OWN awareness? I wish I could type better than I do so that others who read this will be able to see the thoughts which are, I'm afraid, rather crystal clear at this point.</p><p>BUT so effing much! So many levels. Must keep all this under control most of the time! but not right now. Just me and this fucking typewriter. If you'd only seen all the silly images I've been parading And we can't possibly forget the face in the mirror. Mine, but much DIFFERENT!</p><p>WOW.</p><p>Can I show this to anyhene? A measure of how close we are I think? But that thought first came wihout reproach, and now it comes with a more 'is this a good thing to say standpoint'... the ego thing! (I hate typing h's I won't type tem any more becasue I always it te wrong goddam key tis is fun! No fucking letters I can't say! Damn I am estatic h(oops!)ere! Tius is great hhhhhhh (see its not gone, just more fun not to. Why this stupid paranoia? it is </p><p>odd</p><p>that this is going on so long.. I took the shroms at 6pm. Its now 8:54. How much longer?</p><p>It's okay.. but I can see how the wrong UNSAFE setting could make you crazy. I KNOW KNOW KNOW what's going on, so I'm (dont foget what you thought before) I know this is neat; I know this will look silly... but I can explore my thoughts clearly..or is that something I READ? OH I DON'T KNOW ... BUT ITS THE WAY THINGS ARE right now..........</p><p>stop. breath. this i(knee) can't get everything down right... hsi vcsant [this can't?] type fast enough.. this is VERY PRIVATE... but amazing. can see my thoughts... look at each one. WHY MUST I express why this is good? </p><p>Its not the destination, its the FUCKING OBVIOUSLY JOURNEY THATS important!</p><p>It's what's going on NOW NOW NOW NOW </p><p>Selfish... interested. amazing.</p><p>8:57 [still typing away]</p><p>No time sense.... I'm listening (ENERGY TREMORS WITH THE thoughts...) BEAUTIFUL EVERYTHING</p><p>WOW. WHAT will this look like.</p><p>Always the watcher making sure what I say is OK.... can i even HOPE to let that go?></p><p>Who can I share this qith?</p><p>S? K? It would be too different. [I recall I was referring to mushrooms, not to this document in this sentance.]</p><p>I'm a little afraid to bring up people- to be judged. But that's the way it is. </p><p>(the observer watches me type out of order, and keeps a note.) Wow. You could beleive yourself insane here... but this is just a way of looking at the way your head always goes about its li </p><p>(private again, sorry.)</p><p>NO! I'm sharing too much THIS IS AMAIZNG... I AM SO AWARE OF what's on the surface and what is below. </p><p>Wow.</p><p>Mustn't type further... can only share this with someone who is here with me. h Sorry, folks... more energy than I can do to keep writing</p><p>9:01 the observer says!) (feet tickle too!) fighting little bits of my personality.. each one demanding to be [the n let] [the next?] to talk.... </p><p>Enough. Save it and go. DARK darK dark</p><p>If you ever thought stream of conciousness was cool... it don't hold a CANDLE to this... wow.</p><p>(Observer notes tickle left toe, things I won't discusss.) </p><p>Ah. Someone wants to go, someone wants to hang here.</p><p>COPELAND! I *****%&% myust know what's going on inside someone else head! This is a bring home idea! WHAT do you R e a l l y think?</p><p>(Where will you lie, as, um John Anderson seems to be singing)</p><p>too much too much! so much but its good I can just roll with it I </p><p>9:03 [still writing]</p><p>SEEMS LIKE IVE BEEN RAMBING FOR AGES...</p><p>THE BIT WITH THE LETTER uh (oops) o I can't type it again. Tis will be SOSOSOSOSO funny to read later (LAUGTER TE OBSERVER NOTES). (ALMOST IT AN !!!)</p><p>Cras test dummies on now. I can tink it, see it, but its so muc fun not to use sentances i know include a dreaded letter!</p><p>I CANT EXPRESS LAUGTER WITOUT IT :):) :):) I GUESS I CAN.</p><p>9:05 says the observer.</p><p>(The thought)</p><p>How will I explain all tis to but I tink I will let oters try it first, before tey can see were it puts you. (I can type h, I'm just not doing it right now... laugHter mucH Humor!) (WATERING EYES AND STUFF notes the observer. who doesn't like the goddam caps lock key, as I've mentioned.)</p><p>Must post this. Facinating. other people's head might understand it... I know *I* do...</p><p>So this is why Abbie and co. thought it might be good to understand psychosis..? nah. It's just another way of expresing being. True insanity couldn't multiply 6 by (HHHHH!!!) 9. = 54. And the act of multiplying or thinking is diferent from the method of expression.</p><p>Keep it to myself, thinks the obsever.</p><p>'This is a fine place' says Geddy.. (Counterparts... ah yes to yes $#5 #5!)</p><p>Recap. What to bring home! The observer. (trip is SO accurate!) Positive perspective, vs. negative expections of how I think evferyone else must perceive things... I think 'Blah', so so must they!</p><p>JS must've done this. :-)</p><p>OOOPS! mentioned a person. MAKES IT PRIVATE, HUH!</p><p>[M&K call at this point. Long talk about many many things.]</p><p>h Humph. Much more slowed down now after an hour and a half talk with M&K. very fascinating experience all in all. I wasn't really prepared for the ?profoundness? of it all...</p><p>Enough for now., I think I'm getting tired.</p><p>10:43 REREAD EVEYTHING. interestng. way fascinating.</p><p>[Went to sleep at about 11:30. A little tough to relax at first, then drifted off into a solid sleep. Woke feeling a bit groggy at 7am. No problems doing a good workout, but a little draggy today.]</p>"
}
