{
 "title": "Mechanical Rolly Shrooms",
 "author": "Andy Else",
 "citation": "   Andy Else. \"Mechanical Rolly Shrooms: experience with 5-MeO-AMT (ID 20833)\". Erowid.org. Jan 29, 2003. erowid.org/exp/20833",
 "substance": "5-MeO-AMT",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "3.0 mg",
   "oral",
   "5-MeO-AMT"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20833",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 29, 2003",
   "Views: 11305",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all stared when I got it in the mail. Here is my experience off of three milligrams.</p><p>It was Halloween 2002 to in Madison. I brought my near full bag of 5-meo-AMT up with me from Milwaukee. We dosed at 10:30 PM and waited for the puke to come. I puked in mid sentence in the dorm hallway. I held it in though and ran to the the bathroom and puked the hardest I had ever puked in my life. I washed out my mouth and we headed for the hot zone (States Street). </p><p>As soon as we hit States Street we noticed drums playing my friend I was with was shrooming and I tried to get him to go into the circle with me. He said it was too intense so we comenced walking towards the Capital building. I told them that I would 'peak at the peak'. I was feeling what I now know as 'rolly' after taking ectasy three months later for the first time. The feeling was like numbing of my buddy. My skin felt somewhat electric. Eventually we went into Taco Bell. It was booming with customers. I sat down and looked at my hat. I closed my eyes and then it happened. The visuals came. </p><p>I saw a skull first, but wasn't scared at all. In fact I was in awe at the clarity of the CEVs. The skull turned into jesus, and jesus began to bleed on mary who was holding a cloth. I opened back up my eyes and watched the visuals disperse into the air. I had an extreme amount of energy and got all my friends off their asses to go back outside. </p><p>I group of rastafarians were playing drums infront of a store. I went beside them and closed my eyes and danced. It was a beautiful moment in my life. I danced in perfection with the beart. I was a flawless soundwave. I visualized these colored ribons of sorts molding around my body as I danced. Then a rasta had to take a break and asked me to drum. I stepped in and played the best drumming of my life. I closed my eyes and let the energy that the drug gave me take over. The drum beat started to get faster, and I noticed how fast my heart was going. I needed to stop, I needed to slow down, so I stopped, and we went back to the dorms. </p><p>That was the end of the fun. My friend who was shrooming stopped tripping long before I did. I sat in a dorm den alone speedy as hell. I watched the birds trail through the sky at 6:00 in the mornings. Alpha-O has the most insane trails. The are different then any other. The trails slither, that's the best I can describe it. I didn't get any sleep but felt fine the day after. My brain didn't feel cracked out but my body did. Oddly enough, I can say that my brainstem felt funny the next day, but I even feel that on shrooms if I don't sleep.</p><p>Conclusion-</p><p>I think my dose was too low. I think 5- 10mgs is a key dosage. Since this experience I have given many my friends this dose and they have been pretty happy with it. Some of my friends like this drug some don't. I think it is great, but need to do it with another person next time. I didn't feel cracked out, even though I didn't sleep and my brain tells me it isn't that bad for you. But my dose was low. I'll write back when I do more this spring. For those who like natural stuff, stay away. It feels very man made. Industrial. Just be safe, know the dosage, and make sure you have time. This stuff is a commitment.</p>"
}
