{
 "title": "An A+ In My Book",
 "author": "Kava Man",
 "citation": "   Kava Man. \"An A+ In My Book: experience with Kava Kava (ID 20866)\". Erowid.org. Feb 14, 2003. erowid.org/exp/20866",
 "substance": "Kava Kava",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3 cups",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20866",
   "Male",
   " ",
   "Not Given",
   "Feb 14, 2003",
   "64383",
   " "
  ]
 ],
 "report": "<p>I'd read a lot about Kava, and had decided that it was worth a shot. I'd tried just about every other licit and illicit substance that I could get my hands on, and I'm reaching a point in my life where I'm ready for something less intense. From what I'd read, Kava was just the substance.</p><p>I had heard about a reverse tolerance with Kava, similar to that with Marijuana. Basically, the first few times you try it, the results will be less than 100%. Therefore, I gave it several tries before I drew any conclusions.</p><p>I ordered a pound of Hawaiian Skinless Mo'I from a popular provider, and it arrived a couple days later. Excitedly, I prepared my first beverage. *ugh* It tasted like ass...I prepared it just as the container suggested, and managed to choke it down. Not only did it taste disguisting, but I didn't notice any effects.</p><p>After several tries, and eventually getting my hands on a more potent variety, I was able to understand what all the hype was about. </p><p>My most recent experience involved 3 glasses of Kava, each containing about 2-3 Tbsp of Kava powder each. After each glass I can feel myself sinking deeper and deeper into relaxation. I would describe it as a mix between the effects of marijuana and alcohol, although containing NONE of the negative affects with either.</p><p>It is relaxing like alcohol without the intoxication, and it makes me mellow like Marijuana without the anxiety or the stupidity. I get sort of a squinted eye relaxation and I just want to lay down. My bed feels like a soft cloud. I've heard of public speakers taking a glass of kava before hand. I can understand why. It definitely reduces a ton of anxiety. </p><p>Kava is a great beverage. Granted, the taste definitely takes some getting used to. It took me a while to find a preparation that is palatable, but it is definitely worth it for someone who is looking for a nice mellow substance. It is not an intense feeling, but like someone else had mentioned, it is definitely not placebo either. Kava gets an A+ in my book.</p>"
}
