{
 "title": "A Mixed Reaction",
 "author": "Indo Smoke",
 "citation": "   Indo Smoke. \"A Mixed Reaction: experience with Mushrooms (ID 2087)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2087",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2.8 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2000",
   "2087",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 24, 2000",
   "Views: 4210",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWow is one word that perfectly describes my first experience with shrooms. Pot has been a part of my life for a few years now, and I have always been curious to see what shrooms would do to me. I had only heard good things about it and was ready to try it, but somehow never got round to it. Well it happened like this:</p><p>One typical day, I was at a friends room, just smoking pot and relaxing with a few of my friends. Another friend came in and said he had shrooms, I imediately knew I was going to try it once and for all. I consumed maybe 1/16th of an ounce, and just sat there talking and waiting for the fungus to take effect. I didn't really feel it for like a half hour, but then it hit me. It went suddenly from relaxing to very intense in the room. </p><p>I was immediately removed from reality and thrown into my own little, lonely world. I was rolling, I mean i was totally rolling, over and over again. I was confusing myself and sort of flipping out. I was trapped in fear in a world that i thought I could not get out of, but desperately wanted to. I remember thinking, what I would give to have things normal again. I was freaking out. I started jabbering on, and really felt that I was annoying the others in the room. I wanted to stop and just chill, but couldn't. I hudled up in a corner of a couch and just kept talking to myself, convinced that I was going through a bad trip. It was way to intense for me to even look around the room and try and see visuals.</p><p>My friends then picked me up and said that we all should go for a walk. Suddenly, my whole trip flipped upside down and I felt great, like a million bucks.....a billion bucks. The world had never been better, and I was ready to do anything. We all went into the basement and danced like crazy. It was great. I was seeing the sorroundings perfectly, things were spinning, I was just great.</p><p>I ended up going to bed eight hours or so after I consumed the shrooms. I was still seeing small visuals when going to sleep. It was great. I woke up, had no side effects whatsoever.</p><p>I intend to try shrooms again, hoping that the next time I do them, I won't have as an intense beginning. I definitely recommend that you try it once. Pot still remains my drug of choice, but shrooms may jump in my life once in a while.</p>"
}
