{
 "title": "Easy",
 "author": "monkpea",
 "citation": "   monkpea. \"Easy: experience with GHB (ID 20916)\". Erowid.org. Nov 9, 2005. erowid.org/exp/20916",
 "substance": "GHB",
 "bodyweight": "224 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GHB"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 20916",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2005",
   "Views: 10903",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm not a fat guy just big (6'5') and not lanky, hence 16 stone. Anyway, this is less a trip report but more an attempt to characterize GHB. <br>I have explored GHB at various dosages, in various situations for over a year, and I like it! I don't take it daily, never used it to rape someone and never been admitted to an emergency ward because of it. What's the point having sex with a sleeping person, and another thing, how the hell are these people meant to be spiking people with 5g of such a salt substance? I just don't understand.<br>I don't really understand it being called liquid X. It is what it is: A relatively safe euphoriant with few side effects. MDMA is an incredible, powerful drug, worthy of respect, which is very damaging when used irresponsibly, which is V.easy to do!<br>People seem quite disappointed with GHB, expecting MDMA, not me!<br>All doses are of the mono-sodium salt, mostly dissolved in water, and drunk like a shot followed by non salty tasting water. It's not the most pleasant of drinks. <br>SUBJECTIVE EFFECTS:<br>SMALL DOSE (1g-2.5g):<br>A barely perceptible removal of any edginess I might have had, followed by a return of edginess, and perhaps a difficulty sleeping if I took it within 3 hours of going to bed.<br>MEDIUM DOSE (3g-5g)<br>A pleasant euphoric state lasting about an hour and a half, accompanied by some optimistic excitement. Reasonably easy to get to sleep if I lie down before I peak, hard if I let myself come down. Next day I can notice I took it the night before, but only just.<br>HIGH DOSE (5g-10g)<br>Intense experience! Eyes closed imagery, bright colors, difficulty seeing, nausea, diarrhea (not unpleasant), writhing and muscle stretching. lmost guaranteed to pass out, if taken during the day, to wake up 4 hours later, if taken before bed time, the next morning. At this level it does produce a hangover, but it is more on a par with marijuana than whiskey: Slightly cloudy thinking, and a strange 'pressure' type feeling the next day.<br>EXCESSIVE DOSE (15g-20g)<br>See above followed by passing out and a nasty version of the hangover described above, not recommended, only done once to see what happens! There is nothing to gain in going over 10g, except pain and probably some kind of damage. (It's obvious but: moderation IS the key to all drugs, it's sad seeing people racing thru' their youth being 'cool'.)<br>DAILY USE (~4g a day)<br>Tolerance develops quickly, I have never noticed any addiction however, except perhaps to alleviate the hangover sensations. I like my thinking to be clear during the day so this behavior is not for me, so I don't have much experience.<br>SHULGIN LIKE REPORT ATTEMPT (gone to shit)<br>This was written whilst on 5.3g, it ends when I go to bed<br>5.3g GHB (mono-sodium salt)<br>T: 0:00<br>T: +6mins   first alert.<br>T: +10mins still at alert<br>T: +12mins dizzy, smile, slight head 'warmth' or 'pressure'<br>T: +13mins building<br>T: +15mins vision 'slow', slow focus, auditory distortion! wow!<br>T: +20mins quite simply fucked, that's about it.<br>T: +21mins having to read and type out of one eye.<br>T: +24mins want another electric shock (accident from gas cooker)<br>T: +30mins buttock slapping has non sexual effect, strange?<br>WHY THE FUCK IS THIS STUFF ILLEGAL IN MANY PLACES, it's in steak, your own body, and easily available anyway. \n\n\n"
}
