{
 "title": "Total Peace and First Visuals",
 "author": "tollla",
 "citation": "   tollla. \"Total Peace and First Visuals: experience with LSD (ID 20939)\". Erowid.org. Nov 22, 2004. erowid.org/exp/20939",
 "substance": "LSD",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   " ",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20939",
   "Male",
   " ",
   "Not Given",
   "Nov 22, 2004",
   "Views: 5597",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was the 6th time I was using LSD. Its not very easy to find around here ( but not very hard as well), I loved it since the first time I tried it, but blotters used to be quite weak, and the last 2 times I bought them, I got ripped of. I once bought 4 condom blotters and I had to take them all to trip (and I didnt tripped hard at all), and Ive bought 2 totally bunk blotters as well. I got a bit scared of wasting my money on acid, and even if I had the chance to buy them, Id rather blow my money on E or speed. Also, before I tried acid, I pictured it as a powerful visual-inducing drug, but when I tried it, I didnt got any visuals at all apart from some mild colour-enhancement. I truly enjoyed the open-minded feeling and the euphoria though. </p><p>But finally I had the opportunity of buying some good acid. A close friend of mine told me he could get me some very strong microdots. I decided to buy 2, for 10 each. I went to his house in the morning, probably around 11AM, bought the acid and went back home, where I had lunch (only soup and some fruit, I didnt wanted to fill my stomach with heavy food) and half an hour later I opened one of the plastics where the dots were closed (sealed without air for some reason), I put it in a glass of water to be sure Id swallow it and drank it. Then I went to the living-room and watched some TV. </p><p>In that moment, I didnt think about my mindset because I wanted to trip so bad. I know I should have done it, but I wasnt in a bad mood at all. It was a normal day during summer vacations: no college, the sun was shining and there were very few and small clouds in the sky. It was quite hot and all my friends would be in one of the bars we used to go to, so I wouldnt have to trip alone (getting high alone is one of the stupidest things to do with drugs, at least in my humble opinion).</p><p>40 minutes later, I was watching TV in my bedroom. I began to feel a bit nauseous. Nothing strong, only a mild pain and discomfort in my stomach. I knew it was the beginning of something, and waited. The nausea almost totally subsided, and I was feeling more energetic. Mild at first, and then it got stronger. I got up and went outside, to my garden. I wasnt feeling the usual blasting euphoria I used to feel when acid was hitting me, but I was definitely starting to feel the psychological effects. Colours were a bit more vivid, but nothing special. There wasnt visual distortion, but I had the unexplainable feeling that things looked different, weird, but in a very magical and beautiful way. I felt strangely connected to the world around me, to every plant, every animal, every single living being. And by that time, I was also getting speedier by the moment. If I didnt knew that a dose of amphetamines wouldnt fit in a microdot, Id say that there was speed mixed with the LSD, but I knew it was just me reacting in an uncommon way to the drug, for me at least, because I didnt used to get very physically stimulated with acid. </p><p>Some 10 minutes later, the usual psychological stimulation began: my mind started racing, thoughts were reaching and leaving my head in fraction of seconds, I could be thinking about multiple things at once, mostly incoherent thoughts, but I was loving it. I stayed in the garden enjoying the effects for a while and then went back home.</p><p>At 1:30 PM I left home, to meet my friends in a bar. I was feeling able to drive, so I took my car. [Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't Do It!] When I parked and left it, I was feeling enormous (Im not a tall person at all). I would look to other cars parked in the side of the street, and they would look like they were  really small. However, It wasnt a visual distortion, just an inner and unexplainable feeling. By that moment, I was feeling very euphoric, noticing the beauty of everything around me, noticing that it was such a nice day, and also feeling very light. The wind made me feel like I was flying, it was amazing. Finally I met my friends. I told some of them what I was on (the one who openly approve of non-cannabis drugs) and we stayed there for a while, talking. I was very happy and was laughing a lot, I think that some people realised I was on something, but at that moment, it didnt bothered me at all. I drank a coke and it tasted sooooo great That sweet taste was very pleasing, but I think was also noticing the taste of the vegetal extracts (sweet coca  ) separately, very nice indeed, and very refreshing.</p><p>Later (maybe an hour had passed, I dont know for sure), we decided to go to the arcade saloon, and things got weird. My friends were playing and I was sitting next to them. I was very quiet, but my racing mind became paranoid. I was thinking that everybody was noticing that I was tripping balls. That was totally nonsense because I was just sitting there quietly and I think I knew it, but still, I was getting more and more paranoid. I had to leave that place, I told 3 of my best friends that my trip was starting to take a turn from heaven to hell, and that I just couldnt stay there. They said they were going with me, and we went to a bar which none of us knew. We got in and went downstairs, because nobody was there. We asked for some drinks, had some cigarettes, had some very nice conversations. I was back to heaven. We talked a lot and I think I lost the sense of time. Once I realised it, it was 7:30PM and wed been there just talking for hours. It was time for us to go home.</p><p>And in the way home, finally, I had my first acid visuals. I first started noticing that the floor was stretching and undulating. Then, it got stronger. Not only the floor, but also every wall was dancing, being distorted. I drove home, and I got in. I turned the TV on and the colours were amazing, truly magnified. I also noticed that mind gradually slowed down, and I began feeling such a serenity, tranquillity and peace of mind, as opposed to the usual edgy feeling. I went outside one more time to see the sun disappear. The sky was very orange, and when I looked to a cloud, the cloud began morphing and assuming the shape of things like boats, horses and houses I went to my garden again and I felt the most connected to the nature Ive ever felt. A deep and true respect for every living being, more intense than ever. I always defended the animals rights, but I never thought of it in the way I was thinking then. I felt like even killing an insignificant insect was a crime, something disgusting. This was what I learned with this trip. </p><p>It has been 8 months, and Ive never intentionally killed one animal, not even one single ant, one single mosquito. I just try to get them away from my house, not letting any food exposed or using some mosquito-repellent. I love acid so much because it made me realise something that even the deep empathy of MDMA didnt: life is sacred and the most precious thing in the world. Im not a vegetarian because its natural for one species to eat another, its just the way nature is, but I think killing an animal if its not for eating, is totally wrong. </p><p>The effects started to slowly subside as well as the visuals, and I watched some TV, had dinner and later, I went to sleep with no problems and feeling fine. Acid is a blissful drug, absolutely, its the only drug I think that every person should try at least once in their lives, because it makes me see that the world isnt only what we see, makes me realise how important it is to respect our fellow man, and in nowadays society, I think that something that makes us more emotional about everything that surrounds us is a blessing.</p>"
}
