{
 "title": "Lost in the Glass Bubble",
 "author": "Anna",
 "citation": "   Anna. \"Lost in the Glass Bubble: experience with Methamphetamine (ID 20947)\". Erowid.org. Dec 1, 2004. erowid.org/exp/20947",
 "substance": "Methamphetamine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Methamphetamine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "20947",
   "Female",
   " ",
   "Not Given",
   "Dec 1, 2004",
   "9687",
   " "
  ]
 ],
 "report": "<p>I started out a young, well educated, responsible, single mother with my entire life ahead of me. As soon as I started smoking glass, all of my dreams and aspirations disapeared into a cloud of white smoke. </p><p>My experience with meth stretched out over a long period of time, so there are many things that I really can't recall.  However, I do know that the very first time I ever tried glass, over ten years ago, I was instantly addicted.  I truely believe that is how powerful this drug can be. </p><p>I stuck with doing 'bumps' for many years and was totally against smoking it.  In fact, I would lecture some of my friends on how much more addicting it was to smoke it then to snort it.  I finally gave in to the peer pressure and started smoking it when I was about 25 years old.  I had never felt such a wonderful euphoric feeling in my entire life.  Unfortunately, very shortly after that my entire life seemed to crumble before my eyes.  My entire world and everyone it it revolved around glass. My boyfriend was a dealer at the time, so it was very accessible.  My best friend was also a 'speed freak' like me and we used to go on seven day binges together.  No matter how much it made us feel like shit, we still needed it for some reason. </p><p>I eventually lost my apartment that I had been living in for three years.  I started living in hotels with my boyfriend, stealing, lying, doing anything I could to keep my addiction alive.  I ended up getting arrested for stealing my grandfathers car and spent 5 days in County Jail.  That still didn't stop me.  As soon as I got out, I started right up again.  It had complete control over my mind. For the first time in my life I had nothing.  I was a college graduate who couldn't even hold a decent job. I didn't care about anything except getting high.  I didn't even care about my family.</p><p>Meth is a very addicting and powerful drug.  It tricks my mind into thinking that I can't live without it.  I put all of my responsibilities on the side, until eventually they pile up so high that I feel there is no resolution, so I continue to get high so that I can stay numb and forget about everything.  I will always have a problem coping with my problem.  I went through so much pain and suffering (not to mention the pain I put my family through) due to my addiction.  Even though I wanted to quit so many times, I felt helpless, like the drug ruled me. </p><p>Two years ago I got pregnant again and decided to stop doing drugs and keep my baby.  She is the only thing that saved my life.  I don't even know where I would be right now, or if I would even be here right now, if it wasnt' for her.  I am still with my boyfriend and we are now having our second baby.  Although I am pretty confident that I have won the battle, he still continues to use meth regularly. Sometimes I'm not sure if it's possible to completely win the battle once you've started smoking speed.  I pray that I am wrong...</p>"
}
