{
 "title": "Disappointing",
 "author": "pirovamp",
 "citation": "   pirovamp. \"Disappointing: experience with Meclizine (Dramamine II) (ID 20940)\". Erowid.org. Aug 4, 2005. erowid.org/exp/20940",
 "substance": "Meclizine (Dramamine II)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Pharms - Meclizine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "20940",
   "Male",
   " ",
   "Not Given",
   "Aug 4, 2005",
   "Views: 25502",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was a bit bored on a snowy Indiana night, so I decided to drive to the local Meijer department store and pick up some Dramamine.  I had never taken it before, but my friends praised it for occupying many lonely nights.  The store was out of regular Dramamine, so I picked up a two-pack of the 'less drowsy formula.'  The benefit?  I got two nice little pill bottles.</p><p>I downed the 16 tablets at 11:08 p.m., slightly chewing each one so that the chemicals would enter my bloodstream quicker.  30 minutes passed and nothing happened.  I then decided to check online to try for a general idea of how long it takes these little guys to kick in.  After an hour, I became depressed at my lack of an experience.  She brought up a little blip in my drug history when I had eaten an eighth of shrooms and was not affected.  I began to wonder if it was just me.  I could trip with large doses of DXM, but other than that, I've not had any luck (please note that LSD and mescaline are practically non-existent in my area of the world.)  I spent about 30 minutes talking to my friend while watching Nine Inch Nails videos, before I decided that I should listen to Shpongle.</p><p>By this point, I was feeling a little sleepy.  I had a long, rough day at work, as well as a bit of emotional turmoil, so drowsiness was expected.  I fell asleep about 2.5 hours after taking the Dramamine, with no luck what-so-ever.  I dreamed the dreams that one dreams when there is some odd force at work.  Dreams that my good friends would get busted for selling drugs, dreams where friends told me that I should take more next time, and, of course, dreams of running from the police.</p><p>I awoke up around 11 a.m., with a slight headache and a mind full of disappointment, but I suppose it wouldn't hurt to try again, next time with the original formula.</p>"
}
