{
 "title": "Running Away from Myself",
 "author": "Rip",
 "citation": "   Rip. \"Running Away from Myself: experience with Hydromorphone (Dilaudid), Cocaine & Heroin (ID 20956)\". Erowid.org. Jun 19, 2009. erowid.org/exp/20956",
 "substance": "Hydromorphone (Dilaudid), Cocaine & Heroin",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Hydromorphone",
   " ",
   "  repeated",
   "IV",
   "Morphine",
   " ",
   "  repeated",
   "IV",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "2002",
   "20956",
   "Female",
   " ",
   "Not Given",
   "Jun 19, 2009",
   "Views: 11041",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It's funny how when I look back on my life, I don't recognize myself. I am a recovering junkie. I am not here to demonize drugs or glorify them. I just want to give a true and accurate description of my experience so others can make informed rational decisions about them for themselves.</p><p>I remember the first time I ever shot up. It was half of a K4 Dilaudid. My 'friend' hit me and I felt the rush for my first time. I thought I had overdosed because it hit me so fucking hard. I passed out and then awoke to my friend asking me was I alright. I said 'I feel beautiful.' I felt like the world had finally hit this cosmic alignment and everything became alright. This amazing flushing of all me fears and insecurities. It was purfect. The most wonderful feeling in the world. </p><p>Of course, tolerance happened and with tolerance comes addiction. I had to start shooting a whole K4 to get close to the same high. Eventually 1 led to 3 and 3 led to 7 and 7 led to 13 etc. By this time I was shooting a lot of coke and about 4/10g of heroin a day. Damnit....how did I get there. But I wasn't addicted. I just liked to do drugs. Fast forward past the prostitution and stealing. I was shooting 20 K4 dilaudids a day, an 8ball of coke a day and the same amount of heroin. I found out about credit cards and atm machines and 20,000 dollars and a month later I was surely fucked. I was selling, using, stealing, prostituting, whatever I had to do to get my dope. I was using needles that the numbers had been worn off of long ago and the needle was so dull that I had to jab at my arm (or leg by this time since I had blown my veins) to get the needle to go in. I lead a pitiful existence and it was at this point when I finally realized I had a problem. Through all the bullshit I thought I had it under control. Thru Hindsight I realize I was addicted after about 1 week. I kept on my self destructive rampage until all my bridges were burned and I had no dope. I went to detox and got clean in there. After that I started going to a twelve step group and here I am today with hepatitis-c and no veins!</p><p>Now in my past I had used drugs succesfully like pot, acid, a little coke here and there, but I didn't realize that addiction is not from the drugs my friend, oh no, I had always been an addict. It was a disease just waiting for the right time to fuck me good! I could never use drugs succesfully, it was my disease telling me I could, and here lies the key to addiction.</p><p>I have had wonderful experiences with drugs. I have also had bad experience with drugs. Drugs can be used without becoming addicted but I was not one of those lucky people. I am greatful today that I was able to find a program to help me stay clean and a God that loves me. I hope that all you psychonauts who want to go on a journey to discover the most beautiful place in the universe (your mind) will remember that everything has a price. Are you willing to pay that price? If you can afford it, go ahead, I envy you, but most of us will never have enough to pay the price of addiction. Thanky ou for reading me little piece of life. Love, peace, and good luck!</p>"
}
