{
 "title": "Summer Shroom Hell",
 "author": "Smoky Joe",
 "citation": "   Smoky Joe. \"Summer Shroom Hell: experience with Mushrooms - P. cubensis (ID 20970)\". Erowid.org. Mar 12, 2003. erowid.org/exp/20970",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 20970",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 12, 2003",
   "Views: 10891",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After doing a great deal of reading about psychedelic drugs I decided to partake in my second experience with mushrooms.  I had done a low dose once before about 3 months prior with pleasureably mild effects.  I was now interested in kicking it up a notch.  I was home from college for the summer after completing my first year and was spending alot of time with my buddies from high school.  After discussing my prior psychedelic experience with my old friends I was quick to recruit two volunteers who were interested in giving shrooms a shot.  </p><p>After purchasing roughly a quarter of an ounce we decided to split the bag three ways.  The third person who was supposed to join in the experience ended up leaving town. Due to the fact that we were living with our parents and were paranoid about having a bag of mushrooms in our posession we decided to go ahead and get rid of the evidence without the third party.  Due to our ignorance and lack of planning we decided to trip while playing a round of 18 holes in the middle of the afternoon at a place where respected members of the community would no doubt be enjoying their Saturday.  After consuming our portions in the parking lot and getting our cart we teed off at #1 and off we went.  </p><p>The onset came on much quicker than I expected, but things were okay so far.  It was a hot Texas day and there was not a cloud in the sky.  Waves of heat were visible along the horizon in every direction.  Another testament to our brilliance was the fact that we had a pack of smokes and absolutely nothing to drink.  We ended up running into several older High School acquaintences half way through the first hole who were eager to join our game and observe our behavior under the influence.  So far so good, I guessed.  I began to get anxious because I was not too comfortable about these sober people who seemed to find it necessary to watch our every move.  Things began to fall apart when my buddies straight as an arrow brother who I had known since fifth grade spotted us from an adjacent hole and decided to also play in.  Our party went from 2 to 6 in a matter of minutes.  The mushrooms really began to take hold and I was having trouble focusing, hitting the ball, and successfully participating in any social interaction with anyone present.  Thank god for my sunglasses.  </p><p>I began to feel that my behavior must appear increasingly odd and was certain my buddies brother knew we had done something.  The huge lines in the fairway where the lawn mowers had groomed began to overlap and appeared to take on several dimensions.  I was having trouble walking and had cotton mouth to the point I felt I was choking.  As my mental state began to deteriorate I noticed my buddy was also starting to whig out.  When we were alone in the golf cart between shots it was evident we needed to get the hell out of there and fast.  Putting was nothing short of sheer hell.  When it was your turn to try and hit the ball all six people were congregating on the green in close proximity watching your every move.  I would normally never think twice about the amount of social interaction required when playing golf.  Speaking to people who were not in the same state of mind especially when one of the members of our party was deffinately anti recreational drug use was nothing short of impossible. </p><p>By hole #4 I was no longer playing, and was basically just barely able to sit in the cart.  We finally, in what seemed like incoherent giberish told everyone we were going to go for a swim and get something to drink since it was over 100 degrees.  It felt like it was obvious we were making our retreat.  We drove to the pro shop as fast as we could and literally made a dead run to our car, probably looking like a couple of guys who had just robbed the place.  Once we were in our car we did not know what the hell to do or where to go, but we knew we needed to get off of the streets.  It was evident my counterpart and I had been sent spiraling uncontrollably into a very unpleasant experience.  I thought my mom had gone out shopping for the day so we decided to retreat to my house.  Hallucinations began to get more intense and the vine and flower patterns within the wallpaper began to appear alive and almost growing like videos I had seen in one of my botany classes.  </p><p>When I heard the garage door begin to open I was certain of the impending doom.  My heart began to pound and my adrenaline began to pump.  I was about to follow my survival fight or flight reflex and bolt out the front door and back on to the golf course.  I managed to stay calm and some how was able to answer my mothers questions and engage in conversation while my buddy hid in the bathroom and pretended to be taking a shit.  I had an overwhelming feeling of guilt about having to try so hard to deceive my mother.  It went through my head to actually say 'Mom, I am sorry.  I took mushrooms, and am whacked out of my mind.  I cant lie to you' As soon as she went to the other end of the house we took off out the front door and off we went.  By then things had gone so sour that we both felt we needed solitude in order to get our heads straight.  My friend insisted on going to his house where his father could either be or show up at any time. </p><p>There was no way in hell I could hold it together around any more adults.  My sanity reserves had been completely taxed after having to talk to my mom.  I dropped him at his house and began to drive aimlessly into the country.  I drove down dirt roads and felt as if it would be impossible to get far enough away from everyone to ride this thing out.  After I had been on dirt roads for 45 minutes I had absolutely no clue as to where the hell I was and honestly did not care.  All I could see on either side was miles of corn, cotton, and milo.  I finally pulled off into a small pasture with a barn.  I locked my truck got my smokes and stumbled off into a corn field as fast as I could.  It was the end of July so the corn was about 6 -8 feet tall, and luckily this field had not been irrigated in the last week.  I then proceeded to sit and chain smoke not only because it felt good, but also to ward off the swarms of mosquitos that were attacking me.  </p><p>I suddenly heard a noise overhead and noticed a crop duster off in the distance.  I realized that at this point in the growing season farmers were beginning to treat corn for Southwestern Corn Bore infestation with some pretty potent pesticide.  I began to run aimlessly out of the field, not having any idea whether or not this particular field had been treated (Which would be the wrong thing to do because I would be inhaling the pesticide deeply into my lungs as I began to get out of breath).  I started getting paranoid, thinking I had possibly exposed my self to toxic pesticide.  I began to associate the dizziness I was feeling from the shrooms with the possibility of being poisoned.  I later realized that if the field had been treated, the huge swarms of mosquitos would not be present, and if it was recent enough to have not substantially decreased the population I would have been able to smell the chemical in the air.  </p><p>I then hid in some tall grass and sat and smoked cigarettes until I began to get straight.  I felt I had completely permanently altered my consciousness and would forever have to live with a  self induced chemical imbalance within my brain.  After about 2 hours when sobriety returned I realized I had no clue as to my location and to top things off my truck was almost out of gas.  The feeling of actually getting sober was better than someone handing me a million bucks.  I finally made it back into town after stopping at a grain silo and asking several local farmers for directions.  </p><p>Overall, I learned a great deal from this experience and have shroomed multiple times since with a great deal of preparation for the experience.  I am surprised I am still alive after driving in the mental state I was in.  I was incapable of comprehending traffic signs and symbols.  I am surprised I even knew to drive on the right side of the road.</p>"
}
