{
 "title": "Risk and No Returns",
 "author": "Pointless",
 "citation": "   Pointless. \"Risk and No Returns: experience with Meperidine with Promethazine (ID 20987)\". Erowid.org. May 1, 2010. erowid.org/exp/20987",
 "substance": "Meperidine with Promethazine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)",
   " ",
   "3 tablets",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)",
   " ",
   "2 tablets",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20987",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 1, 2010",
   "Views: 8887",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I found unused painkillers in the medicine cabinet in my own bathroom. I could believe it. It made me wonder if my brother had been abusing them. Anyways, the time I found the bottle was right before a went to bed, very late in the night. I didn't even know what the pills did, just that they were painkillers called meperidine and prometh. Each pill contained 50mg of meperidine and 25mg of promethazine. My plan was to wake up early and take them. While I was high, I was to lie in bed and end my experience before my brother woke up. If he did wake up, I wouldn't have to talk to him, so it would be ok.</p><p>I did very minimal research late at night on my mom's computer. I would have to risk it. It had to be pretty safe if it was prescribed to my mom, and nothing happened to her. Well, at least more safe than taking something completely unknown. I took 2 pills as indicated on the bottle, and I went to bed.</p><p>As I was laying awake, I started to shiver uncontrollably. I put all of my blankets on me, but I kept on shivering. It felt good, though. After the shivering wore off, I felt... nothing. I tried to take another pill. After I took that one, I sat in bed listening to music, and I started to feel something. It was really floaty and peaceful. After floating around for a few minutes, I was overcome with tremendous fatigue. I had to sleep, and I did fall asleep.</p><p>I woke up with my brother bothering me about going to my dad's house to help him move boxes. I agreed. I don't know why. I felt drunk, groggy, and intoxicated. However, it was pretty mild. It felt like my speech was slurred, but no one commented on it. It couldn't have been that bad. I moved boxes and eventually woke up from my stupor. I felt like I was half asleep. When I got home from my dad's house, I was determined to try again. The bottle said 'take every 2 to 3 hours as needed.' I wasn't overdosing.</p><p>I took 3 this time, and strangely, I didn't feel any shivering. I thought that I might have built up tolerance. After an hour, I didn't feel anything. I took 1 pill every hour for the next two hours, and then an hour after that, I took the last 2 pills in the bottle. I knew it was my only hope in getting any effect unless I snorted them. I didn't want to snort them.</p><p>The only thing that happened around this time was that I was dozing off, and I suddenly woke up. I could see the room around me, the lamp, the television, the clock. Except my eyes were closed! I opened up my eyes, and my head was facing a completely different direction. It was very strange to be put in that kind of state of mind, half-asleep, half-awake.</p><p>All in all, it was a lame experience, and I'm very disappointed. Besides the shivering and very brief episode of floating around on my bed, the only thing I felt was tiredness. So tired, in fact, it was quite difficult to prevent myself from falling asleep.</p>"
}
