{
 "title": "My Night at Sue Bee's House",
 "author": "NutterButter",
 "citation": "   NutterButter. \"My Night at Sue Bee's House: experience with Cannabis (ID 20989)\". Erowid.org. Nov 22, 2004. erowid.org/exp/20989",
 "substance": "Cannabis",
 "bodyweight": "176 lb",
 "header": [
  [
   "DOSE:",
   "0.66 bowls",
   "smoked",
   "Cannabis",
   "(flowers)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 20989",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 22, 2004",
   "Views: 5650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I got a call from my friend one night, lets call her Betty Sue. She called to say that she was over at her Neighbor's (Sue Bee) House. Se told me to have my mom drop me off immideately. I could smell a good amount of almost sweet marijuana at the doorway. My mom didn't smell it. I sat down in the house and had one small hit from the bammer filled joint Betty Sue was smoking. it was definitetely not enough to have any  sort of effect, but it was the kind I could stay  up all night smoking for a good alert buzz if I had enough. We went out to get some food and shared a few more hits of bammer. By this time, the bammer wasn't having any psychoactive effect, but I could feel cottonmouth coming on, so I at least knew that when we smoked enough, there would be a pleasant mild high that I could enjoy. </p><p>Sue Bee broke out the 'Blue Box' full of her stash. there was a sandwich bag full of bammer and I got excited, but there was one more thing. Green Bud. Now I had had green bud before, but this had a very stoney smell, Sue Bee said that it was new and real good (by the way, sue bee is about sixty to seventy years old) so I opted to try some. The taste was very sweet, probly what I had smelled coming in. We began passing around the pipe, filled with a full bud (enough to fill the bowl) and we refilled after a few minutes. I tried to hold it in, but it made me cough too much, which I didn't expect because the smoke was very very smooth and light tasting. And for a while, I noticed nothing. The onset was about five or ten minutes longer than normal. </p><p>Finally it hit me. I didn't really come up, I actually hit the plateau immideately. I first noticed that I was in fact high (at the time I couldn't remember how that  felt and I couldn't actually feel anything, I just knew I was high) I started to remember what pot was usually like, and noticed that I did  not get cottonmouth like I do with the pot I usually smoke, and I had certainly never felt this clear headed after smoking so much (these were huge bowls, I had way more than one or two hits) I decided to stand up, and I noticed a slight swell in my limbs that spread to my whole body. Like I was being filled up with blood. I felt very heavy, I noticed that when I jumped, I only got about three inches off the ground When my jumping was usually about a foot normally and two feet when I am high and it feels like I am flying (It was probly a foot every time, my perception just changed) I eventually at down and let it fade. </p><p>I would like to experiment with this type of green bud again and write a more thorough report and try more things. I would also like to examine it for other  plant material such as california poppy (I have noticed a similar effect mixing california poppy with damania).</p>"
}
