{
 "title": "Avoiding the Initial Anxiety...",
 "author": "DIEA",
 "citation": "   DIEA. \"Avoiding the Initial Anxiety...: experience with 2C-B & Pharms - Diazepam (ID 20991)\". Erowid.org. Jan 30, 2004. erowid.org/exp/20991",
 "substance": "2C-B & Pharms - Diazepam",
 "bodyweight": "182 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   "  T+ 0:10",
   "20 mg",
   "oral",
   "2C-B",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 20991",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 30, 2004",
   "Views: 8082",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had previous 2cb experiences.  Sometimes combining small amounts with MDMA or by insuflation.  Insufflation is much too painful and distracting.  It comes on much too quickly to be enjoyed, at least in my case.  </p><p>@ 3:00 PM I swollowed 20 mg of diazepam because I am aware of the near-panic attack associated with coming up on 2cb.  It is like a 'transcendence' into bliss.  Being ripped through conscious understanding can be hard on the psyche. </p><p>@ 3:10 I swallowed 40 mg 2cb HCl.  Rinsed out the vial 3 times to make sure all of it was taken.  Very bitter stuff.  </p><p>@ 3:12 my early warning system went off and I climbed slowly over the next 20-30 min into the 'transcendence period' where the anxiety develops.  I still felt restless for about 15 min but I just layed in bed and closed my eyes, meditating with focus on the breath.  The diazepam definately helped with the intense energy build.  </p><p>From 3:45-6:00 pm I had wonderful visuals and the anxiety had faded.  What was left was a state of zen bliss.  Intesnse love for everything, fearing nothing, feeling strong, alive.  The introspective is clearer than LSD.  Eyes closed imagery was fantastic.  For some reason, I did not want to listen to music as with MDMA.  I enjoyed the silence.  I especially enjoy this drug because of its ability to communicate.  Come down was extremely smooth.  By 8:00, largely out feeling tired from the diazepam. </p><p>For next time: take lower dosage of diazepam.  Preferebly obtain a short acting benzo like alprazolam so one doesn't feel so groggy from the long-acting metabolites the diazepam produces.</p>"
}
