{
 "title": "Go Ask Alice",
 "author": "Now I Know Better",
 "citation": "   Now I Know Better. \"Go Ask Alice: experience with Mushrooms (ID 2099)\". Erowid.org. Jun 25, 2000. erowid.org/exp/2099",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 2099",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2000",
   "Views: 32358",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo one night me and 2 friends head up to our good friend's college for a night of beer and bong rips. Well to our surprise when we got there we had an opportunity to get shrooms. We all jumped on the chance since they are impossible to find around here. So needless to say me and my 2 buddies all got an eighth and we devoured them right away.\r\nSo we were sitting around watching t.v. And smoking lots of pot for about an hour and realized that nothing was happening to any of us. So we stayed for another hour or so and decided to go home. On our way to the car i remember eating a pretzel and then being in a hazy dreaming state. Like the one when you first start to fall asleep. I could see colors and hear voices. I opened my eyes and realized i was on the ground looking up at about 15 faces. I stood up and i couldn't see or walk straight, man, i was instantly tripping my face off! Everyone kept asking me if i needed to go to the hospital. I said 'no no i'm cool' even though i knew i wasn't. Everything was one big swirl (looked like spin art, if you remember what that was). Anyway my head was gushing blood from falling backwards on the pavement. \r\nSo off to the hospital we went, of course getting lost on the way. I was tripping so hard but i couldn't stay conscious. Into the ER I went, (my first time to the hospital) i had to tell the nurses i was on shrooms and pot. So i sat there bleeding and shrooming while listening to some guy scream bloody murder for 30 minutes before the doctor came to stitch my head back up. Good thing they let my friends in the room to keep me from flipping. The doctor was making jokes about it too. But the shitty part was going home at 3am to tell my mom i was tripping and i had a concussion. Every time she came to wake me up i was shrooming, even the next morning when i woke up. But as for my friends they didn't feel a damn thing off those shrooms. \r\nI don't know what the hell happened that night, i guess even the most experienced have trouble sometimes. But i've learned that drugs fuck you up in the long run. Unfortunately i found out through all bad experiences. Have your fun and enjoy life but think about what you're putting into your bodies. In my opinion, all that shit they spoon-fed you as a kid is true - drugs are bad! Just smoke some pot and you won't have to worry about going to the hospital because you hurt yourself or because you're od-ing. \n\n\n"
}
