{
 "title": "A Second Wind",
 "author": "plntshmn",
 "citation": "   plntshmn. \"A Second Wind: experience with Catha edulus (khat) & Cannabis (ID 21035)\". Erowid.org. Feb 4, 2003. erowid.org/exp/21035",
 "substance": "Catha edulus (khat) & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cannabis",
   " ",
   " ",
   "24 leaves",
   "buccal",
   "Catha edulis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21035",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 4, 2003",
   "Views: 50227",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>With the negative media attention given to khat I thought someone should paint a more accurate picture of this plant's effect. It is nothing like ecstasy and rather unlike methamphetamine as claimed by people at the DEA. Its psychoactive properties are much more mild, its effect not much more powerful then caffeine.  </p><p>About 2 years ago I came across khat at a local Ethiopion market. I bought 2 fresh bundles, knowing I may never stumble across this great opportunity again. I had been smoking marijuana earlier in the day and was feeling kind of tired and burnt out. On top of that I was supposed to meet a girl for our first date later on that evening. As that time approached I was a bit worried I would be to tired and stoned to make a good impression on her. I had read khat makes you more social and talkative and is used socially. Sort of like alcohol. With this in mind I thought I would give it a try.</p><p>I began to roll 3 leaves at a time into quids. As the leaf entered my mouth there was a sort of generic green plant material flavor. As I chewed the leaf, I noticed A powerful astringent flavor. It was as if my tongue felt dry, yet there was plenty of saliva. This rather strange flavor may be unpleasant at first but you get used to it. I even like it.</p><p>From first bite it took about 30 min for any effect. About every 10 minutes I started on a new quid. When the plant material losses the astringent flavor its spent. After I had chewed 12 leaves I was starting to feel my fatigue dissipating. My thoughts became more clear. Like some good frappacino at best. </p><p>As I chewed 3 more quids over the next half hour I noticed the effects increase and change slightly. I continued to become more clear headed and alert until I just felt normal. I felt as though it was 12 in the afternoon after a restful nights sleep. A new, very mild feeling of well being set in. No shaking , jaw clenching, dizziness,or uneasy stomach usually associated with stimulants. It was like a large dose of caffeine with no negative side effects.</p><p>I then left and went to meet my date. The drive took 30 min and I had no problems driving at all. I would say I noticed very little in the way of becoming social. Nothing like a few drinks of alcohal. Its more like being just awake and alert; slightly more confident and able to pay attention. This makes one more likely to get deeply involved in the conversation. </p><p>After 2 hours from the start I began a slow smooth return. By 3 hours or so I was totally normal. No problems sleeping that night.</p><p>I finished the bundles over the next few days. In retrospect I would have to say that khat's effects are almost unnoticable. Its similar to coffee but I think it better. I chewed the leaves and made it into a tea. Chewing leaves was always about the same as in the above experience. Taking ten to get an effect and a plateau or rather ceiling of effect at about 20-25 large leaves. The tea was a bit stronger... </p><p>I double brewed the tea in my coffee maker. The tea was maybe 45 or 50 leaves. It was the strongest dose of khat I got. It was not much different from the experience above except I noted a hot flash for a while. I had taken the tea at 11 at night and yet I was sound asleep by 1 or 2. All the friends I shared Khat with reported the same things as me or even less of an effect. Khat being illegal makes no sense to me. Maybe It would take out the coffee industy if it ever caught on! Another casualty of the war on drugs.</p><p>[Editor's Note: Many experts on khat report that the potency of khat leaves degrades rapidly over time.  Also, potency between different plants varies dramatically. It may be that the leaves purchased in the market place were old or just weak.]</p>"
}
