{
 "title": "Smeared Across Infinity",
 "author": "Occupant",
 "citation": "   Occupant. \"Smeared Across Infinity: experience with Mushrooms & Nitrous Oxide (ID 2104)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2104",
 "substance": "Mushrooms & Nitrous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   " ",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2104",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 55089",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently my wife and I were given the opportunity to try some psilocybin mushrooms. Both of us had previous experiences with larger doses of LSD, and we were both anxious to learn more about this sacred chemical first-handedly.<br>At approximately 10:30 P.M., we began ingesting two grams of powdered mushrooms apiece. At first, I tried to eat a teaspoon of it and wash it down with water, but it was extremely difficult to swallow because my mind did not recognize the shrooms as food, and insisted on keeping my throat closed. After struggling with my first swallow, my wife suggested that we drink the mushrooms in V8. We decided this was probably our best option, so we mixed our shrooms in with the V8 and finished the remaining dose with relative ease.<br>We sat with our friend who was there to observe our first Psilocybin encounter and talked for about an hour, and decided to take one more gram of mushrooms apiece (again with V8). After I had completed the very last swallow of my dose, I became nauseous and vomited. While I was retching V8 and powdered shroom clumps into the kitchen sink (which, despite the vivid imagery provided, was not an entirely unpleasant experience), I noticed that the lights in the room were beginning to seem to pulse in intensity. I felt a wave of wonderment come over me, and felt great- the brick in my stomach was gone and I was alive with energy. <br>Gradually, my wife and I entered into a series of trance states, something that I have felt difficult to do on LSD. I experienced a series of visions in which I saw neon mushrooms, mushroom clouds, and other assorted mushroom-related animations. It was as if I had stumbled upon the great genetic library of Psilocybin-containing fungus everywhere. The effects of the mushroom continued to accelerate, and I was seeing patterns on the walls, ceiling, and carpet, similar to LSD patterns but more delicate. It was then that I was introduced to the wonderful world of Nitrous-with-a-Psychedelic.<br>My friend inflated a balloon, and instructed me to hold it in as long as possible. I was already tripping fairly hard (I hadn't tripped in about 4 months, my wife: one year!), and was curious and unsure as to how the nitrous oxide (which I had only had at the dentist, and was not too impressed with the effects at the time) would interact with the Psilocybin. I took a deep inhalation of N2O, and held it in...<br>Nothing in the world can prepare one's consciousness for the experience of being smeared across infinity in a nanosecond. My ego was instantly dissolved, and the effects of the Psilocybin seemed to be growing in intensity, in orders of magnitude. For what felt like a lifetime and more, but was probably only ten seconds, I felt like I must have been tripping on a hundred billion hits of LSD. I only opened my eyes a few times, only to discover that my wife and our friend were staring at me, and that I was ginning like a ninny and laughing like a psychotic cat-killer. I was able to utter the phrase, 'I see why they call this laughing gas'. For an instant, every essence of my being was completely disintegrated and annihilated, and I could hear what I can only describe as a 'rapid, flapping, sputtering' noise accompanied by a high pitch. I thought that this was probably about as close as one could get to Nirvana while still alive. Complete, temporary ego death combined with a momentary link to Shiva and Kali's eternal orgasm.<br>I gradually re-materialized into this Universe and looked over at my wife, who had yet to experience this. Even after I told her what had just happened to me- that every part of my being had just been ripped apart by shockwaves of a giant, cosmic orgasm, she said she was content with the effects of the mushrooms and would try it later.<br>I did a second and third balloon, each one more intense than the previous. After I had come down (mostly) from the final balloon, I sat in silent meditation for a while, contemplating these ego-flattening experiences, as the peak of the trip rode off into the sunset and the patterns slowly dissipated. I smoked some marijuana to ride the rest of the trip out on, and sat in a trance, occasionally snapping out due to the music or someone talking.<br>The trance state, for me anyway, was almost impossible _not_ to attain during the duration of the trip. Psilocybin left me much more clear-headed than I am on LSD, and it, in a way, kind of forces you to really think about what's happening. Although the dose was relatively small (I would estimate the effects to be similar to 1-2 hits of average blotter acid), I felt completely overwhelmed by the trip, and can barely imagine the potential for neuro-exploration that this drug has to offer. This trip has definitely given me a new respect for the mushroom, having felt their power firsthandedly, and I look forward to taking larger doses soon. My wife seemed to have had a more intense trip than I did, and I suspect this is because I vomited much of my dose- she said she would estimate her trip at 3-4 hits of blotter acid.<br>I would recommend the combination of N20 and Psilocybin (or, from what I understand, just about any psychedelic compound) to anyone seeking a truly psychedelic experience. The N20 seems to 'flip a switch' in your mind, making you, temporarily, significantly less tolerant to the effects of the psychedelic. Words can not begin to describe the essence of this experience. The nitrous sends you flying, light speed, into oblivion, and then yanks you back and sets you down gently in your chair, as you gradually remember that you have a body.\n\n\n"
}
