{
 "title": "A Portrait of the Artist as a Young Man",
 "author": "Dskritpiv",
 "citation": "   Dskritpiv. \"A Portrait of the Artist as a Young Man: experience with Methylphenidate (Ritalin) (ID 21058)\". Erowid.org. Sep 5, 2007. erowid.org/exp/21058",
 "substance": "Methylphenidate (Ritalin)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   "  T+ 0:00",
   "10 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   "  T+ 5:00",
   "20 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21058",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 5, 2007",
   "Views: 18348",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I obtained ritalin from an online pharmacy based in Colon, Panama.  It is a generic version, it is a white pill, one side says 'CG' the other says 'A/B.'  I have never been diagnosed with any disorder, however I had a lack of motivation for school.</p><p>My first experience with Ritalin.  I took two 10mg pills. I crushed one pill into very fine powder and made two lines, one for each nostril.  After taking the first pill orally, I immediately insufflated the other.  I began to read a book for my english class, 'A Portrait of the Artist as a Young Man' by James Joyce.  About 3 or 4 minutes after my dose I could feel it working.  At first I feel it come on strong in my head, it produced a feeling of euphoria and extreme alertness.  This lasts for about 10-20 minutes. It has a speedy feeling to it, but I am not jittery or restless, as long as I have something to concentrate on.  My brain gets the exercise, my body is relaxed.</p><p>The speedy feeling is no longer concentrated in my head, it flows through the rest of my body.  I am in deep concentration in my book, I am reading extremely fast, about 2.5 times faster than normal and I am catching every little detail and retaining everything.  Sometimes, when not on ritalin, when I would read books I would start to think of something else as I read, then realize I had to re-read the page because my mind was somewhere else.  However, as I read under the influence of ritalin, it seemed I had the ability to read the page, comprehend and retain every little bit of it, as well as let my mind think about reoccuring themes in the book and relate intrinsic ideas and topics all at the same time.</p><p>My hands and feet get cold.  Socks and slippers on my feet and they're still cold.  Turned up the heat, still cold.  Mainly just cold feet.  I feel very buzzed and alert for exactly 5 hours.  I then encounter an almost immediate crash.  The crash is not unpleasant, I just start to fall asleep.  It is as if someone pulled the plug.  I was going strong, reading fast, then my head starts nodding off.  I need another boost because I am not done with my book, though I should be, I took a 2 hour break from reading, just to enjoy and analyze my experience.</p><p>This time I crush up two 10mg pills and take the 20mg by insufflation alone.  3 to 4 minutes later and I'm back baby!  The rush to the head and euphoria is stronger and lasts longer, however the buzzed body high and total duration of alertness plays out faster.  After 3 hours, the effects are noticeably diminished but it is still doing its job.  After 4 hours the alertness has completely vanished.  Head begins to nod.</p><p>Taking 20mg by insufflation plays out faster than the 10/10 split oral/insufflation.  I want another pick-me-up after 3 hours, and need another pick-me-up after 4 hours.  I have found 20mg methylphenidate by insufflation every 3-4 hours, or 10/10 split oral/insuf every 4-5 hours keeps the ball rolling.  I have yet to try >20mg.</p>"
}
