{
 "title": "Sublime and Enjoyable",
 "author": "Clayton",
 "citation": "   Clayton. \"Sublime and Enjoyable: experience with Morning Glory (ID 21069)\". Erowid.org. Nov 24, 2005. erowid.org/exp/21069",
 "substance": "Morning Glory",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "7.6 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21069",
   "Male",
   " ",
   "Not Given",
   "Nov 24, 2005",
   "13827",
   " "
  ]
 ],
 "report": "<p>After having read about and having heard from many, many friends the great experience of morning glory seeds, I finally took the time after many months of hesitation to try and find out for myself what exactly all the hype is about.</p><p>Obtaining the seeds was fairly simple.  As it's just a couple months before the flowering season here in Texas begins, I had no trouble finding a supply.  I bought 4 grams (a combination of 10 packs, each containing 400mg of seeds) from Wal-Mart  and 3.6 grams (a combination of 2 packs of seeds weighing 1.8 grams apiece) from Alco; I wound up spending about seven dollars for the entire lot.</p><p>I have read a few different methods of extracting the LSA itself from the morning glory seeds, but all of these routes seemed to me to be *much* more difficult than they were likely worth.  In the end, I decided to just ingest the seeds themselves.  After a quick thrashing in my coffee grounder, I placed the seeds, which looked then like sawdust, in a glass of water and downed it all in a few gulps.  The taste wasn't terrible, but the texture was enough to make me gag.  And then all I had left to do was wait.  The time was precisely one o'clock in the afternoon.</p><p>About twenty minutes after consuming the seeds, there was definitely a noticeable change in bright colors and sharp corners.  At this point, the walls were already starting to slightly breathe.  Within forty minutes of ingestion, I was well on my way to a full-blown trip; there was a definte and total change in consciousness.   But by now my stomach was screaming at me, so I went to the bathroom and waited for the nausea to pass by.  I must have stayed there for about an hour or more (you'd be amazed how interesting light fixtures can seem from the vantage point of your bathroom floor), and I finally forced myself to puke knowing that I would feel much better after it was over and done with.</p><p>My stomach felt worlds better, and I went again to my bedroom.  The clock said that it was already past three o'clock in the afternoon, but I could tell by the steady progression of the trip that I hadn't quite yet reached my peak.  Within another thirty minutes, I had reached what was likely the pinnacle of the experience.  I sat with my computer in my lap, and I put on my headphones.  I made the best attempt that I could to chat with a couple friends online, but the music pumping into my brain was entirely too distracting.  Every sound had infinitely more depth than it ever had before, and the accompanying visuals were just as complex.  I hadn't been expecting the trip to be as strong as it turned out to be, but the visual experience was absolutely fantastic.  The walls were breathing heavily, constantly bending and shifting for well over five hours.  There was a steady flux in all of the colors around the room.  I managed to stay quietly satisfied with the trip on my bed for the rest of the evening, and I passed out from exhaustion at about ten o'clock.</p><p>Overall, I'd be more willing to compare the experience of morning glory seeds to that of MDA than I would to LSD.  The body load was approximately that of MDA, and the entire world seemed to be constantly buzzing.  At times, the weight of my body was somewhat annoying and permeated the experience quite a bit.  I wasn't quite catching on to so many enlightening ideas as I would with LSA's chemical cousin; I was much more aware of the fact that I had consumed the morning glory seeds as opposed to the complete and utter psychedelic intoxication of LSD.</p><p>I don't quite understand the experience reports available on the internet from those who had terrible experiences with morning glory seeds.  The trip itself was sublime and incredibly enjoyable.  I'd highly recommend the seeds to anyone who's willing to deal with a bit of stomach trouble.  In the end, the experience was well worth it, and it's definitely something that I plan to try again.</p>"
}
