{
 "title": "Great Experience",
 "author": "yao",
 "citation": "   yao. \"Great Experience: experience with 2C-I (ID 21065)\". Erowid.org. Feb 13, 2003. erowid.org/exp/21065",
 "substance": "2C-I",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 21065",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2003",
   "Views: 7338",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy experience began in some friday night, I went to an outdoor party. I took 25mg of 2C-I orally at 02:00, more or less. I was with good friends, and I felt comfy. We laughed a lot and there was a good chemistry between us 4. Me and a female friend of mine took the substance, the 2 others took LSD. Well, I tried to dance here and there but I didn't like the music (wasn't enough psychedelic:) . That was in the first 2-3 hours after taking the material. I did'nt really figured out why it's not working (I felt a slight buzz, that's all), I'm very sensitive to materials. My friend was in my state as well.  But I felt less comfortable with the music, close to the speakers. When I eat research chemicals I usually stomach-sensitive and I tend to puke so I walked about 300 meters away from the party and my friends. \r\nIt was about 5:00, and it wasn't dark anymore. I lied down under a tree and looked at the sky. Then I realized that the body needs rest to let the material come to life, not activity. As I calmed more, living visuals began forming in the sky. They seemed far and real, I liked that (unlike LSD when I feel the visuals more inside of my head and eyes).\r\nThe substance was definetly present after 15 minutes, I played a sensory-visual game- trying to load myself with sensations and emotions I get from the surroundings and form these to visuals, then back to feelings. That's quite easy and very fun on the 2C family, because my head is clean and I can remember things and build a good thought-train, and the visuals always has a certain distance so they kind of twist themselfs (they don't have an LSD like impact on the followings) and these features are great for what I call a 'hi-fi' psychedelic expereince. I have plenty of room left for MYSELF to achieve the most of what that is happening. I enjoy myself first before all of the psychedelic effects.\r\nThe body is soft on that substance. Let it rest for less body load. Well it developed in an hour to a very nice peak. Not too strong but very fun. It's a very funny drug, one of the best IMO. We joked a lot and didn't have any need to have a real conversation - communication is good but not too much (and less good for the 2 on LSD). Bit confusion, but very little for a psychedelic experience. If I smoke weed, I'm much more mind-fucked, but that's me..\r\nI did'nt feel very close emotionaly to my friends (huging someone is hard, also my body did'nt want a human touch for some reason), but it was minor and I know I'm like that when I'm tripping. I got just a bit far from them in that aspect. \r\nThe sound is GREAT. It's not clean (such as AMT which is a great substance for listening and making music). It's echoing, and has a great vibe. Very 'sonic' feeling , you can feel the sound waves, you can hear great details ,and their textures are very pleasant and futuristic (I can't explain that too good). I think it gives the overall 2C-I experience a futuristic feel. I have'nt noticed this in other drugs, and it's great to feel that with good music on (that was pink floyd in the car)\r\nThe insight is very powerful when nature is a part of the experience. We went to a cliff above a beautiful beach, and I had the greatest time of my life with good and true insights. Felt more true then any other substance. It's very meditative.\r\nSo the real trip began after more then 3 hours, in the morning. I stopped feeling trippy in about 7 hours (and felt safe to drive, yet I still saw things), 2 hours later I got home. Sleep was very hard to achieve and took about 3 hours, but was deep.\r\nI believe this substance is good for sensitive people who like the more peaceful side of a psychedelic experience. This is not a ride. It wants you to be gentle in many ways. So listening and dancing trance isn't really a good thing for that. I enjoyed most the hours of being away from the party, in and next to the car, no music or with good music (or really crappy music like leonard cohen on full volume on my crappy car speakers, when his voice and everything there is totaly distorted), and the beach was the best. I went home just because my friend's girlfriend is sensitive to the sun and they had to force me. Could have stayed there forever, on the ground, listening, watching and learning.\n\n\n"
}
