{
 "title": "Red and Green Spots",
 "author": "Cosmic_Fool",
 "citation": "   Cosmic_Fool. \"Red and Green Spots: experience with Diphenhydramine (ID 21064)\". Erowid.org. Feb 11, 2003. erowid.org/exp/21064",
 "substance": "Diphenhydramine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21064",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 11, 2003",
   "Views: 31509",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had heard of the Diphenhydramine trip before, but had assumed it was horribly unsafe and did not bother with further research. A few days ago I remembered the drug almost by chance when looking online, I read as much as I could about it, and being a fan of creepy, disorienting trips, I figured I'd give it a shot.<br>Last night on the way home from school I bought a box of 24 sleeping pills, each containing 25 mg of Diphenhydramine HCl.<br>After arriving home and finding out that my mom was gone for the night, I dropped 12 pills at 5:50 PM, washing down two at a time with some water.<br>I sat in nervous anticipation, watching the Simpsons and talking with some people online. Then I went upstairs to my semi-dark room to wait for the drug to manifest itself.<br>I became more nervous, but was able to calm myself down for the most part. Soon after, around 7 maybe, I started noticing some disturbing effects.<br>Everything seemed to move, especially out of the corners of my eyes. Things would suddenly jump forward several inches, then reappear in their correct place. I would see large red and/or green spots superimposed over my vision from time to time, kind of like the spots you see after staring at the sun for a moment and then looking away, except much bigger and more solid.<br>I looked at the wooden door frame of my room, and the grain of the wood was swirling and streaming intensely upwards, towards the ceiling. Colored sparks and dots would fly across my field of vision frequently. I found that if I ran and then stopped, my entire field of vision would 'snap' or lurch forward, almost as if it was trying to catch up.<br>I recall looking at a piece of black metal on my wall that had originally held a poster and seeing it start to vibrate, then spin violently. This unnerved me for some reason, it just did not seem right and I was overcome by an eery feeling. This quickly passed however, but similar events took place over the remainder of the evening.<br>Overall the trip was not very intense, and only lasted maybe 3 hours (although I am still catching slight visuals as I write this, a day later).<br>There was almost no 'high' to speak of, as my thought processes and motor skills remained intact. My body did feel quite a bit heavier than normal, but not uncomfortably so. The visuals were extremely interesting, though quite small scale.\n\n\n"
}
