{
 "title": "Distortions",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Distortions: experience with Nitrous Oxide (ID 2108)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2108",
 "substance": "Nitrous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "",
   "2108",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "67807",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There we were, late at night, sitting and listening to music, as the morning neared. Being just the three of us and with relatively little time (and with work the next day, for some of us), it was really out of the question to make use of any longer-lasting substances, so Nitrous was suggested, and thus Nitrous it was.</p><p>Having never made use of this particular inhalant, I didn't know what to expect. I had read up on it a bit and discovered that it was very short lived, and produced both 'aural and visual hallucinations.' Having had no drugs producing visuals before, that would be something completely new to me. I was somewhat apprehensive, but the fact that it is still used medically calmed me a bit.</p><p>I sat out the first round and watched the other two do their thing. One of them kept on inhaling and exhaling into his balloon, which eventually exploded, which sent him into peals of hysterical laughter. Hmm, I thought. I guess it's called laughing gas for a reason.</p><p>A few minutes later, they had calmed down and were ready for round two. This time, I got my very own balloon, and, with some reserve and nervousness, breathed out and then inhaled the contents. I inhaled and exhaled about four times, maybe five--I know that by the third, I noticed an effect--and stopped when I saw that the guy whose balloon didn't explode put his down. I was actually proud of myself for noticing that he did that, since everything was leaving such incredible trails it was difficult to determine where was was and how fast it was moving.</p><p>The first thing I had noticed, at about inhale number three, was the auditory choppiness. Breathing in the balloon sounded all cut up and chunky--hard to describe. The music playing in the background seemed to be going slower than before, and the balloon I was breathing into and out of was expanding and contracting at a retarded rate as well.</p><p>I felt 'fuzzy', and looking at my arms, they looked like those cartoon drawings do--those ones with multiple images used to indicate rapid repetitive motion. I managed to mouth the words 'oxygen deprivation,' more to see if I still could than anything else. I stared off in front of me, still holding the balloon at chest level, somewhat in awe of the greatly distorted universe which I had been thrust into.</p><p>I noticed, then, that the other two were looking at me, grinning, so I looked back, squinted my eyes, raised an eyebrow, and then grinned. The fact that these actions occured at a normal speed--and weren't choppy as everything else was--made them seem inhumanly fast and fluid, and the contradiction of the rest of my apparent world made making those actions seems rather strange.</p><p>At some point, I dropped the balloon I was holding. The trails everything left made stuff seem to travel in slow motion, so when I dropped the balloon, I was somewhat surprised to note that it fell in my lap. When I let go of it, I saw about three balloon images in successive steps going down towards my lap, but they only covered a few inches. I didn't see it again until it was stationary on my pants. It was all very strange.</p><p>It wore off shortly thereafter. It was certainly not what I expected, and 'hallucinations' are not what I would call what I experienced. I think I'd call them just distortions, since nothing showed up that wasn't already there. Things just showed up sort of differently.</p><p>I decided I would do this again. (I have.) It was fun. I can't, however, see getting addicted to it--it's too weird to want to live in that sort of world. Part of the fun is knowing it doesn't last long, I think.</p>"
}
