{
 "title": "24 Hours In Hell",
 "author": "Killia666",
 "citation": "   Killia666. \"24 Hours In Hell: experience with Methylphenidate (Ritalin) (ID 21093)\". Erowid.org. Jun 16, 2006. erowid.org/exp/21093",
 "substance": "Methylphenidate (Ritalin)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 21093",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2006",
   "Views: 19861",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been taking Ritalin for 3 years now, all that time I have never abused it. But I had an exam, and I needed to stay up late. So I took 2 15 mg pills (I was always trustworthy so I kept the Ritalin in my room) crushed them up into a fine powder, and snorted then.</p><p>The burn was bad, but nothing too serious. After I was done, I remember thinking 'Damn, it didnt work. Little did I know I'd have to wait for the drip (which was the nastiest tasting thing ever) to feel anything. I thought it be great. I could study, get a good grade, and pass my class.</p><p>Wrong! At first it was O.K. Mild euphoria, peaceful, etc... But every drug has its dark side. I was snapped back to reality real fast. </p><p>First it started when I could feel my heart beating like a lab rat's, I swear, I thought I was gonna die. I tried to calm down and played 'GTA Vice City' (I forgot about studying). No use, still felt like my chest was about to explode. </p><p>Finally, I said 'fuck it' and tried to sleep. HA! Not one fuckin wink. Then, as sudden as it started, it stopped. It was around 2:00 (I snorted the pill around 12:00). I finally got some shut-eye.</p><p>The next day I was the mean as ever. I felt tired, cranky and wanted to snort another line. I never did though, and I finally got out of that phase (and I didnt pass the exam).</p><p>Methylphenidate is one powerful, and I think my experience was one of a kind. It was 24 hours in hell for me.</p>"
}
