{
 "title": "Journey Inside My Mind",
 "author": "Bol-T",
 "citation": "   Bol-T. \"Journey Inside My Mind: experience with Nitrous Oxide (ID 2109)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2109",
 "substance": "Nitrous Oxide",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2109",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 6131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nRecently I had the most incredibly intense experience involving Nitrous. My friends and I were coming down off a trip and somehow had ended up at a friends house when we al decided to finish the night with some bulbs. After filling up three baloons eachs we turned the lights off and turned on the techno full blast. I had done many bulbs before this and each had been fairly intense but for some reason this one was the master.</p><p>As we counted down from three everone started to take hits from the baloons. I inhaled as much as I could and held it in for aslong as possible, repeating with each baloon until I was definatly feeling the effects.</p><p>What happened next is pretty hard to put into words but i'll giive it my best try. I completely forgot what I was doing and where I was, I was walking down a dark cylinder that I somehow knew was a tunnel going deeper and deeper into my thoughts. I was witnessing a situation that I somehow new was of great importance and I had a great understanding of what was happening. It seemed as if I was being given the answers to some important question and that everything was going to be alright from that time forward.</p><p>Then something snapped me out and I sat upright on the bed, I immediatly felt disorientated and was in a cold sweat. Although I could still feel the effects of the bulb quite strongly but I no longer had the wisdom and understanding that I previously did. Suddenly I got very emotional and felt like leaving the room as quickly as possible. I was walking around quite delirious and babbling shit.</p><p>Afterwards I was frustrated that it was hard to put my experience into words and describe it with it's full intensity.</p><p>The actual time I was bulbing would have been no longer than 45 seconds but time seemed infinite at the peak.</p><p>All the drugs that I have taken have never been able to match the intensity and personal depth that can be created by taking a quick trip down to your local 7-11. </p>"
}
