{
 "title": "Frightening Reality",
 "author": "toenailpies",
 "citation": "   toenailpies. \"Frightening Reality: experience with Salvia divinorum (5x extract), Kava  & Kratom (ID 21108)\". Erowid.org. Mar 22, 2004. erowid.org/exp/21108",
 "substance": "Salvia divinorum (5x extract), Kava  & Kratom",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Kava",
   "(roots)",
   " ",
   "2 leaves",
   "smoked",
   "Kratom",
   "(dried)",
   " ",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21108",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 22, 2004",
   "Views: 7064",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok I had an interesting experience with this salvia plant everyone is talking about, a few weeks ago. I first heared of salvia from some T.V show which I saw which made a big deal out of using a legal drug on Television, and I began researching what in fact salvia was as the guy on the T.V seemed pretty freaked out by what was happening to him.  I turned to the trusty provider of information that is the internet.  After reading several trip reports and finding an online ethnobotanical supplier I bought 1 OZ dried leaf, 1 gram 5x extract and a bag of Kava Kava and some 'Kratom' [Erowid Note:  it has since been determined that nearly all material being sold online as Kratom at this point was in fact an unknown plant, not M. speciosa]. Having never used a psychadelic before I tried chewing the dried leaves first when I got an empty house as I figured the rest of my family would probably have some problem with me using a drug like this as I have experienced many occasions where they have frowned on simple drunkeness. </p><p>So anyways I hadn't really researched the quid technique so I basically just shoved a handfull of dried leaf material in my mouth and my attempts at chewing the dried leaf seemed wholely pointless as I gained no effect whatsoever, despite filling my mouth with some gritty foul tasting plant material, I think if this quid method is done correctly it will probably produce more satisfying results than smoking but it takes perseverance. </p><p>Somewhat frustrated by my lack of results I turned my attention to smoking the extract I had bought. I decided to experiment without a sitter because I didn't really want to ask a friend to come round for such a specific purpose and then have it not work so I decided to try it first myself before involving other people (maybe a bad idea, but personally it didn't really matter).  So when the right occasion presented itself I figured I would eventually try it.  I felt somewhat nervous about what the trip might be like so after hearing about 'kratom' and kava's relaxant qualities I thought I could smoke some of each before my trip to calm me down and also it might help to 'let go' as I had read in Timothy Leary's Psychedelic experience manual that letting go produced the most positive results and could result in total ego death and enlightenment which in theory sounded great. I rolled a terrible Kava joint which almost fell apart whilst I smoked it but I managed to get some reasonable 'stoning' effects from it and I definetely felt more relaxed.  </p><p>The 'Kratom', which I smoked out of a bong, didn't seem to relax me any and I noticed that the effects of the Kava wore off quite quickly, but I was nonetheless feeling relaxed and ready to have a psychedelic experience (whatever that was). I laid my bed covers on my floor beneath my window sill as I figured I could put the bong above me and quickly get down on the ground after smoking. I left the light on and made the fatal mistake of leaving my radiator switched on which was placed right where I was lying, this made the well noted heat/sweat effects much more noticeable.  I put the first 1/10th gram (which I judged by eye) bowl onto the stem of the bong and drew my butane lighter into it. I sucked for about 2 or 3 seconds with the flame in the bowl before releasing my thumb from the air hole and inhaling, I then quickly lay on the floor and waited for an effect, seemingly nothing happened excepting the fact that my arms seemed somewhat heavy and I lay for about a minute lifting my arms up in the air and letting them flop onto my face (this seemed perfectly normal at the time), so I decided to take another hit of the bong.  </p><p>I placed about the same amount in the bowl and this time I held the flame in the bowl for about 5 or 6 seconds until the flakes of leaf started to glow white in the bowl, I then removed my thumb from the air whole and inhaled, I remember thinking briefly 'the smokes much harsher this time' by which point I was now lying on the floor with absolutely no memory of taking salvia, in fact I had absolutely no thought process at all I was just lying there. I suddenly became reasonably aware that I was on the ground though it didn't seem strange at all and I looked across at my hand which I was sort of holding half in the air, no sooner had I looked at it than my hand began to break off into an image of a seemingly endless stream of hands stretching into the distance, I have to stress that this was not like seeing a blurred image of something as when drunk this was perfectly clear that there WAS an endless stream of hands and whats more they were not my hands.  </p><p>Now the whole room behind the hands seemed to be warbled wnd moving, a stream of callers and whirling pulses, I was still somewhat aware that I was in my bedroom and I turned my head to the left and seemingly the whole room returned to normal and was perfectly fine, I glanced back over to the right at my hand and I sensed a voice inside my head say the word 'hand' then the room started to disintegrate again, the voice was certainly female and it was certainly behind me and to the right, in fact it seemed inside my head, i.e I didn't hear it with my ears but my brain immediately sensed it without the need for senses (I have been thinking about this and wonder if say a blind person would experience the visual hallucinations as they seem not to be dependant on the eyes).  As the room began to dis-assemble now the entire room, left-side included was gone and I was being taken downwards somewhere through some sort of green dimension which I couldn't really focus on or make sense of. </p><p>I suddenly became very aware that I may not be coming back to my room ever again, and started to try and get up to try and realise my surroundings, but as I did this the voice seemed to be trying to trick me into thinking that this was true reality and that my room had never existed.  I began a sort of inner tug of war with this voice and my ego, the voice wanted me to let go and come with her whilst my ego was confusingly, trying to persuade me that I was still in my room and this was all in my mind. I was fighting with myself to try and break out of this green dimension and I had the feeling that I was moving about and swinging my arms around although I couldn't see or feel anything in 'normal' reality.  It seems strange but allthough part of me thought I was still in my bedroom in some way, it seemed completely true to me that this was in fact happening and I was in no way connected to my old life. I suddenly remembered that I had used salvia and this came as a small comfort to me as I knew that the effects only lasted a few minutes, however I still felt like I might be trapped in this other dimension. </p><p>I eventually managed to catch sight of a sock which was lying on my floor and I lifted it up and smelled it and this somehow brought me back into my bedroom, though I needed to smell it several times to convince myself, I turned round to the radiator which is where I thought the voice in my head had came from and started to shout at the radiator that I was right and she had been lying all this time, then I realised that there was no voice at all and it was all an hallucination, something which I found incrediably funny at the time and I ran around my room laughing in a drunken stupour for about 3 or 4 minutes. </p><p>I have no idea how long the 'trip' lasted, but I don't think it was any more than 3 minutes, for about ten minutes after I regained my bearings I felt like I could be sucked back into the green dimension at any moment if I looked at my hand or focussed on an object for too long so I kept moving my vision around the room until the effects eventually wore-off.  </p><p>In conclusion I was very surprised at the power of salvia and it was completely unpreparable for as the trip came on so quick that any previous preparation was completely forgotten. I will certainly try salvia again but perhaps with a sitter as I have no idea what I was doing physically whilst I was in 'salvia space', the kava kava and kratom didn't really have any noticeable effects in calming me down during the trip as I became pretty scared and paranoid at one point, I don't think salvia should really be combined with a relaxant as it didn't seem to affect me in any way except maybe giving me the courage to smoke the stuff in the first place. This was certainly an unusual experience and I look forward to experimenting with all three drugs though seperately next time to guage the effects, now if I could only find out where to get ahold of some DMT, that would be a more interesting combination.</p>"
}
