{
 "title": "Beware!",
 "author": "klink",
 "citation": "   klink. \"Beware!: experience with Methadone (ID 21117)\". Erowid.org. Dec 8, 2005. erowid.org/exp/21117",
 "substance": "Methadone",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1.5 Tbsp",
   "oral",
   "Methadone",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 21117",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 8, 2005",
   "Views: 16479",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I came across Methadone through my girlfriend.  She takes it regularly about twice a week.  I asked it I could try it and she reluctantly agreed.  The methadone she receives comes in a small plastic bottle containing about 2 tablespoons.  It is a red liquid with the consistancy of water and it tastes like cough medicine. </p><p>My first methadone experience was pretty bad.  I drank a lidfull (1/2tbsp?) at 3:30p.m. at my girlfriends house.  By 4:00 I could definately feel a difference in my body.  I felt a lightness about my limbs and my hearing was dulled.  I asked my girlfriend if it was normal and she said it was.  We decided to go to get some food and then go to the park.  After we had eaten and were on our way to the park, I suddenly felt violently ill.  I imediately stopped the car and emptied my the contents of my stomach onto the street.  I felt incredibly nauseated.  I managed to get in the car and drive to the park, but as soon as we got there I again spewed out bile and food remnants onto the asphalt.  We slowly walked to the shade of a tree and lay down.  I enjoyed the peace of the park and the company of my girlfriend and the nausea went away after lying down for about 30 minutes.  I did notice however that smoking a cigarette or driving around for a too long would bring the nausea back.  With the nausea gone I felt a peace and well being similar to an opium trip.  This lasted for about 24 hours.  The comedown was very gradual and enjoyable.</p><p>Anyway the horrible thing about this drug is that it is extremely easy to overdose on.  It is easy to make the assumption that because it is a legal substance prescribed to people that it is safe.  I made the mistake with thinking it was just another opiate, similar to popping some vicodins or something.  The time I screwed up was just like any other day.  I had taken about 1 1/2 tbsp around 7:00p.m. so that I could go to sleep nicely and then wake up and go to work high. I had taken more than I usually take but I thought nothing of it.  I got real sleepy around 10:00 and decided to stay the night at my girlfriends house.  This saved my life.  Around 4:00 a.m. my girlfriend awakened to my loud attempts to breathe.  She turned on the light and noticed I had mucus running out my nose.  She quickly called an ambulance and then continued to try and awaken me.  My skin began to turn a grey color and my breathing was shallow.  As the minutes dragged on I stopped breathing altogether. I stopped breathing for approximately 2 minutes. Luckily the ambulance and emt's were able to get to me and save my life.  I was in intensive care unit for 2 days and then remained in the hospital on oxygen for another 8 days.</p><p>I hope my experience might be able to help inform people about this chemical.  It is dangerous and should be treated with extreme caution.  It is also addictive.  My girlfriend says the withdrawals from methadone are comparable to heroin.  My advice would be to stay away from it altogether, but if you must try it please be very careful.</p><p>Klink</p><p>(Note: the measurments explained here are estimations and not to be taken as to what a normal dosage should consist of.)</p>"
}
