{
 "title": "HippyCracks in the Fabric of Time",
 "author": "The Management",
 "citation": "   The Management. \"HippyCracks in the Fabric of Time: experience with Nitrous Oxide (ID 2112)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2112",
 "substance": "Nitrous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "",
   "2112",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "14312",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having been on a recent vacation, I decided to further explore with some nitrous oxide. Lately, I had been at a turning point. I had become aware of what it felt like to be self-suficent without regret or resentment for the labor one does to attain thier success. Even if it was just for the moment, I felt relaxed as if I had found my niche. I had recently begun remembering things from my past that I had not thought about for quite some time. My life had become very intense as I was going through various trials (legal and real life). In the midst of it all, I had fallen in love with a spirit. One tends to name her Mary Jane. I had always had a crush on her but now I was in LOVE. I even broke up with her for a month out of fear of wrath by 'the man' and reunited with her again, stronger than ever.</p><p>And as we spent our vaction from reality together, we invited a third spirit over: Ms. Nitrous Oxide. She could only stay for awhile but she did make an impression. You see, I used to have a fling with Nitrous back in late '95 early '96. We broke up on bad terms, as I sometimes do with women around Christmas and New Years, and it had never been the same with her since. We got too close, spending too much time together. After a huge binge it was over. In the end, a nagging feeling would always permeate the high. I would become very afraid of where I had ended up after a few blasts (say three shots in one ballon -- go buy some at a head shop sometime and get multiple balloons for a bunch of people at one time:)). After a few puffs of strait breathing in and out of a balloon, one starts to go under from the anesthetic property. This becomes an increasingly higher and higher feeling if you breath only nitrous, partly because of the drug, and partly because of oxygen deplition to the brain. </p><p>Avoid suffication (i.e. no gas mask/tank combos or garbage bags which can suffocate you). Anyway, in self administered nitrous treatment, it is a constant battle to remain conscious while taking breaths of nitous and air. You can pretty much go out a couple times if you are carefull and use 4 shots in one balloon or more (if you have a bigger balloon or tank with balloons). The high is objectively indescribable with words if you pass out completely. I start blasting back to the past on my vaction, reliving that fear and overcoming it. As I said, in my youth that fear had caused me to binge in an attempt to beat it and then give up, exausted. Anytime I did nitrous after that (which was rare, but one was during the first time I took MDMA), I felt slightly uncomfortable. Now I do not feel uncomfortable, but rather I will proceed with my vacation with Mary Jane. Nitrous is a blast, but you can't get too attached. I firmly believe all drugs have personality, just look at the stereo type of a common 'pot-head' or 'coke-head'. Though everyone reacts differently to these drugs, universal and objective trends do occur. Nitrous is much like cocaine in it's instant gratification and quick comedown... leaving one to desire more. It is also much safer, because you don't get hooked quite as easily and it is less harmful to you. Be careful out there. </p>"
}
