{
 "title": "The Time Machine",
 "author": "Laura",
 "citation": "   Laura. \"The Time Machine: experience with GHB (ID 21138)\". Erowid.org. Jun 25, 2007. erowid.org/exp/21138",
 "substance": "GHB",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GHB"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21138",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jun 25, 2007",
   "Views: 16609",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experience with GHB was interesting because I found that it made me more emotional to music.  I got sentimental and maudlin on the stuff and spent time looking at old photo/school albums while listening to old favourites.  I was getting a little disoriented and almost nodding off but not quite so I know I was on the threshold level.  I was able to retop the dosage two or three times by just taking a bit extra as the effects wore off. There was about a 10 minute delay from ingestion to onset.  </p><p>I found that my memories of my early teenage years were coming back to me very strongly and I was able to listen to these old songs as if I were going back to that time.  I also felt spiritual and peaceful.  I felt God's presence and even sensed a couple people who I've known who have died.  I couldn't see them but it was if they could have been in the next room.  I felt safe and loved by an unseen presence, though I didn't actually 'see' or encounter any spiritual being.  It was just an overall feeling of almost being in two worlds at once.  It was like I could sense eternity.  It made me wonder if this is how it may feel to be close to one's deathbed, in that I was sensing more than what I could actually see.  </p><p>I've read about and heard that dying people (slow lingering deaths) sometimes have this gradually increasing sensation of sensing the spiritual more as they get closer to death. It's a subtle thing.  My coordination was affected and when I went out to buy a can of Dr Pepper I noticed that I was quite disoriented as I was walking to the shops.  Things seemed farther away.  I also noticed that objects, if anything, looked slightly longer and thinner so that my soft drink can looked taller than normal.  Drinking fluid is heavenly!  I would get a pleasurable erogenous sensation, particularly in my mouth and lips for some reason rather than around my genitalia. I could imagine that oral sex could be very fulfilling on GHB, i.e. performing fellatio, though I've never tried it whilst under the influence.  </p><p>I don't feel too bad now but I'm wired and I can't sleep.  Perhaps this is the so-called 'dawn effect'.  I feel slightly queasy so I believe I will have a bit of a comedown though not as bad as from either alcohol or ecstasy.  The stuff I bought came in a sort of mushy playdo consistency and can either mix it into a drink or sometimes I'll just grab a lump and swallow it as if it were a tablet.  I bought it at a health food shop here in London, which they probably weren't really supposed to do; but I don't think it's fully illegal here yet.  It probably will be soon so I'm enjoying it while I can.  I was at home when I did this because I wouldn't have wanted to be out in a public place while so intoxicated.  I can see how it could be used as a date rape drug.  I masturbated after I came down and found it harder to come but my orgasm was more intense.</p>"
}
