{
 "title": "Nitrous Oxide - Western Prana",
 "author": "Gaseous Vertebrate",
 "citation": "   Gaseous Vertebrate. \"Nitrous Oxide - Western Prana: experience with Nitrous Oxide (ID 2113)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2113",
 "substance": "Nitrous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2113",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 8756",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first observation I can make about nitrous oxide is that it profoundly enhances and alters the experience of any other drug that it is combined with. By alters, I mean adds a entirely new and hitherto unsuspected dimension to the experience that transcends its usual parameters. I personally never use the gas unless it is in combination with some other psychostimulant. I personally have used gas whilst intoxicated on amphetamine, MDA, MDMA, LSD, heroin and cannabis. It every case it created a blissful and deeply significant experience, changing the mundane recreational drug use into a spiritual epiphany. I have also personally witnessed persons significantly intoxicated with alcohol thoroughly enjoy using it.</p><p>My theory of the essential nature of the gas experience is that it causes consciousness to vibrate: that is, all being is reduced to the essential duality of sound or vibration: one becomes, as it were a pure sine wave. Thus, any thought that intrudes into this state is experienced as if that single thought and the perceiver of it were the only two objects that comprise the entire universe. Thus, such thoughts are deeply significant. </p><p>As the 'rush' of a standard dose of nitrous oxide (10 cubic cms)lasts objectively for about 90 seconds, while the subjective experience is somewhat timeless, the full import of the eternal expansive thought is usually lost upon return to normal experience of time and complexity of thought. However, with practice, and repeated use and some prior concentration it is possible to bring the experience more fully forward into normal consciousness.</p><p>It is also more fully enjoyed in company, as the transcendant state it produces can be a powerful social bonding.</p><p>Obviously, it is is difficult to verbalise such elementary mental states, but I will say for every skeptic I have convinced to try the gas with me on ecstasy or other amphetamine has been profoundly blessed and is a skeptic of the drug power and value no more.</p><p>The best attempt to objectively characterise the nature of the experience in general terms is found, in my opinion, in 'Psychedelics Reconsidered.'</p>"
}
