{
 "title": "Mental Visuals",
 "author": "GKP",
 "citation": "   GKP. \"Mental Visuals: experience with Salvia divinorum (ID 21133)\". Erowid.org. Mar 14, 2007. erowid.org/exp/21133",
 "substance": "Salvia divinorum",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21133",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 14, 2007",
   "Views: 3580",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter reading many of the reports submitted on experiences with Salvia, I decided to write this account in a more simple way describing the effects in the most basic form. My experiences with hallucinogens is limited to only mushrooms, but the varied experiences I have had with them greatly improved my ability to comprehend what exactly was happening to me when I smoked the salvia.\r\nMy first time smoking salvia extract was with the 7x form which had a surprisingly pleasant nature to it. I was with a group of friends and we filled the bowl with what looked like a dark dried up leaf, with an almost floral aroma to it. This was different than the 1x form, which basically looked like little brown leaves, and which was far less expensive but not nearly as powerful. Not having 'ripped' a bong in a long time, and wanting to get the most bang for my buck, I took the biggest bong rip I possibly could and inhaled the smoke making sure to keep it in as long as I could hold my breath. About ten seconds after exhaling, with little smoke actually coming out, I began to feel my body getting sucked down onto the couch and my head feeling thick and heavy.\r\nI looked at my friends on the opposite of the room and I felt like they were being sucked into the floor. Now I must note that I didnt actually see them moving into the floor, it was might sight of them, their visual appearance was pulling towards the ground. The reason I note this is because it was very different than hallucinating and seeing blood drip from the ceiling, it was a totally mental vision which was fully under my control. I did not lose touch with reality, and it was not a full out trip.\r\nI took another large bong load and then another, and every time I experienced a mild sensation of hallucinating, but I was always in touch with the reality of what was happening and every time the affects would end after only three to five minutes of having an altered perception. I also did not see any color patterns or what could be described as hardcore visuals like objects floating or trees moving. It was a very mild experience with the 7x form. \r\nMy second experience happened the next day after going to another head shop in town and purchasing the 10x form of the salvia extract. This was supposed to be the strongest form available, and I am not sure if that is true, but thats what the I was told. I was with three different friends of mine, and we all sat there, put a little bit of bud on the bottom of the bowl, cause the bowl was real big and we didnt want to suck the salvia through, which I should point out will happen so be careful. The 10x extract was darker than the 7x and looked more like real small burned wood chips. It didnt resemble a leaf at all. We were using a thick three foot bong, with a huge bowl and we all proceeded to take the biggest hits we could possibly take.\r\nAfter taking the first rip and holding it in as long as we could, we packed more on top and kept it going around, again taking the biggest hits possible. I sat back and waited, laughing at first, almost like when you first begin to trip on mushrooms, but for a much shorter amount of time. The 'perma-smile' thing was happening, but only for about thirty seconds.\r\nNext thing I know, I am looking at my friends sitting on the opposing couch and their bodies began to blend into the pattern on the couch and slowly get vacuumed up into a vortex like point in the wall above them. This is similar to the experience I had the day before with the 7x salvia extract, but much more intense. At this point I had begun my journey into a disillusioned reality. I think the best way to describe it is disassociation with my surrounding and with myself as a being. This might sound like a bunch of mumbo jumbo, and thats exactly what I dont want this experience report to be, so basically I lost touch with reality and everything surrounding me.\r\nFor a little while I didnt know why I was feeling this way, or if something had gone wrong in my head, but from past experiences with hallucinogens I quickly realized I was tripping and it would all be over soon. The feeling in the body was similar to that of using pharmaceuticals and having body parts feel heavy and weighed down, also similar to the body high under mushrooms.\r\nThe visuals in the experience however were mostly mental in nature, as I wasn't seeing extraordinary colors or patterns moving, it was almost like a dream like sense of visual. My reality was so skewed that I felt like I was in a dream. I could almost see what I thought was going to happen. I was also able to keep myself calm and talk to my friends, but for a short amount of time I didnt want to because I felt like there was something wrong with me, a slight paranoia. For an instance I felt like leaving the scene and going home, like getting away would allow me to figure out what was happening.\r\nWhen talking I could basically answer questions and make comments, but I didnt understand where those answers were coming from, they were at the time almost impulsive. While at the peak I wanted to experience the trip with my eyes closed and I was thinking and seeing the same dream like reality. It was a total loss of consciousness and of self reality. The whole trip lasted about thirty minutes and had a peak of about twenty minutes. I was confused for a short time as to what had happened to my mind, and why I was experiencing such a different mindset and difficulty understanding the reality of reality.\r\nWhat kept me sane through the basically unexpected hallucination, was the fact that I knew what the feeling of tripping was and also that I knew it was going to be over in a short amount of time. It was also calming to realize that the feeling I was having was due to smoking the salvia, as often when tripping one loses touch with all surrounding including the fact that they smoked or ate anything to cause the trip.\n\n\n"
}
