{
 "title": "Combo Induced Fear",
 "author": "Side Show Bob",
 "citation": "   Side Show Bob. \"Combo Induced Fear: experience with Escitalopram & Cannabis (ID 21169)\". Erowid.org. May 10, 2006. erowid.org/exp/21169",
 "substance": "Escitalopram & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Escitalopram",
   "(daily)",
   " ",
   "5.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21169",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 10, 2006",
   "Views: 14529",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a sunday night in february with nothing to do as usual. I was out with my friend getting high...the usual, only tonight was different. The last couple of nights were different. I had been recently prescribed to the antidepressant Lexapro (escitalopram oxalate) 10 mg. My doctor told me that the most common side effect was nausua. so I was okay with that, I had already had my experience of antidepressants, been on zoloft and effexor for a 5 year period. My depression has really been taking over my life lately. </p><p>I am currently out of school, and just lost my job a week ago. I think to myself that its just bad luck, but really I think its the laziness and calling into work that got me here. My doctor put me on a more powerful dose of a different pill. so here I am now, high as hell sitting here just after smoking a blunt, then another 2 joints during the 1 hour long simpsons episode. I can't stop thinking about how weird everythign around me has been the last couple of days. I find myself almost in my own world all the time, I never hear whats really going on, conversation wise, I just have a really hard time following people when they are trying to tell me something, [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] driving I can't stop and think that a deer with huge antlers is going to run out in front  of my car and take my life, I see all of the details while I'm ina dream like state while I'm on the road home...trying to make it home safe. </p><p>I think to myself that someone is in my back seat waiting for me when I least expect it, even though before I got into my car I checked the area around me because I felt like somebody was out there, watching me, I dont know its weird...I jsut dont feel like I am really alone, I am only 2 minutes away from home, sso high that I briefly wait in my driveway for my visine to take the redness out..and my mind is somewhere else, yes! and here I go again running to the front door  because I feel like someone is chasing me!! I come inside to put on my opajamas, turn on my cd player to listen to some jack johnson ...this will  mellow me out, I get a glass of water, sit down in my living room with my parents and felt very out of place..I wanted to just crawl in a hole and die, I felt very negative vibes from them....at htis point all I want to do is give my mom a big hug, I want her comfort but I find myself comign here to my computer to share my experience. </p><p>This one will hopefully be the last because im telling my doctore tomorrow that these pills are no good!!</p>"
}
