{
 "title": "Not Just for Egg Nog",
 "author": "Dan",
 "citation": "   Dan. \"Not Just for Egg Nog: experience with Nutmeg (ID 2120)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2120",
 "substance": "Nutmeg",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3 Tbsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2120",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 4642",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One Friday afternoon after reading a bit about the psychedelic effects of nutmeg I decided to give it a whirl. It was about 3p.m. when I ingested it. What I did was; I filled my mouth half way with water, then poured a heaping table spoon of nutmeg into my mouth, followed by some more water, and then swallowed it all at once and repeated two more times. </p><p>I was just hangging out with my friend Joe playing video games for about two hours, until we had to go to his girlfriend's house and thats when it started to take hold. I was feeling a bit euphoric and a bit high at the time it was about 5:30. When we got to his girlfriends house her mother was there and she began to talk to us about some trip she was taking that day, I only recall half of what she was saying since I was in a sort of daze. I can only describe the 'daze' as an awake dream, it was like I was participating in all these events but as a spectator where I'm watching myself do things.</p><p>I remember sometime around 8 going to some fast food joint to eat with Joe and a couple others, but only getting a drink to get the lingering taste of nutmeg out of my mouth. At about 9 we went to the mall, all the while I'm still feeling high not a hyper kind of high like some people get but more of a mellow type of high. There we met up with a friend named Donny who imediately asked me if I was high. I told him I didn't smoke anything and he called me a liar because he said my eyes were dark red, which I hadn't noticed yet. I told him what really did and he said he wanted to try it but I told him to save it for another day. The mall closed at eleven and we went back to Joe's girl's house, by the way I was still feeling high with no signs of coming down.</p><p>Later around midnight I paged my friend Shaun and he came by and we went to IHOP with 2 other people. I remember ordering a burger and fries and a coffee, I didn't finish it, and I think I fell asleep right there. At about 1:30am we left and I went back home. I was feeling really tired and high still, but I didn't want to go to sleep, because I didn't want to miss the psychedelic stage (the whole reason I took the damn nutmeg) of the drug which I was told comes around ten hours after taking it. So I forced myself to stay up while watching some Chris Rock special on TV. </p><p>Nothing was happening and it was about 3am so I called it quits and went to bed. All of a sudden couldn't sleep, and then my stomach started to feel weird. It felt like my stomach kept contracting, and I had real sharp pains like someone had a rope tied to my stomach tugging it and letting go, tugging it and letting go, tugging it and letting go, that went on for a half hour and once it stopped I finally went to sleep. Only to be woken up sometime later by a humming noise, this noise was coming from nowhere, and it kept getting louder and closer until it got right inside my ear only to die out. Then I went to sleep again....</p><p>The next day I woke up by my alarm at 7:30am because I had work at 8. I stood up to shut it off and I found I was having trouble walking. I staggered to the bathroom and looked in the mirror to see my eyes almost completley shut and what part of my eyes that were open were blood red. I went back to my bed in no condition to work and called out sick. Then went back to sleep. I was woken up at 1pm by Joe still tired but no longer high, my eyes were still bloodshot but not nearly as much as before, and I could walk strait. For the rest of Saturday and the following day I was beat, I could not do anything more active than getting the mail , and I dont even think I did that.</p><p>In my opinion nutmeg was par, not that much fun, but something to do. I was let down since I didn't even hallucinate, although I can't explain that huumming noise. For those of you going to try nutmeg make sure you don't have anything to do for the next 72 hours, don't have to drive, and won't have anyone questioning why your eyes look red. If you go by those rules you should be ok. </p>"
}
