{
 "title": "Thinking Through Movements",
 "author": "Hashbrownx",
 "citation": "   Hashbrownx. \"Thinking Through Movements: experience with Hyoscamine & Zolpidem (Ambien) (ID 21232)\". Erowid.org. Jul 1, 2007. erowid.org/exp/21232",
 "substance": "Hyoscamine & Zolpidem (Ambien)",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "sublingual",
   "Hyoscyamine",
   "(pill / tablet)",
   " ",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21232",
   "Male",
   " ",
   "Not Given",
   "Jul 1, 2007",
   "13876",
   " "
  ]
 ],
 "report": "<p>I have used ambien, a non-barbitual hypnotic sedative a.k.a. kickass sleeping pill on a regular basis, I have a prescription because I have very severe insomnia. It gives pretty good trips when taking two or more 5 mg pills. Good visuals, and very good feelings and thought process. I was looking through my medicine cabinet for any pills to peddle. I came across some of my old pills such as Tylenol with codeine #2 and various anti-depressants. I noticed two interesting pills, belladonna/phenobarb and hyoscamine, pills I had taken for stomach cramps. I decided to do some research. </p><p>While I could not find anything on the actual pills I did find out that both Belladonna and Hyoscamine are both kinds of Deadly Nightshade. I thought this was interesting so I decided to take my ambien, and take two of the Hyoscamine, the friendlier looking of the two. It was a tiny blue pill, that you are supposed to dissolve under the tongue. It tasted pretty decent, minty, but by the time you are finishing the pill it is tiresome. After about ten minutes I noticed I was feeling it. I noticed my bed was pulsating and the covers were moving. The moving covers is the signature first sign of an ambien trip.</p><p>Here is a conversation I had with a friend online. 'Translations' are in parenthesis.</p><p> me (11:38:33 PM): this is so trippy</p><p>Her (11:39:07 PM): what is?</p><p> me (11:39:07 PM): li   am thinkinh thtough movenments [I am thinking through movements]</p><p> me (11:39:44 PM): the floor and the celeing are fettinh mixxed up[The floor and the ceiling are getting mixed up]</p><p> me (11:40:10 PM): but there are big plants growing\\ </p><p> Her (11:40:26 PM): are you high</p><p> me (11:40:37 PM): everytahng is slanted</p><p> me (11:40:54 PM): somewhat]</p><p> me (11:41:06 PM): the keys are colored now\\</p><p> me (11:41:46 PM): and the colors are reminiscent of police cars</p><p> me (11:41:54 PM): and the floor is shakeiin</p><p> me (11:42:11 PM): the room is spinning alittle\\</p><p> me (11:44:58 PM): I feel like warm socks</p><p> me (11:45:07 PM): u dibnt nbotice my body [I didnt notice my body]</p><p> me (11:45:10 PM): I have to shake</p><p> me (11:45:24 PM): nmy lips are intense</p><p> me (11:45:37 PM): I neeed to got to muy bro;s roomfor a better tripp</p><p> me (11:45:49 PM): nmovements are harddddddddddd [Movements are hard]</p><p>After that I stumbled into my brothers room. I laid down on his bed and the second I closed my eyes I felt like I was moving. Not like I was moving but more like the bed was moving, very powerful movements not like inching, but more like a ride. It was spinning and changing incline. It was incredible. On ambien trips I had felt movements but nothing this intense before. I looked up and noticed that my brothers Grateful Dead Poster was not flat on the wall. It was 3-d and stuck out. I walked up to touch it and was disappointed too see it was flat again. My brother yelled at me to leave his room. I kept telling him I was leaving, but instead just lay on his bed. It took him quite sometime to actually convince me too leave.</p><p>When I got back in my room I turned off my computer and lay on my bed. I kept trying to make it feel like a ride again but I could not. I decided to turn off the light, but after a little while I noticed they were still on. I decided I must have forgotten to turn them off. I noticed they were still on later and actually turned them off. It must not have occurred to me that I actually had to do some action to make them turn off. The rest of the night is blurry but I do remember going back into my brothers room after he had fallen asleep, and lying on his bed to get the movement feeling, but I was unsuccessful.</p><p>This was a pretty decent trip in my opinion. Though it lacked visuals for the most part it was very fun. I will probably repeat this. The hyoscamine appears to be pretty decent shit. I hope there is a market for this shit because I have so much of it.</p>"
}
