{
 "title": "A Trip Back in Time",
 "author": "Tripper No. 9",
 "citation": "   Tripper No. 9. \"A Trip Back in Time: experience with AMT (ID 21242)\". Erowid.org. Jul 17, 2008. erowid.org/exp/21242",
 "substance": "AMT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "AMT",
   "(pill / tablet)",
   "  T+ 1:00",
   "25 mg",
   "oral",
   "AMT",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 21242",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 17, 2008",
   "Views: 3750",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently I aquired some AMT from a friend of mine.  He gave me two pills, each containing 25 mgs of AMT.  I took the first pill at about 3:30 in the afternoon.  He had told me to take one pill and the second an hour later.  So I did as he said and took the second pill at 4:30.  The first two hours were all waiting. about half way threw the second hour I started getting angry, thinking he had burned me and I wouldn't trip.  <br>I popped in Fantasia just so it would get me in the mood to trip if the stuff was going to come on eventually. I then turned out the lights and sat down on a chair.  I was feeling a little funny, some naseau.  At about 7:30 it started to kick in.  I looked in the corner of my room and saw a Chinese Dragon floating around. 'What the hell?' I thought, then i realized that it finally kicked in. I was completely filled with joy at that point. I put on a Led Zeppelin album and walked around my room tripping.  <br>It felt like i was floating, I felt alive, I felt very psychadelic, it made me feel like I was a hippy in the 60s.  After listening to Zeppelin for awhile, I picked up my guitar and began to play.  The neck of the guitar felt like a snake slipping around in my hand.  This was insane. Everything was covered with patterns and was moving. <br>I then went upstairs to the living room(my room is in the basement).  This was a mistake, it caused me to overcome with naseau.  I put on Fast Times At Ridgemont High, and sat on my couch which was completely out of control.  There were patterns of plants on it and they were all moving around like crazy. I got completely lost in the couch and started to feel like I was going to be sick.  I turned off the movie and went back downstairs. I was only a few hours into the trip but it was starting to turn out bad. I knew i still had a long time left.  A friend told me he had tripped for about 25 hours one time. I couldn't imagine being completely twisted on this drug for another twenty hours.  It was ahorrible thing to think of.  So I just tried to enjoy the rest of my trip in what felt like the psychadelic age of the 1960s.  <br>I listened to some more records, like The Beatles and the Who, more Zeppelin.  I watched a few movies and just tripped out. It felt like I was in a cartoon. I knew I wouldn't be able to sleep so I stayed up most of the night. I layed in bed in the early hours and looked out my window and around my room. The American Flag was very intense, the stars swam around and interlocked with one another.  It was light out now and I could see out my window. There seemed to be a snake, or multiple snakes going around, and a mouse.  It was going to be eaten.  This was a bit intense but exciting to watch.  The most intense hallucination I had yet, well, next to the dragon.<br>I fell asleep while watching the snakes, I awoke a few hours later and felt rather burnt out and had to lay around and relax the next day.\n\n\n"
}
