{
 "title": "What's the Story Morning Glory?",
 "author": "PacoLoco",
 "citation": "   PacoLoco. \"What's the Story Morning Glory?: experience with Morning Glory (Heavenly Blue) (ID 21250)\". Erowid.org. Feb 12, 2003. erowid.org/exp/21250",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21250",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 12, 2003",
   "Views: 21015",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I found some morning glory seeds at the local nursery.  I read that they contain LSA, so I figured I would give it a whirl.  I opened up the 5 gram package and washed them, then ground them up into a find powder.  I then mixed the powder in with a sports drink and drank it down, mistake number 1.  </p><p>Withing 5 minutes I was already feeling kinda off key.  Like I had just woken up with a really weird hangover.  It was easily manageable, and I continued with my activites as normal.</p><p>Then I felt a pain in my stomach of unknown proportions.  My friends had injested some seeds with me by the same means and they were all feeling sick too.</p><p>We decided to smoke a bowl, but it did not help to our dismay.</p><p>By now things were getting very weird.  Sounds became very alien, and I entered into a highly catatonic/drunk state sprawled out on a couch in my house.</p><p>I then got up to walk around a bit to calm my stomach and decided to take a small walk outside since sometimes fresh air helps.  I walked around for a bit outside in the brisk air, and then vomited.  It was interesting because as soon as that happened a million throughts ran through my mind, like if I was going to have to go to hospital, because I couldn't stop.  I finally did.  It made my head spin, and my vision went completely blurred for a while and I couldn't make out anything.  </p><p>After this I went inside to go brush my teeth since I still had the sour taste of vomit fresh in my mouth.</p><p>My friends asked if I was ok, and I said I was fine.  I was still pretty weird, and only about 20 minutes had passed.  I knew that some of the LSA took a hold of me before I expelled it.  I must have brushed my teeth for what seemed like 20 minutes, but was only about 2.  My time perception went a bit off, but only for a short while.</p><p>I then returned to the couch in a catatonic state, when suddenly I felt this rush.  It was about 30-40 minutes after injestion.  I felt energized and ready to take on the world.  I began to stare at things, the walls, the cats, and whatever was in my field of view.  There was not much morphing, but a lot of depth perception play.  I also noticed lots of shadows moving slightly in what seemed like some rhythmic pattern.  I just laughed.  I was very euphoric.  The weed had kicked it up a bit.  We all began to talk about what was going on, when my friend all the sudden said 'WHOA! 8 Lanes of traffic!!!'  Apparently that is what he saw appear before him.  I was not getting anything that intense, but it was very mild, and highly amusing.  </p><p>This state carried on for probably another 4 hours or so.  We watched a movie and laughed it up, and my friend gave me the craziest light show, which induced all sorts of crazy visuals about the room for a long period of time.  After the immediate affects had come and gone they went to sleep, but I had nothing to do the next day so I stayed up until I was back to baseline, which was about 6-7 hours after injestion.  </p><p>It was a highly amusing experience except for the nausea.  Next time I try it I will most definately follow the extraction processes, which my friend pointed out was probably my fatal flaw.  I think I'd do more tho, 5 grams was a good dose, but next time I'd probably do 10 or so.</p>"
}
