{
 "title": "It's Just Not Worth It",
 "author": "Wen",
 "citation": "   Wen. \"It's Just Not Worth It: experience with Diphenhydramine (ID 21252)\". Erowid.org. Feb 12, 2003. erowid.org/exp/21252",
 "substance": "Diphenhydramine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "800 mg",
   "oral",
   "Diphenhydramine",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21252",
   "Female",
   " ",
   "Not Given",
   "Feb 12, 2003",
   "Views: 129869",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have taken smaller doses of diphenhydramine before, about 400 to 500mg or so, and had not had any real lasting problems, so I figured it was okay to take more without experiencing any ill effects.</p><p>I was wrong. Oh god, was I wrong.</p><p>I was walking to school one morning in October and I stopped by the grocery store on the way there to pick up the pills. I purchased a bottle of 32 50mg gel tabs of Unisom, a sleep aid, and a Butterfinger Bar.</p><p>As I left the store, and continued on my way to school, I downed 16 of the little blue pills. This was at about 6:20am. I was looking for a way to not entirely be myself at school that day, a chance to be so out of it that I could sleep through class and just waste the day away without having to think too much.</p><p>Needless to say, I got more than I bargained for.</p><p>Anyways, so I continued walking to school and was basically fine until about 6:50 or 6:55, when I arrived. I walked through the building for a few minutes, but because I was a little early, not too many people were there, so I wandered back outside.</p><p>Outside, I was walking past the gym when I saw this guy that I sort of knew, he was a good friend of one of my friends, and he said hi as I walked past. I said hi as well, and was anxious to make my way past him and go on into the school, but then he noticed that I was not walking exactly straight, and he asked me if I was okay. I told him that I was fine, which wasnt true, I was not anywhere near fine, but thats what I said anyways.</p><p>He didnt quite believe me, I think he thought I was drunk or something, because I was walking all crooked and kept tripping and I wasnt talking like the most intelligent person either. At this point, I was starting to feel the effects of the drug, majorly. I was having a very hard time walking, especially with my bookbag on, it felt like I was being pushed down by some unknown force, like someone had turned the gravity up and was still turning the knob.</p><p>My tongue was becoming increasingly larger, and it wasnt working too well. I would try to say something, and instead of using my tongue to form sounds, it just kept getting in the way.</p><p>So he kept asking me what was wrong and I kept telling him that I was fine, just leave me alone and let me go on. But he wouldnt let me go. He was telling me that I was not okay, and I needed help.</p><p>Then a teacher or someone came by, I dont know if someone went to get her or if she just happened to be walking by, but she sat me down in a chair and told me to rest, and clam down.</p><p>Well, I tried to sit down, but I kept slipping out of the chair, and finally I ended up just laying on the concrete, right outside the gym there. I kept trying to get up, but no one would let me. Some other teacher or administrator people came by and they kept asking me questions. They were asking me what I had taken and how much. I wouldnt tell anyone, so the lady said that I had to tell her, and if I didnt, then she was calling 911. That scared me, because I didnt want to go to the hospital.</p><p>I had done this before, and if I just had some time to let it wear off, I would be fine.</p><p>I dont remember too much of what happened next, just bits and pieces, but I think my friends friend and some other teacher helped me walk to the attendance office and they put me in a chair. I vaguely remember the lady calling 911 and giving the address of the school to whoever was on the line. I remember seeing the paramedics come a little after that, these two guys in all blue came into the office. That is the last thing I remember until the hospital, but according to my friends, who came into the office, I was passed out on the floor and it looked like I was dead. I was then loaded onto a stretcher and wheeled out of the office into an ambulance, where I was taken to the hospital. I dont remember any of the stretcher or ambulance ride, though.</p><p>The next thing I remember is seeing this lady, about 25 years old or so, and she was trying to get me to drink this stuff, and I didnt want to. So she shoved this tube down my nose, through my throat, and into my stomach and put the charcoal into me that way. I think I passed out again after that, but the next time I woke up I remember looking around and thinking, Where the hell am I? I noticed the IV in my arm and then I looked down and I saw that I wasnt wearing any clothes, expect this little hospital robe. I thought, What happened to my clothes? I noticed that I wasnt wearing any underwear either and the sad part was that I didnt know if that was because someone had removed them, or I had just forgotten to put underwear on that morning.</p><p>Then I remember my grandmother and my parents came and tried to talk to me, but I was still not totally there. My mom tells me I was saying things that made absolutely no sense, and even talking to people who werent in the room at all. I was still having hallucinations also, the walls were moving and was hearing things as well. I had to stay in the hospital for a few more hours, until my heart rate and blood pressure were back to fairly normal, and they had IVed enough saline or whatever into me to make me have to get up and pee about 4 times.</p><p>A man came in and talked to me and asked me if I was trying to commit suicide, and he said that I was going to be admitted into the local Behavioral Center or mental hospital, basically. So I was checked out of the hospital and checked into the Behavioral Center where I had to stay as an inpatient, meaning that I had to spend the night there, for four straight days. After that, I was allowed to go home at night but come back to the day program from 8am to 4pm for five more days.</p><p>I was put on anti-depressants and I was suspended from school for three days as well because when I was passed out, the school searched my book-bag and found the rest of the Unisom, some Advil, and a lighter. I have to go to a drug and alcohol abuse program for two weeks, and continue with counseling after that.</p><p>In all, I missed seven days of school, my chance to go to homecoming, and now my parents are more paranoid than ever.</p><p>I nearly died in that hospital.</p><p>Now you tell me, is it really worth it to take a few pills and try to change your mindset for maybe a few hours, and risk all of that?</p><p>I didnt think it could happen to me either, but it did. All I know is, I will never touch that drug again, nor any other. Its just not worth it.</p>"
}
