{
 "title": "Death by Xanax",
 "author": "arieljb",
 "citation": "   arieljb. \"Death by Xanax: experience with Alprazolam, Cannabis & Alcohol (ID 21262)\". Erowid.org. Apr 22, 2003. erowid.org/exp/21262",
 "substance": "Alprazolam, Cannabis & Alcohol",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:30",
   "1 tablet",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "1.5 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:00",
   "4 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "21262",
   "Female",
   " ",
   "Not Given",
   "Apr 22, 2003",
   "Views: 63816",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Mixing drugs and alcohol is never a smart thing to do. Being college educated, one would think that I would know this and adhere to it. But in the midst of my experimentation and stupidity, I spent one night of my life nearly dying. </p><p>A friend of mine is addicted to pills, particularly xanax. Grudgingly one night he sold me two footballs. I ate the first one, then waited about a half hour and ate the other one. In between taking the footballs I smoked a blunt. Feeling great at that point, I smoked more pot, I can't remember what exactly, probably like a bowl or two. I was looking foward to a great evening. I was feeling relaxed, euphoric, down for anything. About an hour after taking the first football my boyfriend, our friend and myself went to a friend's apartment. He offered us some rum. I was feeling awesome already so I threw back 4 shots of rum. This coming from a girl who usually SIPS her alcohol. It only took a few minutes before my head started pounding and my stomach was turning upside down. I stumbled into the bathroom. I have no clue how long I was in the bathroom or how much I even threw up. </p><p>Eventually my boyfriend came in realizing that I wasn't in good shape, he stuck his fingers down my throat and made me throw up. I remember thinking, damn this kid's never satisfied, cause he just kept making me throw up over and over again. It wasn't until later that I realized his actions probably saved my life. All the throwing up left me light headed and I still felt like I was not in the clear yet. The whole time I was hearing voices in my head and starting to freak out. It's the worst feeling, knowing that you have no control over your mind and body. My boyfriend forced me drink cup after cup of water and sat with me in the bathroom for what seemed like forever. Eventually, the other guys came to make sure everything was ok. From what I was told afterwards, I had to be carried by two guys through the halls of the apartment building and put into my boyfriend's car. My boyfriend took me back to his house and made me drink more water.</p><p>I consider myself lucky that I had someone looking out for me. If I had just gone into that bathroom and passed out, I know that I wouldn't have woken up. A person with a low body weight like myself should NEVER mix pills and alcohol. BE CAREFUL!</p>"
}
