{
 "title": "Molecular Death for the Warrior",
 "author": "SullenChoirboy",
 "citation": "Citation:   SullenChoirboy. \"Molecular Death for the Warrior: experience with 5-MeO-DMT (ID 21268)\". Erowid.org. Feb 15, 2003. erowid.org/exp/21268",
 "substance": "5-MeO-DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21268",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 15, 2003",
   "Views: 19949",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSaturday. I don't think much of what happened tonight could be translated to text, but here, for the sake of remembrance, I'll give an overview of this tragedy and miracle.\r\nI'd been on somewhat of a psychedelic 'bender' lately - 20mg 2C-T-2 about 5 days ago, moderate doses of 5-MeO-DiPT on Thursday and Friday, and today it all came to a spectacular pinnacle, an unplanned event I could never recreate. \r\nTonight, at 9:40 PM, alone in my room lit by bubble lamp and lava lamp, with a trance compilation entitled Euphoria providing the ambiance, I loaded a small amount of 5-MeO-DMT into my glass pipe. I only wanted a small hit, something I've discovered to be a manageable transcendental moment through experimentation. My mistake, however, was not showing enough caution concerning the pipe's inside already being covered with half-vaporized portions of previous doses. I held the hot flame on too long, vaporized too thoroughly. Every bit of residue melted at once and a strong-tasting gas filled the apparatus.\r\nI realized my mistake as soon as I brought the smoke into my mouth. Smoke was pouring out of the pipe at both ends, and it hit before I even exhaled. A normal vaporized dose of this chemical will usually take at least 5-10 seconds before anything is felt. This time, it hit immediately and gripped harder than words can describe.\r\nI gagged and threw the pipe and lighter down in panic. Most of what happened after this was too much to register in my memory, and what I do remember is hard to put into words. What came was a feeling more terrifying than I could've ever imagined in my lifetime. My insides turned to stone. I stopped breathing. I tried to force the action again, but there was far too much going on in my mind for such trivial matters as breathing.\r\nI thrashed about on the floor a bit, then fell on my waterbed. Survival was uncertain, but I fought for my life. My room disappeared and I was splashing around in a violent sea of infinitely intense colored liquid of ecstasy, pain, life, and death. I've experienced the idea of matter vibration objectively, but this time I felt it firsthand, as every molecule of mine vibrated and released me into liquid psychedelic warmth and energy flow. I was pure energy. Layers peeled off from such depth, I knew that if I survived, I would never be the same. Time stood still as I discovered entelechy.\r\nAll the depression I've been feeling lately, all the confusion, everything I was, everything I knew, it all bled from my cold bare skin. It shouldn't take such a severe attack on my mortality to realize the futility of the suffering I put myself through, but sometimes it does. This was a real lesson in impermanence. Whatever happened to me in this state of unlimited terror, it eventually showed signs of easing and I realized I was going to be okay.\r\nI lie on my back on the waterbed. Breathing began to to steady and I began to calm. I began to remember who I was and objects began to separate again, rather than seeing the multicolored liquid blend that was swirling around me just minutes before. Somehow, sometime during my death/rebirth, I turned on the television and turned down the music, perhaps for grounding. I knew that I'd eventually come to be very grateful for what had to be the most terrifying experience of my life, this experienced molecular death.\r\nI lied there staring at the ceiling, thinking, integrating. I ran a few math equations through my head to make sure I hadn't damaged my brain too badly. I was going to be alright. It was a strongly traumatic to my mind and body, but that didn't seem to matter. All that mattered was that I was alive. I was just glad to be alive.\r\nI didnt sober for a while. Whereas I usually feel normal after at least 30 minutes, this time it took well over an hour. I just sat still thinking of what I could learn from this. None of the depression I'd been feeling, none of the confusion, none of my troubles, none of it mattered anymore. I'd just transcended my life and had the divine psychedelic experience I never could've imagined. It was a difficult experience, but before long, I'd come to really value its impact on me.\r\nAfterwards, there were no adverse side-effects, surprisingly. My health seemed to be in good order. It wouldnt have mattered much, though. I was just glad to be alive.\n\n\n"
}