{
 "title": "Nutmeg Shit Me Up!",
 "author": "Gus",
 "citation": "   Gus. \"Nutmeg Shit Me Up!: experience with Nutmeg (ID 2131)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2131",
 "substance": "Nutmeg",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "22 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2131",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 28936",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI recently took a hit of nutmeg and to put it mildly ,I was WELL FUCKED!! I bought a 52g jar of ground nutmeg and divided it up into two mugs of hot chocolate. One mug was for my mate, who promptly refused when he sipped his half of the rancid mixture. Not wanting to waste it, i persevered and gulped it down in three sickening stages,whilst holding my nose(it was that bad!). I think i must have consumed approx 22gs. This was about 2.30pm...<br>We then headed up town to do some shopping and returned about 5.30pm. At this time my lungs became very sensitive and as i smoked i could feel all the shit and crap that was lining my lungs,causing me to sporradically cough. I have had this sensation before on acid so i wasnt too worried. At this staged i felt slightly stoned and sort of drunk but it was only a mild sensation..Then the shit hit the fan!!<br>About 6.30pm ,as i laid on my bed watching my mates play doom, all of a sudden my heart rate crept up to about 130bpm and just continued to pound away....with each thought of 'fuck my heart can't take much more of this ' a sort of numbness spread out form my left side and enveloped my heart region. At this point i was shit scared and told my mates to get an ambulance but they just said 'im not doing it!' and passed the phone to and fro. I just lay there unable to move as a new sensation hit me. It felt as if i had a heavy weight pressing on my heart, it was like heavy hardback book tipped on one corner sitting on my chest, if you can get the comparison. At this stage i thought i was going to die and just waited for my heart to eventually overload. This continued for about two hours, with me in the meantime trying to take deep breaths to relax myself and slow it down. My friends soon departed and i just continued to lay on my bed watching tv. Before these events were set in motion i had been awake for about 20 hours and now at 8.00pm, i was hitting 26 hours.<br>I started to slowly drift asleep and at this stage i thought 'if i fall asleep ill never wake up.' So i kept myself awake until about 11.00pm. During this final period it felt like i was feeling the effects of every drug i have tried all at once but only mildly, if you can understand that! Also,as i watched tele i kept having deja vu about the things i was seeing ,thinking i saw them earlier on breakfast tv(The Big breakfast advert clips to be precise!)WEIRD ,HUH!!<br>Finally i soon fell asleep and woke up the next day..Phew!! i must admit it was an experience ,but not one ill try again in a hurry!!<br>Could someone tell me if what went wrong? Did i push the limit with my heart? I mean could i have had a heart attack? I apologise about the length of this post but i had to share my experience with you!!!\n\n\n"
}
