{
 "title": "Intensity Of Emotion",
 "author": "Boywithproblems",
 "citation": "   Boywithproblems. \"Intensity Of Emotion: experience with Mushrooms (ID 21335)\". Erowid.org. Mar 30, 2007. erowid.org/exp/21335",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21335",
   "Male",
   " ",
   "Not Given",
   "Mar 30, 2007",
   "2975",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experiance with mushrooms is one I will never forget. I had taken them by myself just after hearing some particularly bad news that had me in a terrible mood. So I had decided to take the shrooms that I was saving to take with a good friend.</p><p>First of all I would like to explain how I ingested the dried fungus. I at first attempted to swallod the crushed up bit but seeing as how it would take forever unless I threw it all in my mouth I wanted a different way to do it. So being the clever person I am I took a brownie from the cupboard, cut the top off and hollowed out the bottom. Then I took the shrooms and put them in the hollowed brownie and poped it in my mouth and ate it. it was delicious.</p><p>So with the mushrooms in my stomach I decided to pass the time by talking on icq and drinking some water. Now it is at this point that I will mention that I had taken various drugs before, including acid and I had expected the shrooms to be very similar to this. So considering acid takes FOREVER to hit me I was suprised when the shrooms started to take effect in about 15 minutes. The first thing I noticed was when I looked at the glass of water I had. It was blue and half filled and the light was shining in through the window and the glass of water looked so beautiful. I still wasn't sure if this was the shrooms taking effect untill I looked at my floor and the grains in the wood started to move around and appear as the image in one of those eye magic pictures are.</p><p>So it was at this point I decided to call a friend. I asked if he wanted to go do somethign and he said he did so I waited for him to pick me up. While I was waiting I decided to explore the rest of my house since nobody else was home. And the first thing I noticed when I got up was the body load. My legs were so wobbly I thought I was gonna fall down. So I go and check out my parents room. The only thing I looked at was the floor. It was the same as mine but instead of the grains if the wood moving around the pattern in the tiles I guess you would call it rapidly changed. I didn't like this so I left. Next I went to see if my friend was there to pick me up. So I go down in the porch and he wasn't. But I noticed how beautiful the sky was. When I looked at it it made me feel so good. Then I looked at the ground. and for some reason this made me feel depressed. I spent a long time looking at the ground and the sky respectively alternating from emotions and gettin quite a kick out of it I must say.</p><p>So now I move to the living/tv room and stare out the front window at the snow. The wind had somehow created hundreds of little tiny snow dunes about a centimeter high all really close to each other creating a tiny snow desert and when I looked at this it struck me as very beautiful, a real work of art. The more I stared the more interesting it became with the light from the sun shining on it becoming brighter and brighter and turning neon coulers and such. All the while the grains of wood in the hardwood floor under me are moving around like in my room before. I was feeling great I must say.</p><p>So now is where my friend comes and I get in his car where I spent the rest of the trip untill I came down. My friend at this point does not know that I am on shrooms and talks to me normally as he would any other day when in the middle of the scentance he makes a comment... a VERY strange comment... 'I just took a shit' and then poceeded to finish the rest of his scentance. So after hearing this I think about it for a second while he is going on about something else untill I finnaly stop him from talking and I say 'man, did you just say 'I just took a shit?'' to which he replied 'yes'. So after contemplating for a second why he would say such a thing all I could do was LAUGH. And laugh I did. And laugh and laugh and laugh. I asked him why did he say such a thing. To which he replied 'I wanted to see how you would react'. Hah. He sure did see how I reacted, and then I reacted more when I thought of the phrase again immediately screaming out 'I JUST TOOK A SHIT!' and bursting into a uncontrollable fit of laughter. I really didn't understand how he could say it without laughing. So after this I had told him that I found it very amusing that the day he wanted to see my reaction I just happened to be on mushrooms.</p><p>During this whole time the way I felt was incredible. Comparable to no emotional state I've ever been in before. It was so amazing and unexpected. I had been thinking I would be feeling the same emotions acid make you feel with it's false sense of imense power but what I felt was so different. I felt so euphoric, happy, intense.</p><p>So now we go to pick up another friend as I suggested we do. At this point a very odd thing had happened. For you see, with my erratic behaviour I was forced to go into my friends house to summon him thinking i could pull it together for 30 seconds to do so I set out on this jounrey to his doorstep. Upon arrival I knock on the door. A lady answers and at that moment I forgot who I was there to get. I stand silent for many moments untill finally the words come out of my mouth. I had said the right words and are now inside the house. And while inside here it had dawned on me that I had no FUCKING clue where I was.</p><p>I looked around very confused untill a figure appeared at the bottom of the stairs. It was my other friend. We exchange a few word and I return to the car to tell my friend of the events that had taken place. He gets annoyed at me for not answering his question of if our friend was coming or not. So I answer him and all is good. Then the door opens and closes and the first words I hear are 'how are ya feelin' man?' for I was talking to this person about my shroom ingesting method earlier on icq before I had left my house.</p><p>And now after the come up the peak was about to start and I was soon to know the intensity of shrooms first hand. The intensity I was feeling was building. MY thoughts were racing and I couldn't hold it in. I HAD to talk. I tried to explain to my friends how I was feeling. But it was just too hard. The only way I could communicate this I thought was to speak my thoughts. So I did. Every thought I had I verbalized and instead of getting my point across it only annoyed my friends. This saddened me greatly for I never wanted to do this. I was merely trying to explain to them the beauty in everything I saw so that by some chance they could feel the same way I did. I wanted everyone to fell like I did.</p><p>But I could also understand how annoyed they were since I was constantly saying things such as 'I like the colour of that house... eventho it's ugly... that person is wearing a yellow jaket... OH MY GOD WHY AM I TOUGHING MY FEET'. And with that I will end the description of my trip...</p><p>So in conclusion a couple things I noticed was that the trip was mainly based on the beauty of the world and everything in it. The sky was amazing to look at, especially the sun and I now understand the whole thing about lsd users going blind staring at the sun cause I was staring directly at it untill my friend told me it wasn't healthy. But it was so amazing to look at. Also for about a half hour or so, I had no concept of time whatsoever. I knew the answer. To what I'm not sure. Right now it has seemed to be lost to me, but it consisted of something a friend had said to me a while ago.</p><p>Also this trip helped me understand this friends greatly and for this I am thankful. So the last thing I will say before I depart is that I think it was a great idea for me to trip in the terrible mood I was in. It helped me learn and it had an extremely positive outcome.</p>"
}
