{
 "title": "A Bad Experience with a Household Spice",
 "author": "Anonymous",
 "citation": "Citation:   Anonymous. \"A Bad Experience with a Household Spice: experience with Nutmeg (smoked) (ID 2133)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2133",
 "substance": "Nutmeg (smoked)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "20 hits",
   "smoked",
   "Nutmeg"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2133",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 7376",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had been reading about the hallucinogenic properties of nutmeg on the web, and decided to give it a whirl. Right off the bat i discovered that there was no way to eat the stuff, it tasted awful. So I mixed some up with water to make a paste. I stuck this mostly dry paste into my pot pipe and started to toke.\r\nIt tasted awful, burning my throat.\r\nIt lasted a long time, and would not burn very quickly. I had about 20 nasty tokes and then decided I would stop. By this time the drug in the nutmeg had started to take effect. I layed on my bed with the lights on for a while, feeling very strange. I didn't have any visual hallucinations, but sounds were intensified and distorted, and I can remember hearing things like voices that weren't really there. This caused great panic, and I remember laying on my bed sweating, scared out of my mind. Thumps came from other parts of the house. I experienced intense paranoia.\r\nI tried to turn the lights off and go to sleep, but I was too scared. I quickly turned on some happy music and tried to relax.\r\nWhen I woke up the next day, I still felt weird. I was a little bit out of it for the next four days, feeling completely awful.\r\nThe experience was a bit like acid, only i didn't feel happy at all, just bad.\r\nIn the end, it scared the shit out of me, and it stank up my pipe, and I think i'll be sticking to mushrooms from now on.\n\n\n"
}