{
 "title": "A Spiderweb of Colors",
 "author": "Chris",
 "citation": "   Chris. \"A Spiderweb of Colors: experience with 5-MeO-DiPT (ID 21346)\". Erowid.org. Feb 15, 2003. erowid.org/exp/21346",
 "substance": "5-MeO-DiPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "12.5 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 21346",
   "Male",
   " ",
   "Not Given",
   "Feb 15, 2003",
   "Views: 6624",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, Ill start off by explaining the circumstances in wich i obtained the drug.   I was over my friends house and we were all bored so we started making phone calls to find some bud.  But in the process we heard one of them say he has some pills.  Now of course i couldnt pass up an oppurtunity to try something new so i had him stop by.</p><p>When he arrived and showed me the pills they were gel-capsules filled with white powder.  I purchased 2 pills, one for me and one for a close friend of mine.  Now I was 15 at the time and I had to have an aliby for my mother so i could go and trip all night, i made one up and out we went.  We took them orally at about 6PM and we were suddenly hit with this huge wave at about 6:30.  The body high was the most intense high ive ever experienced to this day.</p><p>We went driving around (My friend and I were in the back seats) and stopped at the package store (but we didnt drink) and a bowl was being passed around, by this time it was about 7, the high was so intense my friend dropped the bowl and said'no way i cant hit that right now'  and i was feeling the same way.  But around 715 PM i started to feel sick, i had the driver pull over so i could vomit.  As i was vommiting i pulled my head up to look at the setting sun, and what i saw was amazing, a spiderweb of colors from the WHOLE color spectrum, I continued to vomit until there was nothing left to vomit, i got back into the car and proceeded to goto a park.</p><p>When we arrived i got out of the car and started to dry heave a little bit.  I told the driver of the car to go and get me some water because i thought i needed to keep hydrated.  When the driver and her friend left to get water is when i started have crazy visual halucinations.  The sky was moving extremely fast, the clouds zoomed over my head at an incredible speed and the sky was constantly changing in tints, from red, to green, to orange and so on.  I layed down on the ground and couldnt get the buzzing sound out of my head, it was loud and intense.  After getting the water i took a small walk and noticed lights were strobing, when i looked to see where they were coming from there was nothing.</p><p>Now it was about 8:45PM and my mother called on my friends cell phone, i picked up and had trouble talking with her, so i gave the phone to my other friend and she talked to my mom and i got the news that she was flipping out and i had to go home.  So I'm tripping like fucking crazy and i have to go home and deal with my parents, i didn't think it was possible but it had to be done.  I arrived at my house, told my parents I was not feeling so well and went upstairs to my room.  I was sitting on my futon with this overwhelming feeling of safeness, and the body high was still there.</p><p>At about 10:30PM my parents had gone to bed and my cat had entered my room, I hugged him and felt extremely happy to see him, as I was looking into his face his wiskers turned blood red and his face looked like a demon from hell, i shook my head but his whiskers were still changing colors, I left his side and looked out the window, they sky was still moving along with huge swirls of dark clouds.  I continued to have halucinations until i finnaly got to sleep around 3 AM.</p><p>This experience has changed my life, it is a memory i will never forget, overall I loved it except for the vommiting,  But, wow what a fucking experience.</p>"
}
