{
 "title": "Manic-Depressive",
 "author": "Morning Glory",
 "citation": "   Morning Glory. \"Manic-Depressive: experience with Morning Glory, Cannabis & Alcohol (ID 21368)\". Erowid.org. Sep 24, 2007. erowid.org/exp/21368",
 "substance": "Morning Glory, Cannabis & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Cannabis - Hash",
   "(plant material)",
   " ",
   "4 glasses",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "4.5 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21368",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 24, 2007",
   "Views: 3723",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the last few days I've been thouroughly researching Morning Glory seeds, reading every post I could.  Then, last night over a couple bowls of hashish and some nitrous hits with two of my friends, I told all about what I had learned.  We had all done mushrooms several times and enjoyed it, but none of us had ever tried MG seeds.  I was the only one who had heard of them.  So we decided to go pick up some beer and seeds.  They were $0.75 for a 1.5g bag (about 45 seeds).</p><p>We washed the seeds thouroughly in water and ate them at 5:30 pm.  I soaked mine in a shot of banana liqour for about 10 minutes.  They tasted good in small quantities.  Too many, and they tasted like dirt.  Subject 1 weighs 215 and smoked a lot of hash.  He consumed 4.5g of seeds.  Subject 2 weighs 150 and smoked about 4-5 hits of hashish.  He consumed 3.0 grams of seeds.</p><p>At 6:00 a third friend arrived and drove me to the liquor store for a last minute run.  By this time I have a pretty good buzz from the beer and I'm pretty stoned from the hash.  At 6:15, on the way home from the liquor store, I notice everything looks two-dimensional.  It's pretty cool.  Lights look kinda trippy.  Nothing great though.  Everything kinda jumped.  It was like we weren't driving smoothly, we just sort of skipped from one bock to the next.  Mostly a mild body high.  When I got home, no one else had started tripping.  I expected to feel sick, but no one did.</p><p>At about 7:30 my friends decided to leave.  They didn't think the MGs would work.  I still don't know if they fried.  At about 7:45 I started frying HARD.  The first thing I thought was OMG it's Valentine's Day and I didn't get my fiance' anything, even though we said we wouldn't buy each other stuff, we would go on a trip instead.  So I started jumping and laughing like bugs bunny (whoo-hooo whoo-hooo who-hooo) really fast and I started cleaning the house like a madman.  I thought that that would be a good gift.  As I was scrubbing dishes as fast as I could, which turned out to be really fast, I kept alternating between laughing maniacally and sobbing in about 5 second intervals.</p><p>Suddenly I got really tired and I had to crawl everywhere.  I got in the shower and turned on the water.  Although it felt fine, even slightly cold, my chest and back were burned from the hot water.  I noticed the next morning it was turn all the way to hot.  When I was in the shower I felt that 'skipping' feeling again.  I couldn't remember coming from the kitchen.  And I couldn't remember taking off my clothes.</p><p>Then I saw myself in the mirror.  I looked like trash.  I was slumped over with my head cocked to the side.  My face looked like mush and my chest looked like it was swirling or my skin was melting.  It was horrifying and I wanted it to stop.  I wasted to get away from the mirror, but I just stood there completely motionless, I don't even think I blinked, for about 20 minutes.  I thought, if this is what acid is like, I never want to try it.</p><p>I started cleaning again.  In about 15 minute intervals, I changed from being superactive (laughing/crying the whole time) and cleaning the house, to crawling around, just in circles really, and back to cleaning and laughing and crying.  This went on until about 10:15, when my fiance' came home.  I was still frying a little bit (certainly still high from the MGs).  For some reason I was paranoid to tell her I was on MGs, so I didn't.  I was able to fake sober until we went to bed.  </p><p>I was so confused about everything.  What just happened?  Is it over?  While I was high on MGs I acted mentally retarded.  And at one point (very non-PC quote ahead) I thought 'this must be how people get retarded.  I guess I'm stuck this way forever.'  Then I started babbling nonsense.  To myself nontheless.  I spoke to myself nearly the entire 3 hours I was alone, with the exception of the silence in front of the mirror.  Sex was stupid.  I performed great and she enjoyed it, but I was so confused I couldn't enjoy it myself.  I was going throught the actions like a machine.  I couldn't sleep.  I drank about a gallon and a half of water during the night.</p><p>I had a bad night last night, and a crappy day today.  I still felt wierd when I got up this morning.  Not 'good' per say, just wierd.  Like my body wouldn't cooperate.  But it's over now.  Another chemical to add to my list.  I know what it's like now, and I probably won't ever do it again.  But my only regret is that I didn't try any nitrous hits while I was frying on the MG seeds.</p>"
}
