{
 "title": "A Breakthrough into the Raging Space of History",
 "author": "Navi",
 "citation": "   Navi. \"A Breakthrough into the Raging Space of History: experience with Salvia divinorum (ID 2138)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2138",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 leaves",
   "smoked",
   "Salvia divinorum",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "1997",
   "2138",
   "Male",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "182970",
   " "
  ]
 ],
 "report": "<p>I have been growing two salvia plants for a few weeks now. [Props out to my righteous benefactor, who will remain nameless for reasons of National Security.] I could have tried some leaves before this, but I felt that I needed to 'earn' the experience by cultivating and caring for the plant myself. Last week I tried a single leaf, to introduce myself. It was just a threshold dose, but I sensed the power that lay in these leaves. This time I had 'primed the pump' with another, less exotic green ally before raising the bowl of salvia to my lips.</p><p>After the first leaf, there is a growing sense of anticipation, a feeling that something is very much about to happen. This is a deep somatic response, not merely the result of my hopes or expectations. Intrigued, I inhale most of a second leaf. Then I lie down in darkness.</p><p>Breathing in, I know I am breathing in. Breathing out, I know that I am breathing out. There is only this breath, in darkness. What else can I be said to be? What else is life on earth but a quiet and majestic rhythm beating in the vacuum? But I am breathing. Now. And something is happening...</p><p>Something is trying to be remembered. Something is unfolding itself from this moment. I sit up, concentrating. Petals of thought are spreading out around me. Half-formed words tug at my awareness, as if birds were plucking straw from my scarecrow body. I feel a Fact slowly washing through me that is basic, simple, important -- something 'my grandfathers' knew about. (This is the phrase which comes to me.) I am breathing, trying to focus on what is happening NOW. I am breathing, I am breathing, I am...</p><p>I am something unspeakably old. It is enormous, ongoing, renewed in every moment. Have I always been this nexus of perceptions, bursting back through the membrane of birth, arching across millennia to my root in the earth? I am the center and the boundary of all things. I push the trunk of my being up through the ages, unshakeable, flowers at the tip of each branch waving and winking like tiny eyes in the breeze of eons. It is me, has always _been_ me, and yet, compared to how I see myself from day to day, this is unaccountably alien.</p><p>There is a word for this, if I could only remember. I see it shifting in the periphery of my attention, slipping away like a silver minnow when I look right at it. Or, like the corner of words, incomplete of themselves, unpronounceable when joined together: it is slippery, at the tip of my tongue.</p><p>I find myself thinking of my grandfather, a man I did not know very well, but whose memory has been passed to me through my father and my grandmother. The archetypal image I have of him is of wisdom, humanity, and passionate conviction. He was a scientist, doing cancer research, and the motto of his laboratory was 'For the Dignity of Man.' Though he was not my biological ancestor, with the Leaves in me I feel that _I am the descendant of his Idea._ I am his onmoving _force_ through Nature. And by extension this is the force of a much larger, older momentum, working through this man and now through me. Suggestions of destiny, of a breakthrough into the raging space of history...</p><p>The Presence leaves me after about 20 or 30 minutes. The focus dissipates, and I am left wondering at the implications of this strange encounter. Throughout I had remained surprisingly dispassionate. There was no fear, no particular awe, though some remote part of me responded to the strangeness of the experience. It is only afterwards, patching language onto it, that I am forced to break it down and draw lines through it, losing myself in contemplation of it. You who are familiar with these things understand this: it as I have described, and yet not like that at all. We do the best we can.</p><p>New York City, July 1997</p>"
}
