{
 "title": "Money for  Nothin'",
 "author": "giga",
 "citation": "   giga. \"Money for  Nothin': experience with Adrafinil (ID 21397)\". Erowid.org. Mar 13, 2003. erowid.org/exp/21397",
 "substance": "Adrafinil",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "Adrafinil",
   "  T+ 0:59",
   "300 mg",
   "oral",
   "Adrafinil",
   " ",
   "300 mg",
   "oral",
   "Adrafinil"
  ]
 ],
 "footer": [
  [
   "2001",
   "21397",
   "Male",
   " ",
   "Not Given",
   "Mar 13, 2003",
   "15553",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As I read the following I thought, wow you should try this, seems not that neurotoxic like amphetamine.\rFrom the Smart Drugs News, Vol.3, No.8: 'Adrafinil selectively stimulates alpha-1 adrenergic receptors, increasing alertness and sensory vigilance. Unlike other stimulants, such as amphetamines, Adrafinil does not cause anxiety and agitation, nor does it induce a need for 'rebound sleep.' Many other stimulants act as re-uptake inhibitors, increasing the levels of various neurotransmitters in the synapses. Adrafinil achieves its effect by binding to norepinephrine receptors directly, a very specific mode of action which greatly reduces the amount of unwanted side-effects. Moreover, the effect of this drug appears to be localized in the CNS, not stimulating the peripheral system to a significant degree.'</p><p></p><p>Well I took 300mg, and waited about one hour. Nothing. Took another Tbl. with 300mg. Again nothing. Then I thought, well take one more, and if its still inactive resell it to someone else. So I took another 300mg.</p><p>Waited, and waited, and the only thing that happened was, I was getting extremely tired, but was unable to sleep. Very unpleasant.</p><p>So my suggestion is, for everyone who searches for something that keeps you awake, take Yohimbine-HCL instead - Not Adrafinil. This medication is in my opinion totaly useless. No idea who put this on the pharma market.</p><p>-EOF</p>"
}
