{
 "title": "Surprise, Shock, Panic, Awe",
 "author": "I aRe",
 "citation": "   I aRe. \"Surprise, Shock, Panic, Awe: experience with Salvia divinorum (extract - 6x) (ID 21400)\". Erowid.org. Aug 1, 2005. erowid.org/exp/21400",
 "substance": "Salvia divinorum (extract - 6x)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21400",
   "Male",
   " ",
   "Not Given",
   "Aug 1, 2005",
   "3261",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, I had heard a little about her before from the internet, then a friend told me a new shop in town had dried Salvia divinorum leaf for sale.</p><p>I visited the shop and purchased my 3.5 g (£8).</p><p>Later that evening, I tried a little, two small/medium inhalations, and was quite pleasantly surprised. I feltgood, with some strange (to me) effects primary in my experience. Firstly, a bubble appeared to surround my head, and it stayed while I stood. I smiled, felt the warmth of it in my face, then turned my head to the side, the smile remaining where it was, until I turned back, where I again felt its presence. After a while, the primary effects faded, and I was left feeling re-vitalised and happy, in a strange and humorous way, and in a bizarre, daft mood.</p><p>A while later, my girlfriend was coming to drive me to her house for the weekend, and I told her of my experience (I actually mountain biked the seven to eight miles there in the end). We decided to share a smoke, and although she didnt seem to notice any effect at first, she had a curious smile and look grow on her face, and soon, we were both exchanging strange witticisms and generally feeling great, stimulated mentally, physically, and creatively.</p><p>The week after, I found another shop, that had for sale a 6 x (on leaf) extraction for sale, at a better price (£10, for a similar weight), and yesterday, I took a pack home.</p><p>I was intending not to try it until my girlfriend came for me, but decided to try a little before taking a shower. I put a small amount in the pipe (small home made water pipe/bong), lit, inhaled, and held it in. Before I had a chance to exhale, I was in a state of shock, mild panic, and I immediately stood. I was suddenly fearful she would arrive to find me in this state, and rebuke me for it. I was a little dissociated, and needed to gain a grip on something familiar. I quickly grabbed a glass of red wine I had near me, and drank deeply. The familiarity of its taste and warmth helped my thoughts coalesce somewhat, and I could function a little more normally.</p><p>I found I had trouble finding things, anything I looked for, was absent. I tried to shave, and although looking directly at the can of shaving gel, it was not there. I could see it, but it wasnt there. I eventually managed anyhow, and by the time she arrived, I was fine, and happy.</p><p>I took the pack with me when I visited. Later, I filled a small bong bowl with the extract, and offered it to her first. She inhaled deeply, but coughed it all out. She passed it to me to smoke while she regained her composure. I took a big hit, and all hell started to instantly break loose! I tried to fill the bowl for her again, but couldnt manage it  things just didnt work</p><p>She had some Indian style music playing on the stereo. The tabla and sitar (esque) grooves had a circular rhythm, and I felt that time had done the same, like I was locked into a loop. I thought the music was not supposed to sound like this, like it was only a product of the trip. The whole sensation was of a hypnotic thrumming, an echoing of sense and sensation. My body had intense spinning and buzzing points all over it, like the nodes of a standing wave. I panicked a little, stood, walked around the couch, the movement helped me to hold my head together. I tried to convey my experience to her  it seemed she should know exactly what I was experiencing somehow, like it was a normal thing, a frequently experienced thing.</p><p>As I started to calm, and as my girlfriend had smoked a little more, I noticed she was having quite an experience herself. She told me that shed felt time had stopped for a while, and felt like shed folded in on herself. She just sat, smiled, and soaked it up, where Id panicked a little (at least!)  we must have been going through slightly different things (?). Afterwards, I just felt in a fun state of mind, and happy.</p><p>(I was going to submit this as above, until last night).</p><p>My most recent experience, well, here is the (edited) E-mail I sent my girlfriend this morning  I dont feel I could put it any better:</p><p>\nRight, now that Ive got my head together a bit more, Ill tell you about last night muy strangeossity indeed</p><p>After Id got home, done a few things, spoken to Paul, etc. I decided I might try a little salvia, and just chill into it. I had a small smoke of the normal strength, let it fade a bit, smoked a bit of both mixed, yup - working nicely. Let that fade a bit (trying to moderate the dose, in vain), put the radio on in the bedroom, got ready to crash (locked up, and put my keys where I wouldnt easily find them wasted, just in case), and had one last (decent amount) smoke</p><p>I breathed out, was instantly and increasingly wasted. I was being pulled, very strongly, into something, and it was worrying. The radio changed - it was loudly and clearly talking about me, sounded like overhearing a walky-talky communication between two coppers. It felt like everyone (the world) was there, up there in this other space already, and that they were waiting in anticipation for me to join them. I could feel you, and (your daughter) there. I got this extremely strong sense that I was about to actually experience reality for the first true time, and that almost everybody else was already there, and only I needed the chemical help to achieve it. (All this occurred within a minute (at most)).</p><p>Well, I sh*t myself (figuratively) - proper panicked - my whole reality had been shattered, and a new one was trying to take its place. The physical world was dissolving, becoming irrelevant - it was a sham, a facade, it no longer had purpose (made me understand why I couldnt find things that I could see in the earlier experience).</p><p>I couldnt handle it, wasnt ready for this humongous revelation (it all happened so quickly), couldnt understand why everyone else already knew what was only just trying to make itself known to me. The voices on the radio were becoming urgent, talking my thoughts and actions, my progress, out loud. I tried to switch it off, but it didnt work, they said I was trying to switch it off (I think...). I pulled the plug, and it was silenced. </p><p>I was still being pulled, material things were still becoming less and less real, I ran into the kitchen, put the light on. It didnt want to come on, because it wasnt real, but it did - I willed it to. I tried to close the door, to shut out this other world, this real world - it was too sudden, to soon to be there. The door didnt want to close, and was being pulled back away from me, with a pulsing energy, the same energy that was powering me into this other space. I closed it though, again I had to will it so, and hard, but I did, and finally, the door was closed. Id achieved another level of separation from this real reality. I was fighting now, fighting all the way, and hard, to gain some measure of control. I needed to perform a normal activity, desperately, so I switched on the kettle (getting easier to make things physical occur now), put two spoons of coffee into a cup, and it was almost done. I felt my own reality, the one Im used to, gain the upper hand, become dominant. I switched the kettle off - I didnt need coffee! </p><p>I went into my bedroom, feeling disappointment (?) - I felt Id let people down (including you - you were still there, with (your daughter), in this other place', at the edges of my perception), that theyd tried to help me to join them, and Id stalled and stifled the momentum of their (and the salvias) efforts. (Your daughter) was smiling, saying (something like - not sure now) told you! [hes?] useless - like I said, dont remember the words, just the attitude. I said (not out loud) sorry to everyone, said it took me by surprise, that I didnt mean to be such a pain, but I couldnt go there just yet - the panic, the rapidly approaching unknown, the fact that I felt strange that this was new only to me, that you were all already there, made it feel impossible not to fight it, and that I would be back, more prepared to join you all. I told you how much I loved you, the best I could.</p><p>I re-set my clock-radio (I did it wrong too - set it for the wrong half of the 24 hours  doh!), set the alarm for 7 am. (heh - got up late, it didnt go off, of course), and settled. I was asleep fairly quickly, considering, and dreamt quite a bit, but all normal stuff. I didnt feel bad, or scared when I went to sleep, in fact I dont think I felt fear at all really, just panic, and awe (?) - didnt quite know what to make of it all.</p><p>Well, Im feeling quite humble today, in many ways, but Im feeling good  Ive had to smile and giggle a bit at myself, I mean, if you were there in that space, and waiting for me, how bad could it have been to give in to it all, eh? Heheheheh!</p><p>So, thats it - strange night (well, strange few minutes - it all occurred in such a short space of time).</p><p>\nTo me, salvia seems to have a hypnotic action, quite unlike any other hallucinogen Ive tried, but I have had moments of similar experience, Im sure, I just cant remember when and where</p><p>I aRe, still cannot believe S. divinorum is legal here (England).</p>"
}
