{
 "title": "Visiting Other Dimensions",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Visiting Other Dimensions: experience with Salvia divinorum (ID 2141)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2141",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "",
   "2141",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "121155",
   " "
  ]
 ],
 "report": "<p>I've now used Salvia twice. Both times I've had a sensation of external pressure against my body, coming from a discernable direction. Both times also I've had some experience of what could be thought of as visuals, but are really much more like visually-interpreted perception in other dimensions. The second time, I had a mini-vision of rushing past several windows in a structure like a greenhouse, accompanied by a REALLY strong sense that I was near something forgotten, yet familiar, and intensely powerful. I struggled, perhaps too hard, to grasp what it was, but it has as yet eluded me.</p><p>This is the strangest of substances! I also had the terrific experience of synaestesia with music, something I've never experienced on another compound. After I smoked my first couple of bowls this last time, I closed my eyes and let the music work on me (this was some beat-oriented ambient groove by William Orbit). I was presented with gently waving bands and waves which swayed with the beat, and vegetable visions where leaves and stems appeared and built upon each other in time with the development of the music.</p><p>Grass grew from the backs of my hands, at least it felt like that. Both times I've felt the feeling-tone of my tactile sphere change from whatever normal is to something that tasted-felt sort of orange and green. I get a slight disorientation, some loss of balance and coordination, and the feeling that my body is extended into these wierd dimensions that I can *see* in my mind's eye but which are not part of our normal milieu.</p><p>That night, as I lay down to sleep, I was startled and fascinated by brilliant flashes of light and a sense of rushing, rushing behind my eyelids. It didn't keep me from sleeping, or evoke any profound dreams, but it sure was interesting. Several times there was the feeling of perceiving a sort of shimmering barrier or screen between myself and the imaginal realm that I had briefly visited, and this was hours after the actual experience.</p><p>It's most interesting with Salvia that I have fairly strong perceptual experiences that are not visual, and that do not indeed seem to relate well to ANY of my normal senses. A person who also partook with us during this last smoking said he felt that Salvia wanted him (and this is my paraphrasing) to turn from the reality-perceptual-tunnel through which he normally looked and see these OTHER things within the Salvia realm.</p>"
}
