{
 "title": "Tripping Forever in Boulder",
 "author": "Cipizi",
 "citation": "   Cipizi. \"Tripping Forever in Boulder: experience with Mushrooms - P. cubensis (ID 21414)\". Erowid.org. Sep 16, 2007. erowid.org/exp/21414",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21414",
   "Male",
   " ",
   "Not Given",
   "Sep 16, 2007",
   "3294",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a cold Friday night in Boulder, CO.  I had been wanting to try shrooms for the past 8 months, but the opportuninity had never really presented itself.  The voyage started at 7:00 PM when myself and three others each ate about half an 1/8, and my other, much more experienced friend ate a full 1/8.  The same batch of shrooms had been around campus for the past couple weeks and everyone who tried them said they were the most potent shrooms they had ever done.  For the first 20-30 minutes I was incredibly anxious, which I assumed was the reason I felt a little different.  After 45 minutes I wasn't feeling much so I took another small cap and a couple more stems.  At this point we walked to my friend N's house.  On the way I started getting these sensations where my vision would zoom in and out extremely fast, leaving me slightly disoriented, but still no major effects.  </p><p>Once at N's house, about 1:15 later, I started to really feel them kick in.  I lit an Izmir Stinger, because everyone told me smoking was the shit when tripping.  I never took a drag though, I couldn't take my eyes off the cig slowly burning down....moving slowly down the paper and the ash forming.  It was beautiful and I watched it until it was done.  At this point 3 of us wanted to walk around Boulder.  For those who don't know Boulderm it's full of fairly old, scraggly trees, situated at the base of 1000 ft tall flatirons covered in snow, and at the time it was barely snowing but otherwise crystal clear.</p><p>We made our way to a playground and I was looking at a piece of curved yellow metal with water droplets on it.  All the sudden the water droplets began to 'dance' almost at my will.  They would rearrange themselves and flow uphill and I was absolutely intrigued.  After a while we figured we should move on since we all looked like we escaped from the mental ward, just staring at inanimate objects for over 15 minutes.  I discovered on the way back to N's that I didn't much care for walking, but more that I prefered standing and looking at objects.</p><p>We made our way back to my house and had my friend J got his guitar and a candle.  He is a very outgoing person, so he asked if any of us minded if he just talked for a while.  None of us cared so he began telling us about himself growing up and just playing some chords, which sounded very, very good.  It was very calming to have him talking and playing.  I could go off into my own world to think and play with objects while still having that in the background.  By far the best part of the trip was the candle.  After it had been burning for about an hour (seemed like 5 hours) the wax began to soften up.  I started staring into the candle and playing with the wax, molding it and reshaping it.  It was beyond words to describe the beauty I saw in the candle, the way the flame danced around and reflected off the inside of the candle.  </p><p>Eventually we decided to change the mood once again and go walk around once more.  When the lights were turned on it was almost an insant mood lift.  We all got huge smiles on our faces and got a rush of energy.  This time when we walked around I couldn't ignore the trees.  Most of the trees are 40-50 feet tall, dead for the winter, and are very chaotic in the way the branches come off the trunk and main limbs.  They almost seemed to speak to me.  For the first time in my life I saw true beauty in trees, which we all take for granted every day.  I realized how much a tree has seen in its life, and how many changes have happened while the tree remains the same.  And the snow, my God the snow.  Watching the snow fall in front of a street lamp put the largest smile on my face ever.  I could have watched it for hours.  </p><p>Finally we all decided we were coming down to some degree, and that we should head inside.  At this point it was about 7 hours after he ingested, and we talked for a while about our different experiences and what we all thought about during the trip.  Looking back I realize I greatly underestimated this drug.  I'm fairly experienced with weed and a plethora of pharmaceuticals, and before I tripped I had an idea of what I thought it would be like.  I couldn't have been more wrong.</p><p>I remember 2 different points when I began thinking about a past girlfriend and if I hadn't asked my good friends to change the subject to give me something to think about, I think I could have had a horrible trip.  Days after the trip I still notice things in my everyday life that I saw for the first time when I tripped.  For me, this first trip was really having my eyes opened further than I thought they could be, and the beauty of nature and life poured in for what seemed like 3 days.  Next time going to try a full 1/8 and go up to the flatirons or mountains during the day.</p>"
}
