{
 "title": "Use a Sitter!",
 "author": "Andy Weisner",
 "citation": " Andy Weisner. \"Use a Sitter!: experience with Salvia divinorum (ID 2142)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2142",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "",
   "2142",
   "Male",
   "",
   "Not Given",
   "Jun 26, 2000",
   "113499",
   " "
  ]
 ],
 "report": "<p>Yesterday the mighty Salvia crossed my ways the first time and I have to reckon that this was one of the weirdest experiences in my life.  I....well I do not remember what happened the first few seconds. I found myself in the same room but it was quite weird. There was some kind of force field not unlike gravitation pulling me strongly in a certain direction. I felt like this field was forcing me to go to its source which was not inside the room but outside. This forcing felt quite unconfortable, and I felt kind of possesed by something. This sensation was so strong physically and mentally that by this time I actually forgot that it was caused by smoking the salvia, I actually forgot why I was there. The room was in the second floor of the house and I was lucky I did not take the direct way outside-out the window but went the stairs down. On the way down I noticed that the environment looked a bit trippy but not distorted,(like the coming down of a low dose shrooms, acid or 2CB) and I remembered that I smoked the salvia. But the forcefield was still pulling strong and I got a bit desperate. I went into the room in the first floor where my girlfriend was sleeping and tried to wake her up to help me but was not very successful. </p><p>At this time I saw the force field like some sort of sparkling psychic plasma which covered me and starting crawling and covering everything I touched. The look of the transparent plasma I saw is very hard to describe. It made me and everything I touched a bit sparkling and different and at one time it seemed like another reality trying to slide over the usual reality. I was a bit afraid to get my girlfriend also trapped in this field and so I left the room and closed the door and followed the force and went down the second staircase. At this point I felt quite sober and clear mentally but the force field was still there pulling on me but now I tried to oppose it with my will and this sort of worked but was very difficult. At this point another friend who lived there just came in and looking at me he asked if I was felling well. I said 'Yes. . but I don't wanna follow this. . (force)' and than I realized that he was not feeling it and I was the only one. I felt embarassed as a experienced psychonaut to be in a situation like this but I was happy not to be alone. I now had the sensation that the forcefield is getting weaker and it was easier to control it. I told him that I have smoked a new plant and that it is unlike anything I had before and very strong but I could handle it. </p><p>After a while the sensation slowly dissapeared completly and I felt only the familiar MJ buzz. The whole experience lasted not more that 3-5 minutes and I was very happy to be down again but quite shaken. I promised to treat Salvia next time with more respect. This experience was very different from any trip before, I had never had similar sensations before, not even from heroic harmala+shroom or K+2cb+Acid trips. The feeling of being manipulated against my will was especially scary and had never happened before, and there no Ego dissolution like usually with strong trips, I was quite lucid. The only analogy I found for the gravity like force field sensation is a strong underwater current when swimming or ,blame it on my love of Science Fiction, the tractor rays which aliens use to abduct people in UFOs. I would recommend to use Salvia with great respect and only in safe environments. While I feel that with most other entheogens I personally don't really need a sitter I would recommend it with Salvia. I'm a person who has a strong will and still lost control for a while, and from what I read this sort of experience is not unncommon with Salvia. </p>"
}
