{
 "title": "Vomited Repeatedly",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Vomited Repeatedly: experience with Heroin (ID 21434)\". Erowid.org. Feb 19, 2003. erowid.org/exp/21434",
 "substance": "Heroin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "0.03 g",
   "IV",
   "Heroin",
   "(liquid)",
   " ",
   "25 mg",
   "IV",
   "Cocaine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21434",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 19, 2003",
   "Views: 41652",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having obtained .25g of tar heroin for the first time, I decided to try a small dose intravenously to experience the nature of the effects. Being comfortable with intravenous drug use (having used cocaine before using this administration route), I sat back in my typical comfortable using environment and prepared the shot.</p><p>Not having a scale accurate enough to measure doses, I eyeballed approximately 1/8th of the quarter gram, and added a minute amount of coke (about 25mg of high purity powder).</p><p>The shot was prepared using sterilized equipment, sterile water, and a compact cotton filter, also sterile. After administration, only positive effects were noticed for the first 15 minutes, with the exception of slight worry at the intensity of the effects.</p><p>After this period, I became increasingly nauseous and eventually vomited repeatedly over a period of four hours. Pupils were small, profuse sweating, inability to focus eyes, and extreme difficulty in maintaining consciousness were experienced. Heart rate slowed to 50bpm but never below this point.</p><p>To attempt to prevent a fatal overdose, I sipped water to stay hydrated and walked around to keep heartrate within safe range. Without opiate blocking drugs for help, ODs are relatively helpless unless they seek professional medical attention.</p><p>This experience scared me out of trying opiates ever again, and others should learn from my scary experience by being extremely careful in dosing new substances, relying only on personal trials instead of the advice of others to determine what amount they are comfortable experiencing. To make it painfully clear, I ALMOST DIED MY FIRST TIME. Be careful and responsible, please.</p>"
}
