{
 "title": "Awful Side Effects",
 "author": "Vlad",
 "citation": "Citation:   Vlad. \"Awful Side Effects: experience with Ecstasy (ID 21457)\". Erowid.org. Mar 7, 2003. erowid.org/exp/21457",
 "substance": "Ecstasy",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21457",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 7, 2003",
   "Views: 19408",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter taking E twice a week for about a month I have finally reached the point where I will never take it again. On a cold snowy nite I took 3 hits of green mercedes ecstacy. Everything was fine for about 3-4 hours until I started 2 feel out of place, so I went to the bathroom and started throwing up water for about 20 mins. \r\nAfter it calmed down I decided I need 2 go home so I asked for a ride. On the way home, my heart went into huge pain and I had a hard time breathing and I couldnt pick up my head. I was rushed home quickly by my friend, I got home and quickly woke up my parents because I needed help, I felt like I was gonna die. My heart and chest was in pain and so was my stomach, I couldnt feel my legs or hands and they were very cold, I was very dizzy and couldnt speak and had a hard time breathing. Me and parents didnt know what was goin on so they rushed me to the emergency room, in the emergency room they injected 2 drugs into me, one that clears my blood of the E and then a relaxing drug that will make me 2 sleep easily. They injected it and told my parents 2 take me home so I can sleep it off, so they did. \r\nI wake up the next day feeling better and then in 20 mins the heart pain hits and I feel just the same as I was when I was rushed to the hospital. My parents decided to take me to our family doctor, I get there and they take a couple of tests, I think 1 of them was an EKG test for my heart and everything came back fine. So in the end the doctor told me I'm suffering from Panic Attacks and referred me to a psychiatrist. My appointment is comin up in a few days, I still feel heart pains but not as bad as before. I havent ate since I took the ecstacy, not only am I having panic attacks im also havin strong anxiety attacks and depression, im having mood swings where at 1 point I feel like killing someone and then another I feel like cryin. I have a hardtime concentrating and speaking and cant fall asleep unless someone watches me because im worried of dying, I also have muscle cramps thru out the day and feel very drowsy. This has been goin on for 5 days already, I feel a little better day by day and everyday im hoping it goes away.\n\n\n"
}