{
 "title": "Poppy Seed Disaster",
 "author": "John Gibson",
 "citation": "   John Gibson. \"Poppy Seed Disaster: experience with Poppy Seeds & Urine Tests (ID 2147)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2147",
 "substance": "Poppy Seeds & Urine Tests",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "1993",
   "ID: 2147",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 111612",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nDate: Sep 1993</p><p>From: 'John J. Gibson'</p><p>To: Multiple recipients of list SCODAE </p><p>Subject: Poppy Seed Info Needed....</p><p>Hello Everyone,</p><p>I'm new to this LISTSERV, but I have an extremely urgent request that perhaps only YOU in the Internet community can help with now....</p><p>My wife recently moved to Arizona to start her 'Dream Job' (offered in July) and was given the standard pre-employment physical at a local hospital.  She was given no warnings of what NOT to eat, and I believe was not even asked what she had recently eaten.  She ate two poppy seed muffins that morning and registered a positive morphine level on their drug test that afternoon.  She was fired because she was a 'drug abuser'.</p><p>There are a few other circumstances that seem to have complicated this situation.  We've found out that the NIDA suggested limit is 300; she scored about 1,000 and we are trying to figure out 'why'.  The nurse said she was extremely dehydrated (after working in 100-degree temperatures) and that her keytones (?) were high (she had eaten very little the last few days).  She is also vegetarian.  We've heard that these other factors may have been the reason for her score, but we have no solid medical research to back this up....</p><p>Does anyone out there know of any research or other cases that can help us prove the truth?  Is there another LISTSERV with someone who could provide this information?  Are there any experts out there we could talk to?  Any suggestions you have would be appreciated!</p><p>We are trying to get the actual lab results (and will ask for a re-test of</p><p>the same samples), but the hospital has been very slow in giving us a</p><p>copy.  She also had a surprise test which proved clear, but they discounted</p><p>these results because a 'drug-abuser would have expected a second test'.</p><p>We are now trying to prove the truth so my wife can keep her Nursing</p><p>license and her livelihood.  Previous to this test, we thought these drug</p><p>tests were a good idea; as you can imagine, this experience has shaken that</p><p>belief somewhat.  In fact, it has almost devastated our lives.  Not only</p><p>did we move all our belongings there (at our own expense), established a</p><p>residence, etc., but the hospital reported her to the State Nursing Board</p><p>and nobody will hire her now that she has this 'record'.  After 20 years of</p><p>experience and higher education (with absolutely NO drug abuse), she gets</p><p>this for eating two supermarket muffins for breakfast.  The scary thig is</p><p>that this could happen to anyone....</p><p>Thanks VERY MUCH in advance for all your help!</p><p>****************************************</p><p>John J. Gibson</p><p>Director of Computing</p><p>Dean's Office</p><p>College of Business Administration</p><p>University of Northern Colorado</p><p>Greeley, CO 80639</p><p>Internet: jgibson@asu.edu</p><p>****************************************</p><p>=========================================================================</p><p>Date: Sep 1993</p><p>From: 'John J. Gibson' </p><p>Subject: Poppy Seed Update #1</p><p>Sender: Drug Abuse Education Information and Research </p><p>Hello Everyone,</p><p>I'm the source of last week's poppy seed disaster story - and I'm</p><p>finally back for the long haul.  Being somewhat concerned that our</p><p>situation might be viewed as cluttering up your LISTSERV discussions, I was</p><p>happily surprised to see your many wonderful responses from the last week</p><p>or so.  Thank you very much for all your help and the offers of continuing</p><p>interest and support.  As a number of you have said, this situation is an</p><p>education for all of us - and an opportunity to somehow prevent others from</p><p>encountering a similar fate.  I can assure you that we are committed to</p><p>seeing this thing through, not only to clear Laurie's name, but to change</p><p>the laws or at least to educate everyone as best we can.  This is my first</p><p>update of what we've found out so far, in case it can be helpful to anyone</p><p>else.  If this isn't appropriate for the whole LIST, please let me know and</p><p>I will mail these updates only to those who express an interest....</p><p>First, my apologies for the delay at getting back to all of you, but</p><p>Laurie's sister got married this past weekend and we were back East to</p><p>attend the wedding, make plans, etc.  She is holding up pretty well, but</p><p>you can tell she still feels quite devastated by the entire unbelievable</p><p>situation.  Laurie wanted me to thank you and she is following up on</p><p>much of the information and suggestions that you've sent me so far.  She</p><p>doesn't have an Internet connection, but we are working on getting her one</p><p>so she can listen in and reply to you directly.  The latest situation is</p><p>this, as best as we can understand it:</p><p>The hospital that 'fired' her because of this one test result is a private</p><p>business; the lawyers tell us that there is not much we can do through the</p><p>courts because, as a private concern, the hospital can do what they want as</p><p>long as they don't discriminate on the basis of sex, race, religion, etc.</p><p>If it was a public institution, she would have different rights.  That's</p><p>lesson number one for anyone looking for employment or anyone in Congress</p><p>who really wants to make a difference.  As an aside, we were pretty</p><p>discouraged at first because almost every major law firm in the city seemed</p><p>to be on retainer for this place; they quickly stated a 'conflict of</p><p>interest' to our inquiries and nervously hung up.  It made us feel pretty</p><p>small and helpless....</p><p>The State Nursing Board is public, and so far they have returned some phone</p><p>calls, but have not given us much information about how long it will take</p><p>for them to give Laurie a chance to state her case (and the TRUTH).  So the</p><p>lawyer has dispatched a letter to hasten this process, since nobody will</p><p>hire her while she is being 'investigated'.  Meanwhile, we are hoping that</p><p>the hospital will give us the full lab test results, since they may help</p><p>show the truth; the hospital only reported the morphine levels to the</p><p>Nursing Board, not the other data needed to put them in perspective.  We</p><p>would like to get Laurie's specimens sent to a lab whose analysis</p><p>carries some weight, if we can just get them to talk to us (its now been</p><p>almost three weeks).  DOES ANYONE OUT THERE KNOW OF A LAB WHICH HAS AN</p><p>UNDISPUTED REPUTATION IN DRUG TESTING ANALYSIS AND ALSO HAS AN EXPERTISE IN</p><p>DIFFERENTIATING POPPY SEEDS FROM REAL MORPHINE ABUSE???  That would be a</p><p>perfect solution to this mess, if such a thing exists....</p><p>A number of you have suggested the ACLU, the press, etc.  We are developing</p><p>a letter to the ACLU (they must be overwhelmed since we always get the</p><p>answering machine and they haven't return our calls).  Whatever happens</p><p>with the legal system, we may eventually talk to anyone in the press</p><p>who will listen; people have to be educated about the dangers of drug</p><p>testing, especially if the government is unwilling to help protect innocent</p><p>people.  We are gathering suggestions here, but we are not going to push it</p><p>until we've done our best to gather the facts and the support of any</p><p>experts who will help out.</p><p>One Nursing Association has asked Laurie for her suggestions of what the</p><p>proper drug testing procedure should be.  Its a start; any professional</p><p>organization willing to listen (and perhaps eventually lend their support)</p><p>is very welcome indeed!  ANY SUGGESTIONS OUT THERE ON PROPER PROCEDURES?</p><p>Laurie has confirmed that the hospital did NOT warn her of the foods not to</p><p>take (in advance of the test) and they did NOT even ask her what foods she</p><p>had taken the past 48 hours (when she took the test).  Many organizations</p><p>seem to do this as standard procedure.  A number of doctors have said the</p><p>recommended procedure on a positive morphine reading is to confirm the</p><p>findings only after a positive check for needle marks, eye color, etc.; the</p><p>hospital didn't do that either.  What can one person do when an</p><p>organization uses these drug tests as THE ONLY proof, and doesn't follow</p><p>all the other recommended procedures?  I guess you take your lumps like</p><p>Laurie and so many others have.  (Lesson numer two for those seeking</p><p>employment).</p><p>A number of you have also asked if they did a GC/MS test once the EMIT gave</p><p>a positive reading, and you've asked what procedures were used.  We have no</p><p>idea since nobody's talking at the hospital; we can't even find out which</p><p>labs did the testing.  Its tough to prove the truth when the data is</p><p>unavailable....  (Lesson number three for anyone who has the power to</p><p>change the current status-quo).</p><p>Yes, the DOD did raise their morphine limit to 4000 from the suggested NIDA</p><p>levels because of their research on poppy seeds (that was published).</p><p>Laurie just talked to them and they've brought it down to 300 again</p><p>(we don't know exactly why; they may think they are missing some legitimate</p><p>drug abusers).  Someone at the DOT said that they don't even ask questions</p><p>until you hit 2,000 (has this changed?).  They said something like 'we</p><p>don't want to catch bagel-eaters; we want to catch drug abusers'.  If this</p><p>is true, it appears we may have working pilots with readings near 2,000</p><p>while other people have lost their jobs over limits far below that level.</p><p>This is NOT a complaint, just an observation.  But if this is true, the DOT</p><p>should be commended for a much more intelligent approach to drug testing</p><p>than other offices in the same federal government.  CAN ANYONE DIRECT ME TO</p><p>INFORMATION ON JUST HOW NIDA ARRIVED AT ITS LEVEL OF 300 AS A LEGITIMATE</p><p>INDICATOR OF MORPHINE DRUG ABUSE???  We've also learned that American poppy</p><p>seeds are much LESS potent that pacific-variety poppy seeds.  You</p><p>guessed it - the stores have confirmed that Laurie's muffins had poppy</p><p>seeds from Australia.  Did these contain much higher levels of opiates than</p><p>the variety that NIDA used to arrive at their levels?  We don't know.  CAN</p><p>ANYONE AT NIDA HELP US OUT ON THIS?</p><p>We've learned that several legislators may be pursuing a solution to these</p><p>problems.  Dingle from Michigan has done something, but his office doesn't</p><p>return Laurie's phone calls.  We've just found out that Hatch from Utah and</p><p>Boren from Oklahoma are working on something, but we don't know exactly</p><p>what.  A state legislator from Arizona actually personally called Laurie</p><p>and wanted all the facts we could give them.  We were really impressed by</p><p>that.  It is another reason why we are honestly trying to pursue the REAL</p><p>truth and find all the facts we can BEFORE we go public.  We are not</p><p>interested in being trouble-makers; we just want all people to be treated</p><p>fairly.  So we'll take any suggestions, off-the-record, from anyone who</p><p>feels in any kind of danger helping us out.</p><p>Finally, we don't really know yet, because we lack so many 'facts', WHAT or</p><p>WHO is responsible for Laurie's misfortune.  It could be the Feds, the</p><p>State of Arizona, the Board of Nursing, the hospital, their insurance</p><p>company, their employee health doctor, the Director of Nursing, the human</p><p>resources department, all of them, and/or all of us.  Its interesting</p><p>that the doctor refused to acknowledge that poppy seeds could have ANY</p><p>effect until Laurie gave him some articles.  But that 300 is an absolute to</p><p>him; that's as much as he will consider, no matter what.  His mind is like</p><p>a brick wall.  The Director of Nursing has recently been devastated by a</p><p>close friend and associate whose life suffered greatly because of her</p><p>hidden drug abuse; in the Director's eyes, that 300 is also quite</p><p>absolute - Laurie may always be guilty no matter what we finally prove to</p><p>be true (God himself would have trouble convincing her).</p><p>You would also think a nurse would know about the foods which give positive</p><p>drug readings, and I was very surprised Laurie did NOT know.  We've since</p><p>found (unofficially, by an informal poll) that MOST nurses don't know.</p><p>Laurie specializes in critical care, and has seen her share of overdoses,</p><p>but never one from poppy seeds.  And I would wager that is true for an even</p><p>greater percent of the general population.  We do watch some news and read</p><p>the paper, but we can't remember ever coming across a similar story.</p><p>Neither one of us has ever taken a drug test in our lives and never gave</p><p>this one a second thought because we've been 'good'.  Now we feel like the</p><p>innocent people who are given these tests are like cattle being led to</p><p>slaughter - without intelligent laws, reasonable guidelines, or some type</p><p>of education, improper (or misinterpreted) procedures have the potential of</p><p>ruining lives everywhere.  But you folks already know that; I've learned</p><p>from your email that you've been at this awhile.  I hope that one or two</p><p>items from this looonnggg note might be helpful to someone and/or the whole</p><p>field of study.  I promise a much shorter note next time....</p><p>Best wishes,</p><p>John</p><p>****************************************</p><p>John J. Gibson</p><p>Director of Computing</p><p>Dean's Office</p><p>College of Business Administration</p><p>University of Northern Colorado</p><p>Greeley, CO 80639</p><p>Internet: jgibson@asu.edu</p><p>****************************************</p><p>=========================================================================</p><p>Date: Dec 1993</p><p>From: 'John J. Gibson' </p><p>Subject: Poppy Seed Update #2</p><p>Sender: Drug Abuse Education Information and Research </p><p>Hello Everyone,</p><p>Many of you asked us to keep you informed after the 'poppy seed</p><p>disaster story' several months ago; its time for the next</p><p>installment, and we have finally have some good news to report.  In</p><p>a nutshell, an incredible series of events has culminated in the</p><p>State Nursing Board COMPLETELY dismissing the charges on Laura's</p><p>record.  They have acknowledged that there was absolutely no proof</p><p>that she was a morphine abuser and that the test readings were</p><p>indeed possibly due to those poppy seed muffins bought at the local</p><p>supermarket....</p><p>We would like to thank all of you again for the many leads,</p><p>articles, referrals, suggestions, good wishes, opinions, etc.  The</p><p>Internet community came through, and your feedback helped more than</p><p>you can know.  Laura now has a huge stack of research and other</p><p>information which most definitely helped to speed her case, and may</p><p>someday help to advance appropriate legislation, educate the</p><p>public, and/or save someone else in a similar career-threatening</p><p>situation.</p><p>In case any of you run across a similar situation again, Laura's</p><p>experiences may prove helpful (and from what we've heard, she might</p><p>be one of the lucky ones).  In the end, it was an interview with a</p><p>psychiatrist that eventually helped to break the case; as you will</p><p>see, it was necessary for Laura to carefully check several of these</p><p>doctors - a good one was not so easily found.  The Board had told</p><p>Laura that it would be 6 to 8 months before they would get to her</p><p>case, due to the massive backlog of other cases.  They also</p><p>mentioned that they could require a 'psychological assessment' when</p><p>they finally considered her story.  However, after hearing this</p><p>story over the phone, a doctor at the recommended hospital insisted</p><p>on enrolling Laura in a $4,500 program (three days long) and made</p><p>a number of disturbing statements like 'you'd better not lie or I</p><p>will have to punish you.'  Thinking that this might be the only</p><p>type of recourse to get her license back, Laura was devastated by</p><p>the conversation; she was obviously already being considered by the</p><p>medical community as 'guilty until proven innocent.'  A neighbor</p><p>suggested that she call other psychiatrists, and she eventually</p><p>scheduled an interview and random drug testing with one whom (she</p><p>later found out) just happened to have a good reputation with the</p><p>Board.  She really knew very little about this psychiatrist (there</p><p>were no referrals); but he recognized the truth and called the</p><p>Board after the initial session.  The Board immediately made</p><p>Laura's case a high priority and an investigator met her two days</p><p>later; Laura's stack of research and contacts was by that time</p><p>complete enough to help establish her innocence, and the rest is</p><p>history....</p><p>There are many other interesting side-stories to this case.  For</p><p>example, the Board had also called a toxicologist whom they</p><p>frequently used on such cases, and he just happened to have</p><p>attended a meeting where a number of these toxicologists</p><p>experimented on themselves by eating poppy seed bagels; most of the</p><p>group then tested over the 2,000 level for morphine (remember that</p><p>Laura's reported level was 1,017).  Also, after much prodding, the</p><p>hospital finally gave Laura the results of the EMIT (which shows</p><p>only an approximate positive/negative reading).  They said they had</p><p>to order the GC/MS report from the lab again because they 'only had</p><p>a phone report.'  After much more prodding, we finally got a copy</p><p>of this report in mid-November; it turns out that the 1017 level</p><p>reported to State Boards was not accurate, since this second report</p><p>was over 1,400.  We still wonder if this second test was really</p><p>done in August or if it was really completed more recently to</p><p>satisfy our requests.  In the final analysis, however, this didn't</p><p>matter.  Experts all over the country confirmed that levels over</p><p>1,000 could come from poppy seeds alone, especially Australian and</p><p>several other varieties (it is interesting to note here that the</p><p>supermarket acknowledged these particular poppy seeds came from</p><p>Australia; we've also learned that these potent seeds may have</p><p>originally been genetically bred for morphine production).  The</p><p>hospital also refuses to give us the history of handling, and they</p><p>had not recorded any of the data taken on Laura's level of</p><p>dehydration at the time of the test.</p><p>Next, as far as we can tell, the hospital's Occupational Health</p><p>doctor (whose analysis everyone respected) did not follow official</p><p>federal government guidelines when considering the test data.  In</p><p>fact, the AMA, ASAM, and AAMRO all recommend following these</p><p>guidelines, but private organizations are NOT required to do so.</p><p>This doctor did not try to find out if Laura's 1,000+ level was</p><p>possible from poppy seeds; the 300 level used by the EMIT was all</p><p>that mattered to him - IT was the final word.  Official guidelines</p><p>say that the initial test results should be recognized as just one</p><p>indicator in many, that one must consider the whole picture: a</p><p>physical, second lab tests, and other clinical signs of abuse</p><p>should also be used in the analysis.  We're not even sure if this</p><p>doctor had the education to know what guidelines exist to make</p><p>'accurate' judgements.  We just know that his abrupt judgement in</p><p>this case caused the loss of a job and almost destroyed an entire</p><p>career.  And we are told that private institutions, such as this</p><p>hospital, can continue to do these tests in whatever manner they</p><p>please; there are no laws to protect the innocent in drug testing.</p><p>More on guidelines: The Reagan Administration first required that</p><p>federal agencies establish drug detection programs - and that they</p><p>follow federal guidelines on the analysis of the results.  The</p><p>administration also suggested that private organizations establish</p><p>similar programs because of potential losses due to drug abuse.</p><p>Unfortunately, for some reason, these private organizations were</p><p>NOT required to also follow the accompanying guidelines.  We've</p><p>received a broad range of opinions on the pros and cons of drug</p><p>testing itself.  Whatever you believe, it seems obvious to us that</p><p>if drug testing is going to be with us for a while, EVERY</p><p>organization should be REQUIRED to follow some type of intelligent</p><p>set of guidelines or regulations if they use drug testing</p><p>procedures.  In fact, urinalysis might better be utilized as</p><p>confirmation of a positive reading in 'impairment testing,' since</p><p>urine drug tests do not necessarily reveal the level of a person's</p><p>impairment on the job, etc.  You may be interested in a recent</p><p>'Viewpoint' guest editorial on impairment testing published in the</p><p>New York Times, Sunday, November 28, section F-11.  As an aside,</p><p>we've heard that many of the same organizations who have stiff drug</p><p>testing programs do not test for perhaps the largest abuse problem</p><p>of all - alcohol; is this true?</p><p>Now that Laura has her Nursing License back, a few of you are bound</p><p>to ask 'what happened with the hospital?'  We called the hospital</p><p>shortly after the Nursing Board's decision and found that the Board</p><p>had already informed them that Laura's record was cleared of all</p><p>charges.  When asked what they thought about this, the hospital</p><p>replied 'this just proves that the system works.'  Amazing.  There</p><p>doesn't seem to be any recognition of what this event has done to</p><p>our lives and that it could easily have been prevented (one way the</p><p>system SHOULD work).  In fact, the hospital also mentioned that</p><p>they feel they did most everything right.  Their view now is that</p><p>poppy seeds may have indeed been the cause of Laura's positive test</p><p>results, but that nothing can really prove that morphine wasn't the</p><p>true cause.  Laura will always be 'guilty until proven innocent' at</p><p>this hospital.  And what about her job?  Since early September,</p><p>they have advertised that position in the newspapers - and even on</p><p>the Internet.  However, it has recently been canceled as a cost-</p><p>saving measure.  After all the hospital's time and expense of</p><p>nationally recruiting for this position over the past year, we</p><p>can't help but wonder if there is another story we don't yet know</p><p>about....</p><p>There is another side to this situation, and in all fairness to the</p><p>hospital, they may be correct about inconclusive lab testing in</p><p>poppy seed cases.  Unlike food combinations that cause positive</p><p>results on the EMIT (which can later be proven false by the GC/MS),</p><p>there is much disagreement about the ability of any test to show</p><p>the difference between eating poppy seeds and using morphine.  The</p><p>BEST policy may be to just WARN people, well in advance, to steer</p><p>clear of poppy seeds before drug testing.  We've heard that WalMart</p><p>gives their people a list of substances to avoid before such drug</p><p>tests are taken.  If only the hospital had done that too!  And as</p><p>far as we can tell, none of the other hospitals in the area do this</p><p>either.  The hospital says a committee is now studying changing</p><p>their policy to warn people about poppy seeds before testing.  They</p><p>also say they may require testing to be done before a job offer is</p><p>extended and families move their entire household to town (as in</p><p>our case).  Great idea, folks!  Its interesting to note that the</p><p>hospital said it can't understand why this same misfortune happens</p><p>to such a high percentage of out-of-state nurses.  Perhaps they are</p><p>finally seeing the light.  We wonder, however, if they really care</p><p>enough to follow through with their plans - to do so would</p><p>certainly be a step in the right direction.</p><p>Many people have encouraged us to initiate lawsuits against the</p><p>doctor, the hospital, the state, etc.  The logic goes something</p><p>like 'not only could a lawsuit reimburse you for damages, but it</p><p>could initiate changes in the law to protect others from the same</p><p>fate.'  This sounds great to us and we would love to proceed.  It</p><p>is easy to see the doctor/hospital rationale; the reason for suing</p><p>the state would be to encourage an early initial hearing (e.g. a</p><p>few days) for those who are forced to put their livelihoods 'on</p><p>hold' while the Nursing Board sifts through 6 to 8 months of other</p><p>cases (in Colorado, for example, you have that right if your</p><p>driver's license is suspended and you have to wait a long time</p><p>before your case goes to court).  Unfortunately, we've discovered</p><p>a number of problems in proceeding with a lawsuit.  Laura has</p><p>talked to dozens of lawyers; most refuse to touch the case and the</p><p>few others recommend against it.  Many of the major law firms are</p><p>already on retainer for the hospital; that's conflict of interest.</p><p>The other firms say that it will be a long, slow, expensive,</p><p>painful, and eventually fruitless process.  Since drug-testing</p><p>sentiment is running high in Arizona (so close to the border),</p><p>almost any jury would agree with the view that 'the chance of</p><p>losing a few innocent people is much better for the public good</p><p>than the risk of hiring a drug abuser into the hospital</p><p>environment.'  In the end, we would damage the cause and help prove</p><p>the hospital acted in the correct manner.  Again, 'this just proves</p><p>that the system works.'</p><p>We've also been told that its too risky a case for lawyers with</p><p>political ambitions because it makes them extremely nervous to</p><p>handle a cause so contrary to public opinion.  This might also</p><p>explain why the drug testing bills before Congress (which would</p><p>correct some of the loopholes) haven't been passed.  Furthermore,</p><p>most of the real damage can't be measured.  And the legal folks say</p><p>that Laura did too good a job of mitigating our damages for the</p><p>things that CAN be measured.  Since our financial losses will</p><p>probably 'only' be $15,000 or so, no competent lawyer would look at</p><p>this volatile case for such a 'small sum of money' (we couldn't</p><p>afford to pay them anyway - that was all our savings and the down</p><p>payment for a house).  Its been suggested that we find someone on</p><p>the national scene who is outraged by this situation, who has the</p><p>financial resources to proceed, and who does not have political</p><p>ambitions.  As of yet, we have not found anyone like this with the</p><p>appropriate expertise.  We've also tried a number of 'cause-based'</p><p>organizations with no success; however, they do wish us luck.  The</p><p>state ACLU has not returned our calls (and is rumored to be almost</p><p>bankrupt); the national ACLU told us to talk to the state.  So we</p><p>will probably send the state ACLU a report through the mail before</p><p>we finally give up on them.  IF YOU HAVE ANY IDEAS - OR NAMES -</p><p>THAT COULD HELP HERE, PLEASE LET US KNOW.  We still hope that</p><p>justice will somehow be served - for everyone's sake.</p><p>So what's next, you say?  Laura is now writing a number of articles</p><p>for submission to journals in the hope that she can educate</p><p>professionals that her situation IS indeed possible.  Once this</p><p>research is completed, we may also try popular media like NPR, 60</p><p>minutes, the Wall Street Journal, etc. hoping to educate the</p><p>working public that this could also happen to them.  Since private</p><p>organizations aren't required to protect people from these types of</p><p>errors, people will probably have to look out for themselves.  If</p><p>we do take this approach, a lawyer friend has warned us to 'report</p><p>only the facts, not your opinions' and to use a quality program so</p><p>we don't get sued over the report.  Its a frustrating situation; we</p><p>don't have much left.  But our friend has also made another</p><p>observation - we were really lucky when you think about it.</p><p>Somehow we were fortunate to connect with the right advice, sources</p><p>of information, expertise, etc., and Laura was skilled (from her</p><p>recent Master's program) in doing the needed research.  We also had</p><p>a supportive network of friends whose spirit helped us to continue.</p><p>And we are now somewhat free to seek a new dream.  Others may not</p><p>be so fortunate in a similar situation.  So the challenge remains</p><p>to somehow correct the system....</p><p>And that's about it for now.  We promised last time not to make</p><p>this next update too long, but we've done it again.  We hope it</p><p>will be valuable to someone out there.  Until the next update, we</p><p>will be trying to put our lives back together again - Laura is</p><p>still in Arizona but is looking nationwide for a job, John</p><p>(fortunately) is still making a living in Colorado, and we will</p><p>have to see where we end up.  As promised, we aren't done yet; we</p><p>will share our story with almost anyone who will listen.  You'll</p><p>hear from us again, if you would like to.  As always, if you have</p><p>any other ideas or thoughts, please let us know; we would love to</p><p>hear from you.  And thanks VERY MUCH again for everything!</p><p>Best Wishes,</p><p>John & Laura</p><p>****************************************</p><p>John J. Gibson</p><p>Director of Computing</p><p>Dean's Office</p><p>College of Business Administration</p><p>University of Northern Colorado</p><p>Greeley, CO 80639</p><p>Internet: jgibson@asu.edu</p><p>****************************************</p>"
}
