{
 "title": "Hours of Convulsions",
 "author": "Egor",
 "citation": "   Egor. \"Hours of Convulsions: experience with Amphetamine (Adderall), MDMA & Albuterol (ID 21489)\". Erowid.org. Feb 21, 2003. erowid.org/exp/21489",
 "substance": "Amphetamine (Adderall), MDMA & Albuterol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 10:00",
   "1 tablet",
   "oral",
   "MDMA",
   " ",
   "  T+ 0:00",
   "  repeated",
   "inhaled",
   "Pharms - Albuterol",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "21489",
   "Male",
   " ",
   "Not Given",
   "Feb 21, 2003",
   "31697",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At the time of this experiance I had fallen in love with with the amphetamine family and experimented with several, and this was my only problem</p><p>The day started with me procuring 100 mg aderall under the name A-D; or 'after death'. Me and my guy M took 100mg each at around 11am and spent most of the day contemplating life, religin, and reality. At about about 4pm, M had to go run some erands and I sat at home until about 7pm listening to music and contemplating the experiance and the mind opening quality of the drug. </p><p>Around 7, my close friend I called me ans said 'hey, we got some pills and we were going to party tonight.' I drank some gatorade, ate a little rice to pad me stomach and was on my way. We (my close group of friends: I,A,S, and B sat around shooting the shit and just catching up until around 9pm when we decided to dose. I was mostly down from the aderall when I dosed, so I did not expect any problems; though I did not know of the combo.</p><p>Within 30 min I began to odd physical 'peaks', similar to cns surges, but with more of an electrical shock feel to them. The peaks started mostly in my legs, but quickly spread up my body while also increasing in intensity. After about an hour of the increasing surges, I began to lose control of them and my limbs began to shake and shudder. S and I decided I should drink some water and lay down. The peaks began to transform into full blown physical seizures, but at the time I remained conscious and talking.</p><p>As the night went on, my seizures with concurrent peaks became more and more intense; and I became less coherent, though never fully losing consciousness. The only thing keeping my in this world was the constant words of love and encouragement from my crew. At around 5am I began to regain control of my body, and there was an intense air of love and relief in the room. I did not totally stop getting the peaks until almost 10am.</p><p>The only thing that got me through the night was the support of an experianced crew who knew how to handle this type of situation; and I am sure that they are the only reason that I survived the night, and I am thankful to have been in their company that night. I looked on several sites and did not see any other reports of this type with this combination of chemicals. I felt I should warn others other of this danger.</p><p>As an after thought, I realized I was using an albuteral inhaler to help deal with shortness of breath at regular intervals of three to four puffs about every two hours throughout the night.</p><p>happy tripping, be safe!</p>"
}
