{
 "title": "Yoga and Speaking in Tongues",
 "author": "JUJU",
 "citation": "Citation:   JUJU. \"Yoga and Speaking in Tongues: experience with DMT (ID 21482)\". Erowid.org. Feb 20, 2003. erowid.org/exp/21482",
 "substance": "DMT",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 21482",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 20, 2003",
   "Views: 16562",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHaving taken DMT over 50 times during a 2 year period I found my self making very bizzare physical movements with my arms which resemble complex yoga positions, they are very specific and generaly  represent exact spaces of concsiousness ie colour and geometry of hallucinations. They are completly involuntary as if I am possesed by a totaly seperate entity, whether they stem from inherent knowledge, DNA or a collective subconcsious I dont know but they seem very familiar as if I am returning home.\r\nMore recently strange sounds and vocalisatons have been literaly gushing from my mouth, again they are totaly involuntary but represent a distinct language based on colour and form, for example I can radicaly change the overall colour scheme just by uttering one of these alien words yet I still have no idea what they mean. The only reference I have is what Terrance Mackenna terms as a glossolalia especially after hearing his accounts it seems the language is identical, by the way I had these experiences before I read any of his accounts. I would be very interested to hear of any one elses experiences on this particular aspect of the DMT state.\r\nOne last thing is that after many many trips I decided with great difficulty to look very closely at just one of the shapes which make up the general mosaic of the hallucinatary space and discovered\r\nthe image which closely resembles the Kali yantra an ancient Indian\r\nTantric motif was actualy a very high pitched sound rather than an image. Which leads me to believe that the DMT space is based on a molecular harmonic of soundwaves rather than being interperated in a visual format. As with all entheogenic experiences this is totaly subjective,so if any one can shed some light or has had similar experiences stroke delusions I would be extremely keen to enter into further dialogues.\n\n\n"
}