{
 "title": "Holy Guacamole",
 "author": "We've got chips",
 "citation": "   We've got chips. \"Holy Guacamole: experience with Salvia divinorum (ID 21500)\". Erowid.org. Jan 29, 2007. erowid.org/exp/21500",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21500",
   "Not Specified",
   " ",
   "Not Given",
   "Jan 29, 2007",
   "2840",
   " "
  ]
 ],
 "report": "<p>I ordered some mimosa hostilis from a web site and the dude who runs the site sent along a quarter ounce of salvia divinorum. I arrived home from work to a box in my mailbox with these two substances in it, opened the box, and immediately got excited.  I couldn't wait, and opened the bag of Salvia right away.</p><p>Before I continue, I would like to say that psychedelics have been a major influence, and part of of my life for about 5 years now, and I have tried just about everything I care to (except DMT, real LSD, pure MDMA), and love smoking weed.  I consider myself very experienced with psychoactive substances, and hence saw no need to get a sitter.  Luckily I didn't know until about 10 minutes ago, how to smoke this shit properly.</p><p>I tried it two times, the first time, I took about half a leaf and loaded it into my bong, and smoked the shit out of it.  I smoked it improperly, just lighting it, and letting it smolder.  As I exhaled, I felt myself begin to sweat in the underarms as well as the hands and feet.  I immediately felt hotter, and felt I should try out another hit.  I packed an even smaller dose this time, and smoked it too, and even before I exhaled - zang!  I felt like I had instantly become completely baked on acid.</p><p>As I held my breath, I guess my lips were in an odd position, and as I exhaled, I could still feel them in this position.  I took my sweater off, and felt waves of craziness/heat/something flow through me, and it basically felt as though this intoxicating flow began in my lungs and continued to spread outwardly from there.  I was sitting on my couch, and laid back to look at my ceiling, and the only thing I have ever seen which comes close to this is taking shrooms and acid all at once.  The stuco changed into patterns which looked like vines, and from the intertwining of these vines, came a feminine form, and I was jibbering and jabbering at this form in a crazy languange.</p><p>The duration of all this was about 2 minutes.  I continued looking at this womanly figure, and everything began to calm down.  I sat up, and came back to reality just as quick as I left it.  I do not believe this was a breakthrough dose, but holy shit that stuff comes at you like a raging bull. </p><p>After a few hours, I decided to try some more with very similar effects... the bosy felt like I was just waking from a black out, but was an extended feeling, with the same open eye visuals I saw the first time. </p><p>This stuff is extremely powerful, I would estimate I smoked no more than a fifth of a gram, and I was thrown around by it.  I haven't attempted any further doses, mainly due to the fact that the person I would like to do a large dose with, has been unavailable, and it seems to me that a large dose while unsupervised could lead to injury.  I now know how to smoke this shit properly, and cannot imagine what a significant dose would do.  I am definitely going to do more of this and will write a report when the experiment is complete.</p>"
}
