{
 "title": "First Trip to the Forest of Dreams",
 "author": "Krishna Erasmus",
 "citation": "   Krishna Erasmus. \"First Trip to the Forest of Dreams: experience with 2C-I & Poppies (ID 21527)\". Erowid.org. Feb 22, 2003. erowid.org/exp/21527",
 "substance": "2C-I & Poppies",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-I",
   "(capsule)",
   "  T+ 1:07",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   "(dried)",
   "  T+ 1:35",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   "(dried)",
   "  T+ 6:07",
   "5.0 g",
   "oral",
   "Poppies - Opium",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21527",
   "Male",
   " ",
   "Not Given",
   "Feb 22, 2003",
   "Views: 32955",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>2C-I was the first psychedelic that I have ever taken.  For a first time with psychedelics, it was very nice.  The trip was very controllable, giving me a lot of confidence to explore how far I could go on this substance.  I would highly recommend it for a first time trip.</p><p>4:30 PM - 20MG capsule taken</p><p>5:20 PM - Slight body buzz, this could be placebo.  Perma-grin is in place.</p><p>5:37 PM - I'm beginning to feel pressure around my temples.  I go outside to smoke a cigarette in an attempt to alleviate the pressure.  After two drags, I look at a citrus tree and suddenly am overwhelmed by how green it is.  I stomp out the cigarette and run inside giggling and when asked what was funny, I say, 'The tree was really really GREEN!'</p><p>5:54 PM - I'm watching TV when suddenly the clock slides up two inches in the corner of my vision.  I start to giggle and realize I need to use the restroom.  In the bathroom everything starts to breathe and move around.</p><p>6:05 PM - I discover the true use of psychedelic posters.  After staring at them I go outside for another cigarette.  The clouds are amazing.  Swirling and shifting.  Wow.</p><p>6:52 PM - I decide to go inside because the gnats are coming out.  Unfortunately, the clouds entrance me again and I get to watch the stars come out.  A truly amazing experience.</p><p>7:17 PM - My friend T takes 20 mg of 2C-I and goes off for a walk.  Body buzz is very good.  I'm beginning to discover anchors in reality.  Namely TV.  Just hearing it brings me back down to earth.  I got hungry and ate an apple.</p><p>8:42 PM - Time has slowed.  Me and M, T's boyfriend, went looking for T.  She trips really badly sometimes so we were worried.  We eventually got into Matt's car and drove around looking for her.  At some point, I finally let go of reality and begin to invent a story as to why we're looking for T.  I come up that she's lost in a Forest of Dreams and that Matt, being a veteran, could navigate this forest in his car.  I was lost, so I was just helping to look for T.</p><p>All the while, I realize this is fiction and that it isn't reality, but I don't care what is real anymore.  This sort of dual thinking becomes the focus of my analytical attention for some time.</p><p>Anyway, now the visuals aren't as pronounced, but are still there.  It's more a feeling.  A feeling of being beyond normal reality.  Of knowing both what is, what isn't, and what will.  Like being able to pick the most probable branch on a fractal of time.</p><p>Anyway, the searching took only 1 1/2 hours, but felt much longer.  The world surrounding me has become a plethora of dreams and thoughts, all sitting beneath my normal spectrum of sense.  I opened up to M about random stuff.  Mostly about a girl I fell in love with back in the day and then she died.  Kinda cool, though.</p><p>I wondered what tomorrow's retrospect would bring to this entire trip.  I seemed to be able to switch between social trip, solitary trip, and think 500 miles per hour and 500 fathoms deep modes.  I sense that I could bring reality back in, but I don't want to.  I just wanted to surrender to the trip.  I had had my fun from playing in this world, I wanted to let it use me and teach me.</p><p>10:37 PM - Slight headache.  Breathing visuals if I concentrated.  Consumed 5g dried opium powder orally.  I seem to be stuck in a way.  Like my mind is behind my body, while before it was the reverse.  This is probably me just having trouble coming down off my first trip.  Adjusting to transitioning back from a sort of hyper-reality to normal reality.</p><p>11:07 PM - Opium kicking in.  Nice mellow and slow.  I feel like both mind and body are back in synch.  I feel restful and meditative.  Headache gone.</p><p>2:01 am - Sleep finally calling me.  A actually feel completely normal.  Like I'm naturally tired, not post-high tired.</p><p>10:30 am - Woke up feeling refreshed and very very good.  My mood seems slightly elevated, but there is no crash, no body hangover, and no mental depression.  Very nice.</p><p>Overall, the trip was very nice.  I seemed to prefer outside to inside.  To quote my great wit whilst tripping:</p><p>'I can see why hippies love nature so much when tripping.  It's like, nature provides all the natural things you can naturally make all trippy.  It's like...ALL NATURAL!'</p>"
}
