{
 "title": "An Educated Impulse",
 "author": "Navi",
 "citation": "   Navi. \"An Educated Impulse: experience with Salvia divinorum (ID 2152)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2152",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "1998",
   "ID: 2152",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 11183",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For months I had been hoping for another salvia dream, so tantalizing and inconclusive were the few I'd had already. At last it happened, when the gremlins that control my dreaming were in a particularly mischievous mood.\rAn Eductated Impulse</p><p>In my dream I had just acquired a new 'party bowl', recommended to me specifically for use with the salvia. The leaf was old. 5 months, Burning Man old. I knew as soon as I got the bowl that I would use it that night. Had to make sure it worked, didn't I? But this decision wasn't entirely impulsive. I'd been craving a session with the numinous for some time, mustering up my courage against a fear which had grown stale with waiting. It was the right time.\r'POOF You're Dead'</p><p>The bowl filled, I collected myself. Water pipe, with ice -- check. Lighter -- check. Glass of water -- check. Writing utensil and paper -- check. Pillow -- I was set. The lights were out except for one small lamp nearby, because this lesson is learned in darkness. I caught the stream of my breathing and, praying for grace, ignited the leaf. Three large tokes in rapid succession finished the bowl, and by the second one I could already feel the effects coming on. It was a deep tingling closing in around me, coming down from my head and in from my limbs.</p><p>I barely managed to switch off the light before I collapsed. It wasn't so much a loss of muscular control as a full-on somatic commandment: 'Lie down, NOW.' It was similar to that critical point in the onset of a mushroom trip, when sitting becomes too much and you retire to a more comfortable position, that of a corpse. Only this happened much faster.</p><p>It occurred to me that anyone watching would have seen me basically slump over, staring into space. Had I been poisoned? Well, YES, in a sense, very much so. Intentionally so. I knew that I was physically safe enough; I'd heard no reports of salvia toxicity, at least with raw leaf. I also knew there were no guarantees in this business... But these fears were fleeting. They gave way to a greater depth.</p><p>This is the death plant, I realized. (One of them, at least.) I felt I understood a bit what it meant to die, to have one's conciousness secede from its union with the body, leaving certain familiar elements of understanding behind. And yet, there was consciousness. Some part of me knew that it had to get back, that there were friends and family who loved me, who would be tragically disappointed were they to lose me this way. Was it the Ego, telling stories of this boy it remembered, building him back out of memories and nothing? Or were the effects of the drug simply fading?\rBeelzebub</p><p>Gradually, I began to recover. It was an upwards process, halting, like I was surfacing in thrusts from beneath an avalanche of green snow. Soon I was able to sit up and write a bit, but another wave hit me and I lay down, this time with headphones on, to drown out noises from the street. No music, though.</p><p>Again in darkness, eyes closed. It was me who lay there now, not some pseudo-cadaver as before. But the presence of the herb was still with me. On previous encounters with it, I have experienced a phenomenon wherein the ambient sounds condensed into a single insectoid buzzing language. This now began to happen, only it built in intensity until it exceeded any previous experience.</p><p>A complex, multiharmonic hum, quite possibly related to the sound of cars outside and the refrigerator across the room from where I lay. I knew better than to try and identify the source, though. Let it come as it will. And so it continued to build, speaking to me in some higher-dimensional tongue which I could not yet understand. Aloof, deliberate, like a bored god reading me my rights. As it rose in pitch and intensity, the sound began to resonate throughout my entire body, most strongly in my spine. It felt as if great energy was flowing through me, as if my whole nervous system had been electrified. I was not twitching, or convlusing -- I was buzzing. It felt pretty good! (The image reprinted by the McKennas, of the bee-headed mushroom shaman, flashed briefly in my mind.)</p><p>The buzzing lasted for quite awhile, perhaps 5 minutes, and faded slowly. Nothing like the brief visionary spasms of kundalini action I've noticed with cannabis. This was no trick of perspective. Even after I sat up and felt mostly 'down', I was suffused with a pleasant low-level tingling. Other than a little social displacement, interacting with others online, I felt fine.\rSmoke and Mirrors</p><p>Looking back on this dream, I should say that it didn't feel entirely healthy. This had to do with the method of ingestion. Smoking the leaves had several disadvantages, most notably the discomfort caused by inhaling hot smoke. The use of a water pipe did not eliminate this. As with most smoke experiences, such discomfort can color the trip, and may have contributed to my immediate sense of having been poisoned.</p><p>The effects of smoked salvia leaf do not last long. This is good for those who may not be ready to deal with issues of mortality. But it seems to be a virtue of the plant itself, this audience with death, and the short recovery allows no time to struggle or make peace with it. You can just grit your teeth and bear it, as I did, and pop back out none the wiser. So it seems a longer session, chewed leaf or mouthwash, might be preferable.</p><p>Finally, perhaps most importantly: the need to take in much smoke quickly was disconcerting. It felt juvenile. I felt like a school kid huffing solvents. This is a ceremonial plant, and the desperation of the smoke path seemed inappropriate and quite possibly disrespectful to its subtle nature. I may try it again, but I will also explore other options.</p>"
}
