{
 "title": "Almost Nothing to Report",
 "author": "Shake",
 "citation": "   Shake. \"Almost Nothing to Report: experience with Amanitas - A. muscaria (ID 21531)\". Erowid.org. Nov 12, 2003. erowid.org/exp/21531",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Amanitas - A. muscaria"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21531",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 12, 2003",
   "Views: 16000",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was tired when first testing this substance - bear this in mind.  Following research from what I could find on the Internet I ordered 10g of South African 'Grade B' Amanita Muscaria from a UK Internet based supplier.  <br>I decided to start with 3.5g prepared to the tea recipe found hereabouts.  The tea was easy to drink and I got on with something whilst I waited for the affects.  I did not feel nausea and there was no trip as such though I did feel quite relaxed.  I was disinclined to thinking, simply experiencing.  One noticeable sensory effect was that my experience of hearing became enhanced in the boundary between the sound stimulus and my experience of the sound seemed non-existent.  It was a very subtle effect.  I went to my bed some four hours later feeling cuddly and slept really quite well and uneventfully and woke up fairly refreshed.<br>I decided to take the rest of the pack, around 5g or so, this evening.  I'd soaked the mushrooms in brandy and then blended them with a milk shake then drank the lot down.  Some two and a half hours later I really have nothing to report.<br>Assuming that the mushrooms I have taken are indeed as described on the packet I should confirm that they are indeed not fatally poisonous.  Any effects are as subtle as to be hard to assert.  I may try some of the 'grade A' samples that exist out there.  I'd always start with a very small portion to be safe.\n\n\n"
}
