{
 "title": "Bordering on the Brink of Pure Beauty",
 "author": "David",
 "citation": "Citation:   David. \"Bordering on the Brink of Pure Beauty: experience with AMT, Cannabis & Nitrous Oxide (ID 21555)\". Erowid.org. Jan 25, 2008. erowid.org/exp/21555",
 "substance": "AMT, Cannabis & Nitrous Oxide",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "35 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   "  T+ 0:00",
   "1 repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 3:00",
   "1 repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 3:30",
   "1 repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21555",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2008",
   "Views: 4028",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAt 4pm, my closest friend and I went to a local head shop, to pick up 3 boxes of Nitrous Oxide, and glow sticks, to accompany the evening. Arriving at my friends house at 5pm, we each measured out our 35 mg doses(6 all together), and parachuted each dose, as well as hitting on a few cans of nitrous. \r\nWalking outside(+30), we began to notice the positive energy creating itself. As darkness began to set in, the rain outside formed exceedingly fast moving clouds, which gave the appearance of visuals. Positivity seemed to reign supreme over everyone in the house, and I believe that the positivity is which kept all 6 of us so closely knit over the course of the insanity which was to ensue.\r\nAfter 2 or 3 hours of dosing, the full effects had seem to come on, which involved a very very sane mental reaction, but with a very empathetic feeling of inner wisdom amongst each of us. As time went on, a few people arrived, who began to smoke bowls and joints, and blunts of all sorts of pot. All of us involved joined in, and the high attained from the pot seemed to be a completely seperate entity from the AMT, almost seperating themselves very distinctly. The high on the AMT was very clear headed, whereas the pot kind of added this feeling of dreaminess to it all. \r\nAfter that was finished(+3:30) we decided to go back into the house, dim all of the lights, and pull out the drums, and other instruments. The best description of the night from this point out was utter beauty. I myself was on guitar and piano, switching back and forth, using an extremely insane amount of pedals, making just very very distant sounds. Matched with 3 people on assorted hand drums and bongo's, the music from this point out took the night over. Never in my life have I heard anything that sounded like what we made, and for everyone there, it was just a tight bonding experience, we could stop playing our instrument for a minute, take a hit of nitrous, close your eyes, and let the patterns create themselves in your head. All of this chaos ended at about 4am, with some people who were not playing, just drawing what they were hearing.\r\nOverall, I didn't see an exceedingly large amount of visuals, closed eyed or open eyed. The pot made the AMT experience much better in my opinion, and honestly, this was one of the best experiences I've had in my life.\n\n\n"
}