{
 "title": "Beginner's Notes",
 "author": "Sync",
 "citation": "   Sync. \"Beginner's Notes: experience with Salvia divinorum (10x extract) (ID 2156)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2156",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 2156",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "Views: 7628",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first thing that stands out about Salvia is how powerful a trip this plant can produce and how short acting it is. An experienced psychonaut described the experience as 300 micrograms of LSD, some good grass, then a big hit of nitrous oxide at the peak. Having only done Salvia a dozen or so times thus far the initial feelings and concerns about it's effects are still fresh in my mind and may be of some help to those thinking about experimenting with it. There's a lot of information on the web about Salvia, read it. Then read a bunch of the trip reports to get an idea of what your in for. Here's my two cents worth:</p><p>I read several accounts of people smoking straight Salvia leaves with no effect, and it was suggested that people's tolerance varies. Other advice included use a water pipe because the smoke can be quite harsh, making it difficult to get a good inhalation, and use one of those blue flame lighter. This vaporizes the active ingredient more efficiently. I followed this advice, and decided to order a 5X concentration of Salvia leaves to cut down on the volume of smoke. This worked well in the water pipe, but did not work in a small conventional pipe, nor in a tobacco pipe. I found not reaching the breakthrough dosage physically unpleasant, and suspect this is why many people try Salvia and give up. I wanted to dispense with the size and mess of the water pipe in favor of a small conventional one, so I ordered some 10X concentrate leaves. These work in a small pipe every time, one draw, two at the most, and the smoke is quite palatable. I believe my typical experience requires less than a tenth of a gram of 10X, and lasts almost exactly five min. All experiments were done alone in a quiet dark place.</p><p>Having tried many legal herbal highs I expected another disappointing BFD experience. Turns out the experience was, and is, a very big deal, far more powerful than most illegal substances. It is in fact so powerful I believe those who report this is not a recreational drug at all, rather something to be given the respect of a spiritual tool to be used for shamanic traveling. Anyway, the first time I sat in a comfortable chair with my feet up, in a position I would not fall down in if I passed out. Turns out the advice on the web not to have lit candles to knock over and a safe place to drop your lit pipe is well worth heeding. After exhaling the second draw I felt a slight effect, but figured nothing much was happening. A few seconds later the Salvia Twist began. It was like smooth a rocket assisted takeoff into a twisting psychedelic spiral. There was the sensation of a heavy electric pinch that grows out of, then replaced all sensations from the body, a very pleasurable sensation than in effect obliterated all conscious connection to the body and left me floating in a visual collage of color and sensation for about three min. The most interesting feature of this was I retained full consciousness of who I was and could think quite clearly during the experience. In this hyperspace of the mind I saw no entities, felt no presences as others have reported (darn!). About three min. into the experience some sensation of my body began to return, and it became clear that the visuals and sensations were tied to, or distortions of bodily sensations in way unique to Salvia. The shift back to normal consciousness took about two min., with a period of about fifteen min. of feeling slightly anxious. There were no other after effects.</p><p>All subsequent experiences have been just about the same in most respects. It has been reported, and has been my experience so far, that Salvia can tend to produce dark experiences, especially if the user is not used to it's effects enough to relax and enjoy the ride. This is one reason it is treated with such respect. On a subsequent experience in disembodied Salvia space I believed that I had stopped breathing and worried that if I didn't get back to my body soon I could suffer brain damage. This was of coarse not the case. I believe that because the effect of Salvia is to mask off physical feedback from the body, one can just become unaware of normal sensations like breathing and having a heartbeat while still being fully mentally alert. Looked for, breathing and heartbeat seem to be absent, so the experiencer thinks Houston we have a problem!, when there is none. </p><p>During a later experience I had the sensation of being almost completely cut off from the body, of receiving enough of a neurological signal to know there was a connection out there, but be completely unaware of the outside world. This was like doing a spacewalk in psychedelic hyperspace connected by a slim tether to the ship. I had the distinct and unpleasant feeling that I had crossed over the line between life and death, and was defiantly on the wrong side. Again this concern was based on having no feedback from the body, and not enough experience with Salvia to have faith there was actually no serious problem. After a few more sessions of 10X I learned to relax and enjoy the experience. Each time I am amazed at the intensity of the experience.</p><p>Salvia has definite pros and cons in my opinion, here's a few:\r</p><p>PRO: It's legal. Never underestimate the power of not worrying about being busted! </p><p>CON: It's said to be safe because it's been used by natives for thousands of years. That's what they said about tobacco too. </p><p>PRO: Short acting effect, for those of us with a life who can't spend eight to ten hours spaced out. </p><p>CON: Short acting effect, for those of us who would like to spend eight to ten hours spacing out. </p><p>PRO: Very powerful psychedelic experience. </p><p>CON: May be too powerful for inexperienced travelers. As with any drug, your taking your physical and mental health in your own hands. Any instability may be made worse by such use. </p><p>CON: At worthwhile dosages it will completely physically incapacitate you for up to five min. If your not careful you could wake up with your wallet missing or get burned from a dropped pipe.</p>\n"
}
