{
 "title": "Shangri La: Reaching Enlightenment with ICP",
 "author": "Burny Regs",
 "citation": "   Burny Regs. \"Shangri La: Reaching Enlightenment with ICP: experience with Mushrooms (ID 21576)\". Erowid.org. Apr 2, 2007. erowid.org/exp/21576",
 "substance": "Mushrooms",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "21576",
   "Female",
   " ",
   "Not Given",
   "Apr 2, 2007",
   "4073",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had tried mushrooms once before when I was 16, buying them from a guy I knew from school. The effects were light and gave slight eye-play, but mostly just euphoria. Having exsperienced many diffrent types of drugs in my past (from huffing gas to exotic opium to crappy bags of weed secretly laced with crack, dust, exc.) but non phycodelic (besides the angeldust that I did not know was there), I found I really liked mushrooms and would like to try them again, but didn't for a while.</p><p>By the time I was 18, which I am now, I found myself growing mushrooms off of rice cakes in an aquarium. The set up is cheap but maitnence is half the work. Me and my boyfriend (we'll call him Guido) learned the techniques off the internet and after researching spores, I decided on a particular strain from a patricular company (I'm not sure if I can list either of thier names so I'm not going to) and began to grow. </p><p>Soon we had a handful of potent little mushies with unopen viels (this means the underside gills are not exsposed, increasing the potency) dried to perfection. </p><p>Now this is the part of the story where I might loose a few of you. Guido has, as long as I've known him, which is a long ass time, been a Juggalo. A Juggalo is a fan of the band the Insane Clown Posse. I was not a Juggalo. While the world only knows the ICP for thier clown paint, violent music content and cursing, there is a whole side to it that the world just doesn't see. </p><p>Behind the music, there is a story. A long story. To sum it up, ICP preaches that when you die, your soul will arrive at a carnival. The Dark Carnival. This Carnival wil judge your soul. If you were a good person, you will go to Shangri La, aka Heaven, but, if you were a bad person (usually depicted in thier songs as a bigot or an asshole), you get sent to Hell's Pit. This story has been told through 6 CDs, the 6 faces of this Dark Carnival, the Jokers Cards. It has taken ten years for the last of these CDs to come out. The last being 'The Wraith: Shangri La', and even though I was not a Juggalo, I was constantly surround by ICP because of my boyfriend, so I too was awaiting the release of this final CD. And finally, it came.</p><p>ICP had told the Juggalo world before hand that if you did not like this CD, you should stop liking ICP all together and move on. This CD was that important, if you could imagine such a thing. </p><p>Before we turned it on to listen to it for the first time, me and Guido ate our mushrooms, about 3 grams each, and chewed them well. His little brother (we'll call him Joe, and he too was a Juggalo) came along to our house to listen to the CD as well for the first time, and watch us eat mushrooms. Joe has never done drugs besides smoking weed and because of his immature additude, we prefure this. And he thought watching us be on these things would educate him.</p><p>The CD starts and the whole thing is wonderful. Beautiful music and the shrooms havn't even kicked in yet. I could feel the uprising. Frightening. I curled up in the corner of the couch in our apartment. The only light on was a red light in a lamp near the stero, which was blasting full force. Me and Guido sat uncomfortablly on the couch while his brother sat motionless in a chair watching the stero. Slowly I started to feel... diffrent than his brother. Like me and him were in two seprate worlds. His world was very cold and gray, while mine seemed to be where all the music and light was. My BF sensed this world parallel too and whenever we tried to talk to Joe he'd get very frustrated that we couldn't comprehend what he was saying and would hand us an object (like a can or box) and say 'go play with this'. Of course we did not want to touch anything at all, touch was to uncomftable as was looking at Joe. Everytime I looked at Joe he would shrink very small and I would grow very tall, so I tried not to look at him at all. This was only the begining. </p><p>The last song on the CD finally came on. Its the one song these last ten years of music have been leading up too. 'What ICP is REALLY all about', because, up to this piont, not even the Juggalos knew really. ICP may not look like it, but they have a plan. </p><p>The last song. It starts off with them just talking, saying that this isn't a joke and its time to push away the bullshit. Then they drop the bomb, and the bomb is this. ICP isn't about hate at all. ICP is about GOD, and they hope that GOD finds US. </p><p>We all instantly wigged out. Joe is outraged because he thinks his favorite 'wicked' band has gone Christian rock, but me and Guido are crying. We are crying because it was the most beautiful and nicest thing ICP could have ever said to us. I would have cried without the drugs, but it was now at that moment the mushrooms kicked in fully. </p><p>I started to see the beautiful music glowing out of the stero, colors of light streaming in and out of eachother like a lazer show, warm tears streaming down my face. Angels singing to me from the stero, like it had a direct antennia to heaven. I look over at Joe. His world is still cold and gray as he sits there going 'I don't get it!!'. We decided it was time to walk Joe home. </p><p>Joe lives down the road and its not a far walk. I could not remeber this walk, only dropping Joe off at his house and saying goodnight. It was around 10pm now and fog was growing over everything. As we left Joe, windchimes danced in the background and for a couple of moments I feared we had somehow come to be in London and would never get home. I followed Guido down the other road, a main road leading to the beach and our house. He did not say anything and walked a little in front of me. I felt like I was floating down the road and talked nonstop to my silent compainion, completly ignoring the threat of passing cars, although they rarly came by.    </p><p>I wanted him to talk but liked hearing the sound of my own vioce to much to stop, I talked nonstop about what had just happened on that CD. So many questions. They hope God finds us?</p><p>I finally got Guido to talk. He looks back at me and I relize hes been so silent because hes been crying. We start talking quielty about life and how we live it and if there is a God at all. Instead of walking right to get home, we walk left to go down to the beach. I find walking on the dirt on the side of the pavement is more enjoyable than the pavement itself, and Guido agrees too. And as we walk in the dirt in an unusually warm Novemeber night, we agree that the world is made of fools living off foolish things like money. Slowly, we mangaed to decontruct society and relize its all a sham. By the time we make it to the beach, we can either go left were all the houses are, or to the right where no one goes. We go right, and find heaven. </p><p>We walked right onto heaven. A lonely beach in the middle of the universe with an endless ocean that touches the moon. Lookng up at the sky, it seemed within arms reach as it glowed with a purple haze and constolations and gas clouds apeared along with the shooting stars. Everything was perfect.</p><p>Guido held me for a long time, we were convinced this was our planet and we had named it Shangri La. That we had reached enlightenment and this is what enlightenment was like. We were the only man and woman on this planet. I do not think we kissed alot, but we held eachother, for hours on the beach. Standing in the same spot, head to head.</p><p>I did not like closing my eyes, the closed eyed visuals were enough to distract me from the task at hand, my new planet. </p><p>We did ever little exsploring on our planet, for it was small and we knew everything in the whole world. We were enlightened. We walked away from our planet soon without fear or regreat and walked back to the house and cried some more. </p><p>We watched the movie 'Brazil' (an old old favorite of mine) and 'Akira' and talked and cried and talked as the shrooms wore off. We did not sleep till morning, but when we awoke, I we had been reborn. I was reborn as a Juggalo. Guido was reborn as a better person and a better boyfriend.</p><p>The trip whiped away all depression about life (i had been suffering from deperession for years) and gave it a certain newness to it I can not exsplian in words. As if the world had only just begun and I had only just begun to exsplore it. Guido became the sweetest person he could become, and still is.  </p><p>We re-named this strain of mushroom 'Shangri La', the sacred mushroom.</p>"
}
