{
 "title": "Terminating Antipsychotic Experience",
 "author": "Byrnn 0ut",
 "citation": "   Byrnn 0ut. \"Terminating Antipsychotic Experience: experience with Morning Glory (ID 21594)\". Erowid.org. Nov 6, 2007. erowid.org/exp/21594",
 "substance": "Morning Glory",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "10.5 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21594",
   "Male",
   " ",
   "Not Given",
   "Nov 6, 2007",
   "Views: 6660",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a minor. A daily cannabis smoker. But let us go back further than that. Back to elementary school. All my life people have attempted to control my emotions, which were very easily let out. I was something of a class clown, always having fun, never really caring, but always getting by. In seventh grade some asshole psychologist decided to put me on Risperdol. This is where the real problem started. I slowly began to lose my ability to express emotion. This is where I decided I must get off of this immediately.</p><p>Of course, nobody told me this was an antipsychotic and that immediately discontinuing use can lead to serious problems. It was only a matter of time before I reached the full status of monotone passive-aggressive asshole. In 8th grade I was switched to Seroquel, which I still refused to take. I began to get into drugs, got caught, and was sent to a placement in the Mormon pit of Utah, where if I wanted to get home, had to take my Seroquel. My mind continued to spiral into an antipsychotic haze, I lost all ability to express my emotion and became so introverted that I could not truly become close to anyone. I left, discontinued my Seroquel use, and went deeper into the world of cannabis and other drugs (not that theres anything wrong with that ;-)).</p><p>Something was terribly wrong with me. I wasnt always like this. Then one day I walked to the nearest store and bought Morning Glory seeds. It was almost as though fate did it. I walked at least a mile without thought and ate 10.5 grams on the way back. I was in no way prepared for what would happen to me.</p><p>Once I got home I noticed something was different. It went as most first trips go so there is no need to go into detail, except for the fact that it changed my life. I am no longer a monotone. I can easily express emotion and am back to the way I was before those evil substances. It is truly great. And it was all overnight. I found a permanent state of happiness and security in 10.5 grams. Since then, I have tripped two more times and always enjoyed it. I truly love myself now.</p><p>Please, I truly think that a published report of this accord would truly help somebody going through the same problems I went through. Nobody should have to suffer through these medications. Ever. Period. I have finally become someone I can truly love.</p>"
}
