{
 "title": "Plant / Human Interaction",
 "author": "Jack Straw",
 "citation": "   Jack Straw. \"Plant / Human Interaction: experience with Salvia divinorum (ID 2161)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2161",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "",
   "2161",
   "Male",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "5268",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Definitely my most intense psychoactive experience ever (ok, i've never had DMT). Did this yesterday at a friend's place in Berkeley, California area. Came over totally sober, intending to try something i've 'never had before', but he and his friend got me to try salvia. Had on a live tape of the Dead doing Uncle John's Band (New Year's '87-8, for those of you who have to know:-)). I remember needing a couple of tokes to finish the bowl, saw it finally being finished, and lay back. Next thing, i was still hearing the music, but in front of my eyes a completely wild and scary story was being played out. I was being taken off a bus in New Jersey, across from New York City (where i grew up), and being dragged away by a woman who i thought at first was my mother, but don't think so. Doors were being slammed shut, walls coming down, all sorts of things like that, supposedly in order to keep me from holding on to something, anything, so i won't be dragged away, while the music was blasting This was a part in the tune which has a jam in a minor key, that can sound rather ominous, so i actually thought at times that i was dying. Then i saw my friend's dog come over and lick my face, which grounded me some, then i saw my friend, and grabbed at him, figuring i couldn't be pulled away as long as i held on to him, and his friend as well. Within a minute, i was still having an intense high, but no longer feeling like i was being dragged away (which was probably my feeling their hands holding on to me.)</p><p>I first thought i had a paranoid fantasy knocked out from deep in my subconscious mind. But then i read one of the reports here, the man who felt like a powerful force was pulling him outside his house. I wonder if this wasn't the plant intelligence melding with my own, and trying to get me to walk out into where the sun was - plants have a powerful sun-seeking instinct, after all - while my human consciousness was determined to stay sitting, as i was advised, and the collapsing walls, closing doors,etc the plant spirit's way of trying hard to get me to let go. </p><p>Which points to the fact that sitters are *essential* if you intend to use salvia. This is powerful stuff. Maybe also it's a good idea to relax as much as possible (eg meditate, herbalize, ) beforehand, and have your sitters remind you to relax, perhaps even walk you outside, make sure you have sunglasses so you don't stare at the sun, etc.</p>"
}
