{
 "title": "Understanding Where We Are",
 "author": "Phantom Groover",
 "citation": "   Phantom Groover. \"Understanding Where We Are: experience with Salvia divinorum (ID 2164)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2164",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 2164",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 5251",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am writing this letter in a cafe in NZ, south island. I have introduced Salvia divinorum to several friends while I have been travelling for the past couple of years and the biggest question I have is 'what does it mean to see what I saw, and does anyone out there experience what I have experienced.</p><p>I am not going to compare what I experienced to any sort of tripped-out acid experience, or recreational high of any kind. I haven't experimented with too many drugs in my life, as I am aware that my body, as I have it now would like to remain healthy and supple into elder years. I have had a few acid and mushroom experiences, and have used pot. I really believe that the substance that this realm provides, the food from earth, is meant to teach or to feed us, and sometimes end our existence on this physical plane.</p><p>Now, the first time I experienced salvia was when a friend introduced it to me, outside, late at night, in the middle of a golf course. No one around. I smoked a couple of bowls, held it in as long as I could and laid back with my eyes open. The first thing I encountered was a profound understanding of where I actually was. As I lay there I understood what it meant to be in existence on the planet. I knew that I wasn't laying down at all but actually stuck to a sphere, spinning. I had the perception that the plane I was on wasn't me laying down, but actually upright (sort of like when you are in those cheesy amusement rides that spin and the floor drops). It was then that I saw the silhouettes of the trees around me and my friend standing there and I had an understanding that everything is connected , made of the same stuff. Obviously what our scientists tell us is true. Naming this 'stuff' atoms.</p><p>I then began to laugh very giddily. My analytical mind and observations were still very much my own. I felt that a very funny joke was being played on all of mankind. I felt as if this substance was letting me on a little secret of our existence and I wasn't upset or scared at all. Eventually this wore off and I knew where I was again, but I still had the revelation in my thoughts and had a challenge to apply them when I was surrounded with the familiar.</p><p>That was over a year ago now. As I have said I have introduced it to several people in hope of connecting with someone who might be feeling the same. It all sounds very basic, my experience, but I feel that when I truly have faith in the knowledge it shows me, I will be able to become truly equanimous. Knowing that everything in our existence is in fact vibration. Not just because that is what we read, or our told, but actually experiencing it.</p><p>Some ways I have described my observation of this reality:</p><p>Take for instance those 3-D picture books where you must train the eye to focus on a different depth. When you do it, whammo! you are suddenly taken to a new dimension. I really felt that whilst on Salvia during the last couple times i have smoked it. Each time wanting to understand more and to be able to convey the perception and to share it with someone. </p><p>There was a time when I felt that everything in my field of view was made of a sort of substance like the sound absorption cones in a sound studio. Everything, some familiar objects, and some unfamiliar. A definite depth. I could see for miles; just as my eyes can see where I am now.</p><p>There was a time when i felt that I didn't have a body. That my vision, was my being. Almost as if I could be any'body' at anytime. As if I was looking through holes into a new space, that I have been in all this time. A bit hard to put into words.</p><p>I would like to try to smoke the same amount as someone else who perhaps is experiencing something similar to me. To do this simultaneously and attempt to exist in this perceived space. In fact there was a time when a small group of us were taking turns in a very quite setting. I felt that there was a moment when this person across the room and I were in the same reality of understanding and we both laughed at how amazing our existence on this planet really is.</p><p>Look at children ,especially babies; look at that look in their eyes and you can tell how amazed they are with their surroundings. Everything is new. I know that that feeling of experience has been extinguished with all that surrounds us in our modern western world. I praise those of you who can experience this wonderment of life without substance and I feel that some of the substances are there to remind us just exactly where we are and how awe-inspiring our existence is. I believe meditation can reach this awareness, yet I don't seem to have the patience to 'sit' for so long. I tend to want to use my body for dance, or other physical experience.</p><p>When I saw 'The Matrix', I about let out a yell. I felt that it was hollywood's attempt to introduce this idea of our known reality not being what is actually there. I was a bit upset that they used the idea of pills and high tech equipment, but I was pleased with the message.</p><p>Near the very end, we see what 'Neo' sees as he looks down the hallway at the 'agents'. Everything is made of the same texture, numbers and symbols in movement. That is when I felt the connection most powerful to convey what I have experienced.</p><p>Good luck to all of you and just remember that we are meant to know so much more about our existence and that we have the ability to 'be' without substance or material. But do what you will.</p>"
}
