{
 "title": "The World of Spirits",
 "author": "Jani Heinonen",
 "citation": "   Jani Heinonen. \"The World of Spirits: experience with P. harmala (Syrian Rue) (ID 2168)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2168",
 "substance": "P. harmala (Syrian Rue)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "1993",
   "ID: 2168",
   "Male",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "Views: 23788",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>J writes:</p><p>>Three grams of ground seeds has proved quite adequate. Less would >probably also work. \n>I think a psychedelic dose of harmaline is around the 200 mg mark,</p><p>>so maybe up to 20g of seeds could be eaten for the full effects </p><p>A FOAF once chewed approximately 10 grams of harmala seeds. The full effects started within half an hour of ingestion, with occasional feelings of weightlessness and a peculiar enchanced and distorted perception of sound. He lay on his bed, eyes closed, and was immediately immersed in a visual fantasy starting with floating eyes (;-), one of which eventually swallowed the psychonaut and threw him into The World of Spirits(tm). The visionary and auditory quest continued for quite a while, during which our brave experimenter had an alarmingly high pulse and was seriously contemplating whether stroke or cerebral haemorrhage comes first.</p><p>The body load was so horrible that he was unable to write down his experiment by any means, and any movement was extremely painful. He was nauseated but did not expel the contents of his stomach, although it probably would've been better if he had - the seeds don't digest too well. He was also completely unable to sleep during the whole night. The experiment started at around 8 pm. (post mortem?)</p><p>As for the trip, it was very much like how Ayahuasca is often described. Perhaps this knowledge affected the course of our apprentice ayahuascero's voyage. Anyway, there were e.g. eyes-closed visions of the Amazonas, with sparkly fireworks in the sky. The statue of a hawk-headed deity, accompanied by a section of Revolution 9 (on the auditory side) appeared. No jaguars, however. ;-) There was very little, if no synesthesia and visual distortions were limited to a blurred vision and very strong tracers. Emotional effects were very profound and he encountered an extemely critical inner voice pointing out how he had neglected and mistreated the people around him. There was also a sensation that could be best described as 'cognitive feedback' and which is often felt during high fever. He felt telepathic contact with the late(?) curandera Maria Sabina and some people, supposedly Americans, who had permanently crossed the river Styx as a result of Ayahuasca experiments. This was probably influenced by a net article describing a butane huffer who saw spirits of people who had died from said indulgence.</p><p>Well, that's about it. It doesn't make much sense and there's no logical or chronological continuum, but considering the circumstances, it's an adequate sum-up of my friend's experience. He might have left something out or thrown in an after-fancy, as this happened almost a year ago.</p><p>By the way, he had not eaten or drunk anything which could've interacted with the alkaloids, so they were fully responsible of the dangerous sympathomimetic side effects. I advise excercising some caution before chewing up a bloody ounce of the stuff. As to DMT, comparing my friend's experience with the Ayahuasca one, I'd say that the only difference is the level of visual effects and perhaps the combination being more 'unreal'.</p><p>-- Jani Heinonen </p><p>\n"
}
