{
 "title": "Loving and Loathing It",
 "author": "SomberSoul",
 "citation": "   SomberSoul. \"Loving and Loathing It: experience with Amphetamine (Adderall) (ID 21686)\". Erowid.org. Dec 12, 2005. erowid.org/exp/21686",
 "substance": "Amphetamine (Adderall)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " ",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21686",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2005",
   "Views: 17994",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me say, that first of all, for my age (15) I am a moderately experienced drug user with a pretty vast knowledge of psychoactives.  My 'resume' of substance use includes marijuana, alcohol, cocaine, heroin, opium, Datura, Ecstasy, LSD, diazepam, hydrocodone, oxycodone, alprazolam, clonazepam, and DXM.  Marijuana is by far my drug of choice, but I see fit for myself to experiment.</p><p>One drug that I have always been curious about was speed, especially in the form of amphetamines.  I had read about it, researched it thoroughly, but I never had the chance to try it for myself.  That is, until yesterday. My close friend, who always seems to have a stockpile of pharmaceutical drugs, informed me that she had 20 milligram Adderall tablets that she wanted to sell.  I gleefully accepted this offer, especially since she was selling them for $1 each.  I bought 4 tablets.  I recognized them immediately by their pale orange color and imprint, 'AD'.</p><p>I decided to pop all of them (a total of 80 milligrams) last night at 9:00 PM.  I also skipped my daily dose of Celexa, which I take for depression, because I was unsure whether amphetamine would interfere with it.  </p><p>So, I waited.  Forty-five minutes breezed by - and that's when I started feeling the speed kick.</p><p>First came the jittery movements, the clearer thinking, and rapid talking.  Almost like caffiene, I thought.  Yet, as each minute passed by, I felt more and more euphoric.  My confidence skyrocketed.    Suddenly, I had a replenished and passionate interest in everything I did.  I had a lively conversation with my younger brother, asking him tons of questions about everything and anything.  When I looked in the mirror, I was beautiful despite my flaws.  I immediately noticed that my pupils were enormously dilated (which I read was a common effect of speed).  I didn't care.  I was full of energy, ready to burst.  I stayed up until 1:00 AM perfecting every detail of my homework, writing endless letters to my friends, reading my assigned English book twice (which was 125 pages) with extreme fervor.  Smoking a single cigarette was like heaven, even though I smoke a pack a day.</p><p>At 1:30 AM, I retired to my bed (certainly not because I was tired, but because I didn't want my parents suspicious).  With my jaw being clenched at full force and my uncontrollable lip twitching, my hands wandered around my cluttered desk until I found some chewing gum.  I shoved 3 sticks of gum into my mouth and chewed anxiously.  After about 15 minutes, I decided my wad of gum was lacking flavor.  I chucked the enormous, chewed-up wad into the trash and started on 3 new pieces of gum.</p><p>All night long I did this.  Chewing on gum, for hours at a time, until my jaw and tongue were raw and sore.  I didn't really notice it - I was much too tweaked out.  I didn't sleep one second last night.  It was impossible.  I was boiling over with energy and sporadic thoughts.  Compulsively, I checked my watch every ten minutes.  </p><p>I started getting ready for school at 6:00 PM.  I felt like absolute shit and I was STILL very high on amphetamine.  Crashing on speed is a horrible, horrible feeling.  My heart beat was very rapid, my breathing was sporadic and shallow.  My pupils were still dilated to the max.  My jaw and tongue were raw and painful from hours of gum-chewing.  Sweat flooded from my skin as if I were in 90-degree weather.  Dehydration was setting in.</p><p>As I arrived at school, I felt mentally and physically burnt.  I bought some juice (which I gulped down).  My friends noticed my pupils were dilated, and that I had dark circles under my eyes.  I was also wearing the same clothes from the day before.  I didn't even think to brush my hair.  Yes, I was truly a mess this morning.</p><p>An easy conclusion is hard to derive from one experience with amphetamine.  I was in paradise for several hours, but that paradise was followed by several hours of hell.</p>"
}
