{
 "title": "The Most Traumatic Thing I've Ever Experienced",
 "author": "Indrid",
 "citation": "   Indrid. \"The Most Traumatic Thing I've Ever Experienced: experience with Diphenhydramine (ID 21696)\". Erowid.org. Nov 9, 2007. erowid.org/exp/21696",
 "substance": "Diphenhydramine",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21696",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2007",
   "Views: 19593",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This happened about the second week of January 2003. I remember because it was that Friday after all of my mid term exams were done. anyways, I go to military school, their policy on drugs is you get caught using them, you're out. I've used dxm many times and got away with it, but this night was an extreme last warning.</p><p>I've used Benadryl many times in the past. taking about 25 pills. I call these 'pinkies', because they're small and have a pink-tic-tac look to them. My friend John and I went AWOL (Absent without leave) Friday night. We went to a drug store and bought some benadryl. He took 25 and so did I. We finally got back to school and back into barracks without getting caught. It started to kick in about 3:30 am, we left my room and went to the TV room. I noticed the hallucinations like before and was enjoying my trip. I noticed that my friend John said earlier 'My legs feel numb.' He stood up from the couch to my right and walked over to the couch on the left side of the room.</p><p>A few minutes later he says 'I need to piss' he stands up and his legs must've buckled. He fell and his head came crashing down onto the corner of the TV stand. I didn't notice he hit his head until he rolled over and started convulsing uncontrollably. He was gasping for air and looked like something out of a horror movie. Considering I was tripping, I remembered from my first aid class that when someone's having a seizure is to get something for them to bite on. To my luck there was nothing. So to prevent him from choking on the spit that was coming out of his mouth I rolled him over on to his stomach. He finally stopped shaking and breathed really really hard. There was blood and foam all over his mouth. I was scared out of my mind. He didn't respond to me. I turned on the light and there was spattered blood along the side of his face. he cut his head but not severely. I couldn't concentrate because I was tripping myself. My adrenaline rush killed the high.</p><p>After about 5 minutes he finally calmed down and just stared at me. his eyes were black as coal and I couldn't clearly see his pupils. I wanted to bring him up to the health center but I couldn't lift him up. He was all dead weight. I managed to lift him up onto the couch, getting blood all over my sweatshirt. He immediately leaned over and puked a little bit, but not enough to make a mess. I still couldn't make sensible decisions, leading myself not to wake anyone up to get help. I put his arm around my neck and started walking to his room. He was so out of it that if I let him go he'd fall over again. He couldn't put in his door code and I couldn't get his roommate to wake up.</p><p>My roommate was on a weekend leave. So I brought him to my room. Getting him on the top bunk was near impossible but I managed to get his heavy-dead weight body into the top bunk. I sat there and thoughts were racing through my mind. He layed there and was still breathing. So I decided to go to sleep. He started talking gibberish like I used to when I would trip. OK now I have an idea that he'll be ok. The next morning I wake up an hour past reveille. I immediately jump out of bed and look at the top bunk. John was still breathing and sleeping soundly. I wake him up and he asked 'Where the fuck am I? What happened to my face?' I told him the story and said that I was an idiot for not getting help. Yeah that was a dumb decision on my part but he's still alive.</p><p>After all of that I go to sleep each night thanking god that John's still alive and that no one found out. John is still fine today, no noticeable side effects. Since then I'm cautious about doing benadryl or any other Diphenhydramine drug. Please Please Please, be careful if you're to do this drug in the future. I'm lucky that I'm still here today with John. This was the most traumatic thing I've ever experienced, and it's hard to let go. I'm not telling any of you not to do any drugs but this one you should avoid for your own safety.</p>"
}
