{
 "title": "Vomiting Can Be Fun",
 "author": "Girl, Jr.",
 "citation": "   Girl, Jr.. \"Vomiting Can Be Fun: experience with 5-HTP (ID 21695)\". Erowid.org. Dec 30, 2004. erowid.org/exp/21695",
 "substance": "5-HTP",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)",
   "  T+ 1:00",
   "200 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21695",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 30, 2004",
   "Views: 18674",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've been experimenting with different legal and easily accesible chemicals over the years to enhance mood and combat ennui, my favorite being DXM. I have been on antidepressant therapy with Effexor XR for over a year with excellent results, aside from the tendency toward mania which has been quite disruptive to my attempt at living a 'normal' life (yeah, that's overrated anyway.) After carefully researching the use and dosages of 5-HTP, I decided to (not so carefully) experiment with the chemical. I abstained from my regular meds for a day prior to avoid complications and proceeded to ingest orally a dose of 300mg. I had taken 200mg at an earlier date with no real effects, so I figured this would be a good starting point. This was at about 6:00 p.m. After an hour, I felt fine aside from some mild stomach upset, so I proceeded to ingest another 200mg. My school was putting on a play, and since I had worked on production I decided to go and assist with props. I figured that the serotonin boost should make it interesting, so I had no reservations about anything going wrong. <br>Oops. The stomach upset I had experienced increased, with transient nausea added. I made it about 15 minutes through one scene change when a crew member remarked how pale I looked. I found someone to take my place, grabbed a plastic cup, and ran to the most remote restroom I could find. Two cups of water and a minute later, the toilet and back wall of the handicapped stall was sprayed with projectile vomit. This was at about 7:45, 45 minutes to intermission. I sat slumped against the wall for a few minutes, wondering if I'd really done it this time, when suddenly the nausea subsided and was replaced by an extremely evident sense of well-being. I surveyed the scene and realized that it just wasn't right to leave that kind of mess for someone else to clean up, and cheerfully set about the business of mopping up the former contents of my stomach. By intermission, the task was complete to the best of my ability. <br>The feeling I had was one of elation, coupled with a pleasant body high. All traces of nausea and stomach upset were gone. I went back to the shop backstage to make fun of my situation with some friends, then excused myself to rush home and write this report.  <br>It is now 11:00 p.m., and I feel quite pleasant, though no longer 'high'. My blood pressure is 100/70, pulse normal, and I'm pretty sure it remained normal throughout the experience. I think I waited too long to record the feelings as they happened; I was writing in my head during the walk home, and what I have here seems seriously lacking in comparison. I would definitely repeat this experience with a careful adjustment of dosage, and would like to experiment with using it in a normal dosage range for antidepressant purposes.\n\n\n"
}
