{
 "title": "DMT Deluxe",
 "author": "Jair D.",
 "citation": "   Jair D.. \"DMT Deluxe: experience with 5-MeO-DMT & Syrian Rue (ID 2170)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2170",
 "substance": "5-MeO-DMT & Syrian Rue",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 g",
   "oral",
   "Syrian Rue",
   "(seeds)",
   "  T+ 1:00",
   "2 hits",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)",
   "  T+ 1:40",
   "1 hit",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2170",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 12286",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was on Saturday afternoon at 12:30 that my friend mesured up 3 grams of Syrian Rue (said to be an MAO inhibitor), and we split the seeds between us. My friend advises chewing these very small, very digusting tasting seeds for five minutes or so. Apparently the saliva helps as an anti-vomiting agent. The taste is so bad that it will linger for a very long time, but brushing your teeth makes quick work of that problem. In order to gain full effect from the Roo, we waited a full hour before smoking the 5-MeO-DMT.</p><p>During which my friend meditated and I smoked a bowl of bud. Needless to say my hour lasted longer than his.</p><p>Feeling somewhat effected by the first substance (I was not feeling the weed at ALL-no burn out, nothing), we flipped a coin to see who'd go first. We had a feeling that the first toker would heat up the 5-MeO-DMT in the bowl to the extent that the second toker would get more of a blast. A. won the toss and I toked first. I toked twice in about 20-25 seconds and layed down on the bed feeling immediatly high. Blasted in fact, as if I was peaking on 8 grams of mushrooms having dosed 35 seconds previous. My body was moving around mildly, I was a little anxious and said so to my partner, who toked just 30 seconds before. 'Give your SELF to a higher power', was his response. I did nothing but listen to those words and everything was just fine. After what I suppose was 5 minutes I sat up. Still feeling the most high I had ever been, I noted the visuals. I didn't see any animal or bookcase trying to comunicate with me. I simply noticed tracers, and waves. Another three minutes and they were gone.</p><p>Upon standing up (10 minutes after smoking) I was still awfully high, but without the intensity. Similar perhaps to extasy, but also constantly changing. Two minutes later, for example, I felt as though I was floating, as though on 'Poppers' or 'Rush'. Gigily and talkative, I communicated with my friend who said, 'You didn't become consciousness, did you?' He obviously got more 5-MeO-DMT smoked in his 'window'. He suggested that I smoke more, explaining that the Rue will allow one to process and enjoy the effects of 5-MeO-DMT after much shorter a time. I looked a my watch: 2:05. It didn't seem to make any sense so I laughed. It seemed liked two hours since I first toked.</p><p>Coming down ever so slowly and beautifully, I toked again at 2:10. Only one toke this time, laid down. I didn't feel near the intensity as was present the first time but visuals were similar. After half a minute or so I recall felling very still, having a very strong sense of the bed beneth me. Once I noticed that, I lost sensation of myself. Not judging it, or being scared I felt this amazing sensation OUTSIDE myself, it was crawling down the side of my face apparently from my mouth. I thought that maybe me being completly motionless, drooling, and complete was a sign of an over-dose. Without any real effort I let go of that thought, sat up, still blown away, just beeming in my my beingness. I looked at my arms on the bed and I saw them as completly separate from me. My legs, same deal. I realized then what A. was talking about, I was experiencing pure consciousness. In fact I WAS EXPERIENCE. This state lasted about half an hour at which time we both went for a walk. </p>"
}
