{
 "title": "The Tempest",
 "author": "Shep",
 "citation": "Citation:   Shep. \"The Tempest: experience with 5-MeO-DIPT (ID 21719)\". Erowid.org. Mar 2, 2003. erowid.org/exp/21719",
 "substance": "5-MeO-DIPT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21719",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 2, 2003",
   "Views: 7477",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm a sophomore in high school.  Foxy [5-MeO-DiPT] was given to me for a field trip to see a Shakespere play.\r\nI went to see 'A Midwinter's Night Dream,' a take off of 'A Midsummer's Night Dream.'  I must've been nervous or something cause I defected almost right away.  After about half an hour, I was acting strange.  I dont really remember much, just really horny.  I identified the themes of 'sex' and 'love' right away.  I wanted to please everybody.  My nervous system was going all out, and my legs felt like they had been beaten with paddles.   I remember the fairies being labeled by me as the 'Sexual Faries of Justice'.  I understood Shakespere mustve been really stoned.\r\nThe second time was for my second field trip to see The Tempest.  This happened more recently, so I remember more.  A dizziness or a buzz took over about an hour into it, and that's when it all started.  I felt a warm connection with everyone.  I felt kind of horny, too.  I felt like the whole world was based on love and sex.  I started yelling at a friend for no good reason cause I thought he said a girl I liked was hot.  The play about love seemed so real to me, and then there was some weird 69 gay sex going on that I understood.  The spirit, Ariel, was played by a small Chinese girl, was to my liking.  I felt like I had to chose girls all around me, in the play, close to me, and girls I didnt even know.  I wanted to know everyone's sexual needs and deliver them to them.  When the horniness was over, I sort of dosed off.  When I closed my eyes, words from friends played over and over, and even words they didnt say.  Visuals were easy to come up with.  Colors and patterns and characters from the play mixed with friends in real life.  The color green became evil as one of my friend's heads on Caliban's body marched down the aisle, and my friends heads turned back from the seats in front of me to stare at me with cold eyes.\r\nI felt danger from teachers.  My legs started shaking and felt like dynamite sticks.  I thought my bones were about to explode.  Then the dynamite sticks were replaced with rainbows.  I had to go pee.  The lights went up, and it was intermission.  I had a faithful friend guide me to the bathroom and when I was going pee, I felt like I was still in the audotourim, peeing right on stage.  I felt unreal lapses.\r\nI opened the door and stumbled out.  I walked into a room and it was a daze.  It was like that scene in the movie Loser (starring Jason Biggs) when the girl was on the date rape drug and everything went by so fast.  I had like wall eyed vision.\r\nMy dealer and friend in the same grade said 'just so you know, I doubled the dosage' and sort of blew in my face the powder I had swallowed.  I complained about my legs being beaten by paddles.  The rest of the play got more intense.  I dozed off and tripped and someone asked me if I had fallen asleep.  I could look at the play and close my eyes and still see what was going on.  I had to chose girls to make out with.  I wanted to kiss.  I felt warm.  I felt horny and lonely.\r\nThe bus ride back to school was fun.  The whole bus knew I was on drugs, and I sat up front near the teacher and everyone was like 'Hi 'S'!'.  I closed my eyes and saw visuals of rainbows spinning and interwining with my nervous system, flowing like DNA strands.  I tried to explain this to my friend, saying it was all like the IMB colors, but he said 'youre too intoxicated to exist'.\r\nI just thought on the way back, about how I had only Two more years of being with these people and then everything would change, I thought about what I wanted to be when I grew up, about passing on the family name, about religion, where I will go when I die, and what the meaning of life was.  While the ride there was just reading a magazine, the ride back was thinking and knowing my place.  Knowing I had to have good grades to get to a good college to become a good writer.  I wanted to write movies.  But for now, I just needed to stay physical and keep my grades up.\r\nBut the headaches.  Ah, the headaches.  I had a swiss cheese feeling in my head.  It was the worst headache ever.  But I was being very unshy like I usually am. It was weird.  Everyone in the school knew I was on drugs.  I took the 3:10 bus home, and just hung out on my room and thought.  I took off my pants and tried to concentrate on goals as I felt my balls.  I thought I was Shakespere for a moment, thinking things I thought were the cleverst things ever. I had thoughts of suicide, just to make people think.  I was a thinker.  I was a ponderer.\r\nThe next day, though, I felt depressed.  And strange.  It was nothing like the day before. I went back to being ultra shy and felt unpopular and ugly.\r\nBad, depressing hangover.  No one really mentioned the drugged-out day before.  No one.\r\nWas it worth it?  Yes.  I guess. I dont know.\n\n\n"
}