{
 "title": "Itch Itch Scatch Scratch",
 "author": "Dr. Homolka",
 "citation": "   Dr. Homolka. \"Itch Itch Scatch Scratch: experience with Poppies (ID 21712)\". Erowid.org. Mar 1, 2003. erowid.org/exp/21712",
 "substance": "Poppies",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "700 g",
   "oral",
   "Poppies - Opium",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21712",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 1, 2003",
   "Views: 34015",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have always been an avid opiate user.  I have tried almost every pharmaceutical opiate-Vicodin, Codeine, Percocet, Darvocet, etc.  I also used to be a heavy heroin user, roughly using the substance about 100 times.  Out of all the drugs I have tried, including cocaine, ketamine, crack, ecstasy.., I have always had a special love for opiates.  Naturally, when I heard that you could extract opium from poppy seeds, I was excited.  I looked all around town for a bulk grocery store that would sell these seeds, but it was to no prevail.  I finally found a market that sold bulk(20 oz for 5.85).  I have tried the tea several times, I will describe one such experience:</p><p>The setting was in my dorm room, with my girlfriend and two other friends.  One friend was new to the experiment but the rest of us had done it before.  We dumped 100 ounces into a big tub with 2 and a half quarts of pure lemon extract and a quart of hot water. I have done this procedure and found it to be the best.  We let the seeds sit for half an hour, stirring every 5 minutes.  We strained the liquid with a T-shirt, than drank away.  I must add, 25 ounces per person is a lot.  You could be fine with much less of a dose, but since I had done it before and had a tolerance and we wanted an overall intense experience, we decided to go large.</p><p>Drinking the juice is not a pleasant experience, but it is not nearly as bad as some might think.  It just tastes incredibly tart and hurts the stomach a bit.  After drinking the juice, I find the effects come 1 to 2 hours later.  There is an underlying subtle elation you feel in your chest, and then, of course, the itching.  For me, the itching is the best part.  When I try to explain to people that you itch a lot on this substance, it always turns them off.  It is not until they try it that they understand how cool it really feels.  Itching with opiates is similar to a drip with cocaine.  It is not the most pleasant thing at first, but it grows on you and reminds you that the drug is kicking in.  The itching starts with my crotch, then my nose, then face, then my whole body is fuzzy.  Opiates are very simple drugs.  They make you feel good.  Thats it.  They make you warm and fuzzy inside.  I have found the poppy tea to be a very potent form of opiates.  Out of all the ones I have tried, only heroin is more potent.  If you use high enough of a dose, the effects are similar to heroin without the enormous rush, obviously.  </p><p>I would suggest using the drug with a girl or boyfriend.  My girlfriend and I enjoy laying in bed and scratching each other, which sounds odd but is quite amazing.  The tea just puts you in an overall loving mood.  I have also found that sexual activity is very exciting.   It takes awhile to orgasm (which is a good thing) but when you do, it is wonderful.  We have found that oral sex is tremendous, my girlfriend says that the back of her throat goes numb, which eliminates her gag reflex. This benefits both of us.  </p><p>I must add that this dose had most of us throwing up all night. This isnt as bad as it sounds, but I believe our dose was a little too high.  I would stick around 500-600 grams tops.  If you like opiates or havent tried them, I would highly suggest finding some poppies and making tea.</p>"
}
