{
 "title": "SmOkin' ToAdZ",
 "author": "Spiney Norman",
 "citation": "   Spiney Norman. \"SmOkin' ToAdZ: experience with Toad Venom (ID 2172)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2172",
 "substance": "Toad Venom",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Toad Venom",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "1993",
   "2172",
   "Male",
   " ",
   "Not Given",
   "Jun 26, 2000",
   "143153",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nDoing a bit of research in various alt.drugs files, and some textbooks I discovered that Bufo Alvarus (Sonoran Desert or Colorodo River Toad) has a venom in its paratoidal gland that contains from 6-16% of 5-MeO DMT. Having experienced this (or a related) drugs once before, I was exited at the chance of obtaining a readily available supply of it.</p><p>After consulting with the local herpetologist, and checking with several biological supply houses, I discovered that B. Alvarus is a common enough toad, but not available this time of the year. The price for a B. Alvarus is generally around $10 plus $25 (US) for shipping. </p><p>Luckily for me, the local pet-shop had three specimins. Since they were rather exorbitantly priced, I decided to have a go at conning them out of some venom. I used the story that I was a biochemistry student interested in certain indole alkaloids present in the venom of Bufo Alvarus. Basically, I told them the truth. After checking with the management, they gave me the go ahead.</p><p>Extracting the venom was somewhat problematic. _Venomous Animals and their Venoms_ gives a procedure where the toad is pressed firmly down with one hand and the paratoidal gland (behind the 'ear') is sqeezed firmly with the other. A piece of glass is suspended above the toad to catch the viscous venom as it squirts from the toad. I found this method awkward. The best way (after brief experimentation) I was able to discover was to hold the toad in one hand, squeeze the gland with the other, and have an assistant hold some glass in the firing line of the paratoidal gland. This should be repeated once after the toad is allowed to rest for 20 minutes or so. You must apply a considerable amount of pressure to release any poison; I was hesitant in this as I was afraid I would injure the toads (especially with the manager standing next to me). Because I didn't apply as much pressure as I should have, I only obtained 80-100 mg of venom from the three toads. According to _Venomous Animals and their Venoms_ I should have obtained something more like 400mg per toad. </p><p>In any case, after letting the poison dry, I scraped it off the glass, obtaining a fine crystaline substance. I took 1 gram of Harmala seeds for my experiment (I weigh 160 lbs) and a friend (who weighs 260) took 1.7 grams of the same substance. We also smoked one MJ cigarette. Instead of freebasing the 5-MeO-DMT (as would have been most efficient) we mixed it with some MJ and smoked it in a pipe. The taste was unusual, but not intensely unpleasant. Halfway through smoking the quantity, we stopped. I noticed an odd feeling and slight buzz from the MJ, the freind noticed nothing. We continued smoking, and after finishing both noticed some rather extreme effects.</p><p>Objects appeared extremely distorted, colors were intensified and facial quirks were magnified, giving people a clown-like appearance. Perception of distance was extremely disorted; objects within arms reach seemed miles away. Height perceptions were also distorted, one minute I seemed like a giant compared to those around me, the next minute I seemed a dwarf in comparison. Light sources provoked an unusual reaction; they seemed surrounded by moving, prismatic colors. Walking was problematic; the sidewalk reminded me of the famous films of the 'galloping gertie' bridge in washington state. I felt as if I was surfing rather than walking. Observations of the facial expressions of the passerbys seemed to indicate that my manner of walking was no different than that of any of the other pedestrians that night. My freind (who was, for the record, rather out of shape) claimed to experience racing heart, but I had no such difficulties.</p><p>After walking for approximately 15 minutes, the intensity of the experience subsided, and we felt able to go to the bar as we had intended. We were both rather strongly intoxicated for the next hour, drinking several beers in that time. Paranoiac feelings, and some mild visual/auditory hallucinations persisted for approximately 2 hours after taking the substance. </p><p>Conclusion: the venom of B. Alvarus seems to contain the quantities of 5-MeO-DMT that are claimed for it in the various publications. Its use with harmaline seemed to powerfully increase the already present marijuana intoxication (unlike LSD, which often has an antagonistic effect with THC), as well as provoking uniquely powerful visual hallucinations. The steroidal poisons in the venom _may_ have a toxic cardiac effect when the venom is smoked, or (more likely IMHO, due to my lack of similar reaction) the heart-racing may have been due to the effects of the THC intoxication, or the effects of the 5-MeO-DMT itself. It would probobly be a very bad idea to ingest this substance orally in conjunction with harmaline as a kind of animal ayahuasca; the steroidal poisons are doubtless much more harmful when an orally active dose is taken, due both to the greater quantity that would be required, and to the lack of steroid pyrolysis in an oral dose.</p>"
}
