{
 "title": "Strange Happenings",
 "author": "Green Eggs and Ham",
 "citation": "   Green Eggs and Ham. \"Strange Happenings: experience with Salvia divinorum (leaves) (ID 21745)\". Erowid.org. Sep 24, 2007. erowid.org/exp/21745",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "4 bowls",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21745",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 24, 2007",
   "Views: 2373",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe following events took place about two or three months ago. In retrospect, I figure my experience with Salvia Divinorum might be worthy of being posted; both to inspire and inform.<br>I had originally thought I had stumbled upon a bag of low quality marijuana, the leaves were dark, brittle, and loose.  The bag was stashed away in some far corner of a dresser drawer in my older brother's room. Its wasn't weed, as I soon realized, but 'Salvia Divinorum', clearly labeled on the bag.  Wow, what luck.  I was not, and am not, a true explorer to the hallucinogenic drug culture.  I smoked a little pot here and there, nothing more, nothing less.  I decided to give Salvia a try for one simple reason, curiousity.  A mexican herb with the power to 'unlock hidden truths,' as I had read, seemed quite intruiging.  I waited for a quiet night on the weekend when my parents were gone and got ready to experiment with Salvia.<br>I turned the lights off in my room, while leaving on a lamp that gave off a crimson glow.  I had borrowed a bong from a friend, which I found to be adequate for smoking Salvia.  I layed down in bed for a minute or two, and calmed my mind.  I figured Salvia was not something to be taken lightly and therefore, I needed to be in the right mind set.  I walked into this Salvia session secure, open minded (I thought), and ready to experience something new.<br>I packed a bowl, inhaled it all in one hit.  As instructed, I held in the smoke for as long as I could.  As I was holding the smoke, I began to lose the concepts of what was real and what was not.  I thought, as I was holding the smoke in my breath 'Who gave me these instructions?  Why am I holding my breath?'  It was terrifying.  I remembered that I was supposed hold the smoke as long as possible but as the effects presented themselves, I thought of this 'smoke-holding practice' as a completely alien ritual.  This spiraled me into a state of utter disoreintation.  I sat in my room, and soon felt completely dissconected from my surroundings.  <br>I knew I was in a room, I knew it was supposed to be mine, but in a sense, It was just any old teenager's room.  A person's room, that's all it was.  I thought of my mother, father, sister and brother, not with feelings of love, but with feelings of plain familiarity.  They were family, I reasoned, but I did not feel any more connected to them as I did anyone else.  Now that I look back on this, I wonder, if what I felt compared to what it feels like to 'lose your ego?'<br>I sat there on the floor of my room for what seemed to be forever.  Honestly, I felt as if I was trapped in some kind of parallel time, and I was imprisoned in some kind of alternate reality I knew nothing about.  It was as if I had just been dropped there.  I was living a life, but I had forgotten whose.  I remembered one thing: I had just smoked some Salvia out of a bong.  The thought should have comforted me, but it did not.  So I sat, and was terrified.  I was lost.  I had even forgotten if I had smoked the Salvia alone or with someone else.  I called out in panic to anyone, although no one was present in the empty room. I felt like crying.  When would I feel normal again?  When will I return to my life?<br>I saw an entity appear before me.  It was my aunt who is experienced with psycoactives.  She saw me there, and knowing of her desire to keep me away from drugs, I saw her dissapointment.  Very troubling, even more so because I truly believed she was there, standing before me.  I continued to smoke, despite my instincts that were screaming for me not to.  The minute I smoked another bowl, I experienced strong feelings of urgency.  I felt as if I had almost done 'something wrong' in smoking Salvia Divinorum. I had a sense of little beings watching me, as if to say, 'tsk tsk.'  Each time I finished a bowl, I quickly put it away with a feeling of overwhelming guilt.   <br>The intense fear and feelings of being permanently enclosed in an unfamiliar universe lasted 15 minutes.  I almost couldn't believe my clock.  That's it, it seemed like an eternity while actually on the drug itself.  I gradually found myself slipping back to THIS reality.  I grasped what I knew to be 'me'- MY bed, MY room.  The sense of relief I felt was liberating. I looked back at what I had just felt.  How could I have felt so lost and confused ??  I was sitting in my room the whole time.  My room.  <br>I realized, maybe this reality that I had returned to was no different than the one my head had just made up while fucked up on Salvia Divinorum.  In a sense, I had just 'swapped realities.'  I remembered a phrase I had once heard, 'We shape our own realities.'  Wow, this is so true.  While high on Salvia, this is essentially what I had done.  I had shaped a new reality with my mind, and it scared the hell out of me.  <br>I guess Salvia was not what I expected, to say the least.  I believe I came in to the experience not prepared in the way I should have been. I did not expect to be rooted up from all I knew to be real, and when I did, it was mindblowing.\n\n\n"
}
