{
 "title": "Toad Is the Mystery",
 "author": "Bob",
 "citation": "   Bob. \"Toad Is the Mystery: experience with Toad Venom (ID 2174)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2174",
 "substance": "Toad Venom",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Toad Venom",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2174",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2000",
   "Views: 34924",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI took the biggest hit of Toad from that stinky resinated test tube pipe that I have ever taken to date; smoke was coming out my ears! As the rush came on and I finally blew the rest of the smoke out of my lungs, the world around me began to melt. My first reaction was shear terror because I was instantly in that dreadful space I got into during my last mushroom experience: I saw not only the room melting into chaos, but when I looked down at my own hands, they too were deforming and blending into the chaos of totality as the molecules of my body appeared to be melting into the disintegrating matter of the universe. <br>Instantly, I bolted upright in a panic. 'Oh my God!, I screamed and fell face down onto the ground. I was fucking scared shitless, I thought surely I was going to die this time, especially since the intensity of the trip came on so fast and so fucking hard! In my panic, I was preparing myself to touch God and on some level, I believe I did. Fear can do some fucked up things to your head! I was still tripping after about seven minutes and finally hit baseline around twelve minutes. I couldn't believe what I had just experienced. It's so hard to describe in words the experience of the Toad. I have never soared to such inner depths of my mind and space. I felt that I was teetering on death's doorway and the experience completely overwhelmed me. Toad IS the MYSTERY. What a wake up call.\n\n\n"
}
