{
 "title": "Soma and the Divine Lady Have a Night Out",
 "author": "Silver_Strigoi_Vii",
 "citation": "   Silver_Strigoi_Vii. \"Soma and the Divine Lady Have a Night Out: experience with Amanita muscaria & Salvia divinorum (ID 21762)\". Erowid.org. Sep 19, 2005. erowid.org/exp/21762",
 "substance": "Amanita muscaria & Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 g",
   "oral",
   "Amanitas - A. muscaria",
   " ",
   "  T+ 3:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21762",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 19, 2005",
   "Views: 9360",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First of all, around 2 years ago, I began to feel a strange energy around me all the time, and it's become very hard to explain this to people.  Only when I read stories of shamanism, and the famous Castenada books that I realized that there is a world beneath this one, and one beneath that one, and so on.  I took it upon myself to use these energies and tap into the different shamanic channels of the universe.  I'm not really a drug user as I believe in spiritual mind expansion, not partying.  I smoke a certain 'herb' for prayer and for making music, and that's about it.  Other than that, I've experienced amanitas alone before in the same dosage with some pleasant effects (nausea was a little annoying), salvia divinorum in her most amazing/terrifying moments, and have had one experience quite some time ago with 'magic' mushrooms as well.  That in mind, here we go.....</p><p>The night started out around 7:00 when me and 2 other friends each ate 10 g of amanita mushrooms...  about 2 hours later, we started feeling the effects (mostly nausea) so we decided to smoke some herb around t+3:00 to kill the nausea, and it most definitely worked.  Each of us seemed to be coming up in our own way.  As usual with amanitas, I felt the feeling that I was beginning to crawl inside myself.  My body is just a vessel carrying my spirit through a sea of energy almost like an invulnerable shield.  I decided to test this shield by picking a friendly fight with my roommate...  yup!  that worked!  didn't feel a damn thing, and he's still lyin' on the ground.  lol  the power these things give me is pretty awesome when I channel it.  </p><p>Around T+ 4:00 we all sit down with the 3 footer and decide that it's time to welcome lady salvia to the session.  We each took around 2 full 3 footers of just the regular leaf.  I still don't know what everyone else saw...  my experience is as follows....</p><p>*HIT*  5 sec.......not feelin' anything</p><p>-10 sec.......not feelin' anything</p><p>-30 sec........nuthin'....hmmm..  is the leaf gonna work?</p><p>-1min....oh yeah here it comes!!!!!!</p><p>In a single moment, the floor dropped from under me, and reality itself started sliding down, and pulling me with it.  We just keep falling down and down and down as the universe pulls itself apart around us...  by We, I mean the lady and I.  She has wrapped her arms around me in a loving embrace as we fall together.  She is not terror as she was before, but now she is a warm comfort that is somehow protecting me from the fall.  She sets me gently down as I feel her grace slowly slip away....  </p><p>*important info*  Salvia only usually lasts about 3-5 min depending on dosage...  Salvia on Amanitas lasted about 20-30 min even with a low dose!!!   </p><p>.....I feel like I'm at baseline again and I start telling my fellow psychonauts about what just happened, when she wraps her arms around me again and pulls me back into her warmth...  I'm not entirely sure, but I think at that point I just fell back onto the floor and laid there laughing and squirming with what my friends said looked like pleasure...  and it was!  Waves of laughter rolled over me like never before, and as before, I once again returned to baseline.  However, as I lay on the ground of my apartment listening to Steve Miller, Steve starts singing 'the ants are coming!  the ants are coming!!' ...at that point an infinite number of ants came and carried me away piece by piece through the wall and into nothing.  This was not terrifying for some reason as salvia usually is.  This was utter bliss, which is somewhat of a shock considering salvia normally bitch slaps me and rips me from reality like velcro.  After about two more weaker waves, I was finally back to normal...  or amanita normalness at least.  The rest of the night was spent recovering from our journeys, relaxing with some herb, and eventually a deep and wonderful sleep.</p><p>Salvia is a very powerful ally, and if you treat her like a bitch, she will make YOU the bitch.  If you accept her, and go to her with good reasons, however, she will reward you heartily.  Furthermore, I think that salvia and Soma form a very synergistic pair when approached with respect and knowledge.</p>"
}
