{
 "title": "Cardiac Arrest",
 "author": "WhiteSand",
 "citation": "   WhiteSand. \"Cardiac Arrest: experience with DXM (with CPM) (ID 21760)\". Erowid.org. Mar 3, 2003. erowid.org/exp/21760",
 "substance": "DXM (with CPM)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "810 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 21760",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 3, 2003",
   "Views: 10015",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOk. So, yesterday me and 2 of my friends decided we were going to take some DXM from Corricidin and then go to the Water Tower mall in Chicago.\r\nI am 18 years old and have taken them many times before, and have experienced several mind blowing trips.\r\nEventually I began to grow a tolerance to Corricidin and the old 8 pills just wasnt enough. I had seen one of my friends go to the hospital when he took 42, I had taken 32 that day and tripped very hard. But yesterday was the renewal of this drug as we havent done it much since the hospital incident.\r\nMy friend 'J' took 27 and within 10 minutes was immobile. I went to the bathroom while he sat in a chair at the Water Tower Mall. When I came back with my friend 'T' we had seen that 'J' had vomited in the garbage can and was almost ghostly. We had each taken 27 and I knew that I'd be fine. 'J' however slowly went further and further from life. He sat in the chair and began to just look creepy, and people began to question us about his condition.\r\nAt this time his roomate came to his aid as me and my friend were having the trip of our lives. As we walked around the mall tripping we noticed more and more police. We went back to see that 'J' had needed an ambulance.\r\nHe is now in the hospital and had many seizures and went into cardiac arrest. Me and my friend were fine, apparently 27+ is a ridiculous dose as I have been reading experiences of only 8 all over [drug experience websites on the internet].\r\nRight now I don't know if 'J' is alive, but I know hes in intensive care.\n\n\n"
}
