{
 "title": "Oh,  That's East ...",
 "author": "Egotripper",
 "citation": "   Egotripper. \"Oh,  That's East ...: experience with AMT (ID 21806)\". Erowid.org. Jan 25, 2008. erowid.org/exp/21806",
 "substance": "AMT",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   "  T+ 6:00",
   "1 tablet",
   "oral",
   "Caffeine",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21806",
   "Male",
   " ",
   "Not Given",
   "Jan 25, 2008",
   "Views: 8745",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Its T + 14:20 and I managed to pull off a less than spectacular trip on 25mg of AMT.  How did I manage to not enjoy myself on a drug whose claim to fame is its guarantee of a good time?  I tried to control it, and it taught me a lesson.</p><p>Dont get me wrong; I didnt have a bad trip.  Ive experienced what I would consider the worst kind of trip possible on a 9 gram dose of morning glory.  No, it was more like just a flat-out bad day.  Let me take you through my experience so that you dont make similar mistakes.</p><p>Inspired by a few reports I read raving about the benefits of an early morning solo trip, I got it into my head yesterday that I would dose at 6AM this morning.  Its important to note that Ive taken AMT twice before and both times were at this same dosage.  Both of those times I had done it with friends and had an excellent time.</p><p>Last night I had a calculus test at 8PM (Im a first year college student).  I was fatigued, and prior to the test I took a caffeine pill.  Im not a regular soda or coffee drinker and that kind of dose was enough to keep me up until 4AM.  Being the stubborn (stupid) kid I am, I decided against putting off the AMT trip until later in the week because I figured the speedy effect of the AMT would counteract my lack of sleep.  I woke up at 6AM, hopped out of bed and drank down the small amount of powder in a glass of OJ.  </p><p>30 minutes later I was buzzing pretty hard and my eyes were dilated.  Some people refer to the come-up on AMT as a roll on X, but for me it seems like the onset of X.  I never get to that point of really rolling.</p><p>I looked up on the web that the sunrise was at 7:10, and since Im usually not up at that time, I decided to walk ¼ mile or so to my car (it was really cold out and I wanted the heat), which was sitting out in a parking lot.  This would give me a good view of the sunrise and an opportunity to smoke a cigarette, which I love to do on this substance.  At 7:20 I was sitting in my car and I noticed that it was pretty light outside already, but the sun was nowhere to be scene.  A couple seconds later something caught my eye in the rear view mirror.  It was the sun.  I had been looking out to the west and missed the sunrise.  I am truly a dumbass.  </p><p>Well, that was depressing.  I listened to some tunes out in the car and noticed that I felt pretty epithetical but depressed.  I also began to feel some nausea at this point.  I got back to my room at around 8 and watched some TV, making sure to keep myself hydrated.  I then listened to some music until around 11, when the visual part of the trip kicked in.  </p><p>I had some blurred vision, noticed that the carpet would roll in waves if I watched it long enough and had very very mild though shroom-like closed-eye visuals.  Probably the most fun I had all day was looking out of my window and letting the bright outdoors burn an image onto my eye.  Then, by closing my eyes very tight and then releasing the tension, the color of the afterimage change.  I dont know how to explain it but it was extremely beautiful.  I was also having periods of uncomfortable hot and cold sensations and my teeth felt odd in my mouth like they were extra-sensitive.  I started to feel very, very tired, something that never happens to me on AMT.  I went against every bit of good judgment I possess and took a caffeine pill.</p><p>At 12:30, peaking, I decided that I was up for going to my only class of the day, which happened to be calculus.  I got my exam back to discover that I received a good grade, which normally would have made my day, but was indifferent to it.  I walked home and spent the rest of the afternoon chatting with friends on the net, uncomfortable, bored, nauseated, worn out and spacey.</p><p>Why am I writing this now you ask?  Well, I supervise a computer lab on Tuesday nights.  Thats right  I didnt even consider how I would feel working an 8 to midnight shift, completely cracked out from no sleep and coming down from AMT with horrible jaw pain that just set in.  BLAH!  </p><p>Things I learned:</p><p>*Take AMT when I have 18 hours of free time open in my life.</p><p>*Take AMT with my friends.</p><p>*I shouldn't try to control the experience.  If its not the right time, its not the right time.</p>"
}
