{
 "title": "Stoned Beyond Belief, Too Scary to Enjoy It!",
 "author": "Zilch",
 "citation": "   Zilch. \"Stoned Beyond Belief, Too Scary to Enjoy It!: experience with Cannabis (ID 21809)\". Erowid.org. Dec 8, 2005. erowid.org/exp/21809",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "10 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21809",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 8, 2005",
   "Views: 7330",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been tokin' for a little over year now, I wouldn't call myself a pothead, but I usually find myself high almost every weekend.  Before my unfortunate experience, I had only smoked out of a home made water pipe (hookah).  I had been pretty stoned before, but NOTHING like what I had experienced that night...</p><p>It had been a normal saturday hanging out with friends, jamming with my band, overall a nice and relaxing day.  My friend 'M' called and asked if I wanted to smoke some pot out of his newly purchased virgin pipe!  So, looking forward to a pleasent evening with mary jane, I decided to indulge.</p><p>I met my friend at our usual meeting place, and promptly sparked up a bowl.  I must have not been paying attention because I smoked for what seemed like at least 10 minutes, I mean, I must have taken 8-12 huge hits out of this pipe.  (My friend had packed the bowl ridiculously tight), the thing was still going strong after 10 minutes!  \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>After it was done, we got into my car (after this experience, I will never drive stoned again), and proceeded to pull out of the driveway.  Within a few seconds of driving, time suddenly stopped.  I could almost hear it slowing down.  I managed to get out a 'What the----?' as the next wave hit me.  My vision slowed down so much that it looked as if I was only seeing about 1 frame per second.  </p><p>I felt these tight and intense waves shoot through my entire body.  These waves were so strong, that it actually hurt to experience them, I literally felt like every nerve in my body clenched as tight as a fist, and let go in a huge wave.  My back arched, and I just started to shake, (all while driving, mind you).  </p><p>'Dude' I said to M, 'I can't drive, I seriously cannot drive, I gotta stop'.</p><p>Luckily we were only about a mile away from M's house.  The time warp seemed to get more intense, and I was absolutly gripped by terror, as I realized that I was no longer able to function by any means.  This wasn't normal, this wasn't right.  I kept looking at the speedometer, and the road, back and forth, back and forth for what seemed like hours.  After a few confuzing traffic lights, and driving through town, we arived at M's house.</p><p>He said something, I dont remember what, and left me in the car.  I had NO idea what was going on.  I stared out of the window in the car, and for a period of a few minutes, I was lost in a stunning pink pixelated universe, with hazy white stars everywhere.... Then when I snapped back into reality (kinda), I was shocked to see that I was in my car, looking at the door panel.  Tears welled up in my eyes, and I started praying to God that he help me out of this hell.  (I have never prayed before).  This was well beyond the normal mind-wandering effects that marijuana usually has.  I was BEYOND stoned.</p><p>I noticed that my whole body was vibrating, and when I focused on it, I realized that I was actually shaking, quite violently.  Strange visual pleateaus and vast colored spaces just flowed out of my head, and I could feel myself getting more stoned by the minute  (This was probably only T + 10 minutes since we stopped smoking).  </p><p>After quite a long while, my friend came and opened the door, 'Dude' he said 'Are you alright?  Im not that baked at all.'  He then managed to get me out of the car, and I ended up in his car.  I remember telling him to slow down as we drove to get some food.  My shaking became more violent, and my friend kept asking me if I was alright.  I would just shake my head in a rythmic pattern, and zone in and out of oblivion.  My mind was flowing too fast and I was trying to keep track of all the visual worlds.  The clenching numbing waves hit so hard that I thought that I was going to black out.  My teeth and mouth hurt.  I don't remember too much of the ride.</p><p>During this time, I aparently made phone calls to the most random people in my phone directory, I vaguely remember leaving a voice mail on another friends phone.  When we listened to the message later, it was very odd.  I said, and I quote: 'Im sooooo stoned, everything tastes like rain in texas......there are a million worlds at the same time.' </p><p>When we arrived at the resteraunt, my friend went in, and left me in the car, because I was absolutely freaking out.  I kept telling him that my teeth hurt, and that my tongue was melting.  The intense numbing waves kept shooting through my body, and were starting to get annoying.  I sat in the car, and zoned out, thought about alligators and girrafs for some reason, and realized that I was seeing a million large square overlapping pixels per second, and that within them was the past, present, and future.... Normally this would be beautiful, but I was flipping out, and feeling very disconnected and numb.  All I wanted to do was lie down on a couch in a safe place.</p><p>Eventually I made my way into the resteraunt, and got some food at the buffet, although I was extrememly paranoid, and thought that everyone was looking at me.  For some reason I felt like I was in the African Savanah, and I have no idea how I was able to put food on my plate, and return to my seat (I was that gone).  I was absolutely convinced that we were going to get busted or get hurt, or I was going to pass out.  My legs were still shaking violently, and I was still seeing at about the rate of 1 frame per second (granted each frame had those 'million pixels'..... yeah, who knows, I was STONED to oblivion).</p><p>I ate ALOT of food.</p><p>We drove around some more, listened to some music, I really don't remember much.....  Honestly, I think I was too stoned to enjoy, being stoned, and I was paranoid as all hell! Came down at a coffee shop, things started to make more sense, and I was feeling one hundred times better, and I found it VERY enjoyable to be feeling back in reality again.</p><p>Overall it was an interesting experience, I think I started the 'trip' badly, by freaking out that I couldn't drive.  (I have driven stoned many times before, but I seriously could not function on this ocasion).  I was paranoid and absolutey nutty during the whole experience, my friend, M told me that he had never seen anyone act this way before.  Overall it was an unpleasent experience, but interesting never the less.</p>"
}
