{
 "title": "Everything I Focus On Melts Away",
 "author": "redrum",
 "citation": "   redrum. \"Everything I Focus On Melts Away: experience with 5-MeO-AMT (ID 21821)\". Erowid.org. Aug 2, 2005. erowid.org/exp/21821",
 "substance": "5-MeO-AMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)",
   "  T+ 2:50",
   "3.0 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21821",
   "Male",
   " ",
   "Not Given",
   "Aug 2, 2005",
   "3448",
   " "
  ]
 ],
 "report": "<p>6:30 AM - Ate 3 milligrams of 5-MeO-AMT.</p><p>7:05 AM - Feeling a bit of nausea nothing too bad.</p><p>7:22 AM - Stomach is gassy burps will not stop.</p><p>7:27 AM - Nausea is gone pretty much little body buzz going.</p><p>7:29 AM - Whoa, color just got a lot brighter all of a sudden!</p><p>7:31 AM - Trails have started VERRRRRRY delayed.</p><p>7:46 AM - Intense trials and closed eye visuals.</p><p>7:48 AM - The joy of a smile is all one can ever want. :P</p><p>7:52 AM - So much better than AMT more focused in tune with movement.</p><p>8:20 AM - At a bit of a plateau maybe peak I dont know its still great.</p><p>8:23 AM - Visuals kind of fading but believe from lack of stuff to do other than sit at a computer at the moment.</p><p>9:20 AM - Ate three more milligrams!</p><p>9:52 AM - Everything I focus on is melting away feels like I am underwater its very relaxing.</p><p>2:06 PM - I decide I will never do this drug again without knowing for sure no one is going to show up at my door that I dont want here. I forgot all about an old roommate that was coming buy and he was trying to find a car part. He had left here he also brought two of his friends with him witch is not cool the guy was ok and polite but his girlfriend was very  how do I put this  snooty. When she walked in the first thing she did was make a face and stare right into my eyes with the expression, WTF are you on? So I quickly turned away and let them look for the part they tore up my big closet looking for it. I was too incapacitated to look for it but I was still walking around looking for it after they left I was like totally stressed out and wanted not to trip anymore because I was full of bad vibes. I ate two downers and was awaiting them to kick in so I would at least not be feeling so bad.</p><p>2:50 PM - I decide to take a few nitrous hits and see if I can get ride of nasty feelings it works and brings back melting a bit and trails but I am totally worn out and decide to just chill and listen to music.</p><p>3:31 PM - Back to a smooth ride no problems.</p><p>5:50 PM - Coming down decide to go to sleep.</p><p>10:22 AM (next day) - Awoke from sleep refreshed.</p>"
}
