{
 "title": "Aural Cleansing",
 "author": "Arjuna",
 "citation": "   Arjuna. \"Aural Cleansing: experience with Ayahuasca (B. Caapi & P.viridis) (ID 21836)\". Erowid.org. Mar 6, 2003. erowid.org/exp/21836",
 "substance": "Ayahuasca (B. Caapi & P.viridis)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "30 g",
   "oral",
   "Psychotria viridis",
   "(tea)",
   " ",
   "30 g",
   "oral",
   "Banisteriopsis caapi",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 21836",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 6, 2003",
   "Views: 15187",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>     Ayahuasca had intrigued me, so I decided to make a batch. I did so by mixing 30g of crushed P.virdis leaf and 30g crushed B.caapi in a pot with approx 12oz of lemon juice to aid in the extraction of the active alkaloids. After an extraction process I ingested the home brew. </p><p>     I was skeptical as to whether or not the extraction would work, but I forged ahead. After reducing my half gallon of fluid to a manageable 12 ounces through a process of boiling, I decided to drink it down.</p><p>     The taste alone was enough to make one vomit; I feel that I may have used too much lemon juice. The bitterness of the lemon juice mixed with the earthy and viscous taste and texture of the brew made me gag. I was able to get about 8oz or so down, and proceeded to wait. At about T+0:30, I had an experience that was both terrifying and amazing. I began to feel uncomfortable and nauseous, so I thought it might be a good idea to go to the bathroom. Within the next 10 minutes I was projectile vomiting like I never had before. I drank the huasca on an empty stomach, so I was amazed with what came up. Mostly the vomitus was just the undigested black and viscous huasca, but the second round could have only been food that could have been stuck to the lining of my insides.</p><p>     In between bouts of vomiting, I had diarrhea. My entire digestive tract was being scrubbed from the inside out. The vomiting and diarrhea lasted about 15 - 20 minutes. After this subsided, I had felt like years of toxins and unhealthy food had been flushed from my body. Between T+1:00 and T+1:30, I leaned up against a couch in my friend's apartment, experiencing the most powerful and intense CEV's I had ever seen. The patterns were of a fractal mandala fashion; bright yellows, golds, and whites flowing in a moebius band fashion; spiraling around one another and divided into four quadrants like an x,y plane. By T+3:00 most noticeable effects were gone, with a minor abdominal pain. The next morning was like any other, no significant hangover. The experience left me cleansed, both spiritually and intestinally.</p><p>     This is an entheogen that I would certainly not consider recreational. Ayahuasca is more appropriately referred to a medicinal. If you feel your body and mind may need a good cleansing with some energy from the Amazon, this may be a way to go.</p>"
}
