{
 "title": "Still Feel Minor Effects After 6 Hours",
 "author": "smokey",
 "citation": "   smokey. \"Still Feel Minor Effects After 6 Hours: experience with Cannabis (ID 21851)\". Erowid.org. Nov 13, 2004. erowid.org/exp/21851",
 "substance": "Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21851",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 13, 2004",
   "Views: 6350",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Earlier today I bought a gram (sativa-domintant strain) half/half with a friend, B. This was the start of one of the most intense cannabis experiences I have ever had it would be my first time hitting a gravity bong, i was very excited, and prepared to cough my lungs out...</p><p>B stuffs a tiny snap into the bowl, and lights the bowl while pulling the bottle up. I push down on the bottle and feel my lungs fill up with the thick smoke</p><p>* cough *</p><p>I blow the huge hit out, not holding it in more than 2 seconds because it was so bigI sat back and waited for B to take his hitthe effects were already noticeable , and quite strongafter B took his hit he loaded a bowl for me, and I hit itthis time it took 2 hits to clear it, and I could hold it in a bit longer. I blew out the smoke.</p><p>I see out of the corner of my eye that B is loading up his second hit, but I cant move. Some sort of emptiness came over my body, like my muscles werent there. I couldnt feel anything but empty space I kept saying to myself snap out of it, if I dont, I wont be able to moveit was really hard but I finally moved, and realized that I had to keep moving around or Id get stuck again. Keep in mind this was only 3 hits</p><p>B loads my third (and final) bowl, and it takes me 3 big hits to clear it, holding each for about 5 seconds. I sit down, my lungs aching from all the smoke.</p><p>Okeverythings ok here, Im finemy head is hollow, where did my brain go? There it is, behind my eyesare my eyes burning? Its because there are so many colors in this roomeverything keeps bending, and movingbetter stand up, I have to get homewait, I cant stand up, I cant movemy limbs are now a part of the surroundings, and I am a part of his bedroom. Wait, oh yeah, I just smoked some bud, Im just high, thats right, just high.... </p><p>I say bye to my friend and am on my way home.</p><p>Half-way up the hill I feel my legs burning, like they are about to fall off. I try to just ignore it and keep walking. suddenly I am locked in a repeating motion, over and over againleft foot forward, right foot forward, arms swing, cant stop, im going too fast now The feeling of helplessness grows; I can do nothing but walk, faster and fasterI never slow down, I couldnt if I wanted toI cant feel my legs anymore, but I can feel my feetwhere did the ground go? Im floating now, nothing around me.</p><p>Faster, faster, I kept walking till I was practically joggingI stop for a secondor was it 5 minutes, I dont know</p><p>ok, time to walk again walkingits hard to keep up a steady pace; Ill walk fast then slow, then fast again, then nearly stop Finally I approach my house, but right as I get to the front yard, my mom is backing out of the garage she says she is going to the store and asks if I want to come. I somehow mumble the words no thanks and go inside. I lock my door behind me and sit down at the computer</p><p>my vision is meltingthe computer screen is the only thing that is real, everything else is just a hologramthe computer screen is popping out, coming closer to my face Ok Ill lay down insteadsinking into bed? No wait, there is no bed, I am floating, higher and higher</p><p>This goes on for an hour, very intense, before I start to come down a bit. By 2 hours later, I was in an average high, and 4 hours later, I was basically back to baseline however, some lingering effects stuck around. I am writing this 6 hours after I smoked, and I still feel minor effects.</p><p>This has been by far the most high I have ever been off such a small amount of cannabis3 small bowls, and I felt like I was on acid or something.</p><p>At some points you could say I was too high, though I usually dont think there is such a thing hehe</p><p>I find gravity bongs are the best way to get really high off very little weed.</p><p>Peace</p><p>LEGALIZE</p>"
}
