{
 "title": "The Ugly Effect",
 "author": "Zara",
 "citation": "   Zara. \"The Ugly Effect: experience with 2C-B (ID 2185)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2185",
 "substance": "2C-B",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 2185",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2000",
   "Views: 6663",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDOSE : ~15 mg 2cb powder <br>Method : Mixed in water <br>Setting : Home <br>Intent : Sexual <br>Mood : Happy, Relaxed, Well-Rested<br>Onset : +15 minutes Peak : +45 min - +2 hrs Duration : 5 hrs After Effects : 3-4 hrs<br>One fine Saturday afternoon, while lying around in bed, my partner and I decided to try 2cb with the intention of experimenting with it's effects during sex. Being particularly sensitive to many substances I chose a dose of 15 mg...and in a happy and relaxed state we carefully measured our doses (+/- 2mg).<br>We were in the middle of watching Quo Vadis, one of those 3 1/2 hour 50's epic bible story type movies. After about 15 minutes I started to feel the effects of the bees and soon chose to turn off the tv...as it started to be quite confusing. Within 15 minutes of feeling the first effects, I started to have extremely strong visuals...some of the most prominent I've ever had. <br>A visit to the bathroom yielded a towel that was actively growing from every stitch. 'HEY...you've GOT to see this! Look at this towel! Every little bit is moving!' I'd heard people mention this sort of visuals before, but had never experienced them myself. <br>But almost immediately, the rather cool constantly shifting visuals were joined by a sense of utter ugliness. Everything around me was dark, disgusting, and dreary. Flat, 2D, black and white, cluttered. There wasn't a mental sense of these things being ugly...but an almost overwhelming visual appearance of UGLY. <br>About this time (+1 hr) we decided to go outside to see if perhaps the UGLY wouldn't follow. Outside had a bit less of the ugly feel. The trees in the sun were nice, and the 2 cats were beautiful moving oasises in the otherwise jagged world of UGLY. But we quickly decided to return inside for warmth and security.<br>The uglies had at this point been joined by a refracting filter causing everything to be broken into sliver shaped pixels. The combination was no better. Once back inside we wandered about hoping it would end quickly so we could go on enjoying our evening. Upset stomach, hacking cough that hadn't previously been there, cold, ugly. Stand up, sit down, cough, pee, wait.<br>Finally things calmed enough to sit down and turn on music. Some Deep Forest helped a bit. Closing my eyes got rid of the uglies and I was able to enjoy the music. Occasionally I'd open my eyes, look at my partner and think...gee he looks really shitty today...kinda sick and pale and sometimes rather like a troll or something. Then I'd close my eyes and go on listening to the music. <br>Interestingly, the uglies didn't upset me too much. They were irritating, but I remained in a mood of jovial annoyance. I didn't particularly enjoy the experience, and it certainly wasn't sexual, but no harm was done.<br>I lasted out the rest of the effects with some aural enjoyment of the enhanced Deep Forest...then gladly went back to watching Quo Vadis 6 hrs after turning it off. \n\n\n"
}
