{
 "title": "A User's Manual",
 "author": "Amason",
 "citation": "   Amason. \"A User's Manual: experience with 2C-B (ID 2187)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2187",
 "substance": "2C-B",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "1995",
   "2187",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 27, 2000",
   "12784",
   " "
  ]
 ],
 "report": "<p>The 'nexus' that is available here comes in two forms: small yellow capsules, and small red/purple pills. I have only tried the yellow capsules, and believe them to be 2C-B. The effects *are* subtler than LSD (my main point of comparison), IMHO, but are still very noticable. One thing about 2C-B is that it is very dosage dependent, and can vary >from very subtle to mindblowing. The yellow capsules are supposed to contain 10mg each, although I suspect less.</p><p>On one capsule, the effects are quite subtle, as one would expect from 10mg of 2C-B. Slight rosy tinge to things, feelings of warmth, empathy and sexual attraction. Vague psychedelic look and feel to things, particularly music.</p><p>On two capsules, things get more hectic, and vary between a fairly wasted and very laid back feeling at first and when you sit down, and a sharp, clear, psychedelic feeling when you do things. The degree of sharpness seems proportional to the extent to which you are active, and the change from cloudy to sharp can be so sudden and dramatic that you feel as if you are on a different drug.</p><p>On two capsules, you also get psychedelic type hallucinations, such as patterns on things, distortions of time, and very intense colours. But these hallucinations are not generally as intense or as obvious as those of LSD, which is why I would say that Nexus is more subtle at these doses. Occasionally when dancing I have been totally immersed in hallucinations as happens with LSD, but not very often. Dancing generally feels good, and you groove on things in the same way as on LSD.</p><p>I would say the most noticable difference between LSD and Nexus is that LSD tends to 'twist' things, so that perfectly ordinary things can seem very scary. Nexus seems to enhance things, but without adding its own paranoid edge. Rather there is generally a feeling of well-being and of empathy with other people. In that way Nexus has been likened to MDMA, but it's different in that you don't feel unnaturally happy all the time, and you don't love people regardless of their characteristics.</p><p>Another thing which is different from LSD is that feelings of sexual attraction seem to be enhanced, more than on LSD. You start to see the attractive qualities in people who you would normally not be attracted to, and people who you would normally be attracted to - hooboy! This all seems to be part of the primal, social, empathic qualities of Nexus.</p><p>On three capsules, I felt very wasted for much of the time, to the extent that I felt uncomfortable. My eyes kept closing, and I had trouble concentrating on things. The urge to lie down was very strong. This feeling passed when I started to mission around and dance, and I think that if I had not been sitting around, I would have had a very different and probably very cool time.</p>"
}
