{
 "title": "The Secret",
 "author": "Divine Rascal",
 "citation": "   Divine Rascal. \"The Secret: experience with 2C-B (ID 2188)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2188",
 "substance": "2C-B",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1995",
   "ID: 2188",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2000",
   "Views: 6435",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI seem finally to have gleaned the secret of 2CB. I am happy! I took 30 mg of 2CB and began listening to The Platters and reading my etext version of the glorious tale by H.H. Kane called 'A Hashish-House In New York'. The room was darkened, and as usual rhymth came naturally. As I read on, through the hashish entry in 'Johnston's Chemistry of Common Life', the nature of the drug suddenly dawned upon me. As thee might have guessed, I am still under the influence of the slightest 2CB tinge. With music and happy thoughts, a darkened ambience and some nice company perchance, 2CB easily places one within the respite one seeks. But that's as far as it goes. No visions are imminent, save, perchance, after prolonged usage. The mind naturally wanders to heavens oriental. 2CB seems to act as an expectorant, and the lingual sensations are transformed into flavours of hashish, plants and things oriental. The fifth circuit is activated, and one is given free to float on waters serene. It requires practise. As was written of hashish in 'Johnston's Chemistry of Common Life', 'it requires, indeed, a long and gradual training to its use before its boasted effects can be fully experienced, and this fortunately is not attempted yet in Europe. While in Jerusalem, M. de Sauley, with the view of passing pleasantly a tedious evening, indulged himself in a dose of haschisch, which, upon his uninitiated constitution, produced only unpleasant results.' I am given to the supposition that I was of this exact nature. I was the 'uninitiated westerner', and my drug experience had been very limited indeed. It is an enterprise requiring practise. And thus, gentlemen, I will leave you as I retire in the final hours before dawn.\n\n\n"
}
