{
 "title": "Dramatic Effects",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Dramatic Effects: experience with 2C-B (ID 2190)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2190",
 "substance": "2C-B",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "1979",
   "ID: 2190",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2000",
   "Views: 6205",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ah, the memories this brings back. I was at Reed in 1979, and bromo was plentiful and popular at Reed at that time. The descriptions of its effects that I've read on this board are, I would say, rather accurate. The effects are different, and more dramatic, than LSD.</p><p>At the time, it was usually sold in single dosages in clear gel capsules. I didn't snort it (I didn't care for the pain), but found the effects to be most effective when eating it as well. I ate 3 capsules one night when I was bored, and had the most earth-shattering experience of my life. Hallucinations were so intense that I could not recognize people and could not understand what they were saying. I saw spinning pinwheels made of knife blades reflecting all the colors of the rainbow on the walls. I thought I was shivering from cold at one point, and remarked as much to a friend of mine (this before I was hallucinating so heavily that I couldn't recognize or uderstand people). He told me I wasn't shivering at all; I realized he was right, and the sensation that I was shivering suddenly changed to a sensation that I had powerful electrical energies pulsing through my body.</p><p>I had many more bizarre experiences that night (including a mild panic when I thought I was moving backward in time), but I don't want to drone on here. Suffice it to say that the drug is real, and the descriptions of its effects on this board are not exaggerations.</p>"
}
