{
 "title": "Friendship",
 "author": "RPTown",
 "citation": "   RPTown. \"Friendship: experience with Cannabis & Tobacco (ID 21913)\". Erowid.org. Sep 24, 2007. erowid.org/exp/21913",
 "substance": "Cannabis & Tobacco",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:00",
   "4 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "21913",
   "Male",
   " ",
   "Not Given",
   "Sep 24, 2007",
   "2903",
   " "
  ]
 ],
 "report": "<p>I'm a somewhat experienced pot smoker. I smoke pretty steadily at around once a week, for maybe a year now, and I dabbled in and out before that. But the other night simply showed me how important friends and setting are to my stoneage. It's not just what I smoke that makes the experience, it's who I am with. I'll try to make it as accurate as possible, so here we go. It all started one odd day out of the week after school. There was a wrestling match that night at our school, and me and a few friends decided to go to the match and then smoke in the woods. I wasn't totally sure that we would be smoking, so I decided to smoke a little beforehand.</p><p>(6:00PM) I have a little ritual. I go into my bathroom, open the window, and turn on the shower and some music. After smoking to my heart's content (probably about 2 tight bowls of moderate pot), the water vapor/pot smoke simply is wafted outside with a generous helping of air fresher, and some visine in the eyes. Very effective, but somewhat off topic. At this point, I was blasted off my ass. I started seeing the most random things - I pictured my entire world as a discovery channel exclusive. I saw close-ups of things around me, and then zooming into them, and me narrating how the chemical/physical reactions took place, all in my head. It was really strange though, I saw the actual cell reactions taking place, I even pondered if this might be the actual things taking place and not my THC-induced state just playing with me.</p><p>(7:00PM) It's time to leave to go to the match. I bring my little torch lighter, and a bit of pot just in case. My friend was bringing his pipe, so it was all good. I get there, and I was the only one high at this point. My friend has brought his pot, so we stir up a beautiful party mix between the two of us, and get ready to smoke about 4 tight bowls between us. I'm being my normal high self, lots of laughter, etc. I'm usually a clown but when the herb is added to the picture I'm a comedian. At least thats what I think. There was ice on the sidewalk, so I am literally STRUGGLING to get across the ice without falling, but I do it. The visuals are gone now, but the body high is on me like a blanket. I tend to enjoy visuals a lot more. They are a lot more interesting. Anyway, we get to our usual smoking spot in the woods, on a little wooden bridge. We all sit, and since only me and my one friend were smoking out of the four of us, we begin to pass the bowl between us.</p><p>(7:45PM and 4 bowls later) Wow. This is a different feeling. It's almost humbling. I'm still laughing, but I've passed the point of High, and gone onto a different state, of oneness with myself, my environment, and love for all of my friends. I notice their personality so much more, and everything about them seems to just be a piece of puzzle into my life. It's so perfect, but so cool. We're hungry, and fellow stoners work at the pizza place, so we walk there to get a calzone or something. I'm engaging in conversation on the way that just seems to go deeper and deeper, and just becomes more and more 'right'. We were talking about how good pizza was. Looking back on it, I realize how much getting a calzone with a good friend really means.</p><p>(8:30PM) We made it to the pizza place, and this is the best place to be, especially with really visual pot. I'm still feeling one with myself and my surroundings, but now its gotten more playful. This pizza place, like many others, has lots and lots of bright colors and cheap food. There's a little arcade, and stoners work there, and most of the people that go there ARE stoners, so its a safe environment to talk about your experience. We just sit to compose ourselves for a second, and my friend looks at me and says, 'Bro.. I'm tripping so hard right now.' and giggles hysterically. This triggers a huge amount of laughter in me, and both of the non-stoners that are there watching also respond in laughter. 75% of the best experiences I've had with pot have been at this pizza place.</p><p>I walk up and get a huge calzone for 5 bucks. All four of us split the calzone, and the non-stoners didn't finish theirs. We immediately grabbed their left-overs, after a puppy dog face. For some reason, this all felt so right, and I immediately began picturing us in one of those cheesy movies, where we are in slow motion and soft instrumental music is in the backround. My mind is a very powerful tool when I am high. I immediately begin having auditory and visual hallucinations where this exactly happens. Everything is in slow motion. I hear music, and I can't understand what people are saying, including myself. I am responding fine to my friends, it is almost as if I was out of my body and I was looking down on it having this experience. After what seems like about 20 minutes of this, I snap back into it and we go back to the school to wait for our rides.</p><p>(9:30PM) The non-stoners have left, so it's just me and my friend. We both have a couple cigarettes, and just relax and engage in some real meaningful conversation. The high is starting to wear off, but this oneness, it is still there. Even to this day, about a week later, I feel it, as strong as ever. It's like I know my place now. I know the way I work in this circle of life. It's a natural high, and I don't need pot to replicate it, but I thank the wonderful herb for helping me attain this inner peace. I tell my friend about this, and he seems confused. Can't expect a cat to understand a dog I guess. His ride comes, and mine comes soon thereafter. I am comfortably high until I go to sleep, and wake up the next morning completely refreshed, relaxed, and happy with myself. What a great night.</p><p>From this journey I had, I learned one valuable thing. Friendship. I've smoked a lot by myself, and a lot more than I had smoked this night, and didn't get even close to the intensity of this high. Friends make your high so much more interesting, fun, and even spiritual. It was because of my friends that I've reached this inner peace I hold now.</p>"
}
