{
 "title": "Panicked",
 "author": "misty",
 "citation": "   misty. \"Panicked: experience with 2C-B & DXM (ID 21944)\". Erowid.org. Nov 4, 2004. erowid.org/exp/21944",
 "substance": "2C-B & DXM",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "480 mg",
   "oral",
   "DXM",
   " ",
   "  ",
   "insufflated",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 21944",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 4, 2004",
   "Views: 11373",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just got out of the ICU at the hospital. Friday night I took 480mg DXM and then snorted some 2C-B, I guess I snorted too much. I vomited the DXM and I felt fine, and I started tripping harder and harder and I tripped so incredibly hard. The synergism of these two substances was absolutely amazing, it's like a whole new drug, not DXM and 2C-B combined. It was more intense than anything, and it was so intense that the physical effects began to take hold. </p><p>After laying on the bed a while, my body felt prickly and tingly  and I felt like I was laying on sandpaper. I started to fade away like I was about to sleep. I didnt really think much of this until I realized I wasnt breathing; those effects were from oxygen deprivation. 'Fuck!' I thought and started gasping for breath.  But this kept happening. I'd try to keep my mind on breathing and I would forget and then only begin to breathe when I realized I wasn't breathing. I was suffocating myself. I had a near death experience several times. I felt like I could give up and slip away, and fall into like a sleep. And I really would have died too, of suffocation. </p><p>I couldn't even figure out how to breathe. I was dizzy and I made it across the house and woke up my father, who was pissed but he took me to the emergency room. They stuck a tube down my nose and put charcoal in my stomache, gave me IV's, and measured my heart rate and whatnot. I stayed in the icu overnight and was released the next day. The DXM gave a false positive for PCP in drug testing.</p><p>It was scary that I came so close to death, I was actually considering not breathing and letting myself die. But I was thinking about how I'd die without ever being marrying or anything, without ever being loved, it made me sad. And I changed my mind and tried as hard as I could to concentrate on breathing.</p><p>The trip would have been amazing if if I wasn't dying. If I hadn't gotten to the hospital I would have suffocated. Now I owe my dad $1000 for the hospital bill. I'm fucked.</p>"
}
