{
 "title": "Tooth Pain Away",
 "author": "Remut",
 "citation": "   Remut. \"Tooth Pain Away: experience with Datura stramonium (ID 22005)\". Erowid.org. Nov 17, 2004. erowid.org/exp/22005",
 "substance": "Datura stramonium",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "buccal",
   "Datura",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22005",
   "Male",
   " ",
   "Not Given",
   "Nov 17, 2004",
   "19089",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the last few days I have had pain in the left molar due to a cavity.  I have a dentist appointment in 2 weeks anyway.</p><p>If I went to eat anythings gummy my tooth hurt and throbbed for 20-30 min even if I washed my mouth out with warm water.  I had been growing a Datura Stramonium plant for about 4 weeks.  It's just a seedling 3 small leaves 1 bigger one at 2 inch stem to tip. With an odd smell to it.  I was reading that people use to rub Datura inside of infants mouth during teething to numb the pain, it sounded good and my pain was nagging badly. </p><p>Picked up the pot (4 inch) and rub the live leaf (still on the plant) inside my mouth just inside my mouth not around the tooth. I rubbed it for duration of about 10 seconds back and forth and then rubbing the other side of my cheek for about the same time. After I was done I was thinking I was going to see things, but nothing trippy happened. For all the plant lover out there (I'm one of them) I did not leave the plant with drool on its leaves. I sprayed my baby with water then gently put it under the grow light again.</p><p>+2-4 minutes - pain is gone.</p><p>+10 minutes - the TV is very old (it has turn dials!) and as I watch it, the waves in it are more noticeable.</p><p>+30 minutes - pain is still gone I went to the bathroom looking for eye dilation found none. But eyes were dry feeling. Mouth had no different feeling but I got a glass of water just in case and I found I drank it all in a period of 10 min and went to get another glass.</p><p>+40 minutes - A little light headiness most likely its just me thinking something is happening.  The cold water I was drinking caused no discomfort on the tooth.</p><p>+70 minutes - pain has returned but very slight almost unnoticeable.</p><p>My opinion due to all the bad trips I've read about did deter me but I was not looking for a psychedelic trip, mostly pain relief. I was glad I was growing it.  I plan on using it for other pains like arthritis, which I don't have, but I've gone hiking for miles and when i get home my knee sometimes hurts.  I'm only 21 years old..I'm sure i dont have arthritis yet.  I do have asthma and I'm willing to try smoking the leaf for asthma relief as soon as i can pick a leaf without hurting my plants.</p>"
}
