{
 "title": "Mental Comfort / Physical Uncomfort",
 "author": "The Fresh Prince",
 "citation": "   The Fresh Prince. \"Mental Comfort / Physical Uncomfort: experience with 5-MeO-DiPT & MDMA (ID 22007)\". Erowid.org. Jul 23, 2004. erowid.org/exp/22007",
 "substance": "5-MeO-DiPT & MDMA",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 line",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)",
   " ",
   "1 capsl",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22007",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2004",
   "Views: 6379",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOver the past year I've had what can be reasonably considered an ungodly amount of Ecstasy with short breaks here and there in between binges and mini-binges. I've had everything from bogus MDMA pills that ended up being other chemicals (from Ketamine to dirty speed / ALWAYS test your pills if it's not from a reliable source) to your average tablet to purecaps. I thoroughly enjoy the effects from a purecap far more than those of a tab, they have a much cleaner, smooth, put-you-on-your-ass effect. One point of this that got somewhat old to me was the fact that it makes me so lazy (too comfortable to want to move) as opposed to your average tab which is far too weak for that effect.\r\nI've also experimented with Foxy (5-MeO-DiPT) roughly a dozen times or so through my friend (his name will be Dr Dernny). Dr Dernny had purchased a gram from another person who ordered it from a research company back when it was an unscheduled chemical. Knowing the almost 'speedy' nature of the chemical (by that I mean the energy surges that you feel throughout your body, which in excess creates a heavy bodyload as well) - I decide to mix it with the purecaps that I love so much, expecting that physically comforting & extremely empathic feeling I can get only from purecaps to mix with the get-your-ass-up-and-move-around energy of Foxy.\r\nMe and Dr Dernny started off the night with shoving this shit up our nose whose taste can be compared to a construction worker's rotten taint mixed with lighter fluid and a port-a-potty but in the form of a white powder... by that I mean we snorted a line a piece of Foxy. From that point my fiance, me, Dr Dernny, and a few others went to a rave where we found our purecaps.\r\nWe munched down the purecaps roughly an hour and a half after chasing the fox, the roll hit quicker than usual and I still had the urge to sit my ass down and try to squeeze every little bit of physical euphoria that I can out of the roll... but the rigidness of the Foxy kept me tense so the 'I'm going to sit right here with my eyes closed and not move, nobody bother me' idea left my head quickly. My fiance, who was rolling and had no Foxy in her, was put on her ass so to keep her company I spent the night sitting next to her however instead of being put on my ass, I was sitting next to her completely tense and rigid but still rolling and uplifted so I didn't really care, I just sat next to her and helped her roll while scoping what was going on around me and chilling, still very empathic.\r\nIt worked out great, it did diminish the euphoria quite a bit but I actually had a much better time than usual, maybe because it wasn't 'the same old thing.' It was exactly what I wanted, the Foxy had done the trick. I have combined MDMA with 5-MeO-DiPT twice, both had the same effect and while I had no hallucinations during the peak, both times when I came home I experienced mild yet very astoundingly complex and detailed hallucinations when I let myself phase out staring at an object. I don't hallucinate from MDMA or a low dosage of Foxy, but the two combined did a little sum-sum.\r\nSome things to keep in mind: Foxy is extremely dose sensitive, so if you were to try the same make sure you have a good feel for what different mg doses would be like so you can judge accordingly. Foxy in low doses will give me energy however in large doses can and will produce an intense trip, filled with hallucinations and the mentality and visuals that everything is boxing me in or crashing on me, not to mention the audio hallucinations for example Dr Dernny said a sentence to me and it sounded like perfectly pronounced well-spoken gibberish.  The more Foxy = the stronger the trip = the heavier the bodyload and uncomfort, so dose carefully according to your goal.\r\nThe two seem to almost contradict each other so I would assume most people would not enjoy it unless you're shooting for the same thing I was or are simply just not blown away by rolls anymore. Tabs would be a good choice for a more 'active roll' but after having so many purecaps I just can't enjoy tabs anymore, the roll seems almost 'dirty' compared to the smoothness of a purecap/molly.\n\n\n"
}
