{
 "title": "Euphoria & Body-Highs Vs. Paranoia & Insomnia",
 "author": "Benny Dubbers",
 "citation": "Citation:   Benny Dubbers. \"Euphoria & Body-Highs Vs. Paranoia & Insomnia: experience with Alprazolam (ID 22014)\". Erowid.org. May 5, 2004. erowid.org/exp/22014",
 "substance": "Alprazolam",
 "bodyweight": "62 kg",
 "header": [],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 22014",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 5, 2004",
   "Views: 70025",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nFor years I have suffered from minor anxiety to full-blown panic attacks. Over time, with study of my condition, energetic healing, therapy, exercise, meditation and the use of other self-prescribed medication, I have never found a med more effective than Alprazolam, or 'XboX', as my circle refers to it.\r\nI have been addicted to it in the past;\r\n  addiction to benzo's sorta can sneak up on you.\r\nTo use this medication for treatment of anxiety, or recreationally, it is important not to let it run-away with you... be careful!\r\nComing down off it, especially cold turkey, of more than 2-4mg+ a day for more than 14 days can FUCK WITH YOU - like coming off speed addiction. Paranoia, MAJOR INSOMNIA, edgyness, dillusions, physical sickness, can't think straight, oversensitivity to senses and flu-like symptoms, fatigue, nightmares and tremors.\r\nHowever, after a night on it, one can feel fantastic the next day, if used irregularly.\r\nI find it grants me the exact opposite to many who descibe its effects; euphoria, body-highs*, empathy, extreme relaxation but no lost of motivation, increased comfortability in social situations, a clear-mind, no lose of motor control unless at about or over 6mg - sometimes a increase in creativity, clearer vision and joy.\r\nMixed with Alcohol, it is much more unpredictable, though can be extremely enjoyable, but can add for many the 'snoozaline' effect.\r\nHowever at high doses of both, one can become almost 'zombielike', with no recollection of events that they partook in, sometimes dangerous, sometime boring for those around them as 'short-term memory' can go TO HELL, and one can become unco-ordinated and participate in acts they have no recollection or control over.\r\nI find it takes the psychotropic edge of marijuana, making it more sedative.\r\nI find it completely destroys MDMA experiences, taking away the strength of the pill and the magic.\r\nI find that it minimises the effects of true entheogens (LSD, mushrooms).\r\nMixed with amphetamine it can cause any interesting up/down synergism. It makes coming down off stimulants a breeze!\r\nIt is LESS euphoric than Diazepam, lasts about twice as long, is stronger and it's smoother. I have tested this extensively, but maybe IT'S JUST ME.\r\nBe Safe, but the 'XboX' can be WONDERFUL if treated with respect.\r\nHappy Doc-Shopping,\r\n  and weigh up your irresponsibility(fun)\r\n    with your responsiblity(care)\r\nBenny Dubbers\n\n\n"
}