{
 "title": "Increased Aggression & Sexed Up",
 "author": "j",
 "citation": "   j. \"Increased Aggression & Sexed Up: experience with DHEA & 19-Norandrostenedione (Nor-19) (ID 22025)\". Erowid.org. Aug 15, 2005. erowid.org/exp/22025",
 "substance": "DHEA & 19-Norandrostenedione (Nor-19)",
 "bodyweight": "69 kg",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "DHEA",
   "(daily)",
   " ",
   "1 capsl",
   "oral",
   "19-Norandrostenedione",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "",
   "22025",
   "Male",
   " ",
   "Not Given",
   "Aug 15, 2005",
   "Views: 19889",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have used illegal/grey-market anabolic steroids (oral and I.M.) in the past to assist weight-training/body building. The psychological effects can be quite intense, accentuating all the male characteristics with exagerated masculinity, sexual predation and aggression. It felt amazing at the time, but with hindsight, it's a dangerous state of mind to be pushed into. I found this worrying and along with reports of long-term liver damage decided to abort any further use of these drugs.</p><p>I have gone on to try OTC preps (50-100mg) of both DHEA and NOR-19, separately and in combination. A daily regime lasting between 6 weeks to 2 months usually, with a long rest in between to allow a natural hormone balance to be restored.</p><p>NOR-19 is by far the stronger product, giving more than a hint of the potentially difficult psychological side-effects I got from using anabolics after just a few days use. The physical effects are noticeable after just a couple of weeks.</p><p>DHEA alone seems to be far more subtle and slow acting and the psychological changes seem to be avoided. I would vouch for its effectiveness in helping to grow some musculature on a body which has remained stubbornly skinny over the years. (Some people think I should be most grateful for that....). I can't recommend it for the kind of huge muscle growth seen by steroid users, but that was never my goal.</p><p>With DHEA and NOR-19 in combination, I found my levels of aggression were very high and my temper would easily rocket and I would snap at people. I also felt highly sexed-up. I don't like these feelings at all. They are very out of character and I would not recommend to anyone to take both these products together, nor to take more than what is recommended, nor to use anabolic steroids.</p><p>I prefer DHEA alone because I can take it without any aggression to those around me. NOR-19 carries with it, for me at least, a risk of quite strong mood changes. It also goes without saying that use of hormonal products for weight-gain must be accompanied by a physical exercise regime, otherwise any weight-gain will be mostly fatty tissue. I attribute my physique to around 90% hard work over the years, 10% to hormones. I think low potency products like DHEA are best used to enhance what I already have, rather than changing my body shape completely.</p>"
}
