{
 "title": "Missing My Left Side",
 "author": "Mullet_g",
 "citation": "   Mullet_g. \"Missing My Left Side: experience with Salvia divinorum (10x Extract) (ID 22031)\". Erowid.org. Mar 5, 2007. erowid.org/exp/22031",
 "substance": "Salvia divinorum (10x Extract)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   "  T+ 0:20",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22031",
   "Male",
   " ",
   "Not Given",
   "Mar 5, 2007",
   "Views: 2734",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After much research into this strange and fascinating plant I decided I just had to try it for myself. Upon visiting one of those shops with all the bongs and other goodies, I had the choice of a bag of salvia leaves for £8:50 or some salvia extract. A friend and I went halves on a little container of the extract for £20, which contains about a gram of the stuff. It came in a semi-transparent, cylindrical container and looked like some finely chopped, dark green herbs. My friend bought a bong from the same shop, nothing huge just a little personal toaker. This is what we planned on hitting it in.</p><p>The day turned into night and I was absolutely dying to try the salvia out for size. Although my friends parents allow spliffs to be smoked in the kitchen, we had to wait for the right time to unleash the bong. Another friend and his girlfriend were also there and he built up a normal spliff that we were gonna smoke after. The four of us went down to the kitchen and loaded the bong. Being the first encounter with the salvia, we had no idea as to how much to use, an earlier chat with the person in the shop resulted in several ambiguous comments and offered very little insight on the matter.</p><p>We devised a little feeder to load the shit into the bowl, by folding a playing card in half and tipping a bit of the stuff on it and then pouring it in along the crease. Consider the amount of tobacco in about 2cm of a cigarette; thats about how much we put in. I offered to be the pioneer and picked up the bong and started toaking. We used two butane lighters to get it going. I took a fat hit and held it in as long as I could. The stuff combusted relatively quickly and the smoke was easy to take down, no tightness like with skunk.</p><p>This next piece of text is an attempt to communicate the experience I had. Although I have done my best to explain it in as much detail as I can remember, the words do nothing to describe that actual experience itself. I would also like to add that this was the most mind-blowing, confusing and just plain fucked up experience I have ever had! Salvia is by far the most potent substance I have experimented with and Ive done more than my fair share of intoxicating substances. I completely underestimated this drug, even though I had read a number of reports on other peoples salvia trips. Anyone thinking that the effects are similar to cannabis but more potent, are nowhere near to comprehending what its actually like. </p><p>I dont even remember breathing out. I had herd before about the bouncy effects of salvia and wondered what this actually meant. I now knew, for everything in the kitchen suddenly felt more three-dimensional and squidgey, if that makes any sense! I dont mean to the touch, it was just a feeling all around me. Strange movement could be perceived in my peripheral vision. An attempt to tell the others that I could feel the effects resulted in some indecipherable grunts and slurring. This was because when I closed my mouth, my bottom jaw was sitting about a foot behind the top.</p><p>The whole left side of my body had now completely vanished like it had never existed. Just then my mate whos yard it was looked at me and said, that was potent innit cos he had blasted the remains of my toak, which was dead anyway. I then looked to my left to hear my other mates girlfriend let out a laugh. Then to the right and my mate said the same thing again, then to my left and the laugh, and again, and again. I was experiencing the same three seconds over and over for what felt like an eternity.</p><p>I tried to remember what had happened before but couldnt, I came to the conclusion that I had stepped out into the road and been hit by a bus and died, and that this is what happens when you die, you live out the same three seconds for eternity. By now I had forgotten who these people even were, what had once been my mates kitchen was now nothing more than some sort of psychological trap that I had to escape from. I had now totally forgot that I had just hit salvia and was extremely confused.</p><p>The whole time there was a diagonal line through my vision and anything on the left side of it didnt exist. I could also feel the line or even a flat plane, like it was some kind of energy channel. I started to panic a bit at this point because everything was so confusing and a bit sinister. The way I describe this experience makes it seem like I was present the whole time and experienced this and then that; but at times I actually lost all memory of me ever being a person, as in, a body with a mind, all I knew was that shit was going on and it wasnt too pleasant.</p><p>The only way I can describe the unpleasantness is if you can imagine a place thats all funned up like a circus or funfair or something, thats got clowns and bright colours, but has got an evil twist to it kinda like the Jokers vibe in Batman. Now imagine that the evil leader of this crazy funfair has trapped you in some kind of wacky scenario that you have to escape from but cant because everything is just wak. And you cant think straight. You are also aware that he is watching your every move and laughing hysterically at you, at your pitiful attempts to figure out what the fuck is going on. Depending on how good you imagination is; thats pretty much what I was going through. </p><p>I reached out and grabbed hold of my mates arm, I dont know whos. I was trying to move my fingers across the top of his arm and around to get a better hold. I had somehow figured that getting my fingers around his arm and pulling hard was the only thing I could do in order to escape this realm of madness. Sounds simple enough but not when I had to reach just a tiny bit further to get a hold, so I do, but then Ive got to reach just that tiny bit further so I do, but now it seems like Ive always got to reach that tiny bit further because his arm seems to be moving around as Im reaching for it.</p><p>I tried to make a grab for something else, but it was the same story; always just out of reach, no matter how far I stretched. A thought occurred that this was gonna go on forever and I was never going to escape. I remember finally grabbing something and trying to pull myself to it, it was something familiar, a doorknob I think, to me it was my only ticket back to reality. To my horror when I pulled, the doorknob came towards me and then behind me as the momentum from my pull carried it, and my arm off into infinity. I tried the other arm with something else and the same thing happened. </p><p>Looking around the so-called kitchen, I noticed that the others were watching me laughing, completely oblivious to the insanity that was still raging through my mind. Reality was slowly returning but it was warped and I felt somehow alienated. My body now felt like a piece of paper, the left side still not all there. I was aware that my lungs were now two straws, suspended in front of my 2D body. Two energy channels starting in my head and pulling down through my neck and body, through my legs were sticking me two the floor, they were kinda warm and electrical and made my body feel a bit heavy.</p><p>I could now feel the weight of my clothes on my body, which still barley existed and this felt really weird. I felt lost and confused, I kept asking what was going on and my mate showed me the bong and said I had just done salvia, it sort of rung a bell. I had this earge to look around and check every inch of the kitchen and had a profound sense that something was going on or was just about to. </p><p>I now wanted to go outside so I somehow got the door open and stumbled out. My body felt so weird; hollow, two-dimensional and heavy all at the same time. I fell into a plastic garden chair and started cracking up with laughter, I had no idea what was funny but I just kept laughing. I so wanted to tell the others what I had just experienced but simply couldnt find the words or know where to start. All I could say was shit like Oh that shit is fucking nuts!, Trust me you dont wanna do it. The spliff from earlier had been sparked and I didnt want any at first. Sitting there in the chair I was desperately trying to piece together what had just happened to me. I had some toaks in the end and then wanted to get inside coz it was proper cold.</p><p>Back in my mates room I crashed on his inflatable chair thing for about 20 mins while the others played PS2. I felt so relaxed and didnt want to open my eyes. I was always aware of what was going on in the room though. After that I felt fine and started trying to explain what happened.</p><p>I watched my friend do it the next day in his shed. We used to have a sofa, T.V, heater, carpet in there, it was our little blazin den but now its filled with random shed stuff so you can't even see the floor. We climbed in and made seating arrangements. He did about the same amount as me but he filled and cleared the bong a few times in one go and then held it in. Even though I had been going on about the potency of this stuff he was still sceptical.</p><p>As soon as he exhaled after a good 30 seconds he completely lost it and started freaking. Ive seen him in some fucked up states before but this topped everything. He was murmuring, grunting and falling everywhere, a look of pure terror on his face. I grabbed him by the wrists in an attempt to restrain him and get him back to the chair. This resulted in him screaming and shouting shit like let me out. And whats going on? This was very disturbing for me because my friend had suddenly transformed from an intelligent individual to some kind of mentally retarded psychiatric ward patient.</p><p>I was wondering if he would ever be normal again and what the fuck I would say to his parents. After about 5 minutes of that he calmed down and was very confused I had to keep telling him that he had just done salvia coz he kept forgetting. We then went inside and he crashed for half an hour. He had no recollection of his behaviour or his screaming.  That shits weird man, I aint doing that again! was one of the things he said along with things like he was trapped.</p><p>My experience with salvia divinorum was not enjoyable; I dont regret doing it and would probably do it again but in a better location. Anyone thinking of doing it I strongly advise you dont start with anything more than 10x even if you are experienced in the drug world. This shit is in a league of its own. It is absolutely imperative that you have a sitter with you that wont freak out when you start acting like youve lost your mind and get them to keep reminding you that youve taken a drug.</p><p>I had no closed eye visuals, which was a disappointment because thats what I wanted it for. The fucked up part of it lasts for about the first 5 mins, it felt like much longer than that though. Im thinking on giving the leaves a try but I wouldnt touch the 15x, no fucking way.</p><p>If anyone has had a similar experience or has any way of making the experience more pleasurable please e-mail me:</p><p>Mullet_g@hotmail.com</p>"
}
