{
 "title": "A Lucky Find",
 "author": "Kni",
 "citation": "   Kni. \"A Lucky Find: experience with Codeine (ID 22092)\". Erowid.org. Mar 5, 2007. erowid.org/exp/22092",
 "substance": "Codeine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Codeine",
   "(liquid)",
   "  T+ 0:03",
   "15 mg",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 0:03",
   "30 mg",
   "oral",
   "Pseudoephedrine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22092",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2007",
   "Views: 46142",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had been suffering through a particularly annoying cough the last week or so. Dubbed the 'death cough' by my friends, I of course decided to self medicate instead of going to a doctor as university life was a bit too hectic to spare a few hours for a clinic. One night, I was wandering around the ground floor in my dorm asking if anyone had any cough syrup. One girl said she had some stuff she hadn't finished, tossed me a bottle, and told me to keep it.<br>Reading the prescription info on the outside, I began to realize I may have come across something interesting. 'Codeine Linctus, 5mg/ml' it read. Checking the indicators on the side, a little over 40ml was left. Having experience with codeine/apap pills and cold water extractions from a troublesome wisdom tooth removal, although at lower dosage levels, the concept of a sweetened codeine mixture with no liver worries was most intriguing.<br>The next day I went the gym at about 6pm, trying to get my body familiar with physical activity again, as the cough had killed my appetite and energy for the last week or so. After a rather lackluster session, I returned and ate a medium-sized meal at approximately 8pm. At 9pm I decided to consume the codeine syrup.<br>21:00- 40ml of syrup ingested, containing approximately 200mg codeine.<br>21:03- The death cough returns, and my body is wracked with terrible coughs of historic proportions. I decide to consume a good slug (30ml) of some generic cough syrup containing 15mg dxm, 30mg pseudoephidrine hcl, and 200mg guafenesin per 5ml.<br>21:10- First hint of liftoff? Maybe it's just placebo. I've had codeine hit me this fast before though, but that was on a far more empty stomach.<br>21:15- Started to get bored surfing the web. Note that approximately 2ml of codeine linctus remains in the bottle. Start getting weird ideas, decide to rail the rest. 1ml bumps in each nostril, there we go. Little to no burn, minor numbness, and the most delicious drip ever. Absolutely bizarre, it tasted fabulous. I really dont know how effective this was, but it was fun.<br>21:30- Noted a tendency to 'zone out' a bit more. Still not euphoric. Then mom phones, asking if the cough is alright. I end up talking for about 20 minutes, enjoying myself quite a bit. This indicates to me that it must be kicking in a bit, normally conversations tend toward the 'yep, ok, sounds good' variety.<br>21:50- Got off the phone. Realize I'm feeling a bit of a buzz, still not 200mg worth in my opinion. Perhaps the syrup has sat around for a while and started to degrade in potency?<br>22:15- A friend shows up unexpectedly and asks for help with her homework. I've resigned myself to a minor buzz at this point, and crank off some math for a while. I find myself calm and doing quite well solving these problems; I could get to really like the opiates I think. Only problem is that I find myself itching whenever I lose focus on the problem, a minor distraction.<br>22:45- Homework all done, I decide to play some videogames. I don't really feel like sleeping, as the codeine isn't quite knocking me out like I planned.<br>23:30- Wow. There we go. I zone out completely for an extended period on the computer, and as soon as I stand up I realize that I'm rather 'there'. Lucid mind, thinking about nothing in particular but focus, when required, is easily obtained. Calm exterior, with a warm fuzzy body feeling. Minor balance/coordination issues, similar to drunkenness, only without the idiocy and toxic body feeling. Zero nausea or itching, however thinking back I believe if the thought of itching had come to mind, I would have scratched up a storm.<br>23:45- I decide to go to bed listening to some music. I feel amazingly comfortable, and the scene in Trainspotting where Renton sinks into the floor comes to mind, without all the pesky overdose issues. I feel completely enveloped, completely calm.<br>I woke up the next day after approximately seven hours of sleep, a length that would normally leave me cranky and lethargic. Today I felt amazing however, a serene afterglow of subtle energy and focus. In a great mood, I headed to class.<br>This was by far my best codeine experience. Worryingly good. I currently have a desire to explore others in the opiate family. Here's to keeping it strictly weekends and hubris.\n\n\n"
}
