{
 "title": "Unsettling With Visuals",
 "author": "ZamZara",
 "citation": "   Zam & Zara. \"Unsettling With Visuals: experience with 4-Acetoxy-DiPT (ID 2209)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2209",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "18 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2209",
   "Male",
   " ",
   "Not Given",
   "Jun 27, 2000",
   "Views: 33220",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMaterial : 4-Acetoxy-DiPT powder dissolved in distilled water at 2 drops per mg. Off-white powder from very reliable source. This material tastes fucking bad, bitter, rotten, foul. Zara would describe it as worse than MDMA or 2C-B.</p><p>Zam (male) : body weight ~ 100 kg (220 lb). Zam's general entheogen sensitivity is average, though usually he prefers somewhat lighter doses than others. He chose to do 18 mg of 4-Acetoxy-DiPT.</p><p>Zara (female) : body weight ~75kg (160 lb). Zara's entheogen sensitivity is definitely higher than average, requiring less material than most people with most substances. She chose to do 10 mg of 4-Acetoxy-DiPT.</p><p>OVERVIEW</p><p>This experience came at the tail end of an MDE experience. The two reports have been separated out because we wanted to capture the MDE experience separately. However, it's difficult to know exactly how much or what type of effect the MDE had on the experience with the 4-Acetoxy-DiPT. The 4-Ace was done 3 hrs after taking the MDE, but the primary MDE effects were definitely gone at this point. </p><p>The effects here were experienced as a somewhat unsettling, especially for Zam who wasn't ever quite sure what to do with himself. Mood was neutral-ish, no strong push in any direction. There was a weird but not exactly bad body trembling / vibration. It seemed like the MDE and the 4-Ace didn't really mix smoothly and the transition was more like a somewhat rough jostling for receptors. We both definitely went from 'coming down' off the MDE to feeling mentally stimulated (not physically stimulated exactly). It felt like the effects were not quite strong enough to totally override the tail of the MDE, but enough to make sure we was definitely 'tripping' in a generic sort of way. Some pleasant and pretty visuals, fairly strong body vibrations, no significant mood lift (but this could be accounted for by the tail of the MDE). </p><p>One disconcerting note was the high pulse rate we both had even at T+4 hrs while lying down not moving much, also experientially high body temp.. moving around made us sweat. It seems hard to separate out the effects, but it could likely be a mild serotonin syndromey kinda thing with the mde & prozac & tryptophan, or it could be the combo of those with the tryptamine.. very hard to say, but still somewhat odd.</p><p>DETAILS</p><p>1:50 (T+0) - We each mixed the chosen number of drops into a small amount of grape juice. This potion is drunk on an empty stomach (neither of us had eaten a meal during the day, and nothing for the past 3 hours). Zam eats a few cherries to clear the taste. We both drink a bunch of water and then clean juice to get rid of the final remnants of taste.</p><p>2:27 (T+ :37) - Lights are definitely sparkly, like tryptamine looking through a crystal at lights effect. It's hard to focus eyes, feeling a little unsettled and odd. Breathing is somewhat shakey. Not in a bad way, but not particularly good either. These effects seem as though they might be the result of the mixture of the remaining MDE effects and the just starting 4-Ace. </p><p>We lie down to start watching 'Shakespeare in Love'. While the movie seems interesting and good, neither of us can quite settle in to be sure it's what we want to be doing. We both have a bit of the body feeling that we want to get up and do something, move around more, but going outside in the 40F damp weather seems like a pain, so we stay in.</p><p>Zam : Pulse 78 BPM lying on floor (normal resting pulse 60-70BPM) </p><p>2:57 (T+ 1:07) - Zara settles in much more with the experience and finds herself very much enjoying the experience of watching the movie. The somewhat uncomfortable body and mental feelings from 30 minutes ago fade pretty much into non-existence. Zam continues to feel somewhat unsettled.</p><p>4:10 (T+ 2:20) - Zam is still a little shakey. We finish 'Shakespeare in Love'. An excellent movie. Eat a few carrots and both take our temperature and pulse: </p><p>Zam : Ear temp 100.3 (avg of 3 temps taken) Zara : Ear temp 99.7 (avg of 3 temps taken) </p><p>4:27 (T+ 2:37) - </p><p>Zara : Blood Pressure 117/68 (normal 100/65) Pulse: 99 BPM (normal 65-70) </p><p>It is quite noteable that Zara's pulse was this high. While she doesn't feel at all bad, it's definitely a little weird to have her pulse so high while resting. Others should take note of this and keep track to make sure their pulse does not become dangerously high with this substance.</p><p>4:36 (T+ 2:46) - Vision is still very sparkly, crystal effects on candles and christmas lights. Eyes are definitely focusing differently than usual. </p><p>5:10 (T+ 3:20) - </p><p>Zara : Blood Pressure 103/60 Pulse 95 BPM</p><p>Zam : Blood Pressure 110/70 (normal 110/60) Pulse 85-90 BPM (normal 60) </p><p>7:00 (T+ 5:10) - Both lie down to sleep. Neither of us have much trouble.</p>"
}
