{
 "title": "Forget Tea, Make Capsules",
 "author": "chaz-spain",
 "citation": "Citation:   chaz-spain. \"Forget Tea, Make Capsules: experience with Calea zacatechichi (ID 22108)\". Erowid.org. Oct 20, 2003. erowid.org/exp/22108",
 "substance": "Calea zacatechichi",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 capsls",
   "oral",
   "Calea zacatechichi",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22108",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 20, 2003",
   "Views: 28044",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHow bad can boiled leaves possibly taste? So bad youd want to chuck everything youd just bought into the trash\r\nI made a spliff out of dried leaves and flowers first. I would register this as no effect, although I felt slightly light-headed afterward. I attribute this to the fact that I am a non-smoker, and inhaling anything rather than pure air would do the same.\r\nThat night I made tea, measuring about 3 large tablespoons to a liter of water, for my wife and I. I put a ton of honey in it, but it was still God-awful--unbearably bitter and nasty tasting. I normally dream quite a bit, and so does my wife; that night was normal, a few dreams, nothing especially intense. We were disappointed; I thought perhaps what I received was old product, or I hadnt made the tea strong enough. \r\nTwo nights later I crushed and chopped a large handful of leaves and flowers as finely as I could, and stuffed it into capsules. I ate two before going to bed; my wife declined. During my very first dream (that I remember, anyway), I suddenly realized I was dreaming. I thought lucid dream! and tried some tricks to stay there, like looking at my hands and feet. I was too excited though, and woke up. However, my wife looked strange in bed next to me, and both our children were in the bed as well, crying. I was still dreaming. Finally, I woke up for real.\r\nI got out of bed and expected to feel strange, like I was high or hallucinating still from the plant. However, I felt completely normal. I find it amazing that this plant could only be psychoactive when dreaming, but that was the effect with me. When I went back to sleep, I continued to have intense dreams, but none were lucid. The next morning I awoke feeling normal, no residual physical or mental effects. \r\nI will certainly try the capsules again, but am not sure if its necessary to wait a length of time, or if repeated use has reduced effects, or can be harmful to my mental or physical health in some way. Instinctively, I tend to doubt it.  All in all it was pretty amazing, since I've had lucid dreams only once or twice before in my life.\n\n\n"
}