{
 "title": "Addicted to My Meds",
 "author": "OKComputer",
 "citation": "   OKComputer. \"Addicted to My Meds: experience with Amphetamines (Adderall) (ID 22122)\". Erowid.org. Mar 7, 2007. erowid.org/exp/22122",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Amphetamines",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22122",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 7, 2007",
   "Views: 5683",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was diagnosed ADHD in the summer of 2002 and was perscribed 20mg Adderall. When I first got the pills I never took them because I thought the whole ADD/ADHD thing was pretty much bull shit. About a month after I got them a friend saw them in my room and informed me that they were an amphetamine and could get us high. Wanting to know if this were true or not I suggested we crush some up and snort them.</p><p>I'm a HEAVY pot smoker and have also used exctasy, coke, mushrooms, acid, opium, and a variety of different painkillers but i'd never used any add drugs like ritalin or dexedrine. So I crushed up 1.5 pills (30mg) and snorted that my friend did the same. </p><p>Unlike coke Adderall didn't burn my nose and actually had a pleasent fruity taste to it. Within five minuets of snorting this stuff I was totally fucking jacked. This was by far the best drug I'd ever done and after smoking a fat ass blunt it got even better. I stayed up for the next four days binging on adderall.</p><p>It's been about nine months since my first experience and I do Adderall or dexedrine at least once a day. I can't function right without dextroamphetamine in my system I need it to go to school, I need it to go out with friends, I need it to have sex, I need it to clean my room, and I needed it to type this report. I strongly recomend that no one try this drug it can be very addicting don't think it's safe just cause it comes from a doctor.</p>"
}
