{
 "title": "Better than Medical Anxiolytics",
 "author": "Phenomenon",
 "citation": "   Phenomenon. \"Better than Medical Anxiolytics: experience with Brunfelsia  (ID 22143)\". Erowid.org. Mar 8, 2007. erowid.org/exp/22143",
 "substance": "Brunfelsia ",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE:",
   "10 leaves",
   "oral",
   "Brunfelsia",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 22143",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 8, 2007",
   "Views: 14851",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I decided to try chewing the leaves of a plant in my girlfriends garden. I experienced a calming effect beginning after about fifteen minutes. I suffer from lower back pain which to a large extent is aggravated by an anxiety disorder I've had for 7 years now. I have tried many antidepressants, anxiolytics and pain killers and nothing has worked as good as chewing Brunfelsia Grandiflora. </p><p>I experience virtually zero drowsiness, which is a major negative aspect of most anxiolytics. For about two hours after the stuff first kicks in I am 95% plus pain free in my back. This happens every time I chew even when I have done major exercise which usually gives me severe muscle pain. Cognitively speaking it makes me very focused on the task at hand. This is a great advantage for someone with Post traumatic stress disorder due to the negative and fatigue related effects of hypervigilance. I also sleep like a baby every night after I've chewed some. </p><p>At present I am taking no pain killers, which hasn't happened for about 5 years now. I also have no need for my anxiolytics at present. I experience no memory problems, in fact my memory [short term] hasn't been this good in years - probably related to decreased anxiety. I experience myself as much more sociable and do not get irritated by the stupid little things that I used to get irritated by.</p><p>There is no trip involved in this drug.</p>"
}
