{
 "title": "Wind Through The Yosemite Valley",
 "author": "Jason",
 "citation": "   Jason. \"Wind Through The Yosemite Valley: experience with Mushrooms - P. cubensis (ID 22152)\". Erowid.org. Jan 22, 2004. erowid.org/exp/22152",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 22152",
   "Male",
   " ",
   "Not Given",
   "Jan 22, 2004",
   "Views: 8207",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friends and I planned a trip up to my friends campsite in Yosemite, and naturally we thought that it would be a great place to take a journey on mushrooms. We bought an ounce and headed up to the campsight. The next morning we got up and had breakfast, got dressed abd sat around the table by our campsite and divided up our bag of mushrooms. I ended up injesting 4.5 grams while everyone else took a little less. For the first hour I had the usual anxiety and nausea that is common during the onset of mushrooms. I went into our tent and laid on the bed till my stomach felt better. Eventually I decided to go out and have a seat by the river. The small river beach had a wonderful view of Half Dome and if it were in the spring you would be able to clearly see Yosemite Falls. I brought a lawnchair out there and sat down. Then the visuals began.</p><p>Fist I began to see patterns emerge in the limbs of the trees across the river from me. They were geometric patterns of triangles and stars. These patterns also began to emerge from the sand. As I sat alone on the beach my eyes began to water as the visuals came on stronger and stronger. All of a sudden I began to hear strange things. At first I couldn't make it out, but after a while it began to sound like singing, or more like a chanting. Soon the sound was much louder and all around me. Then i realized it was the wind...it was sweeping through the Yosemite Valley, through the leaves of the trees, and between the great stone walls. It carried the sound of the past, the sound of those that once inhabited the great beautiful valley. As the wind surrounded me the music got louder and louder, but it made me think that it was only a wisper of the power and herritage of this great valley. Then I began to se the walls of the valley throb with energy. I ran into the tent, my eyes watering half tearing up from the powerful moment with the wind, and half because i couldn't bring myself to close them. </p><p>I told my friends, who were feeling quite sick, to come outside and see the power of the valley. They were not feeling well and apparently having pretty bad trips. Two of my friends threw up, but nothing could wipe the smile off my face as I sat in the middle of this great valley of power. Thoughts raced through my head as the nature of the place taught me about its history and begged me to do my part to keep it from being ruined by civilization. As i sat and pondered these thing my friends began to feel better and we decided to take a walk down the river. When we are on shrooms we tire easily so after walking a little ways down the river we sat down again and began to talk about the what we had been seeing. As we were talking all of our attention turned to a lone duck flying above us. All of a sudden the duck swooped down and flew right at us and landed gracefully in the water next to us. As you can imagine, this was an awe-inspiring sight to us. </p><p>The duck then proceeded to swim over to us...about 3 feet from where I was sitting and clean himself and fed. He showed no fear of us and stayed there for about a half an hour taking care of his own business while we talked. He almost seemed like he was listening and being a part of our conversations. Then all of a sudden he let out a loud quack, turned slowly around and flew away. It was as if he was politely saying goodbye to us. Everyone in the group shared this idea. It was one of the most amazing things I had ever seen. After this we made our way back to camp and spent the rest of the time coming down eating and talking and laughing. Luckily everyone who was sick had felt better and enjoyed the second half of their trip.</p><p>This experience changed my life in innumerable ways. I had never felt such a connection with my surroundings and nature. The place spoke to me of a time long forgotten, and showed me it's beauty beyond anything i had ever seen before. So for those of you looking to learn from mushrooms, I would have to say that they are the greatest teacher that I have come into contact with. I hope to try some other entheogens, but i will never forget this experience that changed my life.</p>"
}
