{
 "title": "Fox Base Alpha",
 "author": "Murple",
 "citation": " Murple. \"Fox Base Alpha: experience with 5-MeO-DiPT (ID 2216)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2216",
 "substance": "5-MeO-DiPT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 mg",
   "smoked",
   "5-MeO-DiPT",
   "(freebase)",
   " T+ 7:00",
   "11 mg",
   "smoked",
   "5-MeO-DiPT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "1999",
   "2216",
   "Male",
   "",
   "Not Given",
   "Jun 27, 2000",
   "36062",
   " "
  ]
 ],
 "report": "<p>\nAfter having experimented with 5-MeO-DIPT a few times, and having tried a few smoked tryptamines in my day, I got curious as to how smoked 5-MeO-DIPT would be. I looked in all the printed literature I had available, and searched on-line. As far as I can tell, nobody has ever smoked 5-MeO-DIPT - at least not anyone who has documented the fact. This gave me a sense of adventure... the fact that I would be the first known human being to try this route. That and the fact that I had never attempted to convert a hydrochloride salt of a substance to a freebase, not being a chemistry type. I looked at the procedure used on DPT from the DPT Primer by Toad, asked questions of a few chemsitry-aware friends, and the mad scientist within me came up with a plan.</p><p>I took 50mg of 5-MeO-DIPT HCl, a white crystalline poweder, and dissolved it in about 150ml of filtered water. It dissolved rapidly with almost no stirring, leaving nothing behind. I added some NaOH to this, trying to reach a pH of 8 or 9, but finding that it jumped from 6 to 14 with just a pinch of NaOH, the water going from clear to cloudy white. Ooops! I tried to add some vinegar to lower it back to 8 or 9. Add a drop... no change... add a drop... no change... add a drop... Whoop! It goes clear. pH back to 6! Argh!!! So, add a little more NaOH. pH goes back up to 14. I confer with someone who has more chemistry knowledge than me who tells me 14 is ok. So, I add about 75ml of petroleum ether and shake. I set the jar down outside to settle. Using an eyedropper, I siphoned off the ether layer from the top of the liquid. I dropped it into a large Pyrex baking dish, where it evaporates almost instantly, leaving a whitish film. When I'd gotten off all the ether I could without also sucking up the water layer, I added another 50ml of petroleum ether, stirred and let settle. I siphoned off this ether layer, then added another 50ml. After I'd gotten most of it off, I used a turkey baster to grab the last of the ether and some of the water layer, and put them into a test tube. The smaller diameter of the test tube allowed me to suck off more of the ether without getting any of the water layer. I found myself left with a baking dish full of off-white residue. I let this dry overnight then scraped it off with a razor blade. The end product was a slightly greasy, wet, off-white powdery solid. I weighed it and found myself with 53mg of this - obviously it contained some impurities from the vinegar, NaOH, or both.</p><p>This afternoon, I decided to sample what I had created. To be cautious for the first run, I measured out 3mg of material and loaded it into an improvised vaporizer. I vaporize it, and it left behind a brownish stain. Yep... impure. I inhale. Disgusting taste! Much worse than other tryptamines. Perhaps I'm tasting some vinegar impurities as well. Anyway, its not tasty. Within about 5 minutes, I began to feel 'something' and by T+10m I felt a definate tryptamine signature. I'm tempted to push it further but have plans for the evening. The tryptamine buzz lasts for about an hour.</p><p>I got home tonight and decided to try again. I measured out about 6mg and put it in my improvised vaporizer, and hit it at 2am. I feel a little headrush. Within 10 minutes, I feel a pretty nice tryptamine feel, but decide that it wasn't enough. I prepare another 5mg and smoke it. 10 minutes later, I find myself feeling a very pleasant, mild effect. It is definately 5-MeO-DIPT, but different. There seems to be less physical effect than orally. This is much more of a euphoric, trippy buzz. The visual effects seemed about equal to what oral 5-MeO-DIPT does. There is much less stimulation, and much more of a relaxed feel. While its definately the same drug, the emphasis seems to be shifted slightly. By 3am, things had dropped alot... but I maintained a nice, warm, glowing feel for another hour and a half or so, similar to how I would expect to feel about 4 or 5 hours after an oral dose of 5-MeO-DIPT.</p><p>In conclusion... first, I was reminded of the fact that I am not a chemist. I probably lost a large ammount of material in the free base conversion... and I think my end product was quite impure. I'm guessing 10mg of my material would probably contain a full dose of around 6-8mg. Second, this is something I'd like to explore more thoroughly with the remaining material - but I don't think I will try converting anymore. I feel that perhaps 15mg of this material taken all at once would provide an excellent experience. It seems like this could be a very pleasant alternate route of ingestion for this material which offers some qualitative differences from the equally pleasant oral route. Perhaps. So far, my 2 experiences with smoking the freebase have not come close to the intensity of my oral experiences. I feel this is dosage related. Finally, I would like to point out that while there is a great sense of excitement that comes with pioneering new territory, anyone considering trying experiments like this on themselves should do alot of research beforehand, and extrapolate based on things that are known. And ethics dictate that you should try things out on yourself before even considering offering them to (or forcing them upon) others.</p>"
}
