{
 "title": "Complete, Slightly Incorrect Harmony",
 "author": "Triode",
 "citation": "   Triode. \"Complete, Slightly Incorrect Harmony: experience with 5-MeO-DiPT (ID 222)\". Erowid.org. Oct 11, 2000. erowid.org/exp/222",
 "substance": "5-MeO-DiPT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 222",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 11, 2000",
   "Views: 15528",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n5-MeO-DIPT was introduced to me as 'the pill that would enhance my reality.'  I'd read interesting things about how it gave new significance to one's surroundings, and I like thinking drugs, so I decided to jump in.  16mg gelcap dropped at 10:30pm or so, and I'd started to feel the come-on stomach flips at about 11:30pm.</p><p>12am (T+30min) and going to the bathroom is decidedly pleasant. </p><p>12:30am (T+60min) and taking a shower is decidedly fun.  </p><p>1am (T+90min) and (at the advice of my friend) masturbation is decidedly mind-blowing. Colors had a brigher hue and lights cast a same-colored aura around themselves.  While holding a steadily-pulsing light source (which did not heat up at all), I felt its colored pulse as both color and physical warmth in the fingers holding it.  Everything around me seemed to fit together in one great master plan.  Everything did its thing in complement and supplement to everything else.  </p><p>When I retreated to my room (1am or so, T+90min), the music I turned on was right on, playing along with my train of thought.  I listened to a few of my favorite albums, and they cast their feeling right through to my core. At around T+3h, I wrote a bunch of email to out-of-touch friends of mine.  I put on _The Very Best of Cream_ and watched my screensaver, Hypercube (a wireframe rendering of a 4D cube collapsing).  The music and the cube danced with each other; the music played further and further into an ever-collapsing feeling and sound. I couldn't get over the beauty and wonder of the collapsing cube, or the complexity of the music, or tales from friends past, or *anything* I thought of.  </p><p>The only mindless effects of this drug were the slight color fringe and the odd trait that music sounds tonally lower than it should.  The rest of the 'trip' was thinking, thinking, thinking about everything in your life.  By T+5h I was able to sleep, and I awoke the next morning after a full night of comfortable sleep, feeling fine.</p><p>Many propose that 5-MeO-DIPT makes everything seem very fascinating, but always a little incorrect.  I agree.  The most enjoyable part for me and for most people I've talked to was the come-down.  Music sounded lower than it should have.  The cube wasn't supposed to be collapsing infinitely.  Light wasn't supposed to make my fingers tingle with its waves of heat.  Nothing was /quite/ what it was supposed to be.  It is for this reason that folks around here have taken to calling 5-MeO-DIPT 'Incorrect'.</p><p>Conclusion: If you want to take a drug and feel happy for six hours, take MDMA.  But if you love to think and you want to feel fine the next day, then I think Incorrect is for you.</p>"
}
