{
 "title": "We are Just Not Meant to Eat Cactus",
 "author": "Rob S.",
 "citation": "   Rob S.. \"We are Just Not Meant to Eat Cactus: experience with Cacti - T. pachanoi (ID 22213)\". Erowid.org. Mar 17, 2007. erowid.org/exp/22213",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Cacti - T. pachanoi"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 22213",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 17, 2007",
   "Views: 19602",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is about my attempts to meet Mescalito via the San Pedro cactus, or SP for short.</p><p>I was in Peru with my girlfriend, Sharon, and we met a girl who told us that there was a cactus growing wild which was hallucinogenic. Given that there were a variety of the spiky things around, we did a bit of research before trying one. Sure enough, sites like this one gave us pictures and info on the SP and we decided that it would be rude not to give it a go. We have been fans of acid and E for years and I have tried DMT, Salvia and mushrooms so we were aware of the good and bad sides to stuff.</p><p>The sites had various ways of preparing it and we decided to liquidise it, add lemon juice and eat it in line with one report - we had no way of drying or extracting it as we were travelling. Off we set to buy a liquidiser, a 5kg SP from the market and back in the hotel began to cut up and liquify the fresh cactus after first cutting out the white core (time 3pm). Water and lemon juice (10 small lemons) was added as we went. The gross amount we chose was about 1.5 kg and the resulting goo was about 3 litres. It had the consistency of thick lumpy snot, was bright green and, if you want to know what alien vomit looks like, then this is it.</p><p>However, sometimes you have to do these things for the greater good and having a bad taste can be a good sign if our experiences with mushrooms was anything to go by. So we tried to drink it. It was disgusting in taste and texture - really bad - but we persevered and drank about a litre each before our bodies said stop and we sat back to see what would happen.</p><p>I also tried to eat some of it raw and the taste was much better than I had expected but still not very nice. Whoever suggested adding lemon juice needs kicking as it made it taste worse. We also discovered that there was a hard outer layer on the cactus that you could remove by scraping off the green stuff. However, this was too late for us as we had chucked it all in the liquidiser. Not surprisingly the motor had smoked a bit from having to mash this up.</p><p>There was a roof terrace and we sat upstairs enjoying the view over Cusco. Then Sharon went and puked as the memory of swallowing the goo made her nauseaus. I was OK but 1/2 hr later I went and made myself puke too. This was about 1 1/2 hrs after finishing and it had taken an hour to eat it so I thought I would have ingested the mescalin anyway. We felt slightly spaced but nothing of the 'mindmelt' we had read about.</p><p>Then it began - both of us began to feel sick. We had a horrible case of wind as a result of the air that liquidising had put into the goo and spent the rest of the evening feeling like shit. The only real narcotic effect we felt was feeling very awake and we did laugh but the stomach cramps overrode the plus sides. We eventually got to sleep at about 2am after the air had worked its way through us.</p><p>OK so lessons learnt - leave out the lemon juice, scrape the green flesh from the outer waxy skin and DON'T LIQUIDISE!!!!!!!</p><p>We were not going to give up that easily on SP so, after a day in bed recovering, we bought a 500ml bottle of ready prepared SP from a shaman (!) in town. It was a brown liquid and looked like it had been boiled. This tasted better and we did have a nice afternoon and evening feeling almost straight but happy. Nothing like a huge hit and nothing pschedelic. There was enough to make us want to continue our studies but to get a real hit I think you'd need 2-3 bottles each at least and they were fairly expensive.</p><p>The third try was back to fresh cactus, a different one we had picked ourselves, and we decided to eat it straight. The location was on a beach on l'isla del sol by lake Titicaka in Bolivia so we had a fantastic view. Perfect for getting wrecked. The amount was again about 1.5kg of cactus gross but was a lot less after removing the core and outer skin. We has a cup each to eat washed down with fizzy pop and it was much easier to do than drink snot. It tasted bad and I don't like to think about the taste even now but again we were prepared to gamble on 1/2 hr nastyness for a possible 10 hours tripping.</p><p>This time we did get something and spent several hours sitting on the beach watching waves, listening to a shepherd playing his whistle and playing with sand. There weren't any visuals to speak of but we both felt good and talked about loads of stuff. Good so far if not headblowing in intensity. Then we began to walk home (2km). As we walked the feeling of nausea got worse and making ourselves sick did't stop this. It was a horrible walk back and we had to keep stopping to rest. Back in the hotel we sat in bed and waited for the sick feeling to go for 6 hours! I did manage to eat before sleeping but Sharon couldn't face it.</p><p>Lessons learnt: I will never eat cactus again. We couldn't understand why we had felt sick this time as we had not mixed in air like the first time.</p><p>The fourth time we tried was with some powdered SP we had bought in Cusco. It smelt as if it was dried from fresh and we added it to water before drinking down in one - about twice the dose the seller had recommended. This was a hell of a lot easier than eating it and we waited for any effects to kick in. If only I had properly learnt my previuos lesson - after about an hour I began to feel sick and puked my guts up. </p><p>However, this did not seem to matter as I had stomach ache for the whole afternoon and into the evening. This time the location was looking out over a huge valley with a swimming pool by us, sun, beautiful birds flying around and fireflies when it got dark. What a waste. There was no narcotic effect at all for either of us. Sharon felt fine all day but began to feel sick in the evening. I felt better about 8 hours after drinking it and could face eating. The date of 23rd October will forever be a date I will remember as the day I poisoned myself despite having 'learnt the SP lesson'.</p><p>Final thoughts: I think our bodies had become sensitised to SP but I don't understand how. For all the effort we put into giving SP a go I had only one fairly good experience and made myself feel awful 3 times. I don't see the point in trying to do things like this when the dosages and effects are so variable and problems of preparation are so big. I can't blame the cactus for not trying to tell me - it tastes disgusting amd has big spikes. We are just not meant to eat them.</p>"
}
