{
 "title": "A Panic Disorder Is Terrifying",
 "author": "Mindy",
 "citation": "   Mindy. \"A Panic Disorder Is Terrifying: experience with Cannabis (ID 22265)\". Erowid.org. Mar 21, 2003. erowid.org/exp/22265",
 "substance": "Cannabis",
 "bodyweight": "9 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Pharms - Diazepam",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "22265",
   "Female",
   " ",
   "Not Given",
   "Mar 21, 2003",
   "Views: 10521",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started to smoke pot about 3 years ago, as I have suffered depression most of my adult life and it seemed to really bring me out of it. Most of my friends did it and held down good jobs and basically seemed to cope with it. I thought I was no different!</p><p>I began to realise something ws wrong a few months before my black day, but never associated it with the cannabis. I remember a time when I went to buy a CD from a well known music store. I took it home only to find nothing on the CD. I was absolutely convinced that it was a conspiracy and that they were laughing at me when I bought it. So much so I wouldn't take it back! </p><p>I started to become a bit agraphobic after then. I started talking my way out of every social occasion possible. And if I had to go, I became extremely aggitated before hand. Still I never linked it to anything, in fact I enjoyed it when the day was over so I could get stoned and laugh at myself with my husband.</p><p>I went to my daughters nativity play on the Tuesday before the shit Saturday. I had my first real severe panic attack! I sat there for over an hour sweating, tapping my feet to keep my balance and feeling so bloody dizzy I wouldn't have been able to stand and leave, even if I had tried! I was surrounded by parents. I couldn't even get my arms to work enough to get my camera out to take a photo of her!! That night I got stoned after the kids went to bed and laughed about it again! </p><p>Then came the Saturday I will never forget for the rest of my life! It started out quite normally. I had got very stoned the night before, maybe a bit more than usual as we had had some friends round. well anyway one minute I was sitting there looking at some old photos and the next I had absolutely NO idea where I was! I started to panic, shake, sweat, my heart began to speed off somewhere and I couldn't even speak apart from to say to husband 'I really think i'm losing it babe!!' I began to pace the whole house nervously, near on hysterically with a juggling ball in my hand. I could see my hand fiddling with this ball but it didn't feel like mine! I started going to the loo every several seconds although I didn't want to go, i was just scared of wetting myself. Whilst on the toilet I had voices in my head telling me that if i didn't close the shower curtain something really bad would happen to me. At the same time a voice was arguing with it saying I was on the toilet and I can't fucking move to close it! </p><p>These voices were absolutely nothing to do with me as I was just sitting there panic stricken and at this time I had started to rock like a little child!! Eventually I got up off the loo and caught sight off my eyes. One of my pupils was so bloody big where as the other one was fine. Well I freaked! I ran downstairs and managed to get the words out to my hubby that he needed to call the doctors. At this point I was petrified of my kids, my cats AND my husband. Eventually the doctor shoved me on some Vallium (Diazepam) it took well over the normal dose just to settle me. </p><p>I am now on antidepressants and getting back to normal again. I still sometimes see things that are not there. And I still sometimes have thoughts arguing with themselves that are nothing to do with me and cannot control but since stopping smoking I feel I have the slight brain power it needs to stop them after a while. It might take a long walk or if that fails my bloody Vallium! (which I really hate taking!) It annoys me sometimes because my friends sometimes smoke around me, which they're entitled to do, but they have never experienced that sheer terror of what is in my own head! Until they do they will never take me seriously, when I say it's not always just a soft drug. Let me tell you i'd give anything to go back to the depression i had. Then it was just tears and lack of enthusiasm. A panic disorder is terrifying! And i've been told I may relapse again. </p><p>Fancy a spliff? Think about it.</p>"
}
