{
 "title": "The Last Time I'll Bother",
 "author": "Flotsam",
 "citation": "   Flotsam. \"The Last Time I'll Bother: experience with 5-MeO-DiPT (ID 2227)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2227",
 "substance": "5-MeO-DiPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2227",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2000",
   "Views: 5698",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nTwo experiments with 5meo-dipt. Brief background: I have a hard head when it comes to tryptamines, so I figured I'd have to go higher than what I'd heard was a typical dose (10-15mg). I also kept in mind that the first experience with many tryptamines is often the most powerful, so I didn't want to go too far overboard.</p><p>#1</p><p>Weighed out 2 caps with just under 10mg each. Popped one at 7:50pm. By 8:15, I was feeling distinct, but very subtle tingles. I'd heard movement and activity helped activate so I did a 10 minute workout and a little bit of yoga. At 8:45 I was having typical tryptamine symptoms (sinus drainage, sticky back of throat, rumbling bowels, etc.) but absolutely nothing that I would call psychedelic, entheogenic, entactogenic, or even interesting. So I popped the second cap. By 9:30 I was getting yawns similar to what I get on psilicybin, but the associated jittery wiredness that usually accompanies those yawns wasn't there. I just felt tired. Having heard the wonders of this substance in sexual scenarios, I cuddled up with Jetsam and we started fooling around. I felt slight animalistic urges during the play, but nothing I hadn't felt before. Sex was OK; good, but nothing special. Certainly nowhere near the kaliedescope orgasms one has on mdma or 2cb or an L/mdma combo. I was completely unaware of any affects from the substance by 11pm and was fast asleep shortly thereafter. Two wholly positive notes: 1) I slept through the entire night (I usually wake 3-6 times), and 2) I felt unusually excellent the next morning, ready to take on the day, just feelin' great. That feeling lasted most of the day and I slept better in general for almost a week afterward (although as the week progressed, I slipped more and more back into my disordered pattern).</p><p>#2</p><p>Weighed out 20+mg and 10+mg. Ate the 20+ at 9pm. Tryptamine tingles again, but not much more than that by 1 hour. Popped the other 10+. More gunky throat and other tryptamine side effects, but nothing that I would call altered at all. We tried getting nekkid and while it was fun, it wasn't anymore fun than lots of flesh is without additives. Even at over 30mg, I could have dealt with authorities on any level. I struggled to stay awake past midnight and finally passed out around 1am. Had another wonderful night's sleep, but I didn't feel as unusually positive the next day as I had after the first time.</p><p>So, I would have to say that my first 2 experiments were failures. I might give this stuff one more try at around the 75mg level to see if there's anything to it for me at unheard of dosages. If I get similar results, it'll be the last time I bother with it.</p><p>1999</p>"
}
