{
 "title": "Chemical Nirvana",
 "author": "Etheseekr",
 "citation": "   Etheseekr. \"Chemical Nirvana: experience with Morning Glory (ID 22275)\". Erowid.org. Dec 31, 2006. erowid.org/exp/22275",
 "substance": "Morning Glory",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22275",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 31, 2006",
   "Views: 5493",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirst Experience - 7.2g dry seeds washed and then eaten (no other preparation)\r\nThe seeds were eaten on a full stomach of bad Chinese food at about 7 pm on a Saturday night. Nausea began even before I was finished eating all of the seeds, and steadily increased for about an hour. I joined some friends in an attempt to forget about the nausea and pass the time until the onset of MG effects. The Nausea subsided to a dull stomach ache after about three hours or so, but was still noticeable until onset of LSA effects five hours after ingestion. Effects were still pronounced at 3 am when I decided to go to sleep, and slight traces of the effects were noticed the next day. \r\nSecond Experience - 10.8g seeds washed, sprouted, and eaten\r\nThe seeds were eaten on a fairly empty stomach at about 7 pm on a Monday night. Sprouting seeds were soft and extremely easy to eat with none of the mildly ill taste of eating dry seeds. No significant nausea was experienced, only some burping and mild stomach upset which was offset by eating raw ginger. Onset of effects was within a similar time-span with consumption of dry seeds, with effects being notice in earnest about four hours after ingesting the sprouted seeds. Three friends who also ate MG that night (both dry and sprouted) noticed effects after about two hours, however. Effects were still pronounced at 4 am when I decided to go to sleep, and a pronounced 'afterglow' remained the next day as with the earlier experience.\r\nThe Effects - \r\nThe effects of Morning Glory at these dosage levels is rather hard to quantify. It can best be described as making the world more interesting than I ever thought it could be. Everyday objects become sources of wonder and amazement, and the moon is breathtaking. The world itself take on the appearance of work of art, or a great photograph. Music as with many other drugs, takes on new dimensions. Capacity for abstract thought and imaginative understanding seem to be increased with a noted increase in one's ability to truly understand other's perspectives and to articulate fleeting insights which normally are left unexpressed and undeveloped. It is in this respect that MG stands apart form other substances, it leaves the intellectual mind not just intact, but in an augmented state. MG is a substance for understanding the world, not escaping from it or forgetting it. \r\nThe morning after effects are a pleasant and subtle detachment from and appreciation of the world, a sublime feeling that lasts for about 24 hours after ingestion of the seeds.\n\n\n"
}
