{
 "title": "Fear of Permanent Brain Damage",
 "author": "G",
 "citation": "   G. \"Fear of Permanent Brain Damage: experience with DXM (ID 22333)\". Erowid.org. May 18, 2003. erowid.org/exp/22333",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "515 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22333",
   "Male",
   " ",
   "Not Given",
   "May 18, 2003",
   "9841",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a friday night, and there were no parties, no weed, and no alcohol.  It seemed like it was going to be a boring friday night when I then told my friend about how cough syrup can give a psychadelic trip.  My friend 'S' seemed pretty enthusiastic so we went to the store.</p><p>Now, I knew that some cough syrups contained more then just DXM and that large doses of the other medical ingredients can be fatal.  The only cough syrup I found with only DXM was Benelyn (which still had a non-medical ingredient which turned out to be a laxative and I only found this out the day after).</p><p>So I bought a bottle of 250 mL of Benelyn.  My friend didn't want to take to much his first time, so he took 75 mL of it (approximately 225 mg).  So I took the rest which was 175mL (approximately 515 mg's).  </p><p>At first I just felt it coming up, and it seemed very relaxing.  My friend was jamming waiting for it to kick in, while I was just watching TV.  Before I knew it I felt very heavy, and out of it.  It almost felt like I was drunk and tripping at the same time.  Soon, me and my friend went to stephs house.  We chilled there, and thats when I realized that I couldn't walk very well without relying on walls, or other objects which I could hold.  Also my vision was impaired hugely.  I was seeing everything in doubles.</p><p>Afterwards I began to walk home, which was a 30 minute walk.  On the walk home I remember hearing some Led Zeppelin in the background, and for some reason I figured that the street was singing, and under the influence of DXM that seemed to make sense to me.  It was very hard to walk, yet I pressed on hoping to get home before my dad would come to get me.  Half way to my house my dad came, and its hard to explain yet this seemed like it was supposed to happen.  </p><p>I had trouble getting in my dads car, and when he drove it seemed as if we were moving in very fast motion which nearly freaked me out.  I got out of the car with much difficulty and went inside and just landed on my bed and turned on some hendrix.  At this point I was trying to make sense of what had just happened.  </p><p>After my parents went to sleep I found it safe to get up.  As I walked through my house I found that it was still extremely difficult to move.  I lied down on the couch and turned on the television.</p><p>This is where I was having a bad trip.  I had read much on DXM earlier and learned of how it can give you considerable brain damage with chronic use.  Sure I hadn't done it in 2 months, yet this thought never left my head.  I felt stupid right now, and couldn't even walk normally.  I thought that I would come to class as one of those slow kids.  I almost felt as if autism had come over me.  I was freaking out.  I was praying to god (not that i'm religious) to make it wear off.  I was saying things like 'i'm never doing dxm again', or 'i'm never doing any drugs including marijuana again'.  </p><p>As I laid their watching TV I felt as if I had lost a great deal of intelligence, and couldn't even find humoure in my favourite shows anymore.  I went on the computer, yet I couldn't even type.  So I went to sleep hoping I would wake up feeling normal.  Thats when I had to get up every ten minutes to use the toilet.  I still couldn't sleep, because everytime I would close my eyes I would think about waking up tomorrow and my parents taking me to a hospital because I couldn't walk normally and wasn't acting normal at all.  I would picture the doctor telling them about DXM and them thinking of me as some kind of druggy.  I would imagine going to school and seeing my friends and all of them and the rest of the school seeing me as a stupid junkie who deserved it.  </p><p>I woke up today feeling a slight buzz, yet I was extremely happy that my sight was back, and that I could walk again.  Most lights considered a considerable amount of auras still yet after a couple of hours that was even gone.</p>"
}
