{
 "title": "True Confessions of an American Lettuce Smoke",
 "author": "Sir Olas",
 "citation": "   Sir Olas. \"True Confessions of an American Lettuce Smoke: experience with Salvia divinorum (extract), Cannabis &  Wild Lettuce (L. virosa) (ID 22339)\". Erowid.org. Feb 8, 2005. erowid.org/exp/22339",
 "substance": "Salvia divinorum (extract), Cannabis &  Wild Lettuce (L. virosa)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "  repeated",
   "smoked",
   "Lactuca - L. virosa",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 22339",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 8, 2005",
   "Views: 17054",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently went to a head shop and purchased 6 grams of Salvia and 2 grams of 7x Extract.  While there I had an interesting conversation with the owner about the scheduling of AMT and 5-MeO-Dipt.  Thankful for the information he gave me 3.5grams of free sample lettuce opium.  I was very interested because I have been talking about it for months with my local friends.</p><p>We got to my friends house and were overly excited to experiment.  I have done salvia before not reaching the effects that I wished.  We decided to smoke a bowl of Cannabis before hand.  This made me slightly nervous.  For some reason recently I have been having reoccurring but subtle panic attacks when smoking cannabis.  Finished the bowl... </p><p>Loading up salvia extract in the bong but need a plug.  Throw some Lettuce Opium in there and fire it up.   Following the directions of the salvia holding my hit in for 20-30 seconds exhale.  Repeat till bowl is totally gone.  My usual experience with salvia, stoned slightly trippy with 2D C.E.V.'s.  After the salvia wore off we decide to smoke more lettuce opium and the Black Meridian chronic my friend brought over.  The lettuce opium had a distinct bitter taste, exactly what I would expect it to taste like.  I had no panic attack and the high was very mellow and smooth.  Fast motions didn't appeal to me and there was no pain reduction.  It was as though someone had but a warm blanket over me to pillow my high.  We decided to do more salvia extract and have a bowl of lettuce opium going around at the same time.  This time the world had erupted into a different dimension.  It was not like any high I have had with mushrooms, acid, Dextro....  It was at first controlled by a definite flow of body movement.  Any movement made by anyone in the room was beautiful form and movement.  It had reminded me of a Degas ballerina.  Next hit....</p><p>Looking at my pipe... it turns into a woman.  I close my eyes and speak to her.  She is constantly moving and changing form.</p><p>Who are you?</p><p>Ssss     ssss</p><p>    aaaa         aaaa     </p><p>             hhhh</p><p>Sasha?</p><p>She disappeared and reality slaps me.</p><p>Coming down on salvia seems to be very rapid.  Yet the rest of the day was spent very mellow and comfortable.  I hadn't wanted to move, a matter of fact every muscle in my body was against it.</p><p>Opium Lettuce: Very mellow, very soft high to mix with something.  The experience is nothing like Vicodin or any other pharmaceutical opiate; it is unique to itself.  Is Lactucin on the DEA's watched list?  Is it illegal in any other country?  What is the chemical make up of it?</p><p>Well all in all I would say it was a great synergy with salvia and cannabis for me.  If one has acute anxiety this might me something to look into.</p><p>*Also it is important to note although I do not think it had an effect on my experience that I had taken 37.5 mg. of Phentermine HCL the day before this.  About A week before I had taken 3.5 Grams of Psilocybin containing mushrooms.  Other chemicals of interest would be Caffiene, Psuedoephedrine, and Tobacco.</p>"
}
