{
 "title": "Scary",
 "author": "anonymous",
 "citation": "   anonymous. \"Scary: experience with 5-MeO-DMT (ID 22355)\". Erowid.org. Nov 25, 2003. erowid.org/exp/22355",
 "substance": "5-MeO-DMT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 22355",
   "Male",
   " ",
   "Not Given",
   "Nov 25, 2003",
   "Views: 16209",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I bought a quarter of a gram from an on-line site.  Had it for about a week before I had a chance to try it and was very excited, had been researching it for awhile.  Was at the time a very experienced psychedelic enthusiast, been to many Grateful Dead shows, never had a bad experience.  I had tried Salvia on several occasions as well.  </p><p>I placed a tiny amount in a bowl, no one around.  Put the flame to it and it really freaked me out.  Had no visuals whatsoever, but noticed that I could see with my eyes closed.  For some reason this really scared me.  Didnt like this feeling AT ALL.  I suddenly starting thinking that maybe I had been crazy my whole life and that it took this for me to realize it.  I really started to panic now and jumped up out of my seat, then started repeting to myself 'I don't like this!'.  My heart started to beat uncontrollably and started to think I should go to the house, I thought I was dying, my whole life flashed before my eyes, as I prepared to walk into the house and tell my dad I thought I was having a heart-attack.  I could see myself in the hospital with my family standing around crying.  I was trying to decide rather to walk in or to die.  Right about then I turned towards the road and started talking myself down.  Within a few minutes I could tell I was coming down. It took about a half hour to come all the way and I set by self and contimplated my entire life.</p><p>I decided then to never do hallucinogens again and consider myself lucky I been on as many successful journeys that I had been!  My friend had a good experience, but it was scary to me.  He laid there kind of like he was in a coma or something.  I say stay away from this drug!  Like it says it can bring heaven or hell.  I experienced TERROR.  Dont take your chances, do something that is tried and true like LSD, mescaline, or mushrooms in a nice happy environment and you will better off either way.  Good luck intrepid travelers!</p>"
}
