{
 "title": "The Road to Hell and Back",
 "author": "Scala",
 "citation": "   Scala. \"The Road to Hell and Back: experience with 5-MeO-DMT (ID 2236)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2236",
 "substance": "5-MeO-DMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2236",
   "Male",
   " ",
   "Not Given",
   "Jun 27, 2000",
   "Views: 14194",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had just finished smoking some opium mixed with salvia 5X extract with a couple of friends when I whipped out something I ordered a couple of months ago but hadn't decided I would do. That's right...5MEO-DMT. I showed my friends and they started drooling because you've got to understand...my friends and I have tried everything under the sun and had a great time from most of them. I felt an obligation to try 5MEO first as it might damage in some way my friends and I didn't want to be held responsible for them so I dropped what appeared to be a modest amount(two kernels) of the substance into my pipe and my friends watched with excitement as I lit it up and began to suck in the chemical tasting smoke. As I began to exhale, I realized I just smoked way too much stuff, as I exhaled for more than 20 seconds worth of smoke. </p><p>I handed the pipe to one of my friends and laid back on the couch preparing for the onset..I didn't know what to expect, but before I even finished that thought, a MASSIVE PRESSURE began to sit itself upon my body, and then the horror began...I stared straight forward eyes open at my brightly lit living room when everything dissolved into a bright white light. The best way I can describe it is as if you were staring at a watercolor painting and someone threw a pitcher of water on it. Then the real fun began. I began to get the distinct feeling that I was not gonna make it out of this alive. It was too strong. Nothing in my history of drug use even came close to the strngth of this shit to the point that I truly felt I'd poisoned myself beyond repair. The drug wanted me to close my eyes but I refused in what I honestly believe to be a FIGHT FOR MY FUCKING LIFE!!! I was scared to death, horribly sad that I just had booked a ski trip and wouldn't be able to experience the majesty of the rocky mountains and my friends just sat there unaware of what I was going through as I couldn't communicate with them how I wasn't going to be there much longer. I felt for them as they would have to explain how I died and I felt for my girlfriend as she would be all alone again without me. </p><p>My small Maltese dog jumped up into my lap seeming to understand my state as all of you know most animals appear to be empathic to drug usage. Now this was only into the 10 minute mark when I felt an incredible thrust up through my esophagus and I staggered into the bathroom just making it to the toilet when I projectile vomited. I kept myself busy for the next 10 minutes cleaning my vomit up in an effort to retain the ego that so desparately wanted to give up my ghost so to speak.. It worked. After the 25 minute mark I knew I was gonna live and that I would survive this ordeal. I immediately threw away the rest of the 24 doses I had left and swore up and down I'd never touch another drug again in my life. I also explained what happened to my friends and they weren't so keen on trying it after my experience. Now maybe a smaller dose would've been more mild, maybe not. But what I do know is that you do drugs to open your horizons and to have fun and feel good, different good than you usually feel.</p><p>I felt nothing but hatred for this drug and stupidity for trying it. If you want a near death experience, just take a heroin overdose. That's not what I was after with this drug is all I know. I was after the Terrance McKenna experience which is probably why I should use the standard DMT next time, if there is a next time. I'm okay now and feel like I am gonna take a big break from drugs and re-examine my life for now. I'll get back with you later if I decide to try the other tryptamines I also bought but most likely not. Take care Psychonauts. Use only if you have a masochistic need to torture yourself to the point of death and back again. Maybe you won't be so lucky though....Peace out.</p>"
}
