{
 "title": "A Bizarre Sailing Ship",
 "author": "Scotto",
 "citation": "   Scotto. \"A Bizarre Sailing Ship: experience with 5-MeO-DMT & DMT (ID 2237)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2237",
 "substance": "5-MeO-DMT & DMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1998",
   "2237",
   "Male",
   " ",
   "Not Given",
   "Jun 27, 2000",
   "Views: 20772",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have only had this experience once, so for all I know, my response was completely anomalous, but nevertheless, a capsule summary at least is in order. </p><p>An indeterminate amount of DMT and 5-meo-DMT were combined in a pipe, in what appeared to be roughly even amounts. This would mean that, if an active dose of DMT were in the pipe, the equivalent amount of 5-meo-DMT would have to be a rather huge amount; and for all I know, the 5-meo-DMT was moderated slightly, but I consider it a little unlikely. The person I was with has as huge an appetite for these things in general as I do, and would have known that there is no particular dose of 5-meo-DMT that has yet managed to stop me in my tracks. Earlier in the evening, I had had an experience with 5-meo-DMT on its own, and had wound up on my back in the grass, staring at the moon and remembering all kinds of wonderful feelings about god and the nature of the universe. It had been a rather blissful experience. </p><p>This combination wound up being much more ominous. I took several large hits - the person administering the combination commented later that he had never seen anyone smoke that much before, and so perhaps I could recommend a certain amount of caution should you choose to pursue this combo. Within minutes, I was completely floored - literally. I writhed on the floor for what seemed like an eternity, connecting to a space that was intensely cosmic, but with extremely dark undertones. We were in a hotel room, and at some point I crawled underneath the sink next to the bathroom and curled up. I have little memory of what the actual 'content' of the flash was, but I suspect the tone is more important than the content in this case: that I was definitely involved in an experience which didn't particularly enjoy me or my involvement in it. I attribute most of the dark edge to the DMT, as I typically find 5-meo-DMT to be a much more open and vibrant kind of experience, but I couldn't say for sure. It was not so dark or ugly that I wouldn't do it again, of course, and in fact, it was far more enjoyable than many of the strictly DMT experiences I have had. </p><p>After about a half an hour, I returned to reality, with the typical hilarity and 'I can't believe I survived!' sensations that accompany the end of a DMT or 5-meo-DMT experience for me. In general, each time I return from an experience involving this particular pair of tryptamines, I feel as though I have gone off on some long voyage in a bizarre sailing ship, and then returned to a warm and friendly reception. That aspect is itself perhaps my favorite part of these strange experiences.</p>"
}
