{
 "title": "It's Not Fair, but It's Still Great",
 "author": "Tolerant",
 "citation": "   Tolerant. \"It's Not Fair, but It's Still Great: experience with 5-MeO-DiPT (ID 22384)\". Erowid.org. Aug 14, 2006. erowid.org/exp/22384",
 "substance": "5-MeO-DiPT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 2:00",
   "56 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22384",
   "Male",
   " ",
   "Not Given",
   "Aug 14, 2006",
   "Views: 2861",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had purchased some Foxy recently, and even after three attempts to trip, I had been unsuccessful. Since I had never used a tryptamine before, I decided to take it easy; first going with 10mgs, then 16, then 25 on my third outing. The 25 mg dose definitely worked, but not to the degree I had read about (BTW, I know that this stuff was fine, cause that same night I took 25, my friend I was with took 20 and was LOVING the evening. Additionally, it was a full week between each dosing for me, and each time I had fasted for at least 3/4 of a day). I was beginning to think that I didn't know what I was doing or that I had gotten ripped off, but was willing to give it one more college try.</p><p>The night after I had dosed with my friend, I was working on a remix on my computer, and couldn't get inspired to come up with any real 'new' or fresh ideas. Then around 9:00pm, I remembered the Foxy in my fridge, so I decided 'what the hell, lets go for broke tonight and see if I get a reaction at all'. Remembering what I had read about needing more to get a reaction if one tried to dose within a few days of the last dose, I decided not to fuck around and measured out 36mg and put her down the hatch. I had not eaten a thing all day, so I figured if this stuff would work for me, this was going to be the ideal time and setting. Oh boy was it ever.</p><p>(T+0:20)</p><p>I had almost for gotten I had dosed, then out of now where WHOOSH!! I came on like a monster. In addition to working on my remix, I was also IM'ing with my friend I had dosed with the night before. He was unaware of my activity, until.......</p><p>(T+0:25)</p><p>Holy shit I am tripping my balls off and am getting nervous because 1) I wasnt sure just how hard I was going to trip given that I had only dosed 25 minutes prior, 2)I had never 'tripped' before; no acid, a minor amount of shrooms, only MDMA, K and weed, so I began to get REALLY nervous about the whole notion that I was 'tripping'. And this stuff was still coming on like a freight train; 3) I was seeing an unbelievable amount of OEV's; more than I probably ever had before with high doses of MDMA and K combined. There was smoke trailing off of everything that moved; the walls, the TV, the computer screen were all breathing heavily. I looked in the mirror and saw that my face was breathing and shifting shape and form in a never-ending ballet that I actually enjoyed, but at this point decided to call my friend to have a trip sitter present .</p><p>(T+0:40-1:30) </p><p>Not long after I had gotten off the phone with my friend, I began to call other friends in hopes of having a trip-sitter, if only by phone just for comfort. (How the hell did I manage to become Jeff Spicolli from Fast Times at Ridgemont High? Here I was tripping balls and calling everyone to tell them about this wonderful new toy I had discovered lol). By the third call, I began to feel very foolish. I thought to myself 'oh wait; why the panic? I've taken a field trip to this part of my brain before' and began to really sit back and enjoy the experience. I was still coming up, but was getting used to the overall physical and visual sensations (which btw, were OUTSTANDING). The physical side of this substance is fantastic. I would describe this substance as a perfect blend between the shrooms I had taken before and MDMA. I REALLY wanted to go dancing, but unfortunately, I was tripping so hard, I'm not sure I was ready for public consumption on mass transit. But I really didn't care; I was enjoying myself too much, and the thought of having my friend come over gave me something to look forward to.</p><p>(T+1:30-3:00) </p><p>My friend arrived and I greeted him with and apologetic and sheepish smile. 'Sorry; false alarm. This wasn't anything I couldn't handle; wanna join me??' After his glowing experience the previous night, he eagerly agreed. I also redosed with another 10 mgs, then another 10 mgs 30 minutes later.  It is true what they say about redosing after the peak of the experience has arrived; it will not intensify the experience, but will help extend it. 30 minutes after my friend dosed, he began to come on and we put on some techno music, killed the lights, broke out a couple glow-necklaces, and entertained ourselves for the next 2 or so hours, alternating between giving each other light shows, and working on my remix together. </p><p>While my state of mind was definitely altered, I wasn't thinking I loved the whole world or wondering why the world was the way it was or anything super introspective. However, I DID get that creative inspiration I was looking for earlier in the night and put together a phenomenal remix. This substance has done WONDERS for my creative process when it comes to creating music (although it ALSO makes the mechanics of executing these new ideas fairly difficult lol).</p><p>(T+3:30-6:30) </p><p>Been slowly coming down, but am still experiencing mild OEV's the whole way. Working on my remix is much easier now, and the ideas I had earlier are still very fresh in my mind. I bang out most of the remix during this period, and am VERY happy about the results-best work I had done to date, and I owed it all to my new little remix partner Foxy!!</p><p>(T+6:30-10:00)</p><p>It's been a very smooth trip down, and I know by looking at the clock that I should feel tired, but do not desire sleep. This isn't like amphetamine-induced insomnia; I simply don't feel sleepy. My friend and I both try lying down, but neither of us can come anywhere near sleep till almost 7:30 in the morning. We both got about four hours of sleep, then woke up feeling a little groggy form the late night and lack of sleep, but not spent like I get after a night of MDMA and K. This is a very pleasant surprise to say the least.</p><p>Overall review and commentary;</p><p>This is an extraordinary substance.</p>"
}
