{
 "title": "Pete the Happy Homegrower",
 "author": "Something Monstrous",
 "citation": "   Something Monstrous. \"Pete the Happy Homegrower: experience with Cannabis (ID 2239)\". Erowid.org. Jun 29, 2000. erowid.org/exp/2239",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "1993",
   "2239",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 29, 2000",
   "Views: 87571",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThe following is a work of fiction. While the following may contain information that may be used in breaking of existing state and/or federal laws, I do not encourage or advocate the breaking of any state or federal law. Please do not participate in illegal activities.</p><p>(If you do, try not to get shot)</p><p>\nPete the Happy Homegrower</p><p>1) Amsterdam Sprouts</p><p>Peter looked at his books. There were a few of them, he would have to make a list of them later. The seeds that he had placed on a plastic tray filled with moist cotton wool had begun to sprout after a few days, and now they were the ideal length to plant.</p><p>They were about 1' long maximum, most of them smaller.</p><p>Pete took small drink cups (he had forgotten to buy Jiffy pots) filled with dampened soil of the same composition as the final growing pot. He poked his finger about 3cm into the soil and gently placed the sprout into the hole, head up, and sprinkled soil around it.</p><p>The seeds had come from the same variety... but it didn't matter much too him, he was only a hobby home gardener. The best plant would later be singled out to provide seeds for his next crop.</p><p>But first, he decided to have a closer look at the earth he was using:</p><p>2) The Earth</p><p>Peter looked at the bag of potting mix that he had bought. It would supply his plants with nutrients for a while, even though most commercial potting mixes required additional nutrients for his hungry plants. The texture was the primary consideration: It had to drain well and allow air to enter empty spaces so that the roots could breathe oxygen. Too fine a mix would make the soil sticky or soggy, preventing ventilation and promoting the growth of harmful bacteria.</p><p>He squeezed a clump of his potting mix: Perfect. If formed a clump when squeezed, and the clod broke up with a slight poke. The last time, the clod had stayed together and he had added soil conditioners.</p><p>He had also used some natural soil, which he had had to sterilise. This had been done by placing it in the microwave until steaming. Anaerobic bacteria might have harmed the roots of his plant, and the many insect eggs in the soil had been microwaved away. (The microwaving had taken 5 minutes on high for a microwave-safe container full of earth).</p><p>The components he had used in previous mixes were:</p><p>FOAM. It holds water trapped between its open cells, but also holds air. He had used pea-sized pieces of foam once, instead of styrofoam.</p><p>GRAVEL. In his hydroponics system, only gravel was used: Easy to clean, doesn't wear out, does not lock up nutrients, doesn't cost much. It creates large spaces for air pockets and gices the mix weight. Pete knew that gravel containing limestone should not be used.</p><p>LAVA. Lava was a very good medium on its own or in a mix, Pete knew. It is porous, holds some water on its surface... By itself, Pete felt it was a bit too dry. One frined of his had mixed 3 to 6 parts of Lava with one part of wet vermiculite. The vermiculite had broken up and coated the lava, creating a medium with excellent water-holding abilities and plenty of air spaces. This had to be watered from the bottom in order not to wash all the vermiculite away.</p><p>PERLITE. Puffed volcanic glass. Peter sighed. It was not a bad material, but the dust could harm the lungs and he had not wanted to buy a mask and respirator.</p><p>ROCKWOOL. A friend of Pete's had told him that he had achieved a phenomenal growth rate using rockwool. It absorbs water like a wick, and is convenient to use. It could be used in all systems, but Pete thought it was most often used for hydroponics.</p><p>SAND. Pete used this to add some weight to his planting mixture. It promotes drainage and keeps the mix from caking. It came in several grades, and all of them seemed to work. The sand to use was usually quartz. Peter avoided limestone sand because limestone raised the pH, causing micronutrients to become unavailable for the plant. Sand also had to be salt-free, Pete knew: Salt was bad for your plants.</p><p>STYROFOAM PELLETS. Pete's old chemistry teacher had called Styrofoam a 'hydrophobic' material: It repelled water and was an excellent soil mix ingredient. It allowed air spaces to form in the mix and kept the soil from clumping, since it does not bond with other materials or itself. The only problem was that it was so light that it tended to travel to the surface of the mix. Peter used Styrofoam pieces no larger than a pea in fine- textured mixes.</p><p>VERMICULITE. Pete tended to use the larger sizes of this material, which is processed puffed mice. Mice? Ah, Mica. Vermiculite broke down into smaller particles over time, Pete knew, and the larger ones provided more aeration. When he had used it, he had wet it before using it to avoid breathing inthe dust.</p><p>The book he had just read had included a list of conditioners. A one- part-in-ten mix of cow manure was excellent and would break down over the growing season. Chicken manure was very fast-acting, and Pete used a one-in-20 mix. Blood meal, dried blood, worm castings, guano and even hair and feathers were included in that book... he would have to have another good read of it later.</p><p>Ah, the miracle of Life. Peter sighed and took another deep drag on his hand-rolled cigarette. The sun was the best light for plants, but his shaggy apartment had no large windows and not even a balcony, and certainly no garden. His few plants were in a back part of the cellar. As he went down, carrying lamps and foil, he could hear a helicopter circling nearby, and praised the Law Enforcement Agencies who kept dangerous criminals at bay.</p><p>He had heard of thugs with rifles, dogs and bulletproof vests, who had shot people and harrassed them because of a small herb garden. 'Murderers', he thought, and was glad that the friendly police force was always ready to help and protect the citizens of this country. 'To serve and protect'! He started whistling his national hymn as he went down the stairs.</p><p>3) Can You See The Light?</p><p>The garden was a small section of the cellar. The walls had been painted white, which was a very reflective colour and worked about as well as aluminum foil. Heavy foil, hung in vertical strips, sealed the area off and reflected light back towards his baby tomatoes.</p><p>Light requirements varied with the vriety of plants. During the growth period, 1000 - 1500 lumen per sq ft would do, although the plants could use as much as 3000 lumen/sq ft effectively. The equatorial varieties tended to need brighter light. During flowering, the various plnats would need between 2000 (the indian variety) and 5000 (equatorial) lumens.</p><p>Peter set his camera for ASA 100 and the shutter for 1/60 second, with a 50mm ('normal') lens. He then set the f-stop, using the manual mode, and looked at the chart.\r</p><p>1/60 second, ASA 100</p><p>F-Stop          Footcandles</p><p>f.4             64</p><p>f.5.6           125</p><p>f.8             250</p><p>f.11            500</p><p>f.16            1000</p><p>f.22            2000</p><p>1/125 second, ASA 100</p><p>f.4             128</p><p>f.5.6           250</p><p>f.8             500</p><p>f.11            1000</p><p>f.16            2000</p><p>f.22            4000\r</p><p>Incandescent bulbs and quartz halogen lights were too inefficient to provide enough light - Pete recalled having read that they only convert around 10% of the energy to light. Peter was on a low budget and could not afford professional growing lamps, so he used fluorescents. They were easy to set up, were 3 to 4 times as effective as incandescents, and his plants grew well under them.</p><p>A minimum of 20 watts of fluorescent light per square foot would be necessary, Pete had read somewhere, and he knew that the more light his plants would receive, the faster and bushier they would grow. Light also improved the tomato buds, making them heavier and more developed. For each foot of width of his garden, he would use two fluorescent tubes. He had achieved the best results by using a mixture of tubes with various shades of white light. The light was fixed to a movable bar that could be lowered, and he had carefully mounted reflectors. More fluorescents were mounted on the walls for side-lighting.</p><p>He had read about metal halide and sodium vapor lamps... maybe sometime, when he had more experience.</p><p>There were plants, he had read, that measured the amount of daylight per day in order to 'know' the season, thus determining when to flower. As the periods of darkness become longer, a certain hormone level builds up and the vegetative growth stops - and flowering begins. Different varieties of the same species of plant would need different amounts of light/darkness to flower.</p><p>For this purpose, he had an automatic switch that he could adjust to turn the light on and off.</p><p>He would let the plants grow under 18-24 hours of light for the first period, he thought. Say, 18 hours of light a day for 3 1/2 months. Then, 12 hours a day for a while, to create autumn, and 1 1/2 months later his plants should be flowering. The full period of flowering might take as long as two months.</p><p>A friend had claimed that days shortened to 9 hours a day of light had brought plants to flower within 6 weeks of germination... they had been rather small though, all flower and not much of that either.</p><p>The cutback from 18 (or more) to, say, 12 hours a day had been quite aprupt, Pete thought. He marvelled at the ingenuity of the plant, who had responded to the new regimen without any problems., without showing signs of shock or unusual growth. After a month of flowering, he usually set the daylight period to be another hour shorter, especially in equatorial plants.</p><p>Also, Peter usually removed male flowers immediately... The female tomato flower tasted much nicer in his herb tea. The desexing was done carefully, as even the female sometimes grew male flowers. One plant would be set aside - the healthiest one - and its flowers dusted with pollen to make seeds. </p><p>Peter checked the thermometer. Moderate, that was OK. Although the plant could withstand hot weahter and cool climates, it grew best between 60 and 85 degrees. Strong light and low temperatures seemed to make the plant smaller, while moderate light and high temperatures seemed to make it higher. Peter had installed a fan to provide his plants with CO2 and to keep the temperature down. The fan was operated by a timer switch: 10 minutes every hour.</p><p>*End of Story. The previous story was purely a work of fiction. Knowledge about gardening should be vailable to the general public freely. I do not encourage or advocate the breaking of any laws, state or federal, however outdated and stupid they may be.*\rBibliography:</p><p>Marijuana Growers Handbook, Indoor/Greenhouse edition. Ed Rosenthal. Australian Edition published by AGUNG TRADING (Australia) Pty. Ltd., PO Box 194, Condell Park NSW 2200, Australia. ISBN 0-932551-00-9 (Almost all the background for the short story came from here).  Ed Rosenthal writes for 'High Times': Ed Rosenthal, High Times, 211 East 43rd Street, New York 10017.  I did not receive permission to use quotes from the book, so _PLEASE_ go and buy it. It's worth it.\rAustralian Handbook for Indoor Growing of M*r*j**n*, published by Doug Wakefield, PO Box 214, Lane Cove, NSW 2066, Australia. This booklet is very comprehensive and should be OK for the beginner. It costs around $10 (incl postage).</p><p></p>"
}
