{
 "title": "Shroom Growing Successes",
 "author": "Scott E.",
 "citation": "   Scott E.. \"Shroom Growing Successes: experience with Mushrooms (ID 2241)\". Erowid.org. Jun 29, 2000. erowid.org/exp/2241",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "",
   "ID: 2241",
   "Male",
   " ",
   "Not Given",
   "Jun 29, 2000",
   "Views: 15977",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThe best way to grow shrooms is to grow a species which is native to your climate.  When you've fruited as many caps as you can, just throw the spawn outside and let nature do the rest.  Two species which are particularly hardy are P. Cubensis in warm climates, and P. Cyanescens in temperate areas like the Pacific Northwest.</p><p>Sterile technique is required for germinating spores, especially if you start with a petrie dish of agar. This method is preferred because you can select the best mycelia to transfer to the growing medium but requires some practice to maintain sterility and extra cost for the equipment (petrie dishes, agar, scalpel, alcohol lamp).  You can start the spores directly on the growth medium, but you have no control over quality.</p><p>The most important thing about sterile technique is to clean everything twice.  Take a shower, wipe down the work area with soap and water, then spray it and yourself with Lysol or some other disinfectant.  This doesn't take more than 10 minutes and will almost insure success. I usually work nude from the waist up to keep dust from clothes from getting involved. If you wear clothes, make sure they are freshly laundered. Work in an area without a draft, and use a glove box (best case), or on a flat table underneath some sort of cover to protect from stray contaminants from falling down.  Keep the lids on the jars or petrie dishes and only open them for the minimum time necessary to add spores or transfer mycelia to another jar. Don't make any sudden moves, though, as this causes drafts and may lead to contamination.  Use a pressure cooker, and sterilize at 15 lbs for at least 30 minutes. I generally go for an hour.</p><p>For growth medium, I use birdseed without sunflower seeds for P. cubensis.  It's easy to sterilize because it's smooth without a lot of nooks and crannies for bacteria to grow in, plus it's easier to shake apart later.  This is important, because once you have a jar or two of healthy uncontaminated mycelia, you can use them to inoculate at least ten jars each of fresh growth medium.  Once the mycelium has completely saturated the growth medium, transfer it to a larger container for growing.  At this point, sterile technique is no longer required as the mycelia generates its own fungicides which keep other contaminates from growing.  Use an open box or carton so you can easily get to the mushrooms when they sprout. </p><p>Apply the casing layer to the spawn, and keep watered. When the mycelia has permeated the casing layer, drop the temperature about 10 degrees to induce fruiting. When picking, use a razor blade or other sharp implement to cut the fruit close to the soil.  Make sure you don't damage any of the pinheads which will eventually grow to full size.  You should get two or three flushes of mushrooms over the next couple of weeks. When no more caps fruit, toss the contents outside in a shady area and wait for next year.  You might also want to make some spore prints of your own. To do this, cut off a mature cap and place on a piece of paper.  Cover the cap with a glass or cup and let sit for a couple of hours.</p>"
}
