{
 "title": "Brahma Ripped Through My Head",
 "author": "Monkey",
 "citation": "Citation:   Monkey. \"Brahma Ripped Through My Head: experience with 5-MeO-DMT (ID 22419)\". Erowid.org. Feb 20, 2008. erowid.org/exp/22419",
 "substance": "5-MeO-DMT",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 22419",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 20, 2008",
   "Views: 3191",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had been planning to take 5MEO-DMT for quite some time, so when the event came I was a bit nervous. I was seated, and used a bit of pot first, to relax with. The pipe had just been used for 5MEO-DMT, so when I inhaled the cannibis, there was a trace amount of the 5MEO-DMT that came through. This little taste was as a charge of blue energy rushing through my body. I knew that the full dose was going to be behond this world. \r\nSo the pipe was loaded, fire was held out for me and I breathed in the white smoke. It seemed that I clenched everything, I wasn't even breathing. My friend had to yell breath! I let it out (with great pain). It seems that I fell to the floor. My ego, or protective psychological layers, evaporated; as water vapour, cool and horrifying  to be without. Back again as a child, fearing; without all the years of protective layers I had assembled. \r\nMost of it, I cannot recall until the realization of my death became apparent. Face to face with the fact that I did not want to die. The pain of missing all my loved ones, especially the idea of beeing seperated from my six year old son. It was horrible. My friend kept reminding me that it was not going to last, the substance (from his sources and his experience) would not last past thirty minutes. This did reassure me. \r\nEvetually I got up off the kitchen floor. I sat back in the chair, and felt that my surroundings where completly dead, except my frind, so I went out side and sat on the stairs overlooking the back yard, at night and in a mild drissel. My sensitivety was intense. I remembered all the times I had been there, feeling that perhaps I was a ghost who had been haunting this place for years. I really think I felt the sadness and confusion for which schizophrenics are plagued. To live in that mind set would be imposible. With no set ego to ground oneself, no berrings. \r\nEventually this too dissipated, I went in and reentered theis world with a good strong dose of The Simpsons. My dreams the next few nights were mythological. I sensed my energy body on waking and had great ease when navigating dreams with amazing power. For the dreaming alone it was worth it. The whole thing has been enlightening ever since, but was a horribly painfull experience at the time. A must in the world of psychedelic geography. Relaxation techniques would probably have helped.\n\n\n"
}