{
 "title": "More Therapeutic Than Recreational This Time",
 "author": "Professor Chaos",
 "citation": "   Professor Chaos. \"More Therapeutic Than Recreational This Time: experience with Mushrooms  (ID 22439)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22439",
 "substance": "Mushrooms ",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22439",
   "Male",
   " ",
   "Not Given",
   "Oct 2, 2007",
   "Views: 3813",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So I decided to do shrooms alone for the first time.  This was my sixth time doing them overrall.  I did them around noon.  I chopped up a cap and mixed in with a little stir-fry, and ate two fat stems, which I washed down with tea.  Having done these particular shrooms before (I do not no the name), I knew they were quite potent and I was guaranteed an opening experience having waited about a week before I did them last.  </p><p>Needless to say, this was probably one of my most interesting trips, although I must admit it will be my last, at least for a few years.  I noticed the familiar rush of heat to my body and face as they were beginning to take effect after half an hour or so.  I knew I began to see the visuals when I looked up at my ceiling.  The popcorn ceiling does not lie.  I see shadows, relflections, vibrant colors, and 2-D images hovering over everything.  The trip was quite pleasant so far.  I should also mention that I did smoke a couple bowls of chronic prior to ingesting the mushrooms.  </p><p>Anyways, things started to take an obvious turn for the worse momentarily.  This was about an hour to and hour and a half into the experience.  I began to notice these little red circle patterns that were on 'everything', including, my own skin.  For some reason this upset me, and I became somewhat frustrated.  I'm not sure, but it almost seemed that the particular color of red was what upsetting me.  Then the bad thoughts started to come.  I realized that I was alone and now wanted company.  I wanted to go drive around, but I convinced myself not too, understanding that it was too dangerous.  I kept thinking how awful my life was and how I didn't know what to do with myself.  Then I just wanted the shrooms to wear off.  This was about two hours into the trip.  \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Then I finally came to grips with everything.  I realized that I should just accept the shrooms, enjoy what they can bring, and wait till the wear off.  I watched Saturday Night Live, which definitely helped out.  Phil Hartman was the host and it was a very funny episode.  I didn't want to smoke any more weed yet.  I just chilled out and watched TV, but the visuals were still very present.  Then finally around 4:00 pm  I felt I was almost ready to drive and get something to eat.  But first I smoked, which only brought the visuals back, but I was no longer so disoriented and was in control completely.  So I drove even though I was still kind of seeing things, but I drove fine and driving seemed like a video game.  I got back and ate, but visuals were still present.  </p><p>Then I realized so many things.  I didn't like where I was at in my life and knew I had to move back home.  I'm still smoking weed, but no longer shrooms.  I now believe that shrooms sort of show truth in everything.  It took shrooms to make me realize I didn't need them anymore.  They were definitely more therapeutic then recreational this time.  I now am looking forward to things, which I haven't done in a long time.  Doing mushrooms alone, which can be more unpleasant, can also be more rewarding and often a slap in the face with reality through the unreal.</p>"
}
