{
 "title": "Vein honey",
 "author": "Charlie",
 "citation": "Citation:   Charlie. \"Vein honey: experience with Meperidine (Demerol) (ID 22430)\". Erowid.org. Jul 1, 2007. erowid.org/exp/22430",
 "substance": "Meperidine (Demerol)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Pharms - Meperidine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 22430",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 1, 2007",
   "Views: 18417",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was riding my motorcycle at about 10 pm, down a main street in Venice Beach, CA, when a car shot through an intersection. I only saw bright lights for a split second before I hit the car head-on. I initially hit the pavement with my head and shoulder--my helmet undoubtedly saved my life. I was lying in the street unconscous until the ambulance came. I had a strange experience while unconscious, but I won't talk about that here. \r\nI was in the hospital emergency room for most of the night--I had a broken pelvis, separated shoulder, some kind of nerve damage to my right leg, and a broken thumb. At the end of a long night of tests, probing, and pain, a nurse asked if I was in pain, and wanted to sleep. I realized how exhausted I was, and said yes. He gave me an injection, and told me to tell him if I felt sick. I suddenly felt like my body was on fire, and was going to puke. I told him so, and he immediately gave me a second injection of something else, I don't know what. The on-fire feeling instantly melted away with the nausea into a feeling of absolute warmth and comfort. Within 5 minutes I was asleep.\r\nI was in intensive care the next day, and later a regular hospital room. I couldnt move my legs or my left arm, and could only use 4 fingers on my right hand. They rigged a bar over my bed so I could shift myself around a bit. A few days later, they had to take X-rays on my shoulder. Two interns had to move me around quite a bit to take the pictures, I was in agony. I can usually take pain pretty well, but I was yelling.  A nurse gave me the Demerol, and I felt that warm, honey feeling immediately course through my veins, reaching every part of my body. Within a few minutes I was sleeping peacefully. \r\nThe third and last time I got the Demerol shot was in post-op, after shoulder surgery. The pain was drilling into me. I was sweating intensely with my teeth clenched, trying to bear it. Finally I requested relief. Once again, Demerol came to my immediate rescue, like a wave of chemical love bathing me, speaking softly to relax, that all was well. \r\nMy surgeon gave me other drugs for pain to use at home, but I never took them, even though pain in different joints kept me awake every night for months afterward. The Demerol showed me how someone could learn to love a needle, and how a drug which deadens feeling, be it mental or physical, could provide instant refuge, and how that might turn into a lead crutch if used over time. As an athlete, I chose the physical pain, instead of artificial relief, and am convinced my subsequent recovery was much faster because of that choice.\n\n\n"
}