{
 "title": "Shroom Growing Journal",
 "author": "Dojah",
 "citation": "   Dojah. \"Shroom Growing Journal: experience with Mushrooms (ID 2243)\". Erowid.org. Jun 29, 2000. erowid.org/exp/2243",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "1995",
   "ID: 2243",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 29, 2000",
   "Views: 63729",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>AN EXPERIMENT IN THE HOME CULTIVATION OF PSYCHEDELIC MUSHROOMS</p><p> </p><p>*****************************INTRODUCTION**********************************</p><p>The following is (more or less) an edited journal of my experience in the home cultivation of psychedelic mushrooms. When I finally decided to go ahead and try home cultivation, I found the archives to be lacking in information other than the basic 'How to Grow' files. As a result, I decided to record the process with the hopes that others will find the information useful.</p><p>This journal is in no way meant to be a replacement for any one of the really good books and/or methods already available. That's right. I want you to have to trudge through the libraries and Net sites, just like I did. It doesn't only put hair on your chest, it forces to learn more than the process itself. At any rate, as you read on, you'll see that my anecdotal journal is of little use other than it's intended purpose. Namely, as a rough guide to first time growers who want to know the truth about how difficult home cultivation is.</p><p>So that's enough BS, here's the journal. Each entry begins with the day it was entered. (ie: 13- Blahblahblah means the event happened on the thirteenth day after inoculation.) Any additional notes added during editing will appear in [square braces]. If you see me using 'We' and 'I' interchangeably, I'm doing so because I split the costs of the project with a couple of friends, not because I have any imaginary friends.</p><p>*******************************JOURNAL************************************</p><p>1- I recently received my package from PF [see my wholehearted endorsement of Psylocybe Fanaticus spores and method at the end of the journal], and today we managed to get all of the equipment we need. [The jars, substrate, and the pressure cooker. BTW, I borrowed my cooker from a friend's mother. It seems that everyone has one, but no one uses them. Be sure to ask friends before you shell out $$ for your own.] Because of the cooker's size, we sterilized 8 jars in two batches of four. We followed the standard PF recipe. We used approximately 0.2ml/hole. [This will make no sense unless you know the PF technique (see the PF section of the journal). BTW, the spores are psylocybe cubensis.]</p><p>3- The first signs of growth. Tiny spots of fuzz have appeared at (roughly) the inoculation points.</p><p>5- Germination results: Jar # of spots #1 7 [all spots are less than 1 cm^2] #2 5 #3 7 #4 1 #5 8+ [the plus means it's hard to differentiate spots] #6 8+ [single spots may really be multiple germinations] #7 10+ #8 7</p><p>Looking good except for #4. I have a suspect contamination, but I'm not sure yet. I've marked the spot so I can keep an eye on it. I should start building the grow chamber soon. The proper heat, humidity, and sterility won't be found in my room. There's even dust particles starting to cover the jars. [I have a really dusty place]</p><p>6- Jar #4 looks fine today. I guess it was just a late starter. The suspected contaminant looks the same, so I am starting to think that its only a wierd chunk of greenish vermiculite. The other jars are fine. The spots are starting to look feathery around the edges and are getting noticeably bigger every day.</p><p>10- [I have hard data about the size of the spots, but since they vary so much (jar to jar), I'll generalize a bit to give you a rough idea.] The inoculation points are now clusters of growth. Each quadrant of the jar has numerous germinations, and they're starting to intermingle. Roughly speaking, each quadrant of the jar has a growth that ranges in size from 3 cm^2 to 9 cm^2. [I ran the numbers through a spreadsheet to give you an idea of how fast the initial colonization happens. At this stage, the jars ranged in coverage from %14 to %27 colonized. Quite a variance.] All jars are doing fantastic. The growths are definitely starting to feather radially towards the edges. Absolutely no contamination found in any of the jars. Preparations are underway to build a grow chamber. Total cost of the project to date: $65 CAN [All prices are in Canadian dollars]</p><p>12- I measured the growths again today. [Sizes range from 5 cm^2 to 15 cm^2. The colonization percentages range from %39 to %80.] All measurements should be taken with 2 grains of salt. It's hard to measure irregularly-shaped growths in a cylinder with a straight-edged ruler. [I'll emphasize that yet again, so it hits home. My measurements won't be your measurements. If your growth is slower or faster, don't be surprised. We're talking biology here, nothing is guaranteed.]</p><p>14- Most of the jars have mycelium all the way around the jar. [What I mean is that all of the growths from the four quadrants now touch each other.] A couple are expanding into the bottom. It looks like they won't be ready for the grow chamber on Sunday. [I originally projected that they'd be ready to transfer by a certain date, using available literature as a guide. Of course, I was way off...] I'll give them a few more days. Today we bought the materials for the growing chamber and built it. Total cost of the project to date: $100 CAN [See info about my terrarium at the end]</p><p>17- Today is our original projected birthday [a PF term referring to the day you take the cakes out of the jars], but they aren't ready yet. Most of the jars (except #1) have mycelium totally covering the sides of the jars. [The reason #1 didn't was because only 3/4 of the inoculation points germinated.] A few have the bottom half-covered as well. Anyway, the birthday will have to be delayed a few days. On the bright side, [Joe Smith] found us an ultrasonic humidifier for $10 at a thrift store. [the original receipt was in the box: $150 in 1985 currency] Now we need to interface it to the grow chamber and buy a timer. Total project cost will now exceed $120 CAN, but not by much.</p><p>18- Growth data as follows: [Basically, most of the jars were close to being colonized. Uncolonized areas were roughly 10-15 cm^2. Percentages ranged from %81 to %93. The differences between the jars have tightened up.] I got curious about how deep the mycelium penetrate, so I decided to take the worst jar (#1) and cut a sample out and do a little dissection. Sure enough, tiny fibrous strands penetrated the cake for at least 1 cm. [of course, this Curious George routine cost me in the end. Read on.]</p><p>20- The growing chamber is complete. Man, is it nice. [see the end for details] The growth in the jars is really slowing down. It's taking days to fill in the last little bit of uncovered cake. As an experiment, I'm transferring #1 right now, to see how it fares. [You learn by doing, and sure enough, I learned]</p><p>21- Since the jars are going so slow, I'm transferring half of the jars into the chamber tonight. [I thought they might be dying off in the jars because of the dramatic decrease in growth.] #'s 1,2,5,6 are going in. We have the timer programmed for 6 events/24 hours with each event lasting 5 min. [I chose a good cake, a bad cake, and two mediocre cakes to go in prematurely. They only had about 2-4 cm^2 left to go, so they were pretty much colonized.]</p><p>23- Jars # 3,4,7,8 are going in today. Only #8 was truly %100 permeated with mycelium, but the rest doing well anyway. The first four I transferred are doing great, with increased fuzziness all over the cakes, especially the perimeter where the growth was incomplete. Small 'bumps' are starting to grow on them (start of pinning?), and I pulled off one 2 mm^3 chunk (primordia?). I crushed it, and sure enough, it turned blue within a minute or two. Things are looking good. The terrarium is fantastic, and today we tilted it (and added a spigot) so it can get rid of the condensation. (BTW, some of the bigger 'bumps' had brownish tips)</p><p>24- I checked the cakes today. Pinning has definitely started on all eight cakes. The original four are a shitload bigger than yesterday, with some pinheads growing 5-10 times larger [by volume] in just a couple of days.</p><p>25- We elevated all of the cakes by inverting the bands. Now they'll be above any water that might pool from condensation, and nothing will impede the progress of mushrooms growing from the bottom.</p><p>26- Today, we had to remove #6 from the terrarium due to mold infection. I removed the infection with a sterile knife, but I'm dubious about the possibility of saving it. We will have to keep a better eye on the rest. [We separated this cake from the rest by putting it in a pot with saran-wrap over the top, and misting it manually. The mold spot grew in a previously uncovered part of the cake. Let this be a lesson: Let the jars colonize completely. If you do what I did, you may jeopardize the whole project.] The growths on the other cakes are as big as 2 cm long and 1 cm in diameter.</p><p>27- Another death today. This one was a much slimier looking green mold. It took hold at the vermiculite/substrate interface [the bottom of the cake]. It was jar #1, so I'm not surprised. Anyway, I cut it out and put it in with #6 for a few days of intensive care. [John Doe] sampled a few grams (wet) of primordia and he said that he had what amounted to a prolonged 3-beer buzz [canadian beer]. He wanted more, but we didn't want to decimate the cakes. The precise quantity is unknown [we didn't get access to our scale in time], but we have a rough idea. I'd like to double the dose and try again, but that will have to wait until the cakes produce some more shrooms.</p><p>29- R.I.P. We had to bury one of the cakes today. The mold (although removed) returned in too many places to save it. I decided that the infection was too severe to attempt additional rescue attempts. Unfortunately, I threw it out before dissecting it for informative purposes. Maybe if the other one dies, I'll remember to analyze it first. As far growth goes, things are going well. The ones in the grow chamber are starting to get that kind of 'foamy' growth at their bases. By Monday, I will (hopefully) be able to sample some for myself.</p><p>31- Holy shit they're huge! We now have mushrooms as large as 65mm by 15mm [total length by cap diameter]. Of the six cakes, we have all of them producing roughly a half-dozen large [normal sized really, but large compared to the primordia] mushrooms each. Some veils are broken, and others are on their way. The rate of growth have been on the order of 2X/day [doubling their volume each day], so I don't expect that kind of growth to keep up. The cake in intensive care re-grew mold again, so we're going to let it go, and see if it takes over, or gets overtaken by the shrooms. [I think we were erroneous in our ID. What we saw was probably just a bluing reaction from the surgery, rather than a re-growth of mold.] Tonight, [John Hancock] is going to be our second guinea pig. We gave him roughly 3 mushrooms approximately 55 mm long with caps 15mm in diameter. He compared the high to a 6-pack buzz. No major visuals, but since we don't have our scale yet, we deliberately underdosed him.</p><p>32- The cake in intensive care is doing well. The hole [from surgery] has been overgrown. Hopefully we will be able to put it back in with the others in a couple of days. Tonight I'm going to try some for myself. I'm taking four mushrooms approximately 70mm long with caps 23mm in diameter. I ate them raw to see what they taste like. As expected, they tasted like raw mushrooms. Either you like them, or you don't. The trip took about an hour to kick in [I had just eaten dinner], and it peaked about 3 hours later. I had mild tracers and wall-bubbling, and for a while I closed my eyes and listened to some tunes. In the darkness, I had some wild mental imagery going on, and a good time was had by all. I found this to be a comfortable first dose. [I'm 5'11' 180lbs]</p><p>33- The isolated cake is A-OK. In fact, I pulled 2 shrooms off of it today so [Joe Blow] could try some over the holidays. It seems to be all healed up, and I see no reason to not put it back into the grow chamber. The other shrooms are just huge. In fact, I picked about 15-20 shrooms off the cakes because they were mature enough to eat. (the veils had ruptured)</p><p>34- I picked off another 10. The cakes are starting to look bare, but we have to pick them as they get ripe. Each cake still has 4-8 shrooms each on the way.</p><p>48- I got back from vacation 2 days ago and the shrooms looked neglected. The spores were everywhere, and things were starting to shrivel with age. The cake in intensive care is dead. [Joe Smith] left it out to dry for over a week. More have been picked and dried, but I've lost count now. The humidifier was on the blink, so [Joe Smith] left it on overnight to see what would happen. Huge growth! We're going to try this kind of supersaturation for a while. [After a couple of days we stopped the experiment. The increased growth rate wasn't worth the hassle of filling the humidifier up twice a day, rather than 1-2 times per week.] I took the humidifier apart, but I couldn't see what the problem was. It seems to work fine now anyway. [Joe, John and Jane] ate the dried ones in a tea. I figure they had 22 shrooms of various sizes between them. They had a very strong trip. We are trying to make a spore print of 3 caps we picked yesterday. I have yet to see how it is going. [It turned out great. The prints were very strong, and the spores later germinated with no sterility problems.]</p><p>60- I haven't bothered to make any entries lately because not much has happened. Every day I pick about 5 shrooms off of the 6 remaining cakes. The other intensive care cake dried out and died because I went away for a week. The rest of them are doing great. We made a spore syringe and successfully inoculated another four jars, so now we officially have an endless supply of shrooms. The 6 cakes have been producing for about 3 weeks now, and we've grown enough to trip 20 people. It has been well worth the investment.</p><p>So there you go all of you nay-sayers. Home cultivation is not only possible, but it's really pretty easy. I went from spores to edible shrooms in about a month. Of the original 8 jars I inoculated, I lost one of them to infection, and one to negligence. The problems stemmed from my own stupidity, not because it's 'hard' to grow your own shrooms. If you have the time and inclination to try it yourself, have no worries about losing your money. In my mind, the project paid for itself completely within 2 months, and anything it produces from now on is gravy.</p><p>**************************PSYLOCYBE FANATICUS*****************************</p><p>I give full credit for my successful cultivation project to the source of the spores, and the growing guide: Psylocybe Fanaticus [www.fanaticus.com].</p><p>I can't endorse the company enough. I sent them my order in the middle of the week, and I received my package 12 days later (including weekends). Not bad for an international order. (PF is in the US, I'm in Canada) Needless to say, although buying spores is perfectly legal in Canada and most US states, none of this was done in my name. (But that's just common sense.) BTW, I did this in October 1994, and many others have ordered since then, so the company is still active. [still going - July 95]</p><p>If you do order from PF, make sure you order their Science Reports. It's only $10, and although it's only 16 pages of photocopies, those 16 pages contained information that I haven't seen in any book or on any Net site. (Except for the idiot who reprinted it without PF's permission. If this joke really thinks information deserves to be free, maybe someone should post his credit card number to the net...) It's PF's technique that makes the process foolproof. Although I could spill the beans in less than five lines, I won't. They deserve to make a few bucks for their ideas.</p><p>I don't know if they've updated their brochure, but for those of you outside of the US, PF charges $10 for shipping and handling on all syringe orders. It not an unfair charge, but the fact that it wasn't in their brochure caught me off guard.</p><p>***************************THE TERRARIUM**********************************</p><p>Ahhh, my terrarium, a thing of beauty it is. This is the place my cakes reside, being bathed in a gentle mist of water vapor while fresh air sweeps away excess CO2. But enough of that, here's the facts:</p><p>Equipment [all dimensions approximate] Cost (canadian $)</p><p>=========================================================== </p><p>Styrofoam cooler (regular 3'x2'x2' size) $10 </p><p>2 chunks of plexiglass (3'x2') $10 </p><p>Caulking gun & caulking $10 </p><p>Spray bottle $3 </p><p>2nd hand *ultrasonic* (NOT STEAM) humidifier $10 </p><p>A length of 3' dryer hose $2 </p><p>NOMA 6-event 24 hour digital outlet timer $30 =========================================================== </p><p>Total   $75</p><p>I don't expect you to be able to find an ultrasonic humidifier for $10. We got lucky in that department. A new one is well over $100. But with the set-up we currently have, mushroom growing is effortless. At this stage, it's a matter of filling the humidifier reservoir every week, and emptying the jar that collects the condensation runoff. Other than that, it's on autopilot. Every couple of days, we check on them to remove the ripe shrooms for drying, but that's it.</p><p>I've recently helped a friend set up his own terrarium, and after calling around, he managed to find a couple of 2nd hand stores that had humidifiers for less than $10. They were the rotating-cone type of atomizer which may not be as good as an ultrasonic, but were suitable for the job. So shop around, a humidifier is worth the time and expense.</p><p>The construction of the terrarium is pretty straightforward. You cut a hole in the lid of the cooler where one of the plexiglass sheets goes, and caulk the sheet into place. Keep the chunk of styrofoam you cut out. You can put it in the bottom of the cooler to keep the cakes away from any water that might condense. You put the second sheet inside the cooler to make two chambers (a la the PF terrarium), but since I don't use the spray bottle, I didn't really need it, but you might. I found that my cooler came with a small lip about halfway down the the inside. I rest one edge of the plexiglass on the lip, and the other edge towards the top. This gives the little guys more head-room, thus more space for more cakes.</p><p>The humidifier is plugged in via the timer, so I leave the humidifier power on and use the timer to regulate the misting cycles. The humidifier has a fan built in to blow the atomized water out the top, so I took advantage of that feature, and used it flush the air in the cooler. I have a duct running from the humidifier into the side of the terrarium (near the top). It's that white clothes-dryer type of tubing. It looks like a slinky wrapped in a white condom, and it is caulked into place to prevent leakages. The cooler is tilted towards one corner where I have poked a hole in the cooler with the tube from a pen. I left the tube in there, and it acts as a spigot to funnel all of the condensation run-off into a jar.</p><p>So that's it. That's my terrarium. After I built it, I had to program the timer to come on every four hours, for fifteen minutes each time. I found that that was sufficient to keep the plexiglass misty-wet. The mushrooms love it too, and if the mushrooms are happy, I'm happy.</p><p>I've heard about PF's cheap humidification scheme, and although I haven't tried it personally, I've been in contact with others who have used it. In a nutshell; It's not as good as an ultrasonic humidifier, but it's better than spraying by hand. It's cheap, so you might want to try it out, but if you want some serious humidity, splurge and get a decent humidifier.</p><p>********************************DOSAGE*************************************</p><p>Since not many of you have access to gram scales, and don't want to spend the money to buy one, I'll tell you the system we use to measure out doses. First off, the method of preparation we use is to dry out the shrooms thoroughly (sun-dry or chemical dessication), and pulverize them into a semi-fine powder. (1mm diameter and smaller, about the same size as coarse salt) You might find that the stems don't crush so easily, so I sometimes mince them up with a good knife.</p><p>Lately, I've started to use a coffee bean grinder like PF suggests, and it works great. Don't grind them too long or else they turn into a fine powder. When you grind them you'll find that it kicks up a cloud of mushroom dust inside the grinder. Take a sniff; it will be the most sickly sweet smell you'll ever experience.</p><p>After pulverizing the shrooms, I went to a laboratory on campus and used their gram scale that is accurate to 1/100th of a gram. I measured out 1 flat teaspoon (5ml) and weighed it. On average, it weighed 0.80 grams. Using this as a guide, we tried 1.5 tsp (1.2 g) of shrooms each and the trip was quite nice. Just recently, I tried 2 tsp (1.6 g) of shrooms, and lost touch with reality (in a good way), so I would recommend 1.5 tsp to begin with. Of course, this dose is particular to my strain of shrooms, the freshness, and the water content, so your mileage might vary. Generally speaking, shrooms that have been dried within the last week or two will be much stronger than an old stash (presumably due to psylocin breakdown).</p><p>I personally recommend mushroom tea as my preferred method of ingestion. I've tried them fresh, dried, cooked, and in tea, and above all, tea is the best way to go. What you do is bring a cup of water to boil in a pot, then add the powdered shrooms. Turn the heat down to low and simmer for about 15 minutes. Stir the shrooms around as it steeps so the psilocybin and psilocin diffuse throughout the water. After 15 minutes, pour the mixture through a tea sieve to strain out the pulp (we like to call it the slurry). And what you have left is a steaming cup 'o goodness. Add sugar, honey and/or milk to taste and drink away. It doesn't taste too bad, although the color and smell may not win any awards. If you drink it on an empty stomach, it will hit you *fast*. In fact, when I first did 2 tsp of shrooms, I had major visuals in 10 minutes, and auditory hallucinations within 30 minutes. (After an hour, I met god...) The GI tract is much better at absorbing water than it is at digesting solids, so the effect is both immediate and powerful.</p><p>**************************QUESTIONS & ANSWERS******************************</p><p>Q: Won't handling the cakes contaminate them? A: Not to my experience. You never handle the cakes until they mycelium has completely permeated the cake. When this happens, there is no exposed substrate for foreign mold spores to take hold of. Of course, this is the reason why you shouldn't remove the cakes from the jars until the cake is totally covered in white. Also, make sure you scrape off *all* of the top layer, right down to the hard white substrate (this only makes sense for the PF technique). Don't give mold a place to grow. So in a nutshell, yes, you can touch them if you have to, but excessive handling is not advised.</p><p>Q: How much can I expect to grow? A: The cakes don't produce constantly for their whole growth cycle, so it's hard to give you any concrete numbers. Right now, my cakes are half-way through their expected fruiting life (they've been fruiting for a month). In the last two weeks, I have produced roughly 12 dried grams from 6 active cakes. That works out to 1 dried gram per cake, per week. A typical dose ranges from 1-2 g, so it's reasonable to expect 2 cakes to produce enough for a person to trip once every week. That should be a good guide when it comes time to decide how many cakes to grow. I will try to get more data on the life cycle of the cakes, and give a more concrete estimate of production.</p><p>*****************************CONCLUSION************************************</p><p>So there you have it. That's just about everything I can say about the mushroom growing process. All of this information is first hand, and is as accurate as possible. I hope you found it informative, especially if it helps you to decide to try it yourself. Although growing is not totally effortless, it's certainly not as difficult as some people who post on the net make it out to be. Personally speaking, the project cost us about $150 CAN, and since we've already consumed 20 doses at $10/dose, it has already paid for itself within 2 months.</p><p>I'm sure some of you will have questions or comments. If you have something to add, or if you want me to clarify some part of this file, please email me at: an183998@anon.penet.fi</p><p>I will try to answer all of your questions, or incorporate your suggestions into an updated version of this text. Since I'm using a borrowed account, my responses might not be lightning fast, but I'll get around to them as soon as humanly possible.</p>"
}
