{
 "title": "Confusion",
 "author": "Leigh",
 "citation": "Citation:   Leigh. \"Confusion: experience with Hydromorphone (Dilaudid) & Oxycodone with Acetaminophen (Percoset) (ID 22485)\". Erowid.org. Jun 19, 2009. erowid.org/exp/22485",
 "substance": "Hydromorphone (Dilaudid) & Oxycodone with Acetaminophen (Percoset)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 mg",
   "IV",
   "Hydromorphone",
   " ",
   "  repeated",
   "oral",
   "Hydromorphone",
   " ",
   "  repeated",
   "oral",
   "Pharms - Oxycodone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22485",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2009",
   "Views: 17153",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI came online tonight searching for answers to my questions about the myriad of drugs I am currently taking, and thought my experience so far with these drugs could prove useful to someone in my position in the future.  I have had been passing kidney stones for the past week - the most painful experience of my life - and in between my many trips to the ER, I have been given oxycodone, toradol and dilaudid to control the pain.  \r\nI am extremely afraid of developing an addiction to these drugs, as I have an 'addictive personality' and have had drug habit problems in the past.  It's been a difficult situation because the onset of kidney pain sends me into such a fright that I pop the maximum amount of pills that I am supposed to take at once.  I am afraid that slight pain I begin to feel will worsen until I am in the state I was in the first day I had the stones - a pain that I would not wish upon my worst enemy.  The pain had me reduced to a blabbering, crying mess.  When I got to the ER that day I had no control over my words and actions, and I was screaming and moaning for painkillers.  When I finally got my shot of toradol and dilaudid I was in heaven...and I tried so hard to convince myself it was just from the pain relief, not from the drugs themselves.\r\nI finally left the hospital that day and continued to have bouts of pain that would sometimes be relieved by the prescriptions, and sometimes not.  By the fourth day, I noticed the meds were having no effect whatsoever.  It scared me that I already was having such a tolerance to the meds, especially because of how strong I was told dilaudid was.  Was it the strength of pain or my tolerance to the meds?  I don't really know.  I just got home from my third visit to the hospital in the past week, except I had to stay overnight with a morphine drip to control the pain.  I was later switched to oral medication - oxycodone - and I was able to handle the pain that way so I got sent home with 30 more pills.\r\nThere is no real point to my story except that I question my actions...at the slightest possibility of my beginning to feel twinges of back/abdomen pain associated with kidney stones, I take the oxycodone, toradol, and/or dilaudid.  I really don't know if it's more because I am afraid of having pain like I did, or because I am developing an addiction to these pain killers.  I must admit that the pain killers make it so much easier to sleep, and as soon as I feel the 'coming down' effects like increased sensitivity (crying at the drop of a hat) and increased annoyedness (especially at loud noise), I feel compelled to take the drugs.  At the same time, however, these drugs do not provide all bliss to me either; I experience intense itchiness, mild nausea, and an overwhelming grogginess that brings about a depressed mental state.  I personally feel much better having written this, because I think I am being a lot more honest with myself, and have realized that I have caught myself giving in to an addiction.  I fully intend upon discussing this matter with my doctor, in the hopes that I can find an alternate way of dealing with my pain.\n\n\n"
}