{
 "title": "A Vacation in the Courts of Chaos",
 "author": "BluDog",
 "citation": "   BluDog. \"A Vacation in the Courts of Chaos: experience with Methamphetamine (ID 22499)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22499",
 "substance": "Methamphetamine",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "IV",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 22499",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 2, 2007",
   "Views: 5789",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 500 mgs of methamphetamine is considered an extremely high dose, see nethamphetamine Dose Chart] </p><p>This was a five day long glass binge. It all started in the usual way a nice 40 unit bumb with the usual effects, hyper alert, wired, and a little nuts, I had a great time for what seemed like forever, I felt ten feet tall and bullet proof, then about 30 hours later came number two, and so on through day five, with shots getting bigger and closer together, all was well until the last one.</p><p>It was about 4 am midsummer in the mountians, I felt like I was vibrating at a high rate, no paranoia, or really any fear at all. Every body had left, except for one buddy of mine who was quietly skitzing in the other corner of my room. I set up my works for the last hit of the eighth oz. probably in the range of .70g added 35 units water, hot, makes it break better, and drew back about 80 units. I gave my bud about 23 of them and quickly punched the rest. Within 20 seconds the world turned 90 degrees from me and everything became kinda, hazy, far away, yet very urgent. I was watching a full sensory movie. Yet I was detached. I began to halucinate, visually, audibly, tactily, and in my very thought processes. And yet I was fully aware that it was just a trip, I just chose to let it ride. Not like acid where I have no choice, let alone realization of self.</p><p>My first visual came while looking out my second floor window at the wooded area below, the seen began to warp, like an out of sync monitor, then with a mighty crash, the scene before me gave one last twist and shattered like some kind of super cool movie effect. Behind it was a new forest, similar yet not. There were in my eyes, new unknown forms of life there, sentinant and possably dangerous, but not for sure. Chaos had arrived. I looked at my friend and he to seemed somehow different, changed inside but not to others eyes. I asked if he had heard the scene shatter, he stared at me and asked if I was OK. I said sure, let's go out back and have a smoke. While smoking I became convinced he was an alien here to take me away, not necessarily for some evil purpose, but for some unfathomable one. I should point out that he was fairly straight having slept 28 or so hours before. He and I tried to talk but I was way to spun to even form words, let alone sentences.</p><p>He finally said he needed to get home, and stood to leave. I thought that this was the que for the others to come and nab me. I could even hear and see them coming around the corner for the house. I looked my friend straight in the eyes and asked 'You know what happpens next don't you.' fully expecting him to say 'Yes it's time for you to set out on your journey, we are here to help you start', my tone must've been beyound weird, because he just stared and replied cunfusidely 'What the f*** are you talking about, I gotta go NOW. see ya.'</p><p>I think this is probably the most bizaar series of images and and thoughts I have ever had, outside of LSD trips as a teenager. The weirdest part was the dissasociation of part of my consciousness from the reality of what was up. I mean I had very little control over my actions, yet if I pushed hard enough I could have a small influence. I was also never paranoid or even meth scared, just trippin on the whole show. Now I know I'm close to that state when power cords and door trim start to bubble up and peel, thats a very good warning sign for me to stop and sleep. NAW screw it.</p>"
}
