{
 "title": "The Ecstatic Naturalist",
 "author": "Bill",
 "citation": "Citation:   Bill. \"The Ecstatic Naturalist: experience with Morning Glory Seeds (ID 2251)\". Erowid.org. Sep 17, 2001. erowid.org/exp/2251",
 "substance": "Morning Glory Seeds",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Morning Glory",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2251",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 17, 2001",
   "Views: 12887",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nUsing TracMan.du's excellent instructions, I made a tincture without naphtha over many days of soaking, filtering, drying and dissolving.  I freed up an entire day to be outdoors, in nature preserves, to get acquainted with MG seeds.  I walked to the furthest nature preserve, and took 1/3 of the tincture at 9:45 a.m.  An hour later I couldn't stop admiring plants and insects for their purity and beauty.  I also couldn't walk very fast or very steadily.  I took the rest of the tincture at 10:45 a.m., and felt slightly nauseous, but not badly so.  Plants and animals continued to delight.  \r\nAround noon, another person arrived at the preserve so I slowly walked to my next destination, the town cemetery.  There was a small grove of memorial trees as I approached...and behind it were numerous fungi, many possibly Amanitas.  I plucked one and put it in my knapsack for later identification.  The creek and tree line were lush with flora, and mosquitos.  The stagnant pond was teeming with frogs.  I was feeling very slowed-down, and continued my walk to the next nature preserve, which was also an arboretum.  \r\nThe arboretum was loaded with mosquitos, whose bites bothered me less as time passed.  I admired the fish in the creek, and sat down at the end of the footbridge and jotted down a quick note before I continued.  '1 p.m.  Intense pure natural.  On bridge in arb.  Beautiful creatures all.'  \r\nI found a sunny meadow on the east side of the arboretum which was lush with a stunning variety of plants and insects.  I spent the next 4-5 hours in this part of the arboretum, slowly walking around, entranced by the beauty of the plants and insects and sunlight.  I had the arboretum to myself most of the time, which was good, because I did not feel like talking, and maybe couldn't talk very well.  I was in a state of wordless adoration of the natural world, mesmerized by the living creatures around me.  The life force of the plants gave off a soft, wholesome glow.  The insects were living jewels.  A wildflower field was almost overwhelming in its beauty.  \r\nThe spot I gravitated to and stood for long periods coincidentally had Morning Glory vines growing out onto the footpath.  Bees were gathering pollen and nectar from clover on each side of the path.  I felt my own body energy becoming very pleasurable and calm.  I found that putting my palms together in front of me with my arms close to my body increased the comfortable feeling, so I wandered about in bliss, with a mudra of prayer, although I was not praying as prayer is commonly regarded.\r\nAround 5:30 p.m. I decided to leave this paradise and return home, to rest.  A couple blocks from home I noted that the shrubs by a fast food parking lot contained a Morning Glory vine.  At 6 p.m. I wrote: 'Back home.  Sitting and resting.  Have yet to come down.  Much seen, will write later.'  \r\nThe next day I was back up to speed.  I will never forget those hours in paradise.  'All things bright and beautiful, all creatures great and small'!  That hymnist would have enjoyed the MG experience, I think...For the record, for what it's worth, I'm a Born-Again Vegan.  Plant energy rules!\n\n\n"
}