{
 "title": "Gone Psycho",
 "author": "W0lf",
 "citation": "   W0lf. \"Gone Psycho: experience with Alcohol (ID 22555)\". Erowid.org. Nov 29, 2006. erowid.org/exp/22555",
 "substance": "Alcohol",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 22555",
   "Male",
   " ",
   "Not Given",
   "Nov 29, 2006",
   "Views: 6987",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all happened the night of a university drinking contest. Before I left for the contest I already found myself to be enraged for some reason, but I didn't pay much attention to it and thought : 'well lets  just get hammered again and forget everything'</p><p>So I set of to the pub and started the contest, I think I had about 15 beers in 3 hours (could have been more). After that we went to a party where I drank some more...and from then on my memory is shattered.</p><p>So most of what I write now is what people told me afterwards.</p><p>It was a party organized by some international student association and  apparently I met some foreign students. Those guys had some kind of strong alcohol with them (80%). I dont know if I drank some of it, but I suppose I did. Next thing I remember I'm in my own car with one of those lads driving it !!!! Why? I really really dont know ! Everything went blank from then on and the next thing I know I wake up in a police station.</p><p>So what happened that night? Apparently we drove to where those foreigners resided for a week, and for some reason I must have REALY flipped out in that building. I tried to bust in a door leading to some sort of television room, it didn't work though so I broke the glass in that door and crawled through it, injuring my hand. Once inside I managed to yank a large wooden board from the wall and smashed the window leading outside with it. </p><p>At that time some guys who where staying there heard all the commotion and found me there, in a frenzy of anger and despair and the entire room smeared with blood ! They managed to get me to the parking lot and tried to calm me down, cause I was in a SUICIDAL state. They didn't succeed however and had to call the cops (the guys who tried to call me were military for crying out loud !).</p><p>I can tell you, waking up in jail and hearing that story is not at all funny ! The cops said that witnesses had explained to them that I was running round like a psycho trying to kill myself.</p><p>This experience of course opened my eyes, I indeed had a SERIOUS problem that needed professional care. </p><p>Later my dad explained to me that my family had a history of alcohol abuse and suicide, which explains a lot since Ive been having psychological problems my whole life.</p><p>After that experience I stopped drinking alcohol for 3 months and stopped smoking weed for a week ( I hadn't even had weed that awful night !!!!!), the reason I did stop smoking for a week is that I wanted to grant myself 'a moment of clarity' since I've been smoking every day for 3 years...and wanted to pin point the exact problem in a sober manner before I went into therapy.</p><p>Therapy indeed seemed to be the sanest solution, I dont wanna walk around like a walking time bomb waiting to kill someone else or myself...</p>"
}
