{
 "title": "Comic Book Colors on a Violin River...",
 "author": "SD",
 "citation": "   SD. \"Comic Book Colors on a Violin River...: experience with Mushrooms (ID 22651)\". Erowid.org. Dec 1, 2006. erowid.org/exp/22651",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22651",
   "Male",
   " ",
   "Not Given",
   "Dec 1, 2006",
   "3539",
   " "
  ]
 ],
 "report": "<p>The month was March, not a long time ago, actually, it was just about the one year mark since I had started smoking herb. Over the course of the year I had become highly interested in the concept of being out of my head. A few months earlier, some friends and I had acquired some microdots of mescaline. I ate one, and over the course of a day I tripped fairly decent, not really anything spectacular, but the dancing trees were cool. But there was no real thinking involved.  From that point I wanted to move on to something different. After a time though, thoughts of tripping fell out of my mind, and I merely continued to smoke daily. </p><p>About six months after the mescaline experience, I got my hands on some mushrooms, finally! At first, I was angry, my bag was just some shakes with gold colored chunks and a few large stems. I ate the whole 1/8th anyhow, letting the largest stem sit in my mouth for a few minutes. About an hour or so passed, and it was like the mescaline all over again, I felt really stoned, but in a different sort of way. The room that I was sitting in was filled  with people, many of whom I had never met. I decided to leave the studio and sit alone in my car. I made my way into the hall; the moment I stepped outside the door, I realized that my journey had just begun.</p><p>My body felt weak, but my mind knew of the haven that lie in my car. The trip down the hall was arduous, but fun. By the time I was halfway there, the walls began to swerve and a few hours had passed. I felt like a knight coming home from years of crusades, I had made it to my car and I was the happiest being alive.</p><p>As the euphoric melodies of Mickey Harts drum kit raced through my brain, my car was gone and I was sitting atop nothing, it was like a magic carpet ride. My childhood dream! The snow banks at the police station across the road were trains, and the spindly trees began to weave themselves into the most beautiful black spider webs known to mankind. I was happier than ever before, things were perfect, in the purest sense of the word. </p><p>Eons later, my friend and his inebriated female companion came to check on me. They got into the car and started talking to me. By this time, I had returned to innocence, my mental and visual perspective were those of a small child again. As they continued to talk, I was seeing the truth, the ugliness in humans. Although physically beautiful, I was repelled by the girl, again, I saw her for what she was, like a kid would. Her outer apperance took on the characteristics of her drunken state, she morphed into a decrepit hag, warts, thinning hair, wrinkles, the works. I was mortified when she touched me, I tried explaining to her why she should change her ways of mentally prostituting herself, but she ignored me and continued to rant of sex and why she needs it. I told her to shut the fuck up and get out of here, let me chill. A few minutes, or maybe a few hours later, my friends left me be. </p><p>I continued thinking, and I saw the beauty of everything in life, but from an untainted point of view. Thus making everything in this confangled adult society revolting to my sight and mind. I went digging though the debris in my car, where I found a notepad and pen. I furiously started writing, my every thought was transcribed through rays of blue ink onto the black paper. </p><p>A few hours of real time had passed and I decided to go driving through a rural section in the next town over. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I stopped at a friends house first, because I wanted to share the beauty of the world with the people living in it. He brought along a mix CD with the Grateful Dead song California, and that helped my mellowing trip stay stable. We drove around for an hour, and I dropped him off so I could think about life some more. </p><p>By this time my trip had been reduced to an interesting, strong high, maybe due to the bowl I had smoked at the onset of my trip. Wherever I turned, I was seeing trails. It was like a great anime film. Unfortunately, I was regaining my concept of time. I took my phone out of the sweatshirt on the floor, and it was 2am. It was time to return home. </p><p>As I walked to the door, I was fumbling through my pockets for my keys. I eventually remembered that they were in my left hand. I put a key into the front lock, but it wouldnt unlock. I finally got it together and unlocked the door, the next one was no problem. </p><p>Up the stairs to my bed; I made it no problem. As I lie in my bed, I continued to think, and admire the tapestry on my ceiling and the Dead collage on my slanted wall.  I dont know how long it took, but I fell asleep without much effort.  </p><p>To this day, I am still trying to capture the beauty of life, as I saw it on my journey with psilocibe mushrooms.  I havent tripped again, but thats only due to lack of funding. Eating mushrooms was one of the greatest occurrences of my life. Its definitely not for everyone though.</p><p>Peace and Love</p><p>SD</p>"
}
