{
 "title": "Riding The Cactus Rocket",
 "author": "Jon",
 "citation": "   Jon. \"Riding The Cactus Rocket: experience with Cacti - T. pachanoi & Alcohol (ID 22658)\". Erowid.org. Nov 29, 2005. erowid.org/exp/22658",
 "substance": "Cacti - T. pachanoi & Alcohol",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "12 in",
   "oral",
   "Cacti - T. pachanoi",
   "(plant material)",
   " ",
   "8 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 22658",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 29, 2005",
   "Views: 5947",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It started out as a normal day. It was a hot summer morning and I was home along surfing the internet. As usual I was reading experience reports and doing some research on different hallucinogenic substances. I have been very interested in mind-altering, naturally occuring substances for sometime. I'm also very into trying new things that not many are willing to try. Some of which include Dipenhydrinate (Dramamine), Datura, Amanitas, and Belladonna.  I stumbled across some information on legal Cacti that contain moderate amounts of mescaline. </p><p>I eagerly looked up the nearest cactus shop in my area. I informed my friend about my discovery, (he has never done any hallucinogens) and he was more than willing to try this with me. I journeyed to the Cactus Shop and bought a 12 inch piece of San Pedro...very expensive...it was around 70 bucks (I probably got ripped off since the guy could tell I had no knowledge of cacti whatsoever.) </p><p>We decided that the next day we would blend up a mixture of the cactus and some ginseng.  That evening as I was about to get in the shower before a night out with some friends, I began to get really excited about trying this new substance. I couldn't wait until the next day and I began slicing up the cactus into spears and eating everything but the core and the skin. I was VERY anxious, and felt VERY nervous about what I was doing. I had NO sitter, NO preparation, and I was planning on leaving my house to go to an unknown environment.  Three words can describe what I was doing...stupid, stupid, stupid.</p><p>I left my house, drove over to my friend's place, and by the time I got there, things began to happen.  I felt giddy, warm inside.  My jaw was clenching, my palms were sweaty and my skin was clammy. I told my friend what I had did and that I didn't want to leave his house. I felt so STRANGE. Things felt new, like I just moved there. Everything had a strange personification attached to it. Like everything was alive. Things didn't move or talk, but I just knew they were all alive. </p><p>I sat down with him and began drinking beer. I didn't even think anything of it at the time. I was in a kind of trance where I knew what I was doing, but it didn't register that it was actually ME and that it was actually REAL.   I remember just sitting there for what seemed like days...never getting bored, just looking at everything like I was from Mars. I kept drinking and kept going to the bathroom and that was it. I ended up having 8 beers before I passed out. </p><p>I awoke the next day at my friend's place...and I felt HORRIBLE. The trip itself, for me, was amazing. I didn't have a good set or setting and i could have hurt myself VERY badly. Have fun</p>"
}
