{
 "title": "The Most Powerful Entheogen on Earth?",
 "author": "Adamdma",
 "citation": "Citation:   Adamdma. \"The Most Powerful Entheogen on Earth?: experience with MDMA (ID 22689)\". Erowid.org. Mar 3, 2008. erowid.org/exp/22689",
 "substance": "MDMA",
 "bodyweight": "190 kg",
 "header": [
  [
   "DOSE:",
   "500 mg",
   " ",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22689",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 3, 2008",
   "Views: 4499",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe length, intensity, control and power of my first MDMA trip is without comparison.  I had previously tried marijuana and smokeable DMT and subsequently I have tried psilocybin and Ayhuaska.  My Shaman informs me that he knows only one other person who has had an experience like mine and I would like to hear from other people who have.  I can only describe some of my trip here so I will talk to you about my ring and mirror, my psychic abilities, my increased physical strength and some proofs in religion.  I will keep my relationship with the Hindu Goddess Kali private! Remember that this entire trip lasted for an astonishing seven hours, not bad for a lifetimes worth of experience, but it was exhausting.  \r\nIt might be important to note that we had been smoking almost pure purple haze joints with added Shivas resin for an hour before the hallucinations started coming on.  I was strangely depressed just before the effects began, this is why I took an extra dab of powder and the effects took hold soon after. When I started going under I was immediately aware of its power, the start was like the beginning of DMT except that I was compelled to quest for something.  The quest lasted a short amount of time but was very difficult.  When I reached the top of a pillar of rock I found a tiny box on a pedestal, after sighing for it like some bizarre library, I unlocked the box and took out a ring consisting of two concentric gold pieces when I put this on the third finger of my right hand it split and locked on.  The two parts crossed at the sides of the lower knuckle and opened in a way that allowed me to flex my finger.  The flesh in-between the rings was now transparent to me in both the real world and the dream world.  I could use it to read auras and peoples thoughts in the real world. \r\nIn the dream realm I now had absolute control; I could teleport to any place or time by seeing it in the ring and climbing through.  A short time later I stumbled across a very kind hearted shaman (he could make my spirit guide laugh) called Shenan who showed me that my other hand was a mirror that I could use like a telescope to see things smaller or bigger depending on whether I looked through the palm or the back of it respectively.  This is how could see the entire universe (and beyond) past the DNA molecules, down to thought vibrations rippling across atoms.  In the real world I could use it to travel inside peoples memories.\r\nAt one point a new friend asked me to read his thoughts and not only could I describe the surroundings of his first house in detail but I reminded him that the patio was where he had first learnt to play chess, he was using black and facing the garden, the checking piece was a white bishop (I didnt even know he played chess before MDMA).   This sounds impressive but my skills were limited only to the past, when trying to see into the future I predicted to my embarrassment that the large Iraqi anti-war march was going to be bombed by pro-war terrorists.  My flat mate didnt go because of me.  For days after the experience I could clearly see other peoples auras - it was particularly easy to read a womens  I had difficulty interpreting the colours meaning and even if I thought I was sure of my judgement I couldnt confirm the results easily. \r\nWhen I was certain that I had all the drugs out of my system I returned to jujitsu as usual.  Before I started the warm up I noticed that I could get my wrists to touch my toes when before MDMA I was straining to get my fingers there.  In the warm up I was the only one to be caught out for every press-up penalty in this game that the dojo plays.  At the end the Sempi in charge of the warm up sat on my shoulders to try to wear me out  my strength and fitness had grown considerably.  After the session I realised that I had not eaten all day because of the twelve hours I had spent in the library. \r\nAlthough I did not want to test or taint my visions I researched Egyptian and Hindu mythology, obscure eastern European religions and Shamanism.  The connections to some of the things in my vision and also to each other led me to believe that there is an accessible dream world that is very similar between different cultures and individuals.  I did wonder if I had imagined the visions as a strange mixture of ideology from religious education at school, but I hadnt studied any of this in such detail before.  If anyone is interested, Hera from Greece, Hathor from Egypt, Kali from Hindi, and the Neolithic Snake Goddess from Eastern Europe, and my vision loosely share the characteristics of: shape changing, horned snakes, the duality of being a lover and a mother, dog/jackal aspect, wealth, wisdom and war. \r\nThe spill over of powers from the dream world into the real world is the most intriguing experience of my life and as a philosophy student it has positively realigned my perceptions. I am now doing a dissertation based on some of the ideas I took from my trip.   As a final note I would like to express my hope that anyone who reads this has similar experiences on their favourite hallucinogens and to say never underestimate the power of the human brain.\n\n\n"
}