{
 "title": "A Bittersweet Encounter with My Id?",
 "author": "Soma",
 "citation": "Citation:   Soma. \"A Bittersweet Encounter with My Id?: experience with Mushrooms & Cannabis (ID 22724)\". Erowid.org. Apr 4, 2007. erowid.org/exp/22724",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "4 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 22724",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 4, 2007",
   "Views: 3429",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is an account of a difficul trip I had about three years ago.  I've tried to write it up before but I never felt I've given this trip it's due and therefore I will try again.\r\nIt was the summer before grade 10, I was 14 years old and I was discovering the herbal escapes that nature has provided humans with.  It was all very exciting but now, three years later, I would consider myself foolhardy to be wrecklessy endangering my brain chemistry at such a tender age.  Even now I still wonder if I'm making the right choices.\r\nAnyhow, as expected it all started with drinking at the end of grade 8, a few cigarettes over grade 9, towards the end of grade 9 I'd puff some joints and in the summer I was smoking over 4 grams of pot a day.  It seemed like a great choice, an easy answer but the real effects were not revealed until the second time I used magic mushrooms.\r\nIt was a sunny August day in Saltspring Island.  Saltspring Island is one of those islands in British Columbia where hippies still exist in a noticable kind of way.  That means that theres some great Ganja and it's easy to aquire just about any kind of trip you want.\r\nAs I had a visiting friend from England and it was another friend's birthday the desired trip was magic mushrooms.  My english friend, henceforth: Jim was a virgin to shrooms and the birthday boy, let's say: Will, didn't want any so we set out to buy 6 grams of dried shrooms.  I'd done 2 grams the week before and enjoyed it thoroughly.\r\nOnce we had the six grams of shrooms we went to Will's house ate the shrooms and hopped on Will's little motor boat to go cliff jumping.\r\nThis is important:  NEVER DO ANY DANGEROUS ACTIVITIES WHILE INTOXICATED.\r\nI'm an idiot.\r\nWe arrived at the cliffs about 15 minutes after dosing and the sun beamed brightly upon us.  I was in a fantastic mood.  Jim lit up a joint and we all shared four joints back to back.\r\nThen the mushrooms kicked in.  THere's no point in including time for the next section.  It was far too abstract to comprehend.\r\nI looked at my hands to discover that they were changing into the blue-gray colour of the rocks I rested them upon.  Cool, I thought and waved them infront of my face and watched the magnificent comet tails follow them.\r\nThe sun stared at me.  Ominously.  The sun is angry at me.  It is hot.  So damned hot.  I have to exfoliate.  I have to shed my skin.  Just like a snake.\r\nJim, Will and I climbed to the top of the cliff to feel the cool breeze.\r\nGiant tidal waves crash towards us and my friends are dripping.  Their flesh is dripping off their faces like plague victims.  And they're mocking me.\r\nI try not to look at them but I am surrounded.  The sun is everywhere and it is turning my skin into leather and my body is swelling.  There is nowhere to go.  I am trapped on a cliff with an evil sun soldering me and zombies for friends.\r\nThis I feel is when I recessed into my Id.  They say the Id is the reptilian part of the brain which is the only way I can explain the fragmented memory I have of that day.\r\nI am a lizard and I am hiding.  I am curled into a ball and I am in the shade.  The sun can't get me here.  My leather skin is too tight.  I am sick. My life expectancy is short.  I am afraid to open my eyes because what I will see might devour me.  Be it the sun or those zombies.  I can't open my eyes.\r\nI hear voices.\r\n'Are you alright?'\r\n'What's wrong?'\r\nI hear my own voice.\r\n'I'm throwing up.'\r\nI hear voices.\r\n'No.  YOu're not.'\r\nThis goes on for too long and then I open my eyes and there's a boat to pick us up.  I have regained enough of my ego to know I'm not a lizard.  I recognise people on the boat.  It's Will's sister and her friends.\r\nI am sitting on the boat but I feel like a lizard again.  So hot and so scared.  I am crying out of fear and there are people staring at me.  They are Will's sisters friends but they don't have to stare.  THEY DON'T UNDERSTAND.  Or do they?  Because they are comforting and quieting and they drive around on the boat until I am calm.  And I am taking deep breaths and every breath I take alters the shape of the world into something more recognisable.  Until finally I have regained ego.  By no means is the trip over.  It's not even half over.  But I am in control now.  It's not just my id reacting to the poisons in my blood.  Now I am controling the trip and it doesn't even feel that bad.  In fact I'm having a hard time not smiling except that some people seem angry at me.\r\nNext thing I know I'm sipping a glass of water and the world is still breathing but I'm holding what seems to be a normal conversation with Will's parents.  I feel good.  I am being tickled by a thousand pixies inside my bloodstream.\r\nWill's parents drop me and Jim off in town.  We finally regain a semblance of time and it's been about four hours since we took the mushrooms.  We're both very high and Jim has been grinning like a maniac for a while.  We smoke some cigarettes and fumble for words to try and describe the experience.\r\n'Tickly' Jim suggests.\r\n'Boo!' I say.\r\n'Boo... I like that, there may be something to that'\r\n'Yah.'\r\nThe effects decline over about four more hours and it's about nine in the evening and I just feel groggy and so we go back to my house and sleep.\r\nThe next day I felt very embarassed but everyone was goodspirited about the whole event and so it wasn't too bad.\r\nIn retrospect I can answer what seems to be the results of that trip:\r\n1.  It was the catalyst for a medium level depression that took over a year to go away.\r\n2.  Call this stupidity but I felt that I had to take shrooms again to prove to myself I was brave.  I did and have taken shrooms 25 times since although I've stopped probably forever now.  I never had a truly wonderful experience on mushrooms since but never a bad one either.\r\n3.  It showed me the weakest vision of myself and in a way I am very thankful.  I didn't really know myself back then but now I feel I really am very self aware.  Maybe it's just age or maturity.  Maybe tripping on all kinds of things opened doors that were otherwise closed in my brain.  I'd say it's probably a combination of both and this report is going on too long.  If I was to explain the changes of perception drugs and time have caused in my life I'd need to write a novel.  In fact... I am.\r\nBest wishes.\n\n\n"
}