{
 "title": "Testing the Waters / Temporary Madness",
 "author": "Kap",
 "citation": "Citation:   Kap. \"Testing the Waters / Temporary Madness: experience with 2C-E & Cannabis (ID 22720)\". Erowid.org. May 18, 2003. erowid.org/exp/22720",
 "substance": "2C-E & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 ",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   "  T+ 0:30",
   "16 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22720",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 18, 2003",
   "Views: 17216",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBased on the lack of information available on such a mysterious and rare compound, I feel impelled to share my first experience with the substance for the benefit of others.  \r\nPsychoactive Background:  I am fairly familiar with psychedelic territory and am familiar with the following: 2ct7, 5meodmt, lsd, mushrooms, mdma, k, and dxm.  I haven't had any particularly bad trips, but then again I've never really pushed the limits _too_ far.\r\nPrior to the trip, the last meal I had had was at 7 the night before.  Since then I had only eaten one powerbar around 11 and drank various juices through the day.\r\n(T-0:30) 3:00pm: Take 1 dramamine and smoke a bowl of cannabis prior to ingesting 2c-e.  I find that this combo rids me of a lot of the bad come-up side effects of many psychoactives, especially mushrooms.\r\n(T+0:00) 3:30pm: Ingest 16mg of 2c-e dissolved in distilled H2O.  [Note of dose measurement: not having access to a scale accurate on the mg level, I dissolved 500mg in 250ml of distilled water. (2mg/ml) I measured out 8ml with a syringe and took it as a shot.] The taste was not bad at all; it had the classic 'chemical' taste but it was completely bearable.  I put on 'Fight Club' and relaxed on my bed.\r\n(T+0:30) 4:00pm: I am somewhat uncomfortable, shifting from position to position.  My heart is somewhat racing, my hands and feet are cold, sweaty, and clammy.  My body is chilled.  I feel a warm glow in my head, slight visual distortion, and a 'presence.'\r\n(T+1:00) 4:30pm:  The distortions become more intense, and so does my discomfort.  I become uninterested in Fight Club, and put it on pause to take a shower.  I notice the visuals of this compound are very unlike anything else.  I have found that acid/mushrooms/2ct7 all have a kind of similarity- but these were very different.  Instead of the waving/breathing/flowing, it was more sporadic, less patternlike.  Colors in some of my posters were cycling and swirling, objects were undulating in terms of size. (They puff up and then shrink back down.)\r\n(T+1:15) 4:45pm: Getting close to the plataeu, but not quite there.  The warm water on my body does not feel good, but it does not feel bad either.  It just is.  The sound of the falling water all around me is really distorted, I feel as if I'm experiencing 'natural music.'\r\nAt this point, I stopped taking notes, with the final thought: 'I definitely know what madness is (like).'\r\nI knew I was really hungry, and had a bowl of cereal.  Eating was very strange.  The taste and texture of the food wasn't good, but it wasn't bad either.  It just was.  Music became too intense to listen to at one point.  I felt tired and energized at the same time.  Closing my eyes, there were no real CEV's to speak of, but rather I just got lost in thoughts.  To comment on the above note- I felt as if I had gone insane.  I was hearing voices inside my head.  They were not mine, and they were having  conversations with one another, and me as well.  This was not very pleasant.  My thoughts were chaotic and unbalanced.  I didn't seem to get much out of them, I was not feeling introspective.\r\nAs I started to come down, my mind returned to normal first, and the OEVs slowed down to a close.  I made myself a rum & coke and smoked another small bowl to calm down while listening to music.  I went to sleep at 11:30pm(T+8:00) and slept for 10 hours.  I was worn out and tired the next day.  I think I could have slept before T+8:00, but my 'normal bedtime' is around midnight-1am.\r\nIn PIHKAL, Shuglin says something to the lines of: 'I'm not sure if I had fun or not - but I definitely want to explore further.'  I completely agree with that.  If you are looking to 'just get high' this is not something for you.  My experience just 'was,' but not in a positive or negative way.  I do intend to explore this compound again, perhaps at a higher dose.\n\n\n"
}