{
 "title": "Cleaning the Windows",
 "author": "Syntar",
 "citation": "   Syntar. \"Cleaning the Windows: experience with Methamphetamine (ID 22731)\". Erowid.org. Mar 7, 2007. erowid.org/exp/22731",
 "substance": "Methamphetamine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3 lines",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "22731",
   "Female",
   " ",
   "Not Given",
   "Mar 7, 2007",
   "44363",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was around 10:00 am.  On a Saturday morning.  I had partied the night before with new friends that lived in my apartment complex. I had done ecstacy the night before for only the second time, but I had taken all the nessecary precautions before going to bed (1 vitamin C, 2 Aspirin, and 1 Calcium tablet with a full glass of water). They always do me right. </p><p>That morning when I woke up my boyfriend was not at our home and so I figured he might be in the apartment above us, one of our new friends.  Sure enough I knocked on the door and he was there, with another friend.  They were on the internet, looking at porn.  Our friend, we will call him Jim, he got nervous and thought I would be mad at what they were looking at, but I was fine, I told him it didn't bother me and I sat down and joined them.</p><p>My boyfriend sat next to me and told me that they were doing something new, something Jim did sometimes and shared with him today.  He showed me and than offered me some.  Jim called it Glass.  He gave us more info on it, but at the time, he didn't even really know much about it.  I ended up afterward finding more info on it on the internet.  I like to know what I'm doing.  My boyfriend and I have always experienced drugs together so I decided I would do some too.</p><p>Jim cut me a line about 1 inch long and rolled up a $20 dollar bill, which I found very distasteful.  But I did it anyways, I put the rolled up bill in one nostril, Jim told me to close one nostril with my finger and also to breathe out all the air in my lungs and then snort quickly the line.  I was really scared because I had never done this and it took me awhile to take that first giant leap!</p><p>When I did it, the first thing I felt was a blow to the head, then almost immediatly after I felt the burn, I felt like my nose was on fire, both my eyes watered profusely and my teeth began to clench!  After about 10 seconds (felt more like 10 minutes) my nose became a little more accustomed to this newborn sting.  Then what Jim called the 'drip' came.  This was a slow meth, mucous and saliva mix that ran down the back of my throat and into my esophagus.  It was very nasty, and actually partly gave me a gag like reflex, but I was able to calm it down with a large glass of water.</p><p>Jim told me to drink lots of water because this drug can dehydrate you.  So I continued to drink water anytime my mouth felt dry, so that I didn't overhydrate myself.  After about a few minutes, my mind was racing, I felt very much at peace and very talkative.  I remained quiet that day so that I could experiance this high on a personal level.  I pretty much just took everything in.</p><p>This high was not like marijuana, ecstacy, or mushrooms.  It was a very peaceful and mind tingling experience.  I did about 3 more lines the same size in a span of 6 hours.  The day turned to early evening and my boyfriend and I came home, we were expecting guests over soon and we realized once we got home that we could not stop talking, about everything, the experience, the feeling, our thoughts.</p><p>We also noticed little things Jim called 'Tweaky twitches', like my boyfriend kept grabbing his goatee, I kept clenching my teeth, we kept moving around the room, excitably, and looking out the window even though no one was out there.  We both were examining this new feeling openly, expressing how our minds were racing yet feeling competely focused and determined in thought.</p><p>I noticed I got very expressive emotionally and very affectionate with my partner, not sexually, just very 'clingy', alot of I love you's and alot of expressions of how much I appreciated him.  We both felt like little children on a playground, talking about how fun it is to ride a fast rollercoaster.  The rest of the evening was very delightful and insightful.  I had no negative ordeals for the duration of the high, the high began to wear of several hours later, probably around 3 am that sunday to be approximate.</p><p>The only after effects I concluded happened several days later.  I became irritable, moody, and plain old crabby.  After learning more about glass, I realized that this drug depletes your serotonin, the recepter that basically takes care of emotional stability.  I needed to take note of my hyper-sensitivity, and my moodiness.  I also took plenty of vitamins and lots of sleep.  This helped insure a better and emotionally healthier recovery.  I took note to be easy on my self the following week, because most of us work for a living, this simple thing can cause much stress and become even harder after using this drug.  Unlike some people, I did not find myself wanting more, I merely just enjoyed the time I had with it.  </p><p>That was 1 year ago.  I have done Glass occasionally since then.  I no longer snort it for fear of serious damage to my nose, I smoke it.  I have done 3 day long glass binges with friends, no eat, no sleep.  Today, I can't imagine putting my self through something like that, payback was a serious b**ch.  Now I occasionally smoke but for one nite only and then thats it.  Smoking I have found it less harsh on my body.  I can still eat, and still slepp when I want to and need to.</p>"
}
