{
 "title": "A Sick Start to a Nice Trip",
 "author": "Sublime",
 "citation": "   Sublime. \"A Sick Start to a Nice Trip: experience with AMT (ID 22786)\". Erowid.org. Oct 24, 2008. erowid.org/exp/22786",
 "substance": "AMT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 22786",
   "Female",
   " ",
   "Not Given",
   "Oct 24, 2008",
   "Views: 5303",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently trid AMT for the first time with my boyfriend. We went to his apartment and took it at about 2:30 in the afternoon. Some people snort it, although i have heard that this burns and is very uncomfortable, so we wrapped the powder in tissue paper and swallowed it. </p><p>After about 40 minutes, i felt lightheaded and my stomach was queasy. My hart also felt like it was beating extremely fast and i was shivering. I had only had a small bowl of cinammon oatmeal about 3 hours before. I threw up and came back to lie down. After about 20 minutes, i threw up again. Then i felt much better, but still kinda 'floaty' feeling. By then it was about 4. I started noticing different colors and shadows on the white sheets. </p><p>We watched rugrats and it sounded like the characters were speaking jibberish and the colors were insane. we played some trippy music at the same time, mostly grateful dead. we watched ren and stimpy and it was funny but gross. i noticed things like eyes and animals on the walls and ceilings, especially the wood-paneled walls, which seemed like a forest.</p><p>I had brought some toys over (i highly reccomend having something to play with if you cant be outside), including a kaleidoscope, play-doh, a koosh ball and a coloring book. The kaleidoscope really spaced me out and the play-doh felt very fun. By the time i was peaking, at about 8, i got pretty over-sensitized. I felt like having my best friends over, so the three of them came over. they all just stood around and couldn't really relate, although we smoke pot and drink all the time together. They just couldn't see how funny and cool i thought things were. </p><p>My boyfirend never came out of the tired stage and couldn't laugh with me either. We went to ben and jerry's and i felt like a little kid, watching people and looking at the cows on the wall. By about 1, we were sitiing in a diner smoking cigarrettes and i was real tired. I drove home at about 3:30 in the morning and slept like a log.</p><p>Overall, it was a good trip. I was hoping to have some more out-of-body or significant revelations, but i think i'll wait and do shrooms again for that. AMT seems to be more of just a recreational, ectsasy kind of drug. Just be prepared for some discomfort an dpossible vomiting while coming up, and tiredness after the 12 hour trip. Also, I would start out with a small dose, around 30 or 40 mg.</p>"
}
