{
 "title": "Euphoric Hookup",
 "author": "GreenGirl",
 "citation": "   GreenGirl. \"Euphoric Hookup: experience with H.B. Woodrose (ID 22802)\". Erowid.org. Feb 10, 2006. erowid.org/exp/22802",
 "substance": "H.B. Woodrose",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 22802",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2006",
   "Views: 4438",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience with these seeds was a very positive one. My friends and I all took them at different times, yet we all started to trip at the same time. For at least an hour before they kicked in, we were all in agony, complaining of stomach pain. All we wanted to do was lay in bed clutching our stomachs. Finally, we felt well enough to travel the few blocks to our friends who gave us the seeds. There they had set up a very nice environment to trip in. And thats exactly what happened. As soon as we got to his house, our stomach pain disappeared and our trip kicked in. One word I would pick to describe it: Chill. We were all just chilling out. I went outside to sit on the porch, and started talking to this guy that I had a crush on. Because I was tripping really hard by this time, it was much easier to talk to him than it had ever been before. After chilling out for awhile, my other friends decided to go back home. I made the decision to stay with the guy. We went back to his room, and he set up another awesome tripping environment. We chilled out, and then eventually, we hooked up. The whole experience for me was entirely perfect. I experienced a lot of euphoria with these seeds, and the visuals were very cool too. </p><p>Later on, I found out that once my friends left, their trips began to go downhill. They found themselves alone, just the two of them, and started to trip out. With no one around to help them, they just continued in a circle of questions. Neither of them knows exactly what happened, all they would say was that they were somehow communicating with out speaking. Weird. </p><p>Overall, the experience with these seeds was very awesome, I personally experienced very little nausea, and had a very wonderful time. Highly recommended.</p>"
}
