{
 "title": "Visiting Heaven",
 "author": "MC9",
 "citation": "   MC9. \"Visiting Heaven: experience with Mushrooms (ID 22815)\". Erowid.org. Mar 27, 2006. erowid.org/exp/22815",
 "substance": "Mushrooms",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22815",
   "Male",
   " ",
   "Not Given",
   "Mar 27, 2006",
   "Views: 3487",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>If there was one word for the first time I did mushrooms outside during midday I would have to say it was Magical.  </p><p>I never will forget the trip I went through by eating aprox 3 grams of mushrooms.  I eat every bit just like it was something precious.  Knowing that I would eventually have a high that only I would be in I was very excited and my friends and I headed off towards the forest where a waterfall was.  It was me and 4 others who eat mushrooms but I was the biggest consumer.  </p><p>My pals and I were able to eat the mushrooms before we took off towards the waterfalls.  Unfortunately there was plenty we had to go through like 1 foot of snow.  It wasnt fun or easy at all getting to our destination but then again I knew it was going to be a struggle to get where we all planned to go.  We headed off and I soon found out that as I worked my body the mushrooms were digested a lot faster then if I sit in a room or do any lazy work.  It is something that diffidently hit me with in 30 minutes.  I started to daze off and I could feel myself being lost in the world of mystery and simple answers.  </p><p>When we felt that we got close enough to wear we were heading, we decided to rest and just see how things flow.  I can remember we stopped down stream of wear the frozen water fall was and there were trees and life all around.  At first it wasnt all so great and I did feel a bit depressed and wanted to go back home instead of being outside of our boarding school campus.  I quickly started to look at things and wondered about them more deeply to myself.  I was a bit depressed but just thought to my self why dont you just be happy that you did them and have fun, laugh, socialize with the others.  In any case that seemed to work the best because before I knew it I was laughing and having a great time with my other friends.  There were a few sober people around, well basically, the only thing they did was smoke some bowls.  But I found out how much friends really are dear to me and I never ever wanted to break a friendship for any reason.</p><p>We were all just chilling in the forest and before I knew it when I asked my friend what time it was, it had already been almost 2 hours into the trip.  I then decided to look at the snow and just watch it as it waved around and made sharper star figures.  The way the snow looked there was nothing short of amazing.  The snow was melting little by little every time I let out a breath.  It was amazing when I saw all the snow just melt away grain by grain.  I thought about how nice it would be to live in a place surrounded by crystal like reflections.  Once I snapped back into my self I stood up and noticed how cold it was.  This was something I didnt like.  I was then irritated and I hated the cold and I hated how the snow would make me feel numb after a bit.   </p><p>Once we started moving again it was so pretty how the trees made the shadows in the snow look.  There was nothing like it, the snow had looked as if they were clouds and they were moving as water does when it flows downstream.  I was on top of the clouds just like Jack and the Bean Stock.  I watched the snow flow around my legs and around other tree trunks.  The rest of my friends were just jumpy and laughing at everything as they walked on.  I didnt wanna walk around anymore and I would have loved to stay in one place for a while to admire the great out doors.  I thought about the most unimaginable stuff one can think about.  I thought about how heaven is just the same as earth, and how there are many different dimensions, and that we were in only one of them.  I also thought about my free choice and the freedom we really have.  I mean do we really have freedom or are we simply slaves to modern society.  I thought about how wonderful it would be to be absolutely free. I also wondered if I was the only one on earth that could understand what I was saying.  I even wondered if I could even bring it out on words or even totally explain what I was thinking.  </p><p>We all walked on, and it kept going through my head that the more we walk the farther we had to walk back to the school.  And trust me I wish I would of just teleported back to wear my room was and pop in some Pink Floyd or some Infected Mushroom.  </p><p>For some reason every time Im on mushrooms I feel as if I wanna experience LSD (Acid).  There is no other reason but to just experience the images and see what I think.  The mushrooms are fine and I love them but its just like a itch that I have to scratch Im not sure that Id do Acid, maybe its just more fun to think about how cool it would be rather then to actually do it.  </p><p>We walked and walked and finally there was no way I was going to walk anymore I wanted to enjoy my trip rather then think about whats in front of me or anything else.  A friend and I just stopped and rested for a bit laughing at stupid things like the air and how our hats looked funny or whatever.  The weirdest part was when we stepped over a log and blood came out from under the snow.  The blood was red and I did notice it before I stepped into it.  I was just too tired to care but I did wonder what it was from.  One of my friends yelled everyone stop ware you are someones bleeding!  For minute I thought I was tripping hard and I could do nothing but stop and rub my nose and spit and see if any blood shown.  Luckily it was no one and it turned out to be some dead animal or something that was under the snow and someone stepped on it.  The blood was quickly forgotten and we moved on.</p><p>There was a hut we liked to stay at up the trail some and once we got there we took a quick break and decided to just chill for a bit and see what happens.  By this time it was well into the afternoon.  It had been approximately 3 and a half hours since we eat the mushrooms but seemed like it had only been maybe 2 hours.  At this point in time my hallucinations had died down and it was hard to see waving stuff unless I looked at it for a second or two.  At this point in time I realized how wonderful the shrooms were hitting me and how the powerful reaction just kicked my ass.  I thought a lot about how the shrooms got me tranced, and I loved every minute of it.  </p><p>We moved on, and as we did I decided to lie down on one side of the river while everyone crossed a snow covered log to the other side to pack a bowl.  I thought about how much I hated weed and how it diffidently wasnt for me at all.  I didnt wanna have anything to do with it and I was rather proud how I didnt become a slave to its effects.  My roommate was lying beside me in the snow and we talked about the power of mushrooms.  There are two types of people in the world that do mushrooms, there are the people that keep looking for more, and there are the people that just let the sensation take over.  Now I know why my roommate wanted to try acid because a few times now I wondered how wonderful the power of LSD would be.  I wanted to see more visuals as well but this thought only occurred to me when I was high on shrooms.  </p><p>Anyway my roommate and I were just laying there talking when everyone started yelling at me to cross the river.  Now being me and how I took the shrooms I should of known better and said yo just go on with out me.  But instead I decided to try and cross the log over the river.  Of course it was way more difficult when someone is on shrooms but I still tried.  The first time I was a giggling geek, there was nothing I wouldnt laugh at even my situation on the log was funny.  I was half way across it when all of a sudden I looked up and my friends laughing there heads off about me trying to cross the log.  If I was sober I would have crossed it with not a care in the world but being on mushrooms made it a lot more challenging.  The log would twist and turn and faded in and out.  Trying to walk on something like that is like trying to walk on a balance beam in the dark.  So I fell in completely and was drenched with freezing river water.  The river was only 3 ft deep at the most but some how I wasnt cold at all.  </p><p>I thought quickly about how I am on the shrooms and how it probably made me numb so I decided to check my self out after 5 minutes to see if anything looked bad.  Amazingly enough I found out that my skin was as normal as if I was in side a nice warm room or something, not only did I feel warm I also was warm!  I cant say the same about my pants though because they were freezing and every time I walked I was fallowed by the sound of ice breaking off my pants.  Everyone got a kick out of it and I still was amazed at the fact that I wasnt cold or going into some sort of shock.  </p><p>After this I really wanted to head back to the room and see if I couldnt get some music on and have the last hour or so just feeling the music.  So we headed back but of course it was harder then it sounded.  One should know that a group of booming kids tend to stop ever few seconds and take breaks and stare off into there own little dimension.  It took us a lot longer then any of us wanted.  But we finally did get back.  I was coming down and everyone else had been down for quite some time now.  The things I thought about on the way back were nothing short of amazing and I swear I could make up my own philosophy about life.  My roommate and I walked back to our room and decided to just listen to some music.  Unfortunately I had to call my girlfriend in Holland and talk to her as I was coming down.  This would be a thing not quite so easy, she couldnt know I was doing this trip or else I would be in the worst of spots in her agenda.  Not a good thing when I was expected to live with her on my break coming up soon.  The phone call was weird and confusing, I could not keep a straight story and my girl had a strong feeling that I was trying to hide something as well.  I still feel bad to this day that this happened and I wish for it never to happen again.  </p><p>I looked at my hand and saw that the veins were funny colors. I would never forget about this trip and look forward to doing it again.  The thoughts and theories in my head I started forgetting as my trip came down to normal.  It had been a great day indeed.</p>"
}
