{
 "title": "Just Can't Let Go",
 "author": "b",
 "citation": "   b. \"Just Can't Let Go: experience with 5-MeO-DMT (ID 22883)\". Erowid.org. Sep 20, 2004. erowid.org/exp/22883",
 "substance": "5-MeO-DMT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "smoked",
   "5-MeO-DMT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 22883",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 20, 2004",
   "Views: 12117",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been looking to try 5-MeO-DMT for a long time, and finally got the chance several days ago when me and several friends bought some.  I've done a fair amount of hallucinogens, and have become completely comfortable with the effect of tryptamines.  Drinking Ayahuasca last year was incredible - it was pure bliss, no fear or discomfort, apart from the nausea (which wasn't even a bad thing)- but 5-MeO-DMT fucked my shit up.  </p><p>We decided the best method for taking the substance would be smoking it free-base style.  We made a spoon out of aluminum foil, sprinkled some 5-MeO-DMT  on top, lit it from below, and sucked in the smoke through a rolled up piece of paper.  Each time we did it, we took it in in three smallish hits - we found that by doing this we wasted less smoke and did not have to take in a huge hit of noxious chemical vapor.  One of us would take the hits with help from a sitter, then lie back on a bed.  I was the third person to try it; the two that went before me both had positive experiences.</p><p>I was prepared for a bad trip; I had eaten two eighths of mushrooms several nights before and spent the entire night in hell.  The odd thing was that I didn't really even trip off of the 5-MeO-DMT - seconds after the rush hit me and I started getting visuals and so on I got horribly sick and vomited.  I tried different doses, and ended up smoking it 6 times over two days, and every single time the trip was aborted before it peaked because of the incredible nausea.  Once I started vomiting, the trip would essentially end.  </p><p>I think a lot of it just has to do with the place I am at in my life right now, both in my mind set and my use of hallucinogens.  I have been horribly depressed for the past several weeks; because of this depression and the incredible attachment for the world and my life that it entails I was unable to just let myself go and ride the trip.  Instead of accepting, letting the 5-MeO-DMT  run its course and show me what it wanted, I was fighting with it.  In terms of my hallucinogenic use, it's all been downhill since my first peak experience (to use Maslow's terminology) a year and a half ago.  Since that night, I have had a bad trip every time I have eaten mushrooms with two exceptions (one of which was a combination of lsd and mushrooms.)  Every time I eat mushrooms they tell me that they've shown me all they can, and I have to get my shit together and learn how to reach those states without their help.  I used to meditate for an hour every night and work on lucid dreaming; I no longer do this.  </p><p>I think perhaps I should be meditating more, drinking more ayahuasca in serious settings and eating less mushrooms to relieve the boredom of college.  Rather oddly, since the ayahuasca trip, my trips have been much more intense (which I atribute mostly to my navigation) and my visuals have changed.  Where once I saw geometric patterns and so on, I now see flowers, vines, and other plant forms.  The ayahuasca experience is one of unequaled beauty and power, and it seems to have permananently affected my trips.</p><p>The set and setting were also not what they should have been for an experience like 5-MeO-DMT.  The dorms we live in are incredibly miserable, depressing, and dirty.  There is a constant flow of people in and out of our suite that I would much rather not associate with.  We didn't bother with any meditation or preparation; we just opened up the envelope, put a few grains on some aluminum foil, and hoped for the best.</p><p>I wouldn't by any means reccomend against this drug - just make sure you know what you're getting yourself into.  My roomates didn't experience any of the difficulties I did, and had some incredible experiences.  My experiences weren't even that bad.  I got horribly sick, but afterwards I was actually feeling quite pleasant.  You have to realize that I can't really navigate through the experience - in a flash I'm just there.  Whereas normally I'd have spent several hours getting myself to where I want to be in my trip as the intensity builds, 5-MeO-DMT  puts me right there in about 10 seconds and I have no way to keep myself organized.  I just have to accept whatever happens, and unfortunately, I can't do that right now.  I can't just let myself go.</p>"
}
