{
 "title": "The Music Was So Beautiful",
 "author": "Teri",
 "citation": "   Teri. \"The Music Was So Beautiful: experience with Salvia divinorum (10x extract) (ID 229)\". Erowid.org. Aug 19, 2001. erowid.org/exp/229",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 229",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 19, 2001",
   "Views: 7498",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI thought that I had tried or at least heard of just about every drug known in the West, and so was suprised when I stumbled on a Salvia archive on the web. Always open to new experiences, I decided to try it out.  Happily, the plant is totally legal, and I ordered some online without incident. That was easy! 25 bucks got me a small vial of divine mint that claimed to have an active ingredient content that had been concentrated to 10 times above normal. There was a small label attached that said to exercise extreme caution while using. Curious, I popped off the cap and smelled. Typical herby aroma.\r\nI was alone, confident that I could handle the experience by myself. I closed all the windows, creating a fairly dark atmosphere. Turned on a compilation CD; Tori Amos, Jamaroquoi, lots of different sounds.  Sat on my bed and improvised a little bowl out of tinfoil.  Since I don't normally smoke, it was all I had.  Packed a little, then a little more. Maybe two bowls altogether. Felt the effects come on quickly.\r\nIt started with a distortion of vision... I couldn't tell if I was moving up and down or if the room was. I tried to find a comparable experience in my memory right off but failed. It reminded me of a lot of things, but wasn't exactly like anything. I was immediately overwhelmed by the feeling that everything in the room was watching me, or that something was approaching me. It wasn't a bad feeling, quite the opposite. I was anxiously awaiting the unseen presence to make itself known to me, kept expecting a head to pop through the doorway and smile at me. I noticed that I was nude, I hadn't showered all that long ago, and decided that I should put some clothes on before this mysterious presence showed up and caught me in my birthday suit. I don't know why I felt this was necessary, but I rushed out to the living room to get my clothes. \r\nWhile I was dressing, I began to notice the things around me.  My sofa, the curtains, everything was radiating this benevolent intelligence. I felt like the furniture loved me. And for the first time I noticed the music.  Korn was on, and I would have thought it would be a little too heavy for the situation, but not at all. There was a new depth to it, the beat was so primal, earthy even.  It felt like the heartbeat of the universe, and it was all around me.  I just sat in the hallway, listening to one song after the other. It didn't seem to matter who it was or what style of music, that undecurrent of beauty was there. It occurred to me how wonderful this drug would be at a concert, or a drum circle. Gradually, I came back to a normal state of conciousness, although as I write this about 45 minutes later, I feel as though my level of awareness has been heightened.\r\nThe whole experience was short, but beautiful. I would like to try it again with friends and enough plant to sustain the high for a couple of hours.\n\n\n"
}
