{
 "title": "Interesting, Though Pointless",
 "author": "Ellen",
 "citation": "   Ellen. \"Interesting, Though Pointless: experience with Nutmeg (ID 22900)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22900",
 "substance": "Nutmeg",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "4 tsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22900",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 2, 2007",
   "Views: 3768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was 8:46 or so, and I had had a stressful day, so I was looking for a way - any way - to get high. I had very few choices; Triple C, alcohol, and nutmeg. Seeing as I'd never done the latter, I decided I'd try it. I took down the newly-bought glass shaker and put about four generous teaspoons of the spice into a large glass of milk. I gobbled it down as best I could, and went to watch a movie in the living room.\r\nAbout half-way through the film, I began to have trouble focusing on the screen. My mom also noted how I wouldn't shutup, which was quite true. I attributed that to the drug, and then just laid back waiting for the drug to really kick in. At 1:00, I didn't feel anything. Quite disappointed, I went off to sleep.\r\nWhen I woke up, there was definitely something different going on. It was 6:00, all of the alarms were beeping viciously for my mother to get to work (I didn't have school), and I was somehow, off. Off. Ha. I'll be more specific. I felt the kind of sort of clouded mind, the carelessness that the latter part of a high off marijuanna would bring. I kept smiling and laughing, as I couldn't control it. I felt like eating even though I wasn't hungry. However, it was early and I was still sleepy so I just crawled back into bed after turning off the alarms and I fell back to sleep quite quickly.\r\nWhen I woke up again, it was 11 in the morning and that previously mentioned 'clouded head' had gotten alot more intense. I immediately sat up, and ate. And ate. And ate. Let's see. I had two bowls of soup, one bowl of heavily sugared shredded wheat, two slices of toast with butter, I drink about half a gallon of milk straight from the container, and I was chewing lots of gum. That last one may not be accurate. Then I picked up a book I had not yet read as it seemed like a splendid idea. About 120 pages in, I realized how high I was. And it wasn't going away; it felt like it was just beginning. Also, though I hate to note such things, I was feeling extremely sexual.\r\nAfter a good deal more reading, my mother (she had decided not to go to work, ugh) said she was going to pick up my brothers and bring them to their sport activity so I got ready. I noted that I was stumbling a little. I also forgot to note a very, very important fact. When I was laying down on the couch, quite comfortable, reading that book I've already told about, my cat came to visit me and laid on my tummy as I continued to read. As I glanced into her eyes, suddenly I could not turn away, and saw two beautiful worlds just staring at me. They seemed ancient, reminding me of the pyramids of Egypt or just deserts, deserts with blue skies and wind. Either way, I was just tripping fabulously, feeling quite strange.\r\nWhen my mom and I got to my brother's (I had decided to invade that place for a little) I immediately turned to the kitchen and ate some meat, some frosting, and alot of orange juice - again, straight from the carton. The feelings in my head were quite new, practically the same as weed except that it wasn't camera-view and I could see like I was sober. Anyways, my brothers acted sort of positively towards me, which usually isn't the case, so I suppose my body-language said I was very laid back and chill.\r\nI tried reading the newspaper, tripping over words and having trouble understanding what I was reading for my thoughts were constantly drifting. After that, I came here, to the computer, to document this trip as I love to document all of my drug experiences.\r\nAnyways, yes, this has been my nutmeg experience! I used a bottle of ground nutmeg, which cost like $6 and which I bought at a grocery store, and I had about four teaspoons. Took a while to kick in, as I had only awoke the following morning to find myself high but until then I presume I was sober.\n\n\n"
}
