{
 "title": "The Back of the Universe",
 "author": "Neuroactive",
 "citation": "   Neuroactive. \"The Back of the Universe: experience with 5-MeO-DMT (ID 22933)\". Erowid.org. Apr 14, 2003. erowid.org/exp/22933",
 "substance": "5-MeO-DMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 22933",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 14, 2003",
   "Views: 12664",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Shortly after receiving my 500mg of 5-MeO-DMT in the mail, I decided to try it out with two other fellow psychonauts. We prepared a slightly smaller than average lightbulb for smoking by ripping out the internals of it. (It was a clear lightbulb, the white on the inside of most are poisonous!) We prepared the back of my friend's van for resting back, due to the many warnings about total balance loss and the danger of falling over.</p><p>After dropping a tiny bit of crystals in the lightbulb, we heated it with a lighter, covering the opening. The smoke began to tumble about in there, but the crystals still hadn't entirely vaporized. We let the whole lightbulb become filled with smoke, holding the flame under it for about a minute. I grabbed the metal end and took a long and fierce inhalation, tasting the familiar smoke (I had tried to smoke it once before, pretty much unsuccessfully). This time, my lungs filled with an acrid and harsh smoke of the 5-MeO-DMT. I knew this was the real thing, and I reclined back into the padded van floor.</p><p>What puzzles me about the reports I've read on this substance is the lack of any mention regarding the extreme kinetic and physical aspect of this drug. Every single person that I've seen on it has been intensely physical during the high. This doesn't exclude me. After reclining back, I began to feel as if I had failed to stop reclining backward...slowly tumbling over and over...</p><p>Eventually the back of the van felt like my capsule, getting shot in the cannon through the universe. My soul was getting kicked in the ass, and I recall seeing my friends watching me laughing at my own joy. In fact, they told me I was laughing some of the time, which I don't recall.</p><p>The high involved absolutely NO visuals; I saw absolutely nothing. It is a purely a physical smash and a mental exploration of the universe. In fact, it's incredibly hard to describe what happened. </p><p>The most amazing part about the whole thing was knowing that I had done a very, very tiny amount of the substance. I would estimate the dosage at under 10 milligrams smoked, which threw all of the psychonauts I was with into a high of undescribable proportions.</p><p>'I just got shot out of the Universal cannon for 15 minutes...'</p><p>'I was just in a cosmic dryer.'</p><p>It's one thing to read the experiences and reports and an entirely different thing to actually experience it. Chemical bliss for everyone I've done this with. If you're afraid of experiencing 'chemical terror', take smaller doses and work up.</p><p>So good, cats ask for it by name! Meow meow meow meow....</p>"
}
