{
 "title": "Cat Squirts",
 "author": "Bob",
 "citation": "   Bob. \"Cat Squirts: experience with Catnip (ID 22984)\". Erowid.org. Apr 10, 2007. erowid.org/exp/22984",
 "substance": "Catnip",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Catnip",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22984",
   "Male",
   " ",
   "Not Given",
   "Apr 10, 2007",
   "Views: 26877",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I bought a huge bundle of herbs off the net and been experimenting with them for awhile with little results.  Getting fed-up with smoking the stuff I decided to make a tea and actually drink the herb, thinking if a cat can do it can't I?</p><p>I weighed exactly 4 g on my digital scale and put it in my coffee blender.  I let it run for about 45 seconds until it was almost all in a powdered form.  I then boiled a cup of water, put the powder in and let it soaked for about 15 mins mixing it once every 4 mins.  Next it was time to drink it.</p><p>I was not under the influence of any substances at the time.</p><p>I didn't enjoy the taste very much, I have a really weak stomach, so I put in two sugar sweetners and a little milk.  I was still hard to digest because the powder kept sticking to my throat.  At first I thought I had a slight rushed feeling that MAYBE lasted a few minutes and feeling a bit relaxed.  Catnip is excellent if I want to go to sleep, I tried it before and always felt tired right after.  So I went to bed.</p><p>That night I had an incredible vivid sexual dream, which usually never happens after jerking it before I go to sleep.  I woke up the next morning and could remember the dream in great detail.</p><p>Day 1:  That day I had to take 10 shits throughout the whole day.  On two occasions the shits were REALLY sneaky too, the ones where you fart and a little slush is right between your crack.  It always had this certain awfull smell to it.</p><p>Day 2:  I still had the shits but it wasn't as bad as the day before.  The same smell.  I had to take around 5 that day.</p><p>My advice.  If you want to drink catnip PLEASE don't eat the herbs unless you aren't feeling regular.  Let the herbs sit in the water (don't boil it) for about 20 mins and then drink.</p>"
}
