{
 "title": "A Mellow, Easy Buzz",
 "author": "T-Moe",
 "citation": "   T-Moe. \"A Mellow, Easy Buzz: experience with H.B. Woodrose & Cannabis (ID 22999)\". Erowid.org. Oct 3, 2007. erowid.org/exp/22999",
 "substance": "H.B. Woodrose & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "9 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "22999",
   "Male",
   " ",
   "Not Given",
   "Oct 3, 2007",
   "5776",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just tried HBW for the first time and had a positive experience, so I hope the things I learned can be of value to others. I'm in my mid-twenties, with pretty broad experience in most drugs, though my tastes run almost exclusively to MJ and booze, with occasional (i.e. once or twice a year) psychedelic voyages facilitated by entheogens like psilocybin mushrooms or LSD. Wanting to try something new, I researched HBW and decided to give it a try, buying seeds online. </p><p>First I chose a good time to dose- it was a beautiful Sunday morning in the spring, I had no pressing responsibilities to attend to and I had the whole day to myself. Furthermore, I was in good mental/physical/spiritual health and ready for a new experience, so I prepared a drink from nine HBW seeds. Here's what I did:</p><p>1. Scrape the seeds with knife, removing as much of the brown, woolly matter as possible, so the seed looks white. This fuzz is the stuff that will irritate your stomach.</p><p>2. Fill a jar with warm water, soak seeds for two hours</p><p>3. Remove seeds, try to scrape away any lingering brown fuzz (it's easier after they've been soaking), then crush seeds to a pulp with mortar and pestle. Needlenose pliers or a hammer will work, too. </p><p>4. Take pulp, put in jar with water, shake vigorously a few times. The water will turn brown-green. Drink the whole thing and relax. </p><p>DOSAGE NOTE: I'm a lean 6'3 and 190 lbs., I work out regularly, have a quick metabolism and a sensitive stomach. I took the nine seeds on an empty stomach and found it was a good dose for me, especially for my first time. </p><p>The mixture didn't taste that bad, but it didn't taste that great, either. So I sat back, put on some tunes and took a couple bong rips, for both pleasure and to help with the nausea. After about 30-45 minutes my stomach rumbled. I felt nauseated enough to think that at any minute I'd be running for the bathroom to hurl my guts out, but I closed my eyes, relaxed and pulled it together. After a few minutes, the nausea got better, so I drank some water took a soothing bong rip and my stomach returned to calm.  The nausea passes and never comes back. The effects came slowly. After an hour or two, I noticed a definite change, though nothing major: a mellow, full-body tingle and altered perceptions, especially where time and space were concerned. I tried watching a basketball game on TV but found it too hard to follow, even though I'm a fan of the game. Relaxing, listening to music and sitting outside on the porch by the trees was the best thing to do. </p><p>At three hours the effects plateaued and I thought that was it, the experiment failed. I'm glad I was wrong. Suddenly at the fourth hour, the stuff really kicked in: I had a wonderful mind trip very similar to a mild dose of good LSD, but with a surprising burst of energy I hadn't experienced with any other psychedelics. I felt calm, serene and full of vigor all at once, stoned and full of piss and vinegar.  After a while, I walked in the park  through the grass and trees, enjoying the beautiful spring day. The effects tapered off after a couple more hours, so the total trip time was about eight hours, though I felt a few lingering effects into the ninth, tenth and even eleventh hours. </p><p>SUMMARY: This was an excellent experience- a mellow, easy buzz, similar to a mild dose of good LSD. It lasted about eight hours, with an onset of about one hour and the peak hitting after 4 hours. There was some initial nausea, but it's not that bad and it passes. Cannabis goes very well with HBW, it kicks off the trip and calms the stomach.</p>"
}
