{
 "title": "Tolerable Panic",
 "author": "sensei",
 "citation": "   sensei. \"Tolerable Panic: experience with Cannabis & Alcohol (ID 22992)\". Erowid.org. Apr 15, 2003. erowid.org/exp/22992",
 "substance": "Cannabis & Alcohol",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "4 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "1 shot",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 22992",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 15, 2003",
   "Views: 14549",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was around a friend's house, with a couple of other people, and we were generally having a laugh, drinking and smoking weed. Anyway, I had had three beers, a large shot of whiskey and a glass of some alcopop, and, a few tokes on a joint, when we decided to get properly stoned.<br>So my friend rolled up and we started playing 3 person traffic lights (where you can't exhale until the joint gets back to you). We did this with one joint and I was quite stoned, then we rolled with another and I gave up the traffic lights half-way through, feeling the tingling in the back of my head that tells me I'm very stoned. I went back in the house, and two of my friends decided to roll another joint. I myself collapsed on the floor, back against a soft chair, and laughed so hard it hurt. Then I found that it was hard to breathe, and that my heart was beating so hard it hurt. This started to freak me out, but I thought to myself: its a panic attack, its in your mind, just calm down. This helped, and I even thought the room was still swimming and whenever I closed my eyes I was scared shitless thinking I was falling, I was able to get up and walk over to my friends to let them know I was ok.<br>I then collapsed on the sofa, and for the next 15 mins or so (i think) I lay there. During this time I felt panic and felt like I was falling, and also whenever I heard my friends laugh I thought they were laughing at me, in a nasty way, and thought perhaps they had laced my joint with something (nonsense, they had toked from the same). I thought: I didn't know you could get bad trips from weed. What if I get really messed up? This set off my panic again, but I contained it by thinking that it didn't matter, because I couldn't really do much about it anyway. At times I felt certain parts of my body feel warm and tingling and almost painful, yet no matter how much I told myself it wasn't real, the feelings wouldn't go away. In the end with a huge effort of will I drank a glass of water, then went upstairs and collapsed on the bed. I don't remember much after that, just waking in the morning and thinking: wow I can think clearly again!<br>Anyway this was my first bad trip on weed, I don't know what triggered it, but it was quite endurable, and the sensations were fun at some points.\n\n\n"
}
