{
 "title": "Hit Me Like a Ton of Bricks",
 "author": "Mac",
 "citation": "   Mac. \"Hit Me Like a Ton of Bricks: experience with Salvia divinorum (10x extract), DiPT, Cannabis & Alcohol (ID 23010)\". Erowid.org. Jul 23, 2004. erowid.org/exp/23010",
 "substance": "Salvia divinorum (10x extract), DiPT, Cannabis & Alcohol",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   " ",
   "  ",
   "smoked",
   "DiPT",
   " ",
   " ",
   "  ",
   "oral",
   "Alcohol",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "23010",
   "Male",
   " ",
   "Not Given",
   "Jul 23, 2004",
   "Views: 9728",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently received salvia 10X extract and a sample of DiPT in the mail so we decided to combined them. None of us were really sure what to expect.  In a water bong with cold water, we packed a nice sized bowl, put a decent amount of salvia extract (10X), a small amount of DiPT, and lit it using a blue torch lighter.  My friend had done DiPT before and made sure that it was an ok amount of DiPT for everyone else's first try.</p><p>It hit me as soon as I inhaled.  The force of the salvia pulled me down, sounds were strange (but I was too messed up to actually realize how they were different), I looked around the room everyone looked kinda funny.  Then, I laid down, and like a ton of bricks it hit me so hard. It was so strange because i had tried salvia 10X but the DiPT kept me up somewhat so i could enjoy it more, as well as experience the DiPT which was interesting as well.  No open eye visuals , but many closed eye visuals.  It was very interesting and tickled part of my brain that hadn't been touched by other drugs before. </p><p>It was light out so we went outside after a little while.  The body high and after effects lasted for the rest of the night as we smoked and drank beer (I couldn't drink that much but my friends who also tried this drank a lot).  It was definitely a good experience. I tried it again with less of each substance and the effects were still enjoyable but not as strong (lack of strong salvia effect due to repeated salvia use that weekend).  </p><p>Please be careful, my roommate got way too fucked up from this and COULDN'T HANDLE REALITY.  We calmed him down and he was fine but it could have been really bad.</p>"
}
