{
 "title": "Shutting Down The Sense",
 "author": "Frozen Man",
 "citation": " Frozen Man. \"Shutting Down The Sense: experience with 2C-T-7 & MDA (ID 2302)\". Erowid.org. Oct 4, 2000. erowid.org/exp/2302",
 "substance": "2C-T-7 & MDA",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "2C-T-7",
   " T+ 3:00",
   "150 mg",
   "oral",
   "MDA"
  ]
 ],
 "footer": [
  [
   "2000",
   "2302",
   "Male",
   "",
   "Not Given",
   "Oct 4, 2000",
   "15450",
   " "
  ]
 ],
 "report": "<p>\nThis trip is a little confusing.  When I recieved some 2C-T-7 originally, I noticed that no one had combined it with Ecstasy.  Some brave friends took a lower dose of 2C-T-7 (~8MG) and some MDA (one other took MDMA).  They found the two to have a synergistic effect, although they never got the heavy visuals that I had found on a heavier dose of 2C-T-7, they felt like they were having a VERY powerful Ecstasy trip.</p><p>Later one weekend, we were camping out in the woods, and I found this amazing spot on the rocks that overlooked the valley.  When I found it I thought, this is the place for a trip.</p><p>Convincing two friends to take a 25MG dose of 2C-T-7 (one took another 25MG booster dose at about the T+2:00 mark).. we began our journey.  Two of us had it come on rather fast, and at about T+1:00, we witnessed an amazing fractal pattern consume a piece of cardboard in the fire... both of us almost simultaneously said 'beautiful.'</p><p>The other friend did not seem to be impacted the same, and took another 25MG.  There was the stipulation that the friend had been using psilocybin mushrooms somewhat heavily recently, and a possible cross-tolerance was considered. (??).</p><p>We began to scale the mountain at about T+2:30... which was difficult given the heavy body load of the 2C-T-7. Muscles were VERY stiff... half way up the mountain, I ingested the MDA and the others ingested some MDMA.  We continued our assent, and I could feel 'something else' coming on...</p><p>When we got to 'the rocks,' we were in absolute awe of nature.  We could see the sheer beauty in everything... we stopped talking and began to 'stare' out into the trees... at one point in the staring, I began to feel as if all my senses were in fact, one sense.  I could see EVERYTHING at once.... and then... _IT_ happened.</p><p>I'm not sure what _IT_ was.  Time disappeared.  It felt like eons had passed, and my two friends had switched positions (which originally blew my mind -- I thought something VERY divine had taken place, but they had in fact, moved by their own control).  However... very strange things began to happen.  Telepathy.  We were completing one anothers sentences.... I had an odd feeling that the MDMA was more powerful than the MDA... but nonetheless... it was as if I had 'shut off' that one sense...</p><p>There were moments when I was taking everything in... becoming totally still... then -zap- time would seem to disappear.  It felt like I had been sitting there for days... yet only 3 minutes had passed.  I asked my friend for the time everytime this happened... and it happened a fair number of times.  Yet, only a few minutes would have passed.</p><p>My friend would have gotten sick of me asking, had not the same thing been happening to him... and what seemed to be in unison.  There was an odd connection, which we seem only able to explain as 'telepathy.'  Yet not telepathy in the mind-reading mind-controlling state... only becoming one with everyone.. yet it doesn't really seem like that either.  It's hard to understand, and harder to put into text.</p><p>I still think I shut off the one sense... and experienced 'something else'... yet, I have a very hard time remembering.  The 2C-T-7 seemed to be hard on the short term memory... while the experience was valuable... I was overwhelmed with a fear of self-destruction on the come-down... that this continual slipping of time would in fact continue on,... that it was in fact simply my short-term memory completely malfunctioning... baseline in 13 or so hours.  Sleep did not come easily...</p><p>Unlike Shulgin, the light was blue.</p>"
}
