{
 "title": "Before and After",
 "author": "A",
 "citation": "   A. \"Before and After: experience with Ecstasy & Sertraline (Zoloft) (ID 23025)\". Erowid.org. Apr 16, 2003. erowid.org/exp/23025",
 "substance": "Ecstasy & Sertraline (Zoloft)",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   " ",
   " ",
   "  ",
   "oral",
   "Pharms - Sertraline",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23025",
   "Female",
   " ",
   "Not Given",
   "Apr 16, 2003",
   "Views: 10055",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I rolled for the first time last night. I take Zoloft for my depression but hadn't in two days. (Zoloft has a half life of 26 hours). I had heard SSRI's like zoloft lessen the roll, and I think mine did. </p><p>It was eight o'clock when me and my friend dropped. It was a whole pill. I don't know exactly when it started working, but it was some time before nine. (I was trying to avoid thinking about it). First, my heart started racing. I tried hard to slow it down, like breathing slowly and resting. But it didn't work. I was so unsure of whether it was working or not, or whether it would. I don't remember how long it took, or when exactly it happened, but I felt it. It was like energy was flowing through every part of me, and every touch was so incredible. It was as if it didn't just touch the surface, but it touched deep down and all over at once. I was at a friends house, so they were very good to me. I didn't see much change in light. I've heard light shows were supposed to be mind blowing... but they looked the same as when I was sober. I felt so close to everyone and wanted hugs and snuggling, and I got it! They gave me water which was ice cold and it cooled me down instantly. (by then I was sweating from my heart rates increase). Just then, when I thought everything was so great, they pulled out the vicks. One of my friends rubbed it under my nose and when I breathed it in it gave my chest a free, minty feeling. But then, they pulled out the vicks inhailer. When I breathed it in, it sent a jolt of life to my body, it made the energy I felt surge and it filled my chest, mouth, nose, airway, stomach, all of me, feel fresh, clean, like my mouth when I eat a mint. The feeling was consentrated in my torso. A little after that, my other friend gave me a vicks kiss. She took the inhailer, put it between my lips, told me to inhail, and then blew through the other end. It was like breathing it in normally, only the feeling was ten fold.</p><p>They didn't try many roll tricks on me. They did do air plane. They put me on my friends back, and another grabbed my legs and moved them up and down and around, it felt like flying. I thought I was floating. Later on, while snuggling with one of my close friends who was also rolling. We kissed. Since it's not even 24 hours after my roll (which ended around 11 pm. It's now noon) I'm very confused. We kissed ALOT. Before I knew it we had spent two hours all over each other! And I've been with my current boyfriend 5 months, but that didn't seem to matter to me at all. I'd always had a little thing for this boy, and the xtc seemed to amplify it. Now I'm not sure if what I felt last night for him was real, or just the drug. My other friend that was there asked if we were hooking up so... maybe what we did is kinda outta the ordinary. I've heard of people making out like crazy while rolling, but then why would my friend (who was my source and had been/done E for a long while now) ask if we were going to hook up? I've very confused, and slightly paranoid as to how/what he thinks! I'm sure it'll all work out after I've hit the 5 day come down. </p><p>I'm told in five days I'll have a harsh come down where I'll be overly depressed and possibly suicidal. My experience with E wasn't what I thought it would be. I thought it would be a total mind fuck and shoot me into a whole nother universe. Don't get me wrong - it was fantastic and I can't wait to do it again, but I thought there'd be stronger physical/visual effect! Maybe it's because of my zoloft, but who knows!</p><p>I did feel a closeness with everyone. As if I had known them all and loved them all my entire life, even though I had met 4 of the 5 people there that night. I was overflowing with love and wanted to hug everyone and snuggle. It was as if they were all my best friends, my soul mates, my one true loves (even if there was 5 of them!). It was a fantastic feeling of unity. Not only did it feel good to be touched, but touching other people was just as good. I'm wondering how my five day come down will be... slightly nervous. </p><p>My friends have told me to take a daily vitamin every day for the next few days because it'll help my body. But they also told me the next day everything would taste bad, but it doesn't. It does taste odd, a little different, a little off, but not nasty like they described.</p><p>Even after the effects of the pill had all but vanished, I still felt happy, loving, snugglie, and all the other emotional things that I had. hmm, I think that's all I have to say. Sorry it's not completely in chronological order, I'm still trying to figure it all out myself!</p>"
}
