{
 "title": "What Happened to My Legs?",
 "author": "Nemo",
 "citation": "   Nemo. \"What Happened to My Legs?: experience with Mushrooms (ID 23037)\". Erowid.org. Feb 8, 2006. erowid.org/exp/23037",
 "substance": "Mushrooms",
 "bodyweight": "162 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23037",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 8, 2006",
   "Views: 10179",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My two friends and I had been saying we should get together and trip for around 2 years before we finally got an opportunity; I remember the last events of this day so fondly...</p><p>I meet up with A and Z downtown, we follow Z to the house of the guy who's hooking us up.  This guy was real chill, we sit in his living room and get stoned; he pulls out a book and starts telling us about the particular variety he had (hand picked).  At this point he recommends making a tea with this particular mushroom, I protest that I'd rather just 'crunch em, fuck the taste'.  he takes us into his basement where he pulls out these stuffed ziplock sandwich bags (supposedly it was an 8th, but I'd never seen a shroom bag this big), and hands them to us; I note uppon inspection that the gods flesh contained within was in perfect condition, this guy really cared about what he does.  These were also a totally different varity than mushrooms I'd had before; I'd only tried quarter-sized fat caps with short stems before, these had a long stem made up of a cross shape that got fatter towards the cap which was no bigger than a dime.  </p><p>We take off and go to find some pot of our own (my own really, this was at my house after all), another successful score out of the way we proceed back to my place.  We chill up in my room, Z and I bust out on guitar, and A rolls a joint.  At some point we order a pizza (probably around 6 or 7 pm), none of us had really eaten at all that day and we wanted something so the shrooms wouldn't eat away our gut; A thinks it's hilarious to eat a few caps on his pizza with my mom around the corner doing laundry and my dad on the couch in plain view watching TV.  At about 9 pm back in my room I declare dose time; we pull these fat bags and start crunching away ignoring the tea idea, Mistake the first.  A and Z go through about half their bags and stop, I probably ate 3/4 of mine. The reasons for these beginning doses are as follows: Z had never tried anything beyond pot, alcohol, and cigs before, A had taken about two caps at one point in his life and hit the visual state so we thought he had a low tolerance (later finding out that the caps actually just had acid on them), and I had tripped twice in the past two years resulting in pleasant and colorful experiences.  </p><p>15 or 20 minutes go by, A and Z are playing chess on the floor while I sit on my bed EXTREMELY HIGH (despite the fact we haven't smoked anything yet, in retrospect this powerful 'coming up' period probably was an indication of the impending trip's intensity), out of the corner of my eyes I see some objects start to grow bigger and smaller; in another couple of minutes I can distinctly see my closet door bulging out in a circular shape.  At this point I proclaim I'm starting to get visuals, A and Z say they're not yet (though they later said in another few minutes the pieces were starting to slide around); I lay back and the room was starting to spin around, I heard A and Z talking about the color scheme of green I had in my room and that it was good to trip around.  The game finally over A suggests we go downstairs to watch a movie; at this point I get up and am feeling really dizzy, A looks at me and goes 'Dude, you look fucked up.', and then we all laughed about it (by this time we were probably pretty gone already, we just didn't know it).  </p><p>Moving downstairs we decide which movie to watch, A has come equipped with two; Bumfights and Super Troopers, we decide on Bumfights, Mistake the Second.  I hated this movie for the entire hour it lasted; it was pretty trippy to watch but it was fucking with me in a way that was just bad, something about crowds of people beating the shit out of each other mixed with freestyle rapping about crack plus bums too drunk to walk on top of whatever the hell else was in there that I don't want to remember is a horrible thing to watch on shrooms.  Later we all said we hated it, but we were all way too blasted to say anything about it anyway; this hour is a complete blur to me from the point of sitting down on the couch.  At this point I crossed over into whatever that other reality is, everything I can remember is in a spinning storm of greenish blue, I know I was walking backwards through time in a dreamlike trance and watching my life in third person.  </p><p>Someone stated shrooms amplify background noise; in this trip I could hear a windstorm going on in my head, actually the 'wind' was really hundreds of whispering voices saying different things.  Sometimes one would be more distinct than the rest, I occasionally identified my own as a thought and other times it sounded like a god was speaking to me, some of these gave me some crazy messages most of which I of course don't remember.  I became very tired and my body was uncomfortable despite it being stretched out, I closed my eyes and let the brainstorm take me where it wanted.  Recently I had been drinking (just to get drunk of course) and this resulted in a couple bad experiences having too much to drink; that came back during the trip, I felt really drunk most of the time and at one point was actually convinced I was drunk, though I'm not really surprised at that.  </p><p>I think in the middle of the movie we went out and smoked the joint A had rolled, I always feel like I'm becoming one with the earth when I smell pot during shroom trips, and the feeling seems to intensify as I smoke it too.  After it was roached we were back in the living room and I was having hallucinations, seeing other people and hearing them talking to me, shit like that; actually it was just Z trying to ask me what I was going through, he scared the hell out of me.  We sit on the couch and they remind me I still have some shrooms left in my bag (they ate the rest of theirs during the first half), I just throw these back because I feel so gone already I don't even want to; we watched the rest of Bumfights during which I was so completely fried I had lost coherant thought.  With my eyes closed I would see these colorful worlds just draw themselves, with eyes open little lines would just spin off of things; I kept having visuals of mayan ruins and temples, the whole trip had a distinctively native indian (Aztec or Mayan indian) feeling to it, the gods voices that I mentioned earlier seemed like Indian gods too.  I had sensory crossovers as well, if I breathed through my nose I could smell the color green, and green fans would explode in my vision too.  </p><p>The movie is finally over and we go back up to my room; A wants to go on an 'adventure', I want to smoke on this adventure, so we pack up our supplies and go out for a walk, this might just be Mistake the third.  The first attempt at getting outside I get fucking cold so I have to go get a better jacket, the second attempt we make it probably 100 feet up the hill before deciding the wind was too much and that we'd rather smoke in my room anyway; going back down I say I'm really cold still and run back down towards the house, A runs in front of me and says something like 'what are you running from', the shrooms turn this into phantoms dodging about yelling 'what are you so afraid of' in a teasing tone.  We get back inside to my room, the rest of the shrooms must have hit me about this point because I'm seeing walls disintegrate in seconds when I look at them; I have this feeling like I have been shown what I was and what I have become and the whole trip was a battle to answer see if I was happier now, the answer was yes incidentally.  </p><p>We smoke half a bowl before deciding we're ripped enough and save the rest.  I start playing my guitar and discover I have this intense musical energy, I probably played for about a half hour (by now it's like 12, though I don't know how it became that) while my friends just sat around and had 2 sentence conversations, I was completely lost in my own world; soon they start talking about me and my playing, A says something like 'Whatever happens to you I know it's going to be good' which the shrooms turned into a god telling me I was a chosen leader - cool.  We finally get tired and veg, lying in bed listening to dark side of the moon and burning nag champa, this is how it ended; a beautiful night, yet the worst was yet to come.</p><p>The next morning I wake up and go to piss, I stumble around everywhere like I am drunk, didn't think anything of this at the time (hey, I just woke up).  Finally we all get dressed and go downstairs to get water/food whatever; I can't hold a glass because my entire arm starts shaking uncontrollably, at one point my legs give out suddenly while I am walking and I fall on my ass, I'm still not really taking this seriously, though I'm beginning to wonder what the hell is going on.  For the mutual reasons of finishing the bowl and helping me out we go back up to my room and complete last night's session, afterwards I decide (don't know why) I was feeling better.  The three of us leave the house so I can walk them to a bus stop; on the way my legs start to get this really crazy feeling, it's like they were trying to move the other way or something, I had forgotten how to walk normally.  We're going down this really steep hill and I'm falling behind because I can't fucking walk, I try to catch up to my friends and fall; they turn around and I try to get up, I walk a couple paces and fall again, I tell them to just go on and eventually they do.  This really sucked, my muscles (and I'm a serious runner so my legs are pretty powerful) just wouldn't hold my weight or something.  </p><p>I try to stumble up the hill and keep falling, I try to crawl and my arms start giving out resulting in me falling on my face, this really tarnished that 'I love myself' notion I had gained last night unfortunately.  Finally I crawled to a fire hydrant and pulled myself up, after a few tries I was able to walk-unsteadily and very unnaturally-back to my house.  </p><p>With all the detail I have described here I might have hit about half of what actually happened that night; the guy who sold us reassured I would 'freak out' with these, I did.  This trip was totally different than any other shroom trip I'd had, it was much more like what I've heard acid to be; although why it made my muscles stop working was a mystery.  It was the most incredibly mentally enriching experience I've ever had; fast enough that I could live my life a thousand times a second, colorful enough that green suddenly became the representative for all color, musical enough that the keys of G and D (which I was using for a lot the guitar work I was doing that night) became everything, and emotional enough that I became myself after seeing everyone else as myself and was quite literally brought to my knees.</p><p>Mushrooms are truly the flesh of the gods, use wisely.</p>"
}
