{
 "title": "A Way Around the Nausea",
 "author": "bevz",
 "citation": "   bevz. \"A Way Around the Nausea: experience with AMT (ID 23050)\". Erowid.org. Apr 17, 2003. erowid.org/exp/23050",
 "substance": "AMT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "rectal",
   "AMT",
   "  T+ 3:00",
   "15 mg",
   "rectal",
   "AMT",
   "  T+ 15:00",
   "1 glass",
   "oral",
   "Alcohol",
   " ",
   "0.25 mg",
   "oral",
   "Pharms - Alprazolam"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23050",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Apr 17, 2003",
   "Views: 14115",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There were two things that had kept me from trying AMT:  the time commitment (for both the trip and the recovery), and, more significantly, the nausea.  I just couldnt get too excited about 2 hours of queasiness, no matter how enjoyable the rest of the experience might be.  But then my dear friend J informed me that shed found a way around the nausea:  take it in suppository form.  Yes, boys and girls  if you take it rectally, youve effectively circumvented the stomach and escorted the drug right to your bloodstream.  Voila: no nausea!  However, there are some caveats, which Ill describe below.</p><p>With this exciting new technique available, five of us set out to give it a shot, with J as our ground control (for which she deserves a medal  babysitting people on AMT is boring).   Rather than give a blow-by-blow of the day, Ill just summarize the overall plan and each persons experience.</p><p>We all started with a first dose at 8:15 a.m.  We knew that the batch was a bit weak, but started with moderate doses anyway under the theory that the drug is more effectively utilized when administered rectally.   However, either the batch was even weaker than wed thought or there is little difference in effect when taking it rectally, since none of us was very high at T+2 hours.  At T+3 hours, we all boosted.  That did the trick.</p><p>Subject A, female (me):  Body weight 125, typically a lightweight with tryptamines, never taken AMT before.  Initial dose 20 mg, boosted with 15 mg at T+3.  Zero nausea, very smooth coming up and down.   Enjoyed the mild but long-lasting sense of well-being and contentment, with a wee bit of acid-like trippiness and contemplation around the edges.  Was able to eat throughout the experience, but rarely had the motivation to get up and make food happen.  Had a glass of port at T+15, then a quarter of a Xanax, and slept soundly for 8 hours.  Felt great the next day, but a bit headachy and tired the following day.</p><p>Subject B, male:  Body weight 220, had taken AMT once before.  Initial dose 30, boosted orally with 20 at T+3 hours.  Had some mild stomach upset after the boost, but no major nausea.   Ended the trip with port and Xanax as well, and slept fine all night.  Was likewise tired and headachy two days after the experience.</p><p>Subject C, female:  Bodyweight ~130, typically a lightweight with pretty much everything, experiences nausea when coming on to most substances, had never tried AMT. Initial dose 20 mg, boosted with 15 mg at T+3.  Had only minor stomach upset up until boosting; however, we probably should have given her only about half as much boost because she quickly got very high and very nauseous, vomiting multiple times (whereas with MDMA she typically only has one bout of sickness).  We are unsure whether the nausea came from the drug or simply from the experience of being too high, but it took several hours for her to stabilize and be able to enjoy the trip.  (She had no food in her stomach most of the day, which may also have contributed to her rapid ascent). Once the nausea did subside, she had a full 12 hours of happy, connecting high.  </p><p>Subject D, male:  Bodyweight ~170, had never tried AMT before.  Initial dose 30, boosted with 20 at T+3 hours.  Minimal stomach upset, no nausea.  Described the experience as skipping in and out, never really settling into the trip.  Enjoyed the several hours of chatting and connecting during come-down the most.  </p><p>Subject E, male:  Bodyweight ~160, the hard-head, has done AMT more times than Ive had hot meals.  Initial dose 110 mg, boosted with 30 mg orally at T+3, then with another 30 (?) insufflated over the following hour.  The initial dose appeared to have little or no effect, so this method of administration appears not to work for him.  Normally, insufflating AMT leaves a ratherunpleasantsmell in the nasal passages for some time, but apparently this batch was mild enough that it wasnt a bad option  and it did prove to be the most effective method for him.  </p><p>So, the key takeaways:  for all of us, taking the initial dose of AMT rectally was effective in eliminating the nausea usually associated with coming up.  Howeverbe aware that this method may not be as effective for some as taking it orally, and that people who tend to get sick from the rapid state-change of getting high (rather than from the physical presence of drugs in the stomach) may still experience nausea and should be very cautious about boosting (or taking a high initial dose).</p>"
}
