{
 "title": "Anxiety and Excretion System Hyperactivity",
 "author": "yvette176",
 "citation": "   yvette176. \"Anxiety and Excretion System Hyperactivity: experience with MDMA (Ecstasy) (ID 23068)\". Erowid.org. Feb 16, 2006. erowid.org/exp/23068",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2001",
   "23068",
   "Female",
   " ",
   "Not Given",
   "Feb 16, 2006",
   "Views: 10326",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was given a 'mitsubishi'-looking pill by a friend of mine.  I took it at a well-known dance club in chicago on gay night.  I thought I would have a well-being feeling, would feel connected, and would have an experience similar to other first-timers that had a positive experience.  The crowd on gay night is very accepting (and, from what i've heard, very heavy X users), so I thought I'd be okay, surrounded by 'family'.</p><p>In fact, it was the opposite.  When it hit me, I immediately became anxious, like 'this is horrible - when does it end?'  my digestive system began functioning on what I can only call a 'hyperactive' state - I had to use the bathroom three times in one half-hour.  The toilets were so crowded I had to cut in line, apologizing, and then immediately go to the back of the line to use them again.  I was so tense I thought my brain was going to explode.  Worse yet, my car was in a parking lot that would close at 5am, and if I didn't get it out of the lot, it would get towed.  This meant that I had to drive.  I could have drove it about 100' to street parking:  even if it was an illegal spot, and I got ticketed, that was better than getting stopped while driving while toasted.</p><p>But because I was toasted, I didn't think correctly, and I decided to drive.  This was worse than any acid trip I ever took in the '60s. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I drove to a hotel not far away.  It was the worst drive of my life.  If a cop had stopped me, I would have been arrested.  For me, based on my sexual orientation and gender, that *could not* happen.  I didn't think about what to do with the car before taking the X - *Big Mistake*.  It was one of the most tense, anxious nights of my life.</p><p>At the hotel, within minutes *everyone* knew I was toasted.  My pupils must have been the size of dimes.  I went up to my room, went to bed, and just shook for hours.</p><p>Was it X?  Was it speed?  Was it cut with baby laxative?  What was it?  I don't know and I don't care.  *I will NEVER take it or anything purporting to be it again*.  Reality feels so good now, I hardly even drink, and take no 'recreational pharmaceutical' drugs whatsoever.</p><p>Some people say X is wonderful.  I say the whole thing sucked.  At the end of the day, it's your body, it's your brain, it's your life.  Caveat emptor.  Whatever you do, do NOT drive.  Please!</p>"
}
