{
 "title": "My Tale of Terror",
 "author": "NickS",
 "citation": "   NickS. \"My Tale of Terror: experience with Salvia divinorum (13x extract) (ID 23062)\". Erowid.org. Apr 5, 2007. erowid.org/exp/23062",
 "substance": "Salvia divinorum (13x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23062",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 5, 2007",
   "Views: 5307",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>About a month ago my herb supplier was spreading around some 13X potency Salvia extract. Everyone was raving about it so I thought I'd try it. Over the course of a few days I smoked it three times, each time taking two big bong hits and holding them as long as I could. The effect was like an extreme trip, like a combination of PCP, LSD, and nitrous. Nothing I couldn't handle or enjoy. One afternoon I went outside by myself, bad idea, at exactly one o clock and sat on a bench underneath a maple tree and went balls out. I took the first rip, held it, and exhaled. Then the second, held it, exhaled. As soon as the third toke reached my lungs I started coughing violently. I managed to set the bong down.</p><p>The next thing I remember was opening my eyes and instead of seeing my house and yard I was inside a giant fairy tale treehouse. I'm talking complete loss of reality. I was in this treehouse and some giant malevolent female presence was folding me up like a shirt and stuffing me in a dresser drawer. All the while I'm trying to scream but no sound was coming out or so I think. I'm trying to convince myself that it's just a drug and that it will wear off but this presence convinced me that she had transported me to her universe and that I would be there forever. Scary thought. So she stuffs me in this drawer and everything goes black. The air got hot and stuffy and I felt like I was suffocating which is strange because it was cold and breezy outside that day. Very physical trip as well. The sensation of being 'folded' was most unpleasant. I think I was leaning over the arm of the bench at this point though I don't know.</p><p>Anyways, after what seemed like an eternity of struggling I managed to jump out and scream 'NO!!!!' I shot to my feet like a rocket. The world around me melted into a flaxen puddle of color and I started running away screaming. All I could think of was escaping that house and that drawer. At this point I was running around psychotic till eventually I fell to the ground in the backyard. I lay there for what seemed like hours. I felt like I was lying vertically and as the time passed I slowly came to a horizontal base. I.E   I / -   if you get my drift.</p><p>At this point I was able to stand and take in my surroundings. The world was still FUCKED UP, undulating and spinning but I was able to get inside and go to my room to lay down. I looked at the clock. It said 1:30. All my previous experiences had lasted about ten minutes. This one lasted about twenty-five! Then I passed out till the next morning. I don't know how to truly convey the totality of the experience. It was complete visual, auditory, mental, and physical hallucinations. I've read about people having experiences like that with DMT but I never would have imagined Salvia could be that strong.</p><p>All in all it was a truly terrifying experience. I've never been so fucking scared. I was totally convinced that I was going to be stuck in that drawer for the rest of my life. I'm still rather unsettled by the whole experience. Salvia seems to be able to physically manifest latent psychological issues.  The only way I can relate the experience to my life is through my fear of being stuck where I am right now in life, which is not where I want to be. Being trapped in the drawer was like a metaphor for being trapped where I am right now. Then again I could have just been twisted but the experience seemed a little to profound to be the case.</p><p>Final analysis: In smaller doses Salvia can be an entertaining recreational psychadelic. However once you up the dose it can become an extremely power substance that I think could potentially permanently mindfuck someone who isn't prepared. I thought it was never going to stop. There doesn't seem to be much research on Salvia's actual effects on brain chemicals so I don't know if permanent psychosis is actually possible but be careful. DO NOT underestimate it just because it's legal. It's stronger than anything illegal I've ever done and I consider myself well versed in the ways of psychadelics.</p>"
}
