{
 "title": "Wanna Die For 5 Minutes",
 "author": "Notgonnagiveumyname",
 "citation": " Notgonnagiveumyname. \"Wanna Die For 5 Minutes: experience with Inhalants (ID 23070)\". Erowid.org. Apr 5, 2007. erowid.org/exp/23070",
 "substance": "Inhalants",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23070",
   "Male",
   "",
   "Not Given",
   "Apr 5, 2007",
   "24589",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I felt most reports on duster were fairly anecdotal. My experience varied alitle from the norm and I feel compelled to express the magnitude of the feelings as best I can.</p><p>Ahh computer duster. Is there a more vile inhalent out there? I am a 19 year old with a rather dedicated drug using hobbie. I ussually enjoy all types of drugs and have tried may. Apart from habitualy weed smoking,I've dipped into opiates maybe half a dozen times, tripped off of DXM for solid months, eaten large quantities of benadryl and delved into the world of trytamines (It-190 and LSA mostly with sporadic journies to the Shroom God and Acid Lady). I can basiccally hold my brain together more-or-less while high. When I saw you could get high off of computer duster I was instantly intrigued.</p><p>The taste was sweet, the lungs felt cool (temperaturewise) for a second and then numb. I held my breath for a good 10 seconds before the buzz from hell came on. Massive tinitus struck me as my thoughts increasingly braked to a holt. I exhaled 45 seconds later and my breath felt funny, almost like my lungs were a bottle of nail polish remover. The buzz just kept hitting harder until about a minute in, were things plateaued for a little bit.</p><p>The space I was trapped in went by like hours. I thouhgt I was DEAD. I felt like I was one with the universe, but in a bad way. Very Sinister. I was an insignifgant speck that was doomed to view the universe from afar for eons until everything implodes on itself, at which point there will be blackness, but still a concious mind. When I mentally hit the blackness I kept counting to 3 in beat with my tinitus and feeling doomed because the universal language of math was stunted at 3 and therefore reality was put into suspended animation.</p><p>I felt out of phase, almost like my soul was escaping, but the grip of life was too strong. After coming down all I thought about was how interestingly weird the whole thing was, so I thought another hit wouldn't hurt, another HUGE hit. HUGE mistake, back into the void I leaped. Scared and far from my home I vowed never to touch this gas again.</p><p>It made me sick afterwards and the symptoms after contemplation felt inseperable from nerve damage. I felt dazed like when you get punched in the head real hard, thats the best way I cuould explain head buzz during the come up and comedown. The plateau is being kocked uncouncious. Inhalents suck. The interesting thouhgt pattern and insights were abolished and forgotten by what I felt as an overall toxicity. I honestly felt DEAD. BEWARE!</p>"
}
