{
 "title": "Brought up Preverbal Childhood Memories",
 "author": "Rahasya",
 "citation": "   Rahasya. \"Brought up Preverbal Childhood Memories: experience with Salvia divinorum (ID 23108)\". Erowid.org. Feb 13, 2007. erowid.org/exp/23108",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23108",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2007",
   "Views: 8897",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday the 10X Salvia extract I had ordered came in the mail.  When my wife went out of the house, I took it into my study, closed the door, lit some incense, turned off the lights, and took out a big leaf and a small leaf.  I tore the big leaf in half.  I put a little pinch of extract on each of the leaves, crumpled them up, and thus prepared 3 bong hits.  I did two of them.  Everything I had tried before was nothing in comparison to this.</p><p>After the second hit, I very quickly became oblivious of who I was or what I was doing there.  I have a memory of everything turning to flames.  One flaming figure appearing before me was tall, narrow, rectangular, enlongated.  Apparently this was based on the shape of the bong.  It may have had a flaming face.  I felt the return of the ambience of the house where I lived as a very little boy.</p><p>I do not remember getting up, opening the door, and going up the basement stairs.  I have only a vague memory of emerging into the living room and seeing a couch there, and instinctually feeling it would be a good place to lie down.</p><p>As I lay on my back, I heard disjointed bits of TV dialogue from the other room; my daughter was watching Buffy.  I think Angel was looking for a demon or something, I don't know.  All I heard was stuff like 'I think he might be in there...' 'Watch out, that might be him...' Well, of course this became slightly paranoid in my imagination as though they were about to discover me there, and my family would find me out: Daddy's turned into a druggie, oh no!  I would be disgraced.  Then I became aware I wasn't down in my study any more, I was lying on the living room couch.  How the fuck did I get up here? </p><p>I went back to the stairs and sat down near the top of the staircase, putting my hands out to the walls on either side, and sat there for a minute.  In my feeling it became the staircase in the house I had lived in as a very young child.  I then had the presence of mind to go back to my study, locking the door this time, and sit down.  I bonged the third hit.</p><p>I instantly shot back to the world made of little colored flames, like an Impressionist painting.  In front of me, the lines of my bookcases and the edges of the walls curled up and in, starting to form the tunnel I had heard about in other people's Salvia reports.  I didn't go through it, as had been suggested.  I just sat there and by an effort of will as I was tripping I reminded myself that I was sitting in my study and had taken a powerful psychedelic.</p><p>I remembered how the Salvia had tricked me into going upstairs and started to laugh at myself, saying to it: Oh, you thought you were being pretty funny, huh? You sure made a fool of me, all right! Yeah, the joke's on me! You got me there! There was no reply.  A few minutes later I went upstairs and cooked dinner for my family.  That's how quickly I returned to normal.  But I retained the heightened sensibility to energy, thoughts, sensations, feelings, and metaphysical principles that one also gets from lysergic acid diethylamide.</p><p>In the last part of this trip, although I was forcing myself to laugh at the 'joke' the herb had played on me, I also felt an awful sense of terror at what had happened.  But there was something much deeper underlying all of this.</p><p>The only memory I could retrieve from the part at the beginning where I blacked out was this:</p><p>The sense of my father's presence from when I was a very little boy and he was a young man. The early 1960s, in that house we used to live in on East 187th Street.  The memory was entirely preverbal, so it must have been brought up direct from my infancy, from the time before I can recall any memory.  The herb awesomely reached in that deep and brought it up.  </p><p>The tenderness of my infantile feeling for my father's presence near me is indescribable in words.  I'm starting to cry now. I want to say to him, O Dad, how can I ever repay you for loving me and taking such good care of me when I was little? How can I ever express my love and gratitude? The feeling from the beginning of my life is overwhelming, and it was released by that herb.  </p><p>The other feeling that went along with it during the trip was that now I'm the daddy.  My Dad's fatherhood and mine united in a seamless continuity.  My own identity merged right into the vibe I had gotten from him.   I hugged my son and hoped he would have good memories of me as I did of my father.  </p><p>The incense I had been burning was of the very highest quality, very sweet and pure, in fact, it smelled so intensely sweet and good that it embarrassed me with its sensuousness.  The ambience of the room around me felt like that too.  When tripping on LSD also in the past I noticed this odd intensity of sensations from the environment that seemed to open up my deep inner soul feelings so nakedly it was embarrassing.</p>"
}
