{
 "title": "MDMA Induced Loss of Heroin Addiction",
 "author": "Ripped",
 "citation": "   Ripped. \"MDMA Induced Loss of Heroin Addiction: experience with Ecstasy (ID 2312)\". Erowid.org. Feb 14, 2001. erowid.org/exp/2312",
 "substance": "Ecstasy",
 "bodyweight": "83 kg",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1999",
   "2312",
   "Male",
   " ",
   "Not Given",
   "Feb 14, 2001",
   "Views: 11675",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\ni was addicted to smoking heroin for just under two years..,over this time my addiction had virtually destroyed my life..i was so sick all the time that i couldnt leave the house.. in that time i left 4 jobs, i eventually went bankrupt.. i decided to get off heroin (for about the tenth time).. i had been two wks without it and was still suffering withdrawal (pain,sweating,cold,headaches) i thought this pain would NEVER leave..i hated life in general, not any particular aspect of it.. i decided to try e after an old workmate had been bugging me for ages.. he said, ' come out and feel life'.. we went to a melbourne nightclub, i took 1 tab and the first feeling i got was a relaxed, alive, not nervous and happy feeling.. I felt i'd found the 'fountain of youth'.</p><p>This nightclub was abut 2/3 gay preference.. prior to this night you coulkdnt get me within 20ft of a gay person (whata homophobe eh?) well this night quashed all of that.. a gay bloke even felt me up whilst walking past..in the past it probably would have provoked anger/violence in me, instead i found myself making eye contact, not nasty or anything probably a surprised look he saw i wasn't interested and left me alone. I instantly saw my fear of gays was unjustified and changed my view completely.. i am not gay, but am not bothered by anyones sexuality anymore.. this was just the beginning of a full spiritual rebuilding..I can honestly say that e has done nothing but good for me and is here to stay for me...it is now over 12 mths since i was addicted to heroin and have no interest in it at all..</p>"
}
