{
 "title": "Denied in Jail",
 "author": "Ceg",
 "citation": "   Ceg. \"Denied in Jail: experience with Venlafaxine (Effexor) & Tramadol  (ID 23124)\". Erowid.org. Jun 22, 2007. erowid.org/exp/23124",
 "substance": "Venlafaxine (Effexor) & Tramadol ",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23124",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 22, 2007",
   "Views: 12158",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have consumed both Effexor and tramadol, and experienced moderate opioid like withdrawal from Effexor. I have talked to a few people who have had difficult experiences withdrawing from Effexor, after enduring quick tolerance, and side-effects that undermined the positive. Effexor does not need to be taken weeks before effects are felt, and one can take weekend breaks from dosage. This is one reason my doctor prescribed it to me, after I complained of sexual side effects from taking Prozac. Effexor has quick stimulating action which tapers off over 5-8 hours. I usually took two doses, 8am and 5pm. </p><p>I took Effexor for a few months. When I was subsequently incarcerated, the doctors within the jail system told me Effexor was too new for them to be stocked up on it and I was denied that and any other antidepressant. the withdrawal was similar to opioid withdrawal, with a definite ringing of the ears, extreme anxiety, and the strange effect of 'spatial disorientation', which feels like my body has tracers following it, when I move, a slight delay is felt, and then it feels as if I slide into the place occupied by my body. Very strange and annoying effect. </p><p>I have taken 100-500mgs of tramadol a day to ease withdrawal from oxycodone, and from methadone. In the case of oxycodone I was habituated to 100-120 milligrams a day. the tramadol eased withdrawal in the first few days significantly, and on the third day mild euphoria was experienced. Withdrawal from the tramadol over the next two weeks was comfortable when dropping dose 20-50mgs every three days. I have read of the mild antidepressant effects that tramadol can have, and consider low oral doses of opiates to have a positive effect on my mood.</p>"
}
