{
 "title": "Weed in the Bush",
 "author": "Steve",
 "citation": "   Steve. \"Weed in the Bush: experience with Cannabis (ID 2313)\". Erowid.org. Mar 5, 2001. erowid.org/exp/2313",
 "substance": "Cannabis",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "6 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1",
   "ID: 2313",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2001",
   "Views: 8021",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nToday I had the most powerful weed experience I have had in my life.</p><p>I have always liked the bushland park down the road from me, and I have a few juvenile plants growing in there as well.</p><p>First thing in the morning I woke up early to watch tv, because I had a big smoke last night and I was feeling dazed. So, after mum and dad left I grabbed my gear, which was:  pipe, weed, lighter, discman, seeds, and I brought some osmocote as well for the plants. I turned on my discman and walked down to the park.</p><p>When I got to the grow site, I quickly looked around for people and climbed up the rock where my plants are growing. I planted the seeds and sat down on a log where I then had around 4-5 hits  of this really strong weed and I waited. I felt nothing much for about 20 minutes and I was wondering if it was doing anything, so I had 2 more cones. After the second to last puff I coughed violently and my head spun. I then finished the last puff and put my stuff away.</p><p>After about half an hour of nausea, I laid in the thick grass and dozed off for what felt like hours. I remember seeing weird patterns and a vision that reminded me that I was falling down a tunnel. I came to it 10 minutes later and I was lying 5m away from where I first laid down. I noticed that I had tunnel vision and everything I saw was outlined in black and the sun seemed so bright that I found it uncomfortable to sit in its light, so I moved into the shade.</p><p>I was concentrating on some magpies that were collecting sticks for their nests. I remember hearing them repeat their calls and I was getting the impression that something sounded odd. Before I knew it, the sound dissipated into the sound of the river flowing and I then realized that the magpies weren't even there, that I was imagining it.</p><p>I just sat there eyes half closed and taking in the sounds of the bush. At 10 o'clock I decided to leave, but when I stood up I collapsed back down, so I tried again and jumped onto the foot path, which was a 3m drop underneath the overhang. On my way home I heard all of these cries for help and I kept getting the feeling that something was stalking me. I started running as if I was running for my life, which spooked me a lot and I raced up the hill where I could reach the entrance. I made it out and went home to find that mum was already at home, so I bypassed home and went to the soccer field where I had a few more puffs and then closed my eyes so I could concentrate on the patterns that I was seeing. From that I remember reflecting on what I had heard and saw, so I slipped out of the sleep after a while because I felt that someone was gonna steal my headphones and discman and I realized that I never had gone to the soccerfield - I had fallen asleep in the bush and I was only dreaming it. The dream was the most lifelike and realistic I have had. </p><p>Conclusion:  This was the strangest experience I have had with weed and I will ask my dealer what sort it was and if it was laced, which I think it was.</p><p>I can still feel the effects after 5 hours of sleeping in the loungeroom. I decided to write this while I had it fresh in my mind, but I am forgetting quickly. I am about to finish the rest of it now.</p>"
}
