{
 "title": "Don't Mix",
 "author": "Dk_trippy",
 "citation": "   Dk_trippy. \"Don't Mix: experience with MDMA (Ecstasy) & Amphetamines (ID 23144)\". Erowid.org. Feb 13, 2007. erowid.org/exp/23144",
 "substance": "MDMA (Ecstasy) & Amphetamines",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "40 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23144",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2007",
   "Views: 16041",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my one and only experience with Ecstacy.  Me and C got a call from our friends D and J asking if we wanted to roll with them.  We had never tried it before so we thought it would be worth a try.  J who isn't perscribed Adderall, ate a pill given to him by a friend about an hour before the ecstacy.  We got back to C's house after aquiring the drugs and ate them at 10 p.m. with some orange juice.  We started rolling about thirty minutes later and put on some Bone Thug's n' Harmony and played with glow sticks and J and D who had both rolled a few times before, showed us some other fun stuff like E hugs and vapor rub.</p><p>We then sat down and listened to J talk philisophically about illuminati and his theorys about the world.  We all we feeling pretty good.  J was wearing alot of clothes, two pairs of sweats, two t-shits, a sweatshirt, and a jacket, and we didn't notice till later he hadn't had much water.  J put on some house music and started dancing hard for about thirty minutes staight, while we watched since me and C weren't really dancing fools like J and D.</p><p>After he was done he sat down on the bed sweating hard still wearing a ton of clothes.  He started fanning himself and I remeber him saying 'Damn son, I'm rolling hard as a bitch.'  A few minutes later I looked over and he seemed to be pressed against the wall then I noticed his eyes were rolled back in his head.  He then went into violent convulsions.</p><p>D started asking him frantically what was wrong and was yelling his name and then he fainted from the shock of seeing his friend in a seizure.  I was a lifeguard for a while and had seen people in seizures before and knew what to do.  After he finished seizing we pulled him into the bathroom put a pillow under his head and stripped him to his boxers.  We placed his hand in ice water and and put a cold pack in a cloth on his head and cold cloths over his legs and kept his chest wet while D fanned him with a pillow.</p><p>His pulse would go from near 200 bpm down to almost nothing and back up again.  He seized in the bathroom two more times. After about an hour and a half he started to come in and out of consiousness and his pulse became more even and slower, when he did we gave him sips of water.  He vomited once while he was unconcious and we turned him over so to get it out.  This is important, if someone is unconcious from drugs lay them on their stomach or if you see them vomiting or gargling turn there head to the side so they do not drown.</p><p>When he finally came too he was bleeding from the ears and began vomitting in the toilet.  He then became very cold so we put him in bed made him comfortable and kept him awake for about two more hours till he and D left to go home.  This was probobly the scariest experience of my life.  I believe the siezure was result of MDMA which already contains methamphetamine and the Adderall which is amphetamine along with the tons of clothes and lack of fluids.</p>"
}
