{
 "title": "What was I Doing?",
 "author": "User Friendly",
 "citation": "   User Friendly. \"What was I Doing?: experience with DMT (ID 23164)\". Erowid.org. Mar 11, 2008. erowid.org/exp/23164",
 "substance": "DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23164",
   "Male",
   " ",
   "Not Given",
   "Mar 11, 2008",
   "Views: 3289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Since first learning of DMT about 3 years ago, Ihave heard no mention of it in physical form. Luckily a friend came home for easter break with a couple grams of synthetic DMT. At first I didn't believe it was real, but I obtained 3 doses for $15. He said </p><p>the doses, wrapped in paper, were roughly 20 to 30 milligrams. Later that night a friend and I decided it was time to dose. I was giddy to say the least. We split the three doses to ensure we had a threshold experience, as this could be the last </p><p>time we saw the substance. We had smoked very good marijuana roughly 2 hours prior. </p><p>Experience:</p><p>*NOTE*</p><p>The mg amounts I indicate are in no way verified by weighing. They were supposedly weighed prior on a .001 gram scale, but I can not verify this. If the powder</p><p>of one dose were spread thin on a table it would cover an area roughly half the size of a dime (currency). The doses were slightly of different size as well, which contributed to the decision to combine and then split them. </p><p>Setting was the basement of my house, Me and a friend, my brother and his 2 friends. Half the DMT (1.5 doses roughly 30-40mg)was placed in a spoon fashioned out of tin foil. A lighter was held directly beneath the tin foil as the DMT powder liquified and smoke began to rise from the spoon. Using a hollow pen, my friend began to inhale the </p><p>smoke, as some escaped around the pen. After all was vaporized, he leaned back and blinked, exhaling with a slight cough. I asked him how he felt and he could only blink again and lean back. I asked him to close his eyes, which he did, but could not communicate after this. </p><p>I then placed my powder into the spoon (1.5 doses roughly 30-40mg) and had my brother hold it and apply the lighter in the same manner. I inhaled every bit of the smoke and the entire amount of DMT was vaporized. I leaned back and removed the pen from my mouth, exhaling the smoke (which I did not find that harsh) as   turned to my right to look at my friend, my vision went completely white from the center out. I remember seeing the bowl and it seemed as though the whiteness expanded from the bowl. Interstingly enough, there was no bowl, as we used a spoon, so I'm not sure if I misinterpreted the spoon or just hallucinated. </p><p>The next thing I can remember was just sitting on the couch holding my head, and an INTENSE feeling in my head. It was like my thougts were accelerating out of control, faster and faster like a turbine engine. Faster and faster until I could not believe the intensity I was feeling. Continuing to grow in speed and intensity, I couldn't speak or reason with the outside world. I knew that I had done it. Done what? I remembered that I had done IT, I had made some kind of initiation of my circumstances, but I couldn't put my finger on what I had done.I had a feeling that it was something great, and that I had done something extreme - I had feelings that I had been somewhere new, or that I'd done or been somewhere unexplored. I was so in awe that I was not grasping anything around me. This feeling slowly dissipated and I realized I was sitting in my basement. I muttered 'Man, I've been fucked up for like 45 minutes' and my brother said 'It's only been 10 minutes.'</p><p>My friend was still sitting back not speaking. I was sitting up, then back, running my hands through my hair still in complete and udder shock and amazement at what I had experienced. It was then that my brother and his friends told me that as soon as I had toked the hit and turned to my right, I closed my eyes, grabbed my head and began rocking back and forth. Then I began making motions with my arms that I can only explain by their mimicking, which resembled someone sitting, and trying to swim</p><p>with their arms. They told me I began to drool, and murmur incoherently very loud. So loud they came inside and had to turn the television upstairs on as not to wake anyone. I doubted them as I had no recollection, but a towel lay at my feet and the television was on upstairs where it had not been prior. </p><p>I think I may have smoked too much for a first trip. I experienced no visual sturbances I can recall, unless you consider my mistaking the spoon for a bowl to be a visual disturbance. And no buzzing noise. As I 'took off' I 'blacked out'. And 'came to' when I think I was coming out of it. I was still intensely inebriated and I'm unaware of any other substance this could possibly be. The entire time I felt as though it could not possibly get more intense, as it continued. I never felt overwhelmed and the entire experience was rather friendly. As I came to, I was  also aware of an extremely pleasant body high. My friend reported a visual field of waves extending outward from </p><p>his head as he exhaled. He could recognize faces, or shapes of people, but not distinctions or details. He thought that he was making noises and being incoherent the entire time, which he wasn't. I attribute this to MY reaction during his trip. He had no reactions as I did, and was merely silent and sitting up an back, running his hands through his hair. </p><p>Time is of no measurable context so I can only say that I was down after roughly 30-45 minutes. It felt like I was gone for hours. Residual effects lingered, but none were prevalent for about a day afterwards. The kids I was with had never seen anyone do that much or react like I did, and they almost called an ambulance. The entire after experience, immediately as I regained the ability to reason and speak, I spent saying how incredible it was. They told me that they usually snort the DMT. I will try and get more, as I feel cheated of the DMT experience I was aiming for. The feeling I had is still mind boggling, but I had no hallucinations,  no hyper space, and mostly I feel as though I can not remember the peak of the experience. Either now or right after doing it. </p><p>I did not feel comfortable with the reaction I was told that I had to this substance, but I do not think it was abnormal or harmful.</p><p>Did I do too much? Was the marijuana a factor? Did I have some kind of adverse reaction? I'm not too sure. I was under the impression that a high dose would indicate an extreme experience, but the dose I smoked wasn't extreme, however not minimal. I'm considering snorting an amount and evaluating. If this goes well I will smoke another dose, at lower amounts. </p><p>This was probably the most intense feeling I have ever had, and at the same time it was welcome and extremely pleasurable. In the future I will do this with one person to spot me, in dim light with minimal or no music/television, on a completely clear head and during the day when I am not possibly fatigued.</p>"
}
