{
 "title": "In The Woods: An Amazing Experience",
 "author": "JM",
 "citation": "   JM. \"In The Woods: An Amazing Experience: experience with Mushrooms & Cannabis (ID 23189)\". Erowid.org. Feb 10, 2006. erowid.org/exp/23189",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:00",
   "3 hits",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23189",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 10, 2006",
   "Views: 3589",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>(Introduction)</p><p>I decided to trip on mushrooms in the woods, in area filled with old disused military training tunnels, which is absolutely the coolest place in the world.  Much of it is covered in interesting graffiti, which figured into my trip.  I tripped with two other friends, all of whom took 3.5 grams, and a bunch of other friends who did not trip (though some smoked cannabis with us).  Before this the only hallucinogen I had tried was AMT, and I disliked it to some degree, so I began to search for illegal hallucinogens (that hopefully wouldn't last 24 hours and that didn't have disgustingly strong amphetamine qualities).  The mushrooms were INFINITELY better than AMT!  And now, the report:</p><p>12:00 - Meet up with A1, V, A2, C, S, P, and J. (Not their real names, obviously!)</p><p>Around 12:20 - Arrive at the wooded area past the college dorms, around the water tank.  S, C and I each eat 3.5 grams of shrooms.  (Probably closer to 3 grams for C because he gave one of his stems to J).  At first they taste fine, like crunchy peanuts, but after a while of chewing they start to taste bitter and disgusting (but manageable) and I swallow them with water.  I had eaten nothing in about 20 hours.</p><p>Around 1:20 - We reach the wall before the first tunnel.  I am starting to feel the physical effects of the mushrooms, and I'm feeling good.  It seems a bit harder than normal to carry on a conversation, and walking along the path I remember thinking that I'm 'moving too fast'.  A1, P, and A2 go to explore the tunnels, the rest of us stop to smoke some pot.  As soon as I take my first hit, the patterns begin.  I see patterns everywhere, in the leaves, in the surface of a paintball that C found, on people clothes and faces.  EVERYWHERE.  Anything I look at forms itself into a kaleidoscope-like pattern, with lots or detail and intricate Indian-looking designs.  I look at the leaves, and they form into an endless pattern of interlocking lizards that looked just like the ones from the MC Escher drawings. I end up taking about 3 hits, which is plenty for me.  I remember handing the pipe to V for her to take a hit, then having the pipe magically appear in my hand what seemed like a few seconds later and handing it to V to take her hit, only to be told that V had just taken a hit (don't you remember?) and that it was my turn.  From this point on I had no sense of time, and the order in which events occurred did not make sense and did not matter.</p><p>Body high</p><p>Amazing.  Running my hand through my hair felt like sticking my hand into a vat of jello, I couldn't tell where my hair ended and my face began.  Applying pressure to any part of my body made it feel as is that pressure were spreading out, outwards towards the surrounding area.  All tactile input mixed together.  Cracking my knuckles felt SO WEIRD, and I had to stop doing it.  I felt what can only be described as 'the physical equivalent of echo', and had VERY STRONG feelings of being pushed and pulled in different directions and of my center of gravity being in abnormal places.  I had intense synthaesia, and could not tell the difference between a bug buzzing near me and crashing into my head, they were the same partially audial partially physical sensation.</p><p>Visuals</p><p>All patterns and groups of smaller objects/dots/lines contained smaller sets of kaleidoscopic patterns.  Kaleidoscopic, intricate patterns were everywhere.  A pile of pebbles was still a pile of pebbles, but it was a pile of pebbles that formed an intricate kaleidoscopic or Escher-like pattern.  When I stared at my fingers for a shot time, they puffed up like marshmallows to the size of large sausages.  When I looked at a wall with a piece of graffiti on it, that graffiti would appear to be multiplied and cover the whole wall, moving around.  A great deal of my hallucinations centered around a piece of graffiti which may or may not have existed in real life which I saw everywhere, on every surface.  Everything looked perfect, fake, like a movie.  When we entered the tunnels to get over to the building beyond, and my perspective was immediately altered drastically.  When I looked down towards the direction we were headed in, the tunnels appeared very, very narrow and seemed to go on forever, but when I turned around and looked back toward the entrance, it appeared to be huge, maybe 30 feet across, and A1, who was a few feet behind me, seemed to be very far away.  </p><p>I had a great deal of difficulty walking in the tunnel, and kept tripping on and running into things that I couldn't see.  I had to hold the wall the entire walk through to avoid falling over.  The walk through the tunnel was INSANE, as I seemed to be walking at a hundred miles per hour, the tunnel looked endless, and the walls kept moving in and out and sliding.  I remember saying quietly 'I'm on a roller coaster!' because that's what the walk felt like.  As I walked through these tunnels full of graffiti the walls became endless moving murals that looked like movie screens.  As I go on and more and more of the wall is revealed in dark, more and more of this huge, writhing, hallucinogenic 'mural' that covers it is revealed as well.  I'm feeling fantastic, and really excited.  There's a grin plastered to my face, and I keep laughing and giggling at nothing, to myself, because I can't stop myself.  A great deal of my hallucinations wherever I went centered around one piece of graffiti that I saw at the beginning of the trip which may or may not exist in real life.  It was a circular design containing an 'Illuminati pyramid' with an eye in it (like on the back of a dollar bill), a star and moon, and a broken-up skull.  These were surrounded by a circular arrangement of blocks containing text which I couldn't read.  This appeared in every surface and type of ground I encountered.  </p><p>I remember saying to A1 'Did the Illuminati paint all of these??' at one point, and being rewarded with a very, very confused look and a 'uh... maybe...'.  As we explored the forest, I felt like it was an insanely intense, fast adventure, and I was loving every minute of it.  The whole forest blended together organically, I couldn't tell one part from the other.  It all seemed like a crazy wonderland of jungle, and I enjoyed being led around it by my (somewhat) sober 'guides'.  The whole trip is a series of disjointed experiences that don't seem to follow any logical order at all.  I had a strange sensation of my vision being... choppy, in a way.  I remember looking back and forth for a long time right after I finished smoking, seeing the two different sides of the woods that I could see when I turned 180 degree left or right, and thinking that they were two different world, completely detached from one another.  I had a similar experience when walking down a passage filled with prickly bushes towards another tunnel we wanted to explore, and having the branches seem to attack me, but I was completely unfazed by them. I didn't even feel them prick my legs (which they did, a lot).  Looking back at A2, who was leading me there, was completely different than looking forward toward the tunnel entrance.</p><p>Audial Effects</p><p>I had almost constant audial hallucinations for most of the trip.  I had an MP3 player with me, and so did Sam, and I had my headphones around my neck for the whole trip, but only turned it on for about 10 minutes.  We were standing in the area above the first 'tunnel house' when I heard some strange music coming out of my headphones, but couldn't tell if it was real.  I handed the headphones to A1 and asked him if there was music coming out of them.  After listening for a moment, he responded 'yes'.  I went back to listening.  A few minutes later, I decided to find out what this interesting track was named, and fished out my MP3 player to see.  It was, of course, turned off, and had been the entire time.  I yelled 'Damn you A1!' while he laughed.  I continued to hear music for much of the trip.  The one audial hallucination that lasted for basically the entire trip and was very cool/strange was of two voices, one in each ear.  One kept saying what sounded like 'a-winkster a-winkster a-winkster' while the other sounded like 'sturbings sturbings sturbings'.  The first voice gradually went up in pitch, the second down.  All sounds that I hear for a while were translated into terms of these sounds, the sound of someone stepping on some leaves was just one version of 'a-winkster a-winkster a-winkster' and 'sturbings sturbings sturbings', the sound of someone's voice another interpretation of these.  </p><p>I distinctly remember that these two sounds were battling, and that each represented a different 'side' of the world, yin and yang, good and evil, and that they were present in everything and always battling... yet I don't think that I ever decided which was 'good'.  They both seemed neutral, I couldn't tell which was positive and which was negative, but I knew that there was a difference.  I also heard a constant ringing noise in the background that grew and diminished in loudness whenever I heard these voices.  As we walked along the top of one of the tunnels, P said something like 'stop' or 'theyre here' in a nonchalant way, and I 'knew' at once that he had seen the police, that they were there, poised and waiting for us to come out.  I heard one say through a megaphone 'come out with your hands up!' but I was unconcerned.  Of course, none of this other than the first thing P said had happened.  The voices of the police and their presence at all were a strange delusion my mind had come up with.  Later on, we found a skeleton.  We went closer to examine it, and for a moment I though that it might be a human skeleton, but it turned out to be the remains of some unknown animal.  I stared at it for a while, never afraid, just interested, and after a few seconds I noticed that it was crawling with maggots and ants, and pointed it out, slightly disgusted but not really affected, the euphoria wouldn't allow me to be upset. </p><p>However, as other quickly pointed out, these maggots and ants were not real.  I had hallucinated them, and they soon disappeared.</p><p>Delusions</p><p>Throughout the trip I kept coming up with bizarre 'beliefs' and delusions.  The first was when we stood in front of a graffiti-covered wall, and I KNEW that this wall was the place for an album cover photo to be taken.  I believed, for some time, that we were a band and that the album cover picture was being taken right now.  I lined up against the wall expecting the photo to be taken any moment.  While on top of the same building where this wall was, I had the very strong sense that we were all 60's hippy college kids out on a trip in the woods, talking and laughing in a circle, and the graffitied wall seemed like an echo of the psychedelic painting of Ken Kesey's Furthur bus or some other psychedelic 60's art.  When we split into two groups, one composed of A2, P, and myself who went on to explore more tunnels and the other composed of V, J, Cory, Sam, and A1, and when we did this I distinctly saw P and A2 as camp councilors herding us around like little kids.  P's white shirt was his camp counselor uniform, I 'realized'.  </p><p>I also saw each sober person (not those on any drugs, for some reason) as having a certain 'persona'.  A1 was a knight or some kind of noble lion, and also somewhat saintly, and P was like the 'mercenary' type of character from a fantasy novel or movie.  He was the kind of character who is very competent, and meets up with the group of adventurers and helps them out, but never seems to trust any of them and could leave at any time.  I saw and analyzed social interactions in an entirely different, very strange way.</p><p>Afterwards, I was very laid back and reflective, and still very, very happy.  Overall, I found the trip to be one of the most amazing experiences of my life.  It was incredibly </p><p>intense, but always in a very fun, eye-opening way.  A bad trip would have been impossible.  I will definitely be getting more of these as soon as possible!</p>"
}
