{
 "title": "Never in Public Again!!!",
 "author": "Half-Fast Ed",
 "citation": "   Half-Fast Ed. \"Never in Public Again!!!: experience with Salvia divinorum (13x extract) (ID 23194)\". Erowid.org. Feb 16, 2006. erowid.org/exp/23194",
 "substance": "Salvia divinorum (13x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol",
   " ",
   " ",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23194",
   "Male",
   " ",
   "Not Given",
   "Feb 16, 2006",
   "32235",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I have experienced the majority of household name drugs like coke, weed, acid, mushrooms, speed, pcp, microdots, mescaline, qualuudes, and ecstasy. I am 57 years old and was a protestor (and local subversive magazine editor) during the Vietnam War.</p><p>To the point. I was at the local pub when one of my friends handed me a dime sack as a birthday gift (not weed). He told me to take it home and enjoy it in a safe place. It was 'Salvia Divinorum', I was told, a rare mexican hallucinogenic plant. It was blessed with a 13x extraction for my pleasure (I feel honored).</p><p>After a few slew of drinks I decided to get a cab ride, as to avoid another DUI. While riding home I pulled out the little birthday baggie. I was really drunk and must have confused it for weed. The cab driver wanted to share a a few hits. As he drove, we kept smoking until the bowl was cashed. We both agreed this was bullshit weed. Next thing I remember was laughing hysterically with 'Mark' the cabdriver when a loud thud and glass shattering made us laugh harder. I cannot remember much of what was said but, we both got out of the cab alright. I could not stop laughing. It must've been only 3 minutes. I held onto the roof of the car to get a sense of balance, I fell on my ass getting out! As the laughter faded I realized I was screaming at the top of my lungs 'I'm waiting for someone to take the pipe!' I must've been shouting for a while because my throat was sore. </p><p>Now I realized it only could've been 8 minutes since I became coherent again. But the cab crashed into an abandonded house. People were already surrounding the scene in curiosity. Two hands grabbed my arm and yanked me away from the cab. It was 'Mark' the cab driver. He told me the rest of the trip home was free if I never told anyone. I never saw Mark again. But that Salvia scared the living shit out of me. It resembled PCP a little bit. I think I'll stick to my two favorites---Coke and Weed.</p>"
}
