{
 "title": "Artificial Confusion",
 "author": "xyclo",
 "citation": "   xyclo. \"Artificial Confusion: experience with 5-MeO-DMT (ID 23191)\". Erowid.org. Nov 25, 2003. erowid.org/exp/23191",
 "substance": "5-MeO-DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23191",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 25, 2003",
   "Views: 14305",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI purchased about 100mg of 99+% pure 5-MeO-DMT from the internet. Having tried home-extracted DMT (a very spiritual experience) in the past I heard they would have similar effects and was very excited. At first I tried lining the base of a cheap cannabis pipe with aluminum foil, placing in about 5mg, and holding the flame above it, but I couldn't get the smoke into my lungs, so I removed the foil and tried again. I managed to liquefy the powder, but it seemed to run up the sides of the pipe (heat-resistant?), so I ended up with a lungful of marijuana resin smoke.<br>Later I tried heating it in a test-tube (smoke stayed at the bottom and was impossible to suck out).<br>I finally got my first effects with about 10mg in a metal spoon. I heated it and managed to vaporize it but didn't suck in the smoke until it was too late. I felt some threshold 'weirdness' effects but had absolutely no visuals and felt like puking. I tried 2 more times with varying amounts and the metal spoon method before I gave up and was left with about 30mg or so of powder.<br>I decided to give up on the smoking method. I insufflated about 10mg of the powder. I had minor nasal burn but not nearly as bad as I expected. It came on to me very slowly, yet quickly... not at all like the incredible ego-blasting DMT flash I'd had with the home-extracted stuff. I felt sick and weird for a while. I had trouble walking but the mere fact I *could* walk shows the weakness of the 'trip.' There was minor distortion, but NO 'visuals,' 'trails,' or patterns.<br>Overall: Not an experience that was bad, but definitely not worth repeating. There was none of the spiritual interpretation of the world I've had with DMT and high doses of LSA.\n\n\n"
}
