{
 "title": "Total Blackout",
 "author": "Seraphim",
 "citation": "   Seraphim. \"Total Blackout: experience with Cannabis (ID 23223)\". Erowid.org. Oct 3, 2007. erowid.org/exp/23223",
 "substance": "Cannabis",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "23223",
   "Male",
   " ",
   "Not Given",
   "Oct 3, 2007",
   "Views: 4653",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok, let me begin this by stating that I consider myself to be fairly well educated and experianced in the underground world of illegal drugs and substances. I haved tried many different kinds of drugs in my late teens which include weed, shrooms, acid, crank, crystal meth, cocaine, extasy, special k, opium, dxm (triple c), and various other drugs that I cannot recall at the moment, an unwanted side effect of such drug usage one would assume. I have tried all of these drugs at LEAST twice, some more often than others. I view myself as a veteran of sorts when it comes to weed. I've smoked many different types of bud before so I can safely say that smoking weed for me is about the same as smoking a ciggarette, just with a bigger and better high or buzz if you will. Ok so anyways enough about me, on to the story.</p><p>I belive it was around one year ago when this all happened, by then I had been smoking weed everyday for a few years. No problems with the drug at all, no paranoia or panic attacks and whatnot. So this day started out as any other, although I didn't have the urge to eat anything, just drank some coke and ate a few chips all day. So 10 pm rolls around and my friend who lives down the street from me calls me up and invites me to go over his house to smoke a blunt with him and a few of his friends. Not being one to pass up a free smoke I gladly jumped at the chance even though I was feeling quite hungry at the time. A few minutes passed and soon I was in my friends garage making small talk with everyone there. A few more minutes went by as my friend broke up the weed and rolled the blunt. When he finished we sparked it up and began the rotation. Everything was completly normal as I felt very comfortable in my surroundings. The usual feelings of being high slowly began to occur, and the usual 'cotton mouth' followed soon after. It took around 15 to 20 minutes to finish the blunt off and I was feeling very relaxed and pretty stoned. All seemed well, yet I tended to notice that my stomach would not stop growling. I just shruged it off and figured I would have something to eat when I got home.</p><p>We stood around talking in his garage after we were done smoking for around 8 to 15 minutes when I began to feel a slight headache creeping up on me. Thinking it was just a migrane I paid no attention to it, untill I began to feel VERY light headed. I tried to suck it up but it soon began to become very disorenting and I started to hear a high pitched ringing in my ears at a very low volume. At this point I began to take notice of what was happening to me and realized that it was best if I just went back home and layed down for a while. Trying to keep face with my friends I said I was going to go home and get something to eat and maybe go to sleep which was partailly true. I said my goodbyes to everyone and thanked them for the smoke out and began my walk home.</p><p>I had not walked more than 6 meters away when the light headedness began to intensify rapidly, it seemed as though me walking had somehow been to much for me at my present state, yet, I continued to walk down the sidewalk thinking I could beat whatever it was that was happening to me. I walked a few more meters and the ringing in my ears became much louder than when I had heard it before and actually began to drown out every other sound that was going on around me untill just a very loud and high pitched ringing was the only sound in my head. At the very same time the ringing grew, my vision seemed to become affected as well. My vision was slowly fading away as I began to see the sidewalk as though I was looking through a tunnel, a sort of a concave view that was slowly being overwhelmed by the darkness that seemed to come from all around me. Keep in mind that the whole time this was happening only a few seconds had gone by and I was still thinking I could make it down the street to my house which lay in my line of sight. Big mistake. My legs began to become very heavy to where I was stumbling untill the ringing in my ears and my tunnel vision had increased to where all I could see was black, even though my eyes were wide open, and all I could hear was this LOUD ringing. </p><p>I then lost all balance and began to stumble rapidly to the side. Trying as best I could to regain my balance, but to no avial as just then I slammed into the trunk of a car that was parked in a neighboors driveway. Completely dissorented, I then stumbled immediatly the opposite way and fell yet again. But this time I hit the concrete sidewalk but was fortunatly able to break most of my fall on my arm which left quite a scratch on it. I tried to get back on my feet as soon as I could just in case someone who had seen me fall not think anything of it than me just having triped on something. I stood up only to have a small tree branch wack me right in my face. Oddly, after the branch hit me, my vision improved slightly to where I could see right in front of me and I yet again continued to walk home.</p><p>I got about 3 meters when I began to lose sight again and the ringing was getting louder. Finally realizing that I might not be able to make to to my porch in time before I fell yet again, I stopped and sat down on the curb 3 houses down from mine. I could feel my heart pumping at a very fast rate and I was sweating profusely. My breathing became very erattic and I was becoming very scared as I had no idea what was happening to me. I tried as best I could to take long deep breaths and tried to calm myself down in hopes I would feel better. It seemed like I was sitting there for 45 minutes when it could only have been around 15. Luckily, it seemed to work as the ringing subsided and the tunnel vision seemed to get better. Feeling slightly better I decided to go for it and walk to my porch and lay down on a bench. I got like maybe halfway and I could feel it all coming back, I kept going none the less determined to make it to the bench. Thankfully I made it before it got so bad as to where I couldn't walk, but just barely. I slumped on my bench and closed my eyes and continued my breathing technique which worked yet again after a few minutes. I then proceded inside where I quickly had something to eat and relaxed on my bed till all the symptoms faded away.</p><p>What happened to me that night I am still not sure of. I have smoked much more weed than one blunt at one time and never had I had anything remotely simmilar happen to me other than just the normal 'high' feeling. I know for a fact that the blunt we smoked wasn't laced with anything at all. The only thing that I can figure is that my body was just completly exhausted due to me not eating anything all day and then going and putting weed smoke in my lungs was all that it could take. It was a very scary experiance but I learned a good lesson from it and I continue to smoke weed everyday with much enjoyment and not with one bad experiance say for this one.</p>"
}
