{
 "title": "Analgesia?",
 "author": "Snail",
 "citation": "   Snail. \"Analgesia?: experience with Zolpidem (ID 23272)\". Erowid.org. Sep 19, 2005. erowid.org/exp/23272",
 "substance": "Zolpidem",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23272",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 19, 2005",
   "Views: 15000",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm an 18 year-old male student with experience with a relatively large variety of substances. I have a very painful back problem due to degenerative disks in my spine, and I've been taking hydrocodone, as well as a number of anti-inflammatories, muscle relaxants, and supplements to try to deal with this problem. One of the issues that this pain causes is insomnia. I simply will not lie in bed comfortably for a long enough time to fall asleep. Anyway, to combat the insomnia, which will cycle back into more pain, I was prescribed Ambien. From the start, I found it to be very helpful in putting me to sleep. I've recently developed more and more troubles with it, as I've developed a tolerance to the sleep-producing effects with no parallel tolerance in the effects of amnesia and intoxication. However, I do get a very interesting reaction to it that I'm not sure has been discussed much: analgesia.\r\nPut simply, my pain goes away almost immediately when the drug starts to take effect. Any headache, backache, muscle tension, or stiffness is eradicated. I am suddenly able to sit in bizarre positions with little or no  difficulty. Pain just disappears. Along with pain, I lose sensations such as taste and smell. If I'm on Ambien and I decide to chew another one to put me to sleep, it no longer tastes bad to me. In fact, I don't even notice it. If I've got a stomachache, that disappears, too. I'll find myself eating piece after piece of strawberry rhubarb pie, completely discomfort-free. Normally, my tummy is very sensitive. Also, I should mention that this effect was prominent regardless of whether I had taken any othe pain medication, such as my Lortab (hydrocodone) prescription. In fact, sometimes I would skip the Lortab completely in favor of taking the Ambien and eventually making my way to bed. At lower doses that would normally never put me to sleep, such as 10 mg (because I've gotten quite a tolerance to it, as I mentioned above), I still become much more comfortable. \r\nI would say that the painkilling effect of Ambien is much stronger than that of any opioid I've taken. However, the feeling of the pain relief is very different. With Ambien, the pain is gone. It's just no longer there. It's like a whole-body lidocaine injection. With opioids, I still feel the pain, but it's no longer something that threatens me. It just isn't a bother anymore. It's quite puzzling that this stuff seems to beat methadone hands-down in the category of pain-relief, and I'm curious as to if this is something that's been discussed or studied anywhere else.\n\n\n"
}
