{
 "title": "Induced Paranoid Psychosis/Schizophrenia",
 "author": "zarr",
 "citation": "   zarr. \"Induced Paranoid Psychosis/Schizophrenia: experience with Cannabis (ID 23274)\". Erowid.org. Feb 10, 2006. erowid.org/exp/23274",
 "substance": "Cannabis",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Alcohol - Hard",
   " ",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 23274",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2006",
   "Views: 5339",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had 5-6 cannabis induced psychotic episodes in the past, the last one 6 months ago. You probably will think that because I have had that many bad experiences with weed that they cant be that bad. But I believe I may have had a glimpse of hell. I have been on a personal quest for sometime now to find out why I get this 'key into the dark reality' and none of my friends do. I have always wondered if maybe all the answers to every question I ever wanted to know would come to me when I visit this reality, and thats why I keep on falling into the trap. There was something there that I couldn't remember, it was evil, horrible, terrifying but maybe I had to find it again and get the answers. What if the fate of the world depended on it? </p><p>Each time I smoke weed the effects get worse, the last time I was fucked up for 3 months and then 3 months after that I was depressed, sometimes paranoid, and an alcoholic. My mind struggles to remember what the other times were like, because it is so painful to bring up those memories and if I think about it too in depth and remember the way I would think I would bring on the effects soon enough. I will tell you what I can about the last experience, 6 months ago.</p><p>I went to the doctor and was given some fluoxetine (prozac) for depression.  I have been depressed since I was 14, but only now have I finally got the brains to admit that I need medication.  I convinced myself that there was a good chance the prozac would block out the psychosis and I would finally feel the awesome high my friends have been feeling all these years (my friends are constant stoners, it sucks). My theory was that if I started off in a good mood then the weed would act on that, I theorized that it must of been enhancing the depressive chemicals in my mind that were always present, only I must not of been aware of it as I am quite used to the low, pit-of-the-stomach feeling of depression. </p><p>I knocked back two cans of bourbon and cola and danced around to my favourite music and breathed in air like it was making me high. I remembered some old jokes I had laughed at with my friends and I ended up being super happy, mildly drunk and relaxed. It was then that an idea came to me, I would record this experience on video camera so I can see what I am like and in case I flipped out, I wanted to be able to look back on it and get an outside perspective. (This kind of takes on a story form from now on, but it's as good as I can remember)</p><p>'I am making this tape to show what happens when I smoke weed. I am going to smoke this joint and if it turns out to be a nightmare then I dont want to forget how bad it can get. Here goes..........' I took a hesitant puff, followed by a big drag.  Immediately my body felt a bit detached and heavy, my thoughts slowed down into seperate internal narrations conflicting with each other and I sat down and drooled onto my lap. I thought that if this was normal then I should be laughing at myself drooling on my lap, so I did, then I heard my laughter and it sounded demonic, I felt the presence of someone or something had taken over me, and it was joined by someone else who was telling me what happened, where I was, who I am, where I lived, what I was doing and why and that it was going to be okay. </p><p>I rationalised that these were my own thoughts (I couldn't actually hear the voices, they were inside my head) but they began to multiply. Soon there was about 10 different parts of my mind taking their turn at saying something and all disagreeing with each other. Some took sides and I began to count and number them, whoever I was, (which one was doing the counting? Why am I counting?) I had the camera in my hand and I pointed it at me, I saw my face in the monitor and stared at it for god knows how long. It was a face of terror, it wasn't me at all. I know this person, am I this person? Whats her name? Convinced that the evil part of me was documenting my peril and eventual death, I frantically tried to erase the tape, I couldn't stand the thought of my family seeing this. </p><p>I decided that this was not normal and that I had to jumble about my brain particles into order. I forcibly laughed as I was walking up the stairs in some kind of effort to trick myself that I was really okay, but a part of me was also laughing at my terrible mistake. I couldn't walk up the stairs properly. I said this aloud. The words came out slurred, I knew that I had made a horrible, horrible mistake, and there was no way out of it. I couldn't reverse time. The commitee of voices in my head were all laughing at me. I'm in a horror movie, everythings black and white, I can see every little particle of space around me. What is colour? What is this scene? Everythings made of little atoms.........that.........what was I saying? What? Oh my god not this again. Oh my god. Oh my god. No. No. this isn't happening. You've just fucked up my life. I will never forget this. I was supposed to do so many things. Oh and you had so many plans. You're doomed. But if you kill then you can return the ultimate spirit to save the world. It's your quest. You have a quest now Rachel. </p><p>The room was foggy. My body flung itself around and neglected to register pain when I crashed into walls and furniture. O.k, now I have to surround myself with a pleasant environment, it'll ease the paranoia. Theres my cat.  I'm just going to sit down and read the cats mind. She has alot on her mind. Why isnt her skull coming off. No! shit! 'I'm sorry! I would never hurt you Candy! Your my sister!' The cat wants to play football, I kick her. 'No, I mustn't kill you!' But what if the world explodes if you leave this room? You have to figure this out. The world depends on it. Wait Rachel, you are just paranoid. There is no answer. You can leave the room. The room drops its force field and I go into the bathroom and look for a razor. I see her in the mirror. I have known her for so long. I can't kill her either. This isn't real. I can't stand up for much longer. What is the answer? Weed will have the answer. The trees will talk to you if you ask them kindly enough. </p><p>I go into the back garden and hide myself from the satellite up above. I see flashes in my head of all those times my friends smoke up around me, passing the joint across to the person next to me, and I feel the pain of not being able to have a share of that fun. I was coughing and crying. Taken lungs full of the secret agent because Rachel can't smoke weed.  I come back 'Don't do it!!' she screams.  My body has its own mind, it lifts its mechanical hand with prosthetic skin coloured glove to the gateway to hell itself. I'm hot boxing hell. I am hell. I breathe fire out my nostrils. I burned the gargoyles at the back of my throat, at least 2 of the voices are gone.  Maybe I'll script them into a later scene. It's all just a movie. But if I write the scripts that means I have control of my own destiny. And that, young girl, is the key to good fortune, a rule of life. </p><p>Vibrations run up my body. I stand up and declare myself a prophet. My hand tears on the barbwire fence and the pain is unfamiliar, almost pleasant. The more I cut it the more it shows the Red Sea. To part the Red Sea I must cut off this mechanical hand. This is a task. I would do anything to save my friends and family, am I not going to believe this on the off chance this isn't true? The family or the hand? But what if theres a way to save both? I run throught the vertigo infected haze inside to the house of murder and jump down the stairs, head first. My body twists and I land on my shoulder and leg and slide down to the bottom. Take 10, she manages to stand up.  Scene 109.  Zarr opens the door to hell.  No I will not be fooled.  I must obtain the screw driver and insert it into the point of energy in my hand, like Chinese acupuncture, there the energy flow will relay to other pressure points and I will have the strength of 100 men and the power of 6 pylons.  Holy Shit. Come around, that doesn't make sense, I hear my mothers voice.  </p><p>She knows I'm not o.k, I pick up the phone and call my friend. I hang up repeatedly, then a voice: 'Emergency Services, name, address and phone number' Oh no, they are on to me.  Hang up. You've just endangered the lives of your family.  How long did you think you could get away being a terrorist in an 18 year old girls body? If you turn yourself in now you can save lives. Zarr are you there?!! Help me! The heads of hells gargoyles protrude from the wall behind me. I'm under the bed. A ghost of a sailor from the Navy is standing next to the bed. Can nobody help me? I can get past this. I'm delusional, I'm infected with a virus. Zarr has a strong mind. She must switch back to the OTHER reality to save the mortal humans of the 1st realm, of the 1st dimension. </p><p>I lay on the bed, after being convinced that the sailor had better things to do than to make apparitions next to beds with people hiding under them. I saw the lamp, I pulled the cord and it fell on the bone of my eye, the pain rushed through me and I gasped. I blacked out. </p><p>The world was still there when I woke up,(but I'm still not sure what dimension I'm in sometimes). It was the worst thing that ever happened to me. I'm not anti-weed, but I just think thats fucked up that this kind of experience is so underground and rarely documented, I want to know how many people get this and I want to hear their stories.</p>"
}
