{
 "title": "Part Of One Joint Conciousness",
 "author": "HappyHead",
 "citation": "   HappyHead. \"Part Of One Joint Conciousness: experience with Ecstasy (ID 233)\". Erowid.org. Aug 20, 2001. erowid.org/exp/233",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 233",
   "Not Specified",
   " ",
   "Not Given",
   "Aug 20, 2001",
   "Views: 5137",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I ever took Ecstacy was a couple of months ago with two friends. Well, one was a close friend, the other I`d never spoken to until that day.</p><p>It was about 7:00 PM, and we all decided to take out first pill. We were outside at the time, and it was pretty cold, so for the first hour or so I didn`t feel a thing. I began to think it would all be a waste of money, and that I wouldn`t even come up. Half an hour later, I was still waiting for the pill to take it`s effect, and I was getting pretty miserable outside in the cold and dark. </p><p>Then, about ten minutes later, I began to feel a pleasant tremor going through my body, in short rushes. Almost like an intense tingle going along your spine. These rushes became more frequent and intense, and although it was a pleasant feeling, I thought that I might be overwhelmed by it when I had fully come up. Next, all the street-lights around me seemed to become brigther and sharper, the colours much more vivid. My friend was next to me smoking a cigarette, and I was surprised to see the lit end leave a massive trail wherever he moved it. I can`t explain why, but this image just filled me with happiness, and it was lovely to watch. I could feel a massive grin form on my face and I then knew that I had come up.</p><p>By now the group of people I was in was getting larger, almost like a small street party. We swallowed our second pill, and carried on talking. Minutes later, I felt that I could 'see everything' or that my vision was really wide, if you know what I mean. It just seemed to expand my mind. I was looking at one place, but I felt as though I knew what was happening everywhere else. I felt so calm, and at peace. I was shaking hands with people I disliked very much, forgetting any past troubles. I wanted to forgive everyone, and the people `peaking` with me felt the same. It felt wonderful to be around such people, they were so friendly and loving, so trust-worthy, innocent and child-like. </p><p>I then realised, that sub-conciously, everyone who had taken ecstacy (there were about 10 of us now), had all been drawn to each other, and were in a group, distanced from everyone else. We were blissfully unaware of everyone else, and just huddled up to each other to keep warm.</p><p>9:30 PM I couldn`t believe that I had been up for only 45 mins or something, because it felt like hours. Our group of 10 people worked our way to a house where we were going to spend the night.  I saw people on the way, people I didn`t know, but I felt affection for them, I felt close to them. I was dying to tell them that I was peaking on ecstacy. I just wanted to share it with everyone. </p><p>When I got through the front door of the house, the warmth felt fantastic! It had the same effect on everyone, we were all talking, and being so friendly with each other. The atmosphere in the that room was electric!</p><p>We smoked a couple of rounds of bongs, and I felt wonderful.  Everything 'seemed right'. The pot made me feel like I was tripping, my mind felt as though it was somewhere else, and that my body was sleeping. </p><p>The music was put on, some dance, and to make things even better, my friend had his own strobe-light. </p><p>The effect the music had on my mind was amazing! I could hear things I`d never heard before, and I felt as though I could see or touch the music. The room I was in began to feel like the centre of the universe as I was listening to the music, and everything outside seemed so insignificant.</p><p>I felt like I could communicate to everyone else in the room without speaking, as though we could read each other`s mind. I found it very strange when someone said or did something I was thinking about just a moment before....and this happened several times.</p><p>The strangest thing that seemed to happen, was when we were all sitting down listening to the music, when all of a sudden, at exactly the same time, six of us jumped up to dance. We were all just looking at each other and smiling as though we had all experienced the same feeling and urge to dance, at exactly the same time. This really felt as though we were just part of one joint conciousness, instead of individuals.</p><p>By second pill must have taken it effect without me knowing. I say this because I was dancing for what seemed like an hour, stopping to get a drink every so often.  I was beginning to feel it wear off slightly, so I looked at the clock, and was amazed to see it was 3:00 AM! I couldn`t believe how time had passed.</p><p>From then on I began to feel a little tired and run-down, and fell asleep on the kitchen floor for the rest of the night, strange as it may seem.</p><p>Overall, this was a very positive experience for me, I feel like I have seen the world in a totally new perspective, or seen things that only a few people have seen.</p><p>Generally now, I am more friendly and considerate towards other people. I feel like I can empathise with them and really relate to them.</p><p>Anyway, I would recommend ectascy, especially in a small group, because the emotional bonds and attachments formed are pretty amazing I think, and it will change the way you view life forever.</p>"
}
