{
 "title": "Liquid Souls",
 "author": "SubwayBoi",
 "citation": "   SubwayBoi. \"Liquid Souls: experience with Ketamine (ID 23311)\". Erowid.org. Apr 4, 2007. erowid.org/exp/23311",
 "substance": "Ketamine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23311",
   "Male",
   " ",
   "Not Given",
   "Apr 4, 2007",
   "Views: 11809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had done ketamine for several months before, but had never had effects like I was about to experience. Prior to this experience it would simply make my eyes go blurry, slur my speech, etc. It was like being really drunk.</p><p>On this particular night I was at friend A's house waiting for friend B to call, at which point I would proceed over to B's place. While waiting friend A and I did a bit of ketamine I had, but as I had had an extremely stressful week (work, exams, and my grandfather's funeral had been that morning) I chose to snort approximately half of a half-gram vile. Just after I snorted my big line, friend B called and I hopped on the streetcar to meet him, not thinking for a second about the big line I had just snorted.</p><p>My 'trip' began as soon as the streetcar started to move. My field of vision began to narrow and unfocus, and soon I was not aware of any of my senses at all. I began to be lost deep in thoughts of my life, it's direction and meaning. I soon realized that anything and everything I did had no meaning or importance. In fact, I began to move further and further outside of myself. I can only compare it to a movie camera starting at me and moving backwards until it was outside my city, planet, solar system, etc. I realized that nothing in this world had real meaning if you looked at the 'big picture', at which I was now looking. </p><p>The essence of what I now was now perceived as liquid, a drop moving throughout the universe. I soon entered into a sort of waiting room, where I was presented with a mass of spherical liquid which represented the collection of individual 'drops', one of which was me, watching it from outside. I realized the truth - that all individuals sprung from this mass of liquid as drops, but that the drops themselves had no individual identity UNTIL they had been individual drops for some time.</p><p>In other words, if I were to re-enter this sphere my identity would be lost. I briefly wondered if my identity would be absorbed into this mass, but realized that in fact my identity, everything about me, would be completely erased. The physical world in which we lived, and everything that constituted who I thought I was, was all illusionary and meaningless.</p><p>At this point I knew I had a choice - I could re-enter the sphere and get my destiny over with, or I could continue this fabricated life for a little longer. I was unsure what I would decide, but then the horn on the streetcar went off loudly and I was brought abruptly back into this world. I had lost my chance to choose because I had hesitated.</p><p>This was as real to me as anything I have experienced, and in a way it was MORE real. Although the implications of this trip should have been negative, I found an increased appreciation for this world and the people in it. I used to suffer from clynical depression but now no longer have passing thoughts about ending my life - something that antidepressants and therapy have never been able to give me. Also since this trip ketamine, even in smaller doses, has effected me very strongly. It is as though a part of my brain were 'unlocked'.</p><p>I am still wrestling with the personal implications of this experience, as it only happened three weeks ago. One thing is certain, though: I want to experience more.</p>"
}
