{
 "title": "Day Trippin in the Woods",
 "author": "Sopris",
 "citation": "   Sopris. \"Day Trippin in the Woods: experience with AMT & Cannabis (ID 23312)\". Erowid.org. Apr 4, 2007. erowid.org/exp/23312",
 "substance": "AMT & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "AMT",
   " ",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23312",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 4, 2007",
   "Views: 3988",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend, who I will call O, and I had been preparing for this trip for about a week.  As we had both done AMT before, we decided it would be nice to try a day trip, especially since at night, AMT seems to act a lot more like a roll than a trip.  We decided we would eat the AMT and head off, by bike, to a nature preserve about a mile from our apartment.  The weather was perfect for tripping, about 70-75 degrees, cloudy skies. It wasn't raining, but there was a breeze that felt like it may start.</p><p>Once we got to the park we smoked a bowl of some really good kind bud. Just looking at it I was getting high. The crystalization looked amazing. Its odd how great bud looks under natural lights.  Still not feeling the AMT too much, but the bowl is getting us really high.  My friend O decides he can't smoke anymore because his stomach hurts. Not to worry, as an experienced psychnaut he can control himself, he just needed a breather so we decided time to start hiking.</p><p>We start hiking around the lake when the AMT really starts to take hold.  The feeling AMT gives off is so euphoric in its nature that I have no idea how one has a bad trip on the stuff. Our stomachs are starting to feel better, not that they felt that bad, but the discomfort is all but gone.  </p><p>The visuals are absolutely insane.  The beauty and vibes I am getting from the forest are inexplainable.  Hearing the sounds of the forest starts blowing me up and the are morphing into the most insane three dimensional shapes I have ever seen.</p><p>Looking into the woods, I see the trees starting to bend and meld, and then my depth peception goes.  Everything seems far and close and an eyeball is now staring right back at me from under a branch, a very big eyeball.  I start laughing, the whole thing seems so abstract and beautiful at the same time.</p><p>Examing the reflections on the lake become another trip out.  As my brain is fucking with everything I'm seeing, the reflection looks nothing like what its reflecting. The differences that I see allow me to realize just how messed up I am. And DAMN... WE ARE TRIPPING!!!</p><p>The visuals are not the only effect of this drug.  Unlike most psychedelics, AMT gives off an ecstasy-like body trip and brain-fuck.  This is one of the best parts of AMT - everything is beautiful, everythign feels beautiful, and everything is moving and swirling.  Its just awesome.  </p><p>The body trip especially began to build when O and I decided to go for a bike ride in the middle of the trip.  The wind and the excersize itself boosted the sensations. The feeling is very similar to blowing up on ecstasy, except with better visuals.  After the bike ride, we return to the nature preserve to continue tripping.</p><p>About 10 hours after we entered the preserve, the sun is starting to go down and we have to leave. Luckily the park is only about a square mile, so it only takes a little while to find our way out despite the fact that we got a little lost.</p><p>Back to the house.  Still tripping.  We watch cartoons and finally eat about 13 hrs after eating the AMT, to bed in about 15 hours.</p><p>I woke up the next day feeling refreshed.  No lingering morning effects.  Will I do again? I already have, but as it is illegal now, it will be harder to get.</p><p>Peace all</p>"
}
