{
 "title": "Very Bizzare Trip",
 "author": "Faust",
 "citation": "   Faust. \"Very Bizzare Trip: experience with Mushrooms  (ID 23337)\". Erowid.org. Oct 3, 2007. erowid.org/exp/23337",
 "substance": "Mushrooms ",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 tsp",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 23337",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 3, 2007",
   "Views: 3442",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have taken 'Magic Mushrooms' on several occasions.  I acquired them through a friend who grew them in his backyard.  I usually took a dose of 12 mushrooms, which put me in an intense state for several hours.  I wasn't aware that lower doses were the norm.  Upon first acquiring a bag of 12 shrooms from my friend, I asked 'How many should I take?'.  He responded 'If you take any less than what I've given you, I don't think you'll get the full trip'.  Which is true.  All I knew these mushrooms as were 'Gold Tops' due to the metallic gold colour they took on once they had dried out.  The trips have always taken me to 'heaven and hell', and although they have been strong, I have always been aware that I am still on Earth.  Tripping out of my skull, but still on the material plane.<br>The dose I took this one night was one teaspoon of dried mushrooms, about 3 mushrooms worth, a small dose I didn't expect to get many effects off.  Maybe the 'afterglow' type effect where everything glimmers and tastes good, looks good, sounds good, etc., but not too much else.  My friend and I decided to experiment to see how few mushrooms it took for the trip to start.  I had not taken mushrooms for around 10 months prior to this experience.  I was not in a depressed or stressed state of mind, or state of life.  I was not suffering from any mental illness or bad emotional situation that might contribute to a 'bad trip'.  I was 'healthy' in every way.  I had had a good diet, and didn't even smoke pot.  I had even quit smoking.  I drank coffee and alcohol at that stage, and took nothing else.<br>I ate the dose of mushrooms, dried and chopped, on the teaspoon, straight in my mouth with some hot tea my friend had made for me.  We waited around his apartment for around 60-90 minutes.  Nothing happened.  I felt OK, not nauseous, weird or anything.  A little happy, probably because I had just eaten some drugs for the first time in almost a year, but nothing special.  I was not hallucinating at all.  We ventured outside.  The sky seemed normal.  Every other time I had tripped on shrooms, the sky took on an 'infinite' atmospehere, looking at it for too long made me feel like I was staring into infinity, and it was hard to look away.  It was usually awe-inspiring and tremendous.  This time it wasn't, it was the same normal sky.  We decided to go down to the local pub.  It was a Wednesday night, and usually we had many friends there, so I thought it would be a good place to go.<br>It takes about 30 minutes to walk to the pub from his house.  About 5 minutes before we arrived, I noticed the 'tunnel-vision' effects of the mushrooms coming on.  They aren't bad effects, they just kind of give a sense of purpose.  I am aware of everything going on around me, but if I walk in a straight line I get a kind of 'tunnel-vision'.  Good tunnel-vision =] We entered the beer garden' but saw no friends there, so we went inside.  As soon as we got inside the smoky atmosphere scorched my lungs.  It felt horrid.  I had always had a bad reaction to open fires or smoky areas when tripping on shrooms.  I am very sensitive to olfactory stimulus when shrooming.  I went to the bar and ordered a bottle of water, which made my throat better.  My friend and I sat down at a table and listened to the band (acoustic, but miked up - mellow).  The noise was as usual for the pub, loud but not irritating.  I saw no other friends at the pub.  We were sitting at a table when the trip really began.<br>Now, this trip is unlike any other trip I've had on mushrooms.  It was intense, short-lived, amazing, (insert adjective here).  I am eternally thankful for having it, but would never want to experience it again.<br>I sat across the table from my friend.  I began to realise the infinite size of the world.  I was staring at my friend, but the rest of the world got larger and larger.  I could still see the walls, ceiling, floor, etc., but I could see *through* them too, and there was a blue grid, like in the movie 'Tron'.  I was overwhelmed and daunted by this, but I had experienced this several times before, and realised it was a normal part of the mushroom trip.  I started to feel like I couldn't breathe properly, so I told my friend I was going to the toilet to change clothes.  At the time I was wearing a skivvy, with a shirt over the top.  I was taking the skivvy off, so I was just in the light cotton shirt.  I went to the bathroom, went into a cubicle, and noticed that things were starting to go 'chaotic'.  That word describes it well, but I will go into more detail.<br>Flickers of light crossed my vision.  Colours changed without notice.  Think of an old television set that flickers from black and white to colour and back again, except it wasn't that simple.  Things flickered from 'negative' to 'psychadelic' to 'pastel' etc etc.  The sounds started to warp, echoes began occuring with too much frequency, much more than the normal 12 mushroom trip.  Echoes occured not only after sounds, but before as well.  Sometimes pre-echoes would build up and up, but then no sound came.  I felt wet and clammy, like I was melting all over.  My hair had a feeling of static.  Overall, physical sensation was bizarre.<br>I finally got my shirt on, and thought 'Oh shit, this is bad'.  I was not coping well, I was not coping at all, and my friend was still out in the band area.  I staggered out to him. The distance I travelled was tiny:<br>2 metres from the cubicle to the toilet door<br>2 metres to the hallway<br>4 metres to the band area<br>2 metres to the table where my friend was<br>In this period, where I was walking the whole way, this is what happened.  My vision became actual tunnel-vision.  The tunnel kept shrinking, I could only see what was in the tunnel, and that was hallucinatory in any case.  Outside the 'walls' of the tunnel was absolute chaos.  Think of when you turn your TV to no channel, and there's static, except along with all the static, there's random images from throughout my life flickering through.  All the while, this tunnel was shrinking.  The sounds were bizarre.  I could hear the band, the constant beating of the drums, but other sounds came over the top and drowned the band out.  These sounds were chaotic too, they had no rhythm, no pattern, just random sounds.  Hundreds of them, all over the top of one another, all from various times in my life, some were tiny snippets, some were longer sounds.  They got louder and louder, and more chaotic, and it just ended up being a horrible mess of white noise and sound samples.  I lost sensation in my legs, arms, body, and finally I just felt like a floating head.<br>By the time I got back to my friend, I couldn't feel anything at all.  The tunnel had shrunk so much I could barely see my friend (about 10% of my total visual scope).  I remembered trying to communicate with him the idea that I need to leave, but I couldn't feel anything, let alone my mouth, so I just turned around to leave.  And that's when it happened.  I turned around, and was suddenly without form, floating in this cloudy realm of intense blue light.  There was 'Aurora Borealis' type light all around me, all pointing towards me.  I could not control where I moved, but I could control where I looked.  I spent a good 15-20 seconds looking all around.  I had a feeling of terrible foreboding, like I was not meant to be there, like I was trespassing.  I felt an intense fear I have never felt before.  I KNEW I was not on Earth.  I was somewhere else.  I was not even in the Universe.  I don't know where I was, but it had no geographical location.  It was simply 'elsewhere', somewhere outside my little human realm.<br>Then, I looked upwards, and saw before me a figure around 10 metres tall, broad and heavy-set, arms crossed, with large bull-horns sticking sidewards out of it's shoulders, and out of it's head like a demon.  It stood over me, but was silhouetted, so I could not make out any other features.  It just stood there, arms folded, staring at me.  I have never felt so afraid as I did at that time.  I thought I was going to be eradicated from existence.  I don't know how to describe the fear.  I've almost been hit by vehicles, stared at their lights, and that wasn't as scary.  I've been attacked by a gang, one of whom had a knife, that wasn't as scary.  This was absolutely terrifying.<br>Then, suddenly, everything went black, and I felt a hard cold wall against my face.  I pushed against it to push myself away, and realised it wasn't a wall, it was the tiled floor of the pub.  That was the strangest feeling of vertigo I've ever had - 'forward' was actually 'down'.  There were about 15 people standing around me, a few asked if I was okay.  I said I've never felt better, which was true, I had stopped tripping altogether.  My friend hauled me up and we left the pub.  Outside, I asked him 'What the hell happened?!'.  He said 'That's what I was going to ask you!'.<br>He told me I came out of the toilet, looked very groggy, came to him at the table, said to him 'Go. Now.' and then I turned around, took one step forward, stumbled into a chair and fell face-first onto the floor, without even putting up my hands to stop the fall. (Ouch!=) Now, though, we were outside, and at that stage I was NOT TRIPPING AT ALL!  I felt completely fine!  The trip finally came on again about 10-15 minutes later, and I spent the next 5-6 hours tripping at the level that one would expect from such a small dosage.  Small hallucinations, the world just seemed bright and beautiful in it's unqiue mushroomy way.<br>I cannot explain why this happened, but it did.  I have heard bad stories of the past of that pub, that it used to be a drug and gun running pub, and that in the 70's there were blood-baths there between the bike gangs, that people were murdered, etc etc.  I don't know if these stories are true, but my mother couldn't believe it when I told her that it was my local.  Maybe there's bad karma there, maybe not, but I only found out about the places history AFTER this trip anyhow.\n\n\n"
}
