{
 "title": "Eventual Relief",
 "author": "Wonderama",
 "citation": "   Wonderama. \"Eventual Relief: experience with Venlafaxine (Effexor) (ID 23362)\". Erowid.org. Apr 29, 2003. erowid.org/exp/23362",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23362",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 29, 2003",
   "Views: 25405",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Dose: 150mg daily</p><p>After an unsuccessful trial with Wellbutrin, my doctor prescribed Effexor for major depression.  I had been depressed for about 14 months when I started taking it.  I started with 37.5mg once a day, and was to stay at that dose for a week.  What was apparent immediately was nausea, insomnia and anorexia - all of which got progressively worse through that week.  But at day 4, I noticed that the almost constant, negative internal chatter that always accompanies my depressive episodes was beginning to subside.  Considerably.  By the end of the first week it was almost completely gone.</p><p>At the beginning of the second week my dose was increased to 75mg per day.   I didn't experience any new side effects.  The nausea was not as intense as it was the first week, but I still couldn't eat or sleep much without sleeping meds (either 5mg Ambien, or 25mg diphenhydramine plus 600mg Neurontin).  As for the depressive symptoms, they were slowly disappearing.  I started listening to music, which I hadn't done for months.  I found myself being friendly with people at work, I caught myself smiling once in a while, and I was getting some energy back.  Little things like taking out the trash and showering were no longer huge ordeals.</p><p>Week three was another increase to 112.5mg once a day.  At this point I was no longer dealing with nausea and was able to eat a couple of small meals every day.  My energy level also continued to increase, and although my chronic insomnia didn't show any signs of letting up, it was getting much easier to get out of bed in the morning.  My mood improved considerably - I hadn't had a crying bout since week one.</p><p>At week four I started taking 150mg, which is where I've stayed since (just about 2 months).  All side effects were gone.  In the first couple of weeks I lost six pounds, which I was beginning to put back on.  My depressive symptoms were also gone.  At about week 10 I started sleeping through the night without any meds. </p><p>My course of treatment is undetermined, but I don't plan on discontinuing it any time soon.  The inconvenience of the side effects was well worth putting up with for the relief I feel.</p>"
}
