{
 "title": "A Lesson Learned",
 "author": "Method's Prodigy",
 "citation": "   Method's Prodigy. \"A Lesson Learned: experience with Mushrooms (ID 23430)\". Erowid.org. Oct 3, 2007. erowid.org/exp/23430",
 "substance": "Mushrooms",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23430",
   "Male",
   " ",
   "Not Given",
   "Oct 3, 2007",
   "Views: 2456",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>﻿It was about 4 o'clock in the afternoon, and me and a friend were bored at his house. Nothing at all to do until I remembered that my neighbour had offered me the 'best shroom's I would ever try'.  What the hell I thought, why not.  So I walked over, and got five grams, 2.5 for me, 2.5 for my friend.  As I chewed I noticed his twisted face, he did not like the taste and couldnt eat the rest.  So obviously, I took his portion with pleasure, drank a bottle of water and left to play basketball. </p><p>With all of the running around the drugs seemed to effect quicker, and my stomach started to hurt, and everything started to slow down.  Because I didnt feel to good, I went home to lay down.  Walking to my house, my mind seemed to totally clear up, and my senses enhanced. I could see more, hear louder and felt as if the wind was silk on my skin.  I couldnt believe how I'd felt, and never wanted to be sober again.  Walking into my house I found that my mom was home and this filled me with anxiety, but I just said that I was going to sleep and went upstairs.</p><p>Now it was about 30 minutes after I took the shrooms and I was starting to really feel the effects, but no visuals yet.  This is when I got up to go to the bathroom, looked down and saw my pants all wet.  Needless to say I started freaking out until I realized that they were not wet at all but that it was the first of many hallucinations.  The hallucinations started off very small, like my mind was playing tricks on me in the corner of my eye, but rapidly increased to flat out things that werent there.  Walking back from the bathroom to my room I caught a glimpse of the cross on my wall, and for a second could swear that it was bleeding, but at a second glance I found that it was the same old cross.</p><p>Now, before I tell you the rest, I just want you to know that after this point, I lost all concept of time and the hallucinations are based on what I can remember, so they</p><p>may be slightly skewed. I layed back down for the second time, and this is when things got interesting. This was almost an hour into the trip and my walls started to drip down and my heart beat increased until I thought it was going to jump right out of my throat.  My tongue got really dry and fat until I could hear it moving in my mouth, and sounded like sandpaper.  This is about when I could hear the megaphone yelling at me from outside in gibberish.  Sweating profusely, still trying to fall asleep I had a revelation.</p><p>For some reason I truly truly believed that a cold shower would sober me up, so I went back into the bathroom, but could not recall which dial was cold and which dial was hot.  So I just tried one, put on the bathroom radio and jumped in with all of my cloths on.  In the shower, I was listening to an alternative radio station, but because everything was running thru my head like five times over, it all just sounded like techno.  In my mind I had an inner dialogue that was also running thru my head five times over.  This is the point in the trip when I really started to believe that there was something wrong with the shrooms.  Anxiety increased, and all I could think about is getting sober again and being normal.</p><p>Realizing that the shower was if anything making me worse, I got out, soaking wet, and confused, came up with the logic that shaving would sober me up.  Dont ask me why. I lathered up and started to shave... badddd idea. While shaving I was watching my self shave layers of skin off of my face (hallucination, not for real). Without drying off or changing, and a half shaved face, I went back into my room and layed down and closed my eyes. Again, this was not a good idea.  The visuals in my head were some of the most unbelievable and scary things I had ever seen in my whole life, and constantly was debating whether it was the best or worst experience of my life, and chuckled at the fact that I couldnt decide.</p><p>In the middle of this train of thought, the phone rang, and I panicked.  I didnt know whether or not to answer it, or even how to.  Thinking I wouldnt be able to talk in any language that would make sense, I started reciting a verse of a song that I had memorized.  I'm not sure whether I did it right or not, but it sounded like gibberish to me.  Closing my eyes again, my mind began to wander and I wondered if I was going to live through the experience. At this point and time, I'm guessing it was about 2 and a half hours after I dosed, I could feel the feeling being sucked out of my body, if</p><p>that even makes sense.  My body was going numb and I believed that my body was slowly</p><p>shutting down, and I was dying.  After the numbness traveled throughout my whole body, I must have released some gas or something, but didnt feel it, and thought that I had messed myself.</p><p>Now this experience filled me with embarrassment and fear of the fact that I would be found dead in my room, with uncontrolled bodily functions. Along with all of my other hallucinations, I visualized this scenario, and what it would be like.  Realizing that if I thought bad thoughts my trip would be bad, and good thoughts, my trip could still be good, I tried to redirect myself in a positive path.\tHad a long conversation with Tupac (the poster) and believed he could actually hear me, and began to wonder how much longer my trip will last.  This was around 5 hours in and this question made me very very happy. The reason it made me happy being that someone had told me before, that when you start to wonder when it will be done, it almost is.  I guess it has something to do with comprehension or something, I'm not sure.</p><p>Whoever said that was absolutely right.  After I wondered when the trip would be</p><p>done, the only hallucination was my drawers slightly moving, my bed being really high off of the ground and more dripping of the walls.  After all hallucination was done, I decided to go back downstairs, but still felt very odd, even bad in a way.  Just relaxed and was very happy for the rest of the evening.  Not happy because I had fun, but that I was alive, and lived through one of the most mentally trying experiences of my life.  This is just some basic memorys I have of that day, and is not at all the whole trip. Ever since that day, I have steered away from the hallucinogenic, and stuck to more mellowing drugs, mostly the herbal, non psychological stuff.</p>"
}
