{
 "title": "Lazer Light Loving",
 "author": "sensei",
 "citation": "   sensei. \"Lazer Light Loving: experience with BZP & TFMPP (ID 23485)\". Erowid.org. Oct 28, 2004. erowid.org/exp/23485",
 "substance": "BZP & TFMPP",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "Piperazines - BZP",
   "(powder / crystals)",
   " ",
   "50 mg",
   "oral",
   "Piperazines - TFMPP",
   "(powder / crystals)",
   "  T+ 2:00",
   "50 mg",
   "oral",
   "Piperazines - BZP",
   "(powder / crystals)",
   " ",
   "50 mg",
   "oral",
   "Piperazines - TFMPP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23485",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 28, 2004",
   "Views: 15854",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night, I went to a club in Tokyo with 3 friends of mine. My best friend and I had decided that we wanted to experiment a little by adding some spice to the night. We both did our research on the possibilities of what we could take and decided on a combo of BZP and TFMPP. (Previously we tried AMT, which had some good effects, heightened music appreciation and sensations of touch, but we really didn't take enough to fully experience its power only taking 30mg each.)</p><p>We arrived in the club about 10:30pm and got settled into our surroundings. It was a friend's birthday so we had some champers courtesy of the club, along with the free tickets to get in. So already we were feeling pretty pleased with ourselves. After being impressed by the view of the outstanding laser show going on down on the dancefloor, we decided to take the first hits of the drugs we possessed. So at 12:00 we took 50mg of each, to test the water as it were. After that we went down to the dancefloor to experience the lazers first hand.</p><p>By about 1:00am I was cruising and loving everything that was happening. The music was hard techno and seemed to suit the drugs perfectly. At this point I had some tingling sensations down my arms and occasionally across my back, but nothing like the effects of base, very welcoming none the less. At times I was in my own world, leaving my compadres to go into the centre of the dance floor and disappear into the music. This was not something difficult, and I began to experiment with myself. I found closing my eyes for a short time while still dancing made me quite tingly again and then on opening my eyes was greeted with what felt like a fantastic headrush. Obviously brought on by the drugs but also encouraged by the lights and musical entertainment. </p><p>After dancing for the previous 2 hours (2am), and having bought a bottle of water to supress the desperate desire for liquid, we dropped the other 50mg we had left of each drug. By this point I was continually thirsty, but didn't really want to leave the dance floor for fear of missing the great music and out-of-this-world laser display. I found that my movement had become greatly slowed and in anticipation of the next hit, I expected to become even more delayed in my movement and thought. Well, initally, after about 30 mins (2:30am) I felt a rush as the next installment of the drugs hit home. The only time I left the dance floor was for the toilet or to freshen up with drinks. I didn't want to sit down. I relished every beat and found myself grinning at the DJ in appreciation of what he was doing (as if he could pick me out from the crowd below him). </p><p>I know I have mentioned the lasers several time, but it really made the whole experience whole by having them there. My eyes were responding fantastically and at some points I felt like they were shining just for me. I felt that I was at the centre of their attention, and I felt priveleged by that fact. The colours and shapes the lights made me feel excited and encouraged me to dance on. Having said that the strobe and usual club lights had similar affects, but because the laser lights seemed to swallow us, I felt that 'connection' to them.</p><p>I read that this combination of drugs has an MDMA sort of effect but having never done it, I can neither confirm nor deny. All I know is that I could have continued dancing until I dropped. It was ALL about the music, and I really becam oblivious to other people around me. We left the club just after 5am (to my friend as Is disappointment) but I was still buzzing from the night. At this point my thought and movement felt very slow, and I felt quite lathargic. At no point in the club did I feel nausea, as I had previously read would be the case. Nor did I feel any sort of sickness or coldness etc. I have to say it was a floorless experience. Having said that though, I would advice preparing the drugs and putting them into capsules before hand. Unfortunately we didn't have the time to do that, so had to sort it out off the cuff in the club toilet. We did this with the AMT and it was soooo much easier.</p><p>On the train home I felt quite chatty and giggly but the tiredness was kicking in. By this point it was about 6:30, and I could feel the aches in my body begin to rear their ugly heads. I knew that I would feel the effects of the night later on. I could still feel the drugs inside of me, at 8am, and they were still affecting heightened sensory impulses, but to a much lesser extent. (total up time 7 hours)</p><p>As I write now (post club) I do ache and my head is a little cloudy, so really advisable to ensure you have a day off the next day so that you can chill and recover in style and the comfort of your bed or a nice warm bath.</p><p>I have read the amzing quantities of these drugs that some people take, and in my humble opinion what we took was really adequete. It was a great experience and I would have hated to ruin the experience by taking too much. I recommend people research about the drugs they are planning to embark on. These are some strong chemicals that your body is quite likely going to be shocked by, so I suggest starting slowly and then building up.</p><p>Whatever you decide to do, have fun and be safe :)</p>"
}
