{
 "title": "The Green Fairy Made Me Lose Control",
 "author": "Moses",
 "citation": "   Moses. \"The Green Fairy Made Me Lose Control: experience with Absinthe (ID 23504)\". Erowid.org. Dec 5, 2006. erowid.org/exp/23504",
 "substance": "Absinthe",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "4 shots",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23504",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2006",
   "Views: 18677",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had wanted to try Absinthe for some time now, having read many experience reports and hearing a lot about it from friends.  I finally got the chance last night.  I was at an 'underground dance party' when I met up with one of my friends, who asked me if I wanted to talk to 'The Green Fairy'.  I didn't know what he meant right then, but when we went out to his car, it became very clear.  I told him I only wanted one shot so I could see how I felt.  Peer pressure got the best of me and I ended up taking 4 straight shots.  The taste was horrible, almost making me gag a few times.  It tasted a lot like black licorice, with a disgusting and long-lasting after taste.\r\nThe effects were almost immediate.  I felt a rush of warmth over my body and my legs felt numb.  It wasn't exactly difficult to make my way back to the party, just weird.  It almost felt like it wasn't really happening, as if I was in a video game watching the action.  Over the next hour, reality became very distorted.  People would talk to me, and I heard every word, but none of it made sense.  The DJ that was spinning was playing some good cyber-trance and it was the best music I'd ever heard, but I couldn't comprehend what was going on around me.  I walked around in a daze for what seemed like forever just taking in the sights and sounds and smells of the party, though my senses were jumbled and I could barely distinguish the three.\r\nMy stomach felt really uneasy, and a few times I thought I was going to throw up, but as soon as I got to the bathroom, the feeling went away.  I felt very disoriented.  A few of my friends were talking to me, and I just mumbled replies, not knowing if I was making any sense to them.  Every so often, they would be saying something serious to me, and I would bust out laughing uncontrollably and it wouldn't stop for at least a few minutes.  After the second hour had passed, I was full on hallucinating.  The walls were moving, and I could feel the music coursing through every vein in my body.  It was an incredible feeling.\r\nThe ground felt like clouds and walking almost seemed like a basic motor skill that my body was still performing, but I wasn't too sure how I was doing it.  Halfway through the third hour, the effects were still going strong.  A very heavy dissociated feeling from the world.  I wanted to interact, but I didn't feel as though I was a part of everyone else's existence.  I felt like I was a figment of their imaginations and that at any minute I would disappear.  The hallucinations and altered state of being lasted well into the 5th hour, but at that time, I took a pill of ecstacy, but that's another experience report.\r\nIn conclusion, I can honestly say I've never tripped that hard my entire life on anything.  I am definitely going to try it again, and I would definitely recommend this drink for those of you looking for a good time.  It was like a combination of E, alcohol, and LSD all at once.  Oddly, it wasn't anything like any of the experience reports I've read.  It was totally different from what I expected.  I was definitely satisfied though.\n\n\n"
}
