{
 "title": "Waka Me Good",
 "author": "Tony Dobson",
 "citation": "   Tony Dobson. \"Waka Me Good: experience with Kava (ID 23517)\". Erowid.org. Jan 12, 2007. erowid.org/exp/23517",
 "substance": "Kava",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 glass",
   "oral",
   "Kava",
   "(tea)",
   "  T+ 0:05",
   "1 glass",
   "oral",
   "Kava",
   "(tea)",
   "  T+ 0:10",
   "1 glass",
   "oral",
   "Kava",
   "(tea)",
   "  T+ 0:15",
   "1 glass",
   "oral",
   "Kava",
   "(tea)",
   "  T+ 1:00",
   "0.75 glasses",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23517",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2007",
   "Views: 27980",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had just got some fresh kava root from a market in QLD on the packet it says WAKA Grade. I have had kava a few times and my usual dose is 3/4 - 1 cup depending on how strong it is.\r\nIt was a average day at work and I was feeling good, tired but I had a good mind set. I was just bored at home so I decided I would make a brew of my new kava (this was the first time I had it). I put about 1 cup of the root powder into a piece of cloth and then submerged it in tap water(22 deg C) in a bowl say 600ml water. I plunged it up and down and worked it with my hands for a min or 2, I let it stand for about 2.5 hours working it with my hands every half hour or so. After the 2.5 hours I squeezed all the remaining liquid from the cloth/kava leaving a nice milk-coffee colored liquid. I then put the fully squeezed sack of kava into a new container with fresh liquid.\r\n(T 0:00) I poured myself a large glass which I finished in about 5 min.\r\nAn instant feeling of slight relaxation was present, I then finished 3 more glasses in 5 min intervals which was all I had.\r\n(T +0:35) After 35 min I began to feel the effects more strongly and felt the need to curl up in bed. I had a slight feeling of drunkeness/unsteady on my feet.\r\n(T +1:00) At this time I was feeling very euphoric with a slight buzz going through my body. The drunken like effects had gotten stronger and my balance was a bit out. I drank the second extract I had made about 3/4 of a glass.\r\n(T +2:00) By now I was feeling very sick in the stomach and was feeling the full effects with included Tiredness/relaxation/loss of motor skills/muscle relaxation.\r\n(T +2:30) Well that sickness got stronger until I dryreached a few times but never got anything up. It was not an unbearable feeling but certainly not a positive.\r\n(T +3:00) The sickness and effects were slowly starting to wear off and there is not much else to report on after this.\r\nWell from exprience I would say WAKA grade kava is quite strong I think I will stick to half a cup next time :).\n\n\n"
}
