{
 "title": "Pantherina Mysterina",
 "author": "human",
 "citation": "   human. \"Pantherina Mysterina: experience with Amanitas - A. pantherina (ID 23532)\". Erowid.org. Nov 12, 2003. erowid.org/exp/23532",
 "substance": "Amanitas - A. pantherina",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Amanitas - A. pantherina"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23532",
   "Not Specified",
   " ",
   "Not Given",
   "Nov 12, 2003",
   "Views: 20706",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Since I have found only five reports online pertaining to a. Pantherina experiences, I have decided to add one of good value, so others with similar paths may help themselves.  Before I share my experience, I must expound on some critical points:</p><p>1. The aforementioned experiences, except for one written by J. Ott, and another by anonymous, were reached through the ingestion of raw A. pantherina flesh.</p><p>2. Inadequate consideration was given to dosage.</p><p>3. The intentions were to become intoxicated on a novel 'shroom'</p><p>It can be said that those are the three red flags for venturing into unkown and potentially deadly territory.  Because of the deliberate lack of reputable information on A. pantherina usage, I took up the sword and cut through the mystery for myself.  My findings are not amazing, or even entertaining to read (as so many trip reports aim to be).  Here is how the Amanita pantherina dosed me:</p><p>1st test - apx. 1/2 of an 8cm di. Fresh cap simmered for 30 minutes in 3 cups of purified water. No liver failure, no wretched pain, only purity of consciousness and lucid abilities. Drowsiness, urged to close eyes.</p><p>2nd test - apx. 1 and 1/2 6cm di. Fresh caps simmered for 1 hour in purified water. No liver failure, no wretched pain, only more purity and extreme lucidity. Drowsiness, urged to close eyes.</p><p>3rd test - tonight. 8:30 pm ET. Four 5-6 cm di. Dried caps simmered for 75 minutes in purified water. I understand that the switch from fresh caps to dry caps is not within the structure of any procedural experiment, but, a. Pantherina told me so. Intuition never falters.</p>"
}
