{
 "title": "Colorful and Enlightening",
 "author": "Jared",
 "citation": "   Jared. \"Colorful and Enlightening: experience with Mushrooms (ID 23557)\". Erowid.org. Oct 19, 2005. erowid.org/exp/23557",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 caps",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:30",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23557",
   "Male",
   " ",
   "Not Given",
   "Oct 19, 2005",
   "Views: 5925",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been drug free my entire life.  I am currently 20 years old and a sophomore in college and up until the point of using mushrooms I had done nothing.  Not been drunk, not been high, I even stopped drinking drinks with caffeine a while ago.</p><p>What had interested me the most about mushrooms was the possibility of experiencing a totally different world than what I know now.  I am a philosopher and thought of it as a great experience to reinforce the thoughts of 'is this world really real or could it just be my imagination?'  Mushrooms didn't do this for me, but let me tell you what they did do for me.</p><p>I had decided to buy an 8th of mushrooms for me and my friend to do.  I had had them for like 3 weeks and we just never seemed to find the time to do them, so when my other friend asked me to go camping one Monday night I was like ya and decided to bring my mushrooms along.  I had been told by many people to do them out in the woods and I thought it was a good idea to have more of a spiritual type experience rather than just hanging around my dorm or someones house or apartment.    I am a very outdoorsy type person so the woods don't scare me, but I could definitely see it being scary at night for some people.  Anyway after dinner I brought up that I had some shrooms. I was with my 1 friend and 2 of her friends who I had just met that night but were cool.  And I finally decided on doing them at about 11pm.  I gave the smallest one away and 2 other small ones away.  And ate 2 big ones I was told that's all I really needed.  So we were hanging out they were getting drunk I was waiting for the shrooms to take effect.  We had a fire in the middle it was all cool I was comfortable not afraid at all I had read all about shrooms and was perfectly comfortable and knew that if I let my mind be scared or anything I would have a bad trip.  </p><p>About 1.5 hours later still nothing had happened (I didnt even think of it then but this was cause I had eaten) and I was wondering if I had taken enough.  I asked the guys and they responded, 'You know I may be drunk, but if I were you Id eat the rest of that bag'.  I'm not sure if I was under the influence already and didn't notice but I decided that I would eat the rest, which was about 1/2 of an 8th.  Well about 30 min after that I started to feel that nauseas feeling and staring at the fire didn't really do anything for me.</p><p>But I finally looked up at the stars and noticed a rainbow pattern covering the whole sky.  I sat back and looked at this for a while and the tree branches also were cool making spider webs and other such things.  I convinced the others to come out and watch the stars with me away from the fire and they said yes, so we walked away from the fire and went and laid and watched the stars.  Nothing was going on with the stars but this pattern was everywhere and darkness made it much easier to see.  I could go into the pattern and explore it and it changed it was really cool.  I also started shivering at this time and got really cold.  Also we had a dog with us and I would occasionally hear him panting right next to my ear but he was never there.  The others left and it seemed like they had been gone for a while before I got really cold and wanted to go back to the fire.  Once I got up to walk I noticed how heavy I was.  It was like gravity was amplified. At the fire I continued looking around, and enjoying the show.  I also laid sideways in my chair thinking gravity was holding me down.  </p><p>One of the things that amazed me was the fire was normal I could see some colored lines in it but the fire never actually did anything cool which I expected.  The trees were all leaning in around me and just looking around in the woods was really amazing.  After hanging out a while more I decided to sleep.  I was still tripping hard and sleeping was impossible. My mind would change subjects every second and closing my eyes produced kaleidoscope type pictures and cartoon type images.  Staring at the side of the tent produced colorful cool images.  But I really wanted to sleep.  I drifted in and out of crazy sleep not really remembering a lot of it.  Finally I noticed it was light outside it was 6:45am.  I still felt some of the effects but it was mostly over.</p><p>The whole day after was a day full of classes I was tired and head a headache all day dont know if this is from the shrooms or the lack of sleep.  I also looked at everything a little differently.  A lot of art makes a lot more sense now. </p><p>One of the things that tripping made me realize was how the system has been lying to us.  Sure some drugs are bad and I fear going near them and I know they can fuck up my life.  But drugs like this are a great experience.  And this probably is a 'gateway drug I think any drug is because it opens my mind up to the lies I have been told my whole life.  Now Im looking into doing some harder drugs like mescaline.  I am educating myself and learning all about it.  What I really yearn is what I yearned from the beginning, an experience that makes me question what is real and what is not.</p>"
}
