{
 "title": "Surprise!",
 "author": "Murple",
 "citation": "   Murple. \"Surprise!: experience with DOM or DOB (sold as Ecstasy) (ID 2357)\". Erowid.org. Sep 10, 2000. erowid.org/exp/2357",
 "substance": "DOM or DOB (sold as Ecstasy)",
 "bodyweight": "170 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 1996",
   "ID: 2357",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 7690",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There are some 'Ecstasy' tablets circulating in the DC area right now [1996] that are definitely NOT ecstasy. The pills are white with a line scored on one side, and a large E imprinted on the other side. Some people are selling them as E that has been cut with mescaline.</p><p>This stuff is not MDMA. What it is, I'm really not sure. I've taken LSD hundreds of times, this is not LSD, nor is it mescaline. My guess would be that its some kind of phenethylamine psychedelic.</p><p>I took it at around 1am last night, expecting a nice mellow ecstasy trip. Around 1:30 I began feeling preliminary effects, and by 1:45 was aware that it wasnt E I was dealing with. I vomited once sometime between 1:45 and 2, after a brief period of nausea. I didn't feel nausea after that at all, although it did seem to cause an upset stomach. The psychedelic effects</p><p>of this stuff were very intense, and I still feel them quite strongly now at 11:45am. Whatever this stuff is its:</p><p>* Not MDMA</p><p>* Definitely a psychedelic, probably a phenethylamine</p><p>* Very intense</p><p>* Very long lasting</p><p>I'll definitely be hitting the books when I return to a normal state of mind to try and figure out what this stuff was. DOM maybe?</p><p>If anyone else has experienced this stuff, let me know if you have any idea what the fuck it was. If you run into this stuff, don't buy it if youre looking for ecstasy, although you might want to get it if you want to try some real heavy duty tripping.</p><p>Follow-Up:</p><p>----------</p><p>I ended up tripping for over 24 hours, with residual effects lasting through the next day as well. Looking back now with much more experience with phenethylamines under my belt, I can say without a doubt that this was indeed a long acting phenethylamine, probably DOM or DOB, and at a fairly high dose. A while after I vomited, the effects became very strong, and I experienced total ego loss for perhaps 3 hours. I sat down in a yoga position on my bedroom floor in the dark, and began noticing intense visuals. The next thing I was aware of, I found myself suddenly existing again, sitting in the same position, eyes open, and looked at the clock and it was 3 hours later. I have no memory at all of the time in between, nor do I have a feeling of any missed time. I simply did not exist for a while. Despite how it may sound from my original report, there were some positive aspects to the trip. Had I gotten this material knowingly, it might have been a rewarding experience. The shock of it not being MDMA and not knowing what I'd taken was the biggest negative.</p>"
}
