{
 "title": "Finding Purpose",
 "author": "Murple",
 "citation": "   Murple. \"Finding Purpose: experience with 5-MeO-DMT (ID 2361)\". Erowid.org. Sep 8, 2000. erowid.org/exp/2361",
 "substance": "5-MeO-DMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1997",
   "ID: 2361",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 8, 2000",
   "Views: 7760",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nTonight I think I found the answer to part of the question that last night's trip ('Horrifying') so forcefully put to me.</p><p>B, C and T came by and we decided to smoke some 5-MeO-DMT. C had already tried it and T was unsure, so B went first. She got the first, biggest hit, and after taking it smiled and closed her eyes for the journey. C went next, and reacted the same. I readied another hit and asked T if she wanted  to try it, and she changer her mind again and said yes. I took one myself right after her. I was just about to take off when T began to panic. She said she was scared and couldn't breathe, and thought she was dying. I remembered last night's hellride, and empathized. I put my hand on her knee and said 'You're OK, try to breathe evenly.' She grabbed my hand and wouldn't let go. I got behind her on the bed to hold her up and kept trying to reassure her. She kept saying how afraid she was, and looked and sounded like a frightened child. </p><p>All the while I was peaking myself. She became the focal point of my universe, my whole existence was to try to comfort her. My body, such as I was aware of it, fused with hers, and my mind existed only to anchor this frightened being I'd merged with. It was as if I'd dissolved myself into a spiritual shield around her. As I began to reintegrate, I knew I'd found purpose. Friendship, love, sharing. As our peaks wore off, we all just laid on my bed talking about the experience. It was a beautiful thing. The sound of the wind and someone's windchimes through my window was tangible. After a while, T and I walked up to the supermarket. The night was cool and crisp, the stars bright, the air clean. Life is good.</p>"
}
