{
 "title": "Doing Justice",
 "author": "Ezcz",
 "citation": "   Ezcz. \"Doing Justice: experience with 5-MeO-DiPT (ID 23675)\". Erowid.org. Jul 25, 2006. erowid.org/exp/23675",
 "substance": "5-MeO-DiPT",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23675",
   "Male",
   " ",
   "Not Given",
   "Jul 25, 2006",
   "Views: 4048",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Experiences 1 and 2: I took 10 mg both times, and smoked some cannabis with it, but not much. I found my mind very clouded, and I do not recall most of the experience, except that it was pleasant. At one point I attempted to make a bracelet with colored beads, and spent 2 hours planning what I conceived to be the greatest and most beautiful pattern ever. The next day I realized that there was no such pattern to be found at all in the bracelet. This belies either distinct open eye color distortions, or an interesting limitation in cognitive abilities associated with 5-Meo-DiPT.</p><p>Experiences 3: I took 20mg. I felt a light high in my head within 15 minutes, but after that the coming up was very gradual. At about 45 minutes I began to shake mildly with the body high, and got more giddy. At this point I tried to do some Tai Chi to relax me, but found it too difficult. Slowly to about an hour and a half the body high became so intense that I was shaking too much to stand. This was less unpleasant than inconvenient. I was unable to hold my laptop, nor could I operate my CD player with any luck. All I could get was an AM mariachi station (conveniently I love mariachi and was entertained by it). I found the music comforting, but by no means hallucinogenicly exceptional. Eventually I threw up, but only briefly and just barely unpleasantly, and then continued to lie in bed for what I though to be 4-6 hours. At this point I reasoned that I had taken too much and been overwhelmed by the physical aspect, and that being way past my peak I could calmly wait it out. I then looked at the clock and realized I had taken it only 1 hour and 45 minutes earlier, and was likely to just be hitting my peak. So I reasoned that it was absurd to be lying there, and forced myself up to roll a joint (I am still amazed that I was able to).</p><p>Immediately following my first hit, I was calmer and the nausea had disappeared. As I smoked that joint, which was very very small, I became more relaxed physically, more excited emotionally and very happy, and my open eye visuals became very intense. I switched the radio to a big band jazz/old lounge singer station, and I absolutely loved it. The visual experience was akin to a very strong psilocybin mushroom trip, both open and closed eyed, and the music was similarly mind blowing. I spent the next 6 hours having a wonderful time that completely made up for the body high I had experienced earlier. One of the most distinct aspects of the trip was time dialation: it seemed to last at least 16 hours, though at no point did I feel slow. I was able to sleep just fine afterwards, and had no digestive problems.</p><p>Experience 4: I took 20 mg, but this time instead of waiting to hit my peak before smoking, I had a friend come over. He had one of the largest joints I have ever seen, which he had laced with the oil of 3 marinol pills. Apparently I smoked half of this joint in two hits (I find that my smoking capacities are abnormally large when on hallucinogens). Needless to say, I got very high. Though I had wanted to be awake and sociable, I just had to lie down and let it take over. I laid there for several hours, with a most pleasant body high, shroomily enjoying my music, watching a brilliant closed eye cartoon. At no point did I have the unpleasant body high I had had the previous time. This time though I was unable to sleep until about 8 hours after dropping. Once again the time dilation was extreme.</p><p>I shall now relate my friends' various experiences: </p><p>1. (On 10 mg): One friend completely relived a past experience (his first time driving after he got his license). He sat for two hours at a party with his hands at 10 and 2, working the pedals, shifting occasionally, and making car noises. He was most entertained. He then proceeded to have a orgasm (complete with ejaculation) from a Krispy Kreme donut, and then danced in a manner I have never seen before nor since. He had not taken any other drugs that evening.</p><p>2. (On 10 mg): Had what would be called a standard foxy trip, until about t+ 4 hours, at which point we left the party and went outside. He described what he saw: Los Angeles had become a fantastic, mythological, cartoon city. Though he is an experienced hallucinogen user, he claims to this day those were his strongest visuals ever. He had not taken any other drugs that evening.</p><p>3. (On 10 mg): Had an experience almost identical to MDMA. He described the same emotional opening, enjoyment of music, and wonderful body high. It lasted for about 8 hours, and then he could not sleep for another 20 hours. He had not taken any other drugs that evening. He also experienced time dialation. </p><p>Next to LSD, 5-MeO-DiPT is the most diverse compound I have come in contact with.</p>"
}
