{
 "title": "Great Morning Glory",
 "author": "Luke",
 "citation": "   Luke. \"Great Morning Glory: experience with Heavenly Blue Morning Glory seeds (ID 23689)\". Erowid.org. May 28, 2003. erowid.org/exp/23689",
 "substance": "Heavenly Blue Morning Glory seeds",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 oz",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23689",
   "Male",
   " ",
   "Not Given",
   "May 28, 2003",
   "Views: 8864",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>  I have been anxious to experience a Morning Glory Trip since I have learned about the significance of the LSA on the web, which has been for about three months now.</p><p>After ordering two ounces of seeds from an online store, I anxiously grinded up the complete volume with a pepper grinder and into a rubber container.  Afterwards, being too eager to wait to try the ether method of extraction and being minus a car to get to the store for lighter fluid, I poured the crushed seed-powder into a jar and then added 22 ounces of 101 Proof Whiskey.</p><p>I let the mixture sit, shaking it briefly, for 24 hours.  Then I got a coffee filter that I poured the mixture through into another jar.  Once I was left with all of the crushed seeds on the coffee filter, I placed it back into the original jar to save for another attempt of extraction.</p><p>Now, the preperation was ready for consumption.  I got a funnel and poured the ready jar into a suitable drinking bottle and mixed half of the preperation with coffee.</p><p>  I approached the experience with the humbled respect of an intrigued learner that is greatly fascinated with the enhancement of awareness.  It was four o'clock in the afternoon when I began to drink this magic elixer.</p><p>  After walking through trails and through fieds while listening to my Walkman for about an hour, I managed to finish 1/8 of the elixer.  Unfortunatly, I threw up.  </p><p>  But, without being discouraged that easily, that made it easy to quickly consume the rest of the whole thing.  </p><p>  Whenever I finished the bottle, it felt like I was on fire inside my stomach.  This was a result of the quick consumption of whiskey.  Then, I walked down a short trail overlooking a factory and a great portion of the city nearbye.  By this time I definatly knew that just on this short walk down the trail, My entire process of thought and vision have completly been altered.  I sat on a couple of concrete blocks on the side of this hill and I felt like I was a bird, my vision able to see into everything I looked at with great clarity.  My senses were all enhanced.  I could feel my surroundings like an animal, noticing things in the world that they must notice and am completely unaware of normally.</p><p>  Colors were brighter, pupils in the eyes much larger.  Perception of time was much different probably because everything was so much more interesting.  My body felt gummy like a stretched rubber band-the same bodily sensation experienced on LSD.  I was involved with the world in such a way that my advanced animal perceptions made me feel godlike and perfect.  Lines patterned my visual field.</p><p>  My journey began at four o'clock and it began to get dark outside.  I made my way back towards home and lied down on my back in a field.  Suddenly I heard a deer in the bushes next to me, grunting and breathing.  I was amazed at how close to this animal I was and I reasoned that my bodily movements must have been naturally undisturbing to the deer, giving me a feeling of oneness with Nature.</p><p>  Not wanting to yet return home, yet feeling exhausted from both physical and mental excercise, I looked at the time on my watch which was ten o'clock.  I had my headphones off for a while and thought that I would look at the sky and listen to a C.D..</p><p>  I put in a favorite C.D. and lied on my back looking at the moon.  The </p><p>clouds made beautiful designs moving across the sky.  Initially intending to only listen to a couple of songs, the C.D. was so interesting and sounded so unusually wonderful that I ended up listening to the entire album.</p><p>  It was about twelve o'clock and I felt like it would be a proper time to return home because I thought there might be a good movie on television.  I was hungry too.</p><p>  I enjoyed the journey until three o'clock in the morning, wanting to get everything out of the experience I could before falling asleep.  The entire trip lasted about eleven hours, until I slept.</p><p>  In conclusion, the trip was identical to LSD.  The only difference was that it was more gentle.  No doubt that if more Morning Glory would be consumed that this could be an understatement.  My senses woken up and I explored all of their features.  It was a travel into enhancement of human potential.  Completly rewarding.  Altogether a wonderful experience.  I plan to explore this fascinating discovery further.</p>"
}
