{
 "title": "Fucked Up in Front of the Police",
 "author": "cookingwine82",
 "citation": "Citation:   cookingwine82. \"Fucked Up in Front of the Police: experience with Ecstasy & Cannabis (ID 23695)\". Erowid.org. May 13, 2003. erowid.org/exp/23695",
 "substance": "Ecstasy & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 23695",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 13, 2003",
   "Views: 30619",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was my freshman year of college.  I had recently just gotten into a new scene or doing drugs.  My personal favorite drug at the time (and to this day) was extascy.  I had been doing it pretty frequently because my boyfriend at the time could get ahold of it, whenever he wanted.  So at around 9 pm we drop the pills.  We were all really prepared for it, ate a light dinner and excited cause they were a new batch of pills and none of us had had them before.  Then..we waited..played some cards...watched tv..and smoked some weed. it seemed like forever, but after the bowl they started taking effect around 9:45.  They were very very very very smacky pills with some good MDMA in them.  So we were all rolling our asses off in my dorm room.  Then some friends of ours left to go smoke a cig outside, cause you can't smoke inside the dorms.  so it was me, a friend and my boyfriend at the time in my dorm room listening to techno music and rolling very very very hard.  We heard a knock, and assuming it was our friends and because we weren't really thinking, we just opened the door. \r\nAnd to my shock, there was 3 police officers standing in front of my door..not my friends.  I had no shirt on because i was hot and was just in jeans and a bra.  my boyfriend had a nook in his mouth and my other friend was just spacing out on the blacklght.  I didn't believe it at first.  I looked down, then looked back up again. Yup.  Still cops there, i'm not hallcinating.  I hear 'is everyone decent in here?' and of course, i had no shirt on.  so i threw on a sweater that was inside out and  backwards. they asked who was responsible for the room.  I just said 'I am.' and by this point we had turned off the techno and blacklights and had the lights on. They say that there was some funny smells coming from outside my room and asked to search the room cause they assumed we were smoking weed in the room.  We hadn't and i never had previously to this. us, all freaking out just let them in the room.  \r\nI remember talking to them but not exactly what was said.  i remember being able to bring myself down for awhile cause i was talking to police.  I remember glancing into the mirror while one was talking to me..and seeing my eyes..dilated as shit.  they search the room and little to my knowledge we had 10 pills stashed in the room, a bag of weed in my friends purse and an open beer in the fridge.  they didn't find anything, somehow. They apologized, told me to 'go back to doing whatever i was doing'..then i realized..it probably looked like we were having a threesome in my room..cause when they walked in it looked..bad.  This was the most scary run in I ever had with the police.  i figured that we were going to jail for sure for just being on drugs.  thank god nothing bad happend to me or my friends, but after they left we sat there perplexed for about 10 minutes thinking 'WHAT THE FUCK JUST HAPPENED?'..we then went out on a drive and smoked a bowl and we were all really fucked up again.  \r\nMy advice to anyone reading this is don't freak out in front of the police if your on drugs..you can bring yourself down off of e.  Just make sure you don't have shit on you if your on drugs and in front of cops...it makes for a scary experiance.\n\n\n"
}