{
 "title": "My Foul Temptress",
 "author": "Jay",
 "citation": "   Jay. \"My Foul Temptress: experience with Heroin (ID 23690)\". Erowid.org. Dec 12, 2005. erowid.org/exp/23690",
 "substance": "Heroin",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Heroin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23690",
   "Male",
   " ",
   "Not Given",
   "Dec 12, 2005",
   "9668",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It started with the prescription drugs... oxy/hydrocodone, morphine, and later Oxycontin.  I started using heroin just a few years ago, but never shot it until just a few months ago.  It was a decision I'll regret to my dying day, which I'm convinced will be somehow associated with the drug.  My girlfriend and I had beed using it recreationally for a month or so, but she decided to stop out of feelings of guilt.  I should have stopped with her.  Instead, I continued using for a while, until guilt caught up with me too -- but by then it was too late.  I managed to stop, but only for a few days -- I was so dopesick I was in danger of losing my job, and was basically forced to buy another bag.  Well, I lost the job anyway, and started shooting just a couple days later.  My first experience was a poor one, but I decided to give it another go.  What a mistake.  I already knew how to prepare a shot, thanks to movies like Drugstore Cowboy and Requiem for a Dream, so I bummed a syringe from my dealer, bought a bundle and set to work making myself into a junkie.  </p><p>The stuff was good -- real clean, dissolved into the spoon the instant the tiny, hairline jet of water hit it from the needle.  I dropped in a miniscule bit of cotton and sucked the fluid through it into the resevoir of the syringe, marveling over how clear it was.  I was hooked before the needle even hit my skin.  Tying off with a belt, I strangely thought of my mother...  The needle found my vein effortlessly, and i drew back, watching the crimson mushroom cloud travel through the cylinder of brown fluid.  I pushed.  As soon as i removed the belt, i could feel a sweet, relaxed sensation travel outward from my chest over my entire body.  I shuddered with virtually orgasmic ecstasy, dropping the spent syringe on my desk.  A quick swab of alcohol over my arm, and i washed out my syringe a half dozen or so times.  I was definitely going to use it again, and use it again I did.  </p><p>It just feels to good to let go.  Now, months and thousands of dollars later, I still cant see myself quitting -- I love it too much.  Every aspect, from the score to the prep to the high, it's my dirty little secret and it keeps me alive... gives me a reason to go to work every day, gives me a reason to BE.  But it's killing me, I know this all too well.  It used to be a couple bags, now its six, it used to be once a day, now its every three hours, and my arms look like shit.  Still, I cant imagine life without it, and that scares me more than death itself...  never pick up a needle.</p>"
}
