{
 "title": "Addicted to the Stuff",
 "author": "PharmPhiend",
 "citation": "   PharmPhiend. \"Addicted to the Stuff: experience with Dimenhydrinate (ID 23735)\". Erowid.org. Aug 8, 2005. erowid.org/exp/23735",
 "substance": "Dimenhydrinate",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23735",
   "Male",
   " ",
   "Not Given",
   "Aug 8, 2005",
   "Views: 14161",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This whole thing started off in about September.  I was a big fan of marijuana and alcohol, seeing as these were the only drugs I had ever done.  I'd only been smoking for about four months.  One day, a kid told me about dramamine.  This would be the start of my addiction.</p><p>My first trip seemed pretty fun.  I had about eight dramamine.  I saw some neat things, such as moving jelly on the walls, a pile of jelly in the corner of the room.  I was walking my dog and talking to a friend, who disappeared.  General stuff like that.  It was a good experience overall.  By the end of that day, the effect had mostly wore off.  I decided to take 12 pills before I was planning on going to bed.  Falling asleep was my first major mistake.  I went on an unconcious 'Dram rampage' in the middle of the night, and broke some stuff in my house.  Lucky for me, my mom thought I was sleepwalking.</p><p>I wasn't so lucky the next time.  I bought some store-brand allergy pills from a drug store.  I was spending the night at a friend's house.  I decided to take 12 of them.  I didn't feel anything for 2 or 3 hours, so I took 12 more.  An hour later, I was just getting slightly tired.  My stupid self decided to take 12 more.  This brings the grand total up to 36.  I was barely feeling anything, I was seeing just mild stuff on the walls.  Next thing I know I'm standing in my friend's hallway while his dad is yelling at me.  I remember walking into my friends room and just going to sleep on the bed.  Evidently, I was looking for my clothes in my friend's sister's room, and I also tried to steal his parents' blanket.  Messed up.</p><p>I still didn't learn my lesson.  I had some fairly good trips over time.  I started to do it once a week, twice a week, about five times a week.  I'd be on it at school, I'd be on it everywhere.  I did the stuff so many times, that it wouldn't even effect me anymore. Anyways, I kept taking the stuff almost every day for about 3 months straight.  I was becoming the biggest wreck ever.  My grades sucked because I wouldn't remember anything that I did in school.  I took tests on the stuff.  It was hard, seeing as how the writing kept turning into cyrillic and jumping around the page. I still kept taking it.  I saw no reason to stop.  It was tearing me apart.  I didn't stop.</p><p>After a couple trips to the hospital, I decided to go back to mary jane. Now that I think about it, the stuff may still be messing with me.  I can look at walls and they have strange shimmering going about them, and I'll look at something with a pattern and it will be moving all over.  I get really itchy sometimes.  It feels like there are spiders or something crawling all over me.  I'll reach into my shirt to scratch my back or something, and I'll swear I'll touch something that's running around on my back.  I'll try to grab it, but it always is out of reach, and always gets away.  I still see things 'jumping' out of the corner of my eyes.  I'll look at trees or plants and a leaf will do some abonormal jiggling every once in a while.</p><p>I tried doing some sleeping pills (DPH) about two to three months ago.  I didn't really see anything.  All I did was get itchy and tired.  I had a few decent moments where I'd be sitting around, thinking I was playing tetris or something, but it wasn't anything special.</p><p>I've tried Meclizine a few times, but I don't recall anything happening from it.</p><p>I just have a few warnings:</p><p>1.  Be careful!  Have a trip-sitter.  This is the most important thing to do!  I can not stress this enough.  This could be deadly without a trip sitter!  'I don't even know what's real and what's fake anymore' is a good quote to sum it up.  </p><p>2.  Do not fall asleep!  This is the second biggest mistake.  Unconscious Dram-rampages are very shady!  It's like sleepwalking except a hundred times worse!</p><p>3.  Do not do any of these things if there is something important to do, such as go to school, drive, walk, talk, and breathe.  Seriously though, it was near impossible to do anything.  I was simply too tired.  Plus, I was tripping out and forgetting everything every two seconds.</p><p>This is all I have to offer.  All of this is based off personal experience.  Amazingly, after all the crap I have been through with this, I still feel like eating about twelve sleeping pills.  I still think maybe I'll trip out, and have a good time.  I think maybe I won't just get very itchy.  I think maybe I'll do some of these again soon.  I'm not lying - I actually want to, and I probably will very soon.</p>"
}
