{
 "title": "Smoking a Woo b=Before a Final Exam",
 "author": "Weedwulf",
 "citation": "   Weedwulf. \"Smoking a Woo b=Before a Final Exam: experience with Cannabis & Cocaine (ID 23746)\". Erowid.org. May 14, 2003. erowid.org/exp/23746",
 "substance": "Cannabis & Cocaine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  joints/cigs",
   "smoked",
   "Cannabis",
   " ",
   "  joints/cigs",
   "smoked",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23746",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 14, 2003",
   "Views: 40635",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy old friend Dpak and my boyfriend Roque came by for a visit and brought some coke that his friend had given him. I had seen Dpak two weeks earlier and smoked up with him, but prior to that I hadn't seen him for over a year. I think getting high is a great way to have a reunion because it relaxes any tensions there are when seeing someone that I am no longer quite as comfortable being around.<br>We rolled a blunt with about 2 grams of weed in it, and then sprinkled the equivalent of a couple lines into it and smoked it. This was my first experience with cocaine of any kind. I could definitely taste it in the smoke, and it made my lips and teeth numb. I've been smoking marijuana several times a week for about 9 months now, and before that it was several times a month for about a year. My point being that when I smoke, unless its chronic or really really good shit, I don't get really high. I get relaxed and chill, but not head vibrating high. Anyway, the coke in the blunt helped me reach that level.<br>I also had a final about 3 hours later which I hadn't started studying for, so I did two lines and went off to learn. I read pretty much all of the material I needed to know for the entire final twice within an hour and when I went to the final I was able to recall everything I had read and finished the test in about 25 minutes (out of an allowed 110 minutes). The cocaine helped me out. I see a dangerous pattern that could develop from this, and I don't ever want to rely on drugs to perform any sort of task because thats how addiction starts the easiest. I've done well on finals since without any drugs...although I did smoke a blunt with shrooms in it the day before my last final... (p.s. don't smoke shrooms, it killed my throat for days).<br>I realize I took a small dose, but it was still fun, my nose got numb, i felt and tasted the drip, and i definitely got the focused/alert high cocaine is famous for. Smoking it with the weed helped it last a bit longer than it usually would have I think.<br>Positive experience all around, great way to kick a weed high up to the next level, but I will not do cocaine again for at least 6 months. If I got addicted I would be thoroughly dismayed...\n\n\n"
}
