{
 "title": "Misused or Confused Use?",
 "author": "Jasper",
 "citation": "   Jasper. \"Misused or Confused Use?: experience with Salvia Divinorum Extract 17x (ID 23779)\". Erowid.org. Dec 11, 2006. erowid.org/exp/23779",
 "substance": "Salvia Divinorum Extract 17x",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23779",
   "Male",
   " ",
   "Not Given",
   "Dec 11, 2006",
   "3296",
   " "
  ]
 ],
 "report": "<p>My entheogen of choice is psylocybe shruumz. I chose these over drugs because of the personal insight they have brought to my life time and time again. I heard from a local stoner friend of mine that there's 'this shit, maaan, it's not even weed, but you smoke it and it's like shrooms for ten minutes, dude! it's tight as hell!', so, I jump online to check it out, and sure enough, this 'teacher plant' called salvia divinorum is a seemingly benign, yet mindblowing experience. The intensity I'd read about was what was most appealing to me, especially because my budget is a bit tight for 30 dollar trips all the time (broke as a joke!!).</p><p>This friend of mine took me to a smoke shop where we purchased 2 g's of 17x extract at homey prices ($20 total, suckers!), and verily trotted home with our new, herbal, legal purchase. I put on Led Zepplin's 'No Quarter' (my favorite trippin song) and sat on my buddie's majical leather couch I'd spent many a stoned assed night on. I dropped a small snap of the sweetest jeeba into the bowl to cover the hole so we didn't lose any sally. I packed an unreasonably huge bowl, and let out all of my breath. i was going to enjoy this... OR ELSE.</p><p>I held the lighter over the bowl the entire time, noting that salvinorin vaprizes at a higher temperature than THC. I milked the bowl, snapped it, and held that motha in. My buddies (sitters) packed bowl dos for me, and i snapped it down the hatch like a pro. Now, i've taken my share of bongrips in my day, and i've been knocked on my ass once or twice by some fine sensimillia, but Sally D. is not to be tampered with lightly (at least not for me, damn). </p><p>I woke up, from some sort of void, a detatched body vs. self world of absolute nothing (or everything with it's back to me). I had no idea when I was there, I only became aware that I had just been there. Years or milliseconds, I have no idea how long i resided there. it was cold, unfeeling, and not willing to speak to me. I woke up to complete consciousness, with no visual trip. Then, one of my friends asked the unthinkable question : 'ARE YOU TRIPPING, DUDE?' and started laughing. I must have had a look on my face, because when i turned to my other friend, he looked cornered and scared, like i was going to explode or kill him or something. I was just looking for help, but i could not speak.</p><p>A wall resembling a sixties fold out garage door stood ten feet away. Led Zep was pounding my brain like ten songs at once, a juggernaut of intensity. The wall spoke. It was definitely female. WHERE? it asked, but not in the gentle, comforting tone of the mushrooms i had come to love. WHERE ARE YOUR PRESCIOUS MUSHROOMS NOW, JASPER??? (my dog's name is jasper, and has since become my alias, but it was very strange at the time to be regarded as such) WHERE ARE THEY TO PROTECT YOU? and it started jabbing me in the face. it poked me and taunted me and knocked me with inescapable bodily pain. when i moved my eyes, it felt as though they were holding the trip where it was, projecting a physical entity, and therefore felt incredibly heavy to move even to look at the bong on the table in front of me. It hurt. I've never had a bad trip off shrooms, but i can definitely describe this as a difficult entheogenic experience. I got up in a 'dissociated state' and made my way to the bathroom to do what I always do when shit gets rough. I took a piss. As soon as I opened the door to leave the room where I smoked the stuff, it was all over, and I just felt stoned as I'd been. My body felt very prickly and unsettled for a bit, but at least the pain in my face went away. </p><p>Simply because this was a frustrating experience, I bought an ounce of pure dried leaves (thank you, sweet internet) and proceeded to try again. I found myself with the same results on a mellower level, and simply refuse to go back to smoking the stuff. I'm interested in the quid method, but cant seem to find fresh leaves, so I must wait. I'm not one to delude myself (i hope), but the only logical conclusion i can make is that magic mushies (and possibly amanitas) are meant to send me a message that i haven't decoded thus far, and shouldn't be dabbling in other lessons from other teachers quite yet, much like reading two books at once. I'll be Back with a quid story when i've benn there and back. Moral of the story: Intense is not necessarily good. More is not neccessarily better. know your substance, tolerance, reaction, and dosage. every time.</p><p>HAPPY TRIPPIN'~80~~~</p>"
}
