{
 "title": "True Self",
 "author": "Jamie T.",
 "citation": "   Jamie T.. \"True Self: experience with AMT (ID 23803)\". Erowid.org. Apr 10, 2006. erowid.org/exp/23803",
 "substance": "AMT",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   " ",
   "Pharmaceuticals",
   "  T+ 0:00",
   "40 mg",
   "oral",
   "AMT",
   "  T+ 12:00",
   "2 hits",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23803",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2006",
   "Views: 13965",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>T- 5:00  50mg oral Spironolactone</p><p>T- 5:00   2mg sublingual Estradiol</p><p>T+ 0:00  40mg oral AMT HCl</p><p>T+ 7:00  50mg oral Spironolactone</p><p>T+12:00  marijuana (2 hits)</p><p>This was my first experience with AMT.  I am a male to female transsexual in the process of transitioning genders, the Spironolactone is an androgen blocker and the Estradiol is used for hormone replacement therapy.  It's unlikely that they affected the experience in any substantial way, but I included them for completeness.</p><p>My primary use of psychedelics has been to help break down mental barriers that have existed since my childhood.  I recognized my bodily dysphoria by the time I was four years old, and many of the years after that were filled with pain.  It is very difficult to convey the magnitude of my wrenching misalignment with how the world perceived me, but it has been a pervading force in my life for as long as I can remember.  In the end, my choices were to transition or to give up living.  This is not a journey that anyone makes when there is another rational choice.</p><p>The AMT HCl was dissolved in distilled water and taken in one dose. I had had a light snack roughly 2 hours before.</p><p>T+0:30 - The first effects noticed were a general body 'speedyness' and a vague feeling of disconnection with reality.  My 'alert' came at this point, which usually manifests itself as an internal shift in depth perception.</p><p>T+1:00 - Beginning of nausea.  It's not severe if I just let the feelings flow over and through me instead of trying to clench.  I go to the piano and start banging out Chopin and Debussy with great enthusiasm.  Focusing on the music helps to avoid the nausea, and I can just let the sensation flow through me.  Many inhibitions about my playing competence seem to be fading away and I find myself more technically adept than I have been in years, though I can sense a physical clumsiness and body load from the AMT.</p><p>T+1:30 - Start of visual effects.  There is flowing, especially in wood grain.  Closing my eyes reveals fractal-like patterns of blue, red and green.  If I focus hard on my music then I can float away in pure aural sensation, but if I stop then the nausea starts to return, along with some nystagmus.</p><p>T+2:00 - Nausea has faded.  I get up to look in a mirror.</p><p>I have a great deal of difficulty conveying exactly what this meant to me.  It's said that some people, on psychedelics, see a reflection of how they see themselves internally.  Usually they find more youth and beauty in themselves then they consciously allowed themselves to feel.  Physically, to most people, I look like a 28 year old male.</p><p>I saw a beautiful, confident, artistic woman.  My soul, on the inside.  At that moment I heard a whisper inside my mind, 'I walk in grace'.  I saw the power and the strength within me that I could draw on in the hardest moments of my life, and as I leapt back to the piano my laughter pealed like golden bells.  I started playing as I had not let myself in years, thundering through Bach, Czerny, Liszt, Mendelsohn and Fats Waller.  The house is alive with music and as I close my eyes, I see sprays of color firing through my mind in time to the music.  An E-flat chord was a spray of royal blue, and a D-seventh was a wall of gold sparkles.</p><p>T+8:00 - It is now midnight, and the trip is still going.  It seems both eternal and slipping away rapidly at the same time.  The visuals are less intense, but the internal feeling of peace and self-knowledge persists.  I dance through the house, feeling connected with myself in a way that I have not been for decades.  I know who I truly am, and nobody in the world can take that away from me.</p><p>T+12:00 - 4AM, and things are finally winding down.  There is less sparkle with my eyes closed, and though I still have an overwhelming sense of self-knowledge, I feel that winding down and getting some rest would be a good move.  I take 2 hits of moderately good marijuana (I'm not really a big fan, though my housemates are) in the hopes of drifting off, but I get no effect.  Zip, zero, nada.  I resign myself to coasting for another couple of hours before I can sleep.</p><p>T+15:00 - Effects have faded, and I sleep soundly.  I wake up after only five hours, but feel very refreshed.</p><p>I do plan on trying AMT again, though the need to block out so much time makes it tough to schedule around.  It was definitely one of the more profound psychedelic experiences it has been my pleasure to experience, and the self-knowledge and understanding I gained has persisted.</p>"
}
