{
 "title": "An Even Synergy",
 "author": "Murple",
 "citation": "   Murple. \"An Even Synergy: experience with Propoxyphene & Cannabis (ID 2381)\". Erowid.org. Oct 7, 2001. erowid.org/exp/2381",
 "substance": "Propoxyphene & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)",
   "  T+ 2:10",
   "1 hit",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "1999",
   "2381",
   "Male",
   " ",
   "Not Given",
   "Oct 7, 2001",
   "Views: 43221",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n12:50AM</p><p>-------</p><p>        OK, so its actually the 18th now. So what. I haven't gone to sleep</p><p>yet, so its the 17th as far as I'm concerned. Anyway...</p><p>        I have 2.5 tablets of Propacet, each containing 50mg of </p><p>dextropropoxyphene. They're the last of a batch of 8 of them that I was</p><p>given. I ingest all of them. I had smoked a little cannabis earlier, still</p><p>feel a lingering effect, but am close to baseline.</p><p>1:09AM</p><p>------</p><p>        I begin to feel a hint of opiate feel kicking in. I also seem to</p><p>be feeling random itches all over my body, but they are easy to ignore.</p><p>This is a typical opiate alert for me. I feel slightly warm, a little</p><p>'floaty,' and real calm. Not much else yet. Narcotics seem to take a long</p><p>time to take effect orally.</p><p>1:21AM</p><p>------</p><p>        The itching passed several minutes ago. But other than that, there</p><p>has been no change. I almost even feel closer to baseline than at my last</p><p>check-in. I'm yawning a little now though.</p><p>1:45AM</p><p>------</p><p>        Well, I definitely feel 'something' - basically the same as I have</p><p>been feeling, but its moved up a level of intensity. Its tempting at this</p><p>point to smoke some cannabis to bring on the effects. I'm holding off</p><p>though, so I can get a good description of an unclouded dextropropoxyphene</p><p>experience. But damn... this slow come on time is a negative in my</p><p>opinion. I would hate to have to wait this long if I were using it for</p><p>pain relief!</p><p>2:10AM</p><p>------</p><p>        T+1:20 and it still hasn't really kicked in yet. This is taking an</p><p>unusually long time. I haven't eatin in 11 hours or so, so my stomach</p><p>wasn't full. I feel slightly more than I did at last check-in. Same</p><p>effects again, just a little stronger. A kind of warm tingly sensation</p><p>diffused throughout my upper body and somewhat in my legs. A feeling of</p><p>calmness. Somewhat quieted thought processes. But I'm not yet feeling the</p><p>euphoria or the 'buzz' yet.</p><p>2:15AM</p><p>------</p><p>        As I typed that last paragraph, things did jump up a level. The</p><p>body tingles increased alot, and spread all over my body. There is some</p><p>tinnitus in my ears now. Every now and then I get random itches, which has</p><p>been going on since I felt the first hint of effects. I'm developing a</p><p>decent 'buzz' and some euphoric sensations now as well. </p><p>2:30AM</p><p>------</p><p>        Things still seem to be building, but I'm at a pretty decent level</p><p>now. I feel typical opiate effects, though sort of mild. As I said,</p><p>narcotics are very different from other CNS depressants. Its hard to</p><p>compare this high to something like GHB or alcohol.</p><p>        I feel a little warm, its a pleasant warmth. My body feels a sort</p><p>of tingly, floaty sensation. I feel much lighter than usual. I don't feel</p><p>like moving around at all. I tried to lay down, though, and that wasn't</p><p>noticably more comfortable than sitting in my computer chair or standing.</p><p>It doesn't seem to matter what position I'm in, I'm equally comfortable.</p><p>Its a comfortableness that seems to come primarily from not caring about</p><p>things that might normally make me uncomfortable. My thought processes are</p><p>slow... I'm a verbal thinker, and the voice in my mind is much quieter</p><p>than normal. Its not that thought is impaired, I *can* think if I want</p><p>to... it just seems nicer to not think though. Opiates are a very</p><p>detatched high. You just want to float around feeling calm, not doing or</p><p>thinking. Its not that you feel unusually happy - you just feel mentally</p><p>relaxed and physically good. Personally I find it sort of boring, but I</p><p>can see how this state would appeal to alot of people, especially those</p><p>with escapist tendencies. Music is slightly enhanced. Orbital's 'Halcyon</p><p>On & On' sounds prettier than usual, and goes well with the floaty</p><p>sensations. Other minor effects... I have dry mouth, but its different</p><p>than cannabis 'cottonmouth.' I was pretty hungry before I took the pills.</p><p>The hunger vanished within a half hour or 45 minutes or so and hasn't</p><p>returned. The itching is still somewhat there, but its so easy to ignore</p><p>as to be a non-issue. Its concentrated on my scalp, face and arms now,</p><p>though, whereas earlier it was all over. My juice tastes bland.</p><p>2:50AM</p><p>------</p><p>        Its been 2 hours... peak plasma concentrations of</p><p>dextropropoxyphene are supposedly reached at 2-2.5 hours, and I do feel as</p><p>though I've gotten as far as I'm going to. There doesn't seem to be</p><p>anymore sensation of increase in the effects. I'm kind of bored of the</p><p>high already. Narcotics just don't do all that much for me on their own.</p><p>I've been wanting to smoke some cannabis, but haven't yet because I wanted</p><p>to write an accurate report of an unclouded narcotic high. I think I've</p><p>accomplished that.</p><p>3:00AM</p><p>------</p><p>        I smoke some cannabis. One hit from my glass pipe and I'm already</p><p>feeling much nicer. Yes, I think this is what was needed.</p><p>3:15AM</p><p>------</p><p>        The cannabis made a huge difference. I can feel the effects of</p><p>both blended into a fuller high than the dextropropoxyphene alone. The</p><p>cannabis also made me think more vocally again, and the combination makes</p><p>mellow music AMAZING! It is making me a little sleepy though. Neither drug</p><p>seems to dominate the high, its an even synergy, at least at these</p><p>dosages.</p><p>3:45AM</p><p>------</p><p>        I feel much the same as before, but the narcotic aspect of the</p><p>high is starting to taper off ever so slightly. I'm pretty tired and plan</p><p>to go to bed soon. This was interesting to actually document a narcotic</p><p>experience, but I've never really been a big fan of this class of drug.</p><p>I'd definitely do it again if I was given some more, although I'd combine</p><p>it right off with cannabis. Ah well...</p>"
}
