{
 "title": "An Even Synergy",
 "author": "Murple",
 "citation": "   Murple. \"An Even Synergy: experience with Propoxyphene & Cannabis (ID 2381)\". Erowid.org. Oct 7, 2001. erowid.org/exp/2381",
 "substance": "Propoxyphene & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)",
   "  T+ 2:10",
   "1 hit",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 2381",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2001",
   "Views: 43221",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n12:50AM<br>-------<br>        OK, so its actually the 18th now. So what. I haven't gone to sleep<br>yet, so its the 17th as far as I'm concerned. Anyway...<br>        I have 2.5 tablets of Propacet, each containing 50mg of <br>dextropropoxyphene. They're the last of a batch of 8 of them that I was<br>given. I ingest all of them. I had smoked a little cannabis earlier, still<br>feel a lingering effect, but am close to baseline.<br>1:09AM<br>------<br>        I begin to feel a hint of opiate feel kicking in. I also seem to<br>be feeling random itches all over my body, but they are easy to ignore.<br>This is a typical opiate alert for me. I feel slightly warm, a little<br>'floaty,' and real calm. Not much else yet. Narcotics seem to take a long<br>time to take effect orally.<br>1:21AM<br>------<br>        The itching passed several minutes ago. But other than that, there<br>has been no change. I almost even feel closer to baseline than at my last<br>check-in. I'm yawning a little now though.<br>1:45AM<br>------<br>        Well, I definitely feel 'something' - basically the same as I have<br>been feeling, but its moved up a level of intensity. Its tempting at this<br>point to smoke some cannabis to bring on the effects. I'm holding off<br>though, so I can get a good description of an unclouded dextropropoxyphene<br>experience. But damn... this slow come on time is a negative in my<br>opinion. I would hate to have to wait this long if I were using it for<br>pain relief!<br>2:10AM<br>------<br>        T+1:20 and it still hasn't really kicked in yet. This is taking an<br>unusually long time. I haven't eatin in 11 hours or so, so my stomach<br>wasn't full. I feel slightly more than I did at last check-in. Same<br>effects again, just a little stronger. A kind of warm tingly sensation<br>diffused throughout my upper body and somewhat in my legs. A feeling of<br>calmness. Somewhat quieted thought processes. But I'm not yet feeling the<br>euphoria or the 'buzz' yet.<br>2:15AM<br>------<br>        As I typed that last paragraph, things did jump up a level. The<br>body tingles increased alot, and spread all over my body. There is some<br>tinnitus in my ears now. Every now and then I get random itches, which has<br>been going on since I felt the first hint of effects. I'm developing a<br>decent 'buzz' and some euphoric sensations now as well. <br>2:30AM<br>------<br>        Things still seem to be building, but I'm at a pretty decent level<br>now. I feel typical opiate effects, though sort of mild. As I said,<br>narcotics are very different from other CNS depressants. Its hard to<br>compare this high to something like GHB or alcohol.<br>        I feel a little warm, its a pleasant warmth. My body feels a sort<br>of tingly, floaty sensation. I feel much lighter than usual. I don't feel<br>like moving around at all. I tried to lay down, though, and that wasn't<br>noticably more comfortable than sitting in my computer chair or standing.<br>It doesn't seem to matter what position I'm in, I'm equally comfortable.<br>Its a comfortableness that seems to come primarily from not caring about<br>things that might normally make me uncomfortable. My thought processes are<br>slow... I'm a verbal thinker, and the voice in my mind is much quieter<br>than normal. Its not that thought is impaired, I *can* think if I want<br>to... it just seems nicer to not think though. Opiates are a very<br>detatched high. You just want to float around feeling calm, not doing or<br>thinking. Its not that you feel unusually happy - you just feel mentally<br>relaxed and physically good. Personally I find it sort of boring, but I<br>can see how this state would appeal to alot of people, especially those<br>with escapist tendencies. Music is slightly enhanced. Orbital's 'Halcyon<br>On & On' sounds prettier than usual, and goes well with the floaty<br>sensations. Other minor effects... I have dry mouth, but its different<br>than cannabis 'cottonmouth.' I was pretty hungry before I took the pills.<br>The hunger vanished within a half hour or 45 minutes or so and hasn't<br>returned. The itching is still somewhat there, but its so easy to ignore<br>as to be a non-issue. Its concentrated on my scalp, face and arms now,<br>though, whereas earlier it was all over. My juice tastes bland.<br>2:50AM<br>------<br>        Its been 2 hours... peak plasma concentrations of<br>dextropropoxyphene are supposedly reached at 2-2.5 hours, and I do feel as<br>though I've gotten as far as I'm going to. There doesn't seem to be<br>anymore sensation of increase in the effects. I'm kind of bored of the<br>high already. Narcotics just don't do all that much for me on their own.<br>I've been wanting to smoke some cannabis, but haven't yet because I wanted<br>to write an accurate report of an unclouded narcotic high. I think I've<br>accomplished that.<br>3:00AM<br>------<br>        I smoke some cannabis. One hit from my glass pipe and I'm already<br>feeling much nicer. Yes, I think this is what was needed.<br>3:15AM<br>------<br>        The cannabis made a huge difference. I can feel the effects of<br>both blended into a fuller high than the dextropropoxyphene alone. The<br>cannabis also made me think more vocally again, and the combination makes<br>mellow music AMAZING! It is making me a little sleepy though. Neither drug<br>seems to dominate the high, its an even synergy, at least at these<br>dosages.<br>3:45AM<br>------<br>        I feel much the same as before, but the narcotic aspect of the<br>high is starting to taper off ever so slightly. I'm pretty tired and plan<br>to go to bed soon. This was interesting to actually document a narcotic<br>experience, but I've never really been a big fan of this class of drug.<br>I'd definitely do it again if I was given some more, although I'd combine<br>it right off with cannabis. Ah well...\n\n\n"
}
