{
 "title": "Got the Lads Running All Up on Me",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Got the Lads Running All Up on Me: experience with 5-MeO-DiPT (ID 23828)\". Erowid.org. Jul 27, 2006. erowid.org/exp/23828",
 "substance": "5-MeO-DiPT",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)",
   " ",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 23828",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2006",
   "Views: 3599",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My trip started when I ingested 15 mg that was  placed in a capsule. The first 2 hours I felt really high, like on the effects of marijuana. I actually got tired enough that I took an hour and a half nap. After I woke up my friend asked me if I wanted to smoke a joint. I took three hits off of it. After that we went into a cafeteria and then the trip really started to take effect. In the cafeteria people started to look very scary, I got insanely anxious and started to have what I believe to be an anxiety attack. I started pouring sweat, looking around earnestly, and getting very scared, I thought I was going to cry. </p><p>Once I got outside, I sat down and started to stare at a wall, this is where the positive effects of my trip started. The particles in concrete started to swim like they were liquid and kaleidoscope like patterns started to form on top of brick walls. We wandered back to our dorm room and there the anxiety attack started again so I had to leave.</p><p>Once I got outside I was a lot better. Throughout all of this I did have a very anxious feeling though which was rather uncomfortable but was manageable once I got used to it. I had very vivid  hallucinations once I got back outside and was chilling on top of a roof. I remained there for the rest of the night. There trees started to grow, concrete was swimming and patterns emerged in the layer of gravel that was on top of the roof. Also patterns that were composed of light emerged across the entire sky when I would</p><p>focus on a star. </p><p>Once my friends joined me after another hour of  this the anxiousness went away and I felt very calm and at peace with my friends while all my hallucinations were still in great effect. These effects are all very different from what my friends have experienced and what I have heard about online. Unlike other trips like mushrooms and LSD, I had absolutely no desire to ponder thoughts on life or any mental side effects. The entire trip was  basically composed of visualizations. The best way I could describe it for me was that it seemed very hedonistic because it was just pure pleasure. It did seem like I was very warm the entire night, and I was sweating the whole time. While I was sitting on the edge of the roof I had a very strong desire to jump off, so I forced myself to get to a safer spot. After I finally got back to my dorm room, I had difficulty going to sleep for a while </p><p>All in all I really enjoyed it.</p>"
}
