{
 "title": "Ketamine Log",
 "author": "Murple",
 "citation": "   Murple. \"Ketamine Log: experience with Ketamine (ID 2382)\". Erowid.org. Nov 20, 2000. erowid.org/exp/2382",
 "substance": "Ketamine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   "  T+ 0:40",
   "25 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2382",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 20, 2000",
   "Views: 36047",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n11:45PM<br>-------<br>        I weigh out 50mg of Ketamine HCl which was obtained pure (not as<br>an injectible solution) from a chemical supplier. It is a crystalline<br>powder with some rather large chunks that look like crystals of table <br>salt. I crush this to a fine powder, then further powder it with a razor<br>blade, and divide it into two even lines. This is about my 8th experience<br>with ketamine, though I've never written a report about it before. Looking<br>at this 50mg, it appears to be alot more than what I've done before.<br>Erowid's ketamine dosage page states 'One method for nasal use is to<br>insufflate (snort) 25 mg in each nostril, wait 5 minutes and repeat until<br>you reach your desired dosage.' I do not anticipate that there will be any<br>need to repeat. Looking at this, I visually estimate that most of my prior<br>experiences have been with around 30-40mg.<br>12:00AM<br>-------<br>        I insufflate the first 25mg. There is a mild burn, but not too<br>bad. The file mentions doing 50mg at once. I've decided to space it<br>out somewhat and see how things work out.<br>12:03AM<br>-------<br>        I feel very noticable effects. My body begins to feel strange. My<br>head has a sort of 'balloon-like' feel to it, its somewhat like nitrous<br>oxide without the sound in the head. Speaking of sounds... I put on<br>Orbital's live mix of 'Halcyon On & On'. Normally this song is very<br>pretty... but now, even with headphones, it sounds muffled or distant.<br>Ketamine certainly doesn't seem to enhance music - quite the opposite.<br>12:11AM<br>-------<br>        I am getting strange visual disturbances. Hard to explain really.<br>I have the impression that things are moving, but nothing looks as though<br>its moving. Corner-of-the-eye type stuff... but much more so. There is<br>a flittiness to the visual effects that is vaguely reminiscent (I was<br>completely unable to spell this word myself and had to ask for help on the<br>Internet) of the visual effects produced by ecstasy. My visual field is<br>swimming... thats the best word for it, somehow. As if looking at<br>everything through some kind of moving liquid.<br>12:18AM<br>-------<br>        There is a noticable drop in intensity of the effects. Visual<br>effects are still present. I still have a feeling of 'dumbness' (not being<br>able to remember words, etc). In fact I am nowhere near baseline. But the<br>initial rush is over. My body feels 'weird.' There are no closed eye<br>visuals.<br>12:30AM<br>-------<br>        I still feel a little unusual, and my visual field is still<br>swimming a little, but the effects are more or less over. 25mg remains<br>sitting on my plate. I'm not sure I want to do it... I feel as if I wasted<br>the first 25mg by sitting in front of a computer and trying to describe it<br>in realtime - as if the very act of attempting to describe the effects<br>prevents the more interesting effects form appearing.<br>12:40AM<br>-------<br>        I divided the remaining 25mg into 2 more lines, and put some Orb<br>on through headphones. I insufflate one of the 2 lines, then go to lay<br>down and close my eyes and listen to music.<br>12:45AM<br>-------<br>        No significant increase in effects from that  mg, so I insufflate<br>the other. I go back to laying down, after skipping to a different Orb<br>tune (Little Fluffy Clouds, Dance Mix MK2).<br>12:56AM<br>-------<br>        The song ends. I get up to start writing. My body feels somewhat<br>'detatched' - I can't quite explain it. Its not numbness per se, but<br>shares some qualities. Laying on my bed was very odd. The bed felt hard,<br>and the pillows felt hard, as if laying my head back on a cloth-covered<br>rock. The overhead light in my bedroom appears somewhat like the light<br>over an operating table. Not much in the way of closed eye visuals. Open<br>eyed, my room looks somewhat stark and my perspective seems odd. Is my<br>heart beating OK, am I breathing normal? I think. Don't really care. I<br>find myself thinking of mundane, every day issues, trying to find answers<br>to things which have been on my mind - no answers come to me that haven't<br>already come to me sober. I seem to be able to think about things in a<br>detatched, analytical way, but there is no enlightenment coming that I can<br>see. Most drug 'spirits' I've dealt with have seemed to be male or female<br>- not so ketamine. The ketamine 'spirit' seems robotic or mechanical in<br>nature. This molecule taps into some very different energies than the<br>traditional psychedelics. I would not consider this a psychedelic at all.<br>Its something else entirely.<br>1:08AM<br>------<br>        I feel I'm in approximately the same place as I was at the 12:18AM<br>entry above. Visual field is swimming. Feel physically weird...a slight<br>sensation of motion, perhaps. Somewhat dulled sensation. Music sounds<br>mostly normal. But the mental effects have noticably dropped off. I feel<br>more 'coherent' and though quite a ways above baseline, I'm definately<br>aware that I'm headed there.<br>1:20AM<br>------<br>        Visual effects are still quite noticable, though dramatically<br>less than what they were. Other effects are decreasing rapidly. I decide<br>to smoke some cannabis and conclude this experiment.<br>1:34AM<br>------<br>        I am on IRC... I just had a very intense deja vu experience. I<br>recieved 2 variations on the same chain email from 2 friends who are<br>totall unconnected (except through me). Then all of the sudden I realized<br>that the conversation I was having on IRC was something I had before. I<br>had the strange feeling that I existed in that time segment twice. Just<br>thought it was worth mentioning... Strange!\n\n\n"
}
