{
 "title": "Ketamine Log",
 "author": "Murple",
 "citation": "Citation:   Murple. \"Ketamine Log: experience with Ketamine (ID 2382)\". Erowid.org. Nov 20, 2000. erowid.org/exp/2382",
 "substance": "Ketamine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   "  T+ 0:40",
   "25 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2382",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 20, 2000",
   "Views: 36047",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n11:45PM\r\n-------\r\n        I weigh out 50mg of Ketamine HCl which was obtained pure (not as\r\nan injectible solution) from a chemical supplier. It is a crystalline\r\npowder with some rather large chunks that look like crystals of table \r\nsalt. I crush this to a fine powder, then further powder it with a razor\r\nblade, and divide it into two even lines. This is about my 8th experience\r\nwith ketamine, though I've never written a report about it before. Looking\r\nat this 50mg, it appears to be alot more than what I've done before.\r\nErowid's ketamine dosage page states 'One method for nasal use is to\r\ninsufflate (snort) 25 mg in each nostril, wait 5 minutes and repeat until\r\nyou reach your desired dosage.' I do not anticipate that there will be any\r\nneed to repeat. Looking at this, I visually estimate that most of my prior\r\nexperiences have been with around 30-40mg.\r\n12:00AM\r\n-------\r\n        I insufflate the first 25mg. There is a mild burn, but not too\r\nbad. The file mentions doing 50mg at once. I've decided to space it\r\nout somewhat and see how things work out.\r\n12:03AM\r\n-------\r\n        I feel very noticable effects. My body begins to feel strange. My\r\nhead has a sort of 'balloon-like' feel to it, its somewhat like nitrous\r\noxide without the sound in the head. Speaking of sounds... I put on\r\nOrbital's live mix of 'Halcyon On & On'. Normally this song is very\r\npretty... but now, even with headphones, it sounds muffled or distant.\r\nKetamine certainly doesn't seem to enhance music - quite the opposite.\r\n12:11AM\r\n-------\r\n        I am getting strange visual disturbances. Hard to explain really.\r\nI have the impression that things are moving, but nothing looks as though\r\nits moving. Corner-of-the-eye type stuff... but much more so. There is\r\na flittiness to the visual effects that is vaguely reminiscent (I was\r\ncompletely unable to spell this word myself and had to ask for help on the\r\nInternet) of the visual effects produced by ecstasy. My visual field is\r\nswimming... thats the best word for it, somehow. As if looking at\r\neverything through some kind of moving liquid.\r\n12:18AM\r\n-------\r\n        There is a noticable drop in intensity of the effects. Visual\r\neffects are still present. I still have a feeling of 'dumbness' (not being\r\nable to remember words, etc). In fact I am nowhere near baseline. But the\r\ninitial rush is over. My body feels 'weird.' There are no closed eye\r\nvisuals.\r\n12:30AM\r\n-------\r\n        I still feel a little unusual, and my visual field is still\r\nswimming a little, but the effects are more or less over. 25mg remains\r\nsitting on my plate. I'm not sure I want to do it... I feel as if I wasted\r\nthe first 25mg by sitting in front of a computer and trying to describe it\r\nin realtime - as if the very act of attempting to describe the effects\r\nprevents the more interesting effects form appearing.\r\n12:40AM\r\n-------\r\n        I divided the remaining 25mg into 2 more lines, and put some Orb\r\non through headphones. I insufflate one of the 2 lines, then go to lay\r\ndown and close my eyes and listen to music.\r\n12:45AM\r\n-------\r\n        No significant increase in effects from that  mg, so I insufflate\r\nthe other. I go back to laying down, after skipping to a different Orb\r\ntune (Little Fluffy Clouds, Dance Mix MK2).\r\n12:56AM\r\n-------\r\n        The song ends. I get up to start writing. My body feels somewhat\r\n'detatched' - I can't quite explain it. Its not numbness per se, but\r\nshares some qualities. Laying on my bed was very odd. The bed felt hard,\r\nand the pillows felt hard, as if laying my head back on a cloth-covered\r\nrock. The overhead light in my bedroom appears somewhat like the light\r\nover an operating table. Not much in the way of closed eye visuals. Open\r\neyed, my room looks somewhat stark and my perspective seems odd. Is my\r\nheart beating OK, am I breathing normal? I think. Don't really care. I\r\nfind myself thinking of mundane, every day issues, trying to find answers\r\nto things which have been on my mind - no answers come to me that haven't\r\nalready come to me sober. I seem to be able to think about things in a\r\ndetatched, analytical way, but there is no enlightenment coming that I can\r\nsee. Most drug 'spirits' I've dealt with have seemed to be male or female\r\n- not so ketamine. The ketamine 'spirit' seems robotic or mechanical in\r\nnature. This molecule taps into some very different energies than the\r\ntraditional psychedelics. I would not consider this a psychedelic at all.\r\nIts something else entirely.\r\n1:08AM\r\n------\r\n        I feel I'm in approximately the same place as I was at the 12:18AM\r\nentry above. Visual field is swimming. Feel physically weird...a slight\r\nsensation of motion, perhaps. Somewhat dulled sensation. Music sounds\r\nmostly normal. But the mental effects have noticably dropped off. I feel\r\nmore 'coherent' and though quite a ways above baseline, I'm definately\r\naware that I'm headed there.\r\n1:20AM\r\n------\r\n        Visual effects are still quite noticable, though dramatically\r\nless than what they were. Other effects are decreasing rapidly. I decide\r\nto smoke some cannabis and conclude this experiment.\r\n1:34AM\r\n------\r\n        I am on IRC... I just had a very intense deja vu experience. I\r\nrecieved 2 variations on the same chain email from 2 friends who are\r\ntotall unconnected (except through me). Then all of the sudden I realized\r\nthat the conversation I was having on IRC was something I had before. I\r\nhad the strange feeling that I existed in that time segment twice. Just\r\nthought it was worth mentioning... Strange!\n\n\n"
}