{
 "title": "PropylHuasca",
 "author": "Murple",
 "citation": "   Murple. \"PropylHuasca: experience with DPT, Harmine & GHB (ID 2383)\". Erowid.org. Nov 20, 2000. erowid.org/exp/2383",
 "substance": "DPT, Harmine & GHB",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   "  T+ 4:00",
   "100 mg",
   "oral",
   "Harmala Alkaloids",
   "(powder / crystals)",
   "  T+ 4:35",
   "50 mg",
   "oral",
   "DPT",
   "(powder / crystals)",
   "  T+ 4:39",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 5:15",
   "1.0 g",
   "oral",
   "GHB",
   " "
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2383",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 20, 2000",
   "Views: 20922",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is an experiment that I'd been planning but putting off for some time. The only other propylhuasca report online claimed that 100mg of DPT with some harmala extract was a very mild and disappointing trip. This led me to believe that I would be in for a mild trip, thus I put it off so long. Just goes to show how influential trip reports are to the entheogenic community. How many people have had samples of DPT and decided to try it intranasally, smoked, or by injection, thinking that the oral route was a waste of time? Well, that report sure turned out to be off-base! The oral route proved quite spectacular... </p><p>2:05AM</p><p>------</p><p>Took 100mg of harmine HCl orally. I had insufflated 10mg of ketamine around 10PM, so I opted to wait a while and make sure there was no reaction prior to taking the DPT - just in case. </p><p>2:33AM</p><p>------</p><p>I am definately feeling the harmine now. Typical of the effects I would expect from harmala seeds, minus the physical side effects (so far) and without the lingering disgusting taste of the seeds pervading my entire being, which is definately a positive. </p><p>2:35AM</p><p>------</p><p>I take 50mg of DPT HCl orally, and put on 'We Are...' by Genetic. </p><p>2:39AM</p><p>------</p><p>A hint of nausea, that could be psychosomatic. We'll see. I'll employ some anti-nausea herb just in case. </p><p>2:50AM</p><p>------</p><p>I get up to get another 50mg of DPT. As I do this, I begin to feel the DPT beginning to take effect. </p><p>2:57AM</p><p>------</p><p> Burping leaves a funny DPT-ish taste in my mouth. Very chemical, slightly metallic. Odd, not exactly pleasant, although not strong enough to be repulsive. The only things in my stomach are DPT, harmine, and iced tea. Yummy. </p><p>3:03AM</p><p>------</p><p> I'm beginning to notice visual enhancements. Still havent taken the second 50mg of DPT. It may not be required. </p><p>3:06AM</p><p>------</p><p> Definately feeling the DPT now! It seems somehow different. Mellower. My stomach feels somewhat uncomfortable, but its not nausea. </p><p>3:15AM</p><p>------</p><p> Noticable tachycardia! I decide to take 1g of GHB to try and relax. I'm getting noticable visual effects. Much more LSD-like and more prominent than DPT done on its own via insufflation. The tachycardia makes it a kind of edgy feeling trip, which I could do without. </p><p>3:15-5:00AM</p><p>-----------</p><p> OK, from here on, this was written after the trip. </p><p>OH MY GOD! This portion of the trip sent me out to some very strange places. I was definately aware of the fact that I was in some strange suburb of Ayahuasca City - it had a similar feel to it. I seemed to be able to maintain a grasp on reality, however, and the experience was much gentler and less threatening than DMT-based ayahuasca. This is not to say that it was weaker! Different, but equal. </p><p>The tachycardia stopped around 3:30, which made the trip much more relaxed. Where did it come from? A friend of mine was also trying propylhuasca and we were communicating over an Internet chat room during the trip. He experienced no tachycardia at all, and in fact reported bradycardia. So where did it come from? At the time, I became concerned that perhaps it was some reaction between the harmine and the ketamine I had done - but this turned out not to be the case; I had taken the ketamine hours earlier, it was a miniscule dose, and my friend took some ketamine during his propylhuasca trip and didn't experience it. It could be because I was using harmine HCl and my friend was using a crude extract of P. harmala seeds. Most likely, however, it was a psychosomatic reaction, perhaps nervousness about being in uncharted waters triggered an adrenaline rush. On another level however, I realized that this was my body telling me that I needed to get in shape. DPT seems to be very powerful in this regard - if your body needs to tell you something, it will speak quite loudly in the DPT state. </p><p>Visually, this trip was far beyond what I would expect from insufflated DPT. Things seemed vertically somewhat squashed, while the horizontal remained normal. Floor tiles seemed to move in a way similar to DMT visuals, but smoother and more liquid. I had quite noticable tracers from moving objects. While the visuals were more intense by far than what I expected from DPT, they were rather tame in comparison to other tryptamines such as DMT or psilocybin. </p><p>There were some closed eye 'visuals' - but perhaps 'visions' is a better word. The images had a similar quality to the way dream sequences are filmed in movies, sort of fuzzy and not totally focused. They would be coherent scenes with plots. One that stands out the most had 'entity' contact involved. While I was having the strong tachycardia, I closed my eyes, and suddenly found myself on a track, surrounded by several people in track and field clothes. The one who was obviously the coach (had a whistle) came up and started yelling at me to get in shape. He said 'Come on you can do it, you already quit smoking and thats a big step!' The other people standing around joined in saying various encouraging things. These people all seemed to have their own consciousness. Perhaps they were the 'consciousnesses' of various parts of my body. I had the distinct impression that this was a message to be taken seriously. There followed many other such 'lessons' by other 'entities' - the overall experience of this 'entity school' was similar to some experiences I've had on LSD in many ways. </p><p>There was a very pronounced auditory component to the trip. There were strange sounds in my head, astral 'music' that defies description. At one point I picked up and played my guitar, and heard a doubling of the notes, and a change in the whole timbre of the instrument's sound. It sounded like playing a cittern or mandocello. When I put on music, it was greatly enhanced - fuller sounding, more intricate. </p><p>Physically, it was a nice trip, after the initial tachycardia passed. I had the usual DPT vibrational feel. I felt very warm and relaxed. The comedown felt very gentle and pleasant. </p><p>Mentally, the trip was right on the line between managable and 'too much' - yet in a gentle, meditative way. There were several times when I found myself uncontrollably grinning or laughing for no apparant reason other than just feeling GOOD. The space that it took me too had characteristics of both DPT and ayahuasca, and seemed to lie a little closer to LSD territory than DPT on its own. It was very much a profound and revelatory trip, and something I found worthwhile. This was far more thorough than any insufflated DPT trip I've had. I feel I've experienced more fully that DPT has to offer. </p><p>5:00-6:15AM</p><p>-----------</p><p>I took 2.5g of GHB to begin to wind down. I was in a very pleasant place. I was still having moderate effects, including visuals. I received the weekly DRCNet bulletin in my email, which announced that Portugal had decriminalized all drugs, and that North Dakota had legalized hemp cultivation. I prepared a gelcap with 100mg of harmine HCl and 50mg of DPT and put it away - I will take it the first night that marijuana is legal. </p><p>Conclusion</p><p>----------</p><p>At 6:15AM I decided to begin getting ready for bed. Got off the Internet, and went and smoked some cannabis and relaxed. Finally went to bed around 7:30AM. I woke up late, around 4:30PM, feeling good, but somewhat drained. Beautiful day. Great mood.</p>"
}
