{
 "title": "A Walk in the Park",
 "author": "Murple",
 "citation": "   Murple. \"A Walk in the Park: experience with DPT (ID 2384)\". Erowid.org. Jul 13, 2000. erowid.org/exp/2384",
 "substance": "DPT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2384",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 13, 2000",
   "Views: 7910",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My intention was to have a nice casual, slightly altered stroll through a park by my house, a 40 acre tree preserve with a lot of surrounding fields and bike paths, stuck in the middle of urban America. As any experienced psychedelic traveller knows, it is often the case that when we just plan for a mild bit of fun, we get alot more than we bargained for. I insufflated a moderate dose of DPT, and headed out walking towards the park. </p><p>As I walked through the neighborhood towards the park, I began to feel strangely uneasy, in a way I've never felt from DPT before. I soon realized that it wasn't the DPT but something else which was making me feel uneasy... I wasn't sure what until I reached the park and got into the woods. I felt myself drawn to this one particularly large tree, a giant 300 year old willow oak. Standing there and looking up at its mighty branches, I could feel it probing my mind, questioning me. 'Why have you given up all of this for those concrete boxes?' I could give it no suitable answer. I felt myself directed deeper into the woods, where I found a little creek surrounded by honeysuckle and wild rose, with yellow, orange and white butterflies dancing circles around each other in the air.</p><p>I could still feel the willow oak in my mind - it was obvious that I was meant to look at this and learn. I made my way back to the bike path, again feeling myself directed, and off the path into a little clearing, full of honeysuckles, roses, blackberries, grasses and mimosas swaying in the wind. Again, I felt the presence in my mind, 'Why have you given up this, for THAT?' - my gaze being diverted to the brick and concrete monstrosity of an apartment building looming in the near distance. I could give no answer. I felt an incredible sadness wash over me for all of us, and could do nothing but walk home to my ugly little brick home.</p>"
}
