{
 "title": "10 Year Anniversary",
 "author": "Murple",
 "citation": "   Murple. \"10 Year Anniversary: experience with LSD, DPT & GHB (ID 2385)\". Erowid.org. Aug 30, 2001. erowid.org/exp/2385",
 "substance": "LSD, DPT & GHB",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 4:15",
   "2 lines",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   "  T+ 6:00",
   "25 mg",
   " ",
   "DPT",
   " ",
   "  T+ 8:00",
   "  ",
   " ",
   "GHB",
   " "
  ]
 ],
 "footer": [
  [
   "1999",
   "2385",
   "Male",
   " ",
   "Not Given",
   "Aug 30, 2001",
   "46257",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>* June 4, 1989 - Beijing, China: Many students are killed by government</p><p>  troops while protesting for democratic reforms in Tiananmen Square.</p><p>* June 4, 1989 - Washington, DC suburbs: Through a a series of</p><p>  coincidences, I ran across a little square of white blotter paper</p><p>  containing a sample of Hofmann's magical elixir, and so have my first</p><p>  trip.</p><p>* June 4, 1999 - Beijing, China: Soldiers raised the Chinese flag over </p><p>  Tiananmen Square in Beijing, as China tried to ignore the anniversary of</p><p>  the student democracy movement there a decade ago. </p><p>* June 4, 1999 - Washington, DC suburbs: Unlike in China, June 4 is an</p><p>  anniversary full of joy for me, and one which I celebrated quite fully</p><p>  this year, as is fitting for 10 years...</p><p>        Ahh yes... my 10th rebirthday! This is one that I won't soon</p><p>forget. I hadn't had LSD in a pretty long time... about 15 months since my</p><p>last mild experience, and around 2 years since my last full blown LSD</p><p>experience, which had been a little on the rough side. I've been exploring</p><p>other entheogens quite thoroughly in this time, but I stayed away from LSD</p><p>for a variety of reasons.</p><p>        With my 10th rebirthday approaching, however, I decided it was</p><p>time for a reunion. I obtained a hit of green geltab acid, and set it</p><p>aside for the upcoming anniversary.</p><p>        June 4th finally came, and I felt that old familiar nervous</p><p>anticipation rising in me. Acid! My first and most familiar ally... I</p><p>found myself incredibly nervous, which struck me as silly. I've done this</p><p>countless times. I've done crazy shit like ayahuasca. Why is a little hit</p><p>of acid causing so much tension? I guessed just because it had been so</p><p>long. I decided on 11PM for take-off.</p><p>        Around 10:15, I decided to go on my regular internet chatroom to</p><p>relax and smoke some cannabis before take-off. I go on there and find one</p><p>person taking AMT, one person taking DPT, one person taking AMT with</p><p>mushrooms, one taking DPT with ketamine, someone else taking LSD, and a</p><p>few other assorted trippers. Surprise, it looks like the universe decided</p><p>to throw me a spontaneous rebirthday virtual-party! Well, alright then!</p><p>        I placed the sacrament at the foot of my Buddha carving, and lit a</p><p>stick of incense. I reflected upon all that I had been through with LSD</p><p>over the last 10 years, and all the wonderful things I have learned from</p><p>it. 11PM, down the hatch! Well, like I said 10 years ago, theres no</p><p>turning back now!</p><p>        I felt a strong alert by 11:15PM, and knew I was going to be in</p><p>for a wild ride. I was also overcome by a strong wave of nostalgia about</p><p>LSD. I put on headphones and listened to Moody Blues, broke out a folder</p><p>of my old LSD-influenced drawings, and began reminiscing. I read old LSD</p><p>reports of mine (unfortunately, I've only made a few of them). I thought</p><p>about how different of a world it was when I first fell through the rabbit</p><p>hole. There was still a Soviet Union. The Internet was still not much more</p><p>beyond the wet dreams of a few visionary geeks. Someone reminded me that</p><p>the Tiananmen Square massacre happened the same day. 10 years. Wow...</p><p>        Around 12:15, I wasn't tripping unusually hard, I was at a Plus 2</p><p>on the Shulgin scale. I started to get worried that I wouldn't trip any</p><p>harder. By 12:30-12:45, however, I realized that I was about to trip quite</p><p>a bit harder. I went to lay down just as I found myself hurled into an</p><p>amazing Plus 4. I remembered how much I loved LSD right then, and wondered</p><p>why I had let it go so long.</p><p>        The peak was spectacular. I was laying in bed in a dark room, the</p><p>best way to experience acid I think, and the closed-eye visuals were</p><p>mindblowing. At the same time, I felt that high-speed LSD consciousness</p><p>train blasting through my skull. The visuals and thoughts were very much</p><p>in sync. I thought about many things... how much I had missed acid, how</p><p>much I had learned from it over the years... and then into reflections on</p><p>my life. Realization that this was my first acid trip as a non-smoker,</p><p>which struck me as being an important milestone. After a little while, I</p><p>stopped thinking *about* anything and I became just a process of</p><p>abstract thinking, accompanied by the fantastic acid visualscapes of the</p><p>disembodied eye state. I experienced strange temporal distortions, had</p><p>visions of the LSD 'spirit' appearing to me as a yound woman dressed in</p><p>white muslin, saw both the dark and the light sides of acid as a sort of</p><p>'This Is Your Life' nostalgia session. I had a particularly amusing vision</p><p>of people putting tabs of acid to their tongues and immediately sprouting</p><p>wings from their mouths and flying off to the 'real' world (a la 'The</p><p>Matrix', sort of).</p><p>        Sometime during the height of the peak, around 1-1:30AM I would</p><p>estimate, I had a very strange experience. I had the sensation that I was</p><p>somehow communicating with an entity - which I soon realized was Becky.</p><p>This had a strange feeling of being real... some sort of telepathic link.</p><p>I found myself talking to her soundlessly in some sort of impossible</p><p>space, and rapidly became confused as to which one of us was who. 'Whats</p><p>happening?' I felt her think... and I thought back 'I don't know, I just</p><p>think our realities are overlapping...we'll just have to ride it out.' I</p><p>felt a strong feeling of caring, and soon after, it was as if we zoomed</p><p>apart at hundreds of miles per hour and the contact was broken. The</p><p>strange thing is that the next morning when I spoke with her, she asked</p><p>'So, did you feel us talking about you last night?'</p><p>        Around 3-3:30AM, things leveled off enough that I was able to move</p><p>around. I returned to the internet chatroom, and soon someone convinced me</p><p>to try a little ketamine, saying that the combination was amazing. I cut</p><p>some out into two large lines, returned to my bedroom, snorted the</p><p>ketamine, and lay down. I waited. I got a strange visual effect where</p><p>everything began to 'melt' somewhat - the effect is similar to what would</p><p>happen if you sprayed water on a watercolor painting. This only lasted a</p><p>short while. I felt a mild increase in the trip's 'weirdness' factor, but</p><p>overall it seemed to make no real big difference to the character of the</p><p>trip - I think I was already too far out for it to have any effect. I</p><p>wasn't very disappointed, not being very fond of ketamine to begin with. </p><p>        I got back on the chatroom and had a great time talking about</p><p>tripping with everyone for a while. Around 5AM, I decided to take a little</p><p>bit of DPT to boost myself back up a little. It added a little vibrational</p><p>signature to the trip, and brought back some intensity, but didn't add a</p><p>whole lot to the trip, as I only did a small quantity (25mg at most).</p><p>        2 or 3 hours later I got an email from some guy in Serbia who had</p><p>emailed us a few times before. It was a picture of a peace sign overlaid</p><p>on a potleaf. I decided to go to CNN's web s ite and saw a headline saying</p><p>the war in Kosovo could be over by the end of the weekend. I made a</p><p>little prayer for peace.</p><p>        Around 7AM, I had dropped down to a level where I was mainly</p><p>stimulated, more than tripping, and decided it was time to take a little</p><p>GHB to make myself sleepy. No such luck! I ended up consuming enough GHB</p><p>to tranquilize a herd of elephants over the next 6 hours, and barely</p><p>noticed any effect over the lingering LSD stimulation. I finally managed</p><p>to fall into a fitful sleep around 1PM, sleeping until 6, when I woke up</p><p>physically drained but mentally full of energy.</p><p>        This was one amazing trip, totally worthy of a 10-year anniversary</p><p>celebration! And it was a spectacular reunion with an old, trusted friend.</p><p>I won't be letting it go that long again before I schedule another date</p><p>with my beloved Lady Sidney the Divine...</p>"
}
