{
 "title": "10 Year Anniversary",
 "author": "Murple",
 "citation": "   Murple. \"10 Year Anniversary: experience with LSD, DPT & GHB (ID 2385)\". Erowid.org. Aug 30, 2001. erowid.org/exp/2385",
 "substance": "LSD, DPT & GHB",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 4:15",
   "2 lines",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   "  T+ 6:00",
   "25 mg",
   " ",
   "DPT",
   " ",
   "  T+ 8:00",
   "  ",
   " ",
   "GHB",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 2385",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 30, 2001",
   "Views: 46257",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n* June 4, 1989 - Beijing, China: Many students are killed by government<br>  troops while protesting for democratic reforms in Tiananmen Square.<br>* June 4, 1989 - Washington, DC suburbs: Through a a series of<br>  coincidences, I ran across a little square of white blotter paper<br>  containing a sample of Hofmann's magical elixir, and so have my first<br>  trip.<br>* June 4, 1999 - Beijing, China: Soldiers raised the Chinese flag over <br>  Tiananmen Square in Beijing, as China tried to ignore the anniversary of<br>  the student democracy movement there a decade ago. <br>* June 4, 1999 - Washington, DC suburbs: Unlike in China, June 4 is an<br>  anniversary full of joy for me, and one which I celebrated quite fully<br>  this year, as is fitting for 10 years...<br>        Ahh yes... my 10th rebirthday! This is one that I won't soon<br>forget. I hadn't had LSD in a pretty long time... about 15 months since my<br>last mild experience, and around 2 years since my last full blown LSD<br>experience, which had been a little on the rough side. I've been exploring<br>other entheogens quite thoroughly in this time, but I stayed away from LSD<br>for a variety of reasons.<br>        With my 10th rebirthday approaching, however, I decided it was<br>time for a reunion. I obtained a hit of green geltab acid, and set it<br>aside for the upcoming anniversary.<br>        June 4th finally came, and I felt that old familiar nervous<br>anticipation rising in me. Acid! My first and most familiar ally... I<br>found myself incredibly nervous, which struck me as silly. I've done this<br>countless times. I've done crazy shit like ayahuasca. Why is a little hit<br>of acid causing so much tension? I guessed just because it had been so<br>long. I decided on 11PM for take-off.<br>        Around 10:15, I decided to go on my regular internet chatroom to<br>relax and smoke some cannabis before take-off. I go on there and find one<br>person taking AMT, one person taking DPT, one person taking AMT with<br>mushrooms, one taking DPT with ketamine, someone else taking LSD, and a<br>few other assorted trippers. Surprise, it looks like the universe decided<br>to throw me a spontaneous rebirthday virtual-party! Well, alright then!<br>        I placed the sacrament at the foot of my Buddha carving, and lit a<br>stick of incense. I reflected upon all that I had been through with LSD<br>over the last 10 years, and all the wonderful things I have learned from<br>it. 11PM, down the hatch! Well, like I said 10 years ago, theres no<br>turning back now!<br>        I felt a strong alert by 11:15PM, and knew I was going to be in<br>for a wild ride. I was also overcome by a strong wave of nostalgia about<br>LSD. I put on headphones and listened to Moody Blues, broke out a folder<br>of my old LSD-influenced drawings, and began reminiscing. I read old LSD<br>reports of mine (unfortunately, I've only made a few of them). I thought<br>about how different of a world it was when I first fell through the rabbit<br>hole. There was still a Soviet Union. The Internet was still not much more<br>beyond the wet dreams of a few visionary geeks. Someone reminded me that<br>the Tiananmen Square massacre happened the same day. 10 years. Wow...<br>        Around 12:15, I wasn't tripping unusually hard, I was at a Plus 2<br>on the Shulgin scale. I started to get worried that I wouldn't trip any<br>harder. By 12:30-12:45, however, I realized that I was about to trip quite<br>a bit harder. I went to lay down just as I found myself hurled into an<br>amazing Plus 4. I remembered how much I loved LSD right then, and wondered<br>why I had let it go so long.<br>        The peak was spectacular. I was laying in bed in a dark room, the<br>best way to experience acid I think, and the closed-eye visuals were<br>mindblowing. At the same time, I felt that high-speed LSD consciousness<br>train blasting through my skull. The visuals and thoughts were very much<br>in sync. I thought about many things... how much I had missed acid, how<br>much I had learned from it over the years... and then into reflections on<br>my life. Realization that this was my first acid trip as a non-smoker,<br>which struck me as being an important milestone. After a little while, I<br>stopped thinking *about* anything and I became just a process of<br>abstract thinking, accompanied by the fantastic acid visualscapes of the<br>disembodied eye state. I experienced strange temporal distortions, had<br>visions of the LSD 'spirit' appearing to me as a yound woman dressed in<br>white muslin, saw both the dark and the light sides of acid as a sort of<br>'This Is Your Life' nostalgia session. I had a particularly amusing vision<br>of people putting tabs of acid to their tongues and immediately sprouting<br>wings from their mouths and flying off to the 'real' world (a la 'The<br>Matrix', sort of).<br>        Sometime during the height of the peak, around 1-1:30AM I would<br>estimate, I had a very strange experience. I had the sensation that I was<br>somehow communicating with an entity - which I soon realized was Becky.<br>This had a strange feeling of being real... some sort of telepathic link.<br>I found myself talking to her soundlessly in some sort of impossible<br>space, and rapidly became confused as to which one of us was who. 'Whats<br>happening?' I felt her think... and I thought back 'I don't know, I just<br>think our realities are overlapping...we'll just have to ride it out.' I<br>felt a strong feeling of caring, and soon after, it was as if we zoomed<br>apart at hundreds of miles per hour and the contact was broken. The<br>strange thing is that the next morning when I spoke with her, she asked<br>'So, did you feel us talking about you last night?'<br>        Around 3-3:30AM, things leveled off enough that I was able to move<br>around. I returned to the internet chatroom, and soon someone convinced me<br>to try a little ketamine, saying that the combination was amazing. I cut<br>some out into two large lines, returned to my bedroom, snorted the<br>ketamine, and lay down. I waited. I got a strange visual effect where<br>everything began to 'melt' somewhat - the effect is similar to what would<br>happen if you sprayed water on a watercolor painting. This only lasted a<br>short while. I felt a mild increase in the trip's 'weirdness' factor, but<br>overall it seemed to make no real big difference to the character of the<br>trip - I think I was already too far out for it to have any effect. I<br>wasn't very disappointed, not being very fond of ketamine to begin with. <br>        I got back on the chatroom and had a great time talking about<br>tripping with everyone for a while. Around 5AM, I decided to take a little<br>bit of DPT to boost myself back up a little. It added a little vibrational<br>signature to the trip, and brought back some intensity, but didn't add a<br>whole lot to the trip, as I only did a small quantity (25mg at most).<br>        2 or 3 hours later I got an email from some guy in Serbia who had<br>emailed us a few times before. It was a picture of a peace sign overlaid<br>on a potleaf. I decided to go to CNN's web s ite and saw a headline saying<br>the war in Kosovo could be over by the end of the weekend. I made a<br>little prayer for peace.<br>        Around 7AM, I had dropped down to a level where I was mainly<br>stimulated, more than tripping, and decided it was time to take a little<br>GHB to make myself sleepy. No such luck! I ended up consuming enough GHB<br>to tranquilize a herd of elephants over the next 6 hours, and barely<br>noticed any effect over the lingering LSD stimulation. I finally managed<br>to fall into a fitful sleep around 1PM, sleeping until 6, when I woke up<br>physically drained but mentally full of energy.<br>        This was one amazing trip, totally worthy of a 10-year anniversary<br>celebration! And it was a spectacular reunion with an old, trusted friend.<br>I won't be letting it go that long again before I schedule another date<br>with my beloved Lady Sidney the Divine...\n\n\n"
}
