{
 "title": "First Time *WOW!*",
 "author": "EarthPrincess",
 "citation": "Citation:   EarthPrincess. \"First Time *WOW!*: experience with H.B. Woodrose (ID 23885)\". Erowid.org. Feb 21, 2006. erowid.org/exp/23885",
 "substance": "H.B. Woodrose",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "6 seeds",
   "oral",
   "H.B. Woodrose",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23885",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2006",
   "Views: 39193",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n My Husband and I have done some reading about the effects of HBW seeds, and managed to obtain some seeds from a friends garden (organic).  I was a little scared, as I have only ever smoked a few 'herbs' before, and never taken anything stronger. My husband, however, has experimented with a few other stronger substances...\r\nIt was a Sunday-lunchtime, we were at home and feeling very relaxed and comfortable, so we thought this was a good time to try.  We each had six seeds, which already had the fuzz removed, we ground them up just a little in our mortar and pestle, and added about 1/3 cup of water for each of our 6 seeds. We let this soak for about half an hour. Neither of us had eaten much this day (just a couple of small donuts each). When we swallowed this mixture, we were both pleasantly suprised at how little taste it had, we were expecting it to taste a little horrid.\r\nAbout 20 minutes later, I started feeling quite nauseous, with a little dizziness, and had to sit very still for awhile. My husband felt a kind of tightening in his stomach, and a strange tingling in his head. Half an hour later, the 'bad' feeling was gone, but we both felt the need to brush our teeth, as there was a bad taste in our mouths. We sat around for about an hour, just watching some tv, then we both got VERY hungry, it seemed like we ate everything in sight!\r\nAfter we had eaten, we both started to feel very content and happy with everything, and seemed to laugh at nothing in particular. The experience I had of this was that my body was doing the laughing, and my brain couldn't quite catch what was so funny...\r\nA short time after this, my husband was floating around the house smiling at everything, he said he hadn't felt this happy and relaxed for ages. I, however, had a stronger reaction. Everything seemed quite surreal to me, like everything looked like it was 'soft', I don't mean the kind of soft that you'd sink into, just surface-soft. I didn't feel at all like standing up, so I stayed put on my comfey couch. I began feeling as if I were somehow drifting slightly to the right of my body, like I was becoming siamese twins or something. It wasn't a scary feeling...just very strange. I felt like my body was a separate entity from my brain. I reasoned with myself that this wasn't so, but I had a hard time convincing myself! My body seemed to moving of its own accord - picking up a drink, having a cigarette, changing the channel on the t.v., which I didn't seem to be watching at all. At one point I was looking up at the ceiling, which is very high and made of bare timber, and I felt as if the house itself was actually alive, and breathing with me.\r\nBy the time 5 hours had passed since taking the seeds, everything was back to normal, and I was left with a sense of wonderment at what I had experienced. I felt so calm and happy with my life, not that I'm generally unhappy, but this was an extreme happiness...  We made dinner and ate, and the food tasted terrific, like it was the best meal I'd ever eaten.\r\nAll in all, this experience for me was fantastic, and I'm looking forward to trying it again sometime. Though next time I feel like if I were outside in the bush somewhere, it would be even better!\n\n\n"
}