{
 "title": "An Opioid World",
 "author": "J.C.",
 "citation": "   J.C.. \"An Opioid World: experience with Tramadol (Ultram) (ID 23886)\". Erowid.org. May 16, 2005. erowid.org/exp/23886",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23886",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 16, 2005",
   "Views: 198570",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Previous Non-Opiate Experiences: Dextro-amphetamine, Amphetamine, Methylphenidate, 5-MEO-DiPT, Mushrooms, Marijuana, DXM, Various Benzodiazepines and GBL.</p><p>Opiates Experienced: Demerol (Meperidine), Codeine, Hydrocodone, Oxycodone, Morphine and Ultram (Tramadol).</p><p>Due to certain medical conditions I have had the opportunity to sample different opiates of the medical world for pleasure and for pain. I have always enjoyed the feeling of opiates but at the same time Ive had to watch myself in order to keep tolerance, dependence and addiction at bay. While I have had fun with all the opiates on the list I have found that after the initial use their duration became shorter and that they also began offering a strange come down effect. I have tried abstaining from opiates to see if it was a tolerance issue but the comedown was still there. After the bliss of an hour or 2, I would begin to feel exceedingly irritable. This is about when my interest in these substances waned, and my interest in Tramadol began to grow.</p><p>Tramadol is a synthetic analgesic whos mode of action is not completely understood. It has been shown to exhibit some of the same effects as other opiate pain medications but there is no consensus in either the medical or the recreational community whether it is a true opiate/opioid. As of now it is not scheduled in America and is relatively easy to get prescribed. I routinely get 50 count bottles of Ultram with 3 refills and no complaints from my doctor; where as getting hydrocodone for my chronic pain can be met with cries of Criminal and medical gauntlet running.</p><p>Back to the story though. I was prescribed Tramadol for my day time pain at a dosage of 100-200 mg a day. When I first took it I was on a relatively high amount of hydrocodone for a relatively high amount of pain and was not expecting to be impressed by this previously unheard of drug. Amazingly the effects were incredible and over time I stopped taking all other pain medication.</p><p>The Joys of Tramadol</p><p>1.\tIt lasts from 3-9 hours</p><p>2.\tLittle constipation</p><p>3.\tIt does not disrupt or muddle thinking</p><p>4.\tApparently little tolerance. I have taken the same 100mg dose once ever 2-3 days for over a year now and have never had effects any weaker than the first time.</p><p>5.\tLess come down than other opiates.</p><p>Here is a summery of a fairly standard experience with Tramadol.</p><p>T+ 0:00 </p><p>I am in a stable mind set with the usual annoying pain, but typically normal. I swallow 2 Tramadol with a little food to pad the stomach (best not to risk any nausea).</p><p>T+ 0:30</p><p>I began my exercises and weight lifting. Nothing at all can be felt out of the ordinary.</p><p>T+ 0:45</p><p>Thoughts are a fraction slow (the onset is the only place I have experienced this) but nothing else.</p><p>T+ 1:00</p><p>Body pain starts to fade a bit as I finish my workout and drink some water.</p><p>T+ 1:15</p><p>It hits me when I step into the shower. Its not like many opiate medications that can have the tendency to overwhelm you (albeit in a good way) in the onset, the beginning of the experience of Tramadol is like a breath of fresh air. Suddenly I am calmed and my mood is elevated. Unlike many other drugs than can provide euphoria that can seem forced or chemical, the euphoria from Tramadol seems like the most natural thing in the world. It just feels completely right, I can easily forget that I have taken a drug at all.</p><p>It is difficult to describe the experience itself, its nothing like the full body orgasm that some heroin users describe. Its more like a full body blanket, its as if the most comfortable, softest, pink blanket is being wrapped around me in both a physical and emotional way. It is like laying back and talking with my best friend. Its like walking outside on the first day of summer and smelling the fresh cut grass. My problems have not disappeared, I have not escaped them, but the little annoyances of life have had the volume turned down a notch. Tramadol has often giving me the opportunity to reflect and feel optimistic about the future.</p><p>Ill admit that it all sounds a little intense. Most likely because I am focusing on it so intently. The great thing about Tramadol, however, is that it does not inhibit my activities at all. It doesnt make me want to just lie on the couch like marijuana, or immediately run around the world like amphetamines. It just feels natural to continue to do, whatever it is that I do. Doing work is fine, conversations are great, sports are fun, there are hardly any activities that I can think of that Tramadol detracts from. Well except sleep. Its no good for sleeping.</p><p>This drug is a great at multitasking. I can lounge around and watch movies or I can go out and give an academic presentation. It doesnt matter, It just feels natural.</p><p>T+ 2:00</p><p>Still operating at the same level of enjoyment. It falls into the background of whatever I am doing more while still giving everything around me a slight glow (emotional not visual).</p><p>T+ 3:00</p><p>The effects have dropped slightly but I am still having a great time.</p><p>T+ 4:00</p><p>The effects are at about 1/3 of their strongest (peak around +2:00).</p><p>T+ 5:00-8:00</p><p>The effects slowly drop off until there is just a tiny but pleasant calming buzz in the back of my head. I usually remain emotionally lifted until I go to sleep that night.</p><p>Reflection: If there is such a thing as a perfect drug this is as close as I have found. It doesnt overwhelm, it simply enhances. It provides a very natural feeling of tranquility and calm. Now I cant make this entirely a positive report. Opiates can be very addictive to those without strong self control. Tramadol while not be considered a true opiate is addictive and will cause withdrawal symptoms I am told, when taking frequently and in large amounts. Personally I take 100mg of Tramadol (half of the actual recommended daily dose) every 2 or 3 days. The effects are always the same and I have felt no withdrawal on the off days.</p><p>*Note: Many people to not receive the same effects that I do from this drug. There are some for whom it is useless, or that receive only a minimum effect. But there are others, like me, who are lucky enough to enjoy this drug in its surprising glory.</p><p>PS: Its not very safe to mix pain medications and alcohol</p><p>Have fun, be safe.</p>"
}
