{
 "title": "Wait! Where'd My Body Go?",
 "author": "Jezebel in hell",
 "citation": "   Jezebel in hell. \"Wait! Where'd My Body Go?: experience with 5-MeO-DMT (on mint leaves) (ID 23892)\". Erowid.org. May 21, 2003. erowid.org/exp/23892",
 "substance": "5-MeO-DMT (on mint leaves)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "23892",
   "Female",
   " ",
   "Not Given",
   "May 21, 2003",
   "19736",
   " "
  ]
 ],
 "report": "<p>I'd been reading up on the effects of 5-meo-dmt for quite some time, and after doing what I considered an acceptable amount of research, I decided to give it a try.  I got ahold of 30mg of the substance and loaded about half into a regular glass pipe, tossed on some headphones, flipped the C.D. to Tori Amos' Juarez (which is a very tribal song with a lot of drums), and plopped down on the couch.  I was in a very comfortable setting, at a good friend's house with a lot of very experienced trippers, so I had little to no anxiety when I lit the leaves.   </p><p>I inhaled as much as I could handle of the smoke, which was actually relatively pleasant tasting since it was mixed with mint leaves.  As the substance entered my lungs I instantly started to feel very fuzzy.  I could quite clearly picture my aura going from its usual bright purple to a kind of colorful static.  I perceived it as looking like the television static, only in purple, green, and pink instead of black and white.  </p><p>I held it in for about 25 seconds, and then exhaled.  Upon exhalation this intense rush of color washed over my vision.  A very pastel purple was swirling with lime green in front of my eyes, and everything else in the room became very distant except for the ceiling, which began to drip down like liquid stalicites.  </p><p>About 30 seconds later I was transported to an ancient desert with an indian shaman.  We didn't speak, but merely sat around a fire and basked in the light of a full moon (it is worth mentioning that the song I was listening to is about the deserts of Juarez).  This lasted for what I'm told couldn't have been more that three minutes, but it felt like at least an hour.  </p><p>As I began to come too I remember being very shocked to realize that I was listening to music, as I'd spent the last  few minutes AS the music.  This is fairly difficult to describe, but I could hear the notes and the drums and the lyrics, but I had no perception of what hearing was.  I just was the music.  It was like it came from inside of me, except there was no inside of me.  I just WAS this song.   </p><p>I've done 5-meo-dmt since then (although I've started referring to it as Matrix because it's real name is too long, and smoking it is like going through the matrix), and have always had very pleasant experiences.  I've found that the background noises make a rather large difference in the kind of trip I have though.  Tori Amos playing sends me off on shamanistic journeys, Poe takes me back to the earth spirit, and if I'm listening to other people talking in the room I just tend to go somewhere I can only refer to as 'elsewhere.'   Of all the many substances I've consumed, Matrix is still my favorite.</p>"
}
