{
 "title": "Alprazolam Log",
 "author": "Murple",
 "citation": "   Murple. \"Alprazolam Log: experience with Alprazolam (ID 2390)\". Erowid.org. Jul 13, 2000. erowid.org/exp/2390",
 "substance": "Alprazolam",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "0.5 mg",
   "oral",
   "Pharms - Alprazolam",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "1999",
   "2390",
   "Male",
   " ",
   "Not Given",
   "Jul 13, 2000",
   "Views: 53429",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n10:15PM</p><p>A friend of mine gave me a 0.5mg tablet of Xanax (alprazolam) tonight, which I crushed up and put into a gelcap (for faster absorbtion than a solid pill would probably provide). I just gulped it down. It's been a few years since I've had Xanax.\r10:25PM</p><p>I think that crushing the pill did indeed make a difference. I'm already beginning to feel some effect. Makes sense... a powder is much easier to digest and absorb than a solid tablet.\r10:45PM</p><p>I'm feeling the effects now. They're rather mild, but nice. Similar to a low dose of GHB, but not nearly as euphoric. Just a calm, relaxed, sedate - yet clear-headed feeling. 0.5mg is a rather small dose, being the average adult anxiolytic dose, so of course I won't be feeling incredibly high. But this feels good. I know that I will sleep incredibly well tonight! Perhaps some cannabis to enhance the effects...\r11:15PM</p><p>Well, it seems that Xanax takes about an hour to fully kick in. I figured what I felt at the 30 minute point was it - it didnt seem to be increasing any - but in the last 5 minutes the effects have intensified alot. I'm sure the fact that I smoked some cannabis with a few flakes of hash over it at 11 probably didn't hurt... Its much like GHB or (of course) other benzodiazepines. Its a little less euphoric than Valium, but I seem to have more physical effects. Much more feeling of muscle relaxation.\r12:10AM</p><p>I feel at about the same place, maybe a hair stronger of a high. Its very much like Valium. I'd have a hard time telling them apart. It seems a little more clear headed and less euphoric, but not by much - and this is probably dosage related. I feel very relaxed and peaceful, listening to music is nice, I feel no urge to do much but sit and relax. Walking, I notice my coordination is a little impaired. I'm a little tired but not sleepy. The addition of cannabis to the mix is nice. I wouldn't go out of my way to look for this substance, but I'd certainly do it again if it crossed my path.\r1:50AM</p><p>I don't feel a significant drop in effects. Maybe a slight one. Listening to music, and just relaxing. Nice.\r2:30AM</p><p>The effects have noticably decreased, though they are still definately there. I'm beginning to feel the call of sleep. I think its safe to say this report can be wrapped up by saying that I'm going to go and get a nice, long nights sleep.</p>"
}
