{
 "title": "Not What I Had Planned",
 "author": "Godric Greenbeard",
 "citation": "   Godric Greenbeard. \"Not What I Had Planned: experience with Salvia divinorum (ID 23916)\". Erowid.org. Apr 7, 2007. erowid.org/exp/23916",
 "substance": "Salvia divinorum",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "sublingual",
   "Salvia divinorum",
   "(leaves)",
   "  T+ 0:30",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23916",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 7, 2007",
   "Views: 2665",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I ordered some Salvia Extract to smoke, I had never used the Extract before.</p><p>It arrived in the mail within two days, so I got my leaves I had, and rolled a Quid and started chewing. Within fifteen Minutes I started seeing slight visuals, looking a lot like Trace residual images left if you stare at something bright for too long.</p><p>Thirty minutes had passed, harder visuals occured.</p><p>I then proceeded to spit out the Quid and fill my pipe up with a bowl full of the extract, 1 gram in measurement. In the suggested manner I enhaled the bowl in three large intakes, making sure I held each one in for twenty to thirty seconds. During this time I was lying on my bed.</p><p>About two minutes after the Final inhale and exhale I proceeded to get tunnel vision, and then I noticed that I was at a creek, and I noticed that two beings, I got the sense that they were a man and a woman. They were filling up a boat with 'Stuff' I could not tell what it was. They looked at me and then began to speak to each other.</p><p>I could not understand the 'words' they were speaking, however I understood the 'meaning' of what they were saying to each other.</p><p>It seemed that they were asking each other how I could see them, and then the Male asked what they should do now that I saw them, should they leave? should they stand still in hopes that I would not notice them further, and they finally came to the conclusion that they should leave. Upon hearing this I got frightened, and I don't know why, I believe I spoke, however what I said to the Beings was, 'What will I do now that you are gone?', however I did notice that my spoken words that I actually spoke came out as gibberish.</p><p>They replied, something like, 'It is ok, the other one will be here soon, and you will be with the other from now on, we can't stay, because you saw us, and once you(and by this I got the sense he was referring to humans) see us, we have to leave.' I looked past the two in front of me and saw a smaller figure quickly appear in the lower left of where they were standing, I looked at this smaller figure and felt myself leaving the tunnel, I saw the other two leaving in the boat on the creek and I tried to say bye, and the two I believe said bye and referred to me by my childhood name.</p><p>The next thing I remember is that I am staring at my alarm clock and only four minutes had passed, I got up feeling a slight pulling effect on my body, like I was leaning forward by my ankles. I went and got a drink of water, I was sweating pretty bad. I then sat down and talked to my wife about what I had just experinced. Within twenty minutes after sitting down, I was completely out of my 'after effect' , and I actually felt quite refreshed.</p>"
}
