{
 "title": "Phen Phun",
 "author": "Murple",
 "citation": "   Murple. \"Phen Phun: experience with MDMA, 2C-B & 2C-T-2 (ID 2391)\". Erowid.org. Feb 16, 2001. erowid.org/exp/2391",
 "substance": "MDMA, 2C-B & 2C-T-2",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 0:15",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:00",
   "4.0 mg",
   "oral",
   "2C-T-2",
   "(pill / tablet)",
   "  T+ 1:53",
   "7.5 mg",
   "oral",
   "2C-B",
   "(pill / tablet)",
   "  T+ 2:10",
   "2.5 mg",
   "insufflated",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2391",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 16, 2001",
   "Views: 19445",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n11:30PM</p><p>-------</p><p>        I've been fasting since early yesterday evening (~30 hours). I</p><p>have here one Mitsubishi pill (MDMA), 10mg of 2C-B (as 5mg pills), and 4mg</p><p>(1/2 pill) of 2C-T-2. The plan is to take the MDMA first (as 2 halves, 15</p><p>minutes apart), then the 2C-T-2 when that begins to decline, then wait 20</p><p>minutes or so for potential nausea, then eat the 2C-B. This promises to be</p><p>a good night! I've never had 2C-B before, so I'm trying to go for the</p><p>Shulgin classic combination from PiHKAL. The 2C-T-2 is only to make up for</p><p>the low dose of 2C-B, and hopefully will not too much color the </p><p>experience.</p><p>        Well, half the MDMA is down the hatch!</p><p>11:45PM</p><p>-------</p><p>        Other half down! I think I'm already feeling the first half of the</p><p>pill! Must be the fasting... fasting can make a massive difference. Alot</p><p>of butterflies in my stomach. Bees. Wow. I've been wanting to do 2C-B for</p><p>years, since reading the old Reed College 'bromomescaline' thing. Nexus.</p><p>The elusive Erox. I hope this is as good as I've heard!</p><p>12:10AM</p><p>-------</p><p>        Damn, the MDMA is really beginning to kick in. Only 40 minutes in!</p><p>Fasting definately makes a difference. Its been a while since I've fasted</p><p>over 24 hours.</p><p>12:30AM</p><p>-------</p><p>        Wow... I'm going pretty good! I'm getting alot more than I have</p><p>off these Mitsubishis before! I think I need to begin fasting before trips</p><p>again. Not only does it make the onset faster and the effects stronger,</p><p>but you feel alot 'cleaner' with an empty system. I wholeheartedly endorse</p><p>a nice fast of 24 hours (or more) before most entheogens.</p><p>1:00AM</p><p>------</p><p>        Down the hatch with the 2C-T-2!</p><p>        I'm in a great place. I read some email a friend sent me today</p><p>which I found very touching. I spent some time thinking about that friend,</p><p>and realized she truly is one of the treasures of my life.</p><p>        Spent some time laying down, just thinking. I love to do</p><p>MDMA-class drugs alone or with a small group of friends. Doing it at raves</p><p>or clubs is a waste. Too hectic for some of the sublter, delicious</p><p>effects. Doing it alone is especially luxurious... you can melt into a</p><p>wave of pure feeling. Lay down in a nice quiet dark room... maybe some</p><p>mellow quiet music... nice!</p><p>1:23AM</p><p>------</p><p>        I think the 2C-T-2 is coloring the MDMA some, hard to tell.</p><p>Anyway, I just ate about one and half of one of the bees... I cut off</p><p>about half of one and crushed it, to snort. Might as well, considering the</p><p>small ammount I have. The stuff I powdered, I put into 4 *very* small</p><p>lines.</p><p>1:40AM</p><p>------</p><p>        Schnorrrt! First bump, not too bad... Second, not too bad there</p><p>either. Two more... Third, in the other nostril - little sting. Nothing a</p><p>squirt of saline nasal spray doesnt fix... All done! Not bad at all.</p><p>Little bit of a bad taste, thats it. I assume the filler material in the</p><p>pill probably buffered it alot.</p><p>1:50AM</p><p>------</p><p>        Definately feeling alot more than MDMA now! Im feeling sweaty.</p><p>Sorta mescaliney, but the body sensations are still all MDMA. But wow,</p><p>they're increasing.</p><p>1:53AM</p><p>------</p><p>        Whoops, just went from sweaty hot to cold. Here come the bees!</p><p>2:05AM</p><p>------</p><p>        Wow. Very nice. I feel very cool, almost cold, despite still</p><p>sweating a little from the MDMA. I feel very good, physically. It feels</p><p>somewhat like a low dose of mescaline, or the latter part of my 2C-T-2</p><p>experience. Not outstandingly visual (yet?) but feels great physically and</p><p>mentally. Only drawback - it seems to enhance the MDMA jaw clench quite a</p><p>bit. Small price.</p><p>3:35AM</p><p>------</p><p>        Im in a really interesting space. VERY nice. Much like mescaline,</p><p>indeed! Similar to my San Pedro experiences, but milder on the body. I can</p><p>feel the 2C-T-2 in there, and the MDMA... but theybe all melded into a</p><p>nice whole. Colors stand out in razor sharp clarity. Very vivid, yet</p><p>natural. Mescaline-type visuals overall.</p><p>3:45AM</p><p>------</p><p>        Wow... this has only been 10 minutes? I must be experiencing some</p><p>pretty heavy time distorions. Laying down in bed with my eyes closed I had</p><p>some great closed eye visuals. I see things flitting around the corners of</p><p>my vision with open eyes. Colors are ultra-crisp. I see little fractally</p><p>overlays over alot of things. Shimmery and spider-weblike. Similar to what</p><p>I've gotten from mescaline. Sounds of crickets outside are amplified and</p><p>reverbate - natural music. Physical sensations are amazing. Not quite like</p><p>mescaline or MDMA but about half way in between the two polarities. I can</p><p>feel the MDMAishness fading some, but the 2C-B and definately the 2-C-T-2</p><p>are going strong still! In some ways theres a GHB-ish feel to the physical</p><p>aspect. This is very interesting... and nice.</p><p>5:10AM</p><p>------</p><p>        I'm still pretty stimulated, and my visual field is still pretty</p><p>crisp, but I'm on my way down now. Out with a little pot and GHB, then</p><p>sleep, I think!</p><p>Conclusion</p><p>----------</p><p>        Well, it took me till near 10AM to get to sleep. Perhaps the</p><p>2C-T-2 was responsible for that. There was a long lingering effect, with</p><p>good visuals lasting the whole time. Phenethylamines are unlike</p><p>tryptamines that way... the effects are more spread out and continuous,</p><p>rather than the sharp peak, gradual decline, and long tail of tryptamines.</p><p>It was definately a nice experience, and I hope someday to get to explore</p><p>2C-B at a more appropriate dosage range.</p>"
}
