{
 "title": "Telazol Analogue",
 "author": "Murple",
 "citation": "   Murple. \"Telazol Analogue: experience with Alprazolam & Ketamine (ID 2395)\". Erowid.org. Jul 13, 2000. erowid.org/exp/2395",
 "substance": "Alprazolam & Ketamine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 1:20",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 3:05",
   "30 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2395",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 13, 2000",
   "Views: 22509",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n(Note: Telazol is a prescription anesthetic combining the benzodiazepine zolazepam with the ketamine analogue tiletamine)\r9:40PM</p><p>Crushed up two 0.5mg generic alprazolam tablets. Down the hatch!\r11:00PM</p><p>I'm feeling the alprazolam, but not very strongly yet at this point. I did eat a little earlier, which may account for this. Time to try and enhance the experience with a little bit of cannabis.\r11:02PM</p><p>I didn't realize how much the Xanax was affecting me until I just stood up and tried walking to the kitchen just now. My coordination is quote impaired. My muscles feel wobbly, as if made of Jell-O. My visual field is slightly altered... when I turn my head, the room appears to move around in a somewhat jerky manner, with an odd sort of trailing effect.\r11:10PM</p><p>I am feeling the effects fairly well now. Stronger than my last experince, but not dramatically. GHB is a much fuller-effected depressant with more recreational potential... at least judging by this dose. Time to try cannabis potentiation.\r12:45AM</p><p>The cannabis helped, but I think the alprazolam was just a rather small dose. I've read about the combination of benzodiazepines with ketamine, in medical use. It appears that the benzodiazepines may inhibit both the more interesting psychedelic effects of ketamine and limit the risk of organic damage such as Olney's Lesions. I decided, due to the rarity of me obtaining benzodiazepines, to try this combination, since the alprazolam itself was not all that interesting. I laid out and began snorting 30mg of ketamine HCl over the next 10 minutes.\r12:00AM</p><p>Interesting... The benzodiazepine does seem to inhibit the psychedelic aspect of the ketamine. I feel rather intoxicated, as if I'd taken alot more alprazolam than I actually did. Going to lie down for a little while.\r3:30AM</p><p>Recover consciousness - still rather inebriated.\r3:48AM</p><p>Still feel the Xanax a little. I decide to take a little bit more ketamine and lie down, and let the combo just fade into sleep.</p>"
}
