{
 "title": "Exploratorium",
 "author": "SmartBoy",
 "citation": "Citation:   SmartBoy. \"Exploratorium: experience with Mushrooms (P. cubensis) (ID 23979)\". Erowid.org. Apr 10, 2007. erowid.org/exp/23979",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 23979",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2007",
   "Views: 2920",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPsychedelics have always interested me, and yesterday I had my first real chance to use them.  It was a scorching spring day in Phoenix, when I obtained the shrooms, I was buying half an ounce at a really awesome price for some people and we agreed on a 5g cut for me.  This was at 3pm, and for the next 6 ½ hours, the time during which Id like to have shroomed, my family seemed intent on drowning me in chores, which Id been neglecting all week, damn I am so stupid.  I had decided to not do them at that point, even told my girlfriend (lets kall her S) so.  S would have been my partner for the trip.  However when I saw the little buddies again at 9:30 something very irrational made me want to gobble them down right that second, despite having read all those reports with the good tips in them for almost 3 months.  So I call her back up again, she is already in her PJs, but after a while I coax her into agreeing to take them.  If Im going down, not alone.\r\n10 minutes later Im at her house, only her lazy dad is home, snoring in front of his PC as usual.  Reading the newspapers online must not be very interesting.  We decide to make a tea out of the 5g, and believe it or not, both of us agreed that it tasted exceptionally good.  We also split and ate the strains, with some pepper, just to not let anything go to waste.  This was at exactly 11pm.  Here just a note:  Ive had 2 experiences with MJ before, and am so sensitive to it that I hallucinated for 1 h every time I smoked it.  This happened from 1 rip of a bowl Ive seen people take 10 from and still be ok.  Some call it luck, I dont, because those 2 experiences made me depressed, fuzzy and stupid for 2 months.  As you might understand, I was a little nervous.  S however was totally cool.  She smoked a lot o herb in her day, and considers herself only mildly sensitive.\r\nAfter 15 minutes the first effects set in.  I got this incredible butterfly feeling in my elbows and chest, felt like someone told me Id get a million bucks if I do this intimate scene with ohh(*insert favorite model name), but sadly they wanted the scene to be perfect so theyd need a lot of takes. This feeling soon grew more psychedelic.  I was standing in the middle of her room, and it felt like my feet were melting with the carpet, growing roots.  My body started to flow as if in an invisible current, and I could see what looked like fractal images behind my eyes.  Very peaceful.  This lasted for 10 minutes, when I decided for the both of us that we were going to go outside.  She didnt want to, just wanted to stay in bed.  The trip was coming on so fast though that I just had to go, explore.  After telling her Id go alone if need be, she finally got up.  According to her, afterwards, she was hardly feeling a buzz at the time.\r\nThis puts me about 35 minutes into my trip, and we were jogging in the neighborhood towards a local park.  This is fun!  Im usually red-green blind, but the mushrooms must have released something, because my entire world was in shades of green and red.  Maybe this is how other people see it?  Never was it so colorful.  Running in itself is great fun also; very soon I lost the feeling in my legs, and my beshroomed head was gliding over the pavement by itself.  Worth the try.  The trip was getting stronger though, and to me it felt as if Id been high for an eternity already.  The first thing I noticed when we got to the park was the grass.  It looked like it was all the same, like a rug with a repeating pattern.  Also, there seemed to be little green snakes moving in it, all moving in unison like the waves of an ocean.  There were other phenomena as well.\r\nThe trees to me were not as other people describe them on shrooms, but you know, just trees.  However, their green branches against the red city sky are a wonderland for the minds imagination.  We laid down under one, and I saw all my friends in them, my future hang glider, a waterfall, monkeys, faces and much more.  Playing with your imagination like a little child is such fun, beautiful.  However, there was one thing that bothered me: S.  I could feel that she was not tripping, but she could feel that I was.  However S couldnt just do what was natural to her and enjoy whatever she was feeling.  While I went exploring in the park, she would follow me around, complaining about how late it is, etc.\r\nShe had read a few reports also, but had cared far less for the event than I.  She was simply bored.  Somewhere though she had read about this guy who got bad vibes from trees, and she would say things like:  Look, the trees dont like you, lets go, or They are telling me you should go.  She must have thought it makes me stupid.  This is where I realized how egoistic she can be, because what she was saying was obviously not true.  I was still sane enough ask her in all earnest if the trees really told her that, and she said No, but I want Damn. Well, I didnt let this affect me at all.  It was beautiful.  It felt like all the things I knew about us just edged a litter closer in my awareness, but were still the same.  \r\nThen, after what felt like 2 hours, but was only 45 min, we went back to her house and up in her room.  I stayed in her room for the rest of trip.  In the beginning we were very quiet, applying our psychedelic powers inward, neglecting the distracting visual field.  After a while I started to explore her room by touch, which was really revealing.  You can truly tell a person by the room they live in, oh yes.  After a while I started seeing her room with closed eyes, or should I say I felt its spirits.  Enjoyable.\r\nThen, after what mustve been another ½ hour, we started talking about our relationship.  We usually dont do this, but just felt in the mood for it.  S had a really hard time understanding my side of the story because my mental power was good enough to realize what was being said, but voicing it was too complex.  It often came out wrong.  Somehow she got really mad after a while, turned her back to me, told me I was a babbling fool, now and in real life, and just counted down all the things she hated about me, and what other people dont like.  She doesnt know what favor she did me with this.  I felt as if a wave of truth was washing over me, straight from the source so to say.  I was smiling all the time, she didnt see.  This was the truly best experience of the whole trip.  It made me feel that I know my strengths + weaknesses much better now, accept myself more and deeper.  They were right before me, and it is great to recognize them.  Shes a great lady too.\r\nAfter that we made up, and for 1-½ hours I was proving to myself that I was still high by making the spirit of her Salvador Dali picture move around the room.\r\nIn the morning we were very tired, my thoughts were still different, deeper.  What pissed me is that she said that I only got more effects because mushrooms are medication, and since she was perfect already she didnt need them that much.  Having a good bod is not all it takes, lady.  In school concentration seemed good.  Unlike with juana, my head is free and clear now, I feel tired but good.  My reading comprehension is excellent.  I will embark on a stronger trip soon, exploring the desert surrounding me.  My expectations are high.\n\n\n"
}