{
 "title": "Call Me Crazy",
 "author": "Kaela",
 "citation": "   Kaela. \"Call Me Crazy: experience with Paroxetine (Paxil), Citalopram (Celexa) & Fluoxetine (Prozac) (ID 23991)\". Erowid.org. Jun 8, 2007. erowid.org/exp/23991",
 "substance": "Paroxetine (Paxil), Citalopram (Celexa) & Fluoxetine (Prozac)",
 "bodyweight": "90 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Paroxetine",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 23991",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 8, 2007",
   "Views: 10454",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI just want to put in a word to anyone who is looking up information on this antidepressant: I think it's terrible. It's got to be one of the worst. \r\nFor a brief history, I took Paxil obediently and consistently for 8 months on my psychiatrist-determined dosage. Then 3-4 months on my own idea of a lower dosage, and then secretly tongued my pills pretty regularly for the next 2 months they documented. I was also on Celexa and Prozac(fluxotine) before refusing further treatment. Paxil was supposedly the 'ideal' medication for my Axis-II diagnosis of Major Depression and Generalised Anxiety. \r\nAnd it gave me the shakes and kept me up all night, sweating and clenching every muscle in my body unwillingly, ground my teeth and gritted my jaw until my head felt like it was going to split. I couldn't sleep on a low dosage. On the higher dosage, I couldn't find the strength to stay awake. I couldn't sit still either way--jittery muscle twitchyness. I'm a particularly small, thin female so the physical adversity might have been unique to my body--but I don't think I'm the only one to have this sort of experience. \r\nThe physical symptoms were uncomfortable, but the part I truly hate about taking this substance is the fog in my head. I felt like I was losing my mind. I couldn't think about anything--I can't describe it. It makes my head go.. not blank, but grey. like mist. There's things in the mist, but they're shrouded. The whole world is shrouded in a cold, heavy, dead fog. Not like a visual hallucination, but I'm so far away. Like everything is coming from a great distance, and it's such an effort to get through the distance.\r\nIt's not a good feeling. Its not a comfortable distance, like downers. it's like losing your mind. It sounds like I'm describing tranquilizers or painkillers, but it's not even like that. I can't begin to describe it--where the connection breaks down, between my head and my mouth, thoughts feelings and the rest of the world. I can't *think* or remember anything or concentrate, anything. It shot my memory all to hell while I was on it and it's terrifying, because it doesn't wear off! When I stop taking it, it doesn't go away! Apparently paroxetine stays in your system for some inordinate amount of time--after a MONTH or more I think the feeling lessened but I could practically feel the little molecules clinging to my neurons, clogging my brain, like they'd permenantly changed me into a feelingless, mindless zombie. Again, this is not exactly typical of other popular SSRI's.\r\nI realized after some time, reading old journals, I had gotten completely delusional in my perception of reality. Not in a happy/depressed way--rather, I couldn't put 2+2 together, logic escaped me, etc. The fog in my head. I got so desperate to get back to normal, I stopped taking the meds secretly, and I thought it would never leave my system. I was sure I'd be like that forever--maybe I still am. Plus the withdrawals--like HELL its non-addictive.\r\nOther antidepressants aren't like this. I feel like it changed my brain. The experience was awful, and completely useless to alleviate my 'anxiety and depression'. I came to my own conclusions about how to conquer depression--I guess everyone has to, but this drug doesn't have to be part of the experience.  I know my opinion seems really strong and drastic but I violently dislike this substance and the idea of other kids being put through the mental torture of it. Just take something else, if you really want an antidepressant. This is like taking Thorazine instead of Ketamine.\n\n\n"
}
