{
 "title": "Notations and Logs",
 "author": "Redgreenvines",
 "citation": "   Redgreenvines. \"Notations and Logs: experience with Salvia divinorum (10x extract) (ID 24024)\". Erowid.org. Jun 11, 2007. erowid.org/exp/24024",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24024",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 11, 2007",
   "Views: 2766",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Friday, May 23, 2003</p><p>3:10 AM: awoke with allergies (lots of trees in Toronto) and flushed eyes with Witch Hazel eye wash. I went to basement to look on the internet, the pipe and stash Salvia 10X extract and tweezers and lighter compactly wrapped in a piece of leather were in the pocket of my housecoat. Recently, so many near opportunities to explore Salvia had been bypassed, but not because I had not been carrying the small leather pouch. Anyway after checking a few web sites and boards that I like, the leather came undone and a single tweezers worth of 10X went into the little pipe. Since nobody was awake, I was not at a window, nor did I obsessively roll everything up in it's leather again after inhaling, but I just leaned back.</p><p>I put my legs up on the desk which was extremely refreshing considering what I was (not) wearing, and the saliva visuals emerged as cold vines running the long length of the backs my otherwise short legs. Pleasant psychedelic lights intermingled with everything. I could move but did not want to  it was great, bordering on painfully stretching of the limbs. Echoes of my own bits of attitude were detected, and tolerated. I have been learning to accept incompleted problems and thoughts and I didn't need to answer to all fragments of my arising self. The room became cool and very comfortable. Space time was relaxing with me.</p><p>After ~6 minutes I cleaned up and repackaged my kit, and went back upstairs, into bed, gently shoe-horning the exotic into my life. Before sleeping again, a gentle approach to each family member's most pressing needs was visualized  just how it was.</p><p>Sunday, May 18, 2003:</p><p>Expected to take SD in the bath this am, but I just kept reading there instead, no need to rush SD for now. Nice to have the window open anyway. After bath I called down to my wife and reported that I had not yet lit the pipe, but plan to do that now. I took my regular amount, one good tweezers pinch of 10X, which gives me one big inhalation when lit.</p><p>By the time I hit the mattress Red Vines with White Flowers had run off in all directions, and, when face down in the pillow, they had become massive red walls of plant flesh expanding and growing. I was aware of the others, a sense of young men and women around, and I was sensing this being the SD place again. This place, so real seeming  emergent from the activity of the vines - which can't be, where many physical laws are different, is twisted, I can't explain the differences, can hardly wrap my mind around or toward what these twisted laws are.</p><p>After about a minute it is too much, I am too hot, I get up, walking is relaxing, cooling, the vast strangeness fades a bit, 1/2 minute later I return to the bed, the intensity has passed, I wish it had not passed yet, though I had walked it off purposefully. I am now cool. My wife comes upstairs for her shower and starts talking to me from the washroom. I answer - sounding normal.</p><p>My reclined body extends down through the bed - includes the floor - includes all the walls, and includes her standing in the washroom. We talk, but it is funny to me because we are one person connected through the floor and everything, which is part of the other universe too.</p><p>======================</p><p>Saturday, May 17, 2003</p><p>Busy day lined up, but things not working according to schedule. At 10:30AM it seems I can have a salvia break but only a small one with my bath. Merely at threshold - invigorated, and after a modest lift I just forget about it. At noon, daughter's friend Anna comes over. The kids had supposed I could teach her calculus which I cannot remember from my high school and university. It seems I helped the girl quite a bit after all, over a period of 1.5 hours. SD is a good block remover, and augmented my patient exploratory mind enough to give the student a lot of confidence, and for me to relearn some interesting math.</p><p>======================</p><p>Friday, May 16, 2003</p><p>After everyone went (house guests) out, or to sleep (wife), after a heavy week of work and family egos, finally a moment to salvour occurs. 'Whoops  you put a bit more in there than you should have fella.' 'Nah  it's such a small pipe, but that was three tweezers pinches usually just 2 go in.' (self talking to self before lighting the pipe) This time the vines appear before the pipe is put away, before the exhalation is over. This time it is a bit funkier, the buds on the vines are more close together and more like mandallas, trefoils or flowers. I put the pipe back in its leather wrap, wash the bathroom sink of ash, and manage to get to the bed, and close the bathroom door so it can air out of SD smoke.</p><p>Next thing I know I am back up cleaning the washroom again of any ash, closing the window, and going back into the bedroom, but I know it is the second time, because the pipe is already in the bedroom wrapped nicely. Obsession has taken over. I am on automatic. Instead of getting into the bed, I just stop the repetitions and sit on haunches on floor, in the dark, and rest quietly, and it is very good feeling, stable, restful. All the connections from the week can breathe from this unusual position. I am glad that nobody saw me there; the position was a bit odd. Merely the last pose taken when the obsessing stopped, and the letting go started. I kept that pose for around 8 minutes and got into bed rested, but wondering if I didn't want to try that again immediately. (Clearly back to the obsessing) Nahhh, I just adjusted the pillow, rested there and fell asleep.</p><p>==========================================</p><p>~Tuesday May 13, 2003</p><p>I am the only salvianaut in the house, but my wife is my sitter, (yet she has no idea about what that means - I just tell her when I am going to be doing it and she knows that for 6 minutes I am going to be between universes) I like her around. I am more sensitive to her needs since this discovery (SD). I feel more awake to human realm issues and to the spirit in each of us. I think the influence has been positive, yet it is one-sided since only I am aware of what is going on, she has no interest in what has been going on with it - I think it might stay like that - it is not for everyone.</p><p>Last time I did it (I did not make log entry) I was actually talking with her during the 6 minute peak. I managed a near normal conversation, but I was aware of a vibrant red network of plastic like mesh which could have been a luminous rendering of face muscles around my face as we were talking, her voice was close but as if through a tube. I could have kept that up for a long time talking about nothing, it was very enjoyable.</p><p>==========================================</p><p>Monday, May 12, 2003</p><p>Yesterday at around 2PM, I had an opportunity  after all chores, shopping, installing a ceiling fixture, etc.- to visit a different aspect of SD - the divinatory aspect. I had become aware of an acute family problem, with no idea how to resolve it. Little ideas formed and dissolved in my head, but no way in or around the insolvable problem. I took the SD in the normal way, one puff 10X, and lay down and forgot about everything. </p><p>First, as usual, I thought it was not enough, then, around 45 seconds later, I was in the garden again, with the busy people, this time I was aware of people loading a truck, a sense of labor was very strong, I could not remain just lying down. I got up from the bed wearing just a housecoat after my bath. So I got up as the most intense vines faded. I was pacing around the bedroom watching the carpet dissolve at my feet and reform. There was just enough carpet material to support me but most of it was space  insubstantial and in flux. It felt marvelous to be pacing or whatever the irregular walking movement or dance could be called. I was compelled to keep moving my feet on this interface between universes, this amazing semisolid but supportive gas carpet flux. Afterwards I feel like I may have been making some adjustments through this action, but to what I do not know.</p><p>Then I dressed, left the bedroom and began painting the edges of my most recent canvas, - a task which needs not too much dexterity. The phone rang, and it was for me. And it was the problem and the opportunity. And I was fresh clear and I had no preconceptions. I was like the carpet, forming and dissolving, feeling my way through life and love and not knowing. For the next 3 hours a drama played out in which honesty caring and unusual admissions occurred. I cannot go into details, but the results again were astonishing.</p><p>==========================================</p><p>Sun May 11, 2003 1:46 am</p><p>I went to see a friend today. I had my pipe, some 10X in a contact lens case, and some tweezers wrapped up in a leather pouch (now I even look like a shaman). It was just past breakfast my friend wanted to give me some nice weed he had grown downstairs. I told him and his wife about salvia, he was very interested, I said I had some, did he want to try? I explained about sitters the not operating machinery or torches for 2 hours - about feeling hot - about a 6 minute experience followed by nice stuff. Still interested.</p><p>We went to the living room and I gave him 2/3 of my mini-pipe full which is heavy for me. He barely noticed, I gave him a full pipe more right after that. His lady sat on one side of him on the couch, talking a bit silly (she never gets high but contact always). The big man sat there, turned reddish as if he had been smoking marijuana for an hour, and said this is very strong, I can't describe it. 'Time has changed. Thank you. Thank you.'</p><p>This was the biggest rush for me yet with SD - sharing it with a someone who really was ready to like it. I was stunned though since he said there were no visuals. He had ~3 times as much as me when I writhe through synesthesiatic visions. But it was very lovely to turn him on to it, and to see a seasoned appreciation on his face.</p><p>==========================================</p><p>Saturday, May 03, 2003</p><p>12:47 PM:</p><p>After Shopping groceries, after rollerblading, after bath, and after a strawberry: Just over ½ lung full of 10X. 15 seconds after exhale: walking to stripped bed in housecoat was easy. 20 seconds after exhale: lying face down, the space changed radically. As if there were any doubt of an intense effect. I sense a very big rage (a psychedelic/emotional state) coming on.</p><p>The perception is of impossible angles for doors, walls, bed and to the body itself  there is a major occupation of space with the Rendthes (the vines and plastic toys). Amazing, everything is inseparable, gummy connected. I want to bring some of it back to normal space. I want to challenge this folding of space. I get up and know I should not. I am railing  rebelling - raging, perspiring intensely. Then I lie down again, this is better, but then feel compelled to get up again, this is right too(?)- it is because I want to bring some of this solid vision back.</p><p>What was I battling and thrashing against? I think I should try not to get any souvenirs. I can't blame myself that I just want to bring some of this back. Raging (a term of intensity fluidity, stormy and fiery all together). I decide to try something healthful and so I struggle to open a liter (quart size) bottle of Evian, and begin to drink directly from it. Walking around the bed, I feel insane. It is so rich and consistent with the experience of the garden I have had so many times before. It is fading. The doorbell is ringing. I am sweating and still too wild to answer, but the rage is passing.</p><p>==========================================</p><p>Friday, May 02, 2003 8:40 PM:</p><p>½ lung full of 10X</p><p>I walked quickly straight to bed from the washroom where smoke has to be exhaled out the window. My wife is asking me to choose a TV channel; I explain that I can't right now as I am trying to find the bed. She turns off the TV and reads. Many paintings (~40) were moved into the bedroom recently  they are stacked neatly all around the bedroom. One of them  usually little noticed for it's meek color scheme  opens into a huge 3-d space. The dark parts of it conspire with all the other dark parts of the other paintings and with the light parts of everything in the room to form Rendthes. I feel the muscular strength of the Rendthes. The conspiracy of Rendthes and the paintings that brought them out makes me squirm. The depth of the illusion of that one painting is wondrous.</p><p>All over too soon. No one to blame.</p><p>==========================================</p><p>Friday, May 02, 2003 4:33 AM:</p><p>10x using 2 pinches from a tweezers, a perfect amount for me @140lbs. Goes to *V* in the *S A L V I A* scale. Just a bit of *I* one half breath exhaled and put kit away. In the basement office, dark, only one small lamp. The clear glass of water on my desk on the way in to Salvia space was understandable - the rest was strange. My legs were too small. I reached for understandable. The nice water was drinkable. The space around full of colored rendhtes vines connecting the plastic toys that go everywhere around the vision and the space - around the monitor and all around my body, we know what they are but that is not true either.</p><p>The space is folded, on the other side they know more about this. I had another drink of water. We think I am making mistakes. I was here but not too stupid to understand the glass of water. I turned around in the chair slowly with much freedom. It was such a tiny bit to smoke.</p><p>==========================================</p><p>Saturday, April 26, 2003: now the work begins, the need to describe can fall away, raising of eyebrows, knotting of fore head  searching for the right word, emoting toward eloquence, all that nourishes a kind of error, which I now have to let down, in favor of the work itself which  believe it or not  is not this log. I prepared my pipe a new way using a folded paper to pour the 10X into the pipe. I overfilled, targeting at less than ½ and achieving 2/3 to 3/4 , I pressed it down to see if it was too fluffy. I smoked in the hot bath with the window open for cool air, had an art book for stimulation. The material crackled during the burn; a bit unusual for that, maybe we hit extra salvinorin? Cool.</p><p>After the breathing out, very cute and Cheshire cattish, the space began to shift. Back to this SD garden I have been to before. My status is child, not especially in favor of the (not visible) adults. The plastic toy vines and ducks ranged, inter-dispersed with fragments from my bath room, like a flowerpot, & a tampon box. Open-eyed visions.</p><p>I crumbled under the pressure, the heat of the bath, and began to ease out of the bath on my belly, like a snake. ½ way out of the bath, the raging mindless effort to wrap the experience in words was identified as part of the overall tension driving the snake from the bath.</p><p>The work begins, and it is to ease up on descriptions and analysis. The peak this time was long, around 10-12 minutes. My wife entered the room  closed the window  'Why are you smoking so early, rag, rag,  rag.' I wanted to say I was working, but I complained about closing the window instead to move the focus back to her action space and away from mine. Lots to not think about (I don't mean ignore - I mean without efforting about words), without a screwed up forehead or tight lips.</p><p>=================================================</p><p>Friday, April 25, 2003</p><p>9:08:17 AM</p><p>Setting -</p><p>A) our attic guest room with sliding door and bed,</p><p>B) our attic bathtub used mainly by daughter who was out.</p><p>premise - TV for wife's morning exercise too noisy to read in bath. Bath filled but temperature not tested.</p><p>Action-</p><p>Open sliding door to let out smoke smell. Nice cold morning air ~40degreesF. Fill pipe carefully for one inhalation. Ignite while kneeling in open doorway, face outside. Hold. Feeling the cold as I practically naked for bath to follow. Exhale. Wait 15 seconds, close door and replace wooden bar. Thinking' I am not supposed to be doing this-relaax, this is good, this is good.' Lie down on bed 'this is good.'</p><p>Vision - </p><p>The cold doorway is a rectangle. I feel the doorway in multiples, the fabric between the many doorways takes on the green red and yellow, everything is one substance, either doorway or between doorways. This is good. I get up after about 2 minutes and go to the bath, put in one foot, sliding off balance. 'Wow! Way too hot. Add cold water.' Crouching wet dripping on edge of tub, now I am an naked Indian at a hot spring. Between the hot of the bath and the cold of the attic doorway. I am like the space between the doors, between the hot and the cold. I am the Indian connected to all the other Indians - no separation.</p><p>The bath cools. I get in. Velvet, excellent. I think of my daughter and all the other Indians who have used this bath. (we are not indigenous racially just in spirit). Nice!</p><p>============================================</p><p>Date: Tuesday, April 22, 2003</p><p>I skipped yesterday. SD just did not fit in. I was painting earlier tonight, and took an SD break. I loaded the pipe to 1/3, one near full breath, and leaned back on pillows. This was sudden impact, not unfolding, no fulcrum shaped centers to speak of. But fading in fast - large images of dinosaurs - complex shaped, plastic-y, barely interlocking. Quite Aztec-y overall.</p><p>A conversation of mes. We were discussing how different this is than what I have been describing earlier. How more detailed and physical this is and we began to try to articulate what it is. Some plastic tulip shapes writhed through nicely. I was writhing a bit since it was only 1.5 hours after a heavy meal. All was skewed like my reclined posture. I sat up. The painting of daughter #1, done 4 years ago, was extremely 3-D, emergent from the wall. Enthralling, and the painting of daughter #2, done minutes before, also became very 3-D and observed me. I shifted between the two of them. Amazed at how real they had become. This was like being visited by both of them. Now I am back to an enriched sage-ified state, and life as usual.</p><p>'till the next time...</p><p>==========================================</p><p>Sunday, April 20, 2003</p><p>This is becoming a log. I must say there are gaps, but I want to enter some pertinent visionary records. This morning I took a healthy 1/2 of my tiny pipe, a full breath of 10X. I lay back and let the visions begin. First a softening color enriching of everything. Then a strong central pivot - dark with extensions like an elbow, green and pink with some yellow highlight. At each point of consciousness one of these dark almond shaped pivots and extensions like some modern plastic assembly toy, -way - better than lego (4-D). They emerge from the fabric. They are the fabric.</p><p>I open my eyes, they dissipate, I close my eyes. At the dark points from my last view like corners of paintings, faces in paintings. Furniture shapes. At each nexus, a dark pivot emerges quickly and articulated extensions connect everything. I sit up and drain my coffee mug  delicious, smooth tasteless - full of flavor. I lie down again. This universe is twisted and more spacious. It accommodates some alternate connected totality, and it maps directly onto everything in here and now. As it gets closer to 6 minutes the large shapes and power of twist fades, visionary elements become small then tiny. Normal space resumes. I get breakfast.</p><p>Some days the extensions are wide like leaves, or narrow like bones, or fluffy like sheep - always a strong sense of bend and twist to the pivots which are eye or almond shaped or leaf shaped themselves - they are integral to everything.</p><p>==========================================</p><p>Saturday, April 19, 2003</p><p>Nice morning bath. An art book on ledge. Same size, small amount of 10X ~1/4 of tiny pipe which is about 1/3 of regular hash pipe/as sold in head shops. Easily could have inhaled 3X as much. I chose a much varied geometric painting in a book to look at. Its dominant palette was tan, it's dominant shapes were Islamic arcs and circles arranged in rows and columns. As sage engaged ~35 seconds, depth of paper surface increased. Each segment of painting became richer and dominant color messages shifted into powder blue and pink, Easter colors.</p><p>I thought of the wholesome message of grandmothers and mothers. Very calming. Very soothing.</p><p>==========================================</p>"
}
