{
 "title": "Was it Pleasurable? I Can't Remember",
 "author": "Sinnlos",
 "citation": "   Sinnlos. \"Was it Pleasurable? I Can't Remember: experience with Triazolam (Halcion) (ID 24030)\". Erowid.org. Oct 24, 2006. erowid.org/exp/24030",
 "substance": "Triazolam (Halcion)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Triazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1988",
   "ID: 24030",
   "Male",
   " ",
   "Not Given",
   "Oct 24, 2006",
   "Views: 10248",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started my drug use history at the young age of 14. At that age in my city, I was still finding it hard to make the contacts with which to score the illegal drugs such as weed or acid, but I had plenty of alternatives at home. I spent the 9th and 10th grades using the prescription and over-the-counter drugs in my parents medicine cabinet and in hindsight I can tell you that most of the things which are 'legal' can much more dangerous than the things which are 'illicit'. </p><p>I was curious about everything, and had taken a dangerous amount of motion sickness pills (Diphenhydramine Hydrochloride) that nearly put me in a coma. The seriousness of that situation didn't sink in, and I continued pill popping. My parents had a prescription for Halcion (Trizolam). Halcion was popular at the time because it was a fast and effective sleep aid and unlike other tranquilizers, it didn't leave a person with a groggy hangover when it wore off.  I loved it. When my Grandmother died and we cleaned out her apartment, I found a full bottle of Halcion in her medicine cabinet. I snatched it right away and kissed that semester goodbye...I was there, but don't recall much of it. </p><p>It was the perfect drug for someone who was bored at school. I would take one at lunchtime, and it what felt like less than 15 minutes, the day would be over. </p><p>It is difficult to describe the experiences because the memories of it include little more than the onset and come down. I recall that after taking the pill a very pleasurable head rush would begin within 15 minutes. It felt as if my head were a balloon full of helium and it was floating off my body. There was a acute giddiness which followed and a complete loss of inhibition that was exactly like the loss of inhibition that accompanies alcohol. </p><p>I recall people noticing my odd behavior when the drug kicked in, and even asking if I was drunk. Memories of anything following this stage are gone. The next experience usually involved 'coming to'...a point where memory comes back and I was always somewhere else, doing something else. The typical duration of the black out was 2 hours. There would be a giddy high that was still going strong and it would last for an hour or so. The final stage was a few hours of general calmness with a complete lack of anxiety. </p><p>Because of the pleasure of the drug combined with the 'shortening' of the day it caused, I began to experiment with the drug. I took a very high dose of 4 pills and went to school like an idiot. Instead of the giddy high, I experienced complete incoherence. Everything had a blue hue to it, and there were trails to motion. I couldn't verbally respond to people speaking to me. The task of talking was just too complex. That is all I remember, and that was just the onset. Amazingly, I didn't get kicked out of school that day or taken to the hospital. In truth, I don't recall what happened at all. I can only imagine that I walked home on autopilot, probably staggering a little, and went to bed for at least 16 hours. That is the scary part about this drug..there is a blank in my experience and I am not sure what I have done.</p>"
}
