{
 "title": "4-Mar - A Versatile Drug",
 "author": "Bandil",
 "citation": "   Bandil. \"4-Mar - A Versatile Drug: experience with Trans-4-methylaminorex (ID 24057)\". Erowid.org. May 28, 2003. erowid.org/exp/24057",
 "substance": "Trans-4-methylaminorex",
 "bodyweight": "98 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "4-Methylaminorex",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24057",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 28, 2003",
   "Views: 25005",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHalf an hour ago i just turned in my exam in organic chemistry. Although i only was able to sleep less than two hours the night before, i was more clearheaded than ever and i finished the exam in record time. This is largely because of the wonderfull substance 4-methylaminorex, which i prefer over all other stimulants. It is a very versatile substance, which i will describe in the following:<br>A little less than a year ago i was so fortunate, that i gained access to unlimited amounts of trans-4-methylaminorex (the more potent isomer) freebase. The first few times i attemped to smoke it, but the smoke is to harsh for a non smoker, which made me unable to hold it in and thus get effects. All of my friends that have tried the smoking and oral route agree that the oral route is the most pleasant method of ingestion (effect wise), and thus i really don't care that my lungs can't take it. I simply eat it in a gelcap.<br>There are several situations where 4-mar is useful:<br>Parties:<br>I prefer 40 mg's of the freebase orally for a party dose. Many of my friends only need 20 for the same effects so please don't do 40 straight away. 40 mg's makes me talk, talk, talk, dance, dance, drink, drink, drink and generally puts me in a PERFECT party mood. Not as pushy as meth. 4-mar people generally don't just babble on and on like meth heads even though people are annoyed. This is a very nice difference. I have once taken about 50 mg's which made me feel like i was floating and was extremely euphoric. It was way too much for a social setting, but at raves and other places where you just generally 'groove' it's appropriate.<br>Boring work:<br>I always postpone boring tasks at work. With a small dose(10 mg's) of 4-mar i do the work very systematic and never skip any work. Work no matter what is enjoyable. The dosage is so small that noone will notice that i'm affected.<br>Sleep deprivation:<br>Just like today, there are times when one gets to little sleep. Before 4-mar it was awful before an exam for instance. But now it's no problem, 10-15 mg's clears the head like no sleep could. It's totally clear for about 10 hrs before the sleep sets in again. This substance is ideal for sleep deprivation. The duration of the sleep deprivation effect is ideal for a whole days work/study. No noticable tolerance is noted when done over a 48 hrs period. I have done this once, with three doses spaced 12 hrs each. The concentration doesn't go away as with meth over extended periods.<br>Generally:<br>In high doses it is often unbearably euphoric, yet very subtle. Often it seems that the euphoria is naturally induced (in the sense that there is not the 'drugged' feeling of meth). It seems very easy on the body compared to many other drugs. The euphoria usually doesn't kick in at doses under 20 mg's. The euphoria duration is around 6 hrs and 12 hrs for the sleep deprivation effect. At high doses the drug can be felt as long as 24 hrs after ingestion. <br>Another nice thing about 4-mar is that it does not induce the 'i want more' symptom as meth. Meth users crave more meth, whereas 4-mar satisfies the user after a single dosage. Nor does it induce paranoia... Very nice ideed :)<br>If you have the chance to get 4-mar, grab it! It's a very unique and nice drug.\n\n\n"
}
