{
 "title": "Mysterious Yet Potent",
 "author": "HighOnLife",
 "citation": "   HighOnLife. \"Mysterious Yet Potent: experience with Meditation (ID 24060)\". Erowid.org. Oct 18, 2004. erowid.org/exp/24060",
 "substance": "Meditation",
 "bodyweight": "155 lb",
 "header": [],
 "footer": [
  [
   "2003",
   "ID: 24060",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 18, 2004",
   "Views: 8991",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nRecently, I have discovered the mysterious (yet potent) powers of meditation. Many friends of mine are now getting into it, partly as a result of my influence on them, as they have noticed a change in my behavior and displayed peacefulness and all around joy. I have discovered the hidden life force energy (also known as Kundalini energy) that each and every one of us human beings possess.</p><p>I can not exactly recall what made me interested in trying meditation, but I thank God that I discovered it. After reading information on the internet (specifically http://www.meditationonline.com) I learned specific meditations and valuable information to accelerate me along on my spiritual path and chakra awakening (the body has seven chakras, each possessing its own characteristics and power). Also, special thanks to John Selby's book, Kundalini Awakining (strongly recomended to interested meditators).</p><p>After that said, meditation has been a phenomenal healing exercise that has made me feel better physically, emotionally, and spiritually. I use to have certain fears and limitations created by my own mind and I am now breaking through them. The basic point of meditation is to stop the constant flow of thoughts that are streaming through our minds every waking second. You can actually meditate right now without even closing your eyes: Focus on something, anything, and just gaze at it without really using your brain. When I do this I feel a slight difference throughout my body. This is the Kundalini energy within. I am now trying to meditate at least 30 minutes a day, which is becoming an event that I am constantly looking forward to.</p><p>The process of my meditation is like this:  Sit down in a quiet, comfortable place where you will not be bothered by anything, especially disruptions such as loud noises or phone calls. Sit in a comfortable position with your spine straight (reasonably, not so it is at all uncomfortable) and your eyes closed. The best position for me is to sit cross-legged and place one hand on top of the other in my lap. Take several deep breaths - breath in for 5 seconds, hold for 7, and breathe out for 8. This works best for me but everyone is different. Concentrate on your breathing and gently try to ease your mind. Saying to myself 'let go' and 'effortless' help to gracefully fall into a relaxed meditative state.  </p><p>Personally, I have been meditating for only 3 months, but I feel impelled to share this discovery with all the people around me as I feel it is an action toward the greater 'good', if you will. I believe therapists should teach this to their patients because the emotional healing power if phenomenal.</p><p>I'm sure everyone experiences meditation slightly differently. For me, my personality is transforming into the strong, determined, happy person that I know I am, but couldn't seem to find before I started to meditate.</p><p>I was psychologically addicted to Marijuana and depended somewhat on alcohol for about 4 years. Now with meditation I have discovered pure joy, where I am even HAPPIER without these substance. I am only 19, so I am fairly young. I am just so excited I discovered this at an early age because I know there will be no more mental turmoil through out the rest of my life.</p><p>Meditation does not take much effort and should not be a chore to practice. There are many things one can focus on while meditating. The feeling is almost indescribable when the Kundalini energy starts to flow through my body.</p>"
}
