{
 "title": "First Day of Spring-Tripping",
 "author": "Special K",
 "citation": "   Special K. \"First Day of Spring-Tripping: experience with Mushrooms & Hydrocodone (ID 24073)\". Erowid.org. Oct 6, 2007. erowid.org/exp/24073",
 "substance": "Mushrooms & Hydrocodone",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "5.0 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24073",
   "Male",
   " ",
   "Not Given",
   "Oct 6, 2007",
   "3489",
   " "
  ]
 ],
 "report": "<p>My friend and I had just gotten an eighth of mushrooms and we planned to drive to an outdoor art museum to trip.  I have done mushrooms once before (1 gram with 5mg vicodin) and had an incredibly thrilling experience.  I took a half maxidone tablet to ease the anxiety I was feeling as I picked up my friend.  My friend was driving us to the art gardens as I wished down the acidic tasting shrooms and I had eaten all but a small stem after about 10 minutes.  I found it was easy to get the shrooms down by putting them in my mouth and taking a gulp of water before chewing a bit and then swallowing.  About 15 minutes later I was hit with some chills and naseau as well as the realization that the world around me was becoming distant and my mind was not functioning as usual.  I wouldn't be so bold as to suggest that my sober thinking is normal.</p><p>Colors and signs and buildings seemed to be looming at me and I was falling into short daydreams that were almost real.  I said to my friend that I needed his support because the loss of comprehension was scaring me a little.  He assured that I could trust him and we stopped at a Burger King.  I walked in with him but was a little nervous as I felt my lack of comprehension would compromise me somehow so I stayed outside.  There were outdoor tables with speckled mosaic design that was sliding around like a snake.  I went inside to the bathroom and had a deeply entrancing vision of an alternate universe that seemed to be around every corner as long as I looked for it.  Before I knew it we were at the museum.</p><p>We were greeted by a massive 20 foot tall blue face at the entrance which incited me to a fit of laughter.  My friend popped the other half of the maxidone tablet and the solitary baby shroom that I had left.  We walked into the garden and I was stunned by a cornucopia of colors and nature.  My mind was so overjoyed at the sight of blossoming flowers, trees, and life-giving sunlight that I couldn't handle all the beauty at once.  I laid down and started dreaming into outer space as my mind was bombarded with complex philosophies and dreams.  My face was filled with childlike wonder as the brilliance of the experience heightened.  I was experiencing minor frustrations as I found myself unable to reach a perfect conclusion that was in accordance with the noblest truth.  </p><p>Eventually I became satisfied with a set of understandings and went on an adventure.  I stood up and felt as though my brain was dancing and it kept sending me a message to jump into the earth and embrace it.  My friend was also tripping after about a half hour and we found ourselves in a wave of philosophical understanding.  We walked around for hours dancing, finishing each other's sentences and communing with the nature and beautiful statues that the museum offered.  We went inside a tripped out room with life size psychedelic colored horses and a fountain and were bugging out like we were dreaming.  After 20 minutes of throwing water and drumming on the horses, we realized that next door was a restaurant and the diners had been watching us freak through the windows the whole time.  Imagine the irony!</p><p>We left and found that we perceived the openess of space and air in an amazing new way.  I only wish that I had a guitar then because I would have played right through the strings. As we looked at gardens of tiny trees, I felt the vastness of the world but in a friendly way and have been filled with that optimistic complacency ever since.  After a great deal of epiphanies and visions we started to come down to the clearest reality.  After about 6 hours we went home covered in dirt, leaves and all sorts of wonderful life.  Since that day I have discovered a new love for nature, finding joy in the smallest things such as grass that runs right onto the road. I can't wait until my next trip and recommend shrooming with nature to anyone that wants to explore themselves and the universe.</p>"
}
