{
 "title": "Jager-O and Paper Smears",
 "author": "SkrewEye",
 "citation": "   SkrewEye. \"Jager-O and Paper Smears: experience with Opium (ID 24159)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24159",
 "substance": "Opium",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Opium",
   "(extract)",
   " ",
   "  ",
   " ",
   "Alcohol - Hard",
   " ",
   " ",
   "  ",
   " ",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24159",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 2, 2003",
   "Views: 26236",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA couple friends and I have been making our own Opium, and basically I have enough to expiriment with, so I've tried a couple different things, these two being my favorite so far (besides just smoking a bowl):<br>1) This is what I like to call a Jager-O shot. What I do is take about half a shot of Jagermeister and put it in the microwave for about 5-10 seconds (I keep my Jager in the freezer. If it's warm, I wouldn't worry about heating it). Next I take about a pinky-sized ball and drop it in the shot and smear it around with my finger until it is completely dissolved, then top off the shot with more Jager. Keep in mind that others will want to adjust their dose. I have an unusually high Morphine and Codeine tolerance, so my dose may make others sick. If in doubt, use just a bit less than you would for a normal tea dose because the alcohol seems to carry it through my system alot faster (half hour to feel noticably strong effects). If there is a tea from poppy straw (pods) then the the tea can simply be heated to drive off the water until there is about a shot-worth of concentrate and it can be mixed with a shot of ZJager. <br>I find Jager kills the tase almost completely, and since I absolutly love black licorice this is the best method for me. I'd try it with Mescal if I could handle the taste, since Mescal and Tequilla are made from a hallucinigenic liquid... who knows, it may be just enough to alter the high to something new  :-)<br>2) This is the paper smear method. All I do is take about a half a smoking dose and use a drip of water and smear it around in a piece of foil or clean countertop until it is liquified, then smear it on the inside of a rollong paper. I love this method, especially if I am going to roll a joint with it. I also use this method for rolling a tobacco cigarette so I can go sit outside in my lawnchair and watch the sunset without fear of a neighbor calling the cops on me. A suggestion: Try this on a tobacco leaf before you roll a blunt. Makes an already well tasting cognac dipped leaf taste even sweeter! Just make sure you warn anyone you are sharing with that it is opium laced... remember that some people are allergic to codeine and morphine. You don't want to kill your friends, do you?<br>One note on smearing: I have done the smear method on the outside of a cigarette a couple times. Since it's on the outside you lose more smoke than you will inhale, so it must be smeared on the inside of the paper! Be kind... don't waste your stash.\n\n\n"
}
