{
 "title": "Thought I Had Died...",
 "author": "Babs",
 "citation": "   Babs. \"Thought I Had Died...: experience with DMT (ID 24161)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24161",
 "substance": "DMT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24161",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 2, 2003",
   "Views: 17272",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was about 8pm on a warm summer evening. The curtains were drawn and my friend and I were sitting on the couch in silence.  This was my third time experimenting with DMT. Previous encounters were mild, probably because the doses were fairly small. This time I put 30mg of crystal DMT into the pipe and smoked most of it in about 3 tokes. As soon as I handed the pipe to my friend, I was taken away into a completely different world. I was unaware of anything around me. I had no idea I was sitting in my living room, no idea that there was someone sitting next to me. I had no idea that I even had a body.  \r\nAll I saw with my eyes closed were these geometric shapes that were all interlocked and gracefully flowing. The color of these shapes was like clear crystal. Each had droplets of other colors within them: blue, pink, red, green.  My vision was in 3-D. Some shapes were in the foreground, others in the background. Slowly they would switch from foreground to background.  I was aware of nothing else but this vision. I had no memory of anything else. I had no point of reference anymore other than this vision. Nothing else existed. This was my entire universe at that moment. \r\nInitially I felt like I was choking.  In hindsight, it was probably the taste of the DMT in my mouth that I was having diffculties with. But this difficulty took over the experience. I truely believed I was dieing at that moment. Since I wasn't aware of anything else other than this choking sensation and the vision, I had nothing to convince me that it was going to be okay. Nothing to bring me back to reality.  I believed that this vision and the nervousness I felt was leading me to death, or some other strange state of being. I paniced because I didn't understand what was going on and thought I was never going to come out of it. \r\nEventually I started becoming accustomed to it. I think that is because I now had a memory. I now had a point of reference.  This state of being was no longer a strange, unfamiliar thing. At that time, I started questioning who or what I really was. Was I these geometric shapes? If so, then what were these shapes? I had this need to define what I was.  \r\nI began to hear a soft hum. Similar to a waterfall off in the distance. And then I slowly became aware of my hands. I would move a finger ever so slightly and it would cause gentle ripples in my vision of geometric shapes. As if this other state of being was slowly being penetrated and destroyed by me becoming aware of my original reality again. \r\nWhen I opened my eyes for the first time, everything was tinted with an amazing shade of orange. It was a magnificant, metallic, solar orange. I was still very nervous and shaken. My friend told me I was out for about 12 minutes before sitting up and opening my eyes. But by the end of the hour, I was perfectly normal.\r\nWhat a humbling experience!\n\n\n"
}
