{
 "title": "Little Panicky",
 "author": "levelzero",
 "citation": "   levelzero. \"Little Panicky: experience with Codeine (Tylenol 3)  (ID 24192)\". Erowid.org. Feb 28, 2013. erowid.org/exp/24192",
 "substance": "Codeine (Tylenol 3) ",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Pharms - Mirtazapine",
   "(daily)",
   "  T+ 0:00",
   "60 mg",
   "oral",
   "Codeine",
   "(pill / tablet)",
   "  T+ 2:00",
   "30 mg",
   "oral",
   "Codeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24192",
   "Male",
   " ",
   "Not Given",
   "Feb 28, 2013",
   "Views: 1745",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>About the highest I ever went before this was around 60 mg.</p><p>I took 2 tylenol 3's was feeling good and a couple hours later took another one. About 45 mintues later did not feel so well...Got really sweaty, heart rate started speeding up, breathing got real shallow, really nauseous, really dizzy and lightheaded...As I was walking up the stairs I felt like I was gonna pass out...I started panicking even more and I think I might of either jumped into a small panic attack from the symptoms because they were scaring me. </p><p>The room started to slow down a little(had a similar effect on too much cocaine and pot one night years ago-this could of been why I went into a panic). Any ways I was sweating pretty bad and my heart rate got back down to normal after about 10 minutes and as I was laying in bed praying to God that I don't die then I finally fell into a peaceful feeling.  </p><p>Codeine is very addictive but I don't ever want to feel that panicky feeling again...Alot of the symptoms I was having are of both codeine overdose and also of panic attack so maybe a little of both was going on, but I didn't thing 90mg was much codeine. Maybe I just panicked when that 3rd pill hit me hard and I needed to level out. </p><p>Also, I am taking Remeron so that might have made a difference as well...Just start out slow...For me usually 60mg is enough...I have never reached the euphoria like I get with X but have just felt really calm and relaxed. Don't like the slow breathing on the codeine.</p>"
}
