{
 "title": "Fake Tranquility",
 "author": "Fylhtq",
 "citation": "   Fylhtq. \"Fake Tranquility: experience with Codeine (ID 24213)\". Erowid.org. Mar 30, 2006. erowid.org/exp/24213",
 "substance": "Codeine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Codeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24213",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 30, 2006",
   "Views: 32999",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy story with opiates begins when I was 12. I had a hernia surgery, asked for a painkiller afterwards, and got morphine (IV)... I remember getting scared when I saw the label on the syringe... I wanted to ask the nurse to not shoot me, but in the end faked pain 5 or 6 times in maybe 4 hours, getting shot up by several different nurses. All the while I was so scared, but my mind just wasn't in control, my mouth formed words while my logic screamed and rebelled... also I kept passing out like a dozen times... the experience kept me angelically clean for 5 years, with a complete phobia of drugs.<br>For a week I dreamed about the goddamn syringe, was sick as a dog, and could barely move... I thought it was just the surgery, until I had a more serious procedure at age 17. I told the nurse there was no fucking way (directly quoting here) she was shooting me with anything afterwards, she tried to make me reconsider but in the end left. I made it through the entire surgery and two more days completely clean (except anastheasia, of course) --- and had no pain, no sickness, no unconsciousness, nothing at all... The week-long hell I endured five years before was morphine withdrawal. Yeh me...<br>BUT my dear old surgeon prescribed me some Tylenol AC or T3s or something... several days later I couldn't resist... it wasn't as much pain as temptation...<br>I took maybe 100mg of codeine, about 1.5 times the maximum dose on the prescription... I felt really strange --- I was disconnected from my senses, and all warm inside, tranquil... The stuff made me so calm, slowed my heartbeat, relaxed, and made my pupils turn into pinpoints....I still had all of my senses, but I could just phase them all out by choice... playing guitar for hours was cool, because I was so focused on the sound I could not really feel my fingers very much. For me, the disorientation and discoordination were very mild, but I could completely IGNORE pain --- I felt it, I knew it was there, I could just not notice it without any effort, in fact it took some concentration to use any senses. Not as in difficult, but as in it was just not there unless I chose to notice it. I knew my fingers hurt like a bitch, but I didn't care, didn't feel the pain, it just registered like a health bar in a video game. When I figured they were about to start bleeding, I finally stopped playing guitar. Also due to this control over sensory information, listening to or playing music is, well, different... I can just drown in the sound, shutting off everything, thoughts included, and if I am playing it, leaving only a small field of vision (I have control of that too) and manual dexterity but not feeling in said appendages... that and the SOUND... <br>Nirvana suddenly felt alive, more than anything, more so than groups that are actually playing onstage in front of me. And I didn't even *like* Nirvana back then...<br>I spent the next two days in a light but constant haze of codeine, every 4 waking hours...  Didn't do much before sleep because I was afraid of getting messed up dreams...<br>Then I rented 'Requiem for a Dream', on a girl's recommendation... Before seeing it I took a heavier dose of codeine (I had begun to step up the dosage, heh)... and my whole world CRASHED from that film. It's a horror story about heroin... the girl's friends all went cold turkey on everything when they saw it (she just moved to town, her old friends were inner-city druggies and capital messes)... It hit me that those guys weren't even using opiates, and here, good old me who frowns on stoners for godsake, is spending his days getting wasted on codeine and figuring out how to procure a second prescription... I quit it immediately.<br>So the stupid red syrup of Tylenol AC sat in my fridge for about six weeks...<br>Then my girlfriend dumped me... Meanwhile I had lost my job because of my long illness due to surgery, managed to pick up Mono from god knows where, and my only source of happiness was my beloved girlfriend... I really loved her, and still do, after half a dozen more breakups and reunions... I just cried on the phone, thne sat shellshocked for a minute or so.<br>Then I RAN to the fridge and chugged the remaining codeine. Thank god I had taken almost half of it before (yep, chugged 10 times my normal dose or so). On a full bottle I would've croaked for sure... I hadn't the faintest idea about dosages and LD50s on the stuff back then, didn't even know if I'd just OD'd and signed my death sentence --- but I really couldn't care less, almost hoped I wouldn't have to keep on living. Then I went back to my room, and listened to LoveSpitLove's 'Codeine' about 10 times --- somehow fitting considering the situation... I gained an understanding of the song during that time... It sums it all up better than just words...<br>Later I realized I had come damn close to an OD... that night I had 3 layered simultaneous dreams while still awake, and then crashed from the high --- non-injectable opiates don't give me a low from normal doses, I just drift off to sleep...<br>Meanwhile, a couple hours later a few buddies showed up to rescue me from my prison of grief... We walked around, bitched about the evils of the manipulative female (one of the guy's girl of 1.5 years had dumped him about 2 weeks earlier)... I always talked about how Kate made me feel like no one else on the planet could, even the daft ones knew I loved her so strongly... The guys were all looking at me very strangely because I seemed mostly normal, not the sobbing wreck contemplating suicide they, with good reason, expected to find... Finally they realized I was sky-high on something. I never did drugs and opiates are really unknown in our region, its all speed and cocaine, so they didn't really know what was up with me. Then I ended up telling them when I realized they thought I was an unfeeling bastard and my love for Kate was fake...<br>Later that night becomes a blur... I ignored my senses and chain-smoked, causing a complete lack of sensory memory --- on large doses of opiates I simply never process the stuff... Then I felt faint and got someone to drive me home... Went to bed, feeling barely able to stand, dizzy but not sick. Had multilayered dreams with full consciousness and sensory detail in ALL the simultaneous dreams (3 I think), and at the same time being still awake in bed... But, unlike hallucinations, no fear, paranoia, and full knowledge that it is all just my imagination... I was so tranquil... I knew everything was wrong with my life, knew that I wanted to die, but it was like a vacation from unwanted feelings... Then I crashed...<br>It wasn't like I thought it would be. Unlike alcohol related stuff, the only other drug I've used, this had nothing physical to it. Just a horrible feeling of LOSS... loss of this tranquility... it was like coming back to everyday life after the most amazing vacation, seing all the dirt and trouble, but 10 times worse... it was like returning to hell... Then I think I passed out from emotional exhaustion (no sickness, not physical at all)... <br>Hadn't had any more left, thank god, so I couldn't drift into a narcotic stupior for the next painfilled months... Hadn't the money or courage to buy alternatives...<br>Although, in retrospect, the stuff probably saved my life. If not for that tempting bottle of Codeine, I would have either slashed my veins or gotten extremely drunk... I am a bit of a drunkard anyway, have high tolerance for alcohol AND it takes it about 4 hours to fully kick in for me... So I figure I would have drunk about a liter of 80-proof, then gone out to look for a fight I knew I would lose... Because physical pain numbs the emotional shit... Either I would've gotten maimed or killed, or the liter of vodka or tequila would kill me at some point (at 160 lbs, its pretty obvious it would).<br>Later I researched the stuff to find out how much I took and so on... I found a lot of interesting info, and, unfortunately, also found out that roughly speaking, Codeine = Vicodin (NOTE: *NOT* DOSAGE WISE, JUST EFFECTS)...<br>*************THIS BELOW IS NOW********************<br>So, here I am during yet another crippling emotional crisis, and I just folded... Jacked my mum's Vicodin (and I used to tease her about her abusing the stuff ;_)... so far I've been doing it lightly (not much in that bottle), about 10 pills in the last 3 days...<br>And I am now catching myself fantasising of a future, not with going back home, succes and family, maybe a happy marriage to my girl, but rather --- to scoring a hundred codeine T3's... That is scary...<br>Thank god, once again, nature has given me some obstacles to that... I am violently allergic (hives) to swallowing more than 2 Vicodins, need claritin nonstop for that, and that spoils the effect quite a bit... and Codeine, to which for some reason I am *NOT* allergic, is unheard of on our suburban streets here...<br>Hydrocodone (Vicodin), other than the allergy thing, seems pretty much identical to Codeine... Great stuff, but dangerous as fuck... Truly addictive, even on my first time... Addiction can become physical after just several doses. The only time I've felt more tranquil than on Codeine was with a girl whom I truly love, and everybody I know says that love was rare and unique, like nothing else they had seen... I'll testify to that too...<br>If not for the emotional and physical addictions, I would say this is the perfect substance. Better than caffeine, infinitely better than alcohol... Also, because the effect kicks in in over an hour, I'd never know if I accidentally OD'd, I'd just pass out forever... This stuff is dangerous in all aspects of it. But mostly in its near-perfect fake tranquility. Hell, the stuff almost manages to give true love a run for its money (not quite).\n\n\n"
}
