{
 "title": "I Thought I Was Dying!",
 "author": "Keith",
 "citation": "   Keith. \"I Thought I Was Dying!: experience with Vitamins - Niacin (ID 24252)\". Erowid.org. Jun 18, 2006. erowid.org/exp/24252",
 "substance": "Vitamins - Niacin",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Vitamins - Niacin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24252",
   "Male",
   " ",
   "Not Given",
   "Jun 18, 2006",
   "Views: 6858",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started taking Niacin because of a rumor I heard that they prevented migraine headaches.  I'll do anything to prevent my migraines (REAL migraines), so I was up for it. I took it for two days in a row and I didn't experience any problems other than a little light headedness and some feelings of heat in my face, neck, and arms.  I looked at the side effects and it read that these were common and not harmful.  The third day, I missed a dose.  On the fourth day, I took the Niacin at about 7:30 p.m.  I had some buddies over later that night and we drank some beers and played a little D&D.  I felt COMPLETETLY fine when I went to bed...</p><p>Around 7:30 a.m. I abruptly rose out of bed with an incredible feeling of burning all over my body.  I ran straight to the bathroom and looked in the mirror as my face was burning.  It looked red, but nothing too bad.  I started to run my arms under some cold water and it seemed to help, so I hopped in the shower and ran cold water all over my face and body.  As soon as I shut the water off, the burning intensified.  I looked in the mirror and both of my eyes were almost swollen shut. </p><p>I ran to my room and put my clothes and shoes on and bolted outside and drove myself to the emergency room.  I jogged into the emergency room.  There was a security guard in there and when he saw my face, he immediately got someone for me.  As soon as the lady saw me, she started running around to find a paper.  Now I was panicking.  My heart started racing uncontrollably.  She asked me if I'd made any changes in my diet lately and I told her of the Niacin.  She then seemed to calm down and said, 'Ok, now I see what's going on.  You've had an allergic reaction.  It happens to me too.  It goes away, but it's miserable.'  Miserable is an understatement.  </p><p>They got me into a bed where I had to get up because I also had nausea and diarrhea from this. They drew my blood and two IV bags of prescription strength histamine blocker mixed with nausea medicine later, I was back to normal.  Just REALLY drained and tired.  The blood test revealed the alcohol from the previous night and I was told that the alcohol may have had a hand in triggering it.  Who knew?  </p><p>This was easily the scariest moment ever in my life.  I thought I was near death.  To find out it wasn't even serious is just crazy!  Needless to say, I will be getting my Niacin naturally by food from now on.  NO MORE NIACIN SUPPLEMENTS!  Especially 500mg.  That is WAY above the daily recommended allowance.  I was told that I just had too much Niacin in my system from the four days of 500mg.  My body had just retained too much of it and that last dose sent me over the line.</p>"
}
