{
 "title": "Bewilderment and Awe",
 "author": "T-master",
 "citation": "   T-master. \"Bewilderment and Awe: experience with DMT (ID 24299)\". Erowid.org. Jun 7, 2003. erowid.org/exp/24299",
 "substance": "DMT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 24299",
   "Male",
   " ",
   "Not Given",
   "Jun 7, 2003",
   "Views: 7065",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>   I had read a lot about DMT and was very interested. I had done it once before this experience with minimal effects. This time i was at a festival in the mountains in the summer around dusk. skipping how i came across it, I'll get right to the experience. </p><p>   Five of my friends and I were in our tent preparing ourselves. I was first. A key bump, approximately 30-40 mg was put in the bottom of a crude foil spoonish looking thing for freebasing. I took it, held the lighter under the cup-like part until it filled with smoke and 'drank' the smoke very fast like drinking a shot because i knew from before that the smoke was rather harsh. I passed the 'pipe' as I held the hit deep until my lungs were burning and couldn't hold it any more. As I let the hit out I felt it begin. The onset was about 3 seconds, no kidding. Everything went black as my eyes involuntarily closed, and i felt them roll to the back of my head. I felt a rush of energy come over me moving faster and faster as I felt my physical body...The best way to describe it is IMPLODE, on itself to the size of an atom. As my body disappeared I  began to see dim colors in geometric patterns on the 'walls' around me, in a tunnel shape. I was moving at warp speed through this 'wormhole' bobbing and weaving in the space that is my mind, as the colors and patterns became brighter and brighter and began to move in a fractalized glow. The only thoughts I was able to have at this point were just total shock and awe at what i was experiencing, which would not leave through the trip. But it was paralyzing for the first 10 seconds or so though it seemed longer. I'll put $100 that my jaw was on the ground. </p><p>    I was beginning to slow down now but still felt the rushing energy through me. At this point I tried to open my eyes. Everything was veeerry strange and moving in a manner so I could barely make out any objects, and it was hard to look at, even a little frightening. I became aware that my head and arms were dancing and waving around  with the energy I felt and it was starting to bother the people on either side of me, so I managed to say, in a very strange voice, 'I'm going for a walk.' I stumbled to my feet with my eyes closed again and emerged in to the light. </p><p>    My first few steps were awkward but it came to me quickly. Seeing nothing but green behind my eyes I felt I was at the end of the tunnel. The initial rush was over but I was till in awe. I opened  my eyes, and nothing could prepare me for what I saw. There was no solid matter, only complete, colorful, chaos. The shapes of objects were all there but in the form of bright dancing... the word just hit me like it was whispered in my ear, 'ENERGY.' I felt a little sick and thought i was going to puke, but I dismissed the urge and it quickly left. 'Mind over matter' I thought. I looked at my hand and it was pale gray and my fingers were long and waved like sun rays. I felt a huge smile come over my face as I began that walk I had been on for a few minutes I guessed. After walking through a row of cars, staring at everything in amazement, I emerged at the edge of a huge field littered with tied people. At the other side of the field was the stage which disappeared from my sight as I noticed the bright, beautiful colors of the sky as the sun was just setting. I looked back at the stage and just planted my feet and listened to the music. The more I focused on the stage the more it solidified, but it was not anchored to its surroundings. As I moved my head around a little the stage moved with it. Automatically I raised both my hands  in a way that a waiter would carry two trays of food, and moving them up and down I was able to make the stage move with them and it began bouncing up and down at my command. Wanting nothing more than to show this to my friends, I carefully ran back to our camp to get them. I got back in less than a minute but there was only one person there, (who had not done the DMT.) I asked like an eager child where everyone had gone, and the only response was, 'for a walk.'</p><p>    I was still trippin my balls off, but I knew I was begging to come down, so I sat down and talked about my trip with the person there. The best way to describe how I felt at this point is to think of a perfectly clean steady mushroom trip. But still different in some way. Perhaps it was the absolute amazement I was still in from my educational trip. I sat there and smiled as I tried to comprehend and make sense of what I had just experienced. My friend told me I was only gone for about 15 minutes. I felt like I was given a glimpse of the reality of the universe and a demonstration of my own abilities and everyone's abilities if we used a larger percent of our brains. Maybe in another life. There is no way to TRULY describe the DMT experience in words. Its just not comprehendible until you do it and see for your self. That was not and WILL NOT be the last time I experiment with DMT. I've done it a hand full of times since then and every time is an experiment.</p>"
}
