{
 "title": "Spiraling Realization of Reality",
 "author": "Ydoc",
 "citation": "   Ydoc. \"Spiraling Realization of Reality: experience with LSD & Cannabis (ID 24308)\". Erowid.org. Apr 5, 2007. erowid.org/exp/24308",
 "substance": "LSD & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2 drops",
   "oral",
   "LSD",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 24308",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 5, 2007",
   "Views: 3200",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first experience on a psychedelic substance. I've used weed for awhile, and read up on how L.S.D. worked, so I was prepared for the worst. Before the trip I had a brother pass away but I was done mourning his death and accepted it.</p><p>My friend 'F' dropped 2 hits of liquid on a sweetart candy, wrapped it in tin foil, put it in a film container, and gave the bad boy to me after school.His only words of advice? Don't do it alone.Well I thought he meant not to trip alone, meaning be with someone else, and that someone else would in the future be sober, meanwhile I would be taking the whole 2 hits 'alone'.</p><p>12:00-So school got out at 12:00 because it was a teacher workday or some school oriented hypocrisy. 'F' disappeared and wasn't seen again until after the day was over. Anyways I walked with my friend's 'P', and 'K' to k's house. I was so excited about the score that I couldn't wait to tell my friends on the walk. I show them the sweetart, and they laugh telling me I should wait to take it. I agree, and I also agree to smoke some bowls. After a haze of three massive lung draining bong bowls, my friends start to reconsider the fact of me taking the hit.They want me to trip since 'K's guardians are 'cool', and they won't mind if they see me trippin' balls. K is also experienced with sitting people on drugs.</p><p>1:00-Without hesitating and eagerly stoned and ready to flow, I decided it was time. I took the tart around 1:00 p.m., placing it under my tounge patiently waiting for it to dissolve. Within five minutes it dissolved and I couldn't taste anything but the orange flavor the sweetart produced. 'P' had to go home at 1:30, and I started feeling a coldness engulf my body slowly. As 'K' and I we're just wasting time sitting on his couch watching t.v., a music video came on that, someone, somewhere had to have put on because they knew I was starting to trip. The music video was by Soundgarden and it was called 'The day I tried to live'. Great song but horrible video to see while tripping. My friend was starting to crack up watching me and because he knew the video was fucked up also. I asked him 'Are you seeing what I'm seeing', and he said 'Yeah' that made us crack up!</p><p>2:00-After the video was over I simultaneously felt my brain slowly spiral, and melt into the back of my neck, and I magically shrunk into an ant sized human.During this state of physical and visual awareness I realized how big everything was and that 'K' looked like a grizzly giant human! I had to do something.My natural response was to snap out of such a powerful hypnotic trance. Using all of my spirit, mind, and soul I was able to break free from this life changing experience. 'It hit me', I shouted and stood up frantically pacing around in a circle trying to figure out what to do. 'K' instantly knew I was frying so he tried to console me telling me that it was just the acid, but I had so many thoughts racing, about my brother, life, death, the universe, humans, past, present, the future, good, evil.</p><p>I saw my family, and they were happy, especially my brother. I needed something to drink or do something other than watch t.v. I was about to break down and lose everything. It was so synthetic, the inside of his house felt synthetic and materalistic. The visual part of the acid slowly started to creep in again because I noticed how the walls were breathing with me. I'd inhale and the walls would change purple and come towards me as if they were going to touch me, and exhale they'd go back to normal size. This was calming me down, which might be suprising but in the insanity it helped me keep my breathing rate normal, or at least what I thought was normal. We decide to go outside, and I stumble in his backyard. </p><p>3:00-4:00 Gazing at the sky I realize that everything natural outside was so beautiful and awe inspiring that there has to be a God..The clouds had a Yin Yang effect with dark nasty evil clouds on one side, and bright and peaceful clouds on the other. I was standing right in the middle. I felt a mind force that just had to have been a greater being.This would have to be the climax of the trip. </p><p>5:00-Now what happens when we go inside to drink water was the most incohrent part of the trip. We try and talk to 'K's parents as they just came home and so did his little brother and friends. As 'K's mom started talking, a lizard like tounge would slither out from her mouth and lick her face, exactly like a lizard would do in 'reality'. I was so entranced in this that I didn't even notice if she was asking me a question or anything.This really scared me so I wanted to walk home, and I told 'K' but he told me I couldn't walk all the way back to my house which was about 2 miles away. But he tells me that his mom can give me a ride to my friends house who lives about a mile away.</p><p>5:30-We leave and the car feels like a submarine, the windows looked like semi-bubbles pushed inward. And my ant trip dawns in again, and I think wow this is a crazy first trip on acid. K and his mom drop me off at my friend 'D's' house and I immediately told him I was tripping. Obviously he asks where he could get some, but I told him that this was the last two hits my friend had in his vial but I might be able to get some horrid paper:) D loads a bowl and we walk into a field behind his house. I look at the clouds again but this time they have small tracer points on them and when I move my head they follow the direction. I smile big and wide knowing that the insanity is finally coming to an end.</p><p>7:30- 'D' drives me home and we talk about how infinite life is and the human body is just an instrument, the spirit is the main force. It all depends on your outlook. We finally get to my house and I go directly to my room because my parents are asleep and I wouldn't want to bother them in the state of mind I'm in now. I slowly slide under my blankets. My eyes are open this whole time, and they won't shut because they are watching the Revolutionary War. The t.v. must've of been on with the mute on and a storm was brewing outside. I remember cannons being fired and people yelling 'charge!' I was utterely blown away by a raw hallucination.</p><p>Peace</p><p>Ydoc</p>"
}
