{
 "title": "Tip of the Iceberg",
 "author": "A Distant Light",
 "citation": "   A Distant Light. \"Tip of the Iceberg: experience with Nutmeg (ID 24335)\". Erowid.org. Apr 16, 2006. erowid.org/exp/24335",
 "substance": "Nutmeg",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 0:25",
   "15 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24335",
   "Male",
   " ",
   "Not Given",
   "Apr 16, 2006",
   "Views: 11704",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>INTRODUCTION:</p><p>First of all, I weight about 160 lbs, and I have tried nutmeg twice before with no results other than a mild buzz.  Those dosages were approximately 1 (10g) TBSP and 1.5 (15g) TBSP respectively.  This would follow the standard 1 gram/10 lbs body weight, yet I felt next to nothing.  Beacuse I felt no major effects, I decided I was taking too little and would up the dosage significantly for this attempt.  Also, my source of nutmeg is from my work.  We get it from a distributor so it's pretty high quality and doesn't sit on the shelf long, though it IS a ground/grated form of the nut.  I took this one afternoon at my house when I thought I wouldn't be disturbed.  I wasn't expecting too much.  Anyhow, they say the third time's a charm, right?</p><p>THE EXPERIENCE:</p><p>Each entry was written at the time stated, with one exception explained later.  This is a real-time time-line of my first real nutmeg experience.  Sorry that it's so short.  I left the experience unedited except for a few fixed typos and things in [brackets] added for clarity or more detail.</p><p>T=1:50pm</p><p>T+0:00  -  1 (10g) TBSP Nutmeg in PB&J sandwich (awful)</p><p>T+0:20  -  I feel some slight psychosomatic (or so I think) effects, including a light daze or fog, kind of like being very tired, but without the need to </p><p>[physically] sleep.  [No heavy eyelids or any of that.]</p><p>T+0:25  -  1.5 (15g) TBSP Nutemeg in 8 oz boiling water & 2 TBSP Honey & 1 TBSP Butter (tastes less like shit, but still horrible)</p><p>T+0:40  -  a little nausea, by the way.  I hate the taste of nutmeg.  I never [want] to taste it again, but everytime I burp I taste the shit.</p><p>T+1:55  -  I'm kinda nauseous and I keep burping, and it tastes bad, so I'm going to go make some green tea.  Peace</p><p>T+2:05  -  I think it's kicking in.  My bugs bunney pez dispenser looks cool, and I started laughing at this pig with wings I have.  And yes, it IS real.  [It's a plastic toy I got for easter.]  I made the tea, but it's still too hot to drink.</p><p>T+3:20  -  I'm kinda stoned off of this stuff.  It's a wierd feeling.  It's not strong enough though.  [a few minutes elapse] Yeah, actually I'm kind of fucked up right now. I have some really bad cotton mouth though.  [This cotton mouth lasted for hours.]  I'll get some more water...  or green tea  :)  Got some water, but man my eyes are red as hell.  Jesus.</p><p>T+4:53  -  Wow.  I wasn't expecting it to be this powerful.  I'm not hallucinating, but I feel damn good.  [Winamp music] Visualizations look cool as hell.</p><p>T+5:50  -  Still high off this stuff.  Cool.  I feel stoned, but with more clarity.  This is a very nice drug.  Too bad it tastes so [bad].</p><p>T+6+06  -  Even higher than before.  I have been feeling effects for four hours.  holy shit.  And oh yeah, I just ate dinner steak, juicy and delicious.  unbelievable.  The shrimp were awesome.  Food is unbelievable on this stuff.  My tactual [that is, tactile] senses have increased so much.  Well, two out of three.  Touch is still not that elevated, but taste and smell are.</p><p>T+7:20  -  STILL high.  Maybe higher than before, maybe the same.  Holy shit...  I don't remember typing that.  My eyes are so red I could land a plane with them.</p><p>T+8:00  -  Still quite high, accelleration [motion] sensations when I close my eyes.  I'm going get some sleep, cause I'm getting a little tired off of this.  Later.</p><p>T+16:00 - (STILL HIGH)</p><p>T+26:00 - finally about baseline.</p><p>NOTES: </p><p>for the second-to-last entry I wrote a small comment from memory to encapsulate my feelings.  I was at school from T+18:00 to T+25:00.  Also, I woke sometime around 3:00am (T+13:00) and I beleive I was in a completely different reality, but I don't remember it very well because I fell back asleep right away.  This was the third time I had taken nutmeg...  I worked my way up to the dosage that gave me real effects.</p><p>Overall I'd give Nutmeg the approval, but it's something I want to set aside time for, so I can relax and enjoy the experience.  At least when I woke up I was still too messed up to feel that tired.  Later on I slept like a rock though.  I was kind of dissapointed with the lack of elightenment from this experience, so I plan to try nutmeg again in a higher dosage and in a natural, outside setting.  I'm looking to achieve a more spiritual experience and learn more about *everything*</p>"
}
