{
 "title": "Healing and Revealing",
 "author": "Quetzal Butterfly",
 "citation": "   Quetzal Butterfly. \"Healing and Revealing: experience with Mushrooms (P. cubensis) (ID 24382)\". Erowid.org. Jun 9, 2003. erowid.org/exp/24382",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "106 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24382",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 9, 2003",
   "Views: 16639",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On Friday, my parents and I revealed ourselves to my younger brother (he's turning 17).  By 'revealing ourselves', I mean to say that we got to directly and openly telling him about the place certain 'maligned' natural subtances have in our lives.  </p><p>I have been intermittently utilizing substances such as LSD and Psilocybe mushrooms for shamanic/entheogenic purposes since the age of 16 (I am now 20).  After my first real LSD experience, I felt an unshakable need to let my parents know how it changed me, my desire to continue self-exploration, and my need to do this in a safe and nurturing environment.  It was all based on Unconditional Love - and by great fortune they were willing to understand and accept me there, as being mystic-hippies they could relate to my experience.  The only reservations they had surrounded me telling, or influencing, my younger brothers.  </p><p>I accepted this for many years.  After extensive LSD experiments, I went through a long period of abstinence (never stopped occational cannabis use though) and my spiritual unfoldment entered a new octave.  Eventually, a time came in which my parents and I felt comfortable enough to smoke cannabis together, as they had picked up occational smoking again in 1995 after decades of abstinence - but weren't really open about it for a long time.  A few months after this, I had approached them with my desire to grow mushrooms in my closet strictly for personal spiritual use - I no longer felt comfortable buying such a thing from some drug dealer, as to my feelings, such an act amounted to approaching some pimp to solicit Gaea's flesh for prostitution.  I was able to demonstrate the responsibility necessary to safely carry such a project, and my parents gave me the OK.</p><p>That was over a year ago.  Only my parents, my best friend (a true soul brother), and I were to know about my project and use.  In the interim I have eaten the mushroom with my father once (his first trip in some 30 years).  And I've talked about sharing mushroom ceremony with my mother, which has yet to happen - but I'm not in any hurry.  In any case, this whole thing has been hidden, to a large degree, from the rest of my family (I have many siblings).  Indeed, the issue has created quite an interesting healing process between my parents and I.</p><p>But back to the present... Last equinox I held ceremony on my own, and asked/prayed for healing in personal terms, human terms, and universal terms - as it has been my experience that none of these are separate.  The visions revealed to me that I had to show my younger brother who I am, indeed - my parents had to stop hiding from him as well.  That night I told my parents what the vision showed me - and stressed that such was crucial for the healing of humanity.  It's a notion of - 'How is society at large ever going to accept our ways if we feel we have to hide from our own children?!'  I was convinced of my brother's capacity for Unconditional Love - and truely it was a challenging us to Love Unconditionally - ourselves, and him.</p><p>So in due time - we told him 'I reveal myself to you because I Love you unconditionally, and I want you to Love me unconditionally just the same.'  He understood, and everything went resoundingly well.  It is another step closer for us.  I no longer felt the need to hide in my own home - no more closet shaman - at least to my closest Loved ones.  </p><p>So, on Saturday, as I had already planned, my best friend and I tripped at my house.  3 grams each in a fruit smoothy... not an ideal method of ingestion (and probably never do it that way again), but we hadn't made any capsules the night before.  We started in the afternoon.  </p><p>Meditative, prayers, I rattling, he didgeridoo.  Around the peak - I purged... very fast, very smooth.  That wild fruit concoction tased like a freaking Dr. Seuss book on the way out of my stomach!  Frankly, one of the more pleasant purges I've ever had - but a purge nonetheless.  Truth is, my body was compensating by expelling what it didn't need.  My friend and I talked about this later - we were both a little exhausted to begin with (little sleep the night before), and both of us are extremely sensitive people - so it was agreed later on that perhaps we took too much under the circumstances.  1 or 2 grams would have been more appropriate for a trip with dominantly extroverted stimuli.  3+ grams is much better suited for sensory deprivation and totally intoverted trips (at least for us).  (Shrugs) Live and learn, I suppose.  </p><p>'If a fool would persist in his folly, he would become wise.' </p><p>-William Blake 'The Marriage of Heaven and Hell'</p><p>At any rate, much of the experience was exquisitiely beautiful, and largely refreshing - if not a great degree exhausting.  After my purge, and a little more rattling - I went upstairs and my cat gave me a stomach massage.  Went and enjoyed the garden outside - peonies just bloomed!  Read some Edith Sitwell poetry aloud.  Felt totally at ease in front of my brother & parents - a wonderful feeling.  </p><p>My friend and I walked to the park - where the most fascinating part of the trip occured.  We've walked through this park by my house hundreds of times - and interesting things often happen there... But this day brought a sight that may heve been some sort of miraculous apparition or something.  As we walked into the park - to our left there seemed to be some sort of party going on... closer inspection actually revealed it to be a group of perhaps 20 or 30 children of all size.  From the looks of it, EVERY nation and race of humanity was represented in this group of beautiful kids.  They were kicking a ball around - not in competative sport, as there were no goals - but simply for the sheer ecstasy of kicking a ball around.  Everyone of them was laughing with incredible joy - the whole group was in complete harmony.  They would get really ecstatic when the ball popped up into the air.  I tell you, this was some sort of primordial beauty.  I turned to my friend, asking 'What is this?'  He acknowledged the existence of the sight.  It was so astonishingly beautiful and ideal that I needed some sort of reassurance that it was real...  </p><p>We both walked among the tree grove on the hill in the park's center, a little overwhelemed by the almost unbeleavable scene to our left.  Heavy rains had brought the mosses out to thickly coat the crags of tree bark.  So beautiful!  I almost wanted to go and kick that ball with those kids - but my body was so tired.  We walked to the right side of the park - and I did some Tai Chi Chuan in the open grass.  At a certain point I completely forgot my place in the form (which is highly unusual), and had to start over from the beginning.  I got all the way through on my second try, but throughout found myself having to reconsider every single movement.  I became acutely aware of the flaws in my form - flaws I hadn't felt in 3 years of practice.  Simultanously, my body was revealing ways in which I could correct and readjust my form.  This was very interesting to me - some trips, the mushroom allows one to truely appreciate how far they've come, and how exalted & beautiful they really are - other trips, the mushroom allows one to truely appreciate how much they can improve, and what they can do to progess to that end.  Most trips, we get a little bit of both.  </p><p>We walked back to the left side of the park some 20 minutes later, and the kids were gone.  Which left to question - was that brilliantly ideal scene of human harmony real?  My friend and I laughed at the question... we've seen some very unlikely and transcendental things in our lives... and I know that I've had 'true hallucinations' before... but this was more Real than real!  We both saw it - it looked like some divine apparition - but concrete and solid - toally grounded on Earth.  </p><p>If I have to decide - I'd say that the scene was as real as can be... One of the most reassuring omens that I have ever witnessed...  Perhaps the scene was a gift from Our Lady Gaea - to acknowledge her appreciation for my willingness to heal, not only by myself, but 'in relationship' - and reveal a prodigious glimse of what may come from my whole-hearted, and continuous, effort to stop hiding, and find true understanding and Unconditional Love among my fellows - among my species.</p><p>And Oh, for this tender grace... I am eternally grateful.  Thank you, Mother...  Thank you for everything.</p>"
}
