{
 "title": "2nd Encounter with Psychedelia",
 "author": "Andy.V",
 "citation": "   Andy.V. \"2nd Encounter with Psychedelia: experience with Mushrooms (P. cubensis) (ID 24390)\". Erowid.org. Jun 9, 2003. erowid.org/exp/24390",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 24390",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 9, 2003",
   "Views: 6407",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My 1st encounter with psychedelia was not drug induced, it was lucid dream (i classify it in psychedelism because of its non-normal environnement). But, i did not knew how to define psychedelia until i took shrooms. I've done other drugs before, like weed, ether, alcool, xtc (MDMA isn't a psychedelic for me). I've done mushrooms a few times before this, but never feel any effects (as my other friends was feeling them).</p><p>Liège.Belgium.End of June. I'm 18. This was the end of my exam sessions and i planned on scoring some shroomz with some of my mates. So, after the exam, we went to Maastricht, Netherlands (which is near Liège, Belgium).</p><p>Because we bought several amounts of shrooms and were friendly, the nice merchant give us some additional mexican shrooms. We also bought some weed (White Widow as i remember, but i'm not sure).</p><p>When we came back in Liège, we changed our minds and decided to separate us (boys with boys and girls with girls). That evening i was sleeping at T's house, and his parents were out. We first smoke a big-sized joint, then we ate the dried shrooms (it was a 4 persons portion) plus some mexicans (cubensis, too, i think). They kicked quickly and i started to feel VERY light, and it began to grow in intensity, then i get really scared because i though i wasn't in reality and everything i lived in my life has been an illusion, so i really freaked out. T tried to calm me down but i didn't want to believe him because he wasn't real. After a while, i entered in a good trip and all really became fantastic. I think the quick mental-state modification was the real cause of that panic attack. </p><p>I saw everything like if i was wearing some alien 3D glasses with a wide angle. Everything was living. I remember staring at the flame of a candle and it multiplied backward, and as i stared more and more precisely at the end of the 'copies', i realize that these copies, from a certain angle, was forming a kind of 'night street scene'...pretty weird...</p><p>I became also aware that the notion of time was obsolete. </p><p>And, when i closed my eyes, i could see some dancing patterns, alterning or morphing with strange images. Music was essential, because it defined the color of the trip. I thought music was 'tasting' like sugar, but later after the trip i remember we ate shrooms with some sugar (due to the taste).</p><p>This was a very intense trip and a big one for a real 1st trip.</p><p>I also had weird conversations with T, for example, i looked at him and saw that something was wrong in his face and i said him something like 'i know what's happening to you, don't worry, all it's fine'. Or we talked about brain structure. I really liked the experience and i've done a couple of other ones, now; every experience is different and mind expanding/glowing. I had other bad trips but i think they are very useful in the understanding of ourselves. I've also tried LSD and i strangely never had any bad trips with it.</p>"
}
