{
 "title": "Perminent Brain Damage",
 "author": "Magoo",
 "citation": "   Magoo. \"Perminent Brain Damage: experience with DXM (with CPM) (ID 24404)\". Erowid.org. Jan 14, 2005. erowid.org/exp/24404",
 "substance": "DXM (with CPM)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "32 tablets",
   "oral",
   "DXM",
   " ",
   "  tablets",
   "oral",
   "Chlorpheniramine Maleate"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24404",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 14, 2005",
   "Views: 8398",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAbout 2 and a half years ago I checked this out and I couldnt belive a otc product could fuck you up as bad as some illegal hallucinagenics. After reading much about, and others experience I decided to try. The first time I took a whole box and it was great. The 2ent I took 1 and a half boxes, even more of a insane trip. But the third time I thought I would go for this forth platuo that I'd been hearing about. So I popped 2 boxes I think it was 16 pills per box so thats 32 pills or about 980mg dxm. \r\nAt some point the oxygen must have been cut off to my brain because I was fucked up for several weeks after, not able to speak or walk properly, every day I'd go to sleep and pray when I wake up to be normal again, it never happened, and every day of my life since I regret because I have theses terrible daily symptoms which I refer to as 'HEARING ELECTRICITY'. Almost every morning and at least a few times a day I hear this sound like electric sparks or static down the back of my head and neck, and my head stomic starts to hurt, my throat and tounge go numb and I get dizzy and feel like collapsing on the floor. Sometimes are worse than others in the fact that these spells or whatever u wanna call them last from a few min up to 20. This daily occurence has really frightened me. I am truly scared to see a doctor in fear of serious damage and that he'll tell me I wont live a long life.\r\nSo for the past 2 and a half years Ive dealt with my self induced affliction with booze, opioids, and most of all the high grade extreamly potent marijuana. I feel like a aids/cancer patient..etc. patient  in the fact that I dont smoke like most ppl rather I see it as medicine and I take my dry bong toke doses through out the day. I will see a doc soon because its not getting better.\n\n\n"
}
