{
 "title": "Memorable",
 "author": "Nog",
 "citation": "   Nog. \"Memorable: experience with Calea zacatechichi (ID 24402)\". Erowid.org. Jun 10, 2003. erowid.org/exp/24402",
 "substance": "Calea zacatechichi",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Calea zacatechichi",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Calea zacatechichi",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24402",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 10, 2003",
   "Views: 18378",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Calea Zacatechichi      Smoked/Tea</p><p>I was a bit skeptical of this plant at first, as I'd read a number of mixed reports.</p><p>After testing myself for allergic reaction with two leaves under the tongue (a tip thanks to another Erowid contributor), I prepared a sizable amount of Calea Zacatechichi in a clean pipe, and settled down to smoke it while I simmered a generous amount of leaves and stems into a tea.  Fifteen minutes later, I managed to get the tea down without too much trouble.  The reports of the disagreeable flavor were quite true.  Sugar seemed to make it worse.</p><p>The first effect I noticed was that I felt a little stoned, as though I'd just smoked a small amount of cannabis.  Unlike cannabis, though, I felt exceptionally fluidic and clear-minded.  Very relaxed.  After noting this, I recommended some to my girlfriend, whom I then joined in bed for the night's sleep.</p><p>Ironically, I felt the Dream Herb held me with a bit of insomnia.  After an inordinate amount of time tossing and turning, finally I fell asleep.</p><p>I had expected (rather, hoped) to find myself lucid in a dreamworld filled with an extraordinarily rich tapestry of symbols and meaning, but was not so fortunate.  Even so, I had the most peculiar, memorable dreams indeed.  More commonly I'm unable to recall dreams in the least.</p><p>The first dream sequence I remember involved the home I grew up in.  I was visiting there for the sake of nostalgia, the current owners more than happy to show me around.  This home was nothing like the real home had been.  The door was round, and opened by rolling to one side, creating this wonderfully authentic stone-grinding sound.  The ceiling had been vaulted, and the interior was beautifully decorated like some sort of elvish workshop.  It was warm, and there were candles and lit fireplaces everywhere.  The air smelled of sweet spices and cocoa.  The owners of the house were a group of eccentric musicians, calling me to come to the basement with them to view their equipment.</p><p>Equipment, they had a lot.  The basement of this place was brightly lit with flouroescent light, a drop ceiling with small tufts of stringy cotton in the center of each tile.  This seemed important.  Everywhere was musical equipment.  Keyboards of all kinds, drums, hand drums, woodwinds, stringed instruments, even a harpsichord.  It seemed crucial somehow that there was no brass to be seen.</p><p>There were other dreams, all of the same unusual theme.  Consistently, the dreamscape was extremely vivid, and I found this to be very rewarding.  Perhaps most importantly were the 'moments' that occured during the dreams, moments that seemed to buzz with urgency, as though I was being directed to take note of certain details.  Those times are the brightest in my memory, but I've been so far unable to assemble any meaning of them.</p><p>The Dream Herb, to me, lived up to it's name very well.</p>"
}
