{
 "title": "A battle I regrettably won...",
 "author": "Noirceuil",
 "citation": "   Noirceuil. \"A battle I regrettably won...: experience with Salvia divinorum (10x extract) (ID 24447)\". Erowid.org. Jun 13, 2003. erowid.org/exp/24447",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 24447",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 13, 2003",
   "Views: 7270",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having read many experience reports on this drug, I was anxious and very nervous to try this (potentially) very powerful hallucinogen. Quickly, a small bowl was packed of the 10X extract my girlfriend and I had ordered from an online ethnobotanical supply store. I hit the bowl eagerly, in my girlfriend's (let's call her C) unlit dorm room. A pleasant gray light from the overcast sky (which I found beautiful) was filtering into the room, and the album 'Worship and Tribute' by Glassjaw (a mutual favorite of ours) was blasting on the stereo. I inhaled deeply the strange, not unpleasant smoke and exhaled when I could no longer hold it in. Suddenly, I became plastered to the bed, as if punched by some malignant phantom. My face and torso became indescribably tight, as if the walls were closing in and constricting me. I experienced a calm euphoria, and it passed within seconds. I eagerly packed another bowl, a much larger one this time, in an effort to do the job right! I smoked, retained, and then released. </p><p>Again came the constriction, much more severe this time, and it felt as if my mind was trying to free itself from my physical body, and that I would soon burst at the seams. I delved into complete and total incoherence, giggling like a maniac at thoughts that made no sense. It was coming, I was going to break though, the dissolution of the ego and the rational mind, an escape into a world of pure energy and...</p><p>But I was scared, and I, at the last second, fought it. I battled the Salvia and won. The high dispersed, and I missed my opportunity to take a mental vacation into the furthest regions of space.</p><p>It was C's turn. SHe smoked, held it in, and released. Within seconds, she had turned extremely pale and was shivering as if terrified. I kept asking if she was okay, and she responded by screaming 'Nothing belongs to me!!! Nothing belongs to me!!!' I became frightened, thinking that she would 'snap' and that I would have to physically restrain her form running around the room, etc. I put on her favorite cd (Counting Crows' 'August and Everything After') and tried to soothe her as best I could. Within a few minutes, she had calmed down. She later equated the brief experience to the peak of an extreme acid trip. If only I had let myself go, I would have been able to empathize.</p><p>What makes this drug so scary, I think,is the speed with which it comes on. If the effects took several hours to peak, one could easily adjust him/herself to them and 'flow' with the experience, rather than be attacked by it.</p><p>Because the drug was done in a dorm in which C did not feel comfortable, the Salvia magnified these feelings to an exponential degree. I had the worst trip of my life on mushrooms in my Bronx apartment (which I hate) and I could only imagine what would happen had I done Ms. Salvia there.</p><p>I will do this again, I will let her take me where she will, and I will do it in a park, where I feel the comfort of nature's embrace.</p>"
}
