{
 "title": "Get Off My Lap",
 "author": "Victoria",
 "citation": "   Victoria. \"Get Off My Lap: experience with Salvia divinorum & Cannabis (ID 24450)\". Erowid.org. Jun 13, 2003. erowid.org/exp/24450",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "106 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "24450",
   "Female",
   " ",
   "Not Given",
   "Jun 13, 2003",
   "Views: 20723",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Im getting too old for this stuff. Im only eighteen but I have experienced a wide range of drugs and a few addictions. I feel old. It was when I found mushrooms that I began to feel really old. I grew them and ate them often, and discovered the secrets of the universe, even if I forgot them the next day. I thought I was so grown up. Then came the bad trip. Twenty potent little Mexican mushrooms, twisted and albino with potency threw my mind into something unspeakably terrible. If it wasnt for my boyfriend, Id be alive, but not myself. Id be insane, and hed probably be locked up. I almost ruined both our lives that night. </p><p>I get mushroom flash backs now, and sometimes even smoking too much pot is too intense for me. For a girl who used to kick back and chain smoke fat blunts every day, I hardly smoke at all now, once an evening, or twice if Im visiting a friend. But as much as that trip struck fear into my very soul, it also hardened me. But my mind was not ready to trip again.</p><p>Salvia would be the second drug I ever intentionally did without researching first. Normally Im all over the Internet about a drug I want to try, or at least I was. But this Salvia really just came out of nowhere, or it kind of did.</p><p>I almost think God was warning me the day before I smoked Salvia, because I was talking to one of my high school/college friends on the Internet and he said he had ordered and tried some Salvia. As far as I know, he has never actually tripped out on a drug before, be he said he think he was on this stuff, and it ruled because it only lasted 20 minutes. I was skeptical, but I told him I thought it was cool. </p><p>The next day I was alone and bored and went and visited my friend (Well call him Nick). He told me he ordered a huge bag of Salvia leaves and asked if I wanted to try. We smoked a joint, I dropped him home, and said I was going to come back later and try that stuff. He told me to bring my glass bong. I went over later and he led me into the woods by his house. We sat on a log by the pond. We were alone and it was pleasant. I like Nick; hes always been generous to me. I took the first hit of the bong, and ripped it like I usually do when I smoke pot. He told me to hold it in so I did. By the time I exhaled, I was light headed and giggly. Suddenly the scenery changed. It shifted and moved, till the forest closed in on itself and all I could see were the same pattern of leaves. I was frightened. My body hurt and it felt twitchy. I could no longer see my body, or Nick. </p><p>When does this stop? I asked. I had a very hard time speaking. What do you mean? he asked. He obviously didnt know I was tripping out. The tone in his voice was very nervous. I panicked. Maybe I never smoked that shit in the first place, I thought. Maybe Im just going insane. Maybe my mind just snapped and Im going schizophrenic like people sometimes do. I wanted to cry. And Im sure Nick thought I was insane. I was very embarrassed by what was going on, but I knew I had to look past the embarrassment and do whatever I needed to do to get out of this safely and as quickly as possible. I needed to ride it out. Ride it out or stay insane forever. I couldnt see Nick, but my basic instinct knew he was the one who was protecting me so I wrapped my arms around his neck and climbed closer too him. Everything hurt so much When does it end!?</p><p>Then, it stopped. </p><p>I was just sitting on Nicks lap in the middle of the woods on a log. I jumped off his lap WHAT THE HELL WAS THAT!? I demanded. By now, he had smoked the rest of the Salvia in the bong. He looked different than before. We had a few laughs, smoked a bong of pot, but his sense of humor had changed too, and every once in a while hed say something off colored, or even frighten me. I became very uncomfortable after a while of being there; alone with this guy who is supposed to be my friend but is giving me the look the way a snake looks at a mouse. The Salvia, on him, was unappealing and frightening. I drove him home.</p><p>I zoned out a few times, especially when I was saying goodbye to him and I couldnt stop looking out my car door at this water bottle I had crushed. As I drove around to wear off the pot high, sometimes the world seemed surreal and objects seemed huge. </p><p>That night, I told my boyfriend, and gave my bag of Salvia Nick had given as a present (before I smoked it) to him. He says it was foolish of me to have tried tripping out, especially since my mind has become fragile with the mushroom abuse. That I already see specks of light in the dark, I already space out and have nightmares and panic attacks, what more could I want? To die? To become a vegetable? He said he didnt save my life that night, forcing me to vomit up the mushrooms, so I could go insane some other way. </p><p>The bag of Salvia is folded up in a box, under the bed now. We might sell it. We might destroy it. But I think Id like to keep it. Maybe Ill try it again someday, but I will wait until my wounds heal, if they ever do.</p>"
}
