{
 "title": "Chasing the Pixie",
 "author": "CreatioExMortem",
 "citation": "   CreatioExMortem. \"Chasing the Pixie: experience with Salvia divinorum (Leaves) (ID 24485)\". Erowid.org. May 20, 2007. erowid.org/exp/24485",
 "substance": "Salvia divinorum (Leaves)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   "  T+ 0:15",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24485",
   "Male",
   " ",
   "Not Given",
   "May 20, 2007",
   "2512",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After buying Salvia leaves, I tried to expirience it by smoking a bowl, not to great of an effect. Things around me seemed to be shinier, but that's all. After being dissapointed by the effects, I tried smoking about 4 more bowls, to the same effect, lasting about 5 minutes. I had read that chewing a quid produced more pronounced effects, and lasted longer, so I put about a cheekfull, or about 10 leaves (They were broken up, so I'm just estimating) in my mouth, chewing every 10 seconds or so and letting the juices coat my mouth, never spitting, but swallowing about halfway through (10 minutes in) and then swallowing the rest after a total of about 25 minutes.  This, unfortunately, had the same effect, only it lasted about 20 minutes. </p><p>Now, fed up, I got my water pipe, packed a bowl of about 8 leaves, and ripped it all in one hit. While I was holding the first hit, I packed another bowl into my water pipe.  I then repeated this, smoking two bowls in about 30 seconds time, holding each hit for about 12 seconds. As soon as I took the second rip from my pipe, I had the oddest sensation that a pixie had just flown up through the pipe, through my head, and into the cieling, where it then flew very quickly to my room, as part of the cieling. It seemed upset because I had taken something of hers, but the fact that it was upset did not bother me. I can remember saying 'whoops' as I chased it back to my room, because it occurred to me that I had unintentionally taken whatever it was of hers that I took.</p><p>On the way to my room, I had the sensation that my head was moving along a set path in space, that I could not deviate from, not because it controlled me, but because it had been set that way and that was the way it would be. When I got to my room, pixies, in the form of a rainbowish stream of light flowing across my cieling were happy to introduce me to their god, and it was as if I was in some vast forest, and he was a tree who ruled them. A few seconds later it occured to me that he was in fact my lamp.</p><p>At this point, about 2 minutes into the trip, I suddenly snapped back to reality, and the remaining effects quickly wore off.  I realized where I was, and was somewhat astonished at the absurdity at what had just occurred, and how I had completely believed it, without question. I then took two more hits, in the same fashion as before. This time, I could hear my thoughts in my head, the kind of thoughts that just float around at all times, like music playing in my head, or a sentence that I may have been rehearshing in my head.</p><p>These thoughts then became tangible objects, and I could see them, although the visuals were weaker than before, and I was more or less only aware of their physical existence.  They then spread out over my ceiling, and then began to flow down my closet door, and began to pool around where I lay on the floor.  At this point, I closed my eyes, and the thoughts that had pooled around me seeped into me and turned into a spectacular, kaleidescope-type array of colors, that occured to me to be bears for some reason. They began to fade into random 3-dimensional geometric shapes, mostly cubes, that then began to to decompose and fall apart.  Then I snapped back and the effects once again quickly wore off.</p><p>If you're looking for a quick trip, I'd definitely reccomend this, as the effects are very short and the after-effects are minimal.  But I would definitely reccomend that the more expirienced psycoactive user consider taking the extract, as the leaves will probably leave you wanting more. After my expirience, I decided that the 5x extract would be more fun, and the 10x would probably be my stregnth of choice.  I hope you people found this informative, if not entertaining. :P</p>"
}
