{
 "title": "No Boundaries",
 "author": "Phil --(Favillous)--",
 "citation": "   Phil --(Favillous)--. \"No Boundaries: experience with 5-Meo-DMT (ID 24488)\". Erowid.org. Jun 15, 2003. erowid.org/exp/24488",
 "substance": "5-Meo-DMT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24488",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 15, 2003",
   "Views: 8256",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>preparation:</p><p>Did some quick meditation (if one could prepare themselves for this they'd already be enlightened and pumping enough DMT out of their own brain.......), and put on Lateralis by Tool.  Made a little boat out of tinfoil and put just the tiniest bit (equivalent of maybe 6-10 grains of salt? maybe less) of 5-MeO-DMT into the tin foil boat.  I'm assuming I ended up smoking about 5mg of the substance........</p><p>countdown:</p><p>Lit a candle, sat down on my bed, put a gutted pen tube in my mouth and held the foil over the flame.  Within a couple seconds it turned to an amber liquid, and in a few more began to smoke.  Sucking....................</p><p>blastoff:</p><p>Some people are hit while exhaling...........I was hit before I finished sucking it in!  As all trip reports say............it truly is beyond words.  So alien, yet almost familiar.  Terrifying at first (mostly at the thought that I did too much, or that my heart rate would go so high I'd die), but I breathed steadily and the fear faded to a tolerable level.  I was filled with something not malevolent, but not quite benevolent.........sort of sublime.........mostly something that just 'is'.  A feeling like my physical boundaries and to some extent mental boundaries (of awareness) are melting away.  A sort of warm floaty feeling, like ecstasy, but at the same time totally unlike it.  There weren't really any visuals except some thick short trailed tracers, and a weird kind of veil of light.  The music I was listening too got kind of distorted and speeded up sounding, and distant.  Time seemed to stand still during the peak.  It was most intense as soon as I hit it, with the peak lasting maybe 5 minutes, with intense effects for 10 more.  It began to taper off after that over the next 10 minutes, and after a total of 25 minutes has remained as an afterglow of the experience up up until the time I'm writing this (about 45 min have passed since I hit it).</p><p>This drug is NOT for the faint of heart.  Experience with other intense psychedelics beforehand and the ability to remain calm will make it much easier to handle.</p>"
}
