{
 "title": "Dimensional Travel",
 "author": "Jeff S.",
 "citation": "   Jeff S.. \"Dimensional Travel: experience with DMT (ID 24526)\". Erowid.org. Sep 22, 2004. erowid.org/exp/24526",
 "substance": "DMT",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "55 mg",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24526",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 22, 2004",
   "Views: 11470",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was the fall of 2002 on the shores of Kootney Lake in Canada. Through much research and preparation I was ready to blast off. Immediately after exhaling, what seemed to be the sound of a strange radio like frequency combined with a crackling noise began to emerge in the room. Within seconds I was shooting through a dimension that didn't involve the physical reality we now experience on Earth. Time, the way we experience it normally seemed to stop only to reveal a world of infinite knowledge and beauty. A place where the very fabric of life was flowing through everything. I remember my friend who had already experienced DMT had told me to remember that Everything is how it should be and to try and remind yourself to keep breathing and surrender to the experience. <br>Once fully immersed in this new world I was astonished to find out that I could communicate with other beings that also seemed to be sharing this experience. Although I had read about people like Terrance McKenna seeing gnomes and machine elves as he put it, I experienced orb-like creatures who would come close and then come together in formations almost as if to try and tell me to do what they were doing. I kept saying 'Oh my god' over and over and was completely overwhelmed with infinite knowledge of how the world really was and that the love that was all around us always could bring so much power and manifest into anything we wanted. I also experienced visions of the sacred geometry that I am now finding out to exist everywhere. It is the fabric of these realities that we experience. It represents the perfection in all that we are. <br>The 10 minute experience seemed to be an eternity. And when I finally came through the other side I felt reborn. I was assured by this universal force that everything is O.K. in the world. That my higher self had already decided that it was going to experience physical form on Earth and to know that Love will bring forth the truth. And that through love we can begin to understand who we are. I could go on for days about this and would love to but let me leave with this thought. DMT is a gateway not to be abused, but to be explored and experienced and cherished. Enter with an open heart and mind and remember. The Universe is unfolding as it should. Learn to LOVE it.......\n\n\n"
}
