{
 "title": "I.V.  Use of Phenethylamines",
 "author": "oldhippy",
 "citation": "   oldhippy. \"I.V.  Use of Phenethylamines: experience with 2C-T-2 (ID 24555)\". Erowid.org. Jan 26, 2004. erowid.org/exp/24555",
 "substance": "2C-T-2",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "IV",
   "2C-T-2",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24555",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 26, 2004",
   "Views: 9888",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>mind set: bored , somewhat stressed, desiring some thrills , yet somewhat apprensive, having found no reports of IV phenethylamine use. </p><p>I had previously made a 1 milligram per milliliter solution of 2C-T-2 in water.  Having gained posession of a 1cc syringe today, I made the guess that 1/4 of my previous oral doses (which had been 20 mg) would be about equal in affect if injected.  That would mean i would need 5 mg (or five 1 cc shots of my solution), which sounded tedious but do-able.  I reasoned that I could I could always stop if the process was boring or not paying off. </p><p>T+0 - injected 1 milligram of 2C-T-2 in H2O, i.v.</p><p>T+15 seconds - felt signature before needle left arm          </p><p>T+30 seconds - body and traces  </p><p>T+1 minute - more effects than 20 mg oral at its peak.  Dizzy, much color and traces.  </p><p>It continued to get more powerful for the next 30 minutes. I had some light tummy effects, not bad at all, very pronounced 2ct2 effects, colors, motions and body feel.  Slowly tapered off over next 2.5 hours to near base line. Peak was at least 2 times as powerful as 20 mg oral with 1 mg injected!! </p><p>I am 49 and in very good physical shape and could only think to myself, 'Thank God that was only a 1 cc syringe and not the 5 cc I had planned on using.  1 milligram IV 2C-T-2 was just about as much fun as i could handle' So my word of EXTREME CAUTION to any would-be IV experimenters is EASY DOES IT.  Just like seasoning chili, you can always put more in, but too much is a big problem          .</p>"
}
