{
 "title": "No Puke Fuel & Water Extraction",
 "author": "Lurid Burn",
 "citation": "   Lurid Burn. \"No Puke Fuel & Water Extraction: experience with H.B. Woodrose Seeds (ID 24552)\". Erowid.org. May 22, 2007. erowid.org/exp/24552",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "8 seeds",
   "oral",
   "H.B. Woodrose",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24552",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 22, 2007",
   "Views: 28679",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Want to dose Hawaiian Baby Woodrose seeds without puking?  Read on.</p><p>Personally, I have read or skimmed every single HBW seed report.  Holy cow, folks, we are creating a legacy of barf.  One after the other, puke-a-rama.  And yet, there is information available regarding the extraction of LSA.  Why arent more of us doing it?  Well, below I describe a cheap and very effective extraction method.  Next time you ponder these seeds, do yourself a favor and consider this preparation.</p><p>Briefly, about me: Ive done over 250 LSD trips, about 20 MDMA trips, 7 DXM excursions, and a couple significant Salvia experiences.  Cannabis and alcohol has flowed throughout it all.  Now, drug experiences are rare, but still enjoyable.</p><p>Before my successful LSA extraction, I did have one prior HBW seed experience.  One week earlier, I ingested 8 (crushed, dark brown coatings removed) seeds in blended water and ginger.  I tripped on what felt like 1 1/2 hits of LSD and felt quite drunk.  But, 3 hours after I dosed, the incessant stomach cramps overtook me and I puked big time.  Felt like poison was crawling through my veins.  At dose plus 5 hours, merely walking down my hallway, I lost consciousness, collapsed, and then puked again.  That being said, I still had some fun with the seeds.</p><p>So now I am determined to make an effort and separate the bad from the good.  Exactly one week after my first HBW trip, I dosed again, with proper prep.  And, despite a slightly sloppy execution, the method worked flawlessly.  (However, my trip ended up a little on the light end.  Perhaps it was tolerance from the week before, maybe it was I didnt totally crush up my seeds, or maybe 8 seeds, when using this method is a diminished dose.)</p><p>PREPARATION:</p><p> 8 Hawaiian Baby Woodrose Seeds</p><p> Coleman Fuel (AKA white gas) (available at camping supply and hardware stores)</p><p> 8 oz. Distilled water (available at grocery stores)</p><p> Two jars with lids</p><p> Two coffee filters</p><p> Cookie sheet or comparable flat surface</p><p>This will take about 3 hours preparation and an additional 28 hours of non-involvement waiting.  (You must invest this time.  No shortcuts.)</p><p>Scrape off all dark brown coating on HBW seeds.  Perhaps if an extraction really does only extract the LSA, this step is irrelevant, but, for me, with the stomach churning memories of a non-extraction trip fresh in my mind, I scraped anyway.  I used a strong Xacto knife.  It took about an hour.  Eventually I had 8 seeds that now were of a very light coffee color.</p><p>Crush / smash seeds.  Ideally you want all seed matter to be reduced to powder form.  Use a coffee grinder, or a mortar and pestle.  I just crushed them with pliers, then dropped them in a Ziploc bag and hammered them.  This left me with a portion of powder, a majority of granules, and a few stray larger chunks.</p><p>Add seed matter to jar.  Pour in fuel, enough to cover seed matter, plus some.  Ive read you cant add too much, but you can do too little, so go ahead and use the fuel.  Leave enough room in the jar to shake it later.  I used Colemans fuel, which comes in a 1 gallon can and is readily available in camping & hardware stores.</p><p>Seal jar and shake it up.</p><p>Let this sit for 60 minutes, shaking occasionally.  Sometimes a seed chunk would hug the jar above the fuel line.  I made sure to swish the liquid around so that all seed matter was in the fuel bath before walking away from it.</p><p>With a coffee filter over another jar, pour the seed mush and fuel through it.  Takes a little time.  Eventually you will have fuel in the 2nd jar and seed pulp in the coffee filter.  Apparently you can re-use this fuel, but having bought a gallon, I opted to set the opened jar outside and let it evaporate.</p><p>Spread the seed mush out on a cookie sheet.  Smell it.  Smells bad?  It should.  But take note of that fuel smell as you will want to let the seed mush sit here for a few hours until YOU DO NOT SMELL THE FUEL ANYMORE!  Also, keep it out of the sun, and open a window.  Just let it sit and evaporate.  For me, it took about 3 hours until I could no longer smell the gas.  What was left was a familiar nutty scent attributed to the HBW seed.</p><p>Add dried, fuel-scent free seed matter to a clean jar.  Pour in 8 ozs. of DISTILLED water.  Ive read that tap water, containing chemicals, isnt good enough.  And that 190 proof Vodka is the best.  But the extractions using alcohol call for 3 days waiting which I did not have.  I bought a jug of distilled water at the grocery store instead.  Whatever amount of water you add at this point you will end up drinking the next day for the dose.  I chose 8 ozs., but I suppose less would be just as good.</p><p>Seal lid.  Shake it up.  Let sit for 24 hours.  The liquid will go from light yellow, to gold, then light brown, and finally, one day later, dark dark brown.  I shook it up occasionally.</p><p>Now, with a coffee filter over a water glass, carefully pour water & seed mush through filter.  This is a much slower process than the first filtration, so be patient.  It took about an hour.  And I ended up accidentally spilling some over the side.  When all water and seed mush is strained, discard the filter and mush.</p><p>In your water glass you now have 8 ozs. of water containing the LSA of 8 HBW seeds.  Congratulations.  I drank mine slowly, over the course of 30 minutes.  I held each gulp in my mouth for a few minutes, seeing if I could get the LSA going sublingually quicker than the normal slow LSA onset.  I also took large gulps of clean water in between.  I felt light effects 20 minutes after starting the drink.  Within 2 hours I started my peak.</p><p>I had dinner at 8pm.  And confidently dosed at 10pm.  I had a 4 hour peak LSA trip that can be described as somewhat psychedelic and very drunk.  Some visual distortions, and some fun emotional journeys.  I had absolutely no problems in my stomach.  I probably could have even eaten if I had felt like it.  Although, since I spilled some water at the end of the extraction (I ended up with 6 ozs. in the glass) and I didnt entirely smash up my seeds, Id speculate I did not get as much LSA from 8 seeds as possible.</p><p>You could always use a larger amount of seeds and then check yourself as you gradually dose.  Also, there is a lot of talk of Everclear or 190 proof Vodka, or even 80 proof alcohol instead of the distilled water.  Ive read that water, no matter what kind, will not totally eliminate the nausea-causing elements of these seeds.  But this was not my experience.</p><p>At any rate, be careful.  I hope this helps.  Enjoy.</p><p>_Lurid Burn</p>"
}
