{
 "title": "Bad Experience",
 "author": "Lillas J",
 "citation": "   Lillas J. \"Bad Experience: experience with Nutmeg (ID 2457)\". Erowid.org. Oct 4, 2001. erowid.org/exp/2457",
 "substance": "Nutmeg",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.8 oz",
   "oral",
   "Nutmeg",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2457",
   "Female",
   " ",
   "Not Given",
   "Oct 4, 2001",
   "Views: 11912",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nwhile waiting for some 5-MeO to be delievered to me, I decided I could no longer wait to have a psychadelic experience.  I had read how to make nutmeg tea.  Not one to be made sick easily, I quickly dismissed any warnings referring to how sick nutmeg can make people, and went to the store to look for some whole nutmeg.  I couldn't find any whole nutmeg which is suggested, so I settled for a 1.8oz jar of ground nutmeg.  I came home, announced to my family that i was going to be trying this, and got to work on my nutmeg tea.  I followed all the instructions, and about an hour later, I was very excited to drink it.  It was quite possibly the most horrible concoction ever, even after having poured about 1/6 of a Honey Bear honey jar in my tea.  I was still drinking granules of nutmeg after having strained it.  After I got to almost the bottom of my tea, I couldn't drink anymore, so I dumped it out and felt suddenly very tired. </p><p>I didn't want to move even to go to the bathroom, so for about three hours I laid on my couch and watched 'The Shining' with my younger sister.  I have seen 'The Shining' several times and although it is a very creepy movie, I was excessively spooked by the middle of the movie and had to go to bed.  It was making me feel oppressed by the amount of spookiness I was feeling.  I finished my nutmeg tea at 830PM and laid down for bed at 1AM.  When I laid down in my bed, i looked at my wood walls with the dark spots on it and they were moving down like the walls were slowly melting.  I felt like I was floating and had no real contact with reality.  I felt sick.  I fell asleep shortly after that.  At 6:30 that morning, I woke up, grabbed a blanket off my bed and went downstairs and leaned over the toilet for about 20 minutes.  My mom freaked out and called poison control.  I never threw up, but I felt nauseaus for a good three hours.  All morning, I felt like I had a really bad hangover from some really bad liquor.  I had a horrible headache, too.  I had to call into work sick because I was incapable of driving (things were still spinning).  The lethargy was like nothing I ever felt before: I couldn't stay awake for more than 40 minutes at a time.  I spent my entire day sleeping.  I felt fine the next day.  </p><p>I am not sure if my experience would have been different had i used whole nutmeg as opposed to ground nutmeg, but I am not going to find out.  I am through with nutmeg.</p>"
}
