{
 "title": "Mocking Reality",
 "author": "Cernunos",
 "citation": "   Cernunos. \"Mocking Reality: experience with Salvia divinorum (5x extract) (ID 24589)\". Erowid.org. Mar 31, 2005. erowid.org/exp/24589",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24589",
   "Male",
   " ",
   "Not Given",
   "Mar 31, 2005",
   "Views: 3210",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend came over last night with a small bag of Salvia. 'Here,' she said, tossing the baggie on the coffee table, 'smoke a nice big hit of this.' I don't take much convincing with things like this. Throw a bag of about anything at me; I'll probably smoke it. I'll try anything twice, and this certainly sounded better than the T.V. show I was watching.</p><p>I had actually smoked Salvia once before. It was a small hit off a pipe and the herb had not been treated with Salvia extract as this had. It was a fairly intense rush nevertheless, but I promptly forgot about the whole thing and, indeed, that this herb even existed. So I stuffed my glass bowl full of the leaves and fired it up. What followed was the not only the most intense experience I've ever had with drugs, but also undoubtedly the strangest experience of my entire life (so far). I lost consciousness immediately. As many readers will understand, the trance that followed is anything but easy to describe. The image that sticks with me more than any is that of reality as an enormous book. My entire world, everything I was experiencing or had ever experience were 'really' just pages in a huge volume from which I had now been separated and could now consider from this new perspective. My life, my entire life from beginning to end was in those pages, turning steadily as my life took its course.</p><p>But now something was wrong. The pages had stopped turning and begun falling away from the book. This just could not be, I was thinking, but there it was. Everything I had known to be true had only been created by some supreme force as an elaborate distraction for me. This was Death, and even if I could put the pages back in the book and get them turning again, it wouldn't matter. This was Death, unavoidable, unrelenting.</p><p>I thought of my mother and childhood: all fiction, all part of the enormous book. No escape, I couldn't move or speak. The supreme entity had me completely and was now showing me the mockery of what I had thought of as life. Now I was here, in a sort of 1930's, dark cartoon of death, my entire life dissolving before me.</p><p>When I finally began to piece reality back together, I had left the chair were all this started and was making my way outside to my porch. As I regained lucidity, my friend told me I had thrashed about a good deal in the chair, saying 'no, no, no' over and over. She said I tried to stand, against her advice, and immediately fell to the floor. I noticed I had barked my shin on something and taken out one of my house plants, but all else was unharmed. She and I went for a long walk in the night air while I tried to collect and express my thoughts and feelings. This was especially hard so soon after the experience, but I absolutely needed to talk about it. It helped me calm down, and we went back home. The whole experience lasted all of about 5 minutes, although I am still feeling residual affects now, 24 hours later.</p><p>Do I regret this experience? Absolutely not. It has only given me a new perspective, an idea that reality just might be some sort of illusion, engineered to keep us all from the truth, for whatever reason. (Yes, 'The Matrix' has occured to me.) And the next time I do it, I'll be ready.</p>"
}
