{
 "title": "Retirement Plans",
 "author": "Anohate",
 "citation": " Anohate. \"Retirement Plans: experience with LSD (ID 24594)\". Erowid.org. Jun 22, 2003. erowid.org/exp/24594",
 "substance": "LSD",
 "bodyweight": "110 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24594",
   "Male",
   "",
   "Not Given",
   "Jun 22, 2003",
   "9407",
   " "
  ]
 ],
 "report": "<p>Yet another weekend, yet another sojourn down the lsd-brick road. Again, we have a more introspective experience, but hopefully still interesting to anyone not burdened by the need for sensationalism.</p><p>The night began in extremely banal circumstances. My fellow trip buddies and I sat around for several hours trying to work out what to do on a Saturday night in a fairly dead city. No idea seemed to satisfy, however, and we had resigned ourselves to a night of boredom. After awhile, though, someone recalled a party that may have been occurring that very night. Through a bit of remotivation we ended up deciding to go. At this point, the thought of acid was not even remotely close to being on the fringe of any of our conciousnesses. We arrive at the party, soft drugs in hand and proceed to smoke ourselves silly in an alienated pocket of the event. The gracious host, however, asked us if we wished for something more substantial and immediately had a vendor on hand to satisfy us. We bought more than our share, so we could maintain an archive, and munched one tab each to attempt to bring the night to life.</p><p>Nothing that odd happened at the party. Despite, at one point, a baby being brought in the house and left right where we had been smoking cones not minutes before. After awhile we decided to leave and drive back to a place of residence...the problem was, the drugs were already starting to kick in. Our driver undertook a sheer effort of will and managed to get us across the city at a constant 40km/h to where we needed to get. From this point we enshrouded ourselves in warmth and music and let the drugs take hold.</p><p>Timeframes from this point on are a bit garbled, so i shall relate different segments of the experience individually.</p><p>The drugs lasted for *ages*. It was an unrelenting trip that just went on and on, but never quite pushed my mind far enough to make me uncomfortable. In fact, quite the opposite, the familiar state of bliss was evident for most of the trip, just the overwhelming feeling of being 'at home'. It's like I was born in a lsd-candy land but can now only afford to take small journies back. When the electric tendrils race up your legs and arms into your brain, I swear acid is better than procreation. Mixing the two is a story for perhaps another time, though, since I didn't quite have that luxury on the eve in question.</p><p>Most visuals behind closed eyes were quite impressive. Impossible to describe except as high definition multi-coloured structures of patterns. I guess my vocation gives my brain alot of things to work with when things are slightly skew. One day I shall endeavour to draw some of these whilst under the influence, so to provide a much more vivid description. There wasn't very much in the way of open-eyed visuals, except in a couple of small cases as will be explained.</p><p>One particularly disturbing part of the evening was dealing with an overly affectionate cat. This cat had trouble breathing and thus made strange noises. In semi-darkness with this cat sitting on my lap staring up, it became quite disquieting. From my view, all I saw was a feline shaped object making 'snarling' noises at me. The trouble was the cat was completely harmless, and this I knew, but my brain couldn't communicate this and so I began to get quite skittish of this snarling beast. After having to move the cat to regain composure...it came up again and sat next to me. This time, though, it wasn't an aural illusion that made my uncomfortable, but a visual one. The cat appeared as normal, except as I gazed up its back towards its head, it became narrower and narrower till its head was extremely small compared to the rest of it. The best way to describe it was a furry pyramid with legs and a small head at the tip of the pyramid.</p><p>Outside in the garden, staring up at the sky, was an almost religious experience. Drifting clouds give the acid-addled imagination almost too much input to play with, especially with a starry backdrop. It was here I could feel many vivid realisations making themselves apparent. They were of quite a personal nature, but as an overview, revolved around people in my life and their positions. I almost called the people in question to tell them, but at 3am and undergoing acidic rigour, I doubted I could make much sense. I don't know whether to trust my instincts under the effects, but the ideas felt so poignant and real that it was very hard to ignore.</p><p>It was also outside; that the trip hit it's hardest off the evening. This was after several cones, quite late in the evening. I was leaning against a pole and had my eyes closed as the world felt like it was on an angle and I needed to lean on the pole to stay upright. The pole becomes more useful though, as I felt my brain gushing out of my head as multi-coloured soup, the pole was helping me dam the soupy tide and keep my brain in my head.</p><p>The rest of the evening was sitting in a chair in a darkened room, having my brain wracked by psychedelic assaults and having limited discourse and much laughter with my fellow triphounds. Noteworthy events included dealing with the concept of not being solid entities and trying to eat weird toasted sandwiches. I also made a firm commitment to spend my retirement fucked on drugs. You're gonna go old and senile anyway...may aswell enjoy the process. I reckon with the pension you could afford a couple of bags a week and a tab a day.</p><p>To sum up...a rocking good trip, but as always, to communicate the specifics is so very hard. Perhaps ill take notes next time. Next time....eheh</p>"
}
