{
 "title": "Method of Preparing Salvia divinorum Blotter",
 "author": "The_Stalker",
 "citation": "   The_Stalker. \"Method of Preparing Salvia divinorum Blotter: experience with Salvia divinorum (ID 24597)\". Erowid.org. Jun 19, 2003. erowid.org/exp/24597",
 "substance": "Salvia divinorum",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Salvia divinorum",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24597",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2003",
   "Views: 43126",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>How to make 'Blotter Salvia' by The_Stalker</p><p>This is simply a method of preparation so that you get all the benefit of salvia without need for a bong or tasting horrible smoke. This method is nearly tasteless, and produces a smooth trip.</p><p>You need:</p><p>5 grams Salvia Divinorum dry unextracted</p><p>100 ml of solvent (more on solvent choice below)</p><p>900ml water</p><p>Jar or 1 liter flask</p><p>Bowl </p><p>Funnel</p><p>Coffee grinder or Mortar and Pestle</p><p>Filter Paper or Coffee Filter</p><p>Tea strainer or fine mesh sieve</p><p>1.\tPowder 5grams of dry Salvia Divinorum leaves. A coffee grinder will work if it is the type with a small bowl and a spinning blade. A mortar and pestle is best though.</p><p>2.\tIn the jar or flask, combine powdered Salvia with solvent. (A note on solvents; any polar solvent will work but for this extraction an alcohol is best, either 151 proof Everclear or 70% Isopropyl Alcohol [rubbing alcohol].)</p><p>3.\tLet this mixture sit for 10 hours.</p><p>4.\tAdd your water to the flask or jar. Adding water to the alcohol lowers the solubility of the active ingredient Salivorin A to the point that it will fall out or ?precipitate?. This will make your 1-liter solution look slightly cloudy; it is the clouds that you want. Let sit for 5 minutes.</p><p>5.\tSet up your funnel with filter paper over the bowl. Get your tea strainer above the funnel.</p><p>6.\tPour the solution from the flask, through the strainer and filter into the bowl. Do it slowly, don?t let the liquid get more than half way up the paper.</p><p>7.\tWash out your flask or jar with more water to get any residue on the bottom, again pour it through the filters.</p><p>8.\tDiscard the liquid and save the paper. You should notice a nice round area on your paper that looks slightly green or yellow.</p><p>9.\tDry your paper in an oven; 2 minutes on 300 degrees work fine. It will now look as though you have crystals on your paper and indeed you do.</p><p>Cut this circular green are into five equal pieces, each one is good for a nice oral trip or maybe two smoked. To use simply take one of your strip and place it under the tongue, the effects can be felt in about fifteen minutes. A strip may also be smoked for more immediate effects.</p><p>The advantages of this method are that there is no harsh smoke, and no bitter taste.</p>"
}
