{
 "title": "Being Without Time",
 "author": "Shalahara (Adda)",
 "citation": "   Shalahara (Adda). \"Being Without Time: experience with Salvia divinorum (Leaves) (ID 24604)\". Erowid.org. May 6, 2007. erowid.org/exp/24604",
 "substance": "Salvia divinorum (Leaves)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "0.25 oz",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2002",
   "24604",
   "Male",
   " ",
   "Not Given",
   "May 6, 2007",
   "2803",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A late summer evening I was sitting quietly alone by the window, watching the sun go down rolling the Salvia into small cigarettes. It took a while to roll about 5-10 of these salvia cigarettes, and then I stated smoking. Immediately into smoking the first, I had a weird sensation. It was like a had a whole experience which came from someone else. It was an old Englishman's dream, like Walter Raleigh or Isaac Newton (of that era.) and it was in the form of -a tube in my mind-. It was like a kind of 'reward for an old explorer' and not at all modern or novel. I didn't exactly like it, but it was calm and passive, like a cigar. I began to feel very philosophical about time.</p><p>The next few smokes brought on a deeper a more meditative trance, and gradually my mind emptied of all thoughts. I felt as if I was fully in the present time, and the process of time had retreated into illusion only. I thought 'I really do love this herb!'. Then something very strange happened to my body. I was fully inside my head, as if I had never been there before, and I began to feel circuits inside my braid coming to life, which had always been alseep. I feel like calling it (salvanorin) 'The Wake-up Drug'. Once I had reached the peak of the experince (5 smokes out of 10), I felt like I was quite literally 'GROWING' like a flower, with a flowerpot in my neck and stems, branches and many leaves making up my brain pathways, and two big yellow sunflowers for my eyes. I could -FEEL- all the inside of my head, and though it has always been a bit of a scary place to live, that day it felt cool and clean and lubricated, like washing my brain in gentle water.</p><p>Suddenly a very strange thing happened. It felt as thought I had no right to be in my head, and a creature was in the room which was pretending to be mind mind. I don't know if I was completely dissasociated from my own mind and it had left me behind in my body, or whether it was a kind of floating creature which was in the room with me. I felt excellently heathly in my body, but the mind-thing was paranoid and possesive, and wanting to resume a position somewhere behind me, where I couldn't see it. I had become very aware of what I could and couldn't see, and I kept wanting to turn my head to see waht the Solipsist cannot see. I began to see how limited normal perception is, and how paranoia comes about.</p><p>Eventually I was distracted by the TV and a need to drink water, and as soon as I got up to walk about, the experience began to end. The Salvia seems to like you sitting very still, exactly like a flower in a pot does, exacly like a flower on a windowsill; alone but not a lonely experience.</p><p>Thank-you Salvia, for my little insight into a timeless life.</p>"
}
