{
 "title": "Enjoyable, Eye Opening and Mind Blowing",
 "author": "Rossman",
 "citation": "Citation:   Rossman. \"Enjoyable, Eye Opening and Mind Blowing: experience with Mushrooms (ID 24639)\". Erowid.org. Mar 23, 2006. erowid.org/exp/24639",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24639",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 23, 2006",
   "Views: 3689",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, I've been a weed smoker for quite a few years, always scared of other drugs. I was scared of shrooms the most because people told me you saw things... All this time I was missing out...\r\nMy firend invited me over, and he had a big bag of shrooms. Being afraid, I bought some beer and downed two while he munched a few grams. I kept asking him how he was feeling, and he kept saying 'Ok... these shrooms aren't that good...'\r\nI thought, hey, since they're not really powerful, why not have a few.\r\nHe seperated a gram for me, and coke in one hand, to wash down the horrible taste I knew was coming, I munched and munched and munched on those things, like he told me to, until they lost their flavor. I looked around, everything seemed to be normal.\r\nHe told me they took about an hour to kick in, and we decided to make a pizza in the meantime.the pizza was made, and still, I felt nothing.\r\nAbout 40 mins after I took the shrooms, eating my first peice of pizza, I start to feel extremely drunk, as if I had 7 or 8 beers, which is a lot for me. I felt like, if I stopped eating the pizza, I would puke. If I continued eating the pizza, I would puke. The only thing that was keeping me from puking was chewing the peice that was in my mouth.\r\nMy friend suggested that a smoke would settle my stomach, and we headed outside. When I got up, I noticed I stumbled around a lot, as if I was too drunk to stand. I got outside, and looked around.\r\n'Does everything have a tint of red?' I asked my friend, looking at my surroundings. He agreed, and started laughing. I started laughing at him laughing, then he started laughing harder at me laughing, and then, when I asked what we were laughing at, we broke into a laugh that exceeded any weed laugh I had ever been on. My sides really hurt from laughing that hard.\r\nI noticed the trees looked fake, and my hands looked like play-doe, and I started talking about God, and what the after life will be like. My mind never felt so clear.\r\nOne other thing I found very enjoyable, smoking. It was cold outside, but I wanted to just stay outside all night and chain smoke. If felt so good... Smoking not on shrooms now is just bad...\r\nWe did this again and again, going downstairs, watching TV, then going out for a smoke, the whole time I was talking about life, and how things worked. Ideas seemed to flow without interuption from my brain to my mouth.\r\nWe went upstairs to the computer, because I was telling him about a neat tattoo and body peircing website, and he had to see it. I started asking him to put music on, but he was too slow, so I started singing, making him laugh to no end.\r\nFinally the music came on. It was American Headcharge, a seriously heavy Nu-Metal band. It was amazing. It sounded so good. I thought music was great when I was on weed, but on shrooms I could not only feel the music, but see it in my mind, picture the people playing on their guitars. It was amazing.\r\nWe looked at pictures of motorcycles, and laughed a lot at this inside joke we have, then went to the peircing website. We looked at penis peircings, and grabbed our crotches in pain, then looked at... ahem... female peircings. There was one picture where the woman had her legs spread wide open to show the peircing. We stared at it for an unusually long time, then I asked him:\r\n'Hey man, is that picture pulsing?' He agreed, then we flipped out, cause this was the first real messed up vision we'd seen all night. I complained about him being an old man, and wanting to go to bed at 12, so we went down and ate another gram each. Nothing was really happening, so I decided to go home. He was complaining about gas pain, and he had to take a crap anyways.\r\nBefore I left, he told me I wouldn't be able to sleep. I shrugged it off and went home, thinking it was just him. On the walk home all I could think of was my girlfriend, and how much I loved her. I had the warmest, happiest smile on my face the whole way back. I think right then I really decided for sure that I was going to be with her forever.\r\nWhen I got home, I wrote her a few messages on the computer, and picked up my guitar. I had never been so inspired to write before. Playing was an orgasim in itself. I made my bed, then lied down in it. I tried to see if I could get an errection, but I couldn't, probably because I really wasn't thinking about sex at the time. My mind was racing about EVERYTHING but sex, like how life works, where my life is going, the meaning of life, and how much I love my girlfriend.\r\nFinally I turned off the lights, and waited in bed till 6 in the morning, not able to sleep. My mind was racing the whole time, and I had some gas pains. Every time I stood up I could feel my stomach fall from resting against my back to pressing against my croch... if you know what I mean. It was a painful feeling.\r\nI think I passed out finally, but the next day I was alright. I will definitly do this drug again. It was great, and I should've done it sooner. One thing I noticed, because I did it and didn't see anything really trippy, I have a craving to take more, and better shrooms to see something crazy... I'm not afraid anymore!\n\n\n"
}