{
 "title": "A Guided, Mapped Way",
 "author": "Grand High Larry",
 "citation": "   Grand High Larry. \"A Guided, Mapped Way: experience with Mindfulness Meditation (Samatha) (ID 24666)\". Erowid.org. Oct 18, 2004. erowid.org/exp/24666",
 "substance": "Mindfulness Meditation (Samatha)",
 "bodyweight": "160 lb",
 "header": [],
 "footer": [
  [
   "2001",
   "24666",
   "Male",
   " ",
   "Not Given",
   "Oct 18, 2004",
   "Views: 8653",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI have been practising a form of mindfulness meditation called Samatha (meaning calm) for almost 2 years now, and have found it to be a very beneficial thing to do.</p><p>To give you some background; I am a 24 year old male, living in England. I have suffered from depression on and off since I was 19, and fortunately I have had years at a time of being completely okay and quite happy. Unfortunately the depression has returned on two occasions since I was first ill, and i have sought various ways to deal with it.</p><p>I started smoking cannabis (mainly high THC skunk) when I was 20.  I've found it to be a great way to relieve stress as it stops me worrying about anything. This is great if you are worrying about silly things that make you depressed, but the side effect of cannabis is that it makes me really lazy. I've also tried DXM (a few times), Mushrooms (only once) and Nutmeg (never again!)</p><p>Anyway, in the Autumn of 2001 I decided to try meditation. I had started reading about Buddhism in a book my housemate had lent me. It seemed to be really interesting, fitting in with what had until then been my personal philosophy, and explaining the causes of my suffering (depression).  I joined a class to learn meditation at my local University and began to practise at home.</p><p>Meditation in a Buddhist setting is about learning how to observe your mind, and hence have more control over your thoughts and feelings, by recognising that they are not an integral and inseparable part of your self.  Letting go of thoughts that hurt or upset me is THE WAY to be happy.  Cannabis can help me to do this, but makes me really lazy.</p><p>Most meditation works by focusing on an object of concentration; the breath entering and leaving the body in this case.  We generally meditate for 30 mins at a time. It is very hard to concentrate just on one thing, and when I first began to meditate I found my mind constantly bringing up other things for me to think about.</p><p>Slowly, over a period of months of practice, one can learn to let the distractions of the mind drift away, enabling one to concentrate more on what one is doing. I have made some progress, and now am able to meditate for about 10-20 seconds without any distractions.  After a year or so of meditation, I now start to feel really happy when I meditate.  I find it is easier to concentrate on things in my everyday life, as meditation seems to be practise to deal with distractions, worries and thoughts that are painful, or unwanted.</p><p>I have gained a lot of other things from meditation, such as greater feelings of happiness, kindness towards others, etc... but I feel that these things are also partly because I have been trying to be a good buddhist for the last 2 years. </p><p>Finally, I have a theory on the trippy and spiritual side of meditation and psychoactives: If my brain has different channels of thought (like sound mixing channels on a mixing deck) then drugs turn UP the volume on the weird ones (like dreams, sometimes useless, sometimes fun, sometimes insightful, sometimes scary).  Meditation seems to turn the volume DOWN on  every day normal thoughts, and worries (I need to tidy up my room, get some lunch, go out and meet some girls, pay the bills, learn to drive). This allows me to hear the drug-like thoughts more easily. In this way, the two paths have a similar effect, and could possibly be combined.</p><p>I think meditation is a guided, mapped way of exploring my consciousness.  Many others have been this way before, and will be there to help in hard times, or if I go off track.</p>"
}
