{
 "title": "Venlafaxine is Highly Addictive!",
 "author": "Fubus",
 "citation": "   Fubus. \"Venlafaxine is Highly Addictive!: experience with Venlafaxine (Effexor XR) (ID 24673)\". Erowid.org. Nov 16, 2004. erowid.org/exp/24673",
 "substance": "Venlafaxine (Effexor XR)",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24673",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 16, 2004",
   "Views: 24874",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy Advice: Do Not Try This Drug Unless Death Is The Only Other Option!<br>I am gonna keep this short. Major depression and suicidal thoughts and plans ruled my life. I had actually acquired 2grams of heroin and syringes to shoot up an OD and end my life. I told this to my doctor and he gave me Effexor XR. I was to take 75mg the first 14 days, and then 150 mg each morning. So I did for 2 months.<br>Effexor XR removed depression in the blink of an eye, and I was cured...., or so it seemed. Along with my depression, all my feelings disappeared too and I was unable to feel anything. Actually that was great! At least for a period. From being in the extreme hell of major depression, it felt like arriving in heaven to have no feelings what so ever.<br>Anyway, after a while I started missing living, cause on Effexor you are not alive, you just exist. I was urging to feel something, I was desperate to feel life, sadness and joy. I missed crying, but I coudnt.  After the first three weeks, I started getting serious adverse effects. It was hard to see the difference between dream and reality. I did not care for anything, nothing seemed to light my fuse. And I did not care if I was dead or alive, because infact I was already dead.., temporarly dead by effexor! I started getting suicidal thoughts and could not think straight, I decided it was time to quit!<br>So I did! I quit effexor! Not for loong though.., The same day I skipped my first dose I felt really bad! I was totally full of pain and discomfort. And I got som dizzy episodes, that I cannot explain better that similar to epilepsy. It was terrible. Day three I was totally unable to function, I had to lay down in the bed, coldsweating, shivering, nausea and all that! It also felt like I got electrical shocks all over my body, and that was hellish. I had to start on Efexor again. I took a pill and was totally normal within 4 hours!<br>I set up a plan for tappering the dose slowly:<br>75mg 6 days<br>50mg 14 days<br>25mg 14 days<br>12,5mg 14 days<br>I did it and followed the plan, and quit efexor. It was terrible and I did it with great difficulty, but I did it, it is possible! It's been 4 weeks since I stopped taking the last dose and I still have dizziness and epileptic-seizure-like episodes. <br>If you are going to try Effexor, search for 'Effexor widthdrawal' and 'Venlafaxine withdrawal' on google.com or another search engine, and I can guarantee you that you will change your mind! 99% of all matches brings out 1000s on 1000s of reports of people being addicted to this horrible drug and struggling to get off it.<br>Also go to rxlist.com and see all the reported side effects. And with this drug you will probably experience a whole lot of them!<br>Trust me! Stay off Effexor, its just not worth it!\n\n\n"
}
