{
 "title": "Levitation",
 "author": "Bear",
 "citation": "Citation:   Bear. \"Levitation: experience with Cannabis & Cocaine (ID 24685)\". Erowid.org. Mar 23, 2006. erowid.org/exp/24685",
 "substance": "Cannabis & Cocaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  joints/cigs",
   "smoked",
   "Cannabis",
   " ",
   "  ",
   "smoked",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1980",
   "ID: 24685",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 23, 2006",
   "Views: 4748",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nBack in 1980 I was a freshman at a small liberal arts college in the northeastern U.S.  I had begun to experiment with drugs other than my mainstay of marijuana used during my high school years.  \r\nOne night I was partying with my friend I'll call L. We were smoking bong hits and adding some powdered cocaine to the tops of the pot hits.  I don't remember that we were smoking anything particularly potent but what followed was something I wonder about to this day. We were sitting cross legged on the floor facing each other. I took another hit and put the bong down. All of a sudden, I felt myself levitating and bringing L up with me until we were about 6 feet up and hovering just below the ceiling.  I remember looking right at L and being calm and as content as the Cheshire Cat.  We stayed floating there for what seemed like 30 seconds and then we _ever_ so gently returned to the floor. \r\nI have often wondered whether we were physically floating or whether our spirits were briefly freed from their normal constraints.  I am leaning towards the latter.  The gentleness of the whole experience really struck me. I felt as if we were being cared for by a higher power and to this day I think about this and am confident that we are not alone and are cared for and loved by being(s) that we can't ordinarily perceive.  I was also awed by the fact that we both perceived this phenomenon simultaneously.  When we were back on the ground, L asked me 'were we just floating'? Yes, yes we were.\n\n\n"
}