{
 "title": "Noone Ever Really Knows",
 "author": "imcoma",
 "citation": "   imcoma. \"Noone Ever Really Knows: experience with 5-MeO-AMT (ID 24695)\". Erowid.org. Jun 23, 2003. erowid.org/exp/24695",
 "substance": "5-MeO-AMT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24695",
   "Male",
   " ",
   "Not Given",
   "Jun 23, 2003",
   "Views: 46390",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I planned to experiment with this chemical at a high dose after trying 2.5mg 1 week prior and experiencing very little effect. I chose a dosage of 15mg because I had a friend that had taken that amount over the course of 12 hours with no dangerously toxic effects.</p><p>     I was at my house, by myself, for the majority of this trip, and had gotten a good nights sleep the night before. I was in a pleasant and anticipatory mood leading up to the dosing.</p><p>12:54pm - Fasted for the last 13 hours. Ingested 15mg 5MEO-AMT powder dissolved in 1.5 ml distilled water which I mixed with cranberry juice.</p><p>1:36pm - Nausea. Distinct body change. Noticeable in back muscles and jaw. Increased sensitivity to contrasts of light and dark. I feel a need to excrete or vomit, though I don't really want to.</p><p>1:45pm - Body chills. Very sensitive to temperature.</p><p>2:01pm - Quiet sounds are much louder to me.</p><p>3:47pm - Watched a movie. Had a bout of diarrhea earlier. Colors. Walls not bleeding, but crawling images on my mind. Vomiting would probably feel good, but I don't like to vomit.</p><p>Definite mildly euphoric head change is evident. Communication is fun. I began thinking about things that have been on my mind recently and feeling very pleasant.</p><p>?? - I just felt exceedingly like a personification of death.</p><p>?? - Wow. It's overpowering at some moments, but I can still function. I've had two phone conversations that went well. One was fun. One was scary; I had to run for it.</p><p>?? - Wow. This is some strong shit. Yoyo baton wand oscillations of sound that moved on controllable tracks. [describing an aural hallucination]</p><p>6pm - Wow. I have never had something so in control and out of control simultaneously. I feel precise. Moving and stretching isolated muscles feels good. There is a heightened awareness of my body.</p><p>\tsidenote: If I were to ingest much more than this I would probably need a babysitter to regulate fluid intake. I have been very thirsty because of the diarrhea. I feel stripped.</p><p>\tI have  a very shaky grasp on communicating with others. I wonder how I sound. Conversations I'm having in my head are going on on paper at the same time and I am getting confused.</p><p>7pm - I've misplaced one glass of water already. The trip is more comparative to mescaline than to mushrooms. 'Noone ever really knows,' seems to be a recurrent theme. I have a much greater ability to describe this trip as it happens than I have encountered with other hallucinogens. I'm finding more than typical meaning in words I am writing. I became fixated with 'Being Still'...</p><p>8pm - Spilled my first glass of water.</p><p>Thoughts:</p><p>\tIt was really nice. It made me cry.</p><p>\tSome people are so very carefully wrapped up in themselves that it would take a long time to make them unwrap.</p><p>9pm? - I got dressed and walked two blocks to a local coffee shop. It was very hot, and I dressed a little too warmly for the weather. The environment on a typical summer evening in a residential neighborhood was very distracting and almost overwhelming. The crowd at the coffee shop was very alert and chaotic, and I experienced some paranoia. I felt it best to not stay long, and only spoke to one person.</p><p>10pm - Still going very strong. Visuals. Increased awareness. Very thirsty. Feeling slightly tired.</p><p>\t-Earlier I felt as if I were in a container of no sight, no sound; echoing through me. I was moving in and out of these chambers on the x, y and z axes.</p><p>1am?? - started drinking scotch to go to sleep. Still very 'up'.</p><p>3am - Finally fell to sleep.</p><p>730am - woke up and could not get back to sleep. Mind still felt very active, but the majority of the effects of the trip were gone.</p><p>Reflection: I enjoyed the experience. I did not stray far from my notebook the whole trip, and had an enlightening time exploring my writing and thoughts on recent events in my life. I realized more than ever that I'm a fairly morbid person at heart, and that I'm very comfortable with that.</p><p>     Thoughts of having people around to talk to on the same level as me were appealing. When I try this again, I want to do it with a friend or two that take a similar dosage.</p><p>     I also began thinking on being still, as I mentioned earlier. This is concentrating on being as still as I can be in order to more carefully appreciate everything going on around me from moment to moment, by noticing the states of inactivity between moments at a very exact level. I've carried this with me since the trip, and feel pleased with the event.</p><p>Caution:</p><p>This is a very potent hallucinogen. I have had experience with LSD, mescaline, 5MEO-DIPT, DXM, and mushrooms, some at high doses, and this is comparable in strength to any of them.</p><p>Care must be taken. The threshold at which the trip becomes obviously perception altering seems to be very sharp. A friend of mine did 10mg and had a trip that was nowhere near in intensity to what I described above. Doses under 6mg seem to have very little effect, although different reports say otherwise.</p><p>In all, it was pleasant, though a little long, and I plan to do it again, albeit at a slightly lower dosage.</p>"
}
