{
 "title": "A Dangerous Yet Appealing Chemical",
 "author": "czeckmate",
 "citation": "   czeckmate. \"A Dangerous Yet Appealing Chemical: experience with 5-MeO-AMT (ID 24727)\". Erowid.org. Jun 23, 2003. erowid.org/exp/24727",
 "substance": "5-MeO-AMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24727",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 23, 2003",
   "Views: 21055",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been testing out the substance 5-Methoxy-Alphamethyltryptamine on five of my friends. I have used the substance more than twenty times before, and have been a trip-sitter for all of my experimentations.  Basically, not many people know what 5-MeO-AMT is; if they've heard of AMT, they may think it's a very powerful chemical to take orally or through the nose. Or, like 5-MeO-DMT, they think the chemical should be smoked in order to feel the proper effects.  I've tried all three routes and so have my five friends, so most of the commentary is a mixture of what five different people had to say about the experiences.  I'm basically just going to give a run-down of the effects for each route.</p><p>Smoked (amounts tried: 5mg - 15mg) - Definitely not the best way to enjoy the chemical. The smoke's a little harsh, but doesn't have a bad taste like other chemicals we've smoked.  After smoked, there's a feeling of anxiety for around an hour, then the 'full' effects kick in.  A little more physical and less mental; stimulation increased, moderate visual distortions.  'Psychedelic speed' and 'Five Methoxy Alphamethyl'amphetamine'trytamine' were said by a few friends as a way to describe the feelings.  Duration:  16 - 20 hours. </p><p>Snorted (amounts tried: 3mg - 15mg) - I personally do not recommend anyone snorting this chemical.  Effects kick in quick: stimulation, euphoria, hallucinations, sweating, tremors.  It feels like methamphetamine mixed with weak acid, to me.  The chemical taste is very unpleasant (bitter).  This is a very unnecessary and dangerous route.  Only abusers of this substance would use this route.  Duration: 24 - 26 hours.</p><p>Orally Ingested (amounts tried: 5mg - 30mg) - This seems like the safest method for recreational use, though I will say I find nothing safe about the drug itself.  Mixed with drinks (non-alcoholic), effects were first noted at forty five minutes.  Starts as anxiety, forms a short 'chilly' and 'interesting' plateau before the long peak, and peaks for about sixteen hours.  Stimulation, hallucinations (both auditory and visual), strange thinking and/or thoughts, aches, stomach discomfort, cramps, and a few other acid-like effects.  Every individual who ingested 5-MeO-AMT ended up vomiting, though they said the vomiting was subtle and the trip slowly worked into a boundless peak afterwards. Very acid-like, but something seems 'missing', everyone says.  Too 'speedy.'  Duration: 16 - 20 hours.</p><p>As I mentioned, every individual who orally ingested 5-MeO-AMT ended up vomiting, so I have no clue what's up with that.  Everyone also complained about odd stomach sensations that bothered them as well as cramps, feelings of 'weakness' in joints in their body after the trip subsided, lots of sweating, and too much stimulation.  I do not think this chemical is safe for human consumption whatsoever.  Three of the five individuals noted a strange feeling on the left side of their head, around the area of the ear.  They said that they usually felt it in the middle or towards the end of the trip and it lasted until the next day.  Some say it feels like throbbing, some say it feels like something's being pumped or is rushing through a vein, and some say it hurts.  One individual who had a very bad (what I call) 'left side of the head' experience, with pains in that area throughout the whole trip, the next morning, and two days afterwards.  That next morning, he also reported bleeding from some of his upper gums for no reason.  I cannot say whether this in particular is related to the chemical, but either way, like I've been been saying: this chemical is dangerous and definitely not 'safe' by any means.</p><p>Another thing that I'd like to add is that there IS addiction potential with both tryptamines AMT and 5-MeO-AMT.  Two different individuals (not associated in our group of five) took AMT at around 75mg per day and 5-MeO-AMT at 10mg a day and after a month, stopping led to insomnia, increased eating, strange behavior, cravings for the substance, and other amphetamine-like withdrawal symptoms.  There are kids out there ordering this substance from chemical companies on the internet legally and diluting them with liquids and selling hits as acid (LSD).  This is very UNSAFE and if you have any ambition on doing this kind of thing, remember that AMT and 5-MeO-AMT have MAOI capabilities and people who are taking certain kinds of drugs can die from a mixture of the drugs.  Be careful, people.  Don't be stupid.</p>"
}
