{
 "title": "Like MDMA With No Rushes Or Pushes",
 "author": "John Random Lab Rat",
 "citation": "   John Random Lab Rat. \"Like MDMA With No Rushes Or Pushes: experience with Methylone & Cannabis (ID 24739)\". Erowid.org. Jun 24, 2003. erowid.org/exp/24739",
 "substance": "Methylone & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 8:00",
   "2.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24739",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2003",
   "Views: 14252",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nAte about 125 milligrams in gel caps on rather full stomach. Was probably still a bit stoned from previously smoked pot. Definite alert in about half an hour, some mild psychedelia and definitely the same warm glow as from ecstasy developed. No visuals, but a deeper focus on things and a somewhat widened consciousness.\r\nNo problem functioning or interacting with people. I guess most of my friends didn't notice a thing, my eyes seemed pretty normal and I was fully in control of my behavior. Cannabis felt truly wonderful (like with ecstasy, and other phenethylamines...).\r\nHad a good time walking in the midsummer night with a couple of friends who were also doing some chemical research. Couldn't stay inside with other guys & girls who would just stare the tv and drink beer and/or smoke pot. We went to a park to smoke the rest of our weed and had fun just being curious.\r\nAfter a few hours there was still a strong stimulant effect as i rode home by bike. Felt probably a little like being on an SSRI as somebody suggested; I tried citalopram for a couple of days a while ago but didn't like it one bit. This was definitely a better state of mind :)\r\nThis gradually subsided and I got to sleep about 8 hours after ingestion with the help of 2mg melatonin and a lot more pot. \r\nThe next morning there was a little stretched-out feeling, but felt generally ok. Would probably try a 150-200 mg dose the next time... if a next time ever comes. Interesting stuff anyway, I'm glad I tried it.\n\n\n"
}
