{
 "title": "Gateways to Insanity",
 "author": "Catfish",
 "citation": "   Catfish. \"Gateways to Insanity: experience with H.B. Woodrose (ID 24748)\". Erowid.org. Oct 12, 2007. erowid.org/exp/24748",
 "substance": "H.B. Woodrose",
 "bodyweight": "11.5 kg",
 "header": [
  [
   "DOSE:",
   "6 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24748",
   "Male",
   " ",
   "Not Given",
   "Oct 12, 2007",
   "Views: 9872",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>To begin with, a friend who regularly sold weed to my friends and I commented that a headshop near our home had a new line of legal highs available, and that out of curiosity and scepticism, he had decided to try woodrow (the name we gave it, its easier to say when your jaw doesn't work). He recommended it, even though he could get almost any substance, so we decided to give it a go. He said the minimum of the seeds we would need would be three, so between four of us we bought fourteen seeds. F took four seeds, S,D and I took three seeds each, and we threw one away because it was deformed. the trip as a whole was rather disappointing, we all suffered major tiredness, pains in the legs and very slight confusion. That afternoon we layed and watched various television until three am when we finally fell asleep. The trip was boring, if it was not for the immense fatigue and confusion, and difficulty moving from place to place, we had no real trip at all. We decided that the seeds were no good and decided to stick to hashish for the forseeable future until acid was available from the local dealers.</p><p>However, in May 2003 I had suffered a break up with my girlfirend of one year, and felt the need to do something to take my mind off of the situation. Foolishly i decided to invite the same three friends over and repeat the experince with more seeds. I went to the same headshop that day and bought 21 seeds. S,D and F all took 5 seeds, whereas I took 6. We ate them at about 8.30 and went to the local shop before they had kicked in. After leaving the shop the effects had begun already. The same crippling leg pains were present, as was tiredness and slight confusion. </p><p>The effects begun to climb, and by 10pm, F and I were having a very enjoyable time. We giggled and talked crazy things all safe in the knowledge that my brother, who was not on woodrow, was in the house in case anything went wrong. S reported that he was getting very few effects at all and was not sure if what he was getting was forced or genuine. D said very little apart from that he was getting something. Half an hour after this, I was tripping quite heavily, as was S and D was downstairs relaxing while F stood upright in the hall unable to move, giggling like a schoolgirl. S and I were upstairs listening to Tad, though not really taking in the music. After what seemed like a long time, everyone went back downstairs while I went to my room to call my girlfriend. I was still upset and wanted to straighten things out. I told her i was on woodrow and she understood, and tried to sooth me and not send me on a bad trip by saying anything upsetting. She told me some jokes and then I hung up and went to watch Tv with my friends.</p><p>After watching a very confusing cartoon, followed by more cartoons, we arrived at a show called 'Ned's Newt', which simply must have been invented to scare people on woodrow. It was extremely confusing and I was having mild auditory hallucinations throughout it. Also I was repeatedly rubbing and poking and scratching my head without realising, like one second I would be sat enjoying the cartoon and then without warning or transition be pawing at my face. This freaked me out and I began to feel sick. I decided to go to my room and go to sleep. I left the guys downstairs, sure they would be fine. </p><p>As soon as I got inside my room I felt trapped, I was getting extremely bad vibes. I felt alone and like nobody would understand. I called my girlfriend up again and she said some stuff which I don't remember but I remember didn't help me. I thanked her anyway and layed down to go to sleep. Suddenly I felt really sick and had to get up to throw up. I threw up quickly in three bursts into the toilet, and despite my condition I managed to clean my bathroom and myself and I did a pretty darn good job. I went to bed feeling no better and closed my eyes.</p><p>Immediately I felt out of place. My room seemed huge, when I knew it was tiny, then felt even smaller, like a box. I was unaware of the postion of my body, i.e. I was touching one wall then the next with no apparent movement. I also had a few actual hallucinations, such as my wall being huge, and my radiator seemed very strange indeed. Also I couldn't stop thinking. The thoughts seemed to be patterned, as if I knew what thought was coming next, yet they were completely random. To top it all off I had extreme paranoia that my friends downstairs would be trashing the place. Then I held a small conversation with myself, speaking out loud, telling myself that they couldn't move, let alone trash the place. This cycle went on for about two hours. I finally passed out at about 3am.</p><p>When I awoke I felt better, I could still taste my vomit but I had my mind back. D had gone at about 6am because he couldn't sleep, F claimed to have had an amazing experience, and S also claimed that sleep was difficult because of thoughts. The whole day after I felt tired and was not content with watching TV, I felt I had to do something that took advantage of my seemingly increased intellectual power, but when I thought about this I thought that the drug may have lasting psychological effects, which worried me.  The thing that had happened both times was we had all shared symptoms that others had not reported, we hypothesized that this may be because of a psychosomatic response to the effects the others have. Many other things seemed to happen that night, too many to report, it was indeed unlike what we had imagined the first time around. I don't think that I would try it again, though F says he really wants to, but I am glad that I did it, for the experience.</p>"
}
