{
 "title": "Beautiful Terror",
 "author": "calleme,sonja",
 "citation": "   calleme,sonja. \"Beautiful Terror: experience with Zolpidem (Ambien) (ID 24795)\". Erowid.org. Mar 29, 2006. erowid.org/exp/24795",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "24795",
   "Not Specified",
   " ",
   "Not Given",
   "Mar 29, 2006",
   "5879",
   " "
  ]
 ],
 "report": "<p>Ambien had been prescribed for my inability to sleep.  I took in normal dosage for at least a few weeks.  One nite I thought to myself, 'what, if anything, would a higher dosage cause?'  I took 3 10mg pills.  Assuming something bad would probably happen, I went to the highest level of the house and sat staring at a computer screen.  </p><p>Noticing a general 'odd' feeling  (floating, running water over the ears, the fact that everything seemed much more there then it usually is, etc.)  I went back to the basement.  After vomiting into the sink many times I decided to go to bed, only to discover I couldnt sleep.  Things were moving too much.  That may have been one of the nites I thought my blanket was trying to eat me.  I felt I shouldnt abuse this drug ever again.  </p><p>I awoke the next morning incredibly tired.  The entire day I felt something in my throat I wanted to cough up, but was unable to, as there was not anything there.  For many months following I abused the drug almost nitely (except for the part of the month when it ran out).  Eventually, I got into snorting it (the key is to crush the entire pill just slightly with something hard and flat.  Then, break the pieces apart and use a credit card or drivers license to separate drug from casing.  The casing is incredibly painful and sticky feeling, so I dont skip that step.  I use a hard, flat object to crush the drug into powder, cut into lines  (one big one is fun, but my nose wont care for it), and get ready for 15 seconds of insane pain  (kind of like some kinds of speed) followed immediately (the first 30 times or so) by memory loss, inability to walk or speak properly,  insomnia, hallucinations, strange urge to take more [sometimes until its gone], problems looking away from things, acting like a complete idiot (fish in glass tanks are afraid of hands),  being very afraid of everything for no reason while that the same time completely upbeat and the most friendly person in the world, and...on really rare occasions waking up with a broken nose, black eye, really huge upper lip, and scraped face.  </p><p>Although, that last one only happened when mixed with a lot of alcohol and some diphenhydramine hydrochloride.  And its better now.  Oh, and it could possibly make me really horny, but that will just lead to frustration, as my brain wont work well enough.  Essentially, I try to make sure that I'm in a comfortable place, and be very careful who I talk to and what I do.  It can be dangerous and addictive.</p>"
}
