{
 "title": "Makes Me 'Me' Again",
 "author": "Horse",
 "citation": "   Horse. \"Makes Me 'Me' Again: experience with Opiates (ID 24873)\". Erowid.org. Mar 20, 2006. erowid.org/exp/24873",
 "substance": "Opiates",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "650 mg",
   "oral",
   "Acetaminophen",
   "(pill / tablet)",
   " ",
   "20 mg",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24873",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 20, 2006",
   "Views: 24143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a carpenter.  I do anything from framing to finish trim-work, and everything in between.  About a year and a half ago, I was in a relatively bad car accident and consequently was hospitalized for approximately five months. Coming out of the hospital (and nine surgeries), I was given a slew of analgesics to try, including percocet, vicoden, vicoprofen, darvocet, oxycontin, MS-contin, and morphine.  I have chronic pain in my right knee as a result of my right patella being shattered.\r\nI have read many reports on the use of opiate analgesics and I think that I have a somewhat different reaction to them.  For example; I am a 250lb. 6'6' guy, so don't think that I am overdosing myself. This morning I took two 7.5/200mg vicoprofen (vicoden with ibuprofen instead of acetaminophen) and I went to work.  Everything sounds the same as every other account so far, doesn't it?  Well, about 30-45 min. after ingestion, I start to feel the effects.  Everything is a little more shiny and surreal.  I don't get upset in traffic and I can not really feel as acutely as I normally can.  When the effects kick into full swing, I am a machine.  I am working faster and harder than anyone else around, and there is no stopping.  Everything I do is more swift and accurate, and the hours just fly by.  \r\nTwo Weeks Later\r\nI ended up going with Oxycodone as my pain killer of choice.  The effect is astonishing. \r\nI pop on or two 10/325Mg tabs before work (I am reasonably skilled as a craftsman.  A physically demanding profession), the same dose after lunch, and again when I leave whatever I am working on for the day. On weekends I tend to lay off just to keep my tolerance relatively low.  It's funny.  Without the meds, I am restricted to sitting as much as possible, and avoiding doing anything that involves walking and being on my feet for any length of time.  But with them, I am steel.  I can walk around the jobsite all day and lift whatever needs lifting and swing a hammer as hard as I ever could (notable due to my having suffered a 'powderized' wrist.  The Percocet makes me 'me' again.  I am trying to find an Orthopedist that is willing to attempt to fix my wrist completely, but the search is slow going.  However in the mean time, Percocet is the way to go.\n\n\n"
}
