{
 "title": "Stillness and Silence",
 "author": "Matt",
 "citation": "   Matt. \"Stillness and Silence: experience with Mushrooms (ID 24886)\". Erowid.org. Apr 10, 2007. erowid.org/exp/24886",
 "substance": "Mushrooms",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 caps",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 24886",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2007",
   "Views: 2944",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This being my first time to experience mushrooms, I was obviously somewhat apprehensive. I went through with my plans however, and my friend Will and I fell into our pre-planned purchase of 6 caps. In his kitchen, we made a simple peanut-butter and mushroom sandwich, 2 apiece for us, (no, we weren't stoned!) and washed it down with a nice glass of whole milk. Another friend of mine, Josh, had also taken two caps. However, he shortly left, and doesn't play an extremely big role in this story.</p><p>About thirty minutes into the trip, well into the night, I began to feel a little giddy, as if drunk but without the stupor. The three of us were in Will's living room jamming out. Me on the busted two-string electric guitar, Will on his wonderful fretless bass, and Josh on an old black acoustic guitar. I didn't experience anything two abnormal other than being completely enveloped in our music... which will happen on any given day, regardless of my state. After some time we called it quits and went into the main living room (Will has a BIG house) to listen to a demo cd of Josh and his band.</p><p>Slowly but surely, the effect of the trip started to take momentum as I sat on the couch listening to the music. Most anyone who's taken any mind-altering substances, light or sever, can attest to the changes in auditory perception, especially while listening to music, so I won't bother with such obvious explainations. However, upon seeing my reflection in the window, I, for no obvious reason, took extreme notice of my face. Not necessarily in a vain way, but with extreme curiosity. However, the longer I looked at it, the dimmer it seemed to become, until it had completely faded away and I was left without a reflection.</p><p>After toying around with this reflection effect for a while, I felt the need to relieve myself and in doing so, discovered an even more reflective surface: the bathroom mirror. I remembered all of the stories I'd heard from friends, and how they'd taken LSD and gotten lost in the mirror, or how they'd seen their 'true' nature. So I decided to oogle at myself for a while in the mirror. The dimensions of this mirror were no greater than two by three feet. However, after staring for what seemed like a minute, I realizd that the mirror had expanded to what seemed like six by six feet. A good analogy to this experience would be similar to the movie Sphere, where any one of the character is staring into the sphere, and suddenly they are consumed by it, and their reflections are lifted towards the top of the ball. Towards the end of this experience, I was looking at myself from a bird's eye view, in a mirror that seemed to fill the entire wall. It was only when I snapped out of this gaze, that I realized my nose was two inches away from the mirror. I had a good laugh.</p><p>I gave up on the mirrow and went in search of my comrades, who I found outside. Outside is when things started to change. Josh had taken the guitar outside, and was strumming some simple chords which sounded absolutely amazing to me, as simple as they were. I heard each string being hit, and each string had their own voice, which filled the sky and made the clouds smile down on all of us. Although it was night time, the clouds were incredibly visible, and whispered gently with one another. Soon I began to recognize simple shapes in the clouds: airplanes, rabbits, faces, almost anything. Will's back porch has an amzing view of the lights of the small city I live in, it was amazing. I felt the thrill of adventure, as I seemed to look on this city I've lived in for nearly 17 years with new eyes.</p><p>What I began to gradually feel in next hour was almost as if I had died and 'gone home'. The only way I can explain 'going home' is to realize that where I am, physically, emotionally, and spiritually is good. I felt old, beyond old, almost as if I had experienced an entire lifetime, and was now looking back on it all, ready to move on past this physical existence. I was absolutely content with everything, an infinite feeling of well-being. God smiled down on me, and I smiled back, knowing I'd be home with Him soon, knowing that my life was a mere blink in the presence of eternity.</p><p>The visuals and heightened auditory perception were mere extras. The two-dimensionalities of my surroundings were amazing, I picked up patterns everywhere. The lights of the city were beautiful and the wind never ceased to lightly press upon my face. We played guitar and talked deep into the night, about most anything. We came to the conclusion that the shrooms had uninhibited our fine motor skills, increasing our dexterity with the guitar. However, I think it was really the enhanced auditory perception that made our music seem amazing. There seemed to be a consistent chord progression that Will seemed to stick with most of the night, and it's something for me to remember that night with anytime I have a guitar in hand.</p><p>I drove home and went to bed at 4 that night, and woke up around 10. It had been a good while since I had woken up feeling so refreshed. Everyone in the house seemed to be in unusually high spirits and extremely friendly, which is not necessarily unusual, I just seemed to take a greater notice to it. It was beautiful outside that morning. I think this experience, combined with doing construction work all that summer, sunrise to sunset some of those days, made me more appreciative of the simple and basic things, people, nature, God, almost anything.</p><p>As a sidenote, I think I'm extremely lucky to have such an amazing first trip. My friend Samantha tried them for the first time, freaked out, and peed her pants. That's all I have to say!</p>"
}
