{
 "title": "Hills of Kailua",
 "author": "Rick",
 "citation": "   Rick. \"Hills of Kailua: experience with Hawaiian Mushrooms (ID 24899)\". Erowid.org. Jan 7, 2007. erowid.org/exp/24899",
 "substance": "Hawaiian Mushrooms",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "6 caps",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24899",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 7, 2007",
   "Views: 4962",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The hills around the ranch were lush and green, made mysterious and inaccessible-looking from the high mists.  I was excited and apprehensive as D and I vaulted the iron fence.  We were on a dubious errand, to say the least: collecting illegal, mind-altering mushrooms on a privately owned ranch.  Any number of things could go wrong with this scenario.  We could have dogs sicced on us, we could go to jail and if we were hurt somehow, we would only have each other to extricate ourselves.  Nonetheless my heart was filled with childlike joy at the prospect of getting a bag full of shrooms, and I knew we would be tripping on them that night.</p><p></p><p>I kept an eye trained to the hilltops for ranchers, but the first thing we discovered actually discovered us first.  A black helicopter buzzed by overhead, with D and I standing out in the open.  The sight of this bird of ill omen froze us, but after exchanging looks we decided not to let it get to us.  We crested a hill, and after scanning a dozen or so cow pies, I spotted something moving.  It turned out to be a young man who hadnt seen us, apparently.  He was downhill of us and past some underbrush.  I thought he was a ranch hand, but D hand-signaled for us to go talk to him.</p><p></p><p>We asked him how the shroom-hunting was today.  In response, he took a ziplock full of about a pound of fresh shrooms out of his bag.  D and I stared in surprise and barely restrained glee.  The kid directed us to where he had been hunting, and D and I took off toward it at a run.  After another fence-vault we spotted more hunters picking through a field.   I was struck by the sight.  Whether they were dealers or just kids out for kicks, they seemed to strike a chord in my mind that could best be described, perhaps, as romantic.  Outlaw farmers, utilizing the part of the ranchers trade that would have gone unused.  They were taking the by-product of an agricultural industry to get to a mental state forbidden by law.  It was beautifully rebellious.</p><p></p><p>D and I began scanning the cow-pies, because they were the most likely places for the mushrooms to grow.  The crew ahead of us, however, had mostly ransacked these.  After a brief search, we had gathered enough for our personal use, but decided to press on ahead of our co-farmers.  We walked up a wet cattle path, looking along the sides for errant shroomies.  Every so often, one or the other of us would get a feeling that we should look in some particular place or other, and BOOM!  There would be a fat patch of the little toadstools, winking from underneath a clump of grass or a bush.  It seemed like the shrooms were calling to us, telling us where they were, and this happened more than a few times.  As our bags filled, we became ecstatic with the thrill of the hunt, and its copious rewards.</p><p></p><p>It was like a magical Easter-egg hunt, dashing through beautiful hills, finding secrets that appeared to be calling out to us.  The illicit thrill of being on someone elses land, and the adrenaline kept us going as much as the reward.  The task itself was definitely a part of that reward.  I couldnt remember having that much fun in a long time.  After a few hours hunting we had gathered about a pound of shrooms ranging from 1 to 6 inches in length, and decided to head for home.  </p><p></p><p>We set apart the ones we wanted to eat right away, and put the rest on a cookie sheet to oven-dry.  After attending to the oven, I poured a glass of red wine for D and filled one for myself, and we drank to a good trip.  We had about 5 shrooms each from the larger ones we had picked, and put Dead Can Dance on the stereo.  D is a musician himself and we discussed music for about 40 minutes until the effects began to catch up with us.</p><p></p><p>The shrooms came on slowly and gently, not the sudden rush we had both come to expect from previous experiences.  The tribal beats and soaring vocals took on new dimensions, and set the pace for our rise into shroom-consciousness.  These shrooms were unlike the intense caps we had had before.  They had their own sort of personality, very friendly and mellow.  More than ever before, I felt as if I had been given a penetrating insight into things.  Whatever I turned my attention to, I would come up with new connections in my mind, whether it was music, or the news, or whatever.  I felt clear and lucid, like I had greater intelligence and wisdom, and a broader view of the world.</p><p>More than this, I felt compassion and empathy as well, as the shrooms opened my mind in deeper and deeper ways.  I had been out of any romantic relationship for a while, and was having a hard time forgiving myself for mistakes I had made in a previous relationship.  After talking with D, and thinking about the troubles he had with his family I realized that the love I had to give was a good thing, that I had learned from my past mistakes.  The other girl, despite being my first love, was gone and this was okay.  The shrooms told me, without words, that what mattered was sharing the warmth inside myself, and that instead of 'taking' someone for yourself, love is like watering a flower, and helping it bloom.  I felt a profound joy and relief at hearing this, and it was as if an emotional veil lifted from my heart.</p><p></p><p>Shrooms can have different personalities.  Some are aggressive and rough, like high school football coaches.  Some are like therapists, and some are like good friends.  These shrooms turned out to be very happy and friendly therapists, glad to help me work through my problems.  I am indebted to the little guys; that was a great day in my life.</p><p></p>"
}
