{
 "title": "A Trip to the Hospital",
 "author": "Anonymous",
 "citation": "   Anonymous. \"A Trip to the Hospital: experience with 750 mg DXM, 600 mg Diphenhydramine (ID 24904)\". Erowid.org. May 6, 2004. erowid.org/exp/24904",
 "substance": "750 mg DXM, 600 mg Diphenhydramine",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "oral",
   "DXM",
   "(liquid)",
   " ",
   "600 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24904",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 6, 2004",
   "Views: 32293",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well I picked up a bottle of cough syrup and a pack of 24 diphenhydramine pills at the store earlier.  After coming home from a session, I decided to take the dxm and diphenhydramine.  I chugged the whole bottle of dxm at once, and swallowed all the pills, then waited for the effects to come up.  The time was 9:45 pm when I took them.</p><p>I do not remember what happened, except for the fact that I woke up in a hospital.  My sister helped me fill in the blanks when I talked to her the following day.</p><p>09:45 PM-  Took 750mg dxm and 600mg dph</p><p>10:00 PM-  Played Tekken 4</p><p>10:20 - 10:40 PM- This is where I completely forgot everything.</p><p>11:30PM-  My sister claims I am starring and fluctuating my eyes in almost confusion.</p><p>11:45PM-  I am talking to many of my friends who are currently not in the house.</p><p>12:30PM- I went to my room to lye down, and I am twitching.</p><p>1:30PM- My sister asks me what I took, i reply by saying 20mg of benedryl, when that is ridiculous, because 1 pill is 25mg.  My sister looks it up, and asks me again, I then tell her 24 pills of benedryl.</p><p>My sister got worried and woke up my mom, explaining to her the situation.  They call the hospital to see what their options are.  They can either call the cops, take me into emergency, or take me to the hospital.  </p><p>My mom tells me that we are going for a ride, and I got up exitedly, not even wondering why we would go for a ride at 2am.  We get to the hospital, and I go outside telling my mom and sister that I am waiting for a friend of mine, they tell me to wait inside because it is cold.</p><p>In the hospital, I am hearing voices of my friends, and I am still not in coherence.  I asked my mom for zig zags several time, and she gave me a tissue paper, which I rolled.  My mom gets me to drink the charcoal by telling me that its beer.  I finally settle down and goto sleep.  I woke up at 6:30am, and we went home.</p><p>This was a scary experience which only happened 3 days ago.  I am writing this to warn people to be careful with otc drugs, and stick to marijuana.  If my sister hadnt seen how fucked up I was I could've died.</p>"
}
