{
 "title": "Orgy of Unperceivable Plorbclaxtity",
 "author": "Scarecrow",
 "citation": "   Scarecrow. \"Orgy of Unperceivable Plorbclaxtity: experience with Mushrooms (ID 24918)\". Erowid.org. Jul 1, 2003. erowid.org/exp/24918",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "13 g",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24918",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Jul 1, 2003",
   "Views: 8768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Quaintly located among the vast cow fields north of bastrop texas, a great quest so unsoberly embarked upon rises from within the fiery depths of that short period of time I was homeless.  An aquaintance as well as a good friend (who happened to be so kind enough to put a roof over my head) and I roll towards these fields of unspeakable chaos. I'll spare you the irrelevent section of the story in which we lose our way. Upon arrival my band of thoroughly intoxicated partners hop a predictably placed barbed wire fence shrouded with undergrowth, as is to be expected in a suitable shrooming environment. I assure you, the mistress psilocybin burst through the veins of these unspeakably beautiful mushrooms.  Alas, only an ounce was to be found. </p><p>Home (temporarily) at last, I devour almost half of our quasi-bountiful crop, Ratboy eating only an eighth, and Chris none, Ratboy and myself trip our way towards a nearby albertsons to aquire cigarrettes.  Purpose fullfilled, we tread opposite our origional direction. First wave....show yourself! And it did. I hadn't payed attention to the amount I had taken in, and I made a presumptuous assessment that either I hadn't eaten enough or that they were lacking in potency. Indeed, I was mistaken.</p><p>Happily walking down the middle of the street at 2:00 in the morning, the two of us laughed and cowered at the perceptual differentiation indicative of psilocybin. </p><p>One moment, must smoke another bowl.</p><p>Moving on. Silently passing through the portal leading from the outside world and inserting our desicated viscera into the indoor plane of existance, my weary travel-worn associate passed out on the couch, and I claim my place on the starboard of the bed and make an unwittingly feeble attempt at sleep. I didn't even realize that an hour had passed, when I found myself very much awake, twitching and laughing face down on my makeshift matress. I arose cautiously as not to disturb my slumbering companions.  Everything in sight that eminated light to even the smallest extent danced wildly in my visual perception. Glow in the dark decore swirled anti-patternously in order to invoke madness in my ever descending state, spiraling downward into an abyss to be later discovered.  Stumbling through the door I fluxed into the living room, colors flashing an infinate spectrum of shaded terror. Indeed, the potency of this particularly harvested substance exceeded my expectations immensely. Clawing frantically at reality, it slipped into its original position and left me to marinate in my new hotel.  </p><p>Suddenly the floor was positioned at my back as I laughed and squirmed without pause for an approximate section of time equivalent to 3 hours. Time existed not as I basqued in my inferno. Ever played the game moria? or rogue? classic text based games from the 80's I believe. I found myself (I no longer saw the room, all that confronted my field of vision was in my psilocybin saturated minds eye) I was in moria, letters and walls and dots no longer a monotonous black and white, but rather bathed in vivid color.  Hands flapping wildly towards what used to be my face. Intense time dilation. The thought of lifting myself from the floor only a parodoxical conundrum that was rendered impossible regardless my attempts. The room I was centered in flashed into my sight briefly from time to time, and what a world it was. The pictures that hung from the walls seemed fixed, but the faces contained within them were a masque of indifferent terror, staring with the nonchalance of a god.  </p><p>The grand vision came upon me. The orgy I spoke of in the title. I'm assuming that this was the peak of my psychedelic journey. As is true with many a hard trip, I explain this mindblowing piece to the best of my ability, which is merely human. Body parts of varying shapes and sizes were melded together in odd positions and formations. Your perceptually challenged psyches cannot possibly fathom their form without the aid of psychedelic drugs, however the slightly less unperceivable aspect of this vision was the sex. Unkown sexual organs inserted themselves into unknown orifaces of no identifiable sex or species in systematically serene thrusts. Many of these carelessly constructed creatures actually posessed faces, which stared at me with looks of helplesness and dismay, all the while being raped by their more or less equals. Their ubiquitous emotions and feelings seeped through the threads of reality, infecting my mind with their undying desire for emancipation. I began to panic. Subtly, however, and not so much that it deflected the joyous path of my journey. The above explanation is all that can be conveyed by means of language. </p><p>Eventually, I retained enough sanity to sit upright. In this greatly relieving position I struggled to unravel the unimaginably unexplainably unspeakably profound experience that had enveloped me for that short period of time that felt like eternity. Oh, no no no no NOT AT ALL was I in fit condition to end my journey. That was merely the peak, another half day or so before rest can be attained.</p><p>The trek downwards from this peak took a while, and felt like an unnending state of insanity, but I pulled through and recovered after a few days.</p>"
}
