{
 "title": "Not What I Expected",
 "author": "Rupert",
 "citation": "   Rupert. \"Not What I Expected: experience with Poppies - California (ID 24936)\". Erowid.org. Jul 22, 2003. erowid.org/exp/24936",
 "substance": "Poppies - California",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Poppies - California",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24936",
   "Male",
   " ",
   "Not Given",
   "Jul 22, 2003",
   "Views: 43358",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Being an enthusiastic grass smoker and a lover of nature, I had decided to explore the realms of ethnobotany. From various sources I discovered that some effective plants were catnip, skullcap, wild dagga and california poppy - so I decided to plant some seeds. Months later my Californians were in bloom and I decided that this was the point for my hardwork to pay off.....</p><p>Selecting some prime petals and leaves I dried them out. Once this process was complete I rolled a large joint of pure poppy and took a walk wondering what to expect. </p><p>At around 2pm I smoked the joint. The white smoke had an unusual and unpleasant taste but I dealt with it and after finishing it I lay down in the grass and watched the sky...</p><p>2:15 - I felt nothing. It had so far had less effect than a ciggarette and I was deeply disappointed. However soon it started to kick in. </p><p>By 2.20 I noticed slight tracers in my periphery vision and the trees seemed to merge into a mixture of green and brown. (May I stress at this point these were not really fantastic and did not impress me). Still, it was something...</p><p>At 2:30 I knew I had to return to college but was strangely drowsy; to the point that I could not, and more importantly, did not want to get up at all. I felt incredibly sedated - similar to the effects of marajuana but without the fun. Eventually I overcame this and left.</p><p>The california poppy experience was not at all what I expected. I had hoped for a weed like high but it acted more like a sedative. It is possible that if I were to smoke heaps of the stuff I would get a more noticeable effect. In conclusion I would not reccomend Californian Poppy for anything but a sleeping aid.</p>"
}
