{
 "title": "What a Beautiful Day",
 "author": "MrRay",
 "citation": "   MrRay. \"What a Beautiful Day: experience with Hydrocodone (ID 24948)\". Erowid.org. Sep 8, 2007. erowid.org/exp/24948",
 "substance": "Hydrocodone",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24948",
   "Male",
   " ",
   "Not Given",
   "Sep 8, 2007",
   "10414",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, I was cleaning my medicine cabinent and found a full bottle of Hydrocodone.  I decided to expiriment with the drug.  After reading reports of addiction I figured that I would not use this drug two days in a row.</p><p>I took two pills orally about 1 hour before I left for pizza with friends.  After about 10 minutes on an empty stomach I could feel a beggining of euphoria, unlike marijuana or any other drug I have tried.  It was a very very nice day out, so I sat outside on my porch for about 30 minutes playing guitar.  All of my senses were enhanced, except for feeling which was number.  I felt slightly warm, and comforted.  </p><p>I then decided that the weather was so nice that I would go for a quick bike ride, on this bike ride I noticed colors seemed to have a feeling.  Like, the grass seemed to give off happy waves of energy which gave me a very uplifting mindset.  When my friend came and picked me up, I found it very easy to communicate and talk to him, no one knew I was high.  I felt an extreme sense of well-being, very secure and confident in what I was doing.</p><p>Noise seemed to connect with my surrondings.  We were listening to a light-alternative band, I don't know what it was but it seemed to set the mood for the lighting and the actions that were taking place.  It was almost like I was in a dream, where I had complete control.  I felt this way for maybe 40 minutes.  I then started to come down, and felt very very warm.  By this time a few hours had gone by since I had taken the pills, I did not feel tired but rather very comfortable.  My friends were looking for something to do, I however was perfectly content with sitting around a table just talking.  I felt as though I was wrapped in a warm blanket, and I finally went home and drifted of to sleep.</p>"
}
