{
 "title": "A Gentle Push",
 "author": "Scoot",
 "citation": "   Scoot. \"A Gentle Push: experience with Kava (ID 24955)\". Erowid.org. Jul 2, 2003. erowid.org/exp/24955",
 "substance": "Kava",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "0.5 cups",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24955",
   "Male",
   " ",
   "Not Given",
   "Jul 2, 2003",
   "Views: 27982",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having heard conflicting reports about Kava, I went to my local health-food shop and bought an ounce or so of unprocessed root for a buck and change.  It didn't seem anything special, and so wound up sitting in my generic herb chest for a week and a half, untouched.</p><p>Nursing a flat tire, I returned home from work this morning in a rather foul mood.  After changing the tire in my driveway while my wife and daughter rushed me (they were already running late and needed the car), I figured I would take advantage of my agitation and anxiety and put the Kava to the test.</p><p>I pulverized 1/2 cup of raw Kava root in a mortar and pestal, and added it to 2 cups of hot (around 140 degrees) water, mixed it in a blender for a few minutes, and then added 1 cup cold whole milk and blended some more.  I strained it through a nylon mesh, added a packet of instant hot-cocoa powder, and blended it again.   </p><p>9:00 - Okay, so I've got an evil smelling milkshake.  I've heard horror stories about kava's taste.  Here goes nothing, down the hatch.</p><p>9:01 - Hmm.  It's not that bad.  It has a very distinctive acrid taste, but it certainly isn't unpalatable.</p><p>9:02 - Hey, it really does make your tongue and lips numb.</p><p>9:03 - Second cup.  Numb tastebuds do not seem to temper the flavor.  I'm actually feeling more anxious now than I did before the first cup, prolly subconscious concerns about liver damage. lol</p><p>9:10 - Okay, I definitely feel a little 'buzzed'.  Nothing remarkable, somewhat akin to a two-beers-at-a-party lightheadedness.  Not very anxious anymore, although a little itchy.  I'll attribute it to a psychosomatic response to M. Grieve's reference to 'leperous sores'.  :0</p><p>9:20 - Feeling pretty good.  Listening to some funky music and digging it. Not too concerned about trying to come up with money for a new tire for the car, and the problems I had at work last night seem minor and unimportant. Noticing a definite perspective shift.   </p><p>9:40 - Well, right about now I'm wondering why I'm sitting here online when I could be outside in the sunshine.  I've decided to take a nice walk in the forest, and enjoy my day.</p><p>10:55 - It's a really beautiful day.  I just came back from a very rewarding circle meditation, and am contented and peaceful.  I stopped to watch a woodpecker for a while, and just know that he had stopped to watch me; for a moment, our minds were in the same place.  It was nice.</p><p>11:10 - I'm feeling very sleepy- not doped-up-wanna-get-to-bed tired, but pleasantly drowsy.  I know I'm going to sleep very well, which is surprising considering what a foul mood I was in just over 2 hours ago.</p><p>I would have to say that my first Kava experience has been pretty positive.  I don't think I'll find myself quaffing it regularly, but it has certainly found itself a place among my more respected herbs.  It's a great thing to have on hand when I need a gentle push in the right direction, and nothing more.  :)</p>"
}
