{
 "title": "Severe Panic Attack",
 "author": "Kaslen",
 "citation": "   Kaslen. \"Severe Panic Attack: experience with Cannabis & Divalproex (Depakote) (ID 24957)\". Erowid.org. Dec 6, 2004. erowid.org/exp/24957",
 "substance": "Cannabis & Divalproex (Depakote)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "oral",
   "Pharms - Divalproex",
   "(pill / tablet)",
   " ",
   "  joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 24957",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 6, 2004",
   "Views: 16086",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience scared me so much that I will never allow it to happen again. I am a manic/depressive (bi-polar) who has been off my medication now for 2 years. I have recently had a rough time contolling the ups and downs as I have over the last couple of years, so my doctor put me back on medication. That was just 2 days ago.</p><p>My doctor prescribed Depakote (750 mg's I believe). I took my last dose for the day at 10pm. I wasn't feeling odd. I had taken the medicine earlier in the day and I hadn't felt bad afterwards, so I really wasn't looking to feel bad this time either. Well, a half an hour later... my husband and I smoked 2 joints. After smoking even the first joint I was pretty high. The highest I had been in a few weeks, seeing as it was quite potent. Anyways, we went ahead and smoked the other and I was still feeling pretty good until we started smoking the roaches in the bowl.</p><p>I felt a gradual dizzy sensation. This didn't worry me too much. I've come to accept that feeling when we have quality cannabis. This feeling however continued to get worse. I began to feel my heart beating through my chest... and every second it began to increase in its pace. Then, my lungs semed to 'fail' me. I gasped for breath 3 times to try to force air into my lungs. I began to try to calm myself, to try to regulate my breathing and heart rate. It just continued to get worse.</p><p>I asked my husband if he would take my pulse, but he was too high to do so. I told him to call my mother immediately. She arrived minutes later. Found me cold... heart rate extremely excelled.. and pale in the face taking small gasps of air. I litterally thought I was going to die! To me it felt as though I were having a heart attack. I couldn't get the thought out of my head that I was dying... right now... right here... and at the age of 23. All of a sudden, things started to calm down. My breathing became more regulated, as did my heart rate. I took a deep breath and sighed thanking God that it was over. I spoke too soon.</p><p>It was only moments later that it all began to start all over again. The gasping for air... heart excelled... etc. I just KNEW my life was ending! My mother and husband helped me inside and sat me down on the couch as my husband was dialing 911. He descrbed all my symptoms and they were on the way. I wasn't sure though if they would arrive in time to save me. A few minutes later I heard the sirens and I began to panic more making the pain in my chest increase. While hearing them outside asking my husband preliminary questions I was shouting to them ' HELP,  I THINK I'M HAVING A HEART ATTACK !!!'</p><p>They rushed in, though it seemed they took too long for me at the time, and began taking my vitals. My heart rate was at 120 and was rising. My blood pressure was fairly low. My breathing was under distress also. I realise however that my vitals weren't so abnormal that it was life threatening.</p><p>I was still so extremely scared that I was dying. The lead paramedic told me I was going to be fine. That it wasn't a heart attack. It was a severe panic attack that I was experiencing. That gave me quite a bit of comfort in knowing that in all likelihood I wouldn't die, even though the chest pain and gasping for air persisted. After getting me calmed down a bit, they left me at home. I felt safer yet very weak from the ordeal. </p><p>I thought that the panic attacks were over... they continued until 3am. Even after they stopped I was scared to sleep. So afraid that I would stop breathing. My husband stayed awake all night to reassure me that I was breathing while I slept. I woke up every 10 to 15 minutes in a panic attack, thinking I had stopped breathing. I felt horrible the WHOLE following day, even now I still can feel some of the affects of that night. I'm trying hard not to think about how it felt that night, or I throw myself into a mild panic attack again. I hope this helps someone out there reading this. Never again will I mix even the most seemingly harmless medication while smoking cannabis, might not even smoke cannabis again anyways. I'm too shaken at this point to make that determination.</p>"
}
