{
 "title": "Extremely High Dose of Kavalactones",
 "author": "Am Duirmott",
 "citation": "   Am Duirmott. \"Extremely High Dose of Kavalactones: experience with Kava (extract) & Clonazepam (ID 24960)\". Erowid.org. Jan 12, 2007. erowid.org/exp/24960",
 "substance": "Kava (extract) & Clonazepam",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   "  T+ 0:00",
   "800 mg",
   "oral",
   "Kava",
   "(liquid)",
   "  T+ 0:30",
   "1200 mg",
   "oral",
   "Kava",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24960",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2007",
   "Views: 42680",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI take 6mg of clonazepam daily, so the 15mg dose I took this morning was kid's stuff.  I decided to purchase a bottle of kava extract (40% kavalactones, app. 2000mg kavalactones per bottle).  I tried 800mg kavalactones and, pleased with the mild anxiolytic, euphoric, and very strong muscle relaxant effects that were brought on after about 30 minutes, I decided to down the rest of the bottle.<br>T=0:10<br>Anxiolytic effects more pronounced; euphoria and muscle relaxation still moderately strong, but not changed since the 800mg kavalactone dose.<br>T=0:20<br>Feeling VERY sociable (a wonderful feeling for a social phobic such as myself); euphoria much stronger; muscle relaxation has practically turned my legs to jello.  No cognitive dulling of any sort.<br>T=0:30<br>Effects continuing from 10 minutes ago, though exponentially stronger.  I feel as if I could take on the world, if I could just make my muscles work properly, lol!<br>T=0:45<br>Just one thing to say--how can this stuff be legal???!!!!<br>T=1:00<br>Not much change from the 30 minute mark, aside from some pronounced OEV's, CEV's, and an almost LSD-like distortion in spacial perceptions.<br>T=5:00<br>The effects haven't subsided in the least in the past four hours, and I hope they never do!<br>~Anxiety level (1-10) -- 0; very disinhibited, in fact.<br>~Muscle relaxation (1-10) -- 10; and this is saying something, considering that not even Flexeril, Soma, Elavil, or Zanaflex have helped with my fibromyalgia.<br>~Pain relief (1-10) -- 10; I had a moderate headache before taking this, as well as the constant muscle-aches I deal with day to day.  All eradicated.<br>~Hypnotic effect (1-10) -- 1; I don't feel sleepy in the least. In fact, I feel mildly stimulated.<br>~Aphrodisiac effect (1-10) -- 10!!!  Jerking off was quite an experience, lol.<br>T=8:00<br>Still feeling the effects strongly, though the hallucinations have subsided just recently.  <br>T=12:00<br>Most effects subsided, except for moderate muscle relaxation, anxiolysis, and pain relief.<br>T=15:00<br>Back to baseline.\n\n\n"
}
