{
 "title": "How to Make Trumpet Tea Right",
 "author": "BA$E",
 "citation": "Citation:   BA$E. \"How to Make Trumpet Tea Right: experience with Brugmansia (ID 2496)\". Erowid.org. Oct 4, 2000. erowid.org/exp/2496",
 "substance": "Brugmansia",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "350 ml",
   "oral",
   "Brugmansia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2496",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 4, 2000",
   "Views: 40360",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI live in germany and know very much about brugmansia and other species of this flower. Its a very nice drug like lsd or harder hallucinating substances. You can eat the flowers or (better) make a tea. \r\nTo make a normal tea you need 2 big flowers and 1 liter water.  Kick the flowers into the water and boil it 100 celsius 3-5 minutes.  Press the flowers out like a citrous. Its not importent to press it out but its better. Take some suger into the cup you drank because it comes on faster. Dont drink more than 350ml; its not good. If you think you are a hard man and take 3 flowers/L or more or you drink too much I'll tell you a nice story from the 4T-man.\r\nIt was a little skater 45/kg. He take 3 flowers of 0.5L and drank it. After a 1/4h the tea was coming on (normal 2-3h) he was so fucking high and sprang from a 3.5m high bridge into a 0.2m deep water. After 2 friends take him of the water he fought with everyone. \r\nA week later after this little crash I talked with my 13 year old friend about his little experience.\r\nHe said he was 3 days not on this planet. He saw the hyperrealst halos. 3 days after I talked with him I opened the news paper it was a fucking monday I dont can forgot this fucking day because I read T.K. die suicide. I called his sister because I thougt it was not right. She whispered to me he wrote a letter it lie on his bed it said: I DONT WONT LIVE NO LONGER IN THIS UNREALITY LIFE.\r\nSo please dont forget 2 flowers 1 litre water. Drink not more than 350ml and wait 3 h for the booming optics and the hard halos. On a hard trip I saw elves and unreal people!!!\n\n\n"
}