{
 "title": "I Wish I Could Be Free",
 "author": "Anonymous",
 "citation": "   Anonymous. \"I Wish I Could Be Free: experience with Tobacco - Cigarettes (ID 24984)\". Erowid.org. Jul 3, 2006. erowid.org/exp/24984",
 "substance": "Tobacco - Cigarettes",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24984",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 3, 2006",
   "Views: 11586",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been smoking on and off now for the past 6 years, but deep inside I will always be a smoker. I honestly wish I had never started, but no matter how hard I try the cigarettes always pull me back.<br>It all started when I was 12 and I was offered a drag by one of my close friends. I coughed a little and my lungs didn't feel to special, but I went back for more. I did this because I was curious as to what was so good about it, why so many people did it, addiction was the furthest thing from my mind.<br>Over the years I have gone from smoking 2 or 3 cigs a day to a pack, sometimes more depending on my stress level, whether or not I'm going to a party, or where I am. Different situations prompt different levels of desire for a cig.<br>It has been an on and off battle for me, I have had some successes, but none really because I am back where I started and I'm smoking more than ever. I'm only 18 now and I'm scared that if I don't quit soon I could be up to 2 packs a day within the next 6 years.<br>2 packs a day and only 24 years old? God I hope not.<br>I wish I had never started, but now it seems so hard. I've been smoking for so long that it's hard for me to find a place where I don't have the urge to light up. I want to quit so badly, but I always end up back where I started.<br>I regret every cigarette I smoke, and every dollar I've wasted on them, but I continue to smoke and I continue to waste.\n\n\n"
}
