{
 "title": "I am One with the Goddess and He is My God",
 "author": "SierraMagick",
 "citation": "   SierraMagick. \"I am One with the Goddess and He is My God: experience with LSD (ID 24991)\". Erowid.org. Jul 12, 2003. erowid.org/exp/24991",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 24991",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2003",
   "Views: 9544",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nOk, I'll be describing two different absolute wonderful acid trips in this report...I'll try to keep in short and sweet--if I can  *LOL*<br>trip #1:  I just recently, about two months ago, went on my first acid trip....I had smoked pot occasionally, but that's about it until that first time.  My fiance and I recieve two hits from a friend, two tiny little purple squares that completely changed my life.  We each took them at about 1 in the morning.  At 3ish we began our long, glorious journey with constant, hilarious giggling...then about 4 the visuals started.....  I was afraid at first, but I immediately calmed myself not wanting to start the trip off bad.  After a few minutes we went outside onto the deck, and were feeling extremely randy so we attempted sex, which was hilarious, because about halfway through, I looked up at the sycamore tree growing in our back yard and it started to 'grow'...I immediately lost all interest in the task at hand...and actually sat there so long, that brent said that when we snapped out of it my skin was cold..... so that was the main theme of our trip...that big, beautiful, growing tree, that would start to be 'pulled' into the sky by the 'wind', while growing in spiraling vines, each leaf shimmying independantly.  <br>The best part of the trip was how it opened my eyes to the world around me...and I felt the goddess in everything, including myself, and I saw the god in my fiance, he WAS the god, and I WAS the goddess.... it was like playing make believe... I was, for the first time since childhood, filled with complete awe and wonder.... everything went well until my stomach started to feel kind of cramped so I went and got a bath... and the walls started to melt and it kind of freaked me out... being inside really got me down.... we spent the rest of the trip laying in bed, watching the ceiling, trying to go to sleep... he came down about 10 in the morning, but I wasn't back to relative normalcy until about 24 hour after I took the acid.....<br>Trip#2:  our second acid trip took place the night before last.... completely by surpise we came across someone selling acid, and along with a friend bought a few hits... we all took our hits at about 10:30pm, and the effects came on extremely quick, at about 11:30, I was steadily climbing into euphoria.  We watched the cartoon Spirited Away, and it was even more enjoyable that usual.  It was our friend's first time, and he was hilarious, pacing around speaking in a various accents (when he could force himself to speak) and puffing on a cigar.  This trip wasn't nearly as intense as the last, but that was good. it was easy to control, and alot mellower.  It was raining outside, but I went out and visited the tree anyways. it was beautiful, being pulled by the high winds of the storm..... my fiance and I had a serious god/goddess theme again this time, and it was very religious, and opened my eyes even further....  spent most of the night in the bedroom, which has been completely redone in natural decor so it was far more pleasant, and candle lit...  we painted each other with various religious symbols and laid around chilling out having a wonderful time.  <br>my fiance and I ended the trip with some very intense sex, and we both had our first orgasms while on acid, and it was fuckin awesome.... It was so intense, feeling the goddess and god in us... the sex was so primal, like a story, or like a part of a legend or something, I wouldn't have been suprised if I looked behind me at him and he had grown antlers. <br>Suprisingly enough we actually got tired at about 5 in the morning and fell asleep....I was sober enough by 5 o'clock to go in to work, so basically, it was different than the first one, but still excellent.<br>A note on Acid in general:<br>I highly recommend doing this with someone you love, I have never loved Brent as much as I do when I'm on acid...it's brought us closer together....  Also, it has made me do some serious soul searching,and has made me completely rethink religion....everyone needs to try it at least once!\n\n\n"
}
