{
 "title": "The Internal Glow Is Lit",
 "author": "Direwolf",
 "citation": "   Direwolf. \"The Internal Glow Is Lit: experience with Cannabis (ID 25085)\". Erowid.org. May 7, 2007. erowid.org/exp/25085",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25085",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 7, 2007",
   "Views: 3982",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nIt was an amazingly beautiful Saturday afternoon, the day in which I would be seeing the remaining members of The Grateful Dead. My girlfriend K was going to be tagging along with my mother and I. We arrived there and were greeted by the biggest sea of hippies I've ever seen. Only being in high school, I've never been to any other big Hippy Fests, even though I consider myself a hippy and so do many others. </p><p>We got in and found a nice plot of land to camp out at. K and I were going to be sitting very far away from my mom, which proved useful once the show began. I kicked off my sandals and waited for the festivities to begin. I've been using marijuana for the past year very frequently, sometimes a bit too much whenever I have a lot, but K had only tried it one time with me, but didn't experience anything. Other substances I've used are: nutmeg, alcohol, seroquel (a prescription drug that I found to be very sedative), ritalin, morning glory seeds, and a cigarette (yuck, never doing that again).</p><p>As Willie Nelson came on to open the show the occasional waft of reefer smoke would fly by, causing both K and I to look around to see where the pot was. My original intention was to come to the show and buy some LSD or magic mushrooms, but as it turned out I was happy not exploring my consciousness sooo dramatically. As more and more hippies flooded in the smell began to grow. One person, an older dread-head, was caught with some bud and a bowl and was taken out of the show. This would cause a little paranoia later on.</p><p>Just as the sun began to set I became friends with an older (I'd say 19, or so) hippy who I shall refer to as R. He was pretty smashed on alcohol and kept telling both K and I 'Welcome! Welcome to the dead, man!' If you've ever seen the movie Dazed and Confused, R bared an astonishing resemblance to the character Slaterson on that movie. All except the voice, that is. While the Dead were preparing to come onstage I began to wonder if R could hook me up with any reefer.</p><p>After the dead finished two of their songs I asked R if he had any weed. He told me he'd pass a joint around a little later, but it proved to be only one song away that I was handed a glass pipe full of some of the best bud I've ever tried. After only one hit my head began to feel as though it was being filled with something, possibly cotton, because every note the band played rattled inside my head causes a lovely buzzing sound. I was handed another pipe that was in the shape of a mushroom, again filled with some primo bud. And almost immediately following that I was handed a joint, while R put his arm on my shoulder and talked about my glasses. K was looking on in what seemed to be eager anticipation, but upon asking if she wanted some she said no.</p><p>Upon this point I wasn't paying attention to the show as I was paying attention to the amazing sunset that was changing all sorts of colors. This set the mood for the rest of the show. I started dancing like I've never danced before. It seemed as though the music was playing with my muscles and the only thing I could do was dance to the music. Suddenly, out of the corner of my bloodshot eye, I saw my mom approaching me. Just when I thought I was busted for getting high she told me that she was feeling cluster phobic and was going to wait by the rest rooms, away from the crowd. It seems my mom was getting a contact high :) She told me to not 'do anything' as she put it looking at the people around us lighting up.</p><p>Thank God that the smell of marijuana was as prominent as it was or my mom would have surely smelled it on my breath and hair. Deep inside, I feel my mom knows that I got high, but she acts like she doesn't. I think if she were to catch me now she'd be cool with it, even though she's all anti-drug. After she left I talked to another stoned amigo I met that night. We talked for a while and I returned to my dancing and smoking some bud that was handed to me.</p><p>They finished the first set, which proved to be pretty uneventful in the way of favorite songs of mine. From what I remember, and I was REALLY stoned, so my memory is a little off, they played Alabama Getaway, Sugar Magnolia, and (of course) a TON of jamming. During the intermission I went to look for my mom to tell her I was fine, but she wasn't anywhere to be found.  It took me hours to find my seat again (an exaggeration of course, but it seemed like hours). Each person I passed knew I was stoned, but I wasn't paranoid in the least because I knew I was with beautiful people who were stoned themselves.</p><p>I sat back down and K went to find some water. While she was gone I had the most amazing talk I've ever shared with another human being. R introduced me to two of his friend he had come with, P and M. Both P and M were very stoned and non-stop grinning from ear to ear. M and I talked about how meaningless time was and how much we love everybody that was there. We both started to shout 'Good-bye time' at one point in our talk. It was at this precise point that my high became spiritual.</p><p>I'm very spiritual when I'm not high. I follow different eastern beliefs, I'm a vegetarian, etc. I have come to many realizations because of my marijuana use, not saying that I rely on it as a thing, but I use it as a tool. However, the only major flaw I find is that I've never been able to become very spiritual under the influence. I've written poems, played music, and enjoyed my high in many ways but never have I had a true spiritual experience. Yes, I've found nature to be extremely beautiful and breath-taking while high but not like this.</p><p>It seemed as though I was boundless.  That everyone at the concert was the most amazing creature ever put into existence. Everyone there had the same interests as me, dressed just like me, were stoned just like me, and some of these people were even at Woodstock! Everything seemed to be radiating an internal glow that these people have found within themselves, and mine had finally been lit! I was truly flying on cloud 9.</p><p>Once K returned the band began their second set. Beginning with an amazing jam that they're well known for. At this point I was noticing the things I hadn't before. Like, how amazing the light shows were and the visuals they had. They had video screens that were playing amazing moving fractals, kaleidoscopes, melting images, and 3-D tunnels. My body's senses were really working overtime. Everyone around me seemed to be touching me, and it felt fantastic. Not actually touching, but their auras seemed to be touching me. However, upon actually being touched, I felt violated. And since I usually don't feel this way when I'm high I contribute this to the fact of how extremely vulnerable I felt. Because I was being opened up to all of these new feelings that I've never felt before, even on extremely large amounts of pot, and all of these new ideas. To me, this is how I thought the ego-loss you experience while on LSD and other psychedelics must feel like.</p><p>One more and final joint was handed to me, which only served to make me tired. I sat down for a while and just watched the people dance and the fractals move. I slide my hands up and down the grassy area where I sat; nature felt so good. They continued playing some of my all-time favorites including Ripple, which really moved me. The concert dwindled down until it was finally over. I bid my heavy hearted farewells to R, P, and M, all whom I had grown fond of that night.</p><p>On the ride home we listened to The Doors and I drifted off into a dreamy sleep, only to be awakened once it was time to drop K off. For me, that night was the single most amazing night of my life. Everything that I felt that day has left a great imprint in my mind and will probably never leave me. Words can never capture the beauty and awe of that night. Even though I tried to capture the feelings in here, it falls flat of exactly how amazing and overall live changing that night was.</p>"
}
