{
 "title": "Affordable Euphoria",
 "author": "Pocketwatch",
 "citation": "   Pocketwatch. \"Affordable Euphoria: experience with Kava (ID 25141)\". Erowid.org. Jan 12, 2007. erowid.org/exp/25141",
 "substance": "Kava",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "0.5 cups",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25141",
   "Male",
   " ",
   "Not Given",
   "Jan 12, 2007",
   "78724",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>2 weeks ago I ordered 8 oz's of kava kava root from a popular online vendor.  I was mostly interested in its purported anti-anxiety effects.</p><p>For consumption I decided to follow a simple recipe that shipped with the order. I placed 1/2 cup kava kava powder with 2 cups water and 1 cup milk along with 3 TBS olive oil, into a blender and proceeded to blend for the suggested 5 minutes. I didn't bother with a strainer I just poured the entire amount into a tall glass.   </p><p>I took the glass outside and stared at the brown murky substance.  I knew it had a reputation for being 'bitter', but I was in no way prepared for the reality once I took my first sip.  Its hard to express just how awful it tastes.  It seems simple enough to just chug it down.  But it is so disgustingly vile it took a great deal of sheer will power just to finish this large glass.  </p><p>After I successfully downed the foul liquid I felt a sense of accomplishment and at the same time wondered how am I ever going to drink this crap again.  I experienced the well documented initial numbing of the mouth. I decided to lay out on the grass and 'bask' in the sun.  Still not quite over the horrendous experience that was drinking the kava.  I quietly wondered if I would actually feel anything or if it would be a horribly tasting farce.</p><p>For the first 10-15 min I felt nothing out of the usual.  Normally I can only take about 15 min of 'basking' in mid day, due to preoccupation or boredom,  but after drinking the kava I was feeling no need to move and I continued to lay eyes closed with the sun beaming down on my face.</p><p>At around 25 - 30 min after consumption I noticed a slight tingle in the back of my neck.  I also felt some very pleasant sensation when pushing either arm against the ground.  I played around with manipulating this feeling. I found if I took in a deep breath and held it while I pushed very lightly with both my arms I could hold this incredible feeling for short periods. I would describe this feeling as a cross between an orgasm and the high produced by hydrocodone (vicodin).</p><p>While I was enjoying the onset of effects immensely it began to cloud over and I had been laying down for quite a while so I decided to get up and walk around a little. Its here I realized how 'high' I truly was.</p><p>The first thing I noticed when I walked around was an alcohol like visual tracer effect, where you turn your head somewhat sharply and it takes a few moments for things to get in sync. It was not unlike being slightly drunk. I also had a powerful 'vicodin' like buzz going on.  At this point I felt wonderful no queasiness and an extremely enjoyable euphoric sensation.  I was also very happy to know that I didn't just waste $27 dollars and it IS worth it to drink that pile of crap.  I must also comment that I had no idea it would affect me to this degree.  I read many reports where people claimed to feel nothing.  This was a powerful narcotic experience.  No two ways about it.  Its not a matter of just feeling relaxed and peaceful. I was extremely high and my ability to function was limited.</p><p>There was a downside however. A very noticeable queasiness set in after 3-4 hours.  </p><p>I couldn't believe how long I felt the effects.  I took the intial dosage at around 1 PM and when I went to bed nearly 12 hours later I was still slightly high but felt rather sick to my stomach. </p><p>I still have over half the package left and am experimenting with ways to make it slightly more bearable to drink as well as limit the nausea.</p><p>Kava kava can be very intoxicating highly euphoric and easily equals taking a few vicidon with alcohol.  It does have its down sides. To really get the effects you will have to drink a considerable amount of HORRENDOUS VOMIT INDUCING LIQUID.  And I have yet to get the extreme high without at least moderate nausea. But if you are willing to get past the horrible taste and nausea, you will be rewarded with a very intense and pleasurable high.  Oh and its legal.</p>"
}
