{
 "title": "Hanging the Lights",
 "author": "Benadryl",
 "citation": "   Benadryl. \"Hanging the Lights: experience with Diphenhydramine (ID 25154)\". Erowid.org. Mar 27, 2006. erowid.org/exp/25154",
 "substance": "Diphenhydramine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "25154",
   "Male",
   " ",
   "Not Given",
   "Mar 27, 2006",
   "15756",
   " "
  ]
 ],
 "report": "<p>It was like an ordinary weekend at my boarding school in a little boring town. Me and my other buddies always did some thing on weekends to take our minds of things. Our preferences were weed and alcohol, however, they were unavailable at that time. We were extremly bored and restless. Leter at around 9:30 pm, we checked off to the near by suprmarket to acquire some over the counter meds. Coricidin was known for good trips but it was all gone from last weeks raid by another friend. We later came upon this new medication we have never taken before called benadryl. We looked at what was in it. It sounded like it would be fun. so we carefully avoided the cameras and as quick as a flash the pills were in our pockets and out of reach of undercover security.</p><p>We got back to the dorms and went into 'Tupacs' room. we took out all the pills out and dived them into 5 parts. The count per head was 17 little piils. At first, when we started poping pills, we started taking 8, then 12, then up to 20. Plus we were all over 150 lbs, so we though we were good. To be extra safe, we ate a big meal, gulped some gatorade and a quick smoke. After that, the 17 pills went down.</p><p>We went down and watched some TV later and were not feeling nothing at all. so we went outside and bothers other people.  We were very disapointed. Times passed and was time to go in back to the dorms. we chilled at my room to play some xbox and talk about what chicks we wanted to fuck. Suddenly I was feeling a bit dizzy and little fake itches on some parts of my body. The other guys were feeling it too. I went to sit down on a bean bag. i looked up to the the upper wall and noticed outlines. I was freaked out. I stood up and went to the bathroom to freshen up, so I looked down to the baisn and noticed fuckin ants crwalling all over the place. I tried to wash them away but just would not go away. At this times we were all on a full blown trip. I turned around and took a piss and from the conner of my eye i herd a slight vice, I turned my head and ha and saw 3 guys just standing there talking, one of the was ME!! I closed my eyes and loked again......gone. </p><p>Flash backs and head noises were just the start of this nightmare. I went back to my room, but no one was there. I sat down and just stared at the computer screen moving up and down, side to side. Like a zombie sorta. I tried throwing up, but no success. I was now seeing a dungeon instead of my dorm room. There was cobwebs on the corners which blured when I touched them. there was a snake coming out of my coke can, and my computer turned into a wierd color static. I was scared but i could not tell the dorm perants and risk expolsion. I dind not see my 3 buds again that night. my vision was almost in another dimension. The physical feeling was completly disconected and i felt like i was made out some kind of paper material. I felt like shit. I went to bed and tried to sleep. After an hour of convoltions and schizo behavior, I knew I would be like this forever. I wept my self to sleep.</p><p>I woke up the next morning like any other morning exept with a bit of hunger. I stood up and looked around. my room mate woke up and looked at me wierd. I went to the kitchen and ate. later I sw my 3 buds. We were totaly fine and prety energetic. we just looked at each other and laughed hard. FUCKED UP NIGHT!!</p><p>Never agin we will try that shit again, the memory still remains. Weed and alcohol only, period.</p>"
}
