{
 "title": "Subtle Yet Profound",
 "author": "AGB",
 "citation": "   AGB. \"Subtle Yet Profound: experience with Magnetic Brain Stimulation (ID 25150)\". Erowid.org. Jul 10, 2003. erowid.org/exp/25150",
 "substance": "Magnetic Brain Stimulation",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2003",
   "ID: 25150",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 10, 2003",
   "Views: 18193",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>DOSAGE:</p><p>60 minutes of bilateral cranial magnetic stimulation, with alternating burst patterns in the 5-10 mG range to the left amygdala and the 2-4 mG range to the right hippocampus. This is the 'traditional' pattern which was used in the original beta testing.</p><p>SET AND SETTING:</p><p>Cabin, upstate New York, surrounded by 20 acres of private forest and 250 acres of forest preserve, near Woodstock festival site. Smoked a lot yesterday, was feeling very stretched out and hollow when I woke up this morning, better now but still sluggish.  On my own, in a journeying frame of mind.</p><p>JOURNAL:</p><p>2:12 - start session</p><p>2:24 - definite physical sensations around brainstem. Not pleasant or unpleasant, just shifting energies. thought process has positive bent. Effects subtle so far.</p><p>2:39 - positive sensations - peace, sense of integration - in my body, particularly the left side. Have been following breath and thoughts, observing. Thoughts generally in spiritual direction - how to experience own and general buddhahood. Feeling energized and clear-headed. </p><p>2:48 - peace, openness. Doing Tonglen practice (Buddhist meditation of breathing in suffering, transmuting it in the heart and breathing out love)</p><p>3:00 - feeling awareness sink down into ground of being. Still subtle. Quieter inside.</p><p>3.12 - finish, remove headset. Feel peace, calm</p><p>3:28 - very spacious, very still. Feel time stretching, feeling the eternity of the now. Sat by the pond and watched pond skaters, turtle, frogs, bugs. Still in sense of happy, relaxed calmness. Going to go for a run and a swim.</p><p>3:43 - been pottering around. Leaving for the run now. Not very focused, but was not focused when I started at all. Hungry, but again that is not necessarily related to the session.</p><p>4:17 - the experience continues to be both subtle and profound. Equanimity.  Driving through the trees and the green is so beautiful. Back at the cabin because I did not bring the $3 with me that I need to enter the state park where the lake is, really feeling no frustration with the need to come back, feeling equanimity and peace. Have been having deep mystical experiences with Himalayan hash recently, this is very different. The hash ecstasy has me singing out loud with joy when I listen to mystic hymns,  whereas this is more internal, feels deeper, the joy is within me, not bursting on the surface but bubbling deep beneath an enigmatic smile. I feel the joy and smile rise from within me as I type.</p><p>7:41 - the immediate effect has worn off, although it feels as though there has been a subtle shifting of my baseline. I feel a slight melancholy edge to my thoughts. I am now going to add a small amount of THC (malana cream, the chateau d'yquem of sticky black hash) to lift the evening vibe</p><p>8:15 - prayed sunset prayer, then sat on the dock in the middle of the pond and smoked a bowl. Killed about 7 mosquitoes while praying, calmly waiting for them to start sucking my blood before striking, finally watched the last one drink and waited for it to finish and then be blown away by the wind of my breath. Now high, listening to drums and intense sufi chant, building the fire, thinking megalomaniac thoughts, and trying to pull myself out of writing the trip report for long enough to actually - ok bye</p><p>9:12 - reading franz bardon by the fire. Practicing. Time to cook.</p><p>9:29 - sweet potatoes stuffed with garlic and butter, rubbed with salt and olive oil, in the fire.</p><p>9:41 - sirloin steak basted with butter, goats cheese and wild blueberry preserve.</p><p>10:15 - YUM!</p><p>12:38 am 2 days later - the Persinger/Shakti experience was both subtler and in a way more profound than I expected - much more like meditation than like taking a drug, more even like having stabilizers on while meditating. Look forward to further experimentation, and to trying the newer waveforms.</p>"
}
