{
 "title": "Primitive/Modern Split",
 "author": "FlowGnome",
 "citation": "   FlowGnome. \"Primitive/Modern Split: experience with Salvia divinorum (10x extract) (ID 25153)\". Erowid.org. Sep 4, 2003. erowid.org/exp/25153",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "25153",
   "Male",
   " ",
   "Not Given",
   "Sep 4, 2003",
   "7219",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Trip #1: </p><p>The first time I tried Salvia was pretty random.  We had stopped by a head shop in some small town to pick up some nitrous.  My friend and I were getting bored with the comedown from some strange rolls we had bought the night before and were looking for something short-lasting to kill time while it wore off and we could finally sleep.  The shop didn't have nitrous, but we decided that the 10x Salvia they sold would do.  We hopped in the car and started packing a bowl, and thus it began.  </p><p>I took the pipe first, and found it very hard to hit.  The salvia burned hot, and tasted rather strange, but I managed to get a couple of small hits in.  A small body buzz was noticed, and some general weirdness that I couldn't identify, but I knew this wasn't the full effect.  </p><p>I took the pipe again and took 2 hits, this time trying to inhale past the coughing point.  It worked.  Within a few seconds my body was experiencing a very interesting feeling, almost like the sensation one gets when laying down in rough grass, but this was moving slowly up and down.  It intensified and developed into a complete split, down the center of my body. </p><p>My left side was flying free, outside the car, through a beautiful green forest.  There was a breeze on my skin and my vision was filled with plants and animals.  My right side was melded into the car, feeling the tires on the road and watching miles of pavement stretching ahead.  These two contradicting viewpoints lasted for around 2 minutes, when I suddenly returned to semi-normality with people trying to talk to me.  </p><p>This trip had been different from my experiences with other substances at the time, in that there was no internal dialogue, in fact no thought that I remember, just the experience of being two things at once.  Very odd and somewhat interesting, but I had no specific desire to repeat it until later. </p><p>Trip #2: </p><p>I was sitting around watching a movie one day a few months later when I had the sudden urge to smoke again.  I brought out the salvia and went for it. </p><p>This time, I took big hits right away, and spaced out almost instantly.  It was as though someone had thrown a bunch of leaf shaped fractals into my field of vision, with impossibly moving edges defining some sort of general pattern.  These fractals slowly became less and less complicated over the next few minutes, and finally all that was left were the edges, which slowly morphed back into the shapes of the edges of the objects in the room.  Again, there was no clear thought during this experience, just a sort of sense of awe at watching the world completely deconstruct and resolve itself so quickly.  Again, I had no desire to repeat this, and gave the rest of the salvia away a month or so later.</p><p>I write these reports now, because I suddenly had a strange urge to smoke salvia yesterday.  I don't know what brought it on really, but it is the same urge that I felt on the second trip, which I clearly remember. It is different than my usual desires to trip that pop up every once in  a while, in that it seems more urgent.</p>"
}
