{
 "title": "Persistent Visuals 2 Months Later",
 "author": "Mistergod",
 "citation": "Citation:   Mistergod. \"Persistent Visuals 2 Months Later: experience with DXM (ID 2517)\". Erowid.org. Mar 1, 2001. erowid.org/exp/2517",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2517",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 1, 2001",
   "Views: 10372",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI've taken many hallucinogens in the past and have always caught crazy visuals.  I've eaten a lot of acid at high doses in the past.  I tried DXM for the hell of it since those cold pills always gave me decent buzz whenever I was sick.  I got my hands of an oz of powered DXM for a really cheap price.  I started with 100mgs and waited a few hours and smoked some herb.  I started catching very slight visuals.  A couple days later I took 200mg and did the same and caught nicer visuals.  I kept increasing every five days or so by 100mgs.  I got up to taking 600mgs and that stuff put me on my ass without doing any other drugs.  I was so out of touch with reality and I forgot where I was.  \r\nAfter a couple weeks of taking a break from it I introduced a friend to it.  We each took 1200mgs.  Don't ask why we took so much.  Within an hour we were blinded by all the visuals.  We smoked some herb and after that I can't remember a damn thing.  Ever since that night whenever I take any amount of DXM over 120mgs I start seeing visuals and they don't subside for about 3 days.  If this happens to anyone else please let me know.  I don't even feel a buzz from such a low dose anymore, but I see the craziest things.  Ever since taking large amounts of DXM I have been stuck with what seems like permanent visuals.  If I go outside at night and look into the semi-pitch black darkness my vision soon gets distorted and I start catching major trails followed by lots of crazy visuals.  I was just wondering if this is normal.  BTW I've been sober for over 2 months and I'm still catching these visuals that I believe were caused by DXM.\n\n\n"
}