{
 "title": "Brownie Experiment",
 "author": "Kuhlxcrunr",
 "citation": "   Kuhlxcrunr. \"Brownie Experiment: experience with Cannabis & Valium (ID 25235)\". Erowid.org. Jan 7, 2007. erowid.org/exp/25235",
 "substance": "Cannabis & Valium",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25235",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 7, 2007",
   "Views: 12880",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>﻿MJ Brownie Experiment</p><p>What are the effects of eating pot?</p><p>Start Time is 9:15 p.m.  (7/12/03)</p><p>Control:</p><p>I weigh ~135 Pounds (60.25 kg)</p><p>No THC in my system for at least a year!</p><p>No drugs in my system in the last week (caffeine, DXM, aspirin, etc.)</p><p>I have a completely empty stomach!  I ate last at 2:30 p.m. this afternoon.</p><p>I will list my feelings every fifteen minutes until I really feel heavy effects (if I</p><p>do)</p><p>I know the diazepam is against the rules to control this experiment, but this is for</p><p>my own good and I can distinguish the different effect of the two drugs/highs</p><p>My recipe for an identical experiment is as follows</p><p>Stuff you need:</p><p>\t1 ounce of unsweetened chocolate, roughly chopped</p><p>\t4 Tablespoons (1/2 stick) butter, softened </p><p>\t½ Cup sugar</p><p>\t1 egg</p><p>\t¼ Cup all-purpose flour</p><p>\t½ Teaspoon of vanilla extract (for taste)</p><p>\tAround ½ oz of herb, depending on the strength you want</p><p>        your brownies.</p><p>Process:</p><p>1.)  Preheat oven to 350 degrees.  Grease a   cupcake pan</p><p>     that makes 4-6 cupcakes (depending on how large you</p><p>     want the brownie.</p><p>2.)  Combine the herb and butter in a small saucepan over</p><p>low heat, stirring frequently.  When the butter and bud have heated up for awhile (just a few minutes) add your</p><p>chocolate and let that melt and continue stirring.  After</p><p>everything is blended remove the mixture from the heat.</p><p>3.)  Transfer the mixture to a bowl and stir in the sugar. </p><p>Than beat in the egg.  Gently stir in the flour, salt, and</p><p>vanilla.  Pour and scrape the mixture into the cupcake</p><p>pan about 2/3 full on each one.  Put the brownies in the</p><p>oven for 20-25 minutes and check periodically to see if</p><p>the middle of the brownies is set with a toothpick.  Let</p><p>them cool on a rack, outside, in the refrigerator, etc. </p><p>They stay good a few days and make about 4 brownies.</p><p>4.)  The brownies will take about 30 minutes to kick in on an empty stomach.  Eat one every 30 minutes and you should be out for the night within 3 hours!</p><p>NOTE:  The smell of bud shouldn't flow out of the oven, but it smells pretty bad in the oven, but not anything you'd expect from pot.  I actually though I got a contact buzz while cooking it, but really it turned into a headache.  (not pleasant)</p><p>9:15 p.m. -  I ate one Brownie Cake that contain ~1/9 oz of commercial bud.</p><p>9:30 - I took 10 mg of Diazepam to control my anxiety while stoned.  (I seem to have a problem with paranoia)  Also, my parents are up stairs, so in case I get super baked I wont get scared! Believe it or not, I actually feel a buzz coming on from the magic brownie!  It is nothing like the coming up while smoking, it seem to affect how my body feels (in a good way!).</p><p>9:45 - Nothing much different, It seems that I am totally normal around my parents because Im not flying to the peak as you do while smoking.  This is a real benefit to a person in a social setting, but I still dont know for</p><p>sure how high I will reach tonight.</p><p>10:00 - Still not much has changed; I think I feel different (you get the point).  I am eating another brownie that contains ~1/9 an oz of bud.  I also consumed another 5 mg Valium pill.</p><p>10:15 - Im starting to feel like Im moving up fast, my first brownie must be kicking in. I feel baked already, I cant believe that it hit me so hard in just 15 minutes between 10:00 and 10:15.  I noticed that there is a weird body high that I dont normally experience while smoking.  I feel heavy and feel stuck to my chair I dont even want to move right now.  Walking feels weird, kind of like the Robo walk from a DXM trip.  I feel mentally clear, and this doesnt happen by smoking either!  I am excited of what is next!</p><p>10:30 -\tI am toasted right know I had to lead my friend through the process to log on the internet, and I didnt ever care that I was baked (I believe this is mainly the diazepam that eliminated my paranoia.)  I feel like I am stoned in a more calm way, so you can easily control your self in situations that normal smoking would leave you unprepared.  My mind is a little cloudier and find myself getting off task easily, and looking around a lot.  Typing is harder now, it seems that when if I think about what I am trying to write than it seems harder, so I just let my thoughts flow.</p><p>Nothing below is proof read for errors to show my intoxication level.</p><p>10:45 -\tThe normal Marijuana smoking effects are beginning to show up.  These include the munchies, and cotton mouth.  A real intoxicating body high is present.  I feel like I am pulling my legs along, that is similar to being drunk.  I think the THC and Valium are a synergistic mixture.  I feel so relaxed, and kind of like passing out.  I used the delete key about 50 times during this paragraph, and I skipped a lot of words that belong in the sentence in the way I thought it out.  It is now 10:50 after I completed this journal entry.</p><p>11:00 -\tI am blown out of my mind, I feel all the normal effects with smoking herb, but with eating it acting normal is hard, you just need to go with the flow!  I feel baked, but I still have half stash to eat, so I hope it is cool.  I forgot to mention that trip properties of bud are now beginning to show, I am too fucked up to go in front of my parents without any trouble.</p><p>11:15 -\tI am stuck in the chair in front of my computer.  I tried to get up, but I felt like my but was glued down to it.  I walked around and my vision is blurry like the beginning of a 2nd plateau DXM trip, but I fell like I am swaying around.  A lot of the movements I make seem to be done without thinking they flow together.  Typing is easy if you dont have to think about what you are writing, or I always screw up my wording.</p><p>11:18 -\tI feel like passing out for awhile.  Totally blown, not like the time I smoked ¼ oz last year.  (It took me over 6 minutes to right this sentence!)</p><p>12:00 - Im having closed eye visuals, ones that you dont get from</p><p>smoking, I really enjoy eating the buds more because of the high, and I hate the feeling in your mouth while you smoke.</p><p>Sunday 9:00 a.m.</p><p>I still feel different; I have the same feeling of when I began to feel the brownies last night.  I remembered that while I was sleeping I felt a buzzing sensation throughout my entire body.  My vision was buzzing/blinking slightly also.  It was a slight trip while I was laying on my bed, nothing intense enough to scare anyone, but I never finished the entire ½ oz, only a ¼.  I saved the rest for my DXM trip tonight.  I kind of regret taking too much diazepam because I passed out before the peak of the experience, but even before my peak the experience was very intense and nothing like smoking pot! I feel like moving around a lot when I smoke pot, but while eating it I just want to chill in one spot and not do anything!</p><p>11:30 -\tI feel like I have a little hangover, or maybe because I need to eat.  It was from the 15 mg of Valium I should have stayed with five or ten.  (I only weigh 135)  I was actually planning on doing 600 mg of DXM tonight, but I might not be able to if this headache lasts all day.  Just smelling my last two brownies makes me want to puke!</p>"
}
