{
 "title": "In Excess",
 "author": "Downer",
 "citation": "   Downer. \"In Excess: experience with Alcohol - Hard (ID 25287)\". Erowid.org. Mar 12, 2007. erowid.org/exp/25287",
 "substance": "Alcohol - Hard",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25287",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 12, 2007",
   "Views: 6361",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first encounter with drunkenness was a little over seven months ago. Before then I had tried various alcoholic beverages but, due to lack in supply and no particular interest in doing so, I never got drunk. That had changed one night, however, when I was at a friends house. We decided, since I was moving away, that we should have some fun while I was still around (we did pick an awful time to do due to the fact that I was supposed to leave that night).\r\nAnyway, we went downstairs to her parent liquor cabinet and took an unopened bottle of Absolut vodka. When we got back upstairs we mixed up half a glass of vodka with half a glass of orange juice. I remember the taste being a bit strong but I had no problem drinking it. After we drank out first glass we each had another. And then, shot after shot after shot. I don't remember exactly how many. I do, however, remember that as time went by the strong alcohol taste became dulled. I believe that we drank between half and three quarters of the bottle.\r\nSo afterward I just lay on the floor, feeling like a heap of something, holding a shot glass (I had to sip it now because the taste had become too strong now) and watching Invader Zim. I distinctly remember that the main thought I had at the time was how much my head hurt. Like a constant headache. I also remember wanting to have sex. Then, her mom called us down for dinner. We had some kind of sausage but I couldn't eat it. I felt like I was going to throw up. Her mom was talking to me and I was talking back. It was as if I was locked inside my head lookin through crystallized glass and my body had taken over functioning for me so that I would look normal. I don't remember a word that she or I had said. Later, they had to take me home. Both of us were still considerably drunk. We got into the car and right after we pulled out of the drive way she vomited all over herself. \r\nHer dad dropped her back at the house. I got into the front seat and settled myself in a familiar heap. Once again there was a conversation that I was no part of. Soon after I vomited al over myself as well. I spent the rest of the night kneeling by their toilet. She had passed out on her bed. \r\nObviously, this wasnt a very good experience for me. I would also like to say that up until now I havent been able to drink alcohol because the taste seemed stronger to me than it did then. When ever I try to drink I cant stand the taste. This can be easily remedied though by gradually increasing the amount of alcohol in juice or soda.\n\n\n"
}
