{
 "title": "A Worthless Waste of Time",
 "author": "Shane",
 "citation": "   Shane. \"A Worthless Waste of Time: experience with Nutmeg (ID 25284)\". Erowid.org. May 22, 2007. erowid.org/exp/25284",
 "substance": "Nutmeg",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25284",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 22, 2007",
   "Views: 3477",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my account of ingesting a good deal of Nutmeg and having nothing (yes, nothing) extraordinary happen.</p><p>------------------</p><p>Tuesday, July 15, 2003</p><p>12:44am - I took a fuckload of Nutmeg, what I would guess was about 15 grams or so, and threw it in a smoothie I made out of Ice Cream and Milk. The texture of it completely faded. I ate most of it, but there was a lot of nutmeg goop stuck on the sides and bottom which I didn't finish. For that reason, I have no idea how much nutmeg I actually took.</p><p>1:13am - I just got out of the shower and I begin to prepare for a long night waiting for the first sign of effects to kick in. Nothing yet. Not even the slightest hint of nausea; however, I did just have my frist nutmeg burp. I'll report back in an hour or sooner.</p><p>1:45am - I laid down to read, and over time I began to feel slight senations in my stomach that lean towards unpleasantness. It's nothing unbearable... yet. I'll go back to reading for now.</p><p>2:11am - I'm starting to think that the stomach 'sensation' I was feeling earlier was my imagination, as it's all but gone now. It may not be though. Who knows. This will most definitely be the first time I ingest a drug and have to wait more than two hours for even it's initial effects to take hold.</p><p>2:42am - Still nothing. I'm going to look up some Nutmeg trip reports and see what majority of them waited this long for the slightest sign of the drug.</p><p>2:56am - I've been reading some reports, and I'm pretty sure this is more than normal. Actually, I knew it was when I ingested. It's just that the first time I used Nutmeg nothing happened. I chock it up to not taking enough, but this isn't fresh nutmeg. It's pretty old and was in my kitchen for a long time before I decided to use it. I don't know if that has anything to do with the trip. I think I'm just getting anxious. I guess it's understandable when you have to wait up to 4 to 5 hours for the effects of a supposedly really intense hallucinogen. Also, based on the color of my poo, I would guess the Nutmeg is doing what it's supposed to in my body. I may scoff at this tommorow, but I think the worst side effect Nutmeg causes is severe anxiousness while waiting for the effects to kick in.</p><p>3:22am - Weird, my pupils seem to be constricting rather than opening up. Still, no 'real' effects yet. I won't update anymore until or if I notice anything 'real.'</p><p>5:44am - I sat down to watch a movie and some pretty bad nausea started to overwhelm me, so I just layed down and sat still. It's passed now, for the most part. It's been a solid 5 hours since ingestion and not one single positive effect. Even the negative effects weren't supernatural as the horror stories say. I bet if I ate 15 grams of any spice I would trip this hard. Fuck this.</p><p>---------</p><p>This was the second time in which I've done nutmeg yielding nothing worthwhile or by any means 'psycehdelic.' I understand many people have tripped on Nutmeg, but for some reason or another it does not work for me. Lately I've been curious to know if anyone else has experienced anything like this.</p><p>It seems that I'm on a streak for this kind of thing. A few months back I tried Dramamine (Dimenhydrinate) twice, both times yielding no results. All the drug did was make me immensely tired. Nutmeg is the second drug that seems to not affect me. I have successfully used mushrooms, dxm, and the datura seedpods, so I do HAVE the ability to trip. heh.</p>"
}
