{
 "title": "Deep Powerful Tripping",
 "author": "Awakened",
 "citation": "   Awakened. \"Deep Powerful Tripping: experience with DPT (ID 25308)\". Erowid.org. Jul 16, 2003. erowid.org/exp/25308",
 "substance": "DPT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25308",
   "Male",
   " ",
   "Not Given",
   "Jul 16, 2003",
   "Views: 8738",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been investigating DPT in the past couple weeks and I must say that I kinda like it. </p><p>The second time I tried it I had a VERY powerful experience. I had taken a supplement of 100mg 5-htp for the first time about T-8 hrs, I didn't think about it until I was coming down, but I think this may have intensified the trip, which was not my intent, but a nice benefit if its true. My friend and I made our way to a secluded spot in a this wildreness park. The spot was cool, totally covered by trees, there were tons of branches intertwined in a dome shape, and a log for sitting on. You could tell other people went there to 'do drugs' by the drawings & writing on the log. My friend and I both took 50mg into each nostril (100mg total) and killed the taste of the drip by sharing a can of soda. I had eaten a sandwich about 4 hours prior. We talked and smoked a bowl as we were coming up. At first I just noticed the usual tryptamine alerts for me, a high pitched tone, feeling of excitement, and sweaty palms. I remember then seeing geometric patterns on the leaves and twigs on the ground, fractals everywhere, slowly rotating. The bark on the trees would appear to be moving up and down. Then I closed my eyes and got lost in a wave of visuals, they were totally stunning, colors and swirling shapes everywhere, very clear, sharp, very colorful. It is hard to tell how much time had gone by as we had no clock. At this point as it began to get really intense, I got nauseous. I felt my stomach tightening up, and then proceeded to empty it's contents, which luckly was most liquid. But right as I felt better after puking, I got got this huge head rush (probably from the dpt flushing though my sinuses once again) and then I was just totally tripping hard, harder than I have in a long time. I had my eyes closed most of the time and I could hear all the sounds of the place we were at, the birds chirping, insects buzzing, small children speaking spanish on distant hiking trail. It was total music to my ears, It was the song of the place and time where we were, and was totally unique. I felt myself sinking and saw many things, I felt like I was really getting in touch with the earth and nature. At one point I heard a bee flying around us and I opened my eyes and saw it land on our empty soda can. At first I was sort of afraid, as I've never been stung by a bee and my father is allergic, but I quickly realized that I was only scared because I was tripping, any other time I would have paid it no mind. I had the thoughts 'this bee is no trouble, fuck this bee, I AM this bee' At that point I felt as if I had totally taken on the thoughts and body of a bee, my only thoughts being about where I was flying, following my nose to what I was looking for, following my eyes to bright colors, obeying the queen. That was only for a brief moment, but it was one of the coolest things. I honestly felt like I was a bee flying around a can & 2 tripping people. After that I felt like myself (as much as can be) again, although I still felt I could telepathically communicate with the insects as I tried to will the bee to leave and it did, also a mosquito landed on me but I asked in my head not to bite me and I found no bite on my arm later that day. Its funny when you look back on it all. I also sorted out a problem I was having in my life, by looking into myself and realizing how I really felt about a certain person. After we had both pretty much comedown, some raver kids came to the spot and we matched bowls, which brought back some of the effects. Shortly after that, my friend and I returned to our homes. We were only at the spot for about 2 1/2 hours, but it felt like longer (doesn't it always?)</p><p>A very powerful chemical to be sure, and in my opinon, an enjoyable one. I look forward to more experiments.</p>"
}
