{
 "title": "Depression and Dumpsters",
 "author": "Little Floyd",
 "citation": "   Little Floyd. \"Depression and Dumpsters: experience with Oxycodone (ID 25312)\". Erowid.org. Jul 29, 2006. erowid.org/exp/25312",
 "substance": "Oxycodone",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Acetaminophen",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25312",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jul 29, 2006",
   "Views: 15106",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'd like to explain that I have only ever smoked pot and drank on occasion prior to these experiences. I also suffer from bouts of horrible depression. </p><p>The first experience I had with this drug was with a bottle of pills I found in the cupboard one Friday night labeled Oxycocet. My first impression was to believe they were Tylenol 3's because of the warning that they would cause drowsiness and were used every 2-4 hours for pain. I promptly took four of the little white tablets inside labeled TEC; at this point I didn't care about what the dose was; I figured the pills I was taking would either kill me or make me too numb to feel anything for at least a couple of hours. Even then I think I understood how dangerous and reckless narcotics were when taken to ease depression, however at this point I simply didn't care. </p><p>I then sat down to watch TV and after about thirty minutes I started to feel lightheaded and understood less and less. Lights were distorted, seeming brighter than they should and shadows were horribly dark; the lack of middle ground those who suffer from migraines would understand. My mum was trying to get me to try different things she had learned from yoga and normally I excel at these poses, having been a gymnast for years and years. However, I had no balance and hardly any concentration. </p><p>It was about this point that I began to feel nauseous. My stomach felt horribly upset, yet it also felt acidic, like a bad hangover mixed with terrible heartburn. The only way I could avoid this feeling was to be laying completely still on my bed, starring at the ceiling. The moment I moved, I was certain that I would vomit. During this time, I felt next to nothing, aside from deep, dark apathy; I simply didn't care about anything. My body was heavy and the effort it took to lift a limb was unbearable. Finally, the drug wore into a very, very deep sleep. </p><p>I've taken the same drug on the same dosage on other nights, once mixed with alcohol, once at school and several other times when I simply gave up on dealing with the world. I found that I would almost be asleep for a few moments; space out for what seems like an eternity to look at a clock and realize it was only a few minutes.</p>"
}
