{
 "title": "A Strange Calm",
 "author": "FlowGnome",
 "citation": "   FlowGnome. \"A Strange Calm: experience with Morning Glory (ID 25327)\". Erowid.org. Sep 4, 2003. erowid.org/exp/25327",
 "substance": "Morning Glory",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "  seeds",
   "oral",
   "Morning Glory",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 25327",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 4, 2003",
   "Views: 12589",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA long time ago, when my only drug experiences had been a MDMA pill and a +1 LSD + MDMA trip, I was very eager to try some morning glory seeds.  Although the reports on the internet didn't seem very optimistic, I've always been one to try everything once, so I bought 2 packages of heavenly blue seeds (uncoated).  The following morning glory trip, which I still remember very well, was to be my last trip for almost a year that wasn't filled with feelings of self-doubt / paranoia as a result of the bad situations I would be put in on my next couple of drug experiences.  In any case, here's the report: \r\n[Summer 2000]: \r\nThe seeds (6 grams) were prepared by mixing with 2 cups of water and placing in a blender on high speed for about 5 minutes.  They were allowed to soak for 10 minutes or so, blended for a few more minutes, then strained and squeezed out in a paper towel.  The resulting liquid was consumed straight.  The flavor was strange, but not altogether unpleasant... sort of earthy. \r\nIn about 30 minutes, I started to get some mild stomach cramps and nausea, which had mostly subsided and been replaced by leg cramps at the 1 hour point.  I was laying on the couch waiting for this phase to pass and watching the very minor visual distortions when my roommate (we'll call him Q) and his girlfriend showed up on his lunch break.  I told them what I was on, and Q asked me if I wanted a ride back to where he worked so I could wander around outside for a while.  I agreed, as I felt a need to get out of the house.  \r\nThe ride didn't take long, and when I arrived I found that Q's place of work was directly across from a rather large and old graveyard... the perfect place to explore.  I spent some time wandering around, and began to notice a very strange calm sweep over me... not a euphoria, or even a relaxation as one would experience from a normal sedative.  This was a feeling of absolute silence, like the rest of the world had suddenly stopped moving and I was alone.  Was this how death would feel?\r\nI remembered this same feeling when I was young, and playing at the Dunes State Park.  There were certain places that I could go, mere feet from the edges of the public park, where it would seem as though no sound could penetrate.  Likewise, I remembered why I used to spend so much time in the woods when I was younger. I decided to lay down for a while, and found a nice place among the trees near the edge of the yard to rest.  I spent some time watching the clouds move.  I had some very minor visuals, and was disappointed  at the time because I had not really 'seen' much yet.  Later I would realize that you can see a bit too much if you're not careful, but that's a different story.  \r\nMeanwhile, someone had started to mow the graveyard so I felt it was time to find something else to entertain me since my silence had been killed.  I didn't especially want to be mowed, either, so it was off down the road.  I didn't know where I was going; I never do when I walk really.  I just pick a direction and walk as far as I can, then turn a different way and attempt to find my way back.  Its a fun way to explore the town, and how many of my aimless walks end up.  Always a good way to think.  \r\nI probably ended up walking about 2 miles or so, admiring the intricacies of nature and technology, and how they seemed to be slapped together so haphazardly.  It was mostly an uneventful walk, and by the time I was back to Q's place of employment, the effects were starting to wear off.  We went and got some burgers at dinner, and the visual and mental effects slowly tapered off, leaving me fairly tired.  I believe I went to take a nap around 6:00pm, and woke up for my wonderful midnight shift job at around 11:30pm, feeling refreshed and sober.  \r\n[Notes from the present]:  I'm not sure why I remembered this trip today, suddenly.  There was something special about some of my early trips, even the weak ones, that I had mistakenly attempted to capture later by consuming heroic doses and weird combinations.  Sure, some of the heroic doses led to things far more interesting and mind blowing, but I think there is still something to be said for the +1 trip, where smaller things than the eternal secrets of life can be appreciated.\n\n\n"
}
