{
 "title": "Wasn't Really Positive or Negative",
 "author": "soma psycosis",
 "citation": "   soma psycosis. \"Wasn't Really Positive or Negative: experience with Mirtazapine (Remeron) (ID 25355)\". Erowid.org. Aug 12, 2005. erowid.org/exp/25355",
 "substance": "Mirtazapine (Remeron)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "25355",
   "Male",
   " ",
   "Not Given",
   "Aug 12, 2005",
   "14495",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took Remeron for depression (5-30 mgs) for about two months, and found it to be a really strange drug. From a dosage of 10 mgs and up I noticed effects, which included changes in sleep patterns, increased sensitivity to stimulants, and mild hallucinations after dosing. I will go into these in detail in this report. I took the drug once a day before bed.</p><p>About an hour after dosing I would begin to notice strange patterns when I was in an area of low light. Sort of like red and green static superimposed over everything I looked at. I have been off this drug for almost a year and these have not entirely gone away. </p><p>I would also feel really unreal and drowsy but not really tired, kind of like a large dose of vicodin but more anxious. These effects continued for up to a day after taking the drug. It always put me to sleep within half an hour of going to bed, which was nice because I am an insomniac, but I would have unsettling side effects right before. I would be lying with my eyes closed, and my mind would wander. I would think that I was in an entirely different place, and would be surprised when I opened my eyes and found myself in my room. I mentioned this to my psychiatrist and he asked me if I ever heard voices. I guess he thought I was schizophrenic, which makes sense because that was one of the side effects mentioned. This was the reason I decided to get off the drug.</p><p>The most prominent side effect of this drug was extremely vivid and random dreams. There was no way for me to tell that I was dreaming, and when I woke up it took a while for me to realize that I was back in the real world. The dreams always occured much later than normal, so I would have to wake up for school while I was in the middle of dreaming, which made it difficult to wake up. Another interesting side effect was that it greatly increased my sensitivity to stimulants, including adrenaline. Whenever I was surprised the resulting rush would feel extremely good, almost like the come up of a good dose of X. It also seemed to interact with marijuana. I smoked quite a bit while taking it, and it made my paranoia a lot worse. One time I smoked a joint about an hour after taking it and experienced frightening audios and visuals. Everything seemed to turn a shade of red, and I heard my parents screaming at me. Since then I have never smoked alone.</p><p>My experience with this drug wasn't really positive or negative. It didn't have any effect on my depression, and since then I have resolved not to take antidepressants any more. I would rather work through my issues on my own. I apologize for the length of this report, but I wanted to cover all the details. I hope this is helpful for someone.</p>"
}
