{
 "title": "Game Show From Hell",
 "author": "Recentlyhumbled",
 "citation": "   Recentlyhumbled. \"Game Show From Hell: experience with Salvia divinorum (10x extract) (ID 25350)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25350",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25350",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 14, 2007",
   "Views: 3405",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First I would like to say that I am a somewhat seasoned explorer of the mind. I have use many substances for purposes of recreation or exploration. I'm not boasting or anything I just want to be thorough. I have been known to be able to 'keep my cool' in less than desirable phsychedelic conditions, I have watched many friends cause long term damage to their psyches by misusing psychedelics and I try to remember this and repect the chemicals I use. I just want to imply that I cannot compare the Salvia experience to anything else. I was truly terrified like never before in my life!</p><p>The day of my last experience, my girlfriend and I were scheduled to leave for a week vacation the following day, so there was a greatly relaxed atmosphere. I was in a great mood, maybe slightly apprehensive. I had only smoked marijuana and am a regular smoker. I was not stoned at the time. I had experienced mild effects from salvia (10x but I didnt hold it in) before but nothing like the one I was about to. I think this led to over eagerness and lack of respect; I just didn't think it was this strong. My brother brought over a gram of the 10x extract, so I straightened up a little and we immediately got started which I now realize as a mistake. Preparations are a must with this.</p><p>Being the 'Salvia pioneer' I fancied myself to be, I voted to go first and met no opposition. I put on some heavy, trippy jazz music and divided the gram into two parts and packed one of them in my large water pipe. Sitting on my large wraparound couch, I blasted my first hit and held it in like a champ and then cleared the bong and I believe I choked on this but it did not matter any longer for my vision was clearly changing. my friend to my left kindly removed the bong from my grip and I relaxed and laid back. I instantly laughed but I think I was just doing it to convince myself I was okay and not to alarm my friends.</p><p>I felt a strong current pulling me to my right and rolling under me like a wheel. Looking around, I saw everything, not just the room but my whole reality rolling up into this 'wheel' my friend to the left of me and my brother across from me were being rolled right up too and they seemed to only be props. I later found out that I was looking at my best friend and brother as if I did not know who they were. I noticed I too was being rolled up and assimilated into my hardwood floor. I remember thinking 'You've got to be shitting me and getting the strong feeling that this was no joke. I was unaware of this but by this time I had rolled off of my couch and nose dived onto the floor and was rolling around. I remember everywhere I looked I saw an image of what I just looked at as if I truly was being wrapped up. </p><p>I remember feeling as if my entire life and all my experiences were someone's entertainment or game show and it was being disposed of to start a new one. I'm sure my companion's laughter at my state contributed to this feeling. I vaguely felt as if I had known this all along, but was absolutely terrified. I began resisting this wheel to try to get out but could not. at this point I think my brother came over and to check on me on the floor and was asking me if I was alright but I heard none of this. He was holding my forearm as I was sitting on the floor and I thought my brother was the game show host, pushing me into the wheel because I was trying to resist. The loud heavy jazz (not a good idea) became the theme song to this game show, unrecognizable to me, though I listen to that song all the time!</p><p>I remember when it got to the point that my upper body and head were being rolled up I felt an inkling of relief that the struggle we call 'life' or 'reality' was over, but my fear and inability to let go far outweighed this relief.  I finally managed to stand and the effects quickly dissipated. Thankfully not hurt, I slowly came to as I put everything back together in my mind and felt amazed at my re-realization of this reality. My amused brother and frightened friend informed me I had just rolled around and spilled the salvia in my fall. By this time I was very amused like a playful cosmic joke had occurred but only after I regained my conciousness. I felt completely normal 15 minutes from ingestion save a slight tired feeling and I went about the rest of my day, pretty flabbergasted at what had happened.</p><p>I feel as if I have learned a few things from this harrowing experience. if anything to stop clinging so tightly to my perceptions, and not only on Salvia, for they can drag me into a personal terror. I might feel a heightened creativity but this could just be my excitement at a new experience. this plant does unfold a completely foreign dimension that can be equally pleasant and horrific maybe even simultaneously. I am of the belief that the frightening things we see are really our own fears being projected on things we dont know about. If I am brave and full of love I can handle anything, only when I fear, judge and hate do my nightmares surface. this is easy to remember on other psychedelic trips but Salvia hits too quickly.</p><p>I will definitely do Salvia again. When? Im not sure but soon. I only hope I can have the personal courage to let go and see where it takes me. A true challenge. I am concerned about the safety of losing bodily control. I wish I had access to a padded room!</p>"
}
