{
 "title": "Perplexed",
 "author": "DayDreamer",
 "citation": "   DayDreamer. \"Perplexed: experience with Syrian Rue (ID 25390)\". Erowid.org. Aug 30, 2004. erowid.org/exp/25390",
 "substance": "Syrian Rue",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "14 g",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25390",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 30, 2004",
   "Views: 6557",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBeing interested in shamanic ways, I was of course intrigued by the most commonly used Amazonian psychedelic, Ayahuasca.  Wanting to understand the subtleties the ingredients had to offer, I decided to try them out individually, and combine them when satisfied.\r\nNOTE:  I seem to have an EXTREME tolerance to psychedelics.  I have taken 1 hit of acid, ingested 900 morning glory seeds at once, smoked several grams of dried Salvia Divinorum out of bong, on several occasions.  Then I wanted to try an extract, smoked 1 gram of Salvia 5x by myself (used bong).   Ingested 14 g of Mimosa Hostilis extract. ALL to NO effect other then a sense of nausea or minor personality changes, nothing magical.  Most of these states I have been able to successfully induce via meditation. \r\nPreparation:  Grind 14g of seeds, eat them, chase with water.  Also have not eaten in 12 hours.\r\nThese are the recorded events in the order which experienced.  \r\n1:18 Syrian rue taken 14 g\r\n1:51 Light mellow high, barley noticeable nausea\r\n2:22-2:40 I had to hurry to the bathroom, (diarrhea), also where I threw up 3x, then to the kitchen trying to get some water because I choked on my own vomit, throw up some more, about 8x, water is 10 feet away but cant move.\r\n2:44 Lot of zoning out\r\n2:45 Ego seems dissolved\r\n3:00-5:30 Laid on bed, had to get up and throw up 2x, tried to smoke weed, couldnt threw up again.  Back to bed, fell into dreams almost at will, no CEV, or any type of visuals for that matter. Slept\r\n6:05 pretty much down\r\n3:09 Peaceful \r\nConclusion:  This is not psychedelic!!   Then again NOTHING has worked for me except high doses of cannabis.  Combos have yet to be tried but most certainly will soon.  I didnt have but a joint with me, if I did it most certainly would have been a less painful experience, so I would have some cannabis handy.\n\n\n"
}
