{
 "title": "Extreme Sex - Little Risk",
 "author": "DevilDoc",
 "citation": "   DevilDoc. \"Extreme Sex - Little Risk: experience with Sertraline, Sildenafil, Horny Goat Weed, Catuaba (bark) & Muira Puama (ID 25391)\". Erowid.org. Aug 4, 2005. erowid.org/exp/25391",
 "substance": "Sertraline, Sildenafil, Horny Goat Weed, Catuaba (bark) & Muira Puama",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Pharms - Sertraline",
   "(pill / tablet)",
   "  T+ 7:00",
   "465 mg",
   "oral",
   "Catuaba",
   "(ground / crushed)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Vitamins / Supplements",
   " ",
   "  T+ 7:30",
   "100 mg",
   "oral",
   "Pharms - Sildenafil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25391",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 4, 2005",
   "Views: 39480",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Throughout time I believe that men in this world, being exposed to an incredible amount of stress, have sought to increase they sex drive. It is proven that stress decreases sex drive, and too much on the mind can cause erectile issues to boot. And to make it all worse, women (and not that arent entitled to) have been wanting more satisfaction in the bed. That has left us men in a horrible situation! If we want to be in a relationship we need money, but to get that kind of money (enough to support a potential family) we need to be successful  not in our current job, but have aspirations for the future, or a job that will allow for progressive growth and, of course, more money with time.</p><p>I have found, I believe the key to all my sexual problems. Dont get me wrong, I do not have a problem with my member rising to the occasion, but I do have a girlfriend who is hell-bent on having orgasm after orgasm until she is satisfied. I have found the key to this dilemma. </p><p>Note: if you are on any organic nitrates do not follow these suggestions. Instead skip down to the bottom where I have helped people on nitrates (people on nitro or the like for a heart condition).</p><p>Here is my regimen. At about noon (assuming an 8pm encounter with my lover) I take a generic (or non-generic) Zoloft  100mg (sertraline is the generic). If taken with food it shortens the time for complete absorption (from 8 hrs to 5.5 hours), but boost the overall concentration in my body. So, if I discover I feel awkward after a few days of this treatment, I either do not take with food, or cut the dose in half.</p><p>Part 2  that night About an hour before I expect to have sex, I take the extract therapy  465mg Catuaba Bark, 500mg Horny Goat Weed, 500mg (5:1) Muira Puama.</p><p>Let me explain  Zoloft (Sertraline) can cure premature ejaculation. It is now an unlabeled usage for the drug. But there is one unfortunate side effect  impotence! Yep, now Ill be a stallion and can go all night, but I 1. wont be able to get it up, and 2. wont be interested in sex. These 3 compounds are the answer. Horny Goat Weed, Catuaba Bark  and Muira Puama will overcome the lack of sexual interest problem but what of the impotence?</p><p>Well, thats what Viagra is for! But who can afford the stuff? I can! I have found some pretty cheap generic alternatives  the best (as far as Ive seen) is Caverta. Which I take on an empty stomach 30 min to 60 minutes before sex.</p><p>Let me tell you  when I follow this regimen I will not only have a girlfriend who thinks of me as a gift from god but one who would be willing to do ANYTHING to make me feel as good as I make her feel. Careful, though, I will probably not orgasm at all no matter how hard I or she tries. She shouldnt mind too much  I just let her know I care more about her than myself. </p><p>Now, as for diabetics or nitrate-taking heart patients. I have found one sure-fire remedy: generic benadryl (25mg diphenhydramine). Because people get sleepy on this stuff, I start off with one about 1 to 1.5 hours before sex to help with impotence. If not, I go to 2, but no more that 2. </p><p>Good luck, and have fun. But be careful everyone!</p>"
}
