{
 "title": "Angels and Mars",
 "author": "CRaZyAmishMaN",
 "citation": "   CRaZyAmishMaN. \"Angels and Mars: experience with 5-MeO-DMT & Tobacco (ID 25418)\". Erowid.org. Sep 27, 2004. erowid.org/exp/25418",
 "substance": "5-MeO-DMT & Tobacco",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   " ",
   "  ",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25418",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 27, 2004",
   "Views: 7616",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A Fortuna cigarette was dipped in water [soaking about 5mm] and then inserted into a vial of 5-meo-DMT. I have tripped before, but I've always been conservative about the dose [I don't have a very good scale, so it's of no use]. I've tripped using tweezers to measure out a dose onto tinfoil and smaller doses using the cigarette-method, but this time I wanted to have a classic 5-meo-DMT expirience. My earlier trips were + and ++'s. There was a rushing body buzz and a skewing of time and visual perception. My last trip was a +3, and very near a +4.</p><p>I had been on vacation at the Outer Banks for 4 days or so. I was troubled earlier by drunken assholes being themselves, and I thought this may affect my trip. It was (roughly) 2 o'clock in the morning.</p><p>I walked out onto the beach and prepared for my trip. The waning moon lit up the beach and the fog that had settled during the evening. I sat on the steps of a beachfront home and looked at the ocean and moon. I felt no paranoia. I lit the cigarette and heard it crackle as the moisture and DMT crystals burnt out of the tip and through the cigarette. As the DMT entered my lungs the slight sting of tobacco smoke and DMT smoke urged me to cough. I held back the sensation and inhaled a second time, still holding my previous hit. As the stinging subsided I knew this would be a bigger trip than ever before.</p><p>I felt a surge in my loins as I experienced the aphrodesiac affect of 5-meo-DMT. This quickly passed as I was rocked farther into oblivion. During the onset I felt as though I was being smoothly shot 2 steps away and 1 step toward baseline. I had been looking at the moon during the onset and within a couple of seconds I began to see two wings forming from the moon. They got larger and more defined. 'I saw an angel,' was all I could mutter, half unaware that I was still in its prescence. It reassured me. It seemed to tell me, just by being present, that I was worth something. There was a god. There is a point.</p><p>I took a drag of the cigarette and the smoke filled my lungs and escaped, tangling with the moonlight and joining the fog. My hand left my mouth and fluttered in a stream of tracers to my knee, only somewhat under my control. 'This is what it is like to live,' I said to myself. 'This is what it's like.' I repeated this a couple times while listening to the breaking waves and taking drags of the cigarette.</p><p>I looked to the right of the moon and saw Mars shining brightly through the fog. 'Mars.' Our sister planet. Shining through the fog, watching our back.</p><p>The comedown was rough. Not because of the chemistry of the drug but because of the beauty of my trip. I simply did not want to return to the 'normal' world. I was still +3 as I finished up my cigarette. I stumbled as I walked toward the ocean and later wandered home.</p><p>I don't think I will do 5-meo-DMT again soon, but I would like to do it again. There are so many emotions occuring in one instant, it's hard to comprehend what you're feeling and it slows time to a snail's pace.</p>"
}
