{
 "title": "Amazing but Long",
 "author": "gravol",
 "citation": "   gravol. \"Amazing but Long: experience with IAP, Alcohol & Cannabis (ID 25477)\". Erowid.org. Jul 21, 2003. erowid.org/exp/25477",
 "substance": "IAP, Alcohol & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "IAP",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25477",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2003",
   "Views: 22349",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n3:47 am<br>Just took approximately 25 mg of IAP.<br>4:12 am<br>Getting pretty nice head euphoria. Not really speedy, but euphoric. Nose <br>feels tingly. Music euphoria. It is a possible SSRI so I do not know how it is going to affect my DXM trips, but I like what I am seeing thus far. Seems to increase the flow of conversation, but I do not notice any actual mood elevation that comes accustomed to GHB.<br>4:23 am<br>Nose tingling has gone away, now it is just head euphoria, music euphoria, <br>and an opening of senses without any visual distortion. I feel good. It does feel a bit like MDMA.<br>4:58 am<br>Euphoria comes in waves, head is tingly and feels good. Like a low dose of <br>MDMA - will experiment with 50 mg next time. I feel open and talkative.<br>5:21 am<br>Consumed some alcohol. I feel very open and empathetic. Feeling really good. Not intense but very nice positive attitude and energy. Not 'let's go out and do something' energy like with GHB but just happy-go-lucky, content with life, talking a bit more than normal, easy to converse, etc. Alcohol definitely adds to the euphoria.<br>6:29 am<br>Euphoria, disinhibition (probably from the alcohol added - very synergistic). I could only imagine what GHB and IAP would do together. The euphoria is amazing - it encompasses my entire head. And I feel more open and talkative. If only this could be marketed as an antidepressant instead of Paxil and Prozac, the world would be a MUCH happier place.<br>6:50 am<br>Just got stoned with AK-47 strain. I can not tell you HOW synergistic IAP is with weed/alcohol - it feels like a good clean MDMA with waves of euphoria all over my head, without much body buzz or intense effects by itself - increases the flow of conversation, it is truly a remarkable substance. I have found the second best thing to GHB. Perhaps even better, if tolerance is not an issue and I see how it goes at higher doses.<br>THC provides an amazing synergy with this drug. I now have a full-body buzz <br>going. The two go hand in hand. I imagine that GHB+IAP+THC would bring about a full-body orgasm, much like MDMA+N2O.<br>Sleep was difficult. I was not able to sleep until 12 hours after ingesting <br>it. It is a lot longer acting than I thought - the alcohol and marijuana may have prolonged the effects, but I doubt it. Sleep, when it came, was normal.  Today I felt fine, and I notice there is no interaction with DXM. Appetite is normal, everything else fine. Since it lasts so long, I probably wouldn't do this more than once a week.\n\n\n"
}
