{
 "title": "Odd Urge to Cry",
 "author": "bLuEcOw",
 "citation": "   bLuEcOw. \"Odd Urge to Cry: experience with Zoloft (ID 25516)\". Erowid.org. Jul 10, 2007. erowid.org/exp/25516",
 "substance": "Zoloft",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Sertraline",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25516",
   "Male",
   " ",
   "Not Given",
   "Jul 10, 2007",
   "24633",
   " "
  ]
 ],
 "report": "<p>I've been gettin really bored lately since i can't find any of the common drugs around my area.  I realized, hey my parents have all kinds of drugs around here.  I looked through the cabinent and found some zoloft.  It had warning labels for drowziness and that you shouldn't drive while using so I thought hey its gotta do somim.  I took it alone.  I was watchin up in smoke in my basement and took the 3 pills at about 6 o'clock.  I decided on 3 because the perscription was for 1 a day so I didn't want to go too far.  Now I havn't really done much besides weed and a few other perscription drugs so I my comparisons may be a bit off.</p><p>At about 7 o'clock I started feelin really tired and started yawning alot, it was odd because every time I yawned I felt like I had to cry then my jaw would tremble like I was really cold.  This was all that happened till about 10:00 when I started feelin kinda dizzy.  Nottin much else happened for a bit so I decided to just go to bed early at 11:00.  When I laid down in bed I found that I was wide awake all of a sudden, but I was still yawning like crazy with that odd urge to cry.  I tried reading but I couldn't focus on the page.  I just sorta laid there for bout an hour thinkin bout stuff.</p><p>At bout midnight I was startin to get restless.  I would just convulse for no reason and I had to keep rolling around.  Then at about 12:30 I started feelin really odd.  I was gettin really bored but I didn't want to do anything.  I did have the urge to talk to someone though but no one was up.  As I laid in bed and stared at my ceiling I noticed that there where all these black lines forming on it.  It as really weird and I couldn't stare at it or it hurt my eyes.  I turned my light on then started gettin really mad at it for some reason so I turned it off.  Then I noticed an out of place shadow on my ceiling and I got really mad at that too, I almost yelled at it then I remembered everyone is asleep lol.</p><p>All this stuff went on till about 3:00 when I decided it was time to try and get some sleep.  It was an odd sleep.  I would sleep for bout an hour then wake up and fall asleep again.  When I got up the next mornin I figured it was over, then that yawning stuff started.  I got up bout 9:00 and I was just really relaxed.  I didn't seem to be bugged by anything all day.  I played warcraft(a computer game) for a bit and noticed I didn't get mad at it when I lost like I usually do.  I had trouble focusing though so I just sat on the couch and chilled all day.  That night I was wide awake again and I had to force myself to get some sleep.  Well its now the third day and I guess its waring off now although I still feel pretty relaxed.  This is somim that I'll probly try again, although I'll do with a freind since I got that really bad urge to talk to someone.</p>"
}
