{
 "title": "Loss of Body",
 "author": "artfool",
 "citation": "Citation:   artfool. \"Loss of Body: experience with H.B. Woodrose (ID 25524)\". Erowid.org. Jul 24, 2003. erowid.org/exp/25524",
 "substance": "H.B. Woodrose",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "10 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25524",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 24, 2003",
   "Views: 15128",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThroughout my life I have been always held much interest in Mind expanding substances. I have tried LSD and shrooms before and had wonderful experiences. Due to lack of these 'treats' in the  local market I began exploring different substances that might be more accessible. After researching and finding surprisingly many options I decided that I would give Hawaiian Baby Woodrose seeds. I read as much as possible and finally me and a few friends ordered a pack of seeds. \r\nAfter anxiously awaiting our package it finally arrived on a Friday (couldnt have been more perfect). We all gathered up at our usually hang out place and I told everyone what they might expect form these seeds and told them as much as I knew. After giving them a stern warning about possible side effects we began to scrape the brown husks off of the seeds. This took quite awhile for some of us. I was the first to finish. I looked at the small pile of seeds in my hand and after a final thought of reassurance I threw them into my mouth. I began to chew. My first thought was 'Oh my god these things are rock hard!'. After awhile I was able to grind them up in my mouth. I kept the not too-bad tasting stuff in my mouth for a good ten minutes. I finally swallowed the stuff and slammed it down with some sprite. I looked at all my friends who were watching me to see how I was reacting. I kept a cool face through out the process and I think they all got some confidence after watching me do it. \r\nAfter my friends consumed there amount of seeds we sat around playing video games and listened to some Ben Harper and Pink Floyd. After fifteen minutes of consuming the seeds one of my friends proceeded to puke quite violently. Then one after another every one started to puke. I did not. I hate puking and have sworn it off. I have a tough stomache I guess. After this great 'purge' from everyone we resumed playing video games. After an Hour and a half or so I began to notice a slight Buzz similar to a light marijuana buzz. I asked my company if they too were experiencing this and they all said they were feeling something. Then we all decided to run to the store and get some supplies. Upon standing up we all felt like we hit a brick wall. I felt drunk! Not so much physically but I was so giddy. I was having a good time. Everyone else appeared to be having just as much fun as I was. I also noted that all were grinning ear to ear. We went to the store and came back with out incident. \r\nWhen we came back it was about three hours since we ingested the seeds. I was sure we should be feeling more than what we were by this time. After we all sat down and began to mellow out I knew I was definitely feeling something. I have never been so happy in my life! Whimsical thoughts danced in and out of my brain. Then without warning everyone almost simultaniously burst into a fit of laughter. I looked at my friend sitting next to me and his eyes were pure black. I couldnt even tell the color of his eyes. A good sign. Then we all mellowed out again and Soon we were all in the grips of quite a pleasant trip. Not so much visualy was going on but It was a trip. The only way I can describe it is that it was a body trip. It was merely an experience beyond words. In dark places I kept seeing patterning on multiple planes just waving around. We all just kept in our own little world, interaction wasnt really going on. \r\nAs the night went on we all tried to sleep once it was getting pretty late. No one could sleep. It was as if I had totally forgotten how. My mind was racing out of control. So much information was flowing into my head. I just couldnt keep up or stop it. After tossing and turning I closed my eyes and then once I opened them it was One o'clock in the afternoon the next day. I was amazed. I ccouldnt remember any dreams. It simply felt like I had closed my eyes for a mere second. I looked up and all of my friends were sleeping. After everyone woke up we all tried to interpret our trips. No one could explain theres. It was so much of an experience that it just couldnt be explained with words. The only thing I have heard from my friends is that it was life changing. I feel the same way. I walked away from that evening with a new respect for life, family and friends. I also felt closer to my group of friends then i ever had before; a feeling that is absolutly incredible. \r\nJust do your homework and prepare yourself for anything. I dont think any of my friends had anywhere near the same experience. Set and setting are very important factor to this substance. I have used these seeds many times after this experience. I find them to be most therapeutic. In the end. I think I have found what I was looking for and I still dont even know what it is but I know i found it. See you on the Darkside of the Moon. Peace.\n\n\n"
}