{
 "title": "Double Whammy:  Disability & Depression",
 "author": "Angel",
 "citation": "Citation:   Angel. \"Double Whammy:  Disability & Depression: experience with Kava (ID 25536)\". Erowid.org. Jul 24, 2003. erowid.org/exp/25536",
 "substance": "Kava",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "5 drops",
   "oral",
   "Kava",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 25536",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 24, 2003",
   "Views: 46813",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA once very very active person, I became disabled 9 years ago (age 38) due to congenital conditions and cumulative injuries (from athletics, car accidents, and manual labor):  cervical stenosis, degenerative disc disease, neck/tailbone/sacroiliac injuries, repetitive stress injuries of limbs, fibromyalgia, migraines, IBS, clinical anxious-depression, insomnia due to chronic pain. I'm not kidding. \r\nIt's been a hellish passage through worker's comp/voc rehab/SSDI/the medical establishments. So much experimentation with treatments on all counts (physiological/psychological/ emotional/spiritual). Out of the work way of life for all this time, yet working harder than I EVER have! Ironic, no?!\r\nAnd the prescription meds? You name a bunch, I probably know too much about most of them.\r\nAs far as 'alternative' treatment substances, that's all been my own doing. I've been a gardener and herbalist prior, and with that as a base, researched more with an eye out for things that would address these conditions, my particular physiology (extremely sensitive - really), way of life, temperament, and the meds I've fairly well stablized with (as much as that's been possible).\r\nSo, speaking of Kava - yes - a resounding YES from me! I'm surprised to read of so many neutral or negative experiences for others, but I've had only the best of benefits. My first few times using it were amazing! I felt a settling into a so desperately needed relaxation ALONG with a mental clarity and overall presence of well-being, as I can't even remember when, ever.\r\nKava has been a reliable muscle relaxant (oh please!), an anxiety queller (thank the stars), and a depression alleviator (unbelievable). I never imagined taking in a substance that would clearly assist with my symptoms withOUT: sedating me to a zombie-like state; put me to sleep wherever/whenever; exacerbate my migraines and IBS symptoms; leaving my mouth dry as dust; causing painful itching attacks; messing with my memory and articulation (2 of my worthiest gifts dammit!) etc.........\r\nKava does not of the above. The only time I had a reaction was when I had already taken another opioid-based pain med, and/or an NSAID, along with my regular meds. The Kava was nullified on top of those and simply kicked my migraine response into high gear (too much/many meds for pain at one time will always do this to me).\r\nBecause of my hypersensitivity to ... just about anything *s* ... I only need to take 3-6 drops once or twice a day, as needed.\r\nOkay, enough of my near deification of the plant! I am just very grateful for finding it.\r\nBest, Angel\n\n\n"
}