{
 "title": "The Sensuous Curve of Awakened Dreams",
 "author": "mayakaya",
 "citation": "   mayakaya. \"The Sensuous Curve of Awakened Dreams: experience with Damiana (ID 25555)\". Erowid.org. Nov 3, 2003. erowid.org/exp/25555",
 "substance": "Damiana",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Damiana",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Damiana",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25555",
   "Not Specified",
   " ",
   "Not Given",
   "Nov 3, 2003",
   "Views: 34018",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>According to a slim book in circulation on the east coast of Australia, titled Happy High Herbs, damiana is a mild psychoactive, relaxant, and aphrodisiac, said to promote pleasant and sometimes erotic dreams.  I was staying with a friend who keeps a large jar of damiana among his herbs, often adding it to teas or smoking with cannabis.  I decided to experiment with damiana, more interested in its possibility as a relaxant rather than as a dream enhancer</p><p>I mixed several generous tablespoons of damiana with some spearmint and licorice root, making two cups of very descent tea.  While drinking the tea, I rolled and smoked a damiana cigarette, and soon after noticed a *very* mild psychoactivity, not unlike the pre-buzz from a toke of weak cannabis, a perceptive flicker that soon faded, leaving me feeling slightly reticent, anti-socially relaxed.  Two hours later I went to sleep, and by then Id more or less forgotten about the damiana.</p><p>Id been experimenting with dreaming for several months prior to this experiment; I keep a detailed dream journal and, in addition to meditation, practice several methods for inducing lucid dreams.  For instance, before falling asleep, I clearly form the intention to dream lucidly, and then maintain meditative awareness for as long as possible before falling asleep. The night of my damiana experiment was no different, and after waking once and then returning to sleep in the same manner, things got interesting.</p><p>During the first remembered dream I soon became distinctly lucid, and tested to see if I was dreaming by attempting to stick an object thru my hand, which worked flawlessly.  For a few moments I floated entranced, marveling at the detail and intricacy of the dreamscape.  The dream content then swept me up again, and although I was still aware that I was dreaming, I did not seem to have much control over events.  It was as if the dream, once begun, had to see itself through, and I had simply become aware enough to observe it as it happened.  (This type of lucid dream is called a Witnessing dream.)  The dream was decidedly erotic, which isnt otherwise common; in fact the entire focus of the dream was sexual.  I then experienced a false awake: I thought I had awoken, and attempted to turn on my bedside lamp.  I flicked the switch, but it didnt work.  Then I awoke for real, and realized I didnt even have a bedside lamp where I was staying. </p><p>After waking I fell back asleep and experienced another lucid dream!  Again, this second dream was also very erotic.  After again waking and falling asleep, I had a third dream, very vivid and mildly erotic, but not lucid.  This dream ended with another false awake.  I have never before experienced a single night of such intense and lucid dreaming... This experience convinces me that while damiana may not offer much in the waking state (except perhaps at much higher  doses), this inconspicuous herb does have the ability to potentiate vivid & erotic, even lucid dreams.</p><p>Lucid Dreaming Sourcebooks:</p><p>The Art of Dreaming  Carlos Castaneda</p><p>Sleeping, Dreaming & Dying  F.J. Varela (ed.)</p><p>Conscious Mind, Sleeping Brain  S. LaBerge & J. Gackenbach (eds.)</p>"
}
