{
 "title": "Think Positive, Trip Positive",
 "author": "KS",
 "citation": "   KS. \"Think Positive, Trip Positive: experience with Mushrooms & Cannabis (ID 25575)\". Erowid.org. May 22, 2007. erowid.org/exp/25575",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "2.3 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25575",
   "Male",
   " ",
   "Not Given",
   "May 22, 2007",
   "3386",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am not going to exaggerate the effects of the trip, I will say that it was a unique experience  very enjoyable that being said the experience was very powerful but not overly intense, and I achieved this by taking the correct dosage for my tastes (2.3g). Some of the coming-up effects were unpleasant but they were quickly and easily alleviated by moving around, talking, looking, and listening, in general: letting go and embracing the coming entheogenic experience and its effects upon the senses with an open and inquisitive mind.</p><p>I purchased a ¼ ounce of mushrooms from a friend with the intention of taking them with two other people. The quarter ounce divided three ways would mean that each of us would ingest, roughly, 2.3 grams a piece. To weigh the individual doses we used a precision digital scale that one of my friends kept in our apartment. To neutralize, or at best, lessen the horrible taste (bland, in taste, tough in texture) of the shrooms we each ate them with a handful of goldfish crackers. </p><p>Our plan was to drive to a near by college campus and trip there; in retrospect not the greatest idea, but interesting nonetheless. Campus security was out in force but did not bother us. We parked our car and armed with bottles of water we made our way about the campus. About 45 minutes after ingestion I started to note that lights and sounds seemed more pronounced, coupled with a warm feeling about my body, akin to anticipation.</p><p>We stopped at an off campus 24 hour grocery mart to pick up some cigarettes and some gum. Inside the store I started to feel the threshold effects of my trip, a subtle euphoria along with a general feeling of excitement. After we made our stop we walked to a near by bench to sit down and marvel at our surroundings. Once I was seated I began to feel more and more like I was actually tripping and it felt cool. After 20 minutes of this we decided to get up and walk around, it was at this moment that I felt somewhat breathless  I could breath but my ability to speak was somewhat subdued. </p><p>We started to walk around and I could definitely feel a change in perception. It is difficult to explain but everything seemed to exhibit a soothing, calming, luster. We sat down under a tree and I felt somewhat sick, I started to move about  fighting the changes that were taking place, it felt different than previous trips, in terms of intensity of stomach discomfort. I started to get paranoid, my friends told me to let go and enjoy the ride; one was babbling incoherently the other completely silent. I decided to change my surroundings; the shrooms made me yearn for conversation and pleasant atmosphere. I walked with my friends around the campus, as if the fear previously described was HOURS past; we talked, gazed up at the massive architecturally intense structures about the campus. </p><p>When I would close my eyes subtle patterns would emerge, quite beautiful and awe-inspiring, nothing too overwhelming. If I stared at the sky I would see hexagonal patterns stacked upon each other reaching from the heavens to my eyes, once I would move or change focus they would disappear. Looking closely at trees was very interesting, they would undulate, branches would move independently. Sounds were very pronounced, it was as if my aural perception was intensely heightened; people off in the distance whispering would sound as if they were a mere couple of feet away from me. Soft breezes would move past me, sometimes even through me. </p><p>My friends sat themselves down and stared at the sky again, I being the intrepid adventurer took off down the back roads (unlit) that would take me to my apartment, our rendezvous point for the evening. My friends warned against it, but I made my way down the pitch black back roads. It could have gotten frightening, however my oneness with the earth kept me grounded as if guiding me home again. The silver guardrail was all I could see it twisted and turned down the narrow streets until it ended at an intersection with a moderate sized road.</p><p>I crossed and walked up the road; cars would race by me and honk (it was about 2:30 AM) and then finally I made it to the sidewalk near my apartment. It was lit with an amber-colored street lamp that contrasted beautifully with the small dogwood trees that were off to the side of the path. I walked into my development and into my apartment, the inside felt small but comfortable. I began to listen to music and then I heard a knock on the door. it was my friends.</p><p>We laughed and talked, they informed me that they were worried that I got lost. The general feeling of friendly association was heightened by the drug. We sat under a tree outside my place and smoked a blunt, which prolonged the effects of our dwindling trip. We looked up at the trees and they watched over us. I truly felt one with the environment, it was fantastic!</p><p>-ANB</p>"
}
