{
 "title": "Low Dose Proves Beneficial",
 "author": "uNivErSaL",
 "citation": "   uNivErSaL. \"Low Dose Proves Beneficial: experience with AMT (ID 25581)\". Erowid.org. Apr 7, 2006. erowid.org/exp/25581",
 "substance": "AMT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "oral",
   "Pharms - Escitalopram",
   "(daily)",
   " ",
   "15 mg",
   "oral",
   "AMT",
   "(capsule)",
   " ",
   "2.0 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   " ",
   "4 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25581",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 7, 2006",
   "Views: 22774",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>To make this report easily readable, I will summarize my experience in different sections, so just jump to what interests you.</p><p>My Substance History:</p><p>I have experienced a wide array of substances:</p><p>Traditional hallucinogens: LSD & Psilocybin, </p><p>Stimulants: Cocaine, MDMA, Methamphetamine</p><p>Others: GBL, Salvia, K, DXM, </p><p>Pharmaceuticals: Oxycodone, Hydrocodone, Propoxyphene, Methadone, Ambien, Restoril, Valium, Ativan, Adderall, Dexedrine, Phenobarbital, and Gabapentin.  </p><p>If they need mentioning, weed, alcohol, and nitrous are common allies of mine.  (My first high was at the dentist at age 10!)</p><p>Additionally, I have tested 5-Meo-DiPT Hcl, 5-Meo-AMT, and AMT.  I am reluctant when it comes to ingesting research chemicals.  I had unpleasant experiences with Foxy at higher doses and low doses were a waste of time.  5-Meo-AMT I have nicknamed 'Fear', those whom have tried this chemical may agree with why I call it that.  AMT I have tried several times, but upon looking at my bag I realized I only had 98.6% pure AMT which is just unacceptable for consumption.  I then acquired 99.5% AMT.  The higher purity AMT is what was ingested.</p><p>Personal History:</p><p>For the most part, I have lived a happy life.  That changed several months ago, when I discovered GBL.  At first everything was great.  I managed my doses and didn't see any problems.  This didn't last long.  I lost control, went on a non-stop 3 month binge, and my girlfriend of two years left me.  Since then I quit G, but I have a hole in my life since then I have yet to fill.  I still have strong feelings of regret for my past actions regarding my ex-girlfriend, which necessitates some form of personal reconciliation.</p><p>Drug Philosophy: </p><p>This isn't very relevant to AMT, but regarding my personal history it's worth mentioning.  Drug use and addiction is closely intertwined with and fueled by states of personal relationships.  This includes with others and with one's self.  My addiction to GBL originated by wanting to change the relationship I have with myself.  I was social and internally confident and content.  Presently, it could be said I am trying to use AMT as a method to reconcile with myself.  </p><p>Mindset during Dosage Day:</p><p>I've been on Lexapro (escitalopram) for two months now and I've finally tapered my dosage to a malevolent 5 mg.  AMT being a slight MAOI-A and Lexapro being a SSRI, this is generally something I want to avoid; however, both being low doses I decided to give it a shot.  </p><p>Preparation:  </p><p>I weighed out 25mg of AMT freebase I then visually split this pile into two halves taking what appeared to be the slightly smaller half.  Eyeing powders is not a good method of measurement; however, given the 25mg was accurate little harm could come from a miscalculation in this instance.  I then placed the ~15mg in a gel cap and added a little Lemon juice to bring the pH of the freebase down a little.  I found this effective at preventing nausea.  I ate the pill on an empty stomach, but maybe an hour later ate about a cup of cottage cheese.</p><p>The Big Event:</p><p>3:15 P.M. Ate the pill, felt initial feelings of anxiety, which quickly dissipated.  Waited two hours for effects to build, around 5:30 bingo, AMT had definitely made its way into my bloodstream.  I was amazed at how relaxed I was.  There was very little of the nervous stimulation that accompanies most AMT experiences.  There was a strong elevation in my mood, I couldn't help but to smile, but surprisingly I stayed quite relaxed.  I had a warm feeling of contentment with very light MDMA undertones. </p><p>I spent the rest of my day venturing around doing the same mundane daily tasks, but the AMT made it all enjoyable.  Given that AMT was marketed under the name Indopan in the 60's, I think it should be marketed in the 2000's as a highly controlled anti-depressant.  I found more benefits from the AMT than I have from my Lexapro, which I was previously taking, at the highest effective dose (20mg).  I suppose it's possible the AMT potentiates Lexapro, but one could never be sure.  </p><p>Later I went to meet up with an ex-girlfriend (not the one mentioned above) that I basically hang out with when I have nothing better to do.  This required a Valium, 2mg to keep me at bay.  She is, how would you say... a conniving, self-centered, female who is out to manipulate as many guys as she can.  My guess is this originates from low self-esteem, but who can be sure and frankly who cares?  Anyway, I met up with her and the AMT assisted me to analyze her gestures and facial expressions.  Her pimp game was at an all time state of transparency from my perspective.  I also caught her cheating in a game of spades, through simple eyes movements and nods.</p><p>After enough superficial interaction with this girl, I left for a friend's house that was having a small social gathering.  At this point I had a few beers and a couple bowls of good weed and I was ready to eat a lot of food and pass out.  So I went home and did exactly that.</p><p>Conclusion:</p><p>There are many mixed reports about AMT.  People rarely mention purity levels of their product, which makes most experience reports unhelpful when it comes to assessing an adequate yet safe dose.  On 15 mg, I was never in a state I'd call tripping, but it definitely was a tryptamine headspace.  When the time is right I will take a higher dose, but I am in no way dissatisfied with my experience.  I didn't reach any far expanses of my conscious or reconcile my problems.  I did have a good time though; for once I was outgoing, carefree, and content.  It's a shame more formal research could not have been done previously.  Given AMT's legal status in the U.S, less research can be performed on this unique tryptamine.</p>"
}
