{
 "title": "Pure Magic",
 "author": "gravol",
 "citation": "   gravol. \"Pure Magic: experience with 4-HO-DiPT (ID 25600)\". Erowid.org. Jul 26, 2003. erowid.org/exp/25600",
 "substance": "4-HO-DiPT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "4-HO-DiPT",
   "(powder / crystals)",
   "  T+ 1:10",
   "25 mg",
   "oral",
   "4-HO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25600",
   "Male",
   " ",
   "Not Given",
   "Jul 26, 2003",
   "18452",
   " "
  ]
 ],
 "report": "<p>10:16 pm</p><p>Initial effects from 25 mg ingested fifteen minutes beforehand. Getting that warm mystic rhythm and tingly sensation. Can tell this is going to be good. Things starting to move around. Been 15 minutes since I dosed. Music seems more dimensional and the bass flows through me like wine.</p><p>10:29</p><p>Things rocketing into intensity. Spiraling forms of infinite beauty. There is a true magic in the air. Visual distortions that have not been seen since windowpane. Everything becominig softer to the touch... more blankety, velvety....</p><p>10:33</p><p>Massive visuals beginning. Reality is pulsating, breathing, like a giant connected alien membrane. I look to the floor and I see trademark LSD patterns and sort of reminds me of Fear & Loathing. </p><p>10:35</p><p>Body vibration getting more intense. The tryptamine is now coming out to her full blossom. Her colors are of vibrant reds and the bluest hues. A very immaculate nature. Divine inspiration lurks deep inside me. I can tell this is going to be a night for allowing ideas to emerge.</p><p>10:38</p><p>Mental orgasm. Music, everything came rushing through me for that moment.</p><p>10:59</p><p>I feel I have just edged off the peak, and I feel I should go a little higher so I will take more. Be right back.</p><p>11:06</p><p>Just dosed 25 mg more. The initial peak is definitely over. Will have to see if there is tolerance for the ride back up.</p><p>11:19</p><p>Ah, the droll has finally ended, of being caught between peaks. I am finally on the journey back to the top, and I am liking the scenery very much. Think I will go outside to smoke a cigarette.</p><p>1:01</p><p>Just finally made it back in. The evening was magical. At the peak I could close my eyes and infinite fractals of magnificent beauty would make their way to me... I was literally tunnelling down infinite formations of fractals so I trained my eye to the source of the fractal and as I concentrated everything became more intense and finite in view and I realized, in my own awe, that it was a snowflake. Everything breaks down into a simple snowflake. It's madness! Sacred geometry at its core, my friend.</p><p>1:08</p><p>Microscopic vision. Haven't seen this since LSD. Still feel amazingly cognizant of everything around me, of everything's beauty... insanity. An old William Blake poem comes to mind...</p><p>To see a world in a grain of sand</p><p>Or heaven in a wild flower</p><p>Hold infinity in the palm of your hand</p><p>And eternity in an hour</p><p>And now, I am left to ponder the evening.... and what must become of it. It's been one hell of a journey.</p><p>COMMENTARY</p><p>In retrospect, I find that 4-HO-DiPT is much different than 4-aCO-DiPT. With 4-aCO, there were much more open-eye visuals, almost to the point where reality was coming apart at its seams and it was like looking through a kaleidoscope. Also with 4-aCO there was much more sensory euphoria - at one point I had to wrap a towel around my head for hours and roll around on soft blankets. With 4-HO, however, there were many more closed-eye visuals and fractal formations - a jelly-mold over everything when the lights were turned off, and amazing patterns of sacred geometry. The shapes produced by the snowflake-centered fractals looked like an MC Escher painting with lizards morphing and moving about.</p><p>Two totally different, yet similar, experiences.</p>"
}
