{
 "title": "Wonderful 2C-T-7",
 "author": "MGSeeds",
 "citation": "   MGSeeds. \"Wonderful 2C-T-7: experience with 2C-T-7 (ID 2561)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2561",
 "substance": "2C-T-7",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2561",
   "Male",
   " ",
   "Not Given",
   "Sep 13, 2000",
   "5926",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nJul. 22, 00</p><p>Decided to go ahead one week early.  Many issues to work out.  I pray this provides more than just a trip.  Feeling good inside, nervous.  No scale to weigh material.  First experience with 2C-T-7. </p><p>11:38 PM</p><p>Consumed approximately 50 mg. In water.  Slightly pink-orange color probably due to impurities, as Shulgin described 2C-T-7 as white.  Fairly bitter.</p><p>12:03 AM</p><p>First alert.  Slight restlessness.  No nervousness.</p><p>12:11 AM</p><p>Very light-headed.  Hands unsteady.  Definitely active material.  Starting to feel 'outside of myself.'  Nausea</p><p>12:23 AM</p><p>Great visuals have started already.  I can tell it is going to be strong.  Good!</p><p>July 24, 2000</p><p>Obviously, that was as far as I got with my journal.  Shortly after that last post, trip developed into intensity beyond all previous experiences, only rivaled by one 300+mcg LSD trip.   Bear in mind that to describe this type of experience only pollutes and colors what actually happened.  This was beyond any words that I presently know.</p><p>This is my only experience with a phenethylamine, but this one at the dosage I took was of a more complex nature than my indole experiences.  The visuals were vastly superior than any LSD trip, and LSD is very visual for me.  I have truly never seen a color display like that in my life.  In the beginning before the experience became truly overwhelming, I witnessed the most beautiful creamy lavender I have ever seen.  That was only one of hundreds of beautiful color displays I saw.  The visual display could be described as having a most 'colorful, sophisticated, swimming, complex phenethylamine chemical' nature to it.  When I use the word chemical, I do not mean that in a wholly negative sense, I just mean it did not feel organic.</p><p>The world around me eventually took on more movement then has for any other psychedelic trip ever before.  Incredabale swimming, inverting, kaleidoscopic motions, always being overwhelming colorful.  I was in a darkened room with the computer monitor, and at times the television, lighting up the room.  The overhead light was too bright, unpleasant, and overwhelming to keep on.  Eventually, the outer world became so changed, it was unrecognizable.  It is truly no exaggeration to say I could not see the normal world at the peak of the experience, and I had to feel my way around.  I tried my hardest to use the computer, but I could barley read the keys or the screen, even with the lights on.  It was the greatest struggle just to check my e-mail, and I felt like it was one of my greatest accomplishments when I actually signed in (only to not be able to read anything.)   I am truly not exaggerating in any way, and it is amazing considering I have not read of anyone having a similar experience.  </p><p>The most important part of the experience is what 2C-T-7 did for me psychologically.  I had just broken up with my girlfriend of the past six years.  Without a doubt, that has been one of the most difficult experiences of my life.  Before this trip, I have not been able to except in my mind that our relationship was truly over.  My self esteem was as low as could be and I doubted I could carry on with another relationship.  This trip allowed me to let go of her and accept that what we once had was over.  At the peak, I cried, or rather wailed, for us and what we had.  This release of emotion was so intense it was like giving birth.  I tripped two weeks previously on eight baby woodrose seeds hoping for a similar outcome, but they did not provide it.  Since coming out of this trip, I feel better about myself that ever, and I have a new confidence in me that has not been there for quite a while.  It is hard to say exactly what is different, but so much is because of the 2C-T-7.  The changes produced go far beyond what I am now mentioning, but I have not had time to integrate all that has happened to me.  I just know that my life is truly different now.  A true near-death experience.  I also quit smoking because of the trip!</p><p>2C-T-7 did have some negative physical side effects on me, though none too severe.  In the first place, it produced nausea.  The nausea was different than morning glory/baby woodrose seed nausea.  The seeds make you feel like you ate some bad food, 2C-T-7 just seemed to irritate my stomach.  To be fair, I was a little nauseous before I took it, but it still was responsible for some.  Cannabis helped, but not completely.</p><p>The dose I took also had an intense body load.  I could never get comfortable.  My body felt like it might explode.  It was not the same feeling as being over-stimulated, as if one took to much amphetamine, and is difficult to describe.  Also, I had a hangover the next day which was very unpleasant.  Every other psychedelic I have ever taken always makes me feel like a million bucks the next day.  While these descriptions might sound extreme, it was well worth it considering all 2C-T-7 gave me.</p><p>To sum up, based on my experience I consider 2C-T-7 to be a far superior to LSD, in spite of the physical difficulties.  LSD at high doses can be quite a sinister and unfriendly drug in my opinion.  Considering how hard I tripped, 2C-T-7 was quite nice to me.  I believe its psychological benefits are similar to LSD's, but  2C-T-7 never produced the panic that LSD does in the heavy doses necessary for true ego exploration, making 2C-T-7 a more useful tool than LSD.  I do not want to compare 2C-T-7 to mushrooms, or ergoline containing seeds because I consider organic psychedelics to be in a completely different realm than synthetics.  Organics get me in touch with God.  Synthetics get me in touch with me.  I am not saying it is always that way, but in general it is.  I know you can find God with LSD, but I believe it will be easier to achieve that with mushrooms, peyote, or morning glory/woodrose seeds.  It was for me anyway.  2C-T-7 is definitely something any serious psychonaut should try.  Just like 1000 other people will say, start with a lower dosage.  I had no idea 50 mg. would do what it did to me, though since I divided the powder by eye it is possible I took more.  Don't sell this tool, keep it legal.</p>"
}
