{
 "title": "The Dark-Haired Woman and the Gargoyle Within",
 "author": "Gnostikoi",
 "citation": "   Gnostikoi. \"The Dark-Haired Woman and the Gargoyle Within: experience with Salvia Divinorum (10x Extract) (ID 25660)\". Erowid.org. Jul 28, 2003. erowid.org/exp/25660",
 "substance": "Salvia Divinorum (10x Extract)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25660",
   "Male",
   " ",
   "Not Given",
   "Jul 28, 2003",
   "Views: 20132",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've used Salvia repeatedly in the past, with mixed results - it's always had an effect of some sort on me, but it's generally varied widely.  I had one experience in particular, however, that made a big impression on me - it was particularly intense, vivid, and strange.</p><p>I was home alone - I would recommend a sitter, by the way, at least for your first few experiences with Salvia.  I sat myself in an easy chair and packed a pinch of Salvia 10x extract on top of a small amount of plain Salvia leaf.  I took it from a one gram package, and I would estimate it was about 1/10th of the total package, but that's a pretty rough estimate.  I sparked it up and inhaled deeply - in fact, I smoked all of it with one breath.  I held it in as long as I could, probably about thirty seconds.</p><p>As I exhaled, I experienced the more-or-less normal physiological effects that I've come to expect from Salvia - my limbs felt distant and weak, sweat began popping out on my forehead, and I had the distinctive sensation that the whole world was beginning to twist and warp; it's always reminded me of what plastic looks like when it burns, somehow.  </p><p>What came next was the strange part.  I was suddenly looking at my own body, except the chair wasn't there, and...neither was my lower body.  From about my upper thighs down, I was melded into the wall behind me, exactly like a gargoyle on the wall of a cathedral.  At the same time, there was a woman behind my left shoulder, and she was talking to me...this part is really difficult to describe because it was like I was seeing more than one point of view simultaneously - I was still looking at myself, but I was also looking FROM myself over my shoulder at the woman.  It was extremely confusing, and I couldn't see anything clearly, but I remember that the woman had dark hair.  She was talking in a calm, sort of lecturing voice, but either I couldn't understand what she was saying or I immediately forgot the content.  </p><p>I honestly don't know how long this went on for, because I didn't  look at a clock or reference, but the next thing I was clearly aware of was laying on the floor, all the way across the large room, curled up against a couch.  I have a feeling that I must have lost some time, because I definitely have no recollection of moving across the room.  I was feeling pretty shaky, but I gradually calmed myself down and got up.  The woman that I had imagined or invoked was so convincingly real that I actually ran out to the driveway to see if by some chance someone had really come into the house while I was under the influence, tried talking to me, and then left.  No one ever mentioned it to me, so I assume that it was an effect of the Salvia.</p><p>This was the strongest experience I've had with Salvia, and the only one that involved true hallucinations.  If I hadn't been already convinced that Salvia is a powerful substance, that experience would have done the trick.  In fact, I haven't used it since then, several months ago, although when the time is right I will.  I have enormous respect for it, and anyone who is considering using it should too.</p>"
}
