{
 "title": "Blissfully Surprising",
 "author": "BlindMind",
 "citation": "   BlindMind. \"Blissfully Surprising: experience with Cannabis (ID 25698)\". Erowid.org. Dec 22, 2003. erowid.org/exp/25698",
 "substance": "Cannabis",
 "bodyweight": "176 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25698",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 22, 2003",
   "Views: 10063",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Smoking had been getting a bit dreary for me as-of-late. Being a casual, and at times, heavey smoker for the better part of two years had taken its toll on my brain, lungs, and the excitement factor that accompanies doing any type of drug, illegal or legal. It was a night like any other, and I decided to try and make this a more enjoyable and satisfying experience than I'd been having in the recent weeks. So, I smoked a bowl. </p><p>First, let me say that this was incredible 'stuff', so one bowl was much, much more than I even needed to reach satisfactory levels of high-dom. Yet I finished the entire bowl, and cleaned up after myself. </p><p>I turned on some music, and put on some blue-tinted glasses, which made the room and lights appear more intriguing and happy than when the glasses were taken off. I lay on a mat on my floor, staring fixedly at the spinning cieling fan, and watching the 'shiny display' that the lights were giving off through my glasses. I rolled over, and again over, like a young cat rolling on the ground without a care in the world. I felt wonderful, and there was such positive energy flowing throughout my body and my room, even though the real world lay just beyond my closed door. </p><p>I got out a sketch book and made some rather random drawings and wrote some things, such as lyrics to the songs I listened to, or just some crazy sketches that provided nostalgia the next day. I finished the night off with my first attempt at meditation, with incense and some more trippy music playing. I fell asleep peacefully on my couch, only to awake the next morning, completely sobered up, but with a quiet and comforting recollection that I had, indeed, re-established the wholesomeness of my drug-related experience. I enlarged my world by reducing it to something so simple as an evening alone, away from electronics and human-interaction, which I presume is the way that Cannabis has been utilized spiritually for the last couple thousand of years, before the distractions that we now consider obligatory.</p><p>I would recommenend such a rejuvinating experience to any drug-user whose habits may have lost their 'pizazz'.</p>"
}
