{
 "title": "Man Confused by Salvia 'Shocker'",
 "author": "M.C. Cadaver",
 "citation": "   M.C. Cadaver. \"Man Confused by Salvia 'Shocker': experience with Salvia divinorum (10x Extract) (ID 25705)\". Erowid.org. Sep 9, 2003. erowid.org/exp/25705",
 "substance": "Salvia divinorum (10x Extract)",
 "bodyweight": "10.5 kg",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25705",
   "Male",
   " ",
   "Not Given",
   "Sep 9, 2003",
   "Views: 53097",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A couple of weeks ago I had my first run-in with salvia. </p><p>My friend Jimmy had tried it recently, purchased some, and ever since I had been pestering him to know: a) 'what is it like?' and, b) 'when can i try some?'. We arranged a small 'midweek' session round at his flat, where I repeated my intention to be very careful, and not go off the deep end. I had already heard some pretty strange things about it from one person who I knew to be immensely experienced in psychedelics, and was aware that it was similar to DMT, so I wanted to step it up in a series of small doses. This way, I figured, I could in some way control how far I took the experience, having had my hands burnt badly with hallucinogens before.</p><p>After some criticism of my caution, Jimmy filled up the pipe with a very small pinch of salvia (times ten extract). I finished the pipe, got some vague, behind-eye visuals that i couldn't see properly and felt a bit let down.                              </p><p>So, I had another pipe, slightly larger this time, and reached a dreamier state where I felt almost as if I were experiencing the onset of some mushrooms, but with a slightly creepy edge. My head also seemed to start lolling to one side, as if my muscles were slackening. Again, I had the indistinct visuals when I closed my eyes, but found them frustrating, turning towards the lamp next to me to try and shed some light through my eyelids, so that I could see them better. </p><p>So, I had another pipe. This time suddenly, out of the blue, I started being pulled backwards slowly and laboriously by some bizzarre force. It was as if I was in a harness with straps at loads of different points on my body, all of which felt like they were cutting in, and through, my physical form due to the tension being exerted on them from behind. I also had a strange vision, with my eyes closed (I think), of being at the start of a magical country lane with vines or weeping willows creating an arch over it, making it like a tunnel. There was the sense of whispering, fluttering spirits welcoming/enticing me in, and the feeling of an opportunity being offered. All the time this was going on, there was a big silver lever slowly rotating on a central spindle, creaking as it turned.</p><p>When its end brushed the ground during its circular motion, it sloshed as if it was dragging through a big puddle. This part of the vision morphed into a creaking child's swing going slowly backwards and forwards, adding to the 'magical' air. My attempts to communicate this state of affairs did not go terribly well, and have provided much subsequent amusement: 'Creaky roads....no, sloshy arms....there's a swing, and angels voices...'. I was  aware that some of the elements of the music we were listening to (aphex twin-20 mixes for cash) were partly suggesting these images, or connecting with them, especially the angelic voices and whispering. I came back down and tried to explain the slightly unnerving 'being pulled backwards in a harness' feeling, quizzing Jimmy about whether he had experinenced it at all. The vision side of it had been quite interesting, but the 'backwards'(well, sort of.....) motion was a very alien feeling, and had left me confused. However, curiosity got the better of me - After all, I just wanted to check what this 'backwards' thing was all about, then I'd be done.</p><p>So, in no real sound state of mind, I slurringly accepted another bigger pipe without properly thinking it through. I remember holding the pipe, it feeling very hot, then very big...I was going backwards, slightly to the right, in an almost excruciating process that was both crushing and  tearing me out of my physical body. It was not a smooth. I did not 'float out of my body' but rather underwent some sort of an ordeal. I could see my legs on the futon settee that I was sharing with Jimmy, retracting away in front of me as I was dragged further back. I was no longer in my body, that was for sure. It was useless, irrelevant....simply a shell.</p><p>As I had been making this transition, everything in the room transformed in front of my eyes. It was as if someone had arranged for a load of parameters, such as height, size, perpective etc..to be simultaneously randomly tweaked on every object in the room. The result was a bizzarre abstract 'installation' that made absolutely no sense to me whatsoever. In the middle of 'it' was a cave/tear in reality which harboured a spirit being made of lights.It reminded me  slightly of a deep sea angler fish, or a glowing jellyfish. It was just sprawled in this opening, communicating somehow to me that this was the 'spirit realm' and that it, and other entities whose prescence I noticed(or remembered) slightly less, were here all the time. I don't remember any actual words, but there was no mistaking this communique. I had read no salvia reports prior to my taking this, and was amazed to find so many similar experiences when I subsequently checked this site. There was also a feeling of a quandry, or of a question being asked, ie:'are you really sure you're ready for this?'.</p><p>What follows is an account of my perplexed questions to Jimmy as this craziness unfolded:</p><p>>Me:'Am I dead?'</p><p>>Jimmy:'Nah, nah'</p><p>>Me:'Oh.........how do I get back from here?'</p><p>>Jimmy:'You'll be alright in a minute'</p><p>>Me:'but I will come back, won't I?'</p><p>>Jimmy:'Yeah, yeah, you've only just smoked it'</p><p>>Me:'Do people really do this?'(I felt like I'd been tricked, or was the victim of a joke that 'everyone else' was in on)</p><p>>Jimmy:'Yeah, yeah'</p><p>>Me:'But do they do this much?'</p><p>>Jimmy:'Yeah, yeah'</p><p>>Me:'And I'll definately come back?'</p><p>>Jimmy:'Yeah, course'</p><p>I was in some considerable state of shock and panic, stuck out on a limb in some twisted fantasy realm whilst at the same time merging with some kind of intelligent universal life force. Tube-like shapes were being dragged through what was left of 'me'. At one point it was as if I was the tape on a huge reel-to-reel tape recorder, but instead of winding my way round the record/erase heads, they were being pulled laboriously through me instead. This may just be an analogy my mind has thrown up, as I am a musician, but does go some way to describing the indescribable situation I found myself in. </p><p>After a few minutes (it did not 'feel' that long, thank god) I started coming back together again. My brain started recognising objects in the room as they morphed gradually into focus. I was being delivered back into normality at a finite speed, as if I was on a conveyer belt that something else was controlling. I was praying that it would all piece together in the same way it had been before and, miraculously, it did.</p><p>>Me:'I am never doing that ever again'</p><p>>Jimmy:'It's a grin isn't it?'</p><p>>Me:'I don't think I could recommend that to anyone...that's shocking....absolutely shocking.....etc...etc.....'.</p><p>I have since given up smoking tobacco, have realised more than ever the implications of my other drug use, and have felt altogether much more at ease with the world. I may even have become a little bit of a 'salvia evangelist' (to those I think should listen).  Whilst not a pleasant or relaxing experience, I believe it has changed me for the better, and so do all my friends who have tried it. It is a sudden shift into a world of mc esher/salvador dali/dreams/nightmares/synisthasia/astral projection/near death/goblins/spirits/aliens/universal energy/ego obliteration/memories/aaaaaaaagh!!!/what is it?/where am I?/have I missed something?/salvia?/don't even know what you mean by 'salvia' any more......................................................................................................................................</p><p>All I can say is it shook me up, then dusted me down , leaving me all shiny </p><p>and new.</p><p>yours salvscirely, m.c.cadaver</p>"
}
