{
 "title": "Opiates to Overdose",
 "author": "Adam Shoffner",
 "citation": "   Adam Shoffner. \"Opiates to Overdose: experience with Methadone (ID 25713)\". Erowid.org. Jul 30, 2003. erowid.org/exp/25713",
 "substance": "Methadone",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "325 mg",
   "oral",
   "Methadone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 25713",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 30, 2003",
   "Views: 34666",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell it all started at the end of June in 2002.\r\nI had had a really bad stomach ache for about 3 days and decided I should go to the Hospital. Well, I found out that my intestinal tract had telescoped into itself causing the circulation to be cut of which also caused my appendix to become inflamed.\r\nSo I had surgery to correct the problem.  While in the Hospital they had me on Demerol, Darvocette, and Vicodin. Well, after 2 months of nonstop Pain Medications, I had developed a serious tolerance and addiction.\r\nI convinced my Doctor to Start prescribing me Percodan (Oxycodone & Aspirin).\r\nHe would give me 90 tablets every 2 weeks. Eventually I got to the point where I was using Cold Water Extractions on 6 Percodan pills at a time to get High. I wasn't in any pain....But I had convinced my doctor that I was.\r\nWell after 3 Months of Non-Stop Percodan (not including the many Hundreds of Vicodin I received from Emergency Room Doctor Shopping, I realized I had a problem. I had become very violent with my Husband, and all but ignored my friends and family.\r\nSo I made another Doctors appointment so I could discuss the issue with him.  This is how the conversation that Day went:\r\nDoctor: 'How is Your Pain? Is it any better?'\r\nMe: 'Well, I am seriously thinking about going to a Methadone Clinic...'\r\nDoctor (Interrupting Me): 'Well We have Methadone Here, I can write you a prescription for it! Is there anything else you need?'\r\nMe: 'No...I think that covers it.'\r\nMy Doctor didn't take the time to Realize that I was wanting help...\r\nI guess it is my Fault...\r\nSo ANyways, He prescribed me a bottle of 120 Methadone 25mg Tablets.\r\nI had never taken Methadone before nor had I ever met anybody else who had, so I was unaware of the potential dangers of it.\r\nI thought I had hit the motherload!  I figured that this shit was gonna get me high as hell.\r\nWell, My Husband tried to regulate it by giving me one every 6 hours, but that soon pissed me off because I wasn't getting the rush that I usually got when taking Percodan or Vicodin.\r\nI finally fought with my Husband long enough to get him to give me my bottle of pills.  Over a six hour period one night, I took 13 of the tablets.  A couple hours later, I got really tired, so I kissed my hubby goodnight and climbed into bed.\r\nThe next thing I know, I wake up on a stretcher carrying me down the steps soaked in my own urine. I Looked around and saw my husband standing on the porch as they were carrying me to the ambulance. He had this look of absolute horror on his face. Then, He spoke four words that froze my blood -- 'Adam, you over-dosed.'\r\nAfter getting me in the Ambulance, the Paramedics started talking while giving me Oxygen. One of them said 'Another 4 maybe 5 minutes, and he would have been Gone.'\r\nThe other one said 'What did you give him?'\r\n'Narcan', Replied the other Paramedic.\r\nThe Large Dosage of Methadone had depressed my breathing so much that I stopped breathing.\r\nIts Weird...Because I never saw any 'light' or anything...It was all just like a bad dream.\r\nAnyway, that's what happened.\n\n\n"
}
