{
 "title": "A Physical Drunk Feeling",
 "author": "DaCypher",
 "citation": "   DaCypher. \"A Physical Drunk Feeling: experience with Barbiturates - Phenobarbital (ID 25762)\". Erowid.org. Feb 7, 2004. erowid.org/exp/25762",
 "substance": "Barbiturates - Phenobarbital",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "700 mg",
   "oral",
   "Barbiturates - Phenobarbital",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25762",
   "Male",
   " ",
   "Not Given",
   "Feb 7, 2004",
   "40222",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Okay, there is really not much to say about this stuff. I was really expecting more from the barbituarate family. I was at a friends house and they where having about seven or eight people over for a friends birthday. I had brought over a baggie filled with about 30 phenobarbitol pills. I had tried them on previous occasions (judging by my dose, I may have been getting a tollerance (**NOTE: This dose appears to me to be VERY large, and it was not taken all at once.please educate yourself before trying**) I had taken about 14 of them the night before over the course of about 8 hours. I had really not gotten much more than an alcohol-type buzz.</p><p>I felt quite prepared and took about 15 all at once. I started to get the same alchol sensations from it. I mean, it is amazing how much this stuff feels like alcohol. A sober friend drove us to the bar who my newly 21 friend was drinking. We picked him up and went back to the house. About two hours has elapsed since the first eating of pills. I just felt more 'drunk' than I had the previous night. So when we got back, I took about 6 more pills. Within a few minutes, I simply felt more drunk, but much more stumbly. In fact standing up after someone even touched me was very hard. I really do not feel like I lost my mindfulness. It was more of a physical drunk feeling without the mental.</p><p>I remember just about everything about the experience. I remember a couple more people coming over and I tried to go and great them. I had to cling onto the side of the house just to walk down to steps. I then fell down in the driveway. My friends thought I was just amazingly drunk. What was sad is that I was still mindful, it just felt like my body would not cooperate. I ended up breaking a friends speaker (not permanently), several beer bottles, a chair (I think), and myself through the evening. I still have bruises all over me from this experience. One of my friends 'Azzy' (not her real name) told me that she was sitting on the couch with a dog sitting next to her. I tried to go over the back of the couch to sit down next to the dog (bad idea) and ended up falling on what I believe to be her head. She threw me onto the floor. She states that all I said was 'Owww' and then passed out. That is the only part that is kind of blurry.</p><p>Really, I have to say I got nothing interesting at all from this experience. It was just a physical buzz with high coordination loss, basically. No insight, no notta'. I just ended up making an ass out of myself (really, don't do this shit if you have to function with any semblence of coordination). Every time I would fall over on someone, all I would say is 'Barbs', just to remind them of what I was on, because it would seem obvious to probably all spectators that I was just trashed drunk. I will probably not ever do this stuff again, nor do I really recommend it to anyone. Ecspecially due to how physically addicting these drugs are. *DaCypher Out*</p>"
}
