{
 "title": "Hard at Work!",
 "author": "Didgya",
 "citation": "   Didgya. \"Hard at Work!: experience with Poppies - Opium (ID 25816)\". Erowid.org. May 31, 2006. erowid.org/exp/25816",
 "substance": "Poppies - Opium",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Poppies - Opium",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25816",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 31, 2006",
   "Views: 20235",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have read that poppy seeds do not contain enough opium to affect someone, but from my experiences this does not hold true. I work at a very large hotel with a equally large kitchen. Working at night on some equipment (I'm a maintenace man)I spotted the LARGE containers of poppy seeds in the kitchen.  This fueled my research on the web for dosage and possible tea extraction. I took 5 oz. of seeds and covered them with some lemon juice. (all provided by my employment *l*)  </p><p>I heated the mixture just enough so I wouldnt boil it.  I let it set, heated, for an hour. Making sure it didnt evaporate to nothingness, I would add a slight amout of water if the fluid was getting to low.(I find that it is easier to drink if I keep a low amount of juice/water, kind of like a shot of opium tea). Anyway I'm getting ahead of myself.  </p><p>Next I add some mint tea, for stomach happiness,let cool, strain the seeds out with a fine wire filter, leaving a super lemon reaking substance. It's very tart, so I usually have some plain tea waiting to drink after.  I then usually continue with work for about an hour(that seems to be about the waiting period till effects start).  </p><p>EFFECTS: I usually get a very good-numb feeling in my body, my mind starts to wonder and if I'm fairly stationary, I will get the 'nods' in and out of light sleep.  This is where the fun begins! My dreams, which are instant when 'nodding off' are Super realistic and pleasent. I think that is the best part, also I notice that I'm am super social, and loving to my wife when on the tea! It usually last about 4-6 hours, depending if I eat or not. </p><p>Also in the morning, at my job, I can keep working without too much trouble and no one suspects a thing. I usually dont have a bad comedown if I just quit right there and dont take anymore.    </p><p>I have taken too much before and all those lovely ass things I described became hellish like feelings. I have also made a smokeable extract with the same method, except I strain the seeds, resoak, then strain again and at a low heat evaporated the water leaving a smokeable form(sticky as fucking hell) but I get to liking that too much, smoking all day and coming down like a motherfucker.</p>"
}
