{
 "title": "A Lot I Don't Remember",
 "author": "Zop",
 "citation": "   Zop. \"A Lot I Don't Remember: experience with Flunitrazepam & Alcohol (ID 25817)\". Erowid.org. May 3, 2004. erowid.org/exp/25817",
 "substance": "Flunitrazepam & Alcohol",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 mg",
   "insufflated",
   "Pharms - Flunitrazepam",
   "(pill / tablet)",
   "  T+ 1:00",
   "1.0 mg",
   "oral",
   "Pharms - Flunitrazepam",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 25817",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 3, 2004",
   "Views: 21255",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p> I wake up. I'm a bit dizzy. I know am at my friend's place, but I don't remember falling asleep the night previous. In fact, there's a lot of last night I don't remember. No wonder why it's a date rape drug.</p><p> What I do remember of my first experience is this:</p><p> I went with my friend to his friends' place. Everyone was going to take Rohypnol and go to the local world-known theme park until it was closed. They always take alcohol before the pills because it's supposed to create a synergy, and the goal was that you were supposed to feel a good buzz (not too strong a buzz). I snorted a pill (no nasty drip and no burn!) and we went on our way. It felt like a different state of drunkeness, or maybe just more inebriated than I've ever been. Beyond relaxed, similar to xanax or, to a lesser extent, valium. I could still understand people and their intentions all right, but I didn't want to talk. My walking didn't seem too bad, but I wasn't paying attention to that. Normally I would be, but it's as they say, it takes away inhibition.</p><p> I believe I took another one an hour or so later, but I didn't take more alcohol (to keep the synergy, and supposedly keep your memories). Even though I had snorted the first one, it still didn't come on all at once, which seems to be why my memories start to become faded at this point, like a dream. I remember going on a slow, sit-down ride, but my memories end a bit after that point. I think I took a xanax also that night, but I don't think it affected me with a bunch of alcohol and two rohypnols in my system. I do remember spilling a drink on myself, and after we left, getting the driver to pull over so I could throw up... wait! The driver had drank and took some as well! I remember him telling me to watch his driving, but I think I fell asleep... all very dangerous! I was amazed I let that happen.</p><p> There was about five hours before that memory which I knew I was awake and walking around, but do not remember. Never had I experienced this before.</p><p> I look around where I had been sleeping and the objects I had with me remind me of brief memories during the lapse. Later that week, I revisted those friends, and found that they had brought a digital camera and a voice recorder. Pictures of me reminded me of that instant, and I could remember it again. They told me I had fun and stumbled around a lot, but I don't remember. It's like someone else had my fun for me. Perhaps if I didn't take so much on my first time, I would have remembered... but this does 'make' you do things you wouldn't do normally.</p>"
}
