{
 "title": "Comforted by the Cogito",
 "author": "AP&RP",
 "citation": "   AP&RP. \"Comforted by the Cogito: experience with DPT (ID 25882)\". Erowid.org. Aug 6, 2003. erowid.org/exp/25882",
 "substance": "DPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   "  T+ 0:30",
   "30 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25882",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 6, 2003",
   "Views: 12812",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Being my second encounter with this substance on its own, I had little reason to believe the effects would be anything but enjoyable.  My previous experience led me to believe that a dosage resulting in a full effect would play out something like 5-MeO, but without the apprehension.  This was to be the case, but in a way I could have never expected.</p><p>Two mounds of powder weighing 30mg were measured, one to be taken immediately, another for 15-30 minutes later, depending on my state of mind.  The problem with this method is that its difficult to gauge: the first time I took this material I felt little to no effect until the 1.5 hour mark, with a peak soon after, around 2 hours.  The second time, on the other hand, I found little effect at 25mg, even coupled with a light dose of 2-C-T-2.</p><p>And thus, the insufflation began.  DPT tastes terrible, it numbs the nasal passage and waits, dripping into the throat when it is least expected.  Throat lozenges helped, but I found that at every moment I had finished sucking on one and swallowed it, another drip would make its way down the back of my throat.  This occurred for nearly thirty minutes.  Feeling only minimal psychoactivity, I opted to go ahead with the other 30mg.</p><p>It was in the shower, nearly ten minutes later, that I found myself battling to function, challenged by simple tasks and fearing that I would not 'make it'.  By this I mean that it was clear that the DPT was about to take hold in a big way, that drying and getting dressed would have to be completed soon, and that I had only moments before I would need to lay down and get comfortable.  It snuck up on me, to say the least.</p><p>I did these things, found my bed, and curled up under the blankets with the lights off.  Visuals were extreme, perhaps too intense, and I retreated by closing my eyes and bracing myself as the first wave swept over me.  I have tested 5-MeO nearly forty times, with the majority of the events accompanied by some degree of fear, due both to speed and lack of temporal continuity.  I had unwisely concluded that I would never escape this portion of the 'trip', but was proven incorrect on this occasion.  For whatever reason, perhaps the organic feel of the DPT or the peaceful appearance of its direction, I felt little apprehension.  There were a few turbulent moments, but they passed as soon as I realized I had no reason to be uncomfortable, that I had intentionally ingested the substance, and that the territory was very familiar.  I continued on my journey.</p><p>The peak experience was so difficult to verbalize that 45 minutes after it had passed, I was still unable to explain it to RP.  I was a bit frustrated, really, having had an intense moment, near a +4(though not quite, admittedly), but without words to describe it.  What I believed was that I had ventured into a realm where my usual sensual perceptions were no longer applicable, that I was 'seeing' and understanding with a faculty hidden in everyday life.  This world was full of concepts and realizations, ranging from contradictions entailed by my own existence, to unity of consciousness and a reality founded in logic.  Looking back, it was as if I had made true the world of the Rationalist; the state reminded me of Descartes Meditations.  I began with only one truth, that I existed, and I worked my way out, exploring many facets of reality before I finally felt comfortable enough to physically open my eyes and see if I was correct.  This took about a half of an hour.  I was 'still there', luckily, and in time I got out of bed and sought my friends, who had politely let me be.</p><p>The experience was, in all, amazing.  Many of the conclusions I came to were not wholly positive, as it always seems a bit concerning to question one's own existence.  This is the nature of such exploration.  I walked away from my room with many new questions and even more new ideas, all of which seemed to somehow confirm previous ideas derived from similar states of mind.  An advancement, to say the least.</p>"
}
