{
 "title": "Sedated",
 "author": "Bree",
 "citation": "   Bree. \"Sedated: experience with Nutmeg (ID 25904)\". Erowid.org. Feb 29, 2008. erowid.org/exp/25904",
 "substance": "Nutmeg",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "13 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25904",
   "Male",
   " ",
   "Not Given",
   "Feb 29, 2008",
   "16315",
   " "
  ]
 ],
 "report": "<p>Since my friends and I had previously exhausted my city of all its Morning Glory seeds, I wanted to try a different legal drug.  Having read up on Nutmeg some months before, I made the decision to eat some spice.</p><p>I am not an experience drug user by any means.  In fact, the only drugs I have tried are Marijuana and Morning Glory seeds.  I have never experienced any convincing hallucinations, and that was what I was looking for in Nutmeg.  As of today, Nutmeg is definitely the strongest drug I have taken.</p><p>(T-1:00)  I ran out to the local grocery store and bought a jar of 12 nuts.  Net weight is 63 grams.  </p><p>(T-0:15)  From the research I did the night before, I decided to eat the 2 largest nuts in the jar.  Should be somewhere between 11-15 grams.</p><p>(T=0:00)  After grinding up only two nuts, I was amazed at how much spice I had to eat.  Since I knew it would be impossible to eat the Nutmeg straight, I fetched some ice cream and some water.  By plugging my nose and using the ice cream to mask the Nutmegs texture, I got it all down without any difficulties.  Now I wait.</p><p>(T+1:00)  I went to my friends house where I met K and L.  K was hesitant about trying any Nutmeg because most experience reports said that Nutmeg was not worth it.  L had no knowledge about Nutmeg.  They both ended up grinding up 2 nuts and then mixed the shavings with tapioca.  I told them that plugging their noses would mask the taste, but it didnt help.  They both gave up after ingesting no more than 2 grams of Nutmeg each.</p><p>(T+1:30)  K and L decided to smoke some pot.  I decided against smoking because I wanted to feel the Nutmegs effects alone.  If Im experimenting with a new drug, I dont want to take two drugs and mix up the effects.</p><p>(T+2:30)  Nothing more than a contact high.</p><p>(T+4:30)  I think Im feeling something.  Could be placebo. My other friend J arrives.  </p><p>(T+5:00)  Im feeling stoned now.  I have cottonmouth.  I was so used to only getting cottonmouth after smoking, that I thought I had smoked.  After remembering that I didnt smoke at all, I realized it must be the Nutmeg giving me cottonmouth.  This was reassuring because I now knew it wasnt a placebo high.</p><p>(T+6:00)  Definitely off baseline.  Im feeling very stoned.  I can make myself see minor hallucinations in the wall or carpet.  My memory is shot.  Its very similar to a Marijuana high.  No nausea.  At this point Im pretty comfortable with myself. </p><p>(T+7:00)  Feeling sedated.  I felt like I was on a tranquilizer.  I just wanted to sit down and stare off into space.  I have never been drunk before, but I gather this is what its like.</p><p>(T+7:45)  K, L, and J wanted to smoke some more pot.  At this point, I feel really drunk and sluggish.  I tried to take a few hits of the blunt they were smoking but it was unusually difficult.  I couldnt distinguish the effects of the Cannabis and the effects of the Nutmeg.  I felt the need to separate from my friends and take a walk.  I ended up in my car and waited until my friends were done smoking to reunite with them.</p><p>(T+11:30)  Its hard to remember what I did after we smoked.  I never felt particularly uncomfortable.  I never felt really good, either. </p><p>(T+14:00)  Went to bed.  Still intoxicated.</p><p>(T+20:00)  I had to wake up to go to the dentist.  I was amazed at how high I still was.  Sitting down and watching my brother play video games was very enjoyable.</p><p>(T+26:00)  I forget what I did after my dentist appointment.  Nutmeg kills my memory more than pot does.  I was beginning to come down.  I went to my friend, Ps, house.  He commented that I looked drowsy as hell.  He didnt know that I had previously done Nutmeg.</p><p>(T+28:00)  I feel normal again.</p><p>Nutmeg was too long lasting for my taste.  It was also too sedating.</p><p>I now understand why its still legal.  I dont see how anybody could abuse this drug.  I might try it again.  It really takes a lot out of me.  Luckily, I never felt nausea of any kind.  Its a pleasant, sedated high with minor hallucinations.  The whole experience seemed mildly similar to Marijuana.  Be sure to be patient and not take too much.  It took me seven hours to peak.</p>"
}
