{
 "title": "Illusion of Perfection",
 "author": "Nicole",
 "citation": "   Nicole. \"Illusion of Perfection: experience with Cocaine (ID 2594)\". Erowid.org. Aug 19, 2001. erowid.org/exp/2594",
 "substance": "Cocaine",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 2594",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 19, 2001",
   "Views: 14914",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nWhen I first began doing cocaine, it made the world become what I always felt it should be. It made me feel like I was playing a role I always felt I couldn't quite grasp. Everything I thought and felt on the inside became a reality on the outside. I looked better, I felt like superwoman, I was better than my sober best could ever be, words flowed, I was ON all the time. I figured that life wasn't worth living without the drug, because how could it do me wrong when it was doing me so much good. \r\nI ignored warnings from my friends about the damage it would cause to body and brain, and that I would suffer in my life from all directions if I kept abusing the drug. But I was having an absolute blast, I didn't care if I was spending all my money, I didn't care that every night when I went home my nose would start aching ferociously, or that I would lie in bed for hours clenching my teeth, and cursing about everything around me. \r\nSoon the come down from cocaine became too powerful for me to endure, so I started buying sleeping pills, and creams for my nose, and pain killers, and then I stole tons of the highest dose of valium I could find from a friend, which would knock me out literally for 24 hours.   \r\nA few months into my addiction I could not take a step out of bed without having one or two lines...sometimes I would have a huge line in hopes to wake up and I would fall right back asleep. I stole things from my family and pawned them to get money for cocaine. I took a job as an exotic dancer to support my habit and quickly my life became a horrible cycle of working to support my habit, and using in order to go to work. I started becoming bitchy and petty, and so incredibly self absorbed, everyone around me kept telling me that I was behaving like a crazy loser. \r\nOne time I ended up getting caught in a strip club with no cocaine and no money, so I prostituted myself for 2 grams, and 200 hundred dollars, and I was so mad at myself when I went home that I snorted the two grams in three hours in the morning by myself. My life became so dark, that eventually it hit me that either I stop and fix my life, or watch myself slowly dwindle away, or create a less painful end, and kill myself immediately. \r\nObviously I chose the first option. It was not easy...I could not function for a month and a half without cocaine, and I had to fight like hell not to fall into the pattern again, but once you come out of the drug induced haze you start realizing that drugs suck, and you see what an ignorant fool cocaine reduces you to, all while making you think that you are in control. My advice to anybody who touches that drug...It will take away from you as a person, just as much as it seems to give to you, if not more. It is a beautiful apple filled with worms, you will gain nothing from using it...stay away -- we all have enough problems in our lives, Cocaine is bigger than all of yours put together.\n\n\n"
}
