{
 "title": "Body Coordination Lost",
 "author": "Mels",
 "citation": "   Mels. \"Body Coordination Lost: experience with Clonazepam (Klonopin) (ID 25980)\". Erowid.org. Feb 12, 2004. erowid.org/exp/25980",
 "substance": "Clonazepam (Klonopin)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "6.0 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 25980",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 12, 2004",
   "Views: 74797",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have two stories, one of recent recreational use that turned out well, and one past story with a not so happy ending.</p><p>#1 To start this out -- I'm actually prescribed this stuff. I'm bad at taking it on a regular basis and am supposed to use it for panic attacks and what not (I do and it really helps). I also use it recreationally. My partner and I took about 6g of Clonazepam (though you can adjust it for your weight or as desired). It usually takes a while to kick in (like a half hour) but has a very long half life (you can feel it still the next day -- this can be good or bad). Its much like Valium, and in fact is a member of the same class of drugs as Valium.</p><p>Back to the story... My partner and I had just gotten done with a busy day of packing and moving and were ready to relax. We are currently in the phase where drinking doesn't appeal much to us, so we decided to take a few of the Klonopin. Once it kicks in, it is similar to a drunken stupor-- with a clear mind. My body begins to feel a little rubbery and very very relaxed. Makes me feel happy, actually.  I can either get stuck to my chair -- or go for a very fun walk. My eyes feel as though they are moving twice the speed of my body. Bodily coordination is not the best (staggering and such). </p><p>My body feels heavy, and if I bend over too quickly everything spins like mad. I find it a great way to have a fun evening. We drank a lot of grapefruit juice while doing it. I've heard (and this may be a rumor) that it is supposed to increase the effects of benzos (among other pharmies). If anyone knows otherwise, I'd be happy to listen. </p><p>Klonopin doesn't hold a candle to Valium. I myself do not like Valium because I feel messed up for days after I take it. It also makes me incredibly sleepy. I like the more subtle, less potent stuff.</p><p>#2 In a drunken accident a few years back, I took a few too many Klonopin (10-15mg tabs I think-- not sure) along with some other meds. I ended up with an ambulance ride for 4 blocks with 5 attempts to get an IV in my arm (no success). I ended up drinking activated charcoal (YUCK) and managed to hallucinate due to the tegretol (the other medication that was too high in my blood stream). Needless to say, I couldn't stand up without help for two days because my legs would buckle beneath me. </p><p>With this in mind, make your decision to do any drug wisely. Don't be an asshole and test the limit like I did. Use your drugs responsibly and know how much is too much.</p>"
}
