{
 "title": "Diving in the Gas of Laughter",
 "author": "Dysfunkt (Gringo V.)",
 "citation": "   Dysfunkt (Gringo V.). \"Diving in the Gas of Laughter: experience with Nitrous Oxide (ID 2600)\". Erowid.org. Oct 16, 2001. erowid.org/exp/2600",
 "substance": "Nitrous Oxide",
 "bodyweight": "165 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2600",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 16, 2001",
   "Views: 13836",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI've been a fan of nitrous hits for a number of years, and over time have accumulated a relatively thorough knowledge of the drug through experience, experiment, and trial & error.  Most individuals that avoid nitrous adopt that position due to the mentality that all 'huffing' is negative, and will inevitably cause damage to your brain.  It should be made clear, first of all, that nitrous, if used correctly (in a dentist's office, under careful supervision, for instance), is completely healthy and carries with it no negative aspects.  It's obvious that the proffesionalism of a dentist cannot be emulated on the streets, but a basic understanding of the drug can mean the difference between a bad experience and a good one.\r\nIn most cases, N2O is ingested in its pure form, 'huffed' in and out of a balloon.  The negative aspect of this should be readily apparent- while breathing it, you starve your body of oxygen.  This is by far the most overwhelmingly damaging factor: I have repeatedly seen experimenters' lips and face go completely blue from lack of it.  This is essentially suffocation, and by no means is the N2O at fault.  If this point alone is made sufficiently clear, N2O can be considered completely safe for the recreational user.\r\nThe most straightforward, simple method of bypassing this dangerous factor is phun in itself.  By breathing in deep, continuous heaves of air before putting anything to your lips, until you feel light-headed, you are flooding your system with oxygen, and your blood will be enriched to the point where your body can continue on unscathed without any more O2 (oxygen) for a couple of minutes.  This has been practiced for millenia by humanity in a number of different occupations: skin divers do it for a couple of minutes before diving, and can hold their breath in a deep (90 foot) dive for five and six minutes.\r\nAnother point to make is to restrain yourself when breathing in and out into the balloon: doing it for too long will always forfeit your O2 supply and subject your brain to a lack of it.  Personally, breathing the laughing gas until I feel the complete effects of it (metallic echoing, absolute euphoria) does the job.  Some people prefer to continue to the point of unconsiousness, but it seems evident that your oxygen supply would dwindle after that amount of time.\r\nAs always, with every drug, USE RESTRAINT, and I by no means take responsibility for the words in this memo: it is only what I have learned, and I hope it benefits somebody out there. \r\nWord, psychonauts.  -D\n\n\n"
}
