{
 "title": "Medicine Cabinet Binge",
 "author": "Neurotichaosis",
 "citation": "   Neurotichaosis. \"Medicine Cabinet Binge: experience with Methylphenidate (Ritalin) (ID 26022)\". Erowid.org. Jun 7, 2006. erowid.org/exp/26022",
 "substance": "Methylphenidate (Ritalin)",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   "  T+ 0:00",
   "  repeated",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   "  T+ 13:00",
   "40 mg",
   "oral",
   "Pharms - Temazepam",
   "(pill / tablet)",
   "  T+ 14:30",
   "20 mg",
   "oral",
   "Pharms - Temazepam",
   "(pill / tablet)",
   "  T+ 14:30",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 30:00",
   "180 mg",
   "oral",
   "Codeine",
   "(pill / tablet)",
   "  T+ 30:00",
   "3.0 g",
   "oral",
   "Acetaminophen",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26022",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 7, 2006",
   "Views: 44013",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid note: this person took 3 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]</p><p>Being home from boarding school due to severe back pain and having obtained some light pharms at home, it has been a vicious cycle of trying to cure the side affects from each substance taken even though it has been somewhat enjoyable. </p><p>Medical Psychological history: </p><p>I have been diagnosed with clinical depression and anxiety for almost 2 years. I am also suspected of having ADD and when off SSRI's I have obsessive compulsive behaviour. I was on Luvox 150mg last year for 9 months and went off it, and I was going alright mentally (besides from one aspect obsessive compulsive behaviour stopping me from calling people because I'd kept thinking I had dialed the wrong number before they had answered and hanging up which I would repeat many times until they rang me and abused me for ringing and hanging up, thus interfering with my social life), however when I moved to my boarding school which is not the right environment for me I lapsed back into depression badly (as well as a minor breakdown) which resulted in me going on Effexor SR 150mg which seems to be doing the trick. </p><p>I have also strangely grown stimulant (including caffine) sensitive due to my over active nervous system in the past year or so, which is odd as I was a 3 cups of coffee a day person from year 5 until year 9.</p><p>Drug Usage History: </p><p>Over the past few years I have smoked a large amount of pot, at one stage 3 or 4 times a week during school terms and usually binging in holidays. I also tried HBRW seeds once, mushrooms once and salvia divinorum a few times all for spiritual exploration and not to get 'fucked up'. I have tried DXM a couple of times, though never above 2nd plateau. I have tried speed a few times which I enjoy but wouldn't make a habit of taking often. I tried codeine several times but never achieved any euphoria even at dosages up to 250mg whilst off anti-depressants. Lastly, I have tried Valium a few times, temazepam many times (and had one minor OD), zolpidem many times and of course I am no stranger to drinking. I cannot be bothered racking my brain for anything else but I think I covered everything.</p><p>I had used ritalin previously for recreational purposes several times but not for a about a year or so I decided to test if it still had the magic that I remembered it for and to compare it to speed which I had experimented with since. I have temazepam for sleeping problems as zolpidem caused bad reactions with me, involving waking up an hour after falling asleep and vomiting. I'll also add that the temazepam is seldom used by me for it's designed purpose. And now to the experiance.</p><p>It began Sunday, roughly 10:00am:</p><p>Upon arriving home (and throwing my back out on the way, which wasn't suprising as back problems are something that I am very used to), showering and eating breakfast, I opened my box of ritalin that my mother gave to me and proceeded to swallow 10mg and snort 20mg. The smell\taste brought back memories, followed by the jittery and euphoric feeling, I used to think that ritalin would be really similar to speed but it is much different. </p><p>I snorted another one and sat at the computer making posts on a band forum that I contribute much to, talking on MSN messenger and listening to some black metal followed by some trip-hop. I sat there for hours drinking fluids constantly because of the ritalin dry mouth. I tried to force down a bit of lunch with little success and walked over to a friends house for a few while.</p><p>7:30pm: </p><p>After eating some dinner, I snorted 20mg and found my place back in front of the computer chatting and listening to music. I soon went upstairs and did 20mg more. I felt the euphoric and happy jitteryness that was expected and realised that one of the main differences between ritalin and speed was the fact that it creates a calm and relaxed feeling although I can't stay still. </p><p>I did another 20mg around 9:00pm as I was starting to feel comedownish even though I knew sleeping would be very difficult. I chatted more and listened to more music (would of played some guitar but I keep them at school during the term). </p><p>11:00pm: </p><p>I was coming down and talking on the phone to a friend, so I took 40mg of temazepam and sat on the deck out the back smoking cigarettes and talking. I ended up feeling really good and scrambled from the temazepam which usually doesn't really do anything to me without alcohol or weed and when my friend had to go I went into the band chatroom and talked shit. I had another 20mg temazepam gelcap about 12:30am with a few kaluha and milks and retired about 1:00am. I woke up several times during the night.</p><p>Monday (today):</p><p>I woke up about 6:30am unable to go back to sleep. I felt dead all morning and afternoon, with rings under my eyes and overall looking and feeling like shit. I had a chiropractor appointment around noon, but spent most of the day lying on the lounge watching Black Adder DVD's. </p><p>I took 180mg of Codeine to try and help my back as I got a box of Panadine Forte about 4:00pm in the afternoon (500mg Paracetamol with 30mg of Codiene) which did nothing except make me a bit itchy and nauseaus when trying to eat, it didn't even help my back. I layed around a bit more until 8:00pm when I felt so dead that I decided to snort 30mg more of ritalin which jittered me up again.</p><p>Now, 9:50pm: I am still feeling rather jittery but with the tired comedown feeling that ritalin gives me after 2 hours or so, like I am full of energy but my body doesn't want to use it.</p>"
}
