{
 "title": "Several Overlooked Aspects",
 "author": "T. Wolf",
 "citation": "   T. Wolf. \"Several Overlooked Aspects: experience with Pharms - Zolpidem (ID 26034)\". Erowid.org. Aug 13, 2003. erowid.org/exp/26034",
 "substance": "Pharms - Zolpidem",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "26034",
   "Male",
   " ",
   "Not Given",
   "Aug 13, 2003",
   "Views: 28943",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hello folks.</p><p>For several years now, I have been taking Ambien for a sleep disorder often referred to as 'I can't sleep at night'. The medication works like a charm.  I wanted to point out several aspects of this drug which are often unknown or overlooked:</p><p>#1.  The information given with the prescription bottle often</p><p>     makes a statement to take as directed on an EMPTY STOMACH.</p><p>     Over the course of two years taking this medication I can</p><p>     tell you -- DO NOT DISREGARD THIS INFORMATION.</p><p>     On an empty stomach, a 10 mg dose for ~ 170lbs individual</p><p>     will take ~ 12 minutes to begin working and peak sedative </p><p>     effect ~ 37 minutes.  On a full stomach, the medication is</p><p>     approximately 1/2 as effective and takes up to 2 hours to  </p><p>     peak.  I do not know why food has such an effect, however food</p><p>     definitely diminishes the effect, and foods high in fat are   </p><p>     the most diminishing.</p><p>#2.  Ambien (Zolpidem) is a Schedule IV controlled substance.</p><p>     DO NOT let any M.D. attempt to convince you that this drug</p><p>     rates up there with OC's or Dilaudid in terms of addiction </p><p>     and abuse potential.  Addiction and abuse is when an</p><p>     individual takes a drug for reasons other than the medication's</p><p>     intended purpose.  If you take the PRESCRIBED DOSE of Ambien   </p><p>     every night, as directed, and sleep soundly, wake refeshed --</p><p>     this is NOT addiction, even if you need to take it to sleep.</p><p>#3.  Currently, medical professionals are finding that an individual</p><p>     can stay on Ambien much longer than originally thought without</p><p>     adverse effects, as long as it is taken as prescribed.</p><p>Bottom Line:</p><p>Ambien is an excellent drug when taken as prescribed and directed.</p><p>If you cannot sleep, respectfully demand this drug from your physician. The ONLY reasons your physician should deny you this medication is due to potential health issues you already have or potential reactions with the drug. Denying you this medication due to potential 'drug additions fears' he/she may have is unethical and against the Physician's Code of Ethics. If your physician give you any negative comments, then remind him/her of their Code of Conduct for Medical Treament and maybe even toss around the words 'lawsuit' or 'malpractice'. NEVER THREATEN your physician, however, let him or her know that you have done the proper research on the drug.</p>"
}
