{
 "title": "Welcome To Warmth And Contentment",
 "author": "Stonehenge",
 "citation": "   Stonehenge. \"Welcome To Warmth And Contentment: experience with Nalbuphine (Nubain) (ID 26046)\". Erowid.org. Feb 11, 2004. erowid.org/exp/26046",
 "substance": "Nalbuphine (Nubain)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "IV",
   "Pharms - Nalbuphine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26046",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 11, 2004",
   "Views: 14218",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend 'Josh' has been recently reading the book 'Trainspotting' as well as watching the movie quite often. This, of course, led to him developing a desire to try heroin. </p><p>Around here (as far as I know) there is no heroin to be had. Josh has tried dilaudid, demerol, and oxycodone IV before, but those substances are also very hard to come by. But then he came across a source to obtain pharmaceuticals such as valium, xanax, ativan, all that good stuff of the Internet. He saw one of the items on the list was Nubain.</p><p>Nubain is an opiate combined with an opiate antagonist. Its dosage is equivalent to that of morphine, but after X amount of nubain, the antagonist kicks in to prevent 'abuse' I suppose.</p><p>Well, he ordered some ampules of it and it came in not long ago. He tried it out and said it was OK. I figured 'what the hell' so I decided to try some nubain. The one time I shot oxycodone, it left a bruise in my arm and I didn't want to repeat that at all, so we searched and searched and found a suitable vein in my foot. Once we hit it, we pulled back to see the blood. Then he injected the 20 milligrams of nubain into my body.</p><p>A few moments later I began to feel warm. I experienced that same 'head churning' sensation and then my forehead immediately began to sweat. Josh told me he saw my pupils get tiny extremely quickly. I then just laid back in my chair and let out a sigh. It was working. </p><p>I would say it took about an hour, starting at injection time to come out of the complete euphoria and content state I was in. I'm sure everyone has heard the stories about how opiates feel when injected. I was very warm and it just felt pretty good. After that began to wear off, I started to feel a little queasy and I sort of began to shake a little, which was probably the antagonist fighting it off, making me go through a mini-withdrawal. It is 12:30 right now as of the writing, injection time was about 8:00. I still feel that content opiate sensation. We have maybe two ampules left and I might do another some other day, but I'm not a fan of the needle.</p><p>Note: Due to the antagonist in the nubain, you can't just shoot it and shoot it and get off again and again. I would wait for it to fully wear off. Just be careful and read everything you can about it before considering trying it. Knowledge is the key.</p>"
}
