{
 "title": "Natural Born Killers",
 "author": "Kim",
 "citation": "   Kim. \"Natural Born Killers: experience with Carisoprodol (Soma) & Alcohol (ID 26050)\". Erowid.org. Mar 18, 2010. erowid.org/exp/26050",
 "substance": "Carisoprodol (Soma) & Alcohol",
 "bodyweight": "98 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "700 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(ground / crushed)",
   "  T+ 0:20",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 1:30",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26050",
   "Female",
   " ",
   "Not Given",
   "Mar 18, 2010",
   "12298",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm fairly young and I recently started experimenting with pills. I got them through a friend who was going to sell them for some money, but instead gave them to me for free a few days later. There were ten vicodins and ten somas. I was timid about it at first and did some research online, I was careful at first, starting off with one tablet of each to see what their effects were on me. I built a minor tolerance, taking three somas like this over a span of weeks.</p><p>On the day I upped the dosage, I had realized I was going to be fine after having read all of the articles and I was curious, having grown bored with the experiance one tablet was giving me which was close to nothing when it came to an interesting experiance. I was prefectly calm and seeking what could be a good time in the boring early hours of the morning as I went downstairs and mixed my normal milkshake in the blender, adding two 350mg soma tablets in. I blended it, poured it and took a sip of it. It tasted horrible and very bitter as I could taste the tablets; the taste lingered in my mouth and I had to force myself to finish it off. I went back upstairs and sat before my webcam, finishing my soma shake around 2:00 in the morning.</p><p>I had barely typed a message saying 'I can't feel anything yet' when it suddenly hit me, less than five minutes after I had finished the concoction at 2:05. I hadn't eaten all day and expected it to hit quickly, but maybe not that quickly. I shook a little at first as the effects sank in.</p><p>2:10:</p><p>By this time, I was really, really up there on my soma high. I had the urge to headbang and move around constantly. Everything swayed slightly, as though I was drunk, yet it was peaceful. I was happy, laughing at rather odd things and I felt as though this weight had been lifted off of my shoulders.</p><p>2:20:</p><p>I threw a little wine into the mix, not too much, but enough so the feeling grew slightly. I began to do the soma shuffle, wandering around in circles and swaying.. I eventually gave up on this, seeing as how I kept almost falling over at every corner I rounded.</p><p>2:50:</p><p>Suddenly, I wasn't enjoying it as much.. I was dizzy from all of the headbanging and odd movements I had been making and I felt almost, well, sick to my stomach. I fell off of my chair a few times as I swayed there back and form. Yet, my mind was clear, I was pleasant and I wanted nothing more than to lay there and stare at the ceiling which somehow held this beauty of it's own.</p><p>3:30:</p><p>I was coming down, and as I did, this wonderful feeling of well-being washed over me, making me feel warm and calm.. Nothing could be better so I went down and drank some more wine, yet to my dismay I couldn't quite walk properly yet. I eventually found my way upstairs once again and sat at my computer, talking to a few people.</p><p>3:40:</p><p>Giving up, I walked to my bed and, walking into a few walls on the way, I fell into my bed and flipped on Natural Born Killers..</p><p>4:00:</p><p>I was crashing even more, it was nearly over. I felt tired, yet totally relaxed. Those first few minutes of a slight high on somas while watching Natural Born Killers made it take on a whole new meaning to me.. I was now at a point where my mind was free, it was roaming and contemplating what I was watching, looking at all meanings.. It was as though I had reached the philisophical stage, though I was still incomprehensible as my friend put it who I had called at this point. I was going on and on about it and I was so at ease.</p><p>4:34 (where I am now):</p><p>I'm still calm and it's a total sense of well being, which is quickly being over come by being tired. All in all, I truely liked this experiance, it's amazing how hypered up I felt at the start, and then I had the wonderful sensation I landed at when I began to crash where all is wonderful with life, there are no worries and all I want to do is lay back and watch the world pass me by.</p>"
}
