{
 "title": "Sliding Puzzle Pieces",
 "author": "moonchilde",
 "citation": "   moonchilde. \"Sliding Puzzle Pieces: experience with Salvia divinorum (ID 26087)\". Erowid.org. Aug 13, 2003. erowid.org/exp/26087",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "0.125 g",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26087",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 13, 2003",
   "Views: 8129",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was to be my first experiece with Salvia.</p><p>I woke up at 8:30am.  Ate a light breakfast about 1/2 cup yogurt.  Surfed the web a little.  Practiced yoga 9:45 - 10:45, meditated for  maybe 15 minutes afterward.  Quick look at Salvia info (again), both trip reports as well as the Salvia FAQ's and User's Guide, etc.  Turned off the ringers on the phones and quieted the answering machine.</p><p>Lit an incense charcoal.  I grind frankincense and myrrh for my ritual incense.  I measured out several doses of Salvia, placed one in the pipe, blessed it by running it through the smoke of the incense, and left it in the arms of my Buddha.</p><p>I carried the charcoal and incense to the room I would be partaking in.  There I played my singing bowl, and sang made-up songs about my intention of partaking in Salvia and fed the charcoal.  The song were basically about mending my heart and soul as well as about some pernicious memes that I think try to waylay that.</p><p>When I felt ready, I smoked the Salvia.  I was concentrating on the mechanics of smoking and not the ritual intent I was trying to build.  This turned out to be a slight error.</p><p>I took in the first breath, held it for maybe 20 seconds, let it out.  I was already beginning to feel a tingling sensation and slight stability loss.  I took in a second breath, which cleared the pipe, and I felt I had to lay back.</p><p>As I was doing so, I 'heard' a woman's voice, clear, strong, not to young or old.  She told me that I had lost my intent (or something similar to that) and had to be punished.  </p><p>I went, Hmmm, that's not a very good thing to tell myself, and I tried to put punishment out of my mind.</p><p>Luckily, I did not have long to wait until I was immersed.  I felt myself greasily and wetly melting into the universe, most especially the floor, since I was in physical contact with that.  I felt echos of previous bad trips, garbage in alley ways, slime, uselessness, fakery, trickery, wrongness, being taken advantage of, being a hick, being unworthy...</p><p>I was aware of other people 'around' me.  I knew that I had been there before, and I didn't particularly like it.  I told myself that I was doing this to myself.  They agreed with me. :) </p><p>I then remembered something that I had learned not so long ago.  Let go.  Float down stream.  :)  Really, it seems easy to talk about but pretty hard to just let an experience happen.</p><p>They said that since I was there, they would do some work.  I perceived that they were manipulating the 'me-verse' kind of like a three dimensional version of the sliding puzzle pieces.  I wondered why I was sliding in chunks.  I felt myself smear in different directions.  I lost track of my body for short periods of time.  They seemed disapointed when I noticed my breathing, and I felt that if I could have let go more, I could have gone deeper, my physical world smeared away.</p><p>t + 5 minutes and most of the effects were gone.</p><p>I learned that I have an aversion to the natural world in some sense, in that I don't like squishy, gooey, slimey type things.  I prefer hard or fuzzy or straight or curvy, soft but firm type things.  </p><p>I learned that at least with Salvia, the room or area should be uniformly (or gradually) lit.  I had read that a semi-dark room was a good idea.  The room that I was in has double sliding doors.  I closed them most of the way, but left them open enough for the cats, who would have pawed at the doors if I had closed them fully.  So the room was semi-dark with a strip of light from the rest of the house penetrating.</p><p>This goes back to a sensation I felt earlier - that I was sliding in chunks.  After I sat and thought about the experience, it occured to me that the chunk size mirrored the size of the opening in the doors.</p><p>Finally, I learned that 1/8g (smoked) is actually the border between L and V for me, albeit the experience was rather brief.</p>"
}
