{
 "title": "What I Would Call The Shittiest Experience Ever",
 "author": "Infra Red",
 "citation": "   Infra Red. \"What I Would Call The Shittiest Experience Ever: experience with Amphetamines (Adderall) (ID 26093)\". Erowid.org. Aug 16, 2006. erowid.org/exp/26093",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 0:20",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 1:00",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 2:00",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 26093",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2006",
   "Views: 27884",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started at my friends house. My experience in the use of drugs was not varied. I drank heavily at the time, and smoked pot at least once a day. But at this time, that was all Id ever done. Id never taken any more then two pills of aspirin, in fear of what it would do to me, so you can imagine that I wasnt thinking when we found a full bottle of 10 mg pills of Adderall. Leah had experimented with ecstasy, shrooms, and an assortment of pills, so she knew a little more on related issues. We were both 'grounded' by our parents but allowed to hang out together. We told them we were going to go look for jobs. Which wasnt a complete lie, we did go into a few places. Getting drunk and going to Meijer or Wal-Mart was always fun, so why not with this.</p><p>In the parking lot at Wal-Mart, we each took three pills. I remember asking Leah, really three, is that going to be okay? She said it wasnt much at all. We each took three orally and walked around Wal-Mart. Twenty minutes later, we 'felt nothing yet' so in the parking lot at Kohls, we took three more each. Once inside, we walked between racks of clothes, laughing hysterically. Falling to the ground laughing so hard, to the point of almost pissing myself, but I cant remember what was so funny. All I knew was I had NEVER felt this good. It was warm and extremely enjoyable.</p><p>We left Kohls, and stared at the bottle in the parking lot at Meijer. We both wanted to take more, so we did. Again, three pills each. I felt happy, like nothing could go wrong. I felt invincible and I stole things just because my brain was telling me that it was okay and that I could, and get away with it. Walking between each aisle was like an adventure into a different world. I didnt get so much of the visuals that I have heard of with Adderall but the euphoria at this time was intensely strong, and I couldnt help but love it. I remember LOVING it. More than anything ever before.</p><p>It mostly made me very energized. I kept wanting to 'just walk and enjoy it.' We went back to Leahs house, and I am still not sure how she got us to her house. In the car I felt like we were floating almost, but I could feel this trip coming to an end soon. I was fairly wrong.</p><p>Without even thinking, while sitting in Leahs room, I took three more pills. I got out three for her and she was like 'I dunno if I want to' followed by the words 'I am really fucked up.' It was hilarious to me. We laughed until I was the one telling her that it was going to be okay, and that three more wouldnt really do much else. So she took three more. We went into her basement, which was shortly followed by the worst thing that I have ever had to experience in my whole entire life.</p><p>I am finding it hard to write this. I know no other way to describe this night but as terrifying. The extreme euphoric feeling I had for so long, turned into a horrible stomach pain. I began pacing around her house, if I stopped walking, I felt as if I would die. We went for I think five walks that night around the block, but I faintly remember them. All I remember is the shaking. I was scared, I didnt know what was going on, or what was still yet to come. The whole experience had been such a new experience, that anything was possible.</p><p>The pains in my stomach got much, much worse. I felt like I was starving. I could feel my heart racing, faster than after any long run or sprints. My feet and hands slowly were becoming numb, like the blood was being cut off to them. When I tried to eat, nothing would go down. I literally could not swallow anything, which resulted in a panic to me. I thought my throat would swell so much, that I would suffocate. After four hours of this hard coming down, the side effects only got worse.</p><p>It was probably around 2:00 am and I remember painting my finger nails, and then taking it off with nail polish remover, while Leah sat dazed, staring blankly at the TV. Why wasnt she feeling this too? Or was she? Was I just paranoid? I tried to tell myself all this was in my head and that really I was fine, but I wasnt. My breathing got heavy, heart still racing, pains getting worse. I just kept drinking water, trying to cure the most unbelievable cotton mouth Id ever had, even after long smoke sessions I had never had that dry mouth feeling so bad.</p><p>Peeing at a rate of about every half hour, I began feeling very nervous. More then before. The tingling sensation down my spinal cord was sickly chilling. I thought maybe if I puked. I could get whatever I had taken out of my system. Of course, without any food in my stomach, throwing up was near impossible. But it was at this time, when I was spitting into that toilet that I realised my spit was not normal. I spit in my hand to see if I was just hallucinating. My spit wasnt spit, it was like a foam. And it was yellow. The panicky feeling I had been having all night was kicking in, more intense then ever. I began hyperventilating.</p><p>Leah tried to calm me and down and she insisted that I was fine, but I felt everything except for fine. Around 6:00 am, we got in the car and drove to Meijer. I felt that urge to walk. Once in the store, I was dizzy. I felt sick and the pains in my stomach made me think of ways I could kill myself. Thats how extreme it had gotten. I was suffering and I no longer wanted to. I felt I was going to die anyways. I told Leah after being at Meijer that I wanted to go home, but that I wanted her to drop me off a mile away from my house.</p><p>I remember stumbling home. My parents were upstairs sleeping. I was still spitting foam and I was still feeling those pains. I got a big glass of water and made some soup. I took the soup and attempted to eat it on the picnic table in my back yard. It wasnt helping and I was really scared. I thought about going and telling my parents what I had done, but without thinking, I grabbed my cup of water and began walking back to Leahs house. I felt without water I would die. Like water was the only thing keeping me alive.</p><p>There is this path down the street from her house, and I could see that her mom was still there. So I waited for her to go to work. I laid there, in the middle of her neighborhood. That was when I ran out of water. I walked around and found a sprinkler in someones back yard, and I filled my cup up, I felt I had to. Laying back in the walkway (path) a man came up to me and asked if I was okay, and what I was doing, if I needed help. I told him I was waiting for a friend and he strangely looked at me then walked away.</p><p>When I saw her mom leave, I ran to Leahs house and I convinced her that I was dying. We got in her car, she was going to take me to the hospital. We waited a minute and realised we could get into a lot of trouble. And she told me I would be fine, but really I didnt think so. She brought me into her house and made me more soup. She sat there and tried to calm me down. Gradually I was no longer experiencing the stomach pains, or the hard time breathing. I felt like my throat was opening back up and that I was gonna be okay. And eventually I was.</p><p>I didnt sleep for 72 hours, including the whole experience. And the morning after my horrific come down I puked at least a dozen times.</p><p>Looking back now, after discussing it with people I trust, they scold me for doing that to myself. Knowing more about the wonderful world of drugs, they informed me that I was pretty fucking close to dying that night. Mostly that I should be dead. I asked Leah why none of what I experienced had happened to her and she said it did. She said she was so scared and thought her life was ending also, but comforting me was more important she said then her panicking also, which would of tweaked me even more.</p><p>Ive done internet research on the side effects and negative effects of being on Adderall and what comes after. I checked off all that applied. Everything it said might happen in an overdose case, had happened to me. It said if ever experiencing even one of those effects, to consult someone immediately. I am usually so paranoid and careful about what I put into my body. I usually am smart how what and how much. This drug got me going so fast, that I didnt want to slow down, and when I finally did, I would of been better off dead.</p>"
}
