{
 "title": "We Were Told To Watch Our Limits",
 "author": "BurriedAlive",
 "citation": "Citation:   BurriedAlive. \"We Were Told To Watch Our Limits: experience with Alcohol - Hard (ID 26119)\". Erowid.org. Dec 5, 2007. erowid.org/exp/26119",
 "substance": "Alcohol - Hard",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "10 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 26119",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2007",
   "Views: 4455",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy friend and I had wanted to get drunk for the longest time, but we had no idea where we could get it from, finally someone offered to get us some, we had no idea how much we were supposed to drink or anything about it. Everybody told us to watch our limits, but we had no idea what the limits were. \r\nwe werent going to drink the 26 of bacardi we got until there were more than just 2 of us there, but we just wanted a little taste. we opened the bottle and really liked it and had 3 shots to begin with, we felt dizzy but we didnt think that was everything to it, we we had 4 more shots and by this time we were pissed outta our mind. \r\nthere was a little less than half the bottle left so we decided just to finish it off. that was probably 3 more shots each. as soon as i got up i fell over and started puking my ass off all over her bedroom floor. it was only like 3 in the afternoon and my friends parents came home to see that i had been puking everywhere, and my friend had no idea what to do. \r\ni was puking and couldnt get up for about 5 hours and kept passing out and waking up about 5 minutes later on and off. we told her parents that we just had way to much candy and junkfood.\r\nmy friend was told to go and get my parents to help me up, my mom came and told me to get up to walk home (right across the road) i couldnt move,  every time i moved i would puke more and more. finally she got the car and came to pick me up and they dragged me out to the car. i got home and as i walked to bed i puked all over the floor. \r\ni passed out and fell asleep for 14 hours. as shitty as that experience was, we went out and got pissed off our ass again the next night, but this time we knew our limits.\n\n\n"
}