{
 "title": "A 'Trip' to the Mental Hospital",
 "author": "dustigirl",
 "citation": "   dustigirl. \"A 'Trip' to the Mental Hospital: experience with Diphenhydramine (with Acetaminophen) (ID 26120)\". Erowid.org. Aug 3, 2005. erowid.org/exp/26120",
 "substance": "Diphenhydramine (with Acetaminophen)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "625 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   " ",
   "12.5 g",
   "oral",
   "Acetaminophen",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26120",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 3, 2005",
   "Views: 23424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: this person took approx. 12.5 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]</p><p>This is a pretty long story about an actual event in my life... Thank you for taking the time to read it and understand this drug better...</p><p>Well, I must admit this is the absolute most horrible thing I have ever done in my entire life. I tried to commit suicide (of course I was unsuccessful), it wasnt only the fact that I tried to kill myself, it was the ignorant way in which I proceeded to do it.</p><p>It all started with my own depression, a normal teenage problem, and it ended in an awful way. I was over at a friends house and I couldnt sleep (I have really bad insomnia). I decided to take a couple of tylenol pm's, although they never really worked for me. So I took a few at about 1:00am, well I was feeling tired and restless at the same time, I lost my temper and proceeded to pick up the bottle and take 25 more of them... Big mistake, I still dont remember all of what happened after that, but I know bits and pieces. I started feeling an intense wave of the normally small sleeping pill effect. It was so intense. I thought in my mind that I would overdose and slowly just go to sleep and never wake up, but to my shock I never fell asleep. I wound up going to the bathroom feeling very nauseated and puking and I remember seeing the little blue dots floating in my vomit. </p><p>I eventually got very scared and woke my friend up, I felt so strange; things were normal but they looked different I couldnt tell the difference between reality and non-reality. I woke her up and told her I took 25 sleeping pills, she then went and, of course, told her parents. I remember talking to them but I didnt make any sense, I would start out to say something and I would try to make a point but it would come out all wrong making me feel stupid. I talked on and on about many different things, but I was delerious, and I dont remember what I said, but I was told later that I said I had a C-section, and that I had an invisible mask and that when I put it on I became invisible. Her parents were terrified and they called my dad from work.</p><p>He came to see what was going on and I thought he was someone else, I kept talking about my dad in the third person. There is a time period I cant remember, and I'm glad I dont because from what I've already heard I would be even more embarrassed. My dad was scared too so he took me to the hospital, there they asked me questions about what year it was and things like that, I answered those fine. They did all the 'necessary' stuff and I wound up being hooked to a bed for two days with a catheter and some kind of hose coming from each hole in my body. Then I had to explain why I took half a bottle of medicine. They then proceeded to put me in an ambulance where I was taken to the mental hospital where I was forced to stay for five days. </p><p>This by far was the worst experience in my life. If I could give advice to anyone about this drug I would say stay away from it, I couldn't control my actions, I became psychotic and scared the shit out of people. I later found out about the drug I had taken and read other people's experiences and found it was just like mine. Let me make one final thing clear I was not trying to experiment with a hallucinogen, I wanted to die! That is the only reason I took twenty five sleeping pills. </p><p>P.S. I am completely fine now (I am on certain medications for ADHD and insomnia) and I value my life more than ever. I will never touch another tylenol again!! After seeing actual schizophrenic people, and being in hospitals, I appreciated my own normal suck-ass mundane life, it wasnt really so bad after all.</p>"
}
