{
 "title": "1000s of Places and People",
 "author": "TripleB",
 "citation": "Citation:   TripleB. \"1000s of Places and People: experience with DPT (ID 26126)\". Erowid.org. Aug 16, 2003. erowid.org/exp/26126",
 "substance": "DPT",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "62 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   "  T+ 2:00",
   "20 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26126",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2003",
   "Views: 9125",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nthere were 5 of us taking DPT, all with a line of roughly 62.5 milligrams ready for inhalation. we all took our lines and took a seat in the living room in which we had decked out for tripping enhancement (i.e. blankets with different patterns, cushions, couches, everything)... we put on a variety of music in the cd player and let the trip take us away. I sat indian style on a cushion with my hands together as 3 others laid down and 1 was standing up. we tried to play the game P is for Pal but that was shortly abrupted by the come-up of the trip. I started to notice i was shaking alot, almost convulsing, as was everyone else. I started to close my eyes and was being transported somewhere, i dont know where, in which i was talking to many people and visiting many places, but i was obviously just sitting there. All of a sudden my 1 friend just sat up and vomited and it took me out of my special place. I stood up and tried to get him to come outside but he wasnt going anywhere, so i decided to smoke a cigarette outside to take in nature or something like that. I sit down and light my cigarette, and i begin to hear strange noises... I thought that i heard either a bird being squeezed to death or the torture of a small infant, followed by some voices and a car door shutting. Nothing moved nor did any lights outside turn on so i figured i just hallucinated them i guess. either way i had an overwhelming sense of the fear over me, and everything make me tremble. Also about this time i began to feel very VERY cold. I walked inside, only to see my friends sprawled out everywhere, and vomit stains in front of the door, so i stepped over them and went downstairs. I grabbed a blanket and my friend D followed me. I decided to watch TVand found the show Mad TV on. It was very strange and i couldnt comprehend it, there was an old lady gabbing on about something, so i promptly switched it and lost interest. D had started laughing histerically, and i continued to think throughout most of the night he was possessed or something, since he was laughing and grunting and making strange noises. He began to play unreal tournament on the computer and moving insanely fast throughout the levels, proving to be one of the funniest things i had ever seen in my life. there was a lot of water consumption and i urinated about 3 times. i went upstairs and began to feel sped up as if i had just consumed meth or speed. I was running around, waiting to do SOMETHING, anything, just exert energy. I apparently made a box of popcorn chicken from the freezer and cooked it which I do not remember doing, this was told to me later by my friends. After all this, D and i decide to take a booster of roughly 20 milligrams each. about 10 minutes later, I began to feel the effects already and i go downstairs to watch tv with D. We both know its coming and wait for it to arrive. I grabbed a blanket and  started convulsing according to E and felt the fear come back. I was just looking around staring at things while shivering, and E asked if I was alright. I told him i was fine (he said i just sort of grunted at him) and he left. I felt the need to go upstairs and sit in the living room with all the crazy techno music or whatever it was. I sat down indian style and closed my eyes. Then, i once again was transported to somewhere I did not know of, I was in great peace with myself, thinking 1000 ideas at once, talking to everyone and going crazy places... I could have possibly achieved a +4, but I am not sure since I have never achieved such a platform on a psychedelic. I snap back to reality when I open my eyes and find D handing me a saltine cracker, which i accepted and swallowed of course! Throughout the whole thing, 2 of my friends claim to have had very trippy effects, such as moving walls, breathing floors, climbing into geometric patterns etc. etc.... I did not go that way and was more effected by the way i was thinking and what was going on around me. Overall, everything was an amazing, profound experience, and if you can handle the hell of the come-up for the 1st 30-45 minutes, you will be awarded greatly by about 3 hours of extreme pleasure and a good state of mind. Id do it again in a heartbeat.\n\n\n"
}