{
 "title": "Nothing to Hide Anymore",
 "author": "sick of it all",
 "citation": "   sick of it all. \"Nothing to Hide Anymore: experience with Heroin (ID 26152)\". Erowid.org. Aug 16, 2003. erowid.org/exp/26152",
 "substance": "Heroin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Heroin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26152",
   "Male",
   " ",
   "Not Given",
   "Aug 16, 2003",
   "32796",
   " "
  ]
 ],
 "report": "<p>Let me start by saying, this isn't a story of how good my first high was, because we all know how fucking good it is. This isn't about my curiousity, and it's definitley not a fabrication. This is my addiction, and how I've lived through it. </p><p>No need to go into details about my vast drug experience, because I'm here only to tell you my experiences with heroin, my one true love, so I had thought.</p><p>I fell in love with this substance a while ago. I can't even remember the first time I used. I only remember the feeling. Feeling as if I was the only one who knew how good it was. Wrong. Feeling that it would solve all of my problems. Yeah right. Feeling that I was safe from any possible threat to my body, my emotions, myself in general. Fuck that. What I fell in 'love' with was lying to myself, and to everybody else.</p><p>Now, I am by no means well to do when it comes to money. The fact of the matter was that I had none, and my friends had none. What we had were hands that could grab at cash. We had minds that would trick us into selling our personal belongings. We had eyes for every bit of merchandise that was flat out 'worth anything.' And that's when it got worse.</p><p>I would score at least 2 bags a day. I would scrounge up money every which way possible, not feeling guilt. Every dollar I had was somehow in my mind 'saving me' from any worry, pain, or problem.</p><p>The ritual of scoring, hastily riding back to my house, and booting was as my friends would call it 'the biggest rock and roll fantasy.' What the fuck were they talking about? I was just glad to stop sweating, glad to stop feeling sick. And damn glad that I felt my precious love giving me a good hard fuck in any position I wanted. Mostly me on my back. (Use mental imagery to convert the heroin into a Heroine(woman)).</p><p>I had my friend living with me at the time, and he was my partner in crime, literally. We used to have the same routine every day. </p><p>Wake up, shoot up(if we had any), and figure out how to get the next score. We were downright fucked. Had we not had a hit yet that morning, we would quickly submerse into a sweaty race to find ten dollars. Whomever found the ten was the proprieter of 2/3 of the bag. Me, being the extremely talented con-artist, would always and always find the ten first. The only occasion he had found a ten before me was when I passed out and he went out without me.</p><p>The first hit of the day was like daily masturbation, I usually had to work for my satisfaction. I would beg and plead with anyone and everyone, I would beg my mother for money, knowing that she had none herself. Although I have to say this about my mother. She has never done heroin, but she sure did buy alot of it. That meaning I had lied on every occasion on a way to get drug money out of her. </p><p>I often did odd jobs for people, but that was only when I had horrible withdrawal, which being every morning. So I pretty much always made up some useless job to do.</p><p>Skipping months because it went on like this, we move ahead. Let's just say, my tolerance was through the roof, and the heroin was out of this world. But, I had little money and had resorted to anything that could be done to get a dollar. I stopped buying new needles and just reused my needles to the point that the numbers and markings had worn away and it was just a clear syringe which I used a magic marker to draw a line on to diagram my normal dose. </p><p>My arms looked like a pin cushion. God knows I loved my needles. </p><p>I had learned to shoot in both arms, and had designated areas for every hit. First hit was the crook of my arm(s). Second hit was the lower forearm(because I had already used my sweet spot for the first hit). And any hit after that would be switched up my arms. </p><p>After a while it wasn't an unusual thing for me to shoot up 8 times every day. I had sold every expensive piece of item in my house. And had dated several women just to steal their money and leave them.</p><p>As it turns out to this day, I went to rehab and have been clean for a little over a month. And I feel almost confident in saying that I will relapse. But my only worry being, will I make it again? Now if that isn't a fucking honest question, then I have no idea what is. I'm just down and out. And the only thing left for me to say is, I'm an addict.</p>"
}
