{
 "title": "More Drunk then I Wanted",
 "author": "Anonymous",
 "citation": "   Anonymous. \"More Drunk then I Wanted: experience with Alcohol (Hard Lemonade & Vodka) (ID 2622)\". Erowid.org. Oct 19, 2001. erowid.org/exp/2622",
 "substance": "Alcohol (Hard Lemonade & Vodka)",
 "bodyweight": "135 lb",
 "header": [],
 "footer": [
  [
   "2000",
   "2622",
   "Male",
   " ",
   "Not Given",
   "Oct 19, 2001",
   "25570",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been drunk befor this. But this was by far the most drunk I have ever been and ever intend on being. The week befor my friend and I both took 5-6 shots of hard liquor and were pretty fucked so we decided we would do it again this time we were gonna have a whole 750 ml bottle of Vodka 40% between the two of us plus 2 mikes hard lemonades each. </p><p>Not wise...</p><p>We got a buddy to boot for us because we are both under 18 then we hid the shit in my basement and my friend stayed the night. We watched movies not really thinking of anything but drinking. Finially my dad went to bed and we brought out the liquor immediatly after. Starting with the mikes hard lemonade at about 1:30 or 2:00. We finished those in about 30 minutes then brought out the 2-6 of Vodka. </p><p>We started taking shots. We took 1, 2, 3. After the third or fourth I could feel it very well. We were both laughing at the stupidest things and couldnt really stand up strait. We took more and more after 7 shots everything faded and I cant remember what happened after that point. </p><p>I wake up in a hospital bed! I could not believe it I was still really drunk. I ask the nurse what time it is. Its 10:00 am. Shit! Shit! Shit! I know that Im in trouble now! I ask the nurse not to tell my parents she says its too late. I here over the intercom them paging my mom. Damn it! I go use the washroom then come back and my mom is there. We check out and take a cab home the whole way Im begging my mom not to tell my dad. I get home and my dad already knows he sends me up to my room and says he dont want to see me. Once I sober up I go downstairs and find puke all over the basement and a giant whole in the wall plus chips and shit all over the floor. </p><p>I guess we both finished the vodka. Apparently We stumbled all over the house and I passed out on the back deck then my parents got up and called an ambulance for me because I almost went into a coma. Ill never ever drink that much again and dont advise anyone out there drink too much too fast like I did. </p><p>I will drink again but not so much so fast and not for a while.</p>"
}
