{
 "title": "First Time For Everything",
 "author": "Yuna",
 "citation": "   Yuna. \"First Time For Everything: experience with Cannabis (ID 26261)\". Erowid.org. Jan 17, 2005. erowid.org/exp/26261",
 "substance": "Cannabis",
 "bodyweight": "92 lb",
 "header": [
  [
   "DOSE:",
   "12 hits",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26261",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 17, 2005",
   "Views: 6747",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My name is Yuna, 16 and currently in 11th grade.</p><p>I'm a good kid. I'm smart, I go to school and respect elders. But I also do things that some people don't think very highly of.</p><p>Cigarettes. Alcohol. Pot. Speed. Ecstasy. Acid. Coke. Morphine.</p><p>I've never had a bad experience smoking weed in all the times I've done it. And it's pretty often - I usually smoke 2 or 3 times a week on average. Sometimes it's with friends and sometimes it's not. I buy from an ex of mine and he always gets me good stuff. For the most part, getting high is a nice experience.</p><p>Last week, I had my first bad trip. It had been a unusual time for me, I hadn't smoked any weed for about a month. It wasn't planned or anything, I just didn't find the time for it. Some of my brother's friends came over with some weed and asked if I wanted to smoke with them. </p><p>I had always heard to never smoke weed from an Asian. And to that point, I hadn't. Even though I'm Asian myself, I never fit into that hoochie-ghetto-wigger kind very well and out of my group of friends, I'm really the only one who isn't white. But my brother is one of those gangster kind of Asians who only hang out with other gangstery Asians. I assumed the weed they brought was probably bleached or laced but I didn't think much of it. And besides, it had been a while since I had gotten high, so why not?</p><p>They rolled a fat blunt out of about a 30 of weed. We started passing it around the 4 of us and I was taking really big, monster hits. I wanted to get as much out of it as I could. I had about 10-15 big hits off of it, and a few shoties. It probably wasn't the greatest idea. I'm a tiny person. I'm only 5'2 and dont even make the 100 pound mark. But by then, I was too high to think about it too much.</p><p>At first, I was having a great time. I was really high and feeling really good. It lasted for about 20 minuites, when I started to get nauseous. I went into my room to lie down for a little bit, hoping it would take the nausea away, but it only got worse. I turned on the air conditioner full blast and stripped down to my bra and panties and tried to calm down. My heart was beating too fast and I was sweating like mad. I curled up on my bed and closed my eyes and tried to fall asleep but it didn't work.</p><p>When I had my eyes open, the entire room was spinning and twirling. Whenever I closed them, I got the strangest sensation that I was rolling foward, off my bed, even though I wasn't. I couldn't move the slightest bit or I was hit with extreme nausea. I couldn't even throw up because I hadn't eaten anything for a while. There were times I felt that the piece of my bed that I was lying on was hovering midair somewhere and things were flying around me. And I was overheated like crazy.</p><p>I'm not sure how much time passed. Later, I found out it was 45 minuites but it felt like hours. I eventually passed out and woke up an hour later, still feeling a bit nauseous but better. I drank some water and took an asprin to make my headache go away. I still had slight nausea for the rest of the night, but I wasn't burned at all. I made it okay.</p><p>But I'm never smoking weed from an Asian again.</p>"
}
