{
 "title": "Wonderdrug?",
 "author": "Krysta'Lynn",
 "citation": "   Krysta'Lynn. \"Wonderdrug?: experience with Venlafaxine (ID 26293)\". Erowid.org. Sep 22, 2005. erowid.org/exp/26293",
 "substance": "Venlafaxine",
 "bodyweight": "156 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26293",
   "Female",
   " ",
   "Not Given",
   "Sep 22, 2005",
   "18881",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>If I hadn't heard of this drug before reading up on it, I would be scared out of my wits to want to be put on it since it seems that nothing good can come of it.  I've been seeing a psychiatrist for about 9 months, which isn't that long.  For the first few months she would only up my dosages of Prozac, which did absolutely nothing.  I have a lot of friends who are on medications, and my friend told me that she was on something called Effexor, which was used to treat Depression and Anxiety.  I seem to be able to diagnose myself better than my therapist could, so I told my Psychiatrist that I wanted to change my medication, and I specifically wanted to be put on Effexor, so I was.  It took a week or two for it to begin working effectively, but then it worked every day.  The side effects that I had was mild dizziness every once in a while and sleepyness.  I used to take my medication at night before I went to sleep which caused insomnia, but I changed my dosage time and now I sleep fine.  Whenever I am on my meds I am perfectly happy, or at least feeling somewhat content.  I am able to function perfectly fine without it really getting in the way with every day activities.  When I stop taking it, my paranoia and depression DOES come back, I get intense feelings of despair, loneliness, sadness, what have you.  </p><p>I know that all drugs work differently for everyone, but I figured that there should be at least one article that isn't only negative about the drug.  I think it is very effective and I actually enjoy taking it.  While on it, I understand things and accept things much more easily, and it's really helped me with my imbalance.</p>"
}
