{
 "title": "Its Not a Laughing Matter......Or is It?",
 "author": "FZR1",
 "citation": "   FZR1. \"Its Not a Laughing Matter......Or is It?: experience with Salvia divinorium (ID 26323)\". Erowid.org. Jan 15, 2007. erowid.org/exp/26323",
 "substance": "Salvia divinorium",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "0.0667 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26323",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 15, 2007",
   "Views: 2934",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Myself and partner have been considering taking Salvia for a year or so now. We are both experienced with pretty heavy doses of mushrooms and E, although not frequent partakers. We purchased 1gm of 5x leaves. Then spent an hour having fun making a home made bong (we're not big cannabis fans so its not something we either possess or have made before). My partner decided to go first. We had read lots of reports and decided we should 'sit' for each other. </p><p>He took approx 1/15gm in 3 hits, holding the smoke for 30secs each inhale. He then lay down, and seemed pretty stoned, sat up again, asked if he could hear echos. I assured him it was actually the voices outside he could hear. Within 5 minutes he was pretty lucid, telling me that was the most frightening experience of his life and he'd be thinking very seriously about ever taking it again. He described it as 'everything folding in' and 'being on the edge of losing all control'. He felt he was many places at once, on the beach as a child getting an ice cream, very old, and where he was now. He lay down for a further 15mins or so on the bed, talking intermittently, saying he felt stoned in a nice way.</p><p>After 22mins, we were chatting and he couldn't beleive it had been that long, said it felt like 5 mins since he inhaled, 10 at the most. We continued to chat about his experience for 5 minutes, he was still a little stoned but nothing significant, saying the experience was the strongest of any he'd ever had, very extreme and frightening.</p><p>So then I decided it was my turn. I closed the window as I didn't want to hear external stimuli, took the same dose, 1/15gm in 3 tokes. Then, passing the bong to be taken off me (and requesting my hand to be taken off me too, oddly) I collapsed on the bed, laughing. I then laughed uncontrollably for a full 15 minutes (not that I knew it was that long till I checked my watch). I came back to something approaching normal after 15 minutes, though still giggling quite abit for another 10 mins or so. That 15 mins of laughing seemed like a very long and a very short time to me. I was completely lost in myself. I was in my sisters bedroom from 20yrs ago, the top of a lane, and at home in the present simultaneously. I asked to be held by my partner, which he did, but on some levels I don't think I knew who he was, where we where, or indeed who I was. </p><p>Nearly an hour has passed now since I took my dose of Salvia. Just thought this might make interesting reading, two so completely and utterly different reactions to the wonderful plant, but both very extreme. And myself and partner are very similar bouyant, outgoing and positive people. Although naturally I enjoyed laughing my arse off for that long - it was extreme, and it gave me an insight therefore if you went the fear way that would be so powerful too. </p><p>My partner is now over his fear and wants to do it again. So do I, and may even do so before bed time. I've never read of anyone just laughing on Salvia, (its not my usual reaction to drugs either) and I'm a little in awe - I feel I know next time will be nothing like that first one, but I'm intrigued. I read all these reports of mind opening experiences, seeing the lady salvia, life changing views. Yet I managed to be the one person who just thought it was very funny ;-) I have a nagging feeling in the back of my mind that I will be made to pay for this reaction to the holy plant. We will see.</p>"
}
