{
 "title": "Benificial as a Booster",
 "author": "Morninggloryseed",
 "citation": "Citation:   Morninggloryseed. \"Benificial as a Booster: experience with DiPT & MiPT (ID 26385)\". Erowid.org. Aug 25, 2003. erowid.org/exp/26385",
 "substance": "DiPT & MiPT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "DiPT",
   " ",
   "20 mg",
   "oral",
   "MIPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26385",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 25, 2003",
   "Views: 15152",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWhile I found MiPT to be a relatively mundane entheogen, recent information has made the substance much more interesting in my eye...\r\nA friend of mine (I wasn't in the mood and declined to join him) mixed and swallowed at the same time twenty milligrams of MiPT with fifty milligrams of DiPT.  He has taken DiPT before at seventy milligrams, and one-hundred milligrams.  He found one-hundred milligrams of DiPT to be just right for him.  Never has he tried MiPT.\r\nHe found that the MiPT significantly enhanced the DiPT well beyond what fifty milligrams would normally do, but said the MiPT added little to no 'coloring' or 'flavor' of its own, though he did notice that the trip was a bit more visual than normal.  Interesting considering MiPT does not cause much visual on its own according to most reports including my own personal experience.\r\nI have a feeling MiPT will be a fantastic material to boost the waning action of another tryptamine, or to intensify one if it is taken at the same time.  I intend to find out one day myself.  I will take twenty milligrams of MiPT just before the end of a psilocybin mushroom trip peak to see if it will extend the action of the mushrooms without making it feel like a different trip.\r\nAnother thing I think MiPT will be beneficial for is to heighten and stimulate intellectual group discussion.  There is a definite 'smart drug' aspect to MiPT and I feel sub-entheogenic dosages (like maybe ten milligrams) would definitely make for a lively and deep focus group of maybe six people or so, without causing everyone trip out and get so 'loopy' as to result in the event being a disaster.\r\nMiPT did not prove to be the most earth-shaking entheogen in my experience, but I have a feeling it will prove quite useful in other aspects.  Further experimentation is warranted and will be pursued by this private and completely unlicensed researcher.\n\n\n"
}