{
 "title": "Confusing and Frustrating",
 "author": "Mr. Heddy",
 "citation": "   Mr. Heddy. \"Confusing and Frustrating: experience with Salvia divinorum (ID 264)\". Erowid.org. Aug 25, 2001. erowid.org/exp/264",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 264",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 25, 2001",
   "Views: 6860",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI bought an ounce of salvia a few months ago and have tried it several times but I have had to stop my research on it due to its utterly confusing effects. I have only had one experience with it where it actually produced any sort of visions, but the rest of the experiences were all pretty much the same. \r\nWhat happens is, first I break out in a hot prickly sweat, and then suddenly I become extremely irritated, agitated, cranky, and generally unhappy! So much so that I usually have to stop smoking the stuff, because it would only be more painful to continue. Small amounts produce only these effects. Larger amounts often make me feel a strong 'presence' with me (like the plant is inside my head, but not really talking to me), and it is in this stage that I usually end up saying with passion, 'Ouch! Why are you doing this to me? What the hell are you doing?' The slight pain and discomfort are usually accompanied with a strong sense of confusion (often, the pain and discomfort are the very thing I am confused about; i.e., 'why the hell are you hurting me?') It very much feels like Salvia is playing with me, almost. Every time I ask it why it's hurting me, it doesn't answer, and eventually the effects subside.\r\nMy one intense experience was a one-hit full bong load while on mushrooms. This was also accompanied by a great discomfort, although there was also a legion of elves and a four-foot witch that came out of a nearby oak tree that was attacking me with a scythe or sickle. This time the experience was accompanied with a sense of panic, although not at any particular thing; I was not afraid of the things I was seeing, or of anything at all, yet I was panicked.\r\nWhat is confusing to me is why most people seem to have very positive experiences with Salvia, while it only seems to make me very physically uncomfortable and agitated. If anybody has any suggestions or insights, they would be very helpful! This has been bothering me for months now, and it's a tad frustrating having a bag of Salvia but not being able to reap its reported benefits.\n\n\n"
}
