{
 "title": "Retrospective on My Experiences",
 "author": "CuriousGeorge",
 "citation": "   CuriousGeorge. \"Retrospective on My Experiences: experience with Salvia divinorum (ID 26451)\". Erowid.org. Jun 2, 2007. erowid.org/exp/26451",
 "substance": "Salvia divinorum",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26451",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 2, 2007",
   "Views: 2460",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My intent in writing this report is to give readers some insight into the range of effects possible from Salvia on one individual (myself), since many reports on the net focus only on very intense experiences. Brief personal drug history prior to Salvia: alcohol, marijuana, LSD, hashish, magic mushrooms.</p><p>The first few times I tried Salvia, I experienced very subtle effects: mostly loss of coordination and a general feeling of drunkenness which usually lasted only a few minutes. This was with smoked dried leaf (no extract). I later got my hands on a few extracts of varying potency, ranging from 6x to 10x. The dosage has almost always been 1 lungfull with a regular lighter flame held on the bowl for the majority of the inhalation. Here is where I found some very interesting recurring effects:</p><p>1.) Visual and tactile body pixellation/tingles. The pixellation often resembles the fragmented look of a 'magic eye' picture, or perhaps the white noise of a TV set, but much subtler, like a moving watermark over the visual field. The motion of the sensation is usually clearly directed, for example to the centre of my body, or simply down (to the centre of the earth). This sometimes continues into the rest of the session.</p><p>2.) Without noticing it, some basic assumptions about things will shift, or perhaps change completely. Sometimes I can remember that these assumptions were based on a thought or observation which was then blown out of proportion (e.g., 'those trees I'm looking up at are a lot like people standing in a circle'). At some point, these assumptions are questioned, or something is noticed which contradicts them, and then reality starts seeping back in. I liken the whole process to drifting in and out of dreams when very tired in bed or on the bus.</p><p>The assumptions may remain at trivial levels, like the feeling that there is another presence with me (like sentient trees) or simply that the visuals I'm experiencing are normal. Sometimes, though, the assumptions carry a lot more force. In my most recent experience, I was suddenly part of a very different world. The lights and darks that I could see in front of me were exaggerated and contrasted so that there were only two colours in my universe: light beige was eternally consuming brown. Eventually I became one (and perhaps both) of these colours, gobbling up and being gobbled up by the other one. Most striking to me, though, is the sense of history which came immediately upon being immersed in the new world; I had no recollection of my real life, and it seemed as if I had been a part of the two-colour world for as long as I could remember. And, just as someone who has no memory of any other reality tends to do in most moments, I didn't really think about any of the details of my history there too much. There was just the same feeling that one normally has in everyday life: that everything is normal and that this place has been and will be around for a very long time.</p><p>3.) Repeating patterns flow through the outlines of objects or the shadows on objects. This is similar to the flowing pixels mentioned above, and carrying with it the same sense of 'normality' that I expressed regarding the dream-like assumptions that I make. The patterns are usually made up of recognizable things from everyday life: miniature cars, or chairs, or little 'SimCity-esque' streets and roadways. This is very common for me.</p><p>4.) The 'no-clipping mode' effect. I've only experienced this two or three times, actually. A friend gave me this analogy to describe the phenomenon: it's like you're in a first-person-shooter computer game, you've just turned on the walk-through-walls code, and you start walking backwards outside of the boundaries of the game map. For people who don't know what this looks like, I could describe it as a recursive framing of what is seen with partial, fragmented, staggered copies of one's peripheral vision as one moves around.</p><p>5.) When things start coming back to normal (usually after just a few minutes), there's almost always giggling, and lots of it. After that wears off enough to speak, it is very hard to actually formulate meaningful sentences, and it is especially difficult for me to describe what I am and have been experiencing (which prompts yet more giggling). At this time, I can almost feel my brain sorting itself out again, back into normal modes of thought and communication. This is the most amusing part for me, I think.</p><p>...and even after this shakedown, things still usually need to settle for a few minutes before I'm 'back to the old me'. I rarely ever remember to time my sessions, but I think they usually span about 15 minutes from beginning to end.</p>"
}
