{
 "title": "An Extreme and Unexpected Reaction",
 "author": "Dirk",
 "citation": "Citation:   Dirk. \"An Extreme and Unexpected Reaction: experience with 4-AcO-DiPT (ID 26464)\". Erowid.org. Aug 29, 2003. erowid.org/exp/26464",
 "substance": "4-AcO-DiPT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "22 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26464",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 29, 2003",
   "Views: 25364",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast night my wife and I took 4-AcO-DiPT, bought from a research chemical supplier, for the first time.  This report is about her extremely negative reaction to the substance:\r\nt+0:00 - We dosed at around 6:30pm, Zippie (female) took 20-25mg, I (Dirk) took 25-30mg. We had eaten a light meal at 5:00pm.\r\nt+0:20 - First signs noticed, quite similar to the initial onset of LSD, body-wise, but with little visuals.\r\nt+0:45 - Kicking in pretty strong for me, although Zippie was already saying that she would need a higher dose the next time, and appeared slightly agitated by the fact that it was hitting me so much harder than her.\r\nt+1:00-1:30 - Plateaued somewhere during this time, roughly 8:00pm.  Zippie and I went upstairs to give it the 'ol' sex test' (that was one of the main reasons she decided to try it with me, as she's not big on psychoactives otherwise) sometime around now; the substance was predominantly a body-feel, and the sex was great. Took an extra long time to orgasm, however.\r\nt+2:30 - Initial signs of stomach pains began with Zippie; I was fine.\r\nt+3:00 - Around 9:30 Zippie's stomach pain was getting bad enough that she headed off to bed; she was tired and thought that the drug's effect had reduced itself enough that she could sleep. I watched TV and enjoyed feeling like I'd taken a couple grams of shrooms.\r\nt+3:30-5:30 - Zippie came back downstairs after only 10 or so minutes, and spent the next couple hours in the bathroom, having minor vomiting and diarrhea. By midnight we decided that she needed to go to the hospital.\r\nAll-told, we spent 5 hours at the hospital in the ER.  The doctors knew almost nothing, if anything at all, about 4-AcO-DiPT; I basically had to educate them about it.  They put Zippie on an IV and eventually gave her some anti-nausea medicine, which killed both the nausea and stomach pain, and was the reason we finally were allowed to go home.\r\nDuring the time there, they had to call in a Toxicologist, who actually knew something about the substance and other similar 'drug' topics (he really knew his stuff...but he was also pierced up and reminded me of myself, so you can make your own guesses as to why he actually knew as much as he did).  Even he had no clue why she was having this reaction, and couldn't even attribute it to an interaction with the only 2 things in her system - Zippie was on the birth-control patch, and had also been taking 1/2 daily dose of a weight-loss suppliment (non-ephedrine based). According to him, the 4-AcO chain on the DiPT makes it a non-polarized molecule, which is why it is absorbable through the stomach lining, and as such it isn't a MAOI and so the reaction wasn't an MAOI hypertensive/metabolic crisis.\r\nAll in all, I'm submitting this report as a warning to anyone who has read the other information available on the net regarding 4-AcO-DiPT;  just because no one else has reported a truly adverse reaction to a substance doesn't mean that it can't happen, and just because there is no obvious pharmacological reason for a bad interaction to occur doesn't mean you're not taking a risk.  \r\nPersonally, given my first taste of 4-AcO-DiPT, I'd recommend it to people looking for a 'light' shroom-like experience, especially people prone to having 'mental difficulties' on psychoactives - I couldn't think a bad thought the entire time I was on the stuff, and even my wife being that sick didn't make me think any negative thoughts. Just don't look at it as a harmless miracle drug or anything - my wife found out the hard way that nothing in life is free.\n\n\n"
}