{
 "title": "Cranial Chomping",
 "author": "blinny",
 "citation": "   blinny. \"Cranial Chomping: experience with 5-MeO-DMT (ID 26469)\". Erowid.org. Aug 29, 2003. erowid.org/exp/26469",
 "substance": "5-MeO-DMT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6.0 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)",
   "  T+ 0:30",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26469",
   "Male",
   " ",
   "Not Given",
   "Aug 29, 2003",
   "Views: 7192",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was one hell of an experience. Im not sure wether or not this is a more of a warning or an encouragement submission.I am a semi-experienced drug user, having dabbled in a few psychedelics...DPT, Harmala, Hawaiian baby woodrose, among others. One 6 Milligram dose was freebased off of aluminum foil and inhaled via a funnel.  This produced a very surreal feeling, alot of shakiness. I was not satisfied...and went to relieve my bowels while a 10 milligram dose was being prepared by my friend, B, (the shit was quite refreshing.....kudos to the 5-Meo-DMT. B and I proceeded to the basement where we have set up a mattress  for these experiences.  I sat on the matress and used a toilet paper tube to inhale the smoke, ensuring that I would get it all.  Immediately after exhaling the hit, my entire body began to wave and a strange vibrating frequency was felt in my ears that decrescendoed until one frequency was happening. I can only use the word happening because it was only happening, I was not feeling it. And then I ceased to exist. I experienced 'The Void' for about 10 minutes. During this period,I am told, my extremities shot out, and I convulsed violently.  And then came the most insane part,of which I have little to no recollection.  Apparently, my trip advocate, B, was attacked by myself. I seemed to think that he was perpetuating my trip and that only he could make it stop. I swung violently above his head as he dodged my attacks and backed away. I grabbed his head and bit it. Yes, I bit his forehead. I thank the universe that he did not retaliate, understanding my condition, because I could have very well awoken with a broken jaw.  The only part of this I remember is about a half-second blip of a terror-stricken expression on B's face.</p><p>Then, I somehow managed my way back toward the matress, knocking over literally everything in my path. I flopped down on the matress and proceeded to repeatedly bang my head off the floor. I then crawled into the corner and licked a pair of skis.  My trip provider, A, walked in the door, and I apparently traced my hand around his face with an expression, in his words, that was like a dead man, with sheer blankness behind my eyes.  Shortly after this is when I regained any sense of consciousness. I sat up on the matress, my shirt as wet as if I had just jumped in a swimming pool. I am still curious as to how high my body temperature actually rose. A brought me some cold fluid to try and lower my body temperature and for a brief second I felt that he had some divine aura, supported by my actually calling him god. I made him leave the room, and brian stayed with me until the feeling faded away, between 5 and 10 minutes later. During this period I experienced some intense visual stimuli. My comedown provided me with a very clear, intensely honest feeling. Overall, the experience lasted about 20 minutes. I am not sure wether or not to call it an experience, since it was very out of body.  I would recommend the experience, only so that one could feel the total absence of existence that I felt.</p>"
}
