{
 "title": "The Real Deal",
 "author": "scroumf",
 "citation": " scroumf. \"The Real Deal: experience with 2C-I (ID 26476)\". Erowid.org. Aug 30, 2003. erowid.org/exp/26476",
 "substance": "2C-I",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26476",
   "Male",
   "",
   "Not Given",
   "Aug 30, 2003",
   "7293",
   " "
  ]
 ],
 "report": "<p>T+00:00 (8:00PM)</p><p>I consumed the 12mg of this compound orally and washed it down with some water.  It tasted pretty gross.  More gross than 2CT2.</p><p>T+00:30</p><p>This was much more potent than I had expected.  It came on slowly, but with much strength.  The first thing I noticed was a pleasant feeling throughout my body, not unlike 2CT2, coupled with some minor short-term memory scramble & confusion.</p><p>T+02:00</p><p>Once it really started going, my friend and I decided to go for a walk.  On our walk, we were waiting at a Dont Walk sign to cross a street.  It was a fairly long light and I began to grow impatient.  When the lights finally changed I felt quite exhilarated, that exhilaration quickly turned to confusion when I realized there was the sound of a large audience clapping and whistling, the moment I realized that the sound shouldnt have been there, it was abruptly terminated.</p><p>I would look at clouds and try to pick out a face I would look for eyes, nose and mouth, and as soon as I found a face in the clouds, it would begin to change, one time the eyes narrowed and the mouth opened wide, another just smiled, wider and wider until its mouth dissipated.</p><p>I saw two bright lights on the side of an apartment building, obfuscated by a few old trees, and the beams of light peeking through seemed to appear remarkably solid.</p><p>I could continue describing the rest of the myriad of visual distortions I had that evening, but I dont want this thing to be too long.</p><p>I noticed it was devoid of any physical energy push unlike many other psychedelics.  I had just as much vigor as I would have if I was sober, maybe less.  AMT, LSD and MDMA to a degree wake me up and give me more energy, this was not the case with 2C-I.  </p><p>T+02:45</p><p>We ended up in a very large sea of people, as it was Canada Day, and this was the place to be to see the fireworks, I started to get rather unnerved.  I began to fear that I was expressing weird things through body language and offending people in the crowd.  My friend felt anxious as well and we decided to retreat back to his apartment.  Over the course of the walk back I realized that the body language thing was quite absurd, and felt a lot better.</p><p>During the walk and particularly when we returned to my friends apartment I noticed this compound made me voraciously thirsty to the same degree MDMA does.  I definitely recommend watching your water intake with this stuff.</p><p>T+03:00</p><p>Once we were back, we conversed for a while.  Our topics of conversation switched quite quickly.  At one point where there was a break in the conversation, my friend made a peculiar groaning noise while staring off into space When I asked him What kind of noise was that? he slowly replied Thats my Im hallucinating noise.  We both found this quite humorous and had a good long laugh.</p><p>I noticed as complacent and pleasant as this compound made me feel, it didnt have even one hint of the empathy that MDMA exhibits.</p><p>T+04:30</p><p>Once I had come down I got a little down, not only sad that the trip was ending, but just sad for no real reason.  It wasnt unbearable by any means, just slightly annoying.</p><p>T+07:00</p><p>Completely down, and ready for bed.  After I had retired for the evening, I woke up all disoriented and hallucinating three or so hours into my slumber.  I was hallucinating like crazy, I didn't know where I was and the things on my bed sheets were morphing.  Other than that brief episode, I had a very restful sleep, for a full 8 hours, and awoke rather refreshed.  The following days were fine, like I hadnt even taken the drug at all. If anything, I was a little cheerier than normal.</p><p>As for physical side effects:</p><p>No nausea</p><p>No vomiting</p><p>No headache</p><p>No eye wiggles</p><p>No jaw clenching</p><p>No muscle discomfort/tension</p><p>No diarrhea</p><p>Overall, I am amazed with the lack of side effects / hang over that this compound induced, and such a powerful and enjoyable experience it produced.</p>"
}
