{
 "title": "Life In The Fast Lane",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Life In The Fast Lane: experience with Amphetamines & Methylphenidate (ID 26488)\". Erowid.org. Mar 7, 2007. erowid.org/exp/26488",
 "substance": "Amphetamines & Methylphenidate",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26488",
   "Male",
   " ",
   "Not Given",
   "Mar 7, 2007",
   "30935",
   " "
  ]
 ],
 "report": "<p>In the fifth grade my parents took me to get a test done to find out whether or not I had ADHD. I answered the questions and my parents submitted it to my psycologist. About a week later before school my mom told me that I had been started on a new medicine that would help me to focus more in school. The medication I was administered was a 10 milligram oral dose of adderall(amphetamine, d-amphetamine salts).</p><p>Without any experience with mood altering substances I thought to my self 'yeah right this tiny thing is supposed to get me some better grades'. About an hour after taking I realized I had an unusual feeling of well-being, and a strong sense of motivation, in addition to having my appetite completely diminished. I have always been a bit chubby.</p><p>When I returned home I realized that what I had felt earlier that day was beginning to wear off. That night I was very angry and agitated and it was noticed by everyone else who came around me. I proceeded to take my Adderall for the remainder of the fifth grade. That year I recall having numerous fights and arguments with my parents that often were the result of something insignificant.</p><p>When summer arrived I ceased to take my medication and began to gain back my old emotions in addition to gaining back my weight. I was my normal self again. Summer ended and I began the 6th grade and had still discontinued my medication. Later on that year my parents received many phone calls about my impulsive behavior. Their solution was to start me back up on my medication.</p><p>The results were the same as they were a year prior, but this time I was well aware that these feelings were a direct result of my medication. At the same time the thought of abusing it never crossed my mind. I still 'thought' I had never used a drug in my lifetime. My medication was again discontinued at the start of summer vacation.</p><p>When I began seventh grade I noticed that people around me took my hyperactivity along with being fat as a nuisanse. A week later I asked my mom if I could begin taking my medication again she was very hesitant about it because she recalled the many occasions where I would come down and go into rages. She agreed to let me try it for a few days and see what happened. I still had came down at about noon and got in conflicts two out of three days of taking my medicine therefore it was decided I would no longer take it.</p><p>About a week later I began to start sneaking the pills out of the medicine cabinet. I then realized that I was using this drug to get 'high' not to focus in school. After I used up the remaining pills that were left in my prescrption I made a deal to purchase the drug illegaly at school. This was somehow discovered by the principal and I admitted to making the deal. Since the deal was never completed, and I had no illegal substances with me I was suspended rather than expelled.</p><p>When my parents were notified of this they asked me why I had done that. I lied to them and said it was to make better grades in school. They bought my story and I was prescribed time released methylphenidate. I began taking this and realized the effects were dull, as I was on a low dosage.</p><p>I began to crush up the tablets therefore causing the time release to not work. I also purchased Adderall a few more times for recreational use. I stayed clean for the summer. In the beginning of the eighth grade I met a friend who had a prescription for Adderall and would willingly supply me with it. A month later I went on a binge and didn't eat or sleep fro 4 days. The last night I realized I had a problem.</p><p>I was hooked on speed. I told my parents everything about my use and was evaluated and put in an outpatient program. I did not stop using though so I was removed from the program and sent to a residential program in Florida for 25 days. Following that I attended twelve step meetings and stayed clean for four months followed by a one week relapse.</p><p>I came clean with my parents and gave twelve step meetings another shot. The point I am trying to make is that even tough Adderall and other ADHD medicine may not seeem like a big deal. Look where it got me. I went from having no interest in drugs to making drugs the main focus of my life.</p>"
}
