{
 "title": "Still Recovering",
 "author": "Chris",
 "citation": "   Chris. \"Still Recovering: experience with Methamphetamine (ID 26492)\". Erowid.org. Oct 16, 2007. erowid.org/exp/26492",
 "substance": "Methamphetamine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "26492",
   "Male",
   " ",
   "Not Given",
   "Oct 16, 2007",
   "Views: 7132",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few summers ago I had a constant supply of ultra-clean, super-potent, phosphorous based meth. I loved everything about phosphorous dope. Tastes good, smells good, very nice, uplifting high. An incredible, warm surge of euphoria would always engulf me after taking like 3 or 4 good hits, and I'd feel like a king. I had so much energy and I'd talk everyone's ears off, even complete strangers.</p><p>Boy we were fucking tweekers. We'd leave school (I was just about to graduate high school), go buy an eight ball and not return to school or home for the next three days. We'd just sit around in my friend K's dark attic, smoke pipe after pipe of crank and play cards for days straight. It soon progressed beyond that.</p><p>My parents found out I was doing it and booted me out of the house. I was 18 then so I didn't really have any say-so in their choice. I was a legal adult, so if they wanted me out, I was leaving. But I didn't give a fuck. I wanted to party. And party I did.</p><p>My apartment (I moved into a crumbling, filthy, ghetto-ass third floor apartment) was always flowing with beer, slutty women, and truckloads of meth. I had almost fifty people stuffed into my apartment almost every night, drinking keg beer and such. When the party was over, me and my 'select' friends would lock ourselves in my bedroom and smoke crank for hours and hours and hours. I think on a weekly basis, I got about twenty hours of sleep.</p><p>I had been instantly sucked into a dirty, wild lifestyle of sex, drugs, and rock n' roll. I was always awake. People would come visit me at four in the morning and I'd be like 'what are you doing here?' and they'd reply, 'well, we knew you wouldn't be sleeping.'</p><p>I dropped a lot of weight, and that was disgusting because I'm really skinny as it is, so I began to look like a crackhead-zombie. I started hallucinating. And let me tell you folks, sleep-deprivation hallucinations can be truly frightening. It got to the point where I'd nod off without warning and I wouldn't wake up until the next day. I'd wake up scared and confused and I'd swear to myself I would never touch meth again. But then my dealers would call me and if I had money, well, I was back on the pipe in no time. </p><p>I finally managed to stay away from crank for a year, but all the while I was craving it. I've had at least a dozen relapses since I 'quit' in 2001, and every time I do it, bad memories always haunt me and I hate myself for taking it. Truth be told, I took some crank last month and it scared the living daylights out of me, and now I'm trying to stop taking it completely. But I still get a craving for that rush, that oh-so-wonderful surge or euphoria.</p>"
}
