{
 "title": "Might As Well Be Heroin",
 "author": "Bun",
 "citation": "   Bun. \"Might As Well Be Heroin: experience with Pharms - Oxycodone (ID 26542)\". Erowid.org. Feb 28, 2004. erowid.org/exp/26542",
 "substance": "Pharms - Oxycodone",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26542",
   "Male",
   " ",
   "Not Given",
   "Feb 28, 2004",
   "Views: 63754",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Even though most of the drugs that I have done have been more of the psychedelic type, I have always considered myself a narcotic person. Heroin has always been my dream, but at this time, I knew very well that heroin was bad shit and told myself I'd never do it. But now OxyContin hits the spotlight and I got really excited.</p><p>My friend [C] is a legal drug dealer (like DXM), so I ask him if he's got any. He does. But he only has 40 mg tablets. I knew I needed to start low so I laid off for a while. I landed myself three 10 mg tablets and did 10 mg once and 20 the other time, whole pills. I loved it, but it wasn't that strong. But I knew, being an experience user in other substances, that it could be great. So I bought that 40, ground it up and snorted it. There wasn't that much powder from just one pill, so after snorting all I saw, I filled the bowl with water and chugged it.</p><p>It took just a few minutes to start...and then...wwhhhooaaa...I felt like I was in the song Comfortably Numb. I knew it was going to keep going up so I quickly grabbed my cigarettes and got on my roof. I brought The Wall and Dark Side with me along with my pimpin' headphones. I laid flat on the roof, listening to Floyd, going through a whole pack of Kamel Reds. It was the most unbelievable of my life.  I was drifting through reality, through dreams, through heaven itself. My brain spun on its axis, twirling through the consciousness of the universe. My body lifted from off the roof and slowly floated toward the dark side of the moon.</p><p>I was up there for several hours. I finally consented to come back inside. As soon as I got back inside, I climbed in the shower. That was a ridiculous experiement in and of itself. I got back in my room and laid down on my bed...and then...panic.</p><p>I had done enough research on the web to know that overdosing is accompanied by respiratory problems...and I couldn't breathe. I sat up and tried breathing but my throat wouldn't open. I pounded on my neck, thinking these were my last moments. Once more I sucked in as hard as I could...and it released. Very small ammounts of air finally reached my lungs and I sighed in relief. I laid back down, and this repeated no less than 6 times. I freaked out at first but got used to it believe it or not.</p><p>I woke up the next day to go to school and I felt really spacy, but still coherent. Nothing ever happened as a result but I would still say that OxyContin is pretty bad. I think that I almost died to this day. Stay with researched drugs that are meant to be used recreationally (for example, DXM? do the powder! Coricidin is the devil!). This perscription stuff can be scary sometimes.</p><p>Adios,</p><p>Bun</p>"
}
