{
 "title": "Enlightenment? Kundalini awakening? What?",
 "author": "Divinorum",
 "citation": "   Divinorum. \"Enlightenment? Kundalini awakening? What?: experience with Hash (ID 26560)\". Erowid.org. Sep 4, 2003. erowid.org/exp/26560",
 "substance": "Hash",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "oral",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2001",
   "26560",
   "Male",
   " ",
   "Not Given",
   "Sep 4, 2003",
   "8489",
   " "
  ]
 ],
 "report": "<p>Well, I must say that even if 2 years have passed, I still feel weird about that event. An event that changed my life in the years to come. In the summer of 2001, I was working on holiday in a camping park. I´m from Portugal by the way :)</p><p>So, it was an early morning, I entered work at 8:00 am. I have been for the last hour listening to new age music, and I was indeed relaxed. At 10:00 am I had the idea of eating some of the hachish I had buy from a friend. I had been smoking previously, a few weeks before but not too often, so I ngested about 1/4 gram, didnt chew, just swallowed it with water. The effects were taking a bit longer to appear than I expected, I thought that about 40 min would do, since I didnt eat breakfast. Well, it passed one hour and 30 min when the effects started to appear. It was very smooth, just a sense of deep relaxation and a little heaviness on the entire body. I started doing Yoga techniques like pranayama, and thats when things got weirder...</p><p>But, nice at the same time... I began to have visual distortions: I looked at the summer sky, and there was little clouds, like sheep, and I started wondering about sheep races :D and the clouds did start to run one after each other. Then I got my atention on my physical body, I sense a feeling of tightness on my back, like there was some force pushing against my spine. I was eye closed (someone could have entered the gate without me knowing) and I saw the interior of my body when I looked down with eyes closed.</p><p>there was a pink color ball of fire in the base of my spine, and blue sparks entering the inside from the sides of my body (below ribs) when the energy got so intense and bright, it all exploded and I felt like expanding to the limits of the universe, merging with everything... Deep Expansion. When I calmed down, I heard a song from a radio nearby, it was a rock song, but as I listened to it I saw it change... to a christmas song ( deck the halls with bowls of jolly, palalalala etc...) =) and I became confused but the music soon turned again to the rock music I had been listening. It all quieted down after few more minutes. I went home to lunch, still feeling extremely relaxed, and on the afternoon I went to sleep at 15:00 pm... awakening the next day at 17:00 pm! I slept for 27 hours. I was perplexed.</p><p>After this experience, I have been suffering from a few illness. I got apendicitis that evolved to a very dangerous condition, I had to be operated 2 times. I have been suffering from pains in the body, that appear from nowhere and disapear again without a trace.</p><p>I have been experiencing also subtle effects on my life, psychic abilities have been developing and a deep religious sense on my interior, I am now more inside my beliefs, buddhism. </p><p>Thats all</p>"
}
