{
 "title": "Eliminating the Brain Fog",
 "author": "Grug",
 "citation": "   Grug. \"Eliminating the Brain Fog: experience with DXM & Lecithin (ID 26564)\". Erowid.org. Sep 9, 2003. erowid.org/exp/26564",
 "substance": "DXM & Lecithin",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "DXM",
   "(powder / crystals)",
   " ",
   "12 g",
   "oral",
   "Lecithin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26564",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 9, 2003",
   "Views: 10744",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hi All , this is a short one so you can all read it. I've done DXM for about a year now. I started doing it because it decreases opiate tolerance (all opiate users look this one up, there are proven reports and trials on this) which effectively increases opiate effects several fold. </p><p>While I've have several reports of life changing experiences ready to submit i found this little gem out the other day-  Lecithin.  It's available for $5 for a 250 gram bag at most health food stores, it's sometimes referred to as a 'smart drug', and I read a report that it increases euphoria and eliminates the dumbening and side effects of DXM use. </p><p>Well, let me tell you it does. The euphoria was almost unbearable and I can take a 3rd plateau dose and no one would know I'm on anything.  I basically feel excellent for the next 2 days. I wont crap on but DXM'ers take note. Try lecithin, its cheap and youll be amazed about the increase of euphoria and clarity and elimination of 95% of side effects and brain fog,</p><p>As a side note the lecithin should be placed in a glass of warm water as the granules and just drunk as is, add a little milk if you want, it tastes great! a lot like milk malt. The RDI is a laughable 1.2 grams but you'll need at least 6 or 7 grams for noticeable effects. I've used up to 40-50 with no negative side effects nor have I read of any. On a chemical level, Lecithin contains about 30% choline, a precursor to acetyl-choline. </p><p>I hope someone else can eventually shed light on how this makes such a difference.</p><p>Peace to all, i hope it works as well for all of you as it has for me.</p>"
}
