{
 "title": "A Pleasingly Different Trip",
 "author": "Doctor Strange",
 "citation": "   Doctor Strange. \"A Pleasingly Different Trip: experience with MDA (ID 2658)\". Erowid.org. Sep 11, 2000. erowid.org/exp/2658",
 "substance": "MDA",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDA"
  ]
 ],
 "footer": [
  [
   "1979",
   "2658",
   "Male",
   " ",
   "Not Given",
   "Sep 11, 2000",
   "Views: 29397",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOkay, this was a long time ago, but it was still utterly unforgettable. Coming after a number of positive LSD, Mescaline, and Mushroom experiences, the MDA experience - which had been described beforehand as similar, but somewhat shorter and with a more pronounced burnout afterward - was fascinating.</p><p>After taking the MDA at around 4:30 on a midsummer day, we - myself, a female relative, and a couple of male friends - had a 40-minute drive across a spectactular bridge to a lovely nature preserve. Onset of the effects began during the drive (which was accompanied by an excellent live Grateful Dead tape), as a feeling of euphoria, enthusiasm, and a general heightening of all the senses. I don't recall any stomach churning, but I suppose there was some, and the same sense of your body's ordinary functions shutting down as at the start of an LSD trip.</p><p>Sitting by a pristine woodland lake another hour later, we were into full-blown effects. For the most part, they were quite similar to an LSD experience, but with some interesting differences:</p><p>Extremely heightened closeness and intimacy. It was different from the sense of being swallowed by something greater than onseself that you often have in an LSD experience. I was still me, in control, and very verbal. Personality differences fell away, and I loved my companions intensely at that moment, thinking them the greatest friends I ever had. </p><p>(Unfortunately, I did get to try a sexual experience, but I can attest to those who say that MDA is wonderful for it. This was certainly the closest thing to an aphrodesiac drug I have ever personally experienced. I should point out that coke and 'ludes never worked for me: I'm far more into mind drugs, not body drugs.)</p><p>Part of this was do to a stunning auditory difference: Whereas on LSD you hear the entire universe in a great cacaphony - the wind in the trees, the dog barking a mile away, the planes flying by, the water rushing down the stream - on MDA, there was silence. The person you are speaking with is all you hear over a slight background hum, and their words are the central fact in the universe.</p><p>My response to LSD was always that it was a spiritual, mystical experience that included a chance to view oneself at a distance - I never did it just for the special effects. MDA seemed of a piece with this, if somewhat less intense. The mystery was present.</p><p>Hallucinations of a different type: In addition to heightened colors and an 'angular' sense of things seeming rather like a fisheye lens, there wasn't any of the usual 'melting' or 'strobing' effects. What there was - that I had never seen on LSD - was polka-dots. Floating before me in all different colors, uniform spots of about fist-size-at-arm's-length. Whoa...</p><p>We had plenty of energy (this is an amphetamine, after all), and had a pleasant walk. The visual effects remained strong, but there was never a loss of control or a difficulty in speaking (either technically, as in forming coherent sentences, or expressively, as in making myself understood). </p><p>After about six hours, we were well into the downward slide. Went home, drank a little wine and smoked a little pot to ease down. Eventually managed to eat something light. Was up most of the night, but eventually slept pretty well. I wasn't aware of being all that more burnt out the next day than I would have been after a full-blown LSD trip. (This was shorter, and a bit less intense, but thoroughly enjoyable.)</p><p>I never did MDA a second time - it never came my way again - but I treasure this memory as a very special experience. Truly, it seemed another wonder-drug, as worthy in its own way as the other powerful psychoactive drugs I have used.</p><p>In reading about the increasing use of MDMA (Ecstasy) in recent times, I have wondered how it compares to this MDA experience. (From what I have read here, it seems that MDMA is a somewhat less full-blown experience.) Despite my current middle-aged parent status, I can certainly see why the kids of today would enjoy such a thing, and how it could aid is partying and coupling... My MDA trip was one of the (you should excuse the term!) peak experiences of my youth...</p>"
}
