{
 "title": "Drug of Choice",
 "author": "Pharmboy",
 "citation": "   Pharmboy. \"Drug of Choice: experience with Tramadol (ID 26625)\". Erowid.org. Jun 19, 2007. erowid.org/exp/26625",
 "substance": "Tramadol",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26625",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 5351",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIve used Tramadol off and on for about a year, usually between 200mg  300mg.  To me its the most pleasant social opiate-like high because it lacks the drowsiness that often accompanies hydrocodone, oxycodone, opium, and heroin but it maintains a stable euphoric feeling of connection with people around me.  <br>Usually a high starts about thirty minutes after ingestion and a seeping rush follows for about an hour.  Then I pretty much feel waves of relaxation and analgesia and this lasts a good 2  3 hours more.  I usually like taking it in the evening because it gives me vivid, pleasant dreams at night, but on certain occasions Ive taken it early in the day and the pleasant social feeling lasts pretty much all day.  Whats most interesting and unique about Tramadol is its speedy quality that intensifies with physical activity.  <br>After a relaxed evening with some friends, I sometimes go for long long walks because the more my body moves the more speedy and euphoric and intense the high becomes.  Ive tried a wide variety of opiates because its easily my favorite class of drugs and while Tramadol does not produce the most intense waking-dream high it allows for a more socially functional high.  And if youre looking for the waking-dream, Tramadol is great to take if Im going out with friends to a movie I know is terrible.  When my body is at rest, the drug reverts back to a more traditional hydrocodone-type high.  Then with movement, the speedy feeling returns.<br>The effects of Tramadol are difficult to describe but generally I would classify it as an extreme mood boost that often, in my case, allows me to work out problems more clearly and less self-destructively.  Its not exactly a real high in like a trippy sense but more like a boost (the kind of boost some people experience with smaller amounts of alcohol, but minus the impairment).<br>When I started using Tramadol I only did it on weekends but during a particularly boring and depressing time in my life I did up my usage to almost daily and I did develop a tolerance.  However, the eventual withdrawal I experienced was peanuts compared to what many people describe with other opiatesa little diarrhea and a few headaches that Asprin fixed.  I think the diarrhea comes from constipation relief, although Tramadol doesnt constipate me very noticeable (but it does make my waste have a harder consistency, not to be graphic).  <br>Also, other side effects Ive experienced is dry mouth and sometimes drowsiness when driving for many hours.\n\n\n"
}
