{
 "title": "Inter Generational Ecstasy",
 "author": "redleb",
 "citation": "   redleb. \"Inter Generational Ecstasy: experience with MDMA (ID 26702)\". Erowid.org. Sep 9, 2003. erowid.org/exp/26702",
 "substance": "MDMA",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2003",
   "26702",
   "Not Specified",
   " ",
   "Not Given",
   "Sep 9, 2003",
   "Views: 29279",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI guess some would call me a drug-slut. I have been altering my consciousness with illegal substances for more than 30 years. I love it. I try and persuade myself that I am always indulging in a learning experience, but the recreational appeal is always there, even when I learn nothing  which after 30 years practice is fairly often.</p><p>I live alone, and while I smoke grass with people in my tiny fishing village, taking anything more heavy duty is usually alone, unless its with my partner who lives 3000 miles away in New York. Our favourite is Ecstasy, which I can get as pure crystal. A mutual friend once said that  LSD was the work, and Ecstasy is our reward.</p><p>This summer my teenage goddaughter came to stay. Childfree all my life (now 50) this was to be a whole new experience for me. Her relationship with her mother had completely broken down, and mindful that her late father who died when she was five was my best friend, it was a no-brainer to invite her to stay. I hardly knew her; we had perhaps spent only a few hours alone together in her not quite eighteen years. I did know that she had had her first Ecstasy experience, and from her description it was definitely NOT the real thing. </p><p>She had a LOT of psychological problems, total lack of self-confidence, very poor self-image, several neuroses (spiders for example)  a real mixed bag of teenage uncertainties. And of course a complete distrust of deep inter-personal relationships, which had only caused pain or abandonment in her life.</p><p>A stunning looking young woman turned up at the train station. Her uncanny resemblance to her father, who was almost too pretty to be heterosexual, took a long time to ware off, especially since her lack of confidence allowed for very little eye contact.</p><p>The next morning, after an evening of small talk and pleasantries, I suggested we take ecstasy and go to the beach. She was even more enthusiastic than I was.</p><p>I chose a particularly beautiful and private bay a mile from my house. It was a gorgeous day. It changed both of us, I hope forever. </p><p>What little knowledge of E that she had, was the usual teenage night-tripin, trance-dancin party stuff. She had no idea that it was the ultimate therapeutic tool. </p><p>We talked about why she felt badly about herself, we talked about her father, we discussed relationships, commitment, life, and we played in the sand and gee-whizzed at the life in the rock pools. I played my role, which I thought was therapist, not therapee, very well, I got her to say the affirmative things about herself that she so badly needed to hear. We talked and talked and talked  try this for size a couple of hours in to the trip</p><p>If my father, knowing he was dying, could have given me one piece of advice, what would it be?</p><p>And with that sure-shot E head on, I told her He would have told you to have a plan  his whole life was a series of accidents, and the chaos led to his death. You need a plan</p><p>That was typical of the stuff we threw at one another. </p><p>Most important of all we established the kind of loving relationship that could take years to develop without the openness and straight-to-the-heartness of E.</p><p>Now I am a pretty hard-bitten cynical old hippie. I run my high tech business, I get stoned, I fly to New York and I am intimate with the woman I love. Nobody else gets close. I came out of that morning feeling, I still feel, a deep emotional bond with someone I am not having sex with. Parents would understand. Just who was the therapist that morning is less clear. </p><p>On a subsequent E trip she completely overcame her fear of spiders  she was a real screamer. When she arrived we had to check the house together for spiders eggs (!?) I now have a photo of one running up her arm while she giggles with delight. </p><p>The summers just ended. She has gone home to stay with her mother. She believed me when I told her that a sure sign of growing up is when you realise every word your mother said turns out to be true. It seems to be going well. She started college last week  I wont bore you with what a triumph that is. </p><p>Me? I now share some of the responsibilities and pleasures of parenthood, I guess. Before she left during our third and last trip she said People are always saying that my father was worthless, he left me nothing  but he left me you, and thats more important than anything else he could have left. I wont forget that in a hurry.</p><p>Parents. Worried about your kids taking E? The only thing to worry about is missing the opportunity of taking it with them. A friend assures me that when he took it for the first time with his 19-year-old son, he hadnt felt so close to him since he wiped him clean of afterbirth. </p><p>Kids. Taking E? Turn the music down AND TALK TO ONE ANOTHER!!</p>"
}
