{
 "title": "Yellow Jackets",
 "author": "Trucker speed",
 "citation": "   Trucker speed. \"Yellow Jackets: experience with Ephedrine (ID 26705)\". Erowid.org. Jan 14, 2007. erowid.org/exp/26705",
 "substance": "Ephedrine",
 "bodyweight": "117 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "Ephedrine",
   "(capsule)",
   " ",
   "2 capsls",
   "oral",
   "Ephedrine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26705",
   "Female",
   " ",
   "Not Given",
   "Jan 14, 2007",
   "Views: 51505",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I bought a yellow jacket, I had been in the vitamin and healthfood store searching for Stacker 3's, another ephedra loaded stimulant.  I was amazed at the wide spectrum these pills were available in: pink/purple, neon yellow, yellow/purple, blue/black. I parked in front of the aisle for over an hour, comparing lables to see which had the most caffeine, and settled for the Yellow Jackets. They were half yellow with black stipes,and half black. They looked like candy, and I paid $30 for the treasure and hurried home.</p><p>I took great care to read the label and make sure everything was legit. I couldn't wait to try one. Apparently the only 'horrible' symptoms were accelerated heart beat, and nausea. I was already on a caffiene diet pill, so I delayed trying them till the next morning.</p><p>When I opened the bottle, the first thing to hit my nose was an incredibly funky scent. I removed the cotton 'filler', dumped the pills onto my bed, and picked up one. I hadn't eatten yet, and one of the side effects was 'loss of apetite'. The bottle also said not to exceed 3 daily, so I felt I was safe. I took one at 7:00 am with a cup of diet soda.</p><p>The pill tasted awful, but I quickly forgot about it and hurried off on a 2 1/2 mile walk to school which usually took 40 minutes. I got there in record time at 7:20 and had time to kill.</p><p>A bunch of girls from school came over to talk to me. Ususally they annoyed me, but for some reason, I was able to tolerate them, and even joked with them.</p><p>I entered school and everybody instantly noticed how great my attitude was. I played the best kickball game ever in gym class, and I wasn't even winded.  My pulse was well over 17 beats per 5 seconds. By the time lunch had rolled around, I'd long forgotten about my hunger, and I wasn't even feeling remotely nauseous.</p><p>At around 2 I was sitting in detention afterschool, and I suddenly started laughing~FOR NO APPARENT REASON! I just felt so good, and I wanted to go outside and run home. I could barely sit still and I couldn't concentrate on anything-or else I concentrated so hard, I couldn't hear a thing!</p><p>At 2:30, 10 minutes before I could go home, I felt a sudden cold drain take over my body, and exhaustion struck for the first time all day. I could barely lift my head up when we were finally dismissed. Walking home took the longest time ever, and I was so beat, I immediately passed out on my bed and was unable to move for several hours. My pulse beat hard and slowly out of my neck. At around 5 I mustered the strength to slap my hand to my neck, and took my pulse. It was beating less than 2 beats a second. I fell asleep, and when I awoke a few hours later, I immediately had to take a shit. It was the worse case of diareah ever, and I wasn't hungry at all.</p><p>When I got on the scale later that night, I saw that I'd lost 6 pounds. That was excellent. I vowed to continue using the drug the next day. This time, I took 2 yellow jackets, and instead of zooming through the entire day, I was wired and jittery. I could barely write, and I figdgeted all day, or zoned out staring at my pencil. I was full of energy and when school got out, I ran all the way home without stopping. I wuz still super hyper, and I began speed walking around my house, snapping my fingers like a maniac to reduce the speed. I eventually began doing hundreds of pushups and found they were easier to do than ever. They put me into a sort of trance.</p><p>Later that night, when I tried to sleep, I couldn't. My heart was beating too fast and I thought I was going to have a heart attack. It was also skipping beats and very irregular. The next morning, I awoke with numb arms. I thought I was paralized but after a minute or so, they were fine. My hair and scalp were tingling as though they were suddenly growing, and my face itched. However, I found that I had lost 4 more pounds.</p><p>I've done yellow jackets since then, and have had no trouble with them now that I know what to expect: Diareah, naseoua, loss of apetite, tingling, and irregular heart beating. Also,I keep talking more when I'm on it.</p>"
}
