{
 "title": "An Incredible yet Terrifying Experience",
 "author": "Adam",
 "citation": "   Adam. \"An Incredible yet Terrifying Experience: experience with Salvia divinorum (ID 2671)\". Erowid.org. Nov 9, 2001. erowid.org/exp/2671",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2671",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2001",
   "Views: 9950",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n\tWhen I first learned of the legal drug, Salvia divinorum, and read some other peoples experiences with it, I was eager to try this strange plant.  I had no idea what I was in for, and nothing Ive ever experienced, not marijuana, not shrooms, not anything I had done before prepared me for the experience.</p><p>\tAfter getting about a half ounce of Salvia, two friends and I went out to a family members cabin.  We filled up a bong with clean water and packed a tight bowl of about three medium sized dry leaves.  After passing the bong around one time, refilling the bowl once, I felt a strange buzz begin immediately that loosely resembled being stoned, but was somehow different.  After about five minutes, nothing else happened, so we loaded up another bowl and passed it around, and all this did was renew the buzz.  Finally, disappointed, we all went into the cabin and sat around for a while, and in about twenty minutes, the buzz was gone.  One of my friends, well call him S., thought that maybe the screen was getting clogged and so we werent getting enough smoke earlier.  I checked it out, and sure as hell, the screen was clogged and choked with partially burned Salvia and weed resin.  So, I cleaned it out and packed a looser bowl, just one leaf.  I sat down on the couch, took a big hit out of the bong that drained the bowl, and I almost coughed from the volume of smoke.  Remembering what I had read online somewhere, I glanced down at my watch and kept the hit in for 25 seconds.  I had no idea what was about to happen.</p><p>\tI started feeling something right after I let out the hit, first just the weird buzz, then within about 20 or 30 seconds, my world changed drasticallly.  My friends tell me I was out of it for about three to five minutes, and I will do my best to put into words what happened in that time period, but the truth is that words can never describe completely what I felt.</p><p>\tAt first, I felt like I was receding from the world and everything I had known to be reality was slipping from my grasp.  I remember saying, Oh, fuck, guys, I am really getting fucked up.  That was the last I said during the experience.  During this, I had a strange feeling all over my body. It felt like narrow, long lines of steady and uncomfortable, although not painful, pressure, as though the sides of numerous boards were being pressed against me.  However, I was still sitting on the soft couch.  At this point, I began experiencing some anxiety over the intensity of the experience, although I was still closer to reality than I would be just seconds later.</p><p>\tPerhaps a minute into it, I suddenly felt as though my mind, my consciousness, my being, were all being stretched to my left into the infinity of some other, strange world.  In that world, I sensed, not saw or heard or felt or anything like that, but somehow sensed the presence of two people, a man and a woman, and either a horse or a unicorn, Im not sure which.  Then, my spread legs started to form the beginnings of a V-shape like that of a partially opened book, and these extended into infinity and divided the world into three parts.  The people and the horse were still there, as was the sensation of pressure.</p><p>\tI was really scared by this time, as the experience was incredibly intense and foreign to me, and I started breathing quick, shallow breaths.  My friends tell me that my skin turned pale and gray and I started to sweat.  My connection to reality at this time was tenuous at best and my identity was being lost.  Then, the experience deepened further as I truly did lose my identity. I became aware that I was some kind of plant.  I was distantly aware of my friends, although I didnt know who they were, and I also remember thinking that they knew I was a plant, and that they were aware of this woman who kept passing by and tending or harvesting me, Im not sure what.  Through this, I knew that something was wrong with all of this, and I was deeply terrified.  Then, I could actually see the world with my eyes again, and although the strange open book sensation and most of the other aspects of the trip remained, I realized who I was and what I was doing.  Terrified of all the strangeness, I desperately wished for it to end.  Finally, I leaned over and focused on a pattern on the couch, using it as a lifeline of reality.  Within the next half a minute, the extreme sensations of the trip faded, and although there remained the weird buzz, I wasnt nearly as far gone as I was just a minute previously.</p><p>\tImmensely relieved to be back, I started spouting the details as best as I could to my friends.  They told me that while I was tripping I was completely oblivious to everything, and the only noise I made was to cry out once and put my face in my hands, while breathing very fast.</p><p>\tAs for the trips of my friends, one of them, S., had a far-out experience off of one large bong hit, while the other got nothing more than a buzz off of two huge bong hits.  Afterwards, S., who has experienced many, many drugs, and I discussed what had happened, and we came to similar conclusions.  Salvia divinorum is unlike anything else, and nothing can prepare you for it.  Still, even though the experience terrified me, it was brief, and it was truly the most amazing thing Ive ever experienced.  I am definitely going to try it again, but with a newfound respect for this plant and what it can do.</p>"
}
