{
 "title": "That's Where I Met That Lady and Her Kid",
 "author": "Kyle",
 "citation": "   Kyle. \"That's Where I Met That Lady and Her Kid: experience with Salvia divinorum (ID 26735)\". Erowid.org. Apr 20, 2006. erowid.org/exp/26735",
 "substance": "Salvia divinorum",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26735",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 20, 2006",
   "Views: 3066",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I heard about salvia from on of my friends and was quite eager to try it after hearing about it.  So as any other curious mind is I decided to try it.</p><p>We were sitting in my buddies car I was in the front seat and my bud was in the backseat and my other friend was driving.  We packed the first bowl and I was the first to hit it so it did, as soon as i exhaled the smoke I was quite unaware of what hit me, It felt almost like a big oval shape toilet paper roll covered in smooth spikes was molding my body into an L shape. I said man, this is crazy gimme another hit, so I took another one.  </p><p>I immediately lost consciousness and an insanely strong force pulled me somewhere else.  I felt like I was sitting in a whole bunch of ice cream and the window that I was leaning against was a big sheet of ice cream splitting my head in half.  As I looked on one side of the plate of ice cream it was this playskool, plastic-like world where this lady and her little boy were pushing a stroller up and down the street over and over.  I could figure out what was going on. At the same time I could hear my buddies laughing at me in the background and for some reason it made qiute angry and really really scared.  </p><p>All of a sudden I came to and was like what the hell just happened, I could figure it out.  I was feeling an incredible feeling, almost as if i had pins and needles all over my body but it was 1000 times worse than I had ever had them, and that were little hands pulling at the skin on my back.  This feeling went on for about half an hour.  I finally came back to full reality and could figure out what just happened,  to me it was something absolutley insane and out of this world I have never seen anything like and never will again, unless on salvia. </p><p>After trying it a gew more times I became extremely scared and worried and thought everyone was out to get me while I was high. Needless to say I refrained from using it again.</p>"
}
