{
 "title": "Fun with My New Friend",
 "author": "En Vision",
 "citation": "   En Vision. \"Fun with My New Friend: experience with Phentermine (ID 26741)\". Erowid.org. Jun 1, 2006. erowid.org/exp/26741",
 "substance": "Phentermine",
 "bodyweight": "162 lb",
 "header": [
  [
   "DOSE:",
   "37.5 mg",
   "oral",
   "Pharms - Phentermine",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26741",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jun 1, 2006",
   "Views: 21665",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I orally took a 37.5MG phentermine I got from a friend when I went to see The Dead. I was apprehensive about taking a pharmacutical because I tend to prefer ingesting natural chemicals. I had a beer while waiting for any effects.  </p><p>About an hour after taking the phentermine I began to notice I was talking alot more than usual, cracking jokes, and just generally being at ease socially. I felt full of energy. We went into the show and it was quite crowded. I usually would feel a bit edgy being so crowded in, but instead I was feeling very sure of myself and sure-footed. I had plenty of time to react appropriately and could cut through the crowd with ease.  Mental clarity was the best effect, though, and although the friend I was with was feeling very anxious, I felt I could still maintain my own clarity and good feelings while still being attentive and comforting to her.</p><p>I had a big smile on my face and felt very peaceful. I noticed that every sip of beer seemed to diminish my energetic state, so I stopped drinking it.</p><p>After the show, only 6 hours after I took the phentermine, I felt very drowsy. Sure enough, I had no trouble falling asleep.</p><p>I've since enjoyed phentermine on a few occasions: trancedance parties, club nights, an especially demanding day at work, and most pleasurably at a water-park this past summer.  I've tried as much as 2 pills at a time and that was great too. I felt fast, clear, content, energized.</p><p>However, that first time was a bit of an anomaly in that I now absolutely cannot sleep for at least 12 hours after I take it. Blink blink. I tried to sleep and I felt really weird, like my body was made out of wood-- like my body was asleep but I was still wide awake in my head.</p><p>Also, I've noticed a bit of trend that I get a bit anxious at the tail end of the phentermine trip.  This is usually remedied by remembering I'm on a drug and cuddling or socializing with people or even just a meal and a drink. </p><p>I'm beginning to build up a small tolerance to the phentermine, requiring more than 1 pill. This makes me sad, as I only get to use it for a little longer before it's useless.</p><p>Yes, it does surpress my appetite.  </p><p>I know it is only a diet pill, but it has made difference in my life; I'm more open to trying other pharmacuticals, I feel better about going out and not having to worry about being too drunk to drive home, and I feel like I can dance all night and be on top of situations as they come up.  </p><p>I think of Phentermine as MDMA's baby sister-- it's not going to take me to that warm cocoon but at least it's not going to wallop me for the next 3 days.  No noticeable hangover.</p>"
}
