{
 "title": "So Peaceful",
 "author": "PartTimer",
 "citation": "Citation:   PartTimer. \"So Peaceful: experience with Salvia splendens (ID 26748)\". Erowid.org. Apr 21, 2006. erowid.org/exp/26748",
 "substance": "Salvia splendens",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia splendens",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26748",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 21, 2006",
   "Views: 6491",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me first qualify myself.  I have been a drug user for over 15 years now and have tried almost everything, from DMT to LSD to heroin, to mj.   Recently I tried Salvia D. for the first time.  I did the 5x stuff.  Ok a little intence even a low doses but no too bad, butI perfer the body high over the mental 'fuzz'. \r\nI have been doing some research with Salvia Splendens Vars. Not Divinoram.  Let say without any doubt that this IS A PSYCH0ACTIVE PLANT.  Although I have not tried all varieties of Splendens so far almost all have gotten me 'there'.  \r\nI have about 6 varieties of this wonderful plant growing in my yard. I have dwarf, full size, purple, red, white and pink.  So far all have definate psychoactive properties.  ALL are SPLENDENS. \r\nI usually feel the effects after 1 bowl. A wonderful high does not do this plant justice. It is an opiate-like wonderous body high. Very floaty, with just a touch of MJ like feeling. Almost like I smoked a small bowl of opium. For these reasons I belive that it has serious potental for abuse, and possibly addiction.  \r\nAfter 3 bowls the effects are somewhat similar to a very weak dose of Divinoram with that excellent body high, that keeps growing with each bowl.  The effects last longer than Divinoram up to 2 hours depending on how much used and how long I have smoked for.  \r\nI have gone to work on this substance w/o any ill effects.  There is no comedown and no hangover.\n\n\n"
}