{
 "title": "Palm Trees",
 "author": "k",
 "citation": "   k. \"Palm Trees: experience with Cannabis (ID 2677)\". Erowid.org. Nov 24, 2001. erowid.org/exp/2677",
 "substance": "Cannabis",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2677",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 24, 2001",
   "Views: 7178",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI went to my friend's sister's new apartment one weekend in march. It had been a crazy weekend of getting drunk and partying. My friend's sister is in college so I knew we would either be drinking or smoking. </p><p>We walk into her apartment to find only one of her roommates. I grab a beer out of the fridge and sit down. Her sister quickly asks me if I want to smoke. I say sure, but refuse the use of a huge bong, because it looked too overwhelming. She comes back into the room with a mushroom shaped bowl that was from Woodstock 99. She packs it up for me and shows me a tiny carb. All the while everyone else is drinking beers. </p><p>We turn on South Park The Movie for laughs, and I begin to smoke. For some odd reason I took in this weed different from any other time. It was as if the smoke was the air and all I was doing was taking a huge relaxing breath. I exhale my first hit after holding it in for a decent 30 seconds. I blow it out of my nose and instantly my eyes swell and start to shut. I think nothing of it and take another hit. By this time I'm insanely high.</p><p>I watch South Park and laugh at stupid shit, not realizing yet that I'm so high, and not fully understanding why I'm so tired. Somehow I thought it was shitty weed and I wouldn't feel a thing.</p><p>Soon I get distracted and begin to talk to my friend's sister. I come up with this crazy idea that she has an accent and that she sounds exactly like my cousins. As I'm talking with her, she points out that I look 'really stoned.' I begin to lose my train of thought and the entire point to the accent bullshit. Then it hits me! fuck! I'm soo high!!! I proceed to bug the fuck out and tell my friend that we have to leave. I cause an uproar, and begin to insist the weed is laced (either it was laced, or it was just damn good). My friend's sister is saying it's not, but I continue to believe it is. If I think back, my friend and her sister were probably trying to calm me down, but I felt like they were annoyed with me the entire time, so it made things way worse.</p><p>I walk into the kitchen and begin to complain of nausea, and also I start to whine in a helpless tone for someone to stay with me, someone help me, I'm out of my fucking mind and have not a clue what to do.</p><p>My friend and her sister take me into a roommate's bedroom that has red lights done all around the ceiling. This was a damn good idea, it was a calming place to take me and it helped, but slowly. I tell these whack-ass stories about people that make no sense, but everyone is acting interested. I'm cool with that. On occasion the nausea comes back, so I have to kick my legs to try and forget about it. I must have looked like a real mental case. </p><p>My friend and her sister leave the room and let me calm down. I close my eyes and think about suicide and the world in general being chunked together in a pyramid. My mind is racing and I'm thinking mostly about death. I open my eyes to stop it. I shut them again and see palm trees everywhere. Palm trees?? Don't ask, I have no clue. Finally I say to myself, you have to stop, get up, drive and get home.</p><p>I walk into the kitchen where water and rice is waiting for me. Still shaken up, I drink, but barely touch the rice. I spend forever trying to find my car keys when they are in front of my face the entire time. My friend and I get in my car. She is concerned, I had never driven high before. I get in, start my car and drive. I had never felt such a great feeling, the wheel spinning as I made a turn, my Paul Oakenfold and Sascha bumping perfectly. This experience was terrible, yet thrilling and calming at the same time. I was just really high, and after the scary peak, I came down slow, but such a dope slow. It was nuts.</p>"
}
