{
 "title": "What the hell...?",
 "author": "Bun",
 "citation": "   Bun. \"What the hell...?: experience with PCP (ID 26772)\". Erowid.org. Feb 28, 2004. erowid.org/exp/26772",
 "substance": "PCP",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "smoked",
   "PCP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26772",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2004",
   "Views: 66339",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have experimented with several drugs in my lifetime though never wished to make a lifestyle of it. After going from weed to dxm and acid, I kinda wanted something in between or adjacent to those experiences. PCP seemed to be it.</p><p>So I gave my dealer friend [D] a call and found out that one of his best friends smokes that shit every week so getting it would be no problem. He comes by my house and I give him 55 dollars: 40 dollars for PCP, 10 dollars for weed (so you don't waste any PCP), and 5 dollars for a PCP pipe if he could find one. He came by several hours later with a small rock that smelled really weird. He couldn't land me a pipe so I smoked out of his friend's who was with him at the time. Since he couldn't get me a pipe or weed that night, he just put all the money into PCP.</p><p>The way it works is that you break off a really really really tiny chunk and stick in the end of the pipe. You suck ridiculously softly and in the words of one of my friends in reference to his shitty bong, 'Dude, you gotta baby it.' I mean you have to suck really softly, as though it were it your first cigarette and you were only 4 months old or something.</p><p>The stuff vaporizes on contact and all you gotta do is suck it all in before your lighter goes out. It is really hard to master it. Anyway, we drove around my neighborhood matching hits and exchanging the pipe. I had 2 hits that night and felt like I had smoked some weed laced with DXM...yes, I know it doesn't exist, but still. :D</p><p>So I went home and broke up my rock into about 25 hits, give or take 5 or so. As soon as I could, I landed myself a pipe and got out on my roof. I had brought some Floyd and had planned for a good night.</p><p>I took two hits immediately, holding in the smoke for as long as in humanly possible. I followed with two more thinking that was all I needed. But twenty minutes later I didn't feel that different. So I took another one...</p><p>Ten minutes later, all the lights in the sky and the lights from houses all around started going in and out, exchanging placements. My whole perspective of vision had a slant to it and would spin on a central axis if I didn't control it. Dark Side helped this out a little bit too. I laid down on my roof and looked around for a good 20 minutes. I smoked a couple cigarettes and with each one, I became so high it was ridiculous.</p><p>Then my limbs became long, and I felt like I was continually falling through the roof but never actually falling down. I got up and the whole world was swirling. Somehow I managed to get back in my room where I looked at the ceiling. I knew that I hadn't even reached a plateau yet and cursed myself for taking another hit.</p><p>I went outside and made a few calls and then...zzzrrrrmm ... whawhawhawhawha...</p><p>Reality took a step in the background and the metaphysical realm took over. Weird sounds and feeling permeated every cell of my being. I lied down on the side of the road on a gutter man-hole. My head loosened itself from my body and wiggled itself backwards through some plants. I jerked myself up and it came back. I didn't really like that very much, so I got up and all the sudden...I felt like running.</p><p>I ran and ran and ran...I ran until my muscles burned and my veins pumped battery acid. Then I ran some more.  My whole vision entered into a tunnel and I was running in a 10 degree sphere of sight...It was really really really strange. I felt so powerful that I just kept on running. I only realized I was tired the next day.</p><p>I thought it a good idea to go back in my house at this time. I entered my basement and sat down on the couch and watched my whole world swirl. This didn't last long and I was quickly back in my room listening to Floyd...I fell asleep like this several hours later. A combination of Dark Side, The Wall, and A Momentary Lapse of Reason really kicked my up top notch. The next morning I was unbelievably EXHAUSTED though. This lasted for another day thought not as bad.</p><p>When I think back on it, it really wasn't that FUN. It was messed up and weird, sure, but the psychadlics and narcotics are so much better. Do it if you want, folks, but I think it's just a little overrated for this day and age. PCP is for the late 70's early 80's crew...and they were a weird bunch.</p>"
}
