{
 "title": "Screaming And Hollering For Joy",
 "author": "Alex",
 "citation": "   Alex. \"Screaming And Hollering For Joy: experience with Cocaine (ID 26807)\". Erowid.org. Feb 8, 2004. erowid.org/exp/26807",
 "substance": "Cocaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26807",
   "Male",
   " ",
   "Not Given",
   "Feb 8, 2004",
   "Views: 21446",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI recently tried cocaine for the first time. I found that procuring it was obviously quite different than hooking up some weed; most people were very unreliable about what they had and when it was available. The first day i was supposed to try it the deal bailed, but the next day, which was a friday, I was able to get some. We weighed it on my Buddy's scale (he's a dealer, and has done quite a few more drugs than me) and the weight came up 2.00 grams exactly, including the baggie. My buddy said that's right, the bag weighs .25 grams and so the amount of coke should be 1.75 grams. It was rocks and dust, and seemed to be white with a tinge of yellow. My buddy brought out his cutting stone, and we broke some rocks up. We gummed some to make sure everything seemed alright, then my friend did a line.</p><p>When I put the dust on my gums, nothing happened. the next thing i remember is not feeling my mouth. Everything seemed somehow slightly different; I went to look at myself in the mirror, overwhelmed by the fact that i was going to do cocaine. i had seen people do coke a few times before, but actually putting that up my nose was different then being around it. At the stone, my buddy had drawn out 6 lines; smiling, he said, 'Fool, we're gonna do this! Get the fu** over here and blow your nose.'</p><p>After he did a line, I did one too. Then he did another, and so did I. I felt it almost instantaneously. I felt like beating my chest, whooping and screaming and hollering for joy, but I was too content to do so. I looked at him and smiled, and he smiled back. Nothing much mattered after that. In fact, that's where the emotion ended that night. We snorted at 8:15, and around 9:30 I went to meet some friends of mine, and chilled while some of them passed a bowl. They could tell something was different, but not what. I was acting normal, but I already wanted more at 11:15, so i cut out another line.</p><p>I used it while I had it, before school and after. I tried to conserve it, but it was gone after 5 days. I was suprised, my friend kept telling me that I might be disappointed by the feeling, but I loved it. It didn't change much except how I felt, which was alot. It just made me feel good, and i can see why it could be so addictive. I was suprised that it didn't burn at all in my nose, which I heard was a sign of good coke. I've seen my friends do lines that make their nose bleed cause they're so dirty, but this was clean. My friend said it was the most pleasureable it's ever been. i dont think it was cut with speed cause we never got all crazy off it, like running around full of way to much energy. It was good, the best feeling I've ever had. Like every moment that I was on it felt so good. It crept up on me; before I knew it I had been on it for 5 days and I was out. I didn't panic or anything, but I couldn't get the feeling that I was missing someting out of my head. </p><p>I smoked twice the day I stopped snorting, and 3 times the day after, and it hasn't come close to making me feel complete the way it did on cocaine, drinking doesn't even seem appealing anymore. It has definately upped the ante, and it's true that once is enough; now that I've reached that state, that can't be reached any other way, when I want to get fu**ed up i'm gonna think of some coke.</p><p>Peace and be Safe!</p>"
}
