{
 "title": "Third Time's A Charm",
 "author": "dork",
 "citation": "   dork. \"Third Time's A Charm: experience with DXM (ID 2682)\". Erowid.org. Nov 27, 2001. erowid.org/exp/2682",
 "substance": "DXM",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2682",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 27, 2001",
   "Views: 44981",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nWell, first of all, I tried DXM twice before.  A friend came over and gave me like half a bag of the powder.  It was probably more than an ounce.  The first time I took it, I passed out cold after 10 minutes of indigestion.  My friend, though, said he tripped the whole night.  I felt bad for making him trip by himself.  But anyways, the second time the same damn thing happened to me.  <br>OK...so now we come to the third time.  It was a friday night and I did not feel like going out and I knew I had the rest of that stuff.  So I told my roomate that I was going to eat the rest of the bag and for him to leave me alone in my room unless I really start screaming or something.  So I ate the two tablespoons, in a small glass of wine, and freaking five minutes later I was in my room and I started to feel really wierd.  Then all of a sudden my head felt like it had needles poking into it and it itched really really bad, but I would scratch it and it really wouldn't go away.  So I decided to take a shower and get ready for whatever was in store (mind you...it has been FIVE minutes!) OK...so I am in the shower and it really starts to hit.  I started to get really dizzy and put my head on the wall and let the water run all over me.  It wasn't as cool as I thought it was going to be.  <br>So I got out of the shower and barely made it to my room.  I just collapsed in my bed (now its been like 20 minutes).  I started seeing all kinds of stuff in the shadows.  I had my Aiwa stereo on and the lights from the music made these dancing 'figures' all over my room.  I was not scared at all.  I just felt really 'wierd'...actually really really really wierd.  I ended up laying there and manifested this whole party at my house.  I dont know how long it lasted because at this time I could not see at all.  I could see, but, for example, when I looked at my alarm clock, it looked like the numbers were moving up and down really really fast in about an 8 inch high motion.  And I kept hearing all kinds of stuff.  I cant really describe it, just like scratching sounds, like if you ran an electrified wire over a metal surface...kind like a welding machine.  And other sound as well, like just echos of noises...nothing I can pinpoint at all.  <br>But anyways, back to the story.  I ended up meeting all these people at MY party!  It was like there were all these people at my house and I was 'floating' around very peacfully introducing myself and welcoming them to my house.   Then I remember things got really wierd at the 'party'.  There were these girls and they were upset at me because I did not have the right furniture in my house.  This made me feel very strange.  At that time I came back to my room and was once again in my bed.  This is when I realized just how fucked up I really was and just decided to sleep it off.<br>Well of course that didn't work so I called my roomates girlfriend to come up and just talk to me (I was not freaking out at all...I just wanted to talk to someone for a little while).  Well she came up and asked me what up and when I tried to talk I couldn't!  I had to concentrate really hard to get a word out and when it came out I said the word like 30-40 times.  I couldn't stop saying the words.  AT ALL!  For example, I tried to tell her this 'Why did those girls get made because of the furniture?' but it came out like this...'Why Why Why Why Why Why Why Why Why Why Why Why Why did did did did did did did did did did did did did did those thooooose thoooooose thooooose thoooose......'.  I knew I was doing it but I was totally out of control.  Also, when I would talk to her I would raise out of my body from my legs and be 'standing' there like normal.<br>I tried to get out of my bed when I was really phucked up and I could only stand there.  If I moved I would have fallen, I knew that much...so I laid back down.  I liked watching my clock radio.  The numbers...I will never forget that.<br>I ended up falling asleep and waking up the next day still fucked up hard core.  I still could barely walk.  I walked downstairs and looked at the empty bag and just shook my head.  When I did that I saw mad tracers all over and for about the next 7 hours I was constantly seeing stars.<br>I would say that I sobered up on Sunday when I woke up.  In actuality though, I was probably fucked up for a good 15 hours on the shit.<br>Thats all I wanted, just to see what it was like.  Personally I think I over did it because I don't remember much from the night because I was soooo phucked up.  I will never do it again.  I will never forget that awful feeling on my head with the needles.  I had my fun and personal experience.....bye bye DXM.  Peace, Im Out.\n\n\n"
}
