{
 "title": "Shroomy Cookies",
 "author": "Skandre",
 "citation": "   Skandre. \"Shroomy Cookies: experience with Amanita muscaria & Cannabis (ID 26820)\". Erowid.org. Sep 21, 2004. erowid.org/exp/26820",
 "substance": "Amanita muscaria & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 ",
   "oral",
   "Cannabis",
   "(cookie / food)",
   " ",
   "  ",
   "oral",
   "Amanitas - A. muscaria",
   "(cookie / food)",
   "  T+ 1:00",
   "1 ",
   "oral",
   "Cannabis",
   "(cookie / food)",
   " ",
   "  ",
   " ",
   "Amanitas - A. muscaria",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26820",
   "Male",
   " ",
   "Not Given",
   "Sep 21, 2004",
   "Views: 15840",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Around late August of 2003, some friends and I were becoming very excited about the upcoming Radiohead concert at Red Rocks in Colorado. A few days before the show, we were talking about bringing some marijuana and possibly a small bottle of alcohol. We were a bit concerned about the security, so we began to think of ways to be descreet about our intentions. Finally, I had an idea...cookies. I had made up a batch of ganja butter about a month previous, and was looking for something to do with it. I went to the store and bought a box of chocolate chip cookie mix. It required only butter and one egg to be added. I used about 1/4 cup or so of ganja butter and then had an idea...why not add a little Amanita muscaria? I had read in many reports that these two substances synergize well. I took approximately 6 grams of dried Amanita and chopped it as finely as I could. I then added it to the cookie dough. I baked the cookies and let them cool (ended up with a 'bakers' dozen hehe). </p><p>A few hours before the concert was to begin, I munched a cookie...delicious!! I was a bit concerned that they would taste funky with all of my little add-ins, but they tasted as good as any cookie I have ever had. I tried to talk the others into eating one, but they decided to wait until closer to the show. We drove up to Red Rocks, and waited in a long line that was already forming (Red Rocks has open seating). About an hour or so after eating the cookie, I began to notice some effects. I felt the marijuana buzz coming on, but I also noticed another feeling that could only be the Amanitas. Though the dosage was low, there was still a very definate presence of the mushrooms. My friends all decided to eat 2 cookies each at this point, and I had another myself. After about another half an hour, I began to really feel the cookies...I was very stoned...and I was having a slight trip as well! Nothing over the top, but I would not have wanted to ingest any more...it was perfect! </p><p>I was having some unusual effects...not what I would call 'visuals'...I would say more like small 'visions'. Just very peculiar things like a blue pyramid floating in front of me, flashing. It had an eye on top that was very lifelike, in fact, the entire pyramid looked as if it had skin. Very weird. I had never had a vision like this. My evening was filled with these occasional visions. It is this that made me realize how different Amanitas are from Psilocybe mushrooms. With Psilocybe mushrooms, everything sort of waves and breathes, with colors and tracers. With Amanitas, there are occasional weird visions that come and go, accompanied by very deep thoughts. I now feel that Amanitas are probably less recreational and more about true exploration. I look forward to doing this exploration in a relaxed setting, perhaps in the forests of Wyoming. While waiting for the concert to begin, I became somewhat quiet...I was enjoying my buzz immensely, but really felt like I was in 'my own little place'. </p><p>My friends hadn't quite started to get off, so they would occasionally ask me if I was alright. I just smiled and said 'just wait and you'll see'. The concert finally began...it was an amazing show. I am a bit newer to Radiohead, but this show was very well performed, and sounded absolutely incredible (I am now a bigger fan than before). There was an excellent light show. Not to mention Red Rocks in general...what an amazing ampitheater! Built into the mountains overlooking the city of Denver. When the concert was over, we made our way back to the car. One of my friends was really messed up...in a good way. He said, 'I gotta get me some of these mushrooms!' Another friend thanked me and told me that they 'made the show'. I am not sure I fully agree with that...the show was incredible, but these cookies certainly enhanced the experience. Now these guys keep begging me to make another batch of the 'Ganja Amanita' cookies as we now call them. I think I will do just that.</p>"
}
