{
 "title": "The Power of Positive Thought",
 "author": "Gnostikoi",
 "citation": "   Gnostikoi. \"The Power of Positive Thought: experience with 5-Meo-DMT (ID 26825)\". Erowid.org. Sep 15, 2003. erowid.org/exp/26825",
 "substance": "5-Meo-DMT",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26825",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 15, 2003",
   "Views: 17313",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my second experiment with 5-Meo-DMT.  My first had been with 4mg and I had enjoyed it.  I had thought that 4mg was intense, but it did nothing to prepare me for this experience.  I have used many psychedelics in the past and I can honestly say, without any doubt, that I have never tripped so hard in my life as I did with 8mg of 5-Meo-DMT.</p><p>I smoked the dose on aluminum foil with a straw.  As soon as I inhaled I began to trip, and put the apparatus down as quickly as possible and laid back on the floor.  I held the smoke for about 25 seconds, and by the time I exhaled I was tripping unbelievably hard, and that was just the beginning.  Unlike my previous experience, I was having strong LSD-like visuals; my textured ceiling was crawling at what I would roughly estimate to be about a bajillion mph.  It was like watching one of those time lapse movies of a hive of bees, where two days of motion are compressed into a few minutes.  Within 5-10 seconds the experience had become so intense that I felt the need to close my eyes in order to maintain.  I focused on my breathing as a way to keep some sort of sanity - I was trying deep, slow breaths but ended up gasping like an asthmatic.  Oh, well...at least the gasps were rhythmic, which I believe helped.</p><p>As in my previous experience, I reverted to the fetal position.  As I rolled over I opened my eyes, and immediately wished that I hadn't; every surface was boiling, seething, sizzling, melting, and dissolving, all at the same time.   I quickly shut my eyes and began to pray that I would survive this.  I was terrified.  I was certain that I would have a seizure, the intensity was unbearable.  And then, suddenly, I was able to recognize this as a negative line of thought, and more importantly I was able to change it.  I tried to convince myself that I was enjoying it - and it worked!  I felt my mouth stretch into a grin.  I was utterly powerless in the grip of 5-Meo-DMT, and I LOVED it.  The intensity was hitting me in waves, a quick pulse with only a fraction of a second between beats, and each time I felt as if my entire being were disintegrating and then being reassembled, over and over again.  I believe I tried to say something out loud, but I don't know what it was or if I succeeded in making any noise, because I was alone.</p><p>Then, almost as quickly as it had come on, I was coming down.  I opened my eyes and things still looked distorted, but it was perceivably diminishing.  I rolled on my back, still gasping, and said something like 'Oh my fucking god'.  The mental effects departed quickly, but the physical sensation stuck around for a while; my body felt like a guitar string, humming and twitching and shaking like a leaf.  To be honest, the coming down felt like nothing so much as the first few seconds after a really great orgasm.  I suppose both experiences overload the nervous system, so there's a certain similarity.  I laughed out loud, relieved that the trip was over but grateful that it had taken place.  I really wasn't able to move much for five minutes or so; after that I sat up against a wall.  I talked to myself, to make sure that I was still sane (haha!).  Finally I stood and walked around, looked at myself in the mirror (my eyes were very red and dilated).  I felt a little nauseous at first and I thought I might throw up, but I didn't.</p><p>At the time of this writing it's about T + 40 minutes.  I'm still shaking, especially my legs and my hands.  I have the tryptamine taste in my mouth and my throat hurts vaguely, while I have an intense pain in my head.  But I can't stop smiling.  I see 5-Meo-DMT described as 'chemical terror' or 'chemical bliss'; for me it was both.  The peak was more terrifying than any experience I've ever had, it's sheer intensity was almost unbearable, but...there was bliss, too.  My thoughts on 5-Meo-DMT are that I will probably use it at this dosage again.  I do not think I will ever try it at a higher dosage, nor do I think I will try it again at a lower dosage - I have a feeling that this experience took away my ability to enjoy a less intense version of 5-Meo-DMT.  If I ever do decide to try a higher dose, I will NOT do it without a sitter.  It's likely that I will find a sitter even to use it again at this dosage.  It's been said before but I'll say it again: this is a very serious entheogen, the most serious I've encountered, so use it carefully.</p>"
}
