{
 "title": "Night of Auditory Dementia?",
 "author": "viking ray",
 "citation": "   viking ray. \"Night of Auditory Dementia?: experience with Dimenhydrinate (ID 26851)\". Erowid.org. Nov 6, 2003. erowid.org/exp/26851",
 "substance": "Dimenhydrinate",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Dimenhydrinate"
  ]
 ],
 "footer": [
  [
   "2003",
   "26851",
   "Male",
   " ",
   "Not Given",
   "Nov 6, 2003",
   "Views: 13086",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Setting - friends room with friend (D) first time for both of us.  Nothing planned for rest of the night, good mood.</p><p>T + :20 - feeling very lightheaded, try to walk around feeling very drunk without loss of thought process.  </p><p>T + :40 - feeling very heavy, sitting on couch.  I get up to use the bathroom several times, i am feeling stomach pain which is sending me into a bad trip.  Try to keep calm, impending sense of death. My friend who is not feeling anything rationalizes that I will be fine.</p><p>T + 1 - still feeling very heavy, no visuals or auditory hallucinations.  feeling very confused, not feeling pleasent because i have a stomach ache.  </p><p>T + 2 - things start getting wierd.  my friend starts talking to me and responding to what he thinks is me talking.  I tell him i am not talking and he laughs.  I feel sick so i get up to try to puke.  </p><p>T + 2:15 - still in the bathroom, giving up on puking walking out of bathroom i am hit with intense visuals of changing colors for about 10 seconds.  walk back in my friends room, he is talking to himself having a complete conversation i sit down and he explains how he was just talking to me even though i was in the other room.  I am uncomfortable and feeling scared, i try to calm myself down. </p><p>T + 2:45 - staring at my friend we are babeling about non-sense, i am talking to a picture of his mom, she appears to be moving her mouth. </p><p>T + 3:30 - feeling sick, i know i must puke to enjoy myself.  In bathroom i am looking into sink, it fills up with little red spiders.  I am not afriad i find it very interesting, i invite my friend in he sees no spiders.  I still see them and poke at them with my finger and get blood on my finger. I look back down and the blood is off my finger and the small spiders are gone.  My friend leaves me alone again. </p><p>T + 4:00 - still in bathroom havent puked.  I hear my friends outside the bathroom door inviting me downstairs to hang out.  I look outside the door and no one is there.  i thought i heard my friend B who wasn't there the whole night.  While i am puking i become aware of reality for a second and become very happy after i am done puking i start talking to D as if he were there and then i realized he was in the other room. I stagger back into room.</p><p>T + 4:10 - turn around and see my friend J, only for a second and he disapeared.  wierded out and without a stomach ache i go to bed sleep well and wake up next morning feeling hung over.</p><p>Overall it was a very frieghtening expirence, I would do again in a few years but not before then.  Everything seems very real which means this should be done in a controlled setting.</p>"
}
