{
 "title": "Erotic Dementia. Distant Travel.",
 "author": "Alkaloidaholic",
 "citation": "   Alkaloidaholic. \"Erotic Dementia. Distant Travel.: experience with Mandrake (ID 26909)\". Erowid.org. Sep 17, 2003. erowid.org/exp/26909",
 "substance": "Mandrake",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "sublingual",
   "Mandrake",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 26909",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 17, 2003",
   "Views: 36070",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Erotic Dementia: The dream world as induce by Mandragora</p><p>A tincture of 100 grams dried and powdered Mandragora Officinarum was made using ethanol. The reports I've read about high doses of mandrake causing very strong reactions inspired me to keep the dose low. Roughly one half dropper full of this potent liquid was placed under the tongue and remained there for approximately 30 seconds before swallowing. The taste resembled dirt but the alcohol numbed my mouth so it was bearable. </p><p>Within one hour I immediately fell asleep. Throughout the night I kept waking to find myself in another place. As though I have travelled  to a distant land. I could almost describe it as lucid dreaming but it was obvious my mind was not in its proper waking state. Its difficult to recall all  of what had happened that night but it was definitely mysterious. The dreams where extremely erotic and very frightening at the same time. I could swear that I was awake during all of this. I remember tossing about violently staring out over great distances. Psychotic mantras repeating and echoing throughout my mind. Was I awake? My eyes were open but I was asleep. Erotic Dementia. Distant Travel. This experience is worth repeating. Possibly taking a larger amount of this potent liquid. Take care not to ingest to much or you may end up never returning from the dream world induced by Mandragora.</p>"
}
