{
 "title": "A Day to Remember",
 "author": "Roxy",
 "citation": "   Roxy. \"A Day to Remember: experience with MDMA (Ecstasy) (ID 26921)\". Erowid.org. Sep 25, 2006. erowid.org/exp/26921",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 26921",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2006",
   "Views: 33824",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe sounds of the waves were taking over my body.  The sand between my fingers felt magical.  My body swayed with every gust of wind and I felt like I had reached this incredible state of bliss.<br>The first time I took 'E' I was with my best friend, boyfriend, and two of his friends at the beach.  Prior to this experience I had only smoked some pot and taken Ritalin, so this blew my mind. I had heard so many stories of what it's like and how you feel, that I had become so curious that I needed to try it myself. I was so nervous when I was handed that little white pill [a 'harry potter pill'] that I could have thrown up. I hate getting sick to my stomach and that's the only way I can describe the feeling in the pit of my stomach.  Everyone looked at me. It was my turn.  I swallowed it quickly with some water and encouraged my friend to do the same.  She was much more apprehensive than I was, but with a little bit of my pressure, she joined along.  <br>Very excited and anxious, we waited for the effects to begin.  The boys we were with were experienced rollers so we went along with every suggestion they made.  First, we got gallon jugs of water along with gum at the local WaWa then headed for the beach.  Every single thing I felt I had second-guessed it, wondering if the drug had begun working or not.  For about 20 minutes I was disappointed and was beginning to think the pill wasn't going to work.  We all laid down in the sand  and I listened to the other boys talk about how they saw stars moving, and I commented that i didn't feel a thing.  They had told me to let it happen, and to encourage myself instead of saying 'its not working' and 'this sucks'.  I started talking to myself saying that I was going to have fun and that it was going to be worth it. My boyfriend began to rub my shoulders and almost instantaneously, my chest was moving in circles and my body felt like fluid and I wasn't intentionally doing it.  It was just happening.  The boys were excited that it had begun to work and started saying to me 'this is it. doesnt it feel amazing?' amazing it did. Something took over my body and nothing could go wrong.  <br>I was dancing on the beach, my arms and legs moving like a jellyfish, with what probably looked like an odd sense of rhythm, but it was perfect to me. A smile was glued to my face and laughs poured out of my mouth. The beach had a renewed sense of beauty; everything was how it was meant to be. The colors were brighter and more extravagant than any I'd ever seen.  Blue was not just blue.  It was electric. Pink turned into fuschia. Lights flashed across my eyes but seemed to take forever to leave, for even after the light was gone, a trail remained. I began to run and I felt like i could run forever. I would never be out of breath. I would keep going. My arms moved in such odd ways and music could be made out of the simplest of noises.  Another person's touch became intimate, as it felt too good to be innocent. The warmth of another's skin left a wave of tingles across my body although they had only touched my arm. <br>The beach had become a fantasy world, where everyone was happy and smiling. I could talk to anyone and initiate conversation without a second thought.  My self-esteem had risen, for I felt beautiful, invincible and powerful. I felt angelic.  At one point in the night I was so immersed in my roll, peaking actually, and the utopian world around me that I had said 'if this is what angels feel like... kill me now'.  However odd that statement sounds, it was not meant but it was how I felt. <br>My come-down was slow.  I was in this state somewhere between rolling and reality which I enjoyed greatly.  I was having these deep, intellectual thoughts that I had never encountered before and had recieved 'clarity' on many issues and situations that were going on in my life.  Soon, I found myself emotional and crying, for no reason that I could explain, but it just felt right.   Everything that night felt right. It's hard to explain.  It can't be justified by words.  It was an experience that I would relive in a heartbeat, and wouldn't trade for anything.  I had taken ecstacy two times after that, but neither of those experiences could be placed juxtapose to my first time. <br>My friend, on the other hand, was not so lucky. She didn't feel the positive effects of the roll, such as the change of senses, but threw up and went through what seemed to be a come-down.<br>As for something I learned?  Ecstacy is not reality.  While everything may seem wonderful and utopian, it's all the same when you come-down.  Problems and predicaments still remain.  People are still who they are, although they may seem like your best friend and soul mate for those magical three hours.  Ecstacy provides you with a glimpse outside of this 3-dimensional world we know. Just don't get caught in that world of fantasy, cause after all, that's all it is.\n\n\n"
}
