{
 "title": "Philadelphia Heroin",
 "author": "Chris A.",
 "citation": "Citation:   Chris A.. \"Philadelphia Heroin: experience with Heroin (ID 26931)\". Erowid.org. Oct 3, 2005. erowid.org/exp/26931",
 "substance": "Heroin",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "insufflated",
   "Heroin",
   "(powder / crystals)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 26931",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 3, 2005",
   "Views: 66453",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first uses with heroin started after a breakup with a longtime girlfriend.  For those that haven't tried it, it is very similar to prescription pain meds like percocet and oxycontin, just cheaper and stronger. My first few experiences with it were injected.  I always had someone else do it although no one could ever get a vein for me, so I ended up with a few skin bubbles my first few times.  I was conscious of the risks with needles, and didn't always feel comfortable with them, so I always used fresh needles.  But something about it, the fact that it's SO bad and so wrong and I know I shouldn't do it, somehow makes it 10x better.\r\nOn this particular occasion I was back in my hometown in Pennsylvania.  I was really excited to see all my old friends.  My friend and I felt like doing some dope so we took a drive to the city. At about 3:30pm we arrived at the 'block' on York St, where the best heroin can be found. We bought 6 bags of 'XX', very good stuff. I also hadn't eaten a decent meal in about 2 days, so my stomache was anything but prepared for the assault it was about to have on it.\r\nWe started to head back home and on the way we set up a few lines on a book.  I took out my handy straw and did my line, which totalled one full bag. It burned, but I didn't care. Within minutes I felt a rush of warmth and serenity wash over me and I said 'awwww, yeahh... feels good.' \r\nAt that point, I made a call to my ex-girlfriend to try to pick up my stuff from her place.  I tried to be all polite and calm and everything, but she started flipping out for no reason.  She's the definition of BITCH.  So I was pissed off, and I get irritated very easily when I do opiates.  The conversation ended with nothing settled and me steaming with anger.  This was just a prelude to the night I was about to have. \r\nWe continued our drive back to my friends house where the rest of my story continues.  \r\nI was thirsty...REALLY thirsty.  I downed 3 full glasses of water within a minute. I was itching all over, but I was used to it and it was all familar. I felt a little sweaty, yet cold at the same time. All the while still having that nice feeling of heroin. Suddenly, I got a hot flash surround me, and I got that little feeling in my stomache that told me to head for the toilet. So I ran to the bathroom and waited, but nothing happened. Then as I was walking out I barely turned my head in time as I puked into the toilet once. Well, that was quick and painless, eh? If only it was left at that. I went downstairs and we smoked a decent amount of good pot, and that just shot me into another universe, it was crazy. I was crazy. It wasn't that bad of a mix though, I enjoyed it to an extent. Although I think this made my stomache a little more upset..\r\nAfter a while we went out for bit, with my friend driving.  It was maybe 3-4 hours after having taken the heroin that I started to puke often.  I had to open the door of the car every few minutes to throw up. All the while I was downing as much liquid as possible for 2 reasons, 1) to keep myself hydrated and 2) so that the puke would come out easily. It was somewhat amusing. I didn't really care if I died or not, I welcomed death, and still do.\r\nI was so tired, so sleepy, all I wanted to do was shut my damn eyes and go to sleep. I wanted nothing more in this world than to 'catch a nod' and pass out for an eternity. It wasn't even midnight yet when we went back to my friend's girlfriend's house to sleep. I laid down on this big comfy chair with Lords of the Rings playing in the background. I knew there was more than a good chance I wouldn't ever wake up again, I was a little frightened, but I took the risk and closed my eyes and drifted off to sleep within 3 minutes.\r\nI woke up.\r\nI didn't crave heroin when I woke up, I didn't go through withdrawl, I was a little mad because someone had stolen my shit while I was asleep. Other than that I was good.\r\nI had a cigarette and went back to sleep.\n\n\n"
}