{
 "title": "Spiritual Ash",
 "author": "AnonymousMan",
 "citation": "   AnonymousMan. \"Spiritual Ash: experience with Cannabis (oral) (ID 26971)\". Erowid.org. Aug 13, 2005. erowid.org/exp/26971",
 "substance": "Cannabis (oral)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(plant material)",
   "  T+ 0:00",
   "50 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)",
   "  T+ 0:00",
   "3.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Vitamin B-6",
   "(pill / tablet)",
   "  T+ 24:00",
   "6.5 g",
   "oral",
   "Cannabis",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "26971",
   "Male",
   " ",
   "Not Given",
   "Aug 13, 2005",
   "Views: 7069",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Today I am (thankfully) feeling clear-headed enough to recount last night's experience. I must have 'stacked my blocks' properly or else I wouldn't be able to type a single intelligible sentence. Sorry about the length of this report, but I feel it's necessary to let people know what conditions I attributed to the strength of this experience. I believe I was given some insight into the true effects of Salvia yesterday.</p><p>Anyway, some background:</p><p>I consider myself a fairly seasoned tripper, with a few intense experiences behind me. I've tried many different things: pot, LSD, psilocybin mushrooms, Coricidin (yechh!), Salvia divinorum, San Pedro, Morning Glory Seeds, HBWR seeds, plus inhalants a couple of times (very stupid idea, inhalants can cause permanent brain damage). I am also into 2d and 3d art quite a bit, and tend to understand the world in terms of visual representation, however abstract the ideas might be. Along with all of this, I've had a history of depression and moments of extreme social dissociation (for lack of a better description).</p><p>Now, it may help to note that I have been on fluoxetine (Prozac) for about 6 weeks, 20mg a pill, one pill a day. It had been at least 3 months since I had smoked pot, and about 5 months since I had smoked any Salvia. Recently, I decided to try tripping again. I figured Salvia divinorum would be the obvious choice, since the trip lasts only a few minutes at best, and doesn't seem to be causing lasting neurological damage to those who partake of it (though it might be too early to tell just yet). The Salvia trip is a total mind fuck, but I never felt any real fear while on it.</p><p>Anyway, it all started the day before yesterday when I tried a slightly higher dose of Salvia leaf. It made me feel like I was breaking up into smaller pieces. I could feel my body slipping through similar cracks in existence and a spirit was telling me I was a demon sent to earth, that I shouldn't deny my true self. I fought it, because who wants to believe something like that? I shrugged it off the best that I could and went through the rest of the day like I normally would. That night I took 50mgs of 5-htp and 3mgs of melatonin with B6 to give the fluoextine some serotonin to work with. I slept well that night, dreampt intensely, and felt a little hyper the next day, but all was fine.</p><p>I was sure I hadn't taken too much 5-htp. My understanding is I am usually not supposed to take 5-htp supplements with an SSRI such as fluoxetine. A potentially serious illness known as serotonin syndrome may occur. Like I said though, I didn't feel that I took too much 5-htp..... but as the day progressed the hyper feeling just seemed to increase. I was in no bad mood, but was still pondering the unsettling outcome of the previous day's Salvia experience.</p><p>I had been thinking for a while that I might want to make some food out of this marijuana leaf my brother had. What better day, than one where I was feeling a little too manic, right? Pot can sometimes help a person cull a manic or hypomanic episode. Considering that the material I was working with happened to be leaf, I crushed up what I judged to be a generous, but still reasonable amount. I mixed the pot with vegetable oil first, and then with whole wheat flour, salt, baking power, and an egg. The dough was then molded into a flat bread shape and fryed both sides on a skillet.</p><p>The bread was slowly consumed over an hour-and-a-half, a safe speed as far as I was concerned. My brother came home, announcing he was about to go to our mom's house to drop off a care package. I thought it would be good to come along and enjoy what I expected to be a mild high.</p><p>T+1:45</p><p>About half way to our mom's house, I could see it was going to be a very wild ride. Maybe it was the forest glowing extra bright, or the rising energy coming up from the pit of my stomach, but I could sense rough times ahead. I verbally expressed my error in judgement in deciding to accompany my brother on his errand, but it was too late; we were already half way there.</p><p>T+2:00</p><p>By the time we reached our mom's house, my internal elevator was rising out-of-control. It was at this point I could see the Salvia's influence in my thought patterns. I could remember the Salvia trip from the day before with more clarity, and was able to step my way through it slowly. I began thinking about how even though Salvia seems to be a genuine entheogen, it has more in common with the inhalants I have experienced than with anything else. The few times I tried inhalants, I was brought down, not up. I was warped, not built. Same thing with my Coricidin nightmare trip. The Salvia was more like those than anything. The Salvia always warps or breaks up my 'reality', making me see another. It always seems to be like reality is torn to shreds, and with it my memory of self. While high on the green pot bread I was able to see the Salvia experience as if I was above it, seeing it as a more of a complete picture, rather than being taken in by its inherent intoxicating effects. I could see the surface of my mind/spirit, and how the Salvia had ripped holes into it, holes that beings from other dimensions could pass through.</p><p>In the succession of mind-altering substances there are those which occupy the healthful side of the line, and those which are on the unhealthful side. In growth there is health; in tearing and fragmentation there is death (though afterwards sometimes, new life). I was able to see that Salvia, while looking beneficial right at first, still occupies the unhealthful side of the line. It tears, partitions and warps. I could see that if I were to continue to use Salvia, my very soul would be at stake.</p><p>On the drive home the trip kept getting more intense. I honestly felt as if an eternal part of my soul was in serious jeopardy. My recent chemical choices had put me out on a very fragile limb, and I felt as though my nervous system was going to shatter into innumerable pieces, rendering me incapable of solid thought. I could see the surface of my mind/spirit very clearly. It was a technicolor 3d surface comprised of fractals and cubist protrusions. I was travelling over the surface. It felt as though every trip I had ever experienced was happening to me all at once, complete with vivid images. I reminded myself to be strong, that if I just believed (in God) that I would be spared and not shattered like a glass plate. At this thought I saw a great, thick wire connecting me to the Source of Creation, strengthening me. Then, it caught on fire, and I could see the flames burning along its length right into the far distance. I continued to remain as calm as possible, but my destruction still felt close at hand. I saw the latticework of my soul becoming drained of color. It was like a fire was burning me alive and leaving a spiritless ash behind, a hollow shell or skeletal structure of what was once a more complete human. I felt entirely stupid for having placed myself into this position. I had played with fire and was now paying the eternal price.</p><p>T+2:30</p><p>My brother stopped at a store to pick up a few items. I stayed in the car. The presence of other people was too much, and I felt that the sooner I was all by myself, the safer I would be from having my whole being split apart. I viewed myself as a a solid substance, breaking itself into a grid of square blocks. I focused on allowing the blocks of thought to stack up in their proper order. This brought me a little peace of mind.</p><p>Finally, we arrived at home. It was getting dark by this time, and my brother went off to see a friend. I didn't want to be around anybody in this state anyway. I tried to eat something, by my cottonmouth made that nearly impossible. Suddenly, I got the impression that the house was haunted, because I had smoked the Salvia in there the previous day, and that the tiny tears in my spirit gave them free access to my soul. I'm not one to get freaked out about ghosts or anything (especially since I don't believe in ghosts), but when you've had direct and realistic contact with interdimensional entities who don't seem quite benevolent, then you tend to take corrective measures to protect yourself. I went outside. Standing up, I felt fine, but when I crouched down, I saw an energy flash up from the ground towards me. Fuckin' A. I'm being attacked. So I got as far away from the house as possible and crouched in the woods, with the comfort of nature to protect me. Wild animals and insects are nothing compared with losing my mind to some persistent, malevolent beings. </p><p>Looking at the house I could see it had a bad aura, that something terribly bad had been unleashed, that it seemed to be located in the house. I figured out it that was the Salvia. Salvia's very presence in the house was affecting me in this open state I found myself in. Salvia is a much stronger tool than I'd think, considering how people are using it. It's Pandora's box, the implications of which are still largely unknown. I thought about throwing the Salvia away... but then someone might find it and try to use it. The best bet is to hold onto it until I can destroy it. Those were my thoughts right then.</p><p>When I felt stable enough to go back into the house, I was was still peaking. The carpet was overlayed with neon blue and yellow fish, squirming in a general vertical motion. My pupils were very dilated. I still continued to stack up my blocks in a stable manner. I prayed my heart out, that if I were to die that at least my very core would be saved. You see, I felt I had pushed myself over the limit in terms of 5-htp intake, and that I had developed serotonin syndrome. I was feeling very dizzy and the blood was rushing loudly past my ears. Jaw clenched, I layed in my bed trembling, and tripping balls. Perhaps the perceived symptoms of serotonin syndrome (the end result of which is death) were all an effect of the pot, but it sure felt for a while that my hand had finally been played out.</p><p>T+6:00</p><p>Eventually, after multiple trips to the bathroom to pee out the chemical marinade I had made for myself, I found sleep.</p><p>In conclusion, I think the marijuana made me aware of some possibly life-altering effects Salvia can produce in one's mind and spirit. I think Salvia's effects are somehow very close to the effects of inhalants as far as mind bending and reality shredding goes. If there is something so strong out there that it can completely warp and crack our hold on reality, do you think we should be using it as nonchalantly as we do? Just what are the long-term effects of concentrating and smoking the essence of Salvia divinorum? We have no real historical account of that to draw from. Let us be careful.</p><p>As for me, I have permanently put Salvia on my 'do not use' shelf. Whatever it does to the human brain is very serious and shouldn't be taken lightly.</p>"
}
