{
 "title": "Foreign/Unusual Setting, with Broken Arm",
 "author": "cerca del cielo",
 "citation": "   cerca del cielo. \"Foreign/Unusual Setting, with Broken Arm: experience with Mushrooms (ID 27045)\". Erowid.org. Feb 2, 2005. erowid.org/exp/27045",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "20 g",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27045",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 2, 2005",
   "Views: 6343",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn summer of 2003, I was backbacking in europe, and one of my stops was amsterdam. A long-time fantasy for me was to take mushrooms in the Van Gogh museum, so on my third day, I decided to indulge. <br>A quick note on surrounding circumstances: at the time, I had a broken arm from a bike accident, which was in a full-arm cast and still painful when it was moved. I had been smoking marijuana and hash frequently through the whole trip (most of a month at that point, often several times a day), so there was a fair amount of THC in my system, but had not smoked that day because I didn't want interfering factors (and I found amsterdam grass to be too heavy/indica-like for my tastes, and rolling a joint with a broken arm is a huge pain in the ass). I was extremely sleep-deprived, because every hostel bed and hotel/pension room was booked when I arrived, so I stayed up all night in a bar the first night. Finally, it should be noted that I was traveling alone, did not speak any foreign languages fluently, and had been through 3 countries in about a week, a major disorienting factor. Amsterdam was the first place I had come where I could communicate with a majority of people.<br>So... I bought a 30g container of fresh 'mexican' mushrooms (not sure of the exact variety, but I suspect it was plain ol' psilocybe cubensis, just on visual examination.) I took them bits at a time over the course of about 5 hours starting with about 1/2 hour before entering the museum, not all at once. I ate the largest cap first, then the largest stem about 2 hours later, and the smaller mushrooms whole at about 1/2 hour intervals thereafter.<br>I entered the museum, walked around for about 20-30 mins, at which point I began to feel the first effects of the shrooms, a sort of slightly apprehensive state of mind, butterflies in my stomach (not nausea - the sensation was pleasant), and feeling as though I had grown slightly taller, or was slightly off-balance. These effects gradually intensified, and I began to feel fuzzy in the head, which was annoying. This was the only adverse effect of the experience, and it dissappeared after about an hour. As the fuzzy-headed effect waned, I became VERY euphoric, and the off-balance sensation intensified to the point where I felt as though I was dancing every time I moved. It was quite pleasant. In addition, my arm stopped hurting, and the cast, previously an annoying, itchy encumbrance, became much more comfortable. It is interesting to note that even after I came down, the cast remained comfortable.<br>About 1 1/2 hrs into the experience (my time sense was working fine, though it seemed like it wasn't - e.g. Thinking 'it feels like it's about 2:00 now, but that's probably not right... [check watch] no, it is in fact 2:06.') I began to experience visual hallucinations. When I turned my head more than about 45 degrees, I experienced 'skips', like an mpeg movie at a low frame rate, or sometimes trails instead. I had slight auditory hallucinations, like someone whispering indistinctly in my ear, or music from far away that I could barely hear, but these were not very noticable. As I approached the peak, the paintings' colors became much more vivid and metallic or jewel-like, and seemed to move somewhat. Painted trees swayed in the wind, portraits breathed, the liquid in the 'glass of absinthe in a cafe' painting sloshed around in the glass a bit, etc. There was also a general 'dripping' effect, where individual colors seemed to ooze downward. At the time I thought these effects were deliberately added by the artist, though as I came down I realized that it was the mushrooms and not a painting technique.<br>Finally, at the peak, I experienced a particularly interesting effect. While looking at van gogh's self-portrait displaying his bandaged ear, I felt a very strong empathetic bond with it. It felt like his spirit was preserved in the painting, and was projecting to me a powerful sadness. Not entirely unfamiliar (I have had problems with depression), not entirely unpleasant, it did remove the previous euphoric feeling. In retrospect, I would put it down in the 'positive effects' column, but it was disturbingly intense. <br>After another hour, I had come down enough that I felt safe leaving the museum, and felt it had overall been an extremely good experience. I almost bought another package of mushrooms to keep the trip going, but I was running out of money, so I got a falafel sandwich instead.\n\n\n"
}
