{
 "title": "Tucson Trippin'",
 "author": "travis smith",
 "citation": "   travis smith. \"Tucson Trippin': experience with DXM (ID 2708)\". Erowid.org. Dec 7, 2001. erowid.org/exp/2708",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "600 ug",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1995",
   "ID: 2708",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 7, 2001",
   "Views: 15730",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is a short story based on my first experience with DXM. It is basically a conglomeration of all my experiences from 1995 to 2000.</p><p>I'd never thought about it before, but for some reason I felt compelled to try it. I'm on leave, so, damn it, I'm gonna do it.</p><p>'Damn it. I'm gonna do it.'</p><p>'Well, if you're gonna go, I'm gonna have to go with you,' he retorted.</p><p>It was cloudlessly bright in the early late afternoon, driving around in Jeremy's Civic. The hotly determined Tucson sun beat down on us as we began our search. We drove over to the ABCO, got out and floated over the searing blacktop on the way in. WHOOSH!! Ahh! The lovely arctic blast from the freon driven industrial-sized bliss machines. Aisle. Aisle. Aisle. Coffee. Diapers. Freeze-dried. </p><p>Cough and Cold. Bingo.</p><p>'What are we looking for?'</p><p>'Drixoral's with just straight Dextromethorphan Hydrobromide.'</p><p>'What?'</p><p>'DXM, the main ingredient.'</p><p>'Oh.'</p><p>Hmmm. 'Pseudoephedrine 60 mg. Acetaminophen 250 mg. Guafenesin 60 mg.' Nope. Nope; we don't need none of that shit.</p><p>'Got it.'</p><p>Yeah!!!\t\t\t  </p><p>The lady at the checkout counter had an icy smirk on her face, eyeing two fine looking, healthy young airmen buying five boxes of cough caps with neither even pretending to have a cold. I was actually pretty stoked; bolts of crisp electrical excitement raced up my spine like on a chilly Christmas morning.</p><p>'Damn, dude. We don't have enough.' </p><p>Five boxes at five bucks a pop was quite a bit of bread. Shit. Hmmm. 'Could we open these and use the Drix dollars?'  She nodded, so we ripped open the boxes, gave her the coupons, paid, shoved all the liquicaps and boxes into the bags and promptly left the store. We waded back through the shimmering heat to Jeremy's car; got in, melted into the seats, and took off.</p><p>We stopped at the Burger King on base and each got two fat whoppers, then went back to Jeremy's comfortably cool dorm room. As I was grubbing down, listening to '58 Miles, I was perplexed, looking, intrigued, around the curious room.</p><p>'Dude, I've seen some weird things from that poster,' he says, looking at the Day-Glo jungle affixed to the wall. Perplexed. It's strange that I'm here right now, in this room, at this moment. When I left for tech school a couple of years ago, I had no thoughts about ever coming back to Tucson. But, after watching the Shawshank Redemption, I knew I had to make a trip down. I didn't know why, but I had to go. I left Colorado Springs, thinking, remembering, replaying The Shank in my head, as Red was getting ready to cross the border: 'I find I'm so excited, I can barely sit still or hold a thought in my head. I think it's the excitement only a free man can feel, a free man at the start of a long journey whose conclusion is uncertain.' </p><p>Intrigued. What's it gonna be like? Is it just gonna be a drunk-like buzz, or what? Am I gonna go insane? I had no idea. Being in the Air Force, I'd never even thought about doing anything like this.  Not just because of the piss tests, but just because the thought had never entered my head. </p><p>Curious. What happened to Jeremy? Why drugs? I never asked, but I was kinda disappointed; drugs were such a departure from the Jeremy I thought I knew; the Jeremy I met at the Navigator's Bible Study on base; the quiet, handsome, assuredly easygoing, erratically erratic, but dependable Jeremy; the Jeremy I would skate, laugh, and pray with. </p><p>And now we were sitting here amidst 1500 mg. of DXM.</p><p>____</p><p>'How many do I have to take?'</p><p>'Twenty.'</p><p>'Twenty?!'</p><p>'Yeah. Choke em down 5 at a time. It's easier.'</p><p>Hmmm. Well, here goes.</p><p>Why did they have to be red? I remember having to wretch down little red bedwetting pills when I was a kid, and they always made me gag. But these fellatio-sized pills were the worst. Oh well, down the hatch; I wash down the last of em with a swig of Dr. Pepper. And wait.</p><p>And wait.</p><p>And wait.</p><p>After an hour I said, 'This shit ain't gonna work.' I felt let down, kinda like with God. I can't hang around anymore. I bolt. </p><p>'Let's go see what's going on outside,' I say to myself. </p><p>I step out into the smoldering dusk and step along the second floor walkway of the motel style dorm admiring the cool violets, pinks, blues as the persistent sun swims along the horizon, dipping like a bobber being tugged at by a deceived bottom feeder. </p><p>Step. Turn. Whoa; What the hell are these? Multiple levels of planes of being- stairs. I descend, winding and winding in endless circles of blissful and sideways frivolity, reeling out into the simmering parking lot.</p><p>'Dude!'</p><p>'Hmmm?'</p><p>'Dude, could you help me with these brakes?'</p><p>I can't remember where I know this guy from, but I know VW's, so I go take a look. </p><p>'Hmmm. Yeah. These things can be a pain sometimes. Why,' (Why? Why, oh why, did I swallow the fl) 'don't you juuust take that off and then it should slide off pretty smoothly.'</p><p>Uh oh.  </p><p>I could feel a subterranean shudder in my gut.  The Leviathan, red and menacing, was loose and clawing its way to the surface. </p><p>'I gotta go.'</p><p>Full sprint to the anxious, wobbling dorm. Now up up up the planes of existence, spiraling to the second floor running running flowing to jjerreemmmiees seething room of (infinite glacial) bliss </p><p>Coltrane greets me at the door with a frigid glance.</p><p>Slam! Sprint! Fling! </p><p>Ancient swords jamming down my throat; imbedding in my thoraxically oriented stomach. Great gushing waves of pain red whopper flow past my blushing lips and into the shivering commode. </p><p>'goddamit; I drank too much.' Heave.</p><p>'I'M SOOO DRUNK. goddamn burger king.' Heave.</p><p>'I'VE HAD WAAAYYY TOO MUCH TO DRINK' I had to make it clear to anyone who happened to be listening that I was drunk, and not frying out of my deliciously omnipresent mind. </p><p>'plllease, Father, help me, I know not what I do,' I whisper to mySelves, wiping the spray of hamburger and gel from around my mouth, staggering to my feet; out of the corner of my eye I see the last of a red, jagged tail slide down the flushing toilet.</p><p>I stumble out of the bathroom on stilts of guilt and regret. </p><p>'has iiit kicked in?'</p><p>'I think so' </p><p>'hmmm.  well, mmmy ffriend, the best part of my trip just landed in the toy. Let.'</p><p>'What the hell were you yelling about in there?' he says, lying on his back on the brown pleather couch.</p><p>'nothin' '</p><p>Standing is labored. I lie. Down. What is that</p><p>SOUND. </p><p>Lying on the thin carpet floor. Eyes closed. It's the only position that doesn't make me sick. Then it comes- my body expands, expands, miles wide and I am</p><p>floatwirlingeringaroundtheroseycoloredthornsinthemindof</p><p>CHRRRIIISSSTTTAAASSSEEEVVVEEERRRYYYTTTHHHIIINNNGGGSSSS</p><p>\t\t\t\t\t\t\t\t\t\t                           LLLL</p><p>             \t\t\t\t\t\t\t                                           IIIII </p><p>      \t\t\t\t\t\t\t                                           PPPP </p><p>           \t\t\t\t\t\t\t\t                                 SSS </p><p>                  \t\t\t\t\t\t\t                                  D</p><p> \t       \t\t\t\t\t\t\t                                          O</p><p>                     \t\t\t\t\t\t\t                                  W</p><p>                    \t\t\t\t\t\t\t                                  N</p><p>       \t\t\t\t\t\t\t                                          SNAP! </p><p>Then the mind is free.</p><p>The CD changer whirs into action, faithfully performing its appointed task,delivering uninterrupted musical landscapes. Tribal Tech crashes into the room, shoving </p><p>Coltrane aside and pushing me forward, headlong, drowning me under the BiG WAVE  SwervI ng through the notes that pull me 2 and fro and I breathe in pure experience and the song becomes my universe, and my eyes ascend to the ceiling and look down at my simple body then gently descend and</p><p>settle into a comfortable orbit around my head as I exhale my childhood. </p><p>The Big Wave washes back out to sea, pulling along with it the scales that have fallen from my eyes.</p><p>'whoa!' I blurt out, opening my previously orbiting eyes, but not moving.</p><p>'I knowI forgot how good this stuff is'</p><p>'ohmyGod'</p><p>'Justchilland go with it.'</p><p>I close my eyes and spill across the carpet and a purple goddess swims up from under the ornately gleaming rocks and we       t</p><p>       iw           </p><p>     ts</p><p>    i</p><p>   n</p><p>     g</p><p>       l\t\t\t\t\t\t\t y</p><p>            d</p><p>              i </p><p> \t         v</p><p>                   e </p><p>                         through the clouds of mysterious</p><p>green smoke that pour from the orange hell's angels' gigantic chrome exhaust pipes that morphleap over me with one shiny black tire entangled in saturn's rings as the rest of his magnificent whirling machine vaporizes into icicles filled with minute civilizations with endless mazes of televised monsters trying to blast me into oblivion, so I ask them to dance </p><p>'i played too muuuuch doom. all i'm doing issss dancing through mazes'</p><p>'Open up'</p><p>What do you mean 'open up'? Are you crazy? If I open up any more, I'll flip clean out. </p><p>'Open up'</p><p>Nudge.  My eyes pop, open, and I see Jeremy standing above me.</p><p>'Open up'</p><p>'duuuude, IIIII don't think I neeeeed anymooore'</p><p>'Dude, you're barely at the threshold. Take five more.'</p><p>'ok'</p><p>He drops em in my mouth and pours water at me from a distance to wash them down, and its coldness splashes into my face; I instinctively close my eyes, and find myself submerged and plummeting down toward the cold red beast's eyes swallow me and I see through its eyes as time telescopes into inconsequence and miles davis strolls into my ear, pries it open with his trumpet and I am creamy coolness and I squeeze in, then explode outward- joy, body, flying with sparkling kodachrome pinwheels as wings, up and up; noxious rumblings shake and tear at this consciousness.</p><p>Churning, I lurch to a choppy stance as the fresh-frozen, dripping jungle around me bursts and drips down the walls and I Frankenstein back to the severe commode.</p><p>Fling?  Poised beside the bowl, open up echoes through my head, </p><p>'yeah, right,' </p><p>The Leviathan leaps up from the toilet, intertwining with itself inside my mouth. I fight and heave, bite down and its bloody writhing falls as the head claws its way down my throat and I crumple flat on the soothing cool tile; motionless.</p><p></p><p>I rouse and slither off the rocks and through the tall green grass out to Jeremy, lying on the sandy bank, and I lay my head on his chest.</p><p>Tenderly, 'iii canheeeartwo hearts; Christ is iiin you' </p><p>'I know'</p><p>'how did weeee get here?..'</p><p>'I don't know'</p><p>We are rudely interrupted as Tribal Tech again crashes into the room.</p><p>'go get the music ooout of your caaar'</p><p>'Alright'</p><p>He rises, rises, shimmers through the trees and is gone. I lie back in the shifting grass, adrift.</p><p>'FREEZE!!!'</p><p>My heart stops as the Military Police burst into the room.</p><p>'STAY DOWN!!! ROLLOVER!!! PUT YOUR HANDS WHERE WE CAN SEE THEM!!! DO IT!!</p><p>DO IT NOW!!'</p><p>' iiit's not my fault'</p><p>'BULLSHIT, BOY!! YOU DONE SCREWED THE POOCH!!'</p><p>'it's not myyy fault'</p><p>'What?'</p><p>'it's nooot my fault'</p><p>Jeremy. 'What?'  Pondering. 'Oh. Yeah,' sliding Edie Brickell into the changer, 'I forgot to tell you. Dissociatives and paranoia don't mix well'</p><p>'hmmm'</p><p>I close my eyes again, lock jawed and teeth chattering.  I plunge inwards, leaving sense and cold condemnation at the surface, inwards to where the self lessens, lessens and I am able to step outside and away from my pains and mispreconceptions and griefs' self and look inside and see that Life is much bigger and better than anything I could have imagined. </p><p>And inwards. to a relaxed, pleasant, tree-lined neighborhood painted in a light violet glow. i see a small, ruddy boy sitting on a lonely curb, head down, holding something in his tight, pink fists. i tentatively approach.</p><p>'may i sit here?'</p><p>softly, 'ok,' not making eye contact, head still down.</p><p>i sit on the warm, shady curb and look over at his clenched, sweaty fists.</p><p>'what are you holding onto?'</p><p>'nothin' '</p><p>'may I see?'</p><p>'NO!!!,' he shrieks, huddling, burying his head.</p><p>'please? i need to see what you're holding onto'</p><p>fierce, quietly breathless, 'no you don't. no one does. no one must see what I'm holding onto.'</p><p>long, pensive silence as we wait; motionless.</p><p>'ok'</p><p>he carefully, slowly, painstakingly lessens his feverish deathgrip; looking up at me, into my eyes, 'see?'</p><p>whispered, 'Yes,' looking away.</p><p></p><p>Laid out face up; hovering.  I float up, up through the brisk blue immersion to the surface and come back to my senses.</p><p>'Dude, I'm tired. I'm sacking out.'</p><p>Opening my eyes,'me too. could you turn off the ac? I'm freezing.' He clicks the lights and AC off as I crawl into bed and drift away.  The room was already warming under the rising of the tenacious, blazing sun.</p>"
}
