{
 "title": "18 Years Old",
 "author": "Conscious Deciple",
 "citation": "Citation:   Conscious Deciple. \"18 Years Old: experience with Cocaine (ID 27082)\". Erowid.org. Apr 26, 2006. erowid.org/exp/27082",
 "substance": "Cocaine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27082",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 26, 2006",
   "Views: 4774",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first use was in 79.  My last was this past Saturday night.My next? It took some time. I've never been in Rehab, but Ive been with many friends who were, listening to them as they progressed through the program.\r\nI first chose to do two lines on New Years in 79.  I was 18.  On and off use for the last 20.  I always noticed the correlation between usage and difficult or stressful periods in my life.  I traded the knowledge of the experience for respect of the consequences, and decided early on not to freebase, or use crack (which was engineered to facilitate compulsive use and therefore profit-know this and be aware of it) or take intravenously to more economically use the substance.  \r\nMany would see me as a failure for using at all, many would see my experience as a success for not compromising my sober judgment for the pleasure of the using substance to the point of measureable negative effect(I realise this is individualy subjective, and open for debate, but I stand by that statement).\r\nThere is no success with Coke, it is what it is to each individual.  Its a tool, an accessory, that allows me to alter my mind.  \r\nCoke is like fire, its not evil, it just is what it does, like any inanimate combination of atoms.  Fire is a tool, it can be positive.  But change a few small variables and fire can destroy anything and everything. Common experience has set up many universals or rules regarding fire safety, yet fire kills and destroys people and property every day, through negligence or circumstance. There are many universals regarding cocaine and its use yet physically and socially it can destroy anything and everything.\n\n\n"
}