{
 "title": "They Let You See at Night",
 "author": "Chronic Farmer",
 "citation": "   Chronic Farmer. \"They Let You See at Night: experience with Mushrooms (ID 27107)\". Erowid.org. Oct 17, 2007. erowid.org/exp/27107",
 "substance": "Mushrooms",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "8 caps",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 27107",
   "Male",
   " ",
   "Not Given",
   "Oct 17, 2007",
   "Views: 2762",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a few months ago when I decided to try shrooms. I had always heard of people having a lot of fun and seeing a variety of interesting things. A friend of mine owns a ranch which is covered all over by the finest cow shit in the land, which the little dudes grow on. He had just come back from a harvest and gave me about 8-10 dried shrooms and said it was all I needed to have a long trip. When I got home, I grabbed some honey to kill the awful taste and headed upstairs. I poured each one in honey and ate them straight, without making tea or anything. After eating the entire bag, I sat down in front of computer, anticipating the trip to come.</p><p>It took about 45 minutes to an hour before I really started to feel the trip coming on. It started off as a strong feeling of euphoria and the need to be around someone. Another half hour later things got more and more intense. I looked down at the top of my boxers protruding out of my pants and noticed that the patterns on them were moving back and forth rhythmically, almost as if they were dancing. I smiled and looked over at my bed, and saw that the bed looked as if it was alive, for the entire thing has heaving up and down like it was breathing. I thought to myself that this had to be it, I was finally hallucinating.</p><p>I got up and walked to the mirror and looked closely at my face. My pupils were HUGE and by huge I mean that you could not even tell what color my eyes were, it was all black. I looked at my skin and it seemed to have a second layer underneath that was moving all around independently from my face. I also did not feel like a whole person, but I felt that I was just the conglomeration of my cells all working together to make me who I am. Along with the euphoria, I felt as if I was directly connected to Earth and all of its livings things, and all conciousness was linked together as some sort of hive mind.</p><p>For some reason, I decided to spit on the floor, and when I got down close to it, instead of the normal roundness spit bubbles have, the bubbles were all elaborate polygons of different shapes and sizes. I sat down on my bed and took off the necklace I was wearing and examined it in my hands. The necklace would touch one part of my hand, but the sensation of touching it would come from a completely different part of my hand. Intrigued by this, I sat and played with it for what must have been at least 20 minutes. The whole time I sat on the bed I would talk to myself and make up nonsensical words and phrases. I don't know why, but my mind wandered to thinking about night vision goggles and I kept repeating 'They let you SEE at NIGHT' with extra emphasis on see and night. In a brief moment of clarity I noticed that an effect of shrooms is what I would describe as temporary mental insanity. I not only was insane, but I knew I was and it was damn fun!</p><p>Towards the peak of my trip I started to think about the meaning of life, and also about the eventuality of dying. Thinking of death got me so scared it was indescribable. I was terrified to the very core of my being. I eventually changed the subject in my mind and decided to go to the bathroom, but halfway to it, blackness creeped into my vision from all sides and I went blind for about 20 seconds, which scared the shit out of me. I went back to the bed and closed my eyes to see a myriad of numbers that looked like something from the 70's because all of the numbers were changing color rapidly, and the colors were the most beautiful I had ever seen in my life.</p><p>I opened my eyes and looked over at my oscillating fan, which as it moved back and forth, transformed into a new polygon with each sweep. I looked over at the large mirrors I have in my room at the reflection of myself and my surroundings. It looked like some beautiful painting from the 1600's or something. About this time I hit the very peak of the trip and my body started to overheat. Sweat started running from everywhere, so I stripped down to my boxers and lay under the fan. Eventually I cooled down, and my trip subsided for the next hour and a half or so. Although the trip had some scary aspects, I would enjoying tripping again, no doubt.</p>"
}
