{
 "title": "Definitely a Special Psychedelic",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"Definitely a Special Psychedelic: experience with 2C-T-7 (ID 2712)\". Erowid.org. Oct 3, 2000. erowid.org/exp/2712",
 "substance": "2C-T-7",
 "bodyweight": "142 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2712",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 3, 2000",
   "Views: 17068",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nJul. 22, 00<br>Decided to go ahead one week early.  Many issues to work out.  I pray this provides more than just a trip.  Feeling good inside, nervous.  First experience with 2C-T-7. <br>11:38 PM<br>Consumed approximately fifty milligrams in water.  Slightly pink-orange color probably due to impurities, as Shulgin described 2C-T-7 as white.  Fairly bitter.<br>12:03 AM<br>First alert.  Slight restlessness.  No nervousness.<br>12:11 AM<br>Very light-headed.  Hands unsteady.  Definitely active material.  Starting to feel 'outside of myself.'  Nausea<br>12:23 AM<br>Great visuals have started already.  I can tell it is going to be strong.  Good!<br>July 24, 2000<br>Obviously, that was as far as I got with my journal.  Shortly after that last post, the trip developed into an intensity beyond all preceding experiences.  It was rivaled only by one previous 300+mcg LSD trip.   Bear in mind to describe this type of experience only pollutes and colors what actually happened.  It was beyond any words I presently know.<br>The most important part of the experience is what 2C-T-7 did for me psychologically.  I had separated from my girlfriend of the past six years a few months ago.  Without a doubt, this has been the most difficult experience of my life.  Before this trip, I was not able to except in my mind that our relationship is for the time being over.  My self-esteem was as low as could be and I doubted I could carry on with another relationship.  This trip truly allowed me to let go of her and accept that what we once had is over for now.  At the peak I cried, or rather wailed, for us and what we once had.  This release of emotion was so intense it was like giving birth.  I had tripped two weeks previously on eight baby woodrose seeds hoping for a similar outcome, but they did not provide it.<br>Since coming out of this 2C-T-7 trip, I feel better about myself that ever and I have a new confidence in me that has not been there for quite some time.  It is hard to say exactly what is different, but I feel so renewed because of this trip.  The changes produced go far beyond what I am now mentioning, but I have not had time to integrate all that has happened to me.  I just know that my life is truly different now.  A true peak experience.<br>Now I will describe my impression of 2C-T-7's nature<br>This was my first experience with a phenethylamine, and at the dosage I took it produced an effect of a far more complex nature than my previous experiences with indole psychedelics.  The visuals were vastly superior to those of any LSD trip, and LSD is usually very visual for me.  I have truly never seen a color display like that in my life.  In the beginning, before the experience became truly overwhelming, I witnessed the most beautiful film of creamy lavender I have ever seen floating around the room.  That was only one of hundreds of beautiful color displays produced by 2C-T-7.  The visual display could be described as having a most 'colorful, sophisticated, swimming, complex phenethylamine chemical' nature to it.  When I use the word chemical, I do not mean that in a wholly negative sense, I just mean it did not feel organic.<br>The world around me eventually took on more movement than has for any other psychedelic trip ever before.  Incredible swimming, inverting, kaleidoscopic motions, always being overwhelming colorful.  I was in a darkened room with the computer monitor, and at times the television, lighting up the room.  The overhead light was too bright, unpleasant, and overwhelming to keep on.  Eventually, the outer world became so altered it was unrecognizable.  It is truly no exaggeration to say I could not see the normal world at the peak of the experience, and I had to feel my way around.  I tried my hardest to use the computer, but I could barley read the keys or the screen, even with the lights on.  It was the greatest struggle just to check my e-mail, and I felt like it was one of my greatest accomplishments when I actually signed in (only to not be able to read anything.)   I am truly not exaggerating in any way, and it is amazing considering I have not read of anyone having a similar experience.<br>2C-T-7 did have some negative physical side effects on me, though none too severe.  In the first place it produced some rather nasty nausea.  The nausea was different than morning glory/baby woodrose seed nausea.  The 2C-T-7 just seemed to irritate my stomach.  To be fair, I was a little nauseous before I took it but it still was responsible for the majority of what I had endured.  Much of the nausea before the trip was probably due to nervousness.  The cannabis I smoked helped, but not completely.<br>The dose I took also had an intense body load.  I could never really get comfortable.  My body had so much energy running through it, I thought it might explode.  It was not the same feeling as being over-stimulated as if one took to much amphetamine, and is difficult to describe.  Also, I had a hangover the next day, which was very unpleasant.  Every other psychedelic I have ever taken always makes me feel like a million bucks the day after.  While these descriptions might sound extreme, it was well worth it considering all 2C-T-7 gave me.<br>To sum up<br>Based on my initial experience I think I like 2C-T-7 a lot more than LSD, despite the physical difficulties I experienced.  LSD at high doses can at times be a sinister and unfriendly drug in my opinion.  Considering how hard I tripped, 2C-T-7 was quite nice to me.  I believe its psychological benefits are similar to LSD's, but 2C-T-7 never produced the panic that LSD does in the heavy doses necessary for true ego dissolution, making 2C-T-7 a more useful tool than LSD as I see it.  I do not want to compare 2C-T-7 to mushrooms, or ergoline alkaloid containing seeds because I consider organic psychedelics to be in a somewhat different realm than synthetics.  Start with a low dosage.  I had no idea fifty milligrams would do what it did to me and it was very foolish of me to try such a large amount my first time.\n\n\n"
}
