{
 "title": "Mandragons",
 "author": "panaceam",
 "citation": "   panaceam. \"Mandragons: experience with Mandrake (ID 27172)\". Erowid.org. Nov 28, 2003. erowid.org/exp/27172",
 "substance": "Mandrake",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Mandrake"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1997",
   "ID: 27172",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2003",
   "Views: 19670",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been using mandrake for several years and have a great respect for it as an entheogen, but not without fear of its quite toxic effects.</p><p>It has been used throughout europe and the middleeast for thousands of years, even being mentioned in the bible (where a woman trades her husband for some mandrakes, curious since you can't use them for anything else).</p><p>It is a relative of datura, henbane, belladonna, and contains up to 0.4%alkaloids (scopolamine, atropine, apotropine, hyoscamine, hyoscine, cuscohygrine, solandrine, mandragorine). These can lead to psychoactive and hypnotic states. Higher doses can induce delerium and lead to death by respiratory parplysis. (atropine is named after Atropa, a death goddess).</p><p>So be careful.</p><p>I have chosen to use it only in small doses, as an accent on other trips. I have used it successfuly in combination with psilocybin, LSD, MDMA, damaiana and Cannabis. Ingested orally, mandrake has some pretty substantial purgative effects. It leads to vomiting and diarrhea that can last up to three days, even if taken in too small a dose to get high.</p><p>My favorite method of ingestion is to mix some mandrake powder into joints to be smoked once the other drugs start to peak. I have also made tinctures out of mandrake and rubbing alcohol. I Let the mix sit in a closed container for three weeks, then dip some cigarrettes into it. When they dry, I have some psychedelic cigarettes.</p><p>I have found the spirit of mandrake to be an ancient and utterly magical consciousness that gives the impression of having existed for countless aeons, while showing panoramas of images like witch's sabbaths; supersexualised and sadomasochistic views of hell, or heaven depending on your viewpoint.</p><p>Contrary to things I have read, I DO NOT develop a resistance to its toxic effects with constant use. I do however develop a resistance to its psychoactive effects, which may be tempting to take more in order to get the same high. This is dangerous, because some of the alkaloids can stay in the body for several days. If you reach a critical level, you overdose and lose the ability to breathe.</p><p>Less than a gram in a week is plenty, especially is used only to accentuate other drugs. Approach mandrake with caution, but that said, if it likes you, it likes you.</p>"
}
