{
 "title": "Enlightenment Through a Chemical Catalyst",
 "author": "Fragbait",
 "citation": "   Fragbait. \"Enlightenment Through a Chemical Catalyst: experience with 5-MeO-DMT (ID 27175)\". Erowid.org. Sep 28, 2003. erowid.org/exp/27175",
 "substance": "5-MeO-DMT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 27175",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 28, 2003",
   "Views: 20914",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had several attempts before this to breakthrough on 5-MeO-DMT. I now believe that I was approaching the experience in an entirely ineffective way. Set and setting is extremely important with any psychedelic, but it is absolutely necessary to prepare correctly for a drug with this power.</p><p>Set: I have been reading enormous amounts of material lately dealing with spirituality and consciousness. I recently attained employment, and as such I have some money to buy books with. My library has almost doubled in the past few weeks! Everything I've been reading has told me that to know the universe, one must destroy the notion of subject-object study. Give up yourself. Stop worrying about what's going on around you. Do not think of yourself as distinct from the rest of the world. For in order to see the universe as a whole, one must not divide it into parts (such as me vs. everything else). With this and a few weeks of reflection on the subject on my head, I decided I would try once more to breakthrough. I have been making remarkable inroads with meditation and other methods of reflection, and I felt I was finally ready.</p><p>Setting: In an apartment, I had just rearranged my room. I took out the bed because I decided to start sleeping on the floor. I rearrange everything so that the area I would rest in was at the center of attention. I lit one candle, and placed it behind a paper shade with designs. The time was around 6 in the morning, and I hung a heavy curtain over the window to block out most light. Except for the flickering candle, the room was near black.</p><p>Preparation: I sat down, naked, in the middle of my mat. I began meditating. It is relatively easy for me to reach a state of warmth. My hands and feet tingle, my spine and head also tingle, I feel a pressure in my head, and hear a metallic hum similar to that of nitrous, 5-MeO-DMT (in my non-breakthrough experiences), and other psychedelics. I believe this is a product of the increased awareness, not of the drugs. Once I entered this state, I decided it was time to inhale.</p><p>The Experience: I picked up the pipe, and made my movements as automatic and subconscious as possible. I had already loaded 10mg of powder into it, and there was a bit of residue left over from previous attempts. 10mg may seem like a lot to most people, but I have had numerous failed attempts in the past. However, after this experience, I am going to try lower amounts when I am ready. </p><p>I heated the pipe completely, making sure everything was vaporized before I began to inhale. My breathing at this point was very deep and continous, and I just started inhaling the same sort of breaths through my mouth when I put the pipe to it. Automatic and subconscious. I filled my lungs, and interrupted my breathing to hold it in. I pushed all of the air to the top of my lungs, but as I did that I started to forget everything. This was rushing me much faster and harder than ever before! I barely remembered to drop the the pipe before it enter the orbit with me, and within a second after I set it down, I left the physical world, and time lost all meaning.</p><p>Suddenly, my vision exploded with the most complicated fractals and geometric arrangements as can be imagined. These did not seem to last long, or perhaps I stopped paying attention. Either way, I was no longer seeing anything. I had entered a space devoid of vision, sound, and tactile sensations. I was no longer thinking. I was locked into the experience. I realized that I was finally experiencing reality in its entirety. Gone were the karmic worries of my everyday life. Gone was my sense of 'This is who I am - see, I'm different.' I was one with the universe. I was the universe.</p><p>I do not know how long I was in this space, but when I returned I immediately resumed meditation. It was very hard for me to focus on my breath, my mind was absolutely racing. I thought mostly of how I would describe this experience to others. Language is too dualistic to describe what I felt accurately. I had burning pains in both of my shoulders, but I dismissed it as unanticipated effects of the chemical. I continued to see very colorful and complex visions, consisting mostly of geometric clamshells and flowers which opened up over and over again to reveal a blinding white light that persisted in everything I saw.</p><p>I laid down when I decided to sleep and began relaxation techniques. I am not aware of how much time passed between inhalation and now, but I felt my body slipping away from my consciousness as I entered sleep. As if no time had passed, I opened my eyes and got up to go to the bathroom. My shoulders were still burning, and I checked them in the mirror. I had scratches all over my back and a huge gash in my left deltoid! Rather alarmed, I went back into the room to see what had happened, and the mirror beside my bed was shattered. My body must have collapsed into it when I entered that space. I bandaged and cleaned the wound, and checked the clock. It was 9:00am. Only three hours had passed since I dosed, and I had been blessed with the most sacred experience of my life. Enlightenment, through a chemical catalyst.</p><p>Epilogue: This experience has been almost all I can think about since it happened a few days ago. My meditation has gone much easier since, and I reach a level of awareness I wasn't attaining before. I can see now why people do not want to do this often, as my urge has disappeared. I will return some day, when I am ready. I am anxious now to experiment with Salvinorin A and DMT.</p><p>My life feels so good now, not that it was bad before.</p>"
}
