{
 "title": "'The Itch' or 'Why I'll Never Do Drugs Again'",
 "author": "dividebyzero",
 "citation": "   dividebyzero. \"'The Itch' or 'Why I'll Never Do Drugs Again': experience with 5-MeO-AMT, Clonezepam & Alcohol (ID 27180)\". Erowid.org. Mar 5, 2004. erowid.org/exp/27180",
 "substance": "5-MeO-AMT, Clonezepam & Alcohol",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "oral",
   "5-MeO-AMT",
   "(liquid)",
   " ",
   "2 tablets",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   " ",
   "500 ml",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27180",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2004",
   "Views: 17172",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n(The following is my own personal subjective experience, which some may find lengthy and tedious. For the essentials, feel free to skip to the 'Summary')<br>My wife also participated in my little experiment. Her stats being<br>160lbs/ with 6 mgs of 5-MeO-AMT.<br>I've had experience with the whole gamut of natural hallucinogens, and a lot of legal tryptamines (primarily DMT, 5-MeO-DiPT). But, I hadn't done any drugs at all for at least 6 months before I attempted this.<br>T-0:00 Doses dissolved in O.J. and consumed, not on empty stomachs.<br>T-1:00 Slight dilation and light sensitivity noted. Mostly anxiety effects anticipating full blown activity.<br>T-1:30-2:00 Nausea for me becomes overpowering at this point, and any motion of my head is unbearable. I spend :30 on the bathroom floor, forcing myself to purge. At this point, I notice ripples in the water and slight pattern CEV's.<br>T-2:00-3:00 My wife is also experiencing nausea and is trying to sleep on the couch. Poor thing, little did she know she'd be in for a long night...I myself am stuck on the toilet, trying to wait out the glitter shits, beginnings of OEV's with strangely enough, Waffen-SS emblems appearing in the stucco wallpaper.<br>T-3:00-5:00 My wife is certain that she's feeling nothing, but she begins repeating herself and getting lost in thought. I retire to the den to listen to a net radio broadcast of heavy industrial music...This was the begining of my downfall. At this point I begin writing and contemplating the geometric efficiency of the 'menage a trois' or the love triangle, and impress myself with a long-winded semi-Euclidean explanantion as to why three is the best possible arrangement.<br>A new song from Velvet Acid Christ plays, which is one of the most intense aural assaults I've heard in recent memory. The percussion seems to storm in and fade away periodically, like a sine wave. My CEV's are in full swing now at about t-3:30 and I can actually see the beat of the song manifested as a chinese fire dragon coiling in on itself. <br>My wife, too, is coiled into herself on the couch, overpowered by nausea and refusing to move. She reports no effects.<br>The d.j. goes right into a song with a german intro, and a stream of samples reminiscent of a Stuka dive bomber's siren. My CEV's take me to a WWI trench where I'm a German soldier who's buried alive in his trench with his comrades, immobilized by our gas masks. In a past life, I am certain I fought and died in this war, but the vision is horrifying enough to send me reeling for social contact.<br>At this point, everything seems to collapse for both myself and my wife, who is finally admitting hallucinations at this point. We're watching television (which was also a bad idea) and every single frame of every image offends me somehow, and I begin to voice my vague societal objections. Wondering 'why is it they only show all the commercials for drugs and Planned Parenthood this late?' <br>My wife replies, obviously, 'That's when their target audience is awake.'<br>I enter a severe mind trip from this, from which I do not recover. I begin to think that *we* are this lowly demographic to which these bad commercials are pandered. I'm terrified that by virtue of this demographic association, we will follow the very same statistical patterns of development. Middle-class, 3.2 children, 60% debt, an endless range of health complaints...Health complaints?!<br>Something about 5-MeO-AMT for me is that it gives me a sort of 'sensory redundancy'. Imagine nystigmatism on all over the body, with everything repeating itself with a time delay. For example, if I scratched an itch, I would still feel the sensation of the itch repeating itself, slowly fading, and I would only scratch again. I therefore began to scratch myself quite raw.<br>Our house was also hosting a bad flea infestation, so our roommates dog came to see us in the den, incapacitated by itching. Her helplessness vexed her to the point of violent wheezing. I began to worry that my house had become a den of infestation and vermin. I felt I could see the fleas everywhere, and I too scratched madly.<br>Eventually, my wife and her roommate calmed me down and told me to sit still and ride it out. However, as I tried to sit still, my cat crawled into my lap, depositing fine hairs everywhere. I tried to remove the same hair from my face for a good 20 minutes, hopelessly lost.<br>I began to think of the commercials again, and how modern society and the pharmaceutical coorporations are profiting by giving people temporary solutions to the problems caused by their very living conditions. I felt helpless, futile, another member of the target demographic and a faceless source of revenue. It took some time to express verbally, but once it was grasped my wife responded with wide eyes...<br>'Its just like old England. Where the aristocracy would show the kids to play with puffball mushrooms. The kids would kick them around like soccer balls, thinking it was a big game, spreading deadly spores everywhere.'<br>Needless to say, that sent me spiraling into a horrible trip. For brevities sake, my bad trip became contagious, and she became fearful and anxious as well.<br>T-5:00 Mortified at the longevity of the drug (usually a full 12-hr ride for me), I try to abort by downing two clonezepam with at least .50L of rum. This only succeeds in retarding my motor control, leaving me still enough to suffer in my own mind quietly. I follow this with a handful of Ambien and DXM capsules, which only bring me to the point where my eyes become heavy.<br>T-8:00 The sun begins to rise and I realize that it will not end anytime soon, as does my wife who has relaxed into bed and calm introspection. My hallucinations vary on the theme of universal expendability and the power of drugs. <br>One carrying me to the extreme of an almost lucid dream where I was a crewman on a russian submarine. In the rare correspondences we get from back home, my russian wife tells me that they've found out that our base (and home) were located atop a nuclear waste dump, explaining the condition of our son who had leukemia. This one ends with visions of myself drowning at the depths of the ocean with my wife and child neglected at home, waiting for the missles to rain from the sky.<br>'Missles from the sky'...'Public Broadcasting System Emergency Drills.' I wondered how I'd be found if I ever got out of my own head, sitting on a recliner, surrounded by trash and the bodies of my dead, neglected pets, as we watched t.v. with our gas masks on, staring at test pattern and waiting for the world to end.<br>The next morning when I finally felt I'd recovered, I actually took the glass bottle containing the solution to my backyard...and shot it. I resolved to never do drugs again. To this day, puffball mushrooms terrify me.<br>Summary: My opinion is that 5-MeO-AMT's hallucinatory effects are overstated, and they tend towards the delirious. The OEV's were never very powerful, especially at my high dose (which is what I took it for!). The CEV's were spectacular, of course, but a 12-hr spell on bed riding out a CEV journey is not my idea of a good time.<br>I also mentioned the 'sensory redundancy', which I felt is the drug's most prominent, and single most annoying feature. This only increases exponentially with dosage, and is in no way pleasant. In fact, I think it may be the only thing contributing to the purported OEV's, the fact that visual perception is so badly out-of-sync that I get trailers...on EVERYTHING, including the flow of water into a cup.<br>Also, the 12-hr duration should be more than enough to keep people away from this substance. I know mileage will always vary, but as for myself, my wife, and the experiences of others, the trip can only at best be 'mediocre'. Especially compared to other substances and other tryptamines (oh Foxy, I miss you so!) I don't know why myself or anyone else would want to suffer through a mediocre half day. Also, as in my final experience, the 12-hr duration lends for plenty of time to distract, encourage, and aggrivate bad trips.<br>At anything over 8mgs, I wouldn't trust myself in public with this stuff, and that's a *very* generous estimate. At 6mgs, dilation is very pronounced, and communication is straind with repetion.\n\n\n"
}
