{
 "title": "A Brief Clarification on Absinthe",
 "author": "T.A.B.",
 "citation": " T.A.B.. \"A Brief Clarification on Absinthe: experience with Absinthe (ID 2718)\". Erowid.org. Sep 7, 2000. erowid.org/exp/2718",
 "substance": "Absinthe",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2718",
   "Male",
   "",
   "Not Given",
   "Sep 7, 2000",
   "22558",
   " "
  ]
 ],
 "report": "<p>After reading these experience reports on absinthe, I just had to cringe, as there is so much exaggeration in many of them, that not only are a good deal of these reports misleading, but are bordering on pathetic.  </p><p>For example, in the report entitled, 'A Total Sensory Experience', the author claims that he/she went to a bar in New Orleans and was served 'real absinthe'.  I am from New Orleans, I know the bar in question, and this couldn't be further from the truth.  The brand of liquor in question, 'Absente', isn't absinthe, and contains no wormwood.  This is nothing more than an overpriced pastis, is completely legal everywhere (because it isn't absinthe), and doesn't even taste like absinthe.  This person was completely duped, and just goes to show how a combination of exaggeration, wishful thinking, and a bit of ignorance can make for a sensational, albeit misleading 'report'. </p><p>Several points to consider:</p><p>Absinthe isn't/wasn't made by steeping herbs in vodka, Pernod, or everclear.  You'll no more than make absinthe via this method than you'll make wine by adding grape juice to vodka.  Even if you attempt distillation, you'll probably end up with a nasty result, which is exactly what was described in the document herein entitled, 'Absinthe Experiment'.  This attempt was a total failure.  Why?  Because there is much more to making absinthe than can be described in a paragraph or two of badly translated information (e.g. 'Arnold recipe'), and you won't be successful using this information, regardless of what equipment you have.</p><p>Modern absinthe (or 'absinth') is only a ghost of what the original liqueur was.  I know this because I own three preserved bottles of fine label original absinthe (e.g. Pernod Fils, etc.).  Modern products typically have artificial colors, weak herbal content, seductively high prices, and are pushed with some very slick advertising to suck your money from you.  FWIW, there is currently no modern product I have had yet which is like the originals.</p><p>T.A.B.</p><p>Chemist</p><p>Absinthe Historian</p>"
}
