{
 "title": "Seeing the Mind",
 "author": "comrade",
 "citation": "Citation:   comrade. \"Seeing the Mind: experience with Cannabis (ID 2719)\". Erowid.org. Nov 28, 2001. erowid.org/exp/2719",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1997",
   "ID: 2719",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2001",
   "Views: 7229",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThere had been a couple times where i had smoked weed and never caught off of it.  I always questioned why people did it and spoke so highly of it.  I never quite understood this.  Then one time, after school one day, my friend came up to me and told me he was high, and i asked him to describe it.  He told me that things seemed to go very slow, and different things seemed a lot more alarming.  I just passed it off and though nothing of it.\r\nThen about 2 months later, a friend of mine ended up picking up 2 grams just for the night, and ended up getting a very nice count.  Now there were about a dozen people with us, but only about 5-6 who were smoking.  Everything went into different assorted pipes.\r\nThe setting was a park, one which i had been to many times. So the experience began with all of us being like kids with candy, taking as much as we could, not knowing what we'd feel like afterward.  As we were smoking, i think about after the 5th hit, i finally started to notice something.  Sure enough, it was just the onsets, and i was happy that i was finally high and could now start to relate to people about what being high was about. \r\nThen after everything was smoked, everyone was being extremely loud in the park and i could hear every conversation which everyone was having, regardless if i was 2 feet from the person telling the story or 10 feet.  I could hear everything.  I could hear the wind, and also the city night.  I never understood this in my life, how to hear everything at once like this.  Normally my brain just concentrated on what i wanted to listen to, or everything would be bundled up.\r\nAt this point that's when it finally hit me.  My vision became intensely like a strobe light, on a slow setting.  I can duplicate the same effect by opening my eyes for a brief second and then closing them and doing this over and over.  Images of everything were being captured, and i was trying to talk to my friend about me relating to what he had said to me at school, but he was so fucked up that he was too busy laughing at everyone =).  This didn't really help out my experience at all because i felt like i was alone.\r\nAs the night progressed i started on the exploration of my inner self, learning about things which i had experienced, and who i was.  Putting together thoughts, and travelling on the brain waves of thought to understand how things are connected.  As i dug myself deeper and deeper into my mind i slowly noticed paranoia creeping up on me.  I was alarmed with many things and proceeded to act somewhat like a cat, quick and very attentive.  My friends thought this was all funny and just couldn't get enough of it.\r\nThen when things started to calm down, i ended up saying to myself 'something else, something else.' The first something else would be louder than the second one.  Thus, throwing me into a trance.  The two different levels of sound i was now exploring became my whole reality.  Kaleidescope vision would happen when i would close my eyes, and i would continue to repeat this while wandering around the park closing my eyes.  For most of the night, everyone just laughed.  But because it was my first time of exploring myself, i was more entertained by things which i was doing, rather than what people had said.\r\nThree years later, i'm now very experienced with marijuana.  And from this great plant, i uncovered different secrets about music, thinking, art, and other mind entertaining subjects. I wonder to this day what i would be like if my mind had never been exposed to this insight.  I think i would be a lot more of a dull person, and ignore things which meant a great deal to personal exploration.\n\n\n"
}