{
 "title": "No Map and a Hundred Dirt Roads",
 "author": "Saxy",
 "citation": "   Saxy. \"No Map and a Hundred Dirt Roads: experience with Ephedrine & Cannabis (ID 2721)\". Erowid.org. Nov 24, 2001. erowid.org/exp/2721",
 "substance": "Ephedrine & Cannabis",
 "bodyweight": "93 lb",
 "header": [
  [
   "DOSE:",
   "4 tablets",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2721",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 24, 2001",
   "Views: 17881",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt was a normal day, woke up around noon from the phone calls of friends wanting to 'hang out and do stuff.' I decided to actually get up and get dressed instead of lying in bed all day. My friend J called me up and asked if I wanted to go catch some coffee with him at my favorite coffeeshop...we had seen each other the night before, he came over late to smoke a little weed before I went to sleep, helped me sleep nonetheless.... </p><p>Anyway, back to the story at hand. I went with J to the coffeeshop and, of course, he being the persuasive one and me being the little naive one, he offered me ephedrine tablets (popping 6 in his mouth at the time). I decided, ahhh heck, just pills, I'll do it.  Took four of those babies and was good, and along with the caffeine in the mocha I was totally jumpy. </p><p>We were leaving the coffeeshop and when we got in his car I popped in my fav. cd and felt good. Well, I guess nothing is good enough for J, so he took out his stash of weed and waved it in my face. Hmmm, gee, should I do it? Let me think.. Uhhh YEAH. So we packed the bowl and drove out onto some dirt roads. After smoking just one bowl I was gone & not too long after we were both completely stoned. Sure, this was all well and good, but we were so messed up that we didn't even know what direction was which. We drove down what seemed to be endless gravel roads and I could read the signs on the roads, and they sounded familiar, but I didn't know where the heck we were. I was just waving my hand out the window and bouncing to the techno beats. I've been high before, but nothing like this. I was on my third day and that's a lot for me. I was totally gone. Finally J turned around and headed 'back,' well, what we THOUGHT was back anyway. We got out to a busy road about 30 minutes later and we were about 20 miles south of where we first came from and about 15 miles from my house. </p><p>Later that night I went to our county fair and saw the demolition derby. Amazing. It was an AWESOME high and the good thing was, it lasted a long time. I know it sounds stupid, but I seriously think the effies induced a better high for me. If I don't take too much, I can sustain a high for a long time with weed.</p>"
}
