{
 "title": "Addiction Over the Years",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Addiction Over the Years: experience with Opioids (ID 27261)\". Erowid.org. Oct 26, 2006. erowid.org/exp/27261",
 "substance": "Opioids",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Opioids",
   "(daily)",
   " ",
   "  repeated",
   "IV",
   "Opioids",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27261",
   "Male",
   " ",
   "Not Given",
   "Oct 26, 2006",
   "3928",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I shot heroin for the first time when I was 17.  It was everywhere and cost a Dollar.   Then I was cleaned up and sent to Vietnam.   It was cheaper and more available there.  Not thinking I would live to see tomorrow, I used heavily.    Returned home to the States and kept on shooting it.    Years went by, I got busted and send to prison where I stayed clean for over 3 years till one hour after my release or less.   </p><p>I tried to move away from my addiction geographically but was fooling myself.  I then found Mexican heroin which was less pure and had to learn Spanish to survive.   Every Penny and waking thought was of where was I going to get the $ for my next fix.   Every time I bought heroin from a complete stranger, I took it for granted that this might be that bag of death so many of my friends bought through out the years.  The stealing, crimes (non violent), risking my life etc involved possible prison or probable death.  To me it all sums up to death is secondary to getting high.   At the point that needle is hitting the vein is the moment that I knew I was at most risk of dieing but that was only secondary and incidental to the high.</p><p>Then I moved again and Dilaudid was the only thing to get.   I was running from myself.  I chose a Methadone program this time.  I was then in my mid 30's.   Although I still tried to get high on heroin/ Dilaudid, it was more powerful than heroin and there was no rush shooting Dilaudid.    I completely changed.   All the money from work went into my pocket.    What a change!    The Govt was finally helping me help myself.</p><p>Even though I allowed heroin to control me, I could not allow others to control me with a cup of juice dangled before me.   Even though in reality then I was not in control, I had to be the one in control and was sick of being doped up all the time.  It gave me time to breath and see life was more then the next fix.  I stopped cold turkey taking the Methadone after 3 years and had a month of pure night and day hell.   I'm a person that if he's going to do it, it's going to be right now on my terms.  </p><p>I got back on a private Methadone program after tiring of writing prescriptions.    I was not in control of my dosage.  I wanted 30mg a day since I knew my body and they gave me 75mg a day.   Thus keeping me really addicted and paying.   I got pissed after a year and quit cold turkey again.   Worst withdrawal in my entire life.   </p><p>I turned to only writing my own prescriptions after that.  I didn't trust white / brown powder from a stranger and if some Doctor can do it, so can I was my mind set.    I did this for about 11 years and never got caught.   I had every facet planned out and every aspect of the unexpected precalculated.</p><p>I'll be 54 this Month.     I'm married with 2 Sons, own 20+ acres, high dollar tractor etc....</p><p>I realized I was an addict for life, our system didn't give a hoot, I didn't choose to stop and had to deal with life from my perspective alone.   I had several options as I saw it-on my terms.  Continue and go back to prison, die, quit or pace myself.</p><p>I chose the latter 2. </p><p>What I now do is get a (legal) prescription every month for (Rx) and satisfy the beast inside me.   Then I just live a drug free life till the next time I can satisfy the beast within.  I've been doing this for many years now and seems to work for me.   To me it's realisation of who I am, what I want and how do I get it.   It's a meeting of both worlds that keeps me sane and knowing too much of a good thing can be bad for me.   </p><p>This is my Life's experience.</p><p>If I had one wish--it would be that I never tried heroin.</p><p>I don't know how it ends yet.</p>"
}
