{
 "title": "Experimenting with Bhang",
 "author": "Jello-9",
 "citation": " Jello-9. \"Experimenting with Bhang: experience with Cannabis (ID 27264)\". Erowid.org. Dec 20, 2004. erowid.org/exp/27264",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "",
   " T+ 2:00",
   "5.0 g",
   "oral",
   "Cannabis",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27264",
   "Male",
   "",
   "Not Given",
   "Dec 20, 2004",
   "27023",
   " "
  ]
 ],
 "report": "<p>About a month or so a friend of mine J suggested we make Bhang which is a ancient idian recipe for pot infused milk. I consider both of us pretty experienced in marijuana. We've been smoking for about 4 years and we usually only smoke good quality grass. Anyways the recipe (which we stumbled upon in a book i can't recall) called for pretty basic cooking conditions. </p><p>First of all it required 10 grams of pot per quart of milk. It suggested that a 140-150 pound person drink half a quart of milk. We thought it was a tad bit too daring to drink 5 grams of high quality bud in one go (and too expensive)...so we decided to go with your typical mexican brick schwag. </p><p>Anyways we had a free weekend to make the stuff so I called J and he said I needed to by a quart of milk and a stocking. I asked about the stocking and he said it was used to strain it. I never heard of this technique but he assured me it was better then your average strainer. So when I showed up at J's house he already had the 10 grams of weed in a pot of water. The recipe called to boil the pot in water for about 10 minutes or so. After straining the pot from the water we then put the moist pot back into the empty pan and poured a little of the milk to let the weed absorb it. After a minute of this we poured all the rest of the quart of the milk into the pot.</p><p>We heated the weed milk for about a half an hour and then strained it using a funnel attatched to the stocking over a container. For the most part no weed got into the strained milk. The part that really mattered was this...we then squeezed the shit out of the stocking that was holding the strained weed. All of the really strong thc infused milk comes from squeezing this. After this 'easier then it sounds' operation we chilled the weed infused milk in a fridge for about 3 hours. I MUST WARN YOU ALL the milk tastes really really bad unless you do one of the following:</p><p>Either make chocolate milk out of it</p><p>Or add cinnamon, nutmeg, ect to make it taste better.</p><p>Now another note I should make is the recipe said the milk should be a sort of green but it looked just about the same as before it was infused (we came to the conclusion that we just strained it really good using the stocking).  Later on that night I decided it was time to try this stuff out. I drank about 4/5 of the milk after adding nutmeg and cinnamon with some pizza. and then came the long wait...I also must note that I smoked alot a couple of hours before this...but I was pretty sober before I drank the milk.</p><p>After about an hour and a half I got a slight head buzz similiar to eating brownies...it slowly evolved into an intense high over the course of 2 hours and peaked at around 3 hours after I drank the milk. The high was more psychological then physical...it felt more thought-producing then a body buzz. I drank the 1/5 of the milk left after about 3 hours proceeding the initial drinking of the milk. The 1/5 did remotely nothing that i could recall.</p><p>This was a cool new way of getting stoned. Eating/drinking pot can last alot longer and have stronger effects then smoking it.</p>"
}
