{
 "title": "The Flaming Barrels Incident",
 "author": "Ellis D",
 "citation": "   Ellis D. \"The Flaming Barrels Incident: experience with Salvia divinorum (ID 2726)\". Erowid.org. Dec 7, 2001. erowid.org/exp/2726",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum",
   " "
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2726",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 7, 2001",
   "Views: 7542",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAbout a year ago I came across salvia being sold somewhere on the internet, the company promised 'strange hallucinogenic properties; organic coloured geometric patterns, and deep emerging experiences', I thought what the hell (I was going through my 'lets get high on every substance we can find' period of my life at the time) let's order an ounce and see what happens. Well the very same day the salvia came I rushed upstairs to take a few tokes after relaxing for a bit with the lights off and stuff.</p><p>I took three hard hits, each held in for 30 seconds, a few minutes passed and I began to feel very heavy and slow, I went to lay down and stare at the cealing, as I walked I could feel like I was being pushed, and it was clear that I was slightly intoxicated. I layed down and tried my best to get into the experience but I got nothing, just a headache, and an empty wallet.</p><p>A few weeks passed and I had gone back to it several times but still none to very slight effects (strange dots, a fuzzy vision, intoxication etc), until one day I came home and was in the tail end of a particularly good MDMA session, for some reason I decided to go back to the salvia to see its effects with the MDMA. I sat on my bed took a few deep tokes, the smoke went down well, didn't hurt as much as when I wasnt on MDMA (probably due to the pain numbing feeling u get on some pills) and I could hold it in a good while.</p><p>I layed back and could feel the effects coming on slowly, I stared into the darkness and strange swirly shapes appeared (nothing major really not what I'd call tripping), the shapes grew in colour and intensity and I closed my eyes to try and view some funky CEVs. It took a while to get 'into' it, it was kind of like flowing into a different 'state of reality', I could see three flaming barrels rolling in front of me quite vividly, but I had to try hard to properly visualise or make sense of anything. I could make out a lily which opened with a burst of light to reveal a beautiful green woman, but after that it ended as quick as it had started.</p><p>I didnt see anything particularly intresting in my salvia explorations, nor did I gain any particularly insights from it, who knows maybe it was all the other chemicals swimming around in my body, maybe it was just me, i've given up on the rubbish they sell on the net and I'll keep looking for some slaviaX5 fortified leaf or some salvanorin extract.</p>"
}
