{
 "title": "The Everlasting Snorter",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The Everlasting Snorter: experience with Codeine, Oxycodone & Diazepam (Valium) (ID 27269)\". Erowid.org. Jun 30, 2006. erowid.org/exp/27269",
 "substance": "Codeine, Oxycodone & Diazepam (Valium)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "insufflated",
   "Pharms - Diazepam",
   "(ground / crushed)",
   "  T+ 0:00",
   "300 mg",
   "insufflated",
   "Acetaminophen",
   "(ground / crushed)",
   "  T+ 0:00",
   "30 mg",
   "insufflated",
   "Codeine",
   "(ground / crushed)",
   "  T+ 0:30",
   "30 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   "  T+ 0:30",
   "1950 mg",
   "insufflated",
   "Acetaminophen",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 27269",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 30, 2006",
   "Views: 42738",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: this person took 2.25 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]</p><p>I always snort my pills, I have found that this makes the high more intense and more euphoric, but it makes the high not last as long. I started off by making my surroundings better. I dimmed the lights (better on eyes), put on techno (trippy when high), got a glass of kool aid(for drinking while I snort), and locked my door (so my parents don't walk in while I'm tripping).</p><p>I then started crushing the pills all at once, but in separate piles. I first snorted the Diazepam (valium) 4 5mg pills. I then started to feel real happy and felt real relaxed. I then snorted the codeine.</p><p>I then sat down in my chair and closed my eyes listening to the crazy beat. I felt so good my body was numb and relaxed. My mind did not have a thought in it. </p><p>I then went back to the snorting. I always snort the oxys last theyre the most intense, and make me trip balls when Im on other things. There were 6 5mg pills. The problem with snorting these though is that there really big and ended up making like 30 or 40 lines (but I enjoy snorting so it made no difference to me). I snorted about half of it, then decided to take a break. It was about 30 min. since I started and I could feel my body and mind leaving reality. I stood up and fell and then got up and sat down. I sat there and tripped for 5 min. then started again.</p><p>I snorted the rest and turned on my black light. I sat down and felt like I was in another world, more like in a parallel universe. It was about an hour in and felt like I was in complete euphoria. A feeling that I've never felt in my life, and never have since. I then started getting itchy from the oxy. I then tripped for a while (not sure how long) and when I opened my eyes I couldn't remember where I was, but then I did remember so I got up to get some kool aid but couldn't get up. I couldn't feel my body at all.</p><p>This is when I blacked out. In the morning My mattress was on the floor, my chair on my bed frame, and made a tent out of bed sheets, windows all open(even screens), and my desk was upside down. </p><p>This completely scared me away from pills. For about a week! hahaha! I am the never ending gobstopper of drugs!</p>"
}
