{
 "title": "Even Deeper",
 "author": "J2013B",
 "citation": "   J2013B. \"Even Deeper: experience with Mushrooms & DPT (ID 27283)\". Erowid.org. Apr 23, 2007. erowid.org/exp/27283",
 "substance": "Mushrooms & DPT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 0:50",
   "50 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   "  T+ 1:10",
   "50 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 27283",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 23, 2007",
   "Views: 10284",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wanted to take the trip that would completely flatten me once again, and go perhaps deeper than I have voyaged yet. I had 4 grams Psilocybin mushrooms and 100mg DPT to work with. I have tried the 2 together at 3.5 grams mushrooms + 50mg DPT once before. I wanted to do this right. I waited until my apartment was quiet and my roommates were in bed, so my setting would be solo, in darkness, and in silence. I had this voyage planned for a couple weeks and was excited the moment had come to say the least. Hours before dosing I felt rushes of energy just thinking about the oneness I was hoping to achieve.</p><p>2:04 AM - I munch down the mushrooms on peanut butter crackers I have to admit I dont care for the taste of shrooms and this method really disguised the flavor well.</p><p>T + :30 - I feel the first alerts from the mushrooms pictures tacked to the walls are growing in unison and feel like theyre getting closer than would return to their normal position.</p><p>T + :50 - The pace of the trip is picking up. I insufflate 50 mg of the DPT in one line, planning to have the peak of the mushrooms and peak from the first wave of DPT coincide. I lay down on my bed to see how strongly Im effected. What was meant to be a 10-minute break between lines ended up lasting 20, because it was becoming increasingly difficult to perform physical action, like lifting my head off the pillow. </p><p>T + 1:10  I finish my DPT, taking the last 50mg up my nostril. I had prepared a bongload of some awesome herb I had saved for this experience  hash plant, before taking the line. Trying to examine the beautiful nugget before burning, my vision was a fuzzy pixilated mess it looked alive. </p><p>T + 1:20 - After exhaling my smoke, I found my chin at rest on top of my bong, and my ego completely destroyed. How long have I been sitting like this, man? I quickly found a place for the bong on the floor before I spilt the thing on my bed.  Making a trip to my bathroom- I take a moment to stare at the prints on my walls of many of Dalis works. The bizarre aspects were a bit frightening, but the tricks Dalis paintings were playing on my head were magnificent. </p><p>From this point I started practically nodding off- entering classic transcendental states of mind, out of body experiences. Finding myself crumpled up in strange positions in various parts of my room, on the floor, in my bed, or slumped in a chair. Time had become so dilated it reminded me of inhaling nitrous on psychedelics or a 5-meo-dmt flash. Spectrums of color filled my vision. I encountered a concentration of female voices murmuring, I couldnt say exactly what their words were, but they seemed quite real and arrested my full attention. </p><p>T + 2:40  Nearing the end of my DPT plateau, I pack a pipe of my nugget. After taking a few lungfills I gazed out my window to witness some of the most impressive open eye visuals I have ever seen. I saw a virtual reconstruction of the entire landscape. Nothing was solid  everything was melting, electric with energy. It was near sensory overload. Realizing I had let my smoke linger in the room, and noticing I didnt stuff my door, I entered a paranoid phase of scent spraying and conspiracy forming for about 15 minutes, that I can look back and laugh about. I wrote no ones looking thru this onto me to help my self out of my delusions. </p><p>T + 3:35  Still finding myself drifting down the rabbithole for minutes at a time, I was seriously impressed with the experience this combination had produced. I had only smoked a half-gram of my pot at most, and the few hits had launched me into outerspace completely. I was actually disappointed I hadnt been able to pack up more herb during the trip. I was fairly drained from the intensity of my experience. I laid down receiving exquisite pleasure from the warmth and softness of bed, until finding sleep at about 7:00 AM (T + 5:00).</p><p>This combination was mind-blowing. It left me satisfied, and I wont need to trip again at this level for a couple months. I had considered an LSD / DPT combination. I find acid causes the out of body effect to an even greater extent than mushrooms  so I could imagine nodding off for even longer periods of time, possibly with more intensity, if I had tried those 2. I would jump at the chance to smoke DPT freebase.</p>"
}
