{
 "title": "One Year After My First Trip",
 "author": "god",
 "citation": "   god. \"One Year After My First Trip: experience with Mushrooms - P. cubensis (ID 27295)\". Erowid.org. Dec 23, 2003. erowid.org/exp/27295",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "90 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27295",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2003",
   "Views: 7171",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe grass was saturated with psilocybin. That was the first thing I noticed as my pupils dilated. It was greasy sticky translucent blue waving beneath my feet. I was filled with motion sickness and the dramamine was in my pocket, not my stomach. The wind didn't smell clear, it smelled like marijuana filters and saliva. <br>I pressed my face into the crawling dirt. It piled over me, dropped insects into my pores. I was so many people! Every viewpoint became mine and my eyes exploded and finally I could see everything. The trees were twisted around me. I loved being a prisoner of freedom! Intricate designs in soap bubbles floated past me, stained my skin. My hands were blue. It was all that psilocin. It was all that rolling in the grass. You've never been trapped by laughter the way I have. You've never been a slave to happiness. It was exhilerating, the way there was no way to feel my own emotions or hold my thoughts; they were fleeing and screaming shrilly as they went. My identity paraded away and flew up in a hot air balloon...I think my name has been claimed by the moon. The sun rained snowflake patterns and cut tragedies into the peaceful harmonies of future emo boys. My legs sprayed forward - I was sprinting over bodies, creating carcasses and not even remembering I would meet the same fate. <br>Everything became aquatic. I was a fin on a shark eating a fish, I was being eaten. I was a cracked spine. I was sitting under a tree.<br>My pupils contracted and I went in search of a toilet.\n\n\n"
}
