{
 "title": "Killing Off the Superego",
 "author": "Mr Jaco",
 "citation": "   Mr Jaco. \"Killing Off the Superego: experience with Opium (ID 27346)\". Erowid.org. Aug 27, 2006. erowid.org/exp/27346",
 "substance": "Opium",
 "bodyweight": "105 kg",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "smoked",
   "Opium",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27346",
   "Male",
   " ",
   "Not Given",
   "Aug 27, 2006",
   "15022",
   " "
  ]
 ],
 "report": "<p>I thought that getting hold of opium would be impossible so I was grateful that Gautier, Baudelaire, De Quincey and Cocteau had left behind a record of their experiences ( albeit not a very objective and scientific one). A gentleman whom I met at my faculty told me, casually, how easy it was for him to access opium and that opium was for him and the members of his community almost an article of first necessity. He could get me some any time I wished. I was surprised and I thanked my fellow student for his offer. </p><p>Still I let some time go by before deciding to enjoy the experience. A very old acquaintance came to the UK to spend a few months with me. This was the perfect occasion.</p><p>We spent something like $40 USD and received approximately 8-10 grams of opium which at first glance looked very much like the sort of hashish that one can buy in Spain and Morocco. The smell, however was totally different. As was the consistency and, of course, the effects.</p><p>Lacking a pipe ( a proper pipe) we decided to chase the dragon after consuming between the both of us approximately 50 % of the stuff. It took an hour for us to start feeling something and by Jove did it hit us! Firstly that nasty inner policeman, (in vulgar Freudian terminology the Superego) disappeared. It was almost as if it had melted off the back of my head or perhaps flown away like a flock of pigeons.  For the space of nearly 24 hours I had no worries and no anxieties. I had become the perfect aspidistra.</p><p>Then the scratching sensation began (surprisingly pleasant) and achievable with heroin too. My friend took to the chaise long and I simply laid in bed.</p><p>Our ears couldn't tolerate anything else apart from Ludwig Van or Bach. The third symphony was particularly pleasurable.</p><p>We tried jazz and other classics such as Korsakoff and Mussorsky to no avail. Only symphonies like Bethoveen's Eroica could put our minds and bodies at ease. We had prepared a fabulous exotic fruit salad soaked in amaretto and vodka which we ate with delight. We didn't engage in conversation and if the subject of women ever came up it always lacked any sexual content (!) in fact, with opium libido decreases dramatically, which for a certain amount of time is also another form of liberation. </p><p>We fell asleep and woke up in middle of the night, satisfied and happy, still in a perfect communion with the Lord ( o demiurge 0 whatever that the cosmic principle calls itself) and ate a perfectly cooked steak in pepper sauce accompanied by a fine Spanish Rioja. Again I had eaten that thousands of times in the past but that particular steak, that particular wine I shall never forget. We ate almost ceremoniously. Then we smoked some more.</p><p>There was no hangover. But the flock of pigeons returned to haunt me...</p>"
}
