{
 "title": "Fucking Weird",
 "author": "Steve",
 "citation": "   Steve. \"Fucking Weird: experience with Salvia divinorum (ID 27348)\". Erowid.org. May 24, 2006. erowid.org/exp/27348",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27348",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 24, 2006",
   "Views: 3924",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA friend and I booked a hotel room in London, England to have a safe location to come back to after a night out drinking and taking E's. We planned one night of madness in a club and then a few joints to put us nicely to sleep. He bought some 10x strength salvia, neither of us really knowing too much about it apart from it being an intense experience. Intense is an understatement. I wouldn't say I was a hardcore drug taker - I take E's, coke and weed quite regularly, but never any hard hallucinogens. We saved the salvia for the next day come down as something new and exciting to pick us up. After sleeping with a hangover for most of the day and smoking weed most of the evening we decided to hit the salvia around 10pm. I wanted to go first and my friend was more than happy to be the sitter first. I took the bong casually with absolutely no idea what was about to happen. After two of the biggest pulls I could take I laid back and closed my eyes.\r\nThe stangest thing of the whole experience was that within seconds I could not remember I had taken anything. Although I didn't know what a second was - my perception of time evaporated in seconds (how ironic). I opened my eyes and felt like I had just been born into a completely different reality where I had a past and future but didn't know who I was, who my friend was or even if I was human. I sat up. Everything around me had a cartoon like appearance and I can remember my friend laughing hard, he was hysterical and that really tripped me out. I went from feeling complete confusion to feeling complete fear. Suddenly the people on the TV (which had been on the whole time) started to address me personally, they were life size, sitting in the room with me carrying out some kind of interview and I was responding and my answers were being broadcast live around the world. \r\nReality was creeping back into the picture, I got a slight recognition that I was me and my friend was my friend and we were in the room we had booked and I realised the TV was scaring the shit out of me, and so was he. I told him to switch off the TV and go and sit quietly in the corner (which to his merit, he did without a question - I think it was the fear in my eyes!). Then reality slipped away again and the TV was back on and I was being wheeled out on the bed onto the stage in front of a live TV audience by my friend where my family were waiting to meet me in some sort of documentary about my life. Everyone was conspiring against me and I felt intensely paranoid and vulnerable. The TV was the entrance to the stage. I paniced and got up to run away (god knows where) and my friend had to restrain me, sitting me back on the bed. \r\nIt was then I became aware that I had taken some kind of drug and that what was making me feel like this and I muttered 'I've just done something' (apparently). The cartoon like appearence of everything started to retract back along the walls around me, leaving reality underneath - I distinctly remember looking at my friend when this happened - it peeled back across his skin like another skin over the top, revealing him from underneath. This cartoon film over everything was being sucked back into the TV. This overwhelmed me and I fell back on the bed, closing my eyes, after which I remember nothing until opening my eyes and feeling reasonably normal. It felt like I had been away for a couple of hours but was in fact only a few minutes. I felt confused and almost angry that I had had such an intense experience and there was no way I could possibly explain it to anyone - this is the best of my efforts and I still cannot possibly convey the intensity of the visuals and emotional extremes that I had. \r\nWhen I came round I said 'I'm back' and my friends questioning was irritating - I just wanted to lay there and think about what had just happened to me. After my friend trying the salvia, (his experience I will not try to explain as I have no understanding of it as individual journeys are so personal) I plucked up the courage to try it again, more through facination than anything else. The second time was much better. I repeated the process in exactly the same fashion. My mind was more prepared and I let go 100%. I was not scared at all. the TV was off, the lights were dim and my friend was silent. After opening my eyes I could see nothing, just blackness. Then a giant rubber soled boot peeled off from on top of me. That's when I noticed the gravity pushing down on me, it lifted and felt fantastic. Then I was falling through a tunnel made out of rolls of toilet paper and I was a toilet roll and I was bouncing happily off the sides. The sides of the tunnel were connected to my arms and I could distort the tunnel shape by moving my arms which I felt like I was doing alot, but apparently was doing so fractionaly that my friend barely noticed.  Then I was transported into a world of light beams where I was moving as a light beam, all the time reality drifting in and out, whether my eyes were open I have no idea, I think they were for some of it. \r\nThen there was a nice cool wind blowing hard over me - it was a red blanket that was flowing over me from right to left, before curling up and making giant sunflowers that disappeared as soon as they were formed, before the red blanket came back and formed another flower and so on. Reality came back very slowly, it was much easier to deal with and a very rewarding experience. It felt like a few minutes but was more like 10-15. \r\nAlthough my two experiences were completely different, my friends two were almost identical. I am desperate to try it again, but only in  a controlled environment with a sitter. The most concerning thing about the experiences is that I really could do anything as I have no idea who I am, who anyone else is, where I am or what my purpose is. I know I have one and spend the entire journey trying to work it out before coming back to the real world and realising I have no purpose. This is what has changed me psychologically - everything feels insignificant in the real world - while that might sound quite sad, it makes me realise my problems aren't problems at all and I should enjoy yourself. Maybe there is a bigger picture or maybe its just one intense herb! Either way, its fucking quality!\n\n\n"
}
