{
 "title": "Not Bad",
 "author": "Knob Hush",
 "citation": " Knob Hush. \"Not Bad: experience with Venlafaxine (Effexor) (ID 27350)\". Erowid.org. Nov 19, 2004. erowid.org/exp/27350",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "225 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27350",
   "Male",
   "",
   "Not Given",
   "Nov 19, 2004",
   "16095",
   " "
  ]
 ],
 "report": "<p>I've had my problems with depression for a while, and have been on Effexor for around a year. I'd been distant from my family, and I got into a bad habit of masochistic self-mutilation. I've also had sleep trouble for this time, and have been diagnosed Clorazepam, and when I became tolerant to that I was switched to Zopiclone (Imovane). I've been in therapy for about 3 years now. I was on Prozac for about 8 months, before being switched to Effexor. The reason I was switched is this:</p><p>I started smoking pot after being on Prozac for a while. My parents found out, and said it was okay, as long as I was careful and didn't do it that much. About a month later we were visiting my Dad's best childhood friend who is a doctor, professor, and specialist in depression. I stayed to talk to him, while our families went out shopping. He has access to alot of new information about these things, because he's in the top of his field.</p><p>He told me that I shouldn't smoke weed while on SSRI's because evidence was pointing to the fact that marijuana reduces or even cancels out the effects of SSRI antidepressants (in the long-run, at least). [Erowid Note: Not clear on the validity of this claim. See Pubmed query for fluoxetine + cannabis]</p><p>He told my parents and my official therapist this, and they decided to take me off Prozac and put me on Effexor (since I had 'ruined' the Prozac. Also the Prozac was making me tired in the afternoons).</p><p>So I went through the standard dose schedule. I was started at 37.5mg per day and gradually increased from there. I was at 150mg per day for a while, but my depression got worse, and I was increased to 300mg daily. Recently, though, I was reduced to 225mg because things have been going well.</p><p>Effexor has done me pretty well. That's not to say I haven't had my bad times though. However, nothing I've experienced has ever come close to some of the terrible things I've read in other peoples Effexor experiences.</p><p>Those may be what my dad's friend the therapist was talking about when he said that antidepressants don't go well for people on drugs.</p><p>One thing I noticed though, was that the drug abusers he told me about meds not working for were doing much harder drugs than weed. Cocaine was a common character in his stories. Not, only that, but the people he was telling me about seemed to be doing ALOT of hard drugs, and doing them to deal with their problems, not just for fun.</p><p>I've still continued smoking weed, despite my parents and doctors' wishes, but I don't think it has affected my medication or depression. I also have been taking codeine (very occasionally) that I was prescribed after leg surgery in late November 2002. I've also had a few experiences with nutmeg, oxycodone, Ritalin and psilocyban mushrooms.</p><p>None of these have caused any discernible change in my mood. I think keeping my drug use recreational helps.</p><p>\n"
}
