{
 "title": "Revelation",
 "author": "All-in-All",
 "citation": "   All-in-All. \"Revelation: experience with Morning Glory (heavenly blue) & Cannabis (ID 27397)\". Erowid.org. Jan 7, 2007. erowid.org/exp/27397",
 "substance": "Morning Glory (heavenly blue) & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "130 seeds",
   "oral",
   "Morning Glory",
   "(ground / crushed)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27397",
   "Male",
   " ",
   "Not Given",
   "Jan 7, 2007",
   "4514",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experience with morning glories was mild but beneficial.  Whenever I experiment with anything that will expand my mental state I like to read about it extensively before I engage.  I recently purchased 4 oz. of heavenly blue morning glory seeds after reading many trip reports.  I decided it would be wise to start at a low quantity just to get to know the plant.   </p><p>Before I begin my experience, however, I'll precede by explaining about myself.  For three years now I have been smoking herb habitually.  Ironically, I have been intrigued by psychoactives ever since the DARE program began drilling false information into me.  But I am also not one to 'follow the crowd.'  And my goal was never to get fucked up. I was the first one in my group of friends to experiment with substances.  Since then, I have regretted introducing them to drugs.  Thats another story though.</p><p>I began smoking because I enjoyed the profound deep thoughts that accompanied the high.  I began by successfully mixing a sober lifestyle with that of a reefer.  It was always important to respect the plants benefits without becoming attached.  I usually smoked solo, but there were also couple of close friends that I enjoyed chiefing with.  I prefer smoking low quantities of herb due to the sluggish feel I get when I smoke a lot.  So it was not hard to take some breaks from the plant along my lifes journey.</p><p>About a year ago, I got back into the plant more deeply than I should have.  My extensive use resulted in depression and contempt for humans.  Using the plant became an escape rather than what it used to be.  Late in my senior year of high school, I started distancing myself from the people around me.  I felt that I couldnt relate to anyone and that everyone was missing the point of life.  I wouldnt say that I am smart by any stretch, mainly because all I know is all that I have ever been.  But I know that cannabis was starting to take a toll on my mind.  I started feeling more forgetful, slightly less philosophical, but most of all less social.  I now go to a university and live in a dorm (big mistake).  I saw college as an opportunity to alleviate the anxiety I was going through.  By the end of the summer I started using less and less in hopes to decrease my dependence.  The occasional use increased my respect for the plants divine qualities.  </p><p>I also enjoyed experiment with other mind expanding drugs.  Ive used shrooms quite a few times (mostly at low doses).  I have loved the mushroom ever since I began growing it.  Truly, growing psychoactives (or any other plant) brings people closer to the awesome powers that these plants hold.  I also tried LSD recently, and loved it.  I finished an amazing spiritual book called Siddhartha (read it) and felt that acid would bring me closer to the world (it did).  I would definitely try it again, but probably in a better location (I was in my dorm).  I havent enjoyed hallucinogens in the city as much as in nature or the comfort of my old house.</p><p>And now the trip.  My experience on morning glory was unlike the reports of high dosages.  I began the day by taking around 120-150 seeds and putting them in a pepper grinder.  Just to warn you, it takes a while to grind that many seeds manually.  I put the semi-ground seeds into a container with around 2 oz. of water and 500 mg of Vitamin C.  I shook the concoction every once a while during the day.  I got very anxious and decided I wanted to try it that night instead of waiting for the extraction process.  I drank the mixture at 7pm (chewing the seeds that didnt get turned to powder).  Not knowing what was in store for me, I set for the outdoors with a CD player, a newspaper, and some herb.  I reached a nice spot where I was surrounded by trees.</p><p>I started to notice the nausea that I read about in other reports (thus the herb).  So I packed a bowl and tried to relieve to symptom.  The nausea was not unbearable and only lasted for an hour or so.  I actually regret smoking because I think that it diminished the seeds effects.  At my low dose, it was hard to distinguish being stoned from tripping.  During that time I laid in the forest and took a walk, simply enjoying life.</p><p>Once the herb wore off, around 8pm, my mind began clearing but was still hazy.  It was a lot like as if I smoked a few bowls early in the day and was slowly coming back into reality.  I felt great and still able to function.  I wasnt as paranoid as I usually am when I smoke bud and venture into society.  So it was easy for me to go into the city and function normally (although I still wasnt normal).  I could sense that this was deeper than just being stoned.  Next time I would like to try it without the bud though.</p><p>When I got back to my dorm I noticed that my pupils were the size of dimes.  That verified that the feelings I was experiencing were indeed the seeds and not the come-down of pot.  I started feeling increasingly euphoric and at peace with my surroundings (even my close-minded roommate).  It was a lot like the transition from LSD into reality.  I find it very fulfilling to incorporate the feelings of togetherness that I experience on drugs into my daily life (it makes that much more excellent to be alive).</p><p>The biggest mental change of the evening came in a revelation.  I have been in some turmoil dealing my situation at school.  I am confused as to where this system is taking me.  I started school going for Natural Resources, and soon found that it wasnt bringing me the joy that I thought it would.  During my trip I meditated on my situation, as I had been doing, and came to the conclusion that the Natural Resource department taught us more to manipulate the environment rather than coincide with it.  This brought me to think about other paths that would better suit my life.  I began thinking that instead of controlling earth, I would be much happier seeing it grow and giving it the respect it deserves.  I now know that I would like to cultivate plants for a living.  Most likely ethnobotanicals.  This helped strengthen my outlook on life and I now have something to strive for.</p><p>Overall, my experience with the seeds was a valuable one.  Next time I will probably try more seeds and no bud.  I look forward to the possibilities of this plant and its celestial nature.  Hopefully this report will help you out in some way and not just be a form of therapy for me.  </p><p>During my path through life, Ive felt that it is important to cherish the indescribable nature of life.  But we must remember to give back and help out everyday so that other humans, animals, and plants can live equally and with the respect they deserve.</p><p>Peacefulness.</p>"
}
