{
 "title": "The Holy Grail",
 "author": "buttlord",
 "citation": "   buttlord. \"The Holy Grail: experience with 2C-I (ID 27400)\". Erowid.org. Oct 7, 2003. erowid.org/exp/27400",
 "substance": "2C-I",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 3:00",
   "10 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 27400",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2003",
   "Views: 7654",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I can describe it as 'The Holy Grail' of hallucinogens. Its effects were almost completely visual in nature. I felt almost sober the entire time I was on it. Anyone could have perceived me as sober, with the exception of very dilated eyes.</p><p>I took it at about 8:00 PM on Saturday, just as the kegger I was at started to rage. I began drinking at about 5:00 PM, and by 8:00, I had consumed quite a bunch, and was very tipsy. I drank to work up the courage to do it, and I'm glad I did. The night before, I had almost completely talked myself out of it over concerns about warping my thoughts too much toward the negative, as most hallucinogens do to me now.</p><p>I drank a little more over the next two hours, but very little, really. Over those two hours, I noticed no effects, however I did feel myself sober up (from the liquor) very quickly. At about 9:30 PM, I felt completely sober, and began to feel the drug coming on. It felt quite a bit like acid coming up. I felt electricity in my mouth. My palms were buzzing, and my torso felt almost imperceptibly twitchy or tense. Shortly after that, I began to see the slightest color patterns if I closed my eyes. I noticed that the decorative Christmas lights in the house were getting very bright.</p><p>About an hour after I first noticed effects, I began to wonder if I had taken enough. I had been sitting outside talking to people, and really didn't notice any new effects. I could walk around fine, I didn't get dizzy, I was able to speak coherently, I didn't stare at anything or anyone.* (I warn everyone NOT to re-dose at all.)</p><p>Shortly after I thought I may have under-dosed, I went into the bathroom to check on my eyes. The walls in the bathroom were wallpapered with ripped up paper bags. I looked at them for a bit, and realized that I had taken plenty. The patterns came out, and the walls gained depth. </p><p>Over the next couple of hours, the visual effects became extremely intense. I've never actually had visual hallucinations like this. I've had effects that made a door seem to flex a bit, but the walls were actually 'breathing' this time. At times the walls looked like a drop-rippled pond. Carpet patterns were extremely complex and deep (they seemed to penetrate inches into the carpet). There was an semi-round bathroom carpet that seemed to spin like meshing gears. Textured walls and ceilings revealed obvious fractal patterns. I had all this while feeling almost sober enough to drive. Nobody could tell I was on anything. I retained all of my ego and intellect. I could hold meaningful conversations without struggling for vocabulary. On other hallucinogens, achieving this degree of visual warpage, I would have been completely hosed.</p><p>Biting sarcasm and clever witticisms flowed like a river from my mouth. It seemed my comedy switch was stuck in the 'on' position.</p><p>I went to the bathroom to see if my face was warping, but it didn't significantly, and nobody else's did either.</p><p>*The only other significant sensory warping was my sense of beauty. (That's not quite right, but I don't know how else to describe it.) There were several pretty girls at this party, and I really had to stay conscious of how long I looked at any of them, to avoid staring. Several girls who I would normally find pretty, ended up looking extremely attractive. Others, of whom I wouldn't normally think much, looked the same.</p><p>The effects lasted approximately 11 hours, from dosage to sleep. I lay tired and awake on a couch for two hours watching the colored etch-a-sketch on the inside of my eyelids before I could sleep. If I concentrated, I could control the images to a limited degree.</p><p>Still, today, two days later, I feel energetic and happy. It was everything that I'd hoped for, and nothing I'd feared.</p>"
}
