{
 "title": "A Crazy Two Days",
 "author": "phelon",
 "citation": "   phelon. \"A Crazy Two Days: experience with Zolpidem (Ambien) (ID 27431)\". Erowid.org. Mar 29, 2006. erowid.org/exp/27431",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 0:40",
   "  ",
   "oral",
   "Alcohol",
   " ",
   "  T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27431",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 29, 2006",
   "Views: 8285",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, I had never tried Ambien or even looked for it before really. My vice of choice has always been pills, mostly xanax and painkillers. So when I got ahold of 5 10mg ambien, I said what the hell and decided to try them out. \r\nThings went much different than I expected. I took the first 10mb pill at about 5:30 in the afternoon. After about 40 minutes, I still wasn't really feeling much. So, knowing at the time it was a bad idea, I started to drink a little. So of course after I got a little buzzed, I took two more of the 10s. I think I must have continued drinking to some degree because after this I have only flashes of the next 8 hours. Anyways... turns out I called damn near everyone I know at some point during the blackout-like state. There's no telling what I was talking about to them. At about 2am, someone came over to my house and woke me up. I had the most bizarre feeling like i was seeing everything out a window or something. (Thats the only way i can describe it.) I thought this was all fine and dandy, until I woke up the next day. I felt like total ass the WHOLE day, from the time I woke up until the time I went back to sleep. My reactions were considerably slow and my head felt *really* funny. The short version: Dont drink and take ambien.\n\n\n"
}
