{
 "title": "Red Devils",
 "author": "Devilish",
 "citation": "   Devilish. \"Red Devils: experience with DXM with CPM (ID 27455)\". Erowid.org. Mar 1, 2008. erowid.org/exp/27455",
 "substance": "DXM with CPM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DXM",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27455",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 1, 2008",
   "Views: 13178",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] \r\nI started using Coricidin right in the beginning of my freshman year in high school. A friend of mine had tried it a couple times and she told me to do it. I have never heard of it before, I had no idea the effects or even what it was really, but at that age I just said whatever to anything. So, I tried it.\r\nWe split a box and took 8 pills each.  At first I was filling sleepy and I didn't think it was because of the pills. We left her house and I started to trip pretty bad. I had a fever and I felt really dizzy if I turned my head or got up. It felt good though. It wasn't like I was going to throw up because I was so dizzy, it was like a cool trippy dizzy. It feels like being drunk and high at the same time. We started to do it more and more. After I started to come down from my trip I'd get tired again and go to sleep for the night. I sleep like a rock after I take coricidin, I don't even move.  When I wake up, it's like I'm still messed up a little bit. Like, it carried over from the night before. The way I moved, it felt like I was still tripping but not as intense.\r\nNow, 3 years later, I'm still using. I started using every day, in school and again at night. I started taking more and more to get a more intensive trip.  I don't know if I can stop using. I still to this day have very limited knowledge of how badly it screws you up.  This past year I've been upping my dose more and more and I've noticed that when I'm off it, my hands shake or twitch randomly and there's some days where I uncontrollably studder. I've also been having chest pains, headaches and my stomach is always hurting and is very sensitive to certain foods that I usually ate. I have no idea if this is from coricidin, but I have never had these problems before and I'm not on anything else.\n\n\n"
}
