{
 "title": "Zombie Crowd",
 "author": "Greaser",
 "citation": "   Greaser. \"Zombie Crowd: experience with Mushrooms & Cannabis (ID 27462)\". Erowid.org. May 23, 2007. erowid.org/exp/27462",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27462",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 23, 2007",
   "Views: 2747",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt all started on a trip to Slam city jam.  Which is a big skateboard competetion in vancouver, BC.  Me and My friends usually would just get baked at it, but I decided it would be fun to do mush.  Previously, to this experience I had only tripped off of 2g of weak liberty cap mushrooms, so I really had no idea what I was in for.<br>My friends older brother was driving, and he told me that he could buy me some really strong mush from an underground store on hastings.  I said sure, and gave him the money.  We Pulled into the place, and he went in to buy them.  He came out with some weird ass looking shrooms.  They were big fat dried stems with little pinner caps on top.  He said that the guy told him that only one stem was needed to get fucked up, so I decided to only munch a few.  Now, of course peer pressure began to kick in from my friends, and within ten minutes, I had munched them all. (about 12 big ass stems).  *I think they were called purple and whites?*  <br>But, back to the trip. I was feeling the usual giddiness that I feel when first taken.  We went and bought our tickets, and then about 20 minutes later, right before getting in line, we smoked a FAT joint.  Once we got in line, I started to feel them.  I didn't know what to do, and so I asked my friend to help.  My friend baked out of his mind of course.  So naturally, he thought it would be funny to trip me out.  I started to become very confused and worried, which just intensified my trip outedness.  Once I got to the person that searches you for drugs (haha already munched them), I was literally mangled to shit out of my mind.<br>Normally the guy would just let you in after a pat down, but I had decided to bring my backpack, so I had to show him every fucking zipper and pocket.  He could totally tell that I was fucked up, and kept asking me if I was ok, and what I was on.  But, his voice kept trailing off, and going deeper and lower.  After what felt like an hour (2 minutes) He surprisingly let me in.  <br>This is about 45 minutes after first taking the shrooms and I am fucking mangled.  Right when I walk in, I began to feel sick and I wanted to puke.  There was too many people, and it was waaaaaaaay to hectic.  I had to find a bathroom but my friend kept laughing at me and shit as he was pretty baked.  So finally he found me a seat to sit in, and I watched the pros warm up for the competition in the course.  I just sat there and felt so weird.  I knew right then, that although yes I'm going to be normal later, right now my mind is insane.  I had the mind of a crazy person, and I knew what it was like to be considered insane by society.  being 'crazy' is just a different way of thinking.  It's thinking using only emotion, and thats how I was thinking.  I never once thought of what I looked like, or what other people thought of me, I could care less.  I just saw what I saw, and If I found it amusing, I loved it.  If it was annoying I hated it.  At this time I wasn't really getting visuals, I was just tripping out as it was only about an hour and fifteen after ingestion.<br>After about an hour and a half, I started to get hallucinations, Everything I looked at was kind of hazy, and looked like it was partially floating.  When I looked at my hands, then were moving in a fluid motion, like the ripples of a drop of water in a puddle.  When I looked at the skateboarders ollie, there was tracers, and it looked completely slow motion, like they were levitating.  Then, the trip really took for worse.<br>(2 and a half hrs)The competition started, but I didn't really get that it had started.  The announcer of the competition was now speaking super loudly in the speakers.  The deep deep voice was beginning to sound a lot like satan!  I could feel the bass pounding in my chest, and I could feel his speech.  I could feel what he was saying in my bones.  Although I couldn't really comprehend what he was saying, it was definitely disturbing as fuck!<br>Then I looked at the thousands of people sitting in the stadium, and I saw that they were all eating in unison.  All of them, worthless drones, sitting, eating, only half watching and only half thinking.  They were at a skateboard competetion because it was the 'cool' thing to do.  All of them, feeding themselves, and living a worthless half-life of trying to fit in.  After awhile of watching them, I realized taht they were like zombies, they were soul-less beings, only half awake, and only half asleep. <br>Upon discovering this, Their faces melted and twisted into very very disturbing zombie faces.  When I changed my focus onto something else or blinked, my vision was wiped clean and they were normal, but then they would begin to melt and drip in blood.  It was like a living nightmare I swear to god It was so fucking disturbing.  I couldn't think straight, a million thoughts were going through my mind, and I was seeing zombies!  After about an hour of hell, I began to calm down a bit.  I realized that I was going to be back to normal in a few hours, and the worst was done.  <br>(4 hrs)I kept looking around at all of the people, and just pondered about life.  Why do we spend so much money and time trying to fit in?  If nobody tried to fit in, then there would be no such thing as fitting in, and there would be no 'cool'.  The world would be a happier, free'r, and more peaceful place.  After about anohter hour, I felt good enough to get out of my seat, and actually walk around with my friend.  I walked around, bought a new skatedeck, and kept watching people.  I felt really at peace with myself and the world.  It felt good to tell him about the things, and he really agreed with the stuff that I was telling him.  So I wasn't crazy anymore!  :)<br>In summary, I think that Mushrooms are something that we can find answers and meanings that are hidden in our world.  In life, we are tought to learn a certain way, and think a certain way.  Mushrooms throw all that shit out of the window, and give you a completely different way to think.  <br>Sometimes bad trips teach you a hell of a lot more then a good trip does.<br>Peace.\n\n\n"
}
