{
 "title": "Spacey and Ethereal",
 "author": "crossfire",
 "citation": "   crossfire. \"Spacey and Ethereal: experience with Amanita, Morning Glory, Sceletium tortuosum & Cannabis (ID 27476)\". Erowid.org. Dec 8, 2004. erowid.org/exp/27476",
 "substance": "Amanita, Morning Glory, Sceletium tortuosum & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "20 seeds",
   "oral",
   "Morning Glory",
   " ",
   " ",
   "0.5 caps",
   "oral",
   "Amanitas",
   "(dried)",
   " ",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "Sceletium tortuosum",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27476",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 8, 2004",
   "Views: 22710",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I found this combination to be quite pleasureable, and one which I can function on without fear of 'losing it.' I have taken the Morning Glory Heavenly Blues (organically grown) on numerous occasions over the past few months (probably fifty or so times, truth be told), and seem to have gotten the dosage down pretty well without having too much nausea. </p><p>I started out one day around 4:00 PM, on an early fall evening before dusk. The setting was a huge sports field, which really made me feel like I was on a plain in Africa when the sunset came. I downed the MG seeds with a cup of tea, and noticed initial effects within minutes, i.e., slight queasiness, a full sensation in my head, and a feeling of being flushed in the face. On some occasions, the queasiness has sparked a cathartic evacuation, at other times, the sensation has been mild and lasted only a few minutes. Eating something seemed to calm the nausea.  Anyway, after the MG seeds, I ate a small piece of Muscaria (less than half a medium Grade A one) and then smoked two or three bowls of pot mixed with Kanna (Sceletium Tortuosum) that was in a more or less powder form. I read that you have to heat up the bowl with several tokes to get the active constituents in their most viable form, so I pretended I was back in the boys' room puffing furiously just to the point where I had a coughing fit (I kept saying to myself, you're not off until you cough). </p><p>I drove to work and smoked a joint of pot and Kanna, and turned on Joe Satriani and then Blue Oyster Cult on the way to the sports field where I ended up. I have a great car stereo system, and the music was sending me into another world almost...I hated to turn the music off when I got there. </p><p>I was feeling speedy like having taken a few White Cross dexedrines or maybe several lines of good toot, but with a somewhat dreamy and ethereal quality to what I was looking at. I took a seat in a small stand in the middle of this huge sports field which must have stretched for a good quarter mile in each direction. In the horizon, the sun was setting and the trees were outlined against it. I felt completely content there. The weather was really pleasant, and I felt totally comfortable. I didn't care that one day I will die, which is a frequent thought pattern I have had my whole life but now more consistent as I enter an age that I don't want to admit right now.</p><p>I came home that night and listened to Jethro Tull's Benefit and Tempest's first album in my darkened living room with a black light. It was easy to fantasize back to the days when those albums were out, and when I was tripping on Orange Sunshine in New Mexico and going for late night drives west on Albuquerque.</p><p>The next day, I was still stoned and everything still seemed somewhat woozy but nevertheless pleasant. I can't wait to try the new shipment of mushrooms coming to me, and am planning on many future trips with the combinations I've described above.</p>"
}
