{
 "title": "Recreation Turned to Ritual",
 "author": "TheoMo",
 "citation": "   TheoMo. \"Recreation Turned to Ritual: experience with Mushrooms  & Cannabis (ID 27536)\". Erowid.org. May 30, 2007. erowid.org/exp/27536",
 "substance": "Mushrooms  & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27536",
   "Male",
   " ",
   "Not Given",
   "May 30, 2007",
   "2437",
   " "
  ]
 ],
 "report": "<p>Consuming mushrooms has probably been one of the single most defining moments as an adult. That being said, I will probably not take them after this first time. </p><p>I live in New York. My good friend (we'll call him S) told me that his friend who was visiting had scored some mushrooms and we'd be able to do them when he came to NY the following week. Many of my best friends have done psychedelics on numerous occasions, and a few have highly recommended them. I am an avid cannibis user and I've experimented with a few other drugs once or twice (nitrous and cocaine) and had kind of avoided mushrooms; thus I saw this opportunity pretty fortuitously, as a chance to see what my buddies had been talking about. </p><p>NY, being the massive city as it is, isn't very amenable to finding deserted patches of open grass where one can enjoy the sun and kick it with fellow mushroom-eaters, but there is Central Park. In the end there were 5 of us, S, myself, S's friend who brought the mushrooms, and two other friends of S. One of these guys was also a first-timer like myself (we'll call him J), and we had pretty contrasting experiences with the same batch (I'll get into that). </p><p>We weighed out the mushrooms for each of us on a scale at our apartment (we all took the same amount, .75 g), and then I ended up eating a good sized stem and some caps. Almost immediately my stomach felt pretty fluttery, and I felt some very minor 'resonance' or 'vibration' in my perception (it could have just been a mixture of physical sensation with some latent anxiety, but it was definitely perceptible). Our plan was then to race to the subway and hope we found a good place to relax at the park before any noticeable effects started to kick in. </p><p>The subway ride was thankfully quick and we ended up finding a nice bench pretty close to the entrance of the park about 45 minutes after our intial ingestion. The come-up of the drug is nothing I had ever experienced before and it was very nerve-wracking. I kept turning to my friend S and his buddy who had brought them (both of whom have done shrooms a number of times) and kept questioning them about if what I was feeling was normal. During this time nausea kept coming and going and was adding an additional stressful sensation: sometimes it would leave but a few minutes later it seemed to strike even even harder. J, the other first timer, was having a really fun time with them and told me just to chill out. </p><p>I felt really out of it so about an hour after initial ingestion I figured I needed some time away from the group. I walked down this little path on the side of where we were and found this little wooded area. I chilled on this overgrown tree-root and tried to stay calm. This squirrel approached me and seemed to wonder if I was all right. About five minutes, of sitting and intermittently attempting to force myself to to puke (no success), *it* hit - the snap. It can be accurately described as that same sensation one has sitting in a roller-coaster ride and approaching the zenith of the motorized-climb, realizing it's all down here from this point on. While in truth the trip increased after this point, it was like I had reached the point of no return. </p><p>I suddenly realized I should go back to my friends and walked back. I would get flashes every few minutes where it was very difficult to sustain a coherent visual perception of reality. I found the rest of the crew and we all decided to walk somewhere else. We came to a pretty major walkway and found another bench. We all felt extremely tired and out of it, and there was a part of me that was really getting paranoid as hell by this point. I kept rationally telling myself that if the mushrooms were poisoned I would have been dead by now and that these so far were benign. Nonetheless I couldn't shake the paranoia and I once again went for a little mini-walk. I came to this area right behind the bench we were out and tried to hold on to my old sense of sanity, but nothing was working. I told myself that if I survived the experience I would appreciate life a lot more.</p><p>I came back to my friends who seemed to be having a good time, and we talked some before I realize I had to use the bathroom (number 1 thankfully). My buddies had no idea where to go, and the park is too public a place to just drop trousers behind a tree (I have to admit I was super tempted to do that though). I walked up to this gardener who was helpful in pointing out where the nearest public facilities were. By this time colors were almost glowing off of objects (especially other people's faces) so I managed to grunt off a small 'thanks' and then walked fairly briskly to the bathroom area. I kept getting paranoid that people knew that I was tripping and right before this bathroom I saw this rocky area that seemed so appealing that I immediately diverted myself and just sat down. There were some trees in front of me and they seemed to expand to this majestic forest, and the tall shadows from the trees seemed to be dancing on the ground. I was scared that if I explored mentally this perception I would pass out right there, so I got up again and hauled myself to the bathroom area. </p><p>The bathroom was a disaster. I had heard not to look at yourself in the mirror while tripping, so I kept my eyes down and made myself to one of the stalls. While I was doing my business (standing up) the walls around me started to melt and I had to keep snapping myself out of my mental creations. I kept jerking my head up towards the ceiling to keep myself sober for a few seconds until I got out of the bathroom. I felt incredibly claustrophobic and thought everything I saw was just going to start to melt. Once I was done I booked back to where my friends were sitting. </p><p>For the next hour or so we just sat and talked. People were walking, jogging, strolling with little children by us, and we basically people watched. Things seemed to be coming out from their surroundings. The sky and landscape were an enormous canvas on which things were being painted. Despite these pretty amazing visuals, the nausea kept ebbing back and it was something I never really got used to, and would oftentimes really weird me out and cause some stress. My friends' faces seemed very contemplative so it was very reassuring to be around them even while all that was going on though.</p><p>I felt reality losing it every now and then and would keep engaging my buddy S just to ground myself in some sense of ego-continuation. I felt that if I stopped talking any sense of who I was would go down some cosmic drain and I wouldn't be able to rebuild my personality in any type of way. So I kept talking to him about shared history between the two of us (we go to school together and know a lot of mutual friends and also went travelling over the summer). Physically things felt horrible: my hands felt extremely clammy, and the weather was going nuts, alternatively very hot and then extremely windy and cold. I would look at my hands and they seemed to become distended and shift form in front of me. </p><p>Eventually, everyone else felt the need to use the restroom, so we all got up and went back to that area. We used the bathroom again (this time it went really well) and by now the visuals had pretty much ceased, and the nausea had for the most part disappeared. I suddenly realized I had this ability to enter this incredibly contemplative state and receive what seemed to be fascinating and deep insights about people and life. The five of us walked to this area of the park where there's this mock castle, and we sat down and just thought, watched the ducks in the pond, and chatted rather minimally for the next hour. There were some minor visuals but from that point on I felt I had reached some point of powerful inner reflection. It felt amazing. </p><p>After an hour chilling there we walked to this very seculded grassy area off a side road and kicked it, talked, laughed, enjoyed the slowly setting sun. We pulled out a pipe and some chronic and discretely took some hits which really helped calm any remaining jitters I had had. It really seemed to amplify the sense of clarity I was having, and I kept having really insightful, peaceful, loving thoughts. I took the opportunity to think as much as possible about myself, about what I was doing with my life, about where I thought I fit into the world. The few hours of clarity made the real stormy weather prior to all of this incredibly worth it. </p><p>The other first-timer, J, by this time was having a really horrible trip. After the bathroom (my second time but his first) he said he had just started on this downward spiral. So our places seemed to have switched.</p><p>About 5 1/2 hours after initial ingestion we all got pretty hungry and left the park. I was still feeling some mental effects (and even as I write this almost 10 hours after the experience I am incredibly mentally fatigued). </p><p>While I am no biologist, I would conjecture that the body, and perhaps some part of the psyche, views mushrooms as a poison, and a lot of what I was thinking about today was the fact that I had basically confronted a lot of my subconscious fear of death and losing control, and emerged unscathed. I view the event as a major rite of passage in my life, and if there's one piece of advice I would give to people who want to try this drug out it would be to *respect* it. I had done a lot of research on the drug before doing it but I still felt unprepared for the sensations. In my mind it was a defining moment in my adult life and many of the insights I had thought about remain strikingly profound, almost cliched, but highly valuable. </p><p>That being said, I will probably not do this drug again. The physical sensations were absolutely awful at times, and perhaps it might be better for me to view this as a one time life-defining moment wherin I can apply many of the things I learned today in my everyday non-tripping life.</p>"
}
