{
 "title": "Jumping Sky",
 "author": "Jackle",
 "citation": "Citation:   Jackle. \"Jumping Sky: experience with 4-Ho-DiPT, Alcohol, & Cannabis (ID 27544)\". Erowid.org. Oct 13, 2003. erowid.org/exp/27544",
 "substance": "4-Ho-DiPT, Alcohol, & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "5 glasses",
   "oral",
   "Alcohol - Hard",
   " ",
   "20 mg",
   "oral",
   "4-HO-DiPT",
   " ",
   "3 ",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "2 joints/cigs",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27544",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 13, 2003",
   "Views: 11735",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had aquired exactly 30 mg of 4-HO-DiPT (as a white powder) and divided it up by eye into three piles of ~10 mg each. I was very precise with this, so I am pretty confident that the piles were equal. Also, I knew it probably wouldn't hurt if I was off by a mg or two with this drug, so dividing by eye was prefered.\r\nThe night began with drinking at a bar before the 4-HO came into play. I was happy to see friends I hadn't seen in a long time.  I drank 'trash can punch' which I can only assume had everclear in it ...perhaps vodka?  Anyway, I had 5 cups of that.  Then, as a group, we went to a party out in a field, basically.  I opened a beer, got out two doses of 10 mg each of 4-HO-DiPT, and dropped them both in my beer.  It tasted nasty, but after a while it dissolved a little more and I couldn't taste it.   I was almost drunk at this point.  I had some more beers, and smoked 2 joints  of some really good bud with several other people before I felt anything from the 4-HO.  I do not know how long it took to come on or how long I tripped for.  (It was more than 2 hours before the trip was over - that is safe to say).\r\nI was being more talkative (overly so) and had more energy.  The bad part is my memory gets a little hazy about the time I started tripping, so I don't really know what happened next, but I do remember stumbling around in circles just 'tripping balls' as they say.  I kept drinking the whole night as well.  I stretched back very far (while standing) to look at the sky several times.  I looked like someone painted the sky there and it seemed to be jumping around.  The clouds made trails.  Everything seemed to be moving.   I couldn't get over how surreal the sky looked.  I remember closing my eyes and seeing green and purple  crystals everywhere.  They were shiny.  The longer I looked, the more 'crystals' grew and filled up my closed-eyed visual field.  I had a very fun night (I know that much), but once again, I was too drunk to remember a lot of it.\r\nWhen I woke up the next day, I had scabs from minor cuts/scrapes on my knee, hand and face for reasons unknown to me.  I guess I fell down or tripped a few times.  It was pretty dark out there.\n\n\n"
}