{
 "title": "Mild Experience",
 "author": "Koopa",
 "citation": "   Koopa. \"Mild Experience: experience with 2C-T-7 (ID 2754)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2754",
 "substance": "2C-T-7",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "23 mg",
   "oral",
   "2C-T-7"
  ]
 ],
 "footer": [
  [
   "2000",
   "2754",
   "Male",
   " ",
   "Not Given",
   "Sep 13, 2000",
   "Views: 5708",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWe took 23mg each, which I measured out by weighing 70mg and splitting into three equal parts.  I purchased an A&D PV-60 scale from Fry's Electronics to do the measuring; at $250, it was the only one in that price range that could do accuracy to the 10mg mark.  Even with this, it wasn't terribly accurate; I wonder how others are weighing out their dosages?</p><p>At 8:30pm we dumped our portions into small cups of water and drank them.  The taste was quite easy to cope with compared to, say, MDMA, but still not exactly pleasant.  40 minutes later we started to feel a bit strange, something like the onset of LSD, but not as strong.  Two hours later we found ourselves somewhat bored, still feeling odd (in a neutral way).  We resist the urge to take more based on experiences we read at Erowid.  By 2.5 hours, we are feeling some slight muscles stiffness remeniscent of LSD, and some bubbling in the stomach (not unpleasant).  After 3 hours, it seems to be working.  We all report feeling hot and cold at the same time, despite being in an apartment air-conditioned to 76 degrees.  The long come-up is kind of annoying because you are left waiting so long, but at least for a first time experience it makes the feeling much easier to deal with.  (As opposed to, say, LSD, where it hits you hard and fast, making it somewhat overwhelming when you don't know what to expect.)</p><p>We go outside and find it easier to deal with the cooler temperature there.  No one is having any difficulty talking or otherwise functioning normally; there is some introspection where we easily admit to some things that perhaps we have been unwilling to face.  There's a lighthearted sense to the whole thing...insecurities are quickly put aside, it's easy to put perspective on things and not take life so seriously.  One of my companions reports fractal patterns in the ceiling and carpet; another reports more organic, round, bubble-shaped visuals.  I see some distortion but little else.</p><p>Four hours and we seem to be in the peak.  The hot/cold thing is still there, but it's not as overpowering.  The body feels good; I get rushes of MDMA-like warmth in my skin which is quite enjoyable.  We try listening to some music and find that it's somewhat difficult.  We talk, light-hearted and more relaxed than we have been for a while.  We try music again; it does have an odd quality to it, but not so much an appealing one, and it seems like work to listen to it.  We try closing our eyes, which is interesting, but we all note that it is difficult to keep them closed, like springs trying to force them to pop open.  Although this drug didn't seem to give us energy, I doubt that we could have fallen asleep since we couldn't hold our eyes closed for long.</p><p>Six hours and the physical feeling is even better, more resolved.  Less introspection; mild visuals are fading.  Listening to music again and it actually seems to sound worse than it would sober; the sound is very flat, with less the sense of stereo and more the sense that there are sounds eminating from two places.</p><p>Eight hours and most of the effects have faded, but a nice afterglow is left.  Eyes are still difficult to close; music is still flat; we are still relaxed.</p><p>Ten hours and we are feeling worn out and yawning.  It seems that perhaps we can hold our eyes closed long enough to sleep, and we do so.</p><p>Sleep is long and very restful.  The next day I feel good, similar to how I feel the day after a candyflip.  I find it somewhat hard to focus on doing anything productive, but pastimes like reading and video games are very enjoyable. One of my companions reports some temperature-regulation problems, but whether this is related to the drug is unknown.</p><p>Mostly I am left wondering if the folks here that reported 20mg really took that little, and how they measured their dose.  Next time we will try 30mg for stronger effects.</p>"
}
