{
 "title": "View From The Top",
 "author": "davEy",
 "citation": "Citation:   davEy. \"View From The Top: experience with 4-AcO-DET (ID 27586)\". Erowid.org. Oct 15, 2003. erowid.org/exp/27586",
 "substance": "4-AcO-DET",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "4-Acetoxy-DET"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27586",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 15, 2003",
   "Views: 15583",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had previously tried 4-AcO-DET orally, intravenously, and by insufflation, with positive experiences.  Insufflation onset was the least pleasant. The most I had previously injected was about half of the 23 mg doses I had eyeballed.  (Eyeballing, of course, not recommended.)\r\nAt 9:00 pm I injected the compound.  This was much much more than dancing objects and my field of vision swimming about merrily.  I was jettisoned within a minute into a new state.  I realized I was still in my apartment, but visions were zooming towards me only to stop suddenly before me and drop away, or be replaced by new ones.  I was zooming through possible universes until I literally reached the top.  There was an organized or measured feeling to the experience that made it obvious I had reached a pinnacle of Being.  What I met at that pinnacle was my Self.\r\nThis was a feeling I hadn't had since my first massive LSD experience at university, over twenty years ago.  My Self, or my ego- the experience of 'I', was not me, DavEy, but rather a cosmic consciousness that superceded all of space and time.  It was like remembering who I really am.  More than blissful, I felt omnipotent because I knew that 'I' could never really die.  Certainly DavEy would die one day, but that really seemed like no big deal.  I watched as all of creation seemed to unfold before me, living and dying while 'I' remained eternal and unshaken by the passing of lives or universes.\r\nThen I felt some sort of cosmic register, a realization that there was indeed, and undeniably, more good than bad in the omniverse.  That ultimately I may have given more good to the universe than bad, despite my many misgivings about my past.  And I wanted to do MORE good, desperately.  \r\nThough recently I had been sometimes negative about my life and my future, seeing that 'I' couldn't die made me realize that since dying as DavEy meant nothing, really, then I was free to gamble with my life.  To take chances and stick it out, because the end would be the same anyway, whether I took my own life, or time took it for me.  What's the hurry?\r\nThe entire trip was over after about three hours, the descent from peak started within minutes of injection.  It was a peak experience that has stayed with me, and empowered me.  The next day I took about 30mg orally, and it was very intense, with its own characteristics and insights, but didn't have the sheer spiritual asskicking of the previous night.  In fact, there was more apprehension the second night, perhaps because- as one contributer put it- 'there is no time for apprehension via the injected route.'  Since then I have not used 4-AcO-DET, because any further exploration would have been 'chasing the dragon', and that's not what psychedelics are about.\r\nI don't encourage I.V. drug use to anyone, as it bypasses some of the body's natural defenses.  The purpose of my report is to suggest the very spiritual and healing nature of 4-AcO-DET, given the right place and time.  Oral administration seems to me to be the best route overall, and by itself has provided much insight and pleasure.\r\n--------------------------------------------\r\nMAY 5, 2010 ADDENDUM\r\nWhile never explicit in my original report about my past and regrets that I felt I had overcome in that one singular experience, I had been suffering through some six years of crime and intravenous cocaine use.\r\nIt is my complete pleasure to be able to say today that I never injected myself with anything after my experience that day with 4-AcO-DET. I will admit that it's been a slow road to recovering my spirit sometimes, but I never shot up and I never touched cocaine again. And as the record will attest, I've been crime-free too.\r\nMy best friend April was sentenced to three years in prison for selling me the drugs that saved my life. We remain best friends, from that first day she told me, just a customer then, that she loved me.\r\n'You don't get that from Pfizer.' she assured me.\r\nForever linked in the press release of her arrest, she the criminal and me 'a Canadian customer'.\r\nSometimes I wonder how many other hearts were changed like mine because April C. decided these unscheduled compounds were a good thing. It would probably be amazing to collect the stories.\n\n\n"
}