{
 "title": "Miles Past the Limit",
 "author": "Rockin Moccasins",
 "citation": "   Rockin Moccasins. \"Miles Past the Limit: experience with Alcohol (whiskey) (ID 27624)\". Erowid.org. Mar 15, 2006. erowid.org/exp/27624",
 "substance": "Alcohol (whiskey)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 27624",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 15, 2006",
   "Views: 7618",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was an april saturday much like any other saturday, full of life and thoughts of the night ahead of me. I was hanging out with a friend whose dad was visiting from Vancouver. His dad was an alcoholic, but he only drank wine or beer. He liked the buzz while my mindstate at the time was, I just wanna get as fucked up as I can.</p><p>Anyways it was my friend heathers birthday and me and my buddy were invited. We went into town at 2:00 pm with my friend's dad to get some drink. I wanted to start drinking right away til late night so I figured I'd get a 40 pounder of wieser's whiskey.  </p><p>Well I start drinking a bit mixed in with a slurpee I bought at seven eleven. Then I went to the local high school cause apparently some big band concert was going on and concert bands from all over British Columbia would be there. The reason we went was not too listen to band dorks toot there horns it was to scope for any outta town hotties. Well ill tell ya there werent too many. </p><p>During the day I paced the drinking nice and at 9ish I got to heathers house. Mostly girls were there and I was having a blast just talking and enjoying the company. By then I had probably finished 2/3 of the bottle and was quite drunk, not over the line, but nicely hosed. Then one of my other friends that was there dared me to chug the rest of it. Being hosed and confident I didn't take the challenge seriously. I slammed about 12 shots of liquor in one hit. I was fine for about 5 minutes then I vaguely remember taking huge stumbles 10 feet in either direction and walking into a tree. I fell over and heather was trying to get me to walk. I couldnt my body felt like it weighed a thousand pounds. After that I remember involuntarily passing out, I couldnt hold my eyes open. It was really strange cause it felt like I was in a coma or something cause I could still hear. I remember girls screaming at me telling me to wake up and crying and my buddy B yelling 'hes gonna die'. I have no recollection of anything after that and I woke up the next morning in a chair on my lawn, covered in vomit.</p><p>I was still so messed, I had to get my dad help me to the kitchen to get water. It was like a child learning to walk or someone who had got both his legs broken taking his first step after recovery. I drank some water and immediately puked it back up. I couldn't get anything to stay down til about 6:00 pm. It was the most absolutely horrible hangover I had ever suffered. And I scared all my friends so bad and ruined heather's party, thats probably the worst part.</p>"
}
