{
 "title": "Mental Drain",
 "author": "5.14cx",
 "citation": "   5.14cx. \"Mental Drain: experience with 2C-T-7 (ID 2763)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2763",
 "substance": "2C-T-7",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2763",
   "Male",
   " ",
   "Not Given",
   "Sep 13, 2000",
   "5781",
   " "
  ]
 ],
 "report": "<p>\nI have had several experiences with 2C-T-7 and have been thoroughly impressed with it's effects.  The visuals and thought patterns are the most intense I have ever experienced!  There are however a few things I would like to point out about this substance. </p><p>It appears to me that unlike LSD, 2C-T-7 can have an even stronger effect on 'next day' subsequent uses.  It may be that it stays somewhat active much longer than one may think.  The first time I used 2C-T-7 I took about 30~35mg (oral) and had a good experience.  Two days later me and the friend I did it with the first time tried it again with a larger group.  He and I had considerably more intense experiences than the first time users and than we had the first day.   I tried it a few more times over the next few months.  Recently I tried it again 15~20mg (insufflated).  This too was an amazing experience.  However, I noticed after this trip something I had kinda' noticed after the first few, but to a much greater degree.</p><p>For the next 7~10 days I was rather noticably detached from reality.  I could function for the most part, but considering that I am a student this became a very unnerving time.  I could not concentrate or think clearly. My memory seemed to be extremely short term, and my body was running at less than 100%.  </p><p>I'm not saying 2C-T-7 is bad. Actually just the opposite.  It has supplied me with some unique percpectives on things.  One thing that 2C-T-7 seems to do for most people is to put you into this state of mind where you think about what is 'really important' in your life.  I have heard of several people finding themselves picking up pictures of loved one's and telling themselves that 'tomorrow' I am going to be more devoted to the 'really important' things.  It is from this mind set that I have come to the conclusion that given lucky7's danger potential that for me it is not worth the risk at the moment.</p>"
}
