{
 "title": "IAP Runup Summary",
 "author": "Toad",
 "citation": "   Toad. \"IAP Runup Summary: experience with IAP (ID 27688)\". Erowid.org. Oct 26, 2003. erowid.org/exp/27688",
 "substance": "IAP",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "IAP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27688",
   "Male",
   " ",
   "Not Given",
   "Oct 26, 2003",
   "Views: 24879",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>- IAP (Indanylamphetamine) runup summary -</p><p>I recently had the opportunity to sample this novel morsel and put it to the road test with some friends. I had read the initial glowing reports and praises, so had hopes but kinda figured the first reports would be highly subjective and somewhat inaccurate.</p><p>Well one thing is for sure, This is not your Father's MDMA, no big rushing love gusher here... However it's a pretty interesting and completely novel drug. So far Ive tried oral dosages of 30,40,50,60,75mg (though not necessarily in that order). For 80kg male the effects at 30mg level were definitely not enough for full flavor, 50-60mg dosage range was also very mild natured and soft but much more of an effect than 30 or 40mg. At 75mg the effects bordered on uncomfortable during the peak, with an anxious over stimulation tone that did not add much to the pleasantness found at lower levels. Think I'll let someone else push the dose higher.  </p><p>So far Ive found that my sweet spot is 60mg for this chemical. It's effects seem most like AET to me.  A little bit of everything in there, a slight psychedelic sparkle, clear stimulation, a little bit of serotonin mood lifting, but all on micro scale. It's quite difficult to catagorize because there isnt anything else quite like it. Very easy to be in public situations, sociable, talkative, almost like a designer mood than ecstacy type experience for me. The fact that you're on a substance can easily be lost in the background. Also deserving mention was that the substance made me pretty horny. My fellow traveler also noted this and commented that his libido and prowling instincts kicked into high gear. Very clean and clear feeling substance, stimulation without too much body load or side effect.</p><p>In combination with GHB is where this compound really shines, once again the yin/yang phenomena at play.  The G provides a *very* nice euphoria synergy with IAP, no question about it, one of the best G combinations I have tried. I suspect alcohol will be similarly pleasant, although probably much less euphoric than G in combination.  My fellow traveler and I both commented that by itself IAP wasnt all that exciting in terms of feel good potential, but with G... Repeat button for sure! I have yet to try with cannabis or other substances, but I suspect it will combine well with the relaxers in general.</p><p>The kinetics are interesting, a long ramp up to peak 1.5-2 hours with a 2-3 hour plateau followed by a very long wakeful stimulation tail.  In total the effects seem to last 10-12 hours.  Good for staying awake all night at party. For all but the very low dose experiments I required ambien assistance to achieve sleep at the end of the night. The material does not seem to have any crash associated with it like typical MD's. Aside from the general wear and tear of staying up all night without sleep, recovery seemed A-OK with no mood depression or lag behind in the following days. I'm typically very sensitive to the after effects in the days following MD class experience, and this was no problem. All and all a mixed bag and interesting tool for the connoisseur treasure chest... Will be fun to see what others think of it.</p>"
}
