{
 "title": "Another World",
 "author": "Fuck Inhaling",
 "citation": " Fuck Inhaling. \"Another World: experience with Inhalants - Glue (ID 27696)\". Erowid.org. May 7, 2006. erowid.org/exp/27696",
 "substance": "Inhalants - Glue",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "inhaled",
   "Inhalants"
  ]
 ],
 "footer": [
  [
   "2003",
   "27696",
   "Male",
   "",
   "Not Given",
   "May 7, 2006",
   "19223",
   " "
  ]
 ],
 "report": "<p>I was bored one night, I was sitting at home.. had nothign to do. I smoke weed for already a year, I also tried LSD once - thats about it. I decided to try some.. I was sitting alone in my room, Took 1 hit and became very dizzy..then took another hit and my vision was all spinning.. I was hearing a loop..took one more hit and I saw people all over telling me to inhale more.. took another hit and I saw a boxing ring with mickey mouse standing in it..I'm like what the fuck.. another hit and my heart started beating extremly fast. </p><p>My vision started going all grey..then my heart stopped beating, I couldn't breathe. I fell on my bed, then I stood up and I saw a friend (who wasnt there) run to phone ambulance. I was chasing him, then I told him I'm okay but he didn't hear me. I couldn't see his face at all, it had shade all over it. I didn't know who it was. So yeah, I ran up to him and tried to grab phone, but I couldn't. Its like it was air. He threw phone down and ran out of the house, I tried to follow him but once again I couldn't open the door! He ran back in to my room and as I followed him I saw myself lying on bed passed out, not even breathing. He started trying to wake me up, then when I felt my body again I stood up and I didn't see anyone...but the thing that freaked me out was that I had fucking marks on my body/shirt as if someone touched me for real!</p><p>From this trip, I now believe that theres another world with ghosts, and god himself saved my life when I was lying dead on the bed.</p>"
}
