{
 "title": "Diphenhydramine v. DXM",
 "author": "Hack Man",
 "citation": "   Hack Man. \"Diphenhydramine v. DXM: experience with Diphenhydramine (ID 277)\". Erowid.org. Sep 9, 2000. erowid.org/exp/277",
 "substance": "Diphenhydramine",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 277",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Sep 9, 2000",
   "Views: 37440",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAfter careful research and a desire to get fucked up, I finally tried Diphenhydramine HCL.  I bought some generic allergy medicine for a local store ($2.29).  The pack contained 24 pills, I took 10 total.  I did it last night at midnight and I felt pretty normal by 9 AM.</p><p>Until now, I had thought that DXM was the most powerful OTC I had been using.  I have a friend who orders the powder and I have done up to 1500 mg of DXM, which was pretty weird.  I had the out-of-body experience and all of the experiences associated with it...I have done DXM on and off for about 3 years.  I play it smart though and don't overstep my bounds.  I typically do ~1000 mg...now on to my point. </p><p>The Dyphenhydramine HCL is a pretty potent drug.  I had actual hallucinations such as people, posters laughing, walking soda cans that sprouted legs, and if I am not mistaken I think I even saw Marlon Brando.  My point is that I never truly hallucinated before this.  I have tripped on LSD about 35-40 times, DXMed probably around 100, and so on...but the pseudo-hallucinations of DXM do not even compare.  You literally cannot distinguish from fact or fiction on Dyphenhydramine HCL.  I thought it would be an utterly exciting experience...but it wasn't.</p><p>I have always wanted to hallucinate my whole drug life (7 years), and I craved to see if I could handle the distortions of reality.  I always wanted to test the validity and strength of my mind...but they failed.  I was scared, very scared.  While tripping, I crawled into bed and begged for it to stop.  I didnt feel sick that much, but I just wanted things back to normal.  Diphenhydramine HCL is scary.  I never get scared (honestly).  Last night I could not tell what was happening.  I thought my room was on fire and I almost woke up my roommate to get out of the building.  I saw smoke.  When I waved my hand, it looked IDENTICAL to real smoke.  Scary.</p><p>I did not have a tripsitter.  If you want to do Diphenhydramine HCL, fine go ahead.  It is your sanity.  However, all in all it was THAT bad.  At least not as bad as some people's experiences.  Stick with DXM no more than twice a month or less, and just keeping enjoying life.  I am almost done with college (tier 1 school), so I have to grow up before society catches up with me.</p>"
}
