{
 "title": "Little is Enough",
 "author": "gros",
 "citation": "   gros. \"Little is Enough: experience with Calea Zacatechichi (ID 27719)\". Erowid.org. Oct 20, 2003. erowid.org/exp/27719",
 "substance": "Calea Zacatechichi",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Calea zacatechichi",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 27719",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 20, 2003",
   "Views: 17061",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Considered how many reports about Calea have been published recently, I decided to share my experience. The problem with this plant is that nobody really knows how to use it and what it does precisely (tripping? dream tripping? nothing?)</p><p>I am one of those lucky dreamers: I can remember my dreams quite easily although the memories don't last long, and without any effort I can become lucid. But this isn't the all-powerful lucidity everybody talks (dreams?) about: at one point in my overly vivid dreams, I begin to wonder if I'm really awake or not, and when I realise I'm not it can be fun or really BAD! because even though it seems I can escape/control the dream, I actually have very little control over it and feel rather trapped in it.</p><p>When I received my 50g of Calea, the only thing I knew is that the Chontal indians use it by drinking a tea, smoking a few cigarettes and then go to sleep with leaves under the pillow... charming idea by the way. I have only had results with smoking for the only time I tried the tea (10-15g) the mere taste of a single drop (with OD-levels of honey) would launch me into the bitter hell (the place where you experience infinite bitterness for eternity because you have eaten too many sweet things during your life)</p><p>Other people try large quantities of Calea with the tea method and begin tripping? I'm impressed but rather doubtful that it's anything but placebo effect. The only article I've read about Calea states that it's a slight hypnotic, and that's what it's always done to me: mild relaxation which compensates for the horrible taste of the smoke (zacatechichi MEANS bitter) and a short delay in reaction time. The only interesting effect of Calea is on dreaming, it's called dream-herb after all?</p><p>For me, one rather large joint of dried plant material is enough: if I smoke it just before going to bed, I will almost always (4 times out of 5) have more dreams and more lucidity and generally an impression of much much much it's too much much longer lasting dreams. I usually only recall the last dream easily but I'm suspecting that I'm remembering all the dreams as one.</p><p>Now, even though I find the plant effective and enjoyable, I don't think it makes my dreams trippy or more insightful at all. Maybe it's because I usually feel insane while lucid rather than 'in control'. The dreams under the effect of Calea look more like a crazy collage of events the origin of which can be known to me or not: sometimes it's the whole set of thoughts I've had during the day assembled to form a crazy movie, sometimes it's like in the movie 'the cell', like visiting someone else's weird fantasies mixed with my everyday life, and sometimes it can be lucidity hell: being trapped in a realistic dream, and when I wake up I always feel shocked by the intensity whether the dream was fun or a nightmare.</p><p>I may seem like someone who doesn't like dreaming or who doesn't like calea dreaming. On the contrary, but my experience proved me Calea is just for dreaming more, period: it can ruin the plots of my dreams by making me lucid, or making the dream unbelievable (I've been to the point where I seriously wondered if I was on datura because my dreams looked too much like delirium tremens - not fun) and thus useless. For those who can't recall their dreams, it could very well be THE revolutionnary plant, but for the others, remember that little is enough.</p>"
}
