{
 "title": "The Liquid Place",
 "author": "Jesus",
 "citation": "   Jesus. \"The Liquid Place: experience with LSD & DXM (ID 2772)\". Erowid.org. Apr 10, 2001. erowid.org/exp/2772",
 "substance": "LSD & DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 ",
   "oral",
   "Cannabis",
   "(cookie / food)",
   "  T+ 0:30",
   "480 mg",
   "oral",
   "DXM",
   "(capsule)",
   "  T+ 1:30",
   "7 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2772",
   "Male",
   " ",
   "Not Given",
   "Apr 10, 2001",
   "Views: 49572",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI noticed that there aren't really any reports that involve LSD and DXM, so I thought that I would recount one of my experiences for everyone.  It was a week after Spring semester started and me and my friends had been planning this trip for a couple of months.  It was originally to have taken place on New Years but problems arose, so the event was pushed back a week or two.  Needless to say we were all excited about finally getting this trip off.</p><p>To start everything off everyone that was participating took an asortment of vitamins to make our bodies feel better during the trip and to protect against the depletion of any chemicals already in the brain.  Everyone took 1000 mg of vitamin c, one centrum which is a multi-vitamin, one vitamin E, and co-enzyme-Q-10.  The taking of the vitamins was taking a couple pills and waiting about five minutes then taking acoulple more until all of the vitamins had been ingested.  We had already made the Hash brownies the night before so, one large browine was passed out to everyone.  These were ingested and then we all piled up in various cars and headed for the lake to dose. (We are not stupid we had people that stayed sober, so that we would not have to drive and so we did not get stuck out at the lake)</p><p>Once we had gotten to the lake the browines were really starting to hit, everything was so beautiful.  It looked like the lake was a moving painting.  There was also a very nice head change that started my trip out of this world.  It had been bout 30 minutes since the browines had been eaten so we decided this would be a good time to start taking down the DXM. The Dex had been picked up from our local supplier, and there were four of us who were doing Dex.  Because of the nausea of Dex we were taking three or four pills slowly and would then wait a few minutes before taking more.  After getting down all sixteen pills the disassociation was starting to slowly hit.  About fifteen minutes after this we each took five to ten hits of acid, which was between 300 and 400 mics.  We were getting ready to smoke a bowl to help everything along but we were told that the park rangers had been driving by so we decided to go back to the apartment.</p><p>By the time that we got back to the apartment everything was beginning to synergize very nicely.  We had decided that it would be a good idea to watch the movie Transformers on the come up.  This was where everything really started to come together, the movie was totally different then it was supposed to be.  Parts of the robots were coming out of the screen, there were laser beems that would miss the robots and would fire out of the screen.  This is only part of it.  Every scene in the movie was transforming into the next scene which was really fucked up, not to mention that I was slipping between this state of conciousness and what me and my friends have deemed the Liquid Place.  If you have seen Transformers the movie, you know that Optimus Prime dies in like the first fifteen to twenty-five minutes,  for me this took a million years to get to and I thought the movie was over, and after this point in the movie I do not really remember any of the rest for the night.</p><p>Now I will attempt to describe the Liquid Place to the best of my ability.  i have had this sort of experience on other drugs but this was in my opinion one of the most impressive.  While I was in the Liquid Place I was having memories that to my knowledge were not mine, in the sense of me in human form.  It was fucking incredible,  it was as if and excuse this expression, I were God.  I was everyone that had and ever will exist, I was omniscient.  It was like I could just pick up knowledge with my hands and instanly know everything.  I could go anywhere in the universe I wanted to.  And there was no sense of me as me.  I was just one mask that I could put on to amuse myself and that I had just forgotten that I was God and so was everyone else.  It was awesome.</p><p>Because of the DXM waves there were times when I would come back to this plane of existence and remember that I was Jesus.  And then just as fast as I had returned here I was back into the Liquid Place.  It was great I could choose any mask I wanted to and was able to play out that entire existence and then choose another one.  This went on for eons and eons with occasional glimpses into me.  </p><p>After the Dex wore off and I was just here now still tripping good but not considerably noticeable considering the intensity of Dex and LSD.  But it was time to try to get the Nitrous Oxide to work.  Filled up a balloon with two Nitrous canisters and took it in.  This sent me back to the Liquid Place for a few minutes.</p><p>This was one of my most important trips I will ever have for a few reasons.  First I remembered that I am God and that everyone and everything is God and that we are all brothers and sisters and ONE.  This trip also helped reconfirm my lack of fear of death that I had gotten from Ketamine a few months earlier.  I would recommend this combination to any experienced psychonaut.  And i hope that this report will prompt other reports on this combination.</p>"
}
