{
 "title": "At Home with Friends",
 "author": "pharmerjohn",
 "citation": "   pharmerjohn. \"At Home with Friends: experience with 2C-I (ID 27755)\". Erowid.org. Oct 26, 2003. erowid.org/exp/27755",
 "substance": "2C-I",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "0.5 tablets",
   "oral",
   "2C-I",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27755",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 26, 2003",
   "Views: 10430",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Set and Setting, - 3 old friends, one couple and one man (me). This was our first meeting in a long time and were very pleased to see one another.</p><p>All three subjects familiar with Psychedelics, two of whom had not consumed any at all within the last 12 months.</p><p>Three of us took half a well defined and pressed tablet. The tablets were small, tall, scored on one side, and indented with a lower case 'i' on the other. Tablet estimated to be 20mg judging on effects.</p><p>Alert came at about t+00:30</p><p>The comeup was gentle and almost unnoticed, largely in part to the fact we were not paying attention. One subject noted that it was so 'much better than ecstasy' in terms of the lack of rush and smooth ingression into the experience.</p><p>With some alcohol and smoked cannabis, the peak period developed at about t+01:30, with plenty of giggling and word play.</p><p>All three subjects commented strongly on the linguistic feel to this substance, and noted a lack of any visual interference but the traditional breathing walls and rippling carpet. These OEVs were subtle and nuanced and could easily be screened.</p><p>Talk flowed easily and the meanings trickled right out, perfectly correct without effort - a phenomenon that may have been imagined, but I don't think so.</p><p>We were still going strong at t+03:00, talking and laughing and joking - the drug keeping things clear. I noticed that I was much more prone to listen than usual, and that at times, vocal communication was, at root, just animal noises with a sophisticated gloss; and despite all these well turned phrases replete with meaning and significance gushing from our mouths, it was still just apes grunting.</p><p>Comedown was gentle and kind. By t+05:00 all were beginning to tire and more cannabis was smoked, and more port was drunk. All were in bed by t+06:00 although 2 of us needed an hour in bed before sleeping.</p><p>Refreshed and unaffected the next day.</p><p>No adverse side effects other than some uncomfortable wind (farting)</p><p>One subject would try it again at a similar dose</p><p>Two were willing to try again on higher doses (15-20mg)</p>"
}
