{
 "title": "Life Changing Experience",
 "author": "Bearlybreathing",
 "citation": "Citation:   Bearlybreathing. \"Life Changing Experience: experience with Ayahuasca (B. caapi and P. viridis) (ID 27767)\". Erowid.org. Oct 21, 2003. erowid.org/exp/27767",
 "substance": "Ayahuasca (B. caapi and P. viridis)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 g",
   "oral",
   "Banisteriopsis caapi",
   "(extract)",
   "  T+ 0:05",
   "50 g",
   "oral",
   "Psychotria viridis",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27767",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 21, 2003",
   "Views: 13570",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI start this post with a cautious eye and since of being totally unable to explain in any great detail of my dreamer friends Aya journey this past evening. As he sits before you connected on some strange plane with all who inhabit this space we know as the forum.\r\nThe following I post as questions to any who may have experienced some or any of the same or similar experiences. I feel I am rambling and somewhat disjointed but please bear with me as I attempt to get this down.  The dreamer sits here nearly 11 hours after he was humbled and shown a power unlike any he has ever encountered in his 53 years of holding this space as a human.  Humbled and in some ways broken by this experience.\r\nWhen I say broken I dont mean to imply he has lost his indivuality but rather to say for a time he lost his way.  He found himself taken completely by the Aya to an unfamiliar and not entirely comfortable place.\r\nIt started with his last Aya journey of 50 g C/50 g V / where he encountered the jitterbugs. A very physical and joyful experience of energy racing thru his body and being expelled thru his fingertips, the dreamer giggled like a child and marveled at the clarity but limited visuals. This experience left him feeling as if he had only touched the mountain but was unable to climb it. The dreamer felt the overwhelming need to break thru the wall of uncertainty and reach within his person and cast out years of negativity and hardship.  Therefore in his preparations for his second journey he decided to push the envelope. \r\nHe read multiple post from the forum and sought advise from several of the forums gifted and bright people but nothing could have prepared him for what happened last night. The road home was a long and arduous one. From time of ingestion to reasimalition as a human was 4.5 hours.  I will follow with some notes that were taken by myself as well as the sitter. I am extremely thankful that the sitter was present and helped him get through this process, which at times was very powerful and all consuming. \r\nTo think that I can even put in words the overwhelming power would be an understatement!  aprox. 1 hour after ingestion the dreamer felt the first effects and realized at that point that something of great power was going to happen (the spice consisted of 75 grams of Caapi and 50 grams of Viridis) a considerable increase from dream # 1: 50/50.\r\nThere are several differences in the reduction process from dream 1 to dream 2 besides the obvious increase of 25 grams of C.  One of which was the 3 x process was increased to 4 x with the last wash sitting overnight in a pan of cold water with 1 tablespoon of vinegar in an effort to withdraw more of the spice. The following morning the final wash was cooked down one last time and the solution was added to the other 3 washes and then all 4 washes were reduced to 1-cup total.\r\nDuring this final reduction the dreamer noticed for the first time that the solution in the pan had turned very clear/reddish. Not the usual cloudy look. This 1 cup finished product was left to sit one more night in the frig were the solution became cloudy again. Finding this the next morning the dreamer found more sediment in the bottom of the jar and going against popular advise he decided to filter this sediment out by using a small funnel stuffed with cotton balls. This done, he squeezed the excess liquid from the cotton into the jar. This same filtration process was used on the V and neither liquid became clear again. \r\nThe dreamer then took the 2 jars to his bedroom and sat them on the dresser while preparing the room with sage smoke and candles.  He ask that any bad or negative spirits leave the room and to make way for Lady Aya. He asks lady aya to come into him and help him free the negative energies. He asks that she take him and free him from earthly bounds and guide him to a safe and peaceful place. He then sat on the corner of his bed and drank the C spice in one huge gulp, fighting to keep it down he paced the room several times and shook it off, waited 5 minutes or so to let his stomach settle then started drinking the V.  This was even harder to get down and it took 3 attempts, gagging each time and fighting to get it down but finally he was successful.\r\nTime finished all spice was 6.18 p.m.  He noted on his paper that he probably would not go away too far as he did not drink the sediment from the C but he hoped that it still would have some residual effect regardless. This was a learning process. \r\nNotes: followed the diet very carefully and have had no food for 5 hours 15 minutes prior to ingestion.\r\n7.05 feeling a little nauseous, can hear his stomach rumbling.  Feel body stresses. Have physical sensation in his mouth/ lethargic\r\n7.10 (his last moments of having any control) trying to make it to 1 hour holding the spice down before expulsion/he got close\r\n7.15 (Sitter takes over writing notes) puke, puke, puke. He is shaking violently. Kneeling at the toilet\r\nIm sorry, dont worry. Dont call anyone please. I dont mean to scare you\r\nSitter (I made him go to bed, he is shaking violently and hunched over) he keeps saying over and over* im sorry to put you through this. (He keeps trying to throw up in the trash can beside the bed) he is concerned about making a mess and tells me he has no control over what is happing and that he needs me to help him through this. He says that he may not be able to make the bathroom because he is unable to get up.  His speech is slurred and broken. Says he feels like he has molasses in his mouth\r\nI just want to be over the throwing up and shaking part\r\n8.30 p.m. Sitter (1 1/2 hours of shaking and throwing up.  Doesnt look to me like he is enjoying himself!\r\n9.30 p.m.  Stops shaking\r\n9.45 p.m.   Starts shaking again* ever worse than before*\r\nSitter... he is moaning and talking incisively repeating the same things over and over.  He is curled up in a ball on the bed and moaning (this is soooooo powerful) there is no way I can explain!!!\r\nTell me im ok Lynne... Non stop talking... tell me someday ill be the way I was...\r\nSitter... I turn him over and look at his eyes to see how he is doing. His face is blotchie. red and white.\r\nHe turns over again and says...* I have issues* Starts talking again, this is so powerful. I want to be a good human. I want to make a difference in some kids life. There has to be a reason for my existence, I realize im not important in the grand scale of things. Im this little speck in the universe but my very existence has to fulfill some greater good for the world.\r\nAm I going to be all right Lynne?\r\nYou will be fine!\r\nIm sorry for hurting your feelings...Im sorry for making you go thru this on my behalf.  \r\nI have no control. This is so powerful...I cant control anything o.k. Eeeeeeeeeeeeeee (slurred speech) \r\nI just need you as my friend and partner to help me thru this.  I dont know if I can do this on my own.  Its so incredible powerful...\r\n10.00 p.m. still talking a lot (never relaxes)\r\nIm so humbled by this. I still have a ways to go... I cant control anything here.\r\nSitter... he starts shaking his arms as is casting off something and says. Go away...go away... all you bad stuff, go away!\r\n10.30 p.m/ he is quitted down and seems very drained and sits up on the side of the bed with his head down. This was very traumatic for him.\r\n! 0.45 p.m. he runs a hot bath and gets in for a soak\r\nAnd there you have it.  All the revelations, the fear of not being able to get back to my wife from wherever I was.  There is no way to explain the space I was in because there arent any words I could muster up to qualify it. My feeling in hind site are this. I ask Aya to take me and she took me.  My preconceived ideas about the vine and its power were all shattered in a 4.5 hour period.\r\nOne doesnt or cant instruct aya to take them here or there because our tiny universe in the scope of things is just that. A tiny universe and we are little specks of matter that blow in and out with galactic dust. We settle here and take up what we think are roots and begin our merger mundane lives grabbing all the material wealth and power we can. To be human could mean an acceptance of our inevitability compared to the greater universe. I know in some way I am forever changed.\r\nI have no great expectations that these realization will change my entire being but I can never be who I was knowing my insignificance, knowing my vulnerability, knowing I am weak and truly powerless over my ultiminent fate. This will take some time to sort out in my head and im not sure I will ever try as it wasnt anything I could have changed... Humbled and drained of what ego I had I can only speculate that I took a powerful dose figuring that I would go a bit farther that my first dream but I never imagined how much farther. \r\nMy partner was my security string that tethered me to this world. I was unable to release that string and im not sure Aya would have let me. The holding on and not letting go was not a conscious choice but what little grasp I may of had for fleeting seconds did not allow me to be anything other than taken.  Taken and laid helpless as Aya did her magic.  The positive part of this is now, not then. Not while I was under her wing. Not while she pulled and ran like a child thru my veins. Not while she humbled me before her. Only now can I grasp the scope of what happened as bits and pieces flash in my waking dream. This dream I call humanity.  This dream that is one thought in the collective consciousness of the universe.  This dream that may or may not be me!\r\nI would like to know if others have experienced the violent shaking/ neurological lack of control and feeling like you are at the edge of the obis tethered by a thin thread that could break at any moment and you woul\n\n\n"
}