{
 "title": "The Reality Store",
 "author": "Eph",
 "citation": "   Eph. \"The Reality Store: experience with Salvia divinorum (5x extract) (ID 27795)\". Erowid.org. May 2, 2007. erowid.org/exp/27795",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27795",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2007",
   "Views: 2939",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I sat on my couch in the basement, turned the lights on low, put Tear Garden on winamp on the pc, and sat down for a few mins with the loaded bong near by.  After feeling relaxed enough, I took a big hit from the bong, and set it down behind the couch. I closed my eyes, and forgot where I was.</p><p>Before I knew it, I existed outdoors in a universe where the natural colors were red, white, green and pink.  I felt like a child again, I was playing outdoors in what seemed to be a front yard, with abnormal colored grass and sky, with a white fence, with a friendly being that seemed female.  </p><p>After what seemed like a half hour of playing, a stern male being called me to come inside the building that existed in the yard.  I did not want to leave my new friend, or stop playing.  But after a few times calling to me, I felt the need like it was time for me to go see what the male being wanted.</p><p>After coming inside the building, it felt like a grocery store, I felt like I had been here before, (maybe on other salvia experiences???).  The being led me to a counter, he got behind it, and pulled down a device for me to select something out of, I was to choose a REALITY to go back into.</p><p>I did not want to choose one, I saw what seemed to be the one I came to this strange place from, I felt that my whole 19 years living in it was rather insignificant, seeing that it was just something my brain was just passing time in.</p><p>I was busy feeling very un-important, and looking at the other realities that there were, and before I knew it, I was sitting on the couch again.</p><p>Now I remembered the grocery store, I visited it many times in past salvia trips.  I had this strange feeling, like I should have my mom try salvia, like it would be a bonding experience. After I straightened otu a little more, I relized how obsurd that idea was.</p>"
}
