{
 "title": "Unable to Walk, Talk or Remember",
 "author": "Shwaa",
 "citation": "   Shwaa. \"Unable to Walk, Talk or Remember: experience with Diphenhydramine (ID 27792)\". Erowid.org. May 21, 2006. erowid.org/exp/27792",
 "substance": "Diphenhydramine",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "27792",
   "Male",
   " ",
   "Not Given",
   "May 21, 2006",
   "50879",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was not my first experience with diphenhydramine, but I feel secure in the assertion that it will be my last.  While I found the effects to be interesting, there were no mental revelations and no euphoria, two things I use to define a successful drug; and worst of all, the aftereffects were simply torturous for at least 12 hours.</p><p>To begin, it had been awhile since I had tripped in anyway, and was looking for something to achieve that effect.  Being out of DXM (my drug of choice), I knew I had an extremely large bottle of generic brand allergy tablets, which were very cheap upon purchase, and I had tripped on the 25 mg tablets before.  I was in nice mood, not extremely giddy nor extremely depressed.</p><p>Weighing in at a little over 200 pounds, and remembering decent effects at a dose of 16-18 pills and no effects at a dose of 8-12 pills from previous experimentation, I decided I felt secure in a fully-developed dose of 24 tablets...the most I can ever imagine putting in my system.  The previous experimentation had proved nil in the after effects, and the fact I had classes at 9:00am the next morning was considered but ignored.</p><p>Although I don't remember the time frame well, I imagine I dosed at around 11:00pm.  Dosage was easy with a bottle of water on a semi-full stomach.  I fiddled around, got ready for bed, and lied down to prepare for the coming effects.</p><p>Let me note that I did not inform my roommate of my plans, and that he never awoke during my intoxication.  He is a deep sleeper, which is a very good thing.  Also let me note I don't have a tendency to make a lot of noise or wander whilst tripping, and felt well enough protected in a dorm setting to not require a sitter.  Of course, I wasn't a virgin to the substance, which makes all the difference.</p><p>After about an hour an a half of laying in bed, I begin to notice twitching movement out of the edges of my vision.  Things seemed to jump and/or appear in the corner of my eyes.  I knew this to be normal, and wasn't extremely impressed.  I looked at a poster of The Doors on my wall for a while, watching the figures twitch and move (the effects had gradually intensified) when I found myself with the urge to urinate.  It maybe worth noting that in order to avoid drymouth, which is a prevalent factor on this drug, I kept a bottle of water present at all times, and drank from it regularly.</p><p>While lying in bed, I felt completely sober.  It was as if I had never taken the substance, although I never forgot that I had.  When I got out of bed to go to the bathroom however, I realized I was truly intoxicated.   To describe movement as difficult would be an understatement.  Walking was as difficult as can be imagined; I felt extremely light and my legs didn't seem to want to cooperate.  Opening a doorknob (in fact, reaching out and touching a doorknob) took utmost concentration.  I also found it quite difficult to get out of the bathroom once I was inside, and almost panicked when it seemed the doorknob had disappeared.   </p><p>This happened several times (I have to pee a lot on this stuff), but nothing interesting happened until about my third trip to the bathroom.  I got out of bed, headed for the door, and stopped sharp.  I couldn't possibly remember why I was out of bed, or standing up.  My short term memory blew suddenly and completely, and stayed gone until the next morning. This is the worst drug to affect the short-term memory I can imagine.</p><p>Despite all the afore-mentioned effects, my thought processes were still cohesive.  I realized that with my constant trips to the bathroom, and the flushing of the toilet (which is quite loud) would probably eventually awaken my roommate.  Looking back now, I question the logic of my decision, but I decided I would go and hang out into the lounge until I thought I was coming down.  </p><p>I began to dress, which took several different tries since I kept forgetting what I was doing, but finally I got on some clothes and left the dorm.  At one point while walking, I took a step and it seemed there was no ground beneath my foot, but I regained balance and made the rest of an uneventful walk and down three flights of stairs.  By this point, I had forgotten why I was out of my dorm and out near the lounge, and that I had wanted a PowerAide, but having to pee reminded me.  I entered the lounge (this was probably about 2am) and it was filled with at least 5 people I didn't know quietly studying.  I politely nodded, although I was clearly freaked out, used the bathroom, and left, heading back upstairs.  It's possible that these were real people, but equally possible that they were not.  I don't recall if they were there when I left, because I left in quite a hurry.</p><p>Upon returning to the room, I got back in my bed, and had the only real hallucinations of the night, and they were really only pseudo-hallucinations, as I like to call them.  I looked at my   roommate sleeping, and although I could clearly see my roommate, he looked exactly like my cousin 700 miles away.  I could see both people asleep at the same time.  I've had similar experiences on DXM where I will look at something, see it clearly, but my mind will convince me it is actually something else.</p><p>Also, suddenly my roommate sat up (while still lying down clearly) and began to talk to me in the first person about an event he wasn't present for, nor that he even knew about.  I found that clearly bizarre, but when I went to respond I discovered the most frightening effect of the drug:  I had lost the ability to speak.  I convinced myself this would only last the duration of the trip, and that it was probably my mind saying I couldn't speak, but it was still frustrating to try and nothing happen.</p><p>Finally I went to sleep and awoke at 8:00 the next morning, hallucination free and able to walk and talk, but that didn't prevent me from feeling like utter crap.  My mouth was constantly dry no matter how much I would drink, my head felt slightly painful, my stomach was borderline nauseous and I was dog tired.  I went to my 9:00 class after a shower, and endured it, but was unable to force myself to go to my 10am and 11am classes, and skipped them in order to sleep these effects off.  I awoke around 3pm, still with the drymouth and nausea.  They were gone by the next morning.</p>"
}
