{
 "title": "Mild and Interesting",
 "author": "Azure",
 "citation": "   Azure. \"Mild and Interesting: experience with 4-Acetoxy-DET (ID 27822)\". Erowid.org. Oct 26, 2003. erowid.org/exp/27822",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "4-Acetoxy-DET",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27822",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 26, 2003",
   "Views: 14000",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nStraight out of class with Fall Break upon me, I decided to give 4-ace-det another go. Having tasted the material at the 15mg level with positive albeit mild results, I allowed some indulgence and opted for the 25mg dose. Mixing the material in orange juice, it went down with virtually no taste. First alerts were felt in 10 minutes as a sort of transitional confusion, quickly moving into a a fairly sensual and relaxed psychedelic state. The brevity of this experience makes it somewhat difficult to comment upon, but it seems to be much softer/smoother than the diisopropylated tryptamines (5-meo-dipt, 4-ace-dipt). The frequent comparison to psilocybin holds some merit, but 4-ace-det seems to act on the nervous system more as a stimulant. As such,  4-ace-det lacks the depth of psilocybin, and thus lacks the darker dimensions of the psilocybin experience. \r\nThis in mind, I must emphasize that the 'darker dimensions' of psilocybin tend to be the most profound when attended to appropriately. At 25mg 4-ace-det, body image seemed most heavily affected, though in a subtle way. Furthermore, I gained some insight into the general pattern, or learned tendency, I have in using psychedelics as relates to personal health. As a result, there has been a shift in the way I consider psychedelics as part of a larger aspiration towards healthy living. This shift has largely manifested as a generally more wholesome and relaxed body image, though these changes do tend to change :). One thing of note, after the majority of the primary 4-ace-det effects passed (4hours), I slipped into a sort of exhausted/tired/content state not unlike melatonin. This mental fogginess persisted for a couple days afterwards, but nothing too major in terms of hangover. All considered, I would conjecture that this material might have some use in treating body-image issues where the darker aspects of the psilocybin experience are undesirable.\n\n\n"
}
