{
 "title": "Final Success for an Ayahuasca Hardhead",
 "author": "Gumby",
 "citation": "Citation:   Gumby. \"Final Success for an Ayahuasca Hardhead: experience with Moclobemide & DMT (ID 27841)\". Erowid.org. Oct 26, 2003. erowid.org/exp/27841",
 "substance": "Moclobemide & DMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Moclobemide",
   "(capsule)",
   "  T+ 0:05",
   "150 mg",
   "oral",
   "Moclobemide",
   "(capsule)",
   "  T+ 0:10",
   "150 mg",
   "oral",
   "Moclobemide",
   "(capsule)",
   "  T+ 0:35",
   "150 mg",
   "oral",
   "Moclobemide",
   "(capsule)",
   "  T+ 0:35",
   "130 mg",
   "oral",
   "DMT",
   "(freebase)",
   "  T+ 1:05",
   "80 mg",
   "oral",
   "DMT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27841",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 26, 2003",
   "Views: 13146",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have pursued Ayahuasca for quite some time, meeting failure after failure.  I was getting quite discouraged as I increased both MAOI and DMT dosages without effect.  BE WARNED:  This is not a doseage strategy you should use for a first attempt.  I only reached these levels after about five iterations.\r\nt-35 150 mg Moclobemide \r\nt-30 150 mg Moclobemide \r\nt-25 150 mg Moclobemide \r\nt=0 150 mg Moclobemide + 130 mg DMT freebase \r\nt+20 two eggs over easy \r\nt+30 80 mg DMT freebase \r\nI ate the eggs because there has been some reports of the DMT getting stuck in the digestive system, and eggs will kick it back out.  There were not any effects at the time I chose to take the 80 mg booster.  I took only 80 because that was all that I had left.  I was beginning to think that, yet again, nothing would happen.  I laid down to take a nap, and jokingly cursed the spirits and dared them to come get me.  (I did not and still do not believe in entities).\r\nEffects began at about t+50. I'm pretty sure that this was just a figment of my normal imagination, and not an entity, but with closed eyes, I saw a duck come over and start pecking and nudging at my chin, welcoming me into the experience. Behind the duck was a peaceful lake, and I told myself that this was much too plain to be the land of Ayahuasca. I was getting frustrated that there were no OEVs, and thought that the trip might be sub-threshold and a waste of time. After what seemed like a long time but really was about 10 minutes, OEVs finally formed, much to my delight, and at T+65, the effects had ramped up to DMT flash level. About 10 minutes into the flash experience, I felt as though I needed to burp, but my body would not let me. Eventually, I began to feel nauseous. This could have been motiion sickness from two levels. One from the rapid download of information, and two from physically thrashing around to dissipate all of the energy. \r\nRegardless, I purged, and after the purge, I burped quite easily, releasing all pressure. The flash level experience lasted for approximately 50 minutes, and then I could feel myself clearly coming down. After 5 minutes of being down, I went to a low intensity flash stage for another 10 minutes or so. After this, the intensity level dropped substantially, and lingered for another hour or so, dwindling to very low levels. \r\nAt the onset of the trip, I was feeling very cold.  I managed to put on socks and get extra blankets to keep warm.  As the trip was ending, I noticed that I was feeling extremely good.  I tried to identify where the good feelings were coming from.  It was not from the mind, and it was not from the body.  The spirit?\r\nI have tried many a time to get Ayahuasca to work, and was 100% satisfied that my efforts finally paid off. I don't see any need to smoke again. The oral administration allowed for a much longer access to the identical space. \r\nAyahuasca is now officially my favorite psychadelic experience. The only thing that I can ask for now is to make the experience last longer.  One concern makes me gasp to even think it, but I wonder if I could handle increased intensity. I was breathing very heavily, and (not uncontrollably) thrashing about. It was a great deal of physical work. I was in no shape to take such measurements, but would guess that blood pressure and pulse were extreme.\r\nThis combination was absolutely nothing but positive for me.  Some reading I had done suggested that MAOI reduced the visual component of the DMT, and that Moclobemide specifically could lead to negative feelings.  Neither of these were true at all for my case.\n\n\n"
}