{
 "title": "A True Hard Head",
 "author": "Seythenexe",
 "citation": "   Seythenexe. \"A True Hard Head: experience with Salvia divinorum (leaves, extracts, and liquid) (ID 27853)\". Erowid.org. Oct 18, 2007. erowid.org/exp/27853",
 "substance": "Salvia divinorum (leaves, extracts, and liquid)",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2003",
   "27853",
   "Male",
   " ",
   "Not Given",
   "Oct 18, 2007",
   "2704",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading several reports, I geared up with a sober sitter to try my first stint with Salvia. I have since taken Salvia several times in different forms hoping to achieve something not yet experienced. I read a lot of literature and was prepared for great things. </p><p>The first time, I purchased 1gram of 5X and smoked it in front of a video camera with my sitter present. After twenty minutes of inhaling all of it I just kind of sat there. I felt thermal waves but noticed nothing other than a slight loss of coordination when I tried to get out of a chair. After my frustrations, my sitter also inhaled a small dose through the same pipe. Replay of video showed nothing noteworthy other than my strange comment 'The lights (candles) are trying to take me, but I don't want to go with them' despite no visuals. Pretty disappointed.</p><p>Second time. I smoked 25mg of 10X followed by 1gram of 5X, this time through a water bong. No visuals. Significant thermal waves. The only odd sensation was that I 'sensed' I could see into another world. I 'think' I could see little people going about their business not acknowledging me. The experience was so absolutely subtle that I was not sure that I wasn't making it all up. I came out of the experience with a strange epiphany that I understood what to expect after death. I was not experiencing death, I just knew what to expect. It did not seem like that big of a deal. Like why are people so afraid of it? I also experienced a significant time distortion. A span of two hours had passed although the peak effects when inhaled should last a maximum of 5-10 minutes.</p><p>Third time, I chewed a quid of perhaps 30 normal dried leaves as directed by literature. One of the grossest tastes in my mouth. I kept producing substantial amounts of saliva that forced me to occassionally swallow the mixture. Not pleasant. Nothing happened. No insights. No time distortion. No thermal waves. Just a mild case of heartburn.  </p><p>On my fourth try, I again smoked 1gram of 5X along with 25mg of 10X through the water bong. More of the same, thermal waves, time distortion, no visuals. However, this time after about 2 hours, I understood the state of mind of insanity. I did not experience insanity, just an understanding of how misunderstood insane people are. More of an empathy than anything else. That was it. The insight was profound, but at the same time my response was like, 'Oh, ok.' </p><p>Fifth try. I purchased 1/2 ounce of Emerald Essence. I thought this should be it, particularly since my lungs were starting to get pretty sore. I stopped running my 3.5 miles a day from the lung soreness. I orally took 1/2 the bottle undiluted (stronger than the recommended strongest dosage) in a time schedule as directed. Absolutely nothing happened other than the burning sensation my mouth and the green stain on my white shirt from a slight amount of drool. </p><p>According to the literature, it may take several exposures before a full-on experience. My sitter had a few very intense experiences with his own salvia on different occassions (in my presence) proving to me that indeed it does produce hallucinogenic effects. On more than one occassion it was very prudent that sober people were present with him. During his last experience (with a low dosage), he began to panic, wanting to come back, between bouts of trying to sing like Barbara Striesand (which was even more disturbing). He was seeing reality through a 2D film that he could not permeate. Obviously his experiences have exceeded my own in terms of effects. On another occassion he 'became' the driver in a NASCAR race on tv moving his hands like he was gripping the steering wheel. </p><p>I have substantial reserves of enhanced leaf, tincture, and normal leaf should I ever desire to repeat the excercise although I doubt it will be any time soon. I find salvia to be an oddity because it can produce such strong hallucinogenic effects in some people and very little in others. I also cannot explain why I do not receive any visuals but have profound insights (yet my responses to them are so uninspiring) after a significant time distortion. Each time I experience salvia though, I have always approached it with respect. It's nice to be reminded that there is nothing to be afraid of after death, or to feel empathy for others, but it really doesn't catapult me anywhere. I guess I am just a really 'hard-head.'</p>"
}
