{
 "title": "Too Long to be Fun",
 "author": "atomic006",
 "citation": "   atomic006. \"Too Long to be Fun: experience with 5-MeO-DMT (ID 27916)\". Erowid.org. Nov 1, 2003. erowid.org/exp/27916",
 "substance": "5-MeO-DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "insufflated",
   "5-MeO-DMT",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 27916",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 1, 2003",
   "Views: 7753",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOct.26/03\r\nSet: happy mindset, relaxed and looking forward to another 5-MeO experience.\r\nSetting: My basement, a comfortable place where I usually trip.\r\nThis experience started at aprrox. 11:15pm one night after I had prepared my dosage and surrounding area for the trip. My younger brother was present as a sober trip sitter, and had had his first sample of 5-MeO one day prior, so he knew what to expect in some way. Mind you he smoked the substance, and my previous trips were through smoking as well, so the insufflation method was new to both of us. I knew that the peak would come on slower and remain longer but I still didn't know what to expect. I railed the 15mgs off of the end of a knife and sat back in my chair, waiting for effect. Within seconds I could feel a very subtle change in my body, almost like a tightness. I was having a conversation online with my brother's friend, who was watching the trip via webcam, when the effect became much more noticable. This is 3 mins after dosing. \r\nSince the effects came on rather suddenly, I assumed this was close to the peak. It was nothing close to what I had felt on a 15mgs smoked dosage a week before, and I felt a bit dissapointed. I was looking at the capsule of 5-Meo considering taking another quick boost when the drug jumped me up again. Now I could barely think. My eyes were open, but I couldn't talk or move, but instead just zoned out and stared into the wall. No visual hallucinations at all, but definately psychedelic. I slowly becan to slump into my chair and slide out of it. I barely mouthed the word 'bucket' as I hit the ground. I started to get an uneasy feeling in the pit of my stomach, but not quite a nauseating feeling. The shaking in my body started to get more intense and I would twitch random body parts without control. My body was the least of my concern at the moment as I was trying to focus on my psychotic mindstate. \r\nI've had enough badtrips to know how to get through them (I'm not saying that what I was feeling was a bad trip, I'm just comparing my loss of control over concious thoughts to a psychedelic badtrip), so I just tried to focus on my breathing. My brother asked me a few times if I was alright and I managed to say 'yes'. The intensity of the mental effects seemed to come on in waves for me, much like rolling on MDMA, but during the down parts of the rolls, I found I could think quite clearly, and even laugh at my situation. I was laying, twitching on the floor with my head sideways in a waste basket ;P. Then the blast would be back, and it was time to grind me teeth and bare it. After about 10 mins from the start of the trip, my brother decided to go to bed, since I was doing fine in my state. I thanked him and went back into the blah space I had gotten myself into. The waves continued for at least 20 mins, with them all being of equal or slightly lesser strength. \r\nThen abruptly I was dropped out of the peak, although much more slowly then if I had smoked the 5-MeO. Smaller waves continued for approx. 10 minutes until I could finally stand up and return to my comfortable chair. Residual effects lasted for at least another hour thereafter, and my body felt stoned, but my mind was clear. I began talking online again but found it very hard to clearly form ideas and convey them. Eventually I stepped outside to smoke a small bowl of weed just to calm down and relax but this didnt seem to work very well. It seemed like the mental after glow still overpowered the marijuana until I fell asleep. After I smoked the weed, I seemed to notice a nasty drip in my throat a lot more and this became very annoying. In review, I would say my experience wasn't very productive at all and was too long and uncomfortable to be fun. This was definately not a badtrip in my mind, its just that I wasn't able to achieve the full mind blowing effect I had when I smoked this tryptamine. \r\nKeep in mind that everyone reacts differently!! So please be very careful with this drug. In the end I'm going to stick to smoking 5-MeO because I get quicker, stronger effect at lower dosage and won't have to get dragged through an uneventful trip. Stay safe, peace\n\n\n"
}
