{
 "title": "Can I Die Now Please?",
 "author": "Moonkid",
 "citation": "   Moonkid. \"Can I Die Now Please?: experience with LSD & Ecstasy (ID 2795)\". Erowid.org. Oct 29, 2000. erowid.org/exp/2795",
 "substance": "LSD & Ecstasy",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "MDMA",
   " ",
   " ",
   "  ",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1998",
   "2795",
   "Female",
   " ",
   "Not Given",
   "Oct 29, 2000",
   "42205",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was at the House Connection 2 tour, in a well-known warehouse in Seattle, an ususpecting little raver kid in for a long ride. I had expected to take a bomb or two, like always, but nothing prepared me for what lay ahead. At approx. 11:30 I took the first amsterdam mini, after being warned by my friend A to take only half of it. Half an hour later, I didn't feel anything, so I took the other two. The party was bumpin' and I had just started to feel the ecstasy when I ran into my friend G. He asked me if I was high, and I told him I was starting to be, but I didn't feel high enough. He asked if I wanted some acid, and I followed him into the other room, where our friend E was selling acid from a breath-savers bottle. E handed me the bottle, and told me to take as much as I wanted. The next thing I knew, G was grabbing the vial out of my hand. 'Are you crazy?' he asked me. 'How much did I just take?' The darkness had obscured any notion of exactly how many drops had fallen on my tongue. He looked at me and laughed, holding up the bottle. 'Somewhere between 25 and 30 hits....'</p><p>Not even 20 minutes later, I realized something was wrong. My vision was completely gone, I was seeing a total fantasy party. I was standing with a large group of people near a couch, feeling very sick. I remember my friend A asking if I was okay. 'No,' I told her, 'I'm not.' She kept trying to get me to drink water, but I couldn't force myself to drink it. Finally, she dragged me outside. I couldn't walk by myself, so she held me up. I rambled incoherently about the meaning of life, thinking I was Michael Jackson, and the Moonwalk, in no particular order. </p><p>Outside, the fresh air made me feel a little better, and I told her I was okay. She walked me back to our group by the couch, where my friend P was seated. He asked if my tummy felt any better, and poked me. I started vomiting, covering everything in my way. I couldn't stop. 'Can I die now please?' I kept asking. I WANTED to die. My stomach was empty, and I was dry heaving for at least an hour before A finally got me to drink water. I couldn't walk. I couldn't dance. I was completely out of my mind. I felt like I was going over the edge. I was miserable. The last thing I remember is a girl I'd never seen before holding my hand and asking one of my friends if I was going to be okay. </p><p>It was 3:30 before I regained consciousness. I was lying on the couch where my friends had recently been. They now gathered around me, giving me water and hiding me from the view of the random security that had already asked twice if I needed to go to the hospital. People I didn't know came and went, everyone taking turns taking care of me, because I couldn't take care of myself. The party came and went. I was carried out to the car at 6:30 by a group of my friends, because I still couldn't walk. In the car someone gave me sleeping pills so I could sleep it off. I woke up the next day at 7:30 at night.</p><p>Lesson learned? I no longer do acid or ecstasy, although I will say I did both several times afterward. I almost died. No matter how good the high, it's not worth the price I almost paid.</p>"
}
