{
 "title": "A Pleasant Experience",
 "author": "Zardoz",
 "citation": "   Zardoz. \"A Pleasant Experience: experience with Amanita - A. muscaria (ID 27960)\". Erowid.org. Oct 30, 2003. erowid.org/exp/27960",
 "substance": "Amanita - A. muscaria",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Amanitas - A. muscaria",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 27960",
   "Male",
   " ",
   "Not Given",
   "Oct 30, 2003",
   "Views: 18705",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience with Amanita Muscaria was with 5 gram dosage. It seemed smarter to start out with a light dose to see what the effects might be. This proved to be too small a dose as it produced only very faint effects for an hour or so. My next attempt was to double the dosage to 10 grams. I prepared them by pulverizing the 10 grams of dried Amanita Muscaria v. muscaria  in a coffee mill until it had the consistency of sawdust.  It was then boiled in water in a covered pot for one hour.  Covering the pot should theoretically increase the carboxylization of the Iboteric acid by increasing the pressure slightly inside the pot. The resulting mixture did not have any bitter taste as described in other accounts. I can only guess as to why this might be. It sounds as if all the Ibotenic acid had not been carboxylized in those samples and this might be what produced the bitterness and nausea. (Perhaps the bitterness in the other accounts came from the lemon juice which was added, after all it is not tea and should not be expected to taste like tea) It had a very rich mushroom flavour like an excellent mushroom soup, the next time I will try adding  beef bouillon to the liquid. There was also no nausea whatsoever.</p><p>I was for the most part relaxed although I was somewhat apprehensive after reading some of the other reports. I kept a bucket handy in case of nausea. After ingesting the mushrooms and broth on an empty stomach it began to occur to me that it might be better to have something in my stomach just to have something to come up if I did get sick. Soon after taking the mushrooms I ate two pieces of pizza. When it became apparent that no sickness was forthcoming I continued to snack on the pizza on and off throughout the evening.</p><p>The effects started approximately one hour after ingestion. The best description I can come up with is that it is like having flu, but without feeling sick. Profuse sweating, starting at the top of the head and gradually moving down the body was the most noticeable effect. This was soon joined by extreme cold much like the chills one gets when feverish. As strange as it sounds these effects were not unpleasant. It felt much like being drunk but without any loss of mental faculties.  Other than being cold  there was a general analgesia something like a narcotic but, again, without the loss of mental faculties. Throughout the evening I was relaxed and in a very good mood. After changing clothes three times because they were drenched with sweat I finally took a warm shower which chased away the chills and seemed to reduce the amount of subsequent sweating. All effects had worn off after about five hours.</p><p>After feeling the effects of 10 gms. I will double the dosage on the next attempt possibly adding 5 gm. increments in the future. It seems to me that the important thing is the proper preparation of the mushroom to insure that all of the Ibotenic acid has been converted to Muscimol in order to ensure that there are no toxic effects. This however is conjecture. My experience may be due to the dosage or to variations in the mushrooms themselves. Only additional experimentation will prove this hypothesis.</p>"
}
