{
 "title": "Paradox",
 "author": "Mofo",
 "citation": "   Mofo. \"Paradox: experience with DMT (ID 2799)\". Erowid.org. Sep 10, 2000. erowid.org/exp/2799",
 "substance": "DMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2799",
   "Male",
   " ",
   "Not Given",
   "Sep 10, 2000",
   "Views: 6518",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAt first I saw frowning faces. I saw these when I looked to the right. It was a very symetrical, fractal image. Then I would look to the left and could see smiling faces, and everything was the opposite of the right side of my vision. The faces were good...and they were bad. They looked at me and asked me to choose. They were two opposite images that met in the middle and merged. I knew that it wasn't just images, something was showing me the duality of nature. It was like there were two true things and that both were the perfect opposite of each other. They each said, 'the other is a lie', and they were both right. It was paradox. I felt that I was supposed to try to discern which was true, (later on I wondered if I was supposed to be able to accept that things were this way, that maybe nothing was true). </p><p>I got stuck in the paradox and was infinitely looking left, right, left, right. I kind of screamed inside my head that I didn't, couldn't, possibly know, and that I wanted to return to my room, to my space and time. I could vaguely hear my dog barking on the porch, so I knew that I was alive still. But something (me? the universe?) was like 'Look, back there and here are the same, things are just a lot more clear here. You have always been here; the other is just a representation of this. You will have to solve this puzzle someday. Things are reaching the end and if you aren't careful with what you choose, you'll get stuck here, in the paradox. You asked to come here, so help me answer the question.' It was like the universe itself didn't know what to make of the paradox, so it was asking me. It kept saying, 'Do you see? Do you see why life is the way it is? Do you see now why you can't know everything...because it is unknowable?' </p><p>I was terrified because it felt familiar, like it was true that I had always been there. Like maybe the life Ive been living was just my escape from that place. The other frightening part was that it (the universe? me? god?) was pleading with me. It was flabbergasted that I still couldnt make a choice. It was like it had ended the experiment too soon and I wasnt ready yet, or maybe never would be. </p><p>(By the way, while I was 'there', it felt like I was in a small room, buried in the middle of some huge labrynth that housed everything...deep underground. Everything was in black and white. There were other beings there. They didn't seem all-wise or anything. They seemed rather mischevious...but friendly)</p><p>Then it brought me further and further away from the problem until I could see that everything, everywhere was stuck in the paradox, and that life and the universe and everything was about trying to answer the question. It told me that the dual nature of life was shown to me a million times a day (heaven/hell, rich/poor, day/night, dark/light, good/bad, yin/yang, this/that) and that the particular experiment that I was a part of was an ancient one, and that it was nearing it's end. I begged to forget, to be allowed to return to where I was lost in the details and couldn't see the big picture. I promised that I would try to discern the answer. I promised that I knew that I was lucky to have an organic life, and I was lucky that the question was presented to me in such a simple way down here on earth. </p><p>When I returned, I was scared, shaking, thankful to be alive. I looked at my hand and I could see through it. Everything I looked at had extra layers to it. I talked aloud and promised that I wouldn't forget, that I would help to decide...that I would tip the scales. The human (trained?) part of me decided that Love Would Save The Day. But the truth is that I wasn't sure...I've already forgotten half of it, and I'm not too sure what I was supposed to get out of it. Am I supposed to be able to accept that life is this way? Or am I supposed to try to help life choose one side over the other so that the eternal question is finally answered?</p><p>Maybe that's what the big bang was, maybe the universe was sick of the question of 'this or that' and it decided to introduce time, and matter and things that would blur the question so that it was easier to answer. Maybe it wanted to break things down, maybe it hoped that if everything were smashed from the crystal clear paradox view, that when things reassembled at the end of time the question would be solvable, the choice would be easier. And in the mean time, the universe was giving itself a break. It was able to break itself up into a million different conscious entities and try to answer the question without realizing that what it was doing (without being aware of the question it was trying to answer) and without having to know the big picture.</p>"
}
