{
 "title": "All Is Full of Love",
 "author": "Ebonyks",
 "citation": "   Ebonyks. \"All Is Full of Love: experience with Cannabis - Hash (ID 28021)\". Erowid.org. Jun 18, 2006. erowid.org/exp/28021",
 "substance": "Cannabis - Hash",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "0.1 g",
   "smoked",
   "Cannabis - Hash",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28021",
   "Male",
   " ",
   "Not Given",
   "Jun 18, 2006",
   "Views: 3642",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One night last week, me and my friend whom we shall call B were talking about drugs in general, and he mentioned that he was acquiring a quantity of hash oil in the coming week. Now, Ive never been a hardcore drug user (Ive smoked cannabis and done some low level DXM trips) and I had been completely clean for around three months, but the concept of getting some hash oil intrigued me. </p><p>A week later, after picking up the oil from him on an unusually warm late-October day, I began a lengthy attempt to smoke the oil. I had first tried placing it in aluminum foil and smoking it through the foil, akin to how someone would smoke heroin to little success. After many other unsuccessful methods, I eventually covered a small piece of toilet paper with the oil, put it in my pipe, and took a few hard hits.</p><p>Let me make sure I emphases something here. When people say that the smoke is harsh, they arent kidding. The burning sensation engulfed my throat, and after taking each hit, my gag reflex was set off, forcing me to suck in all of the smoke I had just expelled. Smoking with this method was very lengthy and not very pleasant, taking perhaps half an hour to smoke the small bowl of oil-covered toilet paper.</p><p>As soon as I polished off the bowl, a slow creeper stone took over my body, with very little in the way of mind effects, completely different from smoking buds. A longing to enjoy the weather engulfed me, and in an act of childish logic, I was drawn to the local playground</p><p>When I arrived, I rushed over to the swings, began pumping hard on the chains, overwhelmed by a sense of childlike euphoria. A huge grin came upon my face as the wind rushed through my long flowing hair. This regression to childhood was similar to other experiences that Ive had with cannabis, but nothing had ever been quite so intense. In my mind, I saw my smiling face, looking upon myself from a third-person perspective, only elevating my satisfaction further. As I had begun to slow down, I looked out at the abandoned playground and started to image children playing on the equipment, laughing in ecstasy. When I finally reached a stop, I saw a new level of the playground, a level of love.</p><p>As I looked around the playground, everything I glanced at made me think of all of the work put into it. From the large lighting systems, evident of the love of their designers, to the playground equipment itself, installed by middle age underpaid employees, anticipating all of the memories that would be formed because of their labor. I thought of the carefree love of the children, laughing and playing, overjoyed without a care in the world, and then, I began to comprehend nature. Seeing the trees, I felt a sense of love from them as if they cared about me. The shrubs, the grasses and the weeds all bestowed their passion upon me as well. It seemed at that moment that all was simply full of love, that everything in the universe had a purpose to bestow love upon everyone, a continuing divine cycle existed for me to observe and learn from.</p><p>My thought had shifted to a spiritual level, seeing all of this abstract love; I began to comprehend the purpose of god. The most significant religious experience in my life was a simple act of love by a stranger, causing me to believe that god is simply a force of compassion as opposed to a material being. I stared at the bare trees, relating the falling of the leaves to the riches of my own life. Even though the trees appear dead throughout the winter, theyll always come back to be bigger, and even more beautiful than the year prior. My thoughts related the leaves to the material beings in my own life, and while they are nice, it reminded me that without them, survival is still possible and that in the end, everything would be OK. I felt that god was watching over me, slowly guiding my life to prevent me from facing painful and difficult experiences as much as possible, and bestowing some eternal knowledge upon me. As I thought more about god, I started to explore the concept of asking god the difficult questions in life, questions akin to Why do bad things happen to good people? Realizing that god would have no answer, and simply respond with a large smile.</p><p>After returning from the playground, I searched for some food to satisfy my munchies, only to reach for the large bag of apples sitting on my kitchen table. I felt all at once that this apple was a gift from god. That, nourishment and the joy derived from eating was something more profound that I typically thought of it as being. As I slowly ate the apple, I felt thankful for the cycle of nature around me, that life itself would grant me such a gift.</p><p>This was followed by a long period of personal reflection, before I softly and quietly descended into the world of sleep. This trip was something I greatly enjoyed, but its to a point beyond recreational use, so I doubt that its something that I would do again in the near future. Its something that will stay with me for quite some time, however.</p>"
}
