{
 "title": "Lucid Dream",
 "author": "Justin",
 "citation": "   Justin. \"Lucid Dream: experience with Paroxetine (Paxil) (ID 28056)\". Erowid.org. Nov 3, 2003. erowid.org/exp/28056",
 "substance": "Paroxetine (Paxil)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28056",
   "Male",
   " ",
   "Not Given",
   "Nov 3, 2003",
   "13884",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have always had anxiety problems especially in social situations unless I was drinking or amongst friends and even had the occasional panic attack in which I felt like I could not even breath normally so I decided to give Paxil a try.  </p><p>The first day I took paxil I felt almost drunk and more happy than usual but after the first week I just started feeling very lethargic and my appetite increased dramatically. I ended up putting on about 25 pounds which in the end made me even more depressed and anxious because I've always been conscious of my weight and how I look even though I was never really that much overweight until now.  Paxil turns me into a machine without emotions. I had no appreciation for things that used to interest me like music and friendship.  As it turned out, I ended up being very unsocial and shallow at the same time.  The whole two months that I took Paxil I had eaten, slept, and did a whole lot less.  This drug seems to rip the soul from my body and I would highly recommend staying away from it unless you have serious anxiety issues.  </p><p>I still take this drug on very rare occasions when I get more anxious than usual, but I do not take it everyday like I'm supposed to because of the negative side effects and quite frankly this drug isn't helping me that much anymore because my body builds up a tolerance to it after a short time period but I definitely know that I do not want to be under the influence of this drug anymore because of how 'dull' I feel.  The whole time taking it I felt like I was in a dream state and time seemed to go by faster than usual.  I'm suprised that they can market a drug with so many side effects.  I'm controlling my anxiety now successfully with behavior modification and I'm stopping this drug completely very soon.  I'm starting to have side effects of lightheadedness but I'm just waiting them out because this drug sucks so bad.. peace</p>"
}
