{
 "title": "Clockwork Orange",
 "author": "Holy",
 "citation": "   Holy. \"Clockwork Orange: experience with Ginger, Nutmeg & Cannabis (ID 28073)\". Erowid.org. Jun 5, 2007. erowid.org/exp/28073",
 "substance": "Ginger, Nutmeg & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 Tbsp",
   "oral",
   "Ginger",
   "(cookie / food)",
   "  T+ 0:30",
   "15 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 3:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28073",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 5, 2007",
   "Views: 5372",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFriday the 31st october.\r\nTwo of my friends and me are planning to do nutmeg. We planned to do the experiment two weeks ago and decided that saturday the 1st would be quite convenient since we had to prepare ourselves mentally and we also had to know a little bit more about the effect that nutmeg would do. \r\nNeither me nor my friends ever did any drug other than cannabis and alcohol. So like I said, mental preparation was almost an obligation as we all didnt know a single hint of how hallucinogenic trips could feel like.\r\nThe persons involved in the experiment are me, S. and J.P.\r\nToday S. brought me 3 bags containing 4 nuts each, which means approximately 20g per bags.\r\nSaturday November 1\r\nOk today is the day.\r\nIn a few minutes Ill be eating a perfectly dosed 15g of freshly gound nutmeg administrated by a table spoon.\r\nNote that in this text, and it is not superflux to mention it, I will talk about my personnal experience only as obviously I didnt felt or saw what my comparses did. S. Will give me few comments or impressions.\r\nFrom here, Ill make a description of the trip by exposing the effects felt hours after hours, or minutes after minutes if necessary. Lets The Trip Begin!\r\n3:30PM  S. and me took a tablespoon of ginger each to regularize our cradiac rythm during the trip.\r\n4:00PM  We begin to eat the nutmegs. The taste soon pass from bearable to almost unbearable. We eat slowly.\r\n5:00PM  I feel a low pot buzz like effect. S. dont feel anything, yet. I still got to finish my dose.\r\n5:30PM  J.P. gave up the experiment due to the utter bad taste. He didnt felt any effect later on.\r\n6:30PM  I feel the effects are growing. I first thought it was in my mind but soon discovered a mild reality ditortion. Some other friends come by. I begin to feel extremely good while listening to ambient music! Then we eat. The food tastes good and bad at the same time, I cant tell. Its seems like we are eating for an eternity. I become a bit cynical, like if I had drank alcohol.\r\n7:00PM  The effects are growing more and more. Its difficult to remember recents events.\r\n7:30PM  Another friend come by. I didnt remember that he had called. He brought 7g of cannabis. S, J.P. and me decide to take out some hits. I become stoned very quickly (Im sensitive to chemicals). Euphoria is growing. We are listening to a moby song and everything is beautiful!\r\n8:00PM  I smoke some more weed and then I realise every perception, except sounds perceptions, are highly distorted. I begin to create a crazy world inside me: J.P. is Now J.P. The Ring. When I tell him who he really is, he answer by saying he doesnt understand why I call him J.P. The Ring and I thought that was funny as hell! I couldnt stop laughing! Then J.P. along with an other friend E, are becoming some obstinating uncles. That was magnificient!\r\n9:00PM  We decide to watch Clockwork Orange. I had a good understanding of the movie but when I was watching it I felt like I was a part of the t.v. screen and that I was only a witness of the event of the movie. That felt awesome.\r\n11:30PM  I become pissed of with the movie and go make some cleaning in the kitchen to remove nutmeg rests and weed ashes. Its seems Im cleaning for an eternity but at the same time this eternity is not long! I cant explain very well but it felt like I was walking faster than what the speed of the time would allow me to.\r\nSunday November 2\r\n00:00AM  I smoke some more weed before going to bed. When Im done with the weed I cant remember what I wanted to do before and decide to go on internet! I put some Fenomenon on the MP3 player and Im tripping as hell. The music gets me in a blue-like universe constantly glowing of every colors! My eyes are somewhat back-flipping ! Wow!\r\n1:30AM  I then feel extremly tired! I do a little bit more cleaning and go to bed\r\n8:00AM  I get up, a bit dizy but ok! I have a low headache and I still feel stoned from the nutmeg! Like if I had smoked an hour ago or so. Everything feels good. Short-term memory is still very deficient and my eyes are still a little bit red. I play Age Of Empires 2 and im amazed that men once did what im playing!\r\n10:30AM  Im still stoned, but things seems to slowly take off. This is all good!\r\nThe rest of the day fells very dreamlike. Like if I really lived but far away from my body. My eyes seemed to be behind a white veil.\r\nAll in all, nutmeg was an extremely great experience and a mix with cannabis seemed to enhance the effects. No sign of tachycardia or bad trips, only full pleasure and confort!\n\n\n"
}
