{
 "title": "Oil and Water",
 "author": "Hypocrite",
 "citation": "   Hypocrite. \"Oil and Water: experience with LSD & Mushrooms (ID 28077)\". Erowid.org. Jun 7, 2007. erowid.org/exp/28077",
 "substance": "LSD & Mushrooms",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "oral",
   "LSD",
   " ",
   "1.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2003",
   "28077",
   "Female",
   " ",
   "Not Given",
   "Jun 7, 2007",
   "Views: 6715",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first thing was the eel. It was crawling across the bottom of Potter's fish tank, slowly lurching it's way around. Of course, no one else could see the eel. They all saw a rock. I knew that it was an eel though. I closed my eyes. The backs of my eyelids were buzzing, softly, and everything underneath was glowing. Like when you stare at the sun too long, and then get the afterimages. Much more intense. Swirling patterns of blues and greens, colors that have no name, colors that don't exist in any other realm. </p><p>There was this giant starfish, which wasn't a starfish, but it is the only way to describe it. It was spinning slowly in the middle of this void, shooting rainbows from each of it's arms. Then the spirals. I was seeing nothing but spirals, and then I became a spiral. I was a spiral within a spiral, and there were spirals within me. </p><p>I became thought. Not a thought, not a singular thought, but thought itself. I forgot my body and became nothing but oil thought, which is significantly different then water thought. Thought is everywhere, and so all I wanted to do was just free float everywhere. I realized how very limiting and useless my body really is. Language is really hindersome. There is so much for me to say about this experience, but no way to really say it.</p><p>I realized that I was a fish, trapped in a persons body. And all I really wanted to do was go and do fish things, but I couldnt because I was stuck in this land body. I determined that my soul got mixed up somehow with a fish, and that I couldnt reverse it.</p><p>At one point, Potter and I were laying there, and I opened my eyes, and there was only Potter. The wall behind him was gone, leaving nothing but open void. And him. He was more then blue. Potter's soul was beautiful, and I wanted him to be with me more then physically anything but physically I wanted to connect to him I wanted him to be oil with me because there was oil and water and I was oil, so I wanted him to be oil. I wanted to touch him but not with my hands or body. I wanted to touch him with my mind.</p><p>I was a balloon. A red balloon. And I needed to be anchored down or I would float away or pop. I believed that I was better then God, because I know that I exist. I cannot see God, but I can see myself and touch myself, and hear myself, so I am better then God.</p><p>I determined that everything exists. Not necessarily physically, but if an idea can be concieved, then it exists. I tried to taste my words as I spoke. I moved my mouth, forming the words as if they were solid objects, putting my lips around them and moving my lips for the words and the sounds.</p><p>I said words over and over again trying to make sense of their meaning. The words 'thought lard' were the funniest. I just kept saying thought over and over and over again as if it were the first time my tongue had ever uttered the word. I found it quite amusing.</p><p>At one point, I looked at my hand and there was this hole in it that wouldnt stop bleeding. And I closed my eyes, and my hand was still there, bleeding and bleeding. I started to panic because I couldnt stop the bleeding. Potter put God on my back, and tapped it up and down so that I would calm down. When he did this, a blue skinned woman appeared, bursting slowly toward me, spreading her arms and smiling, rays of light shooting out of her chest. And I was at peace. </p><p>Another woman was laying on her back. A giant sphere of a woman, without a head, but with legs, spread eagled, fish nets up to her thighs, and she was rotating, and she had a lot of nipples, each one shooting out rays of rainbow. It was beautiful.</p><p>Tried to get myself into the wall, tried shoving my entire body into Potter's wall, and found myself frustrated that I couldnt become a wall. I just wanted to be one with the wall.</p><p>Potter became a goat, his face extending and contracting to form the mouth and face of a goat. He also became a grapefruit.  Chased a butterfly into the back of my brain. It was pretty, and I didn't want it to leave. </p><p>Saw faces, Some menacing, some kind. Had a bit of a freak out again, saw a wound that wouldnt close, wouldnt stop bleeding again. And the skeleton men. The faces of men where only half of their faces were there, and they were standing there, looking down at me, threatening me. </p><p>I opened my eyes, and it was Potter there, and I was okay. Half of his face disappeared. But not like divided in half, just chunks out of his cheeks and forehead, they were transparent, and there wasn't anything underneath.</p><p>Every cliched pattern from the 60's. And paisley. At one point I was plaid. I became a color that wasn't a color. And there was the dragon that wouldnt let me get off of the chair. I sat in the chair, and the dragon wouldnt let me move. She was looking at me, cocking her head, she had stripes, alternating, and at first I thought she was a sea horse, but she was a dragon.</p><p>Everything took on this neon outline, and when I looked at it, it was just swirling neon glowing edges different colors nothing solid, pretty. I couldn't stop talking the entire time, because I was thought, and I wanted not to be thought stuck in my head but I wanted to be oil thought throughout the room filling everything everywhere. My thought was purely outloud, and I was so completely wrapped up inside of myself mentally that it was hard to focus on anything outwardly, and my thoughts were racing.</p><p>I was seeing me when I looked at Potter, and then I was watching my eyes looking at things, and there were a thousand eyes all looking at me this giant sphere-pyramid-cube covered in bright blue eyes staring at me and I was looking at them, and we were watching each other watching each other and they knew and I knew. I saw myself from three different angles. The outside, the inside and the perspective of others. I was looking down at myself looking up. I was seeing myself in two different places and three different times. And I was free.</p><p>Didn't like looking in the mirror. I felt ugly and impure. Can't explain it any better then that. Potter became a grapefruit. I realized how egotistical I really am, and that really I am no better or worse then anyone else. I realized how much I really do love Potter, and how beautiful he was.</p>"
}
