{
 "title": "Temporary Parkinson's Disease",
 "author": "Skinny Puppy",
 "citation": "   Skinny Puppy. \"Temporary Parkinson's Disease: experience with Albuterol (ID 28074)\". Erowid.org. Jun 16, 2007. erowid.org/exp/28074",
 "substance": "Albuterol",
 "bodyweight": "144 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(daily)",
   " ",
   "  repeated",
   "inhaled",
   "Pharms - Albuterol",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28074",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 8807",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've used Datura (long time ago, not worth it), weed (of course), shrooms, dxm (before I knew about ketamine, hehehe) and many other things. </p><p>Last night was pretty crazy. I am not on any medication, but I rock the ganja every day. I'm shaking like a bastard now, but I think that will go away eventually. I found my brother's inhaler. </p><p>1:10-Took 7 puffs, held it in for a while. I was lying in my bed at the time. I started hearing a rhythm with a piano, and realized that the rhythm was my heartbeat. My heart was beating hard, making a rhythm in my body. I could feel the rhythm.</p><p>1:11-Up the dosage to 10 puffs. I feel the initial rush, and it is considerably stronger. Same basic thing, just a stronger head rush.</p><p>1:12-13 puffs in the bank. I tell myself that this is the last session, but it feels crazy good.</p><p>11:15-I didn't keep track of how many inhales I took this time. Must have been 25 or 30. I held it in for a good amount of time. This has become the strongest rush I have ever felt. My heart was beating out of my chest, giant purple and green rings were covering my walls, and I could hear, feel, see, and taste the rush flowing through my body. Tasted almost marshmallowy, very creamy.</p><p>I repeated this a few more times, but not with the same intensity, so I called it quits. My stomach was starting to hurt anyway. I noticed it made music sound very strange, made it sound like it was coming out of a shitty old boom box. It was kinda cool. I never experienced such a head rush. I was laughing just for the sake of hearing myself laugh. My voice sounded foreign. </p><p>Upsides: Short lived, intense, cheap and easy to get.</p><p>Downsides: Nausea, and this morning I woke up shaking like Ozzy. This is crazy. My body is in constant spastic motion, especially my hands. Hope I haven't done any permanent damage.</p><p>It is now noon, and I am shaking less. I bet this will go away.</p>"
}
