{
 "title": "Valerian insights",
 "author": "NorthernLite",
 "citation": "   NorthernLite. \"Valerian insights: experience with Valerian (ID 2810)\". Erowid.org. Nov 29, 2001. erowid.org/exp/2810",
 "substance": "Valerian",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Valerian",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2810",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 29, 2001",
   "Views: 40124",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have experienced periods of depression, and attempted self-medication with valerian. Earlier this year I ate about 3-5 pills/day for a week, and naturally became extremely tolerant. The effect I experienced with that dosage was a sensation of being completely stoned. I could move but I didn't want to, and my thoughts were racing. The sensation wasn't unpleasant, although the resulting apathy was. So, I stopped eating valerian for about four months. I felt no withdrawal symptoms.</p><p>A few days ago I again became extremely depressed, and sat up all night talking to friends on the phone and on the Internet in an attempt to relieve the depression. About 2.30AM I gave up and ate a single pill of a Swedish brand of valerian extract, in an attempt to at least fall asleep. I turned off the lights in my room and laid down on my bed. About 15 minutes after ingestion, the instantaneous or unnoticable transition into 'valerian-land' occured. I felt as stoned as I usually felt when I had eaten about three tablets! Five minutes later the stoned sensation gave way to a feeling of clarity, outside my soul. I could view all my concerns from an outside perspective, and I realised a lot of things. Exactly what I realised I can't remember, but when I came down (around 3.45AM) I felt much better. I could incorporate all this new knowledge into my soul, and it healed. I felt much better, and immediately fell asleep after thinking through my experience. I woke up five hours later, feeling relaxed and happy.</p><p>The only side effect I could notice was connected to the only realisation I can remember. One of the people I had talked to on the Internet was a girl I knew until she moved away a few years ago. I didn't think she cared about me, but I suddenly realised that she did. I really wanted to cry then, both out of joy and for my own idiocy, but I couldn't.</p><p>I believe that the extensive contact with my friends combined with the valerian caused this experience, since it was unlike anything I have felt before. I am not a regular user of any chemicals other than my allergy medication, and I had forgotten to take it that day, so no other drugs could have provided a boost for the valerian. It was a very strange and lovely experience, probably much depending on my set (I was depressed, but my friends had just told me very sweet things which I just ignored) and setting (dark familiar room, lying down on a soft bed, radio turned down low).</p>"
}
