{
 "title": "Monsoons, Lightning, and the Way",
 "author": "exuberantmantra",
 "citation": "Citation:   exuberantmantra. \"Monsoons, Lightning, and the Way: experience with Toad Venom (Bufo alvarius) (ID 28114)\". Erowid.org. May 19, 2006. erowid.org/exp/28114",
 "substance": "Toad Venom (Bufo alvarius)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Toad Venom"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28114",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 19, 2006",
   "Views: 27931",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was monsoon season in Tucson Az. I prepared my mind for clairvoyance. I treated the toads with the utmost respect, individually asking each for the proper spiritual permission to extract their precious defense mechanism. I ended up extracting the venom from primarily the two head glands of about 20 separate individuals. After partially drying the poison out (a required step to avoid growing mold/mildew/?) I separated what I had into many small 1mm3 chunks with a razor blade and allowed them to fully air dry. \r\nI returned to my porch and the awesome vista of the precious catalina mountain range. Some days passed, as I was waiting for the right time for my experience. It had rained all day long one day, something that we desert dwellers hold ever so dear, and by the late afternoon it began to calm down. With a slight sprinkle, not enough to see unless one pays special attention to the droplets on the ground, the sky began to open up and from above shot magnificent bolts of lightning. They fell sporadically, some atop the mountains, some as close as a mile. I knew this was the time.\r\nI was at no time in any hurry to do anything. I patiently retreived my 'aroma oil incense burner' (vaporizer/crackpipe), my jet lighter (highly recommended), and my bufo. I relaxed, observed the mountains, and deeply inhaled the refreshing creosote air (the creosote bush, zygophyllaceae, releases oils during the rains, giving the air an authentic and beautifully fragrant odour). I prepared the pipe and rested it in my lap, breifly reflecting upon what I was about to feel (I had smoked this before, but not at the dose I had intended this time).  I reflected upon my existence, strived for a sense of some bigger picture, and visualized the earth rotating around the sun, around the galaxy, and beyond. I pondered the sun's rays mutating into plants, into life, and as the lightning continued to strike the ground, I questioned the energy of the world and the goings on inside my body. This, I felt, had prepared me enough for what was about to occur. \r\nThe next step was to ignite the engines. As soon as I noticed the little brown square beginning to vaporize, I started to slowly inhale. Slowly (I didn't want to have the chunk fly up into your mouth). Once it was melted to the glass, I inhaled deeper and harder. I thought I had enough, and then I had some more. A lot. My goal was to finish of the nuglette (which I instead turned into black resin at the bottom of the glass). I stopped inhalation and set the pipe down on the granite table (watch out its hot and can melt plastic). The feeling came on immediately and was overwhelming. I looked beyond my porch at the ground which looked like it was boiling (from the sprinkling). Then the entire world started spinning. I grew slightly neaseous (lots of different sensations all over), and was overwhelmed with an uncomfortable feeling. I could no longer keep my eyes open because the light and exterior stimuli were too intense. I reminded myself that this feeling was temporary and that pain and discomfort are transitory. I seemed to sky rocket exponentially, and soon I was too far beyond my own body to feel anything. \r\nIt was at this time that I realized I was tripping HARD. The most intense trip I ever had. Until then i hadn't even realized what tripping was. I avoided panic by reminding myself that it wasnt going to last a long time, and that in this moment I exist, this moment is my life. Then it got about 10 times more intense.\r\n(probably 3 min into experience, though it felt MUCH longer)\r\nMy closed eyes were seeing bodies of ungulating emanating infintesimal fibres of existence (no other way to describe). I no longer had a body, I no longer lived on earth, I no longer existed in this dimension. I was completely aware of everything that was going on, I had no memory lapse or anything, and yet I was ungulating along with this fibrous liquid. I realized that all these rules we have for living, all these behaviors we exhibit are products of necessity, and that I had no rules, I just existed. My mind began turning itself inside out over the question, 'I exist'. I felt so distant and yet so unified. \r\nNow I realize that language plays a pivotal role in thought processes and memory. We can not grasp existence because we have no means to describe it, to analyze it, to dissect it. But in a state of mind such as this, analysis is futile, thought occurs, and people, things, exist.\r\nIt was this experience that gave me a completely radical new perspective. I had experienced psilocybe, LSD, mescaline, high levels of isomerized purified THC (unfortunately not acetate), etc. and none had left me with quite this intensity of feeling. Probably because the duration is too long with these substances, and what is gained is also lost in the 'coming down'.\r\nAfter what felt close to an hour of just merging with this existing intertwining all encompassing liquid (not to mention the colors, oh god the colors!) I began to step back into 'reality' (which has since then meant something completely different). I watched the mountains rolling in waves in the distant, I watch the lightning get closer and further, and I was at peace with wherever, whenever, whatever I was. \r\nTears come to my eyes recounting this amazing experience.\n\n\n"
}