{
 "title": "Amazonia's Revenge",
 "author": "Prometheus",
 "citation": "   Prometheus. \"Amazonia's Revenge: experience with H.B. Woodrose & Banisteriopsis caapi (ID 28154)\". Erowid.org. Feb 20, 2006. erowid.org/exp/28154",
 "substance": "H.B. Woodrose & Banisteriopsis caapi",
 "bodyweight": "86 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 g",
   "oral",
   "Banisteriopsis caapi",
   "(tea)",
   "  T+ 1:00",
   "15 seeds",
   "oral",
   "H.B. Woodrose",
   "(capsule)",
   "  T+ 0:00",
   "0.2 tsp",
   "oral",
   "Ginger",
   "(powder / crystals)",
   "  T+ 1:30",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "28154",
   "Male",
   " ",
   "Not Given",
   "Feb 20, 2006",
   "Views: 11315",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had some really pleasant and beautiful trips on woodrose seeds in the last few months (every time between 10-20 seeds, depending on the occasion). My experiences so far were also easy to handle (if I compare it to LSD or shrooms), so I decided in my holidays to try a LSA/MAOI combination to boost the trip and make it more 'interesting'...</p><p>I placed about 10g of dried Banisteria Caapi plant material in a pot, added some water (0,8 - 1,0 litre) and the juice of a grapefruit (I had no lemons left) to acidify the water. The mixture boiled for 45 min, until only 1/2 cup of liquid was left. After cooling for about 15 min and straining, I drank the stuff at 1:00pm...YUK! Definitely among my Top 10 of REALLY bad tasting drinks. </p><p>In the meantime I took 15 H.B. Woodrose seeds, scraped of the furry coating and ground them in a spice mill. The resulting powder was put in capsules, which I intended to take after the caapi effects had started (to be sure, that the caapi had any effects at all and to verify, that the extraction was somewhat successful).</p><p>Then I did some easy work in the garden and after 1/2 hour the caapi effects started with a mildly stoned, pleasant feeling, like smoking some weed. At 2:00pm this feeling got some more intense, I also saw some visual distortions, nothing special but interesting. With this light-headed and encouraging feeling I ingested the LSA-capsules together with 1/5 teaspoon of ginger-powder to avoid the nausea (it really works, at least for me).</p><p>At 2:30pm the trip started with the typical dizzyness/tiredness. So I smoked some weed while sitting in the sun in my garden (it was a beautiful, warm summer's day) and waited... 1 hour later I began to realize that I have heavily underestimated the power of the two plants, it already was very intense and my mind was pure chaos (and the trip was just about to start :-(</p><p>For calming down I played something relaxing on my guitar for a few minutes. This surprisingly turned the trip into another direction, I now felt VERY happy and the plants in the garden were of such beauty which I've never seen before. But this lasted not very long: I suddenly remembered that a few good friends of mine wanted to come for a visit this afternoon (playing cards, talking and stuff, nothing special). I didn't want my friends to know about my experiments, so I thought of calling and telling them that I feel very sick and I want to be alone today (instead of telling them the truth, that I have ruined this meeting by taking 'drugs'). This thought made me feel so ashamed of myself because I haven't seen some of them for a long time and we were all looking forward to this meeting. I decided that I would be able to manage the situation and try to make the best out of it (as mentioned, a bright sunny day, good friends, some weed: the perfect setting, I thought)...</p><p>My friends arrived and for no real reason but my twisted mind I felt some sort of terrible guiltiness accompanied by paranoia and fear. I tried to hide it and react as normal as I could. But on the other hand it wouldn't have been a problem to tell them the whole story and that I'm feeling very anxious. I simply wanted to keep the illusion alive that everything is alright and I'm enjoying the afternoon. The next 2 hours were pure horror! I felt attacked by everyone, I thought they would make fun out of me. The only wish I had was to come down and back to reality. I also felt like vomiting but this was the last thing I wanted my friends to wittness this day.  As the evening came and my friends had left, I felt much better again, and happy that the trip was nearly over.</p><p>I can't really decribe in detail what I felt and what the cause for my paranoia was, but I know, that there was no real reason. This experience was definitely a big warning! Never underestimate the power of this mythical plants and the unpredictable consequences of MAOI-interaction!</p><p>As you can see my much-to-heavy-trip ruined a wonderful day and made me panic and paranoid for absolutely no reason but the fear of my illusions. The caapi seemed to amplify the LSA-trip very much, too much for me. This day showed my clearly: those plants are no toys, especially not with this dosage and combination.</p>"
}
