{
 "title": "Perpetual Amnesia from Two Different Pills",
 "author": "Justin Case",
 "citation": "   Justin Case. \"Perpetual Amnesia from Two Different Pills: experience with MDMA, 5-HTP, & Vitamins (ID 28155)\". Erowid.org. Nov 5, 2003. erowid.org/exp/28155",
 "substance": "MDMA, 5-HTP, & Vitamins",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1999",
   "28155",
   "Male",
   " ",
   "Not Given",
   "Nov 5, 2003",
   "8361",
   " "
  ]
 ],
 "report": "<p>On two different occasions with 2 DIFFERENT types of Ecstacy pills (or pills that were claimed to be ecstacy) I experienced extreme loss of short term memory. For both occasions I pre-loaded with Vitamins B-12 and C, niacin, niacinamide, magnesium and 5-HTP. On both occasions, I felt ecstatic for a while then experienced total confusion due to a lack of memory. On both occasions the person with me tried the same pills (although they did not pre-load) and had no memory-loss. </p><p>I was with a different person each time and both report the same thing. That I had completely forgotten what was going on and kept asking them what was happening. They would explain to me that I had taken ecstasy and was forgetting everything. As soon as they told me I had already forgotten and was asking them again. Apparently I drove both of these people crazy for hours with this. </p><p>After the first occasion I woke up the next morning and after a short while realized that I had done E but could not remember what had happened. A phone call to the friend that was with me cleared it all up for me.</p><p>After the second occasion, I woke up at my friends place without any memory of where I was, who's place it was, who I was, how I got there, etc. The friend was so mad at me for what I put her through that she kicked me out of her place. I spent hours driving around lost in Brooklyn Queens. Finally I found a highway and 8 hours later I found my home.</p><p>I could not remember where I worked at first, and after I remembered, I knew I could not remember how to perform my job (it relied heavily on rapid memory recall). So I never went back to it. </p><p>In the following weeks I experienced severe depression and many panic attacks. Many times a day, I would get that feeling one gets when you are very close to remembering something (like a dream) but when I was about to remember it I would get a panic attack and forget it all.</p><p>The next 2 months were a struggle against my own fear and depression and lack of memory. I found a new job and slowly got myself back together, although it seems I have suffered a permanently lessened short-term memory recall. Making it through all that completely on my own was the hardest thing I have ever had to live through.  </p><p>I have never conclusively figured out what's wrong. For the sake of science, I offer this report, for what it's worth. Be safe, be informed.</p>"
}
