{
 "title": "Barter Faire!",
 "author": "Neon Green Snake",
 "citation": "   Neon Green Snake. \"Barter Faire!: experience with Mushrooms - P. cubensis (ID 28202)\". Erowid.org. Jan 13, 2008. erowid.org/exp/28202",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.25 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 3:00",
   "  ",
   "smoked",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 3:00",
   "8.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28202",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 13, 2008",
   "Views: 5005",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 14 grams of dried Psilocybin cubensis mushrooms is considered an extremely high dose, see Mushroom Dose Chart]</p><p>Barter fair is a newly found annual party I go to. Its out in Tonasket, E WA (Okanogan). 1000's of people get together on this vast piece of property and set up vending booths to sell their product out of. 1000's more people come and camp out for the weekend on the other half of the property and everybody partys and makes money all weekend. It feels as if everybody is best friends with everybody and everybody has known everybody for years and everything is expressed openly and freely and authority doesn't interfere whatsoever. The unity of everybody's spirit, the friendships established every year, the energy, it's so intense.  And the partying can be related to a psychedelic experience all in it's own without the psychedelics.</p><p>Drum circles take place at night where everybody, from the old hippies to the teenage deadheads get together around a huge bonfire and half play drums creating the best synergy of drums possible, and the other half dance around the fire, letting everything primitive out from under their skin. Sometimes a few people will jump in and sing a little bit. The music always achieved from the drums turns out to be primitve/native style with a wardrum attitude and they go on alllll night, until the crack of dawn. Well, the majority of my trip takes place in one of those drum circles and it was by far the most amazing night of my life. I must say, I was not expecting the potential for that much enjoyment to be present. So I could have enhanced the night alot more than it was, for sure. I will perféct the experience over the years. Well, setting in mind, night's are 35 degrees F and days are sunny and warm and horribly windy. here goes...</p><p>Night had come and the roads (actually footpaths about 20 feet wide completely structured with straw) were packed full of wandering adults, lost deadheads, drug dealers, hippies walking down the rows swinging basketfuls of every ganja treat you've ever heard of, screaming, 'ganja brownies! 3 for 10!' While the ganja was openly expressed in yells and screams and signs and advertising and samples, the mushrooms were a little different. Id be was along and a random individual out of the crowd kinda leaned my way as he's walking by and whispered, 'mushies...' and then he kept walking.</p><p>'Yea, wait!' the guy turns around and comes back. 'Need some mushies?' I smile and say 'Yea, how much for a 1/4?' '40' 'give me a 1/2' he busts out 4-3.5gm bags of cubensis and makes the exchange. 'So did you pick them? Or are you a gofer?' 'I just got them for a good deal like an hour ago.' I decide to smoke this life saver a bowl of some tasty greenage. Well, the rest is irrelevant, I buy, we smoke, he leaves. I eat 1 1/2 eighths. </p><p>Walking around checking out the scenery and the wide variety of fashion statements floating around, just starting to feel the beginning effects of the shrooms, I take a deep breathe and immediately feel the ineffable energy expelled by everybody present. This is a place where people gather and express themselves in any way they deem worth it, not even worrying about impressing or embarrassment. It was like the assembly of this psychedelic camping trip temporarily erases the past, even the immediate past, and erases any worry or thought of the future. Now is the only thing that's real.</p><p>45 minutes go by and I start to trip pleasantly. Despite the dark, I could see as good as a bat in the darkest corners of the property. Every detail and decoration was magnified and vivid. A man/woman walks by, steals a glance, and it was like I knew exactly what that person was thinking. I saw good souls and a few bad souls wander by all night. The expression on my face took on a jovial air like that on LSD and my inner glow that comes out only through psychedelics, starts growing in my tummy, causing me to grin against will. The drum circles were growing rapidly and the party sounded intense, so I decided to halt my trip around the area and join a circle.</p><p>I silently walk into the main one and find a place where I can see the dancers, about 3 rows of people from the core. I glanced around now and then noticing a few people here and there glancing at me, but with my internal clock slowed down so much, it felt like they were staring at me, which made me feel like they knew I was on shrooms, which made me smile and nod and keep dancing because everything was freely expressed here and the paranoia factor was completely inexistent because of that fact. Everyone knows Im on mushrooms! Yee-haw!</p><p>I watched the dancers and the way they moved their bodies fascinated the hell out of me! These dancers were obviously ones who have been doing this celebration for years because they had the vibe, and the way they connected their dance with the fire and the crowd perfected. They were experts, knew exactly what the observer wanted to see. All were volunteers. Even I danced later on in the night. Anyways, I was dancing, and tripping on the dancers and drummers, thinking, 'Wow, the drum beat assembly is like Barter Faire's heartbeat.'</p><p>Eventually I wandered off and visited my neighbors for a second. 'Go to the northeast part of the property and there's another drum circle. Its better, more precise beat and more dancers. Its like the audience is more dedicated to enhancing the music than screaming and enjoying themselves beligerently.' That's what my neighbor said, I had no idea there was a 2nd drum circle! Not to mention better! I shook his hand. 'Thanks, Ill go check it out, Im looking at an all nighter! Peace brother.' and I took off.</p><p>I stopped at the main drum circle and danced and watched the pattern change and watched people just let out the most intense energy through the windows of psychedelics. I saw people with their eyes closed and their mouths half open shaking their heads horizontally, seizure style, and creating the most amazing drum beat. It was just weird. but my curiosity got the best of me, so I went in search of the 'better one.' It's about a block away, I walked there the next day sober, but I swear to god it took me at least half an hour to get there, in a straight line with a straight pace. The dark looked darker than ever and at the same time, my vision was perfected. Peripheral imaginary movement consumed everything as I strolled on. I felt smart, whole, like I was on my way to an important ritual on behalf of my family tribe. Though I don't have a family tribe. hehe. </p><p>Anyways, I got there, and immediately noticed a difference. There was about the same amount of people, maybe a little more. The drumline was far better and less scattered making for more dense rifts, powerfully tugging at my euphoria, making me tingle and shiver with warmth. Here I saw 8 naked hippie chicks in there early 20's, doing the most amazing dances, Egyptian style it seemed with an erotic texture. I had this premonition that I would be here for the remainder of the night. People weren't coming and going in a frenzy-like motion, freaking out trying to sell their drugs and going in every direction like down in the main part. Everybody was settled in, and the cool part is that it was easy to find a place suitable for me because the rows were in order from the smallest and the ones sitting and lying down to the tallest ones standing up and dancing mildly.</p><p>I found my way to the front and sat down, making myself comfortable. I was in the most incredible state of mind and it was getting better! Everybody here are my friends and everybody knows everything about everybody here and the druming and dancing express that unity to such extent, it was driving me crazy. With my eyes bulging out of my head in excitement, I started swaying back and forth, moving with the drums, enjoying the hell out of the occasional dancer finally coming around at my side of circle and doing the sexiest dance in the world, looking at me with hunger and eagerness, giving me a full fledged boner! That intense gaze gave me this mystical, unexplainable feeling, and that feeling eventually turned physical and vibrated straight from the bones out to the open air, contributing to the energy that was already airborne.</p><p>A guy was sitting next to me playing the drum really good. He had some cool braids in his hair and was wearing overalls and tye-dye. I loaded a small chunk of a cap in my pipe and passed it to him. He frowned and I used hand gestures pointing at my bag of shrooms that it was a cap, he nodded his head toked it up and I told him to pass it along. I loaded about a gram of stem after that and proceeded to eat the rest of my half ounce! Now, even though the whole night was just amazing, I really wished I would have stuck with no more than a 1/4 because my brain got a little too scrambled later on.</p><p>The guy let me use his drum while he went to take care of something and I felt like I was a little kid receiving the most precious Christmas present in the history of man. I smiled with intensity and said, 'Hell yea!' I got into the assembly of drums. He sat around for like 10 minutes and nodded with impressment at how good I was, but Im telling you now, I am pretty good, but still a beginner when Im sober, but when Im on mushrooms, I am literally compared to the best there. I don't know how it worked, but my creativity was just so enhanced. I had a blast, changing my drum rift every 5 minutes or so. By now, I had been about 3 hours away from initial dose.</p><p>After switching back and forth for a while with my new friend whom I could barely hear because of the roaring of the drums, he looked at me and said, 'Sing for us.' Now that tripped me out for personal reasons. It made me feel like he could read my very being like an open book. Because I am a writer of poetry naturally and I have been constructing my own singing voice without the help of a tutor and music and singing and writing the essence of music is the most important aspect of my daily living. And the thing is, I am a really good singer, everybody agrees I can mimic Maynard from Tool's voice really good depending on what tone of voice he's using and I can scream just like SOAD. Most of all though, people like my voice because it has a harmoniously unique quality to it. </p><p>Anyways, I smiled after he requested for me to sing and I agreed silently but I thought of what I should spew out that would sound nice in the midst of the drum storm and I got stumped. 'Im stumped!' I told him. 'Itll come...' as if he could directly read the immediate future. Of course, it was just the mushrooms contributing to that curiously peculiar paranoid feeling of fellow clairvoyance. Or was it? Anyways, I was stumped so I got back into the drums.</p><p>About 5 minutes later I busted out with a mildly scratchy tone at the top of my lungs, but not fully a scream because it was smooth enough not to mistake the words for something else, 'THIS! IS! NECESSARY! THIS! IS! NECESSARY! LIFE! FEEDS ON LIFE! FEEDS ON LIFE! FEEDS ON LIIIIIIFE!' and I heard people gasp with surprise and impressment and the faces brightened with enjoyment and amusement and I heard a few people go 'Yea! Right on!' and 'That guy sounds good!' and at the same time, the drum rift assembly got upbeat and the dancing became more enthusiastic.</p><p>I felt so good, I was totally peaked on the first dose and I was about an hour into the 2nd dose and I was having the time of my life, I would have cried but I was too focused on keeping the drum rift perfect. Then the trip got really intense and I felt bored with the drum so I gave it back to the guy and decided to stand up. I had been sitting there for a while anyways, I needed to stretch a little. So I started to stand up and it was a strange fucking experience just simply standing up from the sitting position. I felt like I had to be extremely careful so I got up really slow and I felt like I was growing out of the ground slowly, or more like I was hatching out of an egg, experiencing motor skills for the first time. It was almost like being physically reborn, reborn into this miraculously heavenly void.</p><p>I finally made my way to a full standing position. I looked around at everybody, and it was so clear, they were all hooked! Hypnotized! I read everybodies aura and they were all completely entranced by the drum circle. Everybody at this particular circle were the best of souls. Alot of them were regulars, who had been coming for years, I could tell. So many happy faces, such an infinite plane of mental states, such a large group of fryheads just living it up. I was weightless! I moved my arms and head and legs, stretching them out, effortlessly. I literally felt like merely a part of my vision, a part of the air, a part of imagination, weighing nothing.</p><p>I began to dance. I came up with the most individually unique dance there. I made my head into a graphic equilizer for the drums, shaking it crazily in all directions at phenominal speeds, paying for it in neck cramps/pains for 3 days afterwards. I was spinning and rotating my arms in this undescribale way. It was kind of an equilizer for the way I was feeling inside with the drums judging how fast they went, or something like that, nevermind, it's useless. But I danced, and I danced, and I got the most peculiar looks from everybody, because just looking at the way I was dancing, they all knew I was way out there and I knew they all knew but it didn't bother me because it didn't bother them. I danced for like an hour, singing tool lyrics in an Indian style way that sounded so synergistic with everything else going on.</p><p>Then I peaked on my 2nd dose, the one I should have saved. I stopped singing and dancing at some point and I looked around. My mind was beyond the definition of insane. Everything was one and I felt like I had traveled back in time physically to a shaman ritual or something. I suddenly felt the need to isolate from the circle for a while. I waved goodbye to the few people I had established friendly bonds with since arrival to the new circle, then I left. My mind was so fucking fried I couldn't tell what direction was what, which way to go to get to the main area, let alone my camper. There was this fog all around making me blind but I was hallucinating it, it wasnt white, it was the same color as a shadow with a kinda static texture to it and it was silently vibrating and twitching.</p><p>The fog went away about 10 minutes later and I decided to just walk with no destination in mind, hoping to find something to apply my deep psychedelic complex mind to beneficially. My brain became exruciatingly scrambled, I basically had a mystical experience, the memory not accessible now as a sober man. I felt I was removed from this reality like a game piece is removed from the box and I was just existing in this synapse between alternate realities that seemed like an eternal state, maybe it's death, maybe I glimpsed the vaults of death.</p><p>Then some parts I do remember were coming out the memory hole, and my body was just shaking and vibrating internally, my temperature was rapidly changing, and in my head, I felt like I was prying open a memory of a past life, or maybe even another mind. It wasn't something that became part of me, it was fading and emerging, fading and emerging. </p><p>Then I went crazy. I quickened my pace because something inside of me convinced me that I had just raped someone, or maybe simply just sexually insulted someone, or even killed someone, and if I get seen by the wrong people, Im fucked. I was convinced that I just didn't remember doing it. I stumbled along, tripping out on this new paranoid delusion, then I got horribly, excruciatingly depressed and sat down in this clearing and put my face in my hands started crying, and repeating over and over again, 'I didn't do anything wrong, it's just the shrooms, I believe in god and god knows I didnt mean whatever I did. I didn't do anything, Ill comedown and Ill laugh at myself, I didnt do anything.'</p><p>After sitting there for an amount of time impossible to decipher, I got up, and decided to just keep moving, convinced that whatever happens is going to happen and I can't change it now, so I walked and I walked and I walked. Today, I wish I wouldn't have eaten so many because then I would have been able to stay at the circle and indulge the serenity and recreational unity. Instead I wasted my time tripping out on a delusion. I walked, then I walked some more. I wanted to go home but my sense of direction was fucked. Everything was a completely different color than it was earlier in the day. The whole faire was simply a completely different place altogether, so it was the same as trying to find my trailer when their really wasn't a trailer to find. Thats how hopeless I was.</p><p>So eventually, I started to freeze bad, so I walked until I came to this tent that had a light on inside and I walked up to it and said, 'Hello? Can I come in and get warm? Im lost and cold.' It was a lady in her mid 30s, she unzipped the door and came out, obviously wanting to know what kind of person I was before she trusted me. 'Probably not, I don't feel comfortable doing that.' she said. She came out, and organized some things in her booth and asked me a few questions, studying my aura and then finally said, 'Yea, come on in, I got the propane heater going in there and tons of blankets, you have a place here brother.' I ducked inside and felt like I had just met my first human.</p><p>I was back in my excited phase, but still convinced that maybe I did something weird. I was obviously starting to come down, but I wasn't going to remember what sober was until morning still. I almost became erect, it felt so good to lye down on a comfortable, inflatable mattress with 20 blankets on it and a propane heater next to it and smoking some of the best pot. She had some very tasty goods. We talked and I tripped her out because I was so high. She comforted me and made me feel welcome and I felt so loved I secretly expelled a few tears when she wasn't looking.</p><p>I eventually fell asleep beneath like 7 blankets and I slept more comfortably than I had ever slept, had the weirdest dreams and didn't know where I was for like 5 minutes after waking up. I was so confused, and my head felt empty and depleted. I thanked the generous lady, she was outside, and I went home to freshen up for another day. That is my story, and I hope it wasn't too long for y'all...looking back, the whole experience has to be considered, not just bits and pieces. I can't criticize and regret, it's just not right. I either enjoyed it or not. The experience was supposed to turn out that way for it's own beneficial reasons and Im sure Ive learned a few things from it.</p>"
}
