{
 "title": "Walking with Regret",
 "author": "Trevor",
 "citation": "   Trevor. \"Walking with Regret: experience with Opioids (ID 28200)\". Erowid.org. Jun 9, 2006. erowid.org/exp/28200",
 "substance": "Opioids",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Opioids"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 28200",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 9, 2006",
   "Views: 7856",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ever since I began using drugs, I have had a certain facination with prescription opiates/opioids. </p><p>When I was 14, I knew little of drugs or drug abuse. I enjoyed the simpler things of life, like snowboarding. However, I wasnt very good; I smashed my wrist in an accident. After they gave me a substantial amount of morphine via IV, they put me under and set my wrist. After I woke up they wheeled me out to my van and my dad drove home. I pretty much slept straight for a few days, but when I was awake my mom would give me a little round pill with a 3 on the back. </p><p>When I finally felt like walking I went and inspected the bottle that mom was getting the meds from. It read 'Tylenol III w/codeine'. Of course, I  didn't know what that meant. I put the bottle back in the cabinet and went back to recovering.</p><p>Several weeks later I was feeling much better. I had forgotten about the pills in my cabinet since I wasn't having very much pain. One day, however, my arm was throbbing for some reason. I went to my medicine cabinet to get some Advil when I noticed the slender orange bottle. I reached over and twisted off the cap. After inspecting the label, I decided I would take 3. Each pill contained 30mg Codeine. I felt a little apprehensive about taking so many since my mom had only given me 1 each time, and since I had never abused drugs before I wasn't sure what codeine would do to me. </p><p>After about 20 minutes the pain went away and my body began to feel a little lighter then normal. I didn't really pay attention to the effects; I was mostly waiting to have a seizure or something like that. After a few hours the lightness went away and the pain returned, so I figured that the codeine was safe to take in larger quantities then prescribed. I put the bottle away and decided I would save the pills for when I was completely healed so I could experiment without a broken bone.</p><p>A month went by and my arm healed completely. I had about 20 pills left. I was still apprehensive about taking them for fun, since I really knew nothing about them. I remembered my first experience with taking three, and thought 'what the hell?' I popped three of them. I remember it was in the afternoon, on a summer day. I went to watch some TV and wait for some effects. </p><p>20 minutes, nothing. 1 hour-- nothing. 3 hours, still nothing. I was a little upset. I followed the same pattern for about a month until the pills were gone. The only thing I really noticed was mental relaxation, but nothing too extreme. I just dismissed the whole thing, and forgot about the pills for about a year.</p><p>By my 16th birthday I considered myself a seasoned marijuana smoker. My marijuana experiences were quickly reaching the hundreds. I was educating myself on the finer points of drug abuse. I quickly became acquainted with the word 'opiates'. It didn't take long to figure out that those pills from my accident were, in fact, opiates. It also didn't </p><p>take long to figure out that they had abuse potential. I kicked myself for letting them go to waste. I wasn't going to ever let it happen again, though. I learned all I could about these nifty things. I read about oxycodone, codeine, hydrocodone and hydromorphone. They all seemed rather joyous; a special kind of recreation I had only tasted with the codeine tablets. I grew more and more interested with these prescription drugs.</p><p>In the spring my dad had back surgery, and when he came home he brought back a whole bottle of Dilaudid; that is, hydromorphone. But to my dismay he hid the pills and I could only come across one tablet, which did nothing but made me itch a little. I was very upset, considering I was eager to experiment with that exact type of drug. I guess I couldn't blame him for hiding them, though; I was probably a little too eager and would of ended up hurting myself with an OD. Of course, the whole incident just aggravated my curiosity more. Finally I was able to find someone who was selling Lortab tablets for 7$ a </p><p>pop. I ended up buying 8 of them. I took them, 3 at a time, over the course of 3 days. I felt nothing whatsoever. I was beginning to lose my faith in opiates.</p><p>When school started my grandpa got cancer and we all flew down to FL to visit him. On his kitchen counter there sat a platoon of prescription drugs. The first night we were there, I snuck out to investigate. There was a bottle of Valium (10mg), a bottle of Oxycodone (5mg generic), a bottle of Oxydose and a few other interesting drugs. </p><p>I pocketed some of the oxycodone and the valium. I decided to wait until tomorrow to pop the pills. I also anticipated on dropping some liquid oxycodone into a beverage of some sort. I really didn't care if it was insensitive to steal my grandpa's pills. I was just eager to satisfy my curiosity.</p><p>Over the course of 2 weeks I took a lot of oxycodone. I could defiantly feel the drug. It was a very nice feeling, although I made the huge mistake of pairing all of my doses with 20 mg of valium, which knocked me out everytime I started to peak. I was pretty much unconscious on and off for a full two weeks. Everyone just blamed it on my grandpa being sick. After it was all over I decided that I had taken way too much valium and that opiates were a lot of fun alone. I wasn't sure when I would be able to play with them again but I was looking forward to it.</p><p>After developing a nasty amphetamine habit and trouble with the law, I was feeling that drugs weren't such a good idea. However, it happened one day that my friend was ready to throw out a bottle of hydrocodone/guaifenesin. It was prescribed for coughing. I told her that I would rather take it myself then have her throw it away. There was only a little left in the bottle, so I chugged it on the spot and gave her the bottle back. After about 15 minutes I felt something I had never felt before. It was very dreamy and relaxing. I tried to compare it to oxycodone, but remembering oxycodone just made me think of the strong intensity and dizziness. This was different. This was an opiate high. After about 3 hours I felt extremely nauseous and threw up about 3 times. I blame it on the other drug in the mixture, of course; not on the hydrocodone. </p><p>After I was done vomiting I concluded that hydrocodone, in the proper form, was a lot of fun. Then, I thought, maybe I had been taking the meds incorrectly. Maybe there was an extracting method or something like that. I researched online and found how to extract opiates from prescription drugs.</p><p>After obtaining some tablets, I tried the extraction with a friend of mine. I noticed a dramatic difference in the intensity of the high. It was much more relaxing and noticeable. I tried the extraction with hydrocodone, oxycodone and codeine and found that, even with small doses, the extraction yielded a very potent blend of water and opiate. I could now also filter out the aspirin and caffeine that the pills contained.</p><p>I am beginning to get a grip on my silly drug habits. I believe that opiates will be hardest to give up. They have really given me a ride, both up and down. I would still have to thank them, however, for all the good times. And forget the bad.</p>"
}
