{
 "title": "UTTERLY Contrary to My Expectations!",
 "author": "I aRe",
 "citation": "   I aRe. \"UTTERLY Contrary to My Expectations!: experience with Amphetamines & Mushrooms - P. semilanceata (ID 28212)\". Erowid.org. May 20, 2005. erowid.org/exp/28212",
 "substance": "Amphetamines & Mushrooms - P. semilanceata",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " ",
   "30 ",
   "oral",
   "Mushrooms - P. semilanceata",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28212",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 20, 2005",
   "Views: 30401",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This all started because I was into taking LSD at the time, but often had too hard a time of it in the situations I got myself into (too busy, too social)  the mind-fuck (MF) would be too much for me, although my friends had no such trouble.</p><p>I found that if I took ¼ - ½ a g of amphetamine sulphate powder (insufflated usually, but orally also worked) before or at the same time I dropped the blotter, the LSD would have a much reduced visuals (not really what I was after, but what the heck) and MF effect, while maintaining the body-high and physical/mental/emotional/creative energy (the visuals would come on nicely, but much later and usually after a few bowls). The speed seemed to help keep my head clear, unless I did too much/it was too good, in which case the LSD would have zero noticeable effect until the speed started to wear off (~4 hours or so!), but I would still not experience what would be quite a traumatic psychic experience normally, the MF. </p><p>After experimenting with mushrooms for a while, I decided to try a mushroom/speed combination, for much the same reason  I figured the effects would be somewhat similar. I could not have been more wrong..</p><p>We (collection of psychonaut miscreant youths) were at a friend's flat one evening, and with me I had several gel caps, into which Id packed a speed and shrooms blend. I distributed these amongst the willing, to the tune of  ½ g speed + 30 Ps. Semilanceata shrooms each. We ingested, and as soon as we started to feel a buzz, we set off walking to the local woods, our favourite haunt for such occasions.</p><p>We were there within a half hour, and we were pretty damned gone by then, but the mood was a good one. Soon we were in the thick of the woods, and by this point, I could not tell, nor did I care, what state anyone else was in  I was in a mad psychic trauma. The visual distortions to the world around me were beyond the pale  everything was exploding with masses of colour, multiple jelly-image outlines around everyone and everything. It was fairly dark, but I was squinting against the brightness of what I was seeing  people would walk around a corner in front of me, yet I could still see them, they were throwing off bright, richly multi-coloured skins that were left hanging there in the ethers, leaving behind a human shaped weaving tube of colourful brilliance. Not a bit like traces or anything similar, rather more real, substantial, and un-diminishing. Where one person walked through these, they would leave their own layered atop the previous one(s). I could walk through them, turn, and still see them there behind me with my own added to the crazy mix. As I was walking at the back of a group of around 9, I could hardly see a damned thing of the trees or trail around me anymore.</p><p>The physical sensations in my body were overwhelming, rush after rush, cutting zinging tingles of razor sharp nervous sensation, thrummings through the bones  more than I can describe. I could not process thought and such in the least  people would speak to me, I could hear every word, knew the words' meanings, but could not formulate even the pre-cursors to an answer. If brain cells are moving parts, then mine were glued-fast together. The only thing I could process at all, was an extremely nervous, very tense and intense, anxiety. I was frozen, closed, locked in and locked up. My head was burning beneath the skull with the overloading pressure of it all. If there was anything more to this experience, anything deeper, any opening doors, connections to the universe etc. then I was far too distraught to notice it.</p><p>My memory now of some of this is a little vague, but I believe I just started to come down some 5 hours after ingestion with the peak at about +2.5 hours, however, I was still having crazy visuals and psychic problems at +10 hours or so.</p><p>The others who had taken the caps were similarly effected as far as sensation and vision are concerned, although they generally suffered little trauma, with one exception; One of the guys with us disappeared at one point, and when we backtracked (a half hour of backtracking = he was missing for an ~hour - I was completely oblivious at this time and apparently acted totally passively to the groups activities) we found him up a tree, clinging desperately to a low bough. He would not comedown and just screamed I cant fucking take this shit! Man, what?!?!? Oh fuck fuck fuck fuck!!!!!!!  (paraphrased) and such like, over and over. I dont know how, but they got him down eventually, and coddled him back to some semblance of sanity. Maybe if I could have reached out, verbalised my experience a little, they may have been able to fix me some too  they just thought Id completely spaced-out and left me alone.</p><p>I have taken this mixture since, albeit much lower doses, and had no real trouble at all. One time (the best? Could well be!), I insufflated ~¼ g speed before eating a mere 8 dried Ps. Semi, and had a most wonderful night -I danced like I was possessed by the spirit of music and dance itself, I felt the ethers contained all motions, and I was just clicking into them, it was like tai-chi/kung-fu or somesuch, and I was completely in-tune with the energies and the people I was dancing with. My sense of balance and motion were incredible, as were the feelings of love for life itself. I was utterly ecstatic for ~4 hours. :-)</p><p>I see this as a potentially useful combination, but Id stress to anyone considering trying it, beware the dose! Unless that is, you like to hurt yourself psycho-emotionally. </p><p>I wonder about the psychopharmacology of this mixture.</p><p>Take care, and happy, safe exploring (inploring?!?) to all! :-)</p><p>I aRe - 'There _is_ more than *this*!'</p>"
}
