{
 "title": "Definitely a Unique Substance",
 "author": "entheogen",
 "citation": "Citation:   entheogen. \"Definitely a Unique Substance: experience with IAP & Cannabis (ID 28232)\". Erowid.org. Dec 15, 2003. erowid.org/exp/28232",
 "substance": "IAP & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "45 mg",
   "oral",
   "IAP",
   "(capsule)",
   "  T+ 0:05",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:45",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 5:45",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28232",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2003",
   "Views: 29454",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDose: 45 mg oral gelcap 4:15pm  (ate spaghetti at 1:15pm)\r\n4:30 feel stuff happening in stomach, tingle in extremities.  No nausea though --note: use of mda 60 hours ago, & cannabis @ 4:20--\r\n4:37 music has extra beauty\r\n4:40 tingle is in head and posture is reminiscent of mdma/mda\r\n4:50 hr is up, am I tripping? Some visual activity\r\n5:05 getting harder to write the paper I have been writing since the beginning of this session. Thoughts stray a bit\r\n5:24 went to get mail. No eye dilation as of yet.  Lights starburst, trails, things look shinier than usual, energy up.  Still very much in a come up stage (it would seem). Comfortable +1.5\r\n5:30 body temp up. Very in the zone, amped.\r\n5:43 go to class\r\n6:00 +2 hr still up. Focused. I might be tripping\r\n7:00 feeling generally good and some tinglyness\r\n8:30 class is getting to me\r\n9:00 smoke +3. Im very talkative and wired, cannabis added alot to this experience.\r\n10:00 smoke.  Low level visuals, tracers and stuff. Energy persists.  Very good with cannabis.\r\n1:00am the substance is wearing off, Im still at a +2. Im not really noticing oevs but there are some cevs that should put me to sleep.  Sleep shouldnt be difficult.\r\nCommentary:\r\nI woke up the next day feeling alert (Im usually not) and I was still at a +1 until I had eaten lunch\r\nI would describe this chemical as if you were to cross mda w foxy.  Good energy rush, good social vibe.  HR definately went up, body temp too.  Mixed great w cannabis.  Would be great for party situations.  The trip does not get overwhelming and I felt no nausea.  Watch out for the amphetamine in here, lots of energy.\r\nMy dose was good for oral but I have found that low doses smoked are very effective (like 5 mg).  I would expect the nasal route to be quite effective but would not recommend starting with too high a dose because of the potency observed when smoked.\r\nThis is not mdma, it's kind of like mda but definately a unique substance.\n\n\n"
}