{
 "title": "My Room is Laughing at Me",
 "author": "Bulldog",
 "citation": "   Bulldog. \"My Room is Laughing at Me: experience with 2C-I (ID 28243)\". Erowid.org. Nov 8, 2003. erowid.org/exp/28243",
 "substance": "2C-I",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28243",
   "Male",
   " ",
   "Not Given",
   "Nov 8, 2003",
   "Views: 7573",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>What follows is my description of one of the best psychedelic experiences I have ever had.  It was my first time using 2C-I.  First, a little bit about my previous experiences.  I have dabbled in Weed, Vicodin, DXM, and Dexedrine before, but never had any experiences with *true* hallucinogens such as shrooms or acid.</p><p>Setting:  My room on a college campus.  I had just finished up my on campus job and was heading back to my room.  I checked my mail earlier in the day to find the 100mg package of 2C-I I had ordered off the internet a few days earlier.  I was eager to try it, so on my way back to my room, I stopped in the chemistry department, bought a bottle of OJ, and snuck into one of the labs to measure out a dose.</p><p>Preparation:  I had read that the best experiences are on doses between 15-25 mg, so I decided to be on the safe side and try 15.  At around 6:30 pm, I measured out the correct amount of powder, dumped it into the orange juice, and shook it up, then drank it.  I had eaten about 5 hours earlier, so my stomach was relatively empty.  I then headed back to my room to see what would happen.  I was feeling quite happy and was eagerly anticipating the experience.</p><p>T+1:00 - First signs that the chemical is working.  I feel slightly dissociated from my body, similar to DXM, but I can still think, walk, and talk normally.  Notice a slight mood elevation and increased energy, as well as a warmness spreading throughout me.</p><p>T+1:30 - Go to dinner with some friends.  I notice that I have a lot of energy, feeling a great buzz right now.  I notice that at dinner I have quite a few witty remarks and find things a lot funnier.  All in all it makes for a very pleasant time.</p><p>T+2:15 - Get back to my room.  My roommate is there, unaware that I am under the influence.  Begin watching Seinfeld.  The show seems so much funnier.  Notice that colors are becoming brighter.  I walk outside to look at the night.  I notice quite a few tracers from passing cars.  Stare up at the stars...they are all shimmering.  Hard to tell if some are moving or if they are passing airplanes.  I am noticing an increase in body temperature.  Go back to my room and turn on the fan.</p><p>T+2:45 - Mild visuals start.  I can see the most beautiful patterns on my wall.  No way to describe it except to say that it reminds me of one of those 3D pictures where if you stare at it long enough, images pop out at you.  I see a bunch of forest gnomes and wizards.  Simply breathtaking.  I crawl into my bed and put on some headphones.</p><p>T+3:00 - Put on Shpongle, 'Tales of the Inexpressible.'  An amazing CD to trip to.  I stare up at my ceiling (it is one of those white drop panel ceilings) and notice that I can make the lines between the panels appear and disappear at will.  The ceiling begins changing all different colors as it pulsates.  Beautiful.  My walls are changing colors and breathing too.  My current thought is that I am playing games with my ceiling while the walls laugh at me.  I feel an incredible sense of joy and comfort.  My room loves me.  It cares about me and wants me to be happy.  I tried closing my eyes to see if I could get any good CEV's like a DXM trip, but I found it is much more fun to keep my eyes open and unfocused.</p><p>T+4:00 - Visuals are starting to subside and exhaustion begins kicking in.  I begin thinking of my girlfriend and what will happen after I graduate in May and go overseas for military duty.  I get the feeling that although we may not be together, everything will still be alright in the end.  A very wonderful feeling, like the weight of the world has been removed from my head.  I close my eyes and drift off to sleep</p><p>The next morning I awoke feeling slightly tired, but not much more so than usual.  All in all it was an incredible experience.  2C-I is a wonderful compound and I would definitely do it again.</p>"
}
