{
 "title": "Alien God and Mushroom Prophecies 2",
 "author": "TrYPtaMinE",
 "citation": "   TrYPtaMinE. \"Alien God and Mushroom Prophecies 2: experience with Mushrooms - P. cubensis (ID 28281)\". Erowid.org. Dec 17, 2004. erowid.org/exp/28281",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28281",
   "Male",
   " ",
   "Not Given",
   "Dec 17, 2004",
   "Views: 10081",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It had been about 3 days since my 5-gram experience.  It was such an astonishing event in my life that I couldnt wait longer than 3 days to do more.  The experience was all that I could think or talk about for the 3 days.  This time I took an extra gram. :O  I took my vitamins and ate my salad this time as well.</p><p>I ate exactly 6 dried grams at about 8:30 or 9 PM.  I ate a generous bite of banana nut bread, chewed it and put as many shrooms in my mouth as I could, until I tasted shrooms, just like the 5g dose 3 days earlier.  Knowing I had a while before they kicked in, I took my shower and prepared for bed as usual.  I filled 2x 1.5 liter aquafina bottles with water, remembering my splitting dehydration headache last time, and set them in bed with me.  I turned off my fan, stereo and even my computer, grabbed a notepad and climbed into bed.  I did not want even the slightest hum to interfere with my trip, taking Terence McKenna's advice again, which went extremely well last time, of engaging in a high-dose trip in the dark of your own room in your own house where you feel comfortable and will not be disturbed.  About 1 hour and 15 mins later my trip started in, same times as part 1 so far.</p><p>It started out with the same high frequency energy like last time.  Yes, the energy is definitely the energy that flows through the universe.  I was sooo relaxed, and breathing softly. I felt like my body was small compared to my head, I felt like pure energy and mind swimming through a universe of multi-creature consciousness.  </p><p>My big head and small body was floating through some sort of earthly consciousness, the immediate consciousness of all mammals on shrooms.  I floated by a cow, who looked as if she too had a small body large mind.  The cow and I could communicate, much the same way that I communicated last trip, but on a much smaller level.  The friendly cow greeted me with a 'hello' (in thought of course), I, with a happy/excited emotion, said to the cow 'How's the weather in your parts?'  The cow then telepathically showed me a big green meadow in full sun, very beautiful weather.  The cow expected a reply as if asking me about my weather.  I replied 'Dark here, but warm,' and I continued to float past.  The next entity that I came across, I call it an entity because I am not for sure on exactly what it was, was a wild boar or similar looking creature.  He then gave me some friendly and good advice.  I cant remember for the life of me, I was still lying on my back with my eyes closed in my bed.</p><p>Then I hear my dad turn on the stupid TV in the living room.  Out of all things to turn it to he turns it to cartoons.  'Boingy, boingy, boingy,' I hear that cartoon bouncing noise.  At the same time I was hearing the boingy noises, it was doing something to me, like my subconscious was now conscious and I felt the full effect of the sound (there are lots of subliminal sounds on cartoons, its a marketing technique).  I saw cartoon looking entities bouncing all over the place!  There were like 8 of them.  The cartoon sounds were extremely obnoxious and interfering with my trip.  This went on for about 10 minutes, and then it stopped.  Finally!  He turned off the cartoons and went to bed!</p><p>It wasnt long, about 10 more minutes and my floating through 'local,' by local I mean earthly, hyperspace stopped.  Wherever I was, was dwarfed by something so huge I would question whether or not it could dwarf the entire universe.  This 'thing' I cannot describe, you would have to see for yourself.  I can only call it 'God' or 'Lord' to describe the 'ultimate ness' and 'intensity' of this 'thing.'  </p><p>At T + 2 hours, approximately, I got up, drank a few mouthfuls of water, used the restroom and got my notepad out.  The first thing on my notepad I wrote was, 'a high frequency energy flows through my mind.'  I have always loved prophecy, and will find and read whatever knowledge I can about future events.  I will listen to anything anyone has to say regarding the important future; especially future that involves any major crisis.  This 'Lord' as I call It, was speaking to me.  I could feel it like nothing Ive ever felt before.  I was conversing with some type of advanced alien civilization.  Conversing in a language that has the power to transcend time and space.</p><p>I again, just like last time asked, 'what else is to come?'  The 'Lord' let me have it this time; He could send me information mush faster than I could write.  He is very patient though, he says 'there is no room in life for ignorance' and if I didnt understand something he would keep explaining and keep explaining until I understood.  He would rather me understand, than just say I understand and move on.  I got to thinking about money.  He said, 'you do not really NEED money I then argued that the entire world is based on money, and money was required to eat and live.  I inquired about the one world currency, predicted in the end of days, and how it would be implemented since how there are so many currencies.</p><p>This is what I wrote (these answers were coming from 'Lord'):</p><p>'Any implementation of a new currency would not be because of an immediate takeover by another power, as we would imagine.  It would be, and is, a very gradual process.  A process doomed to man because of bad leadership and the human failure of not foreseeing what is obvious.  The implementation of a new currency would be a crisis-based decision. He and I then both agreed that gold is the universal currency, and that buying some gold to ensure that necessities can be bought in time of a major crisis would be a wise decision.</p><p>Again, like last time I could speak in tongues.  When I spoke in these tongues it was a fast almost gibberish sounding made by the rapid tongue movement.  When done quietly I could speak with tongues on the in breath.  I called it round breath, as in round trip, both ways.  Under tongue also fits it nicely.  This highly evolved language is used to communicate with 'Lord' besides when he prophesizes, when I am making friendly conversation with Him.</p><p>'Lord' was actively, or in real time, destroying bad thoughts and fears as they emerged.  Well the fears are the anxiety with social situations that I normally feel.  It would quickly and with ease destroy my fears from the root of my consciousness (to the best of my explanation).  It was like a psychological subconscious reconstruction, or remodeling of the interior is a good way to put it. </p><p>Then I remembered about this alien invasion and asked 'can you elaborate on the alien invasion you showed me the other night?'  He gladly explained:</p><p>'The alien invasion is the mushroom,' He goes on, 'I invade to you and with you.  I am more invasive than any other biological organism or weed.  I am consciously invasive.  I invade your consciousness.  I invade what humans call reality and am very open about it.  I am good; I do not come to harm you, but to evolve you.  I am evolution.  When we talk we talk in thought.  You, as a species, are stuck without me.  You face the ultimate, extinction.  You are stupid; you just think you are smart just as every stupid creature does [I agree].  I am here.  I am your consciousness.  You can choose to speak to me or you can choose not.  Evil deceives, you are warned, evil IS among you [as a species].'  That is verbatim.</p><p>This is the best part!  It was the peak of my trip.  I turned the page and started a new one, He had something very important to tell me and it was going to take some space.  Here is what He said (verbatim):</p><p>I contact you through vibrational energy.  This is how I speak.  The more mushrooms an organism eats the louder I get, the friendlier I become, to a point obviously.</p><p>I asked, 'do you breed?'</p><p>He replied, 'yes, I do breed, this is life in itself'</p><p>He goes on, 'I am invading you weather you like it or not so we might as well become friends.  I am indeed what many consider to be 'God.'</p><p>[I had to use the restroom, because I was drinking water and just wrote this down to show His friendliness]</p><p>I said, 'sorry, hold on I have to pee'</p><p>Lord says humorously 'Go ahead and pee, Im not going anywhere'</p><p>He goes on: 'I take you through a process of 'ego defeat,' [which I talked about towards the beginning] or ignorance defeat.  This is essential to your survival [as a species is implied].  You [as a species] cannot abandon me in this period of evolution.  You will destroy yourselves! You are smart enough to build weapons, but too stupid for your own good.  Do not fight each other.  Work together.  This is the world power [I'm unsure on what that means].  The people who you call government deceive you.  Biology is each organism for himself, I control you, do not control each other!</p><p>I am what is, what was and what will ever be...  Yes I am indeed 'God' as you call me, you can call me what you like.  I am who I am.  The message I try so desperately to relay is that I mean no harm.  I want life.  Evil wants death, destruction and power.  Money is a plaque.</p><p>I got a little skeptical and asked, 'how do I know you are who you say you are?  You could just be an alien trying to take us over.'</p><p>His reply, 'How could something so friendly be bad?  I want you as a species to survive.  I want peace and life.</p><p>With an ultimate sense of emotion and anger he heeds humanity this warning, again verbatim:</p><p>'LET ME MAKE THIS CLEAR:'</p><p>'YOU, AS A SPECIES, CANNOT ABANDON ME AT THIS POINT IN THE EVOLUTIONARY PROCESS!  YOU WILL DESTORY YOUSELVES!'</p><p>'You just sit back and let me do the thinking.  YOU HAVE BEEN WARNED!'</p><p>Then in a complete change of tone He says 'Until next time my friend :-) [If I could see Him I know he would be smiling at this point], over and out!'</p><p>BAM!  Just like that, the vibrational energy that I felt that flowed through me stopped.  The peak of my trip was over.  I lay in bed for about 2 hours after the approximate 6-hour trip just thinking about what was said.  (Wouldnt you?)</p><p>He explained in great detail for a while about the invasion.  'I am invasive, just as any biologically successful organism is.' I was told, 'the alien invasion is not through our atmosphere with material and space ships as would be imagined.  This invasion, a very successful one, is through the 'biolution' or biological evolution.'  This is what is implied when He spoke:</p><p>ALIEN:  Term used to describe 'God,' 'Other,' 'Lord,' 'Universal Energy,' NOT a short green goblin as one would imagine.  Not so alien after all, this alien is you! </p><p>INVASION:  Terminology used to describe the biological evolutionary success of this alien interfusing itself with the human species.</p><p>So basically, what we are thinking of as aliens are just highly evolved humans.  They can somehow speak across time and space, and in a mushroom trip we can too.  If you look at the world, He is right, we will destroy ourselves. The creature that ingests psilocybin seems to be reconstructed into the image of this 'Other.' That IS evolution, in human's case anyway.</p><p>This was an experience of a lifetime.</p>"
}
