{
 "title": "Nonstop Conversation",
 "author": "Professor Pan",
 "citation": "   Professor Pan. \"Nonstop Conversation: experience with TMA-2 (ID 2830)\". Erowid.org. Sep 8, 2000. erowid.org/exp/2830",
 "substance": "TMA-2",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "TMA-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2830",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 8, 2000",
   "Views: 32604",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I met an interesting couple at a retreat in July. They gave me a write-up of their first experience with this substance. While I cannot vouch for its veracity, they both seemed genuine and honest.</p><p>40 mg., synthesized TMA-2</p><p>8 p.m. 40 mg. TMA-2 was dissolved in lemonade. Typical phenethylamine bad taste.</p><p>8:20 Mild stomach agitation. Was it real, or was it because I read about 'brief intestinal cramps' in a TMA-2 trip report in PIHKAL?</p><p>8:45 Plus one. Nervous, agitated energy. Eyes feeling glossy. K and I keep pacing around. Hard to sit down for more than a few minutes. Conversation between us flowing very quickly.</p><p>9:00 Plus two.</p><p>9:20 Plus three. TMA-2 takes hold.</p><p>The thing I remember the most was the energized, nonstop conversation. We talked and talked and talked. There was a bit of the empathic buzz of  MDMA, but tempered a nice, unattached (in the Buddhist sense) lucidity. Heart-opening stuff, for sure, but in a different way than MDMA. This could be very effective in therapy. When I directed my vision in a concentrated manner the visuals appeared. They were very similar to 2CB visuals, but not as colorful -- morphing surfaces, shimmery 'heat' patterning on light-colored surfaces, some peripheral sparkling. Glowsticks, as always, provided a visual treat, as did a glowing Frisbee and fireflies leaving blurry light trails against the darkness. K's naked flesh feels electrically-charged and tingly against mine.</p><p>The comedown was long. This stuff is still working at 9+ hours. Benzodiazepenes were just what the doctor ordered to facilitate sleep at 9 hours.  In fact, it took 2 administrations of Valium before we were able to get some rest. Sex was possible, but orgasm remained just out of reach (similar to MDMA).</p><p>Woke up feeling fine. Slight foggy hangover, but that could be due to Valium and lack of sufficient sleep.</p><p>Overall, our first experience with TMA-2 was very rewarding. This substance seems to enhance clear, intellectual communication and is also physically energizing without being enervating. Visuals are unobtrusive but can be</p><p>summoned with concentration, and can be interesting. During the peak it gets much more visually stimulating. Prepare for a 10+ hour ride. K and I both experienced fluttery stomachs, but mine also felt like imminent diarrhea on a few occasions (which never materialized).  The mild body load was certainly well worth the trip.</p>"
}
