{
 "title": "'Have I Seen this Before?'   Deja-vu Gone Bad",
 "author": "Quantify",
 "citation": "   Quantify. \"'Have I Seen this Before?'   Deja-vu Gone Bad: experience with Cannabis & Bupropion (ID 28315)\". Erowid.org. Nov 10, 2003. erowid.org/exp/28315",
 "substance": "Cannabis & Bupropion",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "12 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 ",
   "oral",
   "Cannabis",
   "(cookie / food)",
   " ",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28315",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 10, 2003",
   "Views: 22034",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I cant say that I'm that much experienced with psychoactive substances at all, so this report is probobly geared for people of the novice sort, thats just how I'm writing it. I dont know how common what I'm about to describe really is. Although I have looked through the experience vaults and found nothing of the sort. Anyways, I guess i'll just tell it as it happened and hope to educate.</p><p>Well... I was at a concert with a bunch of my friends and we were all sharing some good bud. We were all in a circle talking about the concert and passing around some big phattys. At one time there was three going around ot once! Anyways, that went on for a while and then one of my friends came by with that notorious tupperware full of ganja food. He walks right into the middle of the circle and pulls open the lid...sniff...sniff........ahhhhhhhhhh, perfect timing! Everyone took one hoping to get really high. Believe me that was the mood of the entire concert with my friends, get really high!!!</p><p>Well. The cookies were gone and I was trying to get away from the chaos and just listen. I haven't smoked that much before, so I was still in the curious mode of my life with drugs. I was observing the differences of this state of mind and such thoughts that make one quiet and suseptable to being blown away. I remember at the time I was particularly interested in the forming of chains of reason and what the difference really was. So, I decided to form one long chain of reason, completely bogus or not, and then memorize it. What It was I cannot tell now but I can say that I did a good job of remembering it and tried to see if it really didn't make any sense or it just seemed like that ( I hate it when your stoned friends dont know what your talking about ;-) ). And the music went on...</p><p>And then something happened that I did not expect in the least. I have never heard of this happening before, but I know what I experienced...   All of a sudden, things started happening. Everywhere I looked, everything I did, anything that happened... Somehow...  I felt as if I had thought of what was happening happening somewhere else, before then. I kept thinking to myself 'where have I thought of this before' It was very strange, and only got worse. I think this is where that cookie came into the picture. Ingestion is a whole other thing!!</p><p>So, I kept thinking to myself about this perpetual deja-vu. It was driving me crazy for a while... </p><p>And then... </p><p>'OH NO!!'.....................................................</p><p>'Where have I seen this before?'</p><p>'That chain of reason! THATS WHERE I'VE SEEN IT!!!!'</p><p>'Ahhhhhhhhhh......'</p><p>I was swept away by that point, and things started to get out of hand.</p><p>Things were repeating themselves, where their first appearance was in my very own head!! How could it be true?? How how how how how HOW!!!...</p><p>That chain of reason I speak so vaguely about goes something like this. I know this dosent make any sense but for your sake...</p><p>Myself from the future of destruction...</p><p>Going into the past to warn myself of the times ahead a choice...</p><p>That I made that ruined it all... </p><p>Because I didnt know what to do and it was too late...</p><p>I brave the barricade of time to tell myself all the answers...</p><p>And save the rest...</p><p>I make it through hell and all else to do what is impossible...</p><p>And am willing to make the ultimate sacrifice to breach time...</p><p>And save it by doing so...</p><p>I am above myself. Above a concert...</p><p>Waiting for him to look up. The fate of everything relies on a simple choice...</p><p>I can go into greater detail but I wont. Instead I must clarify a few things. First, the concert was outside. Second I DO NOT BELIEVE ANY OF THIS IS TRUE AT THE MOMENT AND I COMPLETELY ATTRIBUTE MY EXPERIENCE TO THE DRUGS I WAS ON... SO DONT THINK I'M CRAZY. Third, this entire looooong thought has been doctored poetically to make it legible and still has no significant meaning to me. Fourth, it was accompanied by a series of mental images that made it totally diffirent from what you see it as right now. Those images are what made me think of it as nonsense. BUT...</p><p>I'll continue the story...</p><p>Things were matching up and I just couldn't believe it! Scenes I felt familiar to were showing up all over the place. I decided to look up, for reasons that should be ovbious. This is the only part of the experience that I believe was real. As I looked up and stared at the sky for a moment. WHOOSH!... A shooting star went screaming across the sky.</p><p>Now, if you can make the connection as I did, you can see how things got out of hand from there on. Remember, I do NOT have any spritual connection to this experience or any other. In fact, for your information, I don't have any spiritual connection to anything! BUT...</p><p>As I was saying...</p><p>All of a sudden I felt as if I had to follow these 'instructions' to recieve my 'answers' So as you can imagine, I was doing all sorts of crazy shit. Man, looking back, I must have been a trip to see doing all sorts of weird stunts (Jumping across imaginary gaps that I was told were 'really there' amongst other shit). Coming down I began to feel a little embarassed. But at the same time I was soooooo glad that all that I had experienced was most likely just bullshit going on in my mind. I selpt well without dreams that night.</p><p>Nevertheless, all that was a learning experience, and since then I have learned to not let it get out of hand (yes, it is recurring. Either I am overanalyzing a common experience, or it's something that's just with me. But I do believe it may have to do with my medication for concentration (Wellbutrin SR 300mg)).</p><p>I dont know what to say from here. This report is pretty long.</p><p>So i'll conclude with the fact that different states of perception are fun until you just dont know. I dont mean like not knowing where you are, because that can be fun (sometimes). I mean not knowing WHO you are or WHY you are. I dont mean like those questions we ask everyday... When doubt of something that is always answerable enters you mind like a sharp needle. And you dont have 100% confidence that you are ANYTHING... That is what overwhelms you no matter who you are. That is the embodiment of fear itself. Now, I didn't experience anything like that. But I did get a taste of it for the first time. For the first time I did not know when thoughts formed and what they really meant. That scared me quite a bit and I now know that words of confidence can't always save someone from temporarily going insane. My advice to all of you is that under the influence of any drug, to be weary of your insights, be weary of your ability to come to conclusions, and always know that no matter what you experience, just learn from it and go on.</p>"
}
