{
 "title": "The Enlightened Projection",
 "author": "Elementxero",
 "citation": "   Elementxero. \"The Enlightened Projection: experience with Mushrooms - P. cyanescens (ID 28352)\". Erowid.org. Jun 1, 2006. erowid.org/exp/28352",
 "substance": "Mushrooms - P. cyanescens",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3.5 g",
   "oral",
   "Mushrooms - P. cyanescens",
   "(tea)",
   " ",
   "  repeated",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28352",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 1, 2006",
   "Views: 7570",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSensory overload. Cascading horizons of neon light flow into my very essence.  Absurd phantom conversations explode at ten million decibels in too many places to begin to fathom. A lifetime of memories and lessons unfold in a single breath. My current self detached and all-knowing, I allow this alter ego to probe and seep under the surface of my normal sense of being. Problems seem ridiculous and simple. Character flaws blare at my enlightened projection and I grimace, and then slowly begin to understand.  \r\nInfinite space lay before me yet I understand it in its entirety, as if it were finite.  Radiating energy, the clarity overtaking all doubt or clouded perception, I fully disband linearity of thought. No longer shall my perception cage me. I am free to view things as they are.\r\nEntirely unaware of the extent of these effects, but anxious to stress the walls and structure of my consciousness, I began to research psilocybin fungi as a senior in high school. I read scientific, spiritual, and even first hand accounts of mushroom use, and I was intrigued to say the least. How could I possibly let my life go by without experiencing something so potentially life-changing? I made a promise to myself to attempt to steady my mind, harden my psyche and pin down any unstable distractions. I had hoped that this would allow me a relatively positive experience that I could actually learn from, as opposed to merely witness. I continued to read as much information as I possibly could, and eventually felt as though I knew just about what I was getting into.  The time for preparation was over, and I took the steps to acquiring a dosage. A few days later, two close friends and I obtained a quantity of Psilocybe cyanescens mushrooms.  Coincidentally, we had planned on renting a cottage in Maine near the beach that week. The stage was set. I was ready to learn.\r\nThe days before the event were bland and passed quickly. A kind of giddy anxiety surfaced, probably due to the amount of time between acquisition and consumption.  Nevertheless, the day came for the trip to the cottage, and not a moment too soon.  We arrived at about noontime, and I proceeded to unpack my scarce belongings: one carton of cigarettes, clothing of various degrees of warmth, a few books and CDs and a large bag of pot. Converging in the living room area of the cottage, modestly decorated shades of beige and wood grain; we unwound and discussed which day would be the best to ingest our magic crop.  My mind felt distant yet slightly euphoric, enhanced by the frequent inhalation of marijuana smoke during the discussion.  The decision was made that they should be eaten at once, so as not to build any more tension that could affect the experience.  \r\nThe sun sets. I am standing over a pot of mushrooms simmering slowly in water with honey and brown sugar. The smell is both sweet and somehow foreboding-I remember this well.  It was a smell that would stay in my nose for the remainder of my waking evening. It's sickly mouthwatering smell was exactly paradoxical, perfectly reflecting the nature of the mushroom itself. It was not a good smell; it did not make me particularly anxious to taste it, and yet, I felt compelled to inhale the aroma. These conflicting sensations were disorienting, and I was amazed to realize that the mere smell of this fungus was indirectly causing me to think in paradoxical terms. My anticipation reaches its crescendo. An overwhelming sense experience in itself, my notion of an impending change swept over my mind with a warmly frigid chill/anti-chill. Another absurd contradiction.\r\nThe mushrooms sapped of their psychoactives, the sweet tea was poured into three cups.  I found myself sitting on a textured sofa chair, holding a steaming mug of the unknown in front of me. There was nothing left to do now but drink the warm liquid in my hand, and I would be privy to the knowledge that so many users have claimed to get from this teacher plant. Nervous, but resolved, I took a last look around at reality as I understood it and took a long sip. The taste was quite pleasant. It was sweet, but boldly uniquealmost spicy in its flavor. In all my enjoyment and indulgence in the sensation of taste, I had nearly forgotten the nature of my concoction, and my cup was suddenly empty. There was no going back now. I was in it, for better or worse- revelation, elation, or fear.\r\nI started to feel strange about twenty minutes later. I had a warm tingle in my stomach that spread slowly across my limbs. My mind felt muddled. I was slightly confused, but I knew not what for, or why. A slow melting of normalcy, I allowed my essence to evolve at the will of my temporary mental symbiote. Never without a lit cigarette, I explored my environment. Suddenly it had such depth, such richness in color, somehow more beautiful.  Wandering outside, I was amazed to find the space in between the wooden planks of the deck closing and reopening in other locations in an endless loop of creation and destruction. Now unable to process a traditional, linear train of thought, I was left with an ever-expanding notion of what was going on as a whole, rather than specific, individual events. \r\nI am convinced that this stage of the experience is essentially synthetic madness.  Generally, I think most people use a single inner mental voice that expresses abstract thoughts individually as to make sense of them. Inversely, mushrooms cause the equivalent of ten thousand people screaming totally unrelated things at me at once. And so I start to laugh. Overwhelming surges of random happiness, a feeling of being propelled forward by my own laughter, my own insanity, walls and people bending with the sound of my voice. I had to see the beach.\r\nAfter walking down a fifty foot dirt path to the sand, I saw the water. The very first wave that I saw crash to the shoreline was incredible. In what seemed like the course of an hour, the water crashed into the sand and kept going. Down, deep into the sand, leaving behind a neon-rainbow trail of color, unmatched in their brilliance by anything.  \r\nThe chasm of vivid light spread until it had scorched the earth around me and I stood on a bridge of sand in a sea of color, and I was breathless. The water rushes back to the sea. A thousand thoughts rush into my mind. I suddenly see myself as an absurd caricature of the real truth that now seems so painfully obvious. Every flaw is as transparent as glass, impossible not to see through, presented plain as day, leaving no other option but resolution. The pure simplistic truth reveals itself in a mere matter of hours after eighteen years of complex action. Every piece of personal garbage ignored and reeking was pulled from its festering corner of my psyche, examined, and deconstructed until I was left with the most complete sense of self I have ever experienced.  \r\nFinding myself back at the cottage, smoking more cigarettes, the peak has worn down to a gradual return to reality. I am talking. I dont quite know what I am saying until after I have said it. Yet somehow I am saying complex, very honest and truthful things with such fluidity that I felt like I was listening to myself. The whirlwind of concepts and ideas explored during this dialogue is so vast, that I cannot even begin to touch upon its surface. Suffice it to say it was enlightening conversation, and probably one of the most sincere interactions I have experienced. Seven hours, and 2 packs of cigarettes later, the sun is up, and I am exhausted. A new sense of self that I wish desperately to cling to surges inside of me, despite my waning physical awareness. I go to sleep embracing it, knowing it would be but a memory in the morning.\n\n\n"
}
