{
 "title": "The Plant of the Gods",
 "author": "Sage",
 "citation": "Citation:   Sage. \"The Plant of the Gods: experience with Salvia divinorum (ID 28389)\". Erowid.org. Dec 17, 2004. erowid.org/exp/28389",
 "substance": "Salvia divinorum",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "500 g",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28389",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 17, 2004",
   "Views: 7223",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSound Tribes rhythmic mantras distributed themselves evenly throughout my space like smoke and transcended all previously adopted auditory boundaries; it was nearing one oclock in the morning and it was the second journey my mind had made into the expanses of Salvia divinorums undefinable halls of enlightenment. The room was completely dark save for a half string of Christmas lights that adorned the wall above a dark computer desk; the only sounds were the melodic ones of Sector 9, and there had been candles lit, but decidedly blown out due to the fact that I was unsure of myself and whether or not I could handle fire in my soon-to-come altered state. The sage was packed into the bowl of a small bong.\r\nI sparked the bowl with a butane lighter and by the time I has exhaled it I had begun to feel its influence. My mind spun around itself as I floated in and out of sobriety, feeling the strong sense of euphoria often associated with marijuana. By the second or third hit, I had felt completely absorbed into a new fabrication of consciousness; I felt as the Prince Siddhartha must of felt while sitting under the legendary Bodhi tree, pearls of enlightenment descending into his very being from every aspect of life. There was a powerful energy which surrounded me, and I felt as though I was being taught; I felt as though I was being guided into and surrounded by a divine wisdom. So far, however, none of these apparitions were hallucinogenic in nature.\r\nBy the third or fourth or fifth hit (I began to lose count), I had reached a position in consciousness far beyond myself. My mind and soul and body were three different entities existing in harmony within the same boundary of my soma. I was filled with a great peace and feeling of euphoria and calmness. With closed eyes, I was able to imagine vivid images of an idyllic blue sky, in which expanses of soft, white clouds were floating. I was laying on my left side, in my bed at this time, and though I am certain I was laying on a completely level plane, I began to experience a feeling as though my center of gravity had decidedly removed itself from my body and was now hovering in the space to my right side. I felt as though my bed had rotated into the air, with a steep downgrade; following, I began to convincingly feel as though I was rolling off the surface and felt as though I was about to fall to the floor; I had to physically hold the sheets in order to keep from ending up on the ground. Despite the terror this may have imposed upon some people, it was not at all an unpleasant feeling. I had a sitter present, and when I opened my eyes from these images, looking toward him, my visions were as follows:\r\nHis hand, which was holding the bong, began to glow with a white-blue color (much like that of a blue flame) but it radiated a cold energy, much like ice would in a spiritual world. His fingers began to appear thicker than natural, as the icy color spread from his fingertips to his wrist. Following, a violently pink hue outlined his hand and a second outer color of a deeper, darker blue, surrounded that. Both of these colors spread outward in a crystalline manner so that they somewhat resembled ice and somewhat resembled the fur of an animal. His entire hand was now glowing, all three colors, with a radiant light that echoed warmth and coldness, strength and submission. \r\nThis tri-color pattern soon spread up his arm and onto his face, until his entire essence was no longer his own and he had transformed into a creature of immense understanding, power, and wisdom. The mouth and nasal area of his face were the last to change, but as they did they elongated together until they reached the shape of an animals muzzle. Shapes similar to ears adorned the crown of his head and he was surrounded with the same pink and blue aura as previously stated. I recognized this new being as existing in the form of a Great White Bear, whose nature was both eternal and instant, who was filled with both great knowledge and a desire to learn; he was one with whom I could relate and yet was one so consecrated and greatly beyond my scope that I would always strive to reach his divinity; he radiated truth, enlightenment, peace, suffering, wisdom, eternity, impermanence, and perfection. He was the summation of all the great powers of the universe and in his was harnessed all truths which have existed since the dawn of the age of time. \r\nThen these thoughts appeared in my head; I do not remember thinking them nor did the Great White Bear speak these things to me. Rather, I believe he taught me these things through silence and meditation because that is the communication of the divine. It seems apparent that telepathic communications, or Crystal Monkeys, are quite common in Salvia use. He said that there is a path that we all must travel upon and that this path is surrounded on all sides by a great mass of existence - an infinite oblivion of eternity. He taught that we must all tread on this path which is as weak as dust, but it is held together and secured in the consciousness by our faith and search for knowledge and enlightenment; if we fail to yearn for either of these three things, our path crumbles to dust piece by piece until we are no longer able to tread upon it because the weight of our imperfections it cannot hold. Once we fall from this path, we must once again traverse it from its origin. \r\nHe said that there is a Gate at the end of this long road, and behind it there exists an eternal reward which awaits those who reach it. It is also known that one must travel this path by experience and learning, for those are the ways to move forward. owever, before he could deliver his further teachings, I was disconnected from his aura and lost from his vision.\r\nThe remainder of the experience, which lasted until only about 1:45 am, was spent experiencing pleasant euphoria and extreme cotton mouth and tiredness. In the morning I awoke with a slight headache, presumably from the dehydration; I remembered none of my dreams or anything that may have happened between my visions and my descent into sleep. However, the essence of the Great White Bear has left an influence with me that I shall never erase from my mind; Salvia has brought me to a deeper understanding of conscious existence and yet only given me cause to attain a profound definition of enlightenment.\r\n'There is no burning for him who has completed the journey, who is free of sorrows and all else, and who has broken off all chains.'\r\n-The Dhammapada\n\n\n"
}