{
 "title": "Psychedelic, Not Hallucinogenic",
 "author": "jackthetab",
 "citation": "   jackthetab. \"Psychedelic, Not Hallucinogenic: experience with MIPT (ID 28384)\". Erowid.org. Nov 14, 2003. erowid.org/exp/28384",
 "substance": "MIPT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MIPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28384",
   "Male",
   " ",
   "Not Given",
   "Nov 14, 2003",
   "Views: 20230",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>amount - unmeasured amount (possibly 30mgs or 40mgs)</p><p>setting - 2:04am 11November03 - large bedroom with JBL S312IICH speakers pounding out Hallucinogen - The Lone Deranger.</p><p>20 minutes after ingestion I could feel some weird effects, but nothing I could really describe. The intensity of the substance seemed to creep in rather slowly at first. I really saw only minor visual effects. The walls seemed to breathe slowly with the beats of the music.</p><p>The majority of my experience was more of a mind experience than visual. My mind seemed brighter. Music seemed more intense. The music seemed to glow in a hypnotic sense. I noticed so much more in the music. Certain sound samples and vocal samples would stand out. Everything in my vision appeared to be brighter. The colours were more intense and more profound.</p><p>My eyes felt wide open. I kept yawning (which for me is always a sign of tripping - a freak I am, yes). My eyes were also dilated, when looking in the mirror. I felt warm, but not overly 'fucked' up, however, I knew I was under the control of a substance. The effects were overly apparent. No mistaking. Socialize I could do. Driving, I would stay away from. Usually I am good with words on my experiences. This one is rather difficult. Intense, yes. Although it was all in my mind. The intensity of the visuals were only minor, but I still felt the mind effects of this substance. Without a doubt you knew it was there. This is not a hallucinogen, but more likely a psychedelic.</p><p>It reminded me of the first 10 minutes when you think you are tripping (on lsd). This is NOT like lsd or psilocybin though, but you can tell that it is a tryptamine. It is very strange for me to have such an experience without having many visual hallucinations. I wonder if taking 50 mgs would be better? At 50mgs you would believe it could produce hallucinations, although, I am rather hesitant since this is a new substance with little information.</p><p>The next night I smoked some cannabis and had some alcohol (guiness beer and rum). I could feel some slight after effects from the night before. These were not really strong, but more intense then my normal guiness beer, rum and cannabis experience.</p><p>So far I have only seen reports of 25mgs and nothing higher than that. I would use that with caution. Know your drug! Never do more than you are supposed too (some of us are just crazy).</p>"
}
