{
 "title": "Relaxed, Happily Underwhelmed",
 "author": "'Dre",
 "citation": "   'Dre. \"Relaxed, Happily Underwhelmed: experience with Cacti - T. bridgesii (ID 28407)\". Erowid.org. Oct 14, 2004. erowid.org/exp/28407",
 "substance": "Cacti - T. bridgesii",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Cacti - T. bridgesii",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28407",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 14, 2004",
   "Views: 21441",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'd read all the elaborate, kitchen gadget-oriented preparations, but as a real primitive guy, none of them had turned me on. It took me a while to get around to following my own path to using this sacrament. I've had my two prickly pedros for about two years and have cared for them as best I could. So it was a little difficult to cut my green-fleshed friends. I smudged myself, my sharp pocket knife and the plants with sage and cheap cigar smoke. As I always do when I take life or harm a living thing, I asked the plants permission and tried to vibe in some good thoughts about my intentions of inner discovery. Then I carefully sliced off a joint from each plant. </p><p>Here's my easy prep. I took a plate, smudged it, and began slicing up the joints into 1/4' thick slices. Intending to dry them, I sliced them at a 1/4' because any thicker and they wouldn't have dried quickly and I was scared of mold or fungus, and any thinner and it seemed they'd probably get all crushed up and I wanted to maintain them in button form to have a fairly regulated dose. I took all the pieces and strung them, with a needle and thread, into strands to dry, being careful to tie a knot for each one, so they wouldn't slip down and stack up. Then I hung them in my attic and left for 10 days. I tried to keep  them away from real heat, for the most part, and dried them in the dark, as I'd read mescaline was light sensitive.</p><p>One day, I decided it was time. The buttons were dry. I was alone. I left off eating anything after lunch. That evening, I smudged myself and my house, did some sweeping and picking up, and took my dog for a walk so she wouldn't be restless if I got too weird. Then I drank some water, and a cup of plain green tea, then just chewed up a small handful of the crispy discs and swallowed. It was a little bitter and dry so I drank a little more water. I didn't have to chase it with anything, it wasn't the most disgusting thing I've ever tasted, I didn't want to puke. It just tasted like a dried up plant that was bitter and alkaline. No worries. </p><p>I sat on the porch in the falling dusk and watched the sky change its colors. I waited. I rolled a cig and smoked. I watched a big spider work on a large, beautiful web, silouetted against the orange and purple of the sky. I felt a little warm and tingly in the belly (belly chakra???). Felt a few pangs of nausea and stomach pain, but only dull and not too distracting. Dizziness and slight euphoria. I went inside and lay on the couch. The perennial red and green of mescaline became evident. Some objects glowed a little. I was really sedate and untroubled. A bit more nausea. (I figured I'd hurl and was ready for it, but never did.) The stomach pain went away. I went back outside and watched the spider. As I sat there, I began to hear a faint reedy flute through the trees downhill from my house. I listened harder. It stopped. I relaxed. It came back. I looked for a source of the sound, but when I looked, it stopped. I looked back at the spider, at the sky, and relaxed, and back came the fluting. I was honored, tickled, surprised, and sat there, just reveling in the treat of discovering this sedate, furtive music coming from somewhere beyond my normal reality. </p><p>I was not tripping balls or anything, so I decided to take my dog out into the open grassy hills of the park near my house. There was a good, fat, round moon, and the balmy October wind was blowing ragged clouds across the sky. They took on the red and green hues. My doggie ran around,invigorated by the wind. I sat in the grass and felt high. No more flutes, though--just warm, sedate and understated visuals. What a sense of peace and oneness with my surroundings. </p><p>I spent the rest of the night either on the porch or the couch, read a little, came down and just felt sedate. It was really a great experience. I love to go nuts on a big dose of shrooms, get goofy on acid or liquored up--this was really something else. I've rarely had such a nuanced, complex experience on drugs. No blender, no concoctions, no chasers, and by god, no mixing substances. This was a really great way to experience the power of the cactus. I'd try a higher dose next time and see what happens. I highly recommend this plant, if you're reverent, patient and like what I've described. </p><p>Peace and understanding.</p>"
}
