{
 "title": "The Room Was Still Spinning",
 "author": "The Experiment",
 "citation": "   The Experiment. \"The Room Was Still Spinning: experience with DXM & Alcohol (ID 28435)\". Erowid.org. Mar 15, 2008. erowid.org/exp/28435",
 "substance": "DXM & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "120 mg",
   "oral",
   "DXM",
   "(pill / tablet)",
   " ",
   "5 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28435",
   "Male",
   " ",
   "Not Given",
   "Mar 15, 2008",
   "10453",
   " "
  ]
 ],
 "report": "<p>It was a friday night, and it was a particular tame one, with no parties goin on.  We were pretty bored and had heard stories about dxm and had always wanted to try it.  So we took a trip to Kmart and went to see if they had the pill form of straight DXM (Cs) without guafenisine and the other crap or whatever, it needed to be straight dex.  We ended up finding cough syrup and these cough drop type deals that were the only ones that had only dxm in it.  The cough drops seemed like the best idea because we could just swallow em and we didn't have anything to measure cough syrup with.  Not knowing how much to take, we thought that 12 10mg cough drops a piece would work.  </p><p>Later, we headed to the beach and took 12 of the 10mg drops a piece.  After sitting around for an hour and a half we realized that nothing was probably going to happen.  We called some friends and they luckily had beer!  Good thing because I was feeling kinda shitty after takin the dex, all tired and kinda stoned, not feeling up to bein around a lot of people just yet.  So I drank 1 beer, and to my amazement, I was drunk off my ass!  Four beers later and I was as drunk as id ever been without passing out or something.  This was truly amazing to me and I felt I had to tell everyone.</p><p>The fact that you can get really drunk off dxm and one beer, and still be able to pass a breathalizer test made me very excited about our discovery.  After drinking only five beers that night, I woke up in the morning and the room was still spinning, Wow.</p>"
}
