{
 "title": "Finally Worked",
 "author": "Paranoid Android",
 "citation": "   Paranoid Android. \"Finally Worked: experience with Leonotis leonurus (Wild Dagga) & Alcohol (ID 28464)\". Erowid.org. Nov 17, 2003. erowid.org/exp/28464",
 "substance": "Leonotis leonurus (Wild Dagga) & Alcohol",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "5 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "5 bowls",
   "smoked",
   "Leonotis leonurus",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28464",
   "Male",
   " ",
   "Not Given",
   "Nov 17, 2003",
   "Views: 52564",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'd ordered some African Wild Dagga online a few months ago in my curiosity to try legal substances.  For the most part, I've concluded that legal substances are legal for one of two reason:  either the government hasn't deemed the substance enough of a risk to the public to schedule it or the government doesn't know enough about the substance to schedule it.  The former usually translates into 'this substance/plant won't do jack shit.'  There are exceptions, however, but for the most part I've found this to be true.  Until last night I placed the Wild Dagga into this category, having sampled it on many occasions without much fanfare. </p><p>Some claim Wild Dagga to be a viable MJ substitute, citing mild MJ like effects.  After smoking the dagga three or four times I rationalized that everyone else's definition of mild differed greatly from mine.  I've smoked MJ on many many occasions and consider myself quite experienced with it--based on my experience,  Wild Dagga is no substitute, not even close.  Or so I thought...</p><p>Last night, I drank about five beers over the course of five or so hours.  Before I smoked the dagga I was feeling a slight alcohol buzz, but nothing pronnounced.  In my boredom, I decided to smoke a few bowls of the still full bag of dagga I had laying around.  Initially I didn't feel a damn thing, just burning lungs from the harsh smoke.  However, after watching TV for about five minutes after I concluded smoking I realized I was a lot more intoxicated than I rightly should have been.  Colors were slightly brighter, time moved incredibly slowly (and really fast at the same time), and I was really into the 48hrs broadcast that was playing.  There was a definate dreamy quality to the evening thereafter as well as a 'haze' of sorts.  Music, however, didn't sound any better and the euphoria was minimal.  I was definately affected by something other than the alcohol.</p><p>I can now see why this is claimed to be a MJ substitute.  While I felt nothing after smoking the dagga sober, it seemed to synergize well with the alcohol and the effects were indeed like MJ in some ways.  In other ways it was completely different.  I'd liken it to buying generic Coke (a-cola, that is) and the real thing and sampling both at the same time.  Yeah, the generic kinda tastes like Coke, but it just isn't the same.  So while I'd hesitate to call it a MJ substitute, it is a viable substance and handy to have around when there's nothing else.  With that said, it's just not the real thing.</p>"
}
