{
 "title": "Bored",
 "author": "SunnyD",
 "citation": "Citation:   SunnyD. \"Bored: experience with LSD (ID 28472)\". Erowid.org. Nov 17, 2003. erowid.org/exp/28472",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 0:30",
   "0.5 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28472",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 17, 2003",
   "Views: 8372",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo, last Friday, on the 14th of November, I managed to get my hands on four hits of acid; it was liquid; each drop was poured onto one of the smartie-style sweet tarts that my dealer had bought at the store we met at. I watched as he did this, and we chatted while waiting for the drops to soak in. I was informed that this stuff was really visual, that if you look at glass on one hit, it gets a stained glass effect. This excited me. I wanted the hallucinations...I wanted to watch my dresser breathe. So, blah blah, the day went on. I went to dinner with my dad. Didn't really eat much, as I was hungry, and buzzing with excitement, anxiety, and joy that I was going to experience such a wonderful drug.\r\nTwo to three days before, I had started reading all about LSD, as I tend to do, exactly like I did when I first tried MDMA. I wanted to know everything, so I would be prepared. I was expecting so much stuff to happen. So, at 11:00, as per normal every day, I picked up my boyfriend. We went home, and about 11:20, we both took our shares. Him two, me one, leaving one left over. After around 15 minutes, I was feeling a pretty nice body buzz, and waiting in anticipation, with no fear whatsoever, for the experience.\r\nAround a half hour to forty-five minutes after we took our first hits, we decided to break up the last one; He took a small portion, and I took the larger two that it had split up into.\r\nConan O'Brian came on, so we watched that. After Conan, we turned off the TV, and headed into the bedroom. My boyfriend kind-of annoyed me by being so reclusive...I was expecting him to be understanding and to help guide me. He put on some music and the AVS on Winamp3, and then after a while, laid down. I was bored, and we went outside for a while, and fed the ducks. They were so cute. \r\nThen, we went back in, and my boyfriend went back to laying around. This was about three or four hours into the excursion, and it seemed like no time had gone by at all. I was getting annoyed...why wasn't I hallucinating? I closed my eyes, and tried to see if I could get any CEV's. Nothing. I was starting to feel very dissapointed. I knew that I was at my peak, but why wasn't I having any hallucinations? Why did I only have a body buzz? The only thing that was cool was the trails I was getting. It looked cool.\r\nI went in and played a video game (the new Teenage Mutant Ninja Turtles game for PS2). That got old, as I was easily killed many times. So, I let my boyfriend take control and play GTA: Vice City while I went in our room. Still nothing. I was getting annoyed, now, not just bored. I concentrated really hard...and got a visual of rainbow hearts tacked to a wall, and some poodles with really thin string for hair and really big eyes. That was the extent of my visual hallucinations, save for the occasional India-themed image popping up for a split second.\r\nFinally, at about 9am, I just closed my eyes. I know I didn't sleep; I think I went into a trance, but I don't remember anything about it, not even when my boyfriend asked me to switch to the other side of the bed. When I opened my eyes, it was 1:22, a minute before the alarm went off. I felt sober, except I got the body buzz back minorly when I smoked a cigarette.\r\nAll in all, I was very disappointed by the experience. I was expecting to trip, not to just plain feel high. Upon discussion with an experienced user of the drug, we decided that the dose wasn't enough. I'm not never going to take LSD again, but I AM rather disappointed. I know that I got more visuals when I took MDMA than that, and that was relatively annoying.\n\n\n"
}