{
 "title": "Yugoslavia, the Ex-Paradise of Peace",
 "author": "Blaze",
 "citation": "   Blaze. \"Yugoslavia, the Ex-Paradise of Peace: experience with Tramadol (Trodon) (ID 28470)\". Erowid.org. Jun 19, 2007. erowid.org/exp/28470",
 "substance": "Tramadol (Trodon)",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28470",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 4576",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was amazed when I found out that Tramadol isn't used nearly as much in most countries as it is here in Yugoslavia. A year ago if I walked around a public park for an hour or so with my eyes glued to the ground I would surely spot at least one empty box of Tramadol.\r\nThe fact that a prescription for Tramadol became necessary only at the beginning of this year here and that anything except the most common of drugs(heroin, ecstasy, pot and if we're lucky LSD) are hard to find , could account for why most people I know used it at some time or other. Hell, half of my class in high school used it. We would just pop up into any old pharmacy and ask the granny for a box of Trodon (brand name for Tramadol here).\r\nThey were even quite cheap.\r\nThe standard dose was 200mg, followed by 100mg the next morning so as to keep me from being grouchy the whole next day.\r\nI tried this same dosage on a fairly empty stomach in various settings. What worked best for me was just sitting around with a couple of good friends, talking, cuddling and watching TV. Slowly sipping a strong black coffee seems to intensify the feeling.\r\nThen again, this friend of mine would turn up the music and jump around while on T, and kept insisting we go for a walk. I always remained wrapped up in my blanket staring at her, fascinated that she wanted to move at all. Still it always worked out well, she would dance around the room and I'd watch and smile.\r\nThe worst was taking it in public places with a lot of strangers around. I remember this one time I went to a bar and was so irritated with everyone around me that I almost picked up a few fights (being a girl, imagine how obnoxious I had to be) Plus the smoke made me additionally sick and I ended up vomiting in the bathroom.\r\nI tried sex on Tramadol with a guy who wasn't doing it, and while the touch was pleasant, orgasm was pretty impossible and thus I got bored with the whole thing. To make matters worse he didn't know I was on anything and being a nice guy kept insisting to make it pleasing for me as well. Sex with someone also on T tends to just end up in a cuddling session.\r\nAlso a favorite activity on Tramadol everyone seemed to love was attempting to sleep. I can spend hours being in this sort of half reality, between sleep and consciousness. I could sometimes feel the bed breathing comfortably beneath me. I kind of wake up every 15 min. or so and then slip back.\r\nSooonow Tramadol is rather impossible to obtain in Yugoslavia. The law enforced this year is merciless on pharmacies selling it to people who don't have a prescription. And since it used to be so popular for abuse, I swear doctors would more readily write down morphine for me. Bad for people like me who used 200mg for recreational purposes. Good for a couple of people I know who used it on a daily bases and came down with withdrawal symptoms when they were forced to stop.\n\n\n"
}
