{
 "title": "My Final Trip",
 "author": "Str8-Klownin",
 "citation": "   Str8-Klownin. \"My Final Trip: experience with DXM (ID 2847)\". Erowid.org. Dec 13, 2001. erowid.org/exp/2847",
 "substance": "DXM",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "650 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1999",
   "2847",
   "Male",
   " ",
   "Not Given",
   "Dec 13, 2001",
   "41224",
   " "
  ]
 ],
 "report": "<p>\nUpon arriving at school one day, I ran into an old friend from a couple years back.  I instantly looked into his eyes and saw no color.  His pupils were completely dilated; it was like staring into darkness.  I approached him and asked how he was doing; he just stared back at me.  I just came out and asked him what he was on and he explained the whole story to me.</p><p>He just returned from SC where he was kicked out of his dad's house.  He told me he was with his cousins when he first experienced a new trip.  I thought to myself, whatever he is on looks like it is doing a good job keeping him happy...if you knew him, you would know he looks for the 'Ultimate Trip.'  He said, 'By far this is the best trip I have ever experienced!'  So I said what the hell, and I asked if he wanted to pick some more of it up from the store.  He agreed, so we got in my car and left campus at the beginning of first period.</p><p>On the way to the store, I saw him staring out the window, and I heard him talking to himself or persons unknown, even though there wasn't anyone else in the car.  We picked up a load more of these pills and liquid cough syrup.  We figured we would head to a friends house that was out of town.  On the way I asked him how many I should take, he told me he already took a handful of the pills (about 30).  I looked at the box and saw that each pill contained 20mg of DXM.  So he had already taken 600mg.  He told me to take about 30 also.  I said why not, grabbed a soda, and washed them down.</p><p>About half way to my friends house (driving still), I started to feel a strange rush.  About 2 miles later, it hit me.  I told him I didn't think I could drive the rest of the way...he said just relax and let your body do the rest.  Well we finally arrived at our friends house, lucky we did because I couldn't have made it much farther driving in my current condition.  We stepped out of the car, and instantly, I hit the ground.  I felt like my legs just weren't working, I felt a tingling sensation throughout my body.  I looked at my friend and said, 'My hair is growing.'  It was an awesome feeling.  I managed to get up and get to my friends porch.  I told him to go inside and wake up our friend.  While he was inside he took another handful of the pills (about another 30). I remained outside where I sat, tilted my head back in the chair, and felt the breeze rush across my body.</p><p>I had no control over my legs, and my eyes felt like they were taped open.  I heard a door close inside the house, and I could feel the vibrations run up my legs, moving up my body then out of my head.  It was a trippy feeling!  I thought to myself that this was the greatest feeling anyone could possibly experience.  Both my friends came out, and helped me into the house where I sat on the couch for a while.  I saw the door to the porch swing open and I heard laughing in the distance.</p><p>The friend I left school with walked in and as he was walking in, he tripped over a cable that was on the floor in front of the door.  He spun around and the back of his head landed on a glass table that was in the living room.  I heard a deafening bang.  I looked down and he was out cold.  I regained feeling in my legs immediately and ran over to him.  I grabbed him and tried to see if he was just joking, but he wasn't breathing.  I picked him to his feet; it felt like the life poured right out of him.  He began shaking uncontrollably...and the shaking began to move up my arms.  I was still tripping hard!  I could feel his shakes go throughout my body, then back into his.  I thought to myself, this is the end of his life and it is my fault.</p><p>I dropped into an instant state of depression.  That whole day passed through my head in seconds.  The friend that owned the house had to run and wake up his older brother, who immediately called 911.  I sat and thought about all the consequences.  I was tripping hard, and the ambulance should be here any second.  I reached into his pocket looking for the pills and found a wadded up piece of school paper...upon opening it, I found at least another 60+ pills.  I threw them in the trash and hid out in the bedroom until the ambulance left with my friend in it, still unconscious.  To this day I still have flashbacks of the event.</p>"
}
