{
 "title": "The Cloud Follows",
 "author": "DBTM",
 "citation": "   DBTM. \"The Cloud Follows: experience with Mushrooms, Cannabis & Alcohol (ID 28510)\". Erowid.org. Nov 21, 2003. erowid.org/exp/28510",
 "substance": "Mushrooms, Cannabis & Alcohol",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "28510",
   "Male",
   " ",
   "Not Given",
   "Nov 21, 2003",
   "6487",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Christmas Eve 2002. I had purchased 4grams of mushrooms, no idea what kind and at the time I knew very very little about them. I was in a very good mood and had a lot of time to invest in the experience so I boiled them in water and added iced tea crystals to make it pleasent tasting. It was actually pleasent tasting, I had heard they tasted like dirt. I had little idea of what to expect and I phoned some of my mates over for drinks as my parents were out at a Christmas party. We smoked a few bowls and took some shots of Royal Reserve, RnR, Rough n Rowdy, or whatever u want to call it. I have a notoriously weak stomache and a huge shot left me in the bathroom heaving my guts out. I was quite upset, thinking my mushroom experience had ended up in the toilet as well.</p><p>I was cleaning myself up when I noticed an almost haze like surrounding. Everything I saw was hazey, there was no clearness anymore. I fell on  the floor laughing at the hystericaless of it all. I guess I must have been in the bathroom for a good half hour as my friends picked the lock and entered to make sure I was still okay. I got up and looked  at myself in the mirror and my face was absolutely melting. My giant dumbo ears and pronounced nose became the only  recognizable parts of my face. I dragged myself away from the hallucination and went downstairs were my friends were. There was one girl who had very dark skin and was wearing antlers in her hair. She took on the exact form of a deer and I was amazed. Obviously this creeped her out to no end so I tried to busy myself by folding and refolding a blanket. I had obviously reached my peak, roughly an hour and a half or so after my consumption. I had box vision, everything I focused on became surrounded by a faint black box and my vision zoomed in on it, it was incredible, like a movie almost. I was much more sociable than usual. My mood changed from quiet to outrageous, I couldn't stop the giggles. </p><p>This continued for about another hour until we decided to leave the house before my parents came home. Right as we left the house I flashed out, and the trip was over. About a level 2 trip, but still lots of fun. I plan to experiment with much higher doses in the future.</p>"
}
