{
 "title": "I Unwittingly Invented Hypertext on LSD",
 "author": "Justin Case",
 "citation": "   Justin Case. \"I Unwittingly Invented Hypertext on LSD: experience with LSD (ID 28531)\". Erowid.org. Nov 19, 2003. erowid.org/exp/28531",
 "substance": "LSD",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1992",
   "28531",
   "Male",
   " ",
   "Not Given",
   "Nov 19, 2003",
   "Views: 8053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>   Once on an LSD trip I invented non-linear text that interconnected at multiple points. This was created on loose-leaf paper but it functioned exactly like standard hypertext. Keep in mind that this took place in 1992, the same year the World-Wide Web was released by CERN and HTML (Hyper Text Mark-up Language) was first put in place around the same time. But like most people, I was completely unaware that the internet (and HTML) existed.</p><p>   I was having a surge of revelations about metaphysical/psychological/natural/creative matters and was writing furiously. I soon realized that my thoughts could not be expressed from beginning to end. As I extrapolated on any given subject, I found myself underlining words and phrases (that I intended to elaborate upon on a different page) and placing symbols after them. This basically worked like footnotes, but I was using non-sequential symbols like *, @, #, $, %, etc. These symbols would prompt the reader (if he or she wished to read further about the underlined word or phrase) to go to the page with the corresponding symbol at the top. </p><p>   So I would write a page on body energy (for example) and would make a brief mention of the third eye. The Key Words third eye would be underlined and there was a symbol like * after it. You could continue to read bout body energy or find the page headed with * and read about the third eye. This page would of course contain many underlined words and phrases. Each page was connected to some or all of the other pages on many points. I was a little frustrated that I could not figure out any linear way to arrange these pages from beginning to end, or any order whatsoever. After sometime I put aside the pen and paper and indulged in other activities (music, art books, etc.) and continued to enjoy a mild LSD trip.</p><p>    The next day I again tried to put the pages in some sort of order. After some time I realized that this was impossible. I started hanging the pages from my ceiling using thread and tape. I placed them a few feet apart from each other and began to connect each underlined word or phrase with its respective page using lengths of thread and tape. Soon this became impossible to complete. My room was so full of criss-crossed threads that I could not crawl over, under or though them. It was like shoe-string Indras Net, a room-wide web of tape and thread. This project was abandoned for practical reasons and the pages given to various friends who were impressed (even if somewhat confused).  </p><p>   It was not until this year that I suddenly realized that what I had made functioned as low-tech hypertext!</p>"
}
