{
 "title": "3 Sacred Experiences",
 "author": "mescl",
 "citation": "   mescl. \"3 Sacred Experiences: experience with Peyote (ID 28544)\". Erowid.org. Nov 20, 2003. erowid.org/exp/28544",
 "substance": "Peyote",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "30 g",
   "oral",
   "Peyote",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 28544",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 20, 2003",
   "Views: 19809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOver a year ago, through an unusual contact, and by the most wonderful coincidence, I was able to obtain peyote grown far away, dried, and transported from place to place and finally a quantity landed in my hands.   Enough for three experiences no less.  What follows is a report of those experiences:<br>First Experience 15g-<br>For my first time with mescaline in general, as well as peyote,  I took a half dosage, expecting pleasant euphoria to a mild trip, but no fireworks.   However, I was in for a surprise.  After devouring the bitter flesh, slowly over a half hour,   I was overcome with mild stomach discomfort that passed in time with no purge.  This was the first pleasant surprise. <br>After an hour I felt strong euphoria, one I associate with MDA, but not so piercing.   My sense of touch was greatly stimulated and I found my self rubbing my arms almost obsessively. Eventually, the trip took  a dream like form and I expected this to be the apogee, but it was not and strange visuals  formed, shadow like lines over my girlfriend's face creating almost multiple eyes on her face.  It was difficult to tell when I was peaking. 10 hours later I was down.<br>30g-   This I vomit, but it is a gift and I feel I have a new understanding of peyote.  As I exit  the bathroom, everything begins to shift, drawers look like they are opening and closing, the ground swirls and colors sparkle with purple hues.  Thunderous music fills my ears and it sounds like Gods Dancing and screaming, my friend, on mushrooms, is in a very different world.<br>I go outside and I am greated with a strange sight, the Oscar Meyer Wiener mobile drives by.  NO, I am quite sure it was not a hallucination, just strange timing.   The weather is Beautiful and everything is full bloom.  A wooded area is thick with green patterns and we spend hours near a pond smoking herb.  Until it is is dark.  I return to my friends apartment to listen to music.  I am awake all night, but sleep well in the morning. <br>40g-  This time vomiting is a pain and I must make multiple trips to the bathroom.   A heavy body load over takes and I lay on my bed. With time, I feel better.  All my friends are passed out.  I enter a very introspective state, losing all concern, I smoke herb and listen to music.   I draw and write little poems all over my room, which I regret later when I move out.  I write some music and finally as the sun is rising I go out side.  This expierence was strong yet less visual.   However, the early rays of light cast a frosty glow over everything. 16 hours later I am still awake and the trip is finally coming to an end, accompanied by a strong headache. I get no decent sleep till that night.\n\n\n"
}
