{
 "title": "Squirreling",
 "author": "Travis",
 "citation": "   Travis. \"Squirreling: experience with 2C-I (ID 28569)\". Erowid.org. Sep 6, 2007. erowid.org/exp/28569",
 "substance": "2C-I",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28569",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 6, 2007",
   "Views: 2922",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 75 mgs of 2C-I is considered an extremely high dose, see 2C-I Dose Chart] </p><p>I recived the 2C-I from a labratory after purchasing a half gram. After experimenting and discussing with friends I realized that I was not having as profound experiences as others. So I upped the dose. I had 3 capsules, each filled with 25mg each that I had measured out earlier with an appropriate scale. I ingested all three capsules at the same time around 3:00 pm.</p><p>I sat at my computer for an hour or so, I was familar with 2C-I's longer than average time it takes to come up, so it was simply waiting, I was listening to the music of A Perfect Circle when I started to notice distinct differences in the music I was hearing and the music that I remeber, as I turned off the computer and the music I began to notice that the room around me seemed to wave and flow slightly, as I walked around the experience seemed less powerful. However when I finally settled in my backyard and stared at the grass the longer I stared at the grass the more it began to move like an ocean, the colors of the grass and sky seems much more vibrant than usually almost sickinginly vibrant, or maybe just sickingly cause of the feeling I had grown accustomed too when I ingest reasearch chemicals and see such colors.</p><p>This grew into the one of the most intense experiences of my life. Sounds became extremly profound, however not distorted like tryptamines. Sounds seemed to come and go, volume would be distorted, similar to MDMA. My body seemed gripped by a gravity best described by feeling as if I had been int he ocean for hours, but now was laying down feeling the waves still, however it was much more prounounced than that. I also noted that there was no feeling of dissociation that I had come accustomed to with tryptamines and LSD.</p><p>Visualally, there was intense vision lag, as I watached a squirrel play, its trail would stretch the length of my backyard, however it was segmented similar to 5-MeO-DiPT, where there would be still images in the tracer, not like a solid trail as with LSD. Colors were extremly intense and bright, and the entire world would sway and move as in waves. Patterns swirl and move, however only after I would stare at them for a few seconds. I later spent some other time inside listening to music in which auditory hallucinations became much more intense however matched perfectly with the music in harmony, as if intended in the original piece.</p><p>The remaining hours were spent slowly melting back into reality, each passing hour would produce the same effects, just less intense, no crash. I was able to sleep by 11:30 that night with the assistance of 1 alcoholic beverage.</p><p>Overall I wish I had not taken the dose that I had, comparing with similar experiences personally and friends experiences just as prounouced effects could be achived at far lower doses, the duration was also not much more than average. However, I have had much experience with hallucinogens, reasearch and illicit and this is by far the most pleasant experience I have ever had and I would definitly recommend it, however at much lower doses and definitly with a sitter.</p>"
}
