{
 "title": "Not to Join the System",
 "author": "Ion Rodz",
 "citation": "   Ion Rodz. \"Not to Join the System: experience with Salvia divinorum (ID 2856)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2856",
 "substance": "Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2856",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2001",
   "Views: 5264",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI did salvia for the first time about 3 months ago. I bought a 1/4oz. for $20 from a guy that I met. Simple leaves.\r\nOr at least I thought.\r\nMy reaction at first was, 'this guy has sold me cooking herbs'.\r\nDamn, was I wrong.\r\nIt was night, around 11pm. I decided I was going to inhale when I remember that I need to get something in the car. So I went outside, packed pipe in hand, a lighter in the other, and couldn't resist lighting it up.\r\nTwo huge hits and then another one that I couldnt hold for long enough.\r\nI headed back to the door, when I started feeling like ants under my skin. Nothing bad, but a VERY wierd feeling. I had to sit down in the doorsteps, when I saw myself sitting on the doorsteps. I laid back and closed my eyes, saw a huge cloud. I did not actually enjoy this try, but I did not want to wait to try it again.\r\nNext day, at about 1pm, in my bathroom. Brought some music (Dara) and some pillows.\r\nOpened the window so I didn't fill the room with smoke. Lighted up, and I inhaled and inhaled and inhaled until I lose consciousness with the immediate reality. I fell on the floor (just perfect because I had a pillow).\r\nTRIP, THE.\r\nIt was a circle. In fact, all I saw was concentric circles of different colors, and they had the silhouette of a world. Suddenly I even heard other sort of music, music that I have never heard before. Like industry music (not industrial). Like being in a factory world and all the noises from the machinery formed a beat.\r\nI guess that what it was, an industrial trip.\r\nThe 'world' melted in to machines and people laughed, others cried. I saw my friend's face on it too, but in the form of a kaleidoscopic image. Like a circle, somewhat prismatic. And it vanished. \r\nTrucks, machine, money, green, trees, fires, destruction, chaos and then creation. I did not understand (at least in that moment).\r\nBut it was not bad. I was seeing THE WORLD. Then I found myself in a space. No color. Not black, not white, no colors, except for me. Like P was inside my mind, physically.\r\nThen, the revelation of what I saw. Some voice that came from matter explained to me that we are doing something wrong. That we have left the cycle to join the system. The cycle of nature. The system of capitalism and mass production of machines, life, death, persecution. We are making the world so much complex than it needs to be. \r\nThat was the dream. \r\nSince then, I have not done salvia again. Maybe (surely) in the future. But the things I saw there, really got me thinking. I still think about them every day. I want to do something about it. Until then... 2015.\r\nNeedless to say, I'm not the same since I learned from salvia.\n\n\n"
}
