{
 "title": "The Spiral",
 "author": "TheMountainKings",
 "citation": "   TheMountainKings. \"The Spiral: experience with Mushrooms (ID 28573)\". Erowid.org. Nov 21, 2003. erowid.org/exp/28573",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:00",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 28573",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 21, 2003",
   "Views: 14026",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I became a devote pot smoker at the age of 16 when I went with my older brother to the opening of the Lord of the Rings. Approximately a year and a half after this my curious mind began to question me about other possibilitys in the realm of substances. I was intimidated by the thought of jumping into some kind of heavier drug such as acid or coke, but mushrooms entirely intrigued me and I decided that I must try them for the benifit of the expansion of my mind. </p><p>I posed the question to my good friend and dealer, E, who smiled at me and told me that he would definitely help me out with this. (He always reminded me of some kind of elf-person from his features and actions)I picked them up at P's house where in the basement E told me to consume about half of them for the first session. (sure. )It was thursday night, I had school the next day and told myself that I would take the shrooms friday or saturday night. </p><p>Sitting in my room that night I admired my mushrooms and knowing myself all to well, decided how bad would it be to just sample a small bit of them? I nibbled a piece off the end of a stem. 15 minutes later I ate about a quarter of the stash. Nothing happend and I didnt want to waste my precious shrooms so I ate another quarter. I sat back in my chair and waited. An hour passed and knowing nothing about the effects of shrooms or how long it would take for them to kick in I was severly dissapointed. So I ate the other half of them, enjoying the taste of something as strange as dried fugus. </p><p>Two hours had passed and it was 11:00. Nothing. I began to wonder if some of those hippies were just a bunch of damn fakers. Slowly though, the mushrooms started to take hold of me. I looked up at the wall and started to feel my depth preception changing, but it was still weak. At eleven thirty I started seeing tiny worms all over my sweatpants and enjoyed it emmensly. Then my poster of bruce lee on the closet door suddenly grew legs of wood. Neat but still nothing potent. I toyed with my new glass pipe and then, being a complete fucking moron, decided to smoke some of my mushroom scraps out of it. Smoke curled out of my mouth and turned into the faces of jesters grinning at me. Every word of The Led Zeppelin I had on began to make perfect sense to me. And it was growing more and more intense by the miniute. Gravity was pulling me downwards and melding my body with the chair. It felt good. Still no hallucinations though. </p><p>Everything was begining to come alive in my room, and I was begining to feel what only could be described as madness. My thoughts bounced off of everything and hit me like a ton of bricks. Its time to go trip out in the bathroom I thought to myself. I stepped inside and was tweaking out to my reflection feeling like some kind of jester, or as I thought of myself the mushroom king. I pulled on a bright blue hat and grinning madly, stared deep into my own eyes to try and find my person. I took a piss and then, right there, it happend. The toilet flushed as I was peeing I turned around and the bathroom trobbed with energy. I no longer had irises. I went back to my room and tripped about millions of things, seeing myself in a alice and wonderland of my own. Everything was warping and changing, Jefferson Airplane was singing to me, for me. About an hour and a half had passed since it began and then I ran my hand though my hair. . . I had singed with my lighter. I came to my senses about it and realized the whole room reeked of burnt mushrooms and hair. Oh Jesus. What did I do. </p><p>It was almost 2 in the morning now, school, I didnt expect it to last that long and if my mom came into my room that morning she would know. My heart started pounding. I tried to fix my hair with some sissors and thought it looked terrible. She would know. Oh fuck. Then the thought passed through my shroom saturated mind that smoking mushrooms was a very bad thing. This did not help me. The world grew out of proportion and I did not fit in it. I was tripping very hard now. My heart beat faster and faster. I might die I thought. No, gather your mind. Your just tripping. But I couldnt, I tried to set my alarm so I could wake up early and fix everything but only succeded in fucking it up. My heart now shook my entire body and reverberated in my head. I was extremely scared for my life. It was 3:30, where did the time go? What was happening to me? I had lost myself huddled with my back against my bed waiting to either die, or come out of it. </p><p>Luckily I slowly started to come down and gathered myself. I slept for two hours, my mom didnt come into my room that morning. Tomorrow was a bright and beautiful day for me. I appriciated life more than I ever had before. </p><p>I dont hold it against the mushrooms for what happened to me. I know that it my stupidity that brought me into the terrible trip. Someday I will try them again just so I can know who I am that much more.</p>"
}
