{
 "title": "Well Worthwhile",
 "author": "Wasabi the PimpNinja",
 "citation": "   Wasabi the PimpNinja. \"Well Worthwhile: experience with Inhalants (Chloroethane) (ID 28634)\". Erowid.org. Dec 19, 2007. erowid.org/exp/28634",
 "substance": "Inhalants (Chloroethane)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28634",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 19, 2007",
   "Views: 10165",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>Let's start at the beginning: My friend Dan gets this internship at a hospital. Of course he robs the freaking place blind every night before closing up. I ran into him at the local park on a few occasions during the time he held this internship, and he always had all sorts of new lifted goods: sterile syringes, hydro-ergotamine, morphine, hypnotics, ethyl-chloride in a spray bottle, and just about everything else that would make a druggie like myself come in their pants. I had never heard of ethyl chloride before, but it sounded similar to ether. It came in a large spray bottle, and was used for numbing skin for minor surgeries or injections. It is a liquid gas that evaporates on-contact to leave the surface freezing cold. </p><p>I baught a couple large canisters. I looked up its data sheet over the internet, and noticed it was described as having 'narcotic effects' upon inhalation. So I sprayed some into a cloth and inhaled the vapors. Let me tell you, 'narcotic effects' is an understatement. The correct description would contain the words 'motherfucking blasted'. From having tried nitrous I know know that sensation of being weightless and fuzzy, that sort of creeps through my entire body until I am numb, and how absolutely everything both physical and mental is suddenly astonishingly ironic and humorous. Well, this takes the sensation of nitrous to a new level. For about 5 minutes I totaly lost myself in the physical and mental slew of impulses my mind was franticly trying to keep up with. I would realize something, and as soon as I could process my realization and try to cope with some sort of reaction or understanding of what was going on, my focus would change. At the same time as my mental function was becoming ludicrously confused, my physical self was still trying to cope with the sudden changes in gravity and perception. It was a total spinning sensation. I lost my balance entirely and fell over. (I was using this stuff at midnight in the parking lot to 7-11, and I am sure I entertained the employees working that shift) </p><p>I decided to take two hits the next time. That left me in a total narcotic sedation. Occasionally there would be mild visuals, or echos, or other nifty physical changes. Oh, and time didn't exist as it usually does... it's hard to explain changes in time. We usually think of time in terms of faster or slower perceptions, but this was different... very distorting. So long as I kept inhaling oxygen with it, I could take another hit as soon as my last one wore off. And each hit would only last a couple minutes, and afterwards I was totaly coherent agian. I didn't want to risk causing tranquilization of the lungs, so I was careful about my dosing.</p>"
}
