{
 "title": "Entering the Salvia World",
 "author": "Cameron",
 "citation": "   Cameron. \"Entering the Salvia World: experience with Salvia divinorium (15x extract) (ID 28665)\". Erowid.org. Jan 30, 2007. erowid.org/exp/28665",
 "substance": "Salvia divinorium (15x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28665",
   "Male",
   " ",
   "Not Given",
   "Jan 30, 2007",
   "4131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Salvia is not only the weirdest drug I've ever expierenced, it's the most intense, 'trippiest' and possibly scariest drug I've ever tried. Might as well get that out of the way off the get go. I have no idea what I said/did during the 10 minute long trip (seeming easily as long as hours in my brain), nor do I have the words that explain this trip that my mind created on its own.</p><p>The trip started after my friend Phil had smoked his snap of salvia, he lost sanity after blowing out the hit, he was no longer Phil he was someone else. He didn't know where he was, who he was, etc. The only thing that he could remember/relate too was my bed, where he was taken on a magical carpet ride that had him englufed in  pattering lights/geometrical patterns.</p><p>Now before I had taken the hit, I had told Phil about my pre-expierences with salvia, but none of them resemble this...</p><p>I put the bamboo bong to my face, light the bowl inhaled and held in. As I blew out, I was placed in a room similar too mine, seemingly buried within my thoughts, Phil and a lady I didn't know where talking to me. I then remember looking at a calendar, seeing SALVIA WORLD on the date we where on. I then remember looking back at Phil and he said 'What Cameron? You're stuck in salvia.' as he said this I felt something similar as a giant maul being pushed through my whole mental body and I was forced into my first loop of thought where keep kept repeating this.</p><p>After this loop ended, I was buried in shit, and was placed into a state of jumping up through the shit I was buried in, and jumping was my only thought as I was engulfed in pure mentality, I kept attempting to jump out of this world.  I think salvia is only a taste of what it might be like to be mental.</p><p>As I was jumping in thought(and in reality for a short time), I felt as though I was stuck here, jumping up, and coming back down only to jump another time, which would only be the same thing, but I didn't know, I was engulfed in a loop of thought that seemed as long as a lifetime, and I was doomed in this surely there was no escape. Then BANG(Phil stopped me from jumping), anticipation, anxiety, hate, many feelings engulfed me as I begin heading back to reality out of the loop of thought, only to find that I wasn't, I was stuck in a room that I created souly in my brain, and surely there was nothing outside of the door.</p><p>Phil had attempted stopping me from leaving the room, but from the look on my face I was leaving the room one way or the other, considering I was ensured that I was stuck in insanity for the rest of my life, and if there was reality outside of the door I was to find out.</p><p>As I had exited the door, I had exited the room I was surely imprisoned and glanced back to reality, as my disorientated state walked to the fridge and grabbed a soda, I had cracked it open and drank some, at which point my parents where making fun of how stupid I was acting. I had left, ran from the room with parents back to the room I was trapped in, only to find out that I was back.</p><p>Upon returning to my room, my sanity returned. Phil was rolling a joint and everything had a dimension to it, everything looked 'squared' some how, real hard to explain. I was afraid, just plain afraid. I loved to lay on my bed and it just felt awsome to be back in reality. I had no vision of anything in the real world admist the voyage of the Salvia ship. The best thing I can compare salvia to, is entering a dream while you're still concious(you basically think random thoughts, storys, dreams without visuality), nothing can even explain the intensity and fear I felt.</p><p>Upon exiting the effects of salvia, Phil filled me in on my trip. I guess in the part where I was jumping, I was jumping around hysterically in my room. He reported that I was completely dissocciative(can't be reached, hello not on earth here) and made him laugh about as hard as he made me laugh. The only thing I felt like after the salvia trip was, an idiot.</p>"
}
