{
 "title": "Peeling Back the Flesh of Reality",
 "author": "MIM",
 "citation": "   MIM. \"Peeling Back the Flesh of Reality: experience with Mushrooms & Cannabbis (ID 28667)\". Erowid.org. Oct 23, 2007. erowid.org/exp/28667",
 "substance": "Mushrooms & Cannabbis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28667",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 23, 2007",
   "Views: 3527",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I would not say I am an experienced user of psychoactives but I am not entirely an amateur, either.  So far I have used absinthe, marijuana, salvia, and nutmeg.  Marijuana in particular I have used since high school but this semester (sophomore year in college) I smoke up at least several times each week and usually every day each week.  Although I hear shrooms grow naturally in Vermont (where I got to college), they are rather hard to find on campus.  Recently a guy I know brought a large amount of shrooms to campus and my friend, whom I shall refer to as John, and I were of course very excited to try them out.  </p><p>First we smoked a spliff and after the first wave of the weed high had passed we each ate about 2 grams of shrooms, which happened to be convenient because, as usual, we both had the munchies at that point.  This was about 5 that afternoon.  We then started watching a few episodes of the Simpsons.  By the time the second episode began, the shrooms had clearly begun to kick in.  I was feeling rather warm and fuzzy and the show no longer looked like a show any more, no longer looked like actual characters interacting, but rather just a moving picture that seemed somehow to generate sounds.  Needless to say, things in general somehow seemed to become a lot more literal, less abstract.  </p><p>The show then ended and we decided to stop watching for a while.  He had a psychedelic poster on his wall which I looked at and as I gazed the surface seemed to bubble and the bubbles moved around, radiating outwards.  This was fairly interesting for a little while but it got old after a time.  He smoked a cigarette.  As the smoke swirled under his desk lamp, it suddenly became very interesting, as if I could somehow ride along with it up into the light, though that is only a metaphor for what I felt.  </p><p>We played a game of cards, a simple kids game.  It seemed to go fine and at this point the effects still seemed minimal.  I was rather annoyed because these shrooms werent cheap and Id thought that I should have felt a stronger effect by that point.  After the card game was over, I looked at the back of one of the cards and I thought of how the design looked like a mosaic on the floor of some ancient building.  That too, though, grew old after a while.  We were waiting around for some people to show up for a bit of a get together we were going to have at some undetermined point that evening and as no one had yet shown up we decided to watch a beautiful mind until people started coming.  </p><p>About a quarter through the movie the effect of the shrooms seemed to be wearing off so we decided to smoke another spliff to try to kick up the trip a little bit.  For a while after the spliff was finished I felt more or less like I do during a normal weed buzz, but then, as I watched Jennifer Connelly turn her head, her hair did something remarkable, but I cant describe it in words.  I suppose a metaphor might be that it came to life, that it started breathing and bulging and contracting and undulating.  But that is a poor attempt at a description at best, as any description would be.  In any event, just as the Simpsons had seemed more picture like than usual, this movie suddenly seemed more real than usual.  Though perhaps surreal would be a better word.  There are no words to describe the beauty I saw and the terror I felt at that point.  The sight was a terrible beauty, and the feeling a beautiful terror.  </p><p>A few moments later it seemed as though the skin was melting off the faces of the characters, as though the flesh were thinning and being scraped aside slightly to expose the skulls underneath.  I wondered if this were only specific to the movie, so I turned to look at my friend.  The room was dimly lit, unlike the scenes in the movie, but I saw the same thing.  In my friends face.  I pulled my eyes away from him to look at something else, anything else that wouldnt die before me.  I looked at the air, not the wall across me through the air, but the air itself, between the wall and myself.  Almost immediately it seemed as though the flesh of everything I could see, of everything I thought was real, was pulled away as the flesh had been from the skulls, to expose something.  But I couldnt see what it was.  All I can say that it was blackness but not of the sort one sees in a shadow.  A tangible blackness.  I turned back to the movie, more content to look at the death behind our lives than the blackness behind our reality.  </p><p>It came to a scene which featured a messy office, as I remembered from having seen the movie sober, but instead what I saw I can (for once) easily describe: it looked like it was a Salvador Dali painting or something.  All edges seemed to melt and shapes were very very distorted, with round objects becoming more angular and flowing in some direction or another.  Out of the corner of my eye I thought I saw the moon in the sky.  When I turned to look in that direction I saw it was the lamp lights round shape reflecting off the shiny surface of the poster on his wall.  I laughed, but I cant quite recall why.  For whatever reason, I simply could not stop laughing for what I think was several minutes.  </p><p>About halfway through the movie one of the people we were waiting for (I shall henceforth refer to her as Emily) showed up and she joined the two of us for a game of cards so we turned the lights back up.  I looked at the wooden door and the patterns in the grain while John dealt the cards to us.  The patterns swirled and passed through each other hand all around each other.  I tried to focus to see if I could make them stop, and I succeeded, but only to a still vision of people in a fiery cavern being burned, like a scene from Hell.  And then the patterns, now people  or souls  on fire, became animated, and started twisting around in pain, whilst other patterns which were demons prodded and tormented them.  </p><p>The card game was to begin so I was forced to tear my gaze from the door.  I was no more worried that I had wasted money on a bad batch of shrooms.  These things had even exceeded my expectations.  As I played the game peoples faces were no longer melting and peeling, but rather they seemed to bulge and become distorted, almost as the objects in the Salvador Dali room had become.  Every now and then though I would see, say, someones scalp being torn off their head or blood pouring from their eyes.  The trip, clearly, was becoming somewhat disturbing, but I was still enjoying it, perhaps simply because it was more vivid than any experience I had ever had before.  </p><p>After a while some other people came.  By now the noise of a party in the suites hall had begun as well.  Peoples faces kept distorting and one persons face looked as though they were a bug that had become squished, only it was squished in wards so that it was narrowed and the eyes bulged and seemed to hang in their sockets.  It was hard to keep up with the conversation in the room and most of the time I leaned back, immersed in thought.</p><p>Each thought, though, turned into a 3 dimensional diagram, which my eyes open, right in the center of my vision.  I was not thinking in terms of words, but pictures, and each abstract picture had attached to itself a very precise and logical meaning, and through manipulating the pictures I could reach conclusions in my thoughts and inner questions.  Every now and then, though, Id look at whomever was speaking, so as to not be rude.  Emily kept looking at me.  I had been in her room a few months before on a very bad nutmeg trip and had to talk to her for a few hours before feeling safe enough to go back to my room and go to sleep.  Perhaps she saw similar expressions in my face.  </p><p>The visuals slowly subsided, to the point where it was only every once in a while that someones face would morph into something strange.  What newly befell me at that point though were what I can only describe as emotional hallucinations, like in a weed high but uncountably many times higher.  It was nearing Christmas time and I was looking forward to going home and seeing my family again, but I suddenly worried that I might be stuck in this state forever.  How could home ever be the same then?  My family wouldnt look familiar, theyd keep dying and being torn to pieces before my eyes.  I knew it was unlikely it would ever happen.  But what if? I asked myself, what if I have gone insane?  What is in retrospect an incredibly small kernel of a chance, if anything, drove me to the point where I felt as though I were on the edge of sanity.  </p><p>Slowly, though, I began to come back into the real world.  Later that evening, after the gathering was over, I went back to Emilys room with her and chatted for a bit about a few things, and then the conversation turned towards me and I finally admitted that Id been on shrooms.  She said she hadnt noticed anything but that I had seemed rather more tired and silent than usual.  As we spoke, I began to have disturbing thoughts about reality and perception, the sorts of thoughts that are hard to put into words and had tormented me at a very young age, and had been a curiosity all my life since then, but had suddenly become more acute in my mind, as had been the case when I was 3.  We spoke about this on a philosophical level and had a rather interesting discussion for an hour or two, and then I said Id better go.  By that point it was four in the morning and I was feeling rather sleepy.  </p><p>Outside her dorm building the night air was misty and the yellow, old-English-looking just added to the atmosphere.  I walked down a sidewalk on a bit of a hill, and in the distance on the sidewalk I saw a figure approaching.  By this point I am certain I had finished tripping, but felt very much on edge.  I suppose the adrenaline was still high from the experience, though I cant figure out why, then, I was so tired.  Anyway, I feared this figure but continued my pace in its direction, looking at it intently the whole time, looking for whose face it might be, for whats face it might be.  Close enough I saw some face and it clearly was nothing to fear, though it wasnt familiar, but I continued to look a the face just to make sure this person was no one to fear.  She probably thought I was very strange, but she smiled at me and walked on.  </p><p>On the rest of my walk back to my dorm I encountered no more people, real or imagined, but was rather nervous the whole time.  I got in bed and turned out the light.  I felt, for the first time in a very long time, like I did sometimes as a little kid, afraid of the dark (which I usually like since, as a college student who gets very little sleep, darkness is quite a pleasure).  I fell asleep easy enough, though, and slept for twelve hours or so, which isnt too terribly unusual for me, but is on the longer side of normal for a weekend.  </p><p>I awoke that Sunday feeling refreshed in body but dulled in wit, at least for a little bit.  After I had breakfast/dinner at 5 or so, though, I became far more lucid and could think more clearly.  All in all, despite occasional feelings of terrible and frequent disturbing images, I thought it was a good and very interesting trip, and look forward to doing shrooms, perhaps a higher dose, again.</p>"
}
