{
 "title": "Pediatrically Prescribed",
 "author": "jezebel laguz",
 "citation": "   jezebel laguz. \"Pediatrically Prescribed: experience with Scopolamine (ID 28686)\". Erowid.org. Nov 26, 2003. erowid.org/exp/28686",
 "substance": "Scopolamine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 ",
   "transdermal",
   "Scopolamine",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "1989",
   "ID: 28686",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Nov 26, 2003",
   "Views: 20003",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nWhen I was eight years old, I was prescribed a scapolamine patch by a physician's assistant for nausea.  They applied the patch to my neck, and after only a few hours (3-4 at the very most) my sister had realized something wasn't right and removed the patch, promptly thereafter washing the area on which the patch had been.</p><p>I was average height/weight for an eight year old girl, and the patch was prescribed and used while i had a slight case of influenza.  (The prescription of this drug in such a form to an eight year old for a touch of the flu is a mystery to me.  the only explanation i can give is that the physician's assistant did not speak english very well, and may have misunderstood a very shy, sick child when she listed her symptoms.)</p><p>As for experience, I remember seeing things like flies crawling on the ceiling, snow falling in the bathroom, and a couple times claymation-like creatures scurrying around the corner or across the room in my peripheral vision.  The most lasting effect by far was blurred vision, as i remember having difficulty making out words in books, or even seeing that the marks on the page were words at all.</p><p>I can't report much else as, due to the fact that i was a child, i accepted the experience with overwhelming ease.  I was already feeling woozy and dreamy from being sick when the drug entered my system, so i can't differentiate between when and where illness stopped and hallucination began, nor can i identify the overlap.  The only other bit of information i have to offer is a distorted sense of time, in that, until my mother informed me that i had been in that state for about one week, i thought it had been a month.  This may not be the most useful piece of information, as children tend to have a skewed sense of time to begin with, but i do feel that the drug played a major part in that time distortion.</p><p>Being that this experience happened at such a young age, I am interested in information anyone has to offer on the effects of scapolamine, nightshade, or dhatura during a period of heightened human mental and/or physical development, especially pertaining to the circumstances of this case (i.e. a patch on the neck compared to the arm; a patch versus seeds, roots, leaves or berries; et cetera).  I am interested in terms of how these circumstances may have affected the experience in ways different from fully developed humans; any toxicological attributes that could affect directly mental and/or physical development at that particular stage; and any long-term effects from exposure to scopolamine/nightshade/dhatura at given stages of development through pubescence.</p>"
}
