{
 "title": "Dangerous Even In Low Doses",
 "author": "Wick",
 "citation": "   Wick. \"Dangerous Even In Low Doses: experience with Salvia divinorum (ID 2869)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2869",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2869",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2001",
   "Views: 9373",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nHere is my trip report on salvia divinorum. It is more a collection of several trips and general thoughts. I believe it serves as a useful warning to people wanting to try salvia.<br>First a little background on myself. I am a 20 year with fair experience in entheogens. I have noticed that usually I have a high tolerance to hallucinogens (I usually need to take twice as mush as my friends).<br>I have tried smoking regular salvia, but the harshness of the smoke has prevented me from smoking very much. I have noticed that tolerance to salvia DECREASES: The more I tried it, the stronger the effects became. Here are the two strongest experiences I had. They were, I believe, my third and fourth salvia expereriences. The first two were not very profound.<br>I smoked it out of a pipe in my dorm room. After one medium sized bowl, several effects rushed onto me at once: My vision shifted red and I felt like everything except me was tilted 45 degrees to the side. Looking at my hands, in which the green of the veins stuck out in contrast to the 'red' of the skin, I thought my hands looked like leaves. Of course, I knew that they were not. My underwear (briefs, but this has happened with boxers before) became EXTREMELY chafing in the elastic ring at the top.<br>So far, everything I had experience before. But now, I also had a terrible sense of paranoia. I felt like I was not alone in the room, like there was another presence. (This seems to be a common salvia experience.) Unlike my other hallucinations, I was not aware that this was not reality. The other presence seemed to convey to me that I had set off the fire alarm and that I should flee. So I packed up the bowl and put it away. Even though this took me all of five seconds, it seemed like the biggest hassle of my life. (Everytime I smoke salvia, putting the stuff away is unbearably annoying.) By the time I got outside, I was more-or-less sober. Total time was no more than five minutes of weirdness.<br>The second intense experience was my attempt to overcome two barriers: 1) Fear of setting off the fire alarm. 2) Inability to inhale enough smoke. I was in my frat house all alone, which is a totally relaxed setting for me. So I bought two two-gallon jugs of water, both of which I made into gravity bongs that I filled with smoke. I then inhaled the two bottles, holding the first then second as long as I could. I should have moved the bottles to the common room before inhaling, but instead I was in the bathroom standing up. So:<br>I was immediately filled with total and abject fear. My ego seemed to dissolve and yet I felt totally alone. Although this thought never really bothered me before, that ultimately we are alone and neither our parents nor our lovers can help us through the game of life, I was at that time morbidly and suicidely depressed about the fact. The game of life ... the game of life ... was running through my head. I felt like my life had been compressed to a simple board game THAT I HAD JUST LOST! My parents and the police were going to come take me away since I HAD LOST THE GAME OF LIFE! Oh god!! (Notice that I had no hint of thinking that I was just tripping. I was TOTALLY CONVINCED of this fact.)<br>When I became straight enough to believe that there was some way to evade the police if I worked quickly enough, (but I still was convinced that they were coming) I packed my salvia up as quickly as possible, threw away the jug-pipes, and fled. Once outside, I felt normal again, although the clubhouse had bad vibes and I had to leave.<br>So overall: Salvia was very scary for me in its ability to make me think crazy thoughts without making anything else sufficiently (visuals, etc.) distorted. I would like to try 5x extract, BUT I WILL USE A SITTER. Both of these experiences had HIGH FREAK-OUT potential. I can't stress this enough. I was totally convinced that my hallucinations were reality. This is not to be taken lightly.<br>I would like to hear people's thoughts, especially if they had similar negative experiences or have had the experience that going OUTSIDE sobers them up.\n\n\n"
}
