{
 "title": "Crossing the Fallen Walls",
 "author": "CantorDust",
 "citation": "Citation:   CantorDust. \"Crossing the Fallen Walls: experience with Absinthe (ID 28706)\". Erowid.org. Nov 25, 2003. erowid.org/exp/28706",
 "substance": "Absinthe",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28706",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 25, 2003",
   "Views: 12327",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI followed the recipe instructions here though deliberately skipping one step: distillation. I found that simply mixing all the herbs in 75% (bacardi 151 proof) rum essentially acted as a very effective alcohol tincture/extract of the herbs involved. The end result had a very strong bitter taste from the wormwood with a backing of comfortable licorice; green in color, turning to milky white upon the addition of roughly 3oz water to 1oz (75% alc) absinthe.  My experiences with absinthe, upon reflection, have allowed me to observe some very distinct effects:\r\nThe effects, firstly, are not as prominent as one may believe through hollywood's description of the drink. It will not send you into a realm of psychadelia.  The effects come on slowly and comfortably, and often you feel them only upon a pause to reflect.\r\nIt seems to allow you to sink as deeply into its psychotropia as you are willing and prepared to sink.  My advice is that absinthe is not a 'party drug' and my best effects have occured during quiet meditative, reflective, or discussional settings.\r\nIt feels as though while the strong alcohol content is working on your brain, weakening your inhibitions (as alcohol/drunkeness does), the wormwood's thujone carries a certain lucidity through the mind, allowing one to navigate the inner canals of their usually inhibited brain.\r\nI find this great for discussion or the creation of music or arts, as thoughts that should flow out easily often get bungled up in our overactive conscious translations. The alcohol eliminates this high-strung consciousness and the thujone overrides alcohol's usual slopiness with a clear headed navigability. And back to my first thought; it allows you to navigate virtually as deeply and intricately as you have the mindset, patience, attentiveness, and the will to discover.\n\n\n"
}