{
 "title": "False Positive with DXM for PCP",
 "author": "Rob L.",
 "citation": "   Rob L.. \"False Positive with DXM for PCP: experience with DXM (ID 2876)\". Erowid.org. Sep 8, 2000. erowid.org/exp/2876",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2876",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 8, 2000",
   "Views: 40908",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHello, </p><p>    My name is Rob L. and I have a comment to make about Dextromethorphan and drug testing. A few months ago, my friend Lance K. recreationally ate approximately 500mg of 99.9% pure dextromethorphan hydrobromide aquired from a pharaceutical laboratory (placed inside a gelatin capsule) .  It was his first experience with the chemical and things didnt go too well.</p><p>    He started to lose his sense of reality and complained about being in 'outer space' and 'seeing planets'. Having convinced himself he would die, he called the ambulence and was rushed to the emergency room. He was afraid to tell the doctors he had eaten the DXM, (because of the anticipated negative reaction from his family and friends) so he remained quiet and did not tell the doctors he had intentionaly ingested the substance. They pumped his stomach and gave him a drug test, thinking he had his food in the cafeteria (this was in school) 'spiked' with drugs. The drug test result showed up positive for PCP (phencyclidine). Lance had never done an illegal drug before, let alone one as dangerous as PCP. I am wondering if anyone has had or heard of a similar experience, and if anyone out there in the medical profession, or a toxicologist could explain why this causes false positives for PCP. I think that its important to know that DXM could cause a false positive on tests, and for how long this false reading could persist after ingesting the chemical. Thank you!</p>"
}
