{
 "title": "MDA: Mopeds, Drugs, and Alcohol",
 "author": "AdrenoChrome",
 "citation": "Citation:   AdrenoChrome. \"MDA: Mopeds, Drugs, and Alcohol: experience with MDA & Alcohol (beer) (ID 28779)\". Erowid.org. Jan 9, 2007. erowid.org/exp/28779",
 "substance": "MDA & Alcohol (beer)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "6 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "1 tablet",
   "oral",
   "MDA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28779",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 9, 2007",
   "Views: 15719",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is the story of two friends and their run in with MDA: Myself and one of my buddies (I'll refer to him as B). I have extensive psychoactive experience (Cannabis/hash/oil, Salvia, LSD, LSA, Mushrooms, Mescaline, MDMA, MDA, Cocaine, Ketamine, DXM, 2C-T-7, 2C-B, 2C-T-2..etc) so if a substance isn't crack, meth, datura or heroin (the devil drugs), chances are I've tried it. B had much more limited psychoactive experience (Cannabis/hash/oil, mushrooms, limited salvia experience).\r\nAnyways, I had picked up 3 tablets of what was sold as ecstasy (Yellow Yin Yang, acquired near Detroit), I intended to take two tablets and sell one, but I instead took one, sold one and gave one to B because he had purchased a 24 of Budweiser for me the night before. So, the plan was to save the tablets until the next night, because we had planned on enjoying some quality Budweiser this night.\r\nInstead, I drank a six pack and he had about 1.5 forties of malt liquor (gotta love that Colt 45!). Based on the fact that he's slightly taller and heavier than me, I can assume that we were at similar BAC's when we decided to take the tablets. After popping the tabs, the alcohol went away for the night, or at least until the tab's effects were gone. After about 30 to 45 minutes the roll began. B basically started to get giggly, and a little spaced out. I was beginning to feel the chemical euphoria, and the feeling of 'returning to the real reality' as I call it. The alcohol had stunted our motor control slightly, however, we were both walking relatively straight.\r\nAbout 15 minutes later we had arrived at a friend's house and were waiting for him and a few other friends so we could go to a party. At this point, an acquaintance of B and I rode by on a moped/go-ped. B, feeling the effects of the drug and alcohol quite nicely by now, asked if he could ride the moped. He was allowed to do so, and proceeded to ride (albeit unsteadily) up and down the street, before basically wiping out for some reason or another. B was entirely fine, as he managed to roll to avoid injury, and because the go-ped wasn't travelling quickly.\r\nAt this point, the drugs kicked in quite nicely for me. The world was engulfed in auras, slight tracers, and a wonderful electricity that ran from the ground and up my legs and spine (I knew at this point that I had taken MDA, due to visuals and body effects). When I took a foot of the ground, the electricity stopped...as if I had broken a circuit. According to other friends, B and I both had rather dilated pupils. A group of us then proceeded to go to a party that was to be happening.\r\nI can say that this party was absolutely amazing on MDA. The sounds of conversation were like an exotic, chanting music, and the appearance of the party itself was also amazing as the lights and music synergized and created an experience that I can only describe as nirvana. I had lost track of B at this point, and really didn't care, I was enjoying my surroundings and conversing with others far too much. Also, the fact that I wasn't empathetic whatsoever was a further indication that I had taken MDA, also I wasn't clenching at all (MDMA makes me *slightly* empathetic and rather clenchy).\r\nThe police then arrived at this party as drunken idiots had beaten the shit out of each other in the street. Myself and a small group evaded the police (the entire time I was thinking how awful a substance alchohol is, and how braindead drunks are). My memory is a little hazy as to what happened after this (My term memory is fried due to psychoactive indulgences, lol). I believe that we found a friend who was driving by and we went cruising around, smoking massive amounts of quality organic buds (most likely Jack Herer strain). Music, coupled with the feeling and sights of movement in a vehicle was amazing. I had reached the nirvana I had attained shortly before, I felt as though I was travelling through reality itself.\r\nI had completely lost track of B, and I later found out that he had his own little vignette adventure after evading the police, but I didn't really care to remember the details, I believe it involved him going to a loser-party, and in his drugged state proceeded to fraternize and drink with them (B's not the brightest of lights). My night ended once the drugs wore off, and I was left with an incredible sense of accomplishment.\r\nOverall, I cannot stress enough that MDA and MDMA are both incredible, incredible substances, that have unfortunately been abused by too many. On a sidenote, the following day I looked up the Yellow Yin Yang tablet on www.ecstasydata.org and found out that it was, indeed MDA.\n\n\n"
}