{
 "title": "2C-Energy",
 "author": "Lil Bunny Foo Foo",
 "citation": "   Lil Bunny Foo Foo. \"2C-Energy: experience with 2C-E (ID 28781)\". Erowid.org. Feb 2, 2004. erowid.org/exp/28781",
 "substance": "2C-E",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "21 mg",
   "oral",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28781",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 2, 2004",
   "Views: 11031",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The night started at 11pm, when me and a friend dosed and left for another friend's birthday party.  Everything went as normal, and the trip was coming on fairly slowly, but normally.  Until around 12:30(?) when my stomach felt minor discomfort.  I told my friend who I went with and he gave me a pipe and told me to go to the bathroom.  Well, after much confusion, I realized that I really did NEED to go to the bathroom.  The pot cured the nausea and the trip started to kick in hard.  I read a poem by a friend, which was posted on the wall in the bathroom.  At the end it asks, 'are you hallucinating?'  And at that moment, the answer was 'yes.'  Then I looked toward the door and saw a small sign that said, 'am I dreaming?'  Again, I knew the answer was yes.  But I had in a sense, 'woken up.'  Anyhow, I felt safe, and not in pain, so I left the bathroom and rejoined the party.  I started having a conversation with a friend.  Then I noticed that I could sense the energy that was passing between the two of us, and it weirded me out.  But I was okay until I realized that I could feel everyone's energy.  </p><p>The intensity of everyone's energy caused me to get nervous.  Then the heater in the house turned on, and it smelled of gas.  Instantly, I figured that the smell of gas meant utter doom by way of explosion, so I quickly went outside.  The weird thing about leaving was that it was the 'fight or flight' decision based on a notion that the house would, in fact, explode at any moment.   Outside, I realized everything was okay, and there was going to be no explosion.  So I calmed down and attempted to re-enter the party.  Some kids on the deck were doing this weird cell phone trick and I thought I could feel the radiation.  It scared me, until I realized that it wasn't radiation, but the people's energy that I felt.  All in all, it was extremely trippy, and probably not a good party drug.  But it sure opened my eyes to new things.  Plus, I think I woke up from the matrix for good this time.</p>"
}
