{
 "title": "My Entire Life: Past, Present, and Future...",
 "author": "axel",
 "citation": "   axel. \"My Entire Life: Past, Present, and Future...: experience with Salvia divinorum (10x extract) (ID 28780)\". Erowid.org. Nov 28, 2003. erowid.org/exp/28780",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "144 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28780",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 28, 2003",
   "Views: 7433",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Over the past month or so ive grown incredibly fond of salvia, and have had a variety of experiences. This has been the most impactful so far. </p><p>I settled down with my bong on my basement couch and packed a bowl of salvia. My dog ran past the room and startled me a bit, causing me to spill a pinch of the stuff on the concrete floor (this will come into play later). Took one hit, and got a familiar buzz. I also seem to always get a strange sensation centered in the mouth everytime I smoke the stuff, kind of like my tongue isnt mine anymore yet I still feel it in my mouth. This has become my sign of descent into the familiar salvia territory. </p><p>After my second hit,  I started to feel pressure exerted all around my head and I knew I was  done. I set down my bong and got up. I decided I didnt want to waste any salvia and got down on the floor to look for what I spilled. There was nothing there that I could see and I searched frantically. I brushed my hand over the ground to see if it would help me find it, and instantly all the little particles of salvia jumped out at me and scattered in all directions, which appeared like they were running away from my hand. This shook me up a little bit, and I realized I wanted to scrape my bong. As I was doing this I got a very prolific vision of a family in my mind. Standing in a line, dressed all in suits. This was my family  I told myself internally. But I knew it wasnt. And immediately after this, I connected with my bowl. Not my entire bong, just the bowl. I was the bowl. The bowl was as big a part of me as my entire being. This was mind blowing, but also fleeting. </p><p>I went upstairs to lay on my bed and take in the entire experience, as I was feeling pretty euphoric and didnt want to be so active. As I lay in my bed I realized that I left the tv on downstairs, and the sound of the tv got louder and louder till I couldnt bear it anymore and got up to turn it off. As I walked to the door, I noticed a glare on my door from my window, only this is not how it appeared to me at the time. I saw myself, my life projected onto the door. I saw my past, present and future inside this glare. Well I didnt see it, I thought it, I sensed it. It was absolutely insane. I touched the door and at that point realized it was just a glare. Then began my comedown. I had completely forgotten about my tv and went to check my pupils (I always have the habit of doing this whether it be on salvia or shrooms). They were still dilated pretty big, but the trip was over and I just had a little bit of a stoned feeling. Total elapsed time since first hit: approx. 10 minutes. This was my most enlightening salvia experience so far and I hope to have more like it in the future.</p>"
}
