{
 "title": "My New Favorite",
 "author": "Sirk",
 "citation": "   Sirk. \"My New Favorite: experience with Kratom (ID 28819)\". Erowid.org. Mar 18, 2004. erowid.org/exp/28819",
 "substance": "Kratom",
 "bodyweight": "245 lb",
 "header": [
  [
   "DOSE:",
   "10 leaves",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28819",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 18, 2004",
   "Views: 25768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having read that all the kratom out there is fake, I heard about a company called who claimed that their kratom was authentic and verified by two sources. So I gave them and their product a shot. The company turned out to be fantastic. Their customer service and extras made them the best company I have bought from. Now that I've said that, the bottom line about all kratom out there being fake? What I tried had to be real, and if it wasn't, it is an herb that made me feel like I took a few 10mg oxycodone. </p><p>MINDSET: I was in a good mood, and excited to try the stuff. I had read that it was supposed to have opioid effects, but having tried other herbal products and not getting as much effects as I had hoped, I wasn't expecting much. Boy was I in for a great surprise.</p><p>PREPARATION: First I crushed up about ten leaves. I had read that it can take as little as three and heavy users use up to thirty. So being a bigger than average guy (6'5', 245lbs) I decided to go somewhere in the middle. This turned out to be about two level tablespoons of crushed plant material. I had read somewhere that adding lemon juice to herbals makes the alkaloids survive boiling water, so I did this and let it sit for a little over an hour. I used just enough to cover and make all of the leaves wet. After this I poured about two cups of water into the mix and then put it all in a pan. I brought the mixture to a boil, and then turned it down to simmer (almost exactly medium heat). I boiled it down to about half of it's original volume, then strained the leaf and put the liquid aside. I repeated this process two more times and combined the three cups of liquid 'extract'. I then boiled this down to about one and a half cups (from what I understand you're supposed to boil it down to about 100ml and take it all in one shot, but I couldn't wait). I then drank all of the liquid.</p><p>(NOTE: You can boil it down further to a tarry mixture and add flower and sugar and then eat it. I have not tried this yet. You can also boil it down even further and make a resin to smoke. I have not done this either.)</p><p>TASTE: The taste was very tart, and very strong. It almost tastes like bile, very acidic. I don't want to scare anyone from trying this, but keep in mind that it does not taste good. I tried adding sugar to make it taste better, but I couldn't even tell that I had put anything in it so don't waste your time (it takes long enough already). I just gagged it down and had salt and vinegar pringles to chase it. I drank it in about three gulps. After that I ran a little water in the cup and pot and got all of the stuff off the sides that I could, and drank that. It didn't taste much better, just not as strong. I would recommend boiling it down more than I did.</p><p>EFFECTS: The effects seemed to come on around half an hour after I drank it, maybe a little sooner.</p><p>First thing I noticed is a feeling of great euphoria and energy. Not really a messed up feeling, but something was starting to happen.</p><p>After an hour I noticed that I was feeling like I took a painkiller or two, and I was very happy @ this point.</p><p>Soon after that I REALLY felt it. I felt as if I had popped a few painkillers. I remember thinking that I shouldn't drive on this stuff, and I remember being very relaxed and confident about things (normaly I have mild anxiety about social situations; this was completely gone). The strong effects, or 'peak' if you will, lasted about an hour or two, maybe a bit longer (I didn't look @ the clock, I was just enjoying myself). I could still feel it a little the next morning (I drank the liquid around 5:00 in the afternoon).</p><p>CONCLUSION: I love this stuff, and it helps me a lot with my anxiety. I have tried it without lemon juice and it tastes MUCH better, but I don't think that the effects were as strong. More experimentation is needed.</p><p>WARNING: On Thanksgiving I took the equivalent of four tablespoons of crushed dried kratom leaf, and I was MESSED UP!! Not in a completely good way. It was hard to keep my eyes open and focus. I also had the shakes. My hand (and it felt like my body) was shaking pretty bad. I also had nausea, bu it all passed and everything turned out good. Just a word of advise, start off with small amounts and go from there. I will not be taking that much again, unless my tolerance gets to that level. Some places suggest that you use a whole ounce or half of an ounce, and that is TOO MUCH. @ least for me it was, it could have been the lemon juice (I have not seen that suggested for kratom) or the potency of the leaf I got.</p><p>Good luck and happy experimentation!</p>"
}
