{
 "title": "Stuck in a Time-Loop",
 "author": "Apex",
 "citation": "   Apex. \"Stuck in a Time-Loop: experience with Mushrooms & Cannabis (ID 28833)\". Erowid.org. May 30, 2007. erowid.org/exp/28833",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28833",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 30, 2007",
   "Views: 5211",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night began as the greatest mushroom trip and ended with absolute HORROR.</p><p>I ate 3 grams and took a shower.  It started to come on in the middle and when I got dressed I talked to a few people and everything seemed to have a nice gleam to it.  I walked around and was getting that nice 'seeing everything for the first time' feeling and was just feeling SO good.  I got it in my head to go on a mission of some sort (a vision quest) and I proceeded to bundle up in warm clothes, and as I was putting each layer on and then my boots, I felt like a warrior getting ready for something BIG.</p><p>I also decided that I needed two extra grams of shrooms, so I got those and everything was set. I grabbed two bottles of water and headed out into the bush.  I followed animal footprints and talked to myself the whole time.  I finally got to a log and sat down.  I was tripping VERY hard and was just sitting there hearing all these sounds around me and just feeling giddy.</p><p>I ate the two grams and decided that my vision quest would not happen tonight because drugs can't be involved - too distracting.  As I was walking back to the campus the other two grams began kicking in. I was absolutely OUT THERE.  I smoked a large joint with two people in a giant snow fort and I was just talking away not making any sense really.  When we left, I was starting to go down on my peak, I walked ahead and went to my room alone - that was the BIG mistake.</p><p>I sat down and for the next 3.5 hours I was stuck in a time-loop.  I cannot describe the absolute frustration and mental exhaustion I felt - I thought my brain would literally explode or I'd have a stroke.  Every little thing I did seemed to take an hour because I'd get so distracted by one little thought and everytime I'd get on a tangent thinking about it, I'd forget where I was in the thought and would have to start over.</p><p>I tried reading the things I wrote when I was peaking and pounding away on the keyboard, but I'd get to the end of the line and couldn't find the next - I'd end up reading the same few lines 5 times.  My head actually began to hurt and throb, and I knew that I had to get out of my room and talk to people.  Instead of a plan, it became another loop which I would think and think about and never go through.  I told myself the only way out of it was to constantly do things.  So I took my boots off and said 'I'm getting a glass of water then I am hanging out with people' but instead I ended up on my bed thinking the same thoughts over and over.</p><p>A movie would help, I thought.  I spent what seemed like an infinite amount of time deciding a movie (with a hundred thoughts distracting me a long the way) and when I finally watched one, I would contemplate each sentence, so it was another loop.  Finally I tried to sleep, and surprisingly I was able to after a while.  The begininng was such a great trip, but the end was absolutely horrible, and although it's just a memory and it's impossible for me to really empathize with what happened last night, I just know that it was NOT fun at all.</p>"
}
