{
 "title": "Astoundingly Slow Time-to-Effect",
 "author": "Nonaht Leyte",
 "citation": "   Nonaht Leyte. \"Astoundingly Slow Time-to-Effect: experience with Fentanyl (ID 28861)\". Erowid.org. Mar 1, 2004. erowid.org/exp/28861",
 "substance": "Fentanyl",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "50 ug",
   "sublingual",
   "Pharms - Fentanyl",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28861",
   "Male",
   " ",
   "Not Given",
   "Mar 1, 2004",
   "35275",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: Roughly a year ago I was switched to Duragesic from Lortab 10, for severe pain due to nerve damage at C6.  It is important here to realize that I am not opiate naive, as I have been taking high dose opiates for several years now.  Because of this, my reports may or may not be valid for the population at large.</p><p>Effects: Duragesic is a totally different experience from anything else in the narcotic class.  What makes it different are the delivery method - the transdermal patch.  Duragesic works by allowing the fentanyl to create a pool in the subcutaneous fat, which is then slowly dispersed throughout the rest of the body (as part of the normal circulatory process).  Because of this, it has an astoundingly slow time-to-effect: 16 hours or so is not at all uncommon.  As a pain killer, I'd rate fentanyl as half way between 2 Lortab-10's and 6mg of IV MS04 (morphine).  As a recreational drug, fentanyl just sucks ass!  It's a potent nauseant, as well as a potent constipator :-(  It also has a really nasty and disturbing habit of allowing you to 'forget' to breathe.</p><p>No, I am not kidding: the first couple of weeks I was on this stuff, I had to actually remind myself to breathe!  A lot!  My wife was actually afraid I'd fall asleep and die cause I wasn't up mumbling 'breathe. breathe...'.  Over time this effect seems to disappear, but it's *really* scary at first.</p><p>The above all refers to Duragesic used as directed.  There are also ways of using Duragesic NOT as directed.</p><p>I cut the corner off a patch, and am left with a gelatinous mass of about 1/4cc.  This mass holds whatever total dose was prescribed.  This can be smoked directly in a glass pipe (like crack) - but be *extremely* careful - the literature is *loaded* with people who got dead from smoking the gel!  An easier, safer, and more enjoyable way to 'use' the contents of this patch is to squeeze out the gel, and then divide it into roughly 4 'doses'.  This is not as easy as it sounds because of how little there is, but it can be done.</p><p>I take each of these 'doses' and slide them under my tongue, leaving the dose in place for about 15 minutes.  I will not likely notice any effects from a dose in less than an hour or two, so must go slow - don't want to DIE from being impatient!  In my experience, I don't need more than two of these to reach full narcotization.</p><p>Sublingual fentanyl is a slow and dreamy experience, 1/2 hypnotic, and 1/2 benzodiazepine like.  Very gentle, smooth, and 'comfortable' if that makes any sense.  I likely get sleepy as it wears off (about 4 hours later), and it leaves me with a *profound* hangover the next day.</p><p>Duragesic/fentanyl is one of the most potent opiates available to man - treat it with a hefty respect, and it will return the favor.  Abuse it with arrogance, and we'll be reading about your carcass in the papers the next day...</p>"
}
