{
 "title": "Mixed Feelings",
 "author": "Anon",
 "citation": "   Anon. \"Mixed Feelings: experience with LSD (ID 28869)\". Erowid.org. Oct 21, 2006. erowid.org/exp/28869",
 "substance": "LSD",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28869",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 21, 2006",
   "Views: 4302",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was planning on taking a hit of 2C-I at this show in NYC.  A friend of mine brought it down in a big bottle of vodka, so I transferred it to small, airplane sized plastic bottle.  Unbeknownst to me, the bottle's cap was cracked, and the whole thing spilt out into my pocket. I was pretty bummed.  But we got to the show, I was having a good time, and I decided to hunt around for something else I could do, maybe a hit of shrooms.  Me and my friend searched the entire theatre, but everybody came up dry.  Eventually, we stumbled upon this man, perhaps in his 40's, who my friend began to chat with.  The guy didn't have shrooms, but liked my friend enough that he decided to rip of a few hits of acid from his own stash and give them to us for free.  Unlikely, but it happened.</p><p>I wasn't really prepared to do acid, I hadn't thought I was going to, but I figured I wanted something to do, and although I didn't know exactly what the dose was, it was sure to be low, so I dosed it.  This was approximately 9:00, just after the first set.  We had orchestra seats, but the sound was better up in the balcony, so we headed up there to trip, with a few of our other friends.  I was a little nervous, but I wasn't feeling anything, even by the end of the show.  I realized I had trouble holding my cigarette, but wrote it off to excitement (I was grooving the music pretty hard).  Remember, this is my first experience with acid, or even any hallucinogen for that matter.  I noticed a energy boost, a mood elevation too, but like I said, I wrote it off to just having a good time at a good show.  I didn't have any visuals, so I didn't think I was tripping.  </p><p>So the show ended(11:00), and to tell the truth, even without thinking I was tripping, I felt more connected to people.  Lots of friends from my school were there, and I just felt like saying 'hi' and hugging all of them.  Anyway, when I got outside where the lights from the show weren't flashing and the atmosphere was a little more stable, I started to feel something.  It was somewhat like the feeling you get when you've been in a room with a strobe light...kinda zonked.  People began to tell me my pupils were HUGE and I accepted that I was tripping.  I still didn't really have any visuals, but things did look a bit different.  </p><p>Lights shimmered a little and seemed brighter (makes sense if my pupils are big).  More than anything else, I noticed a good deal of confusion.  Trying to get into the subway with the ticket machine broken was ridiculously difficult.  The door some people walk through to get OUT of the subway opened...and somehow I ended up on the other side, and not getting caught by the cops (lucky me).  </p><p>Also, I couldn't stop smiling or laughing, non-stop.  I felt good...I felt...spun.  I was tripping.  I was a real head trip, no visuals, but I was really in a different state of mind.  I was waling around New York City, looking at the sky, the sky-scrapers, and just talking to people on the street, having a good time.  I smoked a lot of cigarettes too, it felt good.  So that was good, I guess...but it was also a little uncomfortable.  I had so much energy I didn't know what to do with it.  It was good at the show, but on the train and trying to go to bed for two and a half hours was pretty annoying.  I ended up reading Dostoyevesk's Crime and Punishment, which was pretty awesome, especially while tripping.  </p><p>When I woke up the next morning, I was kinda burnt.  I wasn't really tired (I was later in the day) but I was different. I saw things differently, so it seemed.  I was thinking differently and I felt a stronger connection to reality.  It's really hard to explain.  It wasn't a bad experience at all, but it wasn't 'glowing'.</p><p>So that's it.  It wasn't awesome, it wasn't terrible, it was good.</p>"
}
