{
 "title": "An Unfortunate Experience",
 "author": "Max",
 "citation": "   Max. \"An Unfortunate Experience: experience with Opioid (Unknown Type) (ID 28894)\". Erowid.org. Mar 8, 2007. erowid.org/exp/28894",
 "substance": "Opioid (Unknown Type)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "5 tablets",
   "oral",
   "Opioids",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 28894",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 8, 2007",
   "Views: 3641",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have experimented with pain killers before and always had a great time, however one experience last winter left me swearing them off forever. It all started one night when my girlfriend called me up and said she had obtained some pain killers. She said she didn't know what kind they were, whether they were oxycodons, codeins, or hydrocodenes, but that she had about 10 and had dissolved them in a bottle of poweraid. We had taken them before and found that they greatly enhanced sexual experiences between the two of us, so I said I'd be over in 20 minutes. I hopped in my car and drove on by.</p><p>Now her parents hate me so she had to meet me at the op of her driveway. She brought the bottle and we drove around talking and drinking it, sharing it equally, and pretty soon it was gone. I parked in the parking lot of a deserted playground, and we started making out.\r[Erowid Note: Driving while intoxicated is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Pretty soon this advanced to her becoming nearly naked, and me with my pants still on. It got really hot and steamy, and like teenagers will tend to do, instead of rush things we just sort of began grinding and dry humping. I was feeling really good from the drink, sort of like a feeling of contentment and overwhelming love for my girlfriend. My body had become numb, and neither of us could feel any cold, despite the fact that we were nearly naked and it was below freezing outside. This numbness is what caused all the problems for me.</p><p>Apparently, in the heat of passion, my engorged dick came out of my boxers and started rubbing agaisnt the inside of my fly. We were going at it so furiously that the constant rubbing of my dick agaisnt the zipper literally tore into my dick. By the time we were ready to get serious, my girlfriend took out my dick, and looked down at it in her hands. All I remember her saying is 'Oh, shit.' Then I looked down, saw all the blood and fainted.</p><p>I woke up a few hours later in the hospitol. My girlfirend, despite not having a license or knowing how to drive a stick, Managed to shove me into the passenger seat and drive me sixty miles to the hospitol. They sedated me at her request, because no one wanted me to come down off the high to this pain. I was out for about 8 hours, and woke up to what was surprisingly little damage, only 7 stictches. I could hardly pee for a couple days, and definately no sexual contact for about a month. Defiantely a lesson well learned.</p><p>There was a small pot of gold at the end of the rainbow though, the hospital prescribed me a ton of valium and percocet. The irony is not lost on me.</p>"
}
