{
 "title": "Food Grade Nitrous Oxide?",
 "author": "Pastry Chef",
 "citation": "   Pastry Chef. \"Food Grade Nitrous Oxide?: experience with Nitrous Oxide (ID 2890)\". Erowid.org. Sep 8, 2000. erowid.org/exp/2890",
 "substance": "Nitrous Oxide",
 "bodyweight": "300 lb",
 "header": [],
 "footer": [
  [
   "2000",
   "2890",
   "Male",
   " ",
   "Not Given",
   "Sep 8, 2000",
   "41321",
   " "
  ]
 ],
 "report": "<p>Nitrous Oxide is one of those psychoactive substances, that used to be accessible in pre drug war times.  It was a source of amusement for people who could inhale it for a few pennies at the Laughing Gas stand present in traveling amusement shows. Things changed however, and like most potent psychoactives, use of Nitrous Oxide for human consumption has been restricted to controlled medical applications. Of course that changes nothing in the human equation. People still want to feel altered, just as it was around the turn of the 19th. Nitrous Oxide is readily and legally available in food grade as whipped cream maker cartridges - whippets.  At first look it seems like a good source of pure N2O.  However this is not so clear in light of following findings.  EZ whip brand cartridges were examined in this case.</p><p>The notion of safe food grade Nitrous Oxide quickly turned into horror as the taste became clearly toxic-chemical with a metallic hint. First thoughts were that those cartridges might contain Nitrogen Oxides other then N2O. This was quickly discounted after a quick online conversation with a chemist, as they are very toxic in small amounts and have vivid colors unlike Nitrous Oxide. Color of the gas expelled from cartridges was examined. Nitrous  is a colorless gas, so nothing should be visible, however a fine vapor like mist was observed escaping from the opened whippets. Next step was to collect enough of the impurity to be able to examine it.</p><p>A large amount of cartridges was opened in such a fashion, that the gas passed via a filter. After opening about 20 whippets a substantial amount of black oil-like residue was collected. After sensory examination, the smell and texture of this residue was determined to be very similar to machining coolant sludge,  which fits with how cartridges are manufactured. It appears that the coolant residue is vaporized upon opening the whippet and is most likely to be inhaled in large quantities. Of course this theory would have to be tested by professional lab analysis, but it seems like EZ Whip brand cartridges can contain various degrees of impurities that are result of poor manufacturing hygiene. It is likely they are not thoroughly cleaned off after manufacture of casings.  Coolants used during metal machining are made with serious toxins, and they appear to be present in EZ Whip cartridges. Here is a picture of what you should NOT buy regardless of the purpose. </p><p>This brand of Whipped Cream Maker cartridges is not only unfit for inhalation, but is also not food grade and should not be used to make Whipped Cream (that is unles you like factory coolants in on your pie)  Its a clear example of how The War On Drugs can be a cause to dangers that were not of concern in the late 19th century, and add to the drug problem. Thanks to War On Drugs there are more dangers to Nitrous use then the inherent problems associated with the gas itself. So much resources are used up on stopping people from experiencing altered states other then alcohol and tobacco, that quality of foodstuffs such as Whippets used to make Whipped Cream is overlooked.</p><p>Beware what you consider food grade Nitrous Oxide, because thanks to sleepiness of the governments foodstuff quality control, you might be getting a bit more than N2O.</p>"
}
