{
 "title": "Ipracetin Schmipracetin",
 "author": "Phat Stax",
 "citation": "   Phat Stax. \"Ipracetin Schmipracetin: experience with 4-Acetoxy-DiPT, Cannabis & Alcohol (ID 28910)\". Erowid.org. Jun 17, 2004. erowid.org/exp/28910",
 "substance": "4-Acetoxy-DiPT, Cannabis & Alcohol",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "25 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "(powder / crystals)",
   " ",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 28910",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 17, 2004",
   "Views: 10629",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI took somewhere in between 20 and 30 mg of Ipracetin HCl at a party. I began to feel odd as I was drinking the water.  About 10-15 after I was done drinking the water I began to notice patterns forming on the ceiling.  I was sitting on the couch.  Things just kind of elevated from that.  Not much in the way of closed eye visuals.  Movement left visual trails. I drank two beers before I took the stuff.  I drank two beers before I took the stuff.  I drank two beers over the course of my trip as well.  The alcohol had slight effects, and made me colder than I may have gotten without it.<br>After an hour I started feeling like the stuff was hitting harder.  Same things visually, but the drug would hit me in waves, giving me a powerful feeling of sedation, and it felt as if my eyes were being closed by force at these times.  I would be talking to a friend and would have to stop in mid-sentence because I could no longer remember what I was talking about and would be too overtaken by the wave of... that strange sensation. I don't know what to call it.  <br>At some point a friend called me aside, and we smoked some marijuana.  I was confused about what my two companions were talking about while we were smoking.  I got the impression that they were making fun of me, but I really couldn't know.  When we were outside, this was the most visual part of my trip. They were both smoking cigarettes and the cherries looked amazing as they moved them about.  They were glowing and sending trails all over the place - beautiful looking trails.  All movement made trails and I could see impressions of patterns in my feild of vision. I had to go back inside soon because I was very high, and I couldn't make sense of anything they were saying.  <br>I was a little cold the whole time, and every once in a while my body would get little muscle spasms that I couldn't control. After somewhere around 4-5 hours into it, I noticed the effects were fading a lot.  I was able to talk and act normally during this 'coming down' period, but I don't know if I can say the same about the rest of the trip.  I did a lot of sitting down.  I got a bit overly paranoid a few times with knocks at the door, thinking it would be the cops, but it never was.<br>Overall, it was an enjoyable experience (except for the intake of the substance part) and I'd like to try this stuff again.  I'm not too impressed however. I'd say there are definitely better compounds out there. If someone were to sell Ipracetin, I would pay absolutely no more than 10 dollars for 30 mg.\n\n\n"
}
