{
 "title": "Most Noticeable Effects",
 "author": "kaz",
 "citation": "   kaz. \"Most Noticeable Effects: experience with 2C-B (ID 28913)\". Erowid.org. Feb 2, 2004. erowid.org/exp/28913",
 "substance": "2C-B",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-B",
   " ",
   "  ",
   "insufflated",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2003",
   "28913",
   "Male",
   " ",
   "Not Given",
   "Feb 2, 2004",
   "13952",
   " "
  ]
 ],
 "report": "<p>During a period of three months I had tried 2c-b at various doses, never in combination with another substance (excluding one hit of nitrous and a spliff at a rave). I will give a quick outline of the most noticeable effects:</p><p>'Buzzing' - the inherent force of this substance is a buzzing, felt in the body, but follows through in all senses, both visually and is even audible at the higher doses. This happens in waves, usually the effect is subdued, but then it starts ramping up, peaking for a short while and then goes down to the 'base' level. I find it can be extremely pleasureable on both visual and physical levels, like a wave of colorfull pleasure passing through the body.</p><p>'S'-Shaped Time - The way this substance distorts the concept of time is that it gives me a strong feeling of being connected both to a period before and a period after the moment I'm in, as if I'mstanding in the center of the 'S' and can see the two branches far away from me very close. This is felt when the senses are out of phase with each other (for instance, I may sometimes spit and only a moment later see the spit moving).</p><p>Notable psychedelic feature: Nonlinear patterns are something that I am very susceptible to, finding the glitches and escaping from the every-day logic fascinating (music like Squarepusher's is very enjoyable, word games with all kinds of connotations to things that happened earlier come naturally and are very good fun).</p><p>Audio distortions: Background noises and everything that's heard is increased in volume and not one bit more intelligeable. This can reach very disturbing and sometimes scary levels (at a 50mg dose I wouldn't recommend a shower even though this substance is a very sensual one). Other than this, sound is given a more warm and earthy feel to it, somewhat like mushrooms.</p><p>Small doses (under 5mg, insufflated): Little effect other than an instant physical buzz, somewhat distorted way of focusing... maybe a bit easier to feel empathy. Very nice for sex, definately makes the experience more impressive. I have done these amounts approximately seven times, and the effects while were definately there were not overpowering in any way. No nausea or physical discomfort. Not limiting actions in any way, even though I'd recommend not to drive, just to be on the safe side.</p><p>Medium doses (10-20mg oral, 5-10mg insufflated): This is where this substance shows its psychedelic face for the first time. Colors are significantly enhanced, slight visual distortions. Have dosed in these levels four times. Coordination is slightly affected, attention span is somewhat shortened. I have experienced no nausea at these levels.</p><p>Large doses (20-30mg oral, 15mg insufflated): Spectacularly visual, clean thought process, sensual, mishcievious. Strong body load though. Eating on this substance is NOT recommended, even drinking too much water is felt in the stomach. Light distortion of time is appearant. The 'buzzing' quality of this substance passes through all senses in waves. An ability to connect very well with other people, it is still possible to communicate. I have tried this level three times.</p><p>Ego-dissolver doses (50+mg oral, 25+mg insufflated, 20mg oral and 15mg insufflated were my three tries in this): Visuals are no less than astounding, background noises are amplified. Time is not stretched very much when compared to other psychedelics but is definately distorted. While this does reach a very potent levels and can dissolve the ego this way, it remains shallow on both introspective and analytical levels.</p><p>In summary, this is one of the easier-to-handle psychedelics, not nearly as agressive on the thought process as LSD or even mushrooms, a very fun one that offers a lot of visuals. Not something I'd expect to have a truely spiritual experience on. I will add that this substance has never caused me to vomit or have stomach cramps, but the physical tension was more noticeable in my later experiments with this substance (something I know happened with at least one other person), so I would recommend keeping a month between experiences on this substance, just to cleanse the body fully before trying it again.</p>"
}
