{
 "title": "LSD and Celexa (citalopram HBr)",
 "author": "Walken Around",
 "citation": "   Walken Around. \"LSD and Celexa (citalopram HBr): experience with LSD (ID 2891)\". Erowid.org. Nov 24, 2001. erowid.org/exp/2891",
 "substance": "LSD",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:45",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "30 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2891",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 24, 2001",
   "Views: 13069",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI recently took a dose of liquid LSD while on Celexa, a prescription antidepressant.  I have been taking 30mg of Celexa daily for about nine months.  Celexa is an SSRI, and 30mg is a fairly low dosage, especially for my body size.</p><p>This was the first time in approximately 4 months that I had used any psychoactive drug.  For me, the 'speedy' feeling with LSD begins about 30 minutes after dosing, with very obvious muscle tensing and the onset of visuals occuring at about 45 minutes.  </p><p>I took an initial dose of what was equivalent to approximately one tab.  This time, however, after 45 minutes I felt slightly giddy, but otherwise felt none of the normal reactions I have to acid.  A friend of mine who dosed at about the same time (who does not use antidepressants) reported the same thing, at which point we both had another dose each.</p><p>After another 30 minutes my friend began experiencing his normal reaction to acid, however I still remained relatively unaltered.  The giddy feeling remained, a sensational vaguely similar to GHB but muted.  After about 2 hours I felt almost normal.</p><p>After consulting some knowledgable people, it seems that my reaction was a normal interaction between hallucinagens and SSRI's.  </p><p>An addendum to this report is that, three days later, I intentionally skipped my daily dose of Celexa (which is fairly harmless at such a low dosage) and ate ~3-4g of mushrooms.  I felt very strong disassociation and intense visuals.</p><p>In conclusion, it seems that even a very small dosage of Celexa can dampened or cancelled an LSD trip entirely, while skipping one dose resulted in a normal mushroom trip.  Again, I take a small dose of Celexa, and I do not know if skipping a larger dose will have other side effects.</p>"
}
