{
 "title": "In The Desert On Cement",
 "author": "Shaggy",
 "citation": "   Shaggy. \"In The Desert On Cement: experience with Salvia divinorum (10X extract) (ID 28926)\". Erowid.org. Jun 16, 2007. erowid.org/exp/28926",
 "substance": "Salvia divinorum (10X extract)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28926",
   "Male",
   " ",
   "Not Given",
   "Jun 16, 2007",
   "Views: 1834",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Today I had the most mindblowing experience of my entire life. I recently ordered a vial of 10x Salvia and it came in about 2 days ago. Last night after work while I was alone in my room, I packed maybe 1/15 of a gram into my water bong and ignited it using a regular bic lighter. I laid down on my bed and stared at my windows. Within 20 seconds of taking the hit, I felt like I had eaten about 2 grams of mushrooms and was in the coming up stage. Mushrooms are the only other trip I've been on. This feeling totally subsided within 20 minutes. I could sense that there was great power in this drug.</p><p>I woke up today and started getting ready for school. My friend Alex called me and asked if I wanted to skip school and give the salvia a shot. Being that I hate school, I had no opposition to this suggestion. We met up and drove around for a couple hours since my mom didn't leave for a couple hours after I left for school. We got something to eat, smoked a joint, and picked up a butane lighter. When we got back, my friend Alex eagerly measured out a bowl (About 1/14th a gram) and smoked it in the bong using the butane lighter. He sat down and began to laugh hysterically. When I saw the fun he was having, I packed my dose in the bong and took my hit.</p><p>I remember holding in my hit and laying on the floor where I had a pillow that was pretty dirty from my hardwood floors, it felt really sandy to me and my clothes began to feel extremely uncomfortable and tight-fitting. I no longer wanted to lay down on this pillow. So far, only about 10 seconds had passed. I stood up and thats when it hit me. Like a train. My entire field of vision kept flashing and twisting. The best way I can explain it I guess was that it was like a strobe light was on and everything was spinning. The flashes began to speed up and I walked over to my bed which Alex was still tripping on. I grabbed a pillow from the bed because I guess I knew I was about to go down hard. I fell to my knees and looked around my room.</p><p>I remember that it felt like a dream or a nightmare, but I had not the slightest clue who or where I was, nor did I have any clue I had taken any sort of drug. I collapsed onto the pillow on the floor with my eyes closed. I'm not sure if I was conscious or not, but I was lying on a cement square about 6 cubic feet somewhere in a vast desert. My friend Alex was not even looking at me, but laughing hysterically and I perceived this as a great voice miles above me laughing at me like I was a freak. I began to laugh uncontrollably with the voice above me but I was nearly shitting my pants with fear. I began to come back to reality. Here are my thoughts exactly:</p><p>'I'm Kyle. That's Alex over there and he's laughing because he smoked Salvia. Wait I did too. I wasn't really in the desert. Wait, what the fuck just happened to me?'</p><p>Little by little I began to piece together what had happened to me. This was the most intense experience I've ever had and I've been known to eat 4 1/2 grams of mushrooms like it was candy. I'd like to do it again I suppose, I think I might do it this weekend. If it's worth writing about, maybe you'll hear from me again, this time knowing what to expect. I guess I kind of underestimated Salvia. If it's legal it can't be that bad right? Wrong. I don't recommend trying Salvia if you haven't tripped before. I have and it still took me for a ride.</p>"
}
