{
 "title": "Hopeless Case",
 "author": "amr",
 "citation": "   amr. \"Hopeless Case: experience with Heroin, Codeine, Ephedrine & Carisoprodol (ID 28963)\". Erowid.org. Jun 27, 2007. erowid.org/exp/28963",
 "substance": "Heroin, Codeine, Ephedrine & Carisoprodol",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Heroin",
   "(daily)",
   " ",
   "  repeated",
   "oral",
   "Codeine",
   " ",
   " ",
   "  repeated",
   "oral",
   "Ephedrine",
   " ",
   " ",
   "  repeated",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "Cannabis - Hash",
   " ",
   " ",
   "  ",
   " ",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "28963",
   "Male",
   " ",
   "Not Given",
   "Jun 27, 2007",
   "Views: 26590",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I really dont know why am I reporting my still going experience but I think that the shit Im into is so fuckin deeeeeep. as im calling myself a hopeless case.</p><p>my story began when I was 16 I use to smoke weed ocasionely with my friends in the club and then  started to take some ephedrine and codein (in my country we have a medicine called codaphine which is magic) then I started to make collections to satisfy my fuckin brain so with the codaphine (codein&ephedrine) I started to take somadril which is a muscle relaxent and contains corospradol which is perfect when mixed with codein and then smoke some joints of weed or hashish to high my velocity to the peak, and no need to tell how much I loved my life in this period I was doing this shit daily for about 5 years then a friend of mine convienced me to try the heroin for the 1st time I was 21, the heroin was black shit, so I got the fuckin shot and went directly to heaven, that when I started to realize its the best drug ever god made I explored it more and more, start to train on shooting in my poor arms, I always got company, so we use to inject each other then everyone was on his own (now Im a fuckin doctor) I never been satisfied from snorting or inhaling, just direct injection into my left hand master vain.</p><p>the more I use to take heroin the more I realize how I get to be sick when I dont take a shot daily so I got freaked out and decided to take heroin one day then codein the next day  and then heroin the next day and so on.</p><p>unluckily it got worse, one day I took rehbanool (roche) then heroin which is the mother of all high times humanity invented, but some how I convienced myself that I wasnt high enough so I went and got some codein ephedrine somadril (the magic cocktail, I was so fucked up until I was suddenly blacked out and I found my self next day in a hospital surrounded with my family (whom by the way didnt know anything about me taking drugs). the doctor told me he found every kind of drug in my blood test, which paniced my parents so the decieded to enter me a rehab. 16 days and I was out, now I got to be more carefull, haaah</p><p>1st day out of the fuckin rehab I was shooting, more and more and more, buck to my junk life so I entered another rehab after 2 years (I was 24) my parents were so happy that I took the decision myself, hahh</p><p>i use to steal drugs there (tramadol, contramal, amadol, diazepam, alprazolam, farcozepam. bromazepam, cogantine and any useful drug I found on my way) I stayed for 4 months then here we go again Im free back to my life out there without heroin this time, I tried to put myself into some new experiences so I went to partys with my friends, began to take exctacy, I even use to make some shoping from amsterdam anually (exctacy, cocain, acid, hashish) then I discovered that there is something missing...</p><p>uppers are good but boreing and I need a downer at the end of the day to chill out and sleep so im back to codein heavy then offcourse to the mother of all drugs HEROIN, </p><p>not to mention the shit I have been doing to get money from stealing from my parents, selling my stuff, dating some dope girls to get myself a shot and company (which is a disaster)</p><p>then I decided thats enough Im 25, and Im still standing in the age of 16, really I am a fucked up loser so I stayed clean for 10 days as I was doing a 3omra in saudia arabia (a visit to mekka) that was my last hope..... ... I was doing good I prayed alot and asked god for help as I was viting him in his own home in saudia I prayed alot really I felt like a normal person which I rarely feel these days...but...</p><p>guess what...</p><p>the day I came back to egypt I was fucked up by a hit......, I knew it I cant live without getting high.</p><p>I did everything I could to be a normal happy person but there is no way its a dead end, now Im back to daily heroin for almost two months my parents starting to realize that Im a hopless case, which I was sure that I am Im back to my dirty world where I trully fits, everyday I got a fuckin hit, dont ask me how I lost the tast of life, I lost a lot of friends, I hurt my family badly ..whom I think they will die because of me ..the older loser in my brothers and sisters. my life is fucked up again I need to stop thinking for a minute</p><p>I cant, .. I got pain in my stomach now, I hate when this shit happens, sometimes I think about suicide ...ending my misery life...maybe this will end my parents suffering and embaressing ...oh my god Im in fuckin pain I sold my soul to the fuckin pleasure of heroin... which by the way is decreasing now Im tastless,, useless, junky HEROIN -------------THE CYCLE IN WHICH I CANT EXIT NOT BECAUSE OF ADDICTION OF SUBSTANCE ONLY BUT ALSO BECAUSE OF ITS EXTREMELY GOD TOUCH FEELING -----yeah its like a touch of heaven </p><p>shit</p><p>I need to end my miserable life</p><p>Im sorry for everyone I hurt, embaressed or fooled  but believe me thats not the real me.</p><p>amr the addict</p>"
}
