{
 "title": "Pretty Difficult to Not Do Again",
 "author": "Billy Bob",
 "citation": "   Billy Bob. \"Pretty Difficult to Not Do Again: experience with Heroin (ID 29045)\". Erowid.org. Feb 23, 2006. erowid.org/exp/29045",
 "substance": "Heroin",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Heroin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29045",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 23, 2006",
   "Views: 71396",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have done a rather extensive list of drugs over the last couple years and only one class has ever seemed to cause a problem.  Not surprisingly to most the group in question is opiates.  In the past I have eaten my share of Vicodin, Percocet, and even sniffed a fair amount of OxyContin.  Over a period of a few months my tolerance boosted up to the point where I was taking about 30-35mg of any of those substances to have a good time.  It became rather difficult to stop taking these drugs and eventually I found myself using others such as methadone and even a fetanyl patch at one point.  Fortunately I was eventually able to give them up, presumably after some introspective mushroom trips where I realized how inferior they were compared to my drugs of choice -- hallucinogens.</p><p>This was about six months ago -- and in the meantime I've been completely clean of all opiates.  This is not to say I've been drug free.  So at any rate, I stumbled upon the queen mother of all opiates recently.  I have been exposed to H many times in the past and turned it down do to its incredible stigma.  Apparently desperate times lead to desperate actions as I really dropped the ball here and gave in.</p><p>The first time I tried it was the cliché 'freebie' and it was a pretty small amount.  I bumped about half of it, waited a minute, and then did the rest.  The first thing I really noticed was that it makes me sneeze.  It was a real pain in the ass as I feel some of the powder may have flown out of my nose.  Definitely not all though as a few minutes later I tasted the initially unpleasant but now much anticipated taste of it in the back of my throat.  This was shortly followed by a moderate opiate buzz representative of eating many Vicodin back in the day.  All in all it wasn't that impressive compared to snorting large amounts of OCs (say around half of an 80mg pill).  I basically just spent the next few hours very content at doing whatever.  Playing video games and just spending time with a friend was suddenly not so boring but a great time.  I later went to a movie thinking it had completely worn off, but when I got up to leave noticed my body felt incredibly relaxed and I was in a great mood as I left the chair I had sat in for hours.  The trouble occurred when I woke up the next day --  just after trying it once, life seemed dull again and I was really looking forward to doing it again.  I had reverted back to the old days of abusing pain pills, but now it was heroin; son of a bitch.</p><p>Sure enough two days later I decided I needed to get wasted so I contacted the dealer to get a 'bag'.  Ended up getting two thinking I'd use about half of one and save the rest for a much later date.  That was rather foolish and as the night progressed I ended up doing both of the bags.  I felt it pretty hard but no puking or nodding off or anything like that.  It was pretty similar to a strong OC buzz yet again but this time I did it throughout the night for several hours.  During this time I just watched a movie and felt great.  Nothing amazing like the feelings of ecstasy but hell I like it more.  The real hell was waking up the next day and being miserable.   It is now two days later and I can't wait to do it again.  I'm forcing myself not to and it's pretty difficult.  I really don't recommend anybody trying it as I consider myself to be an amazingly responsible drug user and haven't let them take control of my life but heroin is the closest to doing that of anything.  Much closer than alcohol, cocaine, or any other addictive substance that I've tried.  This is just after doing it twice also, whereas I've done other drugs at a much higher frequency with no sign of addiction whatsoever.</p>"
}
