{
 "title": "I Got Sick",
 "author": "James",
 "citation": "   James. \"I Got Sick: experience with Cannabis (ID 29052)\". Erowid.org. Jun 28, 2007. erowid.org/exp/29052",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 29052",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2007",
   "Views: 2488",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am 20 yrs old now and started smoking pot regularly at the age of fifteen. 5 yrs ago back in my freshman yr of high school I was smoking everyday. Then one day the weed fucked me up bad. I was smoking with a group of my friends after I toked I new something wasnt right. Since it was a pretty big blunt, I figured I smoked too much and id just wait until the effects wore off. <br>I cant really remember but I dont recall the trip being that dramatic. However, later that night I wasnt coming down. I felt weird. disconnected from my body seeing fuzzyish type things in my vision and had the strangest sensation which I can only describe as a dulling of my entire body. It was like I could still feel my body but my sense of touch was all messed up. And I had this awful pressure behind my eyes. My vision and equilibrium got screwed up also. I couldnt look in the distance with out getting dizzy and being overwhelmed with this evil sickness. Id have to close my eyes it didnt go away after a couple of days so I went to the doc. <br>They gave me screened my urine and found nothing in it except weed. The weed I smoked was from my stash and I smoked it several times before with no side effects, so I dont think it was laced. Doc tells me ill be fine and it should all go away in 3 wks. So I stopped smoking for three weeks and it wasnt gone. I then convinced myself I was 'sick' with like the flu or something. I was like 'fuck it Im sick and they cant figure out what is wrong with me Im going to blaze. And blaze I did. I puffed and puffed. Way more than before believing I was suffering from some sort of illness. <br>It is only now that I have 11 months sober and some distance from the situation that I can see it may have been the weed all along causing me top feel sick. I wasnt puffing because I felt sick I was sick from smoking. This went on for five yrs. Id try and quit but after like two weeks Id get fed up and start feeling a lot worse and start up again. It led me to other drugs big time because I felt so helpless and scared and anxious. But I couldnt stop. I had to medicate this sick feeling in my head. I dont mean like sick thought it is an actual somatic feeling like my brain is swelling. <br>Ive been hospitalized and put on heavy duty meds like Haldol several times.  I finally stopped for good and Im going through hell on earth. Seriously I am fucked up. For a yr and a half now my sleep pattern is off. I feel like I am going to die. Ive had almost 11 months of sobriety and everyday has been torture. Basically I have been bed ridden. I swear to God. I cant eat sleep fuck or do anything. I know this doesnt happen to people normally and I feel so so alone in my suffering. I cant keep a job or go to school. I havent even been to school since I was a soph. in high school because I had to drop out do to all this BS. It has completely ruined me. My body is fucked Ive been to literally dozens of doctors and they could never figure this shit out. It never occurred to them or me it may be all the weed. <br>I now have what they call complex partial seizures. I see flashes, traces all sorts of shit. I get strange sensations in my body at times that are almost unbearable. Worse than any pain most people can imagine I have had horrible Crohns disease, that shit is excruciating pain wise. Crohn's is a walk in the park compared to this because they arent really feelings. Its like a total mindfuck. The last doctor I went to see decided to test my mitochondria. I dont want to go into depth but I have severe mitochondrial damage. I dont know if ill ever be my old self. And Im not 100% sure if I can say the weed actually caused this per say. It may have brought to the surface some weakness I had or exacerbated something. I can say that the weed definitely has a role and it threw my body's metabolism off. Maybe I lack certain enzyme's to break this shit down I dont know.\n\n\n"
}
