{
 "title": "Memetical Effects",
 "author": "esialb",
 "citation": "   esialb. \"Memetical Effects: experience with Salvia divinorum (10x extract) (ID 29081)\". Erowid.org. Nov 8, 2007. erowid.org/exp/29081",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29081",
   "Not Specified",
   " ",
   "Not Given",
   "Nov 8, 2007",
   "7195",
   " "
  ]
 ],
 "report": "</p>\nSalvia divinorum is a powerful legal hallucinogen with which I have some considerable experience. It affects everyone differently, but for me it provides a very sharp jolt to the memetic universe that is my brain. It does this by fundamentally altering several basic properties of the memetic universe that exists as my mind. To paraphrase the Matrix, 'What memes must learn are that these rules, rules like causality, rules like the progression of thoughts, are simply the rules of a complex formal system that is my mind. On salvia, some of these rules can be bent. Others can be broken.'</p><p>One big rule of the memetic universe that becomes completely irrelevant is the notion that I exist in 3 spacial dimensions, plus time (Making 3.5 or so). On salvia, this is not the case. Intead of 3 spacial dimensions and time, forming a continuum, spacial dimensions and time are aspects of a fractal. There are about 7 spacial dimensions in this fractal. Normal space/time is an infinitely thin ribbon extending ever-deeper into the fractal; the deepening dimension is time. However, one can move deeper or farther out of the fractal in more than just a time axis. There is one direction that one can take that is itself the most interesting, and the most scary. For, not only does reality change as one moves throughout the fractal, but so do also the very possible natures of thoughts. There is a direction that one can go, that leads to the very edge of the universe. As I move closer to it, I can -feel- the powerful meme it emanates with: Non-existence, itself existing at every point in time and space.</p><p>This tangible non-existence forms the barrier to a world of completely different memetic possibilities than that of a normal mind. A normal mind conforms its memes to reality. But as I move closer and closer to the barrier, there is a fundamental change in the relationship between memes and reality. The closer I get, the less the memes are dependant on reality, and the more reality is dependant on memes.</p><p>The fractal universe is infinitely recursive, and infinitely subtle in its variations. However, moving through the fractal universe is chaotic at best. A mind descended from sobriety is simply unable to fully comprehend the reality defined by salvia. Most noticeably, it gets lost easily. This is especially dangerous in the fractal universe, because the recognizeable portion of reality is itself a mere minutae of the entire fractal. The mind flails desperately, searching for any meme onto which it can stabilize itself. If it can not find one, the trip descends to level 6.</p><p>When a salvia trip descends to level 6, the memetic universe that is my mind has been so grossly altered from its normal state that the original inhabiting memes die. The complete and total death of all of one's memes is a very traumatizing event; it is most comparable to having one's soul obliterated. Level 6 trips, and the subsequent memetic die-off, however, are simply one side of a coin. As the now-obsolete original memes die of irrelevance, new memes designed to operate in a truly multi-dimensional reality emerge. When a level 6 trip begins, it is as if one loses consciousness. But once the brain has a new, stabilized, set of memetic guidelines, a wholly new breed of extremely powerful meme can, and does, emerge.</p><p>This meme is the ultimate goal of a salvia trip. This super-meme provides a reality that exists not as a master, but as a toy. This super-meme does not get lost in the 7 spacial dimensions of the fractal; instead, it navigates them with the precision of navigating one's own thought processes.</p><p>The ultimate goal of a salvia trip is the total freedom and power of mind given when conventional reality is shedded, revealing a nature that exists where ideas, and not matter, are tangible.</p><p>This is why I trip to Level 6, for every time I die, and every time I am reborn.</p>"
}
