{
 "title": "Too Intense for Comfort",
 "author": "Gabitril",
 "citation": "   Gabitril. \"Too Intense for Comfort: experience with Tiagabine (Gabitril) (ID 29090)\". Erowid.org. Jan 2, 2005. erowid.org/exp/29090",
 "substance": "Tiagabine (Gabitril)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "24 mg",
   "oral",
   "Pharms - Tiagabine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29090",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 2, 2005",
   "Views: 14915",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last weekend I was bored so I decided to pay my good friend 'G' a visit. Upon arriving at his house he told me he had gotten a new perscription to Gabitril, something I had never previously heard of. I'm really not into trying new substances(especially pills) but after a few hours of absolutely nothing to do I had a shift in judgement and decided to give in to temptation. After doing some research online, we both took a dose of 24 mg and chased it with a can of soda to aid digestion.</p><p>After about an hour of playing video games, we both started to feel something. The feeling increased signifigantly over the next hour. It was similar to a cannabis high but was getting very intense. My friend went into his room and layed down, so I decided to join him. Soon after, he started puking uncontrollably which supprised me, because I wasnt nauseous at all.</p><p>I decided to give him some time alone so I left his room and went back to playing the game. It felt like the effects of the gabitril would double every five minutes, until finally I was overpowered by the intensity. I became extremely uncomfortable and began to have hot and cold flashes. I decided to lay down and thats when the hallucinations began. I began seeing multicolored waves wash across the room and break on the wall next to me, I even heard them coming in from a distance, all the while becoming more fucked up as I absorbed more.pretty soon I could feel the waves roll across my body and I was unable to move. The intensity grew and drew me deeper and deeper into a very uncomfortable trip. Strange patterns of every color began to follow the waves. I was incapable of even the most basic actions (found this out when I tried to sit up) and thought 'God, I'm far gone'.</p><p>Soonafter I decided to puke to stop myself from absorbing any more. After crawling to the bathroom and puking up my dinner of frozen burritos (tastes even better the second time around), I managed my way back to the couch and passed out around 4 hours into the experience. The next morning I woke up feeling like someone had taken a crap on my brain. </p><p>All in all not a very pleasent experience, I wouldn't recommend this high of a dose to anyone.  The lessons: it's bad to overindulge, always be responsible and work your way up, I'm suprised I didn't die.</p>"
}
