{
 "title": "Gets Stuff Done",
 "author": "Swain",
 "citation": "   Swain. \"Gets Stuff Done: experience with Amphetamines (Adderall) (ID 29106)\". Erowid.org. Aug 16, 2006. erowid.org/exp/29106",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29106",
   "Male",
   " ",
   "Not Given",
   "Aug 16, 2006",
   "Views: 16884",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had a huge paper due in the morning, so at around 5:00 PM, I called my friend and bought one 20mg Adderall pill from him.  Like every other college student, I had heard all about how Adderall aids in school work.  I have experience with the usual drugs: alcohol, nicotine, marijuana, painkillers, shrooms, LSD and have even dabbled in cocaine a few times, but I had never taken Adderall.</p><p>At around 6:00 PM I swallowed the little pinkish orange pill on an empty stomach.  Perhaps it was placebo, but in about 30 minutes I felt a bit light-headed.  My field of vision seemed to broaden a bit, and I felt a slight increase in energy.  With this new found buzz of energy, and an expectation of what was to come, I began searching for quotes for my paper.</p><p>I soon began typing my paper, and I noted that sentences just flowed right out of my head and into the paper.  Ideas and thoughts just seemed to come to me easier and faster than usual.</p><p>I really began to feel the Adderall at around 7:30, T + 1:30 from when I had first dosed.  My vision was a little shaky, my hands were sweating and I could feel my heart beating faster and harder than usual.  At this point, I had a fairly good body buzz and just a general sense of euphoria.  It wasn't anything too intense, but the feeling was defiantly there.  I guess I would compare it to a mild dose of coke... only a little less 'pure' feeling, and without the numbing qualities (and naturally much longer lasting).</p><p>During the next 3 hours I was absolutely railed onto my paper.  I would describe it as almost a meditative state, in the fact that I didn't notice, or care about anything other than the computer screen in front of me.  This is coming from a guy who usually procrastinates for hours and has a hard time concentrating on school work for more than a few minutes at a time.  (Yah, I think I have a little ADD--but don't we all?)  </p><p>I couldn't think about ANYTHING else.  I became obsessed with making my paper perfect.  I was delighted to find all sorts of connections, parallels, and quotes that I probably would not have been able to put into my paper if it hadn't been for the Adderall.</p><p>The one time that I had to leave my desk, I remember feeling SUPER pissed about momentarily stopping work on my paper.  Im usually more than happy to take nice relaxing breaks from school work, but not this time!  The whole time I was away from my desk, I was thinking about my paper, my baby.  I was actually happy to resume work on it!</p><p>I finished the bulk of my paper around 10:30.  By this time, I noted a decrease in the intensity of the effects.  My vision was normal, my heartbeat had subsided a bit, and the body buzz was almost completely gone.  My hands were still pretty sweaty though.  I could still feel the speedy effects at work in my brain, and I was still thinking about my paper, although not quite as intensely as before.  </p><p>Slowly, I could feel the Adderall leave my body, and by around midnight, T+ 6:00, I felt just about back to baseline.  I noticed a slight depression from the come-down, but it was nothing too bad.  My friend had warned me that it could make it hard to sleep, so at around 1:00 AM, I took a couple Benedryl pills, to aid in getting some sleep.  I fell asleep just fine, woke up the next day feeling fine, no hangover, no bad effects.</p><p>There is no doubt that Adderall helped me get a paper done that probably would not have been done otherwise.  Adderall helped me get into 'the zone' on something that would otherwise be mind-blowiwngly boring.</p>"
}
