{
 "title": "Enjoy in Moderation",
 "author": "Hophead",
 "citation": "Citation:   Hophead. \"Enjoy in Moderation: experience with Oxycodone (Oxycontin) & Opiates (ID 29122)\". Erowid.org. Jun 6, 2007. erowid.org/exp/29122",
 "substance": "Oxycodone (Oxycontin) & Opiates",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Oxycodone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29122",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 6, 2007",
   "Views: 46763",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs far as I can remember, I've always been drawn to opiates. I've tried every drug imaginable. Nothing compares to opiates. I started with Vicodins and Percocets. My dad had become ill with cancer and there was no shortage of pain meds around the house. I would grab a couple and head out the door. The main benefit for me has always been the slamming confidence boost. The pills would just make me come out of my shell in a slick way. My speech was sharp and smart and I never heard that little voice. See I always analyzed things too much. I would think about stuff and go over my words in my head before I would speak them. Basically I am a very shy person. Not on opiates!  I used perc's and Vic's for a couple years with no real problems. I even managed to get my hands on some liquid morphine a few times. I remember it making me throw up the first time I used that. The high and itching was surreal. \r\nEventually I bumped into a friend who had some little white pills. This was about 2 years ago. I remember the day like it was yesterday. He crushed up one of the pills and we each snorted a half. Ten minutes later I felt perfect. I loved everyone and the world was just right. I remember getting really talkative and thinking positive about everything and everyone. There was no side effect for me other than feeling a little bit of nausea. I could walk and think straight. It was just one of those things that you knew had to be too good to be true. As I've come to find out the only drawback to opiates for me is not having them! Oh by the way the pills were oxycontin 20mg. \r\nFast forward to the present time. I have seen a lot of things change myself included. The people that I know that use oxys are not the same people that I once knew. The scary thing is that I am starting to become them. These are friends that I grew up with. They have stolen from me, ripped me off in oxy deals, and will tell you anything to feed the habit. I often wonder if my situation is like any one else out there. I firmly believe that I am a better person when on opiates. I am harder working, more loving, get more things accomplished, and have much more confidence. Good luck telling that to a physician!\r\nThe most intense feeling in life for me was a 6 month relationship fueled by our love of oxys and each other. This girl was incredible. The intensity of the opiates made us feel as if we were in the most heated romance novel ever written. I had only known this girl for about a month but with overstock of opiates racing through our bodies, I can honestly say I have never felt closer to anyone in my life. The oxys make anyone in my life that I love or feel close to, feel about 100 times closer. It is really hard for me to explain the feeling in words. I remembered her crying when we were making love one night. I asked her why was she crying. She told me that this was the happiest and most fulfilled she has ever been in her life. It must have been the opiates cause we only made it 6 months!\r\nI have taken a multitude of drugs and this is the ideal high. The problem is that when the high goes away and the drugs aren't there. I have to face reality. That reality might be severe withdrawal. I recently had the flu. I threw up and went to the bathroom for 3 days straight. I ended up in the ER room hooked up to all kinds of IV's. I had lost close to 20 pounds. I thought it was just the flu. My friend stopped over with some oxys and I did one and didn't have the flu anymore. Thats when I figured out that it was withdrawal. I think it stemmed from the prior two weeks. I had a ton of oxys for about 3 weeks straight. I was using anywhere from 80 to 160 mg a day for about 20 days straight. That is all it took for my body to get hooked so be careful. \r\nThe people that I know that are junkies for oxys remind me of watching how crackheads are portrayed in movies. I live in a small rural community and have never had the pleasure of meeting a crackhead. The movies make them look like they would do anything to get some. The people I know are not much different.  \r\nI'm struggling with my opiate use. I have really cut back so that my body is not dependent on them anymore. I probably will never quit using, but this has been the hardest thing I've had to deal with in my entire life. They still have too many benefits for me. I have went to 5 job interviews over the past year. All three that I went to high on opiates I got the job, I only took the one that I'm at currently but I know that they had something to do with my success. \r\nThe best phrase I can say to everyone from my experiences would have to be the old saying 'Enjoy in moderation'!\n\n\n"
}