{
 "title": "Much Different Level Than I Wanted",
 "author": "Dexter666",
 "citation": "   Dexter666. \"Much Different Level Than I Wanted: experience with 2C-B & Cannabis (ID 29158)\". Erowid.org. Feb 2, 2004. erowid.org/exp/29158",
 "substance": "2C-B & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-B",
   " ",
   "  repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29158",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 2, 2004",
   "Views: 11591",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirst off I'd like to say it was great and I'm still in a very good mind state because of it. (Written soon after the Boston Hempfest.)<br>00:00- 15mg 2C-B (small dose for me but perfect for a large gathering as such) while on train.<br>00:40- Could'nt tell if I was begining to feel effects or if it was just the weed but I'm feeling good and very nice.<br>01:20- Ok I'm feeling it now and its strong because of all the weed I was smoking right around cops which was weirded out and I was beginning to feel a little wierd to say the least as bad waves of paranoia began to hit me as we were smoking weed while hundreds of pigs were all around us and I was not used to this but after a while it was cool as I reliezed they were'nt busting people.<br>01:40- We all go out wondering around. I 'm begining to see mild patterning and and the intense color enhancment was bueatiful but I began to think if I took more than 15mg by mistake, but I was smoking alot of weed and the anxiety of pigs being all around was part to blame as I only wanted a mild enhancment of the situation not to be tripping.<br>02:00- Well its pretty intense now and I'm tripping even though I did'nt realy want to but flow with it I thought. I went over to the triptourium stand and bought some blotter art and some other items as they were cheap there and I love blotter art. <br>02:30- I'm peaking now and I'll tell you it feels great but at a much different level than I wanted to be at but thats ok I should have expected that. I love it here and I don't want to leave but it was already 5:00 as we got a late start and we were planning on making the 6:00 train but because of minor complications we were not able to so we were stuck until 8:00 but that was cool.<br>03:30- Its geat here and I do not want to move but we decide its time to leave and take the green line back to the fleet center and chill there. I was feeling an amazing feeling at this time as there was a sense of true life inside my body and the CEV's are crazy and intense for just 15mg. Too many jesus freaks out there pushing there shit along with scalpers who kept shouting tickets floor front and center and it was like a battle between good and evil along with me just standing there being kinda freaked but it was all good as we moved out of there to explore Boston a bit. <br>04:30- Coming down a bit I believe but I'm still tripping and by this time we were inside the fleet center pacing back and forth with five sheets of blotter, two silk real-looking marijuana plants and alot of other shit that could have gotten us in alot of trouble and here we were chilling out and feeling freaky so we go out behind the fleet center in the path on the right side of the center to smoke a bowl, wow what a day!<br>05:00- Well the train should be here soon and we would be in a safe comfortable setting to finish out my trip and my day and what a day it was.<br>05:40- Were on the train on our way home and the relief just fills my body with estatic joy and a strong afterglow was setting in and I was enjoying the ride reflecting with friends about what happened and what we should do for next year like come way earlier and be on maybe 12-14mg of 2C-B and well smoke alot of weed again but not quite as much as we did as we became kinda slow but it was good kind buds and it was great. <br>06:20- Back to lowell and I had a strong afterglow but when we make it to our car we decide to smoke a couple bowls and a few joints in this abandoned stair well and so we did and by this time I was blazed and was feeling great. Well ok were heading out but as we do several people pop some Nexus at a cost of course and we all head home. <br>06:40- AHHH back to a comfortable setting were we smoke up some more and just lay back and relax although I'm very drowsy at this point for some reason but it was all good and I stay awake until almost 2:00 in the morning but not because I could'nt go to sleep but because I choose to stay up and smoke.\n\n\n"
}
