{
 "title": "Frightening Seizure",
 "author": "Jamie",
 "citation": "   Jamie. \"Frightening Seizure: experience with Tramadol & Paroxetine (Paxil) (ID 29177)\". Erowid.org. Jun 22, 2007. erowid.org/exp/29177",
 "substance": "Tramadol & Paroxetine (Paxil)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)",
   "  T+ 0:00",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 0:45",
   "350 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 1:15",
   "300 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29177",
   "Male",
   " ",
   "Not Given",
   "Jun 22, 2007",
   "20614",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 750 mgs of tramadol is considered a high dose, see Tramadol Dose Chart]\r[Erowid Warning: There are case reports of people having bad reactions when mixing tramadol with SSRIs. This may include potentially life-threatening adverse reactions such as serotonin syndrome. See Tramadol Health Concerns]</p><p>I take a 25mg Paxil CR every night before bed, well I woke up after taking my medication the next day.  Being an opiate addict I was searching the internet for medications with opiates or opiods in them.  I stumbled across a non-opiate Tramadol.  </p><p>I followed the advice and took 100mg, well 45 minutes later, I was feeling nothing, so I continued on to take more; I took about 350mg.  About 30 minutes later, I was feeling pretty good.  Not really a real messed up feeling, but I could tell I was in a better mood, and I felt like I had eaten a 4mg dilaudid.   So ya know I was feeling pretty good, so I said if 450mgs made me feel pretty good, I could eat more.  So I ate about 300mg. more.  Well after that I was feeling really good.  </p><p>I was definitely messed up.  That was about 4 o'clock pm.  I had to go to a school concert with one of my friends later that night, so at 6pm one hour before the concert I ate about 400mg more Tramadol.  Well all through the concert I kept nodding off, but I felt great.  Well the concert ended in about an hour and a half, and I was still feeling really good. So me and my friend went outside.  I smoked a cig.  And the next thing I know I wake up in an ambulance.  The paramedics said I had a seizure.  They said I had just fallen unto the ground and started shaking and my eyes rolled back into my head, and I was trying to eat my tongue.  The only thing that stopped me, was my friend knew a little about seizures, and knew to put something in my mouth.  Needless to say I will never take tramadol while on SSRI's ever again.\r[Erowid Note: It can be *very* dangerous to put something in someone's mouth who is seizing and can be more dangerous than letting their teeth grind together.]</p>"
}
