{
 "title": "The Spasms",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The Spasms: experience with Tramadol (ID 29182)\". Erowid.org. Jun 19, 2007. erowid.org/exp/29182",
 "substance": "Tramadol",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29182",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 7886",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI came across Tramadol in my online search for pain relieving medication. I purchased a fairly large supply of Tramadol 90 50mg pills. <br>The process was simple and the turnaround time on my pills was fast. When I got my first scrip I took one as directed, to no effect. I started taking more. Up to the 8 maximum a day. The drug's effects were similar to Vicoden. The nausea, lightheadedness, pain-free, all around warm feeling of wellbeing. But, unlike Vicoden the Tramadol was a little bit speedy. I started taking 2-3 pills at a time, and before long I was taking them just to wake up. When I wake up I feel a little jumpy, almost like heavy drug withdrawals. So I took more. In the morning, to go to sleep, during the day, whenever.<br>These effects, mind you, happened [only] after two weeks of usage.  Not only was I taking the drug to stay normal, the 'normal' I did have was constantly being interrupted by twitching/spasming muscles. These were not small spasms either. Sometimes these [abrubt] muscle spasms would wake me from my sleep. They would also persist throughout the day. When I was driving my car my legs, especially the one tensed on the gas pedal, would spasm. Trying to get to sleep, my leg would spasm; sometimes causing me to actually kick my down comforter right off of me. The after effects are too detrimental. I just hope I can get over this soon. It would piss me off if I have body spasms for the rest of my life.\n\n\n"
}
