{
 "title": "Legalization Equals World Peace",
 "author": "Toking Soloman",
 "citation": "   Toking Soloman. \"Legalization Equals World Peace: experience with Cannabis (ID 29188)\". Erowid.org. May 31, 2006. erowid.org/exp/29188",
 "substance": "Cannabis",
 "bodyweight": "172 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis - Hash",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29188",
   "Male",
   " ",
   "Not Given",
   "May 31, 2006",
   "3308",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One day, me and one of my friends secided to go hang over with another one of my freinds house, because we knew we could smoke there. It was around 6:30 on a chilly October night, and when we arived, my freind was already pretty blazed, but was VERY entushed that we wanted to smoke with him. We went to his bathroom, shut the door, and pulled out Ruca, our water bong. (This is tradition whenever we smoke here.) I pulled out a sack of about anywhere from a dub to a quarter, Then Joe, (my freind,) said, 'you lucky bastard, this is kb.' Astonished, I told him to light it up. </p><p>We got the most fucked up all of us had ever been, and I began to see visions, and we proceded to talk about current events, like the war in Iraq, the Taliban, and Micheal Jackson. </p><p>At that time, I held alot of grudges on people, (i.e. ex-girlfreinds, assholes, my dad,) and I really never knew why, it was during Tom Petty's song, Last Dance With Mary Jane, that I realized, that I didnt even know why I didnt like these people anymore, and, I forgave them. Thats when relized, 'Whoa, when was the last time that the Netherlands were at war? Is'nt that where Ampsterdam is?' Well, the next day, I looked it up on the internet, and the last war they were in was World War 2! </p><p>So because I was in such a great mindset that night, I've came up eith a proposition that I will live by and crusade for the rest of my life. This is my proposition and belief: LEGALIZATION=WORLD PEACE. Everyone I have talked to has agreed to this statement.</p>"
}
