{
 "title": "The Paranoia Portal",
 "author": "ravens",
 "citation": "   ravens. \"The Paranoia Portal: experience with Ecstasy (ID 29190)\". Erowid.org. Dec 14, 2003. erowid.org/exp/29190",
 "substance": "Ecstasy",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29190",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 14, 2003",
   "Views: 7113",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am reasonably experienced in psychedelics and other substances, including ecstasy, and so I expected that a single dose would produce nothing more than euphoria and loving feelings.  <br>I took 1 pill of 'blue torch' at about 7:10 p.m. with a friend on the same dose.  In about 10 minutes I complained that the effects were too strong, and had the usual uncontrollable eye saccades and waves of euphoria.  While this was not entirely unpleasant, I had a distinct feeling that the trip was getting away from me, that I could not control where my mind might go.  I got over this feeling in about 5 minutes and continued on a happy ride for about an hour.<br>My friend and I began to talk about spirits and the spirit world.  She mentioned that she saw a portal 'to somewhere' in my bathroom.  Suddenly, that feeling that I could not control where my mind might go returned, and I spent the rest of the night guarding my home and us against the portal.  It was a negative experience that persisted for about 3 days, slowly decreasing in intensity.  I was very paranoid (of evil spirits and creatures from other dimensions, something I usually don't think about) and 'slept' with the light on for several nights.  I was genuinely frightened that I would have permanent paranoia.  Weeks later I was more mellow but still having an occasional dream that something was invading my bedroom while I slept, or the experience of feeling watched by something with evil intentions. (I had not had such feelings before the trip.)<br>I submit this primarily because I have had many excellent drug experiences, including LSD and psilocybin, and a few moderately bad trips in which I was focused on death or sorrow, but nothing nearly this disturbing or persistent after the initial trip,  and nothing that I felt I could not talk myself out of or mentally lift up into a better trip until now. I share this information because I had believed that one could not have a 'bad' trip on E, and I had believed that E was very easy to mentally control.  While I would definitely take E again, I will be a wiser and more cautious consumer.\n\n\n"
}
