{
 "title": "Rollin on the Beach",
 "author": "Jaw Breaker",
 "citation": "   Jaw Breaker. \"Rollin on the Beach: experience with Ecstasy (ID 2920)\". Erowid.org. Oct 22, 2000. erowid.org/exp/2920",
 "substance": "Ecstasy",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2920",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 22, 2000",
   "Views: 7464",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI live in MN and every now and then my family and i go on vacation to the beach in NC.  Well this year I brought my cousin along with me.  One night we happen to fall into a conversation about X.  I had done it a few times but never too much.  I never thought that she had done it before. I was wrong.  And what she told me was the most beautiful story .  <br>About 2 years ago, her little sister had died at the age of 9.  She stuggled with it for so long.  One day a friend of hers stopped over and gave her a pill that she didn't want. My cousin took half and went for a drive not knowing what to expect.  She told me that while she was driving around she started to think about her sister and for the first time in 2 years it made her smile.  Instead of thinking about the fact that she died, she thought about all the good times she had with her.  That night she came to terms with her sisters death!  I was so shocked and it made me cry.  I had never heard of anyone having such a dramatic experience before like that.  <br>Our last night there we were looking for some people to hang out with when this kid comes up to us and asks us if we want to buy a couple rolls.  We decide to go for it and buy 3 pills for the 2 of us.  We sat on the beach at night and watched baby sea turtles hatch and make their way to the ocean.  It was the most spiritual feeling I have ever had.  The way that we both feel about the presence of new life beginning.  And the things that you'll encounter when you're faced with death.  And how one little pill can change your thoughts about it in a good way.  We looked at each other without saying a word, smiled, and we both knew we felt the same.  It gave me goosebumps.  Thank you very much.\n\n\n"
}
