{
 "title": "Infinite Planes of Thought",
 "author": "Mike",
 "citation": "   Mike. \"Infinite Planes of Thought: experience with LSD, Cannabis & Nitrous Oxide (ID 29251)\". Erowid.org. Apr 10, 2007. erowid.org/exp/29251",
 "substance": "LSD, Cannabis & Nitrous Oxide",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29251",
   "Male",
   " ",
   "Not Given",
   "Apr 10, 2007",
   "Views: 3444",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>October 17, 2003</p><p>Four of my friends and myself went to a park and each dropped 1 hit of blotter acid at 4:20 pm, except for one guy who wasnt going to be tripping.  We paid $15 for each dose, which is a lot, but acid hasnt been around here for a long time and we were assured by multiple people that it was some really strong stuff.  This would be my first acid trip but I had tripped on other drugs a few times before.</p><p>After we dosed we walked through the woods for a while until we came to a playground where we chilled until we started to feel the effects coming on.  At first it was very subtle and mostly felt like a bit of anticipation and nervousness.  It was probably 40 minutes after dosing that I began to feel the first of these effects.  Soon I noticed that things seemed a lot funnier than usually and I found myself laughing out loud about things that normally wouldnt be funny enough to cause such a reaction.</p><p>Soon we decided we should go get some food from my friends house.  While he made tuna salad I went to use the bathroom, which is where I began to get the first visual effects.  I noticed that the wood grain on the door was swirling and growing and when I looked at the bath tub it appeared to shift colors and shades, as if the lighting was changing.  Subtle rust and mold patterns grew and spread over the surfaces of the bathtub.  Then I went back to sit at the kitchen table with my friends and eat tuna salad on crackers, which proved very difficult because the minute I was back in contact with other people everything became hilarious.</p><p>I couldnt eat very much because I was laughing so hard and whenever I stopped laughing someone else would laugh causing me to laugh again.  The bowl that held the tuna was breathing and the tuna was swirling around inside of it.  We went outside to leave and while waiting for a sober person to come drive we watched a few people walk their dogs.  One couple had a loaf of bread in their hands and my friend said look bread! and we both laughed for a good 5 minutes.  I laid down and looked up at the sky and the clouds were swirling and flowing by, and one cloud looked like it was only 10 feet above me and if I reached up I could almost touch it.  The floor of my friends truck bed began crawling with patterns and textures, and the rivets in it were sliding against each other back and forth. </p><p>Finally we left and drove to my friends house but we ran into his mom there.  There was a lot of confusion because one of my not tripping friends needed to go to work and she offered to drive him but for some reason one of my tripping friends got in the car as well.  Fortunately he wasnt yet tripping as hard as I was so she didnt notice but we had to go to the theater to pick him up before he caused any problems.  Once we arrived at the theater he was playing a game of Deer Hunter, and whenever he would shoot an animal I was overcome with laughter.  We then went back outside and I ran into another of my friends.  He asked if he looked insane and I replied No but I am insane.  I felt like I was crazy but I knew it was the drug and so I enjoyed it a lot, wondering if it would be fun to be like that forever.</p><p>By this time the visuals were coming on very strong.  The clouds above were enormous and glowing with beautiful pinks and yellows, like the most amazing sunrise imaginable.  We hopped back in my friends truck and drove to go smoke some herb and the ride was incredible.  The wind against my face felt so soft and everyones hair appeared to flow much longer than normal.  By this time my friends heads had morphed slightly to reflect their personalities and moods whenever they talked.  Their eyes and eyebrows and nose would twitch and grow to reflect whatever it was they were saying.  One person said something angry and his eyebrows crossed and his face scrunched up as he said it.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>We were driving down a road I am very familiar with but I had no idea what part of the road we were on.  We seemed to drive by the same places numerous times, and all the plants and trees were incredibly dense and vibrant.  We were supposed to tell the driver how to get to a good place to smoke but we couldnt figure it out because we didnt know what part of the road we were on.  Finally we pulled into a dirt road and there were a few houses.  However, if I looked deep into the woods I could see many houses in the distance so I wasnt sure if I was in some suburb or forest, but it turns out the three houses were the only ones there.</p><p>Finally we came to a place to smoke and we got in the cab and baked it.  When I examined the weed I saw tiny white creatures living in it, popping their heads out of various holes and quickly scurrying away.  When the bowl came to me I took a hit but I couldnt feel it in my lungs at all.  I exhaled and some smoke came out and I passed it to my friend, but then I couldnt remember if I actually took a hit or if I just thought about it and passed it without smoking.  They assured me that I had indeed smoked.</p><p>At this point things started to get weird.  I went outside to pee but I didnt actually have to so I just zipped my pants back up and got in the truck.  My friend said that I turned around and stretched my penis out really far but I was certain this didnt happen, but I couldnt be sure because I was tripping balls, so I guess we will never know.  Anyway, I got in the truck and we started to go.  It was getting dark and I thought it must be cold so for a second I felt extremely cold, but then I thought about hot and I felt warm and comfortable.</p><p>We arrived at my friends house and our sitter said he had to go home.  We were worried about what could happen because we were tripping so hard now but we decided with the four of us we would be alright and could prevent one person from doing anything stupid.  I was also very worried that his mom could come home and she would easily know we were tripping.  I assured myself that I was just being paranoid so I soon felt better about it and I knew she would be gone until at least 9:30, but I could no longer comprehend time so I thought 9:30 could come very quickly and I wouldnt know it.</p><p>We went upstairs to my friends room and put on some music.  His wallpaper was a fractal pattern and it became one of the most beautiful visuals I have had.  It became a 3D living organism living inside his computer.  Its tentacles were waving and growing and lights and colors were flowing through its body.  I between the tentacles were endless spirals, infinitely complex.  I could look deeper and deeper into the image and see more spirals.  My friends wanted to play pool so I sat by myself for a while, looking at his wallpaper and milkdrop.  I listened to Sphongle and milkdrop formed extremely intricate and complex patterns.  In between the lines I could see eyes and flames and other images similar to an Alex Grey painting.</p><p>I could feel the music in my body, the bass was pounding from inside of me and the water sounds made me feel wet.  The music filled the room like I have never heard before, and I could hear voices and sounds in the music that normally I could not perceive.  I thought a lot and decided that on acid each idea I had would spawn multiple new ideas and each of those even more, and normally the brain can only focus on one of these things at a time but on acid my brain could make more and more connections, allowing me to achieve deeper and more meaningful thoughts.</p><p>I went to see my friends, who had just played the best game of pool they had played before, making impossible shots and clearing the table very quickly.  I went in the bathroom to look at myself in the mirror.  I know everyone warns against this but it has always been one of my favorite things to do while tripping.  There was a patch of hair growing out of my chin and the hairs would recede into my face and then reemerge elsewhere on my face.  At one moment my face would be smooth and clear and then break out into pimples.  This was all very amusing but it was strange that my face didnt change near as much as when I was on shrooms.</p><p>We decided to go outside for a walk, but I wanted to check the weather first.  I opened weather.com and then checked the time on the computer, but when I tried to find the time on the forecast that correlated to the current time I couldnt.  Time made no sense to me and none of my friends could figure it out either, so we just went outside and it was a light rain, or more of a drizzle.  However, before leaving the house something interesting happened.  We were about to walk outside and my friend said to me something tells me Im forgetting something, the acid is trying to warn me.  He paused for a second and then said Oh yeah the last remaining hit in my pocket, I should leave it here so it doesnt get wet. </p><p>We walked around the neighborhood talking for a while.  During this time I felt a strong connection to my friend who I have known the longest.  What we said only made sense to each other and not to the other two people and we seemed to be thinking on the same level.  This made us both very happy and Im not sure if we actually could understand what the other was trying to say or if we were just tripping so hard that we made sense out of nonsense and just thought we understood.</p><p>Then I asked him for a cigarette and he pulled it from his jacket and handed it to me.  I held it for a minute and then looked down and saw that it was already lit.  I couldnt remember lighting it but I took a drag.  I couldnt taste the smoke but I exhaled but when I looked at it again it was out.  I asked my friends if it was lit and they said it wasnt.  They told me to light it with another cigarette so I tried that and then started puffing on it again, but then realized it still wasnt lit.  They had tricked me into trying to light it with another unlit cigarette and I became pretty confused but we all had a good laugh.</p><p>We decided to walk up the street to the middle school and as we walked our feet seemed to make impressions in the road.  I jumped up real high and when I landed there was a ripple effect that spread out from beneath me.  Then one friend said to me look are those flashlights under the bleachers?  I looked and indeed I saw lights and could hear kids laughing.  When I looked again though it was gone.  We sat down on a bench and two of my friends started slapping each other for fun I suppose.  Someones glasses flew off and they crawled around on the ground trying to find a missing lens.  All of a sudden I stopped tripping.</p><p>There were still subtle visuals if I paid close attention and cleared my mind, and I still felt a little weird.  At this point we saw a lot of cars pulling into the other side of the school and I thought I heard music so we walked around and realized there was a dance going on.  My friend had 3 canisters of nitrous but we had been looking for a balloon all night, and realized we could get one here.  Then my friend saw his old DARE officer, who is a female police officer.  He went and shook her hand while tripping his balls off on acid, which was very ironic.</p><p>They went inside and got a balloon and we spent some time harassing some kids, following them around and laughing at them.  Then we sat down to do our nitrous.  I inhaled my balloon with my eyes closed and I heard a humming sound that seemed to phase in and out.  Gradually all I could hear was this humming and it was all I was aware of.  Then I realized I wasnt breathing any air so I snapped out of it in the nick of time, just before I felt like I was about about to pass out and I was back in reality.  This had never happened before on nitrous so I think this was a residual effect of the acid.</p><p>By now I felt mentally drained and ready to sleep so I went home and lay down.  It took me about an hour to fall asleep but I slept well.  I had a slight headache in the morning but nothing too bad.  Overall the experience was wonderful.  I think I enjoyed my mushroom trip more but acid was very fun and much more powerful.  I am looking forward to trying it again soon and trying different activities.  Next time I want to listen to more music, dance, watch a movie, and spend some more time by myself learning what the drug has to offer.</p>"
}
