{
 "title": "Like Hydrocodone Tea",
 "author": "kavaman",
 "citation": "   kavaman. \"Like Hydrocodone Tea: experience with Kratom (ID 29250)\". Erowid.org. Dec 16, 2003. erowid.org/exp/29250",
 "substance": "Kratom",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "0.5 oz",
   "oral",
   "Kratom",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29250",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 16, 2003",
   "Views: 32210",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently bought kratom from an online vendor unaware of the what the quality would be.  I boiled one ounce of the dried leaves for about 20 minutes then poured off some of the liquid, strained it through a coffee filter and drank some of the bitter tea it produced.  I split this concoction equally with a friend of mine.  I added more water to the leaves already in the pot and boiled for another 20 or so minutes.  After that I repeated the decant and filter process and my friend and I drank another mug full.  I produced about 4 mugs full for each of the two of us from the one ounce of kratom used.  </p><p>By the time I had guzzled two mugs of the bitter yellow-brown liquid I started to feel a very acute and opioid-like buzz.  During the next 45 to 1 hour after that the buzz increased for both me and my friend until we felt like we had taken 15 or 20 mgs of hydrocodone each.  The buzz was a little different though; I think we were a little more 'spaced out' and the buzz somewhat resembles the beginning buzz one gets from smoking cannabis.  At about 1.5 hours from drinking the kratom tea we felt very euphoric and talkative.  The buzz was so great and the body and mind were so relaxed that we had to concentrate hard so as not to alert the sober parents to what was going on. The buzz starting subsiding after about 3 hours and I woke up the next morning still feeling like I was on just a few milligrams of painkiller.  No side-effects were noted. I just purchased some more kratom today.</p>"
}
