{
 "title": "High on the Islands",
 "author": "Chipper",
 "citation": "   Chipper. \"High on the Islands: experience with Nutmeg & Kava (ID 29272)\". Erowid.org. Jan 12, 2007. erowid.org/exp/29272",
 "substance": "Nutmeg & Kava",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 nuts",
   "oral",
   "Nutmeg",
   "(tea)",
   "  T+ 28:00",
   "10 nuts",
   "oral",
   "Nutmeg",
   "(tea)",
   "  T+ 28:00",
   "3 Tbsp",
   "oral",
   "Nutmeg",
   "(tea)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Kava",
   "(tea)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29272",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2007",
   "Views: 19225",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA while back, I decided to retry the nutmeg trip.  I'd had it about 4 years ago and was disappointed, but after reading so many good things, wanted to see what I was missing.\r\nI bought from the local herb shop, about 20 nuts.  They were smaller than I remember seeing on the islands.  I crushed 10 into small chunks and boiled them for one hour.  during that hour, I occasionally took a spoon and skimmed off the scummy brown foam from the top and ate it as it is said that is an essential part.  In the end, I drank the liquid, (about 1 1/2 cups) which was not as bad as everyone said.  This was in the early afternoon.\r\nBy nightfall, I was relaxed and comfortable, but my eyes were very bloodshot.  When I woke up the next morning, I found my eyes were the color of beets.  I used some eye drops to some effect and then went to work.  Doing this was a bit of a joke, as I was pretty high and really looked it.  It was hell trying to function there, but a damn funny hell.\r\nWhen I got home, I boiled the rest of the nuts and ate about three tablespoons of nutmeg powder in my cupboard.  I wanted to really get the effect as I wasn't tripping, just felt really high like on weed.\r\nThat night, my brother invited me to his Kava party.  I got about 3 cups in me and suddenly found that everything had sparkles all over it.  Objects had a glittery aura around them.  I laughed so hard at the simplest things and everything tasted great.  I didn't get sweets munchies like I had on weed though, it was more salt munchies.  Meat tasted incredible!  I kept drinking til the bucket of kava was gone.  \r\nThe next morning, I was down from the kava, but still stoned from the nutmeg.  That night, I went again for the Kava and had almost the same synergistic experience without having had to take more nutmeg.  It was never really trippy, but so stoned that it blew my mind.\r\nThis was a positive experience, but I could remember little about the first three days, and couldn't function well at work from the nutmeg.  I kept getting asked to stand in for the supervisor and realised I was gambling with a business' reputation. I know that was a lot of nutmeg.  Probably more than most people would take, but again, the nuts were small and I'm not.  But it was a better high than some of the other legal ones I've had. Mixed with kava, it was a fun and loveable experience creating feelings of brotherhood and munchies.  Wheeee!\n\n\n"
}
