{
 "title": "Never Again",
 "author": "Boybri",
 "citation": "   Boybri. \"Never Again: experience with 5-MeO-AMT (ID 29318)\". Erowid.org. Feb 12, 2004. erowid.org/exp/29318",
 "substance": "5-MeO-AMT",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29318",
   "Male",
   " ",
   "Not Given",
   "Feb 12, 2004",
   "Views: 11706",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I write this report in the sincere but perhaps implausible hope that people will heed its warning and avoid unwarranted experimentation with research chemicals. </p><p>My evening began sitting at home alone, ingesting approximately 10 mg all at once. I watched television and did some internet chatting while waiting to feel its effects. Several friends had tempted me to try this drug out, as I am particularly fond of substances with hallucinogenic qualities (especially MDA). After about two hours, I began feeling very constricted in my abdominal region, which only became progressively worse over the course of the evening. Intense nausea soon accompanied this. Soon, I began experiencing the drug's psychotropic effects, as my mind began playing games with me. The abdominal pain seemed excruciating. A friend of mine came over and was sober. Almost the entire time he was in my apartment (overnight), I remained reclined on my bed, for the abdominal discomfort seemed to lessen when I did so. I felt a frequent need to urinate, but I feared getting out of bed to do so, for I knew that the abdominal pain would come back again the minute I stood up.</p><p>To make a long story short, my friend and I eventually decided to go to sleep, for he was exhausted and thought that sleep might help me, as well. He had no problem going to sleep, but I lay beside him on my bed, unable to fall asleep, my mind racing from one thought to another. As I lay there, I began experiencing intensely erotic thoughts--scenarios, which made me erect and even more uncomfortable. I kept waking my friend, asking him to check my pulse, for it felt as though it were racing. My body temperature also fluctuated greatly: one moment, I felt like I was freezing, and the next minute, it seemed as though I were roasting. </p><p>Not wishing to keep my friend awake the entire evening, I finally adjourned to the living room to try sleeping on the sofa. I felt so tired and robbed of energy, but I could still not manage to go to sleep. I should remind you that psychotropic effects (much like those experienced with methamphetamine) were experienced throughout the course of the evening, but the hallucinogenic effects remained minimal. The abdominal pain stayed with me throughout the entire evening (about 13-14 hours), and I frequently became anxious at seeing the veins in my forearm bulging. Quite simply, I was convinced that I was dying but felt as though there were nothing I could do about it.</p><p>I enjoy psychotropics as much as the next person, but I will NEVER again attempt using research chemicals for recreation. I honestly do not think that I've ever been so frightened by a substance before. This is not a safe substance, and no matter how wonderful you hear that its effects are, I can honestly tell you that they are by no means worth the suffering and anxiety that you may endure if you choose to mess with 5-MeO-AMT. Have some self-respect and a sense of responsibility and avoid this drug.</p>"
}
