{
 "title": "The Transcendental Other",
 "author": "Killarava2day",
 "citation": "Citation:   Killarava2day. \"The Transcendental Other: experience with Mushrooms (ID 29329)\". Erowid.org. Aug 27, 2006. erowid.org/exp/29329",
 "substance": "Mushrooms",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 29329",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2006",
   "Views: 7551",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis all occurred about four or five years ago, back when I was in the first few years of my tripping experience. I was eighteen or and living in Australia where I had grown up, we had easy access to mushroom that grow there in wide abundance. We used to go out at least once or twice a week in season and get real fucked up every mushroom season, I loved them and had had some very revelatory experiences, especially during this particular season. \r\nOne day we went out picking, me and two mates, call them D and K. I can't remember if I'd ever tripped with W at that stage but me and K had tripped together a few times, Id introduced him to mushrooms. We out to a patch near my childhood home, it was virtually unknown to the local psybernauts and was therefore likely to be more fruitful than the usual haunts. We managed to get enough to cram fill a paper bag full each. We had know idea how many were in those bags but it was well into the hundreds.\r\nWhen we got home I was talking about drying them to save for off-season, but in being care-free and flush full of bravado we decided to cook them all up into one big brew. We crammed them in a pot then poured water boiled from the kettle and poured it over them, letting them steep for twenty minutes before serving. We poured a cup each of the thick, inky, blue glug and mixed it with spoonfuls of coffee and sugar. After we had arrived home someone I knew, a kid two years younger than me, had arrived and was really interewsted in trying the mushrooms. \r\nWe gave him a cup and he skulled it straight off, I drank my cup and refilled it. The other two guys had been eating mushrooms raw while we were picking and were a little more cautious, W drank nearly a full cup but K only drank half of his. I poured myself another cup and the young dude asked for more so I filled his as well which he promptly skulled in one go.\r\nI got half way through my cup before I felt it starting to come on strong, so I put the rest aside. The young dude started acting kind of agitated and soon said he was leaving. The rest of us went and sat down in the lounge-room to try and relax, I think someone turned the TV on to try and return to some semblance of reality. The peak was mindblowing, harder than any mushroom peak I had experienced before or since, it literally felt like I was being propelled by a rocket into hyperspace. I was trying to grasp onto the carpet to try and prevent myself from physically launching into orbit. I remember there was some banter regarding the young dude, on his first mushroom trip, who had consumed more than all of us and was currently wandering the streets.\r\nSoon though the peak started to pass, the trip plateaued nicely into a bearable yet intensely colourful and hallucinogenic trip. I thought the worst was past us. For a while there was a feeling of fun and playfulness between us, the mood was almost light even though we were all tripping so hard we could hardly see. But soon the mood began to change, the atmosphere took on a menacing feel and it seemed to get very, very hot. I was still very excited, too excited, and was dancing around singing the words to a song that was on the TV. The heat started to overcome me, it was getting to much to bear so I was ripping off my clothes until I was only wearing my tracksuit pants. the guys I was with were almost horrified, I was still dancing about and they thought I was going to go all the way. I wasn't but the atmosphere that day was excruciatingly confusing.\r\nSoon things were starting to get out of hand, I was off on a tangent about the people we could see from my window, walking about and driving in their cars. I couldn't figure out what they were doing, it all seemed so ridiculous, that they were so busy with their strange little lives that they couldn't even perceive this chaotic maelstrom of a world that was raging right under their very noses. D started to get a bit wound up in my tangent and decided it was a good idea to go and confront a frail old lady that happened to be passing and ask her just what the hell she thought she was doing and whether she could spread some light onto just what the hell was going on right then. Naturally we had to restrain him, luckily we were still in a state enough to recognise that this probably wasn't a very good idea and try and convince D of this fact. \r\nIt wasn't long after this that he started to freak out thinking he was poisoned and demanding to go to hospital. I settled him down for a moment and asked him, in what seemed like a moment of clarity, whether a hospital was really where he wanted to be right know. After a few seconds the implications of this question sunk in and gave up on the idea. By now I was tripping way to hard to deal with much more of this so I decided to have a nice, restful lie-down on the carpet and maybe try and escape the manic tension that was gripping the house.\r\nI remember lying there unable to get up and do anything as D screamed hysterically on the phone to his mum. She was a naive and sheltered farmers wife, probably unequipped to deal with the heaviness that her only son was currently laying on her. I must say she handled it with grace. As he demanded to know where he was she just gently reminded him that he had in fact rung her so she couldn't possibly know where he was. After she managed to get out of him just what he'd taken she told him to go to his sisters house, who lived in the same town as me.\r\nD (so he told me later) came into the lounge-room- after having gotten trapped in the hallway for awhile, unable to find the door out- and found me spread-eagled on the floor, half-naked and being literally consumed by the carpet. To him it seemed as though I was being swallowed by some fearsome, living, breathing, contracting, beast that intended to have its way with him next. Ky was sitting on the couch with a look of abject terror on his face and was evidently no help. I remember calling out to him that it was all good and he just needed to surrender to the experience and that when you did it was all beautiful. I urged him to just lie down like I was and just close your eyes and relax. D didn't see it that way. Be buggered if he was going to lie down and just let that pulsating beast swallow him, so he high-tailed it.\r\nI just let him go, it was beyond my control now, I had surrendered any control I thought I had and succumbed to the experience. I gently slowed my heavy breathing down to a point that I thought I wasn't in fact breathing anymore. I became convince I was in some meditation trance state and was breathing through my skin. I heard voices around me, talking and asking whether I was dead, I assumed D had been found and medical attention called. These were paramedics who had come and found me dead because I was no longer breathing (actually, it was that swine I'd given mushrooms to earlier. The bastard had more than all of us but still had it together enough to bring his friends back and steal my weed and the brew of mushrooms. The worst thing was that they had taken the saucepan the mushrooms were in as well, that damned well belonged to my mum. The audacity of it!).\r\nIt was apparent I was dead. I lay there breathing deeply as a whirlwind of visions consumed my total being, I was convinced that I had somehow gone mad and was now wandering the streets naked in a crazed delirium. The I had a vision that my mum was driving back from her weekend away, frantic at the news of her dead sun. I reached out to her and assured her that everything was fine because time and space were simply illusions that we create in our minds. I tried to tell her that it didn't matter where we were we would always be together because we are all one. to me it was a beautiful thing and I wanted her to know that, to share the joyous rapture of it.\r\nI lay there for what seemed an eternity, I don't recall much more about what occurred. After a time I eventually came to and arose from the ground. It was over. I as relived and exhausted, it was more than I'd experienced, more than I thought I could handle now I was back in normality. The house was a wreck, there were mushrooms strewn from end to end, and I was mystified as to where my weed and my pot of shroom juice had gone. I left it all, deal with it in the morning, and decided to go to bed. I was in bed for a few minutes before it all started to come on again. I peaked very hard and very quickly, harder than any of the earlier peaks. \r\nAs I writhed around in my bed, tangled in the bedsheets, I found myself face to face with what seemed like some terrifying alien being (or beings). It seemed so terrible that I couldn't possibly look at its face, it was beyond comprehension. I was scared out of wits. Though this terrifying being seemed to reassure me, after a time it began a process of change, like a spinning wheel, it slowly revealed its other face. A face of radiant beauty and joyous delight, I saw in this face everything we as a species strive to be. But, as surely as day turns to night, this being took on its repugnant form of terror and dismay. And so it went on for god knows how long, it went through the cycle again and again. From the glorious height of radiant love and beauty to the terrifying lows of fear and loathing.\r\nIt instructed me not to fear it because this is what we are, this is where we are heading. It was as if they were us in the future, that was terrifying but the terror reached a point where it simply became love. It was the most mind-bending experience I have ever had, it is the intensity of this trip and the reverberations it created in my psyche that has prevented me from doing breakthrough doses of DMT. This was as close to that as I am ever going to get without actually smoking DMT. Most of the trip was incomprehensible to me in the days following it, only time has given me the perspective to actually come to terms with what actually went down.\n\n\n"
}