{
 "title": "Underated Psychedelic Experience",
 "author": "Trippingsnake",
 "citation": "   Trippingsnake. \"Underated Psychedelic Experience: experience with DiPT (ID 29376)\". Erowid.org. Jul 5, 2004. erowid.org/exp/29376",
 "substance": "DiPT",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Pharms - Clonazepam",
   " ",
   " ",
   "250 mg",
   "insufflated",
   "DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29376",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 5, 2004",
   "Views: 15116",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWow! All I can say is that the DIPT experiance I had was absolutely unbelievable!  My psychedelic friend of mine, Rob, and I were messed up on alcohol and we decided to take some klonopin.  What an absolutely awesome mistake.  At some point during our klonopin high we decided to dig in to my personal drug box.  The box contained 3 hits of fluff LSD, 200 grams of MDMA, 500 grams of 2C-I, and a vial of DIPT.  Since we had never had the DIPT we decided to use it.  So, I cut out two lines of what seemed to be about 100mg DIPT and we insufflated it (it actually turned out to be about 250mg each).\r\nImmediately after insufflating the substance I really dont remember much.  I only remember yelling 'oh my god this is not good at all' and the guests in my apartment began to wig out hard.  I remember telling them not to worry because I was a pro with tryptamines and this was only a consequence of insufflating the substance.  Anyway, I decided that it would be a good idea to pass out.  I tried to pass out but I eventually woke up to Rob standing up and saying 'oh my god what the fuck'.  This is exactly what I felt.  Extremely intense echoes and sounds were running through my head.  It was almost as if I was tripping on a visual based tryptamine such as foxy or 2-cb, however, it was completely auditory.\r\nAn amazing experience, once we realized what the hell was going on, rob and I were in a state of absolute fantasia. Anything we heard was of a completely different level of sound than what would be arguably normal.  Talking, walking, banging, music, even taking a piss was totally abnormal.  We were in a completely different world and it was AWESOME!  I wish I could remember more but we obviously took too much.  All I can remember is running around inside and outside looking for different sounds which at a non DIPT state I would accept to be normal.  It was quite intriging.\r\nWhen we came down from the (overdose) DIPT we found something which was unbelieveably intriguing.  Many empty jars of paint and Jazz CD's including 'The Butterfield Blues Band', 'Muddy Waters', 'Herbie Hancock', and 'John Coltrane', were scattered about on my floor, and my wall was painted like a psychedelic mural.\r\nI reccomend not screwing around with this substance.  Funny sounds are cool, just like funny visuals with other drugs.  Yet, I believe these things mean more than a good time, as Ken Kesey says, 'Visuals are the Decor of Acid', I believe the minor Auditory Hallucinations that come by from small dosages of the substance are the decor of DIPT.  Sufficient doses of DIPT can make you experiance Sound, you can be physically connected to different noises and sound.\r\nThis is the most underrated drug in history, enjoy it while its legal!  Have fun and be prepared.\n\n\n"
}
