{
 "title": "An Unhappy Trio",
 "author": "Dickie",
 "citation": "   Dickie. \"An Unhappy Trio: experience with Wellbutrin, Modafinil (Provigil), Caffeine (ID 29374)\". Erowid.org. Nov 12, 2004. erowid.org/exp/29374",
 "substance": "Wellbutrin, Modafinil (Provigil), Caffeine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   "  T+ 1:00",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   "  T+ 1:00",
   "100 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)",
   "  T+ 3:00",
   "  ",
   "oral",
   "Caffeine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29374",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 12, 2004",
   "Views: 48365",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was an unintentional trip that ended in the ER.  I'm male, 37 and weigh 165 pounds.  I took two 300mg Wellbutrin XL (spaced about 1 hr apart 6am and 7am).  Don't laugh, I couldn't remember if I took the first dose, and I have been bad about taking it regularly, so I took another (now laugh).  I took Provigil 100mg at 7am too.  These are just regular prescribed meds.  But the Provigil had just been added.</p><p>Around 9am I was happily awake, began my workday, and then had my morning coffee (I'm asking myself why at this point, if I was already awake, but hindsight is always 20/20).  By 10am I was zipping around and felt pretty good. At 11am I became a little uncomfortable - jittery and noticed a slight degree of difficulty speaking.  </p><p>At 11:30 a colleague showed up to go to lunch (we had previously planned this).  By around 11:50, at the restaurant, I was able to speak okay, but when I reached for my glass of water my arm wasn't cooperating.  I couldn't lift it.  I also felt like I was going to faint. </p><p>The room was intermittantly spinning - lack of peripheral vision, tingling in my extremeties, cold sweat - you know the deal.  I told my friend there was a good chance I was going to faint, but I thought I could perhaps hold it at bay.  And this I did.  For about 15-20 minutes.  Meanwhile, the food arrived and I tried to eat but I wasn't able to hold my fork properly.  We decided since I clearly wasn't well and I would probably collapse if I got up, we should call 911.  </p><p>While we waited I was using all my energy to stay conscious. The ambulance arrived, the paramedics assessed.  My blood pressure is high but not dangerous.  My pulse was also elevated.  They recommended going to the ER.  They help me walk out of the restaurant.</p><p>At the ER the fainting sensation was persistant and I was disoriented.  They did more blood pressure tests, took blood, and did pulse oximeter readings.  While things weren't normal, they weren't dangerous.  There was sort of a tingling in the head and my speech wasn't entirely coherent.  Anyhow, they put me in a bed, and started fluids.  As I laid back and closed my eyes I thought, 'fuck - I'm tripping'. I realized my morning mistake and felt awkward.  It probably could have been half-way decent experience, but there's just something about having a needle in your arm and the bright lights of the ER that make everything less-than-optimal.</p><p>By around 3 they brought me lunch and had run in a liter of fluids.  I rested more and at 4pm they got blood results back.  Inconclusive.  Possible dehydration they said.  My strength had returned and I could speak normally and was generally aware of my surroundings.  I didn't feel it was necessary to admit my mistake.  So I signed discharge papers and left.</p><p>So all in all it was a fairly lame experience.  I would warn that there might be a contraindication for high doses of Wellbutrin plus Provigil.  I should mention I had some meth-amphetamine metabolites running around in my system from the previous night's partying (2 healthy sized tokes).  </p><p>I suppose this was all a stupid string of choices, but oh well.  Just beware.</p>"
}
