{
 "title": "Saved by Tranqs",
 "author": "Nervous wreck",
 "citation": "   Nervous wreck. \"Saved by Tranqs: experience with Lorazepam (ID 29391)\". Erowid.org. Dec 22, 2003. erowid.org/exp/29391",
 "substance": "Lorazepam",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "Pharms - Lorazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "29391",
   "Male",
   " ",
   "Not Given",
   "Dec 22, 2003",
   "Views: 26508",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This would have to be in my top three amazing drug experiences of all time.  In March of 2000, for multiple reasons, I had severe anxiety problems to the point where I wouldn't sleep for days at a time.  Finally, it got to the point where I was cracking up.  I showed up at my sister's house after not sleeping for about 3 days, and she took my ass immediately to the local hospital.  So I waited there for about 2 hours, and was seriously thinking of checking in to stay a while, when the doctor came into my room.  He heard me out and gave me a script for Lorazepam and told me, 'Take one of these pills, and if it doesn't help then come back.'</p><p>I went to the pharmacy, tore open the bottle and popped a pill.  Within a half-hour or so, I remember I was riding on the freeway with my sister, I got this feeling like a thousand pound weight just got lifted from my body.  The tightness in my chest was gone.  I had a smile on my face, and I actually began singing.  I'm not making this shit up.  It was the first time in months that I had smiled.  Well, to make a long story shorter, I never went back to the ER again.  I've had ups and downs since then, but I've always got my bottle of L (I call it L) nearby in case of emergency.  Shit, I took 2mg this afternoon :).  One thing I will say about this stuff, it's extremely addictive, and the withdrawls are a god damn nightmare if I quit cold turkey.  I don't take this stuff more than once or twice a month now.  If you have anxiety problems, this stuff is a life saver.  It's also quite enjoyable any time, but has a habit of putting me right to sleep.</p>"
}
