{
 "title": "Fake/Real Love",
 "author": "Anonymous",
 "citation": "Citation:   Anonymous. \"Fake/Real Love: experience with Ecstasy (ID 29410)\". Erowid.org. Dec 22, 2003. erowid.org/exp/29410",
 "substance": "Ecstasy",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29410",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 22, 2003",
   "Views: 8073",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI just want to put a little warning out there about this particular drug.   Before I do this, I want to say that I am not an anti-X person.  I love this drug and it has helped me immensely.  I have learned a great deal about myself thanks to this drug.\r\nNow... Here's the warning.  Over the course of my life I have kept my emotions, my fears, and my sadness bottled up.  I was fearful of intimacy and have been extremely depressed.  I felt ugly, mentally screwed up, and held the belief that no one could ever love me.  It has been life crippling.  Last march I decided to take X. I had finally reached a 'fuck it' point in my life and was willing to do anything.  My first experience was wonderful.  I fell in love with everything.  I told people things I've never said to anyone before.  It felt cleansing.  It felt good.  It felt right.  It was ground breaking for me and I learned a great deal.  I do not regret that experience at all.\r\nMy second time to do x I went looking for that same experience.  I found it.  I told people things i've kept inside, I loved everyone, I fell in love, I was glowing.\r\nMy third time to do x was the same experience.\r\nSo where's the warning?  Well... After becoming an experienced user I have come to realize that intense love, happiness, and passion all seem to be solely based on chemicals.  Duh, right? When you increase your serotonin levels you can fall in love with ANYBODY or ANYTHING.  Sometimes this is not a good thing and it is certainly not a natural thing.  BE CAREFUL.  I have not had a bad experience on X, but I have come to fear how easy it is to alter your chemicals and change your attitude.  Do not confuse your experiences with X as the spiritual, emotional epiphany they seem to be.  It is GENERATED.  If everyone walked around feeling like that all the time the world would not work properly.  Now don't get me wrong, these experiences did help me... HOWEVER... In some ways, because of this drug, I have made myself feel even more vulnerable than before.  I have confessed my love for people I knew for a single day.  I have told complete strangers deep, intimate things about myself.  On X it is very easy for repressed people to unlock ALL THEIR HIDDEN secrets.  Now this isn't always a bad thing, but then again, you might be developing long term relationships/friendships with the wrong people.\r\nFor those of you relying on X as your therapy please know that we are SUPPOSED to feel pain, we are SUPPOSED to feel sadness.  It is ALL part of the human experience.  I used X and I overcame many fears, but as soon as I started using it with the hopes of continuing to unfold the complex blanket that is my psyche, I suddenly realized that certain parts of my personal stories, of my personal world should remain just that... MINE.\r\nHERE are 3 X recommendations (for emotionally repressed people)...\r\n1.  Choose the type of trip you're looking for.  Therapeutical soul searching or recreational.  Both are wonderful and both will overlap into each other. A trip can generally be guided to favor one or the other and you will learn a great deal either way.\r\n2.  If you choose therapeutical, do it with close, close friends or family (people you won't mind opening your secrets to).  \r\n3. Always keep your feelings in check with this ONE QUESTION.  ****'Will I feel awkward tomorrow if I say _________ to this person?'*****  THAT IS IMPORTANT because the chemicals in your brain can override logic and reasoning.  If you feel so happy being with someone, if you feel intense LOVE in some one's company, your guard can be let down.  You are now vulnerable and are a slave to your emotions.  LOGIC is a great protector.  Be open, be free, be happy, and love the world HOWEVER don't completely discard your AWARENESS.\n\n\n"
}