{
 "title": "The Sage Ally ?",
 "author": "william ?",
 "citation": "   william ?. \"The Sage Ally ?: experience with Salvia divinorum (ID 2942)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2942",
 "substance": "Salvia divinorum",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Kava",
   "(tea)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   " ",
   "  T+ 5:00",
   "3 hits",
   "inhaled",
   "Salvia divinorum",
   "(dried)",
   "  T+ 5:05",
   "3 hits",
   "inhaled",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2942",
   "Not Specified",
   " ",
   "Not Given",
   "Dec 16, 2001",
   "Views: 5716",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA close friend, 's' and I decide to smoke sage late one evening--about 1:00 Am. We had both consumed a few cups of kava five hours previously, and a few alcoholic drinks following the kava. Neither of us are very drunk at this time, 's' feels tired. We extinguish all the lights in the cabin and move to a bedroom. I have basic rituals that I follow when smoking the sage: I use a small bowl/dish to put the amount of sage to be smoked into. I then take the leaves from the dish and put them into the pipe. I use a homemade water pipe to smoke from--it is not elegant, but works very well.</p><p>I should say that both of us have smoked sage before, 's' on only one occasion. He had bizarre effects his first time and thus had many expectations surrounding this present experience.</p><p>We use candlelight to pack the bowl and then blow it out before smoking. The room is in absolute darkness. I smoke first: I take a large inhalation, holding it in my lungs for about 10 seconds at most, and exhale. I do this two more times in similar manner. The effects are not staggering. Most notable effects are numbing of my body. </p><p>'S' smokes. He too notices nothing in particular. Body numb.</p><p>I smoke a second time, about 5 minutes after the first, following the same procedure. This time sensations are different. I feel the presence of someone... I have felt this sensation before while smoking sage. I've never seen, nor met directly the presence, only felt somebody near me--as though my actions and behavior may affect another person, entity. I feel this presence and my thoughts comment that its leaving. That it came only to show me it was here, but that there's no time now to talk, no circumstance that's fitting. It means well, its playful. An image of receding accompanies this, it as if I am moving away or the presence is moving away, yet we are both smiling, saying goodbye happily. We were near and now we move apart. A stronger sensation is left in my mind... That the presence I felt was somehow a construction of my own mind. Like, what I thought to be the spirit--the object or emphasis of presence that I felt--was something I invented. This made me feel like I couldn't trust it--its authenticity was tarnished. I didn't smoke after that, and finished the experience perplexed. 'S' I should mention felt little effects with either of his experiences--he said 'I'm tired, I'm going to sleep, I don't have the patience right now.' And we both ended the session with no 'gains.'</p><p>But recently I remember Dale Pendell's words: That the sage can be like a mirror without frames. </p><p>I didn't get it at the time, but the sage ally was there with us. What she showed me was my own tendency to impose meaning. I look too hard to find something, and so I create meaning. I designed the entity that night, based on my previous experiences with sage. The voice of the spirit was further off, distant. Because she spoke through me, I missed it. I thought it was my own message. I didn't take my inquiry a step further that night to realize that there was a spirit presence, just not what and where I thought it to be. All I saw was the picture, and didn't realize it to be a reflection.</p>"
}
