{
 "title": "No One Wins the Conversation Game",
 "author": "Giger",
 "citation": "Citation:   Giger. \"No One Wins the Conversation Game: experience with Mushrooms - P. cubenesis (ID 29444)\". Erowid.org. Dec 23, 2003. erowid.org/exp/29444",
 "substance": "Mushrooms - P. cubenesis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29444",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2003",
   "Views: 6322",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSetting: a friend's house, huge, safe, although not as warm as it could be (december weather in upstate NY can be nasty).  People present include myself, A. who took 1.75g, and two to three other house members who took no mushrooms.\r\nSet:  Pretty good, although it was an impulsive trip, which can lead to problems for me.\r\nA. and I eat the mushrooms at my apartment at 7:00 PM, and then decide to drive back to his house before they set in.  This was a somewhat reckless decision, and I absolutely do not recommend doing this..... mushies can kick in fast.  Fortunatly, he had just swallowed his and not held them in his cheeks so it didn't hit him until well after he got out of his car.\r\nIt was your basic mushroom trip.  At the onset (t+30 minutes) there was mild discomfort / stomach pain / nervousness, but nothing I hadn't dealt with before.\r\nSkip to t+2:00.  Mushrooms are in full effect.  Minor visuals, body feels great, thinking is bizarre to say the least.  So I'm in a comfortable room with A and these two other people, we have been watching Family Guy for the past 2 hours.  A conversation starts, I don't remember what about.  Sex, drugs, rock and roll, the usual, I suppose, but very early on I realize that I'm not completely sure what I'm supposed to be doing.  When do I get to speak?  Have I spoken out of turn?  Am I supposed to say what I want to say, or what I think other people want to hear?\r\nAnd then it dawns on me.  This is The Conversation Game, and I have forgotten the rules.  I know it's a game we play a lot, and most of the time I don't think about it as a game, just as communication, but in this social setting I realize it IS a game:  it's all about getting a word in edgewise, bringing up a bright point before someone else beats you to it, getting your idea out on the table before the topic gets changed. Later, I realize that what was really going on was a pleasant conversation between myself and my friends, but I had become acutely aware of the social mores that govern our interactions, and perceived this set of rules as The Conversation Game.  I was thankful that I had been able to experience this among friends, because if it had occured in a conversation that really DID revolve around one-upping other people and ego-tripping, it probably would have seemed like a very unfriendly game.\r\nNevertheless, the experience has caused me to give serious thought to social interaction, and what is gained or not gained through it.  All in all, I favor social groups whose interactions feel natural, because I know that there have been times when I have been stone cold sober and playing The Conversation Game at college parties and the like, and these were not wonderful experiences.\r\nThe other introspection that I had during this experience is a bit more personal, and thus, perhaps not as relevant to other people, but I'll toss it out anyway.  Basically, I've been feeling unhappy lately, and doing things that I know will make me more unhappy with what seems like intentionality.  I have been searching for a reason for this deviance, and it dawned on me that all any parent really wants is to see their children grow up to lead happy lives, and my clinging to my dark side may be some of the last vestiges of my teenage rebeliousness making themselves manifest.\r\nAll in all, a worthwhile, if impulsive, experience.  Also free since the mushrooms were obtained in exchange for some software, so, everyone wins.\n\n\n"
}