{
 "title": "Large Dose in Nature",
 "author": "Mycophile",
 "citation": "   Mycophile. \"Large Dose in Nature: experience with Mushrooms - P. cubensis (ID 29449)\". Erowid.org. Nov 6, 2007. erowid.org/exp/29449",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29449",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2007",
   "Views: 2883",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have always been impressed by the way mushroom takes possession of the entire body (not only the brain as with MJ) even on low doses. This time was no exception. The onset was very quick and 30 min. after ingestion, my limbs were very heavy and I was walking like a drunk man. Where ever I gazed, the swirling, moving effect around my line of sight was present. The place I had decided to retreat to is a quiet, isolated spot in a mountain nearby. I was afraid not being able to make it. But I concentrated my attention on that goal and in 15 min. of erratic walking, there I was.</p><p>It was about time. I was so weak, I was barely able to move an arm or to keep my jaws closed. I layed in a hollow formed by a tree roots, made myself comfortable and tried to relax. It is a very nice place with view at the mountaintop with a few trees in the fore ground. But what I was seen was iridescent pattern web underlining every single spaces between intertwined branches. There, near the mountaintop, 4 prey birds were flying in circle leaving a shadow image behind them as in videoclip effect. At the same time, I was in awe listening to 'Joshua tree' by U2. </p><p>My thought pattern was very fast, almost instinctive. There was no need for words. Forming words was too slow. I was just following a rapid succession of thought-clusters or impressions complete by themselves on various subjects such as medicine, art, relationship with my loved ones, etc. Just trying to write down some impression, the act of writing, those beautiful and gracious patterns, different hues of the ink on the paper, beauty and meaning of the words made me think that writing was a form of art or miracle.</p><p>I was also conscious at the same time of a parallel speech in my mind which was independent of my own inner speech. It had a life of his own. It 'sounded' French (I am French speaking) but had no meaning. It was so rapid, I failed writing down any word at least phonetically and being meaningless they left no trace in the short memory. Very strange phenomenon. Could be linked to glossolalia ??</p><p>If I paid attention, I could also hear the characteristic 'buzzing' of the tryptamine. But at the moment, it did not seem important so it was just there and I noticed it.</p><p>Another strange effect was that I could feel something and his contrary at the same time. Like feeling all the aspects or characteristics of something at the same time, which reminded me of something I have read; 'There is no good or bad but degrees of perfection'. I was experiencing it within me.</p><p>Coming out of my head, I then payed attention to my surrounding. There were small trees nearby and I could feel their pleasure being warmed by the sun and the way they spread their branches looked like a praise they were making. Beauty was everywhere. Then the song 'One tree hill' by U2 started playing and then it was too much for me. I broke in cry and couldn't stop. All this was too beautiful, too intense, almost painful and I was wondering if one could die from too much beauty. I was overwhelmed.</p><p>It was two hours after ingestion and I was beginning to feel sick. I was out of breath and thirsty but water couldn't help, it just made me nauseous. I saw 2 mountain bikers on a trail nearby, they couldn't see me but I decided I was too exposed. The last thing I wanted was being found by a human being in the state of confusion I was now in. So I moved the best I could in a bush near a pond and there I spent the worst 1 ½ hour of my life.</p><p>I was out of breath, I thought I was dying. I thought I was losing my mind because now I couldn't understand anything. Everything was too complicated. I was sure no coming back was possible. I thought nobody had been that far on shrooms. I felt I did not had the right to do this to my loved ones who needs me etc. Mental and moral torment. But still, I tried to hold on relying on what I had read online from other shroom-heads: relax, you will be ok in a few hours, etc. And eventually this phase ended up. I knew I was out of trouble and back at level 3: I could enjoy the beauty of geometric patterns with eyes closed. </p><p>The landing was smooth and slow and I enjoyed walking in nature. The entire thing from dropping to landing lasted 7 hours. So now three months later, having gathered my ideas, I decided to try to make sense out of it and write a report.</p><p>CONCLUSIONS:</p><p>At first, I romantically thought that I had a rendez-vous with Mother Nature. Instead, I realized I had been convoked by Her. She showed me her strength, her strangeness. She showed me heaven and hell. Every shroom-head who did large dose should be given a medal.</p>"
}
