{
 "title": "Down but Feeling Sound",
 "author": "Ridskid",
 "citation": "   Ridskid. \"Down but Feeling Sound: experience with Triazolam & Clonidine (ID 29442)\". Erowid.org. Jun 7, 2006. erowid.org/exp/29442",
 "substance": "Triazolam & Clonidine",
 "bodyweight": "118 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis - Hash",
   "(plant material)",
   " ",
   "0.5 mg",
   "insufflated",
   "Pharms - Triazolam",
   "(ground / crushed)",
   " ",
   "0.3 mg",
   "insufflated",
   "Pharms - Clonidine",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29442",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 7, 2006",
   "Views: 12972",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The day started with me waking early and eager to find some way to get downtown. Then I called my friend C and wanted to go downtown 2, so after 5 mins of mindless rambling C decided we should take the bus somewhere. We took the bus, got to the mall shopped for mom and dad while C mostly shopped for his younger brother, after that we went back home by a ride from my dad. C and J came over and we cracked open some cold vodka. We drank about 7 shots then smoked some joints and took some mad bong hits. J didnt do any drugs he is straight edge and doesnt do them, dont change the guy he just dont like to get high. After that we obtained some triazolam and clonidine off a friend J knew for $2.After that I went to my house and sniffed all those downers to my head. </p><p>As the full effects kicked in I laid down and rested. I felt very strong wind like effects, that seemed the trough of my center of balance as my arms started to warm up like a heating pad Id often get nauseating rushes, I never puked but still to close for comfort. I also couldnt walk worth shit, my walking was poor. I had blurry vision. My thoughts were always calm and peaceful.</p>"
}
