{
 "title": "The Seeds Actually Worked!",
 "author": "Ch3ssm4st3r",
 "citation": "   Ch3ssm4st3r. \"The Seeds Actually Worked!: experience with Morning Glory (ID 29440)\". Erowid.org. Feb 10, 2008. erowid.org/exp/29440",
 "substance": "Morning Glory",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "630 seeds",
   "oral",
   "Morning Glory",
   "  T+ 0:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "  T+ 1:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "  T+ 2:30",
   "1 bowl",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29440",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2008",
   "Views: 3564",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a thursday night, and my last day of work before our christmas break.  I'm also a college student, and school just let out for a month. </p><p>I love pyschedelics -- but they're hard to come across.  I had tried Mornin Glory - Heavenly Blue seeds before, but it was unsuccessful.  I bought 7 packs of them, washed them with dish detergent and bottled water.  Problem was i didn't crush them up enough.  So anyways, i vowed to get these things to work, and i did.</p><p>It was about 3:00pm, i was with my friend Joe, and we had to be at work by 4:00pm.  Right after work we had our company christmas party at a local bowling alley, so we decided to get the seeds beforehand.  I did not know why the seeds didn't work the first time, and some friend suggested that they might have been old.  So we stopped at a near by store to see if they had any Morning Glory seeds.  They didn't have any, and woulnd't be carrying any seeds until spring, so we went to the orignal place that i had bought them from the first time, a local plant nursery.</p><p>Since i thought that the seeds were kind of old, i bought 14 packs of Heavenly Blue, then headed right to work.  It ended up we were only working for about an hour and a half.  It was 5:30, the company party didn't start until 7:30, so i had some time to prepare the seeds.</p><p>Before my friend dropped me off at home to get ready for the company christmas party, we made a quick stop at his house.  He put some dish soap into a bottle of spring water, i then proceded to put all the seeds into the bottle on the ride home.  </p><p>At 7:00, Joe picked me back up from my house.  The seeds had been soaking in dish water for about an hour and half, to try to get rid of any toxic chemicals put on the seeds to prevent from recreational use, or as an anti-pesticide.  So here i was with a full bottle of dish soap water, and seeds.  I also had an addional 2 water bottles i used for rinsing off the seeds from the soap. On the car ride to the bowling alley for our company christmas party, i prepared the seeds in the following way:</p><p>1) I drained the bottle with all the soap water and dumped all the seeds into a bottle of fresh Spring water. I repeated the process again with the 3rd bottle, getting even more of the soap off the seeds.</p><p>2) Once the seeds were fairly dry and soapless, we had arrived at the bowling alley.  I was not sure if the seeds would actually work, becuase i had though i did everything right the first time, but that did not work.  Even though i had doubts, i was still really stoked about the whole thing.  I realized that i had to have the seeds crushed up really well for them to actually work.  I was lacking any kind of crushing device in my friends car, so i took about 150 seeds at a time, threw them in my mouth, and chewed until they were all crushed up nice and good.  This was not too horrible until about i ate 400 seeds, then this process becuase quite nausiating, but i managed to man all of them.</p><p>3)  To ease some of the stomach nausia, i smoked a quick bowl before we went into the bowling alley to meet all of our co-workers and bosses :D.</p><p>The seeds were all washed, chewed up, and finally down.  This is how the rest of the night went.</p><p>8:00pm:  We walked into the bowling alley and met with all of our friends. Between 8:00-9:30 i was going through alot of somach pain/nausia.  But i just kept quiet and continued to bowl with my friends.</p><p>9:30pm:  I was sick of the stomach nausa, and was no longer high from the previous bowl we had smoked in his car.  So i asked my friend joe for his car keys, and went out into the parking lot to smoke a bowl by myself.  By the time i got to his car in the parking lot, i really felt like i was going to throw up.  I managed not to, got in his car and packed myself a bowl.</p><p>The first hit i took was the best hit i've ever felt from weed.  This could have been the only thing in the world that i wanted to do.  Once i exhaled the smoke, alot of nausia and pain went away, and i felt great!  After each hit, i felt better and better.</p><p>9:45pm:  After having smoked a bowl of weed and relaxing in his car for a bit, i decided it was time to back inside.  When i was walking back to the main enterance, i felt very euphoric, and energetic.  This was wierd to me because when i smoke weed i get very mellow.  This was the first sign that the seeds might actually be working, i was so stoked.</p><p>10:00pm:  I was inside at the bowling alley, i had alot of energy still and was very figgity.  The thing that struck me the most was the grin on my face.  I had this little smile hanging around me for about the next 20 minutes.  Things were looking good.</p><p>10:30pm:  By this time, we were leaving the bowling alley, and we had picked up some beer from a fellow co-worker who was 21.  We drove back to my buddy Joe's house, and parked in his driveway.  We didn't go in becuse we were going to smoke the bong, and couldn't smoke in his house. I packed up a bowl and put some water in my bong.  I took about 4 large hits, got really stoned and just sat back.  By this time i told him that the seeds were definatly working.  The seeds actually worked!</p><p>11:00pm:  We sat here for a while smoking and just chit chating, and i was making an attempt to explain all the wierd shit that i was thinking and going through.  When he was talking to me, i could not tell if i was just *thinking* he was talking, or if he was actually talking to me.</p><p>For the rest of the night, i just relaxed sitting stoned, looking at whatever designs my mind displayed for me.  </p><p>Good luck with your own experinces!</p>"
}
