{
 "title": "Sweating and Vomiting",
 "author": "Flotsam",
 "citation": "   Flotsam. \"Sweating and Vomiting: experience with LSD & DXM (Sold as Ecstasy) (ID 2944)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2944",
 "substance": "LSD & DXM (Sold as Ecstasy)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 hits",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 3:00",
   "240 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2944",
   "Male",
   " ",
   "Not Given",
   "Sep 13, 2000",
   "15753",
   " "
  ]
 ],
 "report": "<p>\nBiostats: male, 36, 150#, hyper metabolism.</p><p>Set: great mood for a great party. moderate energy level, very relaxed. Ate very little that day with a modest bowl of stew around 6pm.</p><p>Setting: rural area gathering of musicians and music lovers, approximately 200 in attendance. Daytime temp near 90, cooling down to upper 60s at night.</p><p>Summary: DXM-adulterated ecstasy can be a big surprise.</p><p>At roughly 9pm, 4 drops medium-high quality liquid LSD hit my tongue. Felt minor stirrings at about T(L)+30 minutes but difficult to quantify due to setting. Full on ascension at T(L)+1. Wonderful vibe wandering from place to place chatting and laughing and dancing. Lots of smiles and friendly people everywhere. </p><p>At T(L)+3+ (just after midnight), I ate a white tablet, approximately the size of an aspirin, with red/brown/purple specks reported by a trusted source to be ecstasy. I then proceeded to dance to 3 songs, each 6-8 minutes in length. The area was very hot, easily in the 80s. By the middle of the second song, my shirt was unbuttoned. By the end of the third song my shirt was off, I was dripping sweat, and I thought it wise to skip a song and get some air outside. This would have been about T(E)+20 and T(L)+3.5 (full bore).</p><p>I expected to be able to cool off outside and I was a bit perplexed by how much I was sweating. It is not unusual for me to sweat a lot on MDMA, but this was too soon for MDMA to be taking effect and it was more sweat than was normal for me. I wandered off to relieve my bladder thinking maybe that was part of it. Instead of the pleasing chill afterward, I got flushed even more and got extremely nauseaus but could only dry heave (another fairly common problem I have with MDMA but again this was way too SOON!). When I returned to my group one of them asked if I had just jumped into the pool. I laid down on the grass, but just couldn't cool off. Got nauseaus again; as I walked off to a discrete area to heave, I noticed my balance was all fucked up. That is what finally convinced me that I what I had taken was NOT MDMA.</p><p>I staggered back to our vehicle with the help of Jetsam where I laid around for 2 hours alternating between freezing and burning up and occasionally leaning out the door to dry heave (I was never able to actually vomit anything), the whole time in a delerious semi-conscious state. We were both worried, although something inside me knew I was going to be OK. Finally, at T(!E)+3.5/T(L)+6.5 (3:30am), I was able to get to my feet and rejoin the party.</p><p>My head was very confused, groggy, and slow. The party seemed unusually sedate for that hour. For the rest of the night, I mostly sat around and talked; watched some musicians, but didn't have the energy to dance much. </p><p>That's the jist of it... head was in a fog the rest of the following day, tho it got better as the day progressed. Upon chemical analysis, the pills turned out to be 240mg DXM with 240mg buffer. </p><p>Given that nothing tragic happened, I am personally glad to have had the experience. I would _not_ want it to happen to others. I have heard many reports of adulterated ecstasy but had never taken anything thinking it was MDMA and discovering it wasn't. It was rather boggling to me at the time, especially under the influence of acid.  My only real sense of loss is the more than 2 hours I missed interacting with people I really dig. </p><p>In closing, I want to send a big FUCK YOU to the people who make and distribute this shit under the guise of MDMA. The profit margins on pure MDMA are astronomical enough without trying to squeeze another 25 cents out of each pill. Had it been put forth as DXM, people still would have done it and probably paid as much, but would have done so with different intent in mind and likely not at the height of the party. Greed is the bile of human thought.</p>"
}
