{
 "title": "Smeared Across Multiple Realities",
 "author": "Billy Cuts",
 "citation": "   Billy Cuts. \"Smeared Across Multiple Realities: experience with 2C-E, Cannabis (ID 29452)\". Erowid.org. Dec 23, 2003. erowid.org/exp/29452",
 "substance": "2C-E, Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29452",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 23, 2003",
   "Views: 8766",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Around 8:40 AM yesterday I took a magnesium supplement and 30mg of 2C-E. 9:15 I felt very very nauseas and vomited. I vomited again around 9:30. First alerts were noticed around 9:20 or so, as I was coming back from the bathroom. I was chatting with some goons on irc when it started to come on strong. Around 10:00 AM things were getting very weird. I decided to drop off the computer for a bit, although I would check in peridically throughout the trip. Smoked a bowl at this time.</p><p>I layed on the couch for a bit. There was definitely some physical discomfort. Stomach pains, tight chest, raised temperature. It really felt like I had the flu or something. I kept forgetting that I had taken 2C-E and for some reason I believed I had taken some potion made from plants in the jungle. I was having CEV of jungle vines growing through my vision. Very disorientated. Smoked a bowl of cannabis to relieve some of the tension and unpleasantness. </p><p>I went into my bedroom and put a Grateful Dead show (Cornell 5/8/77) in my CD player and put on my headphones. After about 15 minutes or so of listening to the show, I was AT the show. I mean, I felt as though I was standing in crowd at a Grateful Dead show. It was like a completely real lucid dream. I could look around, see the stage, smell the pot and patchouli in the air. Amazing! I stayed in this little trance for the majority of the first set, right up until the end of Dancing in the Streets. When they left the stage, I came out of it, visuals were phenomenal with open eyes; Merging, morphing, rainbows and fractals on everything in the room. Put in Shpongle - Are You Shpongled to see what would happen. Closed eye visuals were 3D and morphing to the beat of the music. It was very intense! It was almost abrasive. After awhile of that I had to turn off the music. It was too much of a burden on me. </p><p>I found when I would just lie down with no light or sound and let myself go I could easily go out of body, or go to another world, or create a movie, anything seemed possible. The control I had was amazing. I spent up until around 2:00 just lying in my bed exploring these new worlds. Every now and then I'd get jolted back into reality for some reason or another. </p><p>I was still tripping quite hard after 2:00 when I finally decided to leave the bed for good. Meditated for around 15 minutes at this time. It was almost like instanteous bliss. Dropped right into nothingness. Excellent... </p><p>Took some 5-HTP and then played with this program called ZoneRings for awhile and watched some ridiculous TV. Chatted on IRC and a friend came by. We chatted and smoked for a bit. I was very hungry at this time. Ate some crackers and a granola bar. Came back down to baseline around 5:00 or so. Although, throughout the night colors were much more pronounced. The afterglow stays for quite awhile.</p><p>I found this dose to be very intense at times, but also allows me to 'get some work done.' I had many revalations about all aspects of my life. The introspection is great. I'd rate this chemical up there with lsd and psilocybin. It's one of the magical ones. </p><p>The only down side to the trip was the nausea and vomiting as well as some physical discomfort. Other than that it was a wonderful experience. </p><p>This dose is probably not right for everyone, but it's just right for me I'll probably take 50mg of phenegren suppositories next time to combat the nausea. Will definitely be doing more work with substance in the future.</p>"
}
