{
 "title": "Avid User, Yet New Experience",
 "author": "Chiller471",
 "citation": "   Chiller471. \"Avid User, Yet New Experience: experience with Cannabis (ID 29461)\". Erowid.org. Apr 23, 2007. erowid.org/exp/29461",
 "substance": "Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29461",
   "Male",
   " ",
   "Not Given",
   "Apr 23, 2007",
   "Views: 3300",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been a pretty heavy cannabis user for the past 6 months, usually smoking either every day or every other day.  At one point or another I had gone 4 nights without smoking and was questioning when I would be smoking again.  That same night my friend calls me for a session at his house.  It was going to be my most usual smoking buddies joining me at one of their houses so I thought it would be a nice fun, not too out of control, evening as usual when I smoke with my friends.</p><p>We started the first bowl at about 10 pm, my friend had told me that this was 'really strong stuff'.  As soon as I took my first hit I knew this stuff was stronger than usual as I was coughing as I had never done before.  We finished the first bowl and I was feeling good, I was really high and in a friendly surrounding.  The effects of the first bowl had not even reached their peak when one of my friends started packing the 2nd bowl.  I wasn't sure if I was ready for it but decided to go for it anyways.  </p><p>It was at this time that I started feeling different than I ever had before.  As my friend passed me the pipe I noticed that I had lost all sense of feeling in my mouth, and that my sense of death was very off.  As my friend passed my the pipe in my eyes I could not tell if I had ever grabbed the pipe from his hand, and most of all I could not feel the pipe in my mouth!!  All I could do was try to concentrate to make sure I was breathing in some but I could not feel a thing.  It felt as if the pipe was coming towards me and then backing away, and it repeated this pattern 7 - 8 times. All the while the pipe was really in my mouth and I had been breathing in for what was probably 30+ seconds.  I had trouble passing the pipe as well seeing as my sense of depth was shot.</p><p>At this point all I could tell my friends was that 'I'm sooo high' and I probably repeated this line 6-7 times.  As soon as we finished the bowl (I don't remember it being finished) we started watching a movie, and at this point is when I felt a sense of numbness around my upperbody.  I could control my arms, but I could not feel them moving, it is something I have never experienced before.  I had no idea how I was doing it, but it was occuring in front of me.  It felt as if I was waving my arms through the mystical ether that earlier scientists had described, and no matter how hard I tried to take away this feeling I could not.</p><p>Feeling a little scared at these sensations I had never experienced before I decided to just stay still  and not risk any movement.  I'm not sure whetehr to describe this as an unpleasant or pleasant experience, all I can do is  describe it as something new.  This cannabis was a strain I had never tried before, and I'm not sure whether it was the fact that I had not smoked for 5 days or the fact that the weed was that potent, but it was definetly a new experience.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>I drove home later that night 2 hours later and the although I could see fine and actually feel my limbs at this point, the ride which normally takes 25 minutes seemed to take 5.  This night surpasses the 'highest I've ever been' as I can not even fully describe what was going in my mind when I was at my peak, all my friend could say to describe it was that 'you were gone'.  Once again I'm not sure if it was the weed or the days that had gone by since I had smoked, but that night was one of the most intense experiences I have ever had, and if I had a choice to repeat it I probably would.</p>"
}
