{
 "title": "Spa Day",
 "author": "Eric",
 "citation": "   Eric. \"Spa Day: experience with Carisoprodol (Soma) (ID 29491)\". Erowid.org. Dec 30, 2010. erowid.org/exp/29491",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1400 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 0:30",
   "1400 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29491",
   "Male",
   " ",
   "Not Given",
   "Dec 30, 2010",
   "Views: 8649",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had never tried Somas before, only heard tales of this mysterious drug.  I stumbled upon a full bottle of the 350mg pills when my friend complained to my dad of a soar hand.  He had punched something and broke it the night before while he was extremely intoxicated.  So I get the bottle, come online and type in 'CARISOPRODOL', to learn more about the drug.  Seemed very Codiene like so I popped about 4 of them at noon.  After a little while I felt nothing, so out of frusteration I popped 4 more at 12:30 and my friends and I decided to go to the hot tub at my grandfathers country club.  That's where my memory of that whole day ends.</p><p>We didn't have a key to get in, so we broke in and upon entering the hot tub there was 2 cops watching us in the hot tub... we were so fucking out of it that we didn't even know and carried on with our business.  I was incoherient and the cop asked me how we got in here and I just remember telling him that I didn't want to talk to him because I was very 'tired'.  Somehow, the cop got my moms phone # out of me or one of my friends and called her and told her that I was unconcious in the country club hot tub.  She told him to send my ass home ASAP.</p><p>So my buddy drove us all home (I guess?) and I got carried into my house and my mom told me I face planted in the garage and it was scary to see me so wasted.  I passed out for several hours, word is I was foaming at the mouth.  I slept it off, never seeked any medical treatment and woke up around 8:00pm or so and began walking around my house blindly.  I knew I had to pick my girlfriend up from the air port so I got in the car and went.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  The lines on the road were blurring... it was like I was tripping.  The lines kept twisting into each other and I kept swirving all over the place, it was crazy.</p><p>To say the least I didn't really have a pleasurable experience with this drug.  It's like 3 days later and I still feel all groggy and weak... I think due to the overdose.  Later.</p>"
}
