{
 "title": "I'm Still Tingly",
 "author": "Bob",
 "citation": "   Bob. \"I'm Still Tingly: experience with Inhalants - Duster (ID 29495)\". Erowid.org. Jun 12, 2007. erowid.org/exp/29495",
 "substance": "Inhalants - Duster",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29495",
   "Male",
   " ",
   "Not Given",
   "Jun 12, 2007",
   "Views: 8629",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>Two nights ago, I was bored and so I decided to take a hit (maybe half lungs full) of a compressed air product used for blowing dust from computers. The chemical is difluoroethane. I had done this before, followed by the general effects of feelings of disconnection, pulsating sound hallucionations, etc. But the most prominent effect for me has been a strange tingling sensation when I touch things, or in general. It's difficult to explain. It's almost anasthetic like. After taking this hit, I got the regular effects. And then they eventually faded away and I felt normal again. So I stayed up a little while doing some stuff on the computer.</p><p>I hadn't done any since then, but the next night I went to the bathroom. I took a shit, and a few moments after leaving the bathroom, *bam* I got the sensation again, as though I had just taken another hit, even though I hadn't done it in 24 hours. This scared the shit out of me. It didn't make sense that I'd be affected by something that had worn off 24 hours ago. I didn't get it. To make matters worse, the sensation didn't go away. Several hours past, and I still felt 'tingly.' I searched usenet and the usual forums for similar complications, and found none. I figured that I must have swallowed some of the gas into my stomach and going to the bathroom must have caused my body to abosrb it or something like that. So I decided to go to bed and hope that it was gone by morning.</p><p>The next day when I woke up (The day I post this), I still had the feeling. I continued to have the feeling for 7+ hours, even as I write this, although I don't notice it unless I grab something or sit down. I hope it will go away, although it could take several days since it hasn't gone away already. I hope it does go away.  I really hope it goes away, I am scared to think about it. The effect's intensity seems to have varied during the day. Sometimes it's not very noticeable, and other times it's very noticeable. I am worried that maybe I permanently damaged by brain or nervous system or something with this crap. I don't recommend using it. In fact, stay the fuck away from it. I know I will never touch the shit again.</p>"
}
