{
 "title": "Like a Ghost of Me",
 "author": "Chris",
 "citation": "   Chris. \"Like a Ghost of Me: experience with Cannabis & Diazepam (Valium) (ID 29536)\". Erowid.org. Dec 25, 2009. erowid.org/exp/29536",
 "substance": "Cannabis & Diazepam (Valium)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1999",
   "29536",
   "Male",
   " ",
   "Not Given",
   "Dec 25, 2009",
   "2897",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'd smoked Weed about fifteen times before this.  Sometimes, I had felt nothing, and sometimes I'd felt a little relaxed.  I always thought it was a big disapointment though.  All the hype, all the rap songs, and whatnot talking about blazing it.  Yet, for me, it was quite a waste of time and money.  Well, one day a friend of mine came over, and offered to smoke me out for free.  So, I figured why not?</p><p>We started smoking, and within about five minutes it hit me.  I'd never felt like this before.  It felt like my lungs were on fire.  I kept burping to try and stop it, hoping to somehow release the heat.  It didn't work, the more I thought about my lungs burning the more it hurt.  My heart was beating like crazy.  My vision was..... well... bizzare.  If I looked left, and then looked right I'd still see what I was looking at on my left for like five seconds before my brain would process what I was now looking at.  </p><p>It was terrible, I feel to the ground, and laid down.  I tried to catch my breath. It wasn't working, I felt high levels of anxiety.  I got up to look in the mirror, hoping to calm myself down and tell myself it would be okay.  When I looked in the mirror, I saw myself, but it wasn't me.  It was like a ghost of me, I could see through myself.  This made me panic more.  I though I was having a heart attack.  My friend sat me down and gave me some water, and a slice of pizza.  When I started eating the pizza I relaized I couldn't taste anything.  Then I also noticed that I couldn't feel my tounge.  I started think that I might choke because I couldn't feel in anything.  </p><p>My friend eventually had to leave, and my Dad came home.  I had to tell him how I was freaking out on a bad trip from doing drugs.  My parents always thought I was a super straight edge kid too, so this came as a shock to them.  So my Dad was holding me because I was shaking so hard.  Luckly my Mom came home shortly, and gave me a Valium.  It made me feel much better.  I slept for about four hours, and woke up still feeling terrible, but it was just normal sick, not freaky mind-fuck sick. </p><p>My girlfriend came over and had me drink lots of water to flush my system out.  Since that day with my little experiment with bud I've experianced Panic attacks, depression, and mania.  I never had any mental dissorders, or even minor problems before hand.  Not to mention all my old stoner friend thinking I'm a pussy for not being able to smoke weed.  I had to drop out of school for a year too.</p>"
}
