{
 "title": "Worked with Few Side Effects For Me",
 "author": "coruslunarian",
 "citation": "Citation:   coruslunarian. \"Worked with Few Side Effects For Me: experience with Venlafaxine (Effexor) (ID 29542)\". Erowid.org. Jul 28, 2006. erowid.org/exp/29542",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29542",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2006",
   "Views: 18533",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBACKGROUND\r\nI've had mild to moderate depression for most of my life.  I've never been suicidal, but I can tell you I thought about it a lot.  Since 5th grade I've been in therapy and counseling off and on.  It didn't work, other than convincing me that other people truly cared.  It wasn't until I graduated from college that I finally got a handle on my mental condition enough to like myself and pull my bootstraps enough to get my head above water.  \r\nHowever, it still felt like I was treading the pool with no bottom in sight.  I was walking around with a storm cloud behind my eyes for weeks at a time, then it'd go away, the sun would shine, and I'd feel fine and dandy for a while.  But the physical depression always returned and nothing worked.  Changing my mental image of myself didn't work.  Changing my diet (foods like pizza, pasta, bread, and colas always fucked up my moods) didn't work as well as they should have.  Even excercise wasn't enough to snap me out of my cyclic depression.\r\nWELLBUTRIN\r\nSo I went to a psychologist or psychiatrist or whoever the asshat is that can prescribe anti-depressants.  I tried Wellbutrin for a while, but right from the start I got all the bad side-effects: sleeplessness, anxiety, nausea (bad nausea), and dizziness.  The quack who got kickbacks from the makers of Wellbutrin insisted I stay on it and wait for it to actually make a difference to my mood, but after 2 months on it, I was still getting depressed and the side-effects were really bad.\r\nEFFEXOR SIDE-EFFECTS\r\nAfter about a year with no meds, I decided to try again.  A friend of mine had some 75mg samples of effexor, enough to try taking it for 2 months and see how it went.  After 2 weeks I felt a little better, with only two side-effects: anorgasmia and tremors.  For a whole week I couldn't get an erection, only semi-hard.  For two more weeks, I could get hard but got no pleasure from sex at all.  But after a month, I am a fully functioning sex-machine.  I still have tremors though.\r\nThe good effects from Effexor outweighed the tremors by a long shot.  One unlooked-for side-effect of the anorgasmia was that I no longer focused on sex.  I am still horny as hell, but when I get a hard on it's no longer an instant distraction.  Less solo activity has also given my unit some R&R and I swear my erections are fuller, and god are the orgasms better.  I still take a little longer to achieve, but otherwise I'm better off sexually than before I started taking Effexor.\r\nEFFECT ON MOOD\r\nAlso, my moods have really evened out.  I haven't had a serious bout of depression since starting Effexor, or perhaps a few weeks after starting to let it get into my system.  I have started thinking that I can finally talk to girls, as well.  This may not be a direct effect of the meds, but an effect of not having a unhappy storm cloud in my head.  I think people can definately tell I'm happier and I smile more often now.  Without the periods of depression my self-worth has hit a new high, and dating no longer seems like such a scary thing.\r\nRECREATIONAL DRUGS\r\nPersonally I was bumbed when I found out I couldn't roll while on Effexor, but there are plenty of other rec drugs that I can still take.  \r\nFINAL VERDICT\r\nI know many people who bitched about how Effexor ruined their lives.  I've also heard a lot of people speak very highly of Wellbutrin.  Wellbutrin didn't work for me, but Effexor does.  Everyone has their own body chemistry and I'm sure there are many people who take Effexor who aren't susceptible to any kind of placebo effect.  I was extremely critical of Wellbutrin and any other SSRIs before taking Effexor.  I was absolutely convinced that Effexor wouldn't work for me, like Wellbutrin.  There's no reason I would have convinced myself it was working if it didn't actually have a good effect on me physically.  Good luck to everyone seeking to get rid of the thunderclouds in your head.\n\n\n"
}