{
 "title": "The Supreme",
 "author": "m7w",
 "citation": "   m7w. \"The Supreme: experience with Cacti - T. pachanoi (ID 29545)\". Erowid.org. Dec 28, 2003. erowid.org/exp/29545",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "15 in",
   "oral",
   "Cacti",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29545",
   "Male",
   " ",
   "Not Given",
   "Dec 28, 2003",
   "12306",
   " "
  ]
 ],
 "report": "<p>Myself and a friend aquired a 4 year old San Pedro cacti from a local private retailer in a city near where we live.  We began by removing about 30 inches from the cacti (about two 15 inch cuttings), with a diameter of about 3.5' and chopping it into very fine half-inch chunks.  We then took the chunks of cacti and froze the material in a stainless steel pressure cooker for 24 hours in order to break down the cell walls to make the active mescaline alkoid more extractable.  After the cactus thawed we added enough water to submerge the plant material and then proceeded to pressure cook the San Pedro for 1 hour.  We pored off the alkoid saturated water into another pot and boiled off as much water as possible until we had a semi-syrup like mixture that had a dark brown color.  We split the remaining extract in two, which ended up being about 8oz (1 cup) total (each), which we then proceeded to consume. It tasted like a mixture of cucumber and soap, not unbarable, but extremely unpleasent. I'm afraid there is nothing that can be done to coat the taste.</p><p>I should mention that we both drank some freshly squeezed lemon juice (which is acidic) to neutralize the mescaline in our stomachs (which is a base).  I don't know if this is logical, but it seemed so at the time, and it appeared to work.  Niether one of us experienced any nausia, which we had on previous mescaline adventures.</p><p>After about 2.5 hours of waiting the first tingling vibes of the mescaline began to work its way up our spines.  I began to be overwhelmed by fits of laughter and giddyness.  We were watching Monty Pythons Quest for the Holy Grail, an absolutely hilarious flick while sober, but entirely histerial while on mescaline.  The visuals I saw were quite differnt from what I have experienced on mushrooms, DXM, or LSD.  They weren't as dynmaic and fluid but more static.  I saw Native American-like hyrogrlyphics that would slowly ovulate with intense color in a very slow and floating manner.  The christmas tree that was near by was absolutely amazing.  Every light held its own auora of brilliance.  I could disect margins of color in everything I looked at.  My eye sight seemed emmensly enhanced.  I felt as though I could zoom in on any specific object and analyze its every detail.  The closed eye visuals had a very plastic or waxy quality.  They abrubtly shattered into differnt images as apposed to the fluid transitions provided by mushrooms or LSD.</p><p>The body high gave me the same jaw clenching and euphoria as MDMA.  I was overwhelmed by empathy, inebriated into self acceptance with a psychedelic visual twist of bliss.  I became entranced with the detail and entricacy of every last molecule in my existence. I wanted to know how things operated on a deeper more calculated level. I spent most of my time studying my surroundings.</p><p>At about t+4h from initial digestion I became very disappointed because it seemed the mescaline had stopped working.  For about 15 minutes I was entirely sober, I didn't feel a thing.  After another 15 minutes I was back where I wanted to be once more.  I can't explain this anomoly.  This happened two more times that night. It would simply stop effecting me and then come back as fast as it had left.</p><p>We spent our night marveling at nature, dancing insanely to bongo music, and laughing irrationally for hours.  I would have to say, that out of all of the drugs I have consumed, mescaline is by far the supreme a.k.a. The Dusenberf of drugs.  I have tried mescaline via San Pedro extract five times amd have never been dissappointed.  It is truly a significant source of insight and harmony!</p>"
}
