{
 "title": "Free Falling In My Head",
 "author": "sands of time",
 "citation": "   sands of time. \"Free Falling In My Head: experience with Syrian Rue (ID 29552)\". Erowid.org. Dec 29, 2003. erowid.org/exp/29552",
 "substance": "Syrian Rue",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29552",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 29, 2003",
   "Views: 20078",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well this was my first experience with psychedelics and I loved it! The taste was terrible but worth it. I prepared for the experience by not eating any tyramine high foods such as cheese for obvious reasons.</p><p>I started by grinding about 6 grams of the seeds in a coffee grinder. </p><p>9:30 PM: I put the powder in a glass of water and began to drink. The taste was awful but I managed to drink the whole thing in about 30 minutes. </p><p>10:00: I was feeling different, definitely not baseline but no visual changes were noticed. </p><p>10:30: A body buzz was noted but still no visual changes. </p><p>11:00: My mind was becoming more and more clouded and things appeared confusing at times. The buzzing would come in waves and with each progressive wave the clouding became more and more intense. Slight stomach discomfort was noticed but never a problem at all.</p><p>11:30: I noticed that when I turned my head or looked in a different direction, there were tracers. I was intrigued to say the least and I repeated this several times. When I moved my hands however this  produced no tracers. Things appeared strange at times and full of life. Thoughts began to flow freely. Walking became somewhat of a challenge as balance was altered.</p><p>12:00: This was the peak. The body buzz was at it's highest point. It felt somewhat like very strong weed or 6 beers with visuals. Tracers continued when I turned my head, ect. Now things rippled as well. Moving my head caused things to appear warped. My mind was extremely clouded but at the same time thoughts flowed wildly with no control. Trying to control my thoughts caused slight fear. I was not tired at all and my heart was beating faster than normal. Sense of time was extremely altered. An hour passed in what I thought was 3 hours. Balance became even harder, like being drunk. Everything appeared strange and confusing but beautiful at the same time.</p><p>1:00: The body buzz was getting weaker but still noticeable. Visuals remained and thoughts continued to pour out. The confusion was dulling out and I entered a very peaceful state. I was feeling very content.</p><p>2:00: The body buzz continued getting weaker while the visuals also became less noticeable. Around 2:30 I decided to go to sleep. This was no problem.</p><p>Throughout the experience there was slight stomach discomfort. This however was not much of a problem because I was laying down most of the time. Moving caused more discomfort. I woke up with slight stomach discomfort. The smell of the seeds is sickening. The experience however was great and there is a slight afterglow.</p>"
}
