{
 "title": "Very Nice Experience",
 "author": "Bob",
 "citation": "   Bob. \"Very Nice Experience: experience with Amanitas - A. muscaria (ID 29578)\". Erowid.org. Dec 30, 2003. erowid.org/exp/29578",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "2 capsls",
   "oral",
   "Amanitas - A. muscaria",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29578",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 30, 2003",
   "Views: 38568",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI first met the Red Fellow in 1982, but it's been a while.  I don't encourage anyone to eat this unless they are fully aware of the risks and benefits and are *positive* of the identification of the mushroom in question.  These red-orange beauties were picked by yours truly in northern Coastal California.  I also take milk thistle capsules, 'just in case.'<br>The caps were dried slowly on a metal screen in front of a radiant heater (two nights drying -- stored in cupboard during the day), which gives them a nice appeareance and does not appear to make them too 'harsh'.  Tea was made by bringing about 12 oz. of water to a FULL BOIL, then adding the caps to the water AFTER it is removed from heat and letting the mixture sit for 30-45 minutes.  This reconstitutes the caps and creates the tea.  Then the tea was strained and poured into another cup.  The caps were disposed of -- I suppose you could eat them, but I don't.<br>Drank about 6 oz, then waited two hours.  Then I drank another 3 ounces, waited an hour and drank the final 3 ounces.  I can't say that I enjoy the taste of Amanita Tea, but it's tolerable.<br>The effect of the Tea is not too strong.  Slight visuals: 'things look a little bit alive' and a feeling of well being.  I played with my 3-year-old for an hour and a half, and enjoyed every minute of it.  Very much a relaxing tonic.<br>However, I have the feeling that had I prepared the tea with three caps, instead of two, using the same method, the experience would have been better, probably significantly stronger.<br>The effects last, maybe 4 or 5 hours.  Some mild 'flash backs' in the following days, but not unpleasant at all.  <br>I've read a lot of negative reviews of Amanita Muscaria, but in my humble opinion it really is something of a wonder drug.  Besides the enjoyable buzz, I felt energized and the nasty cough that had been tormenting me for days disappeared, pretty much for good after I drank the tea.<br>For the record, I've eaten Dried Amanita, and made tea by boiling dried caps, and smoked the dried caps.  This method -- a slow tea as it were, has so far been the best.\n\n\n"
}
