{
 "title": "Reflections on Brownie Making",
 "author": "CynicalMagician",
 "citation": "   CynicalMagician. \"Reflections on Brownie Making: experience with Cannabis (ID 29606)\". Erowid.org. Dec 31, 2003. erowid.org/exp/29606",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29606",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 31, 2003",
   "Views: 24375",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nEarlier this year I procured a large ziplock freezer bag full of marijuana shake (the leaves, stems, and tiny buds left over from harvest). This stuff is pretty much unsmokable, but there is THC in it. We talked about making butane hash oil, but eventually decided to make drug butter, and subsequently brownies. Our procedure was as follows:<br>1) Grind up the shake until it was virtually powder.<br>2) Melt a pound of butter with a touch of cream in a big metal bowl.<br>3) Set up a double boiler with the metal bowl and a pot of water, and stir the powdered shake into the butter.<br>4) Let the double boiler cook at a low boil for about 8-9 hours, heating/melting the butter and dissolving the THC into the fat.<br>5) This ugly and plant smelling butter/pot sludge was strained in a bodum in about 5 stages, leaving the leftover greenery on the bottom and yielding a greenish liquid butter.<br>6) The solids were thrown in the trash and the 'magic' butter was subsequently used to replace regular butter in a typical brownie recipe. We made 2 large trays of 6 pieces each.<br>The first night we did them was halloween and myself, my girlfriend and four other friends each ate a piece. About 30-40 minutes after eating mine on a relatively full stomach, I was coming up fast, and I knew I was going to be very very stoned soon.<br>My suspicions were correct, and I got really messed up. At first it was pleasant, but about 3 hours into the experience I started getting very withdrawn and nauseous. My gut was in turmoil, and eventually I knew I had to go worship at the temple of the porcelain god. For the next hour or so I was in and out of the bathroom, violently puking and more stoned than I had been in quite a while.<br>Long story short, half the people that night ended up with similar experiences as mine, vomitting hard. I tried the brownies again, eating about a third to half of my previous dose, and this was very good from start to finish. The third time was basically the same as the first, eating about 2/3 of a piece and violently puking for a while. I eventually threw the remaining brownies out.\r[Erowid Note:  nausea, vertigo and other unpleasant effects are quite common on high doses of cannabis, especially from oral administration.]<br>Another factor was alcohol. Each of the times I had bad experiences I had had a drink or two earlier in the day. I was not drunk or buzzed, but it was in my system. I generally have a weak stomach when it comes to drinking or shrooms or whatnot, so the alcohol most likely contributed to the negative trip.<br>In closing, I will try to make these brownies again, because the stoned was great when I wasn't puking and I think they have potential. My lessons learned:<br>-Don't combine brownies with alcohol in any amount.<br>-Cook the butter for a much shorter time.<br>-Leave out the stem from the shake. If nothing else, it makes it much harder to strain because of the 'cottony' fibers it produces.\n\n\n"
}
