{
 "title": "Trippy But No Fun",
 "author": "Average Cracker",
 "citation": "   Average Cracker. \"Trippy But No Fun: experience with Diphendrinate & Cannabis (ID 29612)\". Erowid.org. Nov 7, 2007. erowid.org/exp/29612",
 "substance": "Diphendrinate & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "12 tablets",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29612",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2007",
   "Views: 5280",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was going over to my buddy's house over the summer for a regular night of smoking some good old-fashioned weed. On my way, I decided that I wanted to trip, having not actually tripped in a while. I knew that dramamine was supposed to be pretty crazy, and I tried it once before, but took the pills 6 at a time, yielding virtually no effect. On my way over I stopped by a convenience store to pick up a bottle. Once I got to my friend's, we began smoking immediately, as we usually do. After a few bowls, I decided to take my pills. I downed all 12, they tasted like shit. Shortly after I took the pills a bunch of his dealer's friends came over. We smoked a couple joints and a few more bowls, everyone started talking and I continued to just sit there, as I am not very social with strangers.</p><p>About an hour after ingesting the pills I started to feel it coming on, and the effect struck me as quite powerful. I decided I'd better tell his mom to disregard any possible calls from my parents, just in case I would be too fucked up to talk to them. As I stood up and began to walk to the stairs it felt as though I were moving in slow motion. My legs were quite heavy and my vision choppy. I stumbled past everyone and went upstairs. I found his mom and told her to tell my parents I was gone if they called. I found it quite difficult to speak and words seemed foreign coming out of my mouth. I glanced at the wallpaper and saw energy running across the patterns. After this I began to dislike the way I felt. I am guessing that it was written all over my face because her boyfriend handed a bowl to me and told me to hit it so I would relax a little.</p><p>After smoking I returned downstairs to find that everyone but my friend and another that I knew had left. This fact helped me to relax a bit more. The next portion of the night was the only enjoyable part of my trip. Staring at his bedroom wall I saw different faces forming out of the stone that it was made of. If I tried to focus on the faces, they would vanish and it would be just a wall again. I also found that when looking at certain patterns, I saw what appeared to be a steady rising vapor distorting whatever was behind it. I looked down at my leg and saw bugs crawling under my skin. This was all desirable because these were the first drug induced hallucinations I had ever had.</p><p>After a while the feeling began to overwhelm me and the difficulty of breathing began to make me feel uneasy. I went upstairs again, with my friend this time. I sat on the couch and watched patterns run across the floor. He said something to me and it sounded like nonsense, unsure if it was the drug or him fucking with me, I ignored him. I continued to sit uneasily. I went to take a drag off my cigarette and found there was no cigarette in my hand, nor one lit anywhere. I took one out of my pack and raised my lighter to it with my other hand. Only half to my surprise there was no lighter in my hand. I took it out of my pocket ant lit my cigarette, took a few drags, and set it down on the ash tray next to me. I forgot about it and it burned all the way down, I only noticed once it was to the filter.</p><p>I spent the rest of the night waiting for the trip to end, and according to my friends I looked 'really freaked out' which was partially the truth. The next day I awoke feeling like I was a zombie. Pot smoked only added to this feeling. I felt the same all day through work, and it wore off toward the next night.</p><p>Dramamine creates hallucinigenic effects but in my opinion is no fun and makes me physically and psychologically uncomfortable. I have since wondered about the possibilities of combining this otc with dxm, as I am a huge fan of dxm. I imagine it would be quite interesting.</p>"
}
