{
 "title": "Absolute Nothingness",
 "author": "Fate",
 "citation": "   Fate. \"Absolute Nothingness: experience with Salvia divinorum & Alcohol - Wine (ID 29659)\". Erowid.org. May 7, 2006. erowid.org/exp/29659",
 "substance": "Salvia divinorum & Alcohol - Wine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29659",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "May 7, 2006",
   "Views: 7682",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nFirst I'd like to mention that I have had very few experiences with any drug.  I smoked pot for about a year, done shrooms once, and DXM and Dramamine a few times.  Now with that said onto the experience.</p><p>A friend and I went to a larger city to party on New Year's Eve and noticed a small 'gift' shop.  We went in and I noticed Salvia 10x.  I had read a lot about it and had wanted to try it for some time...what better time than New Year's Eve?  I bought a gram and went off to a party.  </p><p>At the party I had about 3 bottles of champagne and my friends had the munchies so we took off to a grocery store.  One person went in and the other 2 stayed in the car with me and I thought what better time to try the Salvia. I loaded a bowl and smoked it.  I felt pretty relaxed and had the distinct feeling that something just wasn't right with the world.  I decided another bowl would help so I loaded it and smoked.  </p><p>This is where everything started and I apologize if I'm vague.  Much of this is a blur and there really doesn't seem to be words in the English language to describe what this was like.</p><p>The first thing I noticed was that I was seeing snake-like things everywhere and this caused me to laugh uncontrollably.  Then one of my friends was 2-D for the most part.  The front part of his body was there but from the ears back wasn't.  I mumbled something about him not having a brain and went on to try to say 'I feel weird guys.'  Well, I couldn't pronounce weird.  I tried a few more times without success and looked down at my hand which seemed to be holding something.  I was holding the word weird.  I held it up for them to read for themselves but they couldn't see it.  I attempted to read it to them but once again I failed.  Then I got the bright idea to smoke another bowl.</p><p>After the bowl I started feeling dizzy and like I was being pushed back into the car's seat head first.  As my head penetrated the seat the feeling of being extremely stoned and drunk was appearing.  At first the seat suck me in slowly but then it hit my neck and I just fell back through it.  I remember being in complete blackness for a while and possibly having a mental conversation with something.  I came to in a flash not knowing who these people were or where I was.  After about ten minutes I was convinced I knew them and they were friends.  They had said I was mumbling incoherently for the past twenty minutes and was just staring out the window.  </p><p>Thats about all I remember but next time I'm going to try it sober in a safe place.  This stuff is extremely powerful and had I not been drunk it probably would have scared the piss out of me.  Oh yeah, the next day I felt changed.  Everything felt right and better than ever. My outlook on life seemed better and I was in a great mood despite a massive hangover.</p>"
}
