{
 "title": "Provigil Sucks as Recreational Drug",
 "author": "kitty",
 "citation": "   kitty. \"Provigil Sucks as Recreational Drug: experience with Modafinil (Provigil) (ID 29650)\". Erowid.org. Nov 12, 2004. erowid.org/exp/29650",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "116 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Modafinil",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29650",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Nov 12, 2004",
   "Views: 17484",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a high school student who has narcolepsy, a sleep disorder where you fall asleep radomly, with the feeling of sleepiness comparable to a normal person's fatigue after going about 3 days without sleep.</p><p>I was having so much trouble staying awake in school that my sleep doctor recommended first I take Ritalin and then after that wasn't sucessful, partly because of the side effects (it made me EXTREMELY anxious and somewhat homicidal) I began taking Adderol (dextroamphetamines) (don't even get me started on that stuff the side effects where too many for it to be any real use) I was moved on to provigil because of it's strength and lack of side effects. </p><p>Unlike another reveiwer's expeirence with this drug, 200 mg did not do much to keep me awake and alert, often i felt only slightly more awake after taking the pill and usaully very jittery and sick. within the last four month my doctor instructed me to double my dosage to two 200mg tablets every morning before school. </p><p>I still do not have very great results, when i AM awake, I am sick because I should be asleep. Provigil causes me to have severe tension headaches, stomachaches, if I drink coffee in addition to the medication, I may or may not have heart palpatations as well. about five hours after I take this medication, I will still be severly nausious but also falling asleep. my narcolepsy is not that severe at all, normal days on weekends and vactions i can go the entire day without taking the medication, only having to take one ten minute nap a day. I don't recommend taking this drug unless you really have to. it is a lazy excuse for the lack of a few hours of sleep. you'd probaly be better off if you just take an hours nap to rejuvinate yourself and then drink a cup off coffee if you really don't have that much time to sleep. </p><p>Also. my mother take this as well for fatigue, 200mg a day, she's 140pounds, it makes both of us more irritable instead of happy, sunny and otherwise cheerful.</p>"
}
