{
 "title": "Better Off Smoking Crack",
 "author": "Xray",
 "citation": "   Xray. \"Better Off Smoking Crack: experience with Venlafaxine (Effexor) (ID 29660)\". Erowid.org. Nov 6, 2007. erowid.org/exp/29660",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 29660",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2007",
   "Views: 5956",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI thought I was alone in this, but after reading the effexor experience vaults, I realized that I am not. ... Halfway through my senior high-school year I came down with a paralyzing depression. I was at a boarding school, and one day I just couldn't get out of bed... within two days I was sent home on semi-permanant medical leave. Basic things like walking and talking came with extreme difficulty... Somehow I made it home and to a psychyatrist with the help of friends and family. \r\nThe Psychdoctor threw a few samples of effexor my way. I left thinking, slowly, that maybe I would get my life back. That was the biggest mistake of my life. I was allowed a month off school to ween onto the medication ... taking the small doses in the first weeks and eventually working my way up to 150mg twice a day. I spent that month smoking cigarettes and laying in bed, wishing i were dead. The day came when I 'thought' i was better enough to be readmitted to school... and it turned out I was. Sort of. \r\nAs it turns out I was a complete space cadet.... and while I could smile and walk and talk again, basic linear logic escaped me. I was one of, what i call today, the 'prozac' people. I call them that because I can identify them within 1 minute of being around them. They're insane, for the most part. GONE. I also lost all sexual ability within 3 weeks of taking it, which I found depressing considering I had a 'girlfriend' at the time and... well... it just didn't make things any better for me.\r\nSkip 4 months ahead:\r\nThe school was putting preassure on me to 'shape up, or ship out', because I had not turned in an assignment for about 2 months- and i had started to skip classes, and instead spend my time pacing about like a caged tiger in my little dorm room. I really didn't belong there but I was too messed up in the head to realize that. I was so sick of not being able to think striaght that I decided that i'd rather be depressed than feeling like that. So I stopped the medication. STUPID. Within a day the withdrawl symptoms overtook me... and from there my memory is a bit hazey. The electric feeling all over my body and small twitches were just the beginning. I lost all sense of time and place, and began having mild auditory and very not-mild visual hallucinations, though I have no recolection of what they were. I remember being very scared and in a lot of pain, and sleeping was out of the question. I would wonder around campus at night just looking at things, and which I suspect frightened people. What frightened me was the urge I had to kill myself... the combination of depression mixed with the withdrawl symptoms, and little voices whispering in my ear, that it would indeed be a good idea to find myself a lethal dose of... whatever. I was able to ignore the voice, obviously.\r\nSkip a week ahead:\r\nI was being escorted off campus, and before I knew it, I was at home again. There i went completely insane. I completely turned on my family and started drinking to help cope with the extreme pain in my back and neck (much of which still remains today)... which i'm sure didn't help the situation. Nor did the fact that I realized that I had just spent 3 years in boarding school and I left sans diplomae. I broke down completely at one point, locked myself in the house for 3 weeks on end, and proceeded to drink cases and cases of wine... and eventually the symptoms stopped. I'd like to think that i've fully recovered since then, but I suppose there is a reason why i've been unable to function in an academic environment since then. \r\nAnyways I guess what i'm saying, is that if a doctor decided to hand me some effexor, that I would turn around and literally throw it in his face. If i could go back in time, I would punch him in the face on the spot. Fire him immediatly. I am currently considering a class action lawsuit against my doctor- if only to pay for all of the weed I have had to smoke just to remain semi-functional. Anyways I hope someone can learn something from my experience with this horrible drug- its just not worth it. I later went back to that doctor to help with an anxiety problem that i've developed, probably as a result of the whole incident, and he refused to prescribe xanax on account of its being 'too addictive'. He nearly earned himself a punch in the face right there. :) I just walked out and never looked back- and now I am very weary of doctors and their little magic pills. Even GP's scare the shit out of me.\n\n\n"
}
