{
 "title": "Is This Cool? I Don't Know if I Like This....",
 "author": "tektonik",
 "citation": "   tektonik. \"Is This Cool? I Don't Know if I Like This....: experience with 5-MeO-DMT (ID 29688)\". Erowid.org. Jan 4, 2004. erowid.org/exp/29688",
 "substance": "5-MeO-DMT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29688",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 4, 2004",
   "Views: 7794",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'd tried 5-meo-dmt a couple times,  without obtaining any of the intimidatingly intense effects that I'd read about.  The method I'd been using was to place a small amount of the drug into a spoon (I don't have a scale), heating it from the bottom, and inhaling through a plastic drinking straw. Up until this point, the most I experienced was a loud ringing in my ears, a tingly body buzz, and once I achieved a strange meditative state in which my mind was completely silent, and I was surrounded by darkness (not unpleasant, but inexciting).</p><p>On this particular night, I was sleeping over at my girlfriend's house, and she had already gone to sleep.  I went into the bathroom and took out a pipe I had designed for the 5-meo-dmt earlier in the day, but it didn't work too well, so the hit I got was minimal.  Frustrated, I took out the spoon I had been using.  There was a sticky, 5-meo-dmt resin on the spoon, and as I looked at it, I got an idea. When I'd been smoking before, I waited for the crystals to turn liquid, then I started taking my hit.  I figured that my lungs were getting full of air and not smoke.  This time, without adding any additional 5-meo-dmt, I put the straw to my lips, and heated the spoon.  </p><p>The resin quickly liquefied, and I continued heating. After a few more seconds, a thick white vapor began to rise from the spoon, and I started taking my hit.  The smoke was much harsher than any of the times I'd smoked before, so I knew my assumption was correct.  I filled my lungs, then held them.  As the smoke saturated my lungs, I felt my head expanding.  My breathing sounded funny to me, and my chest was a little tight.  I finally exhaled, and stared at my face in the mirror. This is kind of hard to explain, but as I stared at my face, it appeared to change.  It didn't really distort or anything, it looked like it was turning to stone, but it didn't lose color.  I looked like an impressionist painting or something.  At this point I knew I was in fucking trouble, so I rammed the still VERY hot pipe and spoon into my pocket and walked, with some matter of difficulty, to the couch.  Everything was going black, and the ringing in my ears was nearly deafening.  I looked at the clock, and it was all I could see, a 3 numbers floating in an infinate blackness.  Fear struck me then, as my head kept expanding at light-speed.  </p><p>Luckily, I had left the tv on.  I focused on my breathing, and the voices on the tv, and it was all that kept me from slipping into absolute terror.  It kept me grounded to reality, you could say.  Finally, after about 10 minutes (a guess), I started to come down and I was able to see again.  My field of vision was filled with little specks of light, like the ones you see if you close your eyes and focus on them.  I fell asleep before I was completely back to baseline.</p><p>Will I ever do 5-meo-dmt again? I don't know.  I have some left, but it will probably take me awhile to get the nerve to do it again, because I think I was thisclose to losing control.  I'll stick to 2c-I, and leave the deep stuff to my brain.</p>"
}
