{
 "title": "5-Hour Orgasm",
 "author": "tektonik",
 "citation": "   tektonik. \"5-Hour Orgasm: experience with 2C-I & Cannabis (ID 29680)\". Erowid.org. Jan 2, 2004. erowid.org/exp/29680",
 "substance": "2C-I & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29680",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 2, 2004",
   "Views: 13195",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last weekend, on a 3 day binge of drugs and alcohol, I found out the drug for me: 2C-I.  I obtained 100mg of the substance, which seemed dissapointing small, from an online research chemical supplier. </p><p>My first experience was excellent, with a dose of about 15 mg, following some cannabis and a low-dosage 5-meo-dmt trip. It is hard to say how exact any of these dosages are, because it was never weighed.</p><p>My second experience was the day after my first, and a friend of mine came over in the morning to help me finish off whatever was left of the 2C-I, about 25mg apiece, which we mixed with soda and drank.  We then smoked a bowl of particularly potent cannabis, and my friend left.  Another friend of mine came over, who remained completely sober throughout the trip, and we left for a city that was about a 1 hour drive away, to return some christmas gifts, with me at the wheel.</p><p>About 30 minutes after ingestion, I begin to feel some minor stomach discomfort, which was easily taken care of by a couple antacid tablets. 'A good sign', I thought.</p><p>About 45 minutes after ingestion, I realized I was starting to trip. I could FEEL every bump in the road, every hill, everytime gravity pulled down on my body as the car moved up and down.  This was not uncomfortable at all, it felt good.  In fact every part of my body was feeling good.  You know that tingle you get in your solar plexus when you have an extreme adrenalin rush? That is what I was feeling constantly, only more intense.  It was, for lack of a better word, 'orgasmic'.</p><p>By the time we arrived at the mall (about 1h 30min after ingestion), I was tripping balls.  The intensity of the trip and the body high were still increasing, but the onset was at just the right pace so as not to be overwhelming. We went to the food court first, and ordered from this awesome mongolian chicken place.  I have to admit, that eating that chicken was one of the strangest experiences of my life.  The chicked tasted fine, but chewing felt very alien, like I'd never done it before, but I still proceeded with little trouble.  My depth perecption was distorted, and it seemed that everyone around me was very close, but not in an unpleasant way. I even thought people walking behind me were going to hit me a few times, but when I turned and looked I realized (by using the chair I was sitting in as a reference point) that they were several feet away.  I didn't feel claustraphobic in the least, I just felt plain ol good.  I marveled at how rice slooooowly sinks back down to the plate after you take a forkfull, and I was loving every minute of it.</p><p>I'm not too sure when the peak was, but I think it was somewhere around +2hrs to +3hrs from ingestion.</p><p>My friend and I then went shopping for and hour or two, and we ran into a friend of my that lived there.  During this period of entering and exiting stores and my car, I came to the realization that the intensity of my trip was affected by the heat and cold (winter in wisconsin).  I don't know if this effect was real or in my read, but the body buzz and feeling in my head would increase when I warmed up, and I'd sober up a little every time I was cold.  Night had fallen at this point, and when I stared at the dark sky, I saw streaks of color.  I wished it had been darked earlier, during the peak of my experience.</p><p>Me and my friend went home with the friend we had run into, and my trip slowly diminished, as we watched tv.</p><p>This might not sound like that great of an experience, but I honestly cannot put into words the bliss I experienced when I dosed with 2C-I.  I literally was in ecstacy for the 5 hours my trip lasted.  Everything around me looked beautiful, music sounded awesome, and the body buzz was very enjoyable.  I have a half of a gram coming to me next week, and I will cherish every second I have with this wonderful drug.</p>"
}
