{
 "title": "What Is Real?",
 "author": "Jarrett",
 "citation": "Citation:   Jarrett. \"What Is Real?: experience with Diphenhydramine (ID 2968)\". Erowid.org. Dec 6, 2001. erowid.org/exp/2968",
 "substance": "Diphenhydramine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 2968",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 6, 2001",
   "Views: 32842",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe night started off in search of acid and I couldn't find any, so, hearing you could take a bunch of Benadryl and trip, I did. I bought a box of 24 and downed them all. I was at a party with friends and when the first wave hit it was like I was beginning to trip, seeing patterns and all the typical LSD symptoms. I walked to the bathroom and started to piss. When I was done I realized my friends R. and C. were standing there, so I asked them if they were riding home with me. They both said yes. I looked over at the mirror at myself, looked back, and my friends were gone. So I went outside to my car and began to leave.\r\nOn the ride home I noticed that my friends were now in the back seat. I began to have a conversation with my best friend about how he just tried heroin at the party and I was pretty upset by it. Then I looked over at the seat and I was the only one in the car. I looked outside and the same friend I just was speaking to was outside leaning up against a stop sign. So, I stopped my car and asked him to stop playing games and let's go home. I walked over to him, trying to grab him, and when I finally touched him he turned into a tree.\r\nNow, sober people usually would realize that this was not right. But apparently the drug had me to the point of thinking that my friend disappearing was supposed to happen. That was the scary thing about this drug. I didn't realize what was real and what was fake (hallucination)! \r\nTo make a long story short, I ended up in some backwood town, 70 miles outside of the town where I live, with no idea how I got there. And I come to find out I was actually by myself the whole time. I remember seeing all my friends there and asking for directions how to get home and all they would do is disappear.\r\nOnce I found my way home, I remember screaming at my seat thinking my friends were still in my car but I just couldn't see them because they were asleep.\r\nThis drug made me completely lose touch with reality, and when my best friend turned into a tree, it made sense to me for some reason.\r\nI recommend that if you try this, make sure you have someone sober to watch you. This is something I'll never try again. I'll stick to LSD and mescaline!\n\n\n"
}