{
 "title": "Memory Loss!",
 "author": "AncientTowers1",
 "citation": "   AncientTowers1. \"Memory Loss!: experience with Alprozolam, Ibuprofen & Caffeine (ID 29685)\". Erowid.org. Sep 25, 2006. erowid.org/exp/29685",
 "substance": "Alprozolam, Ibuprofen & Caffeine",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 0:00",
   "500 mg",
   "oral",
   "Pharms - Ibuprofen",
   "(pill / tablet)",
   "  T+ 1:00",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29685",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2006",
   "Views: 34124",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've taken xanax plenty of times in the past. It has and always will be the perfect 'chill pill'. But I wanted to mention what happens when I take it. First off I get the 2mg 'bars' and when I go to take it I split it into halfs. I eat the 1mg with at least 2 or 3 200mg Ibuprofens. (I Swear on my LIFE that the Ibuprofen kicks it up, or prolongs it...I'm not sure, but either way I always take together) So...I swallow 1mg and then like and hour later I take the other half. That's how I dose myself. </p><p>Now the effects I get seem to be different from the ones I've read. Actually when I'm on Alpra. it makes me want to clean my house, or rearrange things. I know if I just sit down and close my eyes I'm going to fall asleep, so I brew a nice pot of coffee. I put on some good music, nothing hard core, something to fit the mood. Last night I had the urge to scrub the kitchen floor. ON my hands and knees, and I loved it. I was vaccuming and it was like 1:00am. My boyfriend (who dosed too) was just doing his thing, and I'd pop in the room he was at, we'd talk for bits at a time, then I'd have the urge to do something, so I start looking for things to clean. OMG - I almost forgot...we started watching a movie, and after like 10 min. of it, we were like, I can't just sit here and watch this, so we turned it off and just bummbled around the house all nite and enjoyed ourselves. </p><p>Now the main point is, when I woke up the next day, I had FORGOTTEN all the cleaning I did, I thought a maid must of broke through the window and went to work. The house was spotless...I even had set up a vase with flowers that I stole from the neighbors garden. Which I had forgotten...and almost everything I did while I was on it, I had forgotten. That is the MAIN side effect I dislike, other than that it's great, but I think only for chillin out...not for driving around town or being somewhere I don't feel safe. And falling asleep is as easy as 1-2-3. I just lay down and close my eyes when I'm ready to sleep, it's like magic. But if I'm not used to taking it over days and days, then waking up will feel like a chore. Dazed and Confused like. But all in all I find it's safe to use, not addictive. Be smart and educated...it's the golden rule to stepping out of 'reality'.</p>"
}
