{
 "title": "Trippin' for New Years",
 "author": "2c-b",
 "citation": "   2c-b. \"Trippin' for New Years: experience with 2C-B (ID 29691)\". Erowid.org. Feb 6, 2007. erowid.org/exp/29691",
 "substance": "2C-B",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-B",
   "(powder / crystals)",
   " ",
   "1 repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29691",
   "Male",
   " ",
   "Not Given",
   "Feb 6, 2007",
   "3515",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Time of dosing - 7:15 pm</p><p>Preparation:</p><p>Basically none, besides the fact i wanted to be surrounded by many, many friends, and equantances. So i went to a party where i knew people would be on some-kind of psychodelics(most were on E).  Made sure to not have to deal with parents for the entirety of the trip.</p><p>Main:  </p><p>We had dosed 20mg of 2c-b at approx 7:15(i had eatin a full meal at 6pm).  The powder had been pre-mixed into a small glass vile(extremely similiar to something one may find a physician dipping a syringe into) with 2/3 being vodka and the other 1/3 obviously being the 2c-b. I feel it is important to note the feeling i had just by looking at this vile, it made me feel a little aprehensive, it made it seem more 'hard-core'.  Just a clear solution in a small glass bottle. quite intense for sure. We immediately began smoking our weed, a 1g joint. afterwords we just sat around, enjoying our highness. then at about 7:45 we walked across the street to my friends house hoping to get a ride to a new years eve bash across town.  </p><p>As we waited in his basement I could feel myself getting more and more high, very unlikely this was the 2c-b, definetly just the pot.  However, i did feel as though none of my clothes were actually touching my body, this was surely the 2c-b. the initial REAL effects began around 9:00p.m.  after realizing that i had been way too stoned from the pot for way too long, i concluded this must have been the 2c-b.  The first signs of halucinations began; fussy lights, solid objects looked to be vibrating, or moving like a speaker cone.  My mind however, was still clear, i could think and function pretty well normally. once we arrived at the party My mood had turned into a very relaxed and happy one, a mood that made me feel as though everything was perfect, like i couldnt be in a better situation. </p><p>Setting:</p><p>The party was in a semi-unfinished basement, 2 large black lights at the back, the walls were that fake wood look, many trippy knick-knacks.  The speakers were playing trip-hop, and techno all-night, not sure who the mix-master was, prolly some average club dj.  The bass was at an ok intensity, i guess the system just wasnt cutting it.  Although i could feel all the bass lines as they were meant to be fealt, just not the extreme kick im used to at raves and such.</p><p>Finally at about 10pm i was peaking out, also had smoked 2 1g joints between 9 and 10 pm.  The oddest thing tho was how i would feel very warm one second, and the next i would feel a draft and would cool right down.  And at times i would feel like i had just taken sum cold medicine, like the way it feels to breathe after taking pseudophedrine.  The trip was very similar to a mild to medium(lets just say average) mushroom peak, but with less confusion, more visuals and a sensual emotion was present tho not very intense at all.  The emphatic feelings drifted away by 11, but the visuals stayed until i fell asleep at sumtime i figure between 4-5a.m.</p><p>Conclusion:</p><p>Im certainly not a large person and only 15 yrs old, at 20mgs i experienced what i would consider a un-intense trip, I was able to control myself TOTALLY around parents or other people.   I would even consider going to school on this dose, and also think a wedding would be a blast.  I experienced no hangover, unless feeling energetic in the morning and more than average tiredness in the evening was the hangover.</p>"
}
