{
 "title": "Are you 'motion sick'?",
 "author": "MindScan",
 "citation": "   MindScan. \"Are you 'motion sick'?: experience with Dimenhydrinate (Dramamine) (ID 2969)\". Erowid.org. Nov 28, 2001. erowid.org/exp/2969",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 2969",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2001",
   "Views: 13971",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have had some experience with psychedelics before. I've tried LSD and DXM. The OTC drugs have a special appeal for me, as others are a little hard to procure in my uppity hometown.</p><p>I had heard from a friend that I could trip from taking a box of Dramamine and the thought stuck in my head.  A week or two later, a group of friends and I were going out bowling and I decided, 'Hey, why not?' So, my mind made up, I downed a box of Dramamine and started the worst night of my life.</p><p>It started in on me about an hour and a half later, as I and a couple of friends (in one of their houses) were waiting for the rest of the group.  I couldn't help myself, I became so totally exhausted that my head just fell onto my knees and I was only partly conscious. You know that half awake state you're in if you're awakened in the middle of the night and have no idea what's going on? Yeah, that one.  Well, to me, it felt like hours, but it was only twenty minutes that I stayed like that.  When it was time to leave, my friends rousted me and got me up.  </p><p>I couldn't walk.</p><p>My sense of balance had just gone out the window. It was like being really drunk, except that my mind was shut down, not clouded as with alcohol.  There was a black wall between me and reality.  Somehow they managed to get me to the bowling alley (I quickly learned how to cope with the world's gravity not going downwards anymore).  And there, I just sat in the seat, watching the bowling balls go down the lane. I don't think I ever saw one of them hit the pins...they just disappeared.  There was a blackness all around me.  My field of vision was extremely small and I had no peripheral vision.</p><p>Later, about three hours after ingestion, we went to a restaurant for some food.  There, I saw somebody that wasn't there.  I even talked to him, but nobody seemed to notice (later I learned that everybody was wondering who in the hell I was talking to).  My big problem with dimenhydrinate is that it doesn't allow me to understand the difference between a hallucination and reality.  I would swear on a bible that there was another person sitting at that table, but there wasn't.</p><p>After that, I remember almost nothing.  Bits and pieces of a car ride home, talking to my parents (and being amazed that they didn't notice anything), and crashing in a VERY comfortable bed. Of course, anything would have been very comfortable because I was SO DEAD TIRED!</p><p>So, my basic ideas of dimenhydrinate are these:</p><p>It's too hard to stay awake.</p><p>It's too dangerous in that I don't know the difference between illusions and reality.</p><p>It messes with my memory.</p><p>AND IT'S NOT WORTH IT!</p>"
}
