{
 "title": "Good Friends leads to Good Trips",
 "author": "Dirty Sas",
 "citation": "   Dirty Sas. \"Good Friends leads to Good Trips: experience with Mushrooms & Cannabis (ID 29759)\". Erowid.org. Nov 10, 2007. erowid.org/exp/29759",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms",
   " ",
   "1.0 g",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29759",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 10, 2007",
   "Views: 4568",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHistory:<br>I had only started my journey into the world of mind-altering. I had already tried weed, and even ventured into MDMA a few times, but then I started wanting something more. I was in search of something more introspective, something more spiritual. When I looked into mushrooms further they fit all of my needs and aspirations. <br>Setting:<br>As I had learnt from reading many experiences, the environment was a very important part of a successful trip. Once the right time came around I seized the opportunity. My family would be gone for about 2 days, which meant for one night I would have the house to myself. I invited over 3 good friends and we idiot-proofed my basement. We removed anything which might be perceived as scary or disturbing, and made sure we had a large collection of good music. The library went from Radiohead, the Beatles, the Doors, and some other relaxing music. The basement consisted of mainly 2 rooms. One room with a tv and a very comfortable couch, and the other had a large open space, bean bags, speakers, and my vaporizer plugged into the wall.<br>However the environment is not the decisive factor when trying mushrooms. I made sure for weeks before that my mind was completely free of any worries or upsetting thoughts, so as to insure a proper mindset when trying this. I even asked my mom if there were any schizophrenics in our past just to make sure. As I always have a fair amount of marijuana, all we needed were some mushrooms. <br>Dosage:<br>I had about 7 grams of top quality Canadian bud which I pre-cut, so as not to have access to scissors, and left in a cup for my friends, as they were my sitters and were not shrooming. I then obtained about 5 grams of mushrooms (of same quality) and placed them in 5, neat piles on a counter, right next to 2 cans of cold coke. I quickly munched the 5 grams thoroughly as my friends cheered me on, because I am a pussy when it comes to taste, then I had a coke to wash out the taste. The munching had only taken about 10 minutes, including the can of coke. <br>Experience:<br>10 minutes elapsed <br>We went out to my garage and my friends and I planned on sparking up a few bowls on my bubbler. After 1 hit off the pipe a strange feeling came over me. This feeling was somewhere between nausea and the high you get off of weed. I had been told that it should take 45 minutes to start working, and me being 200 pounds maybe even longer, so I did not expect this. I told the friend who was experienced with this how I felt, and he thought it was unusual to feel it so soon. I decided I could no longer smoke, so I told my friends to finish up and I would go down the basement. One of my friends decided to come with me just in case. I went down and fell down onto my couch, just staring up at the ceiling. After my friend had made sure I was completely comfortable both physically and mentally, my other friends returned from their session. <br>15 minutes elapsed<br>It was coming on strong. As I lay there and my friends asked how I was, I just started laughing. It was a controllable laughing fit, thus very enjoyable. My friends left me and went into the other room to sit on the bean bags and smoke out of the vaporizer. <br>20 minutes elapsed<br>I had munched and I was slowly being immersed in a world which I never knew existed. The colours around me became peculiar, I couldnt put my finger on it. Then I noticed that on the couch cushion there were faces looking at me. They were not vivid faces like that of a photo, but blended in with the pillow, and composed of the same colours. I had to go tell my friends what was happening. When I stood up I felt very disoriented, far from the feeling you get when drunk. Although I felt like I was gonna fall over I moved into the other room. My friends went silent and looked at me. All I did was smile and look around the room and at its beauty. I walked over to a part where there was hardwood, and as I looked down the rings in the wood started to swirl and form a world of their own. I walked back to the other room, sat in my recliner, and my friends followed. They started out my night by putting on a radiohead cd. <br>30 minutes elapsed<br>As I lay there I started to feel uncomfortable about something. At first it wasnt clear what it was, then it hit me: guilt. I thought of how I was doing this in a house where I once played with toys, a house where I had many great memories with my family, memories of innocence. My mother popped into my head. This was the only sadness that night had in store for me. After I started to become upset I told my friends and they immediately took charge of the situation. They phone people who were supposed to come over and cancelled it, then they sat me down and reminded me that everything was okay. It worked.<br>1 hour elapsed<br>My true experience had begun. As Radiohead's latest cd played on the speakers I lay on my recliner staring at the ceiling. The ceiling tiles started to merge and then open again, to the beat of the music. Coloured lines started forming and moving in every direction to the beat of the music as well. When Planet Telex (radiohead) began, and if you know it, the sound it made was the epidemy of happiness for me. I appreciated life: the music, my house, and 3 people who made the world matter.<br>1.5 hours elapsed<br>I felt a slight bit of confusion because after 5 grams of shrooms for my first time, it was fuckin intense. Although I recognized where I was, it was only similar to the world I once knew. Everything had changed: ceiling, walls, ground, furniture, even my friends faces were different. As I felt more comfortable I went to my friends and we decided to go walking. This did not go over well, as I went upstairs I had forgotten this part of the house existed, and seeing it brought back memories of my family, I became frantic and uneasy. When we went outside paranoia struck me hard, and I worried neighbours would know as though there were a neon sign above my head saying, 'kid on drugs'. We went back inside.<br>4 hours elapsed<br>My friends had started getting burnt out and tired (after smoking about 5 grams) so some started to crash. But I was not ready for that. I smoked a bowl and the cherried weed seemed to be smiling up on me, as if it were a mirror reflecting my mood. I went back inside and one friend was still awake. I asked what time it was, and he said 11. I did not believe this, it seemed to be 3 in my mind, and this exemplified the lack of time perception while under the influence. We talked and just chilled, I did not need to talk for more was going on in my head than could ever happen regularly. I emptied my vaporizer bowl and not knowing that I lost all skills with my hands, broke it.<br>5 hours elapsed<br>As I lay in bed I reflected on my night, and despite the fact that I was still having incredible visuals, they seemed to sooth me and put me to sleep easier. Although I spent 3 hours watching the tracers made hand left on the black canvas of night time, the neon colours vibrant against the emptiness. <br>Conclusion:<br>When I awoke the next day I felt very refreshed, except for the clamminess my skin had. I went over the night before with my friends, and discussed what I saw. They even showed me some video tape of some of the stuff I did that night. When seeing family guy on the camcorder I was surprised that it too was not distorted, even though the sounds stupid. But at the time the experience was real, very real. The whole experience was amazing, 10 times better than I had hoped for and this was mostly due to friends. Whether you have 1 good friend, or 3 of them, make sure they are included in your experience. Mine would not have been the same if they were not there to guide me through the journey. A lot was left out of the story, as I could have gone on much longer.\n\n\n"
}
