{
 "title": "Was There a Point?",
 "author": "Tack",
 "citation": "   Tack. \"Was There a Point?: experience with 5-MeO-DMT (ID 29774)\". Erowid.org. Sep 23, 2008. erowid.org/exp/29774",
 "substance": "5-MeO-DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29774",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 23, 2008",
   "Views: 2590",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had gotten this stuff about a month ago, but had to wait until I got the pipe, the lighter, and had tried LSD first. I decided on this weekend. My friend, his wife and kid and I went up to some town nearby, that's strangely like some West Virginian town with railroad, sunk down between hills and a dirty river running past. Everything else around is going suburban fast if it hasn't already. My friend was depressed that day and has been for months, and has tried all the medications and treatments possible. His wife was low and his kid was a pain in the ass. The sad town itself and an oppressive gray sky were extra elements, the sum of which made me doubt I would want to try this stuff later in the day.\r\nWe came back to his house and his kid took a nap. We were going to sleep but neither of us did. I figured I might as well. I got out my scale and other materials and tried to weigh. My scale, although it should be accurate to .1g, seems to not register at very low amounts. So I started with a grain the size of a fleck of salt. My friend helped me light it and the smoke appeared. Nothing happened. We put in a little more. Still nothing. Finally I put in a chunk, something the size of a very small bread crumb. I smoked that. I looked at my friend and there were LSD visual shivers. \r\nI remember saying 'holy shit'. I felt like I was being pushed to the back of some corner of my mind. I couldn't think anything. There was a moment when I felt my skin and heart seething under me, running fast. There was a low hum. Occasionally my friend said something, but I couldn't reply. I tried to fixed my attention to the light fixture above me. Again, the visual shivers, and at some point I could lean forward. Shortly after, I stood up. I remember saying 'I'm not sure what the point of that was'. \r\nI was walking, pacing, still extremly affected but coming down fast. My thinking was clear. I was amazed at the speed of the comedown, and the smoothness of it.\r\nMy friend was nervous. He's experienced with stuff like this, but on medication now. We read that MAOIs would enhance this stuff. He wanted to try. He tried a little, felt the rush, then tried more. He closed his eyes. When he came back, he said 'I'm in a lot of trouble'. He began to talk about his depression in much the same langauge that he has these last months. He said at first 'I'd try that again' then later 'I don't think I need to do that again'. The next evening he said he might like to do it again. He compared it to nitrous in type.\r\nI didn't have an experience of the void that people have spoken of. Or maybe I just smoked too much and it scrambled things such that I couldn't concentrate (if that's the right word). Next time I do it, I'll have people be silent, and maybe have something to focus on visually, something that fills my entire vision, instead of a bare white ceiling and light fixture. Or I'll close my eyes.\n\n\n"
}
