{
 "title": "Great Start, Lousy Finish",
 "author": "Louderklim",
 "citation": "   Louderklim. \"Great Start, Lousy Finish: experience with H.B. Woodrose (ID 29807)\". Erowid.org. Jan 7, 2004. erowid.org/exp/29807",
 "substance": "H.B. Woodrose",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "9 seeds",
   "oral",
   "H.B. Woodrose",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 29807",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 7, 2004",
   "Views: 15133",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first dosage I took was 5 seeds scraped then singed to clean the fuzz, then chewed and swallowed.  This yielded an interesting New Years, where I was unquestionably high but quite able to enjoy conversations with a little confusion.  Eating was quite the ordeal, and I had trouble swallowing.  It's like I had to force my body to perform the act of swallowing, but everything tasted really interesting. </p><p>Two days later, I made the same preparation but this time crushed the 9 seeds left and soaked them in lime juice for 5 hours to bring out the properties.  I drank the concoction at 7pm and went to a friend's to wait for the effects.  I noticed soon that my mind was tuning up as often happens on psychedelics.  I would get waves of ecstacy and with each wave became higher.  It was much as I remember strong weed highs beginning (as I've given up illegal subtances for some years).  </p><p>As my buddy played music on his computer, it sounded profound, yet couldn't really keep my attention and I was buzzing pretty hard.  So I headed back to my place.  As I arrived home at about 8pm, I was very high and noticed everything was really bright.  Suddenly, the apartment felt like the carribbean, wet and pleasant, even though it's the middle of winter in the mountains, and the windows were open to let the cold dry air in. I mean, I was IN the Carribbean at that moment. I found myself drifting back to beloved memories of the islands, really feeling the feelings from those times for the first time in years.  I lay on my bed and looked out the window at the clouds in the night sky.  Though it was dark, there was a beautiful purple sunset shining on them.  It was a Carribbean sunset.  Everything felt wonderful.  This lasted for a little while and I started a movie on the tv.  </p><p>At about 9:30, things turned a bit nasty.  I found my breath getting short.  No matter how I tried, I couldn't fill my lungs while laying down.  Like an asthma attack.  I started to toss and turn in the bed as the high wore off and all that was left was an over-stimulated anxiety.  I started to moan and groan and was worried my roommates would hear me and come check on me.  But groaning was the only thing that felt good.  I got up and started out to see some girls I knew, but only made it downstairs to watch the neighbors play video games.  I didn't get to sleep until 1:30am but slept like a rock for 10 hours when I did.</p><p>Overall, I don't feel this was a bad trip, but did worry a lot about dying when I was having trouble breathing.  I realize now it was silly, as when I got up, and moved, I felt better.  I probably won't try these again, but the initial couple of hours were the best legal high I've had and one of the more pleasant trips I've had.  I wouldn't recommend doing these right before bed as there seems to be a strong stimulant effect to them and it was really unpleasant to be so wired and confused at the same time.  If the high had lasted into the jitters, it would have been more worth it.</p>"
}
