{
 "title": "The Infinite Darkness",
 "author": "Ream",
 "citation": "   Ream. \"The Infinite Darkness: experience with DXM (ID 2981)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2981",
 "substance": "DXM",
 "bodyweight": "167 lb",
 "header": [
  [
   "DOSE:",
   "405 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2981",
   "Male",
   " ",
   "Not Given",
   "Dec 16, 2001",
   "15357",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had been reading a lot about DXM online, and so decided to try it one night. After reading about many different drugs, I knew somewhat how to prepare myself.  </p><p>I made sure to have a good day, and not to fight with my parents.  I meditated shortly before the Simpsons, clearing my head, and decided that I had had an excellent day.  I believe that any and every high is half mental, and with the right attitude, I find that I can make the weakest high become as good as any. After watching the Simpsons (a very funny episode that put me in an even better mood), which ended at 8:00, I immediately consumed one and a quarter bottles of Robitussin Maximum Strength.  I retired to my bedroom to read 'The Beach' and await the experience. </p><p>At about 8:40, I started to feel a grass-like buzz, and decided I would stop reading and just lay on my bed.  I turned all my lights off, and layed still in the darkness.  On my stereo played The Doors.  Ironically, 'the End', the trippiest song ever was playing as my trip began. It was 8:45 and my ceiling began turning different shades of black.  It would lighten, almost to white, and then go to gray and eventually to black again.  I put my hand up in front of my face and saw it light up, and then become engulfed in shadows.  I gathered my wits enough to call my friend Steven, who I asked to help me out with the experience.  Motion had a very special effect, and as I picked myself up to dial, I was shocked out how much I liked it.  From that point on, I was rolling in my bed almost the entire time. I talked to Steve for a while, telling him how I felt.  I lost my perception of time.  I told him I thought we had been talking for an hour, and in truth it was only ten minutes. At this point, 8:55, I noticed my door.  Around the outside of my door frame was a very bright light, like a fluorescent light.  It was continuous and traveled around the entire frame of my door.  In the middle of it was very dark.  It seemed my door had turned into a portal.  I looked into the portal, but it was too foggy to see, like a mixture of black and gray.  This intrigued me, but I got distracted by Steve, and a friend we had called on three-way.</p><p>It was then that I brought my attention back to my door.  The light around it had slightly diminished.  I wondered why, but as I gazed towards the portal, I understood.  In the middle was the blackest thing I had ever seen, similar to a black hole.  I quickly stopped rolling in my bed and stayed silent until Steven queried me. 'Steve, my friend,' I said, 'I'm staring into the infinite darkness.' I stared deep into the void, and everything around it disappeared.  It was intensely beautiful, and for a moment, nothing even existed aside from myself and the darkness.  I then saw two red eyes glowing at me.  I was horribly afraid, and decided to turn away.  I was sorry to do it, but it was more instinct then anything.  Unfortunately, I wasn't able to reproduce the feeling quite as strongly as this one time. I started talking to Steve again, and we tried to call another friend, who unfortunately was not home.  We just sat and talked and laughed a bit.  I felt as if the phone had suddenly become huge.  The end in which I talked was so large that I could lay on it, and the handle had stretched enough to let me listen and talk at the same time.  I felt that everything in my room was a mile away, and I had suddenly shrunk.  This was highly pleasant.  It wasn't actually a hallucination, more like a strong day dream. It was about 10:20 when Steve and I hung up. </p><p>My father called me downstairs to help me move a refrigerator.  When I got up to walk, I felt very drunk.  I stumbled in the darkness, and broke through the portal, out into the hallway.  I had been very afraid of going through the portal, but as I blindly stumbled, I slipped right through it.  I fell down a few stairs and started to giggle.  I got up, and found that by opening my eyes wide, I could walk straight for a little while.  I walked down and helped my father (the refrigerator was on wheels, so I had little trouble), and then went back upstairs.  I got into my bed for some introspection and meditation.  I got up, to see how well I could control my walking.  With concentration, I could walk straight for a full minute, as timed on my clock radio.  When I did not concentrate, I swaggered wildly.  And when I just let go of myself, I began bumping into walls and falling numerous times.  It was fun, but I didn't want my parents to see me.  I want back to my room and layed on my bed.  I fell asleep at about 11:30, as I was very tired from soccer earlier. I had some visions while I was asleep, of things that had happened previously.  </p><p>I was thinking of the infinite darkness when my mom woke me for school. I showered and had a cup of black coffee, which helped to wake me up.  I was very groggy, and if I let myself go, I even felt dizzy.  I got to the train station and smoked a strong unfiltered cigarette, which significantly cleared my head.  I felt much better, and could not wait to tell my friends of my night. My experience was highly enjoyable.  I went into it with a good mindset, and came away with a great experience.  The only aftereffect was my exhaustion, which gradually receded over the school day</p>"
}
