{
 "title": "Peace and Release",
 "author": "Johnny",
 "citation": "   Johnny. \"Peace and Release: experience with Ecstasy (ID 2984)\". Erowid.org. Oct 4, 2000. erowid.org/exp/2984",
 "substance": "Ecstasy",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 2984",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 4, 2000",
   "Views: 6236",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nmy first experience with e came back in 99. Now i have never been a pill popper, only tried acid  once and basically stuck to the weed and liquor. It took a lot of convincing from some friends of mine ('it WONT hurt you', 'its the BEST',etc.) before i said what the hell and gulped down 2. another friend of mine had like 4 hits of acid that night and was just starting to 'feel it' when i gulped down the pills. (keep that in mind, it will figure into the story later.)</p><p>After about an hour i started feeling a little funny, like everything just seemed soft and fuzzy outside of me a little and i couldn't stop smiling. Some of my friends noticed and said 'hey your feeling it' and were asking me how i liked it and all i could think was 'gee, is this it?' Boy was i wrong. 5 of us piled into my friend's truck to go get some cigarettes and food for later and my friend who had taken the acid was starting to look pale and very upset. I asked him if he was alright and he shrugged me off. </p><p>By the time we got back to the house I had never felt so good or pure in all my life. My body felt full of a live, clean sort of energy but i could hardly see straight- everything was sort of fuzzy looking and it was hard to focus. For some reason, I went and got a bible and me and another friend starting having a deep conversation about God's plan and purpose. I truly don't understand how i was seeing to read the scriptures, but i seemed to have an understanding of God's love for us that was overwhelming and almost made me want to cry tears of joy.</p><p>Suddenly, my friend on the acid leaped up into my view (he had been skulking in the corner, starting to have a bad trip) and starting yelling at me 'WHY DID YOU COME HERE! WHY ARE YOU TALKING ABOUT GOD RIGHT NOW!!!' looking very evil like he wanted to hurt me. I dont know whether it was the e or God, but i wasn't upset at all. I just hugged him and he burst into tears, saying over and over 'you saved my mind, you saved my life'. The next morning, he told me that the acid he had taken was stronger than he thought and from the time he was in the car with us he was feeling evil presences, evil all around him and trying to infiltrate his body and he was starting to lose control when i got the bible and started talking about god he felt peace and a release from the bad trip. Didn't mean to get too religious on yall, just wanted to let you know about my first time.</p><p>I have taken e since, but my advice to everyone is to use it in moderation, only every once in a while or you will cease to appreciate it as much and the effects will be diminished.</p>"
}
