{
 "title": "An Unrecognizable Land",
 "author": "Nashiva",
 "citation": "   Nashiva. \"An Unrecognizable Land: experience with Salvia divinorum (7x extract) (ID 29856)\". Erowid.org. Jun 18, 2006. erowid.org/exp/29856",
 "substance": "Salvia divinorum (7x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29856",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 18, 2006",
   "Views: 3587",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started when a friend told me about this plant, that when you smoke it, creates intense hallucinations, and better yet, it was legal. I thought he must be kidding me, perhaps exaggerating the effects of some ridiculously over marketed herb that did absolutely nothing. None the less I was intrigued, so I started researching it. I researched it for about 2 months (I'm very careful about what I do to myself )and finally I deemed salvia harmless, so I ordered a gram of 7X salvia divinorum, and waited for it to arrive. </p><p>The same day it arrived, my friend was coming over, and I talked him into trying some, but he insisted that I 'go first'. So I carefully divided the gram into 5 equal parts, and loaded one part into the bowl of my pipe. I had read that the technique associated with smoking salvia was very important concerning whether it would work or not, so I followed all the steps carefully and took my first hit. I held the smoke in for about 10 seconds, when all of a sudden I felt this huge rush, like getting really really high very quickly. I knew this was just the beginning, so I held it in just a bit longer. </p><p>After 20 seconds something happened. This large patch of snow I was looking at suddenly began to morph and change so much that it was unrecognizable. I looked around me and noticed that I was in a totally alien world, its almost indescribable. Nothing specific was different about this weird world, just everything was changed somehow, it was as if I was literally ripped intensely into another reality. Apparently my friend who was sitting next to me on the bench in my yard was asking me if anything was happening, but I wasn't aware of his presence, I wasn't aware which drug I had done, or where I was, I couldn't even hear him because it sounded like a waterfall was rushing through my veins. </p><p>Apparently as soon as I had blown out the smoke, I had asked him how long it had been, but I didn't know that I was saying it, it was as if my mind and my body weren't connected anymore. After what seemed an eternity (which was in actuality only 5 min) I became aware of my surroundings again, I felt good and warm, and tired. It felt like I couldn't be happier, but yet I couldn't believe what had just happened to me. For about a week after the experience I didn't want to try salvia again, but the more I thought about it, the more I recalled, and the more I recalled, the more I wished to do it. Not because I thought it was entertaining and fun like mushrooms are, but because it was interesting, I felt like it taught me a lot about who I am, and the world, life, and the universe around me. Salvia is not for the weak of mind, and is not something that is fun, or by any means recreational. It is a learning experience, that is awesome, interesting, scary, and pleasant, all at the same time.</p>"
}
