{
 "title": "Friend, Companion and Scheduled",
 "author": "anonymous-cs",
 "citation": "   anonymous-cs. \"Friend, Companion and Scheduled: experience with 5-MeO-DiPT (ID 29869)\". Erowid.org. Jul 17, 2006. erowid.org/exp/29869",
 "substance": "5-MeO-DiPT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29869",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 17, 2006",
   "Views: 4075",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n5-MeO-DiPT has been a friend to me for quite some time.  My first experience occurred after ordering a pure gram through an internet supplier, I dissolved the substance and ingested 12mg with a close friend.  The effects were much like the glowing experience reported by others, and I won't belabor them.  After a few more cautionary and experimental doses, I began to understand the substance extremely well, or so I thought.  In retrospect, this was arrogance.  <br>So over the next year I had in the neighborhood of 30-50 experiences, at a frequency of approximately once a week.  My doses varied from 10mg-35mg.  My affinity for 5-MeO-DiPT is based on the euphoria, introspection and curiosity it produces, but not at the causality of functionality.  I often went to school on relatively high doses, spoke with my parents, drove (during the afterglow stages), and accomplished a myriad of other tasks which I would have been utterly helpless to perform on LSD, mushrooms or other tryptamines.  I once combined 12mg with 30mg of oxycodone producing the most phenomenal euphoria I have ever experienced, but it was relatively mind numbing.   In early 2003 5-MeO-DiPT was scheduled, and as little black market exists to distribute it, I can no longer obtain it, and thus my journey with it has ended.  Throughout that year I learned a variety of things about foxy:<br>-I measured doses by dissolving a pure gram in a liter of distilled water, creating a concentration of 1mg/ml, which provided an exceptionally easy and accurate method of measuring doses, although the taste was downright retched, sore throat spray works like a charm to mask it.  <br>-Marijuana soothes the nausea associated with the beginning stages of the trip.  <br>-As absurd as this sounds, when coming up, the nausea often makes swallowing my own spit repulsive, and a spittoon and a drink were good things to have at hand, my friends frequently experienced this as well.<br>-I generally dont lose control of my better judgment, much like marijuana.\n\n\n"
}
