{
 "title": "Very Hallucinogenic",
 "author": "C-Money",
 "citation": "   C-Money. \"Very Hallucinogenic: experience with Mushrooms & Cannabis (ID 29872)\". Erowid.org. Jul 21, 2007. erowid.org/exp/29872",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 29872",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2007",
   "Views: 2945",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have tried several psychoactive drugs and had several vivid trips but by far this trip was the most intense and the most hallucinogenic experience of my life.</p><p>6:30 pm:  Me and my fellow tripster take around 5 g apiece of psilocybin mushrooms, which we later found out were laboratory cultivated.  Within 10 minutes of consumption I noticed a considerable effect from the shrooms.  Objects in my room started meshing together.  It seemed as everything in the room was connected by some unknown dimension.  The ceiling and the walls turned into water and it's as if I could walk right through them in to some unknown world.  Wow.  10 minutes into the trip I knew this was going to be intense.</p><p>7:00 pm:  By this time I am already peaking hard.  The hallucinations become quite realistic.  My room is a myriad of bright shapes and colors.  Green slime exudes from the cracks between doors, windows, and floors.  Images on the TV begin coming out of the screen and taking form in my room.  The noise of the heater in my room transforms and becomes the horrid sound of a psychedelic beast.  At this point I begin to panic.  It turned the lights off, crawled into my bed in the fetal position, and put the covers over my head.  The dark room became a jungle of crickets chirping, crazy animals and beasts making god-awful sounds, and swirls of colors.  I envisioned vines and such coming out of the floor and walls and taking over my room.</p><p>My bed felt like it had been risen off the ground and I could almost touch the ceiling lying down.  An uncontrollable force seemed to be suffocating me.  My whole body was sweaty and shaken.  My muscles, especially those in my stomach, felt like they were internally twisting and bending.  Two of my friends came in to comfort me.  Their faces and bodies where extremely distorted.  With the light in my room now on, I could see twinkling stars and holographic celestial bodies on my ceiling.  I look out the window and nothing looks familiar.  Building ten stories high seem thousands of feet tall.  Trees grabbed out at me with ten-thousand arms.  Cars in the adjacent parking lot began developing human-like qualities.  Headlights turned into lurking eyes and they began talking to me.  This freaked me out.</p><p>7:30-8:30:  By this time, I am going insane.  Time seems to temporarily freeze.  Seconds turn into hours and minutes turn into eternity.  It seemed as though I was Father Time, with the ability to control how fast or slow things occurred.  The trails of moving objects where incredible and quite colorful.  I constantly look into the mirror to verify that I am still alive.  I keep thinking my face was deteriorating into nothingness.  My vision was extremely improved.  When I looked at something, it was as if my eyes had become a panoramic eyepiece.</p><p>Walking to the bathroom from my room was a journey in itself.  The walls seemed to have more than three dimensions.  The bathroom echoed with laughs and jeers but nobody was there but I.  As I stood there staring at the toilet trying my damnedest to throw up, the toilet began muttering things to me.  I remember it saying things like 'Why Chris Why?' and 'What have you done!'.  Everything in the bathroom seemed to be suspended in space.  The noise of the fans in the bathroom intensifies and echoes in my head.   The walls looked as if they were made of jelly.  The tiled floor began lighting up like lighted tiles on a disco floor.</p><p>I felt like I was dying and being born at the same time.  I went to a friends room and watched TV.  Everything was distorted terribly.  Spinning shapes and colors filled the room.  Attempting to watch TV helped none at this point.  Looking outside the window from his room buildings morphed into temples and the night sky was bright.  I returned to my room and laid on the bed for a couple more minutes before getting the nerve up to go smoke a couple bowls. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>8:30-9:30: The car ride was an incredible experience.  It was like a roller coaster ride that had gotten out of control.  Passing objects were mere blurs and strange colors.  Streetlights sparkled with an eerie shine.  Tree branches still reached out for me, but by now I had gotten use to this occurrence.  Car exhaust from neighboring cars on the road turned into this huge cloud that seemed to envelope the car I was riding in.</p><p>After smoking, I noticed that the visuals and hallucinations intensified for about thirty minutes, then slowly started to go away.  Reality was slowly returning as the visuals seemed to fade away.  Thank you God.  Thank you God.  Thats all I could think to myself at this point.  I seriously thought that I was going insane and that a mental hospital would be my permanent residence.  I am not sure if I will ever have another psychoactive experience that is as intense and hallucinogenic as the one I just described.  I do know, however, that this will be the experience that all other experiences will be judged by.  Damn them were some good shrooms!</p>"
}
