{
 "title": "700 km at Full Speed",
 "author": "Rez",
 "citation": "   Rez. \"700 km at Full Speed: experience with Methamphetamine (ID 29878)\". Erowid.org. Dec 15, 2006. erowid.org/exp/29878",
 "substance": "Methamphetamine",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29878",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2006",
   "Views: 11217",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI never believed in the potential of Meth(or 'speed' as we call it). Speed was and is still a popular drug amongst teenagers in Belgium. The first time I tried it, it didn't have an effect on me. So I never understood why people used it. I always prefered coke. Being a long-term user of cocaine, I was starting to dislike the substance for it's come down (homeostasis) experience.\r\nAbout a month ago I was due to head towards Berlin on an early morning, this was the first time I actually felt the potential of this 'Power Drug'.\r\nI hadn't slept for two nights in a row, cause my friend 'Tambourine Man' was feeding me on speed. I was taking low dosages, so it felt like drinking a lot of coffee I wasn't feeling the full effect, but I was right awake. The last night we went out forgetting I had a long trip ahead the next morning. As we came back to 'Spud's' to chill at 8:30 I asked 'Tambourine Man' if he could sell me a gram of speed and a couple of pills(MDMA) to take with me to Berlin. I was starting to feel tired, and I still had to go back home and pack my stuff. So I decided to start snorting some speed to stay awake and be able to drive.\r\nI stayed at 'Spud's' untill 10:00 so I didn't have to run into my dad on the way home. During this time I took 2 large lines (twice as large as usual). At 10:00 I felt like a rocket, full alertness, my brain was working at 110 percent. I couldn't wait to start the trip more than ever, considering I hadn't slept for 2 nights. I said goodbye, and got into my car. I had a real positive feeling about everything, a thousand thoughts flashing with clarity through my mind. Driving back home became a joy of high speed cornering with exact precision.\r[Erowid Note: Driving while intoxicated or high is dangerous and irresponsible because it endangers other people. Don't do it!]\r\nWhen I got home, I knew exactly what I had to do without having to think about it, as if I had been programmed not to consider anything. I went directly towards my bedroom and I packed my clothes in a fast but precise manner. Suddenly I stopped, cause I was hearing voices outside. I looked out the window but there was nobody there, I went downstairs to get my passport, and as I walking down the stairs I looked at my mobile which I was holding in my hand and heared it go off, but there wasn't anyone phoning. I stopped, then I heared some one say my name inside the house.\r\nAs my mind was so clear I came to the conclusion that these were auditory halucinations, caused probably by not having slept and the speed that I took. Normally I would have freaked out but I had so much self-confidence that it didn't really bother me, I actually found it funny. I took another line and got into my car. I phoned 'Tambourine Man' to ask him if he could sell me another gram, but he told me it wasn't a good idea and told me I should go home and make the trip another day, I told him it would be a walk in the park.\r\nDuring the drive I only stopped for fuel and to ask the way to Berlin (I didn't even have a map, I thought people could be used as maps). Driving on German motorways can be dangerous because of the 'no speed limit' on certain sections. I was driving 190 - 200 km/h, and I was so focused on the traffic around me, one should be, if driving at these speeds. The funny thing about meth for me is that I don't experience a come down at all, when the effect finishes there are no craving for more symptomes or any of the feeling you get with cocaine, which is why I like so much better. So when I started feeling a bit tired I stopped and took a line, without feeling paranoid. Time also seemed to move faster than normal.\r\nI had finished the speed before arriving to Berlin. When I entered Berlin I suddenly felt all the energy fading away, and I started to worry a bit, because when your on speed, you don't seem to realize how tired your body can be after 2 sleepless nights and a 700km trip at high speeds, cause you feel so clear and fresh, you forget that your body is extremely exhausted. Then you slowly realize time is running out and you need to stop.\r\nI suddly started to see everthing blurry and nothing was what it seemed. I called my friend and told him I was going to stop and that he should come and drive the car, cause I couldn't anymore, so I stopped. As I looked around everthing started to move as if I was still driving, so I got out of the car, this was very unpleasent. Finally he came and I was able to relax(for a bit,cause that same night we out all night,again!). Great experience though. Meth from what I've heared can be 'very' addictive and cause serious mental problems, like amphetamine psycosis, and suicidal tendencies when used almost daily for a long period of time, but I think if used properly and very occasionally it can be a good tool and recreational drug.\n\n\n"
}
