{
 "title": "Mouth of Madness",
 "author": "Timmy",
 "citation": "   Timmy. \"Mouth of Madness: experience with Datura (ID 29874)\". Erowid.org. Jan 10, 2004. erowid.org/exp/29874",
 "substance": "Datura",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.5 Tbsp",
   "oral",
   "Datura",
   "(seeds)",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "1997",
   "ID: 29874",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 10, 2004",
   "Views: 119315",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In High School I had a friend who had been reading Carlos Castaneda. Carlos wrote about the Yaqui shaman Don Juan Matus, who would access the spirit world by ingesting peyote, datura, etc... So he, inspired by Don Juan, went on one of his expeditions to find herbs and came back with a tupperware full of the spiny pods. It would be an huge understatement to say that we were unprepared for the extent of the experience. </p><p>I ate a heaping tablespoon of fresh, mature seeds.  Lucy and Pollo had eaten similar amount.</p><p>90% of this was told to me by my best friend, Doogie, who witnessed my discent into madness.</p><p>Basically, what I remember, is eating the seeds around midnight, with Lucy and Pollo. It was kind of like being really drunk...except for the TOTAL lack of equilibrium, serious dryness and soreness of the mouth and throat, and some lucid hallucinations. It didn't feel enjoyable...just uncomfotable really. </p><p>I kept smoking ciggarettes that would dissapear and I talked to a friend of mine from day camp who I hadn't seen in maybe 7 years, before he dissapeared, and I realized he wasn't ever there to begin with. I vaguely remembered finding my upstairs toilet had been puked on(not in), with a dollar floating on top. I also vaguely remember cleaning it up, washing the dollar bill off and hanging it to dry. I really wasn't sure if this had happened and when I went to check it the dollar was gone and the toilet was a little too clean. Later Lucy said she vaguely remembered puking in my bathroom, but we're still not sure if it was real or not. The dollar is still missing. </p><p>Pollo, Lucy and I all got extremely fatigued and sleepy and we all went to bed.</p><p>I had a dream where I kept walking into the wall. </p><p>I was woken up the next morning by the phone ringing. Lucy and Pollo were gone. I picked up the phone.</p><p>Doogie: Tim? Tim? Are you okay?</p><p>Me: Uhm... fine. What's wrong?</p><p>Doogie: What is my name? Tell me my name!</p><p>Me: Fuck you......Doogie. Stop fucking with me.</p><p>Doogie: I'm Not! What do you remember from last night.</p><p>Me: I'm not listening to this....</p><p>Doogie: Just do me a favor and look on top of the fridge.</p><p>Me: Haha. You put my dogs food dish on top of the fridge. Good One! cockhead.</p><p>Doogie: No, asshole, you did!</p><p>Me: Whatever, goodbye.</p><p>Doogie: I'm coming over.</p><p>I go upstairs, where my mom's house is in total disarray. I find the wall mounted phone hanging off the hook, the front door standing wide open, the table in the entryway over turned, a broken vase on the floor....and, it was Halloween, so we had this dish of candy corn....someone went through maybe 75 pieces of candy corn and bit off only the orange half. I start freaking out.</p><p>I had really thought that Doogie was just joshing me... but he never took jokes that far. So Dave comes over and helped me clean up. I found all of the pieces of the vase, broken where they lay, except for a very large section that was hidden behind the curtain on the other side of the room. Strange.</p><p>After we had cleaned things up Doogie proceeded to tell me what had happened. </p><p>He had come back over to my house maybe an hour after I had gone to bed. Apparently he found me, wearing only my boxers, frantically trying to locate something in my kitchen. Things had not been broken yet. He said my name, but I paid no attention, only continued to open and slam drawers and cabinets.</p><p>'TIM!' He shouted.</p><p>I turned around, looking at him with annoyance. 'What!?'</p><p>'What are you doing?'</p><p>'I'm looking for my Windows 95 disk.' I said this with a expression and tone of voice of someone who had just been asked what his penis was for.</p><p>I rolled my eyes and walked off toward my dinner table, stopping for a moment to hock a loogie on the wall. Doogie is very confused.</p><p>'Don't fucking leave!' I said, looking at the table.</p><p>'I'm not,' said Doogie.</p><p>'Not You! The candlesticks!' I said this in the same 'must I always restate the obvious' tone.</p><p>'Tim! What the hell is wrong with you?'</p><p>'Who are you?'</p><p>'I'm your best friend!'</p><p>I try to remember</p><p>'Ummmm...John'</p><p>'No.'</p><p>'Ummmm...Jake?'</p><p>'NO! You don't even know anybody named Jake.'</p><p>'Ummmm...'</p><p>'I'm Doogie!! What the fuck!!'</p><p>'Oh yeah....Doogie.'</p><p>I spit another substantial hocker on the wallpaper.</p><p>'Tim! This is your house. Have some respect, STOP SPITTING ON THE WALLS!'</p><p>'Okay.'</p><p>I spit on the floor.</p><p>'What the fuck, Tim?'</p><p>'Hey, at least I didn't spit on the wall.'</p><p>I grab a spoon off the table and seem to be trying to smoke it. I make as if I'm lighting it with an invisible lighter and take a deep breath.</p><p>'eer.' I offer David the spoon.</p><p>'No thanks.' He takes the spoon away from me.</p><p>I walked away and grabbed my dogs food bowl and went downstairs; down to my fridge where I carefully place the dish on top.</p><p>'She doesn't need it, and I don't like her anyway,' I said, either anticipating his question or maybe just talking to myself.</p><p>I open my fridge and begin digging into the pockets of my boxers...except they didn't have pockets.</p><p>'I'm so thirsty. I don't think I have any change,' I look at Doogie.</p><p>'You don't need change, this is your house. That's your pop!'</p><p>'Okay....do you have fifty cents?'</p><p>'Sure.' </p><p>He reaches in and pulls out a Brisk Iced Tea and opens it for me. I take a single sip, set it down, pull out a fresh can, open it, take a single sip, set it down, reach for another....Doogie stops me.</p><p>'You've lost your mind, you realize...,' says Doogie.</p><p>I cackle maniacally and spit on the fridge.</p><p>I walk toward my bedroom, missing the doorway and walking squarly into the wall. David helps me. Apparently Pollo and Lucy had already left.</p><p>'Where did Lucy go, Tim?'</p><p>'She went to see the shadow people.'</p><p>Not long after this, I think, Doogie managed to get me into bed and go to sleep, then he went home. It was a school night. I'm not sure if I got back up and did those things upstairs or if Pollo and Lucy came back and did them. I guess I'll never know for certain. Lucy woke up in her bed, legs and feet muddy and scraped, with no recollection of how she got there. Pollo woke up at home too. These people didn't drive and they didn't live close to me either. Odd.</p><p>I'm probably forgetting parts... I've heard Doogie tell this story so many times, but I'm pretty sure I did other stuff too. The story gained somthing of legendary status at my highschool.</p><p>Highlights from some of my other friends stories:</p><p>-Josippi ate some, put on Working Man's Dead, and proceded to talk to Jerry Garcia all night long via his radio.</p><p>-Schloppy, sitting shotgun in a moving car, saw a dark man with a tommy gun sitting in the back seat. He bailed from the car.</p><p>-June Bug ate some before his family dinner. He was in my frend O'Dells basement smoking a bong. When he passed it, the basement and all the other people dissapeared and he was sitting at his dining room table, arm outstreched, while his family stared at him. He had to excuse himself from the table to lock himself in his bedroom.</p><p>Other drugs you eat and you're like, 'hey, that's trippy' On jimson weed, you're like 'hey, that's normal.' You NEVER know that you're hallucinating... it's just like a waking dream.</p><p>Not recomended...unless you're a shaman</p>"
}
