{
 "title": "A Combination Leaving Something To Be Desired",
 "author": "joshi",
 "citation": "   joshi. \"A Combination Leaving Something To Be Desired: experience with LSD & 2C-T-2 (ID 29947)\". Erowid.org. Jan 26, 2004. erowid.org/exp/29947",
 "substance": "LSD & 2C-T-2",
 "bodyweight": "155 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "15 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 6:00",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gel tab)",
   "  T+ 9:00",
   "15 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   " ",
   "  ",
   " ",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "29947",
   "Male",
   " ",
   "Not Given",
   "Jan 26, 2004",
   "9092",
   " "
  ]
 ],
 "report": "<p>This is not a winning formula.  The combination of LSD and other phenethylamines, such as MDMA or mescaline, is well-known to be terrific. (I only know the first of those combinations firsthand... I consider candyflipping to be the most decadent psychedelic experience available)  Thus I had high hopes for LSD + 2C-T-2.  However there is something about the 2C-T-2 experience which causes it to be completely and totally swallowed by acid.</p><p>(It should be noted also that people's experiences with 2C-T-2 vary very greatly.  Some of them find it extremely rewarding, whereas others don't get what the fuss is about.  I'm in the former camp... but 2C-B barely works on me at all.  Go figure.)</p><p>Anyway, the experience in question took place at a certain festival in the desert in the late summer.  The LSD was taken around 6 PM, and the 2C-T-2 maybe an hour or an hour and a half later.  A small amount of cannabis was smoked, uh, I think after the 2C-T-2 dose.  </p><p>What followed, anyway, was indistinguishable from an LSD + cannabis experience.  Nitrous was inhaled at a certain point, maybe around midnight, and of course, it was spectacular, but there was still no hint of the 2C-T-2 visuals or mental signature at all.</p><p>2C-T-2 was taken *again* at around 3 AM.  Even then, nothing happened.  Finally, at about 5:30 AM, around sunrise, the LSD was more or less wearing off.  And THEN the 2C-T-2 happened, in full force and amazingness.  As I pedaled my bicycle across the desert floor, I saw it turn into water, I saw words written across the mountains, I rode my bicycle at the sun and I felt pulled into the solar embrace.</p><p>Of course, you'll have to trust my experience with psychedelics that in fact whatever I had experienced earlier in the night was due to LSD and not 2C-T-2, but it will be easy for anyone who has done both drugs to admit that the visual and experiential signatures of each are quite different.  The combination wasn't a particularly unpleasant one or anything (though because I was going to combine the two drugs, I did less LSD than I would otherwise have done, thereby leading to a more watered down experience than I might have liked for a while) but it has absolutely nothing to recommend it.</p><p>Hopefully someone who is thinking about doing the same thing will take a look at this and reconsider and save their drugs.  Thanks for reading!</p>"
}
