{
 "title": "When Things Start Falling Apart",
 "author": "Madorax",
 "citation": "   Madorax. \"When Things Start Falling Apart: experience with DXM (ID 29951)\". Erowid.org. Oct 16, 2010. erowid.org/exp/29951",
 "substance": "DXM",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 667",
   "ID: 29951",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 16, 2010",
   "Views: 6784",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet's see, I was first introduced to DXM by drinking a bottle of Robitussin on the 24th of November, 2002.  From then on it was a crazy, almost spiritual experience about a month later.  I was doing Delsym and Robo almost every day at school, thinking it was changing me into the outgoing person I'd always wanted to be.  In reality it was only masking the bad feelings I had inside.  I'd get into a whole psychology thing, but right now I just want to skip to the powder.  The powder was ordered a few months later on ebay.  50 grams for aprrox. 90 bucks.  When it came in I already had broken apart 500 mg pills and emptied their contents (Vitamin C pills and Stacker 2 pills).\r\nSoon after I fell into a binge.  Several to be exact.  It got so bad that I lost my job because the high would last for 24 hours or more depending on the dose.  I was thrown out of my house because I refused to admit I had a problem and wouldn't go into rehab.  I thought I could teeter at the edge and still have the power to pull back if it got too crazy.  Well, it was insane, I had plummeted over the edge the first night I did it.  I was so 'dedicated' to this drug, that I got a tattoo on my right shoulder.  It says DXM and right below that is 11/24/02.  A while later my mom threw out the rest of the powder, and I finished off the pills.  Then I went back to what was readily available in your nearest grocery store or Eckerd drug.  A few months later I was on my own where I am now.  I met the most amazing woman I've ever known, and fell in love.  By this time I had gotten a new stock of powder, and since I was on my own I didn't have to worry about 'getting caught'.  Well, long story short, I destroyed my relationship after breaking 3 promises saying I'd quit, and I was losing speed in every other department.  \r\nThankfully I knew the father of my best friend, who (my friend) was deeply into the drug as well at one time.  So this man knew exactly what to say and what to do.  He wasn't forceful in any way, but he did make me realize what I was doing to myself and those around me, and that it would lead to no good at all.  Since then, I've been so much better not having that poison flow thru my veins, and things are looking up in all departments.\r\nI had planned on trying to bust it all out in the open, the ebay ordering and the research company that sells the product, but I'm not sure if I want that kind of attention, and would they care anyway?  Lots of money going there.... I wouldn't know who else to tell that would be able to make a difference or care about it either.  No one believes in the power this drug has, but your at the right place to start understanding all about it.\r\nI'm not sure what else to say except if you do this, don't put the blame on anyone else but yourself when things start falling apart.  Remain content in the way you feel right now, because this drug, if taken on a constant basis and in high dosages, will change you slowly into someone your not.  It seemed great at first, but after awhile I saw what was going on.  Sometimes people don't see until it's too late.  Some of us are lucky enough to have someone who cares enough to make you see, in any way possible, how bad it is.  Hopefully if your in this state, you'll realize quickly like I did, instead of ignoring it and moving on through the addiction.  I'm still thankful I realized it now instead of when I'm 30.\n\n\n"
}
