{
 "title": "Some Unique Experiences",
 "author": "Metalhead",
 "citation": "   Metalhead. \"Some Unique Experiences: experience with Salvia divinorum (5x extract) & Cannabis (ID 29963)\". Erowid.org. Nov 7, 2007. erowid.org/exp/29963",
 "substance": "Salvia divinorum (5x extract) & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 29963",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2007",
   "Views: 2384",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI thought I'd share my Salvia experiences with you all, because my trips on this stuff were vastly different from anything else described, but very strong nonetheless.<br>1st trip: <br>Setting: A local park at night. Me and three other friends have a gram of 5x between us. We each smoke a whole bowl in one inhalation with two lighter flames on it. When it was my turn, I felt a sudden rush, and immediate 'Where am I?' sensations. I became convinced nothing was real. I kept asking my friends, 'Are you guys real? Say something if you are!' Due to their level of intoxication they remained silent, freaking me out. After this trip we had one toke of weed each. I found this gave me more visuals than I usually get of bud.<br>2nd trip:<br>Setting: My room at home. Me and a friend. I have two deep tokes of the same 5x and instantly my visual field morphed into a circular shape. I instinctively knew that I was in a kind of infomercial on how to improve my life. A narrator was offering me cliched advice in a cheesy American male voice, such as 'Don't do drugs, Be kind to your family'...etc. At this point I glanced at a poster I had which says 'Name your poison' on it. As I looked at it, the narrator began saying 'Name your poison, name their poison, name his poison, name her poison,' and the words on the poster changed corresponding to what he was saying! This is one of the most vivid hallucinations I've ever had.<br>3rd trip:<br>Immediately after the last one I went back for another round. This time we had music playing (John McGlaughlin) and I saw colourful patterns and experienced mild synaesthesia. No head trip really though.<br>Although these trips were intense and interesting, I've never really been interested in pursuing Salvia any further, because I dislike the sensation of coming up on it. It feels like my skin is crawling and is very uncomfortable. It seemed to have an evil/menacing aspect to it as well. I never experienced ego loss, or ego splitting but I was extremely high each time. I usually don't need much of any psychedelic to get really high though.\n\n\n"
}
