{
 "title": "Synchronization",
 "author": "Salvia Syndicate",
 "citation": "   Salvia Syndicate. \"Synchronization: experience with Salvia divinorum (5x extract) (ID 2997)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2997",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "2997",
   "Not Specified",
   " ",
   "Not Given",
   "Dec 16, 2001",
   "Views: 5402",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On a usual basis, I rarely share my psychedelic experiences with anybody but my closest acquaintances.  It's in this case I will break this rule, because it is in my best interest to further the already expanding usage of this plant.</p><p>Whether or not it actually places the user into a seperate dimension, I have no clue.  But I do know that it is like no substance I have yet to experience and thus I am forced to analyze the situation on a frequent basis.  As my friend Weazel, once spoke about the effects of Salvia divinorum, I will repeat his quote: 'It definitely puts you in a situation.'</p><p>It was warm, summer day when I received the package that I had ordered exactly a week from the date it was dropped off at my door step.  Excited, I tore open the rather large package to find (to my own initial disgrace) 2 small bags that contained a gram of Salvia 5x each.  Of course, little did I know.</p><p>Weazel, not exactly the most enthusiastic about the substance itself, gave me a pathetic look when I asked him to visit me in a smoking session. Though, being the friend he is, opted to follow me out to his blazer where we would soon find out just what the hell we were getting into.</p><p>With a homemade pipe, I dumped what could have possibly been the equivalent to a fourth of the bag into the bowl.  I don't really know how much it was but I do know that we were able to carry out 3 more equally effective sessions afterwards, so therefore I will make the estimate that it was around a fourth of a bag.</p><p>Within a 1 1/2 minutes, we had consumed the entire bowl.  The initial buzz was much like the stereotypical Salvia buzz: Silenced and disoriented.  </p><p>I looked to Weazel and asked him what the hell was happening.  He looked at me with the same question written on his face and shrugged his shoulders.  Blackout...</p><p>Weazel was no longer occupying my reality, though I venture to say that I had was no longer occupying my own reality.  I was now in a world where I was strapped to the boundries of a new dimension, struggling to get free.  I was confused, pissed off but not scared.  I wanted to explore and I was not allowed to do so.  Understandably, I was still mistaken that exploration would require physical movement.  Since Salvia usually puts me into a paralyzed state, it took me another trip to understand exploration would require metaphysical transportation through the vehicle of my mind.  </p><p>Nonetheless, I struggled with the drug, wanting to explore this new realm.  I gathered enough strength turn my head towards Weazel, who had began integrating himself into my reality, but only to the point where I could see his eyeballs, nostrils and mouth. He was the epitomy of the cheshire cat, a chameleon within a blitzkrieg of fluid colors.</p><p>Speaking was an impossibility...but the voices that surrounded me giggled, shouting demands that I relax. As far as I was concerned, they could fuck off.  This was my world and what the hell were they doing in it.  A rather rude attitude towards them (the inhabitant voices), considering it was anything but my world and who was I to come knocking on their door and tell them how I was going to behave in their household.  Being an Eagle Scout, I should had known better.</p><p>As I sunk further into my seat, I began to see a 'Simpsons' like world release in front of me.  Visually, I could see the houses, mentally, characters in 'Simpsons' like form appeared to me in my mind, speaking gibberish, laughing and disappering.  In utter confusion, I went back to instinct:  Where the hell am I and what the hell is going on?</p><p>Then, it stopped.  I was fazed and in complete disorientation.  I didn't know why I was in the car with Weazel and had no idea where time had went.  </p><p>We later discussed our stories whereas our trips had seemingly been synchronized as far as stages went.  I had appeared the same to him as he had to me.  He also witnessed some rather perplexing visuals that also seemed to run upon the same context of my trip.  The only  thing different is that he saw cartoon gingerbread men dancing on the dashboard of the blazer.  Yes, it seemed as if he was being laughed at also.  It was all very much humorous, but very perplexing.  In the end, we went on to experience much more...which will probably be written about at a later time.  Until then, Weazel and I have have some more Salvia to try.</p>"
}
