{
 "title": "Just a Small Dose",
 "author": "aire",
 "citation": "   aire. \"Just a Small Dose: experience with 5-MeO-AMT (ID 29985)\". Erowid.org. Jan 14, 2004. erowid.org/exp/29985",
 "substance": "5-MeO-AMT",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3.0 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 29985",
   "Male",
   " ",
   "Not Given",
   "Jan 14, 2004",
   "Views: 19955",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[[ Background info ]]</p><p>About two weeks ago I received my 500mg of 5-meo-amt in the mail via fedex overnight. I'm not sure why I had it overnighted since I didn't get a chance to try some until last night. Anyway...</p><p>[[ preparation info ]]</p><p>I don't have a mg scale - they are alot more expensive than gram scales. I would have used the liquid technique (mixing all 500mg of my powder into some bacardi 151 or some 80 proof vodka) because I don't want a bottle of liquor sitting around my bedroom. I'm 22, still going to college, live with my mother and don't drink. With that said, yes I had to eyeball an amount. I did this with good technique to say the least but it still isn't very accurate but it worked fine:</p><p>I poured out all 500mg onto some foil and made a thick, long evenly-distributed line of the substance and proceeded to cut it in half which left me with two ~250mg lines. I then cut one of these in half to give me two ~125mg lines. I proceeded on and on until I reached two ~4mg piles. I do realize that through my technique that instead of approximately 4mg piles these could easilly be anywhere from 1mg-8mg if not more. Let it be known I don't suggest anyone eyeball doses like this.</p><p>I had originally taken one of the 4mg piles and 1/4th of the other 5mg pile and put it into an empty capsule for ~5mg of the chemical. Due to personal life issues I wasn't able to dose as early in the day as I had planned and thus I dosed ~3mg instead.</p><p>[[ about me ]]</p><p>I'm a 22 y/o male, as mentioned above, who is still going to college and living with my mother. I love my mother alot and we have a big 4-bedroom 2-bath home together that we share with no one else. The last 12 months I have been practically drug-free. My drug history began before I turned 19 when I tried my first drug ever - ecstasy. After that I went on a 'rampage' of trying all kinds of substances you can think of over the next two years: alot more ecstasty, marijuana, cocaine, methamphetamine, dxm, nitrous, amanita muscaria, salvia, acid, shrooms, ether, nearly every pharmaceutical out there, nutmeg, 5-meo-dmt (via toad venom), maybe a few others I just can't think of. I have never been addicted to anything in my life (I don't have an addictive personality) and found it very easy to have only gotten 'high' off a substance three times total in the last 12+ months. It basically got to the point where the only thing I'll try now is anything new; hence this 5-meo-amt experience.</p><p>[[ the experience ]]</p><p>Approx. 4:45pm...</p><p>I dosed the ~3mg powder with some apple sauce. I hadn't eaten in about 5 hours.</p><p>Approx. 5:15pm...</p><p>I slightly start to feel a little different but can't really pinpoint what it is that's different.</p><p>Approx. 6:00pm...</p><p>I can definitely tell I have ingested a psychedelic at this time. I've got the body load associated with them and also a nice hint of energy. Colors look slightly brighter than usual and I am experiencing tracers a little.</p><p>The following couple of hours...</p><p>I can tell by looking around at different areas of the room I'm in that I have got tracers and am definitely 'tripping' - though not hard at all. I am able to have normal conversation with my mom as we watched tv for about two hours and am generally in a good mood. If I stare at something long enough I can see hints of full-blown hallucinations but nothing major at all.</p><p>Approx. 11:30pm...</p><p>I had gotten quite bored just sitting and watching tv. It seems as though my attitude would go from unsure to happy back and forth all night. I decide to head into my bedroom and find it really enjoyable to lay in bed and watch tv. At about midnight I rolled over and fell asleep very easilly. Note: ever since about 7pm I had felt pretty tired and so going to sleep at this time felt really good.</p><p>Middle of the night...</p><p>I had woken up a couple of times and had to cough. This is extremely unsual for myself. When I'd cough I'd have that 'crap' in the back of my throat as if I had just gotten sick or something. It was very annoying and tasted nasty. One cough would lead to five more and it was difficult to get the taste down my throat so I could go back to sleep. This was extremely odd.</p><p>10:30am (45 minutes ago)...</p><p>I woke up as normal and had to use the bathroom. I normally have to go pee when I first wake up so this wasn't out of the ordrinary. I have a very big headache that hurts pretty bad right on my forehead. I took some tylenol though am still experiencing it full-strength. I am about to walk out the door with my mom to goto lunch.</p><p>[[ conclusion ]]</p><p>To conclude my trip I would definitely have to say that I need a bigger dose than what I had. I would say at least double. That small dose really wasn't enough to start tripping but it was quite nice for being social and having a slight energy boost along with a feeling of being in a good mood at times. Will I do it again at this higher dose? Last night I was saying 'yeah no doubt I will' but right now it doesn't sound like a good idea at all. I know I would have some very nice visuals had my dose been larger but I don't know if these aftereffects are worth it (mainly that waking up in the middle of the night thing and having this horrible headache this morning).</p><p>Have fun and be safe, people. :)</p>"
}
