{
 "title": "Trip Of My Life",
 "author": "Aah",
 "citation": "   Aah. \"Trip Of My Life: experience with Mushrooms (ID 29980)\". Erowid.org. Nov 11, 2007. erowid.org/exp/29980",
 "substance": "Mushrooms",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29980",
   "Female",
   " ",
   "Not Given",
   "Nov 11, 2007",
   "3043",
   " "
  ]
 ],
 "report": "<p>All my friends had tried these magical mushrooms (plus many other drugs). I figured I'd always just be a booze and weed girl, but I couldn't resist my overwhelming urge to try something new. I was a freshman at a nearby community college and finally living on my own, why not? What I thought was going to be a regular Tuesday night turned into the worst and best experience of my life.</p><p>It was about 8 P.M. on Tuesday night. My friend and long time mushroom 'abuser' Fred called me up and told me he had some killer mushrooms that I had to try. I thought 'What the heck, I don't have anything to really do tomorrow.' So me and my roomate (suzy) ventured over to his apartment. We were soon after met up with one of our newly found friends, Bob, who decided to join in the trip with us. We divided up about 2 grams of dried mushrooms for all of us. They gave me one of the 'best' ones, not broken up, long stem with a nice cap. I quickly chewed up the awful tasting fungus and sat back and relaxed. My friend Bob then said he had to go run a few errands and he'd meet up with us again soon.</p><p>No less than 10 minutes after Bob left my trip had already begun. No one had ever pre-warned me about what the effects could be. Almost immediately I was thrown into a 'bad trip'. I sat huddled on the side of the couch staring at Fred and Suzy. They kept asking me what's wrong and I kept saying 'I don't like this. What's happening?' Slowly Suzy and Fred's faces starting changing, their noses were on top of their face and their lips where were their ears were supposed to be. I was freaking out! Fred instantly realized that I was having a bad trip and told me it would be fine and that just to cheer up and it's all ok. He asked if I wanted to go anywhere, and I said my apartment. We all got in the car.</p><p>While driving the road looked non-dimensional. The road was flat and the lights were amazing. I was a little less freaked out, but still confused what this drug was doing to me. I looked down at my cell phone which appeared to be melting in my hands. I threw it across the car and freaked out again.</p><p>What seemed like hours later we arrived at my apartment, Fred me and Suzy off and we both went upstairs to our place. Suzy kept bitching that her trip hadn't begun and I was tripping balls! The room like small and huge at the same time. I tried to find something to entertain myself but nothing worked. I tried to play on the computer but things kept melting and popping out at me, I tried to clean my room but my hangers kept changing into weird shapes. I wanted to take a shower because I was sweating but as soon as I entered the bathroom and looked at myself in the mirror I freaked out even more. I looked almost like a skeleton. I looked down at my hands it looked like someone had burned holes through them. Nothing I did calmed me down. It was no use, I was in a bad, bad trip.</p><p>Before I knew it I was huddled in my bed with the lights off and no music playing. I wanted to cry but I couldn't. I wanted so badly to be out of the trip. My whole bed felt like it was spinning. I looked over at my window and it seemed like it was a million miles away. I wanted to sleep so badly, but whenever I closed my eyes I saw what seemed to be demons or monsters. My emotions were running wild. I can't even remember now what I was all thinking but it was the most intense thinking I've ever had in my entire life. I attempted many times to call my friend Bob. He was stuck at another friends house, tripping balls also. He said he so badly wanted to get back to help me, just hearing his voice made me feel 100% better for the time being. When he hung up it all when wacko again.</p><p>Finally, after probably an hour of horrible tripping my friend Bob made it back. He came in my room, turned on some music, put on a dim light and immediately I was better. We layed there and talked for hours and hours about life and everything. The horrible trip had turned into the best trip ever. To make the story even better, now me and Bob are dating. We still believe the 'trip' is the only reason we ever got together.</p>"
}
