{
 "title": "Not to Dance",
 "author": "SearchingInside",
 "citation": "   SearchingInside. \"Not to Dance: experience with PMA (ID 29998)\". Erowid.org. Jan 14, 2004. erowid.org/exp/29998",
 "substance": "PMA",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "PMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 29998",
   "Male",
   " ",
   "Not Given",
   "Jan 14, 2004",
   "Views: 23507",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI feel I must first point out that I did not voluntarily take PMA as a recreational substance but rather discovered after ingesting a pill that its content was not the MDMA I believed to of bought.  The tablet was a large with the famous 3 triangled Mitsubishi logo stamped on it, the tablet was white.</p><p>I bought 10 of these large Mitsubishi pills as my current consumption is to dose once or twice a week with between 6 - 12 pills each time.  I hadn't had these pills before so bought 10 knowing I would try one, if I was satisfied with the effect I got from that I would be able to ingest more.</p><p>I took the tablet at about 2am, the come up for a pill for me is almost always between 50-70 minutes after ingestion so at 3am you can imagine I was expecting something to happen soon... nothing.  3.30am came, still nothing.  4am came, nothing.  At this point I decidedly accepted I wasn't going to get an effect, I am not the type of person to ingest more unknown substances in the hope of feeling an effect.  However at 4.30am I felt something, not an MDMA come-up though, more like a slight warm feeling thats not too dissimilar.  After this initial feeling which lasted about 5minutes I felt noticeably different.  Not the warm, loved-up feeling of ecstasy however, more like feeling tired when youre wide awake.  I found myself constantly stretching and wanting to move - the wanting to move feeling was a lot like when youre looking for something but you cant remember what it is youre looking for so you just search hoping when you see it you will know thats what you wanted.  I tried moving about different rooms of my house, lying down in places, sitting in others, I couldn't find where I wanted to be.</p><p>This feeling went on for about 3 to 4 hours, it wasn't something I would consider enjoyable but it was a learning experience.  I cant imagine dancing on it if in a club however my friends who use less ecstasy report they got much stronger effects from taking just one of these tablets.  One of my friends who took 2 however had a bad experience, not in control of his own body and had to be looked after by other friends that promptly took him home to try look after him.  He woke the next morning however feeling ok.</p><p>Suppose the moral of this is to remember with ecstasy you are often taking a cocktail of drugs, test a batch before you plan to spend a night taking as many as you will and always be cautious.</p>"
}
