{
 "title": "Religious Shroom, Unholy Experience",
 "author": "d-batch",
 "citation": "   d-batch. \"Religious Shroom, Unholy Experience: experience with Amanitas & Kratom (ID 30016)\". Erowid.org. Mar 22, 2004. erowid.org/exp/30016",
 "substance": "Amanitas & Kratom",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "9.0 g",
   "oral",
   "Kratom",
   "(tea)",
   " ",
   "2.75 g",
   "oral",
   "Amanitas",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2.75 g",
   "oral",
   "Amanitas",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 30016",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 22, 2004",
   "Views: 14672",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I obtained one ounce of dried Amnitas from a friend, along with 1 ounce of kratom. I boiled the kratom down to a double extraction.</p><p>That evening I ate about 1 gram of the Amnitas just to test my physical reaction. I ate them in my apartment, alone, while prepairing the Kratom tea. Nothing much happened, except for some feelings of internal balance and well being, surely nothing that couldn't be explained away by a placebo, or the occassional sips of kratom tea I was taking.</p><p>My apartment was cozy. I was watching 'The Rockers' (old rastafari movie), and alternately listening to shamanic dream in the background.</p><p>The next night I decided to try both the amnita and kratom again. I was working that evening, and took the kratom at work, about 1/3 an ounce worth of tea. It gave me a nice buzz for a bit, but it was both short lived, and not neccessarily intense. Before I left work, around 9:15pm, I ate approximately 3 grams of the amnitas ( I just eat them dry. Strong stomach!), still cautious to test my reaction. I felt a little strange. Walking home I smoked a small amount of MJ, hoping to kick things in a bit. </p><p>By the time I was half way home things were starting to kick in. Nothing heavy, but I was looking around at all the building tops. My attention seemed to wander heavily, and, while I felt normal, I realize in retrospect this was not the case.</p><p>I made it home, and jumped right into eating another 3 grams of amnita, before too much time had passed. I began working on my computer, but this didnt feel right. I would start watching TV for a minute, but again, it didnt feel right. I would throw in a cd, and then feel like taking it out again. In short, I was unsettled. It was only when I would just sit there, on the couch or a chair, doing nothing, that things felt right. I was very lethargic.</p><p>Logic was not working that well. I would smoke some MJ for slight nausia, and afterwords would be buzzing intensely, thinking it was just the MJ, but no, the amnitas were coming in much full force.</p><p>Initially it was a heazy, heazy, body buzz. Almost nitrous like, but less refined. I felt it all over my body. very strange. There were some slight visuals, but very compact. Not moving all over the place, but just everything in the visual field buzzing rapidly, but compactly. A few times I lay down on my couch, to rest, and when I would come to, things were very strange. The body buzz was intense. My mind was thinking in very shallow circles, almost as if free'd from this experience, as if the mind wasn't to be a part of it. It was quite a 'high', but not the type I'd expect from a psychedelic (understanding that these are not your 'typical' psychedelic).</p><p>All and all, by about 3 am I had no doubt that the mushrooms were working. I was quite suprised, as all my life I have read about amnitas, and held them in very high religious regard. Of the thousands of other major trips I have had, this was one that was quite mellow, and quite un religious or mentally/spiritually substancial.</p><p>I wouldn't scare anyone off from trying Amnitas. When I ate just the gram it felt rather nice on my body, and I could see how some refer to it in small amounts as a 'tonic'. I would also think that one would have to take quite a bit (10 grams +) to really experience the religious potential of these shrooms.</p><p>I plan on taking them again, with a friend this weekend. We'll see how that goes!</p>"
}
