{
 "title": "Candytripping",
 "author": "R",
 "citation": "   R. \"Candytripping: experience with LSD, Ecstasy, Cannabis, Kava & Alcohol (ID 3001)\". Erowid.org. Aug 15, 2001. erowid.org/exp/3001",
 "substance": "LSD, Ecstasy, Cannabis, Kava & Alcohol",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis - Hash",
   " ",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Kava",
   "(extract)",
   " ",
   "  ",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3001",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 15, 2001",
   "Views: 23048",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy girlfriend and I had some time off, and we decided to trip for three days.  We licked blotter, and began hitting the bong with good Mexican hash right away, and drinking burgundy wine.  About 2 1/2 hours or so into the acid high, we each swallowed a small bottle (an ounce) of liquid kava kava, and then took two green Ecstasy tablets (about 160 mg we think).  Through out the day, we continued to smoke hash on and off, and we each drank 1/2 liters of wine or so.</p><p>We did this for three days straight.  We started at about noon.  For all three days...we had pretty intense sex on and off -- esp. when the rolling began.  </p><p>This was the best drug experience we had.  I am 190lbs and 6'0', and my girlfriend is 5'4' and about 105lbs.</p><p>On the last day, I had dropped another dose of acid at 6:00 PM and two more x pills.  My girlfriend took another half hit of acid at 6:00 PM and two more x pills.  We shared another bottle of liquid kava kava on the last night at about 7:00 PM.</p><p>We noticed no room spinning -- or any of the negative features of alcohol.  We both felt very warm, tingling and numb.  I felt extremely numb in my lips.  We both felt very light-headed, and 'detached.'  The feelings were very powerful, relaxing and peaceful.</p><p>We felt the rolling about a 1/2 hour after we took the x.  It had to be about 4 times as strong...but we did not notice any negative heart racing...  We are not sure why.</p><p>There were no real visual hallucinations other than everything feeling 'fuzzy' and we felt a kind of mystical one-ness.  We arranged to be alone in a very peaceful setting -- with relaxing music throughout the day.  We slept a very strong 7-9 hours each day...and on the final day -- we both had intense dreams.</p><p>It seems that the hash and kava kava might have reduced the jitters that we normally feel after rolling.  The next day there was little 'hangover' but we both felt a little 'numb,' and agreed that this experience was also very positive, but that it would be hard to do any kind of serious work, as we just wanted to sit back and relax.  I think any kind of concentration would have been difficult.</p><p>During the experiences, we ate light...fruit, salads, breads...but never really had an empty stomach -- and ate three meals each day.</p><p>This morning -- on the fourth day -- we were fine.  Feeling extremely relaxed, lazy, and slightly numb.</p><p>We think kava kava alone -- or in combination with hash -- took the edge off any hangover.</p><p>The sex was incredible.  It effected my girlfriend greatly -- it had a profound dsinhibiting effect --- to the point where she now claims she claims to want to have the type of sex she was once afraid to try -- anal and light bondage -- which we got into the last few days.  This activity was new for me.  It is hard to describe, but it seems to 'change' your personality a little, and make you more receptive.</p><p>We both want to mix these drugs again --- the experience was so wonderful.  Usually, we roll about once a month, and normally are very light social drinkers.</p><p>I am almost afraid to write these words...cause I feel if anyone tries doing what we did --- they would be hooked --- it felt so so good.</p><p>One more thing --- it seemed like we needed to drink a lot of water...and had felt a bit dehydrated.</p>"
}
