{
 "title": "Sheer Insanity",
 "author": "Ripper",
 "citation": "Citation:   Ripper. \"Sheer Insanity: experience with Diphenhydramine (Unisom) (ID 30048)\". Erowid.org. Sep 18, 2006. erowid.org/exp/30048",
 "substance": "Diphenhydramine (Unisom)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Diphenhydramine",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 30048",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 18, 2006",
   "Views: 63801",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy friend stole 2 bottles of Unisom Sleep Aid from a store. There were 32 Gel Tabs in the bottle. My friends told me about unisom, and I didnt even know it was an OTC (over the counter). So, he sold me a bottle for 3 bucks. To my own convenience, there was a dance at the local teen center, so my plan was to ingest a few before attending it. And heres what happened:\r\n5:30pm- I purchased the Bottle of 32 Unisom Sleep Aid Gel Tabs.\r\n6:15pm- I begin to get ready for the dance, and swallow 5 tabs.\r\n6:30pm- I take another 3 or so. (I was a bit nervous about taking all 12 at once)\r\n6:45pm- I take 4 or 5 more- At the time, I was aware that I had taken exactly 12.\r\n7:00pm- I arrive at the dance. I told one of my friends, who was the one that informed me about unisom, that I took 12 pills. He told me I would probably puke, and he laughed, stating that I was about to be the most fucked up I had ever been. I was surprised, because I had used a lot of weed, shrooms a few times, a lot of alcohol, and many different pharms, so I doubted that an OTC would fuck me up really bad since this I have tried MANY other drugs, none are as strange as this one. Boy was I ever wrong.\r\nI entered the dance, and while I walked up the stairs I felt a little light headed. I paid to get in, and walk around to find some more of my friends.\r\n7:30pm- OMG! I started to feel very, very heavy. I didnt really feel tired though. I started to notice little visual distortions like a clock on the wall, that wasnt really there. My friends approached me and said something, I asked 'what'? And they asked it again, again, I didnt understand them. Its impossible to think, you have a 3 second memory span, and become lethargic and cannot talk, or cooperate with any form of communication.\r\n8:00pm- I begin to have extremely realistic hallucinations, like when I was talking to a friend that wasnt there that night. When I looked at a person, they looked pale, and fake, everyone looked like a Manikin. I failed to move, or do anything for the most part. But at one point I recall having a playstation 2 pad in my hand. I was frustrated because I couldn't get the ps2 to work! So I went to restart it, and it disappeared, and I looked around to see my computer mouse, monitor, keyboard, and cpu scattered throughout the floor, I went to collect them all, but each item disappeared as I touched it.\r\n8:30pm- I get the energy to stand up, but feel like I weighed 500 lbs.as I look at people, I cannot understand if they are real or not, and I remember stopping, and just dazing at people that were standing around. One kid was against the wall, standing by himself, and I stared at him for about 3 minutes, he finally dashed away from me...he knew something was up.\r\n9:00pm- The hallucinations just intensify, now, every time I zone out for barley a few seconds, whatever Im looking at blends together, and swirls around, until I blink, or focus out. My friend that said I would puke, asked how I was doing, but I just stared at him. And he just stared back at me, w/o moving a muscle, until finally he vanished. At one point I saw someone get tackled, but I turned away for a moment and they too had disappeared.\r\n9:30pm- I take off my sweater, and put it back on a number of times because of hot flashes. And the hallucinations remain the same, but seem more and more realistic, and impossible to tell apart from what was real. See with lsd and mushrooms, the visuals are noticeably fake such as pink elephants and what not.\r\n9:55pm- I walk home from the dance, and stop at an apartment building, I think its my friends appt building, but its not. So regardless I enter the building and run up to the 4th appt and open the door w/o knocking (I always do at his place) but there is a fat older woman sitting in a metal chair, feet away from the door....I could only do one thing...runnnn....I got outside, and forgot about the old lady incident. I look up to the sky, and I see a twisted spiral in the sky and touch the ground, it was approaching me, and the high winds made it seem so real. Then the fire alarm went off, so I turn around and where am I? My friends appt Building...so I go up to appt number 4 and again, I open the door...and the same lady is just sitting there (note: the lady was real, not a visual)...once again I ran (apparently I forgot about my first visit), but this time she came out after me...I easily escape from the scene and decide home is much safer.\r\nIt was about 10:10pm- when I got home and for the rest of the night I hallucinated conversations with friends, I saw my math teacher, I stomped out an army of spiders, and freaked out my mom and dad.\r\nAll in all it was a crazy experience, I learned not to under estimate any drug...and I saw life in a new perspective\n\n\n"
}