{
 "title": "Two Virtually Identical Trips",
 "author": "kathleen",
 "citation": "   kathleen. \"Two Virtually Identical Trips: experience with Salvia divinorum (ID 3007)\". Erowid.org. Dec 12, 2001. erowid.org/exp/3007",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3007",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2001",
   "Views: 7404",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've done Salvia twice now, and the most stunning thing about those two trips was that they were virtually identical. The circumstances of each were not particularly similar but that made not a bit of difference to my vision.  Both smokes happenend in my flat that I share with my boyfriend. He was with me on both occasions. The first time was in the lounge with the light on and me standing up with my monstrous bong by the open window.  The second time was in semi-darkness sitting on the edge of the bed. <br>The first time, I had to take the dose in three hits  because our bowl wasn't quite big enough. The 2nd time around I'd got us a really rather big bowl, so it was a pretty swift smoke.  Both times I had about 40 seconds of conciousness before I was somewhere else entirely. My surroundings had lost all depth, and  every aspect of what I could see was now exactly the same distance from me.  The room before me was a cliff-face or a huge screen that utterely filled my field of vision.  The wierdest thing about this was that millions of living, breathing, fleshy little Pauls (boyfriend) were acting as variously sized pixels, I was faced with some big scary TV screen made up of little versions of my boyfriend. The first time round I had been laughing for what seemed like ages and they laughed along in unison. I was laughing because I had realised that what I was seeing was what had been my life all along.  Everything I had seen and done  had been a simulation made up by these little Paul-pixels.  They demonstrated this by changing my now two-dimensional lounge into a three-dimensional alien exotic scene with cascading waterfalls and lush non-existent plants and trees.  I got upset then, pushed the vision away and dashed into the bedroom.  <br>On my second trip, right after one big hot inhalation and holding it for 20 seconds I felt like 'everything-was-horribly-real-and-that-I-really-shouldn't-have-smoked-that-stuff'.  I clambered on to the bed and went to pull the quilt over me; that is the point at which I sort of got stuck.  The first time around I was stuck laughing monotonously trying to come to terms with the stuff I was looking at, whereas this time I was stuck trying to have some physical effect on my surroundings.  I saw them all looking at me and kept trying to pull at the covers, but I could see that my hand  grabbing the material was merely a ripple in their fleshy little faces. I did it over and over again yet it was as if I'd never moved let alone touched anything; they were again showing me that it had all been a nasty great simulation.  When I tried to look in another direction I became aware that I didn't actually have a body, all I could do was watch this huge screen that sweeped wierdly when I was supposedly moving my head.  When I started to come out of it, just like the last time there was  a pretty strong residual effect on my vision.  I could see my flat, there was depth again but they were still everywhere.  I was feeling really uncomfortable and totally amazed.  <br>How the hell could I have the exactly the same thing happen twice?  It's made me really suspicious of my life.  I am able to bring on that wierd loss of depth now with whatever I'm looking at, certainly it's not quite as vivid but it's still fucking unsettling. I realise now that the 'essence' of my first trip was lost in my attempts at an explanation; however my second go at salvia has really improved my understanding of that first experience, after the second smoke I was overwhelmed with a sense of how 'wrong' I'd been about the first. I find it fascinating that Salvia was once used as a method of divination; is it a 'Plant of the Gods'? Can we learn from it? Or does it just have funny chemicals in it that just happen to really, really fuck with your brain?  It's just too wierd, I got like this about mushrooms.\n\n\n"
}
