{
 "title": "Preparation Pays Off",
 "author": "bluey",
 "citation": "Citation:   bluey. \"Preparation Pays Off: experience with Psilocybe cyanescens (ID 30084)\". Erowid.org. Jun 14, 2004. erowid.org/exp/30084",
 "substance": "Psilocybe cyanescens",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cyanescens"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 30084",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2004",
   "Views: 17129",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was to be my first try with wild collected psilocybe cyanescens. myself and two fellow intrepid explorers (L& F) had planned to go  for another serious psilocybin journey for some time, and after searching in vain for quite a while for cyanescens, I was elated to stumble on them (after nearly giving up) in a coppice on my way to work. Something had 'told' me to stop and look in this relatively uninviting spot and yet despite misgivings I gave into the impulse pulled over and walked to a lone rhodedendron bush in the beech coppice. BINGO! there before my very eyes was an enourmous patch of specimen perfect cyanescens. They were absolutely beautiful, some were huge and wavy capped with deep blue margins others small and flying saucer like.  I picked around 75% (leaving the others to do their wonderful task of procreation) and left. I took this as a sign of the mushrooms intent to be 'discovered and ingested'.\r\nThat weekend my two friends and I headed of into the  mountains where we had hired a cabin in a deeply forested valley.  we spent the day walking through the now snow capped mountains, valleys and forest discussing the mystery, easing one anothers daily stresses and concerns away  and giving one another the confidence to unravel the mystery of these supposedly potent mushrooms. After our walk we found some suitable habitat for the mushrooms to flourish (wood chipped shrubbery) and deposited a small bag full of mulch riddled with the mycelium from the mushroom discovery site, hopefully creating a future patch for the mushroom to flourish.\r\nFeeling high on nature, and  now on equal terms with the mushroom after helping it to further its range, we returned to the cabin, and prepared for the voyage. After admiring the mushrooms and making a toast for a sucessful journey, we ingested our mushrooms in ginger and lemon tea (on empty stomachs) and waited to alert.  Within ten minutes I could feel the tingling and stomach knotting starting and by its rising intensity there was no going back. CEV's of turquoise hued lanscapes started shortly after the physical effects and within  30 minutes I was forced to go and lie down in the darkened bedroom and submit to the almost overwhelming landscapes washing over me. I have never had  a psilocybin experience that kicked in this fast and intense before. After quite some time the rapidly evoloving lanscapes turned into fortress like structures that pulsed, throbbed and changed structure at an amazing pace. Covering these structures were thousand of identical  mushroom  effigies similar to the aztec and mayan sculptures. These figures were small squat and heavy looking, emotionless and yet animate. They seemed to march forward at me in formation, emmiting a thunderous almost tribal drumming technoid sound. \r\nFlaoting above these emerged what looked like some kind of silvery translucent, crowned  insectoid angel elves. They hovered at the back of the marching mushroom army as though orchestrating their movements. The angel elves seemd to bend near to me  yet they did not communicate, they seemed distanced from the experience as though observing from afar. Almost lost in this sea of intense imagery I could feel my ego draining away...not my self, I knew who I was and where I was but I felt different,dissolved and free, at one with everthing, floating in the same space as the indifferent relentlessly marching army plodded on. The angel elves seemed to nod in agreement at my submission, and from there on in I can recall little precisely. I seemed to float bodyless in a deep turquoise ocean  of language that changed rapidly like the fuits on a slot machine whilst bodyless. I had the sensation of being a spherical comet like pink aura  that swam around like a contented tadpole. I recall absolute bliss. \r\nShortly after I became aware of L & F gasping in amazement and laughing but almost distantly as though we were in a huge hall together. we enjoyed seemingly this mind space together, I recall a shared and felt ecstacy between us.  Eventually the images and sensations subsided and we gathered our selves together, put on our coats and gloves  and walked outside where the cold  mountain valley was awash with the  starlight afforded by a new moon. The constellations dripped with  rainbow colours. I felt at this  point ancient, timeless and blessed to be alive - feelings that  have come to typify my psilocybin experiences.  After a brisk walk we returned the cabin and prepared some hot chocolate and began to share our experiences with one another. \r\nAll in all this was for me a breakthrough experience, in exploring this mushroom, and hopefully an indication of what may come in  future experiences.....If they are prepared for as thoroughly as this one. \r\n*Furthermore heed what Gartz, Stamets etc. say, P.cyanescens is an extremely potent mushroom. I can say that 3.5g is far stronger than 3.5g of mexican cubensis, (I would estimate equivalent to at least 5g) Take heed and  care, pay respect  and they should share their magic with you.\n\n\n"
}