{
 "title": "Beating Tentacle Things",
 "author": "Akuma",
 "citation": "   Akuma. \"Beating Tentacle Things: experience with Salvia divinorum (Leaves & 5x Extract) (ID 30101)\". Erowid.org. Jun 16, 2007. erowid.org/exp/30101",
 "substance": "Salvia divinorum (Leaves & 5x Extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "1.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30101",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 2889",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThis was my first hallucinogenic experience ever. I had been reading up a lot on Salvia and decided that I was curious enough to try it. I was interested in Sally for her potential in unlocking different states of spiritual awareness, but I didn't expect to achieve this on the first shot. I wasn't quite sure exactly what to expect as far as how my own individual experience would be. I decided to try it tonight, as the urge had gotten quite strong and it just felt like the right time to go through with it. I'm actually still coming down from my trip as I write this, so formulating a thought has its difficulties, and typing takes a bit more effort than usual.</p><p>Anyhow, on with the show. All I had to smoke with was a very small keychain-size pipe, so I decided to make do, though I knew I might not be able to do this right with such a small pipe. I had just gotten home from being out at a local bar with a friend but I didn't drink much. I took a shower after I got home and then decided I was ready. I was in a good, generally calm mood but was a bit nervous about what I was about to do, since I had never done any drugs other than pot before and didn't really know what to expect. I packed the very small bowl of my pipe with some crushed unenhanced Salvia leaves and lit it, trying to inhale as much as possible without burning my throat. It wasn't a huge hit, but I managed to hold it for about 10-15 seconds before letting it out.</p><p>I felt a little buzzy and lay back on my bed for a bit, thinking that the little patterns that I usually see behind my eyelids when I close my eyes seemed very slightly different but not enough to really count for anything. I took another hit and realized that the bowl was spent, so I packed another bowl and took a hit, this time holding it in for a count of about 20 seconds but not managing to keep all the smoke in. Didn't get much off that one. Then I decided to try the 5x that I had and see if I had any better luck. I only put in enough for a half bowl and took a hit. I lay back, closed my eyes and saw some spinning orb-like shapes for a few seconds, but they were not very bright. I was getting a little braver with every hit, so I decided to go for a whole bowl of the 5x. I loaded the bowl and lit it. I knew I had taken it deep enough when I felt a burning sensation in my throat since the smoke was too hot. I held the hit for about 30 seconds and exhaled. I put down my lighter and pipe, and then my vision began getting a bit wavy as I closed my eyes. This is where it gets harder to explain.</p><p>When I closed my eyes, everything in front of me, including me, began to break up into these strange, very small creatures with beating tentacle-like things. Unfortunately I don't have a sufficient way to describe these things, as they looked like nothing I'd ever seen before and not quite 3-dimensional. They started to crawl in a perpetual procession. I heard a loud, metallic, buzzing/roaring noise and felt a sensation like I was being repeatedly thumped by small objects all over my body as these things moved along. These creatures made up everything in the room, but the objects themselves (my table, chair, me, etc.) retained their basic forms though the things that comprised them were moving.</p><p>I lay back and as I did so, I wondered if they were going to crawl on forever, and I felt like I was drifting backward, so I thought they were carrying me off. I was still conscious enough of what was going on that this wasn't all that frightening, just strange. I didn't have a sitter, either, so it's probably better that the trip wasn't more intense. Time seemed to disappear when my eyes were closed, and I felt like I was going to drift on forever, but then I opened my eyes and felt a sense of surprise that all I saw was my room just as I left it--no little weird, not-quite-3D tentacle buggies crawling around.</p><p>I came back to reality very quickly and knew that I'd only been tripping for a few seconds. I realized that the noise I heard was coming from my air conditioner, but it didn't seem nearly as loud. After a minute or so the closed-eye visuals subsided and I was feeling more-or-less back to normal, aside from a slight buzzy feeling, so I decided to sit down and write this out so that I could remember this. I think I'll probably do this again, but I think I'm going to get a water pipe before I do. I definitely see the advantages in using a water pipe over my little dinky hand pipe.</p>"
}
