{
 "title": "Hiccups and Red Eyes",
 "author": "Pantless",
 "citation": "   Pantless. \"Hiccups and Red Eyes: experience with Yohimbe (ID 30133)\". Erowid.org. Jun 25, 2007. erowid.org/exp/30133",
 "substance": "Yohimbe",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Yohimbe",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "30133",
   "Male",
   " ",
   "Not Given",
   "Jun 25, 2007",
   "8892",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had heard of the yohimbe bark powder being a powerful aphrodisiac causing spontaneous and long lasting erections.  I decided to 'surprise' my girlfriend by secretly ingesting 2 heaping spoonfuls of the bark powder at about 2100 hours.  I got really bad hiccups that would not go away.  Very unusual for me.  </p><p>About an hour later we went to bed.  I did not feel any aphrodisiac effects but we had our normal sex when the hiccups stopped.  Nothing unusual and eventually I drifted off to sleep.  At about midnight I got up to pee and began hiccupping some more.  It was a very spasmic hiccupping and it was painful.  I began to feel very hot and began sweating profusely.  The sweat literally soaked the bed.  My heart began to race over 200 beats per minute and I was beginning to wonder if I was going to die.  </p><p>After about 2 hours the hiccups and the sweating and dying feeling left but I had to get up to pee again.  When I got up I felt faint and could barely make it to the bathroom.  I felt like I was going to throw up.  My eyes were red and very dilated.  I had to sit up on the couch afraid I was going to puke.  I did eventually return to bed but did not sleep.  It is now 10:00 the next day and still haven't slept.  My head and stomach feel terrible. I find it difficult to concentrate (like a very bad hangover) and I can't eat.  I never felt the aphrodisiac effects.  Just misery.  Maybe I ingested too much.  I'll never find out because I'm going to throw the rest away. The experience felt a lot like eating 10 grams of morning glory seeds but with none of the positive effects.</p>"
}
