{
 "title": "Max in Wonderland",
 "author": "Max",
 "citation": "   Max. \"Max in Wonderland: experience with Mushrooms (ID 30153)\". Erowid.org. Jan 19, 2004. erowid.org/exp/30153",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 30153",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 19, 2004",
   "Views: 6908",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just got down from a trip. Everything is really strange because I feel normal but I also remember the extreme fear I felt a few hours before.</p><p>Lets start from the begining.</p><p>I just woke up. 8:40AM. Yesterday i had a nice easy trip and today I decided to go for more. Yesterday i did only 1.5 grams. </p><p>I take a shower, eat a small breakfast and then take a walk in preparation for the trip. I walk for about 20 minutes. I talk to myself about people and how I'm looking forward to this trip. Im doing all this by myself. I've had experience with weed and light mushroom trips before. </p><p>At 1:00PM I take the shrooms. I go out and walk to the beach. It's a sunny day and as I get there the shrooms hit me slowly. Things get slightly briter, more colorful. I sit and lay down in the sand. The sand feels like freedom to me. I love it. The sun, everything felt great. I knew I had to get back so I started walking back. It seemed like it took the life of the universe to cross a block. </p><p>I finally got home. I thought I had been out for a long time but the clock said about 3:00PM. It didnt make sense to me because i knew it takes at least half an our to get to the beach. I felt like I was at the beach for hours. I started feeling a tingling in my stomach but i told myself that it was the shrooms. </p><p>I wandered around the house and enjoyed the visuals. I went outside. After I went into my room. I put on ambient music and layed down. I started feeling like I was an insane person. I felt like I was in a weird wonderland. </p><p>Progressivly it got worse. I started feeling as if my room was floating in a void. I felt like I was the only person and I got anxious. I felt like I was in a dream world that I couldn't escape. I couldn't remember anything. I didnt know why this was happening. I then felt as if this had been going on all my life. I felt I was born insane. I looked at the time and it said 3:30PM. That really freaked me out because for and hour, at least, I had been all over the house. I then looked again and it was 4:00PM. I got really freaked. I looked in the mirror and saw myself but it was also like it was this evil me. It started talking to me but I had this schizophrenic feeling that my good side was talking to my bad side. </p><p>I wanted to leave the room but I couldnt bring myself to get to the door. I then felt as if my body was being controlled. I had no control. But, I didnt move. I felt as if my body rejected me for being me. I was helpless. I wanted to cry, scream, do anything to make me feel like I was in reality. I was trying to see reality. Wonderland had become my reality and I couldnt leave it. </p><p>I eventually got out of the room and went downstairs. I saw my parents and talked to them. We then went to dinner. This whole time I was still in wonderland. Everyone was insane. When we got to the restraunt and sat down suddenly the trip stopped. I blinked and everthing was normal. It flickered like that a couple times and eventually was over.</p><p>I dont know what happened. It was all good through the day but once I got into my room which isn't that small I lost it. I really want to try shrooms again because I want to face the fear again if it happens. That probably sound really strange but I believe in facing problems.</p>"
}
