{
 "title": "Disappointed",
 "author": "sensi star",
 "citation": "   sensi star. \"Disappointed: experience with Mushrooms (ID 30168)\". Erowid.org. Jan 19, 2004. erowid.org/exp/30168",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30168",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 19, 2004",
   "Views: 6547",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my second time trying mushrooms, I had past experiences with weed, cocaine, meth, and pharmaceuticals.  My first trip wasn't very successful, I took about 2 grams and felt sick and I couldn't walk, and I just laid down and tried to sleep.  Last night, at about 11:50pm I took 2 grams of mushrooms with a friend, he also took 2 grams and washed it down with a cup of orange juice.  Then we sat down on the couch and put in a movie.  After about 30 minutes, I felt definately different, the movie was confusing to me and I really didn't pay attention to it, I was just nervous about the experience I was about to have and hoping it wouldn't be like my first.  I got up and went to the bathroom, and when I shut the door, it seemed like I got sent to another dimension and I was in a new room I've never been in before, It didn't really look different it just felt like I was somewhere I've never been before.  Everything started to get really blurry after I left the bathroom.  </p><p>After that we both walked up stairs into his room to just lay down and listen to some Reggae remix of Pink Floyd's Dark Side of the Moon.  When we got into his room, I laid down on a bed and I laid in backwards and the pillow was at my feet, I didn't have a clue where I was or what was going on,  I was NOT having fun.  My friend kept telling me to turn around so I could get into bed but I just sat there staring at him and I said 'what?'  He was laughing at me, I laughed too and then we just laid in bed trying to relax and listen to the music.  The music seemed to melt (I dont know if it makes sense but it sounded like it was melting), during the whole experience I noticed that my vision seemed really wide, like a panorama type of view.  My friend told me he was going to bed and I told him I was gonna try to too, I sat there thinking very heavily about everything that was on my mind...negatively..I wanted to return back into reality.  I sat there tossing and turning in the bed for hours and hours, I couldn't sleep at all, I was wide awake.  </p><p>I needed to know what time it was,  so I got up and walked down stairs and got my cell phone and saw it was 5 in the morning...I was shocked how fast it went by.  I went back into bed and tossed and turned for about 30 more minutes and finally went to sleep.  I woke up at 9am not tired and disappointed, I probably won't take mushrooms again...I don't want to experience that again.</p>"
}
