{
 "title": "Causes Lasting Effects",
 "author": "Warning",
 "citation": "Citation:   Warning. \"Causes Lasting Effects: experience with Inhalants (ID 30219)\". Erowid.org. Nov 10, 2007. erowid.org/exp/30219",
 "substance": "Inhalants",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Inhalants"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 30219",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 10, 2007",
   "Views: 10470",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] \r\nSeveral years ago I was about 15 or 16 and one of my chores to do was to clean the bathroom. Fair enough, so I did so about every two weeks. Well, one weekend I was cleaning the bathroom, using Lysol on the surfaces, and before I realized it I was a bit high. It was a complete accident -- but in a small bathroom where you are spraying heavy amounts of Lysol onto surfaces (some of which ends up airborne in the process of spraying) for 15 minutes or so, breathing all the while, it isn't exactly surprising. After finishing the bathroom I went out to eat with my family, and I felt quite strange. My kinesthetic sense felt less grounded, things felt a bit more ephemeral. There was the feeling of my vision *almost* spinning. I felt a little less connected to concrete reality.\r\nTo my surprise these effects lasted. For the next week I had trouble reading as I was distracted by this change in perception. To this day it remains -- I have simply become used to it. It is regrettable but it is one of those 'shit happens' things. It is a very subtle thing and, having gotten used to it, it is rarely annoying, but occasionally if I am particularly tired it does affect my balance and makes my head feel a little strange. Now, I suppose it's possible I am imagining the whole thing. But in all honesty -- I doubt it. Even now I can feel it if I pay attention, the slight 'shiftiness' of my sense of balance and orientation. As I said, it is subtle, but it is there.\r\nMy advice to people first of all is to be careful when using cleaning supplies. Make sure to have a supply of clean air always, or better yet, use a mask when cleaning. I am probably peculiar in that I have had permanent, noticable changes in perception from just one encounter, but I have heard of it happen before with the intentional use of inhalants, so there is no reason why it couldn't happen with the unintentional use of them.\n\n\n"
}