{
 "title": "Matrix of Obligations",
 "author": "Stropharia",
 "citation": "   Stropharia. \"Matrix of Obligations: experience with Amanitas & Salvia divinorum (ID 30259)\". Erowid.org. Jan 10, 2007. erowid.org/exp/30259",
 "substance": "Amanitas & Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "12 g",
   "oral",
   "Amanitas",
   "(plant material)",
   "  T+ 2:20",
   "80 mg",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 30259",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 10, 2007",
   "Views: 12821",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The setting was my grandmother's house, where I happen to be staying.  Due to her impaired mobility, I had the upstairs largely to myself.  It was a rainy day.  </p><p>My set was one of curiosity.  I wanted to know what would happen if I combined amanitas with salvia.  I had read the two reports, but decided that these negative experiences were the result of taking too much and receiving much more effect than anticipated.  My intention was to smoke a small amount of salvia on the amanita comedown.  I had no immediate and demanding obligations, though there were a number of big things on my to-do list, which may have influenced my salvia journey.</p><p>The amanitas arrived a few days before in a clear sealed plastic bag.  Very clean; whole dried caps attached to stems.  Quite pretty.  My method of ingestion was simply to chew on the caps and swallow the material.</p><p>First I tried small amounts.  One cap at a time.  No effects were noted from these experiments.  But this time I weighed out four caps: just over 12 grams.  From previous experience, I knew that ought to do something (even though, thanks to variable potency, I couldn't really say what it would do).  I ate them at 9:45 AM.  A bit later I started finding it hard to concentrate, and I felt slightly nauseous.  Soon the difficulty in concentration became quite severe, and I decided to go upstairs so as not to behave strangely around Gran. (10:50)</p><p>I lay on my bed thinking about nothing in particular.  It was hard to get my mind thinking about something, and hard to keep it there, but I could if I really tried.  While trying this, I noticed little jerks or convulsions in various parts of my body, especially my hands.  This would continue throughout the trip, and would have been the most notably odd thing about me to an observer.</p><p>Growing tired of lying down, and feeling more comfortable with my state of mind, I went downstairs and made some camomile tea.  I exchanged some words with Gran and with P., the cleaner.  Somehow I always came out with the right thing, even though I couldn't formulate a reply in my mind before speaking.</p><p>I went back up, lying there for a while.  Hadn't expected it to be this strong.  Came down again (why?), sat at my computer, and tried to learn some course material!  I spent a lot of time trying to concentrate, but I don't remember a great deal of it.  After a while I felt the effect wearing off, and part of me was relieved.</p><p>Sitting at my computer, I decided that I had come down enough to try the salvia.  Having read the reports of over-the-top experiences, I was quite cautious.  I was pretty far down: not far enough to drive, but far enough to interact with just about anyone.  I could feel the effects, but they did not interfere with ordinary activity.  So I went upstairs, put a little plain leaf in my pipe and smoked it. I did not measure it at the time, but I have had much experience with measured doses of that batch of salvia, which is made up of small homogeneous flakes, in that pipe, and I'm pretty sure it was about 80mg.  I'd be very surprised if it was under 60 or over 100 mg.  Normally this would have taken me on a short and relatively mild journey (there are no trivial salvia journeys, no matter how mild!)</p><p>13:10.   I inhaled, held, exhaled. I was going quickly. In a moment I'd forgotten who I was.  In front of me (though I couldn't really see it; it was more like a transparent impression layered on reality) was something that I could only describe as a 'matrix of obligations', little square boxes that disappeared as they were fulfilled.  When the boxes were all fulfilled I would be back.  Luckily something else seemed to be doing all the fulfilling, and I just hung on as reality returned, slowly realizing that I was an individual, a human, sitting on a bed, in a room, in a house etc.</p><p>It was 13:18 when I could next look at the clock.  Not even ten minutes.</p><p>I'd been pretty far out; couldn't even remember my name.  I tried and tried, but it was a bizarre sort of trying, as if the name was trying to get to me.  It seemed to be calling out from a great depth, but I just couldn't grab on to it.  No idea of normal reality. I could not have responded in any way if spoken to.  There was no fear at all.  Last time I was that far out on salvia alone, on a much higher dose, I was terrified.  This time I just sat and waited.  Amanitas have quite a strong anxiolytic effect on me, which makes sense for a GABA agent.</p><p>There were the usual sensations of pressure moving over various parts of my body, and of membranes over parts of my visual field, and these were more than I would have expected from this amount of plain leaf.  But the real difference came in the dissociative effects -- the loss of identity, of the ability to relate sensation to meaning, of situational awareness, of one's short-term memory and consequently one's ideational and behavioural purposefulness.  I did nothing in that state, because I could do nothing, unable to form any intention.</p><p>I have found that smoking salvia while under the influence of alcohol intensified the experience, although not to the same degree.  Dextromethorphan is also an intensifier, but not in the same way.  I found that DXM, counterintuitively, intensifies the visual aspect of the trip more than the dissociative aspect.  These generalisations may not hold for other users.</p><p>Right now (14:20) I am still feeling weak effects from the amanitas, but no salvia effect at all.  It's a little awkward typing, but I seem to be managing OK, and the report seems sort of coherent.</p><p>Overall, I'd judge this experience a success, in that nothing bad happened and I both satisfied and piqued my curiosity.  I would like to repeat this, with a higher dose of salvia.</p>"
}
