{
 "title": "The Tree Position",
 "author": "Karnige",
 "citation": "   Karnige. \"The Tree Position: experience with Sceletium tortuosum (ID 30309)\". Erowid.org. Jun 11, 2006. erowid.org/exp/30309",
 "substance": "Sceletium tortuosum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Sceletium tortuosum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30309",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2006",
   "Views: 13891",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I smoked Sceletium a few times and I had grown to enjoy the uplifting mood effect of the plant. I found that when smoking it, I felt lighter and happy. Also, I noticed that the following evening I was very energetic and positive, which is interesting because I am normally a very reclusive, shy, and slightly depressed person.</p><p>I had previously only smoked small amount, like a pinch in the pipe at a time of a friends supply.  When I had finally obtained my own supply I entered into the plant with my usually 'adventurous' attitude.  I decided that I would test the boundaries of the plant. I smoked one full bowl, began to feel the effects come on, and then packed another bowl. About half way through the second bowl I began to feel an overwhelming sense of energy and pressure on myself.  The feeling I got was very similar to the description of 'serotonin syndrome'. I instinctively put myself into the 'tree' position, attempting to balance out my bodies energies, concentrating my breathing, and I felt better for it. I did not smoke anymore after that.</p><p>In either case my experience was very nerve racking.</p><p>I have experience DMT, and I know what it feels like to die, that feeling of the soul exiting the body.  During my described 'overwhelming pressure' experience, I felt the sensation of my spirit trying (trying... or preparing) to leave my physical body.</p>"
}
