{
 "title": "Dropped Inhibitions",
 "author": "Sometimes Stupid",
 "citation": "   Sometimes Stupid. \"Dropped Inhibitions: experience with Crack (ID 30300)\". Erowid.org. Apr 19, 2012. erowid.org/exp/30300",
 "substance": "Crack",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Cocaine",
   " ",
   "  repeated",
   "smoked",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 30300",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 19, 2012",
   "Views: 10969",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had never smoked crack before, but I considered the other options and figured that smoking crack was the best way to do cocaine. I never did like snorting, and injecting myself with something has never appealed to me.\r\nAnyway, that first hit was, for lack of a better word, amazing! My lips and tongue went numb, my head was spinning, I thought clearer than ever before, music was beautiful, and TV seemed 10 times more interesting. \r\nMaybe the funniest part is that I wasn't shutting up. I felt like just letting it all out. What was holding me back anyway? Why didn't I always feel like this? I've never felt more free in my entire life.\r\n7 hits later I was euphoric. My love for the person I was doing it with grew 10 fold, as did his love for me. We said things to each other that we had secretly thought all along, but didn't wanna say out of fear of being laughed or yelled at.\r\nI felt so happy. So amazingly happy. I started dancing. There was no music on, but my body just seemed to move on its own.\r\nThe sex that followed was amazing too. Each sense heightened to an extreme. I could smell the sweat on him, hear his heart beat louder than ever, taste the air, see through the darkness of the room, and that was only the beginning.\r\nEverything made sense for those 30 minutes. Everything was so perfect.\r\nIt's that come down that you have to watch out for. The realization that you have none left. It leaves you either bored, apethetic, or depressed; sometimes all 3. \r\nOf course the memory of it all is something wonderful to savor.\r\nAfter that experience, it's not hard to understand where crackheads are coming from...\n\n\n"
}
