{
 "title": "An Emotional Roller Coaster",
 "author": "Me",
 "citation": "   Me. \"An Emotional Roller Coaster: experience with 2C-I (ID 30310)\". Erowid.org. Nov 11, 2007. erowid.org/exp/30310",
 "substance": "2C-I",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "18 mg",
   "oral",
   "2C-I",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 30310",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 11, 2007",
   "Views: 3061",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n2C-I was an emotional rush for me, and I am not so sure whether to go back for a second round or not. It started at just before 6:00pm<br>5:50pm I arrive at my friends house, and he proceeds to measure out my 18mg dose of 2C-I and put it in a capsule for me. I ingest it with a sip of orange juice.<br>7:00pm Nothing yet, wondering, worrying, did I take too little? Whats going on?<br>7:30pm Initial onset begins slowly, I notice myself getting tense, muscles are becoming tight.<br>7:45pm Wow, beginning to notice the visuals, Im begging to tweak out. Muscle spasms begin, constantly moving, twitching. The smallest things startle me greatly, make my flinch immensely. The world around me is no longer still, things move, the couch I am laying on is floating inches above the breathing carpet. <br>8:00pm Continuation of the peak/initial onset phase, colors are vibrant, sounds crisp, and the tiniest things still make me jump out of my skin. This is pleasant however, very very pleasant and fun. The air/room appears to be alive with movement as well.<br>8:30pm Initial rush is over, and Im feeling very nice. Colors are still vibrant and sounds are amazing, but I can now function and walk, whereas I was unable to during the tweak stage. I grin feverishly. Things that shouldnt move are moving, the kitchen counter is fluctuation from side to side, and the track lights on the ceiling are waving, shadows are amazing!<br>9:30 Things start to go wrong here, my mind suddenly tells me that Im no longer wanted at this party. In my mind, I am the 5th wheel, and this becomes terribly depressing. I slowly recede myself from the other 4 at the house. I curl myself into the fetal position on the couch and feel like I could start crying. I rarely if ever cry, so this was an interesting sensation. Things are still fluctuating, and the audio is still amazing to my ears, but it doesnt matter to me. I just want to find a hole to die in. <br>10:30 I have succeeded in isolating myself from everyone else, I am now away in my own corner, curled up and not talking, eyes closed to hide that at any minute I could start crying. I cant help it, I just feel miserable, like I want to crawl in a dark hole with nobody else and never come out again. <br>11:00 I slowly come out of this phase, the drug is wearing off, I get up to go to the bathroom and the visuals have subsided greatly, most things are stationary as they should be. I feel slightly better, but in a slightly down mood.<br>12:00 I decide to go home, with my apologies for being the downer of the party.<br>All in all, this was all of a fun, horrifying, mystifying, and depressing series of events. I think this is what would be called a 'bad trip.' I plan on trying this drug again, but probably at a rave or club with a much more fully positive environment.\n\n\n"
}
