{
 "title": "Auras of Bliss with a Shroomic Kiss",
 "author": "Draven",
 "citation": "   Draven. \"Auras of Bliss with a Shroomic Kiss: experience with Mushrooms, Diazepam (Valium) & Cannabis (ID 30323)\". Erowid.org. May 21, 2007. erowid.org/exp/30323",
 "substance": "Mushrooms, Diazepam (Valium) & Cannabis",
 "bodyweight": "166 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(tea)",
   "  T+ 1:00",
   "10 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   "  T+ 3:30",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "10 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30323",
   "Male",
   " ",
   "Not Given",
   "May 21, 2007",
   "Views: 14317",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have experimented with magic mushrooms for about a year now, always seeing potential but never really being able to surplant the paranoia enough to get the most out of them.  Recently I decided to go all-out on the preperation, having neglected it entirely previously, by making a mushroom tea.  The recipe was surprisingly simple (The Pink One's Kickass Mushroom Tea Recipe).  Having decided to kill the paranoia on this trip I vowed to abstain from smoking any Cannabis (as I usually would) and get some Valium ready for around the 1 hour mark.  I took the time to plan ALL the potential music/viewing for the night, insuring there was nothing with any kind of negative message or feel.  I memorised a few basic axioms of psychadelic drug use; 'Much have done more and survived', 'It'll all be over in a few hours', 'realise negative body feelings (gas, nausea) and separate them from my mental feelings', etc.</p><p>T+0:00 - Me and a friend both drank the 'tea' and settled down, determined not to move for at least an hour to reduce nausea.  We put on a Pearl Jam live DVD and got comfortable.</p><p>T+0:30 - Already things had kicked pretty nicely, looking around the room there was a wash of colour over everything. Translucent patterns blurring and merging as I moved my eyes from one focal point to another.  I was begining to feel the nausea but was forced to get up to go to the toilet, when I did I felt very 'distanced' from my body, as if I was controling myself remotely.  Getting up riled the nausea and flared the negatives a little.</p><p>T+1:00 - By now I was well up and experiencing some paranoia, noticably less than when smoking Cannabis though.  We both took our Vs and noted to each other how much faster we had come up than usual.</p><p>T+1:15 - Pearl Jam finished and on came Air - Moon Safari, now the cool stuff started.  The Valium had rendered me almost paralysed and very dreamy, although the open-eye effects were good they were nothing to pry me away from the theatre of 3D-fractal intensity behind my eyelids.</p><p>T+2:00 - My memories get a bit fragmented here but they did include the feeling that the mind-body tether was a little loose and I would drift in-out and up against the confines of myself.  Paranoia and general negativity was not really an issue as I melted into pools of radiant bliss that I seemed to be suspended in, like some kind of love-aether.</p><p>T+3:30 - It was about now that we were over the peak and riding a nice wave back down.  Anugama - Shamanic Dream Vol. 2 (superb triping/medative music!) had just finished and we were up for some comedy; on went South Park - Gnomes and out came the bong.  Over the next half an hour or so we smoked a bit; my friend had a two Js and me a couple of bowls.</p><p>T+4:00 - Now onto our second SP episode I realised the normaly small area of focus that my eyes looked at encompased nearly all my periferal vision as well!  I could 'see' the WHOLE screen in unlimited clarity.  Paranoia had resurfaced and made me a bit edgy since I'd started smoking so I decided to take a second Valium.  My friend also downed a second V and we talked about the trip a bit, especialy noticing how easy this trip had been to control and 'deal with'.</p><p>T+4:30 - Everything was now very subdued and any movement made me feel like my limbs were of lead.  Things remained more or less the same as the night went on.  We watched some TV and a film and generaly chilled until midnight when I colapsed into bed and slept for 13 hours.</p><p>Valium turned an unpredictable drug into a glorious experience for me, and one I feel no need to repeat any time soon.  I hope this has been helpful to any who suffer from similar paranoia issues.</p>"
}
