{
 "title": "Safety First",
 "author": "Arms",
 "citation": "   Arms. \"Safety First: experience with Meperidine (Demerol) (ID 30339)\". Erowid.org. Jun 19, 2007. erowid.org/exp/30339",
 "substance": "Meperidine (Demerol)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "250 mg",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)",
   "  T+ 0:20",
   "500 mg",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)",
   "  T+ 1:00",
   "500 mg",
   "oral",
   "Pharms - Meperidine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "30339",
   "Male",
   " ",
   "Not Given",
   "Jun 19, 2007",
   "Views: 27248",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 1250 mgs of meperidine is considered an extremely high dose]</p><p>I would consider myself an experienced opiate user.  I have been using prescription opiates for 2 years now and have taken every kind imaginable.  My favorite prescription opiate would be Percocet or Oxycontin.  I could easily take 20 to 25 Percocets in an evening, or 2 to 3 80mg Oxycontins and besides the usual nods, or upset stomach (which gravol takes care of very nicely), I never noticed any adverse effects.  </p><p>For 4 months before leading up to the event I will be talking about, I was receiving a steady flow of Percs/Oxy, and built up quite a large tolerance to them.  However, one day, me and a friend, just as experienced as myself, were approached with 50 Demoral tablets for really cheap.  We purchased them and our trip began.  It was a Friday at 3pm and we decided to begin taking the Demoral.  We knew our tolerance was high, but since we never used Demoral in large amounts before, we began with 5 each.  We waited 20 minutes and felt almost nothing (compared to the Percocet we were used to taking) so we decided to boost right away with another 10.  We thought that since we could take 25 Percs and still be okay that we were still being safe about everything. </p><p> An hour passed and although we were feeling pretty good, it was nowhere near what 15 Percs usually felt like.  We decided to take the last 10 each and continue on with our day.  Now here comes the big lesson of the story. We continued about our day, going shopping around town to pass the time. Everything felt normal, just the regular opiate buzz so we never suspected anything could go wrong.  However, around 7pm, 4 hours after the initial dose, something went terribly wrong.  Now the rest of the story was pieced together from information I gathered from others involved as I cannot remember much until I woke up in the hospital a few hours later.  </p><p>In the middle of our shopping, without warning, I dropped to the ground and began to have a seizure.  An off duty police office who was shopping at the moment ran over and called for an ambulance and asked my friend the basic questions.  On the way to the hospital I became violent in the ambulance as I was confused and unaware of my surroundings.  This was not done intentionally as I was completely out of it, but from what I heard I became very scared as I did not know what was going on.  The ambulance was pulled over and I was handcuffed and restrained to the bed and then we continued to the hospital.  We arrived at the hospital and my friend arrived with my parents.  He had taken the same amount as I did, but felt normal (besides the intense fear of seeing his friend drop to the ground and take a seizure)so the thought never occurred to him to tell the doctors that he took the same amount.  </p><p>An hour passed as doctors tried to stabilize my breathing and heart rate which were racing (I was still completely unconscious at this point.)  The doctor came out to the waiting room and asked to speak to my friend about what happened and what I took and so on.  As my friend walked though the door to the patient rooms, he dropped just as I did, and began taking a seizure.  From this point on, we are not too sure what happened as we were both unconscious, but we learned that my friends heart had stopped twice.  We were both injected with Narcan to reverse the effects of the opiates.  My friend was also injected with a sedative to help him relax as he was also becoming violent in his hospital bed, ripping out his IV and so on.  I was admitted over-night, however my friend, who is considerably smaller than myself, was in the hospital for 3 days before he was released.  </p><p>This is being written 3 days after the whole event, and I cannot say with 100% certainty that I will stop with opiate use, however I am 110% sure that I will be a lot more safe about it.</p>"
}
