{
 "title": "I Realized How Fortunate I Am",
 "author": "Istari",
 "citation": "   Istari. \"I Realized How Fortunate I Am: experience with Mushrooms (ID 30358)\". Erowid.org. Jun 11, 2007. erowid.org/exp/30358",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 30358",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2007",
   "Views: 2958",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPrevious to the experience, I had done shrooms once before, to the tune of around 3 grams. It was a trip, to be sure, but it was mostly just recreational - I didn't learn anything from it really, and only felt emotionally and physically exhausted afterwards. The reasons behind this are many, poor setting, no sitter, ingested over a LONG period of time, etc.\r\nThis time, I had just a little bit of mushrooms left over from the previous experience. I estimate it to be around a half gram. I chewed it up around 6pm and held it in my mouth for a minute or so, then swallowed. They really don't taste all that bad, they certainly don't taste great, but theyre bearable. After dosing, I ate a bowl of soup with my mom and couldn't finish it even though I was pretty hungry prior to eating the shrooms. I told my mom I wasnt hungry anymore and headed upstairs to my room and put on some comfortable music.\r\nI'll save you the trouble of reading in depth about the typical shroom effects, and instead just quickly summarize. Breathing felt *great*. I would take a deep breath and I could feel it filling my entire body. It felt as if each breath was the best breath I have ever taken. Music sounded great, as usual. Even at this small dose, I saw some small visual distortions on my computer screen - mostly just wavy images.\r\nOn to the important part. Within probably an hour of ingesting the shrooms, I got fairly contemplative. I thought about my life, and how incredibly fortunate I was to live in such a wonderful situation. I live in a great house, I have *very* caring parents, I have a job that I like, I do well in school, I have a lot of friends, and I'm an accomplished athlete. I thought about all of this and it just completely overwhelmed me. Before this, I knew I was well off, but this experience REALLY made me grateful for my situation. I felt tremendous gratitude towards my parents for giving me this life and for raising me to become who I am now. I also realized that I often just take all of this for granted, and I vowed that in the future I would try and be more appreciative towards my parents, and also just towards *anyone* who goes out of their way to be nice to me.\r\nAlso, I thought a lot about my drug use. I'm not a heavy druggie, but I've tried a lot of the recreational drugs. I came to the conclusion that it is okay for me to experiment with drugs as long as I do it in a safe situation and I know what I'm getting into, but that it is EXTREMELY important that I don't let my drug use negatively effect myself or anyone else. Most importantly, I felt that I had to make sure that I never put myself in a situation where my parents would become aware of my drug use (anything beyond alcohol). I know that they would be very disapointed and the mushrooms made me realize how horrible this would be - I felt like I never would want to do anything that would disapoint them. I felt I should always be grateful to them for everything they have done for me, and that if I was to use drugs I should use them responsibly and I should always try to be kind to my parents.\r\nOverall, I was shocked at how much of a trip I got from only about a half gram. The lessons I learned on this trip I still carry with me (2 months later), and I now am always careful to thank people when they are friendly and nice. I also try to be more kind to other people, and most of all, I don't take anything for granted anymore. When I sit down to the dinner table and look at the wonderful meal I have in front of me, I am *truly* grateful. These mushrooms really changed my outlook on life.\n\n\n"
}
