{
 "title": "Close Encounter of the 10x Kind",
 "author": "Catfish Rivers",
 "citation": "   Catfish Rivers. \"Close Encounter of the 10x Kind: experience with Salvia divinorum (10x extract) (ID 3037)\". Erowid.org. Oct 8, 2000. erowid.org/exp/3037",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "275 lb",
 "header": [
  [
   "DOSE:",
   "  bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3037",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 8, 2000",
   "Views: 35803",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nEntheogens are supposed to help put one in touch with their god force within. Well, after smoking a bowl load of the 10x salvia I am convinced that, while there are indeed plants which show you all the inner light hullabaloo, there also exists certain plants which would invite 'darkness' to enter into one's consciousness. </p><p>What I felt that day was an invisible weight forcing my perception of reality to skew to the left and down, someone has tweaked my vertical hold knobbed much too far. I could sense myself hovering half in and half out of my body, with darkness filling out my right side. Slimey pins and needles tingled in my arms and legs for 10-15 minutes. I felt very cold, although I was sweating profusely. At this stage, there was a lot of confusion, loss of memory. It is unpleasant enough to think there is a demon sitting on your chest, intent on stealing your soul, but what I saw next nearly iced my spine right over. The face of a grey alien, and then the rest of his body starts to flicker in and out of reality, in a choppy holographic way. </p><p>Suddenly, my awareness zooms within inches of the alien's face. I see my reflection cast in duplicate across  those pale insect eyes. There is a rush of panic and mental static which eventually melts away into a battered sense of coherency. I feel I was given a clear message to stay away from this plant. Perhaps my mind has been poisioned with too much H.P. Lovecraft, but I swear that entering that mindset felt evil, all the way down through my spine, as if I shouldn't be trespassing on these here parts. </p><p>Now hold on to your souls because there is one last bit of freakyness to mention. While I was camping at the MOEDOWN festival, I met a kid who wanted to try salvia 10x. I don't know why I brought it with me,  but I did. So, I dumped a bowl full for him, told him I'd babysit, and watched over him. He was certainly blasted out of normal space. His eyes peered through me, fixating at something only his slightly crossing eyes could see. He kept asking me to help him, so I had him lie down in a fetal position, placing a pillow beneath his head. Here and there I would mutter some assurance until finally he sat up, shot me this wierd accusing look, and said, 'I get it. I know what's wanted here.' Then he stood up and walked hurriedly away. Wow. That's what I must have looked like from the outside. Twitching confusion. Hours later, he came back in a much more sober state of mind. He related to me that he had hallucinated an alien that wanted to steal his soul. At the time he thought I was in on the whole soul napping deal. I was grateful to hear that this was recognized to be generally false upon entering a sober state. He also described that weird sensation of being weighed down by something icky. That was enough for me to hear. I had never told this kid my story before he tried the Salvia 10x, so when his description is CRAZY the same as mine I start to bug out...'And the Truth Shall Set You Free.' </p><p>I have found many allies in various ethnogens, Salvia however is not my ally.</p>"
}
