{
 "title": "The Assembly Line Of Life",
 "author": "Josh",
 "citation": "   Josh. \"The Assembly Line Of Life: experience with Salvia divinorum (25x extract) (ID 30409)\". Erowid.org. Jan 28, 2004. erowid.org/exp/30409",
 "substance": "Salvia divinorum (25x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30409",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 28, 2004",
   "Views: 9721",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>To start off I have had alot of experience with salvia, and have tripped on it many times before and was very interested in making my own extract. When the extract was finished I loaded up a bowl in my bong (lab flask with a two hole stopper).</p><p>I lit and took a long deep toke. As I lie on my bed I exhale and within seconds can feel the buzz coming on strong. Almost instantly the whole room is enveloped in a very vast darkness.    I can no longer remember smoking the salvia and I found myself in a room that wasn't quite mine. It was much like I was on an assembeley line and I would get moved forward and more of my room would come back, but most of the time it was put back together completley wrong. (Things were not in there usual places) I had now decided that I did not like my new room and decided to go to sleep, as I reached to turn on my fan I couldn't see it. (it was in the vast darkness. Any way I found it and as I turned it on I had a sudden urge for some iced tea and at the same moment I thought it I could taste it. Now I decided to tell the salvia* that it couldn't change the whole house and that I was going to leave. (it seemed like some form of an entitie that was putting my room back together) Then my whole room came back to sharp relief. </p><p>So I went to the kitchen and all was normal I grabed a glass of tea I went to the bathroom and looked at my pupils wich were huge I then went to my room and imediatly wrote my trip down so I would remember. In conclusion it was not a bad trip just intense and I also found that with a strong mind I can control you trip.</p>"
}
