{
 "title": "The Rooms of Truth and Serenity",
 "author": "Peepers",
 "citation": "   Peepers. \"The Rooms of Truth and Serenity: experience with Mushrooms (ID 30428)\". Erowid.org. Nov 12, 2007. erowid.org/exp/30428",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1.77 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30428",
   "Male",
   " ",
   "Not Given",
   "Nov 12, 2007",
   "Views: 4135",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have taken shrooms before once before this experience but now I am more ready than ever to try them again.  My friend P and myself have considered taking mushrooms for quite some time and when a friend of mine got an 1/8th I bought them happily.  I had done alot of research on mushrooms so I felt prepaired but I don't think P knew what he was getting into.</p><p>It was a normal Saturday and we hung out at his house for a little while until his parents left.  When they did leave we went downstairs and made ourselves some peanut butter and shrooms sandwhiches.  We munched down happily as we went back upstairs into his older brother J's room to trip.  Since I'm a good 40 lbs. lighter than P I felt the effects sooner than he did.  At first it was a slight tingling in my hands that pulsed through my spine.  Thankfully we took some Dramamine before the shrooms so I didn't feel that sick.  As the body trip became more powerful I felt my mind and body clinging to reality.  I quickly laid down on the bed and let everything flow through myself.  </p><p>The first noticable aspect of the trip was the fact that time was irrelevent.  I would glance at the clock and it would say 3:00 and then it would feel like hours and I would glance back at the clock and it would say 3:01.  J was playing 'Vice City' with P while all this was happening.  I felt the desire to describe what was happening but I felt that talking was not necessary.  So I stared quietly at the city while listening to Metallica on the radio.  Suddenly I started having intense vivid open eyed visuals.  I was really ready for it, at first I was just staring up at the white ceiling and brown ceiling fan when all of a sudden white lace seemed to by strung all over the ceiling.  As I looked closer I could see the patterns were very intricate.  They seemed to be blowing around in a gust of wind, but the window was closed so I moved my hand up to pull some down so I could study the patterns more.  Then the fan morphed into a brilliant eagle.  Wow these shrooms were good.</p><p>P. started to feel some of the effects now and the two of us stared at the smoke rising above some insence we were burning.  J left for a smoke and the two of us followed him outside.  I could see ripples where J's feet landed and got the feeling we were walking on water.  There's this giant tree in their front yard and once we stepped outside it was like another world.  The tree turned into a pot nugget, thank God I didn't try to smoke it.  The sun was like waves all in all it was very cool stuff.  Once we went back inside however it was all different.</p><p>I still felt pretty good but P went to the bathroom and while he was washing his hands he looked in the mirror.  Now I have heard of people seeing themselves grow old and die in mirrors while tripping but what P saw just made him question his own existance.  He then proceeded to leave me and J to go into his own room and type frantically on his computer. This is some of what he wrote:</p><p>The truth is in us...being happy</p><p>Life is a cycle of moods, Listen to me happy, sad, either or,   I want them all.</p><p>Life is</p><p>Life is a cycle of moods, the computer tells us this!! READ ME!!</p><p>Once he tried to save and the computer malfuntioned he felt that he was basically in 'The Matrix'.  That we were living in a computer and they controlled everything we did and the only way to break them was to shun technology and go back out into nature.  He then labeled his room 'the room of truth' and J's room 'the room of security'.  He left his room and to tell us in J's room about what he found out but in doing this he locked himself out of his room.  He then turned on me and J saying that we were trying to keep him for real truth and knowledge that he could only get while in the room of truth.  J basically spent the rest of P's trip trying to calm him down but P would say in the middle of nowhere 'Brave New World'! Meanwhile I was in J's room trying not to listen to P for fear of myself bugging out.  After finally P to take a nap after 4 hours of tripping all settled down.</p><p>I know I will try shrooms again, as for P he's to scared to try them again.</p>"
}
