{
 "title": "Very Relaxed",
 "author": "Primal Scream",
 "citation": "   Primal Scream. \"Very Relaxed: experience with Carisoprodol (Soma) & Alcohol (ID 30443)\". Erowid.org. Jul 24, 2007. erowid.org/exp/30443",
 "substance": "Carisoprodol (Soma) & Alcohol",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "700 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   " ",
   "3 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30443",
   "Male",
   " ",
   "Not Given",
   "Jul 24, 2007",
   "Views: 29815",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Wow! Talk about extremely relaxed. Right now I don't have a care in the world.  My back and neck muscles have been bothering me all day, from a car accident 5 years ago. I decided to take 2 Soma and chase it with a few shots of Crown Royal.</p><p>Right now the room is spinning, in a good way. Very relaxed. I could go to sleep right now, and feel like I could sleep for days. Every muscle in my entire body is so relaxed you could hit me with a sledge hammer, and I would grin at you and ask for another.</p><p>The phone just rang. It's the Catholic prayer line asking me to pray for a lady from our parish who is very sick with cancer. I told them with slurred speech that I would not only pray for her but for everyone who ever had cancer, both present and past. I also told the person that I would even pray for everyone in the world who may be diagnosed with cancer in the future. Further, I told her that I would pray for people on other planets that might come down with cancer. I told her that cancer would top my prayer list for the next several years. Wonder why she ended the conversation so abruptly? Does she suspect that I feel stoned? ;)</p><p>Empirically speaking, my mind feels fuzzy. Like when one first wakes up from anethesia or just before sleep overtakes someone. I have to constantly correct my spelling as I type this since my fingers are so relaxed and are randomly hitting the keys. Hearing is very acute. I can hear a pin drop about now. Thoughts are random, scattered, and tangential at best.</p><p>Nothing euphoric like the effects of THC. Body feels heavy. Like I weigh 800 pounds. Rocking and bobbing my head are pleasurable. I feel like one of those Weeble Wobbles from the 70s ('Weebles wobble but they won't fall down'). Getting ready to watch some television. Overall, the sedative qualities of Soma are magnified with alcohol.</p><p>No introspection noted. Hell, I don't even feel like thinking about anything right now, except perhaps the couch and an old movie to lull me to sleep. Only side effects noted are unbalance and slurring.</p>"
}
