{
 "title": "A Different Time Zone",
 "author": "ricki",
 "citation": "   ricki. \"A Different Time Zone: experience with Mushrooms & Cannabis (ID 30458)\". Erowid.org. Jan 29, 2004. erowid.org/exp/30458",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 g",
   "oral",
   "Mushrooms",
   " ",
   "  T+ 1:30",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "30458",
   "Female",
   " ",
   "Not Given",
   "Jan 29, 2004",
   "13522",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After two typical attempts with MDMA, a consistent alcohol use and an increasing interest in marijuana, i decided on a trip to the Middle East to try 'shrooming' for the first time. I was in a completely different country with little information about mushrooms at all other than the possibility of a body fry and a description that likened it to 'potent weed'. </p><p>I met up with a cousin of mine who i had not seen since we were infants. In my mind even in a sober state, she was still the little girl whom i played dolls with. On that trip, i saw a lot of people who i associated with my childhood in general. I was also alone without my family and friends. I was unaware of the need for security while shrooming. She and her friends were going to shroom for her birthday. They had each bought their own 2 gram bags and split about a half a gram of their own with me (about 2) I had no idea about the typical dosage to take and i assumed they knew it was my first time. I took the shrooms at around 10 o'clock with some soda.  </p><p>At around 1130, i was not feeling anything at all. I convinced myself the shrooms werent working. In retrospect, i was probably a bit less inhibited than normal. We were all going to walk down to the beach. I decided that I would have a hit of marijuana before we left just so i would actually feel something. I took about 3 hits. After the third hit it felt like some sort of capsule inside of me burst. My face drained from color and i felt dizzy and nauseous. Everyone left to go to the beach and i remained at the apartment. I tried to just sit down and make the dizziness and white lights that were flashing in and out of my head go away. I thought i was dying. </p><p>I lay on the couch spasming and having a full on panic attack for what i was told was 4 hours. Im not sure when people came in to the room or left but it felt like there was just a constant flow of people in and out of the room. I started to associate that with the relationships in my life. the inconsistency, the need for stability waning. It was an experience that really did alter my perspective on the people who i contain in my emotional surroundings. </p><p>I knew i was coming out of my trip when i kept trying to remember a band name. For some reason, the next day and since then i have had issues with my ears. It may have to do with the fact that while tripping, everything i heard sounded like an echo. If anything, being informed and secure while taking a drug is the most important thing. I have now been sober for over a year and this experience definitely took me to the threshold of my experimenting.</p>"
}
