{
 "title": "Nice Mix",
 "author": "Blazin420",
 "citation": "   Blazin420. \"Nice Mix: experience with California Poppy & Leonotis leonurus (ID 30476)\". Erowid.org. Feb 16, 2004. erowid.org/exp/30476",
 "substance": "California Poppy & Leonotis leonurus",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Leonotis leonurus",
   " ",
   "  ",
   "smoked",
   "Poppies - California"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 30476",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 16, 2004",
   "Views: 23700",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had a sample of wild dagga that was given to me about 2 months ago.  I just put in my desk and forgot about it. I'm a bud smoker and had never tried smoking herbs. Well after 2 months I took a trip to the smoke shop again and bought a new glass pipe. And the guy gave me a another free sample this time it was California Poppy. I just put it in the desk like I did with the Wild Dagga. Two weeks passed and I ran out of bud on a monday and had to wait till friday to get paid. I cleaned out my pipe and all that good shit and got a nice buzz. So on tuesday I was all out of THC. (bummer)I started wondering if those free samples would get me in a good mood. <br>First I tried the Wild Dagga 1 bowl. It tasted kinda like some strong homegrown leaves. It was not that bad I felt a little something I was more calm than before. I put it up and got on the internet and looked them both up and all that. Well that night I took them both out and thought I would try mixing them together and see what that would taste like. I put the Wild Dagga in the bowl and the California Poppy on top. Fired it up took the whole bowl in one hit. Holding it in I got the feeling and taste like I was holding in some cheap bud. It was not bad at all. I held it in for about 30 sec as I let it out I got light headed and the creeping feeling I get from bud. After the third bowl of the same mix. I felt like I have never felt before. It was like I was a little stoned and floating with a burst of energy. I did not even go to sleep that night I started cleaning and all kinda stuff like I was tweeking off of crank. Racing thoughts and not wanting to eat. It was like no buzz I ever had. It's the ideal buzz for some yard work or just chilling. Because the buzz from the mix gives me energy but I am calm. It would be nice for getting on the computer and surfing the web.\n\n\n"
}
