{
 "title": "The Nausea Is Driving Me Insane",
 "author": "mGoLos",
 "citation": "   mGoLos. \"The Nausea Is Driving Me Insane: experience with 5-MeO-AMT (ID 30483)\". Erowid.org. Feb 12, 2004. erowid.org/exp/30483",
 "substance": "5-MeO-AMT",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "oral",
   "5-MeO-AMT",
   "(liquid)",
   "  T+ 1:30",
   "3.0 mg",
   "oral",
   "5-MeO-AMT",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 30483",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 12, 2004",
   "Views: 11175",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just recieved my 500mg of 99.9% ultra-pure 5-MeO-AMT. The fedex guy actually asked me what kinda chemicals these was. I gave him some story about being a hobby-chemist. None of his business anyway...</p><p>I went downtown and bought 350 ml of ordinary 37.5 proof smirnoff vodka. I did wonder if the drug would actually dissolve in such a 'low' alcohol percentage, but it mixed very fine and gave me around 1.5mg of drug per 1ml liquid. Excellent :)</p><p>[NOTE: While working with this drug I threw out Madsen, that's my cat, and covered both my nose and my mouth with a piece of cloth. At no point did I actually touch or even look closely at the drug. I just tried dissolving a small sample first, then poured it all in and shook the bottle well. Also I have obtained an oral ml syringe for the actual dosing.]</p><p>And for the experience:</p><p>We started out 'slow.' I did 5mg and he did 4mg, being that he is the nervous type. He doesn't really enjoy losing control. I have nothing to hide as such, so I like stepping close to the edge.  An hour went by, nothing really happended. Around 30 minutes later we felt exactly like we do when were tripping on ecstasy. Talking was easy, also I was getting a lot of chills and I was shaking slightly. So far a good trip, so we did the stupid thing and took another 3mg each. Then the nausea started, but everytime I thought I would puke I would feel better for around 5 minutes. My friend however, was starting to feel really bad. So we decided to get some fresh air, it was snowing outside so I packed a snowball and launched it. I saw two snowballs.</p><p>I was around three hours into the trip and I were seeing things everywhere. Everything waved uo and down like it was suspended into water. Tracers were absolutely insane, but it wasn't really like any tracer I've seen. These were real. My hands duplicated when I moved them. The ecstasy feeling was completely gone by now. My friend wasn't seeing anything and he was getting pissed at the nausea. No matter how hard we tried we just couldn't puke. The nausea is still with me. I'm about 6 hours into the trip, but it feels days has gone by. The visuals are still at a good +2. Everything is moving and swirling and I cant stop it no matter how hard I focus. </p><p>This trip is not anything for me and I wont do it again. The nausea just isn't worth it. Also I don't really like this. I'm seeing things everywhere and I can't control it. I'm beginning to get a headache. This is not for me. I don't feel any different, but everything looks wierd and I cant seem to focus. Sounds are also distorded and they seem to come from everywhere.</p><p>My friend just felt sick so he kicked me out and went to bed. By now I just want to sleep, but I now I can't. The nausea is driving me insane and I just want to get off this thing. This chemical is extremely powerful and NOT to be toyed with. Be careful with this stuff.</p>"
}
