{
 "title": "Stimulant and Vivid Dreams",
 "author": "bengt",
 "citation": "   bengt. \"Stimulant and Vivid Dreams: experience with DMAE (ID 30504)\". Erowid.org. Dec 16, 2004. erowid.org/exp/30504",
 "substance": "DMAE",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "130 mg",
   "oral",
   "DMAE",
   "(capsule)",
   " ",
   "130 mg",
   "oral",
   "DMAE",
   "(capsule)",
   " ",
   "  ",
   "oral",
   "Vitamins / Supplements",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 30504",
   "Not Specified",
   " ",
   "Not Given",
   "Dec 16, 2004",
   "Views: 23460",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'd like to start off that by saying I take a dose of '700mg', it's not pure DMAE. It's DMAE Bitartrate, and in each 350mg capsule there is only 130mg DMAE, along with Vitamin B-6 (as PAK) and Pantotheic acid. This dosage seems to be plenty (260mg), and if anyone confused the 700mg capsule dose with 700mg pure DMAE, they would likely have some negative side effects (nothing major... muscle pains and insomnia).</p><p>I started off taking one 350mg (130mg DMAE) capsule after lunch for a week. There were slight stimulant affects apparent throughout the day, but nothing too unusual. These mild effects seemed to be magnified with my use of caffeine or chewing tobacco. I eventually stopped using the chewing tobacco within the week (it wasn't something I was addicted to, I just used it occasionally for mild stimulant effect).</p><p>At the two week point I raised my dosage to 700mg (260mg DMAE). One capsule after lunch, one after dinner. Basically the effects were the same, mild stimulant effect, until about the four week mark. The stimulant effect was maintained, but I was also able to focus much better than normal. Ideas flowed more easily, thoughts were more rational, and judgement was more critical. This is a major plus when working with my calculus homework or writing a paper. It's nothing monumental, but the ability to slightly focus easier is a definite advantage.</p><p>... but on to my favorite part about DMAE.</p><p>I'm an avid lucid-dreamer and out of body experience enthusiast. For about three years I've had at least one lucid dream a night and controlled out of body experiences at least once a week. This comes from countless books and research, hours of practice, and infinite patience. I'm able to recognize each REM cycle, and like I said, I usually dont have more than one lucid dream a night. But after taking DMAE (even the first night), all dreams became incredibly vivid (not lucid). From such vivid dreams I was able to turn them into lucid dreams, but in the past my dreams were never so vivid at every REM cycle.</p>"
}
