{
 "title": "Ride Out the Storm",
 "author": "Friend of the Pharm",
 "citation": "   Friend of the Pharm. \"Ride Out the Storm: experience with Bupropion (Wellbutrin), Alcohol & Cannabis (ID 30567)\". Erowid.org. Nov 12, 2007. erowid.org/exp/30567",
 "substance": "Bupropion (Wellbutrin), Alcohol & Cannabis",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "450 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   " ",
   "150 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   " ",
   "4 glasses",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "6 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30567",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 12, 2007",
   "Views: 7289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was put on Wellbutrin 150mg XL late in 2003 after unsuccessful attempts to curb my lack of focus on school, health, and well being. I have had a history of 'depression' leading up to my removal in school and placement into Rocky Mountain Academy where I later graduated in August of 2002. Since the low dosage I was put on seemed to have no affects till about 4-6 weeks later (which is normal), I started focusing more, maintaining good grades, and cut back on eating out with my friends.</p><p>This entire time it has been recommended not to smoke pot at all as it may not help the wellbutrin do its job. That was the first recommendation I blew off. I was binging on the weekends as I was getting better highs, although I can't relate this directly with Wellbutrin. Every night as I would go out, or in the mornings I would pop at least 5 pills of either extended or immediate release and head to school with no altered affects. Since looking for a cheap high was getting a lot more attention because of my lack of funds, I planned a weekend at a house unoccupied for a week. It wasn't going to be a big party, just another laid back weekend. A few people brought some bud and I brought some whiskey. I had popped a few pills earlier in the day and thought it might be fun to drink some to see what happens. </p><p>After about an accumulation of 4 drinks I sat down for a while. I gathered my thoughts that were eluding to anxiety, fear, pain, and nausea. At first I figured it was the bud, for the three of us we smoked about 2.5-3 grams throughout the morning and afternoon. I knew it wasn't the bud a few minutes later. I got overwhelming feelings of involuntary functioning. Its hard to explain but it felt like every nerve ending in my body, external and internal were being destroyed somehow. It wasn't a sensation of light needles, because my brain acted along with my body as well. I heard hundreds of popping noises in my head, it felt like the inner lobe was boiling over.</p><p>My heart rate severely increased and I lost touch with how bad my condition was. I barely reached to notice I was having light seizures in a few muscle groups. My mouth would tense and open up and twitch, along with a few extremities. I suddenly got up and felt helpless at that point. My friends noticed and one particular friend had a similar experience with wellbutrin, said to just ride out the storm, I got pissed and realized I had taked about 450 mgs of time-released as well as the 150's SR. Somewhere around 4 I headed up to the upstairs bathroom. I had seen friends get sick before and never wanted to be seen that way, but for fucks sake I swallowed my pride and puked my brains out.</p><p>I did that for about 1 and a half hours before I caught myself drifting off into a very euphoric state. My friend came up to check on me, I said I was sick but feeling better. Around 6 I got something to eat and tried to maintain. I would continue to be sick until the time-release wore off. When I could finally manage I got up to look at my face, as it felt weird, I was as white at a ghost with flaming chapped red lips. The rest of the night was incredible. I had thoughts and feelings that I had been re-born and awakened from something.</p><p>It was hard to get rest but I eventually did have a very very light sleep, waking up to go back to high school. Some typical symptoms of a hangover were present but I have felt different since it happened only a day or so ago. Like everything in my world flipped. I was talkative, but I'm more shy now, I have a lot less anxiety about school-family, as before I stressed about everything, and I approach every situation differently, almost from a third person. In the past I have been very irresponsible, but read the labels. They are there for a good reason. Some pharmaceutical lobbyist isn't trying to spoil all your fun by sticking the (do not drink alcoholic beverages) label on your prescription.</p>"
}
