{
 "title": "The Eye Opening Experience",
 "author": "Deb",
 "citation": "   Deb. \"The Eye Opening Experience: experience with MDMA (Ecstasy) (ID 30585)\". Erowid.org. Jun 28, 2006. erowid.org/exp/30585",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3.5 tablets",
   "oral",
   "MDMA",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 30585",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2006",
   "Views: 8967",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have used E many times before, each time being only amusing at best, but there was something different about the last time, something special.  I had told my boyfriend that I wanted to go all out for my 22nd birthday (I hadn't done E for a year and a half, mainly because it just wasnt around anymore)  His parents just happened to be out of town the weekend of my birthday, so it was perfect.\r\nI planned for a week.  In the past, we would always just listen to some good beats and zone out on glowsticks or some trippy movie all night.  I wanted to experience more this time, wanted to try different things.  I bought the usual glowsticks and such, but also took a trip to the toy storeand bought all sorts of cool toys.  We also bought motion lotion (it warms up on contact with skin), vaporub, a yoga tape, menthol cigarettes, etc.  \r\nThe big night came.  I had set out all of our toys on the table, swallowed a pill, and we put on a funny movie to get in a good mood.  Its about 7PM.  My boyfriend thought it would be neat to tape some glowsticks to his ceiling fan.  Now, in the past, it has taken up to an hour and a half to start kicking in, but this time, I was feeling things only fifteen minutes after ingestion!  I knew then this would be a night to remember. \r\nWe shut the movie off to turn on the yoga tape, but for some reason, we could only get sound, not a picture, from the VCR.  This didnt turn out to be a problem, however.  We took all of our clothes off, laid on the floor, closed our eyes, and just listened.  It completely blew my mind.  I have never been so relaxed in my entire life.  The guy was saying things like 'Feel the energy surge through your body and soul.' and there was nature sounds in the background.  I felt at peace with myself, my life, and my surroundings.  I loved everything at the moment.  Clarity came over me.  Everything that was wrong with my life just went away right there.\r\nAfter the yoga tape was over, we took another half a pill each and laid on the ground to watch the glowsticks on the ceiling fan.  Wow!  There were trails flying all over his ceiling!  It was totally crazy and definitely not normal.  It looked like a galaxy being born.  My boyfriend then got up and said he wanted to put on a light show for me.  We had these left-over glasses from a 4th of July fireworks display, lights looked like they had rainbow-colored halos around them when we put them on.  He put those on me.  I was immediately transported to another dimension.  He stood above me, glowstick in each hand, and danced for me.  I could not see any of his features, there were six of him (due to the glasses) and he was just a shadow, or profile (again, due to the glasses).  Trippy shit!  He was in layers, with a galaxy behind him, and his glowsticks looked like comets.  My mind was racing, and I was just so happy to be seeing this.  It was a total mindfuck, and almost too much to handle.  I felt like I was floating.\r\nWe took another half-pill after this and danced for awhile.  I then wanted to explore the house (our past experiences were limited due to his parents being home, so I wanted to take advantage of this.)  By this time, I was completely gone and had trouble walking and speaking.  I was starting to sweat profusely and got a bad case of the shakes.  This scared me a little bit, I had never been this fucked up before.  We thought it would be a good idea to go in the office (the only air-conditioned room in the house) to cool down for a bit.  We smoked a joint, which calmed me down a little.  I stood, completely naked, in front of the air conditioner going full blast.  This felt so good and refreshing, and brought me back down to earth a little bit.  I was still having crazy visuals, though.  The orange light on the computer monitor was coming out at me and I named it 'My Little Wormy.'  He had fractal, psychedelic textures on him, he danced for me, was starting to change colors, which freaked me out a little bit (I have seen plenty of trails before, but nothing has ever changed colors on me.)\r\nWe got bored of the office and ventured around the house for some more fun.  Nothing too memorable or worth mentioning here.  We went back into his room, took another half-pill each and cuddled on his bed.  This was AMAZING!  I felt closer to him than I ever have before.  Every little kiss on the cheek, the gentle swipe of a finger sent a surge of warmth through my body.  We made a rule our first time we ever rolled NOT to have sex while rolling.  We just had to break it a little bit this time.  Neither of us came, and we didnt do it for long, but it didnt matter. The connection we made and the love we shared at that moment was beautiful and life changing.  \r\nIts about 1AM by now. We wanted to take another pill, but realized that we had no more.  We called a friend and asked if there was any way he could get some more.  (Normally this would be out of the question, but everything just seemed to work in our favor this night)  He said it wouldnt be a problem and would be over in an hour.  \r\nI laid back down on his floor to see our little galaxy again.  It was different this time.  The colors were coming down at me, swirling and meshing, forming new colors in an ever-changing painting.  I then realized I could control what I saw, how the colors behaved.  His ceiling became my own canvas.  The trails were just not fading on me at all.  I was no longer in his room, I was in a world of beautiful color and light.  I put my hand in front of my face and realized I could smudge the trails with a simple swipe of my hand.  My fingers looked cartoon-y. They were stretching out and all wavy-like, and I definitely had more than five.  They were dancing for me!  I couldnt believe it.  My fingers were no longer a part of my body, they were part of the external environment, just like the glowsticks, or the ceiling fan.  I didnt even have to move them on my own anymore, I only had to hold them in front of my face.  The best way I can describe it is that it looked like a reflection of my hand on rippling water.  I started to 'finger-paint' on his ceiling with my wavy fingers.  I was no longer just seeing amusing trails, I was having a full blown hallucination.  I told my boyfriend to come and join me, that I had never, ever seen anything like this in my entire life, even when we had tripped before.  He realized he could do it too, but not to the extent that I could and he tired of it fairly quickly.  \r\nAll of the sudden, there was a KNOCK KNOCK on his door.  A flood of paranoia came over me like a tidal wave.  I thought it was his parents, the cops, my parents, anything.  I immediately started to sweat and get the shakes again.  My boyfriend went to investigate.  He came back, told me everything was fine, it was our friend, with some more e.  I had completely forgot!  I realized I was still naked, so I put some clothes on.  Our friend came in.  For some reason, I didnt like him being there.  He seemed like an intruder in our own version of paradise, I thought he would ruin everything.  I was getting very bad, sketchy vibes from him, like he was going to take something from us or deceive us in some way.  I pulled my boyfriend aside and told him this, and he said politely to our friend, 'Thanks for getting this for us, but I think you should leave now, its not a good time for you to be here.'  I felt horribly bad, he wanted to stay and hang out with us, but I'm scared to think what turns the night would have made if he did.  I was borderline freaking out before he left.\r\nI wanted to take my last pill after our friend left, but my boyfriend wouldnt let me (which was most definitely a good thing.)  He wanted me to come down a bit before the last pill.  We smoked another joint, which brought my roll back a bit.  Nothing too memorable here, we just hung out and listened to music for awhile.  I remembered I had made jello earlier.  We went out to the kitchen to get the jello.  He told me to close my eyes and open my mouth.  I complied.  He put what I thought was candy in my mouth.  I started sucking on it.  It was totally gross, the worst tasting thing I have ever tasted in my life.  'What is this, what are you doing to me?'  I said.  'Its the pill, you jackass!'   Oops!  I was sucking on this for five minutes, didnt even realize it.  Totally disgusting.  4:30AM by this point.\r\nI do not remember much after this.  I either blacked out or zoned out so much on my visuals, I wasn't thinking about anything.  The next thing I remember is the sun coming up, and I wanted to go somewhere dark because it was bothering my eyes.  We were both annoyed, irritated and tired with everything.  We tried going to his basement, but it was too cold and not dark enough.  I had the worst headache ever, and hated everything at that point.  \r\nWe decided it was probably time to lie down and try to sleep (I knew it would be impossible), but we tried anyways.  We both laid in his bed, and I hated everything about that room and about him.  I hated the glowsticks on the ceiling fan, I got up and ripped them down.  I had to leave the room.  I laid down on his couch and turned on the TV.  I hated the TV so much, everything seemed superficial.  I started to cry.  I was coming down hard and all I wanted to do was sleep.  I think I finally fell asleep around 2PM.  The next three days were hell for me, almost not worth this incredible time.\r\nThis happened last summer, and I have not done it since.  I don't know if I will ever go this far again.  Now I look back on it and realize how much I took and how things could have easily gone horribly wrong (and almost did).  I'm glad I had this experience though, I've learned a lot about myself from it.\n\n\n"
}
