{
 "title": "Give Me a Hug",
 "author": "St. Bees",
 "citation": "   St. Bees. \"Give Me a Hug: experience with Salvia divinorum (10x extract) (ID 30596)\". Erowid.org. Jun 18, 2007. erowid.org/exp/30596",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 30596",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 18, 2007",
   "Views: 2825",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend Michael was a good pot-smoking buddy of mine.  As a confirmed pot smoker for 35 years, I was not particularly interested when he asked me if I was interested in a psychedelic.  But he told me it was legal.  I thought it would be a legal alternative to pot smoking.  Michael said 'It's better if only one person at a time does it'.  So he put the pipe to my mouth with some Salvia extract in it. I took one hit, held it for 15 seconds, took another and held it for 15 seconds, and one more and held it for 15 seconds and let it out.</p><p>As I let out my breath, I was onslaughted by a ferocious wind of day-glo colors against a black background blowing toward me, as though I were in the eye of a tornado.  I opened my eyes and looked at the room.  The wood-grained colors in the wall bulged out and melted into a spiral and poured into a spiraling tornado going into the floor.  I thought the world was coming to an end;  the elements were melting and being dissolved and reconstructed into a new universe.  God had called the end.  I thought,  'How can it be that we build and structure our lives here, but we are molecules to be redeployed in someone else's grand plan?'  But Michael said, 'Relax, this is normal. It happens to everyone.'</p><p>I thought I must be dying.  I thought I perhaps had overdosed and my spirit was being swept into the next world.  I wondered if something had hit me from behind to kill me while I wasn't looking.  The walls poured down upon the floor in waves like the ocean.  The floor rolled up to let the waves wash under it.  All the liquid was pouring down into the tornado funnel that was forming on the floor.</p><p>Michael said, 'Relax.  Go with it.'  I could feel his hand on my chest, holding me down to the floor.  I said,  'But I have my wallet here.  It has money in it.  I have a family '   I did not want to go.   But I felt his hand upon my chest and knew I had no control.  I thought, 'This must be death,' and I relaxed to meet my eternity.  I sat back on the couch and relaxed.</p><p>The next thing Michael said to me,  'You're coming back.  Give me a hug.'  I did not know why he wanted me to give him a hug, but I did so for his sake.  The molecules and colors started reforming themselves into the familiar objects in the room that I am used to.  I realized then that what had happened was not real, but a hallucination.  Up until that time, I had no idea it was not real.  But I knew I was coming back and did not give up my life.</p><p>Michael said,  'What did you experience?'  I told him I thought he was the Angel of Death or a Spirit Guide leading me to the other side.  He said, 'Do you want to know what the experience was for me?'  I said sure.</p><p>He said, 'You took the third hit, your eyes closed and you started muttering gibberish, words that made no sense together.   Then you got up and started to walk out of the room.  I stopped you because that would not have been safe.  You were fighting the effects.  You laid down on your back with your eyes closed, muttering gibberish.  I told you to sit on the couch and relax.  You said you have a wallet, as though you were afraid I'd take your things.  That's when I said, give me a hug, and I could see you were coming back.'</p><p>I was not prepared for a hallucinogen more powerful than LSD, mescaline, or psilocybin.  The distinct difference is with every other mind altering substance, I knew that what I was experiencing was a result of taking a substance.  With Salvia, there was no discernible difference in consciousness from normal, except that I was experiencing things that would not occur in the normal world.  Also I had no awareness I was unconscious.  I knew I was trying to speak, but couldn't, as though my mouth were muted, as if in a dream.  But no dream state here, it was real, or was it?</p>"
}
