{
 "title": "Awakening at 18 - The Start of a Love Affair",
 "author": "Rocketx",
 "citation": "   Rocketx. \"Awakening at 18 - The Start of a Love Affair: experience with Cocaine (ID 30628)\". Erowid.org. Apr 29, 2007. erowid.org/exp/30628",
 "substance": "Cocaine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "  T+ 19:00",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 30628",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 29, 2007",
   "Views: 18136",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I did coke, let me tell you.  I was 18 and living in California, temporarily transported from the east coast.  We were taking a trip to Vegas with friends, for 4 days.  Before this, I had only smoked pot and drank.  Typical teenager, ya know?  I had this boyfriend whos friend were psyched about getting an 8 ball and partying in Vegas.  I said I wanted in.  I had heard such great things about coke!  I was so excited - that should have been my first sign of things to come.  I was never that excited about a drug before.<br>We arrived in Vegas by car at about 10pm.  Our friend Tre had the coke packed in a little baggie, packed in an empty bottle of asprin.  As he cut up the lines, someone made me a screwdriver as I tried to relax.  It was hard, considering my trip to Vegas, being out in Cali, and waiting to try something crazy and new.  There were 4 of us in the room; tre, dogde, my boyfriend and I.  Tre finished cutting the lines, did his, gave dodge his, and called me and my bf to the table.  I wanted my bf to go first just so I could see what his reaction was like.<br>He rolled up a bill, and instead of snorting it, blew it across the table.  He was super nervous because he hadnt done coke in a year, and his gf was doing it for the first time.  He fixed his line back up, and took it.  He handed me the bill then, and tre kneeled next to me and said 'do it quick!.'  We had other friends arriving soon, and we didnt want them to have in. (Greedy... I know :)  I took a deep breath, went down, and inhaled my line.  The only word I can say to describe it was WOW.  Within about 2 minutes I started to feel GREAT.<br>I had so much energy, I felt like I was in the greatest mood, and I was ready to party.  Without even finishing my first drink, I made another so I was double - fisted.  My bf kept asking me if I was ok, and I just kept smiling.  Tre then mentioned something about a hot tub in the hotel and I whipped off my clothes with my bikini underneath and said I was ready.  I just wanted to go, move around, do something SO BAD.<br>Right at that moment, our other friends had arrived at the room.  They took one look at us and knew what was going on, I was later told.  Hot tub plans were put on hold as we all decided to go to the New York, New York.  The lights were crazy, they made me feel like some sort of energetic cheerleader.  I felt the best I had ever felt in my life, and thats saying a lot.  I remember walking over the bridge that connects the MGM Grand with the New York, New York and just beaming like crazy.  I was talking to Tre like a chatterbox, and it was like we were having the most importantly amazing conversation ever.<br>So, we had left our hotel at 10, and arrived back at about 4am.  Since I have had tons more experience with coke now, I know that for my first time we had really good shit, because one line kept me fucked all night.  I look at pictures from that night and realize that it must have been obvious I was on some kind of uppity drug.<br>When we returned to our hotel, my bf and I had to sleep in the closet (we had like 17 people in our room.)  Of course, on coke I absolutely could not fall asleep.  I made my bf have sex with me 3 times, then got agitated bad because he wanted to go to sleep - by this time it was about 7am.<br>I didnt have anyone else on this first time high with me, so I begged my half - asleep friends to go out and get a 'breakfast sandwich' with me.  No one wanted to, so I stepped out into the hotel hallway and ran laps up and down the hall.  I felt so fresh and invigorated still!  It was amazing.  I did not sleep that night, and when everyone awoke at 11am all set to go, I went with them, still feeling like a king.<br>Around 5pm of this conitinuous day, tre asked me if I'd like to indulge again - of course I said yes!  However, my bf said 'it was a bad idea'; and I was SO MAD at him (another sign of this drug having a rather interesting affect on me).  He gave into my complaints further in the night and I did another line, along with the 3 of us.  We ventured on onto the Vegas strip again, but this time, my bf was feeling weird so we headed back to the hotel room, which you all obviously know is NOT THE BEST IDEA when you are just starting your high.  And this being only my second time, the waiting in our room was torture.  I tried to comfort him, then made him please me sexually again.  Coke has that affect on me!  Some of our friends returned soon after that, making me a happy chatterbox one again.  At least I had someone in the room talk to me again :)<br>2 years later, I have a bit of a 'taste.'  I wont call it a habit because I dont need it.  If its not around, its not around.  I must admit I love it, its excellent for going out, talking, sex, and getting certain things accomplished.  Its a small part of me and its fits in to my lifestyle, so its fine :)\n\n\n"
}
