{
 "title": "Early Comparison of Celexa and Lexapro",
 "author": "Ady",
 "citation": "   Ady. \"Early Comparison of Celexa and Lexapro: experience with Escitalopram (Lexapro) & Citalopram (Celexa) (ID 30629)\". Erowid.org. Apr 21, 2010. erowid.org/exp/30629",
 "substance": "Escitalopram (Lexapro) & Citalopram (Celexa)",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   " ",
   "10 mg",
   "oral",
   "Pharms - Escitalopram",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 30629",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 21, 2010",
   "Views: 13643",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter a period of approximately five months taking celexa for social and generalised anxiety disorder, I started to notice that the effects, particularly those concerned with tackling my anxiety disorders gradually started to taper away. Thus making me feel more anxious and self-concious. <br>My doctor told me this effect is known to occur after a long bout of treatment with celexa, so naturally put me on lexapro which has a similar side effect profile and appears to be of particular benefit to people with anxiety disorders. Because the transition to escitalopram from citalopram was instant, I could feel a noticeable improvement in my symptons by the fourth day (of what is currently a 1 weeks use). I found that my anxiety levels, particularly those concerning my social and general anxiety improved significantly to somewhat about two thirds of what they were before. <br>The anti-depressant effect seemed to be more prominent on lexapro, in that the 'so what, who cares' mentality seemed to be more noticeable and prominent-when put in comparison to celexa.<br>I noticed that the side effect profile of celexa and lexapro was pretty similar:- a feeling of wanting to yawn and stretch and a slight distinct 'drugged up' feeling that persists for about a couple of hours. But on the whole, the side effects in my case were easily bearable.<br>Overall, I feel that lexapro seems to be working well (takes about 3-4 weeks for the full apparent anxiolytic, anti-depressant effect), but it remains to be seen my depression and related anxieties are reduced to an acceptable level.\n\n\n"
}
