{
 "title": "Who Would Have Thought It",
 "author": "Tumble Weed",
 "citation": "   Tumble Weed. \"Who Would Have Thought It: experience with Nutmeg (ID 30630)\". Erowid.org. Jan 19, 2005. erowid.org/exp/30630",
 "substance": "Nutmeg",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "12 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2004",
   "30630",
   "Male",
   " ",
   "Not Given",
   "Jan 19, 2005",
   "10671",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI cannot believe what has happened over the last couple of days... On monday at about 7.30 I ground up 12 whole nutmegs and ate them. Two hours later I was more fucked than ive ever been before. It was like a mixture of pills, hash and ketamine VERY ODD. After id slept for 12 hours I woke up EVEN MORE fucked than I had been before I went to sleep. I went to the bathroom for a pee and the next thing I knew I was blind and being carried to bed by my friends as I evidently passed out on the floor (I remember feeling tired but thats it). I spent the whole day drifting in and out of consciousness with mild hallucinations when I shut my eyes and a VERY buzzy head. At half six I returned home after violently puking on the bus. Told my parents what I'd done; only to be told that id taken far too much. (According to dad the web sites he's since looked at the most they recommend is 2 or three) my parents told me it could be fatal with the amount I took and got me very worried (panic attacks; tears; wanting to live etc; as I was VERY fucked). Phoned NHS direct who got an ambulance.</p><p>I dont really remember much of what happened after the ambulance was called; I know the paramedic kept on talking and I just wanted him to shut up. And I remember being hooked up to an ECG and saying 'WOW! Im like Elliot from ET' and being really happy. But most of the time I was comatose. I feel just about ok today; a bit sick and im deaf in one ear. I learnt loads from eating the nutmeg some really important lessons im gonna try and remember; it was a pretty sipritual experience actually my mind really broadened and I felt at one but buzzy. Really mad.</p><p>I feel kind of embarassed that I overdosed on a household spice and poisoned myself; but I guess its a good crack. Its not something I wd repeat in a hurry (feeling stoned for 24 hours is not a nice feeling what ever you might think) and if I DO do it again i'll eat 6 at the VERY most.</p>"
}
