{
 "title": "Psychoreal (Through the Eye of a Needle)",
 "author": "Nuages Gris",
 "citation": "   Nuages Gris. \"Psychoreal (Through the Eye of a Needle): experience with DPT & Cannabis (ID 30698)\". Erowid.org. Sep 20, 2005. erowid.org/exp/30698",
 "substance": "DPT & Cannabis",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 lines",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   "  T+ 0:12",
   "1 line",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30698",
   "Male",
   " ",
   "Not Given",
   "Sep 20, 2005",
   "Views: 19148",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A DREAM OF DEATH</p><p>Hickory dickory dock</p><p>I clench my hand on my glock.</p><p>I splatter my brain</p><p>and shatter my shame</p><p>my running organ rock.</p><p>Quickory liquory lore</p><p>I know that Ive been here before</p><p>enclosed in a dream</p><p>inside of the scene</p><p>waging my internal war.</p><p>Mickory mockory mall</p><p>the clock runs down the wall</p><p>my eyes cant see</p><p>but my mind feels free</p><p>in a motionless bottomless fall </p><p>An intellect slow as molasses</p><p>begins to comprehend its insignificant insight</p><p>into nothingness </p><p>~~~</p><p>I wrote the above poem many years ago, before I'd tripped on anything. Strangely, it seems to fit the mood of the experience more than anything else I've written.</p><p>Well, I did the high dose. I tripled the amount used for my first experiment. This report will be more to the point than my last one, because there was more point to this trip, even if that point is now a splatter of dried context. The 'revelation' is diabolically mercurial, stretched somewhere between hallucination, gnosis, reverie, and nightmare. I came out of that trip with a chip on my shoulder, carrying the singing/dancing looney-toons frog into this world, 2 dimensionalizing the hyperspatial amphibian and knowing he won't be  singing for my shared solipsistic hallucinations on the mundane plane. This trip may look like an ordinary frog, but you really had to BE there, maaaaan! There is nothing to dance around except the still-leaky master-self I've fallen back into.</p><p>The trip took place in my bedroom starting at midnight. I snorted two lines but I was feeling little after twelve minutes, and I didn't seem to be coming up. This is the first time I've tried DPT without being on cannabis already, so I was having trouble recognizing the onset. I snorted another line of the same size as the first two. </p><p>I would estimate that at this point, I was on anywhere from 80-120mg. In for a penny, in for a pound, I thought. I smoked a little weed. Almost immediately after toking, I felt the first two lines kicking in. Stupidly, I got nervous and started worrying that I'd done too much. It was going to be another 'more than I bargained for' trip. Even before it kicked into high gear, I was going into emergency-mode in a desperate effort to soothe myself: 'Hoooold on, hold on. It's  okay. You'll be alright. You're not going to die. You're not going to freak out.' I knew it was all bullshit, these assurances. I disgustedly waved them off as my room became a funhouse of living furniture and breathing walls. This was the big fucking leagues, and no assurance was going to make any kind of good olde comforting human order from this sweeping  hallucinatory hurricane. I was falling into pure novelty. This is what it meant to enter the higher dimension. I had to leave my paradigms at the door - all of them. My current model would not work, my past models would not work, my future models would not work. All was hallucination. Soothing myself here was like trying to plug a leaking submarine with my pinky.</p><p>During the ride up, the power of the trip seemed like an omnipotent force (oh my god, anything can happen) with its own inscrutable motives. It could kill me, it could make me immortal. But I had no control over it. My attempts to take control became screaming cognitive dissonances as I struggled to dig up a SELF to take control. The confusion was intense - this flickering sense of self was an ambiguity as to where my intent existed, or if it existed at all.</p><p>I could not face hallucinations. I could not keep my body's eyes or my mind's eye focused on anything because it would quickly start to scare me. Any visual was possible - anything could become anything. This freedom terrified me. I was learning volumes on my unseen insecurities. I thought of Leary's 'comfortable chaos'. I tried hard, but I could not be comfortable in it. It had gotten far beyond an aesthetic trip. The hallucinogenic possibilities were endless but way down the list of  priorities and not granted much attention or appreciation. My self-identity as artist was immediately challenged and finally shattered - I felt the synthetic alien intelligence was somehow offended by my attempts to use this experience for artistic purposes. The trip had little if any respect for art - the irony being that it was showing me more art per pixel of perception than I'd ever seen in my life.</p><p>I tried to think of it as an entity, but I found that hard since I was dealing with a lab creation, not a plant. I could not connect to the gaian mind, not even synthetically. Nevertheless, it did seem to have a character. It hid itself in kaleidoscopes, in cognitive telemetry, in emotions and stimuli, in synchronicity and auditory phantasms, only to pop out when I least suspected it and assert itself and its views. Slowly me and it collided in a crunching wreck and began to claw at each other's reality, clinging, destroying, intertwining in an ill-conceived sado-masochistic tangle. We couldn't reconcile with each other. My ego was taken and twisted, reformed into a thousand things at the whim of the alien force possessing me. I not only became foreign translations of self, but animals, objects, planets, hallucinations, concepts, energy, nothingness, and everything. These feelings, these dramas of the transmutating soul condensed into visual metaphors which re-formed into new selves and spawned another set of synesthetic stimuli. I was adrift in an unstoppable self-transforming cascade of ontological undulations.</p><p>I felt an anti-nirvanic imperative, the titanic struggle of the me split into yin-yang, the DOer and the BEer refusing to unify. It was the messiest ego death Ive ever undergone - splintered bone and gristle still floating around in anthropomorphic parodies of the first person. My mind had been turned inside out and was subject to brutal scrutiny. The inversion exposed a hundred anxieties I didn't  know I had. The alien, poking through a self-skin and assuming a ridiculous form, kept asking me WHY I was doing this and what I wanted to get OUT of it. It mocked me for wanting to get something out of the experience and scolded me for not being in the moment. It informed me that the preconceptions Id brought to this trip had the penetrating thoroughness of a bacteriums conception of Los Angeles.</p><p>I tried several times to lie down in silent darkness with my noise-blocking headphones on, but I could never let this happen for more than a few minutes without getting into intolerably weird territory accompanied by another compulsion to writhe and cling - cling to SOMETHING,  ANYTHING... So I would exercise my leverage of will over the alien mutation of reality, and tug back on the reins of my consciousness - rein it back in, compress back into a self, tighten up, get a grip, get my shit together...</p><p>I hardly wrote anything, but somewhere near the peak of the trip, I got down a few lines:</p><p>'conception no. 1: it deconstructs everything and offers me nothing</p><p>no alternative</p><p>I am to give</p><p>myself to it'</p><p>This expresses my inability to know what to do. I didn't know how to give myself to it. I was blocked, floating with half-hallucinogenic debris in the orbit of a rogue star.</p><p>I spent the majority of the trip phasing through various ontologies, a million modes of being. Everything I saw was moving and distorting in appallingly fantastic ways, but I could not concentrate on this, I was just feeling TOO FUCKING WEIRD and not able to deal with it. I felt so weird I wasn't sure if I was breathing or not. When I did cling to organic artifacts like breath, the rhythm and mechanism seemed freakishly warped. I was restless all the time. I came to the brink of a freakout dozens of times. Sometimes tactile sensations mingled with the synesthetic stew and my face would melt off into my pillow. Sometimes I would attempt to freeze time and solidify the kinetic visions into tranquil eternal states. This worked for a while. There was even a God moment, where a riot of angels surged down from a foamy waterfall and informed me their visage was being beamed into my mind straight from heaven. I was staring at the God of my youth, the elusive paradise of my dreams. Somehow my Catholic upbringing was now feeding into the trip, and the notion of all that crazy christian crap ending up as the final reality weirded me out more than anything yet  another light I declined to face. Every angel is terrible.</p><p>I was extremely dizzy and clumsy. When I walked around I stumbled and staggered. My ego issues may have been causing the confusion as to where the boundaries of my body were - everything was blurred and ambiguous.</p><p>At one point I felt, quite unwillingly, that I was being given a deep glimpse into first Freudian, than Jungian psychology.  I know little of either beyond popular abstracts. I'm not indoctrinated in these philosophies, and rarely use them as an explanatory tool. Thus I was surprised to find myself thrust into inner-space with internal switchboard exposed and having to deal with oedipal circuitry, primitive sub-selves, and the sweltering boiler room of the libido. This progressed through conceptions of savage carnivorous symbiosis with a pinwheeling yin-yang to which I was consigned the dark side, consumed by the light. I was dominated, that was my karma. Perversely, it snapped to eastern mysticism. I bargained with the universe, the alien, the self, whatever it was. I said I will do whatever you want, just don't hurt me  let my hang on to my sanity  let me stay out of the nightmare. I will be passive in all this, I will be the yin, I will not impose my will on things. </p><p>But somehow this was false, because I could not REALLY let go. I CLUNG to my role as yin and refused to take charge of anything. The entity said to me: Look at you. You invoked me, so listen to what I have to say: look at your shit. You are a coward. You can't escape from your cowardice when the alien is flanging you outside yourself, to become a massive cast of transitory selves. The freakiest thing about the alien entity was that it was me and not-me. It could take on any form or fragment of my identitys inventory and combine that with its own cosmopolitan repertoire.</p><p>Finally all concepts became stuck on a cobweb in the corner of a cave and there was the spider-mother archetype, presiding, meta-self marionette manipulator and cosmos collective in the dark dregs of pale ego. If I could have totally transcended the self, I could have escaped this grim psychological baseline. But I didn't, I let in gnaw at me - and gnaw and gnaw...</p><p>Fear, primal fear -</p><p>but beyond that, another mocking meta-commentary by some cirrus-self up in the stratospheric clouds, high altitude, looking down on this whole mess and saying: This doesn't mean anything. All your metaphors and models are you deluding yourself,  defense mechanisms so you don't have to face the existential chaos you can't accept. Your trip intentions are a joke, and your trip reports are an even sicker one.</p><p>This meta-me was a self-annihilating paradox, a snake eating its own tail. He let me know that he knew he himself was a model and a metaphor, and everything he said was bullshit just like me. And yet he was somehow necessary to the very idea, the creepy feeling of truth that is always lurking on some layer.</p><p>There was an abundance of dark humour. I laughed several times during the trip, but they were not happy laughs. They were the appreciation of itchy paradoxes.</p><p>There was a genuine trip artifact  a word: Oontz which carries with it its own hallucinogenic rabbithole. Oontz. That is what I arrived at after balancing certain synesthetic hallucinogenic equations. It was a predatory motif  a spinning tunnel meatgrinder slick with the blood of bunnies. Blood in accusatory patterns, a language of suffering incinerating karma, the spider back with me on the journey. Oontz is the synesthetic distillation - those five characters somehow describe it better than anything else could - straight to the semantic source. Oontz is a horribly meaningful aesthetic. Oontz is submitting to a carnivorous circuit of existence. Oontz is my carnivors guilt, my unearned consumption of greasy slaughterhouse fruits, my loathsome hypocrisy in this bourgeoisie yangbang  not sick, not well, living in the west in heavenly hell  eating, because I can. What this may boil down to is a walk on the wild side  a descent into my mammalian brain. Its eerie for me, and not something I can deal with, being a pitifully compromised, culturally-addicted human drone, fearing nature yet distrusting humanity. Its being adrift in the voidful midrange between the secular and the sublime.</p><p>I quickly averted my eyes from the oontz trip-within-a-trip. All collapsed into confusion and fractalized chaos. Thematics of brilliant subtle aesthetic acrobatics informed weighty lessons and boundary dissolving experiences and transcendental transcendence: metaphor phased into reality phased into hallucination phased into sensation phased into words image sound feeling being self other everything nothing... et cetera, ad infinitum ad nauseum up nasal unto fractal schizoid chasmic omegalpha needlehole. Then I got up and took a piss.</p><p>A lot of the experience was dreamlike, just shy of delirium. I was too tired to be very lucid - I thought I'd fall asleep during lulls in the intensity. Music felt profane no matter what it was. It was a reminder of baseline reality, which seemed perverse when juxtaposed with my current situation. There was no need for music anyway. Normal auditory perception was far more interesting. The slightest sound echoed in rich exotic reverb and dissolved into a splash of imagery. The peripheries of every soundwave would take on high and low frequency mutterings of translucent voices making semi-sensical commentary on my situation as if there was a freak-chorus in my head. It was the aesthetic externalization of an inner voice. The voices would become counterpoint in the bizarro symphony surging from my mind's ear and feedbacking into the visual loop, swirling with the synesthetic sea.</p><p>It's too bad I couldnt concentrate on the spectacularly beautiful synesthetic phenomenon. My mind was manifesting extraordinary vistas for me, but at this point in the trip, I would have found the notion of 'beauty' laughable. My aesthetic self was the first to go.</p><p>I felt neither alive nor dead, dreaming nor waking. This caused me to attempt to place myself in some spectrum of consciousness, which developed into a probing of  consciousness itself, which quickly dissolved into confusion and a hallucinogenically-adorned smear of truth and lies. This gestalt flowered tactile hallucinations synesthetically melting and mingling with other sensations. My hands would morph into stretching  flapping alien appendages. I felt like the alien force that had been called into my head via the powder was trying to turn me into itself - I was being assimilated, mutated. My nerves were being twisted to fit novel biomachinations. 'I am a human being,' I insisted. This assurance was a comforting mantra, since such former certainties were now merely hallucinations dancing in front of me.</p><p>This trip had a definite CHARACTER to it. I wasn't being filled with a complete void, the void had a face - an alien insectile face. It was hard edged. It was magical, but more like alien-induced holographic magic (which is sufficiently advanced technology), not the gnomish fairyland magick of the mushroom.</p><p>All my superstitions were dredged up to float in front of me as hallucinogenic menu items. Past the florid crawling sheen of  every cryptic cover lurked a real meaty fear package, with some profound acceptance waiting inside, some truth-saturated treasure I could get my hands on if I was willing to face the fear - which of course I wasn't. They danced in front of me, my fears, all on an equal playing field of rationality - all equal in the ambiguity of blurred visual edges, half-dissolved egos, and synesthetic slur. 'Pick ME! I'm your fear of viruses! Remember all the freaky times we had together? You thought you  got rid of me when you were ten, but I'm baaaaack!' 'No, pick ME, I'm your fear of DEATH! I'm much WEIGHTIER than that virus fluff!'</p><p>It was amazing how strongly the motif of alien abduction was felt - the closest I came to freaking out was when a loud ringing buzz settled into my head from nowhere and I began to see my splattered self-shell as a runny collection of severed organs on a table being dissected by a circle of shadowed laser-wielding beings around me. Suddenly I was in the middle of an H.R. Giger scene. I was definitely NOT getting into the abduction trip. Fuck that. I distracted myself with some music until that volley faded.</p><p>I was tripping hard for a full two and a half hours, and slowly came down over the next three.</p><p>Despite the grotesque alienness of the trip, I found it difficult and dirty to re-enter my body, my baseline self, my normal conceptions of time and space, and everything that entails. After such a staggering few hours of psychological sophistication with access to such a broad palette of consciousness, it felt tragic and distasteful to collapse back into my pathetically narrow conceptions.</p><p>All in all...</p><p>Was it a good trip? Well good and bad aside, it was undeniably fascinating. It felt like a tall shot of bad-tasting psychic medicine - something I needed somehow, yet may not make use of for a long time. It feels like the majority of the information that transformed me will be piled on in the next trip I take on whatever substance. One thing that struck me is that any given psychedelic is not as unique to itself as I thought. They all have their own flavour, but even substances as far apart as DXM and DPT will eventually bring me to the same superspace-chronoblivion coordinates. Overall, I was about a hair's length away from a bad trip. The memory resonates like a goofy nightmare, gowned in cryptic drapes of dense imagery that  connote various inexpressible depths, dramas, horrors, and possibilities.</p><p>It was abrasively psychoanalytical. It was like an alien intelligence trying to push through my Faberge shells of selves and not being able to assert its personality over the noise and confusion of my hard-to-crack meta-self, the sneaky self that resisted ego death to the last rippling distortion of reality. That self would hide in hallucinations, pretend to become them, then pop out of a wash of imagery, wet with the ghostly drippings of juicy arabesque, and re-assert selfhood. I learned that I have a huge Byzantine hierarchy of selves. I met them as individual entities rather than the tangles of a meta-me master personal gestalt they normally are. I felt a perfect insight into John Lilly's biocomputer theories. I didn't actually think of these selves as programs, but it was a metaphorical option.</p><p>I successfully resisted being broken down right to the void by the alien (although I was disintegrated pretty severely) and that is not a good thing I think. Oh it's easy to say now, when I'm feeling normal, but at the time I was congratulating myself on not having accidentally annihilated the universe with a stray chaotic thought. In that state, such a thing seemed possible. So I can chide myself for wimping out, but I'd cower again, if I was back there. I know I would.</p><p>Basically I failed as a tripper. Once again I could not let go - I was just too uncomfortable with the ineffable. The grungy-profundity reminded me of DXM. DXM is easier to take in a way, because it changes me into an alien more completely, and I can more easily make myself at home in its universe. DPT tried to make me an alien, but I was not dissociated enough. Looking back at this trip, I see a lot more ME, than OTHERNESS. I chalk this up to partial ego dissolution. The 'alien' was a pastiche of distorted selves, given illusory autonomy over the suddenly flailing meta-self. My meta-self lost control over his cast and was overrun with rivals. They stormed into my head like a Visigoth army and pushed buttons in a random anarchistic orgy of disruption. It was an amplification of my neuroses and theories. A deep deep look into myself. I can't say I really liked what I found, but it was damned interesting. </p><p>Every time I revisit these dimensions, it seems that ego-death is usually the one thing I can count on. While its surely a profound and educational experience, I sense I've yet to truly transcend it and move on to other, more enlightening levels. There's always some shred of self that hangs on and makes trouble. Somehow I feel the environment I tripped in held me back from attaining a higher level. I feel like I should do this outside next time. Day or night. At least out in nature. </p><p>Ive done this sort of thing enough times to know how little will be retained of the experience. As I write this, I am doing little more than the rote-repetition of disembodied facts. I recognize their existence as thought-markers when rubbing along the crusty braille-poetry of my retro-oriented neurons, but I understand the significance not a whit, except that it IS significant  insofar as there is so much more to reality than we arrogantly suspect in normal consciousness, which I am unfortunately constrained to at the moment. I guess what Im saying is, I simply dont know how to take back the information and use it, except as artistic travelogue.</p><p>Thanks for reading, anyway.</p>"
}
