{
 "title": "Wandering Delirium",
 "author": "yamamushi",
 "citation": " yamamushi. \"Wandering Delirium: experience with Belladonna (roots) (ID 30718)\". Erowid.org. Dec 4, 2004. erowid.org/exp/30718",
 "substance": "Belladonna (roots)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Belladonna",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2003",
   "30718",
   "Male",
   "",
   "Not Given",
   "Dec 4, 2004",
   "32059",
   " "
  ]
 ],
 "report": "<p>It all started when friend and I decided we wanted to try belladonna. The main reason I did it, is because I read it would bring back vivid memories. My mother died when I was about 4, so I didnt think much would come of it. </p><p>Boy was I wrong.</p><p>4:30</p><p>We boil about 6 cups of water with the 1/4 oz roots.</p><p>4:45</p><p>I get a phone call from another friend saying hes coming over.</p><p>5:00</p><p>About 1/2 cup of water has evaporated.</p><p>5:30</p><p>I turn the stove off, and let the tea just boil for a while.</p><p>5:50</p><p>We each drink about 1 cup of the tea, later would I learn that I was the only one to drink the whole cup. It tastes like ginseng, a little sweet, not bitter at all. If it werent for the cotton mouth, it would be quite nice.</p><p>6:10</p><p>The first side effects start to kick in, dry mouth, dry eyes, stomach ache. I got up to go to the bathroom, and fell flat on my face.</p><p>6:30</p><p>I decided to lay down, while my friends watched TV. This is where memories start to fade away into nothing.</p><p>I first forgot what day it was, and believing that I must get ready for school, I went to go take a shower, but there was a line of people waiting to get in the shower as well. My own bathroom, and there was a line! At this point in time, I had forgotten that I had taken the belladonna, and was unaware that my friends had left. I have this thing about watching me go to the bathroom, and when I went into the bathroom, there were about 4 people just standing around in there, all around the toilet, I couldn't go!</p><p>If that wasnt bad enough, a cop came up to me, and asked me to hide some cookies. *you will see how this is important later*</p><p>I started to watch a little TV, when suddenly I saw a picture of my dad and my mom and my sister all on the TV. They were all saying things, and just as soon as it started, my mom came out of the TV and started yelling at me. I was pretty confused at this point. BAM! I'm downstairs for some reason, my pants are gone, and someone is shaking me. It's my cousin, telling me to come show her how to play guitar. I get up, put some pants on, and go into the guitar room. I turn on the AMP, and let her play a little. She played pretty good, I walked into my own room, and sat down on my bed. A girl walked by my door, and as the light from my room shined on her, she faded away, but as soon as she got into the shadows again, she came into existence. Many other things happened, but not in any order I can remember very clearly.</p><p>The time I took the Tea was about 5:50pm, the time I went to sleep was about 6am. I was talking to myself for about 12 hours. And the whole time I was convinced I was not imagining things. Everything was too realistic. Those cookies I mentioned earlier, well, I found them, exactly where I had hid them. My cousin playing guitar? she never came over last night. People waiting in line for my shower? Yeah right.</p><p>I thought I had lost the belladonna, when I found it in my dad's closet. I dont remember putting it in there, but I must have. Its as if, part of me was awake, while the other part was sleepwalking. One half of me was constantly setting up the next sequence of events, while the other half was living them out one step at a time.</p><p>The warnings about blindness? Well, I'm not blind right now, but my eyes are plenty dry. Before drinking tea, I had drank about 4 cups of water. And still, I was pretty dehydrated. Now and then I will see flashes of people walking by, but arent there.</p><p>**Warning**</p><p>A word to the wise, do not, I REPEAT DO NOT, attempt to ingest this plant in any way shape or form without first being able to fully give up your sanity. Drink plenty of fluids, and have plenty of fluids ready for you. My friends were assholes and left me, some friends huh? Have at least 2 sitters ready, that way they can take turns sleeping.</p>"
}
