{
 "title": "Stay Clear!",
 "author": "mGoLos",
 "citation": "Citation:   mGoLos. \"Stay Clear!: experience with 5-MeO-AMT & Alcohol (ID 30756)\". Erowid.org. Feb 24, 2004. erowid.org/exp/30756",
 "substance": "5-MeO-AMT & Alcohol",
 "bodyweight": "68 kg",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 30756",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 24, 2004",
   "Views: 11628",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI fucked up. I did it again. Once more. Just to feel the buzz, experience the visuals and hear the chemical. This chemical is a taste, a sight, a feeling and a sound. It's deep thinking and something close to happiness for two hours....if I can avoid the nausea. \r\nAfter that it gets wierd, then it gets old, then I wonder when its going to stop. One thing though, time slows down on this drug, and when I want it to stop, there's no end in sight. It keeps hitting me for 10+ hours and then another 10-12 hours of slowly coming down. \r\nFor me, sleep is impossible. I drank a bottle of vodka and got really hammered, but still no sleep. If I had had more liquer, I would have kept drinking. I just wanted to knock myself out and wake up feeling like... (we all know that feeling), but off this goddamned wierd trip.\r\nAt one point the headache got bad and I ate some painkillers, but soon it was so intense that I decided to eat two more, but the bottle was empty and I panicked. I didn't know how many I had eaten. \r\n'It could have been a whole bottle', I thought. 'Jesus christ, what do I do, calm down, remember. Was it four was it eight, how many was in the bottle when you went for it?', I didn't know. 'You could be dying, what the fuck are you gonna do?' \r\nI grabbed my phone and held it for a long time, thinking about three numbers and the consequences of dialing them. I was really scared, the push of the chemical now seemed different, slightly changed. I pushed in the three numbers. I didn't dial them, but I put the phone on speaker so that I only had to push the button and yell help. I don't know how long I waited, but eventually I calmed down and told myself, that an OD would have happened by now.\r\nI was stuck in the most frightening moment of my life and I had no one to call. All of my friends smoke weed and drop ecstasy every once in a while. They would never mess around with unknown chemicals. They do not know this side of me, I don't want them to know.\r\nIt's been exactly 24 hours since I peaked. It's all gone now, thank god. I'm just left with a headache and a lot to consider.\r\nIn my opinion, don't do this drug. Do other drugs if you have to, just not this one. It is nothing more than a fucked up, long, long ride! It may be cheap and technically legal, but trust me, this is a bad trip waiting to happen. God knows what would have happened if I had taken the 15mg I had planned on.\r\n[NOTE: I watched Fear and Loathing in Las Vegas while on the peak.  Are there supposed to be any skulls, and melting faces in that movie?]\n\n\n"
}