{
 "title": "The Most Amazing Night of My Life",
 "author": "Eddie",
 "citation": " Eddie. \"The Most Amazing Night of My Life: experience with 2C-I & Cannabis (ID 30787)\". Erowid.org. Jul 19, 2004. erowid.org/exp/30787",
 "substance": "2C-I & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-I",
   "(liquid)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "30787",
   "Male",
   "",
   "Not Given",
   "Jul 19, 2004",
   "7149",
   " "
  ]
 ],
 "report": "<p>I've dabbled in the 2c hallucenogens quite a bit in the past month, after myself and a friend aquired 100 mg of 2c-t2 and a gram of 2c-I, respectively. I'd had a few entertaining experiences with both of them, and decided that the time had come to really go for the gold. 2 nights ago, I dissolved 30 mg of 2c-I in root beer and drank it down. At this point, my roommate and about 4 other people and myself began smoking copious amounts of marijuana. Because of the marijuana, I really didn't keep track of the time, but I'm guessing that my trip ended up lasting about 8 hours.</p><p>It's hard to pin down when the 2c-I really began kicking in, but I first REALLY noticed the effects when we all went down to the vending machines in the dormitory common room for what I like to call a 'vending maching party' (not the most creative name, I know) Anyhoo, one of our favorite pasttimes while fucked up is to stare at the picture of the crushed ice on the coca-cola machine. The images were, for me, extremely vivid, full color, and sometimes in motion. What I particularly remember is seeing a cybernetic spider in some sort of industrial factory type setting, hooked up to thousands of pulsating cables. I kept repeating to everyone things along the lines of 'Oh my god you have no idea what this is like' Of course, some of the people present had done shrooms, so of course, they informed me that was not the case. Things got really fun when my friend Nathan climbed up on the vending machine. I joined him, and together we pretended to be a race of advanced beings, far superior to the other people there, who were nothing but foolish ground dwellers. </p><p>Now it's worth noting, that Nathan is absolutely the best person one can be around while stoned; his fun games and bizarre nonsequitur humor really make the drugging experience so much more fun. At this point, his games seemed quite real to me, and I was getting really into it. Then, someone else walked into the vending area for snacks, and it was suddenly over. I could feel a tangible change in who Nathan was as she entered; like I could feel him shifting personas. This, I realized, was the beginnings of the strong empathic effect that I get from 2c-I.</p><p>After the vending machines, we all went back upstairs to the room. My first act was to take a shower. In the shower, I suddenly visualized myself at the base of some great castle, standing in the surrounding moat. It was raining, and I was under some sort of water drainage spout. The vision would shift on occasion from a beautiful castle surrounded by rolling hills and greenery, to a dark horror movie type castle, that was instead of pouring off clean rainwater, was spewing out toxic sludge. Even this, however, was amazing to me. At this point, the entire world shifts and wiggles when I open my eyes. And when I close my eyes I am taken entirely to another place.</p><p>I get out of the shower and return to the bedroom. For a while, I just lie on the bed, and in the background, cops is on the TV. I'm very much out of touch with reality at this point. Lying on my bed, I can't shake the sensation that I'm still on top of the vending machines, and the siren noises from the TV make little sense to me. Sometime around this point, everyone else leaves the room, and I keep forgeting this; turning around expecting to see Nathan behind me. At this point I decided that I should turn off the TV and listen to some music.</p><p>I pull out a CD that I had badly wanted to listen to while tripping, to see what images it would put in my head. I thought at this point that I was immune to bad trips; I've seen terrible monsters and such, and it was just hella cool! I thought. So I figured that if I wanted to see monsters, there would be no better music than the album Delirium Cordia, by Fantomas. For those of you not familiar with Fantomas, they're an ambient band, listening to them is like listening to the score of a movie. This is assuming, of course, that the movie in question is the screenplay version of your worst nightmare.</p><p>Immediately after putting on the CD, I was sucked right into the music (this is about where I was peaking, btw) I was living right there in the sounds. I suspect that this is related to the drug's empathic effects: Whatever mood the music was, was exactly how I felt. At first, the bizzare horrorscape of the music was a delight. It was like watching the greatest horror movie of all time, one particular portion of the album that stands out is a period of Gregorian sounding chants, but, very faintly in the background is a lip smacking, chewing, tearing, devouring sound, that builds very gradually, untill the chanting goes into a chaotic climax. </p><p>This scared me almost more than I can put into words. When my eyes were closed, I saw terrible dark creatures (I've drawn pictures) but then, the horror would subside just as quickly as it came, and the music would take me to a place of wondrous beauty, fantastical landscapes, and the like. The one segment of the album that had the most effect on me was one of pounding tribal drums, complimented by Mike Patton's yelling, that conjured the image of some African religious ceremony, and at the same time of primitive man, before language. As this played, I saw an image of cave walls lit by torchlight, covered with primitive line artwork. The artwork danced and moved to the music, and I felt myself reverting to a more animalistic version of myself. And like all of the musics little beats, this was soon gone again, melting into sounds from inside an operating room, surgeons attempting to ressuscitate a patient, and as it did my mental image melted away into a shadowy blue, and I could watch as the doctors tried to save a life. This was the most jarring experience of the trip.</p><p>This ping ponging from horror to beauty kept me dazzled for some time. Soon however, it was becoming clear to me that the moments of terror far outweighed those of beauty, and I decided I wanted to change the CD. I was too scared. I was shaking, holding up my arms to my face. When I opened my eyes the world seemed dark and terrifying, I remember quite well watching my roommate's Bod Dylan poster shifting bizarrely, the D-man's features shrinking and growing rapidly and grotesquely. Also, all this time I kept thinking that Nathan was STILL in the room. My only explanation for this is that the empathic effects create a desire for company so strong that it was hard for my mind to accept being alone. Finally, when I managed to stand up, and slammed off the CD. I collected my thoughts a bit and then popped in Coheed and Cambria. I felt like I had been listening to the Fantomas CD for hours, but looking back, it couldn't have been for more than 20 odd minutes, because the CD was less than half over when I took it out. </p><p>Coheed and Cambria calmed me, but at times the odd vocals freaked me out. I decided that this wasn't the right music either, I turned it off, and then put on my roomie's Boards of Canada. It was good music, to be sure, but I didn't quite get as much out of it as I could have, because I was definately coming down at this point. I got online, and chatted with some of my friends, which was fun, but I wished that someone had actually been there, because of the previously noted desire for human company. </p><p>As the trip faded I was left with a pleasant warm sensation all over my body. I finally managed to doze off at around 4:30 in the am.</p><p>This trip was, despite the frightening moments, one of the most incredible experiences in my entire life. It fulfilled my ultimate drug use desire: breakthrough to another world. The other world I saw was like ours, only to the extreme, pure beauty or pure evil. I wouldn't say that I learned anything important about myself, or had any sort of religious experience, but what I can say is that everyone should have a full on psychadelic experience at least once in their lives. As for me, like I said, this trip fulfilled my ultimate drug use desire, and as such, I've no longer any need for recreational pharmecuticals. SXE 4 EVER LOLZ</p>"
}
