{
 "title": "Snorting: Not Good, so Much as Stupid",
 "author": "Spicemaster",
 "citation": "Citation:   Spicemaster. \"Snorting: Not Good, so Much as Stupid: experience with Setraline (Zoloft) (ID 30791)\". Erowid.org. Jul 2, 2007. erowid.org/exp/30791",
 "substance": "Setraline (Zoloft)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "insufflated",
   "Pharms - Sertraline",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 30791",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 2, 2007",
   "Views: 31021",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've always been interested in experimenting with drugs-all kinds but those that terrify me, such as crystal meth.  I've smoked weed a whole bunch of times and have never enjoyed it.  Doesn't do much for me as I either: a)stare at a wall or b)throw up for hours.\r\nSo when I was offered a line of coke, I jumped at the chance.  I've always been especially interested in snorting for some reason.\r\nAnyway, this is about what happened after I did the coke.  Of course I want to do it again, but in the mean time I've been searching for something legal and cheaper.\r\nI have a prescription for Zoloft, so I decided to try that. BAD IDEA.  I chopped up one 50mg pill and cut it into 5 lines (I had this weird notion that a smaller portion up my nose would possible burn less, if it burned at all).\r\nI snorted up one 10mg line into my left nostril at 9pm.  It was alright for about 30 seconds, then the burning started.  Felt pretty much like I'd just snorted wasabi. I could've handled that, but within 10 minutes the burning moved up my sinus cavity and into the side of my head.  My ear felt like it was burning off.  This feeling continued for about 30 minutes.\r\nFinally, the pain in my ear subsided, but the pain in my nostril was still the same.  The drip started at around 10:15.  Very salty, and I couldn't sniff it in or blow it out without the original intensity coming back.  So I pretty much sat still in front of my TV, trying breathing through my mouth, breathing through my right nostril, breathing in through my mouth and out through my nose-nothing helped.\r\nAt around 11pm, the intense pain was gone, but my left nostril was extremely sore and stuffy, and if I sniffed it really hurt.  Still a bit of a drip.\r\nI went to bed around 12am and could still feel it.  Obviously, I didn't snort enough to know whether or not Zoloft will give you a buzz in this way, especially, because I take it regularly, I would have had to snort a lot.\r\nAll I know is today my nostril is still stuffed up and I had a terrible sinus headache most of the morning.\r\nMoral of the story: snorting Zoloft sucks.\n\n\n"
}