{
 "title": "Abnormal in Amsterdam",
 "author": "Joe Hill",
 "citation": "Citation:   Joe Hill. \"Abnormal in Amsterdam: experience with Mushrooms, Cannabis & Alcohol (ID 30836)\". Erowid.org. Jun 11, 2007. erowid.org/exp/30836",
 "substance": "Mushrooms, Cannabis & Alcohol",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 30836",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2007",
   "Views: 3116",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDuring the summer I decided to take some of the money I'd saved and bum around europe for a month or two. One of the places I really wanted to visit was Amsterdam for obvious reasons. I ended up staying in this dive of a hostel that was also a hash bar. The owners didn't seem to care how messed up you got there though so that was a good thing. I asked around and got recommendations for a shroom shop I've since forgotten the name of. Finding specific places in the dam can be rather tough, but I did find it eventually and decided on buying these hawaiian shrooms that were rated about a 5 on the fuck-you-up scale. They sold them in 3.5g bags. I bought two.\r\nI should mention that I was alone in amsterdam this time (I'd passed through before). I was leaving for the states in a few days and the people I'd been traveling with we're off to eastern europe. I picked an absolutely gorgeous day to trip. Amsterdam doesn't have the best weather but this day was sunny and warm. I didn't really feel comfortable walking around the city so I decided to trip on the roof of this dive of a hostel I was staying at.\r\nI ate the first bag and about half the second bag pretty much in one mouthful chewing them for a good long while. I actually enjoyed the taste somewhat. I smoked a bowl or two afterward for lack of being sober at the time. This might be a good time to mention I had never taken mushrooms before. I don't remember at what point they kicked in but before they did I remember thinking to myself I had no use for half a baggy of mushrooms so I might as well eat those too. Probably not the best idea but I did it. Anyhow, I don't remember what coming up was like but I was anxious. Smoked a few more bowls to counteract that.\r\nThe first thing I noticed was the rooftop. It was sort of loose pebbles or gravel. As I looked at it I realized it was moving like the surface of water, wavy and rythmic. I found this pretty cool. On a hunch a picked up a rock I found up there and dropped it. To my surprise a giant ripple spread outward as if the gravel really was liquid. This effect continued the entire time.\r\nI layed down and looked at the clouds and saw wise, kind old men's faces among them. A bird sitting on a chimney or something started to communicate with me. It didn't say words but I could understand it's cries somehow. It was looking directly at me and it's message was something like 'It's going to get a lot worse before it gets better.' At this point I was still having an amazing time. Although I was feeling pretty lethargic. Could have been the pot.\r\nI remember having to pee. At this point things turned from jubilant fun to more serious and alarming. I walked back inside the hostel to find the bathroom. This is when I lost my sight. Suddenly being blind well tripping is rather terrifying. Not to mention I wasn't in familiar surroundings. I started to panick quite a bit and a realized I had to find that bathroom NOW. In my blind attempt at stumbling towards it I managed to crash down a flight of stairs. Now totally disorientated and still blind I pissed myself which didn't really bother me that much. That act sort of brought me around and I realized I could see again. I made it back to my room toweled myself off and changed clothes.\r\nBack to the roof. At this point I started getting a very trancy, earthy, shaman-type weird indian on a vision quest type vibe. I wasn't sure if that's what I was looking for by taking these things but that's what I got. If you've tripped yourself you'll probably understand but this part of my story won't make a lot of sense if you haven't. Didn't make a lot of sense at the time really. I remember embracing curves and rounded objects. Corners and sharp points were bad, smooth and round was good. My fingers looked weird almost swollen. I decided to trim my nails with a little nail clipper/file I had. I spent about an hour making sure my fingernails were perfect. Then onto the toes. My toes looked weird too.\r\nAt this point I started doing this amazing chant. It was actually just rythmically saying random words. As if you had made a list of random words from a dictionary and was just reading it. I was surprised at the fact I never repeated one twice and never hesistated with the next word in the chant. This went on for a good while. I was still having a good time at this point but I was starting to realize that I was WAY out of this world.\r\nThat's when things got bad. I looked at my hands again and noticed that not only the looked swollen they WERE swollen. Badly. My legs and arms were too. I panicked here big time. I figured I'd either had an allergic reaction of some kind or I had overdosed. It started getting hard to breathe. The more I tried to analyze the damage the more I realized I was in serious trouble. I was feeling very very lethargic at this point and begin to realize that these things were killing me. I may have started to cry I don't recall.\r\nAs I lay out on this roof with the sun shining I started wigging out pretty good. I started begging God to let me live and thinking about all the things I'd regreted in my life and things I'd yet to do. Some people would say I was being spiritually cleansed by it's my opinion I was freaking out on drugs and was begging someone or something to save me. My legs and arms looked horrid now. They weren't exactly melting but they seemed like warm gellatin, almost runny and spread out. Had it not been MY legs and arms it would have looked pretty cool. Somewhere along the line I thought about throwing myself off the roof and getting it over with. Luckily I was so lethargic I resigned to just lay down, close my eyes and let come what may.\r\nClosing my eyes was a good idea. This kaleidoscope of swirling patterns and colors was going on. I put on some music from my cd player and just at back and watched the show figuring I'm a goner I might as well enjoy what's left. Laying down in the fetal position made it hard to breathe but it also proved to be what brought me back to reality a bit. My nose was pretty plugged up and I decided I needed to clear the blockage because if I could keep myself alive long enough maybe I'd make it after-all. Putting a finger into my nose made me realize something. A nose can't swell. It's made of firm cartiledge with not a lot of tissue. I've gotten punched and beaned in the nose enough time to know it'll bleed, or hurt, but no swell. If my nose was the same size, and my finger could fit in it, then my fingers weren't swollen at all. Which meant none of me was it was just an illusion.\r\nThis made me overjoyed. I sprang up, collected my stuff and ran inside to find a shower and a mirror. The shower was to be a cold one to help reduce swelling just in case. The mirror was to see what I looked like. My face looked fine but I had a goofy grin on my face. The cold shower theory seemed to convince the swelling look to go down. My hands and feet still seemed fat and stubby though. But it was an improvement.\r\nI could feel myself coming down now. I decided to walk around the city, smoke a good amount of weed, and watch the sunset. This was almost my favorite part of the whole thing. Thinking Im going to die and making it is like the happy ending of the main character in an action movie where he tempts death and lives to tell about it. I wandered about, completely content, happy, with a feeling that I had plenty of time and the evening would be a good one. I spent a good amount of time drinking beer in a hash bar and rolling joints which I smoked in a park somewhere. I was totally down by night-fall just exhausted. I guess that's why they call it a trip, you sometimes go to places, and when it's over you're happy to be home.\r\nReflecting on my experience I think my dose was pretty high. I had heard 5g was up there and I took 7g, of potent shrooms having never done them before. All in all I enjoyed myself. The parts that sounded bad were HORRIBLE at the time, but I think experience would have ended it a lot quicker. I just needed something to keep a handle on reality and I would have been fine. \r\nAll in all I enjoyed it, minus a few hours of pure terror. I'd definately do it again. Just like an empty house greets a returning vactioner, reality greets a returning tripper with open arms and, at least for me, that feeling is almost better than anything I felt while I was gone.\n\n\n"
}