{
 "title": "Bliss Until I Decided to Drive",
 "author": "M",
 "citation": "   M. \"Bliss Until I Decided to Drive: experience with Mushrooms & Cannabis (ID 30849)\". Erowid.org. Nov 12, 2007. erowid.org/exp/30849",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "8.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 30849",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 12, 2007",
   "Views: 2437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'd tripped before, 3g doses, acid once, and thought it was time to try a little bit more. I saved these mushrooms for quite some time for the perfect night, which never came. So I settled for a house party. Just a buncha my friends, I was the only one tripping though, an interesting pov. I ate them at around 11:30pm, all 8grams of very good lab shrooms, went outside with my group of friends to smoke some weed. Then I started makin my rounds, talkin to different people, anxious for what was to come. Around 12 I got that feeling, so I did as my mind instructed and went into the living room away from loud drunk people to comprehend things.\r\nI sat in this room for about 30 min warming up, already havin more intense visualizations than before. I just kind of sat there giggling randomly, my friends would come in an check on me once or twice. The feeling of awe was astounding, everything was so beautiful, half the time this lamp on a table across from me seemed to taunt me, looming closer every time I glanced away from it. I decided that it was time to interact with people, which was more difficult than expected. I walk back into the main party area and can only answer simple yes/no questions. I opt to go back outside and smoke some more, and have a cig or two.\r\nThe concrete floor outside was one of the most amazing visuals I've ever seen, swirling circles of varying sizes, green and blue, red and purple, seeming to move like water. At one point a fish leapt out of the concrete and splashed back in. While outside I began to get very irritated by questions. Everyone there kept asking me what I was feeling, or what I was seeing, or 'tell us what you see'. All I muster to say in a disconnected fashion was 'I can't talk right now'. I think they got the point, in my mind though I was screaming profanities at the ones that continued to ask me. I felt too disconnected from 'those people'. I knew who they were, well I just presumed that during the trip, but they weren't on the planet that I was on, they couldn't begin to comprehend what I was seeing.\r\nThe house I was in was the perfect place to trip though, many furnished rooms that are there for no reason, places to explore in safety. I feel that an adventure is a requirement to mushrooms. So I tell all those people where Im going, and not to worry. I begin my trek around the house, which took about 45 min to an hour. My adventure begins, finding a living laser light show coming through the blinds in one of the rooms. Upon entering a bedroom and finding it uninteresting I begin to walk out, only to catch a court jester lying on the floor of a closet staring at me inquizecally (a sweater, a boz and a blanket).\r\nOne room I called the 'doll room' which is one of those up in the corner of house rooms, lower ceiling, just a general tiny feel to it ( Im 6'4'), this was where I spent most of my time. I was lyin on the bed in this room staring at the ceiling. It had one of those sprayed ceilings, which poured a multicolored liquid on onto my body from each little stalagmite (or stalactite you know what I mean). I finally caught myself lying there and snapped back to whatever reality I was in at that time, and went back downstairs to the party.\r\nI smoked another bowl, listened to the drunken conversations of my friends, everybody was drinking a lot, and they were pretty wasted, my stoner friends opting only to smoke. At this point Ill say that its 2ish, I was lacking a clear concept of time. Full of energy and not coming down for at least another 2 - 3 hours, to my dismay, people are actually going to sleep, I dont know what to do. I know that I cant sleep from prior experiences, and they are dropping like flies. My mind obviously wasn't makin that much sense, but I trust myself a lot and opted for the drive home, about 30 min normally.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] \r\nI say my goodbyes to my friends, walk outside to the warm summer night (which didnt help) and get into my vehicle. I gave myself a little pep talk, asking myself questions to keep reality in grasp. But once leaving this house my whole world seemed to crumble, and I really started losing it. I kept myself straight but the overwhelming thought that I would never return from this state nawed in my brain the entire trip home. Repeating over and over 'I cant wait to be home', I would go through my questions again, what's my name, where am I, where am I going, etc.\r\nTo make situations incredibly worse, my car had but 1 headlight, so oncoming cars where a living hell, not only was their light the most blinding light Ive ever witnessed, but now I cant see my headlight. The most frightening encounter was what I called the 'void'. These voids exist when not tripping, slightly uphill, road goes down passed hill and turns right. Im traveling at roughly 30mph in a 50, which is still to fast to me. When I approach the void, I see it and honestly believe thats it, Im about to drive into nothingness, pure nothingness, I cant see anything passed this pitch black area of space, no lights nothing, its to late to stop, Im a goner. An oncoming car suddenly graces me with light and I can see through the void, whew.\r\nThe rest of the ride home was just miserably uncomfortable, I began to overheat (me not the car) a/c to no avail, repeating my questions, yearning for my bedroom, my safety, the only thing that I can remember about where Im going. I make it home climb up my stairs and fall and grasp my bed. Im home. I use this coming down time to recap the nights events. At some point I fell asleep, waking up for work the next day I come to some conclusions, I broke some of the rules for safe tripping putting myself in danger that I shouldnt have. Somebody not drunk there woulda been good to have not let me drive.\r\nThats about it, the trip was enjoyable, most oev's Ive ever seen, the whole foreshadowing of lonelyness leading up to the breakdown in the car was rough, i.e. tripping alone :(\n\n\n"
}
