{
 "title": "Just Physically Drowsy",
 "author": "Style",
 "citation": "   Style. \"Just Physically Drowsy: experience with Lactuca - L. virosa (Opium Lettuce) (ID 30859)\". Erowid.org. Aug 27, 2009. erowid.org/exp/30859",
 "substance": "Lactuca - L. virosa (Opium Lettuce)",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "smoked",
   "Lactuca - L. virosa",
   "(extract)",
   "  T+ 0:10",
   "2 lines",
   "insufflated",
   "Lactuca - L. virosa",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 30859",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2009",
   "Views: 8440",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>5:50am I smoked the Wild Lettuce extract, first using hot knifing but I figured out it didn't melt and I could smoke it in my pipe.</p><p>6:00am Feeling hardly anything, so made 2 lines, 1g each and snorted them. There was a clearing of my sinuses and a very noticable burn.</p><p>6:01am There's a prominent sensation on the right side of my face (I only snorted 1 line in my right sinus). I'm snorting the other line.</p><p>6:10am The 'peak' (if there is one) is now. The drug is there, I can feel it, but it's on the very backline of my brain. I feel horny, but depressed (a little). I was excited about smoking/snorting the herb, cuz I've been extracting it during the last 8 hours It's like having a good trip of mushrooms, and that slowly going into a bad trip.</p><p>6:20am I try to masturbate (boredom), but I'm not really getting a hard one, or even having some sexual interests. My thoughts are on nothing particular, but it's not on sex.</p><p>6:30am Watching Pinky & The Brain, and by the time I watched 2 episodes, I realise I didn't have to translate the English in my Dutch, I just understood the English like it was my first language (Dutch is my first).</p><p>7:20   Ate some chocolate pudding. I'm now sober (did the food help?).</p><p>------------------------------------------------------------------</p><p>In conclusion: I felt sleepy, bit horny at the start (but when I tried, that went away very quickly), at the start a bit depressed. My short term memory was basically FUCKED. When I wrote the start of this report I was still on W. Lettuce, and all the time I think of writing something down, then I write it down and have to think real hard to remember some word I wanted to write down. To tell you the truth, I feel sleepy and relaxed, but I really don't want to sleep.</p><p>This is like Opium, yeah. It has the unmotivational side effect, but that's the only thing. On Opium I'm unmotivated, but because I'm so content and happy.</p>"
}
