{
 "title": "A Hard Lesson",
 "author": "Earl",
 "citation": "   Earl. \"A Hard Lesson: experience with DXM (ID 30879)\". Erowid.org. Dec 19, 2007. erowid.org/exp/30879",
 "substance": "DXM",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 30879",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 19, 2007",
   "Views: 14234",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before this morning I have had 3 other experiences with DXM all of which were amazing, enlightening experiences, even though they were low doses (90mg, 105mg, 165mg). Today was my birthday so I decieded to have a little fun. At 8:00 AM I went to the bathroom at school and took 180 mg of DXM. By English class which started at 8:45 I was comming up fast. I took a bite of a cookie a friend gave me and the taste was overwhelming nausiating. First time I have ever felt sick from DXM. I went to the bathroom and puked. A friend saw me and went back to english class and told everyone I was sick.</p><p>By the time I got back into the class I was having an exteamly hard time walking. Everthing was distorted. I had to lay my head down to keep from felling sick. In my head I constructed buildings over and over again to keep discomforting thoughts away. After about 45 minutes of that we had to move our desks to form a circle around the room. It was extreamly difficult. Having my eyes open made me sick again. I barely made it to the bathroom. By them time I got back I no longer felt so sick, and could keep my eyes open. The shapes on my sprite can were dancing people.</p><p>After an hour and a half of pure hell in english it was over and I got to go to lunch. My friends' presence was very comforting. I calmed down a lot and went to my freinds car to lay down the rest of the day. I listened to Sgt. Peppers and Revolver. They both sounded pretty cool. This experiece was very different from my other 3, seemed like a completely different drug. Shook me up. At least I learned not to do DXM at school or on an empty stomach.</p>"
}
