{
 "title": "Serotonin Sprinkle",
 "author": "Samanthe",
 "citation": "   Samanthe. \"Serotonin Sprinkle: experience with MDMA & Alcohol (Beer) (ID 30883)\". Erowid.org. Feb 13, 2004. erowid.org/exp/30883",
 "substance": "MDMA & Alcohol (Beer)",
 "bodyweight": "124 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 1:00",
   "20 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   "  T+ 1:15",
   "20 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   "  T+ 1:30",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 3:00",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "30883",
   "Female",
   " ",
   "Not Given",
   "Feb 13, 2004",
   "Views: 13287",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Dose: 35-40 mg, insufflated, almost three beers</p><p>Set: Around 11pm, just got home to find my housemate looking for company. He'd been gone for a month and was happy I was home, and I was just as happy to hang out with him. Playfully, we looked in the liquor cabinet. Surprisingly, there was beer. We chilled two. Then half in jest, I mentioned the remaining capsule of MDMA I had. 'Why don't we do that?' This is entirely outside my normal behavior, really, but I was in such high spirits, it seemed like a harmless bit of fun. We drank our beers and talked around the issue, considered going out, reflected on our changing relationship to parties and going out. I think that's why we decided to do the MDMA; as a silly concession to the fact that we are both still spontaneous and like to have fun, but simply didn't have the energy to go out at 11pm on a work night (not that it would have been that fun anyway). Once I started dosing us on antioxidant vitamins, calcium, magnesium, and extra vitamin C, I figured I'd already decided to do some MDMA.</p><p>Setting: the kitchen, till we moved to a cuddlier place</p><p>Started with a capsule with a known amount of powder (90 mg) in it. The capsule was brown and splotchy colored from having been heated and cooled a couple times from various ambient temperatures, but the powder was still pure white and fine and cakey. The way the powder looked, it appeared to be quite a lot of material, but I am certain it was 90 because I weighed it. Just another reason to avoid trusting my eyes with the powders. Dumped the capsule out, split it in two, giving the slightly larger pile to my friend to sniff, so I guestimate I did 35-40. Yep, I like where low doses can get me. I was justifying it to myself on some level as another 'low dose experiment', which is slightly disingenuous, but a good excuse nonetheless.</p><p>I had had one beer already. Insufflated half my pile, and 15 min later insufflated the other half. After the first line, I felt that slight twinge I get when I consider the load on my heart (I'm prone to anxiety so elevated pulse makes me nervous). I was a little restless, looking around for the empty capsule, which had disappeared, so that I could dispose of it discreetly. Street people routinely go through our trash so I am super cautious about what goes into the garbage bin. Then I tried to check my pulse but was too distracted to count properly. I think the rough count was 80-100 BPM.</p><p>Then I had to do the rest, and was glad to. The first line had had no burn to it, this one had somewhat of one, but it was bearable. I snorted with water to wash it down my sinuses. I started to feel warm and peeled off a layer, a sure sign of the onset of effects.</p><p>Overall, the experience was very gentle, slightly past threshold, the combination with alcohol dulled my judgment about what the alerts and progression were like, but 15 min after the second line I felt that familiar MDMA glow, and was particularly attentive to my friend. I wanted to sit closer to him. We started on another beer.</p><p>We moved down to his room and listened to music and sat on the bed and talked and talked. I felt happy, inspired, super connected with him, grateful to have a friend with such a similar world view to share ideas about. At one point I did wonder 'is this the MDMA' which is really a fair question considering the hare-brained ideas I've had on the stuff, but we were so slightly off the baseline that I dismissed the thought. I was glad to have let down my hair a little and not be so in-my-head, allowing myself the natural and innocent pleasure of non-sexual touch with a good friend. I actually should ask my friend if I appeared intoxicated to him -- I just felt high-spirited and in a comfortable place, don't know if I was actually acting more exuberant than I imagined.</p><p>We continued to drink beer till it was gone. Had almost three total. Around 2:30am, another housemate came home, and we were happy to see her and share the love. I just wanted to cuddle. So cuddle we did, in and out of revery till about 4am when our other housemate got home. I went up to my own bedroom at around 5am, making sure to drink more water than I thought I needed. Got to sleep with no trouble. I woke up about 9:30am, hungover with headache but not terribly so (felt like the beer). Took 2 naproxen pills and stayed in bed. I wanted to go find my housemate I'd done the MDMA with   and was feeling really connected with him ('he's so cute and nice, wow, i feel such a connection with him'), and had to call another friend to check in about these unexpected feelings. I was advised to just sit with it and observe for a while, rather than come out with some confession about my affection. Really good advice. Waiting 30 days and checking in on those feelings then seems wise. Got up around 10 and went and sat in meditation. My meditation felt particularly strong and calm.</p><p>Now I'm at work, 6pm, and I've felt soft and fuzzy and easygoing all day. Very good place to be. Productivity not too affected, once I actually got to work...</p><p>I would try this dose again without the alcohol, just to see what it was like. Or maybe try this dose to actually do something productive (art, meditation, writing) rather than just for fun, though I was certainly glad for the fun. I wouldn't go too much higher in dose because I don't like the sensation on my heart of sudden stimulation. Felt like a light serotonin sprinkle rather than a serotonin dump. Nice.</p>"
}
