{
 "title": "The Best Thing EVER",
 "author": "Kurt",
 "citation": "   Kurt. \"The Best Thing EVER: experience with 2C-T-7 (ID 3089)\". Erowid.org. Oct 4, 2000. erowid.org/exp/3089",
 "substance": "2C-T-7",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3089",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 4, 2000",
   "Views: 15291",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was very randomly introduced to 2C-T-7: a friend of mine came upon some, somehow, and said not much about it except that it was 'worth it' and 'visuals as good as acid'.  On a completely empty stomach, i hadn't eaten all day except for a bowl of cereal for breakfast around 10:15AM and a few sips of liquid throughout the day to quiet my rumbling stomach.             </p><p>8:11 pm: Ingest 30 mg of 2C-T-7 dissolved in 30ml of distilled water.</p><p>9:00 (+0:45) :  VERY NOTICABLE body tension, moderate nausea, general discomfort, but  the very evident sense that something very powerful is about to take over.  My friend (who had also taken 30mg) and I went into a bedroom and layed down, trying our best not to disrupt our stomachs enough to/in fear of vomit.</p><p>9:05 (+0:50) : large sweeping LSD-esque visuals covering the walls, woodgrain is swirling, yet, again the sense that what i'm seeing now is NOTHING compared to what is to come.  Bosdy tension still overwhelming, we remain supine on the bed.  The nausea and body tension still occupied my attention over the visuals.</p><p>9:30 (+1:15) : we get out of bed, and venture into the family room where there are about a half dozen friends, the visuals are getting stronger and the nausea (luckily) has died away, or at least faded into the background.</p><p>9:45 (+1:30) : visuals and 'body trip' (i.e. the warm beauty that one FEELS in one's  body in conjunction with particularly exciting visuals as from LSD or mushrooms) are becoming exponentially more powerful, and it's about now that i realizes i'm dealing with smoethng very different and very amazing.  </p><p>10:00-1:30am (+1:45-5:15) : space, time, life death, darkness, light, . . . all is a blur.  absolutely overwhelming visuals 100% occupy me.  i'm laughing, crying, gasping for breath, feeling suffocated, flying, spinning. . . oh, yes: My friend and i were literally SCREAMING at the visuals.  Imagine seeing something, completely sober, that makes you scream, something so profound, so literally awesome, that you SCREAM when you see it.  My friend and i shared an unspeakable unity in theis 'new world'  but my non-tripping friends were completely alien.  Neither my friend nor I possessed even the slightest capability to communicate with anyone not on the drug.  People asked me over and over, 'how is it?' 'what's it like?' 'how do you feel?' --and all we force ourselves to spew out was unintelligble gutteral utterings: things like 'uh, buh, WOW!, Gee--uh, whoooh, oh, um, wow'  this is partly due the inability to express what we are experiencing, partly due to the fact that during the questionings, we were invariably sidetracked with a mindblowing visual, which are ALL AROUND YOU.  I remembre losing COMPLETE concept of time; i remember a non-2C-T-7-ing friend of mine saying 'quarter to 12; so 3 and a half'. .  i was thiking '3.5 WHAT? chickens? dodecahedrons? snaggledorfs?'  </p><p>3:30am (+7:15) finally the visuals either begin to subside or i became accustomed enough to the 2C-T-7-alternate universe so that i could once again regain control of my body and mind.  So my friend and i smoke some pot (which until now we had been unable to even consider, not for fear of reaction, but jsut because we were TOTALLY overwhelmed and enchanted with 2C-T-7.  ...WOW! POT IS GREAT!  it sends you right back into what you have just come out of: the unique 2C-T-7-feeling (i even hesitate to call it 'tripping' because it was SO much more.).  WONDERFUL!  Also, we began munching on chewable VITAMIN-C tablets (which I HIGHLY RECOMMEND when on 2C-T-7): these tablets are wonderful little power-pills or of amazing flow of energy and endorphins, you feel the C shooting up your neck, and  it induces wonderful body surges, like endorphin rishes, or a shiver.  </p><p>6:00 (+9:45) :  Our bodies and minds are EXHAUSTED, and we crave sleep; we manage to force down half of a chicken sandwich eah, to quiet our empty stomachs, and that was that: sleep time.</p><p>CONCLUSION:  2C-T-7 is the most amazing ANYTHING (let alone drug)  i have ever experienced.  And since that day i have been in search of more.  HIGHLY RECOMMENDED!!!!!!!!!!</p>"
}
