{
 "title": "Amazing Adventure at the Hot Springs",
 "author": "John",
 "citation": "Citation:   John. \"Amazing Adventure at the Hot Springs: experience with LSD (ID 30928)\". Erowid.org. Feb 26, 2007. erowid.org/exp/30928",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 30928",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2007",
   "Views: 3569",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first time using LSD was one of the most amazing experiences of my life time.  I have been smoking pot for quite some time and just started experimenting with halluginegens.  I had tripped on mushrooms and salvia divinorum several times and DXM once before I decided to try acid.  My friend called me to tell me he could get me some acid if I wanted it, so I bought 5 hits for myself and was planning on taking it the next day before going to the Camp Verde hot springs to camp.  When I told my friend Jessica she got very excited so I talked to my friend again and bought 5 hits for her too.\r\nThe next day we took the acid in my dorm room at about 3:00 in the afternoon.  Jessica only took 4 and sold her other hit to another friend who was going.  Jess and I had to wait for about 45 minutes for our ride to get there.  I was slowly beginning to feel not quite normal when Jess came to my room, saying she didn't want to be alone.  We both agreed we were a little fucked up.  We started to get kind of giggly and objects were beginning to be surrounded by rainbows of light coming in through the window.  Things were given rainbow trails when I moved my head.\r\nI went downstairs to my friend's room to see if he was there and stopped on the way to stare at the gloss coating of the cement in the stairwell as it flowed like water, carrying footprints with it.  My friend wasn't there, and when I got back Jess was excited to see me.  We sat and stared at things for a while until I decided to weigh out an ounce of mushrooms to bring along for my friends. This took a very long time but I eventually finished and put them in a camera case with a box of baggies, some syrian rue, and my digital scale.\r\nBy the time my friend arrived to pick us up we were tripping pretty hard.  We grabbed all our stuff and headed down to his car.  As we were packing the trunk I beat on my hand drum to listen to the echos coming of the building.  It took about 40 minutes to drive south from Flagstaff, AZ to Camp Verde, during which Jess and I sat in the back like little kids on a road trip, staring out the windows and asking non-sensical questions.  The 40 minutes felt much longer.  Just outside Camp Verde we got onto a bumpy dirt road winding around the contours of mountains through a river valley.\r\nWe were told we'd be on this road for an hour before reaching our stop.  Jess and I couldn't believe it, the 40 minutes had already seemed like forever.  Rocks in the sides of hills took strange shapes and the landscape filled us with awe.  I was asking if we were lost about every 10 minutes.  Jess and I were constantly afraid for our lives as we wound up and down mountains on the tiny road with no guardrails, but cheerfully so.  The sun set on the way, making a beautiful color on the mountainous horizon.\r\nWhen we finally arrived it was dark and we were glad to stretch our legs.  We were meeting more friends at the springs, but we had no cell phone coverage, the springs were about a mile hike away and we didn't have any idea how to get there.  We found a friendly hippy who was sitting outside his van with friends and I agreed to give him an eighth of mushrooms in return for guiding us to the springs.\r\nNobody had a light and the terrain was rocky so Jess and I walked together, talking happily and catching eachother as we would trip on unseen objects.  We again felt like little kids, always getting behind, laughing, and asking somewhat pointless questions.  Ocassional patches of sand were incredibly strange sensations.  In the darkness every large rock seemed like a curled up human.  I could hear footsteps behind and in front of me, making it seem like I was part of an invisible, moving crowd.\r\nJess and I both noticed light coming from behind us on occasion, but it never had a source.  There were more rainbows, in the form of strings, making up nets and grid patterns to the side.  Unseen branches hanging over the path and hitting us in the faces caused me to hallucinate fake ones in rainbow color.  It was at this point the I was the most in control of my visuals.  I got rid of the unseen crowd because it was freaking me out a little bit, and then created my own personal iridescent 3D spherical force field around myself.\r\nAfter about a mile of hiking we reached a fast moving river which we had to ford.  I was cold and waist deep and we had to lean sideways to not be swept away, carrying our belongings above our waists.  Jessica and I were tripping very hard and this was quite an endeavor.  At the end of the ford I payed our guide, whose name was Rennick, then gave my other 2 companions their mushrooms before walking a little farther and finally arriving at the springs.\r\nOur friends weren't there and we were confused but also cold so we went into one of the springs.  It was a small rectangular pool inside a stone room painted with many images from previous visitors.  We sat in its warmth and I found that by lifting my hands from the water I could manipulate the steam that came off of them.  I sold some more mushrooms to some cool people who were there when we got there.  I smoked some pot out of a pipe that was offered to me by a cool old kinda fat guy who later bought some mushrooms.  He sang songs and told us storys from his lifetime.  I later found out that the pipe and weed had belonged to a man that he knew who was murdered in an argument fueled by speed and alcohol.  That tripped us out.  We looked in wonder at the paintings on the walls.  After quite some time our friends arrived, late, and I was surrounded by familiar people.  They were all drinking wine so I got to have some good red wine in the comfort of the spring.  Jess and I were still both very happy and I felt positive vibes from her all night.\r\nWhen we had been in the comfort of the springs for quite some time we decided it was time to go back and set up our camp.  On the way back we had flashlights and got to see the whole endeavor in the light, which was interesting.  At the camp we set up my tent and then all huddled in one of my friends tents, eating granola and chocolate and covering ourselves with blankets to stay warm.\r\nOnce my hands warmed up I played a little guitar before laying down and cuddling with Jess until the rest of our party returned from the hot springs.  Everybody seemed set on going to sleep, so although we weren't tired Jessica and I went to my tent and got in our sleeping bags to stay warm.  After just laying there for a while we both decided that we were not going to sleep and that cuddling had been nice.  We unzipped our sleeping bags and put them together, holding eachother and carressing eachothers backs and hands all night.  It was very intimate and comforting, and turned out to keep us much warmer since the night got very cold.  I felt very close to my friend, and my feelings for her grew quite a bit over the night.  \r\nIn the morning we all sat in the sun and ate granola, trail mix and canned vegitables.  A blunt was rolled and several people smoked it in a circle, while me and a few others played guitars and hand drums.  It was a very nice day, and we left around 12:30 to head back to Flafstaff.  I didn't feel bad, but a little fried and not 100%.  I slept for 17 hours the next night and felt refreshed in the morning.  This was an incredibly positive trip, and though I took a lot of acid, it was never overwhelming and I stayed in control the entire time.\n\n\n"
}