{
 "title": "Advice for the Curious",
 "author": "lucidinthesky",
 "citation": " lucidinthesky. \"Advice for the Curious: experience with Proteus Mind Machine & 2C-I (ID 30962)\". Erowid.org. Jul 16, 2004. erowid.org/exp/30962",
 "substance": "Proteus Mind Machine & 2C-I",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "2004",
   "30962",
   "Male",
   "",
   "Not Given",
   "Jul 16, 2004",
   "11856",
   " "
  ]
 ],
 "report": "<p>About 2 years ago I started reading about mind machines: how psychologists use them to alter consciousness, what mind states they can bring, how these states are beneficial. And about 1 year later I decided to get one.</p><p>The proteus, costing about $160, was my choice because it wasn't a toy. It was affordable and I was sure I'd get my moneys worth.  Not being a psychologist, I bought this machine because I was simply curious about the technology. As soon as it arrived I started my experimentation. The device plays two tones into your ears, your brain, plays the mathematical difference. This difference is called a binaural beat. When the binaural beat is generated and sustained for a period of time, your consciousness is altered from resonating at that frequency. Throughout a couple weeks, I found the Proteus machine no more powerful for me than the Hemi-Sync cds that the Monroe Institute has made.</p><p>Despite the warnings in the Proteus's manual, I too decided to use drugs while using the machine. The two I used were 2C-I and marijuana. They didn't do much of anything to improve the machine's effectiveness. I was hoping the 2C-I and the machine would synergize and deepen my experience but my mind kept wandering, I was unable to focus, and all the machine did was produce fantastic visuals. When I awoke the morning after I had used 2C-I with the machine one of my eyes was *very* bloodshot (something that either alone has never produced).</p><p>I've since sold my Proteus and held onto my hemi-sync meta music cds. If you're curious about the technology, I highly recommend the cds over the expensive mind machines. If however, you want to change your brain, get the mind machine. I suspect these will do very little good unless they are used with consistency.</p>"
}
