{
 "title": "Sleeping Awake",
 "author": "Newt",
 "citation": "   Newt. \"Sleeping Awake: experience with Dimenhydrinate (ID 31059)\". Erowid.org. Feb 20, 2004. erowid.org/exp/31059",
 "substance": "Dimenhydrinate",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "750 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   "  T+ 24:00",
   "250 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31059",
   "Male",
   " ",
   "Not Given",
   "Feb 20, 2004",
   "34409",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First, I'd like to mention that I am not one of those who heard a lot of stuff about this drug, and expected much of it. It is not a popular drug where I reside, noone even knows it can be used to trip. I usually use Dramamine to kill migraine, no more than two pills. I once decided to read the label that came with the drug. Side effects seemed very interesting, and nowhere did it say that Dramamine can be lethal. I decided to try it out. BTW, pack of 10 50mg pills costs $1 here.</p><p>Before Dramamine, the only 'drug' I used was weed, and I didn't use it on regular basis. I never experienced true hallucinations before. Even though I am 19.</p><p>First couple of times I took 5-8 pills. It would induce minor auditory hallucinations, but nothing special. One thing I hate about Dramamine is the twitching that occurs when I go to bed.</p><p>Then came the Tuesday night (it's Thursday now). I didn't have a trip-sitter. Noone was around. It was 2AM and previously that day I bought two Dramamine packs. I took 15 pills with water, and returned to my room. It usually takes around 1-2 hours for Dramamine to kick in, but this time I felt it after half an hour. I was in one chatroom on the Internet and I started to lose my focus. As I tried to type the words, I would constantly make spelling errors, and when I saw them I would try to fix it, but I forgot where they were.</p><p>My heart started pounding, and I had a blurry vision. The light was turned off in my room, the only light was coming from my computer's screen. Occasionally there was an effect of lightning flash inside my room, and also sometimes everything would go black except my computer's screen. Then I experienced some strong auditory hallucinations. There was only one song in my playlist, and it kept playing over and over again, but instead I heard other songs, songs that don't exist, with very weird lyrics. I also heard conversation in the other room.</p><p>I went to bathroom to take some water since my mouth was very dry. On my way out someone shouted to me from downstairs: 'The door!'. I shouted back 'What?', and then I realized it was a hallucination. I returned to my room. It was about an hour after I took the pills.</p><p>I sat in front of computer. Now I had trouble reading from computer screen. Words kept appearing and disappearing, and the text was changing. I took a look around my room. Everything was glowing in various colors even though it was dark. I was also glowing. 'Oh fuck! Now I see aura!', I thought. I saw something in the corner. I tried to focus on it, but I couldn't. I got near it, and realize it's just some box. I wanted to test my sight so I took a cigarette box and tried to read what's on it. I was barely able to do it. My vision was totally fucked up, I just managed to read the brand, and I saw many more lines of text which I couldn't recognize, and it kept appearing and disappearing.</p><p>Then the weird things started happening. Only one and a half hour after I took the pills. I saw a ring (well, some doughnut-shaped object) about 50cm (20 inch) diameter, half-transparent object was rotating in 3D and coming closer to me. I wasn't scared, I knew it was a hallucination. As it disappeared, all I needed to do was to think of it and it would come back. I was still able to surf the web, though I would always forget what I was about to do. However, I managed to find some Dramamine info - heh, I thought I was the first one who came up with the idea of abusing Dramamine... Guess not.</p><p>But, now it was already 2 and a half hours later. I have totally lost my mind, I couldn't remember anything about me, where am I or why am I seeing the things I am seeing. Have you ever watched the movie 'Memento'? Well, that's what I felt like, much worse. My memory would remain only for 2-3 seconds, and then totally disappeared. It was extremelly annoying. I wanted to look for one CD in my drawer, but as soon as I look inside, I forgot what I wanted to do. Then I get back to computer, and see the CD on my screen (it was probably some web site that made me look in the first place). I open the drawer. Memory already erased. I tried several more times. I got very annoyed and angry. I looked at screen. I thought: 'OK, Linkin Park - Meteora... Keep it in mind... Meteora...', I just paused to open the drawer. I already forgot it. It looks kinda fun now, but it was extremelly annoying back then.</p><p>Around 5:30 AM (3 and a half hours after I took Dramamine) my memory started to get blurry. I looked around the room and I saw my two sisters and brother playing hide-and-seek. Just as I wanted to tell them something, they disappeared. No, the hallucinations were not realistic, but my mind was fucked-up so I couldn't tell what's going on.</p><p>I think I was lost in my room. I believe I was walking around the room in circles, or at least that's what's left in my memory. I saw my brother laying on my bed. I thought to him 'Hey! Get out of my room!'. I didn't tell it, I thought it. I heard his reply mentally, and he disappeared. I was shocked. I lifted the covers, he wasn't here. I turned around. My sister was playing games on the computer. I sit next to her and talk to her. But - we were talking telepatheticly (sp?). I was so amused that I can talk like that. Not once did I think it was a hallucination. Also, my room wasn't dark, it was totally lighted, as it would be in the noon. I got up to get some water and told her loudly 'I'll be right back.' Then suddenly the room became dark and I looked back. Nothing. There was only my clothes on the chair. I didn't know what happened. I thought she had vanished into thin air and only clothes is here. I lifted my shirt that was laying on chair - perhaps she just shrinked so I cannot see her. Damn, she wasn't there, and it was so nice to have someone to talk to.</p><p>Then my other sister appeared. I tried talking to her too, but she disappeared quickly. I think I wandered around my room feeling dumber than ever. I didn't know what to do, I didn't know where was I, I didn't know anything. There were much more hallucinations, but I can't remember them. I went to bed, and somehow fell asleep.</p><p>I woke up around 4pm the next day (Wednesday). I was still so damn slow and I still had audio-hallucinations and some weak visuals. My pupils were dialated (sp?), and it was really difficult to interract with other people. I was also very depressed, I talked very silently and I was completely sedated. However, I made a big mistake. That evening I took 5 more Dramamine. I had very strong audio hallucinations (even more than last night), but almost no visuals. Some objects would change shape for few seconds, and then get back to normal.</p><p>Now it's Thursday, I still feel pretty weird, with occasional audio and very rare visuals. But for some reason I fear that I will not return to normal ever again. Dramamine really messed up my mind.</p><p>Dramamine hallucinations are the same as dreams - you see things, you hear things, sometimes you know you are dreaming, sometimes not, you don't know who you are, what are you doing here, and the most important - you do not know the risks of your current state. In dreams you can get hurt or even die, and when you wake up you are totally OK. But, if you get hurt or kill yourself while having a Dramamine trip, be assured - you will indeed be injured or even dead. Dramamine induces state that your mind sees as a dream (at least with me it was like that), but your body is still in reality so be VERY careful. You do need a trip-sitter. I will probably do this again, but after I learned how dangerous it can be, I think I'll wait for a while.</p>"
}
