{
 "title": "Fear and Loathing in Wolverhampton",
 "author": "Jezu",
 "citation": "   Jezu. \"Fear and Loathing in Wolverhampton: experience with 4-Acetoxy-DET & Cacti - T. peruvianus (ID 31060)\". Erowid.org. Jul 15, 2013. erowid.org/exp/31060",
 "substance": "4-Acetoxy-DET & Cacti - T. peruvianus",
 "bodyweight": "10.5 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "4-Acetoxy-DET",
   "(powder / crystals)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 4:00",
   "50 g",
   "oral",
   "Cacti - T. peruvianus",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31060",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 15, 2013",
   "Views: 413",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell the whole thing started at about 1pm when I discovered that my package of 4-aco-det arrived in the post. I almost gave up hope on it ever arriving as I had been waiting 4 months for it to come. So instantly I weighed out about 0.05g using my scales and split this with a friend by mixing it in tequila but for me nothing amazing happened and we just watched a film. \r\nAt about 5pm i decided to get ready to go out as it was my brothers birthday so i weighed out another 0.06g which is 60mg this time my friend didnt really want anymore as he would just have the mescaline, which was also his first time. \r\nSo after 20 minutes of looking and watching the mescaline syrup I finally managed to take one big gulp of the stuff that I prepared earlier from 100g of cacti material. About 10 minutes later my friend had his share of that foul tasting liquid then we set of to meet my brother and some other friends. \r\nBy the time I got to my brothers house I noticed an increase in body tempreature so I decided to drink some water. At time I did feel a bit dizzy and there was lots of tracers etc but after about an hours all this past. It kind of worried me a little bit but I was fine I guess it was just a crappy come up. \r\nThe trip was kind of like mushrooms with psychedelic geometric patterns with everything trailing around me, it was kind of cool there and where no type of mental confusion just clarity of thought with some disorientation. There was also some type of weird body feeling that was defiantly like a tryptamine feeling it was kind of cool. \r\nSo next we all left my brothers to find a pub/club so I was walking the around the city dressed up like Hunter S Thomson Fear and loathing. I was wearing my shades and hat with a rage against the machine t-shirt. After a while we arrived at a alternative pub there was strange light flashing around and some weird music was on, all this madness was totally confusing me but it wasnt part of the trip it was real. \r\nSo a few friends went of to the bar and I stood behind them, suddenly I was thrusted to the front of the bar by some unknown force and I was stood there with my hat and shade on waving my hand around saying oh no, er drink, what me, I dont know then the girl behind the bar started to laugh wildly which sent me to start laughing then things just got a bit crazy. \r\nMy friends told me that she asked me what I wanted and I didnt have a clue and started acting trippy, which wasnt my intention must have been more tripping than I thought. But I guess every one there new what was going on. Anyway I found my self back at the table with friends, then after people staring at me a bit through the night we walked home.\n\n\n"
}
