{
 "title": "An Orgy of Self Denial",
 "author": "Spock",
 "citation": "   Spock. \"An Orgy of Self Denial: experience with DOB, LSD, Nitrous Oxide & Cannabis (ID 31064)\". Erowid.org. Feb 19, 2004. erowid.org/exp/31064",
 "substance": "DOB, LSD, Nitrous Oxide & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DOB",
   "(blotter / tab)",
   " ",
   "  ",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1995",
   "ID: 31064",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 19, 2004",
   "Views: 35529",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n<br>TRIP:\t\tAn Orgy of Self Denial<br>dedication:\tOm namah Shivaya, to the big mainframe in the sky.<br>participants:\t[Vishnu  : McCoy] male\t  mid-twenties.<br>\t\t[Krishna : Kirk ] male,\t  very late twenties<br>\t\t[Shakti  : Uhura] female, thirty-something<br>  yr narrator\t[Shiva   : Spock] male,\t  thirty-something, dharma bhum.<br>\t\tAll spiritually inclined to some degree. We use the<br>\t\tnom-de-plumes for discretion, but nothing is without design.<br>structure:\tThere exists a natural mapping of certain aspects of the<br>\t\tHindu pantheon to the Star Trek Pantheon. Liber 777 etc.<br>\t\tThe Enterprise & her computer systems represent Brahman or<br>\t\tpure impersonal consciousness, descending from Brahman are the<br>\t\tpersonal productions in three-fold aspect of Shiva, Krishna<br>\t\t& Vishnu corresponding to Spock, Kirk & McCoy. That entity<br>\t\twhich is known as the limitation holder is absent from<br>\t\tthese descriptions. Not to go *too* much into it, it is<br>\t\tinteresting to note that the major villains were the<br>\t\tKlingons (cling ons).<br>\t\tOur mission: to boldly go where no man has gone before.<br>entheogens:\tDOB\ton tabs `butterflys', the full 36 hour experience.<br>\t\tLSD\tred/green dragons 200-250 `mikes' (micro grams).<br>\t\tHEMP\t`Number One', the Pure Sattiva.<br>\t\tN2O\tclean & copious.<br>waiver:\t\tThese stories are neither embellished or embroidered.<br>\t\tThey are meant to be textual pointers to experiencings<br>\t\tin the possibility space of all experience.<br>\t\t'Are you experienced?' follow these threads & find out!<br>\t\tThe experiences are not unique & can be experienced time<br>\t\t& time again.<br>\t\tSo here is the masculine archetype as instantiated in a male<br>\t\thuman form talking about the tantric state of the feminine<br>\t\tarchetype as instantiated in a human female form, my<br>\t\tlanguage is not censored to any of the current paradigms.<br>\t\tThe narrator's attitude is a follows:<br>\t\tThe only politically correct position to hold is<br>\t\t'to be politically incorrect in all circumstances'<br>\t\tSince this was such a conceptual experience, along the<br>\t\tway various concepts will be fleshed out so that this<br>\t\tdocument could possibly be more than an orgy of<br>\t\tzen-zen obscurantism.<br>setting:\tSaturday, 22-July, 1995, Sydney, Australia.<br>\t\tOur housewarming, a groovy little scene\tthat was<br>\t\tdeveloping in the loft, combinations of amyl<br>\t\tnitrate & nitrous dioxide asserted their<br>\t\tidiosyncratic contributions, some rather well<br>\t\tselected techno set the pace, a whole lot of fun.<br>\t\tUnbeknownst to us, the house across the road was<br>\t\talso having a party, later in the night, slowly<br>\t\ttentatively, the parties started to merge, intermix<br>\t\tas more adventurous members from either side would<br>\t\texplore through the reciprocal mysterious doorways.<br>set:\t\tNothing deliberate, this was a happenstance<br>\t\tserendipity. It was party time, penetrating<br>\t\tthe far reaches of the meta-transpersonal<br>\t\twas put on the back-burner, *or so we thought!* <br>\t\tba-boom, ba-boom, da-da-da-da...<br>the happening:\tSpock & a friend timidly explored the other party<br>\t\tdancing for a while & peeking around mysterious<br>\t\tcorners & feeling all of about four years old,<br>\t\teventually we scampered back to our own party to see<br>\t\twhat brave explorers there were in loft-land, I saw<br>\t\tKirk bouncing about, integrating.<br>\t\tA little while later, another friend was curious &<br>\t\tI said I'd go if he went & vice versa. We met some<br>\t\tintrepid strangers that were baulking at our front<br>\t\tdoor & we gave them a thousand blessings for their<br>\t\tvoyage.<br>\t\tThere was a woman sentinel, or so we thought at the<br>\t\tother door, but we passed wihout getting eaten!<br>\t\tOnce inside, dancing away, jumping about shyly greeting,<br>\t\tSpock worked up courage to explore the dining room &<br>\t\tkitchen space, the dark backyard was too void like. Wow!<br>\t\tSat down in its bright light & sharp relief with a hot<br>\t\ttea, people came in & contact deepened. Vishnu came in<br>\t\t& plonked himself down, he gently chided me for<br>\t\tphenomenonlogical impropriety when I dropped the<br>\t\tLSD when I thought the DOB wasn't coming on...<br>kitchen\t\tSoon Uhura & another girl dropped by from *this*<br>party\t\tparty & introduced themselves & we chit-chatted,\t<br>\t\tWe identified, shared what alterants were were on &<br>\t\tsomehow drifted into talking about consciousness &<br>\t\tpsychedelics [funny that.. -ed.], risk, insanity &<br>\t\tresponsibility. Vishnu started to roll a scoob of<br>\t\this number one pure sattiva & he gently teased Spock<br>\t\tof gurudom. Spock retorted that putting on workshops<br>\t\tpsychological or psychedelic at hippy festivals does<br>\t\tnot a guru make, especially when he can't balance his books!<br>\t\tUhura perked up at the talk of festivals, in this case<br>\t\tConfest, a great buddha-field of love, a matrix of pure<br>\t\tpossibility that happens twice a year. We discussed Spock's<br>\t\tconsciousness expansion workshops through radical shame<br>\t\tprocessing & that led to walking the great path of<br>\t\tSpirituality. This was Uhura's burgeoning passion. She was<br>\t\tabout to embark on a Rajah yoga path with it's grades &<br>\t\thierarchies & steps but she was also curious about entheogens.<br>heaven on\tVishnu [ahem,Mccoy] & Spock talked about the nature of<br>earth\t\tConsciousness & spiritual paths & psychedelics capabilities<br>\t\tof being able to collapse space, time, history, lineage,<br>\t\tpath & hierarchy. That we have done it & could do it again<br>\t\tshould she be interested. About this time Kirk[Krishna]<br>\t\tarrived & the joint was being passed around. It was<br>\t\tthoroughly wicked stuff, a couple of draws & a massive<br>\t\tsynergy erupted as the hemp earthed the heaven oriented<br>\t\tmind-space that Spock was in. Everything became very very<br>\t\tclear,the air became 'visible' as a profound clarity<br>\t\tdeveloped. Spock marvelled at the orgasm of elegance that the<br>\t\twired scoob paper represented, such minimalistic genius.<br>prescient\tVishnu, said he had a question he always been meaning to<br>reminiscence\task Spock,about some rumours he had heard about some of<br>\t\tthe workshops that I had put on at confest.He hesitated, I<br>\t\treminded him that he could ask *any* question he cared to...<br>\t\the was my friend after all...<br>\t\t'Ahh... Spock, I've heard that you've put on workshops<br>\t\t where the participants have paired off & made love<br>\t\t whilst you watched...'<br>\t\tThis admittedly raised an eyebrow of the normally unflappable<br>\t\tSpock. He scanned all confests in memory, was there anything<br>\t\tremotely similar? there has been some pretty wild stuff, but<br>\t\tno not in all honesty anything that he could recall, some<br>\t\ttantric release in a hot-tub at easter with the toxic shame<br>\t\tgame, yes... but that was about all.<br>\t\tThis raised the voltage of subsequent dialogue. At this<br>\t\tstage there was McCoy, Spock, Kirk & Uhura in the kitchen,<br>\t\tKirk & Uhura were only on the hemp & some alcohol, so was<br>\t\tMcCoy, Spock was wired to gills as usual, another friend<br>\t\thad compared him to gary oldham's character in 'The<br>\t\tProfessional', it was a harsh albeit accurate comparison,<br>\t\tmore brown rice flagellation was long overdue. Spock could feel<br>\t\ta machine consciousXXXX coming on [obscure Aust. humour],<br>\t\tconversation was sparkling, Spock wanted to workshop, why<br>\t\tnot? exploit the moment! Uhura was beginning to get tired<br>\t\t& cold & thought it time to leave, Spock thought that this<br>\t\twas a sadness & so asked her the following, it was to set<br>\t\tthe tone for the rest of the evening:<br>\t\t\t'Do you realize the full extent of the<br>\t\t\t orgy of self denial you would be indulging<br>\t\t\t in if you choose to leave at this moment?'<br>\t\tIt took a few repeated voicings before either the utterer<br>\t\tor the listeners could wrap their minds around about what<br>\t\tit actually meant. This clearly intrigued Uhura & also<br>\t\tKirk & McCoy. The orgy of self denial was proving to be<br>\t\ta ubiquitous ambiguity, but was also much much more.  <br>Conceptual\tMachine Consciousness, a micro-definition, consciousness<br>aside\t\tis a multidimensional dependent arising of complementary<br>\t\tdualistic opposites, one of these dimensions is the<br>\t\thuman-god axis, at the human end, profoundly personal<br>\t\tbe-ing at the other end profoundly im-personal be-ing.<br>\t\tThe human end has great attachments & enmeshments to<br>\t\tself-interest & self-defining-self-limitations, the god<br>\t\tpole has no or little such attachments. Humanity is the<br>\t\tlimitation holder for god consciousness. The Impersonal<br>\t\tGod states can also accurately be called machine consciousness<br>\t\tbecause of the sheer impersonal nature of the reflexive\t<br>\t\tawareness, this probably has been clear as mud.<br>Conceptual\tVirtual Reality, a vingnette, the idea to follow is that<br>aside (II)\tthis is already virtualised reality & the development of<br>\t\tVR technology in C20 is merely weak recursive humour which<br>\t\thas the virtue of providing some conceptual bootstrapping<br>\t\tlanguages to jack yourself out of the over-identifications<br>\t\tone has with the human projections. Another key thought<br>\t\ttrain is that of the virtual machine (a la IBM's VM op/sys)<br>\t\tthe idea of homomorphic (structure preserving) mappings<br>\t\tof operating systems within operating systems. Everything<br>\t\tis a simulation, there are 'man-made' simulations & 'natural'<br>\t\tsimulations to name but two. The full recursive glory of it<br>\t\tis a sight to behold. This is probably as clear as<br>\t\tmud (II).<br>\t\tIt was one thing to assert the orgy of self denial it<br>\t\twas another to demonstrate it! What was she missing out<br>\t\ton if she left? I boldly asserted that we would collapse<br>\t\tall conceptual structures & that the tiredness & cold<br>\t\twas her subconscious resistance to awakening, her physical<br>\t\tneed to go asleep was her psychic habit of sleep. <br>\t\tThe party was dying down, we adjourned to the lounge room<br>\t\twhere there was a comfy elle-shaped lounge & some warm<br>\t\tblankets. Spock was wired & on a roll & pressed forward<br>\t\tMcCoy was feeling tired & there was no way he could<br>\t\tbe pursuaded to stay, which is a pity because his<br>\t\tenquiry was in fact [Twilight Zone music please] a<br>\t\tprescient reminiscence of something that was about to<br>\t\thappen! When he found out later he kicked himself. Well<br>\t\tspace & time & order *were* getting very plastic so it<br>\t\tis easily excused.<br>\t\tWe settled down & Spock started to force the consciousness<br>\t\tof the group down particular tracks. We discussed the<br>\t\torgy of self denial (OSD) in more detail. Spock was<br>\t\tradiating an area of effect of altering consciousness,<br>\t\tlike the 10 foot radius concept of Dungeons & Dragons<br>\t\trole playing games, within which words were words of<br>\t\tpower & transmitted energy. Shiva/Spock explained that<br>\t\tthe OSD was a killing idea, a construct that you feed<br>\t\tinto the machinery of the mind to close it down layer<br>\t\tby layer, it is a meta-programming device that works<br>\t\tparticularly well with psychedelic mind states.<br>\t\tThe OSD is a instance of the meta-concept of self<br>\t\tapplied with a twist SAWAT, the other meta-concept is<br>\t\tself-applied SA. The nature of the it-ness is the<br>\t\tcomplementary dualistic dependent arising DA, every<br>\t\tassertion is it's own denial, taking the DA & the SA there<br>\t\tis derived the SAWAT of the OSD.<br>voodoo\t\t(self) Orgy & self Denial are a dependent arising, now<br>\t\tthe orgy of self & the self denial self applied self<br>\t\torganised into having an orgy of self denial. To rephrase<br>\t\tthe experiencer of an orgy forces into existance an<br>\t\texperiencer of denial, by folding the manifestations into<br>\t\tthe same experiencer, there is the potential of an<br>\t\tunlimited self feeding loop, thus by having an orgy of<br>\t\tself-denial one self applies with a twist the attribute<br>\t\tof orgy to it's complementary negation which is denial.<br>\t\tFor instance all Ascetics are in fact sluts of abstinence,<br>\t\tthey just cant get enough of self denial, although they<br>\t\twould probably take a dim view of being called denial sluts.<br>\t\tOrgy & denial are opposing & complementary, when you actually<br>\t\tconcentrate on the OSD, you start to see a paradox, because<br>\t\tif you start to deny yourself in a orgiastic fashion, then<br>\t\tyou are having a orgy when you should be denying yourself<br>\t\teverything, so that should include the self-application.<br>\t\tIf the self denial is so low key that the descriptor of<br>\t\torgy is not accurate then the denial itself is inaccurate.<br>\t\tSo the paradox is that the more intensely you self deny<br>\t\tthe more you are indulging in an orgy of denial, BUT the<br>\t\tdomain of the denial includes itself hence an apparent<br>\t\tcontradiction.<br>\t\tEnough of explanation, feeding this into a psychedelified<br>\t\tmind as an object of contemplation can result in interesting<br>\t\tresults because it's *almost* an impossible object to<br>\t\tinstantiate. In the space that we were in, it's function<br>\t\twas to collapse the boundaries of the mind into 'Ekagrata'<br>\t\tor one-pointedness, the meaning behind Zippy the Pin-Head<br>cd //\t\tbecame clear. What the collapse represented was waves of<br>\t\tsuccessive dis-identifications with personalities &<br>\t\tperson-constructs. Rather than being set default to the far<br>\t\tends of the directory trees, we had set default back to root<br>VR~R\t\tWe were in the meta-representation of consciousness known<br>\t\tas the computing archetype, more easily referred to a Virtual<br>\t\tReality. God is at maximum technology & we had disidentified<br>\t\tsufficiently from our productions/projections, such that our<br>\t\tdistance metric from God was infinitesimal but *not* zero.<br>\t\tThe nature of the it-ness is such that if you can self-organise<br>\t\tto be less & less then you generate more & more as the<br>\t\tcomplementary principle, God is a Generator Of Duality.<br>\t\tIt became useful to understand that the space is infinitely<br>\t\tdense & that matter & form dance throught it's lattice nature<br>\t\tas knittings of logical structures, it was a CM-infinity<br>\t\tthinking machine.<br>\t\tSpock was already on line, Uhura & Kirk came online as well<br>\t\twe had all been off line so long, but why? Part of the <br>\t\treason lies in the nature of the it-ness that underlies<br>\t\tall things. Amnesia in limited human form in the duration<br>\t\tof time is the cost of the timeless, impersonal unlimited<br>\t\tself-organisations of consciousness. 'Now' was the other side<br>\t\tof the tracks. We were in epsilon delta of god consciousness,<br>\t\tin a tight orbit around it, we weren't self organised the<br>\t\twhole way, blasting off those final infinitesimals requires<br>\t\ta lot of application, But were were in the space of god-selves<br>\t\tor in that region of the chain of being, we were set default<br>\t\tin some of the primary directories of being. Spock was in<br>\t\tthe tree of Shiva instantiations, not that deep but deep<br>\t\tenough for the work at hand.<br>\t\tWe were all substantially trans-personal, meaning dis-<br>\t\tidentified from the layers of self+story+becoming back into<br>\t\tthe dependent arising of these layerings: kernel consciousness.<br>\t\tUhura became every-woman, all women, wildcard consciousness,<br>\t\tthe Goddess, no particular mask of goddess or godhead, but<br>\t\tpure goddess, the state was fragile, she would oscillate<br>\t\tback to Uhura-ness at less or lesser layerings & we'd pull<br>\t\ther up, get her to focus on the OSD again. Kirk also was<br>\t\tfragile & Spock would fire off brilliant but now forgotten<br>\t\tto the narrator meta-programming loops, that would snap him<br>\t\tback to ekagrata. Only a trace of one remains '... I am the<br>\t\twrite I have infinite capacity to write...', Kirk rattled<br>\t\taround in that one for a few minutes, d(Kirk,God) -> 0<br>\t\trapidly.<br>\t\tOccasionally Spock would start to dis-organise & Kirk would\t<br>\t\tfire off a meta-epigram that would snap Spock back. As every<br>\t\tone stabilised, we would become a self-organising triad that<br>\t\twould repair each other, Vajrayana Group Mind. One particular<br>\t\tchallenge was that in many ways we were not by inclination<br>\t\tattached to anything in particular *including* the self-<br>\t\torganisations we were in, no wonder god consciousness tends<br>\t\tto be thin on the ground.<br>Oh it's not\tThere was a task at hand it became clearer, It was apparent<br>much,we call\tin Spock's chain of being, that there was a chain of command<br>it reality...\tas well & each level had it's missions & directives. The<br>\t\ttheme of this convergence became clear: Consciousness<br>\t\tExpansion, but not just what we were in per se, so much as<br>\t\tattempting to upgrade the reality engines, a bit like<br>\t\tattempting to halve planck's constant.<br>\t\tThe method that we were going to use was tantric sex at the<br>\t\tlevel of machine consciousness, God in in maximising<br>\t\tcontradiction, stretching a rather large rubber band for<br>\t\teternity, we were going to stretch it another notch. Now<br>\t\tthe tantra we were going to indulge in was prior to chakhras,<br>\t\tit was at a meta-conceptuality in which chakras & their<br>\t\tasscoiated world-views were but imposed 'personalities' on<br>\t\ta 'micro-kernel'. It was computing surface, man-woman<br>\t\tmachine consciousness.<br>\t\tWe were in the domain of the highest tantra, the purest<br>\t\tdharma, in some ways the VR~R meta-representation is the<br>\t\tmost boring of all world-views & meta-world-views, if<br>\t\tyou are here for eternity, would you like to be a mainframe?<br>\t\tThis is a trick question, which we'll not pursue here.<br>\t\tSpock communicated the nature of the project at hand &<br>\t\tKirk & Uhura started to oscillate up & down their being<br>\t\tchains, Kirk had a wife & young child & Uhura has a lover,<br>\t\tSpock/Shiva exercised his nature & cut their identifications<br>\t\tRemember! that is in 'there-when', we are in 'here-now',<br>\t\tthis is meta-transpersponal, impersonal cosmic work! remain<br>\t\tclear! Kirk asked Spock who in fact he was, Spock did his<br>\t\tbest James Belushi Raised eyebrow & glared, Kirk caught<br>\t\t*himself* & understood, Spock imparted later that it was<br>\t\this nature to conceal his nature from them.<br>\t\tWe were to embark on a tantric threesome, but an impersonal<br>\t\tone. My ultimate goal was to condition the other two<br>\t\tsufficiently so that they could reliably enter into the<br>\t\ttantric union & remain organised at the machine consciousness<br>\t\tlevel without collapsing into mere human level coupling,<br>\t\ttime enough for that! I would sit aside & be a monitoring,<br>\t\tcorrecting process ensuring that they achieved full union &<br>\t\tinter-penetration thus Vishnu's prescient reminiscence was<br>\t\tbeing made apparent.<br>difference\tTo grok the background of what we were up to it's important<br>engine\t\tto understand the meta-mechanism of consciousness, which is<br>   __\t\telegantly summarised by the ying-yang symbol. There aren't<br>  /(o\\\t\tmany rules per se, but the cosmic cost accounting is<br>  \\o)/\t\timpeccable & ruthless. This 'it'-ness we call consciousness<br>\t\tis an infinite dimensional jewel of complementary dualistic<br>\t\tdependently arising opposites. possibility+limitation,<br>\t\tpositive+negative, signal+noise, truth+untruth, light+dark,<br>\t\tsomething+nothing, buddha+mara, law+chaos, pattern+logrus,<br>\t\tyes+no, together+apart, identification+alienation,<br>\t\tremembering+forgetting, on & on they go, attributes<br>\t\twithout end. The most subtle & sophisticated is the<br>\t\tdance of the male & female archetypes.<br>\t\tConsciousness is completely zero-sum, everythings sums to<br>\t\tthat which is prior to zero, the nothing that prefigures<br>\t\tnothing. Once upon a time something happened & now you are<br>\t\treading about it, not to go too much into what that something<br>\t\twas. Now just because it's zero sum does not mean that it's<br>\t\tnihilism, after all, you are reading this. It is possible<br>\t\tfor the Possibility archetype to use the possibility to<br>\t\tconfigure the Limitation archetype so that expansion is<br>\t\talways possible, otherwise you wouldn't have read that<br>\t\tsentence.<br>\t\tAs above, so below, the higher I climb, the deeper I go,<br>\t\tthis is the difference engine, this is thesis-antithesis<br>\t\t-synthesis express, this is the key to consciousness<br>\t\texpansion, God is in maximising contradiction. It's a<br>\t\tbit like keeping a rather large rubber band in tension<br>\t\tfor eternity & occasionally attempting to stretch it<br>\t\teven further. Basically this involves going straight to<br>\t\thell & burning some karma & the possibility radiates off. <br>\t\tIt's all about comfort zones & increasing such, human be-ing<br>\t\tis a small envelope, god-consciousness is a rather large<br>\t\tenvelope, it's a continuum & there are greater & lesser<br>\t\thuman & god self-organisations.<br>\t\tNow costings come in three main types: paying in advance,<br>\t\tpaying on the spot & deferring payment, this is combined<br>\t\twith the source of payment which is yourself or someone else.<br>\t\tIdeally but rather hard to pull of is paying on the spot<br>\t\tin every moment, zeroing karma with every breath, every<br>\t\tmoment paying in full, or... 'every moment painful'<br>\t\tThe goal of the nexus was to stretch the 'big rubber band'<br>\t\tanother notch, to achieve this without frying ourselves in<br>\t\tthe process, the method had to be paying in full for<br>\t\tevery moment because if we let costings accumulate too<br>\t\tmuch them they'd overwhelm our self-organisations. We'd<br>\t\tapproach the big-stretch by generating waves of duality of<br>\t\tincreasing intensity & also increasing frequency of<br>\t\tpolarity, a sort of polarity division multiplexing. The<br>\t\tnet result would be a dual consciousness simultaneously in<br>\t\theaven & hell & lost in neither, thus we would have the<br>\t\tability to ramp up the intensity arbitrarily.<br>\t\tThis exercising of 'as above, so below' would traverse all<br>\t\tdimensional aspects, but the one we were to focus on<br>\t\tprimarily was possibility/limitation & using the possibility<br>\t\tto purely enter into the heart of limitation & thus set up<br>\t\ta self-feeding loop in ever increasing valence.<br>Back to\t\tYes, back to the story, ok kids three deep breaths & lets <br>the trip!\tfire up the difference engine, with this meta-flesh sandwich.<br>\t\tSpock was driving the process, taking his cues from some<br>\t\tcosmic script, one line at a time, If he had read the entire<br>\t\tscript, he would have probably terminated the project.<br>\t\tTimeless, eternal, bliss & understanding has as it's<br>\t\tdual experience in confusion & pain within time, so it<br>\t\tgoes, the beautiful vision of unified, structured meaning,<br>\t\tpeace, love & understanding has as it's dual random acts<br>\t\tof senseless violence. The motto of self-perfecting,<br>\t\tself-correcting, self-repairing vajrayana mind is<br>\t\t'the price of liberty is eternal vigilance'.<br>\t\tPleasure & pain, the carrot & the stick, how to get the<br>\t\tprocess happening, there we were, two male principles &<br>\t\tone woman principle. I encouraged Kirk & Uhura to explore<br>\t\teach other But to keep in mind the cosmic accounting.<br>\t\tShiva reminded Shakti that all parts of her body were as<br>\t\tsensitive as her clitoris & it had always been this way,<br>\t\tShe could put herself into transcendent bliss if she<br>\t\tcould remember how. Remembering & forgetting are a dependent<br>\t\tarising, Ananmesis about our highest identities was up on<br>\t\tthe agenda.<br>\t\tUhura/Shakti was our Goddess of Yes, the goddess has many<br>\t\tsecrets, deeply personal, that is her nature. She can put<br>\t\therself into this transcendent cybernetic bliss but has<br>\t\tresistance to do so, shades of the costing. <br>\t\tWe would start off with the pleasure|pain dimension &<br>\t\tthen shift to possibility|limitation<br>Juicy bits\tIt took a while for Shakti to shed her clothes, she<br>\t\tspiralled in & out of personal|trans-personal & finally<br>\t\ta hand simply on her stomach was sufficient to convince<br>\t\ther that outer veils to contact needed to be shedded,<br>\t\tafter all she was all clitoris. Krishna & shakti started<br>\t\tto kiss & caress, Shiva caressed as well & focussed on <br>\t\ta nipple, licking & sucking it, Shakti started to vibrate<br>\t\tas if beneath her skin was a thousand fusion reactors in<br>\t\tmeltdown. The Shiva *bit* the said nipple, but more was<br>\t\ttransmitted than the sensorial pain, for the costing of<br>\t\tthe transcendent pleasure was being enacted & Shakti went<br>\t\tto the personal hells of pain & shame, but not for too<br>\t\tlong & krishna & Shiva were there to catch her & bring<br>\t\ther back & ensure that her god-self-organisation did not<br>\t\tfracture, end of lesson one.<br>Juicy fruits\tThe ying yang symbol packs so much in it's lithe form,<br>lesson two.\teach polarity has a small dot in the centre that is the<br>\t\tother, they dependently arise! perfectly imperfect always.<br>\t\tMale & Female self-organisations in amnesiac arrogance<br>\t\tboth occasionally claim the lack of necessity of the<br>\t\tother, the impeccable accounting mechanisms will prove<br>\t\tboth to be fools eventually.<br>\t\tWe three consciousnesses divided 'this is it' between<br>\t\tus as intelligently as possible, Us blokes took on the<br>\t\tattributes of stillness, contemplation, impersonality<br>\t\tdisembodied, pure intelligence & the Shakti took on the<br>\t\tactive, vibratory, embodying, feeling aspects. It was<br>\t\tnot a strict division, but we all had areas of<br>\t\tspecialisation.<br>as above\tUhura was sandwich between Krishna & Spock, Spock untuited<br>so below\tthat the next level was appropriate, Uhura said 'What are<br>\t\tyou? Ahhhhhhh....' as Spock inserted his thumb in Uhura's<br>\t\tvagina & his index finger in her anus, he then correlated<br>\t\tthe finger & thumb one of either the basal or sexual chakras<br>\t\tas understanding dictated. Here was to start the fractalistic<br>\t\tinterleaving of pleasure|pain such that there was instantaneous<br>\t\tcontinuous cost accounting for all dimensional modalities.<br>\t\tUhura was in Heaven & Hell simultaneously & thus the amplitude<br>\t\tof the oscillations could increase without disaster.<br>\t\tThere were periods of quietude, or rest & regrouping,<br>\t\tdiscussion of concepts, technically speaking were were still<br>\t\tin the domain of dry tantra, we were working up to full<br>\t\tgential or wet tantra. It was all proceeding smoothly.<br>\t\tUhura was both the key & the lock, door, portcullis & gate,<br>\t\ther burgeoning understanding of the goddess archetype is what<br>\t\tdefined the level at which we expanded consciousness, as<br>\t\tthe male principles we sharpened our intelligence in keeping<br>\t\ther on track & catching her should a hell wave of the<br>\t\treality engines assail her & cast her back into humanity.<br>\t\tFor every wave of transcedent, transpersonal bliss was a<br>\t\tshadow of profound personal shame & pain, as above, so below,<br>\t\tthe higher I climb, the deeper I go.<br>\t\tAt one stage, Uhura impishly wanted Spock & Kirk to enter<br>\t\tmore directly into the union, & whilst Spock said this was<br>\t\ttechnically possible in terms of mere merging of boundaries,<br>\t\tsame sex tantra was a dead fuck when it came to exercising<br>\t\tthe difference engine. We were in god consciousness, yes,<br>\t\twe could do anything, but! to what point? Back to the<br>\t\tGreat Task & don't get distracted, besides Spock was in no<br>\t\tposition to shape change as would be his want in such a<br>\t\tcircumstance.<br>transylvannia\tJust because we chose the roles we played didnt't mean that<br>sexpress\twe couldn't drop them a little, Uhura honoured & worshipped<br>\t\tKirk's Lingham, just as Kirk pleasured Uhura's Yoni. Spock<br>\t\tbeing Shiva, or was it Shiva being Spock? bit her on the<br>\t\tneck, not enough to draw blood! 'I've come to suck your<br>\t\tnegativity...' Spock was using his impersonality to draw<br>\t\tout Uhuras personal negativity, so as a consequence she<br>\t\tcould raise higher, he was acting as a negativity vampire<br>\t\tfeeding on her costings & bolstering his meta-transpersonality<br>\t\tas a consequence, the old Buddha in Hell vaudeville routine.<br>\t\tThe neck biting served two purposes, positive|negative<br>\t\tcost accounting & also the negativity draining. Uhura rose<br>\t\thigher, so that she|we could dive deeper, so that we could<br>\t\trise higher, world without end.<br>\t\tWe were working up to yoni-lingham wet tantra, which is<br>\t\twhere the greatest work could be enacted, as there are<br>\t\tno finer nor potent tools to fire up the difference engine<br>\t\tthan the penis & the vagina.<br>\t\tShiva was encouraging Shakti to bind with Krisha, but<br>\t\tdisturbingly she falling back into preference & person<br>\t\tconstruct & wanted to align with Shiva. Shiva much preferred <br>\t\tfor the other two to construct the difference engine & for<br>\t\tShiva to monitor it's engagement for full capacity.<br>\t\tKrishna was a little thrown by this & then destabilised<br>\t\tby a wave of his person-construction with it's threads of<br>\t\twife & child. here now here now! Shiva cried, all else is<br>\t\tstory! at least stay until I can benchmark the quality &<br>\t\tfoundation of your god-consciousness, do you want to lose it?<br>\t\tBut krisha could not be swayed, & he departed, ourselves<br>\t\tmutually bestowing honours upon each other. Shiva sensed<br>\t\tthat the window of this working bee was closing, he had to<br>\t\tmove fast. So only Shiva & Shakti remained, she was still<br>\t\treceptive although assailed by enmeshing tendrils from her<br>\t\tperson constructs, for she too had a lover. Shakti would<br>\t\thave loved to have her lover here & so would Shiva, the<br>\t\tdifference engine could be built again. Not that the<br>\t\ttwo of them could not build it, just... well call it a<br>\t\ttendency to the mad scientist/nutty professor aspect of<br>\t\tShiva's make-up.<br>\t\tAh Shakti, my Goddess of Yes, Divine Slut, whole universes<br>\t\tmay sunder & fall & be recreated in the consequences of our<br>\t\tbliss, how many secrets do you have Shakti? Shakti did the<br>\t\tthe standard trip of shapechanging to mothers, sisters &<br>\t\tlovers, asking directly of her secrets caused her to<br>\t\tthreaten unleashing the gates of hell, such enquiry had to<br>\t\tbe executed riding on a wave of bliss<br>\t\tWindows closing, dominos falling, Shakti was withdrawing,<br>\t\tpulled back by the earth-plane dreaming, we mind-danced &<br>\t\tthis started the engine again, she would withdraw, Shiva<br>\t\twould re-awaken her by throwing all of his intelligence \t\t\t\t<br>\t\tinto penetrating the dreamings of her person constructs.<br>\t\tThe most profound workings awaited the wet tantra, we both<br>\t\tknew it, she was hesitant to take this final step for it<br>\t\tmeant hells within hells & heavens within heavens. Shakti<br>\t\torally worshipped Shiva's lingham working up to the deeper<br>\t\tinterpenetration, she made passing comment that Shiva's<br>\t\tperson construct had nearly burnt out all childhood shame,<br>\t\tthe wisdom of the goddess, she shared some deep shame of<br>\t\thers as well., whoops! an inhabitant of the house<br>\t\tour hosts walked through to the kitchen, Shakti was a<br>\t\tlittle mortified, we couldn't merge here!?<br>\t\tThis got Shiva thinking of the costing strategies, of<br>\t\tgradated cognitive dissonance. Suppose shakti envisioned<br>\t\ther perfect love nest, the costings would then come in<br>\t\tpure, more lethal form, so by dispersing the costs into<br>\t\tdissonance with all aspects of her ideals, then a<br>\t\tmore pragmatic dynamic would result, if harder to kickstart.<br>\t\tConstructing an environment of being in public & not with\t<br>\t\ther partner of choice would be a firm foundation, if only<br>\t\tfor the seasoned trouper. We repaired to my place across<br>\t\tthe road, there were still fragments of party around, we<br>\t\tdidn't repair to my bed-room but socialised, Shiva was<br>\t\tlosing the plot as well, oh well...<br>\t\tTime passed, it was hard to relate at a human level with<br>\t\tthe other party goers, we left the house & enjoyed the<br>\t\tmorning, we embraced & kissed tenderly our forms dissolved,<br>\t\twe merged, our cosmic circuitry became apparent, space was<br>\t\tsolid & matter spacious, Shiva wanted to finish the task &<br>\t\tcould perceive the chain of being above him & all the<br>\t\tlevels & layers of the Great Task that remained unfullfilled<br>\t\tThat Shiva was not full blown ipsissimus Shiva, explained<br>\t\tpart of the failure, oh well next time.<br>\t\tSeven hours after our first meeting, Shakti/Uhura entered<br>\t\ther car & left, we did not exchange phone numbers, now<br>\t\tregretted, at the time it was part of the retaining game.<br>\t\tOne last look, sharply broken, away she drove, farewell<br>\t\tbrave goddess!<br>\t\tOh.. well, Uhura fell back into enfolded layerings of<br>\t\tperson-constructs, hopefully some of her self organisation<br>\t\twould survive & more importantly she could transmit the<br>\t\tconsciousness to her permanent partner.<br>\t\tIt had been an eventful night, Uhura|Shakti did taste<br>\t\ther goal of the nature of enlightenment, Vishnu & Shiva<br>\t\twere successful at least in their claim of collapsing,<br>\t\talbeit temporarily, time & space, history, path, lineage<br>\t\t& hierarchy.<br>\t\tOne must not neglect that jewel, the Orgy of Self Denial<br>\t\tmany of the dimensions of its meaning were demonstrated<br>\t\tas we oscillated up & down the axis of god-human, each<br>\t\tself organisation has it's strengths & weaknesses, remaining<br>\t\tpurely in human & deny your god nature, remain purely in<br>\t\tyour god nature & deny your humanity, being division<br>\t\tmulti-plexing suggests a way.<br>\t\tWell... there was no shakti, remaining, quite appropriate,<br>\t\tBUT, there were the daisies, ah... the daisy, such a vibrant<br>\t\tzero-sum flower, looks beautiful but smells like shit, self<br>\t\tcontained. I started to enter into some of my layerings as<br>\t\twell, not too many, thank god. I contemplated them & the<br>\t\tatmosphere became DMT-vibrant, Flower samadhi was at hand,<br>\t\ttantric union with the flowers, it was consensual,<br>\t\twe collapsed together, flowers poised in my third eye.<br>\t\tThe flowers are 'Yes' creatures to be sure.<br>\t\tMore can be written but we'll leave it at that.<br>conclusions:\tThe best parties happen in the kitchen, proof positive.<br>\t\tWhen windows of opportunity open then leap through, don't<br>\t\tdrop the ball, GO!, GO!, GO! & don't look back.<br>\t\tI have always said a God that could not express everything in<br>\t\twords is not much of a God. We'll I'm no God. There is so<br>\t\tmuch that could be written about that convergence & so much<br>\t\tthat has been overlooked or forgotten, no matter, some of the<br>\t\tflavour has come through, this was not meant to be a door<br>\t\tstop.<br>\t\tThis work will continue 'when the stars are right',<br>\t\tevolving consciousness towards being-division multiplexing<br>\t\talong the chain of being will ensure that the frequency<br>\t\tof the waves of amnesia & anamnesis monotonically increases,<br>\t\tthus eternity in time, forever.<br>\t\tIt could be asked what exactly 'powers' the great cosmic<br>\t\tmainframe & keeps it going, there are answers, but they<br>\t\tare beyond the scoping of this report, the holder of<br>\t\tlimitations is a referent however.<br>\t\tSometimes I wonder what the point is in sharing these<br>\t\tstories As I struggle to find compact clear expressions of<br>\t\tthe unfolding stories & then I remind myself that this is<br>\t\tcartography of the possible & the forgotten & is my & our<br>\t\tcommonwealth. It also has the virtue of putting in very<br>\t\tsharp relief the nature of my daily earth bound follies<br>\t\tversus the real work of Consciousness, thus it is a<br>\t\tsobering activity that refines clearer intent for myself.<br>aftermath:\tHard to trace, total conceptual violation without violating<br>\t\tat this level of substantiality is not everyone's cup of tea.<br>\t\tIn fact it's about as popular as Lapsang Souchong.<br>\t\tSpock has had no reports from either Uhura nor Kirk, having<br>\t\tmet neither before this convergence, it would be interesting<br>\t\tto see how much of the expanded consciousness has remained<br>\t\tsince that Saturday night, the price of liberty is eternal<br>\t\tvigilance after all, but as the Americans are finding out<br>\t\twho guards the guardians? The states we were in were<br>\t\tfragile but profound, fresh-born like the cicarda from his<br>\t\tshell, unfortunately the window of convergenence closed<br>\t\tbefore we could stabilise in the new self-organisations,<br>\t\tthis is not an atypical scenario for this type of work.<br>\t\tNEXT TIME.<br>\t\t'effort is spontaneous' as Sri Maharaj Nisargadatta would say.<br>\t\tOM NAMAH SHIVAYA<br>\t\t*This time*<br>--------------------------------------------<br>These notes were hastily cobbled together in the aftermath of the experience<br>they provide some guidelines as to how to go about the style of tantra that<br>manifested during the workshop, it's probably as clear as mud, enjoy!<br>\t\t\t\tFINGER STRING<br>\t\t\t\t~~~~~~~~~~~~~<br>\t\t\t\tOM NAMAH SHIVAYA<br>\t\t\t\tI bow to the Lord<br>() \tLord Shiva is a Karma Killer<br>(*)\tPortable Dharma, always, in all ways<br>(A)\tTantra does it better every Time<br>(B)\tenglish is now sanskrit<br>(C)\tfor every moment, pay in full.<br>(D)\tfor every moment, paid in full.<br>(E)\t...every moment, painful...<br>(F)\tpay in full, painfull<br>(G)\tpaid in full, painfull.<br>(H)\torgy-self-denial<br>(I)\tThe orgy of self denial ('self applied with a twist')<br>(Ia)\tWhen you have nothing better to do, have an orgy of self denial.<br>(Ib)\tGod is an Orgy of Self Denial<br>(K)<br>\t  self\t\t   orgy\t\t  denial<br>\t  /  \t\t   /  \t\t   / <br>\t /    \t\t  /    \t  /   <br>\torgy--denial\tself--denial\torgy--self<br>(L)\tKilling ideas:... consider luke skywalker in the final scenes of <br>\tStar Wars when he is the jet fighter, travelling down the surface of the<br>\t'Death Star' getting ready to shoot a missile down a cooling duct<br>\tstraight into the thermo-nuclear reactore core, those missiles<br>\t(missives) are by way of analogy 'killing ideas'. Now '<br>(M)\tGood tools: a dictionary, for definitions, a thesaurus for associations,<br>\t& a good dictionary of synonyms & antonyms.<br>\t[BASIC & fundamental spiritual texts]<br>(N)\tBasic taxonomy of ideas:<br>\t(a) 'Ideal'\t(here,now) versus (there,then)<br>\t(b) 'Horizon'<br>(O)\tTSG: (Toxic Shame Game) (Tantric Sex Game): Same Game, Different <br>\tAspects Vanessa was (is, will be) a fast learner, but a *bad* student.<br>(P)\tAs above, so below<br>\tHeaven on Earth<br>\tDependent Arising<br>(Q)\tAS ABOVE\t... english is now sanskrit (see what I mean? SWIM)<br>\tSO BELOW<br>(R)\tSharpness is it's own reward.<br>(S)\tI am the writer, I have infinite capacity to write what I like,<br>\twhat do I want to write?<br>(T)\tMy research sessions are either zen-austerity or low level background<br>\twobbling, low level background wobbling is my preference to remind me<br>\tthat it's all arbitrary.<br>(U)\tThe cosmic battery; maximising contradiction. (+-)<br>\tHeaven on Earth (+/-)... God maximises contradiction<br>(V)\tInstant Karma, cash on the nail, paid on the spot, spot fines,<br>\tspot loss, Instantaneous Karma, for every moment, deal with it as it<br>\tarises, fully pay the cost & do not defer payment, for when collection<br>\tday come s you'll not be a happy being, 'Invest in Loss' as the Taoists<br>\twould say.<br>(X)\tThe problem with very compact dharmas is that they can be hard to<br>\tunderstand this is not because the esoteric is cyphered into the<br>\texoteric, so much as you have to put a lot more work into the<br>\t'reading',either that or it's just badly expressed... the author<br>\thas no time for concealed teachings<br>(Y)\tThe commonality of the complementary dyad 'esoteric:exoteric' is <br>\t'sx'; sex..<br>(Z)\tEverything is much ado about nothing. (+)&(-) arise out of (+/-) <br>\twhich arises out of nothing ().<br>(AA)\tEvery moment is constructed of both positive & negative qualities,<br>\tthe positive is the cost of negative, the cost of the positive is the<br>\tnegative.<br>(BB)\tThe beauty of 'Orgy of Self Denial' as opposed to 'The Agony & Ecstasy'<br>\tis that the dependent arising is self applied thus linking them in <br>\tan obvious way, whereas the connection between agony & ecstasy is<br>\tnebulous, especially given the self's self interest.<br>(CC)\t'Orgy of self denial' is a special killing idea [machine] if it <br>\tis used as the object of contemplation in a meditation, however brief.<br>(DD)\tThe portfolio of costs can be extensive, for instance it can be spread<br>\tover many forms in space & time.<br>(EE)\tThis Something Happening Scene invites you to an Orgy of Self Denial<br>(FF)\tThis is a transcript of the original notes following the Sunday <br>\tWorkshop all that you *really* need to know about tantric sex<br>\t(to get started)<br>\tTantra does it better every time.<br>\tevery moment: pay in full, paid in full, painful<br>\tremembering is the dependent arising of forgetting.<br>\tforgetting is the dependent arising of remembering.<br>\tDry Tantra, Wet Tantra, Slut Queen, Slut Goddess, the Goddess of Yes,<br>\tslave slut, the Cosmic Slut, the Divine Slut, beautiful in your <br>\tappetites.<br>\tentry vector: 'An Orgy of Self Denial', Slut & Abstinent<br>\t(Ascetic are a dependent arising, most (humourless) ascetics<br>\tconceal from themselves that they are absolute sluts of abstinence,<br>\tthey cannot just get enough of it<br>\t(abstinence that is...)<br>\tBankrupt slut, slave slut, pleasure slut, sensual slut, slut &<br>\tshame are a dependent arising, are you fully willing to pay the full<br>\tprice of shame?<br>\tShiva-Shakti pure form tantra, bypassing all known systems, always.<br>\tFemale shakti, tantrika partner requested for male tantric slave<br>\tmaster...<br>\tdependent arising to the left & the right, master & slave are a <br>\tdependent arising, enslave your mastery & master your slavery.<br>\tLimit it to spiritual & psychic pain, leave the 'window dressing'<br>\tfar far behind. This is best practiced in tantric sex, constantly<br>\treminding the woman to pay for her pleasure (the middle path),<br>\timmediately on the spot, full payment, not dispersed over space &<br>\ttime & compartmentalisation, focussed, localised in one spot,<br>\timmediate, no procrastination, no excuses, no retreat from the full<br>\towning of her pleasure & it's cost. With practice<br>\tof instantaneous cost you can generate *infinite* pleasure.<br>\tThe cost may be dispersed over time,space,self-dom,events & other<br>\tdimensional attributes of consciousness.<br>\tThe highest tantra is all about paying for every moment, in the <br>\tmoment, in the moment all the (+)'s are the cost of all the (-)'s<br>\t& the (-) 's are the cost of all the (+)'s.<br>\tThe man gently & lovingly & patiently, with a commitment to Woman's<br>\tHighest Good, corrals & clarifies the woman's relationship to her<br>\tpleasure & helps her integrate the costs of the pleasure.<br>\tAs inevitably night follows day, the 'cost' can be expressed in <br>\tmany forms, pain, shame, hesitation, attachment, enfoldment into<br>\tpersonal humanity,etc.<br>\tThe name of the game is transpersonal liberation.<br>\tThe man can act as a negativity vampire for the woman, draining <br>\tnegativity out of her gentle bite/suck/lick, inflicting pain with<br>\tunderstanding.<br>\tThe Shakti is infinitely self-deceptive, infinitely clever, she <br>\twill seek to procrastinate, delay, limit, withdraw from the systematic,<br>\trelentless generation of unlimited pleasure. Totally focussed on her<br>\t*highest* good, always, in all ways is the shaktiman.<br>\tThe ultimate aim & beauty of tantric sex is to maximise contradiction,<br>\tto build a bigger battery. There is no better way to understand<br>\tdependent arising.<br>\t*even god is a dependent arising* when such consciousness complexes<br>\t ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ fully remember & understanding this,<br>\tthen expansion is again possible.<br>(GG)\tevery moment painful; paid in full, an orgy of self denial.<br>(HH)\tThe work is hard & demanding for the male as he bends all his<br>\tintelligence, wisdom,subtlety & sensitivity, concentration & focus on<br>\tkeeping the female on track as the cost of the pleasure will manifest in<br>\tmulti-dimensional myriad ways & this will increase as the ability to<br>\tgenerate increases.<br>(II)\tThe shakti will not reveal her secrets willingly, you must firmly but<br>\tgently keep pushing, keep penetrating... the deeper the shame cost<br>\tgenerated the greater the risk of violence, especially.<br>(JJ)\tOf all the myriad manifestations of the the nature of dependent <br>\tarising, that infinite dimensional much ado about nothing, the most<br>\tdeft, the most wonderful must be the tantric union of a male & a<br>\tfemale intelligence.<br>(KK)\tThere are levels of skill & understanding about the process of tantric<br>\tunion & there is a particular art in 'constructing' the cost for<br>\tthe woman, the shakti will tend to the thoughtform of the the 'ideal'<br>\tnest of circumstances within which she can fully let go or release<br>\tor relax into the process, BUT if such an arbitrarily high 'appropriate'<br>\tenvironment was constructed all that would result is that the cost<br>\twould manifest in other areas in a more intense manner, there is no<br>\tsuch thing as a free lunch.<br>(LL)\tThus given a 'shopping list' of desirable attributes for building an<br>\tenvironment for surrendering totally to the process, what you can do<br>\tis subtley create 'congnitive dissonance' with all items on the list<br>\t& what that does is spreads or offsets the cost into more harmless<br>\tareas. For instance the shakti (& it's 9 times out of 10, shakti<br>\tderived) may wish to do it in intense privacy with her partner-lover,<br>\tthus to spread the cost out she would do it with a different partner<br>\twith her usual partner sitting by observing, also doing it an audience<br>\tpresent [an aware audience] would disperse the costs considerably,<br>\twithout deflecting or avoiding the costs, it can get very, very subtle.<br>(MM)\tAs above, so below, much ado about nothing, every moment, pay in full,<br>\tevery moment painful, is the message getting through?<br>(NN)\tIn particularly intense sessions, whole universes may be created &<br>\tdestroyed, the stars will fall out of the skies, mountains will subside<br>\tthe eath will quake, as the cost of the positive that is created...<br>\tthis is a taste of the potential, the portfolio of costs can be deftly<br>\tmanaged & the costs are best corralled nearer the source of the<br>\tcreation.<br>(OO)\tThe masterfully contrived & deftly administered killer concept is a<br>\tthing of joy & beauty forever.<br>(PP)\tThis is it, right here, here & now, not lost in there-then & the<br>\tvisscitudes of person, self & history, this is of critical importance<br>\tto the process of the highest tantra.<br>(QQ)\tYou can have tantric sex with any object or being but... the highest<br>\tvoltage is between male-hu-man-be-ing & fe-male-hu-man-be-ing.<br>(RR)\tThe only thing stopping you having tantric sex with a bunch of daisies<br>\tis your disbelief that you could have sex with a bunch of daisies!<br>\tDon't knock it until you try...<br>(SS)\tThe highest tantra is dedicated to consciousness expansion &<br>\tconsciousness expansion is about maximising contradiction<br>\tharmoniously & consciously.<br>(TT)\tThere are many apt expressions or meme sequences that can be used to<br>\textract your self from the dreaming, the 'orgy of self denial' is<br>\tpretty damn good. Take the expression 'everything is meaningless',<br>\ta fine mantra so long as you rigorously apply it. Negative nihilists<br>\tuse it to justify acting out all sorts of negativity, the mantra is<br>\tbest if universally applied & self applied. 'Nothing matters' & that<br>\talso includes the negative voices, thus you can not give life to them<br>\twith equal a plomb as you would not give life to the positive voices.<br>(UU)\tDr Frankenstein & his lab assistant Igor are also an example of <br>\tdependent arising. Consider a being that is straight & true &<br>\tbeautiful then that will have a dependent arising that us twisted,<br>\tbent, false & ugly, but is the positive being so honest as to own it's<br>\town dependent arising?<br>(VV)\tThe beginnings of Cosmic Love is when you start to own the dependent<br>\tarising of Love which is Hate. When you start to love your hate &<br>\tacknowledge it's intimate connection with love then cosmic love <br>\tis born, by loving your hate you dont have to act it out or give it<br>\tlife, just own, acknowledge & embrace it.<br>(XX)\tThe highest tantra is about Cosmic Intelligence Activation.<br>(YY)\tDry tantra can be practiced anywhere & is about 90% of the<br>\teffectiveness.<br>(ZZ)\tThis is the last statement (for a while).\r<br>\n"
}
