{
 "title": "Smoking Bundleflower Root Bark",
 "author": "Freyje",
 "citation": "   Freyje. \"Smoking Bundleflower Root Bark: experience with Desmanthus illinoensis & Cannabis (ID 311)\". Erowid.org. Jul 16, 2000. erowid.org/exp/311",
 "substance": "Desmanthus illinoensis & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Desmanthus illinoensis",
   "(rootbark)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2000",
   "311",
   "Male",
   " ",
   "Not Given",
   "Jul 16, 2000",
   "71655",
   " "
  ]
 ],
 "report": "<p>This was my first experience with a DMT source I read of in TIHKAL by Shulgin. At 7:00 p.m. I began smoking, with a small amount of grass, ground and pulverized root bark from Desmanthus Illinoiensis. I was expecting the 'instant rush'; this did not occur.  After fifteen minutes of continued smoking, I began to notice that the pot high was an order of magnitude stronger, which I attribute to the DMT. Set was internal exploration, setting was with a friend in a quiet, semi-dark room. He was smoking as well. I noticed at 0:20 that my chest and back muscles were spasming, and thought of the 'rottweilers that jump in and out of your chest', per T. McKenna.  I mentioned this to my friend, and noticed that my voice seemed to be coming out of a machine (my body), with which I wasn't strongly associated with at the moment.  It sounded deeper and more resonant.  It felt good to talk to my friend, and this deepened over another ten minutes (with occasional continued tokes) into a profoundly 'heart opened' experience, which I would put on a par with my best MDMA trips. I practice Kriya Yoga, part of which lengthens the spine. </p><p>As I bowed (sitting crosslegged on the floor), I felt my spine open, and when I sat up, looked at my friend and felt that I was truly able to see him as God.  To do this I had, while bowed down, to see the deepest cruelties that humans are capable of (rape and murder). A kind, deep voice said this was a part of the human condition that a deeply realized being is willing to see. Being willing to view this with detachment let me appreciate the depth of love I had for all people, and I was able to express this to my friend. This intensity lasted for perhaps ten minutes, and the comedown was very gradual.  I am writing this almost 20 hours later; no residual effects at all, but I have felt a pleasant centeredness and afterglow.</p>"
}
