{
 "title": "Consuming Methods",
 "author": "s.d.",
 "citation": " s.d.. \"Consuming Methods: experience with 2C-I (ID 31120)\". Erowid.org. Nov 3, 2004. erowid.org/exp/31120",
 "substance": "2C-I",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "2C-I",
   "",
   " ",
   "",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2004",
   "31120",
   "Male",
   "",
   "Not Given",
   "Nov 3, 2004",
   "13648",
   " "
  ]
 ],
 "report": "<p>2C-I, no new substance for me, I have tripped several times on 2C-I, several different ways. Each way having its advantages..</p><p>The first method Im going to talk about is the one I have found the LEAST amount of info on. Smoking 2C-I. At first I thought of vaporizing the substance in a glass tube with a bubble on the end, but this is what you shouldn't do, cause the smoke is unpleasant tasting (rather very salty), I found it much more pleasant to put the dose on top of a bowl of cannabis, taking big hits, and holding them in as long as possible. The cannabis seems to mask the taste, and I've found cannabis to enhance the trip very very well. I've found the effects/duration of smoking it to be much different then oral. The trip lasts shorter (3-5 hours [constantly smoking cannabis when I'm coming down seems to extend it though]). Come up is muuuch quicker (getting some good visuals in 10 min), body bake is about the same, sometimes stronger if smoking the whole dose quickly. Some friends and I have found it to be less stimulating, however other friends report same amount of stimulation. Some users report much heavier visuals and body bake in comparison with the oral methods.</p><p>Oral method #1 - Shots? - My Favorite oral method. I've found putting the dose of 2C-I in a shot glass, then putting water or gatorade in, stirring it up, and downing it to be much more efficient then the gelcap, for one reason, it kicks in considerably faster (at least for some). Feeling first effects in 30-45 min on a empty stomach, however some friends report it taking longer.</p><p>Oral method #2 - Classic Gelcap - put dose in gelcap, take gelcap on empty stomach, and one can start to feel effects in about an hour and 15 min to 2 hours. Effects last 5-8 hours. </p><p>My main point was to get the smoking method out, cause there was really lack of info on that. And as a few notes, for oral doses, I take it on a empty stomach. Smoking it doesnt really matter if you ate or not, and Smoking cannabis has brought trips back while people are coming down, and can really enhance the trip.</p>"
}
