{
 "title": "A Bit Different",
 "author": "Archenteron Crisis",
 "citation": "Citation:   Archenteron Crisis. \"A Bit Different: experience with Wormwood & Cannabis (ID 31133)\". Erowid.org. Jan 12, 2007. erowid.org/exp/31133",
 "substance": "Wormwood & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Wormwood",
   "(leaves)",
   "  T+ 0:15",
   "1 bowl",
   "smoked",
   "Wormwood",
   "(leaves)",
   "  T+ 0:45",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31133",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2007",
   "Views: 10915",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo last night I went to this new place in Vancouver.  I won't give the name of it in order to protect it's identity, but most Vancouverites would be able to find it if they looked enough.  I degress.\r\nAfter searching through the many different herbs and herb extracts available, I decided to give wormwood leaves a try.  The dealer claimed that the substance could be brewed into a tea using 7 grams per cup, or smoked on the same level as marijuana.  The expected effect, I was told, was something similar to a cannabis like high.\r\nSo I bought 28 grams for a VERY cheap price ($2.52 canadian, which is approximately $1.75 american) and smoked a bowl full of it in a pipe.  The bag smelled absolutely FOUL.  I would compare the stench to sweaty socks or an old gym bag.  But the taste of the smoke was actually quite pleasant, both to the tongue and the lungs.  I would describe it as a combination of wood and flowers.  It's not unlike smoking some sort of floral incense.\r\nAfter about 15 minutes and not noticing ANY effect, I smoked another bowl.  15 minutes after the second bowl I did indeed begin to notice cannibs like effect, but in a different way.  I am a HEAVY cannibas user, somewhere in the range of 1-4 grams a day, and I feel I can safely say that while the effects of a gram of wormwood were like cannibas, they were also very unlike any cannibas high I have ever experienced.  \r\nPersonaly, most cannibus highs I experience are generally a sort of relaxing 'downer' high.  Very mellow, very intense but also with an effect of having energy sucked out of you.  The effect I got from the wormwood was that of a mellow 'down', but also mental clarity and increased energy at the same time.  I would compare it to a very large amount of yerba matte.\r\n30 minutes after smoking the second bowl of wormwood, I decided to smoke a full gram joint of marijuana to see what the effect would be.\r\nIt was absolutely outstanding.  It pushed me right to the threshold of visual hallucinations, ie 'tracers'.  I would notice things in a different way than before.  The best way I can describe it was that I was in a very familiar setting, yet I felt as if I had never been there before.\r\nInformation on smoking wormwood has been extremely difficult to locate.  I know that drinking large amounts of absinthe over a long period of time can lead to absinthia nervosa, but I have yet to hear any positive or negative health effects of smoking wormwood.\n\n\n"
}