{
 "title": "A Simple Man in a Cardboard Cutout Universe",
 "author": "Joshua",
 "citation": "   Joshua. \"A Simple Man in a Cardboard Cutout Universe: experience with Diphenhydramine (ID 31134)\". Erowid.org. Nov 13, 2007. erowid.org/exp/31134",
 "substance": "Diphenhydramine",
 "bodyweight": "143 lb",
 "header": [
  [
   "DOSE:",
   "16 capsls",
   "oral",
   "Diphenhydramine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31134",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 13, 2007",
   "Views: 7480",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThere I stood, ladies and gentlemen, there I shook.  While walking around my local grocery store, I glanced to what I thought to be just your everyday, average sleep-aid.  Wrong.  I had heard stories of this drug, and what sort of person it turns you into.  Not being one to easily buy into the hype, I set out to prove those harsh-speaking naysayers a thing or two about drugs, and their effects on the fragile human body and soul.  I purchased a bottle of thirty-two soul destroyers, blue as the summer sky.  How can these be bad, I casually thought to myself, the colour seemed so inviting.\r\nI dropped 16 with an energy drink, to keep myself awake.  It was a sleep-aid after all.  For thirty-four minutes, I was a super-hero, and my special power was the ability to be sicker than any human being that had, does, and will ever exist.  I swore to the big guy and myself that I would never be caught dead doing this a second time.  Fourty-three minutes later---zero hour.  I was officially taken from my humble universe and displaced into another where I spoke my own language, and perceived things others could only hope to dream about.\r\nIt started off simply enough, with the leaden legs, and general grogginess.  After battling through around twelve minutes of that, I began the insanity.  My first noticable sign that I had lost my mind, were the sounds.  Dogs barking, sirens, yells, crying, voices, car horns, all so vivid.  So 'real'.  I would always investigate these noises, thinking myself to still be sober.  How horribly wrong I had been.  Upon scrutinization of said noises, I found only air, nothing in close proximity that could have possibly been making those noises.  No cars, no dogs, no people, no self assurance.  It took a good hour to realize that the sounds were all in my head, but now I had more pressing matters to worry about.\r\nI will now describe to you, what I affectionately call 'The Pickups'.  The pickups go like this: I see a random object, a magazine, a glass, a bit of string, a hair, a rubber ball, whatever it is, I am entranced by it, it sets itself apart from everything around it.  I want, no, have to pick it up, or all will never be right with the world.  When I go to grab the object, one of two things happens.\r\n1.  It squiggles away, just barely out of my reach\r\n-or-\r\n2.  It disappears entirely.\r\nThis can be quite unnerving, but not nearly as bad as the television.  I sat for around two hours watching what I thought to be my favorite television show, but then I realized, it was only static.  I had become the crazy person in the back of the asylum, trying to get out of their own head.  Random people would call, I would answer, only to realize I was not holding the phone, and would have in depth conversations with people who were not actually there.  The people remained constant as well.  Turning my head, or closing my eyes did not help, they remained.  It even seemed as though they could be touched, but I know this to be a fallacy.\r\nI eventually fell asleep, never dreaming.  I awoke the next morning still hallucinating, but not as vivd as the night before.  If life is to boring for you, and reality seems like too much of a chore, I strongly reccomend Unisom.  But be prepared to tear your universe a new asshole, and kiss your preconceptions goodbye.\n\n\n"
}
