{
 "title": "Happiness is All I Know",
 "author": "Twig X",
 "citation": "   Twig X. \"Happiness is All I Know: experience with 2C-I (ID 31165)\". Erowid.org. Feb 24, 2004. erowid.org/exp/31165",
 "substance": "2C-I",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "17 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31165",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 24, 2004",
   "Views: 8940",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had planned to take a dose of 2C-I with a friend of mine at midnight on a saturday. We had been planning it all week so we had been well prepared for the trip. Neither of us ate for four hours beforehand and I was in a very good mood. The room we were in was very dark with the only lights being blacklights that were shining on psychedelic posters. The stereo was full of various Pink Floyd cds that were playing on loop. </p><p>I am fairly experienced with psychedelic drugs. I have done LSD, DPT, 5MeO-AMT, and 4HO-DiPT before several times. I have also done various other drugs such as cannibis, painkillers, and alcohol. However, I have never done a phenethylamine before and was very excited and somewhat nervous about the experience.</p><p>We both took the capsules at approximatly midnight and sat down to wait for it to take effect. I began to feel effects after about 40 minutes after taking it. The first thing I noticed was the standard stomach tension and jittery feeling I always get with psychedelics. Neither one of us were talking to each other, we just sat in silence. I noticed that the floor was beginning to take on 3 dimensional textures and that the bed was moving around quite a bit. The come up was very soft and mellow with this drug, and it didn't shock me when I was peaking as DPT does. </p><p>Compared to tryptamines, this was quite different. The visuals were not as crisp and clear as with the other substances I have done. Usually I see spirals of color and fractal worlds and so forth, and the patterns are clearly defined. With 2C-I though, it was more of a blur of color and a maze of movement. Also, I was not bursting with absurd ideas and theories about life and the universe as with tryptamines. Instead, I was thinknig somewhat clearly and was able to communicate pretty normally. The other difference was the body feeling. Instead of just a tense feeling, I was hit with an astonshingly amazing body feeling. With every beat of the music, I was filling with a tingly warm feeling all over my skin. </p><p>These effects continued for about 2 or 3 hours after taking the drug. Then we sat down to watch a movie, The City of Lost Children. It was very frightening and quite hard to handle although we were laughing almost constantly though it. Then we played Grand Theft Auto and laughed until our sides hurt. The drug seemed to fade away slowly after about 5 or 6 hours, and all effects were gone after about 7 hours. Overall it was an intensely beautiful experience. There was no such thing as sadness in my mind at the time. I could only think happy thoughts. 2C-I was much less mind-opening than the other psychedelics I have done, however, it was the best feeling and the one of the most beautiful. I would recommend this drug to anyone with an interest in hallucinogens. I would definatly do it again if I was given the chance, and I also think that the dosage was a very reasonable one for someone with my body weight. I am writing this the next day and I still feel very happy and optimistic. Wonderful!</p>"
}
