{
 "title": "The Wonders of Painting While Tripping",
 "author": "'DARIUS'",
 "citation": "   'DARIUS'. \"The Wonders of Painting While Tripping: experience with LSD & Mushrooms - P. cubensis (ID 31182)\". Erowid.org. Nov 13, 2007. erowid.org/exp/31182",
 "substance": "LSD & Mushrooms - P. cubensis",
 "bodyweight": "139 lb",
 "header": [
  [
   "DOSE:",
   "3 drops",
   "oral",
   "LSD",
   "(liquid)",
   " ",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31182",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 13, 2007",
   "Views: 6462",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFor the past 5 years, LSD in San Diego has been non-existent. From what I know, ever since the rainbow brothers got busted in SF, trafficking LSD down here has been scarce. Lucky for me, old friends I have in El Centro spontaneously pick up vials of mediocre acid from unknown resources. I dont give a fuck, I just want what I have longed for, since my last experience in Feb. of 99'. As soon as I got off the phone with my old buddy, I gathered a few of my close friends down here and we drove up there. It was a non stop party as soon as I got there until I left, I guess thats the way they live, and are able to live considering they own their own skateboarding businesses, or are professionals. So, buddy M, after smoking a few bong loads, calls 'T' into the room, and 'T' is holding 3 vials in his hand, and a blotter sheet in the other. I screamed with excitement and handed the man 110$ for one of the vials. I contemplated on whether I should do it then, or save my long reunion for when I'm home. That idea lasted about 5 minutes when I dropped 3 hits onto my tongue and exhaled.\r\nOne of the friends I brought with me from SD was a mushroom dealer for the current season and he had about 2 O's on him, so I asked to buy a couple grams to go with it, he gave me a little less then an 8th, and said I was crazy, but I usually eat around 8-10 grams of the cubensis, so I didnt have any kind of paranoia as to what my trip was gonna be like. I am pretty accustomed to hallucinogens, and can handle overwhelming mind experiences. About 30 minutes later, I started to feel the threshold effects of the mushrooms, my chest felt a little tight, but it was all familiar shit. About 15 minutes after that, booomm, the acid hit me with an overwhelming wave of unconciousness, almost like I was going to pass out, but only lasted a few seconds, thats when shit got cool. I started laughing and couldnt stop grinning because I knew what I was in for.\r\nThe same ripple of unconciousness overpowered me again, and at that moment, I knew I was gonna fry balls. A couple minutes passed, and I was feeling the coming up stage. I am very excited, and in good spirits with myself. Everything in my perivial view began to take motion, and this is when I thought it would be a blast to paint with M's fluorescent/neon acrylic paints. I am an artist myself, in fact thats all I really do is paint, so I thought that if I had a great time painting on mushrooms, acid and mushrooms should be that much better. As I floated towards his Easel, trails that resembled the sun-rays on the Japanese war flag appeared. The pigment in these trails changed frequently, and almost covered my whole field of view.\r\nI had to sit down for a minute. Now since LSD is very good at making my mind race, I had totally forgotten when I had planned to do before the interruption, which caused me to sit there for about 10 minutes thinking about why people take walks, and other random shit like that. M's room appeared to be underwater, since everything was waving back and forth slowly like we were under water, the walls grew higher, then smaller, then would appear as a large bubble, having the center of the wall, pulled closer to my eye, and the edges of the walls looked as if they were almost round, and far away. My friend asked me to paint him something, so then just hearing the word paint something, gave me the greatest sense of joy and belonging, because art is the only thing that comes naturally to me, and it is the only outlet I have besides mr. hallucinogen.\r\nI smiled as I grabbed the fan brush, and the metallic blue tube of paint. I started off by stroking the paint back and forth with the fan brush, to get the brush completely covered with the paint. the paint was so illuminating I could hardly look at it, I stood there for a while, it felt like a few hours, but it was just a minute or two, then M says, hurry up man, and I just couldnt get my mind off random shit, to I put the brush on the canvas, and began to paint checkered patterns using another florescent green color. To my surprise, every stroke I made on the canvas caused a tingling sensation to ripple throughout my body, and it felt so good. Each time I would have to pause for laughter.\r\nPast experiences reminded me that its a lot easier to paint on hallucinogens because when I imagine something, I see it on the canvas, such as faces, patterns, etc. So I concentrated on the canvas, and clowns began to appear. I put the paint down, and grabbed a pencil, this is when your creative mind is most effective, I began to trace out my hallucinations on the canvas, and everyone couldnt believe I could draw so good, but it was pure tracing, when I visualized something on the canvas, it would stay just long enough for me to get a rough sketch of it. I couldnt really notice the mushroom effects, besides the distinctive pulsations of random objects, and the focus factor with my pupils. to make a long story short, I proceeded to sketch everything I saw on the canvas, until my concentrated composition was complete, it was the most insane surrealist painting I have ever created, and won me 250$ in the 'So Cal. Regional Award Show' it is titled, 'my boot-snake-elephant'.\r\nThat LSD experience was a marvelous reunion with myself on acid 4 or 5 years ago, it brought back a lot of familiar emotions and visuals, and was a theraputic critical journey through the deepest crevasses and pits of my subconscious creativity, this encounter with what I am really improved my ideas and creativity afterwards, in all of my artwork. LSD gave me a stronger connection to myself then I could possibly have, now my imagination is so broad, its hard to decide on what to paint first, because of all the ideas I subconsciously create and see. My visualization of my imagination is so efficient now, that I can draw or paint something, EXACTLY how I originally imagined it, in my mind, which contradicts, every bullshit theory society has on what LSD does to you.\n\n\n"
}
