{
 "title": "A Mild, Mild Sedative for All the Family",
 "author": "Antenor",
 "citation": "   Antenor. \"A Mild, Mild Sedative for All the Family: experience with Wild Lettuce (L. virosa) (ID 31285)\". Erowid.org. Feb 18, 2005. erowid.org/exp/31285",
 "substance": "Wild Lettuce (L. virosa)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Lactuca - L. virosa"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31285",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2005",
   "Views: 41687",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt can be really hard to find lactuca virosa aka wild lettuce anywhere unless you ask for 'wild opium'. That's what they call it. I wonder why? It reminds me more of valerian root than it does of opium... oh, well... Anyhow, I must confess I enjoy this close relative of our common European lettuce. I often (2-3 times a week, perhaps) smoke it in the form of joints. I find it's too much of a hassle to smoke it in a bong, since quite a lot must be smoked to achieve any significant effect. <br>What effect? Well... mostly a slight light-headedness, a feeling of relaxation, which does not impair cognitive faculties (as far as I'm aware). I generally use it when I'm slightly stressed. I smoke a joint or two and get back to my books. I also think it somewhat enhances music appreciation, but maybe I'm just fooling myself. On the whole the effects are so slight it takes a while to actually notice them. <br>I think this is a useful herb, but definitely not a party drug, or an easy pick-me-up. The bad side is the smoke is really bitter, which is why it makes a terrible tobacco substitute in ganja joints (it even burns very differently). Really. And I should recommend processing the dry leaves before smoking, because the packets you can find on the market are full of twigs which are really harsh to smoke. <br>Two other methods I've tried are also worth mentioning. The first is brewing a tea (for this I simmer some grammes of the stuff in  water for 10 min. and then leave it to rest for another 15). It's quite drinkable (tastes a bit like spinach), and might contain some vitamins, but I don't think it's very effective. <br>The other method is making an extract (I believe it's called 'lactucarium'). I made it by leaving the dry leaves (1 part of leaves for 2 of liquid) in a bowl filled with water over night. The next day I let it evaporate, by heating it on a very, very low flame (don't let it boil). What I get at the end is a sticky substance that looks a bit like opium, but smells like licorice and tastes oh-so-bitter. The problem with this stuff is that it's difficult to smoke, since it doesn't seem to burn easily, even when it gets drier. I used a bit of it as I would hash and it seems to strengthen my regular lettuce joint, but not much... <br>On the whole, I think the extraction method is too much of a bother, and the end result is not worth all the effort. Use lactuca virosa to relax, as you might drink camomile, and with time you'll come to appreciate it. Just don't expect too much from it and don't think it'll get you 'high'.\n\n\n"
}
