{
 "title": "Drunker than Drunk",
 "author": "desperate psychenaut",
 "citation": "   desperate psychenaut. \"Drunker than Drunk: experience with Diphenhydramine (ID 31317)\". Erowid.org. Jul 12, 2006. erowid.org/exp/31317",
 "substance": "Diphenhydramine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31317",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2006",
   "Views: 21574",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOn a chilly, boring February evening, my friends A. (male, similar size/build to me) and I met up at L.'s dorm, with the intention of getting fucked up.<br>[T+0:00] A. and I each took 600mg of CVS generic-brand Benadryl (25mg/pill) with respectable quantities of water on fairly empty stomachs.  This was A.'s first time trying Benadryl; I had done this three or four times before.  L. abstained; I had warned her that the Benadryl experience was powerful and unusual, but not necessarily pleasant.  The three of us went on a short walk to give the drug time to absorb.<br>[T+0:45] Having returned from the walk and settled into L.'s room, we started to feel the effects.  A. was very silent most of the evening; henceforth, I will report on what I observed.  An initial gradual wave overtook me with a buzz similar to that of having a couple shots of hard liquor.  After several minutes, this wave resolved itself to a slightly strange feeling, best described as slight dizziness, mild hunger, mild nausea, and slight heaviness of the limbs.<br>[T+1:00] By this point, the body dysphoria had reached a fairly uncomfortable potential (the heaviness had reached the point of feeling like a mild uncomfortable pressure over one's body); A. was reclining, and I lay down on the floor and began to stare at the ceiling.  After a few brief moments, the ceiling started to fade from whitish to grayish.  Continuing to stare, I noticed a grid fade into view.  This grid of white, on the gray ceiling, resembled a large fish net; it was not a rectangular grid, but rather one that had been pulled and stretched a bit to give it several random angular warpings, like a carpet pulled in several places after moving pieces of furniture.  Overtop of the grid, I began to see small blobs of white that shone brightly for a second and then vanished again, creating a twinkling effect.  Eventually, I began to see large blurry lines that resembled out-of-focus lightning sparking across my field of vision.  These types of monotone imagery persisted over my field of vision no matter where I looked, but were most prominent when looking at simple expanses of one color or pattern.  Colors were brighter and more vivid; edges between objects were shadowed, similar to overlaying the output of an edge detection algorithm.<br>[T+1:15] Someone was flicking a brightness switch back and forth.  It seemed as if the entire room kept alternating between different levels of overall light.  Every second or so, the brightness of everything changed dramatically.  The physical discomfort by now could largely be ignored, but it was still present.  Xerostomic and diuretic effects began to set in strongly.<br>[T+1:30] My short-term memory became impaired.  I would be thinking about something, then suddenly I would forget whether I was thinking about it or talking about it out loud; thinking I had been saying it out loud, I would continue to speak about it.  L. would just ask, 'What are you talking about?' prompting a quick, 'Never mind...'  It was not that thoughts disappeared, but that meta-properties of thoughts were lost.  I could not remember if I had heard something or imagined it.<br>[T+2:00] By this point, my active thoughts and sensory information were thoroughly confused.  I could often not tell if something was real or in my head.  At one point, I watched some small white worm wriggling across the floor.  I tried to catch it, but then it disappeared.  Audio was recognizing incorrectly; in other words, I would hear something, but recognize it as something it wasn't.  I knew I had recognized it incorrectly, but I could not recognize it correctly, which was rather frustrating.  This began to happen with vision later, but my memory began to get very fuzzy at this point.<br>Sometime later, A. walked home.  He told us later that he would be talking to both me and L. while walking, then suddenly realize he was walking home alone and L. and I were still in L.'s room.  He also reports being unable to find his own room for a while, and at one point entering someone else's room because he thought it was his ('I couldn't understand why they put someone else's name on my door!  I figured someone just thought it would be funny to write the wrong name up on my door and take my name down.')<br>Whenever I got up to use the restroom, I would feel an uncomfortable heaviness at first, but then, if I simply ignored it and pushed myself harder, I could move and walk fairly well.  Everything seemed strange and out-of-place, but I could find my way reasonably well.  At one point, I forgot what month it was, and was hurriedly packing my stuff to go home for Spring Break.  <br>A. reports that he felt dizzy the whole evening, and spent most of the next day sleeping.  I managed to carry on two phone calls at about T+4:30 and T+5:00, although I confused the first caller with another friend of mine and said some things that didn't make sense.  Falling asleep was bizarre, because I would slide in and out of dreaming, hypnogogia, and waking hallucinations.  It was almost as if my mind was in a perpetual hypnogogic state.<br>I managed to make it to my classes the next day.  I simply felt empty during the first one, at roughly T+14:00.  I went to lunch at T+18:00 before my second class (which was around T+19:30), and my friends told me I seemed very spacey.  There were very light visual effects through the whole day, like whitish specks and streaks that would jump around sporadically, but my sense of my-vision-system-is-telling-me-the-truth was much stronger, and I was not mentally confused.  I think I was fully sober by around T+28:00 or so.<br>Overall, I would rate the diphenhydramine experience (in general) a C-.  Some of the visuals were very interesting, but I had no more than a few initial minutes of mental pleasantries, and the physical sensation was bizarre and confusing, leaving a foul taste in the proverbial mouth.  I would liken the experience to being drunker than drunk (but not really in a good way), or something like acute dementia/delirium.\n\n\n"
}
