{
 "title": "An Insane Amount",
 "author": "Equilibrium",
 "citation": "   Equilibrium. \"An Insane Amount: experience with Alcohol (ID 31326)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31326",
 "substance": "Alcohol",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 31326",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 14, 2007",
   "Views: 7943",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a crazy story about a drinking night gone horribly wrong. Me and my friends, we are all 17 and 18, decided to have a party on Halloween 2003. We got our hands on 4 fifths of Bacardi O and lots of beer. I had also snuck in a 20 oz bottle of Vodka mixed with wine I had stolen from my house. Ok at around 9:30 I began drinking the disgusting drink I created (vodka + wine). I drank the entire bottle in 2-3 gulps. At this time I was inexperienced in the amount of alcohol I need to overdose on it. I didn't feel anything at first so I said ok lets brake open the Bacardi. I remember pouring some Bacardi in a small glass and drinking it, mixing it with a 7-11 slurpee, mixing it with beer and taking shots of it. I also remember drinking several beers. The last thing I remember clearly was me turning to my friend and saying 'Man this is the most fucked up I have ever been in my entire life.'</p><p>The next thing I know I am waking up at 4:30 in the morning with my pants off. I am thinking to myself 'Oh fuck what happened?' I turned to my friend and said 'What the fuck man?' He just laughed at me. I stumbled my way into a car and got home, driven home by my still very drunk friend. Ok then I wake up in my bed feeling like absolute SHIT. I ran into the bathroom and puked. Then I started taking a shower and puked. I went back to bed and puked.</p><p>My parents didn't see me puking but they knew what had happened. My dad comes up to me and says 'What the hell happened last night? You came home with your dick hanging out of your pants and wearing someone else's shoes.' Apparently I forgot to zip my fly and I just grabbed a random pair of shoes from the party, they were girl size 6, I am size 12. I talked to my friends about the previous night and they told me that I was so drunk I passed out immediately, but not before mumbling some stuff in Russian (my native language). When I was passed out some girls stole my pants and I woke up and began puking uncontrollably. I was told by several people that I had puked on at least 10 different occasions that night.</p><p>I puked in a flower bed, outside, on some bed sheets, in the garage, on the drive way, and on some guy. When I was passed out my friend tried to move me to the garage because I was puking so much. While moving me he dropped me unto the floor and I had a bruise there the morning after. I was laying unconscious in the garage for hours just puking away. A girl gave me some blankets so I wont be cold but I just puked all over those. My friend gave me a bowl to puke in and I just smacked my face into it and passed out again. I also had some strange things in my pockets the morning after, my friends wet socks were stuffed inside my pockets, I also had a scratch on my cock (how the hell did that happen I don't know, but I sure want to know). </p><p>The morning after hangover was so intense that when I went to drink a glass of water, as soon as I drank half a glass I started puking it out. My stomach was incredibly sore as was my throat. My brain could not function right the morning after, on many occasions I had forgotten that I even drank last night but then I puked some more and remembered. Some people said I am luck to have woken up from that. I was later informed that I drank 'more than I've ever seen anyone drink in my life man'. For the next couple months the thought of alcohol made me want to puke again. My throat was so sore from puking that swallowing my saliva was extremely painful. During my 3 day hangover I must have puked at least 10 times, had very bad diarrhea, and got grounded for 2 weeks. </p><p>It was the worst time of my life. I am not much slower than I used to be, my grades dropped rapidly and I can't concentrate or pay attention nearly as well as I used to, I will never get back all those braincells I lost that night. I suggest to everyone NOT to drink with a ton of alcohol available and friends that are too drunk to care how much you drink. You should always have a limit, a given amount that you should never exceed. Or you will end up drinking yourself to death as I almost did.</p>"
}
