{
 "title": "Mushroom Cultivation - What Went Wrong",
 "author": "Chuck",
 "citation": "   Chuck. \"Mushroom Cultivation - What Went Wrong: experience with Mushrooms (P. cubensis) (ID 3132)\". Erowid.org. Dec 17, 2001. erowid.org/exp/3132",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2000",
   "3132",
   "Not Specified",
   " ",
   "Not Given",
   "Dec 17, 2001",
   "Views: 20727",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\nThis happened to a close friend of mine (seriously, it wasn't me), Ill call him F. You also must understand that finding mushrooms in our area is about as difficult as performing open heart surgery on yourself. </p><p>After F's second experience with mushrooms (the two were spaced roughly 3 months apart) F decided that he desired to explore the effects of mushrooms much more frequently then the availability in our small community would allow. Being an educated individual, he researched mushroom cultivation thoroughly and decided on using the PF-Tek method of cultivation. After ordering the proper materials required for the project he set out to grow his own personal crop.</p><p>You must also understand that F does not live alone, still in school he lives in a common household with several other individuals. There is S who was informed of the plan from the start because S is F's roommate. The other occupants B and M, were not informed of F's activities.</p><p>Well, time passed slowly and F's project yielded its first flush, a healthy one, approximately 30g dried. A few days after his first 5g dose (plus three test doses of 1/2g, 1g and 1 1/2g to insure safety and strength) he was left with 22g of suprisingly potent mushrooms.</p><p>F being a generous caring fellow offered these dried mushrooms to B and M. B and M did not appreciate the idea of mushrooms being cultivated in their household and threatened F that, if all 22g plus the terrarium were not gone in 24 hrs. they would call the police and have him charged.</p><p>So all of F's work and money was wasted as he burnt the 22gs in the fireplace along with all six of his substrate cakes.</p><p>\n"
}
