{
 "title": "The Ferris Wheel of Consciousness",
 "author": "Charlie McGee",
 "citation": "   Charlie McGee. \"The Ferris Wheel of Consciousness: experience with Salvia divinorum (ID 3134)\". Erowid.org. Dec 17, 2001. erowid.org/exp/3134",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3134",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 17, 2001",
   "Views: 16818",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy friend, whom I'll refer to as Bun Bun, suggested I smoke some Salvia. He said it was so 'fucked up' that he could only do it once a week. This coming from a human being that will consume any substance any time as long as it stood a slight chance of providing a buzz. I snickered with disbelief and told him I'd smoke it every day. </p><p>So after work around 12:30 AM I drove to his house and sat on his front porch. He packed a bowl and I smoked it. Two solid hits. Nothing. Not even a head change. He claimed all it takes is one good hit to fry. He took a couple tokes, and nothing. 'This is a bag of shit Salvia, Bun Bun. I'm not impressed with this garbage at all,' I said to him. He suggested I take bigger, heavier tokes and hold it down longer. I grabbed the mini-bong, packed it with more Salvia and flicked my light. 'The gloves are off this round, Bun Bun,' I said as I whipped the flame over bowl. </p><p>Immediately, I felt I had gone over the line. I blew snot from my right nostril and began coughing. From here, my memory from the incident is vague and jumbled and chronologically clusterfucked. I remember laughing uncontrollably, falling to my side, drooling down my face and feeling as if I was spinning very fast on a sideways cosmic ferris wheel. I told my friend Bun Bun several times to 'quit fucking with me' but looking back on it, I have a strong notion that I was talking to the Salvia, which by then was peaking. I kept laughing harder and harder, and for a tiny flash of time felt as if I was doomed to laugh forever, which brought on a vision of my parents standing over me, watching their son locked in some hysterical fit of infinte drug laughs. </p><p>The ferris wheel still turned. Now the scene began to come together. The bright lights of the carnival, the people waiting in line for their turn, my laughing, the red wood and Old West golden swirl decorations of the ferris wheel cars, the dirt ground, something wet on my arm and face- I heard Bun Bun's voice, or at least I heard him laughing at me, which I used as a rope ladder back to some sort of control. I was still laying on my side, and I made a conscious effort to lay on my back instead. </p><p>Finally, I told myself that if I could stand, I'd be in control. I stood. I was in control. I laughed it off though deep down I won't deny being a little 'whoa'...</p><p>Bun Bun seemed to find the entire ordeal very funny. He told me I was gone for about five minutes, though it seemed to last about thirty (long, psychedelic) seconds. When he recounted my actions, I remembered most of what he told me except for staring at him 'with this fucked-up look' on my face. I can't remember staring at him. </p><p>Overall, the feeling is indescribable.  I completely lost control, time perception and briefly, my mind.  All in all, a solid B+ on the fun scale, an A+ on intrigue. Gonna try it again tomorrow under more physically comfortable conditions (indoors, couch, music).</p>"
}
