{
 "title": "The Tunels Of My Inner Cortex",
 "author": "LooksLikeRain",
 "citation": "   LooksLikeRain. \"The Tunels Of My Inner Cortex: experience with 2C-I & Cannabis (ID 31346)\". Erowid.org. Nov 16, 2004. erowid.org/exp/31346",
 "substance": "2C-I & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-I",
   "  T+ 2:20",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31346",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 16, 2004",
   "Views: 5660",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was suposed to be like any friday I was suposed to dex with my friends and just chill out...wrong. </p><p>8:00- I ingest 20 MG of 2C-I </p><p>8:15- A warm awareness washes over me no noticeable affects but I do know that something is up.</p><p>8:45- P drops me off at my friend B's house and the group is reunited, so now its once again....Me T,J,B and H.</p><p>9:00- T and B have each ingested 350 Mg of DXM.</p><p>9:45- First noticable affects of the 2C-I are coming on strong now, lights are brighter and colors are brighter to.</p><p>10:00- we are in J's house when my Friend D comes over with the car. H and I are both on are way up with the effects of the 2C-I hard to ignore.</p><p>I am getting tracers and patterning extremly intense CEV's.</p><p>10:20 in D's car with me and H, H points out the street lights and we both stare at the luminecent ball of light that is exploding rays in every direction spinning around the light and then sucking back in we marvel at this is know we will be peaking soon. We smoke about 3 bowls and drive back to J's house to pick up J, T and B</p><p>10:30 H and I are just about peaking and we get back to J's house and I find out that both T and B are peaking on the DXM just as we peak on the 2C-I. </p><p>10:45 We are all in D's car and I have my eyes shut marveling at the CEV's. I am wondering around the tunnels of my mind. Psychedelic caverns with ever moving walls shifting and melting into each other. very intense.</p><p>12:00 just me and B at my house. We talk about whats on his mind and whats on my mind.</p><p>1:00 B leaves and I am alone, I decide to try and get some sleep even though I am still tripping.</p><p>3:45 Last time I checked the clock before falling asleep. I have a few very detailed dreams and wake up in the morning with a slight headache but feeling good and rested.</p><p>All and all this was a wonderful new experience. 2C-I is a very warm and comforting chemical and I cannot wait to try it again.</p>"
}
