{
 "title": "What a Bore",
 "author": "Math+",
 "citation": "   Math+. \"What a Bore: experience with Alprazolam (ID 31352)\". Erowid.org. Dec 1, 2007. erowid.org/exp/31352",
 "substance": "Alprazolam",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31352",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 1, 2007",
   "Views: 25927",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI got ahold of 60 2mg generic alprazolam.  I am 105 lbs (48kg) and a very experienced drug user.\r\nI took a 2mg bar in the evening, noticed some interesting color enhacements on the blinds in my apartment, and the next thing I knew I woke up 14 hours later.  According to my lover, I sat down on my bed, and within 15 minutes I was snoring.  I was still drowsy when I woke up.  I had to drink a lot of coffee.\r\nThree or four days later my lover and I each took a 2mg bar at the end of an MDMA roll.  It made me feel extremely uninhibited (though I feel I am generally open), but very zombified.  We had wild sex for about an hour and a half; my lover remembers none of it.  I remember what we did and in what order, but have no real connection to the experience.  Somewhere in the middle of it I told my lover to stop doing what he was doing at that particular moment, and he either took this to mean 'no more sex' in general and fell asleep, or he just fell asleep in the middle of having sex.  I fell asleep, woke up feeling like a zombie.  Not an especially bad feeling--just completely moodless and chemically blank.  Boring.  My lover hated it, talked all day about how much the Xanax had fucked him up.\r\nI know there's an immediate recreational tolerance.  The next day I took 1mg in two .5mg doses and felt the vaguest hint of the zombie blankness, but virtually no other effect.\r\nThen I got really sick and started using 2-8mg a day to calm my symptoms.  It worked great for that, because my usual remedy is pot, but I had (and have) this massively swollen throat prohibiting smoking, and making brownies, etc., a pain in the ass to swallow.  The Xanax actually made me feel much better than smoking dope while sick ever has.  I still stayed in bed and rested, but I felt a lot more normal.\r\nDuring the higher doses I've taken throughout my sick state (a 6mg day right after a 2mg day produced marked recreational effects), it made me feel clumsy, which I guess was a little fun--it's sort of fun to collapse on my soft bed after stumbling around the room spilling my thermos and stuff--but, I mean, it's not THAT fun.\r\nOne day when I woke up feeling really, really sick, I took 1mg and my lover took me for a drive and played me a mixtape.  For about 30 minutes, I got pleasant visual and aural enhancements, but they were pretty minor.  It was more fun because my lover took me out and played me a mixtape than it was from the drugs.\r\nI've combined Xanax several times with Soma (carisoprodol).  This enhances the muscle-relaxing effect and makes me drowsy.\r\nAll in all, Xanax has helped me a lot through being sick, but recreationally, my opinion is that it is a very boring drug.  I am hoping to get some Valium soon; I took a lot of it in high school and remember having a lot more fun.\n\n\n"
}
