{
 "title": "Amazing Stuff",
 "author": "K",
 "citation": "   K. \"Amazing Stuff: experience with Cacti - T. peruvianus (ID 31386)\". Erowid.org. Mar 16, 2004. erowid.org/exp/31386",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "158 lb",
 "header": [
  [
   "DOSE:",
   "37.2 g",
   "oral",
   "Cacti - T. peruvianus",
   "(ground / crushed)",
   " ",
   "2.0 g",
   "oral",
   "Vitamin C",
   " ",
   " ",
   "50 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31386",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 16, 2004",
   "Views: 9533",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is the report of my second Mescaline experience. I have fairly large experience with psychidellics and substances, having used DMT, LSD, Mushrooms, LSA, MDA, MDMA, cannabis in every form imaginable, as well as other less interesting substances such as benzodiazepenes, opium, synthetic opiate analgesics, and various stimulants including cocaine and amphetamine. My first Mescaline experience involved peyote buttons, however it was far less enjoyable of a trip, I felt, because of the negative body load, and the downright horrible taste of the peyote buttons. This experience was far, far more enjoyable, as I better knew what to expect and was in total control. On the Shuglin scale, this experience was about a +++ at it's most intense points, and a ++ otherwise. The following text I wrote while still under the effects of the mescaline (written somewhat after the peak). It is comparing mescaline to mushrooms (I didn't feel I could practically compare mescaline to LSD, DMT and so forth). My mescaline stream of consciousness follows:</p><p>definite intensity (what light is present is amplified greatly) incredible depth, vibrations everywhere, pulsations too.....like the mushroom of the desert, definite amazing visuals, smiliar mushrooms in many ways....difference is in pattern styles (mesc is more aztec-style patterning) mesc red and yellow amplified, green  and blue subdued</p><p>mushrooms-> green and yellow amplified, with blue intensified as well, red is deadened</p><p>body buzz (comparative)</p><p>Mescaline body buzz similar to strong hash body buzz combined with medium (2.5-4.5g) of good quality mushrooms, however far less narcotic, much more stimulating</p><p>Definite electric body buzz (Ecstasy feels like weak mescaline)</p><p>slight headache...hypoglycaemia-related, slight stomach discomfort hypoglycaemia related after hour 3, mescaline absorption related before hour 2, one hour no discomfort, the hour between 2...uh...and 3....no problems then....now....some munchies are in top priority now...that and some quality television</p><p>Additional substances</p><p>Nausea controlled from the beginning and further controlled through limitation of any intaken substances/sustinance...dramamine was a must (50 mg) ...phenobarb (360mg) on standby if trip got bad ---no indication of trip becoming bad @ any point in the near future..phenobarb no longer needed...returned phenobarb...would have rather had clonazepam or diazepam on hand to deal with emergencies</p><p>high vitamin c intake...consumed ground cactus powder in 500mL orange juice and took 2000 mg vitamin c with cactus mixture </p><p>mental buzz similar to good quality mushrooms in 2.5g or greater doses</p><p>very high mood lift (ecstasy feels like weak mescaline)</p><p>kind bud amplifies/activates the trip</p><p>fiends for the green everywhere</p><p> could have ended a debt...forgot about $$ in pocket..saving it.....might as well.........a stitch in time saves nine....once again the concept of psychidellics and alcohol don't mix came into play here....drunkened people much less interesting...however drunk is fun too....in different ways....definite mind candy like mushrooms or quality hash oil, LSD and the like </p><p>going to get some food stattt</p><p>television following that</p><p>nothing complicated (the concept of using an oven is still going to be tricky at this point)</p><p>Compared to  ~25g peyote, similar strength, however peyote had far stronger body load and *far* more unpleasant taste</p><p>----------------------------------------------------------------</p><p>The stream of consciousness ends here.</p><p>Some notes, I only had phenobarbital on hand in case things went badly. I am unsure of how effective it would have been though. When this stream of consciousness was written, I was well on my way down from the peak. At the peak of the experience, my thinking was far more abstract and creative. This was single-handedly the best experience I've ever had. Unfortunately, the experience was dampened somewhat by the fact that only one other person with me was on a psychidellic (2.5 g mushrooms), the rest were drunk. Drunks really are boorish, in a lower mental state, really. However, I was in a good setting and maintained an excellent mindset throughout the trip, which helped. I also ate very lightly before taking the cactus-orange juice mixture just to prevent any possibility of nausea. All in all, a truly enlightening experience that will soon be repeated, preferrably away from alcohol fiends.</p>"
}
