{
 "title": "The Sensorum",
 "author": "Featus",
 "citation": "Citation:   Featus. \"The Sensorum: experience with Inhalants - Butane (ID 31384)\". Erowid.org. Jul 10, 2006. erowid.org/exp/31384",
 "substance": "Inhalants - Butane",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31384",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 10, 2006",
   "Views: 22521",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nI have taken several drugs that induce hallucinations including Psilocybin, Dextromethorphan, and MDMA. \r\nButane is a powerful substance and one of my best friends seems to hate its effects. The famed zum-zum-zum is perhaps the most commonly understood description of its effects, and those who have done butane will know what I mean. But being very analytical of drug experiences I will try to go into a bit more detail.\r\nUpon inhalation, which usually occurs in my bathroom with the fan heater switched on to cover up the noise of the can, several things happen immediately. The noise that the fan heater makes somehow seems to get faster and gain a higher pitch. The best way to describe this is to compare this to the noise a train makes slowly taking off in a subway and within the space of a few seconds, rapidly accelerating into the tunnel.\r\nMy body straight away begins to feel a familiar sense of tingly warmth. I can feel it in my whole body. It takes over my tactile sensations and I just flow with it. The tips of my fingers and the inside of my mouth feel like theyre made out of cotton wool and when I exhale my first toke I just know its butane.\r\nTo experience the more subtle effects, which for me are what make butane such a unique and wonderful substance, I need to take three or four more tokes. This is when the hallucinogenic properties kick in. Everything lights up. Everything I look at becomes a brilliant geometric clockwork of shapes, swirls and sharp edged notches. Its impossible to describe and its impossible to isolate or concentrate on any one particular part of the butane kaleidoscope. I cant encapsulate anything I see in my minds eye for even a second. It seems to change faster than I can see or think. Everything almost seems to dance, beautifully timed, rhythmical and systematic. The most miniscule parts of the most ordinary objects seem like Im magnifying into their existence and seeing the most delicate intricate details of their construction. Its like being inside a clock tower and seeing thousands of perfectly interlocked wheels, pulleys and levers working together in brilliant harmony.\r\nAnd then the sounds. Apart from the constantly accelerating train sound I cannot hear anything else. All the sounds that occur within the butane sensorum are inside my mind. Again they seem to flow and dance and its absolutely impossible to recreate them (even in my mind) because they change faster than I can perceive them. These are sounds that I would never hear in real life. Waveforms that I dont think even exist, and they are not even sounds as such, but hearing would be the most relevant of the senses and so my mind automatically dumps these pseudosounds into the auditory section of the neurological 4-tuple. These pseudosounds flow and interlock with all the visionary perceptions than I experience and to top this off all I have to do is move my hands or fingers in front of me and I become wholly integrated into the butane theatre. Every movement I make will correspond with what I see and hear. It feels like a dancer who has been rehearsing for years just to get every millisecond of his dance timed to perfection. And of-course if I become overly aware of my random gestures I will once again see that its all inside my mind. Concentrating or isolating in an attempt to understand or remember this mind show is impossible. All I can do is flow with it.\r\nMeanwhile this is all happening, I experience what I call hyper-thoughts. This once again is indescribable and must be experienced as a whole, rather than attempting to break it down analytically while its happening. But Ill try to explain exactly what I mean. \r\nMy thoughts are being created and processed seemingly so fast that I move from one thought to the next thought before my conscious mind can word it inside my head to make sense of it. I will find myself having wordless conversations that make perfect sense: asking questions, answering them, gaining insight into spontaneously created hyper-subjects and then just as fast dismissing my previous train of hyper-thought by what seems like a profound and solid explanation for what and why I were thinking only seconds ago. And superficially, of-course, any attempt to consciously make sense of what seemed like an entire conversation within the space of seconds, flushes all my hyper-thoughts out of existence leaving me with a dumb-founded and blank realisation that Im on butane. And that brings a smile to my face.\r\nIn a way this is similar to the mind-blank I get after too much MDMA, or the confused endless attempts to figure out the thing when Ive done too many mushrooms.\r\nOf-course the advantage is that its instant and gone out of my system within 5 minutes at most.\r\nIf I inhale too much butane from a prone position I may find myself phasing out of reality. This can seem like a somewhat unpleasant, viscous sensation. Almost like a mental quicksand with an increasing zum-zum-zum noise inside my head. Allowing myself to flow with this quicksand can result in two things. Either an extremely vivid butane dream (which is beyond attempting to describe  words can only do so much, and this experience is beyond words), or a complete faint. Maybe the faint is a direct follow-up of the butane dream, except that there is no memory of the dream. I suppose this depends on just how much butane one induces to get to this stage.\r\nButane does have unpleasant side effects as well. Sore back and spine, sore chest, difficulty breathing and difficulty getting an erection, among others. \r\nThen I must consider the damage it is doing to my brain cells and my CNS.  I feel tired and have a sore head for up to an hour after doing butane.\n\n\n"
}