{
 "title": "Alone Is Sometimes the Best",
 "author": "Jason",
 "citation": "Citation:   Jason. \"Alone Is Sometimes the Best: experience with Cannabis (ID 31389)\". Erowid.org. Mar 16, 2004. erowid.org/exp/31389",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cannabis",
   "(plant material)",
   " ",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31389",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 16, 2004",
   "Views: 10079",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've gotten high on weed several times in my life. It took me awhile to get rid of the paranoia that comes with it, but I think Im now pretty comfortable around other people while Im stoned - and by myself.  I was taking an electrical course and living on my own for the first time.  I bought a small $20 chunk off a guy in my class.  Very potent.  I was in a basement suite so I didnt want to make a stink (the landlady was upstairs), so I was thinking of ways I could injest it.\r\nI boiled up some milk, and chopped up a few small chunks of the bud into finer smaller bits and threw it in.  I kept it boiling for well over half an hour, thinking that it might take quite abit of heat to release the THC properly.  Well it was definately not as 'smell-free' as I thought it would be.  Oh well, I thought.. weed had just recently been decriminilized where I live so I didnt have to worry much.  I drank the milk/weed.  Didn't feel anything for half an hour, so I brought out the blades... \r\nI broke up 2 fair sized chunks and just about burned my lungs (ive never done blades by myself before, Im used to someone else serving me up).  \r\nI went to the bathroom, took a shit, and as I was washing my hands it was starting to hit me.  My tv was off.  No music was playing.  The lack of sound made me lose sense of time.  I couldn't tell if I was actually moving in slow motion, or if I was just perceiving it that way.  There was such an akward stillness in the air.  Sooooooo slllloooooow.\r\nI sat on the couch and turned on the tv.  The transition was amazing.  The very second the picture came on the screen (simpsons), I all of a sudden grasped my sense of time back.  My heart (which seemed to beat very slow before) had all of a sudden seemed 'real-time' which was actually quite fast.  It was very intersting how my perception of everything changed with the click of a button.\r\nMy mind was really starting to wander, something I avoided when I've been high with other people around me.  Thats what I liked about doing it alone.  I could explore my own ideas without the worries of looking like a burnout.  I layed down on the couch.  \r\nI've always been interested in philosophy's of time+space in the universe.  I started to really think about it..and the most unexplainable feeling came over me.  I want you all to think for a minute of what 'Infinite' actually means.  If theres any word in the english language that's extremely hard to grasp/imagine, it's that one.  Try to imagine an infinite number of universes - and the GIGANTIC size of our own that reaches out billions and billions of light years, and no matter how hard you try to imagine, the concept of 'infinite' is the biggest mindfuck I've ever come across. \r\nFor about 10 minutes, as I layed there on the couch staring up at the ceiling, I actually grasped what 'infinite' actually meant.  An infinite number of stars and life forms all of a sudden shot through my head.  Infinite possibilities of absolutely everything.  Everything existed at once, and forever.. infinately.  If our own universe has a boundary, there must be others beyond it.  There has to be.  It was an intuitive knowing because I FELT IT.  I felt like I finally understood.  I kept repeating to myself softly 'so this is what infinite means'.  \r\nI fell asleep unintentionally, still in the peak of my trip.. so I actually had some really trippy dreams that night, waking up once in awhile still admiring the beauty of 'infinite'.  I still do, to this day...  \r\nEver since that trip I have shown an interest in the stars.  I download Hubble Space Telescope pictures and cant help but admire the absolute vastness of space.\n\n\n"
}