{
 "title": "Bad Muscle Control",
 "author": "Apophis",
 "citation": "   Apophis. \"Bad Muscle Control: experience with Diphenhydramine (Benadryl) (ID 31387)\". Erowid.org. Aug 16, 2006. erowid.org/exp/31387",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "148 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31387",
   "Male",
   " ",
   "Not Given",
   "Aug 16, 2006",
   "9741",
   " "
  ]
 ],
 "report": "<p>I have previously taken about 200mg of Diphenhydramine in the form of Benadryl with much different effects such as a drunken tired feeling, intensified senses and such. I foolishly decided to take 300mg of Benadryl on one boring Saturday night.  </p><p>I took the pills at about 9:00pm and then ate dinner and settled down to watch a movie waiting for the pills to kick in.  I'm not sure exactly what time I started to feel the effect, but I guess it took about 45-60 minutes.  I felt pretty much the same as I did the previous time when I took 8 pills instead of 12.  A few minutes later really while watching my movie I noticed a delayed response when I felt like movie my body and being very sluggish like if I were in one of those rides that spins around and pushes you against the wall. </p><p>It became increasingly harder to move my hands and such as if my brain wanted to move them and my body didnt want them to move. I became a little scared by this, but I just blew if off as nothing.  Becoming increasingly tired as well, I tried to relax a bit more.  My right leg started twitching every now and then , but not just a twitch, more like a painful jolting twitch.  It would be impossible to just lay there in my bed if I couldnt stay still for over 2 minutes at a time so I decided to take a shower just to waste time and do something else, so I drunkenly walked to the bathroom seeing things being different sizes than usual and even moving.  </p><p>While taking my shower I felt much more relaxed and not as much worried about my condition so I stood there staring at the wall in front of me.  For some reason while doing this I blurted out a few word which I dont remember saying to some imaginary being.  I didnt notice anything unusual about this until a next day.  I finished my shower and wobbled back to my bed and a really felt like sleeping at this time.  </p><p>After a few minutes my leg began twitching again and also I noticed I was having trouble breathing.  This really scared me thinking that if I fell asleep I could stop breathing and not know it being sedated by the drug.  So I lay there dazed and trying not to worry hoping I would be getting better.  I soon found out that my leg did not twitch if I tried to sleep on my side and my breathing wasnt effected anymore so I decided to try and fall asleep.  I dreamt of talking just carrying out conversations with my friends ( I might have been talking in my sleep).  When I woke up I felt much better and not under the drugs influence anymore.  I feel so relieved now that it is over with.</p>"
}
