{
 "title": "Only Thought Will Exist",
 "author": "DMG",
 "citation": "   DMG. \"Only Thought Will Exist: experience with LSD (ID 31407)\". Erowid.org. Mar 1, 2004. erowid.org/exp/31407",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31407",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 1, 2004",
   "Views: 7940",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nOn Feb. 23rd, 2004, I ingested one hit of LSD. After an hour, I started to feel like  my 'soul' wanted to tear out of my body, this felt pretty chaotic, so I sat down to meditate and clear my mind. I stayed meditating for five hours straight. It was an extremely deep meditation, it is even possible that I could have fallen asleep, but I did open my eyes about every thirty minutes just to reassure myself that I was still sitting there. In this deep meditative state, this is what I saw...</p><p>(This is just a brief sample of the overall concepts that will need further explanation.)</p><p>I saw the entire history of humanity--from beginning, to the present, like as history textbook visually depicted throughout my sight.  </p><p>I experienced the birth and fall of countries,</p><p>I experienced the pain and suffering of humanity throughout time,</p><p>I pondered and imagined the future--what is the highest evolution of humanity?</p><p>I realized how this body and all of its maintenance/ methologics/ procedures/ and mechanical processes--such as eating, pissing, drinking, sex, washing, and shitting, chain down the psyche and pollute and corrupt pure thought. Once we are free from this body, only thought will exist. Pure thought without the chains of the body and all its weight, just may be the highest evolution of humanity. </p><p>What is pure thought?</p><p>Pure thought has no inhibitions (mental or physical), no negativity/pessimism (these are disruptive and vexatious to the 'spirit', they cause frustration and unnecessary conflicts).</p><p>Pure thought is just, humane, and has a well-balance of birth and death.</p><p>Pure thought is also being disconnected from this crude and ugly body, which is currently mere encapsulation and transportation for the beholder of pure psychic energy(a synonym for pure thought).</p><p>Pure thought is also disrupted and inhibited by drinking and smoking--which are petty little escapes that only get one by temporarily until the next time.</p><p>I have realized:</p><p>I need to take life more seriously.</p><p>I am now more humane (in realization of weights of the body).</p><p>I am now more optimistic (pessimism and negativity are weights of the psyche). Pessimism is necessary in keeping one from being naive, but it should only be considered, and weighed appropriately with optimism. </p><p>Only those who are weak, fail to allow optimism to succeed in their lives. Why be so negative when life is so short? Where will it get you? Like I said, pessimism keeps you from being naive, but you can simply be aware of the dark side to keep you from harm. I say 10-20% pessimism, 80-90% optimism. This will aid you in thought of the highest levels.</p><p>* This all seems ideal, but it has been emotionally charged by my unconsciousness for the benefit of at least myself, if no one else will listen. *</p><p>* Listen to your unconsciousness, do not fight it or block it out, it is only trying to help. *</p><p>DMG</p><p>25 Feb 2004</p>"
}
