{
 "title": "Tyrosine Used in Recovery from Hangover",
 "author": "Dave W.",
 "citation": "Citation:   Dave W.. \"Tyrosine Used in Recovery from Hangover: experience with 2C-D (ID 31413)\". Erowid.org. Mar 2, 2004. erowid.org/exp/31413",
 "substance": "2C-D",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "80 mg",
   "oral",
   "2C-D",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "24 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 48:00",
   "500 mg",
   "oral",
   "Vitamins / Supplements",
   " ",
   "  T+ 56:00",
   "  ",
   "oral",
   "Vitamins / Supplements",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31413",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 2, 2004",
   "Views: 14355",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently I met a fellow at a party, 'M',  who had twice tried some 2C compounds and experienced a nasty, long-lasting hangover.  He was able to treat that hangover effectively by taking supplemental tyrosine, an amino acid that is a precursor to dopamine.  Here is M's story:\r\nM is a male in his late 30's, about 180 lb, who has some familiarity with psychedelics (LSD and psilocybin mushrooms) as well as other mind-altering substances (nitrous oxide, DXM, cannabis, ketamine, salvia d., and on one occasion, MDMA).  He describes himself as being very sensitive to psychoactive drugs, and indeed all drugs in general.  His first experience with a 2C compound was to ingest 17 mg of 2C-I (along with a couple of beers and a couple lungfuls of cannabis smoke).  He had a fabulous time, likening the experience to a cross between LSD and MDMA, and had every intention of repeating the experiment.  However, within 48 hours after ingesting the compound, he began to feel tired and drained and hungry.  He felt as though he were sleep-deprived and 'fried'.  He was able to function, but was more or less continuously aware of this unpleasant hangover for a couple of weeks, even though he could tell it was slowly diminishing in intensity.  At three weeks he could still feel the hangover, and only after about four weeks were these unpleasant aftereffects gone.\r\nAbout eight weeks after taking 2C-I, M decided to try 2C-D, largely based on reports of 2C-D's relative lack of hangover and body load.  He ingested 80 mg of 2C-D (plus several hits of cannabis and a couple dozen whippets) and again had a fabulous time, which he said seemed to be pretty much in line with published reports on 2C-D and 2C-B.  However,  within 48 hours, the 'fried' hangover feeling again began to manifest itself.  At this point M started to think about supplements he might take to help his body repair itself.  There is a report of a person taking 5HTP after 2C-D, and experiencing hallucinations and other unwanted effects (http://www.erowid.org/experiences/exp.php?ID=4241).  So, M shied away from trying any 5HTP.  But based on the structural similarity between the 2C compounds and dopamine, M wondered if his use of 2C's had effectively depleted his body's dopamine in the same way that MDMA depletes serotonin.  \r\nSo, M tried taking 500 mg of tyrosine, which is an amino acid precursor to dopamine.  Success!  The nasty feeling went away within about an hour of ingesting the tyrosine.  After perhaps eight hours it returned, but he was able to banish the hangover and keep it at bay by taking more tyrosine.  Elson Haas, a well-respected holistic MD, states that 1500 mg of tyrosine may be taken daily as a mood-booster, so M felt safe in taking daily doses of 1000-2000 mg as a way to work through his hangover.  He also said that when he forgot to take his tyrosine, he could feel hangover effects for at least a month after having taken the 2C-D.\r\nM told me that he doesn't plan on any further experiments with any 2C compounds for a long time, if ever again.  He noted that Parkinson's disease, which involves changes in the brain's effective levels of dopamine, has been diagnosed on both sides of his family.  He thinks that his own internal dopamine chemistry might be rather 'fragile', and doesn't want to screw it up.  Maybe M is uniquely sensitive to the effects of 2C compounds.  But it seems possible that 2C compounds may affect dopamine levels in many people, and that only in particularly sensitive people like M will those effects manifest as physical symptoms.\r\nM said it was OK for me to pass along this information, and I hope it is of use to anyone interested.\r\npeace,\r\nDave\n\n\n"
}