{
 "title": "Too Much XTC for First Time User",
 "author": "Shady JT",
 "citation": "   Shady JT. \"Too Much XTC for First Time User: experience with MDMA (Ecstasy), Cannabis & Alprazolam (Xanax) (ID 31412)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31412",
 "substance": "MDMA (Ecstasy), Cannabis & Alprazolam (Xanax)",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 6:00",
   "4 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31412",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 14, 2007",
   "Views: 9162",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>All the research I did prior to taking MDMA seemed to indicate there were no such thing as 'bad trips' per say.  Overdose perhaps, but everyone I spoke with or read pointed to a pure 'love' experience.  Even my current girlfriend, who had taken MDMA many times in her past, agreed with everything I had discovered.  I decided it was time to take the plunge and try some.  I obtained 4 white doves (here in the States that's kinda rare).  I had also purchased a 'test kit' from Safe-Ravers so I could be sure these pills contained MDMA.  They sure did!  I was filled with anticipation and could hardly wait until Fri night!</p><p>We both took 1 pill each at 8:30pm by swalling rather than chewing.  Approx 1 hour later I was feeling very little, mostly just jitters and anxiety waiting for it to hit, while my girlfriend started to experience 'blowing up' and we had to walk.  Once we arrived back I took another 1/2, since I wasn't feeling anything from the first.  Well, patience is truly a virtue and I should have waited.  No more than 5mins passed and I too was blowing up.  I felt great and couldn't sit still.</p><p>The night went without too much problem until around 6 hours later.  My girlfriend was coming down and wanted to smoke some cannibas to help 'take the edge off'.  So I joined her.  Then we had sex.  This is where things went wrong.  She was still coming down, however I was far from it.  I started to see things, weird designs of color in everything.  I could hardly focus.  Everything seemed very surreal as though I was just watching a movie rather than actually there.  I was soooooo afraid of what I would do, and not even realize it until it was too late.  Hurt my girl, hurt my dogs, hurt myself.  I felt so out of control and confused.  I attempted walking around but this left me feeling as though my mind could not catch up with my body.  I would walk into my kitchen and pick something up, then suddenly I would realize that I was now standing in the kitchen and not in the bedroom.  It was bizarre.</p><p>I tried to lay down and stay still but that was so difficult.  My girlfriend was talking to me, telling me everything was ok and to breathe.  Apparently I kept forgetting to breathe.  The hallucinations were incredible.  At one point my girlfriend and I held a full conversation without every opening our mouths, until I realized it was really all in my head - which caused me to freak out even more in panic that I was losing my sanity.  Luckily for me (and I would recommend this for anyone) I had some xanex available.  I ate 1/2 of a pill and within 30mins or so (who knowz?!) I was finally asleep.</p><p>I'm not sure why this happened to me other than I took more MDMA than I probably should have, combined with smoking cannibas too early in the roll, I don't know.  I was under the impression that more MDMA just meant a higher roll, not a longer one, but the latter seems to be the case.</p>"
}
