{
 "title": "The World of Deja Vu",
 "author": "Blaze",
 "citation": "Citation:   Blaze. \"The World of Deja Vu: experience with Inhalants (Gasoline) (ID 31443)\". Erowid.org. Jun 20, 2007. erowid.org/exp/31443",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 31443",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 20, 2007",
   "Views: 4049",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nAbout 2 years ago, when I was 13, I went to my friends house to smoke he started huffing gas he passed the can to me. I guess I didnt take a big enough huff, so about a week later I decided to give it a try cause I was board out of my mind.  \r\nMy first couple tries, I noticed at first performance enhancing (or at least it felt the way) and anesthesia, euphoria, lightheadedness. I was soon psychologically addicted. My most fucked up experience was when I took around 5-10 huffs (I think) and held each in for a while. I was standing up and suddenly a lighting bolt struck the tree in front of me (no sound from lightning just normal buzzing noise) and then the tree my and the lighting just started spinning I thought I had died and gone to hell I was preying to god to let me live suddenly I forced my self to jolt and snapped out of it. Somehow I was still standing up though. \r\nAlso I noticed déjà vu on many gas trips I would get this thought stuck in by head that I had already done this and wondering why I was in the same place doing the same thing. Several uses after this I quit gas (thank God) and realized how fucking bad it is for me. Never will I try this again although I did love it.  My friend said that gas feels similar to dust. Most of my friends though make fun of me for doing this stupid act.\n\n\n"
}