{
 "title": "Mood Is Everything",
 "author": "Mysticide",
 "citation": "   Mysticide. \"Mood Is Everything: experience with Diazepam (Valium) (ID 31496)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31496",
 "substance": "Diazepam (Valium)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31496",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 14, 2007",
   "Views: 35998",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI don't want to go into personal details but I was feeling very used and not recieving any recognition for my valiant efforts and achievements.  To sum it up, I was being neglected.  So, I ended up sitting in my car listening to some music.  I was in a bad mood so I decided to take some Valium to calm me down.  I searched my car for some water or a drink to swallow the pills, but I found nothing.  Not wanting to go inside the house where the 'neglecters' were at, I remembered reading a report where the guy had placed the pills under his tounge untill they were in a paste form and then swallowed with barely tasting it.  I put both under my tounge and waited for them to break down.  About 5 minutes later, they are in the paste form and I swallow them down.  I had a little snack before hand but otherwise a pretty empty stomach, so they kicked in fairly quick.<br>Another 5 minutes later I start regretting ever coming to this house, ever giving my best efforts for people who wouldnt recognize my talent.  I begin to realize how weak my relationships with my 'friends' were.  I realize that they were not my friends at all, just people I can have a casual conversation with, no deep ties.  After all of this sinks in, I begin to cry.  I see my the overview of my life and realize what a failure I am and how everything is fucked up, that I'm just another kid who is making bad choices that will ruin his life forever.<br>By now I am balling, hitting the steering wheel out of frustration every now and then.  But then I realize it's the valium making me act this way, making me depressed.  I guess it was because it was the first time I had ever taken 20mg as oppose to just 10.  I use some breathing techniques to calm myself that I learned in Martial Arts.  Things begin to settle down.  I'm still in the mindset that I have no real friends and have a pointless life, but I'm beggining to accept it.  After it starts to wear down I realize everything I had thought of was bullcrap and my life wasn't that bad at all.<br>I had previous trips with valium and they were all nice, the usual 10mg dose, but they were different.  I went into the trip excited, wanting to relax and have a good time.  Indeed I did.\n\n\n"
}
