{
 "title": "The Circus of the Mind",
 "author": "Sketch",
 "citation": "   Sketch. \"The Circus of the Mind: experience with MDMA (Ecstasy) & Mushrooms (ID 31498)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31498",
 "substance": "MDMA (Ecstasy) & Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31498",
   "Male",
   " ",
   "Not Given",
   "Nov 14, 2007",
   "Views: 4389",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is just a short exposistory on my experiences into the mind expanding realm of enthogens. Its worth noting that going into this experience I was attempting to quit meth so that most likley played a large part in the images and mindset of myself during this experience. It all started on a dark September night with my two best friends A and S, they were preparing to do some MDMA themselves that night they had aquired from a seperate source well I was planning on a very introverted experience through the MDMA and Psilocybin.</p><p>The experience started off like any other typical MDMA experience for me with the usual tingles and oversensitivity of my body, at which point I injested the mushrooms. Upon the mushrooms hitting me a strange organic quality came about on everything, eveything I touched and looked at felt as if it was made of the same flesh and blood I was. It pulsed as my heart plused, breathed as I breathed, I felt as if I held merged with the planet and we had become one. In this state of extreme oneness for lack of a better word, S suggested we should continue further into the park and go sit by the drum circle that was going on this night, Me and A deemed this an excelent idea and followed her to the site.</p><p>At this point time become completely irrelevent to me. What was normally a long dull walk become a blink of an eye. To me it was if I never had walked there, I was already there as the world was. Upon arriving we layed down by the circle and I was forced to close my eyes by a sudden vast gravitonal pull. What I saw changed my forever. It was if I was inside a sphere lined with geometric patterns containg all varietys of pinks, reds and whites. But most importantly I saw my Anima, my very soul floating inside of this sphere, constantly eating and yet at the same time giving birth to itself. It was in a constant struggle against itself. It appeared as a crystaline beast, spraying all the colours of the universe from its body and yet at the same time vapourizing into a white gas. </p><p>It was at this point it made sense, meth was killing me. My own soul was ripping itself apart due to my vast abuse with meth, I was watching it disappear into thin air right in front of me and I could do nothing to stop it. I layed in this trance for who knows have long, but upon leaving it I felt as If I had been witness to some knowledge my unconicouness had been trying to pass onto me for eons and was finally able to due to my state of mind. I felt disgusted and just synthetic all of a sudden in contrast to the sheer organic and oneness I had experienced earlier. If I didn't stop meth now I never would and It would be the death of me as a human.</p><p>The rest of my trip was merely one of contemplation on the images my own mind had presented to me as a lesson. I feel that even though I might have learned of this at a later date my mind realized I had to know now and guided me in a way to achive this end. Wether I will stay off meth or not is a matter only time can tell, but I hope I will have the willpower to.</p>"
}
