{
 "title": "A New Respect For Marijuana",
 "author": "miraculi",
 "citation": "   miraculi. \"A New Respect For Marijuana: experience with Cannabis & Esctacy (ID 3152)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3152",
 "substance": "Cannabis & Esctacy",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2000",
   "3152",
   "Male",
   " ",
   "Not Given",
   "Dec 23, 2001",
   "Views: 9547",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy friends and I had been waiting for this rave for a long time.  It would be my friend's last party with us, so I decided to buy him a couple tabs and myself one.  I don't use the drug too often, and when I do one pill works just fine for me.</p><p>Before we took our E, we decided to go out to my car and smoke some marijuana, it would make us nice and relaxed before our E began to work.  I took half my pill, and my friend started with a whole one (since he had another whole to go), and we smoked.  Usually it takes at least 30 minutes for E to work on me, but within 15 minutes my friend and I where beginning to feel the E.  The seats in my car seemed extremely soft, and I remeber asking my friend if he was feeling his, and I looked over at him (I could plainly see by this point he was feeling his) and he said yes, so we decided we should go in and dance.  I got in and I felt great, almost as good as the first time. At about half way through the night I took my other half.  My friend and I danced all night, a truly great party.  As the party started winding down, we decided to go out front and watch the sun rise, sit down in the grass, and smoke a bowl.  This was a truly beautiful experience,  as we smoked I could still hear the most beautiful trance set from the party, it went along so perfect with this beautiful sun rising, the wheat fields, and small hills on the country side.  I saw all the beautiful people, after a long night of dancing to the music, they come out to meet the sun.</p><p>This was the most strange high,  I didnt feel like I was high on marijuana, or on ecstacy, it was a totally different experience.  Truly euphoric. Just then we could hear cheering and shouting from inside the rave, and we heard the most exciting, hardcore jungle music.  We went in and only a few people where left dancing, and this is when the party had the most vibe, everyone was dancing like crazy, it was 8 am in the morning, the sun was shining through the windows, it was truly awesome.  Ever since then, when I take ecstacy, at the very end of the experience, I smoke some high grade marijuana and this seems to always bring me into second trip almost, but its always the most enjoyable part of my evening, and I never experience any hard come down, and depression the next few days after.</p>"
}
