{
 "title": "Waking Up Dead",
 "author": "Rachael",
 "citation": "   Rachael. \"Waking Up Dead: experience with Topiramate (Topamax) & Cannabis (ID 31520)\". Erowid.org. Jul 10, 2010. erowid.org/exp/31520",
 "substance": "Topiramate (Topamax) & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Topiramate",
   "(pill / tablet)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31520",
   "Female",
   " ",
   "Not Given",
   "Jul 10, 2010",
   "Views: 7119",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The topamax was not kicking in so I thought to myself, This sucks. I'm gonna go smoke, at least I know that'll get me high.' Soon after I smoked my mom came home from work, I didn't want her to see me high so I told her I was going to sleep. I went and laid down on my bed. Im Anemic and I have a horrible circulation of blood through my body and my thyroids don't work, so I am always cold so I bundled up under my covers, turned on some music to enjoy my high to. </p><p>Everything felt normal until I realized my feet and legs were growing numb. The next song on my CD to come on was 'hEd p.e.- Jesus of Nazareth' that is when I started to trip. I realized that I was hearing the music but only certain instruments and the rest of what I heard was a hallucination. I kept hearing other instruments in the song that weren't there.</p><p>I remember thinking 'If my mom comes in here she will definitely know something is wrong because I am NOT all here.' Next thing you know my mom yells for me, she wanted me to do a chore for her. Somehow I snapped back into enough reality to barely manage to make it to her and complete my task. I went back to lay down and felt myself get numb again, for some reason I kept visualizing lemons. Somehow Lemons and my mother were connected. </p><p>The song kept playing. I felt myself falling farther away from myself. The song is kind of a mocking of god, I felt like god wanted to punish me for everything bad I had begun doing since last summer, and for listening to that song. Sounds dumb but yeah.</p><p>Next thing I know, I THOUGHT I was waking up (but I wasn't this was all a dreamlike state). I felt like my life before that moment had been a dream. A fantasy. I felt like I was waking up for the first time in my life. And waking up hurt. There was this adrenaline rush to my heart that was so strong it was painful. My whole body ached. God was punishing me. Then I thought I was dead. I have always believed that being dead was an eternal unconscious/nothingness that would be painless. But this wasn't painless. I was so uncomfortable, the thought of being eternally dead in this state of pain made me cry and scream.</p><p>I felt like this was reality. Reality setting in for the first time. That my actions did have a consequence and this was the consequences I had to face all summed up in one big painful load on me. I felt like everything that has happened to me in my past was me living in my 'la la' land I seem to get told I live in all the time. I felt like this is how everyone else in the world feels, how do they deal with it?</p><p>Suddenly everything I was seeing started to look like a film. Like negatives of a film, I dont know how to explain it. But it kept rolling up. Everything was rolling up like film negatives in a camera. I heard god condemn me and he told me that all of my actions will have consequences and I won't get away with things and have no bad karma for them. I felt an overwelming sorrow smog out my lungs and through my body. It was the sorrow of the world. Everyones sadness I felt like I was experiencing it. </p><p>My life started to roll back up in film. I suddenly shot up out of bed gasping for air. I had actually woken up finally, but I was still paranoid. I ran to my mom crying and told her a few select details of my experience, as not to let her know I was on drugs. She thinks it was some sort of nightmare, or heart murmur...lol. But it couldn't have been a nightmare because when I looked at the clock, about 5-10 minutes had only passed.</p><p>I know this sounds dumb but thats what happened, whatever it was.</p>"
}
