{
 "title": "ER Experience",
 "author": "happy man",
 "citation": "   happy man. \"ER Experience: experience with Hydromorphone (ID 31532)\". Erowid.org. Mar 5, 2004. erowid.org/exp/31532",
 "substance": "Hydromorphone",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Lidocaine",
   " ",
   "  ",
   "IV",
   "Hydromorphone"
  ]
 ],
 "footer": [
  [
   "2004",
   "31532",
   "Male",
   " ",
   "Not Given",
   "Mar 5, 2004",
   "Views: 24939",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After suffering a work-related back injury, my worker's compensation doctor simply prescribed me a very high dose of ibuprofen and made me go right back to work. However, after awhile, the mega dose started causing NSAID (non-steroidal anti-inflammatory drug) gastritis in my stomach and one day I took the ibuprofen on an empty stomach and I felt like I had just swallowed a razor blade. I had horrible abdominal pain and rolled myself into the ER. </p><p>The doctor performed an exam and initially gave me a GI cocktail to swallow, which is lidocaine and maalox, and ordered an IV started to give me fluids. However, I still had stabbing abdominal pain afterwards, so the ER Doc prescribed me a single dose of Dilaudid HP IV Push. I was NOT trying to get high, but I was very happy to hear that I would be getting pain relief as I was doubled over in agony. </p><p>The ER Nurse came into my room and pushed the drug through the IV pretty quickly. I instantly felt a warm flooding sensation throughout my body as my blood vessels vasodilated, and I felt slightly dizzy. I also felt a very, very pleasurable body high for the next few minutes. Instantly any pain or discomfort I had was erased and I felt great. I was not nauseous either, though that is a common side effect of Dilaudid. Perhaps the GI Cocktail prevented nausea. After only 2 or 3 minutes the high dropped from 'strong' to 'moderate'. The doctor prescribed some stomach medications and discharged me. However, I felt a little dizzy and could not drive, so had someone pick me up and give me a ride home. </p><p>By the time I got home, my high had gone from 'moderate' to 'mild', but was definitely still there. I took a nap for two hours and slept off the high. When I awoke, I pinched myself and could barely feel feel any pain for the next several hours, but I felt slightly groggy and lethargic for the rest of the day.....</p><p>My trip experience was pleasurable, but I highly recommend to anyone who reads this that they do not seek out Dilaudid for intentional use. It is EXTREMELY addictive and is widely known to be one of the most addictive pharmaceutical compounds in the world. I regret the fact that my severe pain required the use of such a strong drug because it can be psychologically addictive after a single use.</p>"
}
