{
 "title": "Great Head High",
 "author": "The Prince of Flower",
 "citation": "   The Prince of Flower. \"Great Head High: experience with Levmetamfetamine (Vicks Inhalants) (ID 31547)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31547",
 "substance": "Levmetamfetamine (Vicks Inhalants)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "inhaled",
   "Levmetamfetamine",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 31547",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 14, 2007",
   "Views: 23874",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is just a quick note to tell people about levmetamfetamine. Levmetamfetamine is the active ingredient in Vicks Vap-o-rub inhalers. These inhalers are almost identical in size and shape to small tampons. They're sold OTC for congestion relief, which is similar to the original use of many methamphetamines. I know little about the chemistry of levmetamfetamine, except that it is a distant relative of amps.<br>Anyways, I got a vicks vap-o-rub inhaler from a gas station. This was not my first experience with them, but I had used them foolishly before (see note at bottom). I unwrapped the inhaler, unscrewed the covering (a long, blunt-ended cylinder), closed my hand around the inhaler and huffed 3 large breaths. I immediately had an extremely cold feeling all through my nasal passages, almost like freezing liquid peppermint was being pumped into my nose. Within 15 seconds I had a great head high, I stumbled a bit, and laughed a little to myself. It stayed with me for about 5 minutes. This was outside on my college quad on a sunny May day in 2003, and I felt very positive vibes.<br>I have found in other experiences that it only seems to be the first few draws from the inhaler that give any high at all. I'd liken the experience to descriptions I've heard of ether use, dissociation of head and torso, general euphoria, slight loss of balance, etc.<br>Note on mixing: I don't recommend mixing with anything else, and I especially dissuade users from constantly huffing. Don't overhuff. One night I was on a half gram of kind bud, 3 prescription codeines (insufflated over a medium period of time, don't remember the dosage), and 4 nodoz, which I affectionately call 'The Poor Man's Speedball'. I had done this once before with a much larger amount of bud and passed out, but this time I only had a bit, so I did all of the above and was hitting a Vicks inhaler all night. I probably hit it at least 20 times over the course of 2 hours, if not more (quite a bit considering the dosage is 3 times every few hours). After a while I had a MASSIVE headache. A pounding pounding pounding migraine. Since I had passed out last time, I didn't know if it was the bud, codeine, and caffeine, the Levmetamfetamine, or all of them put together which was making my brain hurt. The point is, I'm unsure of the results of mixing and/or excessive use, so I recommend against both.\n\n\n"
}
