{
 "title": "Loud Walls and Liquid Gold",
 "author": "Mushroom*_*Eyes",
 "citation": "   Mushroom*_*Eyes. \"Loud Walls and Liquid Gold: experience with Mushrooms - P. Cubensis (ID 31553)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31553",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "142 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31553",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 14, 2007",
   "Views: 2766",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo I've tried DXM, marijuana, Alcohol, Morning Glory seeds (To no effect) and MDMA. For the last two and half years I've been smoking pot about 2-3 times a day and I have an increasing symptom of depression. I've never taken any sort of anti-depressant. \r\nSo anyway I bought 2.5 grams of shrooms for $20 and decided to try them that same night because I really had nothing to do. I was feeling slightly nervous and apprehensive but I diverted these thoughts somewhat by re-assuring myself of a good trip and by reading some positive reports on this site. This took place a couple of weeks ago so I can't remember what time I ate the mushrooms or exactly how long they lasted, so these times are just an estimate.\r\n+0:00 - I eat the shrooms while sipping a glass of orange juice to help them down. They don't taste too bad as I chew them to a pulp but after eating a few they become sort of gross.\r\n+0:20 - I started feeling kind of nauseated like the beginnings of a DXM trip so I concentrate on keeping them down. I also have a sort of bloated feeling.\r\n+0:45 - I run to the sink and puke. I was pissed off because I thought that I may have not had enough time to absorb active ingredients. I was wrong. :)\r\n+1:00 - I've started noticing things and I become somewhat 'spacey' like when I smoke a few bowls of pot. Also developing is a feeling of warmth and euphoria as the lights become more vibrant and shimmery. Things definitely aren't normal as I can detect slight variations in reality, mostly to do with my sensory perception.\r\n+1:30 - It's almost at its peak now as I lay on my bed examing my surroundings. The patterns on the wallpaper which normally just look like random color blotches are now revealing a whole new set of layers behind them. The dimness of my room I suppose has enhanced this effect but it is still wonderful to behold. There was a total of two layers on the wallpaper if I can recall correctly, the first layer which was normal and a second which occupied the darker hues of the wall and seemed to be shifting and drifting in and out of the lighter parts of the array of colors. These layers combined in many places to display random images, mostly faces, but other abstract pictures that I can't recall.\r\nMy lamp is also a brilliant object. I swear it was liquid gold. The lengths and dimensions of it seemed to be shifting and expanding while keeping such a brilliant glow that I was completely in awe of it. The white curtains are also occupied by my trip. They appeared to be shifting but the most prominent of the visual aspects of them where the white ghosts being crucified by the curtain rod. There mouths were stretched in lifelesness and the hands were dissolved in the white flame that was a rinkle at the top of the cloth. Unbelievable. All these images and more were enough to keep me occupied for a good 45 minutes on my bed. Ah, the bed. It felt as though it was a cloud that was conforming to every curve in my body. I felt the normalities of it when I shifted myself but when I stopped my motions it became an object that existed only to provide me with the most supreme comfort. I decide I'm having a really great trip.\r\n+1:30-4:00 - I can't remember when much of these things occured over the next few hours but it is somewhat irrelevant. When I left my bed the walls were so active with visuals that it was 'loud'. At this point I told them to shut up as I began laughing at myself for being so high, and also at the walls, for the same reason. I don't think there was a time period of more than a minute during this trip that I didn't have a big, curious grin smeared across my tripping face. Such a warm, comforting, content and overall pleasant feeling was coursing through my whole body. Everything was good.\r\nI played guitar at one point which amused me very much but not as much as I had hoped so I soon gave that up for some internet chatting. I talked to my friend who was the only one online at the time and I felt very much enveloped by the whole conversation. I felt every emotion represented by our sentences and all the things we discussed I was experiencing almost instinctively. There was a lot of emotion brought about by the things that would envoke it. I listened to music but I only remember the first thirty second of the first song I listened to, which was absolutely fantastic. The song was 'Silent Sigh' by Badly Drawn Boy and OH MY GOD was it refreshing! The intro to the song gave me a similar feeling of diving into a serene mountain stream that flows with liquid crystalline water. I laughed and smiled a truly genuine smile as I listened to that song, I also heard subtle instruments that I had never heard in the background of that song before. I also made some toast, which was a very comical farse, and I had a lot of fun doing it. I checked the bread in the toaster at least 10 times before it was done which exhibits some mild time dilation, but not too much.\r\n+4:25 - The trip is slowly declining and I feel reluctant towards its diminishment. The come down appears to be broken down into 'stages', as I will be doing something and suddenly feel less high. I spend most of the come down on my computer playing Counter Strike, and online game thats really intense when I play it stoned, but was not as much so when I played on mushrooms. After pulling myself away from the screen I noticed that the visual aspects of the trip were completely gone and the feeling my body had was almost un-noticeable. I looked around my room and examined things for the first time since my trip. The room was extremely dull, almost gross compared to the spectacular mushroom version of it. I looked at my lamp and noticed it had gone from 'liquid gold' to a slightly shiny not-very-well-made lamp. It had dust all over it that seemed to have come out of nowhere and was giving off a very small amount of light as opposed the halogen-style bulb that was installed in it by my mind at the beginning of the trip.\r\nThe rest of the night is forgotten except for a small period of time when I was attempting sleep. I have a lot of trouble sleeping on any occasion besides being really tired or having some drowsiness inducing drug in my system. Mushrooms did not affect my sleeping pattern and I did not fall asleep for about an hour and a half after getting into my bed. The entire night up until this point I had no CEV's but when I was trying to sleep I had quite an array of them. They were not very vivid but they were still very interesting. Most were in the form of Alex Grey-style paintings and pictures. My favourite that still sticks out in my mind was a white tower that was surrounded by multi-colour psychadelic flames. The tower was so magnificent that for some reason I opened my eyes when I saw it. This perhaps helped me to be able to remember it because I closed my eyes immediately to try and bring it about again but instead it appeared briefly and faded away quite quickly.\r\nOne thing I failed to mention before was that anytime during the peak of my trip that did not involve any sound I would hear sounds in my head. It was almost music but it was always changing and only prominent when I focused 'past' it. If I concentrated on it and tried to hear it then it would fade away and become just a slight fuzz-type noise. Most of the sounds were in the form of harmonics with flanging type effects. If you've ever heard 'Treefingers' by Radiohead, then just compare it to that and it's quite similar to what I was hearing. Another thing that I've just remembered about this trip is there was little or no 'mind trip'. I tried thinking about personal issues and became slightly confused and just gave up eventually. I concluded after the trip that mushrooms are solely for tripping, in a visual and euphoric way. There was absolutely no effects the morning after and it felt just like any other day, but perhaps with a bit more energy and motivation that following day, but it may have just been me thinking or believing I was experiencing these effects.\r\nI know this report hasn't been very 'helpful' but I wrote it mostly for the purpose of entertainment. There is no information I can provide that isn't already written a thousand times somewhere else on this site. This was my first time with mushrooms and I highly recommend this trip. My other drug of choice is MDMA (Ecstasy) as it is a veritable fountain of information, not just about myself, but about anything I put it up to.\n\n\n"
}
