{
 "title": "Sustained, Controllable Euphoria",
 "author": "DXer",
 "citation": "Citation:   DXer. \"Sustained, Controllable Euphoria: experience with DXM (ID 3158)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3158",
 "substance": "DXM",
 "bodyweight": "230 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: ",
   "ID: 3158",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2001",
   "Views: 18871",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have experimented with Robitussin Maximum Strength Cough for over a year now, and I would like to relate my findings.\r\n     I am not currently under the effects of DXM.  My girlfriend did not like the dramatic changes that manifested in my personality.  I did.  Argument ensued.  I decided to quit.\r\n     I learned about DXM at a small party in the spring of 1999.  Up until then the only drugs I had used were pot and acid, the latter only once.\r\n     The person that told me about it was mentioning it as an alternative to acid, which I had been looking around for for the longest time with none in the area to be found.\r\n      This person was misinformed though about the stuff.  I went home though and did my research on the internet, and found out that RMSC was the stuff I wanted, not the Max cough and cold.  \r\n       This person also had told me that it made you hallucinate by eating the lining of your stomach, somehow causing the effects.  This was nonsense.\r\n        I've experimented downing it in a number of ways.\r\nDose cup by dose cup, chugging the bottle, chugging and drinking a bottle of water, dosing alternating with grapefruit juice shots.  I have not found any difference in what ultimately happens, except with the water.\r\n        The effects are cumulative, and increase in enjoyablity as you adapt.  You the reader could go out right now and buy a bottle for five dollars and chug it and experience very little to nothing.  But if you did that everyday for a week to a week in a half, using your best judgement, you would begin to notice a DEFINITE change in your thinking and actions.\r\n      Negative thoughts could not penetrate my calm mind, my upbeat mind, nor my sleeping mind.  DXM is a euphoriant, so that is why.  Again though, it's cumulative, so don't expect anything without experimenting.\r\n      At first I had no idea what I was doing.  None whatsoever.  But the substance has a way of correcting your behavior in terms of how you find out what works and what doesn't.  \r\n        I don't know how it works, but the water somehow prolongs the effects up to 6-7 hours. Actually plain water is the best thing I have ever taken with DXM.  Not mixed or anything...just afterwards.  I would always drink bottles and bottles of water because I was being cautious with my kidneys.  It is a syrup, and it's being dumped into your system wholesale.\r\n        The negatives I've experienced:\r\nDosing too high for being in public (anything over 4 oz for my body weight)\r\nNot being able to concentrate for a period of time, usually less than two minutes.  This occurs probably two hours into my experiences.\r\nSlight nausea.\r\nHeavy nausea, accompanied by vomiting and not being able to keep anything on my stomach.\r\nGradual loss of my ability to walk decently while being on it.  I have gone to stand up from chairs and had to sit immediately back down in embarrassment because no one knew I was on it.  If I would have gone to walk, they would have been able to tell something was definitely up.  This occurs generally towards the end of the trip.\r\nInsomnia.\r\nConflicts with my loved ones, who have no idea what sustained, controllable euphoria actually feels like, nor how dramatically it alters your self-image.\r\nHeavy sweating, dry mouth.\r\nConstantly wanting more to prolong the effects.  Bottoming out can be avoided..there is no coming down unless you can't find a bottle, and even then the residual effects can last upwards of a week.  Two to three days is more common in my experience.\r\nBeing viewed as delusional.\r\nExcitability.\r\nOveremotion stages.\r\nMotor skills drastically degenerating.\r\nSlurred words. Not so much speech in general.\r\nEt al.\r\nAgain, most of these effects occur when you don't know what you're doing, when you think you have control of the drug and not the other way around.\r\nSome of the positives, and I am leaving out the psychological aspects, which are profound:\r\n    Diminishing of physical pain. This helps in all kinds of things.  Use your mind and experiment.  I find stretching to be extremely pleasurable, and I could stretch easily beyond my non-DXM zones.\r\n    Inability to achieve orgasm (unless you're definitely persistent and tenacious), coupled with a dramatic increase in the enjoyable qualities of sex.\r\n    Lucid thought.\r\n    Out of body experiences.\r\n    Lucid dreaming.\r\n    An increase, after an initial orientation with, ESP.\r\n    The ability to talk to anyone anywhere, unabashedly.\r\nThere is a lot more.  This was the tip of the iceberg with my experience.  It's really sad that others can't see the difference between use and abuse, as they label anything they are scared of or ignorant of as abuse.\n\n\n"
}