{
 "title": "Unexpectedly Suprising",
 "author": "lsdteknology",
 "citation": "   lsdteknology. \"Unexpectedly Suprising: experience with 2C-C (ID 31599)\". Erowid.org. Mar 15, 2004. erowid.org/exp/31599",
 "substance": "2C-C",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31599",
   "Male",
   " ",
   "Not Given",
   "Mar 15, 2004",
   "Views: 16850",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report is without any notes so bear with me. I consider myself a very experienced psychedelic explorer. This chemical caught me off guard, heres what happened.</p><p>Time of ingestion- 4:30 pm.</p><p>First effects noted +20 min</p><p>Empty stomach, however 20 minutes after ingestion I ate 1 quesadilla. By that time I was suprisingly feeling it already. The room and my computer seemed to slightly swirl in a very entertaining way and my vision had the microfine pixelation common to all 2c series chemicals I have tried before.</p><p>+40 min I leave my house to go out and explore my sourroundings (I do not reccommend this unless you have EXTENSIVE experience in psychedelic chemicals and alot of water in a back pack) listening to some GOA Gil and astral projection on my cd player. What I found once I reached the wooded area of my walk into town, is that I was at a full +2.5. But only while standing still. While walking the effects retreated to 'soft looks'. This was at perhaps +50 min.  That piqued my curiosity, everything looked 'fluffy' like the trees and bushes I saw were actually softer than I knew them to be. My mood was extremely elevated and there was a much more felt body euphoria than with 2c-B and 2c-t-2. </p><p>At about +1hr 30min I had plateaued and was feeling very good. There were extreme feelings of closeness with the earth and I felt as if I wanted to never leave those woods. It was so peaceful and beautiful to see what nature had created in her glory. I am usually not a very spiritual or even emotional person, I like logic and science, exact sciences, but while feeling the effects I felt, I was a very docile and complacent spiritual emotionalist (I think I just made that word up) it felt good right down to my soul. After about 3 hrs after ingestion I began to come down and regretted it deeply. At about +4 I was down all the way with only an after effect of what had been so beautifully glorious. However, the feeling I felt then will stay with me forever. </p><p>Conclusion: this chemical is an exceptional one at that. It produced a heaviness on the chest which for me seemed to enhance feelings of spiritualness, emotions and well being. This would be an exceptional theraputic tool for the psycologist/psychiatrist when dealing with depressed patients. I believe this one is special (although, which one is not?) Every 2c series chemical has its therapeutic use, they just differ in which area of psychological therapy. One last reminder, do not take RESEARCH CHEMICALS WITHOUT THE USE OF A SCALE no one can eyeball 10-20-or even 30 mg without being off by at least 3-10 mg. So have fun and be safe peoples Peace on the Realist note, lsdteknology</p>"
}
