{
 "title": "Alice In Dangerland",
 "author": "Itzz",
 "citation": "   Itzz. \"Alice In Dangerland: experience with Salvia divonorum (10x extract) (ID 31591)\". Erowid.org. Apr 30, 2007. erowid.org/exp/31591",
 "substance": "Salvia divonorum (10x extract)",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31591",
   "Male",
   " ",
   "Not Given",
   "Apr 30, 2007",
   "Views: 3823",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Mindset and Setting:</p><p>At home alone. I've bought the extract and a bong as I've read that its best through a bong. I think I'm prepared for what im about to do as I've read nearly all the reports. Also the helpful lady at the shop told me exactly what to do and what to expect.</p><p>Preparations:</p><p>Made sure the bed is clear of sharp objects so I can safely collapse. The front door is locked and the phones are all switched off. I'm dressed comfortably and a CD is playing Amoda and The Transformers which is pretty fitting music for a trip to another world - at least I thought so.</p><p>I fill the bong up and must admit that the various things I have read and heard have left me with a feeling of trepidation. Things such as this stuff being 5 times stronger than acid and that it should be respected and don't do too much are ringing through my head. I was planning on a bit of meditation, but with these thoughts going on, I thought best to just get on with it.</p><p>I pack the bong with a small amount - how much? About a pinch or half a pea size - I don't know exactly. I light it and suck on the bong, I feel the smoke go down my throat and wait for it, wait, wait - nothing! I wait for another minute or two just in case, but still nothing. Now I feel I've been ripped off and loose any fears I previously had. This time I fill the bong. About 3 peas worth. I turn the flame adjuster on the lighter to max, light it, exhale and then suck for all I'm worth holding the lighter all the time. I decide to keep inhaling until my lungs are about to burst, but don't get that far.</p><p>Instantly, like a dagger in the heart I realise I have made a huge mistake. I don't know what exactly, but I go to put the bong down on the desk and it drops onto the floor. It was not even near the desk, but I could of sworn the desk was right there. Paranoia like nothing I've known before hits me. How did I get to the other side of the room with the bong in my hand when I was sitting at the desk? I feel very insecure and panicky. The room is tilting, no its swirling! I feel my body twisting around like my head wants to go under my left arm and my left arm is being sucked behind my back.</p><p>I decide to lie down. This I do and immediately all the things the pretty lady at the shop said come back to haunt me. RESPECT SALVIA - DON'T DO TOO MUCH - DO IT WITH SOMEBODY PRESENT - 5 TIMES STRONGER THAN ACID. I realize that she is kind of a salvia god and now she's going to punish me. Punish me by making me into a mad man for all eternity. What will my parents think? Are my housemates going to turn me over to the police when they get home and find a mad man huddled in the corner of the bed? </p><p>Then I hear the music playing and the salvia God (voice of the lady from the shop) comes back to reassure me - as if I've been punished enough. She reminds me of two things. Two things I had forgotten. 1)I've smoked salvia and what I'm experiencing are results of this and I'm not crazy and 2)that it only lasts for 5-10 minutes. I breathe a sigh of relief. I'm definately still in Wonderland, but now that I'm back in control I can relax.</p><p>I notice the patterns on the bed swirling. Hold on, they're swirling to the music. Ahh, the music, its amazing. I've never heard it sound like this before. It's explaining what im feeling. I'm lying in the music, totally immersed for about 30 seconds, but it  feels like forever. NOTE: Im probably about 4 minutes into my trip, but I feel like I've been crazy for days. I've done weeks worth of reasoning in my 4 minutes.</p><p>The words in the music are slowly repeating breathe, breathe, breathe. I'm doing this to the music, feeling fantastic and then the words say, breathe the fire. AHHHH - back to fear and loathing. Breathe the fire! I immediately sense bad spirits in the room and don't want to breathe them in. I feel like the nice salvia God from the shop has tricked me. She wants me to breathe demons and become posessed. I hold my breath and run /fall down the steps and into the garden. By now though I can feel normality quickly returning. I can reason any thought out and I start to reflect on life and spirits. </p><p>The after effects linger for a long while, long enough for me to go find some spliff , roll it and light it - all in my own sweet time. Once the joint has been lit a different kind of mild stoned feeling takes over. One where the marajuana fuels my already deep thoughts on life and God. I go lie in my hammock and ponder these thoughts till my housemates come home. I tell them about it and we decide to do it again together. This time I'm prepared and fearless because I know what to expect. I'm also in the right frame of mind, feeling totally relaxed. Thats another story, but Wow, Its grand. Less spiritual and more trippy. My friend freaked out though and I was able to help him out, even in my state.</p><p>Conclusion:</p><p>LISTEN TO WHAT PEOPLE ARE SAYING, THEY ONLY MEAN TO HELP.</p>"
}
