{
 "title": "Loss of Touch with Reality",
 "author": "First Timer",
 "citation": "   First Timer. \"Loss of Touch with Reality: experience with Datura (ID 31615)\". Erowid.org. Mar 30, 2004. erowid.org/exp/31615",
 "substance": "Datura",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "100 seeds",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31615",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 30, 2004",
   "Views: 9045",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Over the past few months I have been reading and trying to obtain Datura. My goal is to find a hallucinogen that has CRAZY hallucinations, and one that is easily obtainable. So I read about 90% of the trip reports, and how almost all of them are negative but thought that I was above that. MAN WAS I WRONG!! I am going to describe what I thought might be a fun, short trip that turned into a long, loss of control.</p><p>10:30 P.M.- Feeling good, anxious, and ready to trip. So I start to make a tea out of 100 Datura seeds. I got a mortar and pestle out which had no effect at all in smashing the seeds. So I emptied out a green tea bag and replaced the tea with 100 halfway smashed seeds. Next I filled a glass almost to the top with water and stuck in microwave for about 2 1/2 minutes. Then my parents got home so I had to pause the process and pretend to be doing something else.</p><p>11:30 P.M.- Parents just went to sleep. Very excited. So I had to stick the water back in the microwave till it was starting to boil. Then I went into my room and dropped the tea bag of seeds into the boiling water. I let it set for about 10 mins. and then stirred it for about 20 more until it was cooled down enough to drink. Then I ate the seeds in the tea bag (sucked, chewed, then swallowed) and sat down with the drink.</p><p>12:00 P.M.- Ready to drink tea but decide to add some sort of bottled kool-aid drink to help with the taste (I dont really mind it but its not great). After about now I loose total track of time. I forget that there is  such a thing as time. So the rest of the times are just educated guesses really.</p><p>1:00 A.M.- Feel extremely disoriented and dizzy ONLY when I stand up. I found that to be odd. I was getting kind of tired and thought that I might not trip so I watched T.V. for a while and then decided to go to bed. Even though the effects were getting stronger and stronger, I was getting sleepy. I set my alarm for 5:30 just in case I made a mess or something like that.</p><p>5:30 A.M.- About half of the rest of this report was told to me or realized later, and the other half is ALL really blurry so it might sound wierd Supposedly, I woke up, turned my alarm off, and got into the shower just like I was going to school (it was Saturday). Well, I didn't get in the shower, I just turned it on, and left it on. When my dad woke up at around 6:00 he noticed it was on and that got him confused. Apparently, I fell back to sleep until about 7:00 A.M. Saturday.</p><p>7:00 A.M.- I woke up and to my suprise one of my friends was sitting in my leather deak chair and his girlfriend was sleeping on my bed. I kept talking to him and he never spoke back to me. His girlfriend was 1/2 asleep just kinda laying there so I talked to her. She never said anything back either. None of this seemed odd. I also saw my brother in my room playin X-box. So I went to get some water or something and came back and all were gone. Next, I went to my brother's room and he was dead asleep. Upon leaving his room, my stepmom started talking to me. We argued back and forth on what day it was. I would have bet anything on the fact that it was not Saturday, even though it was. So I gave up on that had breakfast and went to my room again. This was the zone for people to talk to me. Probably because I consider that my safe trip zone. Where I am always comfortable.</p><p>8:00 A.M.- Upon entering my room the same guy and girlfriend were there but then dissapeared. This seemed normal to me. I played music and X-box for a while and then realized that sitting behind me was my friend who was supposed to come over LATER that day. I hadn't asked my dad yet about him coming over so I went to. My dad seemed taken aback by this so he led me back to my room to show me that nobody was there. I was shocked! So shocked I made excuses of how he could of left my room. Then my dad looked at me and said 'Don't you realize, nobody was ever there, you hallucinated him there.' This was kind of a mind-opener to me. I suddenly realized that all the strange crap that happened was not real. WOW! My dad left pissed off I had taken drugs and I sat down unhappy. Then all of a sudden I noticed about 3 random people lounging in my room as if they belonged there somehow.</p><p>I tried talking to all of them. I had already forgot that they were not real. Then one disapeared from the leather chair and I was screaming at it to bring that guy back! The chair actually smiled at me but said nothing back. I got over it quick and gave my attention to the X-box. Then I noticed people coming and disintegrating all from the chair. This went on until my dad came in to talk with me about doing this drug. I thought he could see the people in there with me so I was trying to play it all cool. When he left all the people were looking at me and smiling, even the chair. </p><p>3:30 P.M.-If today was Thursday it would be time for me to go to rehab group counseling but it was Sat. I got ready and called my friend to pick me up to go with me. While it was ringing I realized that it was Sat. and I was fucked up out of my mind. Everything gradually went back to normal after that. </p><p>It was a great experience but unfortunate that I couldn't remember a lot of it. I had taken about 15 mg of Adderall Fri. morning....Effect it or not? I'll never know.</p>"
}
