{
 "title": "A Long Hellish Path to Sanity",
 "author": "Lovely rita",
 "citation": "   Lovely rita. \"A Long Hellish Path to Sanity: experience with Methylphenidate (ID 31613)\". Erowid.org. Mar 17, 2007. erowid.org/exp/31613",
 "substance": "Methylphenidate",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Pharms - Methylphenidate"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 31613",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 17, 2007",
   "Views: 24012",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Life was bad; I had been busted for meth and almost kicked out of school. I have had major drug problems before with meth, cocaine, crack and heroin. After being diagnosed bipolar, I was given a regimen of meds that really saved my life. Unfortunately, I manipulated the psychiatrist into giving me concerta, an extended-release form of methyphenidate that I used to snort.</p><p>I immediately began snorting it, usually about 36-72 mg per day, a little every few hours. It made me calm, focused, talkative; essentially, it made me feel alive and relieved my constant depression. Over the year I became addicted to it. I looked forward only to those moments when I could escape back to my room and snort more, get some blessed relief, feel the burn in my septum. Life was great, I was happy and excited.</p><p>Soon, 72 a day wasn't enough. I told the psychiatrist this, and he unwittingly believed me, giving me 108 per day. I stole from the bottle and bought it from other kids, until I was fucked up on it all the time, losing weight and my appetite but excelling in school and in art.</p><p>Eventually, it all began to fall apart. I decided that snorting was not enough, and began stealing needles from a diabetic friend. The moment I first shot it up, I knew this was it. From that moment I stopped going to school, stopped calling anyone. I had found home. I spent all day on my bed mainlining my little white pills. Soon, every night was a nightmare. I would overdose accidentally and spend horrific hours convulsing and throwing up, paranoid and hallucinating, praying to god that I would make it through the night. </p><p>Despite that, I could not stop. Soon, my whole body was ruined. I had used up all of my veins; I was covered in track marks and bruises and was disgustingly thin. I was a constant emotional meltdown: the smallest stresses propelled me into psychosis and hysteria. I couldn't deal with reality. The only reality I wanted was the needle and the spoon. It was my lover and my best friend, the only constant.</p><p>I was miserable and shooting up over 200 mg per day when I was caught and sent to rehab. I've been to rehab before for coke, crack, meth and heroin, but this time was different. Detox was hell, as I had been on Concerta for over a year straight. I couldn't wake up, I shook, I cried and sweat constantly. </p><p>Life is not easy after 3 months of rehab for RITALIN, of all things. I never thought it would come to this. Life is constant cravings for coke and ritalin, AA and NA meetings all the time, and a sh-tload of praying. I don't know if I'll ever be the same. My attention span is worse than ever and my organs are damaged. My bone density is like that of a 70 year old due to not eating. And my mind is permanently changed for the worse.</p><p>Think before you do this 'harmless study drug.'</p><p>I didn't.</p>"
}
