{
 "title": "My Coke Tastes Like Markers",
 "author": "beerbong",
 "citation": "   beerbong. \"My Coke Tastes Like Markers: experience with AMT & LSD (ID 31630)\". Erowid.org. Jul 16, 2013. erowid.org/exp/31630",
 "substance": "AMT & LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "AMT",
   "(powder / crystals)",
   "  T+ 1:00",
   "1 hit",
   " ",
   "LSD",
   " ",
   "  T+ 1:00",
   "  ",
   "smoked",
   "AMT",
   "(powder / crystals)",
   "  T+ 1:00",
   "  ",
   "insufflated",
   "AMT",
   "(powder / crystals)",
   "  T+ 1:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 9:00",
   "2 tablets",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 9:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 9:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31630",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 16, 2013",
   "Views: 675",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell good lord my friends, what a story I have to tell, or what I can remember of it that is.  A friend was coming into town and supposedly he had 2 AMT pills, which we purchased from him.  Another friend of mine came up to college to stay the weekend with me as well and he brought some xanax and some lsd.  The AMT was a white powder in a gel capsule.  We weighed it out but our scale was not very precise, so it just said .3.  Well obviously it wasn't that much AMT, it must have been mixxed with something else.  <br>But we trusted said friend, so we ate about half of the pill at first by parachuting it around 6 o'clock.  We took a hit of some decent acid around 7 o'clock.  We started to feel a bit sped up from the AMT and then we decided to smoke the AMT.  The acid was also beggining to come on.  When you smoke AMT you certainly feel a rush of psychedelic tripiness and a rush compared to taking a hit of decent meth.  We smoked a small amount, then snorted the rest between the two of us.  The acid was fully kicked in and the AMT was more or less also.  The visuals were very pretty from the combination.  Patterns, colors of course, just looked so beautiful.  I just wanted to smile the entire time.  I ate some jalapenos and the spiciness was so trippy and delicious, even though I had no appetite from the AMT.  We smoked some very high quality marijuana also.  This just helped everything out even more.  The visuals were amazing and my mind was definitely running in over-drive.  Some reason I said some very random things such as 'I hate it when my coke tasts like markers.'  This sentence made no sense, and I had no idea why we said it.  We all just laughed.  We also kept getting sidetracked as most trippers do, but we all had so much good positive energy.  Eyes were dialated a ridiculous amount, no blue could be seen in my eyes at all.  I sweated a little bit.  The nausea was not very bad from the AMT at all.  I loved this drug, and this combination, the trip was beautiful and amazing.  You dont feel apprehensive at all, you just feel trippy as hell.  The trip lasted so long that my friend and I became accustomed to the AMT so although we were still seeing cool visuals we were just chilling with our non-tripping friends too.  It is definitely a social drug.  You relate well to others and your very friendly, its just that you look like you are on a ridiculous dose of MDMA or Acid. <br>After we just got bored of tripping so long, id say around 3 or 4 AM we took 2 xanax and proceeded to smoek quite a bit and drink the everclear.  This is where it becomes hazy obviously.  I eventually passed out, but my partner in crime was apparently awake till 10 am.  He said he was just living in a world of craziness and visuals, as he might have taken more acid, but he simply can't remember.  We slept until 10 PM the next night.  Then we woke up and proceeded to start drinking heavily as we wanted to get some sleep.  I was worn out badly fromt he AMT gbut I Loved it!  I had so much fun and I reccomend it.  Parachuting is a good way, snorting isn't that great, smoking it is fun as hell.  1 hit of acid with AMT can make it so much more interesting and I reccomend it.  Xanax and alcohol for the comedown aren't bad either, so easy and happy.  I loved it my friends, and I hope that if you try the same thing you will too.\n\n\n"
}
