{
 "title": "I Had Been in a Ghost Town",
 "author": "DPT",
 "citation": "   DPT. \"I Had Been in a Ghost Town: experience with DPT (ID 31668)\". Erowid.org. Jul 17, 2013. erowid.org/exp/31668",
 "substance": "DPT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31668",
   "Male",
   " ",
   "Not Given",
   "Jul 17, 2013",
   "497",
   " "
  ]
 ],
 "report": "<p>It all started when my friend R took some DPT at about 5 in the evening.  He had expirienced a very bad trip, throwing up, unhappiness, the whole nine yards.  Then at about 9 in the evening I had the insane urge to trip.  I have tripped on DPT before and I was prepared for a very intense few hours.</p><p>I had him pick me up and then we went to the local store to buy some drinks.  I insuffiliated about 150mg of DPT, and then pounded a drink to kill the god awful flavor.  As we started to drive around I started to feel a little tingley on the inside.  It took about 10 minutes for it to completely kick in.  Then before I knew it some girl ended up in his car.  I had already said to him 'I will see you in a few hours'.  Things started to swirl a little and I had felt in a place of emptiness.  I had felt like I had been in a ghost town and I was very unaware of where I was.  </p><p>As we started to drive my visions became much more intense and I was becoming even more amazed by the vibrant images that where going through my mind.  We had put a Sublime CD into the player and then the trip started really turning around.  Everything became more like a dream worl that nothing could remove me from.  I started to sweat a lot and then a minute later had become very cold the next second.  I was very unaware of what was going on by this point.  Tunnel vission cant even describe the visions I was seeing through my eyes.  Everything was very pleasant and nothing could make me upset.  </p><p>As I continued deeper into my trip I couldnt do anything for more than a few seconds.  I was constantly opening and closing the window.  Also I was  amazed by the images that the cd deck where showing, vibrant colors were all I could see through my eyes.  </p><p>I hacve tripped inside a house and it is one set place that cannot change and the environment will not change.  While I was being driven around by a 'sober' driver, every different place we went to would bring my trip to another level. For instance: If we were going through a woodsy road and there was snow on the ground I wouuld feel very cold and lost, but then I would heat up very fast.  Now when we were in a very lit place everything was looking like color sketches of the world.  Everything around me was being drawn in as I went further and further into my trip. </p><p>We drove on and on and I put in a Led Zepplin cd in.  Now let me tell you that old music really gets me going when I am tripping.  It just gets me off and I love it.  Makes me feel that much more comfortable.  But anyways we drove around and I would look outside every now and then and it was a very blury immage.  My friends told me that the entire trip I was just saying 'I HATE THIS!!!' and for some reason I can understand that completely.  The trip came to an abrupt stop once we pulled into a McDonalds and it felt like I had just awoken out of a good night sleep or something.   I was amzed by this DPT trip.  As I would do this again in a hart beet.</p>"
}
