{
 "title": "Mild Mushroom Trips",
 "author": "fOnion",
 "citation": "   fOnion. \"Mild Mushroom Trips: experience with Mushrooms (ID 3167)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3167",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.4 g",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3167",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2001",
   "Views: 23409",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have regarded Erowid as a very substantial and respectable source of knowledge regarding mind exploration, whether chemically or internally induced.  I have spent literally hours delving into the fascinating, humorous, and sometimes frightening and awful experiences of those who have sought to look beyond the perceptions of sobriety.  I myself have spent several years using psychoactive substances as a means to explore the depths of human consciousness and to better understand the world around me.  I've had a tremendous amount of fun along the way, I might add(let's not be too serious!).</p><p>My most recent(just came down about 1.5 hours ago) experience was with a small amount of mushrooms that I have been anxiously cultivating for six weeks.  This 'experience' was more on the order of a scientific determination of these mushrooms' potency and quality of effect.  I was neither planning or hoping to be blasted.  </p><p>I took two small, young fresh 'shrooms(3.4gms) with a teaspoon of brown sugar and chewed on the (delicious) molasses for about a minute before swallowing.  I don't at all mind the taste of fresh mushrooms, but the natural sweetness of the brown sugar made them far more enjoyable, I highly recommend this method of consumption.  I kept a simple journal of the trip which I won't bore you with. Within twenty minutes of consumption, I began to notice physical tension in my muscles and the weird skin irritability that characterizes my mushroom 'come-ons.'  For the next two hours, I had a relatively mild mushroom trip.  That is, relative to my considerable psychedlic experiences and relative to the fact that I consumed a very small dosage(Yea! My shrooms are rockin').  So what's so special about all this?</p><p>Why am I up at 1am writing about a rather uneventful night of watching football and undulating visual patterns in my shower curtain?  I see so many things written in this great database of knowledge regarding the vast, unexplainable worlds of high dosage drug induced psychosis.  I am no stranger to these worlds.  My most recent dabblings with DXM and salvia were intense, amazing, and quite unintelligible.  However, I just had a very positive and productive time balancing the necessities of my reality(school, work, relationships, blah, blah, blah) and the deep thought provoking fun of a mushroom trip.  I have come down relaxed and happy.  My personality has not changed and I do not have a new outlook on life, but I have made some decisions about what I should be doing tommorow and next week that I otherwise would never had considered or latched onto.  Yes, I think many of us here who take mind-altering substances do so to step away from the mundanity, frustration, and disillusionment of everyday life.  But also because the result of these actions are personally beneficial and enjoyable.  This most recent experience has taught me that a good 'trip' does not require taking the experience to catalytic levels.  I would hate for Erowid's vault of trip reports to be a 'how to  get the most fucked up' list.  I am not saying that everyone should take less drugs.  God, no!  I just hope that this little late night thought gets posted so that the people who look to these things for insight, pleasure, and refreshment can see that their goals can be attained without subjecting themselves to fear, doubt, awful come-downs and hangovers.  Not everyone wants to meet God on a Sunday night.  I have never been very big on mushrooms because of their low urban availability.  However, I am now thouroughly pleased with the fruits of my labor, and have, at once, become quite a mushroom fan.  Ultimately, I do concede that 'to each his own,' but the conclusions on this little test have come back very positive, and I believe that others may find a good light in it too.</p><p>Trip suggestions:  Mushrooms are weird because you never know how good they are.  If you have a trusted source, great!  If you are getting these things from a cow pasture somewhere or some shady guy with a twitch in his left eye, careful experimentation is best.  Everyone's version of a mild trip is different, so find your comfort zone.  I, personally, could have taken a little more this evening.  Because mild mushroom trips don't overwhelm you with confusion and powerful visuals, relaxation is required to induce the subtle beauty of the trip.  Playing your favorite music is number one! (To anyone who likes chill electronic music, check out Cafe del Mar series, especially Vol. 7.)  Anyway, all other basic tripping rules apply, but I think mild mushroom trips are great for solo work.  I definitely plan to experiment more with this wonderful companion to introspection and repose.  </p><p>Peace, and I hope you find what you're looking for.</p>"
}
