{
 "title": "Falling into Psychosis",
 "author": "Pilf",
 "citation": "   Pilf. \"Falling into Psychosis: experience with Salvia divinorum (ID 31688)\". Erowid.org. Sep 1, 2006. erowid.org/exp/31688",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 31688",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 1, 2006",
   "Views: 4578",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Over the last two years, salvia has become increasingly popular in central Florida. The first time I had ever tried it (and heard of it) I was in a very unfamiliar place. A girl's house whom I didn't know, with a friend that I didn't trust, and sitting on a couch that wasn't even a couch...it was some kind of uncomfortable single bed convertible sofa thing.</p><p>Anyways, at that particular point (about 2 years ago), I was at a very experimental stage in my life. I can tell you that that night alone involved several different drugs that I don't usually do (in particular opium and duster)...and of course salvia!</p><p>I really didn't know what to expect...my friend told me that I needed only one hit, and that I needed to hold it in for at least 30 seconds. Shit, I can do that. So that's what I did, except that I probably took too much. After clearing a full bong hit (the bong was probably about a foot and a half clear plastic with slide carb), I held it until I couldn't take it anymore and exhaled.</p><p>As soon as I did this it felt like my body was run over by a steam roller, from the feet up. It wasn't really a bad feeling, kinda strange...I liked it. 'My kinda thing'. Well, of course, as soon as I thought that, that is when the hooks started.</p><p>In the last two years I've heard people describe this feeling while on salvia....the feeling of being pushed...pulled...COMPELLED to go somewhere. Like some invisible force is tugging and stretching me out like some kind of freaking rubber band. For me it felt like invisible, freezing cold hooks were attached to each one of my joints (particularly in my arms and legs)and pulling them in opposite directions. I don't remember having any visual or auditory hallucinations my first time, but I remember that feeling, and I remember breaking out into a cold sweat (I was in a cold room too) and just thinking over and over again that I wanted it to end.</p><p>A few years later, a good friend (not the same as above) mentioned something about it to me. 'Oh that shit ain't good, man...just makes you want to crawl out of your skin' I remember saying something to that effect...it brought back bad memories.</p><p>But, I decided to try it again...I mean the shit is legal right? Might as well learn to like it.-big mistake-</p><p>This time we researched it, made sure we didn't do anything wrong. Most of the information we read said that you should never do it in an uncomfortable place, while the TV is on, around people we don't know, things like that.</p><p>So we did our best to make sure that all three of us were comfortable. Lights off, temperature good, no sound, no distractions, nothing. </p><p>Well, this time we bought 2 grams, and decided to take it as slow as possible. None of this worked. None of it. It was far worse that the first time. This time I felt like my skin was sliding all around my skeletal structure, the skin on my face felt like it was swirling over my skull, and that my facial features were on the top of my head. And it felt REAL. I just remember trying to explain how I felt, of course coming off sounding like someone with down syndrome...and then I just had extreme feelings of fear, confusion, and regret. I was ready for it to end about 20 seconds after I exhaled. It probably lasted about 15 mins, with 5 min of residual feelings. Horrible. I tried it one more time a couple of weeks later and it was even worse, nothing new...just feelings intensified.</p><p>The most important part of my testimony, however, is not what it did to me. One of the two friends with whom I smoked experienced something I've only heard called DRUG INDUCED PSYCHOSIS. It didn't start out with psychosis, mostly depression...and then it just manifested itself into hallucinations, delusions, and even paranoia. I am not exaggerating. </p><p>Another reason this probably happened is because he had just gotten out of residential treatment for chronic LSD abuse, and had already been diagnosed with LSD induced psychosis (this is NOT schizophrenia) but was doing fine with medication. The salvia just put him back into his own world, and he is currently in another residential treatment program. I talked to him a week ago and I couldn't understand what he was talking about at all...just cryptic, it scared me some and disheartened me more.</p>"
}
