{
 "title": "Nirvana And Near-Death",
 "author": "Yekimon",
 "citation": " Yekimon. \"Nirvana And Near-Death: experience with DXM & Cannabis (ID 3169)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3169",
 "substance": "DXM & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "354 mg",
   "oral",
   "DXM",
   "(liquid)",
   " T+ 1:30",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "1999",
   "3169",
   "Male",
   "",
   "Not Given",
   "Dec 23, 2001",
   "15978",
   " "
  ]
 ],
 "report": "<p>\nThis one isn't for the faint of heart (or mind...). No one told me that THC and DXM interact in the way that they do, so be careful, but anyways, here is what happend... </p><p>It was late morning when I decided to dose with a full bottle of Robitussin Maximum Strength Cough.  This was my fifth or sixth full-bottle robo-trip, so I was familiar with the second platuea effects.  Everything was normal for the first hour or so.  Sounds started to flange and my thoughts were becoming more abstract.  I was riding in my friend's truck (we were on a bud run...).  Music was sounding good, I was conversating freely with him.  I was feeling that DXM euphoria at this point.  By the time we picked up our 'connection' and arrived to get the weed, we stopped at a gas station and I could not feel my body.  My thoughts were racing.  It was all good 'till I hit the joint.</p><p>About 15-20 minutes after smoking *something* happend.  I would say that the weed pushed me into a strong third plateau trip.  My body got very rigid and I was breathing in a very shallow way (anxiety attack?). My skull cracked open and all that I can really say is that I died. Not just once, but two or three times.  I *knew* that I was dead, but somehow not afraid. I remember thinking that 'I must be dead now... and I love it!!' It felt as though something was landing in my now open skull.  I have no idea what, but I had the idea of space ships in my head.  Were these bits of knowledge? My own thoughts? I could hear something like Pink Floyd playing in my memory.  My vision was virtually nonexistant.  I kept thinking that I was wetting myself, but I didn't.  Through the peak I felt the oneness that I've read about in so many times in Eastern Thought.  Was it Nirvana? Heaven? Hell? In a way, I think it was all of these and more. I simply existed. I wasn't me anymore, at least this body wasn't mine. I essentially became a discarnated entity. I had the impression that I knew everything that has ever happened or ever will happen, only I couldn't verbalize it.  I could barely talk.  My friend says that I was babbling incoherently.  I have no clue what I was saying. When I finally came down, I remember being in the parking lot of my old high school. I knew that I went somewhere special, I just wasn't sure where. Sometimes I think about it and I really wanna go back. All in all, I'd do it again. It was terrifying and beautiful all at once.</p>"
}
