{
 "title": "'Acid Dust",
 "author": "AMILNOUT",
 "citation": "   AMILNOUT. \"'Acid Dust: experience with 2C-I & MDMA (ID 31708)\". Erowid.org. Aug 2, 2004. erowid.org/exp/31708",
 "substance": "2C-I & MDMA",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 1:45",
   "  ",
   "oral",
   "2C-I",
   "(powder / crystals)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31708",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 2, 2004",
   "Views: 14410",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I got my order of 2C-I or like we now like to call acid dust and had been holding to it for over a week, I wanted to make sure that I had all the information on how it usually affects the mind and body before I took myself on a trip.  After reading all I could I decided that it would be safe to try it. From what I had read effects seem to be a mix of mdma, which I love to use, and lsd or mushrooms. First mistake.</p><p>My first trip was supposed to be on Friday the 5th but between arguing with my girl and getting my best friend's opinion on the matter, who happens to be a psilocybin user, I didn't do it.</p><p>Next day came a music fest; I had plans to go with my girlfriend and some other friends and decided to have it as ground zero for my test. Second mistake. Thinking back I dont regret it, but I could have chosen better.</p><p>I had 480 mg of 2C-i on me, my friend Jose wanted to do it too, I thought that if I liked it I would have time to give and/or sell a little bit to some of the people I knew were going to be at the event.  Since I didn't have a scale nor did I mix the powder in liquid to make sure I didn't exceed the 20 mg, I went ahead and took a little with a ball pen cap from the bag.  I took this at around 5.15 pm. My last meal had been at least 2 hours prior to that and I felt confident, positive and sure that Id have a great time.</p><p>After getting the tickets we went in. At around 7 pm I still did not feel anything. Thats when I decided to get a little more from the bag. I went to the bathroom and took another bump of what I consider to be 20 mg again. Before I did this I could see some movement on the metal sink similar to the ones I had seen with mushrooms, but very light almost nothing at all. Went back to meet my friends and since I was not feeling anything took an mdma tablet of around 300 mg of weight, probably some 100 mg of actual mdma.</p><p>A little after this I went to get some water and as I was walking I started to feel the same as when I had taken mushrooms the last time, like noticing a change in the perception of everything around me and like a filter is covering everything as if that filter was a moving cloud or mist.</p><p>The first thing I notice was a change in some guys skin color, it when from white to tan to a reddish tan and then his skin began to crawl. As I felt this I hurried back to my people just in case. I usually tend to have a little anxiety attack as mushrooms hit me and I felt kind of the same thing.  As I had imagined the stuff was starting to hit me and there was no turning back.  I was no expecting this shit to be as strong or should I say psychedelic as it is. As with mushrooms I started to feel and see the aggressiveness on everyone around me and it was as if everyone was going to start running to me at any moment; I guess that trying this in a concert for the first time was no the best scenario I could have chosen.</p><p>I told my girl that I needed to be were there were less people, so we walked toward the grass away from the crowd.  I can honestly say that at this moment I became dependant of someone else to maintain my cool. My experience with psychedelics had always had a little touch of paranoia and fear of something was about to go wrong and this wasnt an exception.</p><p>On the other hand Ive always loved the visual and acid dust was as great. Everything looked fantastic and with movement. I saw shapes on everything I stared at. The palm trees looked like furry dogs and the turned to dragons. The leaves seemed to have veins that carried glow in the dark green blood, the clouds swirl and formed shapes and even skulls, the planes seem to slide no fly some in fast motion, some in slow motion and the music seemed to darken the way a saw the color or at times make then lighter again.</p><p>When I laid down on the grass the slope we were on seemed to be more inclined and as I close my eyes started to see colors I had never seen before, a mix of gray with pink, white and purple.  These colors became sort of a map and shapes of arrows were flowing between them. The arrows changed shape and the colors changed too as I talk and thought of my girlfriend. I seemed to be losing frames of what was going around me and for that reason people appear to be walking super fast. The looks people usually give as they pass by became stares and the buildings in downtown looked like they had lungs that had just ran 10 miles. I just could not move out the place I was at for a good 3 hours, so my friends and my girl took turns to be with me. My girl would pass her hand over my head and for some reason I felt her movements to be getting faster and annoying as hell, so I would ask her to stop once in a while.</p><p>The idea of getting in the middle of the crowd again gave me a panic attack at the beginning but after having stared at the sky for most of the time I stood up and walk to the fence to take a piss and then to the spot we had been when we arrived. At this moment I felt great but I was still seeing shapes, movement and colors in every surface. This was the best part of the trip for about an hour as I came down I was super happy and without worries or fears. I enjoyed the visuals even as I got out of the concert but without any downside at all, I wished the entire trip had been like the last hour.</p><p>2C-I is should not be compared to mdma.  It should be in the same field as acid and mushrooms. Even though in my case I was feeling happy most of the time, I cant say if the mdma I took had something to do with it.</p><p>I think this is better than mushroom in the sense that one keeps more control over the direction the trip goes and it is easier to avoid a bad experience. </p><p>AMILNOUT.</p>"
}
