{
 "title": "Arabesques And Thought-Circles",
 "author": "Sebastian",
 "citation": "   Sebastian. \"Arabesques And Thought-Circles: experience with Mushrooms (P. cubensis) (ID 3171)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3171",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 3171",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2001",
   "Views: 7827",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nIt happened in the afternoon of a summer day in 98. In Singen, that's my home town in southern Germany near the border to Switzerland, I met a good friend of mine who told me he had been tripping on mushrooms along with some friends a few days before. I asked him where he got the mushrooms. He told me he got it from a headshop in Schaffhausen, a town in Switzerland, about 10 miles away. I instantly decided to trip that same afternoon. We parted, and I went to Schaffhausen by train. I had planned to buy some shrooms, trip and get back to Germany once the trip was over. Well, this wasn't meant to be. By the way, I had experienced only two rather mild mushroom trips up to this date.\r\nHaving arrived in Schaffhausen, I walked straight to the headshop and got a medium-sized bag of Stropharia Cubensis. I don't know how many grams it was, maybe 3-4 grams. I went to a MacDonald's situated in the beautiful medieval town center of Schaffhausen where there are no cars allowed, just people walking around and shopping in the narrow streets. I got a large Coke, took a seat at a table out on the street and started chewing on the shrooms along with drinking the coke. I ingested the hole bag. It was a hot summer afternoon and I had been on a diet, so the Coke and the shrooms on my empty stomach turned out to be absorbed very rapidly by my digestive system. After about 10 minutes I headed towards a nearby record shop and started listening to records. Then came the moment I noticed the first effects: after kneeling down and looking at some records in a box on the floor I stood up and felt like I would float up to ceiling and landing back on the floor. It was a state of lightness. A strange, tickling sensation started to rush through my body. I went outside and looked to the blue summer sky and felt very strange. I knew that great changes were ahead. That was just about 15 minutes after I had taken the shrooms. I never thought they would hit so quickly. I started to realize that tripping in this town was gonna make me feel veeeery uncomfortable, so I decided to head back to the station and get a train back to Germany as quickly as possible. I bought two records and rushed towards the station. On my way, things started to look blurry in a way you probably know from movies. It's like, the center of your vision is perfectly clear, but towards the edge of your visionary area there's that blurry motion effect like a camera is moving very fast.\r\nI arrived at the station and even managed to look up the departure time and platform of the next train to Germany. It was 50 minutes to go. I arrived at the platform and sat down on the asphalt, feeling totally exhausted and stoned. I was sitting next to a baggage car that had a Diner's Club Advert printed on a metal plate. I looked at the colour dots from a very close distance and saw they were starting to oscillate in parallel rows, with every other row in an opposite direction, like sea waves are often depicted in cartoons. At first I didn't notice at all that this was apart from my everyday experience. At second glance, however, I realized that I was actually starting to hallucinate. I could not believe it. From that moment on, things went really fast. It was about 40 minutes after ingesting the shrooms. I looked away from the baggage car to the dirt floor on the platform. Suddenly, patterns appeared all over the ground. They were of a strange  geometrical kind like I had never seen them before. They looked like giant gear-wheels turning and twisting into each other, interwoven in an arabesque-like matter, ever changing and pulsating. The movements grew faster and more intense every minute. Everytime I focused my eyes on a new spot on the ground, the patterns disappeared for a very brief moment, only to form again in an instant, pulsating and moving constantly. At that moment, I began to panic. I feared I was going to trip so hard that I might end up at intensive care in some hospital, babbling and foaming wildly. The hallucinations became more intense. Everywhere I looked, nothing would stand still. The patterns on the floor seemed to be projected in a mathematical order. It was like a grid projected all over the town, pulsating and slightly shifting like the surface of a soap bubble. The floor started to form valleys and mountains, bubbling like boiling water, somehow reminding me of that Windows 95 black hole screensaver. The cars that were driving past the station all had that grim face, especially the BMWs, who (sic!) looked especially fearsome. The hairs on my arm started waving in unison, like a field of crops in the wind. My skin showed the same patterns as the floor, only in different colours. My arms felt as if they weren't part of my body. The leaves of a nearby tree started to turn into hundreds of sea-horse-like faces with eyes wide open and snout-like mouths opening and closing, all looking at me, as if trying to warn me not to panic.\r\nIn my mind, strange things started to happen. I was caught in some sort of thought-circle. Everytime I started to think about something, it would bring me back to the beginning of my thoughts. There was absolutely no result in thinking about anything. I thought: \r\n10 I feel shitty. \r\n20 I gotta get to my buddy to feel safe.\r\n30 But hey, first I gotta get to his home in Germany. \r\n40 Shit, first I need to get the train. \r\n50 Fuck, the train has yet to arrive. \r\n60 Fuck, that's still half an hour to go. \r\n70 Fuck, that makes me feel shitty. \r\n80 Goto 20\r\nAll the way round, endless times.\r\nStrangely, I had the characteristics of many German dialects in my consciousness. I was not hearing them, I was just having words and sounds of words in my mind like having spoken and listening to them at the same time, although I didn't speak at all.\r\nNext, I had do get past the customs office to get to the train. Although I had already passed the customs and was on the right platform, at that moment I was so totally confused and stoned that I had forgotten where and when the train was going to leave. So I passed the customs office once again. Now picture me looking like a complete freak with pale skin and widened pupils, standing before a swiss customs officer asking him when the next train was going to leave for Germany. I was so lucky he didn't notice anything. Sitting on a bench next to two women on the platform, I tried so hard to look normal that I probably ended up looking even more insane. From then on, things turned out well. I took the train to Germany, got out in Singen and enjoyed the rest of the trip, with the walls of houses dancing and bubbling, and the floor of the streets glowing and pulsating wildly.\r\nWell, all I can say is: don't go alone if you trip for the first time, it might be hard to take, especially if you have to trip hard sitting next to a customs officer for half an hour with no one around to calm you down.\r\nFor me, this experience gave lots of respect for any mystical experience made especially by native tribes taking drugs to enhance their vision and consciousness. I felt very mystical, too. I felt the shrooms had a will of their own. You either subdue to it, or you won't experience their full power. This trip was very much about power.\n\n\n"
}
