{
 "title": "This Can't Be Real",
 "author": "trendal",
 "citation": "   trendal. \"This Can't Be Real: experience with Salvia divinorum (10x extract) (ID 31726)\". Erowid.org. Mar 11, 2004. erowid.org/exp/31726",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 31726",
   "Male",
   " ",
   "Not Given",
   "Mar 11, 2004",
   "Views: 24987",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It had finally arrived in the mail: my 1g of 10x Salvia extract. I got home from work to find the package taped to my bedroom door...my room mate made sure it was the first thing I saw.</p><p>We started out right away taking small 'starter' doses of about 40-50mg each, smoked from a pipe with a butane torch lighter. These doses produced a strange intoxication full of laughter, but not much else. Something FELT wrong with what we 'saw'...but we could not figure out what that was.</p><p>Later that night, I decided to see just how far the Salvia rabbit-hole goes...</p><p>The setting: my bedroom</p><p>Friends present: three of my room mates and one of our friends</p><p>My mindset: I THOUGHT I was prepared for anything...I had read all there was to read about the Sage</p><p>I measured out doses for everyone. Our friend and two of my room mates would be taking doses of 75mg each. My other room mate and myself would attempt a 150mg dose each. All doses were split into two bowls in the pipe, taken with about 20-30 seconds in between tokes.</p><p>I gave my friends thier doses first, the three 75mg ones going first. Then I gave my room mate his 150mg dose. He did not say much, aside from mumbling 'I think I'm almost there'. After waiting a few minutes for them to come back to reality, I got my first 75mg bowl ready and took the toke. Salvia smoke is strangely pleasant, producing an initial feeling as if I am going to choke but which quickly subsides. As I held in the toke, my friend (who had just come off his 150mg dose) prepared the other 75mg bowl for me. After holding the smoke for 20-30 seconds I toke the second toke and handed him the pipe. I was standing in the center of my bedroom, with him standing beside me. The other three were sitting on the edge of my bed. I held the smoke in as long as I could, probably about 30 seconds, then exhaled. As I exhaled I felt a curious tingling sensation on the top of my head. I had time to say, to my room mate beside me, 'something is happening...' and then...</p><p>I was standing in the center of my room, alone. I could not remember how I got there, or why I was there. I was confused, but other than that felt perfectly normal. I noticed that everything was very brightly lit up, as if on a movie set with lighting all around. Yet the only source of light appeared to be my single bedroom light, in the center of the ceiling. I looked at the wall in front of me, and noticed three parallel horizontal lines running accross it. 'That's strange', I thought. As I focused on the lines, they began to widen. Later I would remember this widening as the lines growing into fractal-like bands. At the time, I thought they looked rather like zippers. As this happened, everything in my room began to 'flatten' out into what appeared to be standup cardboard cutouts with pictures of the object on the front. Again, I felt as if I was on a movie set with props around me.</p><p>Suddenly my three room mates were back in the room, but each was somehow attatched to one of the three 'zippers' on the wall. At this point, strange thoughts began flowing into my mind. Each thought would allow me to 'realize' what something was or what was really going on. I understood that these thoughts were coming from an invisible entity - a consciousness - floating behind me to the right. A distinctly female presence. My friends were now 'unzipping' themselves along the wall. As they did so, the 'zippers' came apart to reveal pure blackness behind them - which I understood to be nothingness itself. Panic welled up in me. I could FEEL the female presence much more strongly inside the blackness.</p><p>Suddenly my memory returned. 'That's right', I thought, 'I smoked some Salvia'. I put my arms out as if to steady myself, and said out loud, 'This isn't real, man. You smoked some Salvia, remember? This will all be over in a few minutes. It isn't real.' Now my room mates were standing around me, with extremely confused looks on their faces. One of them turned to me, with utter confusion in his eyes, and said 'What do you mean this isn't real? This IS real...and it's always been this way. You fooled yourself into believing in Reality.'</p><p>My mind snapped. The consciousness had placed the understanding into my mind. This WAS real, and I had known that all my life. Somehow I had tricked myself into never thinking about it...into never seeing the grand Movie Set that I lived in. With this also came the realization that this was THE TIME appointed for the end of all existence. I had always known this time would come, and when it would come, but had again tricked myself into not thinking about it. All existence was about to end, and this terrified me. I have never in my life, before or since, felt the sensation of pure terror. Now I did, and I knew Fear.</p><p>My three friends were now surrounding me and all three were talking over top of each other. They kept asking me to help them, saying that this was our Purpose - to unzip the fabric of Reality at this final moment. I screamed 'Fuck off!' and pushed at my friend in front of me. He is quite a lot bigger than I, so all that happened was I flew backwards to fall on my bed. I remember thinking, in some small corner of my mind, that my friends did not know I was so high and I had just hurt them by screaming 'fuck off'. I could plainly see the hurt in their eyes. I got up from my bed in panic, and now I noticed that my friends' eyes seems strange; it was not really them looking back at me, but the consciousness that I could feel all around me now. This consciousness seemed to be saying to me, impatiently, 'Stop being silly! You must see this, trust me, you will like it!' As I continued to resist, I could feel the consciousness becoming angry with me; not in an evil or violent way but as a loving parent gets angry at a child who will not listen to sound advice.</p><p>I ran from my room, but my feet would not move as they should be. They dragged along the floor, as if some force held them in place. I looked down to notice that my feet were attatched to another 'zipper' that ran along the floor. As I moved, it unzipped behind me. I got out my bedroom door, into the kitchen, and immediately felt a sense of relief. Then I turned to look back into my room, and again was overcome with Fear. Half of my room was completely gone; the walls and floor ended in a jagged line with nothing but pure blackness beyond. I noticed things dissapearing from my room with a silent POP! effect. As each light source dissapeared, the light it gave off went with it. It was becoming very dim. As each sound source went, so did the sound it gave off. It was becoming very quiet.</p><p>Again I ran, through my living room and into the hallway leading to the back door. I tripped in the hallway over all the cardboard cutouts that cluttered it. One of my friends was behind me, chasing me and asking 'Where are you going?' I simply ran on, and screamed 'I have to get out of here!!' I reached the back door, and ran through it. Down the steps of my back porch and into the driveway. I got halfway to the garage and again felt an overwhelming sense of relief. I turned to look at the house...and everything appeared normal. I had beaten it and escaped with my existence in one piece.</p><p>Then, to my eternal horror, my entire house dissappeared with a loud 'POP!' I looked down, and saw five of the 'zippers' coming to a point at my feet. All around me now, in an closing circle, the world was turning to blackness. Finally I succumbed to the inevitable. With tears in my eyes, I crouched to the ground and hugged my knees to my chest. I said, quietly, 'I can't fight it anymore...'</p><p>My world dissappeared. I ceased to exist. There was no long any 'I' in existence. I had only one knowledge: the feeling of 'existence' itself. My consciousness was melded with the Lady I had felt around me, though I had no memory of any other form of being. I simply WAS, and was a part of Her. A thought entered existence, it was Her speaking: 'Now do you see? This isn't so bad.' Later I would think of the feeling I felt as having some benevolent figure stare down at me, arms crossed, utterly satisfied with what She had done. I cannot tell how long this lasted...as time was not a part of existence.</p><p>Then there appeared an intensely bright dot, and a voice was saying 'What are we doing outside?' The dot zoomed towards me, and my room mate's face filled the circle of light. Then everything reappeared. I was standing on my driveway, behind my house, with my room mate standing in front of me. He looked slightly confused, and a little concerned. Again, he said, 'What are you doing out here? Let's go in the house.' I felt a tinge of Fear at the mention of going inside, and I asked him 'What's inside the house?' I could not remember how I had gotten outside, or what had happened to me. I felt strange, and things flickered in my peripheral vision. My friend said 'I don't know...let's go see.'</p><p>As I walked behind him into the house, I noticed things 'trying' to flatten out. If I focused on them and concentrated, they returned to normal again. We went back into my bedroom, where the other three were waiting, and I sat down heavily on my bed. Memory of my experience came flooding back to me several minutes later, and I can still to this day remember every moment of the event. I asked my friends what had happened, what I had done, and their explanation gave me chills.</p><p>They said: I had exhaled my second toke and instantly my eyes opened wider than they had ever seen someone's eyes. One of them said it was as if I was seeing everything around me for the very first time, in awe. I made some strange gurgling noises and waved my hands in front of me vainly. Then I turned a slow circle and proceeded to walk, very slowly, out of my room. They sent my room mate after me, and thankfully one of them had the foresight to say 'Don't touch him...just make sure he doesn't hurt himself. He's THERE'. My friend followed me out of the house and finally asked what I was doing outside. According to my friends, at no time did I say a single word during the entire experience. They said it couldn't have lasted longer than 90 seconds.</p><p>I learned two things from this experience: One, that Salvia is nothing to play with and demands a high level of respect. Two, that I was not, as I had previously told myself, unafraid of death. I realized that I love this existence very much, and do not wish to give it up for quite some time.</p><p>Months later I would find the courage to try Salvia again...and would be 'rewarded' with more strange and confusing experiences.</p>"
}
