{
 "title": "Making Sense of the Senseless",
 "author": "FlowGnome",
 "citation": "   FlowGnome. \"Making Sense of the Senseless: experience with LSD (ID 3174)\". Erowid.org. Dec 13, 2001. erowid.org/exp/3174",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3174",
   "Male",
   " ",
   "Not Given",
   "Dec 13, 2001",
   "25565",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSet: VERY tired from the \n</p><p>Setting: A small rave at a bowling alley (my first rave).</p><p>We entered the rave at the very start, around 11:00pm.  All of my friends were going to be rolling, but I'd been tired of it lately and hoped that I could find something a bit more interesting somewhere at the rave.  My hopes were fulfilled.  I told the guy I wanted 3 hits, and he asked me to buy at least 20, but I didn't have the money.  He told me 3 would be fine, so I tore what appeared to be 3 hits off of what I thought was a 10 strip (it was unmarked) and took it.  About 15 mintues later, I realized that he had wanted me to buy 20, and the 10 strip looked a bit wide, and...you get the picture.</p><p>All times except start are estimated, because I was really not paying that much attention.</p><p>12:35am - Took the acid.</p><p>01:30am - Definitely going to be an interesting night.... I don't sweat that much normally.  The floor was breathing and fractals were appearing in the wood.  Time slowed extremely, was actually wishing there were lights on in the room so I could see my visuals better. :-)</p><p>02:45am - Sat down for a while.  As usual, my friends who were rolling were bitching about the music or something and blaming it for 'killing their roll.'  Perhaps the fact that ecstasy only peaks at around 3 hours or their negative attitude is what actually killed their roll, I'd say.  My arm was pulsating and there were little black worms crawling all over it into my skin.  This made me happy, because I'd been wanting to get a larger dose of acid at some point.</p><p>03:00am - Went to bathroom.  Mental note:  Don't go in that bathroom again while tripping.  Sinks overflowing, somebody shit on the floor in the stall, puke in water-filled sinks overflowing.  Didn't especially bother me, but the fact that it didn't bothered me more, because it normally would have.  </p><p>03:30am - Like I said, this was my first rave.  When I first arrived, I remember that the first thing I noticed was that nothing made a damn bit of sense.  It was completely silly to an extreme I had never seen before.  Suddenly though, I looked around, and it made absolute sense.  Not that any group of people there fit together, it was just that the whole thing made sense.  It wasn't about 'PLUR' like everyone says.  There were many people there being mean or rude, and many being very nice.  There were the same ratio of nice people to jackasses that there is everywhere else I go.  The way it made sense was the same way a crowd of people walking down the street makes sense.  It was just another thing people do.  As with many acid headed thoughts, it is impossible to describe in English.  One thing I distinctly remember was laughing my ass off at the thought of massive groups of people being incredibly impressed by somebody swinging around glowsticks on a string.</p><p>04:00am - Began watching the DJ.  I saw the passion he put into his music and realized one of the things I have been missing in my life for a long time.  Passion for what I do.  Vowed to change this, and have been so far.  At this point, glowsticks were leaving tracers that consisted of the color of the glowstick and bright neon purple writing in some asian language.  </p><p>04:15am - Could feel the bass with every single hair on my body, and felt electrified by it.  Dripping with sweat as well, even though I was just standing there.  I had several important realizations about my life that I won't really discuss here....</p><p>04:30am - Danced a while.  The floor seemed to be covered with water or something slippery that was keeping me from dancing properly.  Sat down and watched the lights, which immediately began burning, with long colored flames rising into the air.  Greeted a friendly police officer as he walked by.  Absolutely no paranoia.</p><p>05:00am - Watched the DJ some more, and felt my fingers melting together.  Hmm....  Wow, the guy who sold me the acid was getting the next record for the DJ.  What a small world. :-)</p><p>06:00am - Just spent the last hour watching some friends dance with lights. </p><p>06:30am - #1 way to fuck with someone who took lots of acid:  Turn on all of the lights in the building suddenly, after it has been dark for the past 7.5 hours.  Wow.  Time to leave, so we went outside.  That was when I truly realized how much acid I had taken.  The sun had risen and everything was a beautiful ultra intense pastel color.  The clouds were rippling and shooting across the sky at extremely high speeds.  I was cold, so naturally the trees became covered with frost and icicles.  The condensation on the windows of the car turned to frost, too (it didn't, I verified it with my friends), and slowly melted as I warmed up.  On the drive home, houses in the distance were pulsating and sinking into the ground, and a radio tower duplicated itself about 99 times, filling the horizon with copies.  Thought a lot about my life on that ride, until about 10 minutes from home when I thought a lot about peeing. :-) Felt, smelled, tasted, and saw a smell at the same time.</p><p>08:00am - Back to the dorms, time to sleep.  I can sleep on basically any amount of anything if I feel like it, and since I had only slept about 5 hours the night before I definitely felt like it.  Still patterning on walls, and hearing and seeing techno with my eyes closed.</p><p>Slept till 1:00, and woke up feeling EXTREMELY happy about where my life is headed.</p>"
}
