{
 "title": "Got Lost in Art, Found Myself in Amsterdam",
 "author": "CleanseSoil",
 "citation": "   CleanseSoil. \"Got Lost in Art, Found Myself in Amsterdam: experience with Mushrooms - P. cubensis & Cannabis (ID 31779)\". Erowid.org. Jun 19, 2007. erowid.org/exp/31779",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "30 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "31779",
   "Male",
   " ",
   "Not Given",
   "Jun 19, 2007",
   "3111",
   " "
  ]
 ],
 "report": "</p>\nLast autumn, me (A), and three of my best friends (B,T+R) went on a trip to Amsterdam. Being 17 it was the first time we had left the country without supervision of adults. We were only there for three nights and decided we were going to trip on the second night. So far the holiday had largely been made up with touring coffee shops, and getting very stoned. It was time for a change. We found a smart shop, very stoned we inquired about the mushrooms. They had various boxes of mushrooms, each containing 30g of various types. After much deliberation we chose to buy some Colombian Cubensis mushrooms. I asked the man at the counter if 30g was a good dose, Yes, for the best effects! Being quite stoned we didnt realise the implications of these words. Bearing in mind none of us were remotely experienced trippers, we have all tripped before, but only on small doses of philosophers stones. R decided to abstain, and me B+T bought 30g of Colombian cubensis EACH!!</p><p>We decided we would start our trip at the Van Gogh museum, Van Gogh on mushrooms, could it be more perfect? So we missioned it over to the museum district. At 4.20 in the square outside me B+T munched our 30gs in some bread rolls, this took absolutely ages, as there were so many mushrooms! I was already feeling a mild high by the time we finished munching. We went into the museum and absorbed ourselves in art. Slowly the paintings started to look more interesting, beautiful textures and colours. As time went by, the pictures started to move, slowly at first. I soon found I could control the movement of the pictures and before very long I could completely emerse myself in the pictures. Each picture was another unique world, which opened up at my will, expanding and contracting as I wished it to.</p><p>Coming between pictures I noticed that the gallery itself was not moving as the pictures were. I noticed there were many people around me, but rather than being self conscious; I thought how funny it was that I was experiencing the pictures at such an immensely more interesting level, it was hard to suppress my laughter. I saw myself gawking at these pictures in my blue tie-died t-shirt; the image was so funny. I was slightly nauseous, but I suppressed this. Guilt about schoolwork started to float up from the back of my mind, but I pushed these thoughts back where they came from. I was having too good a time to worry about that crap.</p><p>We decided to leave, T+R went out before me and B, when we werent with them I felt hugely paranoid we would loose each other and be lost in Amsterdam without a sober person to guide us. Fortunately they were waiting for us outside, my joy at seeing them again, coupled with the pure excitement of being in Amsterdam, gave me huge joy. Everything was swirling, the only thing not moving were my friends, me+B+T were grinning our faces of. We took a few photos, in this trippy paradise, this work of art that is Amsterdam. The museum district was full of interesting stuff, so we decided to have an explore.</p><p>We walked around for what seemed like an eternity, the funny thing about Amsterdam is the canals make just about every street look the same, although different, which was very confusing. I was convinced we were lost, but not in a bad way. As we walked thoughts flew through my mind, too many to count, I felt very connected with the universe, I felt I was in my right place. I frequently realised I was standing in the middle of the road trying to get my bearings, as bikes and trams whisked past me. Im very lucky not to have been run over that night!</p><p>We decided it was time for a spliff, so we went to the first coffee shop we found, I cant remember which, it was a nice little place though, we hadnt been there before. We sat down by the window, and a waitress came up to serve us, it was now that I started becoming self conscious, we were tripping our nuts off. I found it very difficult to order, but managed to stammer out orange juice. After I left I started wondering why she was serving us, why she was working and we were using their café to smoke in. What gave us that right? I started to go through a very guilty stream of thoughts, I felt bad for being here, why should we use and abuse this country as our playground? I could hear a buzz of conversation, but what I heard of it was literally double dutch. I became increasingly paranoid. The waitress came up with our drinks and change. She handed me my money, I couldnt comprehend it was mine and kept asking the others whos money it was. Nobody seemed to know. Meanwhile, my sense of guilt and fear escalated, and the nausea returned.</p><p>Suddenly I felt myself retching, I ran to toilet holding the vomit back. I charged into the toilet and projectile vomited 30g of Colombian magic mushrooms into the toilet, it was with such a force that it splattered up all over the cubicle and right up into my face. This was a moment of pure agony; I had defiled the nice Dutch peoples toilets now. I looked up and saw graffiti all around the cubicle, the scrawl seemed to be flying around me and taunting me. I tried to wash the vomit from my face, but I found the taps didnt work. At this point I was reminded very much of the film Trainspotting. I left the toilet in total despair; the guilt was utterly overwhelming now. I was much too scared to tell the owners what I had done though, too scared to even tell my friends what I had done and tripping to hard to even think about leaving.</p><p>Hey, who made the mess in the toilet? We suddenly heard, it would have been absolutely impossible to lie. I stood up, owned up, and apologised profusely. They filled up a bucket and asked me to clean up my mess. The fear was still running through me so I agreed. I started the job, and suddenly realised this was curing my guilt, in fact I was quite enjoying it. I accepted that what I was clearing was only something that had come from me, it was only nasty because thats what I have been conditioned to think. I was wallowing in the toilet, joyful, I realised that I can redeem myself from bad actions with good actions.</p><p>I left the toilet in a jubilant state and thanked the owners profusely. I washed my hands and face, in the kitchen sink (which worked!), that produced an absolutely euphoric feeling. I went to the front of the shop back to my friends, who (excluding R) were extremely paranoid and undoubtedly experiencing the same guilty thought spirals I was having earlier. B had emptied his pockets out on to the table; the feeling rubbed off onto me, and from when I looked round it seemed like the whole coffee shop, everyone seemed to be very depressed. T left, a sense of doom filled me as he did, how will he get back on his own? etc etc. I picked up my coat, which was very difficult to navigate; it seemed to be liquid.</p><p>Outside, T was waiting for us; somehow we managed to return all of Bs possessions to his pockets, which included money and his passport. T said one word, hostel. The only safe place in this whole city. We walked, as we walked I realised that the city was far too much for me to take, I contemplated leaving this place as soon as possible, flying back to England so we could be safe at home. The people, the trams, the bikes, everything was doing my head in. I contemplated ending it all, I was about to walk out in front of a tram, I thought thats the perfect way for a stoner/druggie (i.e. me) to go. But then I thought, well whats death? Ans. Probably nothing, and whats life? Ans. Absolutely everything!! And why wouldnt anyone want anything!!</p><p>We got back to the hostel in one piece, the feeling when we got there was so nice, safety. We went upstairs and remembered the advice to drink sweet things to stop tripping, we shared a bottle of lilt and slowly but surely came back to reality. It was still a bit of a sketchy ride, I was convinced I was going insane at one point, but that quickly passed after telling myself that everyones already completely insane.</p><p>Finally, we landed. I realised I was myself again, with all my unique idiosyncrasies, and leapt for joy! I felt like my mind had been purged of all the baggage, pointless thoughts, it had collected. I felt like a new person, I realised how depressed I had been before this trip, and how much more I appreciated life now. This trip taught me to appreciate life, I have never lost the overwhelming happiness and insight into my self and life I gained, which I have only touched on here, the amount of stuff I realised could fill several books, serious. This was a rollercoaster ride of a trip, and although it was brilliant, for its highs AND lows.</p>"
}
