{
 "title": "Asynchronous Synchronicity",
 "author": "Jamshyd",
 "citation": "   Jamshyd. \"Asynchronous Synchronicity: experience with DiPT (ID 31798)\". Erowid.org. Mar 12, 2004. erowid.org/exp/31798",
 "substance": "DiPT",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "13 mg",
   "rectal",
   "DiPT",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31798",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 12, 2004",
   "Views: 14150",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>DiPT was the first Tryptamine that I was completely drawn to from research. It seemed very unique and very insightful. So, you can imagine how happy I was when I finally got the chance to sample it yesterday. </p><p>For me, rectal doses for every drug I have taken have twice the potency of oral ones. So for the equivalent of 26 mg oral, 13 mg of DiPT hcl were (very easily) dissolved in saline solution then loaded in a sterilized needle-less syringe. The solution was then administered rectally, with a hint of discomfort for the first minute, but the discomfort didnt last more than that. </p><p>By 10 mins I was definitely off baseline but it was a very subtle effect. 10 mins after that, I started having a peculiar ear ringing that sounded like it was coming from the back of the head. These ear twinkles came in waves for the next 30 mins. These where accompanied by slight intestinal stimulation for the same amount of time. ~ 1 hr into it, I had plateaued to a light ++, and was pretty happy. This is a very, very good mood-enhancer, with a very non-threatening and soothing attitude towards the body. Head was clear but I could definitely tell I was altered. But I am jumping ahead here is what happened in detail.  </p><p>At T+30 I decided to go for a walk. I took my MP3 player with me, but I didnt put music on for a while. I wanted to see if I could detect any changes of sound in regular city sounds. It seemed that so far, here was the aforementioned weird tinnitus waves, and sounds seemed to be enhanced in a way similar to what cannabis does. There was obvious sound euphoria. I put on my music and it sounded a bit different but I couldnt put my finger on it. As time progressed, music started getting more and more different. It seemed like it was playing in both normal speed and slow-motion at the same time. </p><p>However, as interesting as the sound distortions where, what really got my attention was how this drug was acting so much like MDMA. There was what I deemed the Clockwork Effect with MDMA  that is, everything in the world seemed to exist in synchronicity with everything else. All movement was in harmony with all other movement, including my own, and the music. What I liked MORE than MDMA, was the fact that the distortions caused by DiPT also effected that Clockwork Effect, in that everything was synchronous to the distortions! There was some light rippling in reality and this rippling, unlike the randomness of 4-AcO-DET, was also in-line with the sound distortion. I can only describe this drug as something defying the laws of physics and metaphysics. </p><p>The magical walk lasted about 40 mins, and by the time I was home (~T+1:10), I as at the strong ++ I mentioned above. I sat down on my PC and had some lovely discussions with friends, while listening to all my favourite music and hearing it as if for the first time. I will note that this material also has tactile enhancement like Iprocetyl, but these were also in-line with the sound distortions. The Plateau lasted for another 3 hours, and very gradually dwindled (it was subtle to begin with). I knew I was close to baseline because the Clockwork Effect, as with MDMA, was gone by the end of the 3rd hour. However unlike MDMA, there is no post-trip stimulation (in fact, the after-effects were relaxing), and thankfully, not a hint of a crash. I will also mention that DiPT provided me with an awake-but-languid state of mind with some insightful but light trains of thought. There were some slight stomach discomforts at a few times but they are negligible. </p><p>I will make a note on the audio effects now. Although they are the most noticeable of the package, they are by no means the most interesting. With my dose and method of administration, these effects lasted all day till I went to sleep. Today (the day after), they are totally gone. The easiest way for me to demonstrate them to someone who had not experienced this compound, is point out the end of Madonnas Hollywood song (to pick a popular example that most people probably heard on the radio). Her voice keeps thickening as she repeats the same phrase over and over. With DiPT, his happens to everything, and it is not a flat thing, it is as if every sound is constantly *in the process* of slowing down. You just never really get used to the effect. And that is why I really think that this effect is not mechanical (ie. Neurological/chemical), but a psychological one. </p><p>To ME, DiPT is superior to Iprocetyl in terms of psychedelic effects, and far superior than MDMA. Mind you this is NOT an MDMA substitute. It is guaranteed to disappoint most if not all casual MDMA users. I am very happy that DiPT is not appreciated by the masses, because that way it has more  of a chance of not being smitten by prohibitionist laws and greedy drug dealers. This compound, IMHO, is a blessing. I will be trying it again in the future, perhaps at a dose that is a bit higher, but not too high.</p>"
}
