{
 "title": "Best (Most Utile) Drug Ever!",
 "author": " SIGNALJAMMER",
 "citation": "    SIGNALJAMMER. \"Best (Most Utile) Drug Ever!: experience with 2C-C (ID 31796)\". Erowid.org. Mar 15, 2004. erowid.org/exp/31796",
 "substance": "2C-C",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31796",
   "Male",
   " ",
   "Not Given",
   "Mar 15, 2004",
   "16854",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>25 mg 2c-c oral</p><p>300 lb.  (With cycling season coming on I will see 290, easy)</p><p>Best (most utile) drug ever!</p><p>by:  SIGNALJAMMER</p><p>Mr. Shulgin, I have never regretted living in a republic before, but you sir, deserve knighthood!  Even 'though I am against graven images, we should construct new, but common denominations of our currency so we can put your visage upon the back.  Wife goes on front.</p><p>Everyone else, sell that second car or pied-a-terre to stock up on this substance in advance of the inevitable ban, not that it is addictive, but that it is so good in every way that it puts the lie to the propaganda of prohibitionists to a degree that would force them to get real jobs and attempt re-integration into society.  That's it--REHAB FOR NARCS.  Also, do not come up with a cool name or this stuff, like, say, PLEXUS, that would only hasten the day.</p><p>Experience Part:  record: Pet Sounds.  Paul McCartney says this is the 'best album ever.'  Of course this is one of the few non-mawkish, non-disingenuous things he has ever said, but he doesn't tell us why:  Rock and Blues are mostly about FUCKING, P.S. is about ROMANCE.  This analogy also properly places 2c-c in the pantheon  of hallucinogens.</p><p>Body load: Borderline perceptible.</p><p>Panic: None.</p><p>Sympathetic stimulation: Minimal beyond expectation.</p><p>Bonus effect: Keen insight into the human condition, particularly one's own.  I have never done MDMA, because I have spent years locked up as a 'house husband,' in a region of the country (chi-chi neo-fascist NW Chicago suburbs) that no cool people who grew up here would want to afford, and I am a strapping honkey who has the relaxed mien of an uber-narc.  But back when I was cool, early eighties, say, a friend provided me with a little MDA, which is, I am told, similar.  That was fun, got a spooky headache-like feeling toward the end.  The most untoward feature, 'though, was the empathy it drove me to feel toward my associates, (I remember a poignant session of gazing at snaps) some of whom I knew for certain, in a clearer light, were a--holes.  </p><p>This drug provides one with a keen, clear insight into oneself and one's kinder.  $$$$ worth of psycho-analysis. Other hallucinogens I have imbibed were, lysergide, which was speedier, more (this was my first 2c-c experience, so, regrettably, I intentionally underdosed) florid, and sometimes of a duration that made me want to get some tricyclics and 'hit the switch,' and psilocybin, which is quite a ride, but features nausea and panic on the way up, and sometimes turns me into more of an egomaniacal bastard, which really, is not a direction I normally need to excurd upon from baseline.</p><p>Insight sans self-pity or other-pity.</p><p>Hangover:  Trivial to non-existent.</p><p>I subscribe to all the things the prior reporter ('A Very Pleasant Ride' by BLAZE) had to say, he was probably more articulate and objective, I would only add a 'here here!'</p><p>and another thing. . .</p><p>Malcolm X, the prophet, said something to the effect that 'the only thing wrong with using drugs is that one wakes up the next morning--still poor.'</p><p>This has always struck me as crystal-clear.</p><p>2c-c is the only substance I have encountered that contradicts this assertion, to any degree.</p>"
}
