{
 "title": "Comfortable Places",
 "author": "Pinkfloyd25",
 "citation": "   Pinkfloyd25. \"Comfortable Places: experience with Salvia divinorum (10x Extract) (ID 31810)\". Erowid.org. Jun 19, 2007. erowid.org/exp/31810",
 "substance": "Salvia divinorum (10x Extract)",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 31810",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 2458",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was at my buddies place and a bunch of friends were over. Nobody had tried salvia before. Most of my friends had never heard of it. I told them that what I had heard: That it was like acid or shrooms, but it only last for a couple minutes. Some of the people there had tripped on acid and shrooms before and so we were all excited. I offered the first hit, and explained the dose (one pinch) and the most important rule, 'Pass the bong fast so you don't drop it.' The bravest of us took the first hit, but felt nothing. He thought that it was far from a trip and much more like a whippit. I was dissapointed so I decided to go next. I increased the dose to a couple of pinches, then I scorched the bowl and took one of the biggest hits I can credit to my name. I passed the bong to a friend and held the smoke in for as long as I could.<br>A friend sitting next to me asked 'OK?'. <br>'Yes, but don't leave', I replied while still holding my breath.<br>I felt my arms melt into the chair and my legs going numb. Later I learned that I had stood up and said 'Wait don't go!', but I dont remember that. Turns out, I was the one that left. My consciousness shot straight into another dimension, while my body collapsed on the plastic patio table. Its difficult to describe what this other dimension was without tarnishing It with our own reality here and now. To make a comparison is absurd, but what other choice do I have?<br>I was no longer I. I had no body, but was most certainly aware of myself. I could 'see' in all directions at the same time, but for only what seemed to be a few meters. I was surrounded by relatively gigantic psychedelic cells. I could move, although I found it very difficult and the cells were oppressive. They would give way as I pushed through them and on the other side I found more. I felt suffocated in an eternal sea of psychedelic cells. I quickly discovered that there were certain spots that felt very comfortable. These 'comfortable' places amongst the psychedelic cells were relatively impossible to distinguish from the regular not 'comfortable' places. They looked like any other spot surrounded by cells constantly cycling though color.<br>I could only recognize by feeling that I had found such a place while wandering. Because moving (I can't call it walking because I had no body) was exhausting I found it very desirable to rest in one of these spots. However the spots, once found, did not last long. Having tasted of the fruit I could not bear to have it leave. Despite the difficulty of traversing the psychedelic cells I push forward once again at random. Eventually I would regain comfort and peace at one of these spots only to have the feeling leave again. I spent an eternity doing this. I completely forgot my name. I forgot what it was like to be human, to have a body with legs and arms. I forgot what it was like to see in only one direction at a time. I forgot everything and existed for a lifetime, searching for comfort and peace at random. Somewhere that existence ended and I jumped right back into my body on the floor of my friends patio. It took a little bit of time to remember where I was. <br>I wouldn't call Salvia Divinorum a party drug. But my experience with it has been invaluable to me. This world may seem a great deal more complicated that an eternal sea of 'psychedelic cells'. But we all spend our time doing the same thing. Searching for a 'comfortable place' that we know is there, but lasts for only a short time. Then go searching again for more 'comfortable places'. I can't help but look at my life today as parallel to my existance in that other dimension. That place I visited for 2 minutes, that lasted a lifetime.\n\n\n"
}
