{
 "title": "LSA, All the Way!",
 "author": "Kdub",
 "citation": "   Kdub. \"LSA, All the Way!: experience with Morning Glory & Tobacco (ID 31811)\". Erowid.org. Jun 1, 2007. erowid.org/exp/31811",
 "substance": "Morning Glory & Tobacco",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "350 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   " ",
   "  repeated",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31811",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 1, 2007",
   "Views: 3887",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>LSD being all but extinct in Central Florida, I decided to dose on its red-headed step child, LSA. After all, how much of a difference can one letter make.</p><p>4:00pm - I dumped out all of my seeds into a huge pile, and began counting out my dose. It's a tedious task, so I lit an encouragment cigarette.</p><p>4:15pm - My eyes are crossed from counting all those little black seeds, but I finally finished. I lit a celabration cigarette, and started eating.</p><p>4:30pm - I finished choking down the store-bought seeds, funguscides and all. Smoked an accomplishment cigarette.</p><p>5:00pm - It's been about four cigarettes since I swallowed my last seed, and I'm starting to feel somthing. Mainly horrible nausea, and a pain in my legs.</p><p>5:15pm - My cell phone rings. I miss the call, because for some reason I can't tell where the ringing was coming from. My complete lack of sound perception was the first sign of the trip to come. </p><p>I pop in a favorite movie of mine, 'GO'.</p><p>5:45pm - I got into the movie, and the next thing I knew, I noticing undeniable, acid-like visual distortions (though they were relatively mild). All of the characters in the movie had the primary colors shooting out from their sillouettes. Everything seemed really 'pixelated'.</p><p>6:10pm - I looked around my living room, and I felt like I was in a pastel painting. It was beutiful, yet simple.</p><p>Spent about ten mintues staring at my A/C vent, watching it spin into itself. Pure insanity.</p><p>6:25pm - My nausea had almost completely subsided, and I was having a pretty decent trip. I put on some tunes and explored my house. I was captivated by just about everything I walked past.</p><p>7:00pm - I layed down in my bed, and the peak of my trip was becoming surprisingly strong. I noticed a single geometric pattern spining, taking up my entire field of view. My feelings of 'Wow, a pattern' turned into 'This pattern is God, I must listen to God', and eventually to complete ego loss.</p><p>9:00pm - The pattern started fading, and I was slowly re-entering reality. There were still tracers-a-plenty, and lots of other noticable effects.</p><p>10:00pm - I'm just about baseline, with an empty pack of cigarettes.</p><p>**Comments**</p><p>Surprisingly good trip. It doesn't compare to acid in intensity, but it's the best high you'll find in Home Depot.</p><p>Though the pattern was pretty good, there was only one. The entire trip, I was staring at the same 2-d pattern.</p><p>I may have downplayed the nausea in the report, but it is really bad. I threw up at least five times. But it will eventually subside.</p>"
}
