{
 "title": "Look Before Leaping",
 "author": "Ecomiendrio",
 "citation": "   Ecomiendrio. \"Look Before Leaping: experience with Salvia divinorum (ID 3187)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3187",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2.5 leaves",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3187",
   "Male",
   " ",
   "Not Given",
   "Dec 23, 2001",
   "Views: 7920",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI got some dried salvia divornum leaves today.  I was feeling bummed about my dream-woman standing me up on a date and I was going to quit fucking around and tell her how I felt.  I hadn't tripped in about 10 months and its not a good idea to trip depressed.  I deserved to have a bad experience. </p><p>Guessing that this salvia was a hoax, and having 15 minutes before my next class, I sat down at a table in the shade and packed a couple leaves into my trusty corncob (its usually for tobacco.)  Salvia tasted pretty bad, but not too bad, and they burn REALLY well.  About 30 seconds after my first hit I looked down at my watch and it sort of looked 'different.' I freaked out, but then I 'remembered' I was stoned.  That idea only lasted for a quick second, until I finished my pipe.  Then I knew Salvia was something.  </p><p>I felt this weird sensation, things were just weird and I felt like I didn't belong in the normal universe.  Everything seemed to be more alive, more intense.  It was almost like I could feel the potential energy in every object.  Realizing that the Salvia was indeed doing SOMETHING, I decided to try and close my eyes, since Salvia only teaches in the dark.  Just as I closed my eyes I felt a sensation of flying, only not of my own will. Right before I got somewhere, all these sorority girls came walking by, breaking the journey.   Even as I opened my eyes, I felt like there was this weird presence/force surrounding me, pushing (forcing?) me to go deeper into the shade and lie down.  As soon as I got there I could feel the presence receeding. It quickly let up and I felt really restless... I started walking and I wasn't sure where I was going.  I passed my building several times and when I got to class I was squirming a lot at first and had to keep getting up to go get water.... </p><p>The intense part only lasted a few minutes but I definitely know this is a drug to respect. It should not be smoked like weed... I'm looking forward into trying this alone and in the dark, its supposedly a lot more intense and my urges seem to back that up.  I could learn a lot from something this powerful. I can scarcely imagine the awesome power of enhanced leaves and extracts.</p><p>I arrogantly entered Salvia's threshold without warning or due respect.  The presence let me put my foot in the door but then slammed the door on it.  </p><p>The best news of the whole trip is that it was so bizarre that I didn't think of L for the rest of the day!</p>"
}
