{
 "title": "An Accidental Low-Dose Breakfast",
 "author": "Um Brella",
 "citation": "   Um Brella. \"An Accidental Low-Dose Breakfast: experience with Morning Glory & Alcohol (ID 31906)\". Erowid.org. Nov 15, 2007. erowid.org/exp/31906",
 "substance": "Morning Glory & Alcohol",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   "  T+ 10:00",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31906",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 15, 2007",
   "Views: 3591",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Around 8 a.m. one Sunday morning as I was sowing various seeds in a planter, I found that I had far more Heavenly Blue MG seeds than space to germinate them.  Rather than throw them away, I started chewing them and swallowing, one by one.  I had read that a threshold dose was between 50-100 seeds, and I had also read elsewhere about certain positive, mild effects of low doses of psychedelics.  MG seeds have very little taste, and I was so into the planting I was doing, I sort of forgot I wasn't munching on sunflower seeds.  When I stopped, to my mild dismay, it seemed I had eaten 20-25 seeds.  I finished what I was doing, read a little, and then my wife got up and she drove me to the local coffeehouse where I do my freelance proofreading work.  I completely forgot I had eaten the seeds.</p><p>At around 11 a.m., as I was working, I noticed I was blinking a lot, and my vision was kind of blurry.  I also had an unsettling sensation, a displaced, restless, anxious kind of feeling.  I was breathing deeply but not getting full breaths, and I was starting to skip over what I was supposed to be reading.  I couldn't concentrate.  Then I remembered the seeds.  I wasn't too worried because I hadn't eaten enough for a psychedelic dose, but I wasn't happy to realize that in the middle of a Sunday morning coffeehouse I was experiencing that first anxious rush of regret and fear that has always accompanied my psychedelic experiences.</p><p>I got up and walked around, went outside to try and clear my head, but the feelng persisted of course and I realized I had probably just ruined a day's work for nothing -- I wasn't even going to trip.  And that's pretty much what happened.  I continued working, but was only maybe 25% engaged in it.  I sighed a lot, and my vision got worse, and I just plowed through regardless.  Definitely unpleasant to be stuck in that 'beginning' phase where it's all body effects as the flesh adjusts, yet without the promise of mental breakthroughs forthcoming.</p><p>Sometime around 3 in the afternoon, the effects subsided.  Around 6, I finished 'work,' which had taken all day instead of the three hours it should have, and met my wife at a bar.  I drank a Guinness and became chatty and philosophical.  I didn't tell her about my experience as I felt I would merely be telling her I was stupid.  I switched to alcoholic cider and after two of those, the 'tripping' feeling crept back, a faint flicker of the breakthrough part, not the somatic unpleasanness, and stayed with me for the next two hours, during which I was wittier than normal and made those around me laugh quite a bit.</p><p>I include this report as a note to those who want to be careful and start with a very low dose.  For me, it was initially worse than tripping for the reasons I've described, yet the very late addition of alcohol did resurrect a faint glimmer of a positive psychedelic experience.  I 'bracketed' a psychedelic trip with the first and final effects, while skipping the juicy middle part.</p>"
}
