{
 "title": "Dream Drugs, Herbal",
 "author": "Wasabi",
 "citation": "   Wasabi. \"Dream Drugs, Herbal: experience with Catnip, Tobacco, Lactuca, Mugwort (mixed equally) (ID 31900)\". Erowid.org. May 12, 2005. erowid.org/exp/31900",
 "substance": "Catnip, Tobacco, Lactuca, Mugwort (mixed equally)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Catnip",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Mugwort",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Lactuca - L. virosa",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31900",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 12, 2005",
   "Views: 22629",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First, a bit about myself: I am a student in Berkeley CA, which really is, for lack of a better word: a psychoactive hub. Everything, it seems, is either being sold, grown, prescribed, or invented right here. And I myself have been studying psychoactives ever since I started highschool and smoked my first joint. An area of particular interest to me is drugs that affect sleep and/or dreaming. Drugs that either are only active during the deep stages of sleep, or drugs that cause waking dreams. There are probably hundreds of prescription drugs that do this (benzoids, Ambien, Rohpynol and it's relatives), but I have discovered at least a couple TOTALY LEGAL, very effective herbs that produce amazing effects on the sleeping mind.</p><p>The mixture I find works best is to get a hold of pipe tobacco, wild lettuce, catnip, and mugwort, and mix the four ingredients evenly. I tend to use a waterpipe with a gigantic bowl attached to it for smoking, but hypothetically the herbs would also work in a tea (minus the tobacco, obviously!).  After smoking a couple of these, the effects on a conscious mind are minimal. Some strong relaxation, a sense of physical and mental calm... but nothing hallucinatory. However, the night after I smoke it, I will have amazingly vivid, lucid dreams. I will know I am dreaming, and can gain control of my subconscious mind and guide the events of my dreaming. Not to mention that the dreams are virtually always remembered completly the following morning. The wild lettuce and mugwort are the two most active ingrediants for the sleeping effects, and I have made an extract of these and smoked it to great effect, but it is not nessesary and adds nothing to the expierance except making the required dosage comparatively small. I have no idea how these drugs work, really, but I am curious if anyone else out there has noticed the same effects as I have. It is important that people interested in altering their mind know that there is a lot m</p><p>ore options out there than just the hyped-up illegal street drugs. Although what is legal is rarely as powerful as controlled drugs like LSD or mescaline, herbal psychoactives like what I just discribed can offer very interesting insights to the mind if taken by a mature and curious user.</p>"
}
