{
 "title": "Rainbows",
 "author": "Rad",
 "citation": "   Rad. \"Rainbows: experience with 2C-T-7 (ID 3193)\". Erowid.org. Oct 10, 2000. erowid.org/exp/3193",
 "substance": "2C-T-7",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3193",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 10, 2000",
   "Views: 6618",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA friend approached me at a house party last summer and asked me if I'd like to try 'something new.'  I asked him what it was because I don't normally take anything without doing research first.  Many of the other kids at the party were on E or drunk.  He said 2C-T-7, which meant nothing to me at time.  And then he said it was free.  So, he gave both me, my boyfriend and the guy whose party we were at (Scotty) a free 20mg dose and told us to put in in koolaid.\r\nScotty and I both took half (roughly) since we didn't know what it was going to do and my boyfriend took the whole thing.  Thirty minutes later I felt a little something and my boyfriend (Dan) was running around like he was on speed, so I took the rest.  Right after I took it Dan sat down with his head between his legs saying he was too high.  I talked him through it and we took a walk (about a half mile) to the grocery store.  Things looked funny, surreal.  We got some hard candy and left.  I knew I gave the cashier a funny look and I had some trouble figuring out how much money he wanted.  We walked home high as a kite, and Dan told me his life story.  I could talk but I had no desire to try.  We sat back down in front of Scotty's house.\r\nBy that time I was getting noticable visuals and I had a pleasant body-high.  Everything that moved had rainbow spiraling away from it.  Wow.  Dan and Scotty didn't see anything until I pointed out that everything was covered in rainbows.  We all sat outside Scotty's and grinned at the rainbows.  It got cold so we went in where the DJ was and sat on the floor.  Me and Dan stared at each other for a while, we both appeared as animals to each other.  He had the head of some kind of antelope and I was a cat.  Whoa.\r\nScotty came over and we all pressed our hands against each other and felt an 'energy transfer' as if we could feel the feelings of the other two people passing between our hands.  Most of the rest of the evening I laid on the couch with my eyes closed exploring a vast expanse of tunnels and open fields and forests.  In my head I became a cat and I was hunting.  At a little after dawn the visuals died down enough to go back to Dan's.  I was unbelievably cold and I took a nap and went home.  He had to work.\r\nThe next day my mind was sharp.  I had intelligent conversations and this was surprising because everything else I've been on leaves me unable to think the next day.\n\n\n"
}
