{
 "title": "Flashback?",
 "author": "A",
 "citation": "   A. \"Flashback?: experience with LSD (ID 3194)\". Erowid.org. Dec 16, 2001. erowid.org/exp/3194",
 "substance": "LSD",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2000",
   "ID: 3194",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2001",
   "Views: 6467",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nHave you tried LSD?</p><p>  yes</p><p>Have you had a bad trip on LSD?</p><p>  yes</p><p>Have you ever experienced flashbacks?</p><p>  yes</p><p>Do you feel that the bad trip and the flashback were connected?</p><p>  not sure</p><p>I have taken LSD, maybe 30 to 40 times, in a 2 year period.  This was about 5 years ago.</p><p>The last time I took LSD, I saw my friend take a running leap off a 3rd story balcony.  Needless to say, this quickly turned into a bad trip.  Even hours after the ambulance took him away, I could hear his voice calling my name and asking me to help him.  This went on until I started to come down.  I've also had other, more mild, bad trips.  Most were intense feelings of paranoia and fear.  I could usually bring myself down from these.  </p><p>A few days ago I had the 3rd of 3 experiences that I believe were flashbacks.  I was coming out of a rest stop restroom and suddenly started to feel dizzy. Everything around me started to look like a photo negative.  This was a common hallucination I had when I took LSD.  It was coming in and out everytime I blinked.  Then, I would lose my vision completely for a few seconds.  The whole time I was feeling dizzy and could barely walk.  Then, I started to have tunnel vision along with the negative images and the darkness.  I found myself crawling towards the front doors hoping my friend that was waiting outside would see me.  Thankfully, it was late at night and no one was there to see this.</p><p>After laying down on the concrete for a few minutes it went away.  Another experience was similar to this.  The other was a tile floor that kept changing its pattern, but that only lasted a few seconds. To me the feeling is way more intense than an acid trip.  Maybe it's just because it took me by suprise. </p><p>I don't really feel that these flashbacks were direct results from bad trips.  But, 2 of them felt like bad trips.  They were very confusing and exhausting.</p>"
}
