{
 "title": "Life, Death, and The Ultimate Truth",
 "author": "blindvoyager",
 "citation": "   blindvoyager. \"Life, Death, and The Ultimate Truth: experience with LSD (ID 31950)\". Erowid.org. Sep 18, 2004. erowid.org/exp/31950",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3000 ug",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 31950",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 18, 2004",
   "Views: 10954",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nBack in my college days I had many chemist friends, who all knew how to produce different drugs. For fun they'd create some mescaline or what have you, and dose people without them knowing it. After a long lull of any acid circulation, I asked them to make some. After a couple months they came up to me with a rather large vial filled with LSD. For it I payed them $100, and asked the potency. They told me it was diluted to 100 ug a drop.</p><p>My memory of the events is rather hazy from here on in, but here's what happened. After about 2 weeks of daily meditation and constant yoga, I was ready for the experience. I decided to have a huge trip, not just the usual 3 hits or so. I counted out 30 hits, dropping them in a cup of strawberry punch. I had 2 other people in the room who would act as sitters in case something should happen, but death was unlikely.</p><p>It kicked in quickly, and hard. The moving fractals took over my entire vision. The TV screen poured out onto the carpet like a waterfall. The walls cracked and defused. Everything disappeared, even my body melted into the void that I was now in. All that was left was my conciousness, and the very basic thought process. Those who have read the Tibetan Book of the Dead or follow Buddhism at all know what I speak of. I forget the exact name of it, but it's the core of all living beings, the very essence of everything; in christianity it is refered to as the soul...but this is much too vulgar of a word to describe the transcendance I experienced.</p><p>There was nothing surrounding me, no floor, no sky, no walls, no people. Just my conciousness and the highest power that exists. The God of Gods. Everything transmitted to me was in tribal impulses that I could feel, smell, taste, see, and hear. Raw perception in all its forms. The laws of existance ceased to function, no time, no death, no birth. Every emotion you can conjur into your mind was felt simultaniously, and ten fold in strength. This transcendant state lasted for hours and hours. The sober sitters who watched said that I was pretty motionless the entire time. Alternating between rigid-looking and completely lifeless. Every now and then they said that I'd twitch or spasm, but that was it for my movement.</p><p>When my vision returned enough to make out my surroundings I was helped into bed by one of the sitters, since the other was asleep. Everything that I could see was oozing, melting, swirling, decaying, transforming. When I finally was able to form coherant words and not just grunts, I asked the sitter to put on a Ravi Shankar cd.</p><p>Total synesthia. I watched as the music came out of the speakers like a tidal wave, or like electrical mandalas floating in space. The words that I spoke randomly came out of my mouth as butterflies and other winged creatures. Things I touched were transformed into smells... an endless play on my senses ensued, relentlessly bashing my fragile concious.</p><p>The acid gave its final breath about 3 days after I first ingested it. To this day, I still experience visuals from time to time. Throughout typing this, I watched a red ball of energy bounce from key to key.</p><p>That acid trip has completely changed me as a person. I no longer view reality in any way that I did before. Since the trip I have devoted myself to Buddhism and the endless path to the ultimate truth. What I experienced was all too real to just be an effect of the LSD, it WAS the ultimate truth that does exist out there. We just need to find it somehow, we need to look past our futile perception of reality and past our basic senses. We can find the truth, but we can't find it until we start the path to it; it won't just find us, we need to find it.</p><p>'If the doors of perception were cleansed, everything would appear to man as it is - infinite'</p><p>-William Blake</p>"
}
