{
 "title": "Down on the X",
 "author": "Revo",
 "citation": "   Revo. \"Down on the X: experience with Ecstasy (ID 3196)\". Erowid.org. Oct 4, 2000. erowid.org/exp/3196",
 "substance": "Ecstasy",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 3196",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 4, 2000",
   "Views: 9180",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMe and a few friends started taking the ecstasy at around 10pm and decided to go for a drive to get it off our minds. I've taken ecstasy 4 times before this and had suffered a bad roll once on a vacation (lovely). Anyways, at around 11pm all of my friends were starting to feel the x kick in while I'm sitting in the back of the car starting to feel a bit nauseous. Another half an hour goes by and I continue to start feeling like shit. Not physically sick, but just feeling really down.<br>Knowing from what I've read, I try to tell myself it's the ecstasy and to just think good thoughts. But it doesn't work and my downward spiral continues. We eventually stop at a gas station far away from home (they were loving their roll, which according to a friend who had had previous experience was one of the best). I got out of the car feeling down and walked over to a curb and sat down by myself, just pissed at myself for feeling like I was.<br>So we finally get back in the car and I get shotgun (front seat) to help me feel the wind and heater in the car (for all you rollers out there, try it, great feeling). They turn on some music and for a few moments I get myself out of the downward loop. Feeling the effects a little bit I get a little happy but I can't keep them going and I went back to feeling down again. <br>So then we were on our way home and I was still feeling like shit but keeping my eyes closed to kind of focus on the roll. Didn't work of course and when we got home I broke out a big bottle of Kahlua and some milk and drank about half a fifth's worth and it didn't do anything, which made me even more depressed (maybe that was what it did?) so I went to my house and slept.<br>Even though I've had 2 bad rolls, this one and one during which I felt like I was having a heart attack, I still believe that ecstasy is a great experience that's worth the bad side effects that I've had to put up with. I've never experienced the hangovers that some people say they have but usually feel great for a couple of days after I use it.\n\n\n"
}
