{
 "title": "Cross Tolerance with Meds",
 "author": "Leander",
 "citation": "   Leander. \"Cross Tolerance with Meds: experience with 2C-I & Methylphenidate (ID 31974)\". Erowid.org. Jul 16, 2004. erowid.org/exp/31974",
 "substance": "2C-I & Methylphenidate",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   " ",
   "40 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 31974",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 16, 2004",
   "Views: 10978",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I went through 25 2C-I trips over a 12 month period.  most of the trips were on 15mg.  A nice .002 scale was used for mesurement and the 2C-I was puchased at the same time (same vial.)  I was 165-170 pounds during this time and 6 foot tall. Some of the trips were amazingly more powerful visually then others at the same dose and it took me a while to figure out what it was that was killing the trips.  </p><p>The first 3 times I tried 2C-I, at 10mg 15mg 20mg, all were very visual yet gentle and all were +++.</p><p>Around this time I was prescribed Methylphenidate otherwise known as Ritalin.  The next 6 2C-I trips were, at most, ++ using the Shulgin scale.  at 20mg I'd have to stare at things to get the 2C-I visuals.  This was a drastic change from my first 3 trips as they all were +++ and I couldn't make the visuals go away.</p><p>I was dissapointed to say the least!  Well, something had changed in my dayly intake of compounds (coffee being the only other) I didn't think about at the time.  I had a prescription for 40mg a day of Methylphenidate - 62 pills a month.  At the end of my prescription period I usually run out (some days I'd use 3 or 4 at work.)</p><p>Well, after being off Ritalin for 48 hours I had a great 2C-I trip on 11mg.  AMAZING in fact! It hit me that maybe the Methylphenidate was causing a cross tolerance so the next few times I stayed off Ritalin for 48 hours before taking 2C-I.  I had amazing trips! Then I spent a few weeks, got back on my regular ritalin schedule and every two weeks I took 15mg 2C-I which were ++ at best.   To test my theory I gave my girl, who loves 2C-I,  10mg of Ritalin two hours before dosing 15mg.  She reported that she was having to force herself to see visions which she never had to do on 12mg.  She is 120 pounds 5 foot 4..</p><p>Just wanted to report on this for those on Ritalin and wondering why the 2C-I isn't effecting you like everyone else you are with.</p><p>Leander</p>"
}
