{
 "title": "Pure Paranoia",
 "author": "Buzz-doubt",
 "citation": " Buzz-doubt. \"Pure Paranoia: experience with Cannabis & MDMA (Ecstasy) (ID 31992)\". Erowid.org. Jun 12, 2007. erowid.org/exp/31992",
 "substance": "Cannabis & MDMA (Ecstasy)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "31992",
   "Male",
   "",
   "Not Given",
   "Jun 12, 2007",
   "5788",
   " "
  ]
 ],
 "report": "<p>I feel I must tell you about the time that I freaked out, even past my usual ganja panick attacks. My all time worst living nightmare. I have smoked ganj since I was about 13-14, but since around the age of 17 it turned against me. I coulnt smoke the herb without freaking out. But if truth be told I never do whats best, and I would tell my friends in the days after my freak out 'NEVER AGAIN WILL I TOUCH THAT SUBSTANCE'. I have taken a vast array of substances but nothing I have ever done can give me the same freak out factor of cannibis. Smoke it, and I enter my own private hell.</p><p>This particular instance was after a rave so I had popped a few e's which deffinately didn't help what was comming. We all left the club at 7 in the morning, and were blinded by the light. Early morning London on a comedown is not a pleasant thing. Me and my little group of friends where all waiting for the subway to start running in order to get home. Whilst waiting, my friend who is a total pothead started wrapping a spliff. At first I told my self no way, your in the middle of London, so far from shelter, and you always go paranoid. But the scent of the burning ganja called my name, I thought maybe the old herb will come through for me just this once, so I took the spliff. Man was I wrong!</p><p>It didn't kick in at first, but as we all found this little cove to sit and chill in for a while. I felt that creeping feeling of negativity comeover me, I tried to tell myself I was imagining it but it starting taking it's hold stronger, and stronger. I started thinking my friends were sitting too close to me. It was a mixed sex group. I got up and moved away, when someone would talk to me it would take me ages to work out what they where saying, and if there was a hidden meaning to what they where saying. I avoided eye contact with every single one of them to me now they where all enemies. A friend just simply can't help someone when they are in this state, I believe it is a form of paranoid Schizophrenia. </p><p>It was then that I realized how far it was that I had to travel to get home, and I knew it was going to be a horriffic ordeal. One of the people I was with (They weren't friends to me at this time lets say, strangers whom I knew the faces of) said let's go catch the train, I knew I was going to have to deal with this sooner or later so I just thought, be strong. I probably said no more than about three words after I smoked that spliff, how didn't any of them notice? As we walked into the station there were loads of other tired and worn out ravers, but I thought they were all staring straight at me.</p><p>To make matters worse, while Im trying to play it cool re-asuring myself they don't know the pure paranoia Im going through, my mind starts playing a new trick on me, and this is the one that has stuck with me. It feels like Im litterally pissing my self. The ultimate humiliation. I have to look down to check every five seconds. I see that I'm not but as soon as I start looking forward again, I feel a warm wetness around the top of my legs, going down. Once again I look down to reasure myself and its fine but this cycle continues for an hour maybe more, I can honestly say If I had a gun, knife, any sort of lethal implement I would have ended it all right there and then. I can't say a word of this to my friends, obviously, so I'm trapped.</p><p>I still had to get on the subway. We get in the crowded train and the majority of commuters are people in suits who have just had a shower/bath, and I am very much aware that I he been sweating pretty much solid for the last 8 hours (Ravin). I start to think I STINK! I feel that every one is looking straight at me, to this day I still think most of those people WERE looking at me. And then what thought starts to manifest again? I start thinking Im pissing myself again. It was time to finaly say something to a friend. I just said, 'I'm gettin off, Iv'e got to get off! When one of my closer friends of the group realized what I said he acted as if I was going to jump off. I got off, and only he followed, I couln't believe the rest were so unsympathetic, but thats a comedown for you I guess. It was lucky it was him who got off because Iv'e always been able to tell him anything, but it took us an extra three hours to get home, but by that time the worst was over. </p><p>Since then I have be un easy about trains, and for 8 or nine months I could stand up in front of someone with confidence because it would creep into my mind that I may piss, and it still hasn't completely gone its a full blown phobic fear I would say. I have now told you what I have only ever told one living person, it may seem funny, disgusting or whatever to you but I hope in some way I have convayed some idea of what it was like to be me for that 2-3 hours that seemed like an eternity. Cannibis is not a friend to me. Since then I have smoked it twice, both times it freaked me out to almost equal that one harsh freak out, but I can honestly say I'm going to avoid it like the plague now, I'm almost positive it will send me into full blown paranoid schizaphrenia.</p>"
}
