{
 "title": "Overwhelming Psychedelic Experience",
 "author": "Zaireeka",
 "citation": " Zaireeka. \"Overwhelming Psychedelic Experience: experience with Mushrooms (P. Cubensis), Cannabis & Salvia divinorum (ID 32059)\". Erowid.org. Apr 5, 2006. erowid.org/exp/32059",
 "substance": "Mushrooms (P. Cubensis), Cannabis & Salvia divinorum",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "",
   "4 bowls",
   "smoked",
   "Cannabis",
   "",
   "",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   "",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   ""
  ]
 ],
 "footer": [
  [
   "2004",
   "32059",
   "Male",
   "",
   "Not Given",
   "Apr 5, 2006",
   "14879",
   " "
  ]
 ],
 "report": "<p>Although this wasn't my first time tripping, I was still fairly new to the experience on this particular night. </p><p>Earlier in the week I had gotten my hands on 3.5 g. of mushrooms and decided that I would trip on the weekend.  My other experiences with shrooms were extremely positive with virtually no negative sensations throughout the trip.  So, as you can imagine, I was very excited for this upcoming trip. Unfortunately, I ended up agreeing to go to a party at my friends house the same night I was planning on tripping.  So, instead of admitting that maybe a party wasn't the best environment to be tripping, I decided I would bring my shrooms and eat them there, just to experience it.  </p><p>From reading other reports, and my own experience, I know that it is always best to trip in a relaxed environment with a few choice friends.  However, for some reason, my curiosity preceeded me and I said 'screw it' and ate my shrooms at about 9:00 that night at the party.  I feel that I did this more to see for myself why I shouldn't trip in such an unstable environment as a house party.  And I really feel that I learned my lesson, although the trip really did have its shining moments.</p><p>After consuming the dried mushrooms I decided to go downstairs where a few friends were drinking beer and watching some stand up comedy.  There I began to relax myself with some slow breathing as I sunk into the couch.  </p><p>I remember feeling light headed at first and I began to roll my head in circles, enjoying a nice buzz.  Soon enough, I had stopped listening to the conversation around me and had also stopped watching the television.  I was feeling more and more relaxed, and anxious for the trip to really kick in.  At this point I was just looking around the room, observing the pictures on the wall and admiring their details.  I remember really liking one picture of a lighthouse in a stormy sea,  I was fascinated by how vibrant it was, yet the colors used were all bland dark grays.  </p><p>Once I had gotten used to the initial onset of the drug, I had begun to pay attention to the t.v. again, laughing occasionally with my friends, which really felt good to me.  There was a strong wholesome bond I felt with them, so strong that I almost couldn't get over how great it was.  I began talking again too, interjecting every once in a while as the conversations drifted from one subject to the next.  I didn't talk too much though, it seemed a great strain for me to really form a long sentence.  I was just content expressing simple emotions and laughing.</p><p>Now the pictures on the walls were finally swimming around the room a bit, and the shadows that enveloped the dark room had developed a soft pulse to them.  Some more friends had come back from a food run and came downstairs to talk to me about how I was feeling (I was the only one eating shrooms that night).  I said I felt great and could wipe a stupid smile off my face.  They readily offered to smoke me up and I was all for it at that point, although now I wish I had waited a bit for the shrooms to peak.  </p><p>Four of us went out to bake in my friend M's car.  I had a little over half a gram of pot and I gave it to M who broke some off and packed the first bowl.  Now, if I had just smoked the one bowl and then went back in, the night would have been much more chill, but I ended up smoking about four bowls altogether. When we finished each bowl, I was always convinced we had finished it all off, but there was always more in the bag somehow.  My friends would say 'Might as well finish off the bag' and I would wind up smoking more and more until we really did finish it.  By this point my head was a hot air balloon.  I could hardly form words at all.  I could only sit there and soak in the intense trip I was having.  Objects oustide the car were unclear.  I couldn't tell if the trees outside were far away, or close up, lights outside were intense and oscillating in regular intervals.  The smoke inside seemed green and was rolling into cool patterns.  'Why am I still smoking?' I kept asking my friends.  They were pretty high too, and it seemed like they never even heard me, in fact, I couldn't be positive that I actually asked them anything, my memory was getting real poor, especially when it came to remembering stuff I had just said.  </p><p>Now, when we finally finished the pot, I brought out some salvia 6x extract and offered it to my friends, who jumped on it.  We all had previously pleasant experiences on the substance, regardless of the not so pleasant experiences we had heard about it, so this seemed like a good way to finish off our smoke session.</p><p>Wisely I only took one hit, which is usually all I needed anyway.  Unfortunately, I knew I was in for a rough ride even before I let go of the carb on the pipe.  The second I inhaled my hands instinctively grabbed onto my mouth and throat as I began coughing violently.  Tears instantly gushed from my eyes.  For a second I was able to stop coughing, until I felt like I had to burp.  When I let out the burp, more coughing and a small amount of bile erupted from beneath my hand which was clasped over my mouth.  This got me into an instant terrifying panic.  My friends asked if I was okay and I said I was, which was a lie. </p><p>I had the sensation of abrubtly falling from a great height.  My panic increased and I felt the most uncomfortable anxiety I can ever remember experiencing.  We sat in the car a while longer and I closed my eyes to try and relax, I tried to enjoy the patterns forming under my eyelids, but my brain couldn't relax, there was all in all too much going on in my brain for me to control.  I had a cigarette which helped me a little and then went inside.  Here, my trip had its peak.</p><p>I was very high, I don't remember going inside, but I do remember walking to a room with a bunch of friends, the room was dark except for a single blacklight which hung on the wall.  The room was relatively small and I was really freaked out by how the blacklight made everyone's teeth and eyes look neon green.  There was nowhere to sit so I had to stand, at least, I tried to stand.  My legs were numb and I could barely keep control of them, I was constantly swaying and leaning on things.  Waves of absolutely unbearable body high swept over me like undertow in a stormy ocean.  My head kept feeling as if it was spinning backwards on top of my neck.  I did everything in my power to appear normal to my friends who were kind of worried about me.  My poor mouth was completely dry, and when I went to lick my lips, it felt as it I had four mouths arranged in a diamond pattern with four tongues rolling about the lips.  </p><p>This whole arrangement made me very uncomfortable so I decided to go sit just outside the room, alone.  Here, as I watched the walls drift back and forth, sound began to play tricks on me.  I could hear my friends talking, but couldn't decipher a word of it, every word came from a different direction, even though most of my friends were in the same room.  It was a low, chanting amalgamation of voices and whispers, varying in volume in pitch.  I was overwhelmed at the fact that I was actually hearing this but soon enough, my brother came by and found a seat for me back in the blacklight room.  </p><p>There I sat for nearly the rest of the night, and what I night it was.  My friends broke out a strobe light to go along with the blacklight and began dancing.  Here I believe I lost my mind completely.  With every flash of light my heart pounded like a bass drum, I couldn't keep track of who and where my friends were and what it was they were doing.  Facing morphed endlessly for what seemed like hours, legs appeared out of nowhere and hands came reaching for me out from the darkness.  At this point they brought out a glow in the dark basketball which my one friend S was spinning on his fingers, and oddly enough, when the ball got near the blacklight, it collected that light and suddenly got even more luminescent to the point where all I could see was this floating green ball which bounced playfully about the room.  </p><p>At that point I began to relax and finally was enjoying myself.  The lights came back on and the strobe light stopped.  I began talking lightly with my friends again and enjoyed the mellow visuals of my trip as it began to recede.  I remember saying a lot of crazy things to my friends and breaking into cold sweats but I felt really good at that point anyway.  </p><p>I also had two shots of rum to help me chill even more and I watched a movie called Koyaanisqatsi with my friends, which is the best movie to watch on mushrooms by far.  So, in the end I finally got to have a few good hours of tripping after getting over the intense peak I had after I smoked.  The only problem I had after all that was that I was still kind of shaky and I had a bit of trouble falling asleep, which is normal for some people on mushrooms anyway.  </p><p>All in all, I would never do it again, but I'm glad I experienced it and proud of myself for making it through the night without completely freaking out and now I feel I have a lot more control and understanding of my own mind.  I'm wiser now about psychedelics and learned what taking things to far results in.  I would tell you to 'Trust me' and that its not worth it to overdo things, but then again, if you're like me, that will only make you more curious so I guess the moral here is to experience things on your own if you're curious about them (within reason of course) and be sure you actually get something out of it.  I'm sure I did.</p>"
}
