{
 "title": "Exploring The Worlds Within",
 "author": "Absolute^Zero",
 "citation": "   Absolute^Zero. \"Exploring The Worlds Within: experience with 4-Acetoxy-DiPT (ID 32064)\". Erowid.org. Aug 25, 2004. erowid.org/exp/32064",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32064",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 25, 2004",
   "Views: 13265",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>00:50: Dosed 25mg orally (capped). Upon dosing, I started setting up a playlist. Chatted for a while on my normal irc channel.</p><p>01:20: Start to feel the drug take effect. Very subtle at this point. On other hallucinogens I've experiened, I usually feel apprehensive (a little bit of butterflies in the stomach), but this was not the case while I was coming up on this substance.</p><p>01:30: I decided to retreat to my bed. I usually go there when I start coming up, as I'm able to lay down and relax with the security and warmth that the blankets provide.</p><p>01:40(?): There is a blank spot in my memory around this point. This substance took control so quickly. I went from feeling the first effects to being blasted out of this world in a matter of about 15-20 minutes. I was confined to the world of my own mind, except without the knowledge of my own existence nor the existence of the outside world. Very, very intense experience. It was personally very meaningful, but is very hard to describe, now that it is over. It started with this very plain, almost mechanical area which I (keep in mind, at this point, I wasn't aware of my own existence, so 'I' isn't the best word to use) could control every aspect of through modification of the coded (programmed) structure, but it was as if I were not only the overarching program, but every object in it. It was a very strange feeling. Later, I emerged into a watery world surrounding an island, again the circumstances were very odd. There were many deformed creatures inhabiting the waters, but I knew they were of a passive nature. </p><p>The island was inhabited by humans, constantly fighting and killing each other. They would throw the bodies into the water, and these creatures would somehow merge the human bodies with stone, which produced large boulders with scenes that fortold of the future. I noticed that one of these boulders showed a great festival with the humans dancing around a bonfire, and as I came up to the surface of the water, I looked onto the shore and saw the scene played out just as the stone had fortold. Later again in the experience, I was in some sort of voyeuristic sexual world. At this point, I had a very general, vague perception of my existence. I consisted of my normal body, yet I was everything and everyone else in this world at the same time. I don't think I'll go into much detail, but the place consisted of a long hallway of doors. I perceived that each room housed a different woman, some doors were shut, some were open. There were a lot of things going on as I walked around to each room, and there was even one large room that had seating behind a large glass wall which onlooked some sort of sexual playground... Like I said, that's about all the detail I'll give, but this was one of the last things that I remember of the CEV's.</p><p>3:50: I opened my eyes and could see my apartment, I walked to the computer and typed:</p><p>'that was intense! I say that, because although I can still feel it... I just now broke through the barrier of my own consciousness to realize that the outside world exists'</p><p>The outside world appeared to me so rapidly, It was only at this point that I realized that I had dosed earlier and that I had been inside my own head the whole time. I still felt the substance in my body, yet it was very weak at this point. I came down just about as quickly as I came up.</p><p>04:30: I lay down and go to sleep, feeling very close to baseline.</p><p>--</p><p>4-aco-dipt is a powerful substance with a lot of potential. Visuals were all CEV's, as I had absolutely no OEV's. I personally suffered no negative effects. The body buzz was not overwhelming for me, I had no nausea, I didn't feel all phlegmy like I do on a lot of other hallucinogens. I also enjoyed its shorter duration... I had peaked and was almost down within 3 hours of the ingestion (asleep by hour 4). Its now about 10:00am, I feel wonderful and completely recharged, even though I only had about 4 hours of sleep. This experience was wonderful, and will definitely be repeated.</p>"
}
