{
 "title": "All is Not Lost",
 "author": "SlinQ",
 "citation": "   SlinQ. \"All is Not Lost: experience with PMA (Sold as Ecstasy), Alcohol & Cannabis (ID 32091)\". Erowid.org. Apr 16, 2007. erowid.org/exp/32091",
 "substance": "PMA (Sold as Ecstasy), Alcohol & Cannabis",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 0:30",
   "1 tablet",
   "oral",
   "PMA",
   "(pill / tablet)",
   "  T+ 1:30",
   "1 tablet",
   "oral",
   "PMA",
   "(pill / tablet)",
   "  T+ 6:30",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "32091",
   "Male",
   " ",
   "Not Given",
   "Apr 16, 2007",
   "13439",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First some context, me and a friend (J) had been using MDMA fairly regularly for a few months, every couple of weeks. We had a good supplier who we trust, but who only sold in quantities of 10 or more pills. Furthermore, he lives a short train ride away so it's always a bit of a pain to get pills from him. We'd done a lot of different pills of varying strengths, and I'd say both of us are pretty good at judging the quality of a pill. </p><p>On the day in question, we were both eager to take a couple of pills each and have a little walk around the city we live in. We refer to these walks as 'missions'. Unfortunately it was late and we were unable to get any pills from our regular supplier. J knows some people who hang around on the beach and sell pills and other party prescriptions to clubbers so we wandered down there after a couple of beers in my local pub. </p><p>When we arrived at the beach, sure enough there was a guy J knows hanging around drinking Jack Daniels out of a bottle with a group friends. He sold us 4 pills for £25, which is a little expensive by today's prices (we usually get good quality pills for £2.50 each), but we were paying the prices clubbers would pay so we didn't mind much. The pills appeared to be white mitsubishi doublestack. It was dark and we were in public so we didn't examine them very closely. Prior to this I had seen the notice on Erowid about PMA being sold as MDMA, usually in the form of white mitsubishi doublestack. However, we've had mitsubishis that look a lot like these before and they've been pure MDMA, so I wasn't worried about them. </p><p>J and I both took one each and started walking back from the beach in the direction of a park not far from my house. By the time we got there it'd been just over an hour since we took the pills. Usually I can at least feel the beginnings of an MDMA high after an hour so we were both concerned that we'd been sold bad pills. We decided to take the other two we had left, one each to see if anything would happen. Had I known the content of the pills I would not have done this, but we were very slightly drunk and looking for that amazing feeling MDMA gives you. </p><p>After about 15 minutes we could both feel something, but it didn't have that happy buzz that MDMA has. We decided to go and sit in little garden with a pond that's near the park. This garden is always a nice place to sit, it's really beautiful. I'd never been there at night though. It must've been past midnight by now and it was dark. So we sat there and talked a bit and took in the beauty of the garden. </p><p>With MDMA I get the feeling of euphoria, the manic need for conversation and the amphetamine-like desire to constantly be doing something. We felt none of these things, we were just sitting there talking as old friends do, feeling no burning desire to get up and do something. Just sitting there taking in our surroundings. The closest thing I could compare the feeling to was the warm happiness of a low magic mushroom dose. Instead of being full of euphoria, we were both just content with our surroundings. There was a mild 'trippyness' as well. By that I don't mean that we were hallucinating, just that colours seemed more intense and everything had a sort of crystaline glow. Jaw clenching was apparent and we were both chewing gum, other than that I noticed no other physical symptoms. </p><p>After a couple of hours we wandered back to my house through the park. This was an enjoyable walk and everything still had a kind of hazy warmth to it; like the feeling of lying on grass on a warm summer's day staring up at the clouds in the sky. It was an enjoyable experience, but nothing like as intense as MDMA. To be honest, having paid more than we usually pay for some pills that were clearly not MDMA, I was a little disappointed.</p><p>By about the 6th hour after taking the pills we were both back to normal, no significant comedown was experienced by either of us. We smoked a little weed and went to sleep. </p><p>At the time, I hypothesized that the pills may have contained MDA or some other such chemical similar to MDMA. Later I found out for certain that the pills contained PMA. This worried me slightly as we'd fallen into the same trap that had killed several PMA users; waiting an hour after taking one pill and then taking more because nothing was happening. Fortunately we were lucky. No negative side effects were experienced aside from jaw clenching and slight muscle ache the next day. </p><p>The reason I write about this now is that I've just been sold 18 white mitsubishi doublestack pills that look very similar to the ones we had on the night described here. I haven't tried them yet, and it seems quite unlikely that they're from the same batch. The experience I've described here happened at least 5 months ago, plus we never really looked at the pills we took properly in good lighting conditions so it's hard to make a comparison.</p><p>I'm aware that the experience I had with PMA was very tame, but that the drug can be dangerous and even kill. I'll certainly not be taking any risks and I don't want anything to think just because I had a reasonably nice time on PMA, they should take risks.</p>"
}
