{
 "title": "Subcutaneously Injected",
 "author": "gggiiimmmppp",
 "citation": "   gggiiimmmppp. \"Subcutaneously Injected: experience with 2C-I, Amphetamines & Sleep Deprivation (ID 32116)\". Erowid.org. Aug 7, 2004. erowid.org/exp/32116",
 "substance": "2C-I, Amphetamines & Sleep Deprivation",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Amphetamines",
   "(pill / tablet)",
   " ",
   "4.0 mg",
   "SC",
   "2C-I",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32116",
   "Male",
   " ",
   "Not Given",
   "Aug 7, 2004",
   "Views: 14104",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Setting: Day 3 of sleep free Adderall binge weekend.  Strung out from lots of Adderall and no sleep, can't think clearly enough to be productive at all on the shit I need to write for school.  I thought maybe a low dose of 2C-I could help me get writing but I didn't want to wait two hours for it to kick in.  So I started pondering this.</p><p>I have never seen a shred of information on the internet, good or bad, regarding injection of 2C-I, and myself being someone who likes to put some things in my body in this manner from time to time, I was somewhat curious about it.  I theorize that snorting is as close to direct insertion into the bloodstream as is possible without a syringe, and as such I theorize that introduction of 2C-I into the bloodstream by a more direct means should not be too terribly dangerous if dosed properly; otherwise there would have been health problems with some of the high dose insufflation reports floating around.  Regardless, I'm not about to be the first guinea pig to shoot a random untested research chemical directly into my bloodstream, so IV is out of the question; however, I did some research into subcutaneous injection.  Of all of the available injection methods, subcutaneous injections are absorbed the slowest, providing favorable conditions for me not dying and potentially smoothing things out due to the time release effect.  </p><p>Considering this, and considering 2C-I's oral dosage, I decided on a dose of 4mg for the first trial.  I was expecting a mild, threshold psychadelic experience.  It seems that I overshot a bit. I dissolved it in 40 units of distilled water with heat and stirring with a key, and sucked it back up through a cotton ball heroin style (30 units made it).  I anticipated that it would sting a bit after the horrible feeling of it dripping down the back of my throat (hands down the absolute worst drip ever), so I injected the 30 units to 3 different sites, on the top of each thigh and on my abdomen.  Search google for 'how to administer subcutaneous injection' for a few legitimate guides on proper methods and places to shoot.  They stung a bit, but nothing intolerable; within seconds it was barely noticeable.  Or, at least, the stinging was...</p><p>Within seconds of shooting, I could feel something coming on.  Full force effects crept up on me in a huge rush within 10-15 minutes at the most, peaking at about 45 minutes after dose.  My least favorite part of an oral 2C-I trip is the hour and a half or two hours from dosing to full effects; this phase was skipped entirely.  The most 2C-I I have eaten at one time was 34mg, and this was incomparable at its most intense point.  I also heard techno music playing, and thought it was real at first before I realized that I wasn't playing any music on the comp, I was imagining it since there wasnt any music on yet :).  The body buzz was gone by t+3 and the last noticeable effects wore off completely by t+6.</p><p>In retrospect... this is powerful shit.  I really had no business doing it tonight, considering the Adderall binge and coresponding lack of sleep, and I didn't really enjoy it as much as I should have because the ride down was overpowered by shitty vibes from the Adderall crash.  Had I known better, I might also have done a bit less, since this turned me completely unproductive for 2-3 hours and somewhat overshot my goal of a barely psychadelic dose.  I will probably repeat the experiment under more favorable circumstances when I have the opportunity.</p>"
}
