{
 "title": "Be Careful ...",
 "author": "DTM",
 "citation": "   DTM. \"Be Careful ...: experience with 5-MeO-AMT (ID 32115)\". Erowid.org. Jan 10, 2007. erowid.org/exp/32115",
 "substance": "5-MeO-AMT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32115",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 10, 2007",
   "Views: 8419",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently had an experience involving 5-MeO-AMT that makes me feel obligated to encourage everyone to be very careful with this substance.  A friend of a friend recently ordered some 5-MeO-AMT from an internet distributer and we decided to take some.  There was some confusion, and at the time I thought what we had was AMT, not 5-MeO-AMT.  Three individuals took doses of 5-MeO-AMT ranging from 50-100mg orally.  Taking the smallest dose myself, i began to feel effects within 15 minutes of taking the capsule.  </p><p>At such an extreme dose the onset was very rapid and within a very short period i was extremely nauseous and vomiting frequently.  The effects felt to me much like a very intense exctacy buzz accompanied with blinding visual patterns much like LSD.  Within 45 minutes i was completely blacked out, and from that point on my memory is completely blank.  From the reports of my friends who were present at the time of my consuming the 5-MeO-AMT, i was violent, uncontrollable, and unresponsive to physical and verbal commands.  I managed to injure myself severely, suffered trauma to my head, was foaming at the mouth, pupils dilated and fixed, and in general was not myself in any way shape or form.  I was admitted to the hospital 5 hours after consumption along with another of those who had consumed the substance.  We both lost conciousness, and had to be put on a respirator.  I woke up 36 hours later in the intensive care unit with absolutely no recollection of the experience at all, and a lot of explaining to do.  I urge everyone to be very careful when consuming either AMT of 5-MeO-AMT, these substances are DANGEROUS.</p>"
}
