{
 "title": "The Pipes of Reality",
 "author": "Adam",
 "citation": "   Adam. \"The Pipes of Reality: experience with Salvia divinorum (ID 32121)\". Erowid.org. Mar 29, 2004. erowid.org/exp/32121",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 32121",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 29, 2004",
   "Views: 6168",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience with Salvia wasn't very powerful at all.  Two friends and I bought half a gram of 5x extract and smoked about half of it, as I felt absolutely nothing, I immediatly dismissed the drug, thinking I had explored the full extent of its effects (that is, none at all).  Later that same night, one of the two friends I had bought it with smoked the rest by himself (while on mushrooms), and was acting... strangely.  Again, I dismissed it as the shrooms working on him, and promptly forgot about salvia.  </p><p>Two weeks later, the same friend who had smoked the rest of the half gram called me up and asked if I wanted to try Salvia for a second time that night.  I figured 'why not,' whats the harm in trying?  So we went out, bought some salvia, found a deserted spot, and started smoking. Before I describe my trip, I should describe the setting it took place in.  The two of us had found a doorway in an empty schoolyard in the middle of a residential neighborhood, huddled up in it, and packed the pipe.  I wasn't quite sure which area of the city we were in, all I knew was that it was close to the house of someone I knew, so in my mind, their house and surrounding area was implanted over the houses facing the doorway we were huddled in.   Not realizing the power that Salvia has, I thought nothing of my surroundings, figuring that if anything was to happen I would be able to simply get up and walk away.  This, I realized once I started my trip, was quite wrong.  </p><p>My trip began about 2 or 3 minutes after taking two larges tokes and holding each for 20 to 30 seconds.  At first I was wondering what I was sitting on, not able to measure the distance between myself and the door and the ground, and in a similar way to which I have badly tripped on mushrooms, started to try to separate reality from what the drug induces.  This, I know from shrooms and salvia, is a mistake.  Once I realized that it was going to turn into a very bad trip if I didn't stop fighting it, I completely let go of myself and let the drug take over.</p><p>Once I closed my eyes, I saw the surrounding streets as I thought they looked from an overhead view.  This view quickly zoomed in, then panned back to where I was sitting.  Once it reached where I was, I realized that everything around me was made up of tubes.  These tubes were multicoloured, with the various colours making up patterns that made up what we view as reality.  When I leaned back into the door and relaxed, the tubes began to flow into my body, connecting me with all that was around me.  This entire experience, once I gave myself over to the drug, had an overlying positive feeling, and gave me the sense that I was part of some greater whole.  This feeling lasted for about two hours afterwards very strongly, and along with it was a slight incoherency in my speech, making it hard for me to make complete sentences if I wasn't paying close attention to what I was saying. This positive feeling, while no longer quite as intense, lasted for 2 or 3 days afterwards, making me feel very happy and satisfied with my present situation.  </p><p>Overall, I would definitely recommend salvia to someone wishing to explore their own psyche.  I often have problems with anxiety and intense paranoia when on psychoactives, and would warn against taking salvia (or any psychoactive for that matter) while in a state likely to have any sort of panic attack.  I  would say, if one happens to start while on salvia, don't try to fight it or the drug, don't try to tell yourself that 'it's just the drug,' as this will only make things worse.  Accept that the drug has control, and let it be in control.  </p><p>Have a pleasant trip.</p>"
}
