{
 "title": "Poppers & Laughter",
 "author": "Spiritual cramp",
 "citation": "   Spiritual cramp. \"Poppers & Laughter: experience with Inhalants - Nitrites (ID 32124)\". Erowid.org. Jun 16, 2007. erowid.org/exp/32124",
 "substance": "Inhalants - Nitrites",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 cart.",
   "inhaled",
   "Inhalants - Nitrites",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32124",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 20351",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was sitting around with my friend 'Greg' on a Sunday afternoon when his roommate 'John' walked in. 'Hey, do you do poppers?' he said. 'Um, I havn't' I replied. He offered them and I looked at Greg, who just shrugged. John told me they wouldn't last for more than two minutes, his friend had brought them back from Montreal and people used them in clubs to get really high, then Greg put in that he'd heard they made orgasms better. He uncapped a tiny bottle that resembled an incense oil bottle and said 'Quick, it'll evaporate! One breathe up each nostril, really fast' and held the bottle up to my nose.</p><p>I breathed in, then he moved it and I breathed deeper. It smelled kind of bad, not quite like varnish but that's the closest I can think of, except maybe a dentist's office. I looked towards the tv and Greg and after a few seconds said something along the lines of 'my head hurts..' John breathed from the bottle and asked if it was 'creeping up on me.' That's really the only way to describe the feeling I got next. A strange feeling creeped up the back of my neck, then it felt like my head was being engulfed by this weird sensation.</p><p>John left with his uncle, who'd been standing around not saying anything the whole time. A couple of seconds later I looked at Greg and started to laugh. I felt like my head and been completely severed and was floating like a helium balloon. I couldn't stop laughing, and I remember thinking 'What the hell are you laughing at? Stop being an idiot.' but when I tried to stop it didn't work. I managed to get out 'John's a nice boy!' before breaking into another giggle fit. Greg just laughed at me and shook his head, then about a minute later everything was back to normal. I really liked the experience, and I'd probably do them again. But, like Greg said, they don't last for long and I wouldn't want to become addicted to something I'd have to do every few minutes to stay high.</p>"
}
