{
 "title": "A Tryp to the Hospital",
 "author": "Bobby Bongchinnigann",
 "citation": "   Bobby Bongchinnigann. \"A Tryp to the Hospital: experience with Ketamine (ID 32123)\". Erowid.org. Sep 16, 2005. erowid.org/exp/32123",
 "substance": "Ketamine",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "3 joints/cigs",
   "smoked",
   "Cannabis",
   " ",
   "3 joints/cigs",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "32123",
   "Male",
   " ",
   "Not Given",
   "Sep 16, 2005",
   "18305",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was out with some mates smoking at a near by skate park, I had just finished my 3rd joint, and with the 4th one in my mouth, I decided to try skate boarding, I know, stupid idea. I was 'pot-tryppin' pretty hard, and about half way through the 4th joint I decided to drop the half pipe, all was well until I attempted a nose slide xp! Well, I fell hard back on my ass, broke my right arm. My mates called an ambulance and I was taken to hospital. They took x-rays and decided to put me under Ketamine to knock me out. After I was injected I closed my eyes and lay back on the hospital bed and tried to relaxed [I was feeling rather dizzy]. </p><p>I dont know how long I lay there, but the next moment I 'Opened my eyes' -  and found myself almost in another world. The place I was in, looked like my home town, right in the center, where all the shops usually were, except the sky and earth beneath me was barren and scarred a deep orange colour. I found myself being drawn towards a 'giant water tower' (the only way I can describe it) - it seemed to stretch forever into the sky, I touched it, then started to sink hard and fast into the ground. Everything looked so beautiful, the ground was not JUST a dirty orange, I realized it was made up of tiny little interwoven pieces of some sort of fabric, which slightly resembled a computer motherboard. I was sucked into the ground, which seemed then not as the ground, but another world yet again, where helpless I was pushed trough the deep thick layers of wherever, until I reached what I can only refer to as 'the green room', I rise out of the floor, and into an operating table, everything was green, of all shades and tones, there were doctors, if you would call them that, cutting at me, however I felt no pain. </p><p>Then for some reason I started to slip through the walls of the place, back into the thick sluggish orange ground, then back to the green room, and back to the ground - it went on like this for quite some time, I cant recall the amount of times exactly, but it started to scare the shit out of me, I thought this would go on for ever, I felt trapped, as I didnt have control over my body, I was just moving through this place. This slowly blurred back to reality, I slowly opened my eyes (real world ;)) banging my new cast repeatedly against the side of the hospital bed. Everything was really blurred, the hospital room was dark which I think caused me to have slight hallucination, a poster on the wall looked somewhat like a baby elephant :S, every time I closed my eyes I saw the green room again. But I eventually just waited it out. </p><p>Definitely a real heavy trip  thats if you could call it that, it seems like something different again all together.</p>"
}
