{
 "title": "Intense But Unsatisfying",
 "author": "Miggady",
 "citation": "   Miggady. \"Intense But Unsatisfying: experience with Salvia divinorum (ID 3213)\". Erowid.org. Dec 3, 2001. erowid.org/exp/3213",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3213",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 3, 2001",
   "Views: 6453",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy roommate and I had been searching for some kind of interesting new experience; we'd wasted too many nights stoned on the couch of our dorm room, watching reruns on MTV.  A friend of mine at Brown suggested that we order some Salvia, and even directed us to a web page where we could buy it.  Initially I was nervous and skeptical.  Everything I read online about it suggested that I would either go out of my mind for a few minutes and plummet from my 9th story window, or absolutely nothing would happen.  Anyway, we ordered a gram of 6x enhanced leaves and waited.  The leaves came shortly and, for about a week and a half we had them lying around our place.</p><p>Well, last night my roommate had no homework (I'm not sure he ever does...), but I had to revise a really important paper.  He had made plans with a friend of ours to try the salvia, but the friend backed out.  I finished my paper earlier than I expected to, and decided that, even though I was just recovering from a cold, I had time for a new experience.  At around midnight we dimmed the lights, put on Phish's Rift, and filled up my bong with some water.</p><p>We agreed that we would sit for each other, and my roommate went first.  We filled up the bowl with a small amount of Salvia, and my friend took a fairly large hit.  Nothing.  He felt as if his lower jaw were being pulled to the ground, but other than that, perfectly sober.  Discouraged, he packed another bowl and did the same thing.  This time he had to lay down after the hit, and he told me he definitely felt, 'abnormal,' but he was still capable of making semi-coherent conversation.  We waited a few minutes, until he felt capable of sitting for me, for me to try.  I decided to pack a larger bowl than either of those packed by my roommate.  I wanted the real 'salvia experience,' whatever that meant.</p><p>I decided to try to take the whole bowl in one hit, and soon a very dense cloud of smoke filled the chamber.  I inhaled as deeply as I could, and kept as much of the smoke in my lungs as possible.  By the time I exhaled I could barely sit up.  I lay down and began to giggle a little.  A little giggling soon turned into a lot of giggling and I felt semi-euphoric.  The most notable physical sensation I felt was an intense belief that I was being pulled down through my bed.</p><p>After this, my vision dissolved and my mind cleared itself of all thoughts.  The experience defies verbal explanation; I cannot say what I 'felt' because I had no feelings.  The only thing I can describe about this period of disassociation is that all I could see were bright purple, yellow, and orange swirls that I thought (after the experience was over) looked like rainbow sherbet.</p><p>A ringing phone brought me back to Earth, but I was still severely incapacitated.  My roommate struggled to get up and answered.  It was a new friend of mine, calling to ask what was up.  My roommate told him that he should probably call back in 15 minutes or so, but I managed to indicate to him that I wished to speak to my friend.  He asked me if we were having some kind of party; he heard the laughter and music.</p><p>I managed to croak, 'we're on drugs,' and he laughed.  He asked if we had any more, and I said, 'sure, come over.'  There was much more to the conversation, but my mind was operating in two ways at once and I forget most of it.  I was on the phone for probably 3 minutes and I was still at the peak of my salvia experience.  I sat on the bed laughing for another few minutes, and my friend arrived shortly.  I had returned to a normal frame of mind by the time he arrived, and I strongly cautioned him to be careful.</p><p>My roommate decided he wanted to REALLY trip on the salvia, so he packed a huge bowl and smoked it in two hits.  Shortly thereafter he collapsed on his bed, flailing his arms and asking me if I could hear him.  He continued to rant about smiley faces pulling him onto the bed and other things that I'm sure only made sense to him.</p><p>My new friend packed 2 small bowls in a row for himself and proceeded to set himself up underneath our lamp and stare into it.  We all agreed that we felt intensely pulled down by the salvia; it forced us to lay or sit down.  All in all, it was a positive, but very intense experience.  I'm not sure I will want to try salvia again; never has one bong hit of anything warped my sense of reality so fully.</p><p>I wish the experience had lasted a bit longer, and been more intricate.  I guess since we have enough for one more session left we'll probably do it again, but I might have to bow out.  The experience was unlike any other hallucinogenic state I have ever visited; it allowed little time for introspection and thought.  I wish I could remember the trip more clearly, but I feel it was more of a brain-cleanser than a brain-enhancer.  Intense.</p>"
}
