{
 "title": "Very Pleasant, Much Like Opium",
 "author": "rev. cosmo",
 "citation": "   rev. cosmo. \"Very Pleasant, Much Like Opium: experience with Kratom & Cannabis (ID 32178)\". Erowid.org. Mar 24, 2004. erowid.org/exp/32178",
 "substance": "Kratom & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Kratom",
   "(tea)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32178",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 24, 2004",
   "Views: 48955",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had read about kratom on an ibogaine email list that I'm on; and, being a recovered heroin addict, I was immediately very interested in learning more about this plant. I had heard that its effects were a combination of stimulation and sedation, and that it is often used in its native Thailand as an opium substitute.</p><p>A few months prior to the experience I'm about to relate, I had tried smoking some kratom I purchased from a botanical vendor. The effects of smoked kratom were not unpleasant at all, but were very, very mild; to the point of being barely noticeable.</p><p>However, a little while ago, I was looking around on Daniel Siebert's website, and I read that the proper way to imbibe kratom is as a tea. So I figured what the heck, I'll give it another shot.</p><p>I used Siebert's recipe for preparing the tea, which involves boiling the plant material twice, and then boiling off the excess water to make it more concentrated. (For the detailed reciped, go to http://www.sagewisdom.org/kratomtea.html).</p><p>It's a rather labourious process to make the tea, but well worth it (if you're fond of opiates, anyway). I used a little more than an ounce (approx. 30 grams), which was enough for two full doses.</p><p>The taste of the tea is quite foul; it's very, very bitter. Even after adding quite a lot of sugar, the bitterness is still a bit overwhelming. But I noticed that after having taken the tea a couple times, well, I wouldn't say that I've grown to like the flavour, but I now associate it with the drug's effects, so it is much more bearable.</p><p>The effects come on fairly quickly, within 10 minutes or so, and are remarkably pleasurable. Quite a lot like opium really; relaxation and sedation, analgesia, and euporia. I did often experience some nausea, but that was controllable with a little cannabis. Whether nauseous or not, I would highly recommend a little bud to go with it anyway, as there is a very nice synergy between the two drugs. </p><p>I did actually vomit on two occasions that I've used kratom tea, but vomiting on an opiate, or opiate-like drug, is really not all that unpleasant. I mean, you know, it's somewhat unpleasant, but not as bad as when one is sober, and certainly not anywhere near as bad as vomiting from alcohol overindulgence. For this reason, it is highly advisable to use kratom on an empty stomach. That will also increase the effects, as it will be absorbed better.</p><p>I should note that while kratom is not an opiate, there is some chance of experiencing mild withdrawal symptoms after prolonged heavy use (muscle aches, chills, etc). Certainly not anything in the realm of heroin or morphine withdrawal though; and I haven't really found kratom addictive, so it isn't difficult to control one's intake of it in order to avoid withdrawal.</p><p>Overall, I'm quite impressed with kratom. It's cheap, easy to get ahold of, and very enjoyable. It is also quite useful medicinally as a painkiller, opiate substitute, and anti-diarrhea treatment. I would suspect that it would be a good cough remedy as well, but I have yet to confirm this.</p><p>Oh, and it's legal too... ironically, except in Thailand; where it grows wild.</p>"
}
