{
 "title": "Awesome First Time for a Nervous Person",
 "author": "No-L",
 "citation": "   No-L. \"Awesome First Time for a Nervous Person: experience with Mushrooms (P. cubensis) (ID 32187)\". Erowid.org. Oct 24, 2007. erowid.org/exp/32187",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32187",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 24, 2007",
   "Views: 5013",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBefore taking mushrooms for my first time I had been experiencing major anxiety (to the point of having anxiety attacks) and was scared of taking them, although I could not pinpoint the reasons. Finally while still stressing we planned a trip to go to Evergreen State College in Washington. This is the ideal place for first timers not only because everyone is chill and trips themselves but also the forest is so amazing its almost made for tripping. The different trees and the mosses are very beautiful and you rarely run into other people. If you do there is a 75% chance their under the influence also. Id also recommend doing it with someone whod tripped a lot whos a chill person our friend accompanied us who was very experienced and knew when help was needed and when its good to just be quiet. \r\nWe took cubensis at 10 in the morning starting off by chewing and swallowing them until we realized that its easier to crumble them in water and gulp them down. The guy who sold them to us gave us more than the usual weights and we had to remove what we estimated was an 1/8th for another friend. 2 1/8ths were split between 3 of us and there is a fairly large portion of crumbled stems left over that were saving. Because it was our first time and I was nervous we did not eat much before hand, which I would not recommend. It caused my boyfriend to throw up various times and myself a slight nausea for the rest of the night. \r\n20 Minutes after ingesting them my boyfriend suggested we go into the woods because he was unable to focus when looking at the trees out a window. After a 10-minute walk in the woods, maybe, we came upon the Fairy Circle students had created. I started explaining to my colleagues how each fairy was represented in the area and they decided the mushrooms were kicking in. \r\nWe then continued on walking my boyfriend complained of extreme dry mouth and we walked back to a stream we had passed. We drank a little and he started getting very nauseous. He described it as not being able to control his body and being outside himself seeing himself throw up and not knowing what to do. I was pretty concerned when the liquids coming up were a purple red but turns out it was the psilocybin which is purple. \r\nWe then decided to return to my friends dorm to get my boyfriend a bottled water to help his stomach. It was on the way back that I started really feeling the mushrooms take affect. As I was walking it felt like my feet were melting to the right and off the path and I was compelled to walk in a circle to the right, which I did several times before stopping. Back at the room my boyfriend was able to chill more and just shut his eyes and relaxed. He complained of his body feeling numb and we later described it as our whole body feeling like our mouth does after weve eaten a Sucret. \r\nIt was now when I started really hallucinating my vision became boxy and it felt like I was looking through several picture frames. The texture of the wall started melting and flowed up into a tie-dyed tapestry on the wall. When I closed my eyes I saw some flower shapes then arched ceiling shapes which were pulsating outwards. Somehow we wandered into the bedroom and snuggled up in a bunch of blankets. What felt like a year was 10 minutes of me staring at a bulletin board, which was pulsating. Eventually my friend pulled out some crayons and I tacked some paper to the wall and started drawing. It was all nonsense but made sense at the time and I wrote a few little messages about what we were talking about. \r\nMy boyfriend who had been struggling for a while sat upright and commented on how soft the blankets were. We then spend 2-3 hours rolling around in the covers, and attempting to put a movie on but technology was difficult to use and we ended up just sitting and rolling in the blankets for the most of the time. At about 3 we decided to go for a walk and find food. It took me several attempts to do this although because I would find myself walking towards the door and suddenly I would be sitting down because that was more comfortable. 45 Minutes later we finally got up, we were pretty much done but still felt off and very hungry. The Campus does not have much food so after wandering for a while we went into Olympia in search for Mexican food. I was unable to eat much of mine because of how my stomach was reacting with the psilocybin. \r\nReflecting upon it its hard to describe it was such a wonderful time, when I wasnt worrying about my Boyfriend, which I never expected because of how much it had scared me before hand. The struggling I did before the trip asking myself why I was doing this, etc I believe in general helped me overall. Describing what I saw is easy but what I felt is a whole other thing. I came out with a sense of Understanding, understanding what Im not sure of but I know I do. Ive been blown away by the experience but also the day after question the fact that I actually took mushrooms. I hope this helps any first timers who are unsure and nervous about their first experience because not all first times go bad.\n\n\n"
}
