{
 "title": "Changed How I Think",
 "author": "Bertie",
 "citation": "   Bertie. \"Changed How I Think: experience with Salvia divinorum (10x extract) & Cannabis (ID 32183)\". Erowid.org. Nov 15, 2007. erowid.org/exp/32183",
 "substance": "Salvia divinorum (10x extract) & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "32183",
   "Male",
   " ",
   "Not Given",
   "Nov 15, 2007",
   "2370",
   " "
  ]
 ],
 "report": "<p>About 2 years ago I decided to try something new. In the past Ive experimented with Cannabis, LSD, mushrooms, LSA and a variety of different uppers and downers but this changed everything. I could never have prepared myself for what my mind was about to endure. Me, an old mate and a couple of newly acquired friends at uni decided to experiment with salvia 10x divinorum. It was a lazy Sunday afternoon sat around in my lounge in my student house listening to sum chilled D&B. I'd managed to acquire sum salvia 10x extract earlier that day. Already quite stoned from smoking bongs all day I asked if everyone was up for a bit of experimentation and to no surprise everyone was. I mixed a small amount of the extract with roughly one bongs worth of skunk and of course was first try it.</p><p>I lit the bowl and slowly inhaled as much as my lungs could take then laid back and held it down for about 20 seconds. As I let the smoke out I tried to figure out what was going on, everything suddenly became very hectic. The chilled D&B suddenly felt very uncomfortable and annoying and my mates were laughing (obviously very stoned) which I couldn't understand. I tried to stand up to turn off the music but just fell over back onto the couch. At this point I think one of my mates turned up the music, thinking this is what I wanted! This was about 30 seconds in. Next I felt myself being sucked backwards into the couch, a very peculiar feeling and not very nice so I tried to fight against it, to no avail.</p><p>Everything in the room turned in cube shapes including my mates, with no shade or depth to the colours and everything started to be sucked to somewhere behind me which I couldn't see. Every part of everything began to break apart into seperate shapes/cubes, like the basis of a 3d animation with no texture, depth or lighting, and slip away, but I didn't know where it was going. I felt terrified, I think I can describe the feeling as everything I ever knew was fake and not real and there was something behind reality but it was still not known to me and I wanted to know where everything was going but didnt at the same time for fear of losing reality alltogether!</p><p>Finally when everything up to me had dissapeared I started to come apart into these shapes, I couldnt move, my friends had all dissapeared with the room and I was about to join them too. I remember my head being part of the couch with no body, as in my body left. One of the most terrifying experiences of my life!! At this point things suddenly started to make more sense and reality started to return, not in the same way it had just left me but sort of just be there again.</p><p>One of my mates had smoked it whilst all this was goin on and had similar experiences, not in the exact same context but similar feelings and visions. Apparently I climbed across the floor and up one of my friends at one point and tried to 'pull' him somewhere but ended up being thrown back onto the couch in the process. I also now remember that whatever I touched had a horrible damp, 'spiky' feeling that scared me. Apparently this all took place in the space of about 4 or 5 minutes, but felt alot longer to me! After I was back in 'reality' I felt that I had been conned and everything was fake and my friends were actors of some sort and my life up until this point had been a complete farce but I hadn't realised.</p><p>This feeling stayed with me for a good few hours after the initial 'trip' had ended. I soon came back into reality though and back into the old 'rat run' that I like to call life, but ever since do occasionally question things that I never questioned before. If I had taken this drug before experimenting with harder hallucinogens I don't think I would have tried anything else. Very strange and scary. Did I try it again at a later date? Yes! Would I recommend it? No.</p>"
}
