{
 "title": "Mushroom Wilderness",
 "author": "Shoker",
 "citation": "   Shoker. \"Mushroom Wilderness: experience with Mushrooms - P. cubensis & Cannabis (ID 32192)\". Erowid.org. Jun 19, 2007. erowid.org/exp/32192",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "  T+ 1:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "  T+ 2:00",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "  T+ 0:00",
   "1.75 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32192",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 2340",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was already out of my mind on mushrooms when my buddy Randall stopped by and proposed a weekend camping trip, chock full of weed and alcohol. I figured outback in the woods, sounds like some shrooms are in order. The next day I acquired an eighth. We checked some local campgrounds, all of which were practically packed, as it was Memorial Day weekend. The plans were all set, the camper was packed, so off we went into some wooded area behind a pasture, not the ideal camping locale but an isolated wilderness area nonetheless. \r\nOnce we unpacked and settled, people were showing up, among them my friend Pedro and his two visiting college buddies Chas and Dan. Everything was in excellent order; the drinking commenced. Randall had started a fire despite it being fairly light still. I nestled a chair near it and happily ate my eighth, Beth, a high school and college acquaintance of mine, inquiring of them throughout. 'What do they do for you?' she asked. I replied to the effect that they were psychedelic but really somewhat inexplicable, 'By far the funnest drug I have ever done.' I sat by the fire then walked around, talking to people I hadnt seen for a while, conversing on various topics, roaming to random subjects.\r\nAround T+1:00 I was still relatively sober. I was wrapped with the low range of a wonderfully familiar body high. I decided a bit of weed might be nice. I took a few puffs of a joint circulating near the camper, leaning against it lazily desperate for support. 'How ya feeling Shoke?'\r\n'Not real high. Im not tripping at all.' This was strange I determined but most likely related to my consumption of another eighth two days prior. I had that awkward sense that in some capacity my consciousness was unusual as if some unidentifiable facet has changed but certainly no visuals. My head was exceptionally lucid, a clear palate upon which ideas could be easily drawn, considered, examined, and understood with seemingly accelerated thought. \r\nAt roughly T+1:30 night was descending. As if directly correlated, I began to feel relaxing electric numbness throughout my body. It expectedly elevated as darkness deepened. I put myself by the fire where I felt compelled to spend the majority of the evening. Around T+2:00 I decided that the mellow flowing of the grass and gentle benign sense of personal and environmental objectivity were simply not enough. As such I bought another eighth and ate it immediately. I remember Chas smiling wryly as he produced their earlier procured mushrooms, 'You booming bastard.' His statement appeared the general consensus among Pedro and Dan who in turn consumed generous amounts. \r\nWe needed to run to the store for reasons beyond my recollection. Once inside the gas station, the drug announced itself as fully in charge. I caught myself staring at a row of chips, yes those deliciously packed morsels, and went outside to avoid arousing suspicion. I was blissfully exploring a flow of thoughts concerning various aspects of civilized life in my town while fixing my gaze firmly on the ground. Occasionally I would glance up and watch cars, utterly fascinated with the individuals inside each passing vehicle. I wondered at and imagined their respective itineraries. Where were they all headed? What were they all doing, thinking? What manner of concerns pressed upon them? I was pondering my cigarette while sitting on the curb when everyone FINALLY emerged. \r\nDuring our return to the camper, we traversed a thigh high pasture. A coyotes howl sounded relatively nearby against the constant throbbing backdrop of the indomitable frog army. I felt a connection to all of the life surrounding me, even hitting my legs as I strode. Again we came to the fire, the blazing beacon lying at the heart of any good camp. The glowing fire-pit was lazily rotating and sinking beneath my feet, threatening to suck me into an ember embrace. \r\nRight around this point I hit the peak. I remember spending an enormous length of time thoroughly engrossed by the flowing liquid sky and one captivating tree. I said something like, 'That tree is fucking out of control.' Indeed it was the coolest thing I have ever seen. Each branch ended in a geometric cluster glowing with radial neon blue tubing along the shapes edges. These figures, quite defined in the darkness, were swaying, undulating, and twisting dramatically. \r\nOur individual journeys were suffused with bowls as well as commentary and discussion on diverse subjects and perspectives. The only thing not totally beyond my ability to recall was Dans assertion of how horrible the Western approach was when expanding and encountering new peoples, truly believing that these fellow human beings needed to be taught something, that they lacked the requisites for salvation. How true! What horrid audacity and arrogance still abounds today! \r\nAs I roamed through a ethereal cognitive and physiological paradise, I became aware of, and was eventually overcome by, the innate depth and remarkable beauty of the mundane, so routinely ignored. Ive always felt that psychedelics allow one to view the world with wonderment similar to that of initial childhood experience, or as Huxley put it, '..Adam on the eve of creation' After an unknown duration of similar occurrence, I split another eighth with Pedro. An hour or so later I decided to leave at around 4:00 a.m. The tripping trio remained awake for several more hours. I got in my car and headed for home.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r\nThe sky gleamed and glittered as the sparkling street stretched before me. I had little difficulty driving, but I would not recommend it as I was constantly forcing myself to ignore the wavy pulsating dashboard. I arrived at my house, drank some water, and immediately got into bed. A sizable heap of dirty clothes nearby shimmered and listlessly swirled as I tried vainly to fall asleep.\r\nOn previous trips I had been able to shed some of my precluded notions of the concept of self, becoming objective to a degree on the subject, but now when I shut my eyes it was something entirely different altogether. In the dark infinite space behind my eyeballs, I lost the sensation of being, as if my mind and body ceased to exist as I know them. I became an inert inactive intelligence. This lack of concrete existence united with the knowledge that I was still an awareness of some form. With this singularity of all things present, I perceived my essence as nothing and everything. \r\nI observed bits and pieces of vaguely familiar stories coalescing, like watching dreams form. One was of a classroom with desks, children, and a teacher all suspended in the void. The stories were short, disassociated, and on the surface entirely random, yet they possessed a divinely ineffable cohesion. Every now and again I would open my eyes to ascertain whether or not I was still alive, finding the transition between the two worlds so intense that I would be fiercely gritting my teeth. \r\nIn time I dwelt on existence and the tree. I realized the utter transience of all things. Everything Ive ever known or been will end; that magnificent tree forever growing upward is solely a testimony of a doomed struggle persisting until it returns to earth. We are all engaged in a hopeless battle that will surely draw to an eternal curtain closing. I will be buried in the ground forever. However, these contemplations didnt distress me. They were instead met with overwhelming acceptance and affirmation. Permanence breeds sacred security and complacency. The desire and antithesis of life. I fell asleep two hours later to related musings.\n\n\n"
}
