{
 "title": "Panic on the Universal Plane",
 "author": "Goldman",
 "citation": "   Goldman. \"Panic on the Universal Plane: experience with Salvia divinorum (10x extract) (ID 32198)\". Erowid.org. Nov 15, 2007. erowid.org/exp/32198",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "32198",
   "Male",
   " ",
   "Not Given",
   "Nov 15, 2007",
   "3398",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experience starts with smoking around 1/8 of a gram of salvia extract; I held it in for a while, I don't remember when I exhaled. I began to feel a force, a pulsating force moving in a clockwise direction that was pulling me into it; I remember resisting this force, it caused me panic - I began responding to non existant forces 'No, you can't take me' I uttered. I tried to escape this force by leaving my room, but suddenly realized that if anyone else saw the state I was in, I would be in big trouble. I returned to my rotating chair, and decided to wait it out.</p><p>At this point I was feeling a panic, as if I would be instantly killed if I gave in to the force. But I did give in. I felt a huge force of gravity lock me into my chair, only able to sit and observe the destruction unfolding before me. All of the objects in my room were being pulled to the ground by a violent gravitational force, while a 'conveyor belt' pulled everything (including myself) into the 'void'. My room then appeared to make a complete upside down flip. I was no longer in my known universe. My floor was a bright orange color with a plastic consistency, I became integrated into the floor. The floor was further integrated into a seemingly infinite quilt. I imagine this may be the 'universal plane' referred to in many reports of dissociation, for I was no longer myself.</p><p>For a short time, I realized that I was not necessarily going to die here, but just as quickly as I realized that, I began to fade back into reality. The first thing I saw was smoke; I had knocked my lamp onto a pile of papers that had begun to smoke (an obvious reason to have someone supervise you). I had come back into the real world, but I hardly believed it. I turned on the tv, which for some reason calmed me down and convinced me I was back. The whole experience must have lasted less than 5 minutes, and it begun within 15 seconds of inhalation.</p><p>I know that there is one more level to the salvia experience that I was not able to attain, I felt its presence, however. With a slightly larger dose, and a more willing mind, I may be able to reach it. Rational thinking while under the influence of this drug was, for myself, impossible. One side note - I frequantly smoke marijuana, for a good 5+ hours, I felt a repulsion to smoking at all.</p>"
}
