{
 "title": "Peer Pressure Almost Fatal",
 "author": "Sucker78",
 "citation": "Citation:   Sucker78. \"Peer Pressure Almost Fatal: experience with Methamphetamines (ID 32191)\". Erowid.org. Mar 4, 2011. erowid.org/exp/32191",
 "substance": "Methamphetamines",
 "bodyweight": "287 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 32191",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 4, 2011",
   "Views: 7251",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have tried powder form speed twice in my life. The first time left me with nothing more than a sleepless night and half the next day. The second, left me with a fear that I may never lose.\r\nI had just gotten out of the Army after 6 years and I wasn't too happy about it. I was devastated when I hurt my back and was unable to continue my career. So I came home after being gone for so long and everyone was gone. I only had my wife's two brothers to hang out with. I knew that they had a friend who made meth in his house, but I had no idea that they themselves used it until a late night of helping said friend move. I let them talk me into trying it and nothing happened. I had absolutely no effect from it at all. All I did was stay awake, just as if I had taken a couple of my ephedra pills. \r\nA couple of months late, the younger brother and I was up running around and he pulled out a bag. I was not feeling all that splendid, to put it lightly, due to a ton of stress. I let him talk me into doing it again, and this time I had everything I have read about. My entire world was clear and happy. And this was from dipping my finger in it and licking it off. I could only imagine the possibilities!\r\nNow, their friend had this method of using the tea filters he used to manufacter the speed to also brew tea through. He called it his 'happy juice'. I downed three tall glasses of 'Happy Juice' within a half hour. I felt on top of the world. \r\nLater in the day, we were driving over to the friends house when out of nowhere, my heart jumps from a normal rate to irrate. It was beating out of control and I felt this huge pressure on my chest as if there was an elephant stepping on me. I couldn't breath. I had to pull the car over and dial 911. I was positive I was having a heart attack and there was no staying calm about it. I was freaking out. When I got to the hospital, they did an EKG and put me on a heart monitor. My heart rate was 170, but they said I didn't have a heart attack. I ended up going back to the ER when I got home to a different hospital. I fell asleep and woke up quickly as I felt I had stopped breathing. They too said I did not have a heart attack. \r\nThis was 6 months ago and I am nowhere near over this. I have been to the ER a million times and I have even had a cardiac cath done and I am only 25. I am continually told that I have no heart damage, and I absolutely do not believe it. I have chest pain 24/7 and thoughts of suicide constantly. I am on a ton of meds for depression and anxiety and they don't even let me live a comfortable life. All I do is think about dying. I have not, nor will I ever touch anything remotely associated with drugs again. It's not worth my life to feel high. I still don't know if I will survive what happened 6 months ago. Whether from heart damage or by my own hand, I am still that affected by the incident. I have no idea how much I took, but I was still pissing hot 4 days later when I went back to the ER. I hope this helps someone to either not pick up a drug or to stop. Being scared for my life and not knowing whether I was going to live or die was not fun.\n\n\n"
}