{
 "title": "I Hold in Awe",
 "author": "Funkee",
 "citation": "   Funkee. \"I Hold in Awe: experience with Hydromorphone (Dilaudid) (ID 32222)\". Erowid.org. Mar 25, 2004. erowid.org/exp/32222",
 "substance": "Hydromorphone (Dilaudid)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Hydromorphone",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32222",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 25, 2004",
   "Views: 48927",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Summer of 2003 I had an anterior capsular shift performed on my shoulder. Ridiculously painful operation; as the anesthetic block wore off the pain came. My shoulder began swelling and pressed against the incisions. Prior to this I had never tried any opiates. Two percocets I was given, which did absolutely nothing for pain. It took hours until my nurse came in with 30mg in 2 ampoules of morphine. Right in that shoulder; I was flying, soaring, nodding off, but the horrifying pain went nowhere. I was pale white, I looked like death I was told, pulling my hair out, disassembling my gun sling brace.</p><p>The brace is a giant piece that looks like body armor that held my arm at a 90 degree angle in front of me. I had to have it on for 24/7 for a month. No showering for me, fun, not.</p><p>Back to that day. I finally got the nurse to come back, and she administered another 15mg of morphine, intramuscular as before into my left thigh. I was as high as a kite, but I couldn't enjoy it. The pain just remained and I couldn't focus on anything but it. I was getting so very sleepy but the pain kept me awake and I was getting so frustrated. Perhaps another 3 hours later, my doctor had to speak to my anesthesiologist who then put me on a PCA pump of dilaudid (hydromorphone). I was told that I had 10 doses flowing every hour, via IV and 2 more with the press of a button. I did not know the mg content, but it was finally the only thing that helped with the pain. It went away and I was in heaven. I didn't even bother to enjoy it, I just went to the best sleep I've ever had in my life, so relieved.</p><p>But they feared I'd become addicted very quickly. After the first night, I was weaned off, and hell it wasn't just any wean. The flow was completely cut off. I wasn't aware of this. My limit to pressing the button to get more, was once every ten minutes and maximum of 5 times per hour. The dilaudid would wear off before 10 minutes and for those 4-5 minutes I'd be in pain again. The next two nights were very difficult. And the nurses were very grouchy about me pressing the button too many times. They probably didn't believe that I was in such pain. One night the night nurse woke me up to give me my percocets and told me she's taking me off the pump. I was shocked. She told me that I wasn't feeling anymore pain and that I did not need it anymore. She told me I was going home. I was so angry at that point, more upset though. She was telling me how I felt and what I was going through. I was stunned. But I kept the pump until the day I left, and by that time I tried not to use it much anymore as they requested.</p><p>The first day, I would close my eyes and immediately I would be in REM. I only dozed off, but I had vivid dreams. The one I best recall was where I dreamt that I decided to take a jog around the floor with my pump and all. When I returned to my room there was a giant (6 foot) glass of milk in my bed. Next thing I was told that I yelled in Russian was 'Why Milk!'</p><p>Most of the nurses and physical therapists were absolutely wonderful, and remarkably good looking. Too bad that I was in that giant brace, having not brushed my teeth in days with my hair all ragged, but I didn't care. I wasn't there to impress them, but I thought I was supposed to. I was delirious. A nurse told me of a patient who was also on heavy medication and had left his room. He returned to another room thinking it was his, where a little girl laid where his bed was. He tells her to get out of his bed, which she promptly agreed to. He was perhaps 19 or 20, and she was 8. The nurse came and fixed the situation before anything really happened, but it was quite good for a laugh.</p><p>In any case I never got to truly enjoy the power of dilaudid, which I hold in awe. It was the only thing that saved me from utter misery and kept me together during some of the hardest days of my life.</p>"
}
