{
 "title": "Conscious Weight",
 "author": "Gaius",
 "citation": "   Gaius. \"Conscious Weight: experience with Nitrous Oxide (ID 32263)\". Erowid.org. Aug 23, 2006. erowid.org/exp/32263",
 "substance": "Nitrous Oxide",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32263",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 23, 2006",
   "Views: 10690",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a Junior at an Ivy League college, and I do well in my studies. I am a brother in a fraternity; this was an eye opener. Previously I had been very naive about drugs and alcohol: I must admit that my first times being drunk and/or high occurred in the basement or back room of a $4 million fraternity house, and not during middle school or even high school.</p><p>I was introduced to Nitrous Oxide in the spring of 2003- not only was this the first time that I had actually taken the drug, but the first time I had ever even heard of it. (Naivety!) I was moderately high when I took the first hit out of the tizer- even though at that time I had never bought pot, my friends were kind enough to let me experiment with it- no charge.</p><p>I inhaled deeply, held it, and felt it overcome me. My body dissolved; I felt like I had been reduced to a being of miniscule cubes and that these cubes were being spread in every direction by a gentle gust of wind. It was like a full body orgasm, that is perhaps the only accurate way to describe it- the visuals projected on the dark screen of my closed eyelids mirrored my physical state, brightly colored geometries dissolving in euphoric gusts. I began laughing uncontrollably; pure pleasure! I fell to the floor, rolled around a bit, completely absorbed in my state, and it felt as if 10 minutes passed.</p><p>Then I came out of it. There was no big comedown, I was just back. I remember asking for (and receiving) another whipit. This was truly the best thing that had ever happened to me.</p><p>A few months ago I took 20 or so when really high and had my best drug experience to date (but I have not yet tried the psychedelics). I entered some sort of time loop, pure euphoria, and one whipit would put me into this state for 6 (real) minutes, an eternity in my dissolving mind. We were watching some cartoon, and I thought that we must have watched it 40 times because each line repeated; I knew what each character was going to say; kept asking 'how many times have we watched this.' It was peculiar, oddly satisfying. I have never had a bad experience using whipits.</p><p>Fast forward to now: I have now done my fair share of whipits, perhaps more. The most I have done without taking a breath probably approaches 10, the most in a short period of time (an hour or so) a box of 24. My use is under control, and very pleasurable. That is not my concern in penning this experience.</p><p>I sell them now. Where once they were scarce, at $20 a box, they are now plentiful, at $13. Since January of this year (it is now March) I have sold 4,648 whipits, and have seen all patterns of use. There are the beginners, those who, like me a year ago, have been unexposed to the drug but are eager to embrace it. There are the moderate users (also like me) who consume a box every couple weeks and are content with that. Some enjoy them alone, some (me again) enjoy them when potentiated with pot. Then there are the users who I make most of my profit from, and those whose use weighs most heavily on my mind.</p><p>One of these users, a friend of mine-he sells me pot and I sell him whipits- I am very concerned about. He will go through 8 boxes a day, an entire case of 600 whipits in 3. He will do this until my supply is exhausted and I am forced to order more. He works on them- reading Milton or perhaps philosophy- I cannot understand how- but he can. I have noticed no ill effects in him, he reports no numbness because of B12 deficiency (even though he takes no supplement) and his mental capacity is not affected. But still I worry; no one I know has ever had a bad reaction to whipits and I have never read of an 'overdose' that resulted in permanent damage, but I worry. One day I may find him dead; of asphyxiation, of falling down steps, I don't know of what.</p><p>But the profits are good, and I make over 100% profit (30 cents) on each whipit I sell.  But I fear that one day I will kill a friend or find myself expelled or in jail. These are the things that weigh on my mind.</p>"
}
