{
 "title": "Benadryl Summer",
 "author": "Sindra W.",
 "citation": "Citation:   Sindra W.. \"Benadryl Summer: experience with Diphenhydramine (with Acetaminophen) (ID 3229)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3229",
 "substance": "Diphenhydramine (with Acetaminophen)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   " ",
   "  ",
   " ",
   "Acetaminophen",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 3229",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2001",
   "Views: 33311",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was two years out of highschool going to a local community college and thought I was the coolest.  Anyways I had tired of all the pot and acid and what not. I had been listening to the Velvet Underground alot that year and wanted to be all hip and down with any sort of crazy drug out there and not associate myself with all the dead head/311 fans around me.  I snorted ritalin,I loved percocet, my heroin experience was yet to come.  I was wanting to get high some boring night and I heard tylenol pm got you high.  \r\nAnyways I take about 3 of these little blue oblong bastards. I wait about thirty minutes. I get a sudden kick of drowsiness and my mouth has a weird aftertaste of the pills.I stand up and find it hard to walk. I needed a cigarette and wanted to go in my room and play music. One good thing about these drugs and dmx is that they do make music a very interesting thing. So I go in but it is dark and I am struggling to find my lightswitch because these sickly, red and blue jelly fish patterns are appearing in front of my face. Finally tada! I have light. Hmmm...What did I want to play? I finally settled on some Siouxsie and the Banshees. No hippie music for my chic drug trips. Just surreal Goth and Punk and what not.\r\nI lye back I close my eyes. I feel sort of cold and warm waves going over me and under the music it sounds as if Siouxsie is saying my name or is it my parents? I am whigging out now. I get up open the door my parents are not calling me at all. So I need to get out. Its a nice summer night and I walk across the street to my best friends house. So we go inside he is playing some video game. I forget which game but it was violent and it gave me this feeling of impending doom. We go outdoors to smoke and I pass out on his swing but don't remember passing out at all. I stumble home. Overall all not a good drug for the loving acid trip or shroom thing.  More like horror movies or goth music.\n\n\n"
}