{
 "title": "Where is She? A Sitter's Perspective",
 "author": "Salvia-Sitter",
 "citation": "   Salvia-Sitter. \"Where is She? A Sitter's Perspective: experience with Salvia divinorum (5x extract) (ID 32345)\". Erowid.org. Mar 29, 2004. erowid.org/exp/32345",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32345",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 29, 2004",
   "Views: 6770",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday I witnessed the hardest Salvia trip I have ever seen. We got the water bong ready, packed a bowl for my friend D, while he sat down and got comfy. This would be D's first experience with Salvia divinorum. We packed him a very large bowl, and did not expect him to pull the whole thing down in one huge hit. But he did. He lit up, and sucked down the Entire Bowl in one massive rip. My friend S counted off the needed 30 seconds for him. When the 30 seconds was up, D exhaled the smoke (tiny wisps of smoke was the only thing he exhaled), and all hell broke loose. </p><p>Immediately upon exhaling, D began laughing. But This wasn't just laughing, it wasn't even just Stoned laughing, it was Hysterical laughing. He was laughing so hard everyone else in the room could physically see him struggling for breath. He laughed like this for approximately a minute, straight. During this minute of hysteria, also, he was constantly drooling on himself. He obviously did not realize he was, because he didn't make an attempt to stop it. He just kept on laughing and drooling, seemingly without a care in the world. After this minute of extreme laughter, he just kind of sat back, and mumbled, mumbled to the point where nobody could understand what he was trying to tell us. He sat and mumbled and drooled and looked at everything like a wild animal for about another minute. After that, he attempted to stand up. Attempted is the key word, as when he did try, he simply toppled backwards back onto the couch he was sitting. He mumbled and drooled some more, then tried standing again. S said to him 'It will be over in a few minutes, just try to sit back and calm down.' </p><p>Obviously, D was somewhere else, because he made no indication that he had even heard what S had said, and stood up anyhow. This time he made it up, but staggered quite a lot. This worried all of us, as we were all his sitters, and we knew that this could lead to something potentially dangerous. We didn't want to physically force him back into his seat, and frighten him, and it was apparent he wasn't hearing what we were saying to him, so we decided to simply let him wander a little bit, but kept a very close watch on him. He Staggered out into his kitchen. Upon entry, he kept repeating phrases like 'What the fuck...', 'What the fuck's going on', etc, etc, and was just looking around wildly, mainly towards his feet, and the floor. (all the while, still drooling every so often.) After some more incoherent mumblings/shoutings, he staggered about 3 feet over, right where his kitchen turned into a hallway. He stopped right before the hallway, being still in the kitchen. </p><p>At this point, he started again looking around the room crazily, but mainly at the ceiling, and began yelling 'WHERE IS SHE' at the top of his lungs. He repeated himself many times. While he was shouting, he was making frantic motions with his hands. Not waving them about or anything, but rubbing his hands together very quickly, as someone does if they are extremely panicky, or scared. He kept yelling 'WHERE IS SHE', and finally, my friend M asked him calmly 'D, who is 'She''? in response, he again yelled 'WHERE IS SHE'. M asked again, 'Is it Linda?' (Linda is D's mom....we were doing this at D's house, without her being home. We thought maybe he wanted his mother) He responded by screaming 'NO', in almost a whiny way, similar to when a child throws a temper tantrum. M asks D, 'Is it the cats?' (We thought we heard him mumble something about the cats previously, so maybe he was again referring to them.) </p><p>Again, in the same manner as before, he simply yelled 'NO!' (I don't know if it has any meaning or not, but while D was screaming his question, he was definitely looking towards the ceiling of his house, looking towards something higher....Maybe a higher being, or entity?) After his last shouted 'NO', he stopped yelling. He walked back to the couch, tripping and stumbling very slightly, mostly normally, back the to couch he had originally been in. He calmly sat back down, looked at all of us, and said very calmly and simply, 'Guys, what the fuck just happened?'    From there on, he acted normally, just with some visible after-effects. We told him all that had just happened, and he seemed dumbfounded. His whole experience lasted about 6-7 minutes. He said that the entire thing had seemed like it lasted only 30 seconds. He said all he remembered was actually smoking it, then was in the kitchen screaming, and sitting back down. That was the extent of his knowledge and memory of what happened.    Nobody can make sense of what happened to him. None of the spectators, me included, and not even him. </p><p>I definitely think that he should not have done as much for his first time.</p>"
}
