{
 "title": "More Confused, Less Visual",
 "author": "SpiritualArmy",
 "citation": "   SpiritualArmy. \"More Confused, Less Visual: experience with Mushrooms, Venlafaxine (Effexor), Divalproex (Valproic Acid) & Cannabis (ID 32350)\". Erowid.org. Jul 12, 2010. erowid.org/exp/32350",
 "substance": "Mushrooms, Venlafaxine (Effexor), Divalproex (Valproic Acid) & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "225 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   " ",
   "750 mg",
   "oral",
   "Pharms - Divalproex",
   "(daily)",
   " ",
   "4 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "5 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "32350",
   "Male",
   " ",
   "Not Given",
   "Jul 12, 2010",
   "Views: 6286",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a Friday night and instead of simply smoking a few bowls as a friend and I had planned, we headed to my college to shroom. We ate as soon as we got there, and other than my friend and I, no one had as many as 4 grams.</p><p>It only took a good 15 minutes before I started feeling them. We were outside smoking a bowl of weed and I noticed all the bricks of the house were jutting out of the house, like little tetris bricks. We headed back inside and took a seat in the living room, ready to watch Spy Kids 3D on a big screen. Now and then I would fade in and out of understanding anything the movie was saying. I started thinking, is everyone else seeing what I'm seeing? Is anyone alive in this room? Am I alone? I took off my 3D Glasses and turned around. I was horrified. Everyone looked the same in their glazed over stares with their glasses on. I yelled at them, I stared at them, I gave them the finger, I shouted profanities, nothing worked. I admitted defeat and went outside for a smoke.</p><p>I heard the world become a little quieter... I stood there by myself, wondering what had just happened. I felt a fear inside of me, I couldn't head back inside. I went to the street and played hackeysack with myself. I wanted a car to come racing around the corner and run me down. I wanted to feel the insides of my body coming out. It never came. I headed back and felt everything *alive* around me. I headed inside and laid down on the floor again. I stared up at the ceiling and felt like my body was rising up with the air. I lost myself for a good 20 minutes and then everyone headed outside to smoke.</p><p>We smoked a joint and talked for awhile, all the while laughing nonstop. It didn't even matter what was happening, we couldn't stop laughing. Headed back inside. The movie was on for a bit longer, but I had lost the ability to concentate on it. I had stopped wearing 3D Glasses at this point, as I didn't see the need for them. Everything seemed somehow more dimensional then it was before. The movie ended and music was put on. I retired to the kitchen to try and make some sense of how I was feeling. No such luck. I spent awhile trying to understand what everyone was talking about, but I routinely spaced out and felt like my mind was being bubbled up inside my brain. Every now and then I would hear something that would bring a 'POP' to my head and I'd phase back in, behind the conversation.</p><p>I headed outside once more, to smoke a bowl. I smoked and proceeded to stare at the brick wall again. It had some sort of feeling pouring out of it. I had to touch it. I felt like if I did, I would be able to make some sense of why it existed. I came inside and did the same with the straw walls. They seemed so odd, so out of place. I wanted to reach across and touch every part of the wall, every contour. It felt so alive. I finally gave up and sat down, trying to relax and calm down for the eventual drive home.</p><p>4 grams is a different trip from 3 for me. It has a lot more confusion and a lot of struggling to find reasoning behind things. I have shroomed before when I was off anti-depressants and I found I hallucinated more. On the effexor and valproic acid, I found myself very confused, yet having a good time. An enjoyable trip, but leaves many questions unanswered.</p>"
}
