{
 "title": "My Time in a Drawing",
 "author": "Kitco",
 "citation": "   Kitco. \"My Time in a Drawing: experience with Ketamine & MDMA (Ecstasy) (ID 32376)\". Erowid.org. Jun 21, 2007. erowid.org/exp/32376",
 "substance": "Ketamine & MDMA (Ecstasy)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "1 bump",
   "insufflated",
   "Ketamine",
   " "
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 32376",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jun 21, 2007",
   "Views: 6150",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The night started off with two pills of e spread apart. It was only my second time doing the drug and I had a stressful day at work so my high was pretty restless and not all that 'high' in the expected kind of way. I'd done a low dose of k on a previous occasion but didn't get much more that a mushy feet kind of feeling, like I was walking on pillows, so this was going to be my true 'initiation'.</p><p>We were all pretty well at the point of passing out when the bullet was passed around, me and two others of the crew were sitting on the sketch pad, couch cushions, blankets etc., just chilling out when one of them finally found the pack of smokes they had been looking for all night. All was pretty well normal until we realised that the person holding the cigarettes up had been there for what seemed an eternity and when my toes, which I had sitting holding on to started to feel like sugar cubes in my hands. It was amazing how quickly the transition from nearly baseline to, uh, cubic occurred. The strange thing was that we had totally differing experiences when we were on e but we now found ourselves to be completely on the same level. Then the adventure began. </p><p>Whenever we moved it felt as though each joint was articulated, and felt as though they popped/clicked when we moved; I swear that you could almost hear our movement, each joint moving independently of the others, basically we had turned into robots. Each movement being a planned event with the outcome already decided. Me, being the inexperienced one, had no idea what the drug truly felt like but my co-trippers were all saying that it was nothing like any experience they'd ever had with K. </p><p>Our vision was cubed, the edges of objects were highlighted and came to linear points with the remaining areas being blurred; we were in a cubist painting. Walking was possible, but it took a very long time and seemed as though it was also cubed, the foot starting at one wall of the cube, then lifting up to just brush the top of that same cube and then falling into the opposing wall and finally touching the ground. Wierd. At one point I was walking through the kitchen and was all the sudden transported out of my body and found that I was looking down at myself but both me and the room had turned into a blueprint and I was a mechanical being, very box-like, and walking through this landscape. </p><p>It just so happened that I was on my way to the bathroom, but when I got there and sat down I was still seeing the room I had just come from in full detail. It wasn't until I looked to the side that I realised where I really was, even though I knew where I had been going, and that I was in the bathroom the whole time. This was a common experience to everyone there but only seemed to happen when we were in the bathroom by ourselves, I guess because we were separated from everything. We found out later that two of the friends who rented the place at times didn't even recognize it as their own home. We were exploring a truly foreign landscape.</p><p>And that ends the report on the first bump. When we finally 'came to', the four of us were standing in a bathtub of warm water, apparently trying to warm up the feet we felt were too cold. We all started kind of half laughing at what had just happened, deciding that we had been blessed with a truly unique experience. We did a couple more bumps throughout the night, trying to understand this new reality which seemed beyond comprehension even though we were living it at the time. I have done K many times since and have NEVER had that same experience, we always buy from the same source but, yeah, it totally blew my frame of reference in terms of the functioning of the world and its participants.</p>"
}
