{
 "title": "I Feel Like I'm in a Video Game",
 "author": "Kaliescope Eyes",
 "citation": "   Kaliescope Eyes. \"I Feel Like I'm in a Video Game: experience with PCP & Cannabis (ID 32419)\". Erowid.org. Jun 19, 2007. erowid.org/exp/32419",
 "substance": "PCP & Cannabis",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 32419",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 50127",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was 16 years old and had been smoking pot on a regular basis with my best friend, whom I call Fry. Fry and I first just used to get high on weekends at her house, and all it would take for me was a skinny joint of some regs. We would generally buy a dime from this kid we met at school, Gangsta Ted. Ted was a good guy, never cheated us or anything. Fry and I started smoking more and more, and soon we befriended some older kids who would all pile into someone's car/van and get stoned and go to the movies or the bowling alley. I was young in body and mind, and this was how I decided to propel myself into more adult situations. This was my escape from being from a nice family. I didn't want to be nice anymore, and neither did Fry.\r\nOn New Year's Eve, 2000, me, Fry, and two girls we knew from school, Ali and April, went to Gangsta Ted's to pick up our pot. By this time we had started buying quarters, but tonight we wanted a half o, on account that it was New Year's Eve. Ted said that his connection was dry, so he got this bag from someone else, he hadnt personally smoked it yet, but said it smelled nice. We gave him his money and left.\r\nWe all went back to Fry's house to smoke a bit before we went to the Pocket, a place where local indie bands played. April cleaned the weed while Fry played with my hair. Ali dressed me in some of her clothes and I looked very cute. I was feeling very good. We packed a bowl in Ali's glass piece, and proceeded to smoke. The window was open and it was blowing in cold air. I wrapped myself in a blanket. We all got a couple hits and the bowl was cashed. No one was very high. They all asked me if I was, because I was the smallest and was always high first, and was always more messed up than the others. I said no, and we packed another.\r\nOn our third bowl, I began to feel very funny. I was high, but something else was going on. I thought maybe I was sick because my stomach felt like it was doing flips and my head felt very light. I didn't think anything of it. We all sat on the bed, talking. A half hour must have gone by. Ali and April turned on the radio and began dancing around. Fry was laughing. I was not laughing anymore. I had this horrible fear growing inside me and my heart started to beat very fast, but everything around me was moving very slow. I began to see little lights out of the corner of my eyes. Fry made the comment that she was 'Really really fucked up.' She looked very confused.\r\nAll of a sudden, I felt very warm and I looked up at the wall and the walls were climbing with flames, but everyone was laughing and dancing as if we weren't all on fire. 'We're on fire,' I said, and I got up off the bed and tried to walk to the door, but I felt like my legs weren't working so I leaned against the fire and everything went black. I woke up with Fry over me, crying. \r\n'Kimmie, do you need a doctor?' Fry asked, I couldn't think of any words, so I nodded 'no'. I had no idea what was going on.\r\nApril was saying 'We're not getting in trouble because of her. I'm not taking her to a god damn doctor.'\r\nAli was in the bathroom, freaking out. She was screaming, 'I'll jump, April!' April was trying to get into the bathroom, saying 'Fry, she's going to jump.' \r\n'Off what? There isn't a window in there.'\r\n'Yes there is!' Ali screamed, 'It's wide open I'm half way out!'\r\n'What the fuck...' said Fry.\r\nFry had propped me up on some pillows. She tried to tip a glass of water up to my lips, but it dribbled down my lips and onto my chest. She held my hand and talked to me about nice things that I liked, and told me that everything was cool, that I fell and hit my head but she was going to take care of me. I mumbled something about the fire, and she said there was no fire and kept telling me everything was fine. I started to feel better, but I was breathing very fast and didn't want Fry to let go of my hand.\r\nApril had talked Ali out of coming out of the bathroom. I felt like a hollow shell of a human being, but Ali and April talked Fry into putting me in April's Jeep. We were going to the show at the Pocket. I stared out the window during the drive. I had lived in this city all my life, but things looked very different. I cannot begin to describe how I felt that night, looking out the window at houses and trees and the sad, abandoned buildings I had seen a million times before. It was like I'd never seen them before. April made a comment I will never forget. She said, 'I feel like I'm in a video game...like Super Mario..' \r\nI guess that's how I felt, too. I was on autopilot; walking was easy simply because I was programmed to do so. There were a lot of people inside the pocket, and most of them were very drunk. I could not begin to connect with anyone on any sort of level. People I knew said hi and I tried to say things, but nothing seemed worth saying. Fry took me upstairs to a room with a bed and a stereo with CD's piled everywhere. She left me up there with these guys who were very nice and made me feel less weird. I knew they knew I was in the middle of a freak out. They gave me some markers and some paper. I sat in the room and drew pictures all night. Fry came upstairs a couple hours after midnight and we went home. I felt ok mentally the next day, but my whole body hurt. Gangsta Ted told us later our sack had angel dust in it. \r\nIf I had been prepared for it, I'm sure it could have been a very enjoyable experience. But, being a naturally nervous person, I have to say that an unexpected trip was the most horrible mental experience I could imagine.\n\n\n"
}
