{
 "title": "LSD Induced Seizure-type Reaction",
 "author": "dreaming_lucy",
 "citation": "Citation:   dreaming_lucy. \"LSD Induced Seizure-type Reaction: experience with LSD (ID 32413)\". Erowid.org. Mar 31, 2004. erowid.org/exp/32413",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32413",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 31, 2004",
   "Views: 25345",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have partaken in LSD many many, at least 100 times. Never had a 'bad' trip. Had a few where I felt nauseated, which was no cup of tea (is it ever) But never the typical 'paranoia' bad trip you can usually read about. \r\nBUT this past weekend. WHOA. I am still making sense of what happened to me. The thing is, I can not find a similar 'trip report' anywhere on the web. \r\nI took 2 hits of L about 5 pm. This is a very normal dose for me. I usually take anywhere from 2 to 5 hits. I had really been building up a tolerance lately, so I hadn't taken it for about 5 or 6 weeks, this time, I could tell right away (within 30 minutes, started seeing trailers and colors) that the effect would be stronger than normal (which I was pretty happy about, I don't want to eat 3 or 4 hits and barely even see visuals). I had about half a beer to drink but no other substances were ingested.\r\nI was in a parking lot, waiting to get into a show, there were about 100 other people there partying, waiting. It was overall a relaxed, fun atmosphere, a nice day out; but looking back, I was very worn out from a week of long work hours and not enough sleep, and had a lot of stress about money and my relationship with my family in the back of my mind. Last thing I remember was talking to 2 of my friends, probably around 7:00, and feeling very confused, not being able to follow the conversation. It was getting cold out, we couldn't get into the show that we were waiting to see yet, So I went to sit in my car (I only vaguely remember this).\r\nNext thing, I was coming back into consciousness, it was about midnight. My boyfriend was there talking to me, our friend was in the back seat. I remember the last few flashes of my 'trip dream' - that is what is was like, like waking from a dream. At first, I wanted to talk to the people there, but I was majorly disoriented, and I couldn't seem to form words. It took another hour or to for me to completely be able to think and reason. My boyfriend says that through most of it (before gaining consciousness), I was sitting there, twitching, couldn't talk (was basically out of it) but was madly looking around in all directions. \r\nThe last thing I remember before 'waking' was that I was 'inside a molecule, trying to master it'. I am a chemist, and have been trying to master some synthesis reactions (in real life, kids) so this 'kind of' makes sense to me. I also vaguely remember some other things, many images flashing very fast, all unrelated to one another. It was almost as if I had to rearrange every thought in my mind before I could come back to reality.\r\nUntil this happened to me, I was not aware that LSD could produce such a reaction. I have been researching this, and have not heard any other account of a 4 to 5 hour long seizure-type reaction. I am also pretty sure that until I find a scientific explanation for what the hell happened, I can never take the stuff again. (and even then, probably not) Shame, really, because it's one of my favorite drugs, and in the past has been more of a tool for thought and meditation than for recreation:(\n\n\n"
}