{
 "title": "Hope You've Got the Weekend to Spare",
 "author": "2C-P",
 "citation": "   2C-P. \"Hope You've Got the Weekend to Spare: experience with 2C-P (ID 32435)\". Erowid.org. Apr 1, 2004. erowid.org/exp/32435",
 "substance": "2C-P",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-P",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32435",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 1, 2004",
   "Views: 20452",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At approximately 10 pm we split up the newly aqired substances and decided to try the 2c-p because of previous enjoyable experiences with 2c-i. It's 11 pm now, the following day, and we're finally starting to come down. Within the first hour some noticible changes occured, mostly tactile and time distortions, all quite dismissible as placebo effects. At 2+ hours the novelty started to wear off and everyone started to wonder whether this RC was bunk or not. So, two of the lab rats decided to complement things with 10 mg of 2c-i, while I thankfully declined and tried to get some rest. This seemed to work for maybe an hour or so until I realized that I couldnt wake up from this weird dream even though I was quite conscious of my surroundings. No matter how hard I struggled or tried to ask for help it was useless. </p><p>This went on for hours on end, literally a good 7 hours into the experience. At that point I could start to talk once again and seriously considered going to the hospital so that I could take some antipsychotics and come down already. If you can handle feeling tweaked out of your mind while tripping on 20 hits of good LSD without getting too paranoid, then this is the next thing for you. Itll take you higher then youve ever been before, and lower then any angel would be willing to even acknowledge. My only recommendation are to have some downers for the come down, more like the muscle spasms and such, and a friend or two to take care of your affairs, it was nearly disastrous going to work like this. Were very interested in hearing other people experiences with this substance since PIHKAL didnt have a lot to say.</p>"
}
