{
 "title": "'I Overdid It'",
 "author": "C",
 "citation": "   C. \"'I Overdid It': experience with 5-MeO-AMT (ID 32434)\". Erowid.org. Mar 31, 2004. erowid.org/exp/32434",
 "substance": "5-MeO-AMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "5-MeO-AMT",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 32434",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 31, 2004",
   "Views: 14014",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nA friend of mine took 20 or 21 mg of 5-MeO-AMT HCl dissolved in a non-alcoholic drink.  He had been given 35 mg (not to be taken all at once); he eyeballed the dose, meaning to take half (he had taken 10-15 mg doses several times before), but it turned out he took 20 or 21 milligrams.</p><p>After feeling nauseous for about 2 hours, he told his company of people he was with that he needed to leave the party they were at.  They did.  He got home and puked about 32 times they say.  He became extremely disoriented and confused.  The words he would say did not make sense, and he wasn't even trying to form sentences. I was called away from another party, and I helped settle him. When I got there, theyd managed to get him to sit on the couch. He came back to reality a tiny bit at that time. I noticed that he was pretty hot temperature wise, so I got a bag of ice and held it either on his head or at the base of his neck for the next 4 hours.  He did cool down quite a bit, most noticeably after said 4 hours. He did shake a little from time to time, but never constantly, and the shaking wasn't too alarming or out of control.  He would say every once in a while, 'I overdid it' and 'someone needs to help me.' He was very confused and had little idea of what was going on. </p><p>We just tried to keep him calm, lit cigarettes for him and tried to make him drink water. He couldnt really drink the water, and most of it poured out of his mouth though. He was kind of catatonic in stature for a lot of those 4 hours ­ with his arms up half way, starring into space and all. I left after he could form complete thoughts (although still slightly sporadically), walk without help and talk to us. He seemed fine the next day and remembered nothing after he started vomiting. He is totally back to normal now (90 days after the trip) and has been back to normal since about 3 or 4 days after the trip. He seemed kind of depressed (didnt talk much, didnt go many places, etc.) for those 3 or 4 days. He probably should have gone to the hospital, and he would have, had he been in public.</p>"
}
