{
 "title": "Insanity Preferred",
 "author": "Humbug",
 "citation": "   Humbug. \"Insanity Preferred: experience with Risperidone (Risperdal) (ID 32443)\". Erowid.org. Sep 1, 2006. erowid.org/exp/32443",
 "substance": "Risperidone (Risperdal)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Risperidone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 32443",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 1, 2006",
   "Views: 23471",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn my case, the main reason I was prescribed Risperdone was for my constant delusions. <br>When I first the pills, I knew nothing about them. I actually thought they were sleeping pills, because I had told my doctor that I had been suffering from insomnia among other things. I was told to take 0.5mg on my first night to get used to it. Even at this low doseage it made me quite tired. And since I thought they were sleeping pills, I decided they must be working and went off to bed.  After that I started taking 1mg about 2 or three hours before I went to bed. It made me kinda tired, but it was bearable. I noticed small changes with my delusions. But its hard to tell just how much it helped, since I can't really tell what are delusions and what is not. <br>Then I went back to the doctor, she went through exactly the same questions as she had the time before, but this time I gave better answers, cause I wanted to be free of the doctors and the drugs. But for some reason she decided to up my dosage to 2mg a day. At  this dosage, the effects started to get quite unpleasant. I want to say that it made me very tired, but its not the same as tiredness. Im not physically tired, but I just feel generally fucked. <br>I felt like a kind of zombie, no emotions, all I wanted to do was lie down. To me it almost felt like what it would be like to have a lobotomy, I couldn't feel emotions even if I tried. With taking it at night I could feel it working well into the next day. I once took it the night before I had an exam in the morning, that I'd forgotten about. I failed the exam miserably, my mind went pretty much completely blank, I couldn't think. I think at this dosage it more or less stopped my delusions, but it did so by pretty much stopped me from thinking at all. I mean of course I was thinking, but it was in a much different way than normal, almost like trying to talk while extremely stoned. <br>Because of the horrible side effects I stopped taking it for quite a while, probably a couple of months. I decided to commit suicide.  I wasn't actually depressed at the time, but I had been severely depressed for the last year, that was the main reason for seeing the doctor in the first place. I was going to kill myself, because I knew I wanted to when I was depressed but could never bring myself to pretty much do anything at all while in that state. It may sound a bit weird but it made sense at the time. I was planned to overdose on my risperdal. I searched on the net to see if I could find out how much I would need to take, but could find nothing. In the end I ended up taking 30mg. In the back of my mind I knew this wasn't enough to kill me, so it was quite a half-hearted suicide attempt. <br>Shortly after I took the 30mg I regretted it, and tried to make myself throwup, with no luck. I decided to just go to bed hoping for the best. I went to bed at about 10pm, and didn't wake up until 3pm the next day. When I woke, although I was completely awake, I may as well have been asleep, I felt so tired, yet not actually physically tired as I explained eariler. My mind wasn't too bad, I could still think logically, although very few thought were going through my mind. After about an hour of lying there, I decided to get up and venture downstairs. I truly felt like a zombie, walking very slowly, thinking close to nothing. I told my mum how I was feeling and she  ran me a warm bath. As I was lying in the bath I felt my neck getting a bit tense but thought nothing of it at the time. When I went back upstairs to lie down my tongue started going to the back of my throat, I couldn't stop it. My nose was completely blocked at the time, so as my tongue went back I couldn't breathe. <br>As hard as I tried I couldn't move it. I put my finger in mouth like I was trying to make myself throw up, this worked to make my tongue come forward and let me breathe. I could not bare things to get any worse, so I told my mum that it was getting worse and to take me to the doctor. Naturally she wanted to know what was going on, so I told her that I told 10 pills (10mg) and that I was simply trying to catch up on the doses that I'd missed. It was a stupid excuse, but the best I could come up with in that state. But amazingly she believed it anyway. As we drove, my tongue eased back, but now my neck was starting to do the same, my head would move down to my shoulder, and I couldn't move it back up again, it also hurt a lot. <br>At the doctors, I lay on the bed groaning in pain as the doctor tried to work out what was wrong. I found that if I relaxed in the right way I could stop my neck from cramping up, but I couldn't do it for long, and as soon as I stopped it would start up again. He eventually sent us to the emergency room at the hospital. I had to sit waiting for a while with my head stuck to my shoulder looking like some sort of retard. When I finally got put through they put plugs of all over my body, although I have no idea what they were for. I was given an injection which instantly relieved of my cramped neck, it was wonderful! The doctor obviously didn't buy my story, because he was trying to get me put in the 'psychiatric ward', in other words the mental hospital. I was pretty sure he knew what I'd been trying to do. I was given the same thing that was in the injection in pill form to take the next morning, I don't know what it was though. <br>The next I must have gotten a rebound effect from taking such a large amount. I was feeling fine, but I was hallucinating very clearly. I walked into a dimly lit room to see my little sister just sitting there staring at me, this freaked me out a bit so I turned round and turned the light on. When I turned back round she was gone. I also heard young children laughing and playing round the house but when I looked, they were no-where to be found. This sort of thing went on for the whole day. I was back to normal by the next day.\n\n\n"
}
