{
 "title": "One Link to My Normal Reality...My Breath",
 "author": "bubbles",
 "citation": "   bubbles. \"One Link to My Normal Reality...My Breath: experience with 5-MeO-DMT & Cannabis (ID 32481)\". Erowid.org. Aug 23, 2004. erowid.org/exp/32481",
 "substance": "5-MeO-DMT & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 32481",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 23, 2004",
   "Views: 5525",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This happened quite some time ago, but it came up in conversation today and I started searching the web for experiences and find that some key aspects have been left out of many reports. I did not know much about this drug when I took it, only that there are no known long term negative effects, and that it is a short trip, and that the comedown is euphoric.  Sounded good at the time, and I was with a group of good friends. I had tried LSD, ecstasy, mushrooms, and marijuana before, and always had a pleasant experience.</p><p>The powder was placed on top of good marijuana inside of a glass bowl.  I was sitting on a couch.  I took a small initial hit, wary of what may happen, and not much did.  I then took a large hit, and held it in.  Within moments, my reality began to change in a way I had never experienced before.  I felt blasted by a cannon of energy.  There was no relation to any experience I had ever had.  I simply did not have the resources in my mental lexicon to understand what was happening.</p><p>This is the most important point for me.  Everything I had ever known, everything about reality that I was familiar with, everything about my everyday conscious mind that I was accustomed to, the normal ways of doing things, thinking, seeing...were gone.  No words.  No thoughts but one thought.  I was considering things, but without the ordinary experience of thoughts.  Bizarre, unimaginable, strange, and at first...terrifying.  I was dying.  But there was one link to my normal reality...my breath.  I knew I was breathing.  Once I realized this and focused on it...the experience became euphoric to the extreme.  There was not a sense of, not an inkling, not an experience of, but simply full and total absorption and isolation with all.  Then I began to come down, very quickly.  I sat there.  I don't know if I opened my eyes, or just began to see again, to experience things normally, but suddenly things were returning to normal.  I felt great.  The comedown was very much like the feeling of MDA or MDMA, but without the negative crash after an ecstasy trip.</p><p>I think when taking a new drug I always try to imagine what it is like compared to what I already know.  It was quite impossible to do that with this drug.  Everything that I have experienced and know of seems to be all the same thing in comparison to this drug.  It truly is a 'spiritual' experience in that it will show an aspect of mind and consciousness that is new and bewildering. Other drugs, such as LSD, Marijuana, Caffeine, etc, all alter my experience of the senses.  They may change the way things look, feel, how happy I are, how twitchy I feel.  They change my reaction to inputs.  This drug simply ignores all inputs, I am left alone, trembling, without communication with the world and perceptions around me, staring at what is left when those things are gone.</p>"
}
