{
 "title": "Music, Warping And Aztecs At School",
 "author": "Ian",
 "citation": "   Ian. \"Music, Warping And Aztecs At School: experience with Mushrooms (ID 3251)\". Erowid.org. Dec 24, 2001. erowid.org/exp/3251",
 "substance": "Mushrooms",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3251",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 24, 2001",
   "Views: 3890",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe other day i did shrooms for my second time, but in all truth it completely blew away the first time. It started out when my friend gave me a gram of shrooms (really good ones) right before 1st period, and said to just take them. I had a short mental debate over whether or not I should take them, and then just did it. I hadn't had any breakfast, so the effects started to set in pretty quickly. By +30min I was already fully into the coming up stage. Time seemed to drag on forever, and minutes seemed like hours. I was so messed. the projection that my teacher was showing us started to warp and bend, and peoples faces were stretching and starting to melt a little. The time kept dragging horribly and I started to wonder 'what have I done to myself?'. I thought I was gonna die, and since the room was dark, my visuals were pretty heavy and I almost freaked out once or twice. By the time 1st period was ending I was done coming up and was full on trippin'. I wasn't prepared for what was coming next.\r\nAfter a long walk throught the halls, I got to the locker room and dressed out for PE, and went to the gym. I talked excitedly to people for a while (that reminds me, my jaw was tightly clenched and aching). I sat down and let the teacher take role, enjoying my trip. Then we started by doing some calestenics, and moved on to an activity called form running. This i where it became interesting. We started running in different styles and the sound of peoples footsteps and voices and weird noises and even their actions became a sort of inexplicably beautiful music, so beautiful I became completely enthralled with it, obsessed with it. We went through form running, and started playing dodgeball (my friend had to help guide me through it). I became increasingly interested with my closed eye visuals (it was too brite in there for strong open eyed visuals, beside extreme warping in the bleachers and the wood floor, and seeing people threefold.).\r\nI saw something like a shoe-print crossed with a dollar sign and made up of little metallic orbs and colorful liquid. However, my most memorable vision was of two, two-dimensinal, aztec-like heads made of a brown kind of stone. they were built into a seemingly endless wall. The two faces were conjoined, in the way that one's mouth formed the other one's brow. I can still see this image in my head, but I can't quite describe it, the way they were conjoined, it bent space in a way. The rest of the day was pretty typical after gym, besides the fact that I couldn't concentrate very well. It was a great learning experience, and I plan to repeat it within the week. Thanks for listening to me babble on.\n\n\n"
}
