{
 "title": "Graveyard Bliss and Then a Long Walk",
 "author": "Vril",
 "citation": "   Vril. \"Graveyard Bliss and Then a Long Walk: experience with LSD & Cannabis (ID 32547)\". Erowid.org. May 6, 2007. erowid.org/exp/32547",
 "substance": "LSD & Cannabis",
 "bodyweight": "54 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "32547",
   "Male",
   " ",
   "Not Given",
   "May 6, 2007",
   "2723",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A group of us had gathered to take acid one Friday night. We had planned this following a trip wed had the weekend before, we acquired 7 blotters of acid with the Mandelbrot set printed on them. After hours of waiting around we headed over to our friends place at around 10:00 pm. There was me, K, F, M, G, C, B and a friend of Fs I didnt know (lets call him S), who wasnt tripping. We ventured to a very posh suburb of Sydney to where K lived. At around 11:00 when we arrived we dropped the acid. I felt massive anticipation after I chewed up the little blotter, I could feel rushes of excitement through my body.</p><p>We decided to leave the house since Ks parents were still home and go to a very large park near his house. The park is a playing field next to a lighthouse, over to the far side the park stops and there is a cliff with a VERY large drop, then its the ocean. We strolled around the park for a while, all of us very excited and thinking that we were starting to feel something. The others were obsessed with the idea of going over the fence and sitting on the cliff, something I was not up for. We walked to the far corner of the park; we could feel the acid coming on. When we reached the corner everyone but me and S jumped over the fence and sat on the cliff. </p><p>I hung out on my side of the fence with S for what seemed like hours, we smoked some weed, talked a little bit, nothing exciting. But then, all of a sudden I look at the ground and it seemed as if the cracks were growing, there were cool colours and I was enjoying it. I alerted S to this, he seemed cool, he was having speed and weed, I giggled and called it spweed. I looked into the sky and the clouds were moving much faster than usual, like in time lapse photography. The clouds were also forming patterns similar to the Mandelbrot set, which I found interesting because what was something I experienced the week before at a trip at Ks house.</p><p>I started to grow bored, they would come up from the cliff and were trying to convince me to come as well. I decided against it because acid + cliffs = bad things. I jumped the fence once or twice, but never made it all the way down. Eventually they all came up, I was disappointed that I couldnt go down, it sounded like they were having a great time down there. We played around the park for a while, giggling and so on, running around, etc. Me and a couple of people walked over to the road (this is a huge playing field so we were quite far away from everyone else), K and G wandered off down a street and we didnt know where they were going. We turned back and found M and F sitting down and laughing. I wanted to find K and G, eventually convincing F and M to follow us to the road.</p><p>I had been noticing how the world gained a strange blue/green/purple tinge to it, everything seemed so alien and weird. We found G and K after what seemed like years sitting on the slope by the road. We sat in the grandstand for a while, just me G and K. We talked for a while, waited till the others found us then decided to go to the graveyard which was basically across the road. We walked over, all the others being loud and hitting stuff, they were drawing way too much attention to us and I was getting paranoid. We all got into the graveyard and started to walk down the rows, we would grab a mate or two and walk.</p><p>This was for me the best part of the trip. At first it was me, G and S walking around and talking. Me and G are very good friends, he is someone I would like to trip with much more often. We would sit in a little tucked away space and me and G would talk weird acid things, forgetting and laughing. We walked for a while, looking into the graves, not being able to make out what was there, everything seemed very alien, the visuals were truly spectacular. Eventually we all decided to go off on little alone trips around the graveyard. I wasnt in the mood for an alone trip, I wanted to talk with my friends, but they didnt want to so I had no choice. I wandered around the graveyard, looking at graves and following the rows and small alleyways, hoping to bump into one of my friends. It was an extremely deep trip so to speak, I didnt have any profound thoughts on life or anything, which was what I wanted, but I had fun with what I had.</p><p>Every now and again I would bump into someone, talk for a second and then they would just walk off into the darkness. I walked around and started to think to myself how the LSD experience was a hypersensitivity of sorts, I felt hypersensitive to colour, sound, light, energy and vibration. I thought about his until I found B, M and F around a couple of crypts, climbing on them and into them. None of them were in much of a mood for a conversation so I left, bumping into K and G a couple more times. </p><p>Then at one point I started to have a bad trip, I was walking along one of the rows and all of a sudden I felt completely alone. Normally I could feel my friends around me, I knew they were in the graveyard but I couldnt see them. Anyway, this feeling suddenly vanished and I was alone, I began thinking that they everyone had left the graveyard and knowing they were on acid they could have gone virtually anywhere. I began to freak out. I could see people jumping up from behind tombstones, running and hiding behind other tombstones. I ran through the rows hoping to find someone when I bumped into K, I knew I was fine. I decided to stick with the others from then on. </p><p>Everyone decided to leave and we couldnt find G, we looked for him and when I found him he was sitting on a large tomb staring blankly in front of him, he wouldnt respond to me, when I spoke to him, he would look at me and then keep staring. I sat down next to him and stared at what he was staring at, I said to him: Now I know why you picked this spot It was a perfect view of the front gate and the layout of graveyard, it was like a long passage with trees at the end, and everything was drooping and melting and bleeding, doing weird acid things. I was in awe of what I saw, it was spectacular.</p><p>The others were standing on the road shouting for us to come to them, I told G wed better go, but again he didnt respond. I was envious of him, he was having the trip I wanted to have, but I wasnt in that headspace, I was kind of paranoid and just didnt want to attract attention, but our names were being screamed very loudly at all hours of the morning. I also felt like I was bumming his trip a little, he was very silent and introspective, and there I was telling him wed better go and talking to him. Eventually he got up and walked out, I followed.</p><p>I walked ahead of the others, again they were making noise and hitting things, my paranoia grew. I walked as fast as I could to the slope from the field to road, watching them dance around the roundabout with cars going past and so on. I admired how the street looked, and how the sky looked, I took in my surroundings. I saw G walking ahead as well, I caught up to him. He greeted me and we walked. The next bit is a little hazy. This was a month ago and Im still piecing together what happened. I think we went back to Ks house and sat in a room I referred to as the think tank or headspace. The others had been looking for us and we all laughed when they came back to Ks accepting defeat, and found us rolled up in doonas staring at the walls. </p><p>G went to sleep. I attempted to sleep, but couldnt. The others said they were going to see the sunrise, so I followed. We wandered up the road to the cliff, I was still tripping, cracks in the road stretched and grew as I walked, and we crossed the big road over the cliff end. I didnt have my shoes on, so I sat in a bus stop to put them on. I went in where my friends had gone, and thinking I was on private property, I got to the end and jumped over the fence. I continued along the walkway in this beautiful path/park along the cliff. I got to a point where I had no idea where I or they were. I found a payphone across the street and called K, he said they were near me and on the cliff. I continued along with no luck and the walkway ended, so did that park. Id obviously gone past them and had to back track (a good 500 metres). I walked along, rich snobby people shaking their heads, I thought it was funny. </p><p>Eventually I could see people on a cliff about 200 metres ahead of me, is that them? I thought. I walked over and surely enough it was them, they were right next to the lighthouse where Id jumped the fence, Id gone straight past them and then on for another half a kilometer or so. I sat and stared at the sunrise, the line between the ocean and the sky was blurred, and the two look like one. I was still tripping, not as intense as before, it was a calm and content type tripping. The sky/ocean was beautiful, truly one of if not the most beautiful thing Ive ever seen, I thought to myself this is what god must look like.</p><p>We had a couple of bongs, I still didnt go over and sit on the cliff. We eventually left and went back to Ks house where G was just waking up. We hung around for a while, eventually me and G decided to leave. We were in an acid haze, we werent tripping but we werent exactly sober. This time to me was the downtime after the trip. Me and G walked for hours down a main road, every now and again we would stray off the main road to find a nook, a little park or something to sit in. We walked and talked for nearly three hours, just talking about the trip, our friends, life, and laughing about the snobby people we walked past who looked at us shaking their heads.</p><p>After walking for 12 kilometres and having a great few hours with G, we reached a bus depot and simply went separate ways, he went left I went right, one of the best few hours Ive spent with a friend simply ended without a goodbye, but we were content, wed had a huge night, I got home in the afternoon and went straight to sleep. </p><p>In retrospect the trip was not as meaningful as I had hoped, however it was one of the best nights of my life, I had an amazing trip, and got a chance to connect more with my friends, especially G.</p>"
}
