{
 "title": "Recipe for Dreams",
 "author": "Pychotropic",
 "citation": "Citation:   Pychotropic. \"Recipe for Dreams: experience with Kava, 5-HTP & Melatonin (ID 32634)\". Erowid.org. Dec 30, 2004. erowid.org/exp/32634",
 "substance": "Kava, 5-HTP & Melatonin",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "35 drops",
   "oral",
   "Kava",
   "(extract)",
   " ",
   "300 ug",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "50 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32634",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 30, 2004",
   "Views: 32110",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have recently been experimenting with various substances to treat my Anxiety disorder. Namely Kava, taken in form of an Extract (Tincture). On a particularly Anxious evening I decided to ingest around 35 drops of my Kava Extract, as well as ingesting 1 300mcg tab of Melatonin and 1 Cap of 50mg 5-HTP. \r\nI had been in a very unrestful anxious, state much of the day, as I am much of the time. I wasn't on any prescription medication for anxiety not having took any for over 2 months. This was adequet to cleanse myself of the SSRI I was taking. \r\nI ingested the substances around 9:00 PM and within 20 minutes began to feel effects. The most notable was a very nice relaxed, calm state of both mind and body. This led me into a state of warm euphoria, nothing like a hard drug, but enough to cherish. I liken the feeling to say 1 Soma or 1 Vicoden.\r\nAt around 10:30 PM the drowsines won over my faculties and I retired to my bed. Oddly enough it took me around 45 Minutes to fall asleep. During this time I continued to feel very relaxed and at ease. I slipped off to slumber unknowingly. Waking up the next morning at 6:30 AM almost void of any after effects I was filled with memories of vivid dreams. \r\nI could recall vivid states of intense euphoria, though I couldn't recall what actually felt good about it. Just that I had felt that way. There were no definite story lines to note, but a memory of vibrant images. Mostly scenes with colorful sets, familiar faces. It all seemed very real.\r\nIn retrospect I figure half dosing the Kava, and maybe excluding the 5-HTP would have allowed me to be more conscious of the dreams. I recommend these combinations to the explorers of the dream realm. While these substances are relativily safe, remember to read precautions, educate yourself, and use common sense. Milage may very!\n\n\n"
}