{
 "title": "I See Two Now",
 "author": "1200Techniques",
 "citation": "   1200Techniques. \"I See Two Now: experience with 2C-I (ID 32631)\". Erowid.org. Mar 11, 2008. erowid.org/exp/32631",
 "substance": "2C-I",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "12.5 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32631",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 11, 2008",
   "Views: 2576",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Mindset: I had acquired 6 capsules containing 12.5 mg 2ci a few days before hand and was eager to try it. The whole day felt very 'right' and so I decided to take it last night. Excited and high spirits. I am a 19yr old male.</p><p>Setting: Started the night in a very psychadelic cafe with cushions on the floor, large tables made from trees, sparkly lights, incredible artwork and numerous other tactile, visual, and audial delights. Then went to my friends audio school to play on a hand activated effects machine which totally blows my mind even when straight.</p><p>Myself and three close friends each took 12.5mg of 2ci at around 6:45pm. We all have some experience with psychadelics however previous experiences have been mild and far between. I am probably the least experienced and most sensitive of my friends except with MDMA of which i am probably the most experienced. Through our teenage years we have all smoked copious amounts of ganja but in the last 6 months or so have cut right back to the occasional weekend session. We all feel much better for it.</p><p>After enjoying a delicious soy chai latte at the cafe mentioned above we were all beginning to feel a little giddy and had the same sort of body rushes associated with coming up on MDMA however they had a different texture. They felt more cold and precise than warm and fuzzy, however it was an extremely cold night out which may have contributed. As we were travelling by car we decided to make a move before things got too serious so we drove up the road to a Turkish cafe where you can smoke hookahs of apple flavoured tobacco. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>While waiting for them to prepare the hookah I started to feel very disjointed from reality. Movement in my vision and slight patterns were forming and in general i felt as though I were in a dream-state. This was enhanced when the hookah arrived and i held the pipe to my lips and inhaled but realised that not only could i not feel the pipe in my hands or mouth, i wouldn't have know where the sensations should have been coming from anyway. This sensation continued for the duration of the trip and oce i got used to it was actually quite nice. </p><p>A strong vibrating energy engulfed everything and soon we could sit there no longer and had to leave. After a trip to the park where we indulged in some nitrous under the stars we picked up a friend from work(i then let him drive the car)and headed over to his audio engineering school where a friend had booked the studio for an overnighter. We often go there as they have x-box, sound studios, and excellent equipment and you can be left to your own devices all night. I was completely absorbed by the handsonic effects module they had which allowed you to create all sorts of intergalactic, jungle, underwater, rave, fairy sounds by hitting the pads, sliding the touch-sensitive areas, and moving your hand through the infrared laser. </p><p>By this stage I had reached a plateau and was very comfortable with the level i was at. While I had been a bit overwhelmed at first in the turkish cafe i would now have enjoyed a slightly higher dose however 12.5 was all we were consuming for this experiment. </p><p>As far as visuals are concerned they were limited to mainly movement, breathing, and slight patterning, however under the stars doing nitrous produced visuals i would compare with a dose of MDA in a dark club. Like a flat layer of patterns over everything but not really interacting with the environment.</p><p>I had some very weird visuals/visions while trying to get to sleep and i awoke at about 2am however i am sure i was not asleep, just lost in my mind. My other friends all mentioned the same thing. I did not notice that this chemical had a particularly happy vibe to it but this was probably due to my inexperience with psychadelics and being overwhelmed by the sensations i was having.</p><p>All of us feel fine this morning except for one friend who has a headache. Despite this she and the rest of us are very keen to try this substance again at a higher dose, probably 15mg or so.</p><p>O Don't underestimate the strength of these substances. I have found out that a small harmless pile of powder can contain great power, and I definitely look at my surroundings with a new sense of respect after last night.</p><p>Peace out. Happy tripping.</p>"
}
