{
 "title": "A First With the Mind Candy",
 "author": "Barney",
 "citation": "   Barney. \"A First With the Mind Candy: experience with H.B. Woodrose Seeds (ID 327)\". Erowid.org. Sep 11, 2000. erowid.org/exp/327",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "7 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 327",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 11, 2000",
   "Views: 10315",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had been wanting to try HBW seeds for a long, long time and finally got the chance. I ordered 60 seeds for $20.00 over the internet.</p><p>Me and Dodd and Nam decided to try them out to see if they are as good as we've heard.  Nam, an experienced dropper tried one as he had homework and other things to do that required a sober head. We decided to scrape the hairy coat off the seeds with Dodd's penknife.</p><p>This took bloody ages, so in the end we peeled two and opted to crush the rest in a coffee grinder and add water to the pulp (this way the seed matter is soaked into the water and the coating sinks to the bottom).  We shook the water and left the mixture soaking for forty-five minutes. While we were waiting Nam started to come up on the one seed and recognised lsd feelings, this is acid he said. We returned and drank half of the mixture each and ate one of the seeds each.</p><p>We felt no nausea at all and the mixture did not tase bad at all. We decided to go for a drive (Nam drove) and Dodd said he could feel it coming on (it was his first trip) He started to feel worried as if he was going to jump out of a plane or something. I began to get a little bit excited but nothing more.  After about half an hour, the trip came on.</p><p>Colours became intense and the music started to surround me. When I looked at my hands they were changing before my eyes. It affected Dodd more than me. He was laughing and saying this is amazing. Throughout our drive we could not stop laughing and were having the happiest time of our lives. Dodd came very close to hallucinating, but it wasnt to be. Colours were really bright and space seemed different (this was most noticable in Blockbuster video.</p><p>By the time we got home (about 2 hours later) we went into Nams sitting room and I noticed the walls were breathing and  space became really distorted. We watched Pink Floyd's The Wall and I felt more emotion and pitty than I have in a long while. After this I went back to my room feeling depressed for about forty-five minutes.  But then I thought about all the good in the world and how Pink Floyd cared about veterans and the trampled people and began to feel very happy and content. I went back to Nams for awhile and although the lsd feelings had almost subsided I felt at total peace...very, very mellow almost like I had smoked a bit of hash.</p><p>I slept like a baby that night and the next day in the place of a hangover, I had eight hours of intense happiness and well-being. At the end of the day I had a very minor visual, I saw little pieces of light like fireflies descending down on me.</p><p>Overall a very happy and trippy experience, which I would definitely recommend. The water mixture idea is no good though, we missed a good quantity of seed matter and probably ended up having more like four or five seeds each. This volume was a lot of fun. Certainly more fun than being drunk but for hallucinations more are probably needed.</p><p>p.s We experienced no nausea and even had a bite to eat while tripping, the seeds did not taste disgusting and neither did the water mix, we also had very fresh harvest seeds.</p>"
}
