{
 "title": "Nasty Taste, Beautiful Experience",
 "author": "Tim Ska",
 "citation": "   Tim Ska. \"Nasty Taste, Beautiful Experience: experience with Mushrooms - P. cubensis (Mexican) (ID 32753)\". Erowid.org. May 1, 2007. erowid.org/exp/32753",
 "substance": "Mushrooms - P. cubensis (Mexican)",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "30 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 32753",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 1, 2007",
   "Views: 3401",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHello there. This trip report will be about my very first trip. It was definitely a level 5 trip, seen as I totally lost connection with reality, and my mind was really all over the place.\r\nWe decided about a month before the trip to shroom somewhere in a forest with the three of us: me (T), L and J. J was the experienced shroomer among us, hed done it for about 4 times, and me and L were both newbies. Even though we had decided to shroom just a month before, I had been preparing and reading about magic mushrooms for at least 6 months before the trip.\r\nThe day before the trip we went to a smartshop in a nearby city to buy 4 portions of Mexican Psilocybe cubensis of about 30 grams each. We bought 4 because another friend would also join us on our trip, but he was ill and couldnt. These mushrooms hadnt been dried, because selling dried mushrooms had become illegal this year. 30 grams wet would equal about 3 grams dried. Actually we wanted to have 2 portions of Thai and 2 portions of Mexican shrooms, but the smartshop was all out of Thai mushrooms, so we had to settle with 4 Mexicans.\r\nThe day of the trip we went to a forest near our home town, and we looked for a good spot to trip, as far away from the roads and paths as possible. We found an (already) beautiful meadow where sunrays hit a nice patch of soft grass on the ground. We decided that that was the place, so we settled there and started eating the mushrooms. I had brought a whole bag of triptoys that I wanted to try out. These include three small plush footballs, some paper and some felt-tips to draw (which we didnt use at all, by the way), my cellphone and a camera. We talked about how nasty the shrooms tasted. The day before the trip we each tried a little piece and that didnt really taste bad, it was much like the usual mushrooms you have on your pizza. But when you have to 30 grams of it, though, they DO taste nasty. Only one word could describe their taste: horrid.\r\nAs we waited for the mushrooms to kick in, J felt the nausea come up first, so he decided to walk around a bit. Then I felt the shrooms kick in, so I joined J in a walk around the meadow, all the time staying close to L, I think because of fear of getting lost. When we were all on our way to Deep Space Nine, we decided to take a walk into the forest. We didnt get any further than about 20 meters though, because we found another place where the sun came in through the trees, and we chilled and laughed our asses off in the sun. The sun was warm, and it felt undescribably good. We sat and laughed about eachother, because our minds made up the most idiotic sentences ('my god, everything's going THAT way!'). We made no sense at all at that moment. Then we decided to go back to our sacred meadow, where we left all of our stuff. I sat down and tried some drumming, but I could not at all catch a rhythm, so I gave it up. I walked around a bit, amazed at all the beautiful things around me.\r\nThe world seemed to have turned into a fairy tale, and everything was good. I looked at a tree with some kind of rough bark, and it was colourful like I had never seen before, and it had kind of a checkered pattern. Then I heard something from out of the grass. It sounded like music, but it also felt, tasted, looked and smelled like music. I bent down and saw the most beautiful fir-cone in the world. It didnt look very different than it would have looked without shrooms, but I thought it looked really nice and pleasant, so I decided to show it to L. He wasnt as far gone as I was, and he didnt understand what the fuck I was talking about.\r\nAs I looked at the bushes I noticed that their branches curled up in a spiral-like way. When I moved my head to the left and right the spirals rolled along with me, which was really neat.\r\nThen I saw a piece of candy, a Campino, which we had bought that afternoon, lying in the grass. It started talking to me, explaining things to me in a language that only we could understand. I have no idea whát it had explained to me, but I felt relieved after it stopped talking and walked away from it.\r\nThen it started hitting me fast. I tried to sit down, but I ended up lying in the grass. I was jumping in and out of a state in which it didn't matter whether my eyes were closed or not. At one moment I pulled my finger, and stretched all the way out and when I let go, it kept hanging there. My hands looked embryo-like, but they looked so cool.\r\nThe last thing I remember seeing in the real world was the tops of the trees, sticking into the skies, piercing them, and the branches curled up in an artistic kind of way. It looked kinda like the elf world from Lord of The Rings. I ate a Campino and it melted into my mouth. It tasted splendid.\r\nIt was then when I started to philosophize about the meaning of life and all of that weird stuff. What I worried about before tripping was that I'd take too much and get a bad trip, but as I was contemplating about the big questions I couldn't remember myself anymore, let alone remember what I had been worried about. At one moment I felt that the world consisted only of me, L and J. Then I felt that the world was only mine, Js and Ls qualities. A moment (or maybe an hour) later I felt like the world was only there in my mind, at that the rest of the world was not really there. It was just my mind, and the rest of the universe was in it. The meaning of life was to feel good, so I did.\r\nThen it happened. I peaked. I had an out-of-body experience: it was like there was me, and there was my mind. I was looking down upon my mind, and I saw the places where it went, sometimes beautiful, sometimes horrible, but I kept feeling good and comfortable all the time.\r\nTime and space blended into eachother. The universe became time. Time became me.\r\nI took a deep breath and it felt great. Time became time again, I became myself again and the universe was there again. From this point things started to look like they were supposed to again. I was still tripping heavily, though. I saw J standing there. His body was huge but his head small, and far, far away. It was funny. Or, actually it wasnt, but I laughed at it anyway. He had a cigarette in his hand, and he was asking me for a light. I wasnt able to give it to him, though. When he put his cigarette in his mouth, it looked like he put it into his eye, and smoked it through his eye. L was listening to some music on the MP3-player that I had brought. I saw him laughing at me at some point, and his smile became broader and broader, until it was all over the place. Js face had earlier on become long and stretched. It was all cool.\r\nI felt how the shrooms wore off. There was again a forest, no longer an endless line of trees that were all exactly alike. The sun was setting. We decided to go back to our bicycles and find some place to sit and talk about what we had seen. We smoked a cigarette and I could still see some swirly thingies in the trees and the clouds. After every few minutes it felt like I had woken up again. The trip was over, and I was totally confused. But all the time, I felt great.\r\nI hope you enjoyed reading this report. For my first time, I think I really had taken too much. As 30 grams would wet equal about 3 grams dry, I hadnt expected to become time and matter itself. Maybe I couldve known, but its already happened so Im not worried at all. To all first time shroomers, I would recommend a good preparation, but most importantly: dont worry. Be happy!\n\n\n"
}
