{
 "title": "Intense Confusion",
 "author": "AcidXcore",
 "citation": "   AcidXcore. \"Intense Confusion: experience with Dimenhydrinate (ID 32781)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32781",
 "substance": "Dimenhydrinate",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "800 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32781",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 17, 2007",
   "Views: 6481",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, I had been reading a few reports on several different websites and decided that it might be interesting. This was my first time using a hallucinogen and I figured that being able to get something like this at a store would be a real treat. I purchased a bottle of Equate Motion Sickness Pills (100 per bottle) and downed 16 as soon as I arrived home. I surely wasn't prepared for what was to come next. This is the order of events as follows:</p><p>1:30PM - Took 800mg. These were by far the nastiest thing I had ever tasted throughout my entire life.</p><p>2:45PM - I began to notice minor hallucinations such as the ceiling and walls moving around. This is rather hard to explain to someone who has never tried this drug. It seemed as though someone had melted pieces of the wall and was moving them around in a shifting sort of way.</p><p>3:30PM - This is when the more intense hallucinations came about. I was, at this time, in a deep state of confusion and could hardly remember anything. I layed my head down on my desk and kept hearing people call my name. As soon as I looked around, nobody was there.</p><p>4:00PM - At this point, the hallucinations were becoming both frightening and annoying. I turned from my desk and my grandmother's face was right next to mine with the most evil of smiles as though she were possessed. I quickly jumped back and she disappeared. I decided to light a cig to calm my nerves and lit three cigs that weren't even there before I said fuck it. It tortured me because there were packs everywhere and I had no clue which one was real. My friends would come in the room and sit down and quickly disappear before I could say hey. I IM'd my friend, N, and asked if I could call because I was becoming very uncomfortable.</p><p>4:15PM - Me and N attempted conversation but it would not work. I kept forgetting what I was going to say and I have no recollection of exactly what was said except for 'It's cool man, don't worry about it.' This went on for awhile and I guess I decided to give up since I couldn't remember how to speak.</p><p>4:20PM - The objects around me began to morph into other objects. The handle on a table turned into a humongous wasp and I am deathly afraid of those creatures. I did my best to try to remember it was only the Dimenhydrinate and rolled over to try and sleep.</p><p>5:30PM - When I awoke I felt like shit. I was dizzy, the walls still shifted slightly, and I was feeling nauseated. This was pretty much the end of my experience.</p><p>Throughout this entire trip, I felt intense confusion, forgetfulness, mixed emotions such as fear, joy, anxiety. It dried my mouth out to the point I felt as if I would die and I had no drink prepared. In fact, I did nothing to prepare for this trip which was extremely stupid. It was the weirdest things ever. This was horrible to use for my first hallucinogen and I suggest that if you are a newbie, you try something else first. For me, this drug gave 80% bad vibes.</p>"
}
