{
 "title": "Smoking Was a Waste!",
 "author": "Eehed",
 "citation": "   Eehed. \"Smoking Was a Waste!: experience with Mushrooms (ID 32803)\". Erowid.org. Jun 8, 2004. erowid.org/exp/32803",
 "substance": "Mushrooms",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "1 cig.",
   "smoked",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 32803",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 8, 2004",
   "Views: 15429",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few years ago whilst on a day trip to Amsterdam, my partner and me, whilst scouring the assortment of Headshops in the 'Dam noticed 'Mushroom Joints'. Initially I was sceptical as I had heard varying reprts re: the efficacy of smoking Psilocybin based mixtures, but curiosity got the better of me and we purchased one, for 'entertainment' (sic).</p><p>We had been smoking for the majority of the day (as you do whilst in 'Dam) and thought that smoking in the safety of our hotel room would be the best thing (re set and setting).</p><p>We where both in reasonable state of mind, neither of us on any medications that might have interfered so decided to light up.</p><p>The join in question was 'ready rolled' so there was no indication of the amount, the type of mushrooms used nor the stability of what the joint contained.</p><p>The most obvious thing was how difficult it was to smoke as depite it's ability to burn, it felt like nothing was being inhaled. It was like a 'really' tightly rolled joint (you know the ones that dont smoke too well) and despite how hard I pulled, it was almost impossible to get a decent amount to inhale.</p><p>In terms of effects - there were none! I distinctly remeber smoking the last few tokes and discussing with my partner that it had been a waste of time and what was the point of selling mushroom joints if the had no effect. We concluded that, given the place (Amsterdam) and the avaialbilty of mushrooms joints that they nothing more than a gimmick, perhaps a flirtation with the liberal (drug) laws of Holland. We also questioned the contents of the joint, as, well - it could have contained anything. We were, after all, tourists for the day and the Dam is a place where anything goes. Would I try this again? Not. Mushrooms are food and therefore to be eaten. I don't smoke potatoes to get anything nutritious from them so why smoke mushrooms? Next time, they are going down my neck in solid form...much more predictable effects!</p><p>Ee-hed</p>"
}
