{
 "title": "Warping Reality",
 "author": "Shockwave348",
 "citation": "   Shockwave348. \"Warping Reality: experience with Mushrooms - P. cubensis (ID 32815)\". Erowid.org. Jun 28, 2006. erowid.org/exp/32815",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(ground / crushed)",
   "  T+ 0:20",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:15",
   "4.5 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 32815",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 28, 2006",
   "Views: 7382",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Prior to this experience, I had only tried mushrooms once and at that time I only ate 1.5 grams, and just felt threshold effects. I enjoyed a couple hours of a stoned feeling and some giggling, but I was kind of disappointed after being ready to finally try a psychedelic. About 2 months after this first trip, a good friend of mine explained that he recently acquired a large batch of incredibly potent homegrown Psilocybe Cubensis, and was selling 4-gram bags for 25 dollars. </p><p>I snatched one right away, and feeling like the confident fool I was, I decided on eating them alone this (Saturday) night and having a solo trip as my parents would be away for the night. I was in a very positive mindset that night, and this definitely proved to be helpful, if not necessary later. I weighed 135 pounds at the time, and as I would soon find out, I have a somewhat low tolerance to psychedelics.</p><p>The bright red caps and the snow-white stems with very faint blue streaks were much more...'professional' looking than many other mushrooms I've seen in the past. I thought they looked very 'healthy' and I later would find out I was quite right. I used a coffee grinder to grind the mushrooms up. I've used the coffee grinder to make mushroom-chocolates since then which I think are the best way of ingesting the sacred fungus. </p><p>Anyway, I mixed this powder with some peanut butter, spread on some toast and all 4 grams went down the hatch. It was about 8:00 PM. I spent several minutes right then in a sort of meditative state to sort of prepare my mind for the journey I knew it was about to make. My mind was completely clear and flowing with 'positive energy'.</p><p>T+20:00 -- I smoke a small amount of high quality homegrown cannabis to ease the anxious feeling, but wait to smoke more till I'm tripping harder. I started playing Half-Life, a game I really get into, and I began to feel really energized. Although I had just smoked, I could definitely tell that the mushrooms were just starting to kick in. I was glad I had chopped them up so finely because they were coming on fast and I wasn't left for long in that anxious, coming up state. I began to feel like if I were actually the character running around in the game, I could have run faster and done better than I was currently doing. My mind was racing with all the right thoughts to play the game well (prediction, timing, aim, special strategies), and I was playing much better than I normally do. I was laughing out loud half the time, and things began to seem really funny. </p><p>T+50:00 -- The fun-factor has increased 10-fold, but Half-Life has now become a challenge to play well. My normally quick-reacting and strategic mind is being taken over by the 'mushroom mind' and I'm letting myself accept it completely. I find myself chasing people with crowbars now and setting remote mines which  sends me into bursts of laughter. I can tell that the visuals are just starting because when I turn sharply in the game, instead of seeing the new scene right away, I see more of a moving blur that quickly turns into the new scene. Almost like tracers in real life, these are really fun to play with. I am also starting to see the other characters in the game as live people with different personalities (most of which are violent as this is a game based on killing :-/ ). </p><p>This game is coming to point of 'overload' for the brain, so I decided to quit out of it and do something else. I noticed that I was really starting to trip now. My body had this indescribable feeling similar to a strong weed-high but so much more intense that I would feel like I was 'melting together with something' only 5 or 10 seconds after I had been sitting on it or whatever. Visuals had become increasingly stronger, and I was seeing colorful patterns on the wall, and all shiny surfaces had an amazing sparkle to them. At only about 50 minutes in, I was curious and weary about how far this trip would go.  </p><p>I hadn't been much into Pink Floyd before this trip, mostly because I just hadnt listened to them much, but I put in Dark Side of the Moon after hearing so many recommend this album to trip to, and settled down on my bed. As soon as I started to hear the heartbeat in the very beginning of the album, the music engulfed me, enveloped me to a degree I never thought possible. Every note played and every noise I heard meant something amazing and significant. </p><p>Also, every note had its own 'feeling' and my mind was going so fast, I had time to experience every feeling of every noise I heard. This whole time of listening, I had my eyes closed because these truly were the most impressive visuals with the music. All the colors and shapes that were forming and disintegrating went with the music, and created a show that seemed so perfectly synchronized and beautiful, it was much more spectacular than any pink floyd rock show or laser light show or anything.</p><p>T+2:00 -- I didn't realize that the CD just started over. Not only did I not remember turning on repeat, but I didnt notice until 3 or 4 songs into the second time playing it that I realized it was repeating. This is how strong of a 'filter' these mushrooms had over my normal reality. Anyway, this second time hearing the song 'Time' I really began to trip in the intro to it because of the long spaces between noises and the way Pink Floyd really separates these guitar noises and other noises well. </p><p>I never knew how strong of a hold mushrooms can have on my sense of time until that night. As the song Time was playing, even after the spatial intro, the music began to sllloooowww down, sort of in waves, and then come back to normal speed again. It was so severe at this point that sometimes when several words of lyrics are spoken, a couple of seconds usually, it seemed to take MINUTES! His voice was really low and drawn out, it didnt even really sound human, and I had to listen for what seemed like a long amount of time just to hear several words. </p><p>Then it would pick back up again, and I'd feel like I was hardly tripping. This was true throughout the whole trip, the hardcore trip coming in waves. My short-term memory was on such a sporadic level that I didnt even really remember I had listened to Dark Side of the Moon one time already. The music seemed new and it was just like listening to the album for the first time ever.</p><p>T+2:50 -- As the heartbeat started to fade in the last part of the album, I thought I was hearing my own heartbeat, and got very scared when I started to hear it fade. I'd try to feel my pulse, but my nerves were firing off signals like crazy, and it was feeling like my skin was 'slithering' and 'crawling' all over my body. It was really strange, but I got used to it and later somewhat enjoyed it. </p><p>However it wasn't good when I thought my pulse was actually fading and couldn't feel anything either. (I'd like to mention that almost all of this trip was enjoyable, but my perception of things that night was on such a different level, that I couldnt really perceive it as enjoyable that night, just really amazingly mind-blowing, and I realized later how good of a trip it was in a lot of ways.) I immediately jumped out of bed for fear of my life and also I really had to pee. I knew there was somewhere I should go to help this need (to pee), but I was confused as to where. </p><p>My sense of place and location was extremely strange and foreign. After a little wandering around my basement (where my room is) I found the bathroom and saw the toilet. After taking a piss, which was a most enjoyable experience, I was caught on the way out by myself, looking at MYSELF in this shiny wall!! I stood there amazed for many minutes studying myself in awe. The visuals were so strong, my body seemed to be formed in different ways. Like my fingers no longer had joints, but were only about an inch long, and were really smooth looking. </p><p>They even looked like this when I looked up close! My hair no longer seemed to be made out of many strands of hair, but of one piece of very soft and fluffy material. All my skin seemed smooth and the same color, I no longer saw freckles, tan lines, zits, anything. </p><p>I then started to look up really close, and realized my pupils were enormous!! I dont mean twice or 3 times normal size, I mean I could just BARELY see a sliver of color around the huge, gaping black hole which were my pupils, that is normally where a lot of interesting color is. It was like I could see into myself, past this physical body, into me, into what I really was, into my spirit and my soul. Staring into my own eyes while this messed up was one of the trippiest and most memorable experiences of my life. I had never seen myself in such a genuine way. This was hard for me to believe because I am very in tune with myself and I usually do see myself in a true and genuine way. </p><p>But this was different, it was deep and very spiritual, and I saw myself as I really am, not as I would like to be or anything else. As I was analyzing these traits about me, I realized I didn't know who I was!! I knew that I was kind and caring for people and that I like to help people, but I couldnt remember my name! I knew how I acted and behaved, how I thought, but I didn't know how old I was, or my phone number, house address, anything like that. </p><p>I couldn't recall what state I was in, and I couldnt remember any of my friends names. This was the very first time in my life anything like this has happened, and it took me by surprise! I was shocked and scared and really, really trippin. This small set of unusual thoughts got me really scared in the bathroom, and I left back to my room. The carpet was swirling around on the ground and seemed to be moving in waves, much like an ocean. The walls and ceiling were breathing in and out together to a great degree, and everything on my wall was 3-D. People came out of the wall, and a space shuttle was in constant flight, flying past stars and galaxies,  in a poster where it is just taking off. </p><p>I hardly even looked at these amazing things because I was so caught up with my not knowing of so many things. When I couldnt recall the names of any of my family members or friends, not to mention myself, I truly began to think that I was the only being in existence and that I would spend the rest of my life alone. I wanted to communicate with another entity, but I didnt know how.</p><p>T+3:15 -- Things were very confusing to me at this point and I was trying to make sense of what seemed like millions of things going on at once. I came to the thought that cannabis usually calms me down and relaxes me, and I knew that many people smoke during their trips, so I looked around until I found the bubbler and finally got it. I was holding it, but not even really thinking about it because my mind would drift off unwillingly every 2 or 3 seconds to something that stood out in my vision or to ponder some thought that had come to mind. I kept looking at my alien-looking fingers wondering who and what I was. </p><p>It took me a while longer yet to find what I was supposed to smoke, and it proved to be very difficult to know what to do with it. After some experimenting, I concluded that the plant goes in the smelly black part, and I put my finger on this hole and I suck in here. The smoke was thick in the pipe, and yet, I couldnt taste it, and I couldnt tell it was in me. I felt like I could have taken the biggest hit ever and held it in forever. </p><p>After 4 or 5 big hits, the visuals became extremely intense and it became too hard to smoke. It would just take me too long every time to figure out how to use the device, so I gave up and put the pipe somewhere safe (apparently in my shoe nearby seemed like the best idea at the time). I tried to stand up to go get some water, but that 'lightheadedness' I sometimes get when I stand up fast, it hit me like a bullet, and I was passed out before I knew what had happened. </p><p>It must only have been 10 or 20 seconds later, but I came to, and everything was swirling like crazy. The border lines to any object were wavy and dancing around, making the room and my entire field of vision seem like a pool of water that is constantly being hit with rocks and disrupted. The marijuana made the already hard-trip explode with intensity, and after this point things get very confusing.</p><p>T+3:30 -- This is about the peak of the trip, and although I do remember a good portion of this time, it wasn't as if I was actually there experiencing it, because I truly felt so out of reality, and in such a different dimension than everything else, that I wasn't really there at all. It was as if my body was there in reality, but my mind (which I had concluded is really ME) was just watching all this happen from infinite space/time away. </p><p>My mind and body had never felt so disconnected in my life, had never actually been 2 completely different things which I could identify and which felt distant from each other. There was some region of my subconscious that was still intact and able to experience all this, and its through this part of my brain that I can now recall what happened, but at the time, all of my normal sensory functions ceased to function in their normal way, and began to function as one. </p><p>My sight, hearing, taste, touch, and smell were all one and were coming to me as one. This is a very hard thing to explain. For a period of probably 20 minutes, I was seeing nothing but a bright yellow, golden color (I couldn't name the color at the time), and I was hearing this low-tone electronic beep noise that wouldn't go away, and my skin felt like it was underwater, I smelled nothing and I tasted nothing. Yet, all these 5 things were happening as one, and my brain registered them all as one.</p><p>T+3:50 -- As I came out of the uni-sense state,  my mind was shooting thoughts and ideas at random very quickly at me. These thoughts weren't created or forced, but just came to me, they just sort of appeared in my head. This was very similar to the earlier stages of the trip when thoughts came very fast at me. But it was as if a person inside my head was just telling me these things. All of a sudden it said '11:56' to me, that was it. A low-tone voice, but very certain of itself. I turned over on my bed because I instantly knew what it related to. On the clock, in big red numbers in front of me read '11:56' This was one of the trippiest moments of my entire life. </p><p>I know for a fact that I didnt see a clock or watch or any time-telling device after about 9:00 or so, and I was stunned for several minutes. Laying in my bed still, everything still swirling, I drifted off into another state of one-sense perception. Again, I came to and the entity said '12:03' I spun around to stare the clock straight on, as it read '12:03' OH MY GOD! AGAIN? WHAT? Did this ever happen a first time? Am I actually seeing this? I was really tripped out. After several more minutes of lying in bed, I tried to predict the time again. This time I was a minute off. And over the next little while, I began to come back to reality somewhat.</p><p>I spent the next couple hours listening to Bob Marley, Sublime, and other various bands, and smoked copious amounts of ganja. The last part of the trip was more in control for me and I was able to enjoy it immensely. I realized that I hadn't talked at all during the trip, and that I hardly even thought in english during the trip. I more just experienced the emotion and got right to thinking about the issue, not talking to myself in english as I often do, but thinking about the thing itself. I went to sleep at about 2:30 that night, about 6 and half hours after dosing. Even as I went to sleep I was still definitely under the influence of the mushrooms, but I was definitely coming back to normal.</p><p>The day after I felt just fine. I woke up feeling refreshed and energized, but my mind! oh my god! My mind had soooooo much information to process. I had experienced so many things that night unlike anything I have ever even thought possible, that it would take a long time for my mind to catch up with it all. I thought I was ready and looking for the full-blown psychedelic experience, but when it came to me, I found myself unprepared the mind-blowing experience that the mushrooms provide. I'm glad that I've spent so much time afterwards trying to reflect on what happened that night because it was such a significant experience in my life. It took everything I thought to be true and real and life, reality and existence and turned it all upside down. </p><p>In many ways, this was a better trip than I could have hoped for. Had I had a sitter there with me, or even another person tripping, I think it would have gone a lot smoother. Either way, I have enjoyed the sacred fungus on multiple occasions since then and have had excellent trips, although none of them even come close in intensity as the trip that night. It definitely has made me able to see things is a true and genuine way. Although this wasn't a big theme in the actual trip, it became apparent later that seeing everything like I was, was allowing me to form a personal, true, genuine, and unbiased opinion on everything. </p><p>This might not sound that amazing, but I feel that often times things appear not as how they really are, so this was great for me. Everything that happened in that trip would take more than my lifetime to completely process and think about, but I think I've got a good start anyway.</p>"
}
