{
 "title": "Experimental Dosing",
 "author": "Molish",
 "citation": "   Molish. \"Experimental Dosing: experience with 2C-B (ID 32811)\". Erowid.org. Apr 6, 2006. erowid.org/exp/32811",
 "substance": "2C-B",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32811",
   "Not Specified",
   " ",
   "Not Given",
   "Apr 6, 2006",
   "Views: 5349",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently took 2C-B and was really unsure of how it would effect me.  After 2 trips, I have learned some ways of making everything go more smoothly.  </p><p>In both instances I was in a comfortable, homelike situation.  The first dose I took was 10mg (I was told, I didn't measure it myself) and I did not eat for a few hours before dosing.  I was smoking pot before dosing, and did not notice additional drug effects for 90 minutes, I thought the drug was bunk, so I ate a little but I felt queasy almost immediately. I chilled out for a few minutes, then felt fine. At that point I had an anxious, excited feeling, and within another 30 minutes I had reached the peak.  It was a different trip, I wanted to curl up and watch things.  I did, and had suprisingly vivid visuals.  After 3-4 hours, the visuals decreased, but I couldn't sleep, even with the aid of sleeping pills for the next 4 hours.  </p><p>A few weeks later, I dosed again with 20mg this time.  I had not taken the precaution of not eating this time.  Everything began as before, but as the visuals started, so did an overwhelming sickness.  I threw up a couple of times over the next 30 minutes.  After that I was floored, literally, by the visuals.  I curled up again, only this time the visuals were completely out of my control.  I had trouble doing anything with my hands (I think it was a mental thing). I couldn't stare into a trippy poster, I just laid back and let my whole world turn into color.  After I gained control of my hands, I did hits of N2O from a balloon.  The effects were amazing.  Intense and beautiful.  I saw music in colors, and had an amazing body buzz.  4-6 hours after dosing, the effects of the N2O were lessening, and I was exhausted.  I was able to fall into a fitful sleep about 8 hours after dosing, but I felt like crap all the next day.</p>"
}
