{
 "title": "Duster Dreams",
 "author": "Will",
 "citation": "   Will. \"Duster Dreams: experience with Inhalants (ID 32837)\". Erowid.org. Apr 22, 2004. erowid.org/exp/32837",
 "substance": "Inhalants",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "7 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32837",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 22, 2004",
   "Views: 18171",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I was working on my computer one day and was using a bottle of duster to clean it out.  Since I was fimiliar to it, and have done small doses once or twice before, I decided to take some hits.  I shook up the bottle, sprayed a little, to get the liquid out of the spray, and put the tube in my mouth, leaving my mouth open to get oxygen in, and held the trigger down.  I do this for about three hits, then I close my mouth on the tube, and slowly suck the duster in, then in the middle, open my mouth and allow for a mixture of duster and air to enter.  I do that, increasing the amount of duster-only breaths.  I am hit hard with it.  The whole ordeal lasted about 10 to 15 mins.  I am sitting on my bed, just thinking about things.  Got a loud ringing in my ears.  I drift between things I think about, and reality.  I think about past things that have happened, and bam, hit by reality.  I start thinking that our life is a cruel joke, and we are the ants in the glass (ant farms), like the kind most of us got when we were kids.  I somehow figured it out!  I had to crack this joke.  </p><p>I then see the universe, waiting for something to happen, then in my head, something is going to happen.  Then bam!  There is a loud boom.  Suddenly, the universe and my life is shattered.  I don't remember what happens next, but the one thing I do know, the duster made me realize this life is a joke, and that when we die, we come back here in another human form to live another life, without us knowing that we have lived past lifes.</p>"
}
