{
 "title": "Glory Flipping",
 "author": "Gf",
 "citation": "   Gf. \"Glory Flipping: experience with MDMA (Ecstasy) & Morning Glory (ID 32864)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32864",
 "substance": "MDMA (Ecstasy) & Morning Glory",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:30",
   "30 g",
   "oral",
   "Morning Glory",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "32864",
   "Male",
   " ",
   "Not Given",
   "Nov 17, 2007",
   "4808",
   " "
  ]
 ],
 "report": "<p>Although Ive heard various accounts on the experimentation of morning glory seeds, mine ended up being very positive.  Around 4 PM I dropped both tablets of the MDMA at my house with a couple of friends and started feeling the effects soon after ingesting the tablets.  I had decided to try mixing the MDMA with the morning glory seeds, because I have not yet encountered any other experiences involving the combination of these 2 substances.  I didn't ingest the morning glory seeds until 2 and a half hours after ingesting the MDMA.  This is because the MDMA had made my attention span so short, it was almost non-existent, and therefore it took more time then usual to prepare the morning glory seeds.</p><p>Preparation included throwing the non-treated seeds into a blender and filling the rest of the blender with ice cold water.  The concoction was blended on and off over the period of half an hour when my friends became impatient and encouraged me to finish off the morning glory seeds.  The liquid in the blender was filtered through paper towel and a metal strainer.  The filtered liquid was then mixed with iced tea.  It took about 15 minutes to finish drinking the liquid, since I had added so much water to the blender.  Definite effects became apparent 15 minutes after finishing the concoction.</p><p>I decided to start my trip off outside in the nice spring weather mostly because I was afraid I would puke and didn't want to be anywhere close to my dad when this occured.  The magnitude of effects increased very slowly and steadily over the next 4 hours where I reached a platue around 10:30.  No nervousness or emotional edginess was encountered due to the MDMA and the euphoria it produced which thankfully blocked out all the bad vibes on receives when experiencing the common trip.  Visuals were rather intense and strikingly similar to that of a strong dose of mushrooms, about 7 grams of mushrooms to be more specific.  Objects shimmered and all my surroundings became alive with movement.  The tracers were not as intense as those of a mushroom trip.  Auditory hallucinations occured several times while listening to music and watching tv. The voices and frequencies of certain sounds became very distorted at times.  I experienced very little confusion throughout the night due to what I believe is the stimulant effects of the MDMA which made me almost completely clear headed.</p><p>Around 10:30 my friends had to go which is where I reached the peak of the trip.  Around this time frame, the euphoric effects of the MDMA wore off and left me feeling extremely tweeked out and nervous for the remainder of the night.  I became very depressed when my friends had to go, because the MDMA had caused me to become so attached to them and when they left I felt deserted and unwanted even though these feelings were only due to the comedown effects of the MDMA.  The intensity of the trip declined steadily after midnight and I was completely back to normal at around 3 am.</p>"
}
