{
 "title": "Notes On The Proper Method To Destroy My Brain",
 "author": "Headrift",
 "citation": "   Headrift. \"Notes On The Proper Method To Destroy My Brain: experience with Gasoline (ID 32866)\". Erowid.org. Sep 25, 2005. erowid.org/exp/32866",
 "substance": "Gasoline",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "1992",
   "32866",
   "Male",
   " ",
   "Not Given",
   "Sep 25, 2005",
   "Views: 20584",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>Capsule review:  Heavy-duty industrial-strength short-term trip, serious long-term damage.  Only for the brave or stupid.  I did a fair amount of gas back in the day.  My first trip was when I was 15; I was visiting a cousin, we went running around with one of his friends, and we ended up in some kind of undergound building foundation with some unleaded in a mason jar.  Time froze around me, and my mind had its' first of many direct exposures to infinity.  The friend said he saw Jesus, my cousin said that we turned into dicks.  Gas trips vary widely by person and setting.  I'll pass on what I learned about huffing on and off over a six year period.  [This turned out to be a bit long, hope it's not too boring]</p><p>First, I'd get a 'Gas Bong', one of those little red gas tanks people use for refilling lawn mowers then fill it halfway with gas (gas treated with a stabilizer doesn't work) and find  a well-ventilated area.  The 'well-ventilated area' part sounds stupid, considering what the business at hand is, but you don't want fumes building up in case you want a smoke later.</p><p>If I could give myself advice for my firs time it would be 'don't go solo'.  A friend and I once made the mistake of going out for a smoke during another friend's first trip, and he freaked a bit when he came down and we weren't there.  The trips were powerful.</p><p>Next, I would take a seat.  A direct seat on the floor or ground, with legs crossed, seemed to carry good mojo, as did huffing while it was raining.  I was always sure the small cap at the other end of the bong is off (I found myself wanting to focus on the whistling noise).  I would then cup my hand around the spout at the other end and start huffing.  Sometimes I would feel free to open my hand a little to serve as a carburator.</p><p>Now, I would simply breathe through the bong.  I knew it was working when my feet start to tingle.  I was not be alarmed when the tingling started to work it's way up to my head, this was normal.  In here somewhere, I will hear The Noise.  The Noise is a low humming sound that cannot be reproduced by technology (we've tried), and it's about the only hallucination that gasheads have in common.  People who've done other inhalants might also recognize it.</p><p>By the time the tingling washed over my head and things got cool, I would quit paying attention to most everything around you except my breathing and the whistling of the bong.  Thinking became disorganized and chaotic.  'Don't sweat it, just let your mind drift, as if you were going to sleep.'  I let the whistling hypnotize me.  If I got the hiccups, I would do my best.  (I once had a trip that I was talking to a hiccup that spoke German, but that's not important right now)</p><p>Right about here, reality as I've known it (or at least sizeable chunks of it) would disappear.  The best trips were the ones where the physical world disappeared as if it never were.  These were filled with Odd Visions of abstract shapes and colors, often in more than three dimensions, and accompanied by a strong sense of Fundamental Truth. A lot of what I experienced is too...  (large? deep?) to be communicated with words.  If I knew more words, they'd still be inadequate.</p><p>Other trips loop, recurse, and generally do strange stuff to your sense of time.  Deja-vu and childhood memeories you never had are common.  A quick example would go like this:</p><p>'You're sitting in the TV room on the couch.  You look up at the TV, and see yourself sitting in the TV room on the couch.  Your perception (snaps? slides? slams?) into the you on the couch on the screen, and you're sitting in the TV room on the couch.  You look up at the TV, and see yourself sitting in the TV room on the couch.  Your perception (snaps? slides? slams?) into the you on the couch on the screen, and you're sitting in the TV room...'</p><p>...that goes on for 'a while', subjectively.  Like I said earlier, my first trip was one of these.  Everything around me stopped moving, but my thoughts continued.  After a brief amount of infinite time, my thoughts turned into a scream receding into the void.  That's usually when you come back from a trip like this - when you think you're dead.  You'll get used to it after a while.</p><p>Other trips happened, but they were less common, and don't really have anything in common.  One problem with gas trips is that, again, they're hard to communicate accurately.  While doing gas, we eventually made a group decision to stop talking about our trips because we realized that they will never make sense to anyone else quite they way they made sense to us at the time.</p><p>If I ever wondered what I looked like while tripping, I would look over at my buddy while he's tripping.  Yup, that's right, I was drooling on myself, muscles mostly slack, and eyes looking around the room sightlessly.  The brain during a gas trip probably lands somewhere between catatonia and coma.</p><p>Which brings me to the damage.  In my/the brain, there's this thing called the 'blood/brain' barrier (the lining of the blood vessels, I think, I'm not a doctor).  Toxins, including gasoline, break this down, and let all kinds of things into the brain that really shouldn't be there.  It also breaks down a substance called myelin, which is important to proper nerve cell function.  Anyway, when I had an MRI recently, my brain was riddled with scar tissue, and the first doctor to review the images thought I had multiple sclerosis.  If you've got a morbid fear of MS, gas probably isn't worth it to you.</p><p>The rest of the bad stuff is pretty minor.  I would smell like gas to everyone else for a few days, and cigarettes didn't taste right for a day or two.  I might feel like I'm a bit stupider than I used to be, but that went away after about a week.  I'm not sure if that means you get used to being stupider, or if you go back to your normal self.  I probably stayed stupider.</p><p>I can't really recommend gas to anyone anymore, because I hear that it can kill you dead on the spot.  I've never known anyone that happened to, though.  Here's some data, make your own decision.</p>"
}
