{
 "title": "The Life Changing Tree",
 "author": "Optical Jelly",
 "citation": "   Optical Jelly. \"The Life Changing Tree: experience with LSD (ID 32903)\". Erowid.org. Jun 11, 2006. erowid.org/exp/32903",
 "substance": "LSD",
 "bodyweight": "174 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)",
   "  T+ 0:00",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 3:00",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32903",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2006",
   "Views: 4349",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the longest time I've been reading about LSD and its effects. It interested me and kind of scared me at the same time. Finally after some time a friend of mine got me a hit, my trip wasn't planned for that day, I knew we are about to get a hit and I was ready to do it very soon.</p><p>Friday night I gave him a visit. I thought we are about to just smoke, but he surprised me and gave me a small hit of acid. I thought 'what the hell' and took one 1/2 of the hit.</p><p>1:00 A.M - I kept the hit for a long time on my tongue, just sucking on it. We were listening to some techno and smoked some hash to just waste some time till the acid kicks in. it had a bitter taste, not unbearable though.</p><p>2:15 A.M - still nothing. I was just waiting and wondering when it will kick in. and the past hour I started feeling more energized.</p><p>3:00 A.M - no visuals. Still energized, feeling stiff all over my body, especially in the back and neck area, and later on the back of my head. Which is the visual part of the brain. I could really feel parts of my brain opening up and waking up to life. </p><p>Felt warm all over, like fever. Giggling and laughing, and more ambition to talk.</p><p>4:00 A.M - still no visuals. It was very hard to spot any effects. Still stiff. I had a feeling like something is cooking inside me and ready to just EXPLODE outside any second. Around 4:20 A.M  I could notice that thoughts were running around my head more and more. I mostly thought about how I should let go and let the trip start, and I was concerned what if nothing will happen. We decided I should take the other 1/2 because I dont feel anything yet. My body was not stiff anymore, and now instead of that I had some kind of a new feeling all over. Objects felt different. In the corner of my eyes I could see bright lights. My head just did not feel the same. At this point I was sure Im tripping. The visuals started to kick in. I was looking at the wall while the room was dark, it had glowing start stickers all over it, they were moving around the wall, looking kind of alive. When I looked at his cat the shapes on her were moving randomly into other shapes and colors, the whole room seem to be somehow alive and breathing. Talking, standing and moving felt weird.</p><p>5:25am - Still no strong visuals. I was more aware to the whole body sensation. I knew that once it will be morning I will trip harder, and the thought of watching the sunshine right on the peak of the trip got me very exited. My friend called a cab for me and I was on my way home. In the cab I was very talkative and tried to open conversation with the driver, but he did not respond, which made me wonder if I was talking at all. I kept looking out side at the trails from the side of the car, and the street lights that were very strong and a bit colorful. He dropped me near my house, and I walked from there to the woody area near my house. It was still dark, around 5:30am. I set on a bench and just looked around, amazed to notice things are not as usual. The trees seemed to be alive, looking at me and move as I breathe. Slowly I could notice more and more visuals, such faces in the trees, eyes all over the branches etc. I sent myself a text message to my cellphone 'you got to let gogog0g0g0g0g0g0g0.....'. From that point I just tried to relax and watch the new world around me. Listening to the night sounds and I could still hear the music from earlier. I entered into a very weird thought that this is the best day of my life.</p><p>5:54 A.M -The night started to fade away, and the sky slowly turned from endless black to deep blue. The moon was between the trees looking alive and smiling. The sky turned brighter, and the birds were all waking up, singing and flying around, leaving trails in the air. I moved deeper into the woods to another bench were I had a better view at the sky. First there were very heavy rain clouds, and it was pretty cold, though I didn't felt cold at all. The clouds were moving as I was breathing. Changing into new forms and shapes and swirling in the winds. I could notice colors and small shapes in the light of the clouds. I felt like I need to think how to improve my life, and how to fix my problems. I snapped out of the thoughts and saw few crows flying around leaving trails behind. I thought I heard one of them call my name, and looked back, as I heard the crows laugh at me.</p><p>I stood up and walked away to a spot I usually like to relax at. On my way there I could hear some kind of noises coming from a small tree. It sounded like small pixies talking to each other, and I looked for them finding nothing. I got to my spot; its a tree that is shaped oval, and very comfortable to sit on. As I sat on the tree I could feel it breathing, and felt very protected and secure. The tree moved with the wind, and felt like it was hugging me, like it was trying to say to me that everything is OK, and it will be alright. It was hugging me in a way nothing human ever did. I was sitting there for a while, looking at the stones on the ground changing shapes and twist.</p><p>7:00 A.M - I walked back to my house, and I noticed Im not the only one out side. There were at least 20 people walking in the street. I didn't know what to do and started laughing, trying to stop myself from drawing attention as people look at me. I walked faster and entered my house. My stomach felt acidic and hurt a bit, so I ate a slice of bread, looking outside the kitchen's window and see the flowers and plants calling me to go outside and watch them. I walked outside and could hear the flowers talking to each other but I didn't understand what they were saying.</p><p>I walked back inside, and went into my room. When I sat on the chair I could feel again like was sitting on the same tree, in the middle of the woods which felt very real.</p><p>I let both of my dogs into my room, and they looked at me like they knew I was tripping. I put on some music, and watched the clouds changing into people who were swimming in the sky. I went and looked at the mirror, my face was changing. First the eyes, moving to different directions, then my mouth and nose, and my whole face mixed up, blinked, and it was normal again. I smoked some more hashish.</p><p>The trip lasted for more than 13 hours. I went to sleep, and woke up few hours later, it felt like it was only few min of sleep, and I did not remember any of the dreams. It was a very nice trip, which changed my life for the good. It fixed a lot of mixed thoughts and feelings I had for a long time, and I can't wait to do it again. I was a bit disappointed that I didn't have very strong visuals, and it took so long to kick in. I guess it was because I took only 1/2 and another 1/2 few hours later. Next I will take a whole hit.</p><p>LSD changed my life.</p>"
}
