{
 "title": "A Floaty Mellow Trip",
 "author": "TenJayYouEssAy",
 "citation": "   TenJayYouEssAy. \"A Floaty Mellow Trip: experience with 2C-T-2 (ID 32930)\". Erowid.org. Jan 11, 2007. erowid.org/exp/32930",
 "substance": "2C-T-2",
 "bodyweight": "295 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   " ",
   "2C-T-2",
   " ",
   "  T+ 1:00",
   "1 repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:00",
   "3 oz",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32930",
   "Male",
   " ",
   "Not Given",
   "Jan 11, 2007",
   "Views: 4894",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>1:30 AM T=0 Feeling good, kind of regretting taking a hallucinogen this late in the night, kind of tired but mentally sound and centered</p><p>2:30AM T=1hr Wondering why things havent kicked in yet. Considering taking another 10mg of 2C-T-2 but opt to supplement with 1.5 grams of cannabis smoked with 3 other people and 3oz of schnapps. </p><p>3:00AM T=1hr 30min  Things have started, the first thing noticed is the body high similar to MDMA like body high. Visuals are subtle differences in focusing. Generally still mentally clear. Despite flux in the perception of time (I. E. Time slows down like with mushrooms) still able to focus and talk frankly about visuals. Better able to connect with people. semi-breakdown of the ego; feeling deeper overall. Better appreciation for music and poetry. The Most unique part of the experience was the feeling of weightlessness when standing, also an intermittent feeling of numbness in parts.</p><p>4:00AM T=2hr 30min Seeing blatant visuals pulsing of objects, color shifts, and brief visual figures (robin from 'witch hunter robin') Intermittent creeping feeling but nothing that couldnt be shrugged off. Listening to OK Computer by Radiohead. Slight auditory hallucinations like clicking noises and confusion of running water for cat hissing. Inability to focus vision. feeling of weightlessness when standing, also an intermittent feeling of numbness in parts. Body is feeling not as worn out as with MDMD or Mushrooms. State of mind still positive. Pupils Dilated</p><p>5:00AM-9AM Coming Down. Little did I know one of the friends I was tripping with was babysitting me and another friend. Coming down is like MDMA but less harsh. Sensitivity to light, slight headache, and cottonmouth.</p><p>After Effects: The Day after I felt sluggish and spacey, A general lack of appetite. I experienced rain visuals at 1PM the day after. I smoked some cannabis that night and experienced slight brief visuals (shapes undulation and colors)</p><p>Overall: A positive unique hallucinogenic experience. A Floaty Mellow Trip. A good $10 spent.</p>"
}
