{
 "title": "Thought I Was a Rock Star",
 "author": "Amnesiac",
 "citation": "Citation:   Amnesiac. \"Thought I Was a Rock Star: experience with Alprazolam (Xanax) (ID 32964)\". Erowid.org. Sep 23, 2007. erowid.org/exp/32964",
 "substance": "Alprazolam (Xanax)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Alprazolam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 32964",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 23, 2007",
   "Views: 18385",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFor two years I regularly mixed Xanax and booze. It didn't seem at all unusual at the time since I was living in a cracked out part of town and was basically surrounded by junkies every time I stepped out my front door. I would start my nights ( and days ) by dissolving a Xanie under the tongue,  chasing it with the Jesus Juice and then hitting the town feeling like I owned the place. Each dose was like a cruel scientific experiment I was conducting on myself. I've always been an anxious person and to feel no anxiety at all when fueled up on benzo's was such a freedom I didn't care about the trouble that lied ahead. Waking up in strange places ( sometimes with strange people ), starting altercations, telling people I hated that I loved them and telling people I loved that I hated them. While it made for great stories when I could recall the nights events, things started getting dicey when I realized I couldn't go more than four hours after fueling up without feeling panicky, anxious, and surrounded on all sides by withdrawal symptoms.\r\nIt was at that point that I decided to quit cold turkey. The next week of my life was hell! I had a constant swooshing sound in my ears, blurred vision, and a constant cold sweat. My thoughts were terrifying and fragmented, my anxiety was at an all time high and strangest of all I felt like my teeth were moving in my mouth. I had no choice but to go to work and making it through those 8 hours was a nightmare.  I would sit at my desk shaking, passing time online by reading about other Xanax addicts who felt like their teeth were moving too. Simple tasks like entering a restaurant became monumental tasks. Finally I called my parents, explained the situation to them and asked if I could come home for a week a recover.\r\nI love drugs, I always will, and Xanax made for a damn good time, but the party couldn't last and coming off of it was the ultimate punishment.\n\n\n"
}