{
 "title": "For Those Who Seek",
 "author": "AtonalPrime",
 "citation": "   AtonalPrime. \"For Those Who Seek: experience with T. pachanoi, Heimia salicifolia & Cannabis (ID 32969)\". Erowid.org. Apr 20, 2004. erowid.org/exp/32969",
 "substance": "T. pachanoi, Heimia salicifolia & Cannabis",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "18 oz",
   "oral",
   "Cacti - T. pachanoi",
   "(fresh)",
   "  T+ 4:00",
   "11 g",
   "oral",
   "Heimia salicifolia",
   "(extract)",
   " ",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32969",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 20, 2004",
   "Views: 45007",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Three of us did the following:</p><p>Order of substances:</p><p>1)  approximately 7:00pm, eat cactus sticks (with lemon juice) from San Pedro cactus.  Based on rough conversions, I estimate we ingested somewhere around 500mg of mescaline.  We lounged for an hour and then started our voyage.  It was immediately clear that we were in a new world when we stepped outside and the next apartment we went to, we quickly exited.  It was on our way to our next stop that one of the most crucial elements of the voyage became clear.  We had to have something to smoke, meaning cloves or cigarettes.  If we had forgot those (and we almost did), I honestly do not know how bad the voyage could have become.</p><p>Approximately 11pm arrive at last apartment.  Euphoria has overcome us and we are perfectly calm and enjoying the nature around us.  Luckily we live in a very well-off community with lots of trees and happy vegetation.  While in the apartment, we know that it is an unnatural place and immediately feel the desire to get out as soon as possible.  I roll a joint with very dank weed and packed it very well.  We popped one 'pellet' of sinicuichi each before smoking just about half of the joint.  </p><p>EXPLANATION OF SINICUICHI PELLET:</p><p>Following the method described by 'Confessions of an English Sinicuichi Smoker, by Glossolalia' in the Sinicuichi FAQs, I had made one extract previous.  It was just powder, approx. 10g.  Upon ingesting 1/8th of extract, a little more than suggested by Glossolalia, all that was felt was relaxation of the skeletal muscles and slight dream-state.  This experience was also mixed with Yopo and alcohol.  Overall, I only came away with sore muscles.</p><p>The night before the San Pedro combo, I ingested remaining powder.  It is very important to use a sweet, citrusy drink, I believe, for best-tasting experience.  The powder is quite bitter and will easily coat the back of your mouth if you try and just throw it back.  Solution could be to put powder into gelcaps.  Mixing this sinicuichi with pot yielded a HIGHLY euphoric state with EXCELLENT memory recall ability.  I did trip on this and sometimes really felt what I was seeing was from a different time.  I canot explain this trip in words.  I believe this is probably as far as I should have gone with the sinicuichi in retrospect.  The following day I had plenty of energy and it was GREATLY escalated by shots of highly caffeinated Chinese tea.  I have no doubt that a good amount of sinicuichi stored in my body and doing a heavy dose two nights in a row was a bad idea.  It can affect my short-term memory to an extreme degree during the trip (which can be brought back by substances such as caffeine and marijuana).  I will say the energy and focus the sinicuichi gave me for the day enabled me to accomplish many things around my apartment.</p><p>The second extraction was done in a very similar manner to the first only I did not allow the residue to fully dry out.  I used approximately 33g of dried sinicuichi foliage.  (SIDE NOTE OF SAFETY:  When making an extract, be very careful.  Pyrex is recommended but it must have a flat bottom otherwise you run a great risk of having it explode.  I destroyed two pyrex dishes in this process (one out of stupidity: cold water on hot pyrex).)  With about half of the residue still being sticky and half being powder, I could easily scrape the bowl and then roll the residue into a large pellet.  This was easily divided into three parts.  It should be noted that the original recipe only calls for using '1/16th of the powder' for a good dose and beginners should only seek more out, in MY PERSONAL OPINION, if they are experienced entheogenic users.  One of these pellets is a HEAVY dose AT THE LEAST.  The best benefit of the pellets was eliminating the taste of the sinicuichi.  It could easily be dropped in the back of the mouth with a gulp of water.</p><p>2) Ingest Sinicuichi pellet.</p><p>3) Smoke half a joint, approximately 1g total smoked.</p><p>What followed I cannot describe in great detail simply because I do not feel comfortable doing so.  I will say this:</p><p>If anyone ever uses this combination, expect to have an experience like nothing else.  I believe the sinicuichi induces an extreme dream-like perception of the reality and can be dangerous if not expected.  There is a nearly immediate relaxation of all skeletal muscles in the body and this includes muscles surrounding the rib cage for breathing.  The chest will feel tight unless one conciously relaxes all the remaining tension in the  body.   Your body will feel completely abused after this trip if you do not relax your muscles.  YOU MUST RELAX.  AGAIN, YOU HAVE TO RELAX YOUR MUSCLES.</p><p>This trip involved walking nearly 5 miles and lasted nearly 12 hours with plenty of residual effects the next day (escalated by caffeine intake and marijuana use to the point where I am still nearly tripping).  It is now more than 48 hours after the voyage and I can still feel the euphoria.  </p><p>For this voyage, it was ESSENTIAL that the three of us stayed together, nearly touching side-to-side as we walked.  The concept of one-mind and one step at a time was essential.  It was extremely difficult to stay with the group as there were constant distractions to pull us away.  For me, a musician, the focus was Auditory Hallucinations.  This aspect became almost the core experience of my trip.  The whirring of a ceiling fan with the clank of its chain became Native American ceremonial music.  Street-lamps became high-energy electronic music.  The waves of Lake Michigan lapping on the shore became a conversation in which I could easily understand.</p><p>We had to be led on our voyage and give that control to the sacred forces that we had put into our bodies.  We only walked where we were welcomed by messengers of nature.  A group of entities (perhaps real) did cross paths with us and I percieved great danger from them.  as we walked by they murmurred aspects of killing trees and killing plants.  This was more than disconcerting.</p><p>There were open-eye hallucinations to a minimal degree (for me), but the most intense happenings were closed-eye.  Planes of existance were traveled by all three of us and conversations with divine beings were had.  I felt at one point that I was the avatar of Mescalito, conversing with the Great Spirit of Lake Michigan while simultaneously acknowledging the divine presence which ruled us all.</p><p>A NOTE ON DANGER:</p><p>One member of our voyage did become so affected by the unnatural force of being inside an apartment that he went unconcious for a moment.  This was of course at the top of a flight of stairs.  All I can say is that we were lucky to already be in a state of one-mind and were able to walk him down the three flights of stairs, 'one step at a time' until we could get out in the natural fresh-air.  This was perhaps the scariest thing I have ever encountered in life and would say stay away from mixing Sinicuichi with other psychadelics unless you are a trained Shaman.  If you do, please be careful and stay outdoors.  For an example, I felt that a laptop was literally burning me with unnatural energy.</p><p>CONCLUSION:</p><p>This experience was life-changing in many ways and I have yet to come to grips with all of it.  This is what I wanted.  I will not do sinicuichi again for a long time.  I am monitoring its other holistic affects and it seems to:</p><p>1) Help me in my asthma.</p><p>2) Give me a sense of energy and the desire to accomplish things.</p><p>3) Enable me to almost 'reset' my muscles and through yogic stretching, really develop a new sense of my body and all of its muscles (including the tiny ones on the top of my toes and the ones which cover my scalp...they are ALL affected.)</p>"
}
