{
 "title": "Awful Hangover",
 "author": "Ben",
 "citation": "   Ben. \"Awful Hangover: experience with Diphenhydramine & Cannabis (ID 32973)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32973",
 "substance": "Diphenhydramine & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 0:30",
   "125 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 1:00",
   "125 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 0:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:00",
   "200 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 32973",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 17, 2007",
   "Views: 9472",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I did it was actually last Sunday. It was about 9 at night and I had read many trip reports for Dramamine. I was excited because the one experience I had with shrooms was very weak and disappointing, and acid hasnt been seen in my town since forever. Because I didn't know if I had any allergic reactions to the chemical I started off carefully with just two 25mg pills. After a half an hour passed I figured I was safe. So I took 5 more.<br>Within 30 minutes I was feeling a vague stoned feeling where music kind of goes through me and when I stand up I feel almost a rush. This was the extent of having taken about 7 pills, 175 mg. So I took 5 more, but to no prevail. I was getting a somewhat paranoid feeling after a while so I decided to smoke a bowl of pot. This kind of alleviated the paranoia because I am an experienced pot smoker and it made me realize that this was just a drug. The only 'tripping' I experienced was occasional patterns on the ceiling which is very textured. Occasionally I'd see things go bye me out of the corner of my eyes. Also by this time I felt nauseous.<br>So finally I said screw it and I took 8 more. I waited an hour, then another half an hour, finally I felt really stoned and massively tired. The experience came to a halt when I decided to sleep it off because it was just wasting my time. The next morning I woke up with a hangover worse than an alcohol-induced hangover. Firstly my mouth was incredibly dry, so I had to drink water asap. My head was pounding so I took advil, my stomach hurt, and my lower back where my kidneys are was incredibly sore. I had to pee a lot during the 'trip' which was scary because bathrooms can get creepy when your on the verge of hallucinating because of the mirrors and small spaces. I felt like my IQ had gone down about 50 points and I still was seeing things out of the corner of my eyes.<br>The hangover lasted till that night at around 9, and my back, where my kidneys are, was sore until the following Tuesday morning. This is not an experience worth repeating, I thought seeing some exciting hallucinations would be fun, cos I never had an experience like that, but it just resulted in a bad hangover that lasted too long and a sore back for some reason. It wasn't worth it!\n\n\n"
}
