{
 "title": "Beyond This World",
 "author": "S.D.",
 "citation": "   S.D.. \"Beyond This World: experience with Salvia divinorum (20x extract) (ID 32971)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32971",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "0.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 32971",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 17, 2007",
   "Views: 2456",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A friend of mine had recently received his 20x salvia from an online vendor, so I thought to try it out. I had been smoking weed periodically throughout the day.</p><p>My friend packed me a half bowl of 20x salvia, now Ive tried regular salvia leaves before, with no effects, although I dont think I should have jumped to such a high level extract, I had no clue what was gonna happen. I ended up killing the bowl in one hit out of my 1'6' bong, and I remembered I should try to hold it in for 30 seconds. I remember getting to about 20, when the next thing I know my vision is completely black, just absolute nothing. I had completely lost all touch of reality, and 'I' didnt exist, I was no where near my body, didnt even know I had a body, I was just some sort of energy flowing through this infinite space of nothing.</p><p>When suddenly I hear laughing, lots of laughing, this was in fact my other friends in the room, so I looked to the right, and could see 1 of them, but I had absolutely no clue who it was, what it was, or why it was making that noise, and I suddenly got the idea that if I look to the right, thats not where I want to be, now I know it was the 'real' reality. I didnt wanna look that way, so I looked back to the left, blackness again, for a very short time, then I began to be 'pushed' and 'shoved' out of this world and back into the 'real' world, although I still couldnt make anything out (where I was, who I was, what I had done, or anything), it was complete confusion. </p><p>I remember this intense visual, I looked out, and everything was very, very distorted, like reality was being twisted around me, I had been sitting on a white couch during the whole experience, and when I looked down to see my body, it was moving, and I wasnt moving it, I just thought I was viewing vision 'something' but had no control of it, and I notice the white (on the couch), and thought it was just a big piece of paper, then I saw the body on top of it, and it was looking 'flat', like 2d, like it was printed on the paper. This was in fact my body, and I remember seeing the paper go all the way up my back, and I thought I was drawn or printed on the paper, being rolled up, when in reality, I was just nodding my upper body forward and backward. The next thing I know I hear more laughing, lots of laughing, and suddenly I remembered I had taken the salvia, fuck, I suddenly started feeling very, very uncomfortable, like my skin, it wasnt normal, it was as if I was stuck in 2 different dimensions, and was kinda painful. Finally things were starting to make sense, I started remembering who people were, and where I was, and who I was. </p><p>Suddenly, memory of the whole experience just rushed into my head. I was in complete awe with everything that had happened. And I remember saying this 'What, the, fuck, just happened???', then saying that, 'That was the most insane thing Ive ever experienced.' If I could say what this does, here it is, it grabs, it twists, it tears, 'you' out of your body, out of reality, out of this world, strips you of everything, then your kinda stuck in that place for a while. When suddenly your forced out, then you remember you've smoked some salvia, and then your put back together very uncomfortably. Complete chaos, and thats the best way I can explain it, and if you ask anyone who has done it, I think you'll find that its effects are incomprehendable, impossible to explain in a way that someone who hasn't felt it, would understand.. Its beyond this world.</p>"
}
