{
 "title": "Analysis of a Difficult Experience",
 "author": "Psychedelic Cat",
 "citation": "   Psychedelic Cat. \"Analysis of a Difficult Experience: experience with LSD (ID 32986)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32986",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 drops",
   "oral",
   "LSD",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 32986",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 17, 2007",
   "Views: 3040",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is the story of my most unpleasant experience to date on LSD. I guess you would call it a bad trip, but I dont think the term is very precise. It certainly was a bad experience. The point of sharing the story is to try to show how preconceptions can affect a trip, and how doing acid recklessly also invites trouble.</p><p>It started when an acquaintance of mine had obtained a couple vials of liquid LSD for his and his friends personal use (he was not a dealer himself). Since I usually dont come around acid very often, I asked him if it would be possible for me to get some, and he obliged. By the way, at this time he had already had the acid for several weeks, so it probably wasnt too fresh. Of the two vials, he told me (now I almost wish he hadnt) that the one vial was weaker but smoother and the other was stronger but more jarring. He ended up giving me four hits from the first (smooth) bottle, onto sugar cubes. I took one, which hardly had any effect. Then I took the remaining three a day later, and enjoyed it though it wasnt as strong as I wanted it to be.</p><p>The next week I was back for more. At that point he gave me six more hits, two on each cube. These were from the stronger bottle. I considered these three cubes, and how I should take them. I thought I should probably eat just one to test them out and save the other two for later. My only problem was deciding when to do this. A few days later, in the morning, I thought about doing one. I did not have to work until three oclock and reasoned that I could take it fairly early in the morning and have enough time to come down and go to work. I have a clerk-type job, which does not require very much concentration.</p><p>I was rather uncertain, though, so I decided I might flip a coin to help me. This is a kind of strange ritual I used to have, of asking the coin yes and no questions. I dont believe there is any real intelligence guiding the coin, but it seems useful to treat it that way when trying to make a decision. So I asked it first, Should I take this acid today? and it answered, No. I wasnt happy with this, so I asked, Will something bad happen to me if I do? The answer was No again. So I went on, Will someone else get hurt as a result? Will I suffer social consequences? etc., etc., asking about any conceivable thing that could go wrong. All the answers were No. At this point, I was rather annoyed. Why not take it then? Of course I knew also that this was just silliness, that the coin did not really know anything, but I persisted. So it struck me to ask, Is the reason I shouldnt take it simply because I wont have any fun? And then the answer came up Yes. Aha! So that was it. Deciding it was worth the risk, I promptly popped the cube in my mouth and took a shower. This was about 7:30 am.</p><p>I had always been told that the showering experience was very fun on acid, but I found it annoying. I felt too hot, and kind of icky being all wet. So I got out and dried off, and went about trying to trip. It quickly became apparent that this acid was kind of harsh, or at least, my subjective experience of it was harsh. I felt very physically uncomfortable, with a lot of back cramping and unpleasant feelings in the throat and mouth. Nevertheless, I was tripping moderately, and I was able to get something out of it, but I did feel pretty foolish and unhappy with my decision. So I spent the next several hours listening to music, going into the bathroom to listen to the fan whirr into the carpet, and doing anything to try to take my mind off the physical discomfort, which was probably the most severe Id ever experienced on acid.</p><p>Unfortunately, as 2:00pm began to roll around, I realized that I had not come down enough. I began to doubt that I would be able to go to work. I worried a little, but simply decided to call and tell them I would be in at four. They asked no questions. Its a very casual workplace. Still, after another hour I was still pretty screwed up. I had to leave around 3:45 to get there on time. It was 3:00 and although I was feeling much more stable and not hallucinating, my pupils were absolutely huge and I definitely still felt strange. However, I really didnt want to just call in sick, because I was somewhat sketchy about being home when my mom arrived, she would certainly wonder why I hadnt gone to work and might notice me acting strangely. She discovered my acid use before and was not happy about it! So, I made a huge (and probably bad decision) to drive to work.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Now, I must emphasize that at the time I left I was not, technically, tripping. The world had solidified and I was feeling fairly coordinated and alert. Still, I cannot claim that I was at the height of my ability. I cant justify what I did, although it was probably no worse than driving on one beer, I still shouldnt have done it and it was probably the stupidest thing Ive ever done. I got in the car and took off down my street, wearing sunglasses of course. I felt fairly confident, but the first thing I saw at the four-way stop near my house was a cop car crossing right in front of me. Bad omen!</p><p>I went on to the freeway. About half way to my work, I looked in the rear view mirror, a CHP was behind me. I began to prepare to move into the slow lane to let it pass when its lights began to flash at me. I could not believe it. I had no idea what I had done wrong. I had a huge rush of adrenalin, and my heart began to pound. The panic was all the more intense because of the residual acid effects. I knew if I had to remove my glasses there would simply be no way my huge pupils would go unnoticed, and even though I had nothing on me, I was terrified of going to jail. I pulled into the slow lane, and the car rushed past me. Phew! What a close call. He wasnt after me!</p><p>Another cop car was encountered after I exited the freeway near my work. Finally I arrived there safely, and worked my four hour shift. I have to say it was almost like torture trying to work in that state, but I handled it. The funniest thing was that the lady I worked with that night told me I looked totally with it that day. Ha! On the way home, I saw several more police cars. I have never seen that much fuzz on my route to and from work before, ever. It seemed to me that God was trying to send me a message. Finally I got home and felt tremendous relief that this ordeal was over. I was exhausted, both mentally and physically.</p><p>After going home I met with a friend and told him all about the experience. He is an experienced drug user himself, but has given up acid. He then told me something strange: he had prayed for me the day before that the next time I did acid, something would happen to make me not want to do it ever again, not something that would harm me, just something unpleasant. It seemed his prayer had been answered. I thought about it for a while. I did not want to repeat this experience and seeing how unpleasant this particular batch of acid was, I washed the two remaining cubes down my sink. Many months have now passed and in retrospect I can isolate several factors that contributed to this bad trip:</p><p>The first is the warning given to me by the supplier. That certainly affected my expectations, and I have to wonder how things would have gone if he had said nothing. I do believe that different batches, due to impurities or perhaps chemical breakdown, can affect you differently, but the psychological factor is also important. I was predisposed to having a bumpy ride, I think. The second is the foolish choice of setting. I had to be at work that day! What an idiot. I should have waited until I had at least two days off in a row, but I was impatient. The stress from worrying about having to go to work certainly affected the quality of the trip.</p><p>Finally, my stupid coin flip decision making process. This is the most idiotic thing I could have done, even if I did not truly believe in it. The coin said I would not have any fun, and I didnt. What did I expect? Even if I knew it was not real, the suggestion was powerful enough when combined with acid. Incidentally, I have wholly given up this process for making any decisions as a result of this experience.</p><p>It has been a while since this happened, and I have not taken acid since, but I am now feeling like I might do it again. I believe I was hasty to agree with my friends advice to stop doing it simply based on suggestibility, because he talked to me only hours after my trip. I had felt a bit psychologically off for a few months after, but now things are starting to clear up and I may do it again, but I will never do it that casually or recklessly.</p>"
}
