{
 "title": "Magically Delicious",
 "author": "Nemo",
 "citation": "   Nemo. \"Magically Delicious: experience with Ecstasy (ID 3299)\". Erowid.org. Oct 14, 2000. erowid.org/exp/3299",
 "substance": "Ecstasy",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 5:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3299",
   "Male",
   " ",
   "Not Given",
   "Oct 14, 2000",
   "Views: 7749",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is the story of my first experience of MDMA.</p><p>Trying to capture the mood I was in that day I remember that I had been working constantly for 8 hours, traveling (2 flights) for approximately 3½ hour and then when I walked out from the bagage handling in a European city I saw my 5 friends sitting on the floor waiting for me to arrive.</p><p>We had all decided to go to a well known festival in Northern Europe this summer and now I was finally there, a little late but still there...</p><p>I hooked up with my friends and we went off to the Festival site roughly an hour of a car ride south. Five minutes or so after the airport my friend M turned around and asked me if I wanted a pill now? I had almost forgotten that I actually had 5 E pills waiting for me when I arrived. I was a bit concerned about the effects as I had never tried this drug before and M gave me a 10 minute facts session and finished up with the phrase 'remember to drink enough of water, otherwhise this shit will dehydrate you'.</p><p>I got the pill, it was a small green pill in the shape of a four leaf clover and of course the name of it was 'green four leaf clover'. I remember having a second of doubt but as I had great trust in my friends, of whom 3 of them had tried this before, and they all said that it was the best thing they'd ever done.</p><p>I took it and swallowed it with almost a liter of water and then sat back and tried to enjoy the rest of the ride to the festival. I was anxious to get the effects but on the other hand I was a little worried that I would hit me before I got in to the camping site (past the ticket control and all). As I didn't know what to expect I tried to 'read' all my body reactions but I was pretty sure that it had not hit me yet when we came to the parking area of the festival. I went outside and took a deep breath and packed up my bags on the back and we went for a long walk to the main entrance. I begun to feel a little speedy effects and I can clearly recall that my legs seemed to bounce of the ground when we came closer to the entrance. Also I started to speak more and rapidly about everything as I tried to hold back the energy I could feel building up inside of me. We finally got to the entrance and by that time I thought that it had hit me but, boy, was I in for a big surprise! My frends told me that I hade to go through the ticket-control myself as they already had their tickets and at that point I felt like nothing was a task too big, everything was easy and I had the greatest feeling that everything was going to be alright.</p><p>I stood for a few minutes just looking at this amazing sight, the thousands of tents, flags and people virtually flowing in and out of the area. I got my ticket changed into a pass by this very nice girl and I just returned her smile with an even bigger one. As I passed through a checkpoint where they tighten up your arm pass and make sure that you can't get it off to share it with someone else, I felt like the sweat poured off my skin and soaked my clothes. Then the strangest thing happened, everything just froze for a moment, I really can't say for how long, but I got the sensation that it just stopped and then it felt like someone threw a bucket of water over me followed by an exploding feeling of ... well euphoria is the only word even close to capture what it felt like. I was suddenly and instantly in another dimension and I just ran towards my friends with open arms and threw myself at them in a big hug. I can remember that it was hard (not using the word impossible) to explain to them how I felt but I had the urge to try at least, they all smiled at me and the 2 who had tried E before said that there was no need for me to explain, they knew how it felt and they knew it was not possible to say with words.</p><p>I walked through almost the entire festival area with the biggest smile known to mankind and constantly talking to strange people asking them if they felt as good as I did and some of them actually stayed for a while and talked to me. It was amazing how totally free I was from ethic rules of conversation and how great it felt to just interact with everyone I met. Suddenly I got a weird sensation that I was walking on water as the entire ground shifted in color and shape. I danced my way through the crowd and looking at the sky I realized that I was really far off now, the visuals were strong but nothing like on acid or anyother psychedelic drug I had ever tried. I was so aware and I saw things in a sober light yet I was tripping to the ecstatic emotions and thoughts that ran throug my body and mind. We left the bags in the tent and then we were off to the green stage where Underworld was to preform later that evening. I had never heard of them as I was mostly in to another area of the music scene but as we got there and I dropped my second clover sitting on a blanket and sharing a bottle of water with my friend M, I just felt like hugging everyone.</p><p>Underworld started and I was in the middle of the crowd as the amazement begun. I had never heard sweeter tunes and better beats ever... I was dancing, I was stunned by the beauty of the colored lights and blown away by the perception of everyone else in the tent we were all under. I could virtually see who was on E and eveyone else just seemed to be a gray mass that I couldn't relate to. </p><p>I remember a guy who came up to me asking for a cigarette and I ended up giving him a whole box, a bottle of water and a joint. He was somewhat grateful and he started to talk to me but I had a hard time following his words as the lights and sounds were really tripping me off. He turned to me and asked; 'hey man, can you see those beautiful lights and the shapes and.... ', and when we looked into each others eyes we both knew and he just said; 'Oh, you already know....' as no further explanation was necessary.</p><p>I ended up taking yet another pill and chilling out in the chill tent after we saw Underworld and after we danced 'til the the tent closed. I was so rapped up in the E spirit that I was walking around hugging people and telling them that everything was alright, OK, it was all going to be perfect. When I had my time in the after glow to think about everything a bit more calm I remember thanking god for letting me join this tribe of wellbeing and loving people.</p><p>It was to be a great festival as I took more e a few nights later and even without the e I felt the changes that had taken place in me, I was more calm and more loving than I had ever dared to be before and I really could enjoy that festival to the fullest.</p><p>Nemo</p>"
}
