{
 "title": "Bad Snuff Experience",
 "author": "Carl League",
 "citation": "   Carl League. \"Bad Snuff Experience: experience with Tobacco (ID 33006)\". Erowid.org. Apr 23, 2004. erowid.org/exp/33006",
 "substance": "Tobacco",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "buccal",
   "Tobacco",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33006",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2004",
   "Views: 23264",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had quite a bizzare experience today from chewing a rather large amount of copenhagen brand tobacco snuff.</p><p>First of all, the drugs I have tried in the past include:</p><p>Whippets</p><p>Marijuana</p><p>Alcohol</p><p>Painkillers</p><p>DXM</p><p>Caffeine</p><p>Cocaine</p><p>Heroin</p><p>Morning glory seeds</p><p>And Nutmeg</p><p>Im not a big fan of cigarettes (mostly because I have a 5 minute coughing attack when I try to inhale the smoke). Anyway, the other day my friend offered me some tobbacco snuff, I figured 'why the hell not?' so in my ignorance I snorted a small line of it (ouch). My friend then informed me that 'your supposed to put it in your mouth dumbass' I chewed a bit of it and enjoyed the pleasant lightheadedness. My friend gave me the rest of the snuff and I went home. </p><p>Later that day I thought to myself: 'Hmmmmm.... I bet if I put a HUGE chunk in my mouth I'll get REALLY buzzed!' (I know I'm stupid) so I stuffed a large quantity between my lips and gums and started sucking, I started swallowing my spit instead of spitting it out assuming that I would absorb more nicotine that way. After a few minutes I started getting that lightheaded feeling but it came on faster and was MUCH more strong it was like that headrush feeling I get when my car goes down a steep hill too fast. It was absolultly unpleasant in every way. I also started getting a horrible throbbing headache and some slight nausea. It was like the feeling I get from holding my breath for a really really long time. I started getting paranoid thoughts like I was going to pass out and choke to death on my own puke. I finally said enough is enough and spit it all out and washed my mouth out. Then I splashed some water on my face and layed down. The feeling faded within a few minutes but I was left with the unpleasant headache for the remainder of the night.</p><p>It wasn't THAT bad of an experience but it just goes to show that you must have respect for ALL psychoactives even if you think its just something mild and harmless.</p><p>Will I ever do snuff again? Yeah, probably</p><p>Will I ever do THAT much again? Hell no</p>"
}
