{
 "title": "I'll Never Do That Again",
 "author": "Nick",
 "citation": "   Nick. \"I'll Never Do That Again: experience with Fentanyl (ID 33013)\". Erowid.org. Apr 23, 2004. erowid.org/exp/33013",
 "substance": "Fentanyl",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "transdermal",
   "Pharms - Fentanyl",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33013",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2004",
   "Views: 35903",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've Currently been able to buy Duragesic Fentanyl patches. I stick them on and they last for 72 hrs. A few times I've just opened the patch and ate the gel out. When I eat the gel it comes on very strong. I get very itchy, and I get so relaxed that I dont wanna move once I lay down. Thats with the 2.5mg patches. A few days ago I got a 10mg patch and put it on my skin. It took about 6 hrs before I had any noticeable effects. The first day wasn't very strong I felt good euphoria and relaxation. The next day when I woke up it was like the best sleep I've ever had. The second I got out of bed I felt really dizzy and when outside to get some air. Then I threw up (keep in mind almost everytime I do painkillers I get sick). <br>Throughout the day it got more intense. It comes on in waves it feels really strong sometimes then others it seems lessened. My vision keeps getting blurry and I have to blink often. If I don't it feels too strong and I get dizzy. I was able to work that day I did throw up at least 10 times. Everytime I drank anything I would throw it up. I could hold down some water, its bad to because its hot at my work. I woke up the next morning extreamly dizzy and very sick I couldn't stop gagging and throwing up stomach acid. Also I got a pounding head that was just horrorable. I don't understand how one can have a headache on a painkiller. I was the scambling for the back to stick the patch back on to. I couldn't take it anymore that was just to much for me. I'll never do that again I guess I shouldn't fuck with patches that are made for cancer patients. I just wanted to try the most powerful painkiller in the world.\n\n\n"
}
