{
 "title": "Deaf",
 "author": "Black Cat",
 "citation": "   Black Cat. \"Deaf: experience with Vinpocetine, Ginkgo biloba & Ephedrine (ID 33026)\". Erowid.org. Apr 23, 2004. erowid.org/exp/33026",
 "substance": "Vinpocetine, Ginkgo biloba & Ephedrine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Ginkgo biloba",
   "(pill / tablet)",
   " ",
   "10 mg",
   "oral",
   "Vinpocetine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33026",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2004",
   "Views: 18404",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was taking two english classes and had many reports to write before the end of the quarter. After several days enjoying a certain ephedra product and typing papers, I noticed that I was having a hard time linking concepts together. It seemed that I could only think one sentence at a time and that I couldn't think up sentences that completed each other. This was probably due to a lack of interest in the topic, and mental fatigue. Whatever the case, my solution was to ingest some vinpocetine 5mg, found in a blend with ginkgo. I probably took no more than three pills, most likely two= 10 mg. It completely cleansed my lack of focus on concept building. </p><p>Vinpocetine naturally gets me rattling off at the mouth. Also I have an almost physical connection with sound in its presence. It seems to increase my attention to sound, with a special affinity towards high frequency noises.</p><p>Don't take Vinpocetine with Ephedra!</p><p>It made me temporarily deaf. The effect seems to come and go but under slight agitation, such as in a social situation, I lost my ability to hear. A pressurized feeling may be felt in the ears.</p><p>I tried various ephedrine products to see whether it was the ephedra or the mixture I took. Its definetly the ephedra, if you wanna have a pressurized and deafening experience that can leave you with ringing ears matching the intensity of a black cat going off next to your head this mixture is for you. Oh yeah the experience is temporary, but can leave residual soreness. </p><p>While this report may have excited you, there are some cautions I suggest as precautions in the presence of these two chemicals: </p><p>1. whatever you do don't stand on your head, this seems to be very damaging to the ears.</p><p>2. don't listen to loud music, it feels good, but may make the condition worse.</p><p>3. small amounts may be tolerable (no deafness), but large amounts of vinpocetine will bring it on.</p>"
}
