{
 "title": "It's Better When I'm Active",
 "author": "Sillililasianboi",
 "citation": "   Sillililasianboi. \"It's Better When I'm Active: experience with MDMA (Ecstasy) (ID 33025)\". Erowid.org. Apr 23, 2004. erowid.org/exp/33025",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33025",
   "Male",
   " ",
   "Not Given",
   "Apr 23, 2004",
   "Views: 7488",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time that I tried ecstasy, there was nothing. I just finished fighting with my girlfriend and I wanted to use Ecstasy as a way of analyzing my feelings. On ecstasy, I felt a slight rush that quickly lost its novelty. To my disappointment, I quickly found myself wanting to sleep, but unable to. Later that night, I went to my girlfriend's dorm and I cuddled up next to her. The next day, I told her about my roll despite anticipating her disapproval. I didn't regret the roll, but it didn't do very much for me. She was upset over my experience and I felt bad for not talking with her first.</p><p>The second time I did it, it was off a whim and again because of my girlfriend. I knew my girlfriend didn't approve so in an effort to establish a more autonomous relationship, I told her I wanted to do it again. I requested that she only disapprove after giving me a reason beyond the negative experiences that she's seen. Well, she didn't and she bid me good luck for the night. That night, I went to a  'rave' at a frat. Although the DJ played undancable music, I had a very positive experience. Growing up, I was very repressed. I was a nihilist until about 8th grade and then I was a depressing deconstructionist. When I was on E, I felt completely empathetic. It is very difficult for me to relate to others. This is my defense against a society where people are so repressed and conflicted. On ecstasy, I was indulged. Others understood that I was on drugs and I was allowed to compliment people without worrying what they would think of me. I was given a pass to ignore the social norms. I was in an environment with other intelligent individuals. I could feel their passions and their interests, but I also shared their disappointment. </p><p>When the DJ refused to play rave music, I felt sympathy for both the DJ and the complainers. I was also saddened and frustrated by the fact that the DJ was not empathetic. Now that I have the oppurtunity to examine my experience through sobriety, I understand that there is no social sanction against empathy. On E, I understood the social sanctions and I saw different people's anxieties and was able to express with sincerity, my appreciation of their beauty. I didn't go around telling people that I loved them, which I did feel, but I did go around telling people what I wouldn't normally. I wouldn't have told a cop he had beautiful eyes, but I did ask a friend who was down if she was OK. I knew that my relationship with her wasn't very well-established, so I did tell her that I wanted to talk with her more. It was as if all those years of repressing blew up in one night.</p><p>I was afraid of empathy, because I saw others repressing their empathy. It's easy to be empathetic on E, but sobriety is more complex. On E all there was was empathy. There are other aspects of my life that are important. I hope that I can embrace the empathy that E has shown me, while balancing my competive nature, my intellectual nature, my spiritual nature and my aesthetic nature. I am grateful for this experience and I would like to maximize the benefits of this knowledge.</p><p>I had a good experience and a not so good experience. I believe that the difference between these experiences comes mainly from the difference between my approaches. I believe the a chemical alteration on my body still works only on my body. I believe that the E experience is highly subjective. I was in two different places when I tried those experiences. I was more confident the second time. I was there to make decisions and not to experience enlightenment. Thinking back now, my first approach was irrational. Who is going to teach me other than myself? E is not a God. It's a drug.</p>"
}
