{
 "title": "Blending Environment",
 "author": "Slanted",
 "citation": "   Slanted. \"Blending Environment: experience with Salvia divinorum (leaves) (ID 33070)\". Erowid.org. Nov 17, 2007. erowid.org/exp/33070",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "33070",
   "Male",
   " ",
   "Not Given",
   "Nov 17, 2007",
   "2445",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first time experience with Salvia Divinorum. I'd read the warnings to smoke Salvia in a setting where you are secure and safe; to avoid candles and other sources of fire, and to be receptive to the experience.  In spite of these warnings and the precautions I took, I must say that I wasn't quite prepared for Salvia's teachings.  </p><p>I'd just lit the Sunday evening barbecue.  It was on our deck about 20 feet away from me.  I was standing beside my backyard sweatlodge, a very comfortable and emotionally serene spot for me.  It was a beautiful summer evening, the sun having gone down about 15 minutes earlier.  It wasn't dark yet, that wouldn't happen for another 45 minutes.  I could hear the mesquite charcoal crackling as I loaded my pipe with 4 dried Salvia leaves (average size 1' X 1 1/2').  I took out my lighter and lit it.  I touched the fire to the leaves in the bowl and inhaled strongly.  Holding the medicine in my lungs, I put the lighter in my pocket.  I looked up through the canopy of leaves provided by the large tree in our back yard.  Suddenly, they seemed to simultaneously twist in a counter-clockwise motion and decend to meet me.</p><p>The next thing I remembered was seeing a sort of granular, pink surface at eye-level, as though I was submerged in the environment of my back yard with only my eyes and upper head above ground, looking over this pink surface which later turned out to be the surface of the square paver blocks in our patio.  I could still hear the charcoal crackling, but it had taken on a new meaning that I still can't put into words.  For the next two or three minutes, I returned to 'normal' reality.  I realized that I had made an important discovery; a link, if you will to the natural environment which gave me new respect to our earth and all living things.</p><p>I also discovered that at the beginning of the session, as I had observed the trees 'bending down' to me, I had lost my vertical position, standing--I know, the directions said to sit, but I was only taking one hit!  So, I had experienced a total involuntary separation of mind and body.  That's why they tell you to sit during the entire experience.  It took me a few minutes to find my pipe--it had landed several feet away when I lost my vertical position (Okay, I fell down).</p>"
}
