{
 "title": "No More Mask",
 "author": "Piece by Piece",
 "citation": "   Piece by Piece. \"No More Mask: experience with MDMA (Ecstasy) (ID 33072)\". Erowid.org. Nov 17, 2007. erowid.org/exp/33072",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33072",
   "Male",
   " ",
   "Not Given",
   "Nov 17, 2007",
   "3400",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I will start off by saying that I'm not an experienced drug user. I have used pot daily for the last 2 years and have taken many pharmaceuticals. The following is what I wrote the night I rolled on Ecstasy for the first time while setting alone at home. I dropped the small white pill at 8:50 pm. My trusted friend whom I live 'C' had given it to me earlier in the day. He suggested that I parachute it but not wanting to underestimate the drugs power I took it whole. By what 'C' and other reports on Ecstasy had told me I estimated that the X would kick in within 30 min. to an hour. Boy was I wrong! At 9:04 pm something was definitely happening. My vision became not blurred, but different.</p><p>I began to think about my friend 'C' and how I actually do love him and how I really wish my girlfriend 'S' was with me. Back to the topic I am rolling hard. My stomach experiences discomfort and I even puke up a little water but I assure myself it's ok.</p><p>I'am feeling like I'am in love with everything. I have been somewhat depressed and have come to the conclusion that I have a load of stuff going my way and there is no simple reason why I'am sometimes distant or mean to people. Nothing is what it used to be at 10:17 pm. My eyes start to 'flutter' open and shut but with a try I keep them open.</p><p>I begin to feel some guilt about mistreating my girlfriend. At the same time I feel an angel has blessed me a thousand times over. I also begin to think of others I have mistreated one way or another and realise it's time to make things right. I really think the little white pill has opened me up to alot of things I couldn't see, didn't want to see, or they were probley covered up with my 'Hardcore Gangster' mask I never took off. I light a menthol cigarette and it is shockingly amazing how great it is! I continue thinking of my girlfriend and how I wish I was with her as I write this. All of my fears have been deadened. This first roll has made me feel so much from within myself I can't really describe in words how uplifting and enlightening it is. I do have the force to push down the other things in life that are just wrong. My goals are to make complete peace with my enemies, and to apologize to all the people I have hurt while putting on a fake.</p><p>So my conclusion is Ecstasy has made me realise that we all can achieve whatever it is we set out to do. The love pill has opened me up to a brighter world and definitely a better world.</p>"
}
