{
 "title": "If  this Isn't HPPD I Have No Idea What it Is",
 "author": "marcs",
 "citation": "Citation:   marcs. \"If  this Isn't HPPD I Have No Idea What it Is: experience with Salvia divinorum (ID 33090)\". Erowid.org. Dec 31, 2004. erowid.org/exp/33090",
 "substance": "Salvia divinorum",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 33090",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 31, 2004",
   "Views: 18364",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've used salvia many times before and until one night I had never really tripped off it.  The times before I just recieved a few visual changes and simulation.  The effect I like the most was the incredible mood lift I received after I smoked salvia.  I still use it as an antidepressant by taking small amounts of it orally.  Yet after one night where I took a huge inhale of a full salvia bowl I was sent into another world.\r\nIt scared me a little bit but I wouldn't say there was any emotional  trauma.  It was the day after the trip that I felt as if something was different.  There was movement in my peripheral vision that I can't even describe.  When i concentrated on a bright object like a tree or plant life i would feel like I was tripping again.  \r\nI've realized now that after reading about HPPD that many of these visions have not gone away yet.  Colors seem very bright and when I get high they don't get much brighter.  I see transparent blobs in my vision and black splotches.  When i concentrate on an object something just seems off and strange.  I feel as if I'm not as conscious to my surroundings.\r\nThis could be something completely different and I may not have HPPD but if this is true I have no idea what it is.  Salvia's a great drug the best anti-depressant I've tried but it might be best to keep it at low doses.\n\n\n"
}