{
 "title": "Breakdown and Comeback",
 "author": "Consoldier",
 "citation": "   Consoldier. \"Breakdown and Comeback: experience with Mushrooms (ID 33100)\". Erowid.org. May 6, 2007. erowid.org/exp/33100",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33100",
   "Male",
   " ",
   "Not Given",
   "May 6, 2007",
   "2448",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Please listen to my long story. I am not an experienced drug user, with the except of pot. I've smoked grass regularly for a long time and as of late, have made the decision to quit due to my high anxiety and paranoia. I tried mushrooms for the first time at 2004 New Year's which was incredible and twice after that, but very low dosages and I could just barely feel the effects. I finally worked out a contact and decided to purchase half an ounce of mushrooms for 100 dollars. Well I tripped last night with my friend, which is a story in itself, but my story is about the trip today. I heard that your tolerance is high soon after a shroom trip and you should wait a bit before taking another voyage. I don't quite know how much my friend and I ate from my bag last night, but it was a decent amount. I woke up slightly confused and emotionally very dull and drained.</p><p>I admit that it probably wasn't smart to trip again the day after, especially being emotionally volatile. My trip last night was quite colorful and giggly and it was fun. Today was quite a different experience. I was disappointed that I didn't get strong hallucinations or perhaps I was expecting too much. Also I thought my tolerance would be high, so I took a high dose (for me) tonight.</p><p>Ok, a slight background here would be that I'm not depressed really, just emotionally dull and I have high anxiety sometimes and my paranoia is occasionally out of control. With these things, it's probably not cool to do mushrooms, but I've read all about it and did my research, so I didn't just do them with a blind eye. I knew what would be involved. I did some preparation earlier in the day, concentrating on happy thoughts and listening to uplifting music and basically just relaxing myself. If I had to estimate how much I took today, it would probably be about 3 and a half to 4 grams.</p><p>I went to the store prior to eating the mushrooms, and got 2 bottles of pop and 2 chocolate bars. I came home and ate a few mouthfuls of the shrooms, which didn't taste too bad. I washed it down with Sprite and sat at the computer. This was 9:00pm. At about 10:00pm things were a bit brighter, colors more beautiful and I was pleased that I was getting that high again, it reminded me of a similar startup as my trip last night. At 10:00, when I was just feeling light headed and the onset of a high, I went and ate two more little mouthfuls of the dry plant material and drank more Sprite and ate some chocolate. At 11:00, I was already fairly high, just staring at my monitor and listening to music was very pleasing and my thoughts snowballed and cascaded, and I just pondered about life and such, but nothing too crazy yet. </p><p>As far as visuals, I didn't experience much worth mentioning. Colors were just a lot brighter and more beautiful and I got tracers when I was smoking, and the cherry of the cigarette was so bright like a laser point and it looked interesting moving it around with the smoke. I decided at 11:30 to take a shower and go to bed and meditate there and ponder about deeper things in private. I began showering and by now thoughts were racing through my mind and it was becoming difficult managing them and focusing on a single train of thought.</p><p>I am very self-conscious of my body and I'm 175 pounds now but I came down from 245, and am still losing thankfully. I looked at my naked body, which appeared very big, probably because my mind was seeing it as that, and the shrooms made it appear big. I began hating myself badly. Then I started thinking about God very much. I suddenly broke down and wept and wept and I had this conversation with God in my mind. I would think something and an answer popped into my mind instantly. It sounds like I was just fucked up, but it was an amazing experience for me. I cried to God that I had made a mistake in taking shrooms and my intentions weren't evil and it was just really, really intense. I begged God to make me like myself more. </p><p>I finish up and go to bed around 12:15 and it's black in my room except for a bright blue light on my cd player which makes the room glow bluish and my alarm clock has bright green numbers, so I pointed it away from me which lit up another corner of the room a neon green. I heard that this is where shrooms are the best, in a dark area with a lot of shadow play. Well, I didn't know how true that was until today. As I lay in bed, I turned on some quiet industrial music, and every song was a new voyage inside my mind. I had really elaborate closed eye visuals, and was basically watching a movie that my imagination was playing.</p><p>Like I said before, seeing as I'm quite self-conscious, I looked at my hands and arms glowing blue in the darkness from the cd player, they kept changing size. Sometimes my arm would look ridiculously long or fat and it kept changing between really skinny and then fat. It was interesting to watch and sort of freaked me out sometimes. If I closed my eyes, the visuals there immediately took over. Well, I can't really describe all the things I was going through, I would race through so many different thoughts and conclusions and realize that I was listening to the same song the whole time, and I had thought a world of thoughts in like 5 minutes.</p><p>With my eyes closed, I saw a lot of swirling colors and tentacles and the most peculiar creatures in my mind. They all danced to the music in this freakish harmony. It looked very strange and although I was nervous and slightly spooked, I couldn't stop looking. Or 'seeing' it in my mind I mean. Frequently images of myself would pop into my mind about how I view myself and it was utterly terrifying at how I looked. I saw my face as very deformed and wide eyed, and huge teeth. Well I can't describe it, it just sounds messed, but it truly scared me. </p><p>During my laying in bed, around 1:00am at this point, I began having religious thoughts again and cried hard into my pillow. It was emotionally wrenching, this whole experience. And after another hour and a half of being captivated by music, closed eye visuals, and glowing blue shadow tricks, my stomach began hurting, but not because of the shrooms, but a gall stone but that's a whole different story. It kind of sucks because I wanted to fall asleep like that listening to music. But instead here I am at 4:20am writing this report.</p><p>At 2:30am I left my room and went to the family room where my 2 sober roomates and another buddy were watching tv, and I was so happy that there were people awake. I had a smoke with my roomate and visited and I just got intense feelings of warmth and companionship, like I really appreciated my friendship with all these people. I came to the computer and e-mailed a bunch of people long happy e-mails and e-mailed my parents. I feel like an entirely changed person now. This trip had very extreme lows, where I began acting very strange. I would laugh at little thoughts that now that I think of it, they aren't funny. I would giggle to myself for no apparent reason and couldn't stop little habits like scratching my head or standing in strange postures in the shower, or laying in very weird positions in bed that were amazingly comfortable at the time.</p><p>Looking at mirrors, I made faces at myself and scared myself! I smiled into the mirror and it very much looked like someone else was looking at me. It was quite unique. I had to tell myself to act like a normal human being, and at times I very much scared myself, and was thinking like a schizo. I lost that weight by starving myself and when I was tripping tonight, I felt I had seperated my heart, mind, and body, and pictured these elaborate scenerios where the 3 would meet together and apologize to each other. I apologized to my body for abusing it so much in the past.</p><p>It sounds pretty messed, but there's things I am working out inside myself. Despite the extreme lows of the trip, I also had similar highs. Let's just say the bad points were really terrifying, but the good parts were amazing, so it was very up and down. Crying and laughing and crying and laughing, just this mangled emotional rollercoaster, and now it's hard for me to describe how changed I am. Hopefully for the better. ;)</p>"
}
