{
 "title": "For Weight Training",
 "author": "bengt",
 "citation": "   bengt. \"For Weight Training: experience with Nitric Oxide & Supplements (Creatine & Glutamine) (ID 33169)\". Erowid.org. Jun 12, 2007. erowid.org/exp/33169",
 "substance": "Nitric Oxide & Supplements (Creatine & Glutamine)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Nitric Oxide",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33169",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 12, 2007",
   "Views: 11230",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just wanted to make a few comments on a supplement I've been taking. As part of a mass-gain workout program I normally ingest 300g+ of protein (2g per lb) along with 15g glutamine daily. Sometime during this nine week program I begin a creatine intake of 3-5g daily (20g during loading). </p><p>Recently, my workout partner let me in on this new supplement he had been taking - nitric oxide pills. The only mention I had ever heard of nitric oxide was the warning that stated 'nitric oxide is a poisonous gas'. So I did some research, and found that nitric oxide is found naturally in the body. When your muscles contract, and your blood vessels dilate, nitric oxide is briefly present. This obviously increases blood flow, which gives the person working out that temporary 'pumped' feeling. Using nitric oxide as a weight training supplement causes sustained hemodilation (widening of the blood channels), and it stays that way for the whole day, supposedly leading to bigger mass, more strength and endurance, and that 'pumped' feeling all day.</p><p>I've been using the supplement for two weeks now, and it seems to be doing more than I had expected. It makes me feel like I just got finished working out every minute. You know that feeling in the middle of your workout where your muscles seem a lot bigger and stronger, my muscles feel like that even when I'm just sitting around. Also there's been a noticeable increase in my maximum weight for most exercises. My friend says I can attribute that to the synergy that NO supposedly holds with creatine, although I'm not sure whether that made the difference or not. Although it's not cheap, it is effective.</p>"
}
