{
 "title": "My Whole Life Was Being Watched",
 "author": "SpiritGuide",
 "citation": "   SpiritGuide. \"My Whole Life Was Being Watched: experience with Salvia divinorum (leaves) (ID 33177)\". Erowid.org. Nov 18, 2007. erowid.org/exp/33177",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   "  T+ 0:05",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33177",
   "Male",
   " ",
   "Not Given",
   "Nov 18, 2007",
   "3633",
   " "
  ]
 ],
 "report": "<p>For three months now I have been on Venlafaxine (Effexor XL) for depression which was mainly caused by stopping smoking Cannabis on a daily basis (for the past 4 years). I felt that my medication was not working and sought for something different (and legal!) on the internet. This is when I first discovered Salvia Divinorum. Having read many, many experiences by other users and the safety guidelines, I decided to mail order 1 oz of dried leaf.</p><p>When the time was right (My parents were out - I still live at home) I opened the window of my room and drew the curtains leaving one small lamp lit in the corner. I have a really good sound system in my room and I couldn't imagine trying this experience without music because I love it so much, so I put on Peter Gabriel's Passion at a fair, but not loud, volume. I then loaded the bowl of a homemade bamboo cane pipe (short-stemmed) with a generous amount of leaf. It was then that I thought  'Should I have a sitter present?' because I had planned to take this drug alone. I then shrugged off my doubts and reassured myself that I had read so many reports of this drug that I would just lie down and experience the effects on my own.</p><p>However, nothing could prepare me for what it actually felt like, but I decided I would not take too much to start with to find my 'level'. I was using a normal lighter despite what I had read about having to use a torch lighter, and I lit it and raised the pipe to my lips and inhaled the harsh smoke holding it deep in my lungs for 30 seconds. By the time I exhaled I could feel something was happening, but I marched fearlessly on and loaded another bowl, fumbling somewhat as I could already feel my body twisting and was slightly disorientated. I then took the second hit and held it in for another 30 seconds, exhaled, made sure the pipe was out and lay down.</p><p>My first thoughts were that I could sense myself in a way I have never done on any other drug, it was totally introspective. My body was twisting into the carpet, my hands becoming part of it. I looked around me and saw my speakers and furniture melting and shimmering slowly, whispering to me to lay down and sink into the experience. Then I remembered something I read, visuals are better when eyes are closed, so I closed mine. The music was coming alive to me, colours, beautiful colours and patterns were appearing before me. The music was the patterns. I can't explain it better than that, it was so beautiful it was beyond words.</p><p>It faded after about five minutes and I remember thinking 'Too soon!', so I repeated my above smoking technique, this time packing a little extra in for good measure. Almost instantly after laying the pipe down I melted in the floor. The music now became part of everything, part of who I was and I understood the eternity of sound, there will always be sound and I in turn became eternal like the sounds I was hearing. I cannot stress the sense of ego-loss enough. I wasn't me anymore, I was simply a floating consciousness, lost in the expanse of everything. This did not make me anxious however, in fact I didn't feel any anxiety at all in the entire experience. I felt safe. I felt I had respected the plant and that she was teaching me as a conscientious student. I am definitely going to become a regular Salvia smoker, I can tell that already, being a very spiritual person myself, I know that this plant has much to teach me, if only I will treat her with respect. I plan to increase the level of dose tomorrow and see what more the Sheperdess can teach me.</p>"
}
