{
 "title": "Felt Awesome, but Bad Side Effects",
 "author": "John Doe",
 "citation": "   John Doe. \"Felt Awesome, but Bad Side Effects: experience with Codeine, Caffeine & Acetaminophen (ID 33236)\". Erowid.org. Oct 23, 2006. erowid.org/exp/33236",
 "substance": "Codeine, Caffeine & Acetaminophen",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "64 mg",
   "oral",
   "Codeine",
   "(pill / tablet)",
   " ",
   "120 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   " ",
   "2400 mg",
   "oral",
   "Acetaminophen",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33236",
   "Male",
   " ",
   "Not Given",
   "Oct 23, 2006",
   "23696",
   " "
  ]
 ],
 "report": "<p>My mom gets OTC pills with codeine in them for her bad headaches.</p><p>Each pill contains 300mg of Acetaminophen, 15mg Caffeine and 8mg of codeine. Since this was my first time I decided to take 8 pills which totals:</p><p>64mg Codeine</p><p>120mg Caffeine</p><p>2400mg Acetaminophen</p><p>I took the pills followed by a glass of water around 1:30am once everyone had gone to sleep. By 2:00am I was starting to feel it, I got all warm and a little itchy and everything was kind of a dull numb. I could bite my lip pretty hard and barely feel it.</p><p>At around 2:30 I peaked and then this is where something went wrong.</p><p>My arms started getting jittery, I developed a slight headache, my neck started hurting and my stomach started getting upset. I had to lie down to stop my arms from jittering, and myself from possibly puking. I decided to abandon my computer and go lie down for the night. I felt pretty tired but the caffeine seemed to keep me awake. While laying down every now and then it was like I got hit with a wave of numbness. I managed to drift in and out of sleep and around 4:00am I woke up with the worst stomach pain ever. I wriggled around for about what must of been 20 minutes hoping for the pain to stop.</p><p>After it went away I went back to sleep.</p><p>Now I dont know exactly what caused this, but I'm thinking the jitters came from the caffiene.</p><p>I will try this again, but this time I will use the extraction technique to filter out the acetaminophen as I'm sure that had some sort of adverse effect.</p>"
}
