{
 "title": "Cow",
 "author": "John Diaz",
 "citation": "   John Diaz. \"Cow: experience with Mushrooms - P. tampensis (ID 33251)\". Erowid.org. Jun 21, 2007. erowid.org/exp/33251",
 "substance": "Mushrooms - P. tampensis",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "30 g",
   "oral",
   "Mushrooms - P. tampanensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33251",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2007",
   "Views: 3649",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>L, J and I purchased 30g of what were described as fresh Thai cubensis from a local alternative shop the day prior to the experience. We had experimented with standard cubensis mushrooms in moderate dosages previously and were interested in having a more profound experience. We fasted the day and morning before we ingested the mushrooms in a hope to reduce nausea and reduce the period of onset.</p><p>We ingested the Thai mushrooms simply by cutting them up and chewing and swallowing them. The taste was mushroomy, not unlike the mushrooms you would buy at a supermarket. Shortly after this ingestion we noted a buzzing feeling in the limbs. This was a pleasurable feeling and we simply sat down and waited for the visuals to start. The visuals were much like we had experienced before with general movement in peripheral visions and more profound movements if we relaxed our focus. This wore off after a couple of hours and left us feeling clear-headed.</p><p>We then decided to go back to the shop and purchase some higher dosages. The woman in the shop explained to us that they had three types of mushrooms: The first were the Thais which we had experienced earlier, the second were Hawaiians which she explained to be stronger and thus more expensive and finally they had truffles which she described to be thinky and somewhat poular. Our first choice would have been Hawaiians but we were not carrying enough money. In the end all three of us bought 30g of truffles each.</p><p>We went to J's house which we knew would be empty for the whole day. We had invited three friends round who were supposed to be getting drunk. We sat and waited for the friends to arrive which served to heighten our anticipation. Eventually the friends arrived and we began eating the truffles. From what we had read 10-15g was a standard dose, we decided to go with the whole 30g. The taste was foul, it left an unbearable sour/bitter after taste on the sides of the tongue. Eventually we managed to stomach the truffles and waited with our friends for the effects to kick in.</p><p>Initial effects took about twenty minutes, we felt the familiar comfortable feeling in our limbs and a slight clouding of the mind. Soon after this I had my only strong hallucination of the whole experience: As I stood in the garden the stones seemed to form a pattern which began to extend around me, eventually I was left standing with this pattern stretching infinitely in every direction. Those who initially intended to observe then had to leave. We decided to walk the two girls who had initially been with us back home. The journey involved a long hill which it took us a very long time to travel down. We left those we were walking with at the bottom of the hill and began walking up.</p><p>It was at this point that our minds simply ceased to function in the normal way. We could not stop laughing and conversation became a series of incoherent outbursts. A shared visual was that part of the hill resembled a film backdrop. We continued to slowly stagger up the hill for what seemed like, and probably was hours. Eventually we reached Jamies house at which point we sat then lay on the floor. We continued to laugh with intermittent outbursts of random incoherent conversation. And then we made a monumentally stupid decision; we decided to go outside.</p><p>We intended to travel to M's house, a journey which under normal circumstances would take us a grand total of 15 minutes. We staggered about like madmen shouting and laughing, during the journey we were almost hit by two cars. Everybody was staring at us, we weren't just paranoid, they were. At this point time no longer had meaning and although I'm sure it took us a while to get where we wanted to go, I couldn't say how long. When we got there we were greeted by M's daughter. We actually managed to keep it together until J said 'cow' and I started laughing to myself. M's daughter looked at us suspiciously but continued to talk to us. Eventually we were offered to come in but L and I felt apprehensive and wanted to return to the sanctuary of J's house. The return journey was much the same as the initial one and left another set of bewildered passers by.</p><p>Once we reached J's things continued in a similar fashion for a while before the trip dropped us sharply back to earth. We felt drained in every sense, physically and emotionally. The trip itself had lasted 6 hours although to us it could have been half an hour or a number of days. We retired to a bedroom and our separate beds and began watching T.V. we were still experiencing residual effects including a clouding of the thoughts. At this point I also started to experience decidedly painful stomach cramps this could be put down to the fact that all we had eaten in the past two days were magic mushrooms. We had little food in the house and so set to devouring a multipack of crisps (chips in the US). After about two hours my stomach cramps became unbearable and I took a paracetamol. Soon I was vomiting violently despite a lack of food to vomit.</p><p>As I stood up something happened which I do not entirely remember. I seem to recall experiencing a headrush, however as the head rush came on so did a feeling of dread. I thought I was going to die and my entire vision turned red. I started to black out and started to struggle, my limbs flailing and hitting the walls before I collapsed to the floor with a pronounced thud. I regained consciousness with my face on the floor. J and L had come to check if I was alright. I told them I was alright and that I just needed water. I left the bathroom and ran downstairs to get a drink of water. Once I had the water the same feeling of morbid dread came over me and I blacked out again.</p><p>I came to with my glass smashed beside me and with L and J standing over me. They told me not to move because of the broken glass but I felt an incredible need for fresh air. I half staggered half ran to the garden before collapsing once again to the floor, but as the fresh air entered my lungs I felt my mind clear. Eventually my stomach cramps receded and fatigue rose to a point at which I felt able to sleep. I awoke the next day with a headache and a 'washed out' feeling. I was the only one of the three of us to experience these negative effects and I'm not entirely sure what caused them. I will never try truffles again because of a mixture of the bad taste and lack of visuals.</p>"
}
