{
 "title": "Let's Get Drunk",
 "author": "Captain Codie",
 "citation": "   Captain Codie. \"Let's Get Drunk: experience with Alcohol - Hard (ID 33252)\". Erowid.org. Oct 27, 2006. erowid.org/exp/33252",
 "substance": "Alcohol - Hard",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 33252",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 27, 2006",
   "Views: 8222",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before this experience, the only time I ever drank alcohol it was in reasonable amounts. Nothing more then a few glasses of wine at a holiday event or a beer with my friends. But I was fourteen years old, and I was so curious to see what would happen if I got really drunk.</p><p>It all happened because my friend R invited me to spend the night at her house. We smoked cigarettes all day, and when night came, we tried to go to sleep. It was 3 o'clock in the morning when I suddenly said, 'Let's get drunk!'</p><p>It took a while, but I finally convinced R that we should go for it. We walked over to the bar she has in her basement, and I took a seat on the stool as she brought out a large bottle of vodka. She mixed about four shots of vodka with cranberry juice, and poured it into a large glass.</p><p>We both took turns drinking from it. When it was all gone, I was feeling warm and happy and a definite mood lift! I was laughing easily at anything R said. This, of course, was not enough. I wanted to get plastered!</p><p>So, R took a bottle of Cinnamon Schnapps from the fridge, and two different shot glasses. She poured us each a shot, and then counted down. We both downed our shots at the same time, and then repeated the process. She was putting the bottle back into the fridge when I begged her for two more shots. My speech was slightly slurred, but I don't think she noticed.</p><p>Both of us downed two more shots. It tasted like Hot Tamales! Very strong. I got off the stool and immediately took a seat onto the floor. R laid down on the couch and I tried to talk to her, but she was drifting in and out of sleep, and I was trying desperately to keep her awake.</p><p>'R, don't fall asleep, please don't,' I begged her, like a child. Everything seemed to mean much more than it usually would. Topics in my mind made me so emotional! I was thinking about how glad I was that R was my friend, she was so nice, etc.</p><p>I would look from R to the wall, and it was as if I was seeing things in slow motion. My vision would be slow, and as a consequence, have to 'catch up with itself' when I stopped looking around so fast. I found this insanely interesting, and proceeded to move my head really fast. It was difficult to focus on anything, almost like everything in my line of vision was blurry. </p><p>Finally, I got up to use the bathroom and I had SUCH a hard time walking. I felt so sad when I knocked off a wall decoration trying to make my way to the bathroom. I was stumbling over my own feet, walking into walls, closing the door on myself. It wasn't pretty.</p><p>Eventually I found my way back to the room and I ended up laying down on the couch. R had already fallen asleep, so I tried to do the same. The last thing I remember is thinking to myself with my words jumbled up. Then, I woke up.</p><p>I had blacked out!</p><p>Or at least I thought I did. Maybe I just fell asleep, I thought. I wasn't sure. I quickly sat up, wondering what had happened and how long I had been asleep. I began to panic, so I just rested myself back onto the couch and tried to sleep.</p><p>I woke up later that day with a pounding headache and a dire need for a can of Coca Cola.</p>"
}
