{
 "title": "Art Party",
 "author": "rudolf",
 "citation": "   rudolf. \"Art Party: experience with 2CI (ID 33272)\". Erowid.org. May 4, 2004. erowid.org/exp/33272",
 "substance": "2CI",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33272",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 4, 2004",
   "Views: 8310",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n I recently started taking 2CI.  The way it was described sounded like a lovely marriage of LSD and E. It seems to have quality of each, but quite distinct and amazing.</p><p> I tested the material and dosage twice before I gave it to anybody else.  I refuse to poison anybody without the proper research and personal risk.  </p><p> The setting for this trip was a rather bohemian artshow & houseparty.  The artist, who had also organized the party, is my best friend's lover.  I had tripped with some of his friends a year ago on E and shrooms and thoroughly enjoyed myself.  The crowd was relatively mellow, pot positive, gay and straight, a nice mix of men and women.  The art show was very interesting drawings of people playing video games and a few of naked men. A quarter eater video game was set up.  Very retro-crude.  Tetris was the only game on it I knew. </p><p> I dosed early on ~ 7:30 pm so I'd be in a nice state when the party really started.  Very few people were there at that time.  There were DJs but all I can recall of the music was Sonic Youth, Public Enemy, and Chemical Brothers.  I'm rounding 30 so its my stuff.</p><p>  I had a few drinks, started to get floaty, sparked a doob and passed it round.  I'm lucky enough to have connections for about the best pot there is (BC & Quebec hydro), which is great but I've learnt to be careful how much I'll let someone toke.  I've seen people fall over from the stuff.</p><p> The party was a lot of fun.  I ended up doing some crystal (I'd been a virgin til that night).  Here are some impressions from my friends that I gave the 2CI to.</p><p> Male, 30s, tweaker/E head -  Really enjoyed it, agreed it was E like, but longer.  Found coming down a little hard. He has very bad reactions to acid -- when he got home things got a little too trippy, he took some tranquilizers, and then started grooving and had an early morning giggle fit. I gave him an extra gelcap and he took it the next weekend to positive effect.</p><p> Female, late 20s, fairly recent doper, experienced with cannabis and shrooms, generally low doses -- She felt nervous during the party.  She had dosed very late, so probably didn't reach plateau til the party was wrapping up.  It sounds like she got some weird disassociative effects.  They were a little freaky to her, but still quite fun.  Wants to do it again.</p><p> Male, early 40s, pretty healthy, very sociable drinker and poth smoker --  He had to do bar for a while beacuse it was his boyfriends party.  He told many people that he was on a strange drug.  They all said he seemed normal.  Giving people change was not hard for him.  He enjoyed it.  He liked the double ffect of being totally high and also very lucid and rational.</p><p> Me, almost 30, chronic doper except for the hard stuff (opiates, coke, crystal) -- I had a great time.  I plateaued during a Tetris match, lost worse than a million drunken monkeys, and just laughed and laughed.  I'm very intersted in simple optical illusions, and the house we were in seemed to have a lot.  On the porch was weird frosted glass that was transparent and reflective.  The street was one way and it could look as if the cars were crashing into each other through the glass.  Lights in the park left lovely diagonal zig zaggy patterns.  Under halogen lights, I felt seizurey, but  felt fine when I left the hallway.  Objects kept staying in my hands.  I was on a bit of a roll talking about Canadian and US politics and the Middle East, and I kept holding things, while also talking with my hands.  A few times I ended up with two beers, a cigarette and a book or CD, none of which interested me at the moment. My behaviour seemed a bit bothersome - I was quite loaded.  I ws able to help a few drunken people make sensible decisions about getting home, not drinking beer on the street, and being aware of being quite loaded and not getting too braggy.  Booze kept flowing and I kept thinking about poliical violence and geometry, so it ws a little hard for most folks to keep up.  I couldn't really sleep that morning - I was headed to a rather esoteric brunch of left wing intellectuals and activists, but I seemed to have been the only person to have prepared for it.  A couple of beers and a glass of wine diminished the edginess and seemed to help the neurons flow.</p>"
}
