{
 "title": "Eyes Everywhere",
 "author": "Wax",
 "citation": "Citation:   Wax. \"Eyes Everywhere: experience with Mushrooms & Cannabis (ID 33287)\". Erowid.org. Sep 15, 2004. erowid.org/exp/33287",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33287",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 15, 2004",
   "Views: 6771",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first experience with psilocybin mushrooms was in the summer of 2000 and I have continued to use them in a ceremonial manner involving music.  I believe they are a beautiful gift of the universe and are here for us to ingest and experience Ego Death.\r\nMy friend and I have been tripping together now for about a year and a half, about three times a month, and had been experimenting with different doses.  Having tripped several times by taking 3 grams each in the form of tea followed by ingestion of the remaining mushroom material, we decided to look in the direction of Terence McKenna.  McKenna says five grams will lead to a peak experience.  So we weighed out 10 grams and threw in an extra stem and cap for good measure (we decided we would rather go a little over than a little under).  We made the 10 grams into tea and drank it fairly quickly, swallowing small but tasteless lumps of the remaining mushroom material.  While coming on we smoked some of Boulder's finest and listened to Physics.  The come on took much longer than I expected this time, and I decided that I was going about it in the wrong way.  I decided to just close my eyes and lay back and let the eyes-closed visuals creep into being.  \r\nAbout halfway through the album my friend got up to use the bathroom and I opened my eyes for the first time in about 15 minutes.  I saw what I like to call 'the patterns' all around me, which is normal for me even in smaller doses.  I continued listening to the music and realized that this was already a different trip than normal.  After the cd stopped we dj'ed through some other things and then went into my friend's nursery to look at his plants.  We was talking to me about the plants and as he was talking to me I began to see eyes all around me.  At this point I was very distracted and could not really focus on what my friend was saying.  'My God this is beautiful and interesting' I said.  He asked me what I meant and I told him that I was seeing eyes in everything.  I continued to look around for a second and then looked at his face.  What I saw next startled me initially but did not scare me.  I saw my friend's third eye.  I was looking at his face with wide-eyed amazement and bewilderment, and he asked if I was doing ok.  \r\nI proceeded to tell him about the eyes and he asked me where they were.  I told him that he had another eye on his face and he asked me to point to it.  I reached out and slowly touched his forehead (I was seeing this eye as a very tangible hallucination and I didn't want to disturb it).  I have seen many works of art (Alex Grey being a prime example) depicting the mind's eye of the forehead, and now I know why.  I am not the only one who has seen this.  After this amazing vision we proceeded back into the room with the music playing.  I suddenly became very introspective and starting thinking about what we as humans actually do.  This seed of thought evolved very rapidly in a way that cannot be expressed in any human language (as is often the case with psychedelics) until I came to the realization.  We as humans, no I can't say it that way.  We as souls, are nothing.  I thought about my name and my phone number and my job and my girlfriend and realized that all those things that we base reality on are nothing.  The reality we experience everyday is what the universe allows us to see, but is certainly not all there is.  \r\nI believe the mushrooms were put here to open the floodgates of the psyche and allow us to see how everything is connected, and how the material world is only the epidermal layer of existence.  I began to think that I have nothing to give, and in fact, no one had anything to give.  Then I realized that it is my choice as to how to interpret this amazing unravelling of the universe.  I realized that no matter how much you uncover, you're still alive and must live through each day and hopefully, try to have some goddamn fun while doing it.  We are all nothing, but that is a very beautiful thing.  I think that when you experience Ego Death, only then do you realize that you are nothing, but that being nothing makes you part of everything.\n\n\n"
}