{
 "title": "Singing Stoned",
 "author": "SingingStoner",
 "citation": "   SingingStoner. \"Singing Stoned: experience with Cannabis (ID 33281)\". Erowid.org. Nov 18, 2007. erowid.org/exp/33281",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33281",
   "Male",
   " ",
   "Not Given",
   "Nov 18, 2007",
   "Views: 7872",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a professional singer with repertoire ranging from Oasis to opera, Mozart to musicals. I have been performing for nearly ten years, starring in numerous productions, as well as being the recipient of many prizes, awards, and scholarships from a plethora of competitions. I currently study classical singing with the recognized best teacher in the city where I reside. I also smoke marijuana approximately once a week, and have been doing this for almost three years. I would like to comment on the relationship between these two activities, in an attempt to allow other singers to understand some of the pros and cons of the effects of smoking marijuana on their vocal abilities. If I use any technical jargon which confuses a reader, I apologize in advance and suggest that the viewer use a reputable voice site to seek a definition.</p><p>First, to dispel a common myth that successful singers do not smoke marijuana, I would like to point out that one of the more successful male Broadway performers today spent about five years fighting an addiction to marijuana and still managed to be the star of an incredibly successful musical. He has gone on to star in other hit shows, as well as produce some of his own. </p><p>Now, to more specific comments. During the actual high, I have found that while my singing ability may be slightly diminished, due, I suspect, to the damage done to my throat by the harsh smoke. My sense of pitch is augmented, and comments have been made by professional singers (who were unaware of my state) to the effect that my tuning is improved. Second, certain concepts critical to good singing, including relaxed jaw, open throat, and breathing into the diaphragm, seem easier to apply when stoned. The vocal range also seems to expand, so I who normally have a little more than two octaves in my comfort range can easily hit notes when stoned that present difficulty when not. I also find that vibrato in the voice is increased, probably due to the relaxing effect of marijuana on the body. </p><p>This is not to say that I endorse or recommend performing while high, particularly not classical music, primarily because the lovely, languid, eased out feeling of being blazed can interfere with focus, concentration, and memory. Personally, I have rarely performed while stoned, though I know many successful opera singers who frequently go on stage while stoned.</p><p>The day after smoking, the voice is almost completely returned to normal. While an open throat is still much easier to achieve, the cells in the throat which were killed by the smoke have yet to completely regenerate, so singing can be slightly painful and some singers complain of excessive mucus on their vocal cords the next day. As to long term effects of smoking marijuana on the voice, the primary one is the damage inflicted on the cilia which are responsible for clearing mucus from the throat. Apparently, it is very easy to identify a smoker by examining their vocal cords, and while cigarettes are not as damaging (because they are filtered) there is clear evidence of damage from pot smoke after only a few uses. Personally, I find that after 36 hours at most, the effects of marijuana on my voice have completely disappeared. For this reason I try not to smoke for approximately 36 hours before a performance. </p><p>Singers should remember that the aforementioned is only my personal experience, and should not be treated as gospel. I know singers who abstain from smoking because they claim that it detrimentally affects their performance, just as I know singers who smoke upwards of one gram a day and still have beautiful voices. </p><p>'Marijuana, votre toast, je peux vous le rendre' -Carmen</p>"
}
