{
 "title": "Explorations Into Subtle Space",
 "author": "MGrandA",
 "citation": "   MGrandA. \"Explorations Into Subtle Space: experience with Skullcap (ID 33338)\". Erowid.org. Dec 4, 2004. erowid.org/exp/33338",
 "substance": "Skullcap",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Skullcap",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33338",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 4, 2004",
   "Views: 19062",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell after becoming thoroughly dissatisfied with my increasingly high tolerance for cannabis and the fact that I didn't see any scullcap exclusive reports I decided to try some herbals tonight.  I've tried scullcap before but to only negligible results.  So I figured up the dosage.  I've also only used this with combinations of other plants like kava, damiana, cannabis, and passionflower.  Tonight's experiment is to determine the true effects of scullcap.  That being said I can't predict that my reactions will be the same as others.  So I will now start smoking.\r\nSupplies:\r\nKing Size Kulu Lips Ultra Thin Rice Papers\r\nI piece of card paper for roach\r\nScullcap purchased off of an internet site.  Got 4 oz. for like 6 bucks I think.\r\nT-0:00-Base line.  I feel perfectly normal.  I ate a sandwich about an hour ago and have been drinking water sporadically ever since.  First hit was harsh and reminded me of a burning marshmallow.  It has a pleasant hay kinda smell.  Its almost sweet but it has a throat attack that isn't that great.  Its also almost expansive in the lungs.  Over all my first impression is of a good smoke even if not expecting any effects.  Hopefully those come too.\r\nT-0:05- I think I feel something it almost feels like a linger cannabis high.  The point right before I feel comfortable going out and actually being able to fake soberiety if I need to.  Just noticed a harsh chemically taste when I took a massive lung busting drag.  It burns well.  Pure white almost.\r\nT-0:08- Definitely feel effects at this point.  Not strong.  Still feel a slight high.\r\nT-0:13- Joint half way gone.  Same as 5 minutes ago.\r\nT-0:20- I got lazy and was holding the doobie in my mouth puffing away as I was typing.  This smoke burns my eyes more than cannabis smoke would.  Yowch!  Definite effects.  I feel slightly less cognizant of my surroundings.  The music is quite present, but other than typing and music I have to think about other things.  Like the noise the fans make disappears when I don't think about it.\r\nT-0:30- The effects are noticeable and definite but not very strong.  I think I am going to brew up a damiana and scullcap tea.\r\nThis would work well in a spliff instead of tobacco.\n\n\n"
}
