{
 "title": "Triggered Psychosis & 5 Mental Ward Visits",
 "author": "Cheryl",
 "citation": "Citation:   Cheryl. \"Triggered Psychosis & 5 Mental Ward Visits: experience with LSD (ID 33340)\". Erowid.org. Oct 11, 2006. erowid.org/exp/33340",
 "substance": "LSD",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Alcohol",
   " ",
   "  T+ 24:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 48:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 33340",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 11, 2006",
   "Views: 5260",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHi, my name is Cheryl, I'm a 31 year old stay at home mom.  Prior to this time I had done one hit of LSD five years ago and had a good time with it...it took forever to come down-I felt the effects the next day but otherwise good.  I had smoked pot maybe 5 times in my life, I liked to drink to have fun...I don't believe you have to do drugs to have fun.  I had suffered from depression on and off throughout my life and in the last 10 years had experienced some panic attacks.  This is my story:\r\nIn the end of August 2003 my husband and I went to Jamaica for his friends wedding.  I was anxious about the trip...leaving my kids (a boy 6 and a girl 3) but he really wanted me to go.  Two weeks before the trip I started taking an antidepressant and decided not to take it the week we were in Jamaica.  The day before we left I had a really bad feeling about the trip and left a letter for my kids in case something happened to us, telling them how I loved them, etc. (I wish now I had just stayed home...but listen..)\r\nThe first day in Jamaica I got really drunk on their Banana Daquiris and the next day I had the worst hangover of my life.  So I decided I would smoke pot (very uncharacteristic of me) all day since I couldn't drink.  Then the next night I made the biggest mistake of my life.  My husband and his friends were sitting around the pool and offered me some acid.  I was on vacation, I figured what the hell.  Well his friend gives me two hits of acid, one brown, one white.  That is when my Hell began.\r\nAfter taking the LSD and sitting around for a while I remember walking around with him and a couple of his friends and everything feeling out of touch.  When we went back to our room and layed down it was like I went inside myself and I felt different personalities emerging and I felt that my husband was trying to pick the one he wanted.  I was overcome with a fear that the real me was dying and that my husband was evil and the devil was coming into me.  That was the first of many hallucinations I had for the next 3 months.\r\nWe got home safely from Jamaica and I was still out of it... 2 days after getting home I was admitted to the Mental Ward for 10 days.  I was assigned a Pyschiatrist and he diagnosed me with LSD-induced Psychosis.  That was the first of five trips (each was about a week long) to the Mental Ward from September through the end of November.  The time I spent there was an experience in itself too.  Many different kinds of people there-drug addicts, suicidal people, severely depressed people.  It was not what I had always believed-people wearing the white jacket. \r\nI was on three different antipsychotic drugs...one, I think it was Haldol...made me a zombie and I was so depressed becuase during all those months I couldn't take care of my children (had to go to daycare during the day), I couldn't even drive a car-it came to a point that I just wanted to commit suicide.  I couldn't do that though because the love I have for my children carried me through.  My nurses can attest to that - I forgot my own name one time I was in the hospital but I knew I had my kids.\r\nWell here it is May 2004 and I have not went Psychotic since the end of November and I have been off anti-psychotic meds for 6 weeks.  Right now I am just on Zoloft (anti-depressant) and Depakote (controls mania).  But I have been severely depressed and have no energy and have gained 24 pounds in the last 5 months.  I have been living in fear of relapsing and disrupting my children's lives again and being locked up in the mental ward again. Last night I had such a vivid nightmare I woke up and had a full blown panic attack...It was like reliving my ordeal in Jamaica with my 'personalities'.  My pyschologist made me feel much better today.  She said anyone that has lived through a tramatic experience will have times that are tougher than others.  Its kind of like I have post-traumatic syndrome now.\r\nOn top of all I've mentioned above we have hospital bills totalling about $2000 (insurance only pays 30 inpatient days) and the added cost of daycare for my children for the 3 months I couldn't take care of them.  It ended up being a VERY expensive 'trip'.\r\nSorry this is such a long story but I have wanted my voice to be heard on this subject and I have found an outlet here.  I don't believe anyone should try LSD.  There is also the fact I quit taking my anti-depressent and smoked pot the day before dosing that may have added to the damage LSD caused me.  But I believe and more importantly, my pyschiatrist believes, this wouldn't have happened had I not done the LSD.  I'll never underestimate anything that can have an effect on my mental stability and I warn everyone that reads this to think about it too. Even if the chance is one in a thousand of this happening to you...do you want to gamble with your mind?  \r\nThank god I got mine back...I'm just praying my brain chemicals are back where they are supposed to be and stay there.\n\n\n"
}