{
 "title": "At Peace with Nature",
 "author": "League",
 "citation": "   League. \"At Peace with Nature: experience with Salvia divinorum (5x extract) & Cannabis (ID 33343)\". Erowid.org. Nov 18, 2007. erowid.org/exp/33343",
 "substance": "Salvia divinorum (5x extract) & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33343",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 18, 2007",
   "Views: 2880",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Pretty much out of the blue one day my friend asked me if I wanted to try salvia. I accepted and I loaded up a bowl filled with weed on the bottom and salvia 5x on top. The salvia burned quicker so I got a lungful of just salvia smoke. It was pleasant tasting and less harsh than marijuana smoke but it was still extremely difficult to hold it in for 30 seconds like my friend had instructed me. On about the second or third hit I got this strong indescribable feeling, the only thing I could compare it two was like having my head shoved underwater.</p><p>My vision started having this weird rippling effect. It was as if my vision was a body of water that was completely still when Im sober but under the influence of this drug there was a current flowing through it. Its all very hard to describe. I started getting a mild panicky feeling and started having thoughts like: 'I dont want to do this' 'Why am I doing this?' 'I want this to stop' But those thoughts only rushed through my head for a fraction of a second, I was then hit with this strong feeling of absolute peace and mental clarity.</p><p>I stared off into the trees in the distance and felt a strong connection with nature as they swayed in the wind, the birds chirping, the sun shining, the ants crawling on the ground, it all seemed so beautiful at the time. Im not really an outdoors type of guy but I realized at that moment how beautiful nature really is. All the while my friend was telling me a story about something that happened to him that day. I wasnt listening to a word he said. It wasnt trying to be rude but he seemed so distant and far away, like he was talking to me from some other plane of reality. I felt like attempting to communicate with him was useless because we were so far apart at that moment.</p><p>As the peak affects were fading I started to smoke the MJ that was left in the bowl. I cant tell if the salvia enhanced the weed or of it was just really good shit but I was quite stoned for the next 3 hours. It was different from most Cannabis highs I have had in the past, this was more euphoric and peaceful without a hint of paranoia or lethargy. Marijuana usually makes me feel tired and heavy and somewhat cloudy-minded. But this time I felt light and slightly energized and very clearheaded like a mild cocaine buzz. The whole experience was very dreamlike as other people have described it. I would most definitely try salvia again but I felt like the experience lacked something, I would probably try to get the 10x if possible next time. I give salvia a thumbs-up and would recommend combining it with some good, strong cannabis.</p>"
}
