{
 "title": "A Full Day of Delight",
 "author": "Scoota Boigin",
 "citation": "   Scoota Boigin. \"A Full Day of Delight: experience with Carisoprodol (Soma), Alcohol & Cannabis (ID 33485)\". Erowid.org. Dec 30, 2010. erowid.org/exp/33485",
 "substance": "Carisoprodol (Soma), Alcohol & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 1:00",
   "2 tablets",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 2:00",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 2:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 4:00",
   "1 tablet",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 5:00",
   "2 tablets",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 12:00",
   "3 tablets",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 13:00",
   "2 tablets",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 14:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 19:00",
   "3 tablets",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 19:00",
   "1 glass",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 20:00",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 20:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33485",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 30, 2010",
   "Views: 10691",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 20 pills of carisoprodol in a 24 hour period, even if they were of the lowest available strength, is considered an extremely high dose.] </p><p>Here is my little retrospective of the 24 hours after I purchased 20 Somas.  I had taken 2 pills at a time on 2 occasions and even then I was wasted.  This time was different.  I'll start with the purchasing of the half-scrip at 9:30 PM on a Wednesday night.  </p><p>9:30 pm - Somas purchased, two taken orally with dinner and milk.</p><p>10:30 pm - Feeling that familiar buzz, numbness, loss of coordination, etc.  Then I take 2 more.</p><p>11:30 pm - Feeling quite a heavy buzz, drank a couple beers and smoked a bowl to add to the effects.</p><p>12:30 am - The friends I was hanging out with leave, and I take another Soma.  The count up to this point, 5 soma, and I am definetly feeling wasted.</p><p>1:30 am - Watching TV, well trying to anyways, as my vision is quite distorted and I am unable to move without thinking about it really hard.  So I take another Soma.</p><p>2:30 am - Reaching the peak of my nighttime Soma experience.  Feeling complete loss of coordination and motor skills, stumbling around when I had to get up and for some reason I decide to take 2 more. </p><p>3:30 am - By this point I have consumed quite a few shots of mcnaughtons to go along with my soma swallowing.  I am laying in my bed smoking cigarettes when all of a sudden my energy returns and I decide to clean up my room.  I wouldn't usually think that muscle relaxers would keep me up all night and make me want to clean my room.  So I stumble around managing to clean some dirty clothes and garbage up.  Then I try to push a loveseat up my stairs by myself.  I'd get it half of the way up the stairs and try to get around it to the bottom so I could push it up and it would slide all the way back down.  Exhausted, I give up and retire to my bed, falling instantly into a deep and dream filled soma sleep.  </p><p>9:30 am - I wake up to go to work, still in a daze from the night before.  After taking a shower, I take 3 more soma and head to work.</p><p>10:30 am - An hour has passed at work and I realize that I haven't accomplished a damn thing.  My eyes were completely out of focus and I couldn't even see the computer screen unless I got 2 inches away from it.  I take 2 more soma and soon decide to take a break.</p><p>11:30 am - In the upstairs part of my office, I smoke a bowl and a cigarette and notice myself nodding off quite frequently.  I remember thinking to myself 'I'm too fucked up to work right now.'  So I head outside and hop in my car to drive home. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  On the way, I noticed I was too fucked up to be driving as well, as I was in the other side of the road quite frequently and rear-ended a minivan at a 4-way stop.  Since I had weed, a pipe, and somas on me I just kept driving and never did get a call from the police about a hit and run (this is about 6 days later).  Paranoid, I race home to lock my doors and shut the car in the garage.</p><p>12:30 pm - By this time I am home safely and sound asleep while I am supposed to be working.  Passing out never felt so good.</p><p>3:30 pm - I awake, and I realize I should head back to work and clock out so I could get paid for being fucked up all day.  I make it to work safely and nobody suspects a thing.  I am such a cheapskate haha</p><p>4:30 pm - When I get home, I take 3 more soma and consume a short glass of mcnaughtons whiskey.  Just as the effects were wearing off, I had to do more.  I continued to explain to my friends about the fucked up last 18 hours or so I'd been having.</p><p>5:30 pm - I am about in the state I was late the night before.  Unable to hold my head up under its own weight, slurring words, speaking rubbish, total loss of motor skills and coordination.  I proceeded to drink a couple beers and smoke some weed and cigarettes.  </p><p>6:30 pm - Still wasted beyond belief, I think it might be a good idea to take the remaining 3 out of my original 20 somas with another glass of whiskey.  By this time, one of my friends is ripping on me because I'm so freakin wasted and I remind him of his soma experience a few days earlier to shut him up (He took 3 and was acting like a 7th grade girl getting drunk for the first time).  In a vain attempt to load a bowl of shake, I spill weed all over my pants and the floor but don't really care all that much.</p><p>7:30 pm - Once again I am delerious and not too aware of my body or surroundings.  I tell my friends I'm gonna pass out before I hurt myself, and they agree its probably a good idea.</p><p>8:30 pm - Sound asleep once again, 23 hours after I purchased the somas.  I end up waking around 11 when my friend shows up and I tell him the story of how wasted I got off soma for a day straight.</p><p>Restrospective - This was definetly one of the funnest 24 hours I'd had in a long time.  As you can probably tell, I have a problem with taking things to the excess.  Alchohol and weed definetly enhance the effects of this drug, which are nothing like hydros or any other pills Ive ever taken.  Another thing, the one soma that was unaccounted for was taken over time through the act of snortation.  I would crush out a little line of the stuff and snort it when I would take the others orally.  I hope this experience was helpful but more likely it was just entertaining.</p>"
}
