{
 "title": "Shamanic Visions",
 "author": "Charles Brown",
 "citation": "Citation:   Charles Brown. \"Shamanic Visions: experience with Mushrooms (ID 33523)\". Erowid.org. Aug 16, 2007. erowid.org/exp/33523",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 33523",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2007",
   "Views: 3090",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI would like to tell you about the most incredible entheogenic experience I have ever had the pleasure, and displeasure of going through. But first I'll start with the background info. I was a 21 year old in good physical and mental condition, studying herbal medicines, shamanism, practicing yoga, and exploring entheogenic territories for the last several years. When at all possible, I grow or extract first hand.\r\nWe had found out about 3 months earlier we were to have our first child and we were extremly delighted. It was around the same time as I started forming a bond with the fungus. I experiemented with edible and toxic species, and it all came rather naturally for me. It seemed ironic that shortly after I had learned to grow mushroom fruits, that I myself had injected biological spores in to my wife, and would soon be 'fruiting' a child. It wasn't long before I dedicded to try mushrooms trips to connect with my child while still in utero. \r\nHaving preciously been experimenting with 1-3 gram doses and not finding the desired effect, I decided to try 4 grams of a Thailand strain of psilocybe ground up and drank in hot chocolate. Now it's been said chocolate is a mild MAOI and weather or not that is the case, I have yet to see personally. I DO know that powdering and making an infusion from the mushrooms will cause the experience to come on much faster and more intense, with a smoother and also faster come down. So I informed my wife of my intentions before she went to bed, and prepared my beverage for the evening followed with some relaxation meditation. It's entirely possible I would have smoked a bowl during the course of getting my mind focussed on the trip. \r\nAs was recommeded by Oss and Oeric in the Magic Mushroom Growers Guide I was trying to work my way up to 5 grams dry in complete darkness. This is really quite trying mentally as my mind would attempt to over analyze certain redundant details of a trip such as spirals and geometric rainbow patterns, and would also lead to vicious negative thought circles critizing my harder lessons in life. It had been hard to see past the pretty designs and let myself fall apart allowing myself to be absorbed entirely in to the mushroom trance, but I was learning quickly as mushrooms do not allow for slackers. \r\nWhen I felt prepared, I consumed my drink and went in to lay next to my sleeping wife and unborn child. Within 10 or 15 minutes I was feeling swelling rushes of energy through my eyelids and skull, quickly passing through my entire body. Visuals ensued about 5 minutes or so following. As I let my eyes look past the swiling colors behind my eyelids, I noticed a glowing figure in the center of a black, vast landscape. My vision approached this figure and I noticed quickly that it was myself sitting in a semi lotus position, transparent but glowing. I was able to 'see' what my transparent self was seeing which was an entirety of the universe, very dark and vast but not lonely or scary in the least.\r\nThe universe and creation appeared to be held at two levels, one above and one below. These levels were symbolized by two faint 2-dimensional squares-one hovering below my transparent self's head, one almost directly below my feet. When I would look directly at these squares they would take on an almost picture type of feel and I could watch the evolution of our planet with each blink of my eyes. A black nothing, quickly filling with fire, then water, then forming mountains, then people appearing, then black nothing again, then another creature or land mass would reveal its secret creation to me. All the images were displayed in 'Beyond Technicolor,' colors so vivid language does not justify them.\r\nAfter an undetermined amount of time the squares propelled away from my 'body.' My vision went dark and I felt myself being swept along what I knew was the current of a river. My vision started fading in and I noticed skulls and then entire skeletons passing next to me. I noticed without fear, that the river I was submerged in was blood. I realized somehow that the river was symbolic and that all rivers have an connection in to a larger mass of water (energy). I questioned where this mass would be and what it would hold just as I was pushed in to a giant 'room.'\r\nI still felt physically as though I were underwater but I had reached the end and it seemed like a tall wide bloody H.R. Geiger painting, mother ship and all. This mother ship machine was obviously the central object in the room and the blood river seemed to drain in to the machine, although like I said I still felt submerged. The skeletons suddenly appeared everywhere grabbing me and pulling me towards the machine. It was at this moment when I realized my wife was yanking on my arm telling me to come to, she was bleeding from her womb. \r\nI tried to adjust my vision but could not, so I simply closed my eyes so I could focus on listening. She told me again that she was bleeding and I told her to get dressed, I was taking her to the hospital. I drove quickly and carefully somehow and arrived at the emergency room after only about 2 hours had passed in to my experience.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r\nI was peaking and all around me was bright white beeping lights and staring docturs and nurses. My fear level has never been so high as this night. Paranoid that everyone realizes I am completely losing my brain with my dinner plate pupils and rose red cheeks, and I have my pregnant wife bloody at my side. I sat my wife down and walked to the receptionist and closed my eyes and explained the situation without blinking or stumbling over a word. \r\nI remember rushing my wife to a room with a most humbing chair for her, and watching a doctor examine her internally. He tried to assure us she was fine as well as the baby but we insisted something was wrong. It turned out he was right, and I was able to hear my child's heart beat for the first time at the peak of a mushroom trip.\r\nWe went home and I lay in bed and tried to sort through my thoughts avoiding the visual disturbances, and my conclusion was this: As I have been shown on so many occasions, time is multi leveled and non existant at the same time, and with a slight adjustment in mental perception we are able to tap in to any physical time space the mushrooms allow (my transparent self watching all of creation). In our searches in life we may never realize that the road we are on now, is the one that will lead us where we need to be to find what we are looking for (floating down the blood river). If we ask respectfully of the mushroom, with patience and hard lessons we will be helped with whatever we ask for (the machine I feel was my unborn child, the answer to my request to contact my unborn child).\n\n\n"
}