{
 "title": "Strange Vibration",
 "author": "AARON",
 "citation": "   AARON. \"Strange Vibration: experience with 2C-T-4 (ID 33525)\". Erowid.org. Aug 16, 2004. erowid.org/exp/33525",
 "substance": "2C-T-4",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "insufflated",
   "2C-T-4",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33525",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2004",
   "Views: 11019",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>(I had planned on keeping a journal for this trip so that I could give more detail here but I had no ability to write or even keep a train of thought  during this, so sorry for the absence of time in this report)</p><p>So my last report on this strange chemical was clouded with confusion as I had just written it moments after waking from a VERY deep sleep. For my second and probably last journey with this chemical I decided against mixing it with any other substance. I should start by stating that I do not own a digital scale that weighs down that accurately so I am only going by what I was told was in each gel cap. So if you are to try this the way I did (insulffation both times) start at a much smaller level and work your way up. Me and my friend (B) dosed at 8 pm. B took the two capsules orally and I snorted both. I began to feel the effects in about 20- -30 minutes. It all started with a vibration throughout my body, something I have never experienced with and other substance. This vibration began to grow and at the peak was my main focus. But I think I am getting ahead of myself. While the vibration started I went to my room to lay down. This was similar to a heavy dose of mushrooms to the effect that the substance 'grounded' me. I had no desire to get up (or maybe I couldn't?) Either way I stayed in this position for about 1 an hour and a half or so listening to the pixies softly. </p><p>During this and especially during the peak I could close my eyes and I would hear every electrical device's vibrations very distinctly and would become this vibration (when I say this I mean that while my eyes were closed I was not myself but just a single fast vibration of energy) this in itself put many thoughts into my mind about a vibration actually being another dimension that we can not grasp. I won't elaborate on my actual thoughts though because they were so hard to remember and when I say them out loud they just sound kind of like gibberish. So once the plateau hit me I was able to walk around my apartment and talk with my roommate and B who by this time was just feeling the onset (because it was taken orally according to Shulgin it should have taken an 1 and a 1/2 to 2 hours to come on. B told me that he was trying to read when all the words started to move. So I sat on the couch with him and we talked about nothing in particular. Through out the experience I would often turn to my girlfriend and tell her this was alot like mdma. </p><p>Thinking back on it now  touch was similar but it produced no sense of empathy, well being, or self worth. The  whole experience also was rather sleepy, I could will falling in and out of consciousness with ease and experience lucid type dreaming. The come down for me started at about 6 in the morning when I looked at a very familiar tree and it was the only thing in my visual Field that wasn't morphing and twisting. This was pretty comforting and I felt that sleep was much needed. So I went to bed and slept a good 10 hours.  </p><p>Overall- I really enjoy this for the strange body high. The visuals were always growing and morphing (nothing was stable visually through out the trip) and if I could even begin to describe what I say it was close to a Persian rug. And again I got a strobe light effect of red color.</p><p>* just a note, through from other reports that I have read and friends that have taken this substance orally it  doesn't seem to work as well.  Although I am not suggesting this to anyone who is not experienced with tripping, because it came on VERY strong this way.</p>"
}
