{
 "title": "Strip Searched",
 "author": "Russell J",
 "citation": "   Russell J. \"Strip Searched: experience with Datura (ID 33542)\". Erowid.org. Aug 27, 2006. erowid.org/exp/33542",
 "substance": "Datura",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "1 glass",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "1991",
   "ID: 33542",
   "Male",
   " ",
   "Not Given",
   "Aug 27, 2006",
   "Views: 9317",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Around 13 years ago I had Datura for the first time in New Zealand. Yes, thats right, I was stupid enough to take it again.</p><p>I was around 19 years old, and myself and a friend had heard about Datura, but hadn't yet tried it. We had smoked plenty of pot together, but that was about it. My friend had informed me that our 'dealer, had some Datura. We decided to give it a shot.</p><p>Mounted upon our push bikes, after meeting somewhere close by, we headed off to our friends house. We sat down in the lounge while they were in the kitchen brewing up a rather muddy brew using flowers from the plant. Once finished we were both served with a glass of this muddy looking water,(and it tasted just like that).Trying to ignore the taste we drunk it down and sat there for about 10 mins after informing our friends that we were going to go.(BIG MISTAKE) We even went our separate ways after getting back on the road. A recipe for disaster.</p><p>The buzz had just started to come on at that stage, and it wasnt long at all before things went real wacky. I remember that after seeing my friend off, I started walking off along the footpath pushing my bike beside me. I must have felt that I was in no state to ride. I learned that day that the inventor of the push bike was on Datura) Ha Ha! </p><p>As I walked along this busy street with probably around 10-15 cars passing per minute, I was soon talking to another mate of mine who wasnt there. We had a short conversation, and after walking past a lamp-post he disappeared leaving me standing there looking around for him.(I wonder what passers by were thinking)</p><p>I headed off on a route that I would not normally take no matter where I was going, pushing my bike all the way. I think I was attempting to go home. After walking for what seemed like about 40 minutes, I remember seeing my friend again. (The same one that jumped into the Lamp-post) He said to me, 'hey man, I know the people who live here. Just wait on the front lawn while I go and see them' So I did. I sat down up against a  big tree out the front of the house.(How weird would that have looked to the neighbours). Well somebody called the cops.</p><p>I was sitting on the lawn and next minute a cop car pulls up and about three cops got out. At this stage I wasnt sure if this was real or not. The cops came up to me and said that a neighbour called them. They asked me what I was doing there, and I told them the truth. At least the truth I knew at the time. I said, 'My mate said he knows the people here' One of the cops then said, What mate'. Once again I was left standing there scratching my head wondering where my bloody mate had gone. This time it was in front of three coppers. (Real ones). BUGGER!</p><p>As I sat in the back of the cop car, arrested on the spot of course, I looked out the back window to see my mate, back again, and putting my push bike in the boot of the car. A cop in the front seat then turned around and said, 'been smoking a bit of wacky tabacky have ya?'</p><p>I replied, 'na'. </p><p>I was taken back to the station and striped, but I had nothing on me. The cops then took me home,(or did they), to where I was boarding with a middle aged woman.</p><p>Although we took the drug around 11 in the morning, and I seemed to be only on the streets for about an hour, I was dropped home by the police at around tea time. The pricks must have found I.D on me and also informed my father of it all. I was 19 and living away from home. IT WAS MY PROBLEM! Anyway, my father turned up after I was home for about half an hour, and asked me if I had been smoking pot. I replied, 'yes'. I didnt get a big speech thankfully.</p><p>After all these years, and a total of three experiences, I occasionally think of the events and get these spooky feeling flashbacks which are a little disturbing.</p>"
}
