{
 "title": "Rapture Surprise",
 "author": "julien",
 "citation": "   julien. \"Rapture Surprise: experience with DiPT (ID 33580)\". Erowid.org. Aug 16, 2004. erowid.org/exp/33580",
 "substance": "DiPT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "insufflated",
   "DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33580",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2004",
   "Views: 11705",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had taken this substance by insufflation, carefully weighed by my friend's scientific contraption. I had initially thought such a dose was small, but now I believe it to be well beyond what is necessary to get the recreational pitch drops this drug is known for. Within minutes of feeling the burning post-nasal drip of this powder (its taste was rancid) I started sweating profusely. Everything started to look saturated in color and gain a distinct sharpness I associate with the beginnings of a mushroom trip. </p><p>At 10 minutes I felt very nauseous after trying to lie down on the couch to 'let go'. The mounting speed and intensity of the drug's effects were too much of a surprise for me. Upon being escorted to the bathroom by my girlfriend, everything started to look wiped, fanned, and blurred. A full disassociation was taking place. I could no longer look at my friends as  their morphing faces were simply too much to handle. I felt quite terrified. Despite the feelings of dissociation, feeling trapped in a time loop, I could still manage to understand that I was being watched by concerned, sober people, and that if I screamed in fright, as I wanted to do, I might make the whole experience more scary than needed. I basically refrained from talking the entire 6 hour duration of the trip. </p><p>After my nausea subsided, Jen led me into a bedroom to watch television. BAD IDEA! Without going into it, the images being directed from that box fueled a roller-coaster ride sensation for 4 hours. One second (if time could exist!), I was in the pits of Hell, and the next minute I felt transformed into a baby needle being shot into the heavens, listening to shivering crystals. </p><p>Speaking of sound, everything I heard in audio, whether objectively negative or positive in connotation, was in sync with the roller-coaster ride. So whenever I felt the sensation of diving downwards, the sound pitch would drop considerably and reverse to delicate jingles of bells upon ascension. After I peaked, it was more jingle than chain rattles in Hell. Everything in general had a metallic, synthesizer sound to it: voices, music, background noise, whatever, but it gained less cold, icy, demonic dimensions I had previously encountered. </p><p>By the 5 or sixth hour, my hallucinations had mostly subsided. My friends didn't seem to be 'in on it' or ambiguous, scary agents, or even objects outside of this world I thought I was trapped inside. Only the sound remained totally skewed and it became very amusing. My pitch would rise and drop in mid-sentence. I went to sleep rather buzzed still, seeing tiny tracers in my field of vision. The sound skews went on through most of the next day. Word to the wise kids: it last quite a long time! Also, it did no good for my tinnitus.  Overall, this was a very intriguing substance, as scared as I felt during most of it. I'd watch out for the dosage, and next time, take it in much lower quantity to simply enjoy the recreational audio qualities. They really are bizarre.</p>"
}
