{
 "title": "Dose Reduction",
 "author": "anonymous",
 "citation": "   anonymous. \"Dose Reduction: experience with Trichocereus Cacti & Syrian Rue (ID 33617)\". Erowid.org. May 16, 2004. erowid.org/exp/33617",
 "substance": "Trichocereus Cacti & Syrian Rue",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "(tea)",
   "  T+ 0:15",
   "  ",
   "oral",
   "Cacti",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 33617",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 16, 2004",
   "Views: 14155",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nSyrian Rue (Peganum Harmala) can be used in conjunction with trichocereus cacti in order to multiply the psychedelic effect of the cactus.  Not only does this reduce the amount of slimy green liquid I have to ingest, but reduces the amount cactus needed by two-thirds!\r\nTea recipe:\r\nBrew two grams of powdered rue in one-half cup acidified water for five minutes.\r\nStrain thru cloth, then paper.\r\nDrink this five minutes before ingesting cactus brew.\r\nThe downside to this is that the rue tea is actually nastier tasting than the cactus juice!  Make an extract if you wish.  It can be prepared dose by dose or in big batches.  I'll give the single dose quantities that can be multiplied out.\r\nExtract recipe:\r\nGrind to a powder two grams of Rue and place in 100ml acidified water.  Ascorbic acid works great and every vitamin store has it.  Get the powder that is not buffered.  Lemon juice or vinegar will probably do as well.  We won't be tasting it, so it won't need good flavor.  And since we want to get the most complete extraction possible, just see that the pH paper comes out red.  Boil the grounds in the acid-water for 20 minutes.  Strain thru cloth, then paper.  Now pour the liquid into a pyrex casserole dish and evaporate it.  \r\nI have an electric hot plate that is just large enough for a standard sized casserole dish.  I preheat the hot plate and evaporation dish on it.  In fact, that is really the first thing I do - plug in the hot plate and set the dish on it.  Then by the time I am ready to pour in the filtered liquid, the glass pan is absolutely piping hot.  Also a hairdryer will go a long way in speeding up the process.  One dose can be extracted, recovered and eaten in under an hour.  When doing a big batch, boil off the liquid after filtering. Let it boil until it is nice and thick, then pour it in the glass for evaporation.  Also, get one of those space heaters with a built-in fan.  Set it up to blow the hot air over the evaporation dish.\r\nNow the goop/crystals that remain can be easily scraped up, balled up and swallowed without being tasted.  Or the goop can be placed in gel-caps and swallowed.  This extract should be taken with a big glass of water.  Also, wait 15 minutes before following it with the cactus - and add another 15 minutes if gel-caps are used (maybe more? - i advise against gel-caps).  Again, two grams starting material should be good for facilitating cacti.  Probably even just one gram would be enough, especially if it were simply brewed and drunk in tea form (yuk!).  But as much as four grams may be used without too much unpleasantness.  When I want to 'make sure' it works, I just use three.\r\nRemember, the amount of cactus used will be one-third the amount normally used.  Someone who normally uses 24' would only use 8'.  18' would become 6' and 12' would become 4'!  That's right, just 4 inches!  I have had some beautiful experiences with only 4' of cactus with the help of Syrian Rue.\r\nThe most amazing aspect of using rue with cacti is the short onset time.  Oddly enough I always feel a distinct head change within two minutes of drinking the cactus juice.  It steps up majorly within 20-30 minutes and then the bomb just drops around 50-60 minutes after ingestion.  See, there's no three hour waiting period here.  But don't worry, it still lasts super long.  After 7-8 hours there is a downturn in the energy, but waves keep coming until sleep can be reached around 12-14 hours.\r\nI've never had any extra side effects from this other than what I would normally expect from trichocereus cacti.  Using a little herb to head off any possible nausea ensures for nice come-up.  Most important advice:  take it before noon.\n\n\n"
}
