{
 "title": "Nervous Breakdown Triggered",
 "author": "fn2",
 "citation": "   fn2. \"Nervous Breakdown Triggered: experience with LSD (ID 33625)\". Erowid.org. Oct 31, 2006. erowid.org/exp/33625",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 drops",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33625",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 31, 2006",
   "Views: 7774",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few months ago, after obtaining a vial of LSD, I had started trying it in various settings and various doses. As an experienced psychonaut that is very familiar with this substance, all of my experiences were positive, even though the lucidity surprised me - there was no 'being stuck in a loop', the visual and audio distortions weren't as invasive as usual. This was attributed at the time to the high quality of the batch, it was definately very strong on a spiritual level (much more so than any blotter I've ever tried, and even more than all but one drop of liquid from a friend's vial obtained directly from the chemist).</p><p>Then came the last experience - about a month ago now. It was great. It was clear. Introspection was a scientific process rather than a painful one, the world showed its beauty again and again, and the visual symptoms of my light HPPD lessened... but the next day, when waking up, I felt a terrible emptiness. All of my faults were thrown at me a hundred times over, and I got locked into a loop of self-loathing. I was on the verge of suicide for the next three days. For the following month, I suffered from the worst case of depression I had had since my teenage years and combatted this agressively, getting professional psychological help (no, I do not use medication, hearing that SSRIs may increase HPPD symptoms and the fact that feeling numb is no answer). Feelings of detachment, of not really being there, of total lack of clarity in anything, everything faded into grayer hues (not visually) still remained well after the depression was gone. Lack of energy, lack of willpower, loss of interest... all these have not diminished.</p><p>This depression may have been inside of me for a while, using the removal of psychological barriers by this substance to surface, but I can't help but question how much of it is real - when only now, after a few months of not touching a psychedelic I can feel like myself again... but there is still a road to recovery. All in all, I am feeling stronger now than before the experience, but more aware of the things to fix, and LSD showed that even when its the devil, it's still a teacher, and one that makes me listen. The symptoms of my HPPD have remained much less acute than before, possibly due to the psychological help I've got. But the effects of this are still very strong.</p><p>In retrospect, I am fully aware that it was a complete nervous breakdown - triggered if not caused by the substance. Please be careful, because HPPD isn't the only thing this substance can do to you.</p>"
}
