{
 "title": "Unprepared and Interrupted",
 "author": "Ment@l",
 "citation": "   Ment@l. \"Unprepared and Interrupted: experience with Salvia Divinorum & Leonotis leonurus (ID 33628)\". Erowid.org. Nov 30, 2004. erowid.org/exp/33628",
 "substance": "Salvia Divinorum & Leonotis leonurus",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Salvia divinorum",
   "(tea)",
   " ",
   "  ",
   "oral",
   "Leonotis leonurus",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33628",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 30, 2004",
   "Views: 21065",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had been telling a friend about this hallucinogenic plant, (Lady Sally) and he said if I had some he would try it with me, so I ordered some, and it came a day before our planned date. So I got off work and drove to his house, with my herbs [5 Grams dried salvia leaf (Tea), 1 gram dried wild dagga flowers (Tea), 1/2 tsp. 5x extract salvia 'incense' (Tea)], and we had to wait awhile before we could start the decoction.<br>6:00 P.M.<br>When we were starting to heat the water, his parents drove up, and we had to shut everything down and go to his room, to avoid any questions. <br>We ended up going to a 'hosts' house, and started the process there. <br>8:55 P.M.<br>I had already measured out the dosage, so I just threw everything in the pot, and stirred it periodically, being very unprepared and interupted, I had not crushed the leaves up, and was very unsure as to how powerful it would be. <br>Being the optimist that I am, I hoped for the best. We decocted it for 30 min, and strained the leaves, into a bowl, we put the somewhat squeezed leaves on a plate, grabbed some cups and the bowl, and went up to a dark room.<br>9:30 P.M.<br>We started sipping on the tea and holding it under our tounges for about 1/2 min to 1 min each sip. and every now and then we would grab some leaves and chew on them, and hold that in our mouths, followed by some more tea.<br>10-15 min later I layed down backwards, with my legs still in indian style, and when I tried to get back up I noticed that it was very fast at first, and then Very slow! It was interesting, but cool.<br>We seemed to be instinctual, we moved to another area in the room because it was darker, and we turned off all the lights, and opened the curtains a bit. I guess my time perception had drifted away, because it was already 10:30 P.M. I had noticed visual tracers and I laughed alot, and my movements and speech were not very normal. My imagination seemed to be ALOT more active, almost like, but very different from a cannabis trip, when I am spinning off into untried thought, of very mystical mysterious, almost probable things, but it wasn't as pronounced, or as out of control, it was almost like I could control what I spun off in thought about. I felt very at peace, I said a prayer around 10:30 or there-abouts, and meditated a little bit, but I should have done these things before hand.<br>I got up and tried walking around, it was trying at most, but fun, I walked out of the room, and noticed a white glow around the edges of my vision, my mind state was almost in a trance, but not uncontrollable. We had 3 ppl with us, and he became our sitter as the Lady did not affect him at all. He said I acted like I was autistic. The second person in our group noticed some stuff I did, but probably not as much, unless he just didn't tell anyone, or didn't notice, but I doubt it. It was 11:45 when we had finished the leaves, and tea, and brought our stuff in the kitchen, the mom in the house offered me a bowl of cereal, and talked to me a little, talking was fun, but helped me express myself, and my emotions seemed to come with it. <br>My experience had platoed, and lasted until I fell asleep at 2 A.M.<br>Just some side notes.<br>The third person in our group was taking Zoloft, so we could not add any syrian rue to increase Sally. this was all our first times trying out the Lady, and 2 of us enjoyed it emensly. It didn't feel like a party night where you just get messed up on alcohol, just to get drunk. I think I benefitted, some ways I can't really grasp right now, but I'm sure I will be taught more if I actually hallucinate.\n\n\n"
}
