{
 "title": "Trapped Between the Pages of Reality",
 "author": "Psytrix",
 "citation": "   Psytrix. \"Trapped Between the Pages of Reality: experience with Salvia divinorum (ID 33707)\". Erowid.org. Mar 30, 2006. erowid.org/exp/33707",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 33707",
   "Male",
   " ",
   "Not Given",
   "Mar 30, 2006",
   "Views: 4493",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nAs I recount this from some time ago, the exact amounts are now unknown. The experience itself, however, will always be a vivid memory, and has left me changed perhaps more than any other.</p><p>My friend, Mr. E, and I had consumed a number of jugs of cocktail at a local bar. We were both very drunk, but in a bouncy happy kind of way, and after meeting with his girlfriend, we went back up to his house, had a smoke, and put on some loud psychedelic trance.</p><p>Mr. E had a small bag of dry Salvia leaves, which had been given to him by a friend who'd grown bored of it! Mr. E had already smoked it 2 or 3 times, so he offered me it first, and despite a dimly-remembered warning of '...you've got to smoke it really fast and hot but you need a REALLY strong head...' in my inebriated state I wanted to try it to see what the fuss was about.</p><p>He loaded me quite a large pipe of it, which I took in one and held in for 10 seconds or so. As I breathed out, I remember feeling slightly fuzzy, and starting to say, 'hmm... it hasn't done much... it's just like being really stoned...' and at that point I felt all my thoughts and feelings begin to smear and spiral uncontrollably around my brain. I tried to speak, but immediately couldn't remember what was happening or what speech even was, and had no idea why I was in this state! I felt broken and distorted, so I stood up to try and straighten myself. I remember supporting myself with both hands on Mr. E's desk, on which was his MC-303 beat machine; the stark angles and flashing red lights looked like alien technology, and actually felt like spikes stabbing into in my mind.</p><p>It was at this point that my reality completely dissolved. I was stuck in a loop in time and space, all I could hear was one loud broken-up rhythm repeating over and over again for infinity, from which I could not escape. Then I could see the room again, but from the outside; the world, the room, and everything in it was a cardboard cutout, blue neon glowing spikes trailing away into infinity around the edges. I could see an infinity of other such worlds further and further into the distance, spread out like the pages of a book; it felt like these were all parallel dimensions, that there were an infinite number of them stretching away from me in both directions. Outside the book and all around me was a swirling mass of colour and shape, with thousands of tiny stick people dancing, dividing into two, merging together, dancing, subdividing again and again, symetrical and synchronised; which I saw as being the everlasting dance of life, which can be seen repeated and recreated in all systems, on all levels, in all realities; in stars, in society, in cells, in particles, and in the space between matter itself.</p><p>I realised that to be able to see this I must have fallen outside of space and time. Looking down, I could still see my feet and legs clearly, although they were still stood on the ground in the reality I had come from. I realised I was stuck, I couldn't move because my feet were trapped. Basically, most of me had fallen through a hole in reality, except my feet which were still firmly on the ground. This felt uncomfortable enough. Then the pages of the book began to close on me, and I was squashed between two of these flat realities, which felt like walls of spikes crushing me. I started SCREAMING, 'I've fallen out of reality! I'm stuck, you've got to pull me back!' All I could hear in reply was my friend faintly saying 'It's ok, you're fine, there's nothing wrong with you.' I was screaming back, 'Yes there is! Can't you tell? There's something really wrong! I can't get back!'</p><p>Sometimes, when I could move, I could only move along a certain pre-ordained path through the room, I had no concept of the 3rd dimension. Sometimes I would see myself as one of the cardboard cut-outs in the room. I wanted to go to the door, to go downstairs and go outside, because I thought maybe the fresh air would help me. However, each time I moved along my fixed path to the door, Mr. E would also move along his own fixed path to block me there. This seemed to happen several times, which I thought was another time loop I was stuck in, and I could never get outside. Each time the loop repeated the sequence seemed to become a little longer, and the fourth or fifth time it ended with him hugging me and saying 'you're alright, you've just had a really strong drug, you've just had Salvia, stop shouting, my dad's downstairs...' At this point the real world started breaking back through, starting at the centre of my vision, expanding slowly in a circle. At the edges of this growing circle of real vision, all in the same kind of neon-blue colour as the triangles, were thousands more little stick figures doing this wierd little symmetrical dance of life.</p><p>Now realising what was going on, we went through to a different room where I stuck my head out of the window. I started saying to Mr. E, 'no, this isn't right, I want to be DOWN THERE' pointing down at the garden outside. Everything felt really difficult, like I had to put a point across 3 or 4 times for it to be understood. We went downstairs, avoiding Mr. E's dad, and went outside. My trip was now mostly over; just mild visuals remaining. I distinctly remember feeling shell-shocked and drained. Salvia had chewed me up and spat me back out. The whole experience had lasted maybe 5 or 10 minutes from start to finish, but felt like it had taken a couple of lifetimes.</p><p>Looking back at all this, I don't know whether I believe that my soul actually went somewhere else, or whether it was purely my imagination taking over - but having been through such a powerful experience that felt so real, I have to question the nature of reality and my attachment to it. Who knows ... maybe I didn't find my way back, and this is a completely different reality... and in any case reality is entirely defined by our mind's perception of it, so it follows that these experiences are in fact ways of exploring different realities. What I have to remember, is that THIS reality is pretty messed up, and I can only make it better with real actions in the real world.</p>"
}
