{
 "title": "Profound Bliss",
 "author": "morpheus",
 "citation": "Citation:   morpheus. \"Profound Bliss: experience with 2C-T-2, Piracetam & Picamilon (ID 33710)\". Erowid.org. Jul 20, 2004. erowid.org/exp/33710",
 "substance": "2C-T-2, Piracetam & Picamilon",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-T-2",
   " ",
   "4800 mg",
   "oral",
   "Piracetam",
   " ",
   "120 mg",
   "oral",
   "Picamilon",
   "  T+ 6:00",
   "2400 mg",
   "oral",
   "Piracetam",
   " ",
   "120 mg",
   "oral",
   "Picamilon"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33710",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 20, 2004",
   "Views: 24713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was looking forward to this experience with great anticipation. I had previously tried 2C-T-2 which turned out to be a primarily neutral experience with uncomfortable body load during comedown. My hope was that the Piracetam and Picamilon would help me to relax, ease the comedown, and potentiate the positive effects.\r\nThe setting was a good one. The weather was unexpectedly beautiful with a warm and invigorating sunny breeze, clear sky, and a few friends.\r\n0:00 - ingested the 2C-T-2, piracetam, picamilon\r\n1:30 - the effects slowly begin to build up. The walls seemed to be breathing and there was a slight nausea, numbness and tingling sensations.\r\n2:00 - the effects are in full swing, the visual effects were likened to having the mind's refresh rate slowed considerably, though everything seemed to flow nicely, could be described as being aware of the 'sea' of consciousness.\r\n3:00 - about the time of peak efficacy, between 3:00 and 6:00 the effects very slowly begin to wind down.\r\n6:00 - took another 2400mg of Piracetam and 120mg picamilon because the comedown was beginning and uncomfortable body load, though mild, was beginning to manifest.\r\n7:00 - fully back to functional normalcy, felt spacey and mildly euphoric.\r\nExperiences: Waves of bliss and orgasmic focus came and went, surprisingly the entire trip was almost entirely positive and very pleasurable. Everything seemed beautiful and inspiring though I was unable to verbalize my feelings. Friends recalled that I would spontaneously say things like 'that's beautiful' or 'orgasm' or make moaning sounds. Looking in the mirror was a bewildering experience as my face would unceasingly morph and flow without changing it's general appearance. At times, the faces of other people appeared grotesque and nearderthal-like. However, I don't recall feeling disturbed or frightened by these distortions.\r\nPeople seemed to have a sacred aura around them and I was very attuned to feeling like I needed to respect personal space. Women seemed to loose all sexual allure, I could see femininity as simply aesthetic dressing yet they seemed as potent or powerful as men in everyway if not even more vibrant.\r\nI remember closing my eyes while lying in a hammock, beautiful geometric shapes danced on my eyelids and I felt blissful and humbled.\r\nIt was difficult to converse, the ability to speak and understand others was still there but I felt speechless and overwhelmed by the engulfing 'tides.'\r\nIt seemed as if the experience was teaching me to let go and simply be. When I would try to concentrate or aggressively focus on something - it would cause headaches and queasiness - as soon as I relaxed and let go - the pain would be replaced by bliss and lightness.\r\nIn retrospect, I believe that the piracetam and picamilon definately helped to calm and potentiate the experience while easing the comedown. It's possible that the generally positive spin could be attributed to the wonderful day and my upbeat attitude.\r\nI also exercised earlier in the day, took a multiple vitamin, Omega-3 capsule, 5-htp, and alpha lipoic acid. All about 3-4 hours before taking the 2C-T-2.\n\n\n"
}