{
 "title": "Psy Effects",
 "author": "Toughtss",
 "citation": "   Toughtss. \"Psy Effects: experience with Cannabis (ID 33725)\". Erowid.org. Nov 28, 2007. erowid.org/exp/33725",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "33725",
   "Male",
   " ",
   "Not Given",
   "Nov 28, 2007",
   "2941",
   " "
  ]
 ],
 "report": "<p>Well at this time I was 14 and I had smoked here and there and know what it was like to get decently stoned.  I didn't buy it with my own money.  I just did it when one of my friends asked if I wanted to or just to pitch in a few dollars and did it.</p><p>At this time it was new years eve and for once I decided to buy a bag for myself so I called up one of my smoker friends.  For x-mas I recived around $200 and told my friend I don't plan on spending much.  Well there were some good mids going around for $25 and thats just was I was looking for.  I went over to his house and from there we went over to the house of who was hooking me up.  I entered the house and to my suprise there were 4 people in there that I all knew but one.  I previously knew that they were potheads.  The whole room was cheeched out so bad if I would have waved my hand I could have seen smoke being pushed around.  I sat down, looked at the bag and confirmed the purchase.  Then one of them said 'Have you used the zong before?!'  I just replied no with a blank face.  After I said that everyone in the room went crazy.</p><p>They whiped out this 3 foot high bong with the mouth piece theat zig-zaged up.  They packed in half of there 'Titan nugg' and half of my mids.  The bowl piece was so huge that it could fit a dime in it and be somewhat loose, but he packed it so tight we had to poke it about 4 times.  Well I started it off and holy shiza this thing kicked my ass. The thing was so huge it took me 3 times to clear it out.  On my second hit it was torched by the person before me.  This hit was so big it took me about 4 times to clear out. Then got one more equaly big as the first.</p><p>Well I hadn't smoked in almost a month before this.  I was just sitting there and felt a decent buzz.  It started to kickin within 5 min.  I started to feel sick cause it was so smokey inside so I said I'm going outside for some fresh air.  Here is where it hit me...hard.  I leaned against the side of the house breathing in the fresh air and it started to creep on me.  I looked down at my feet and BAM it hit me.  It seemed as if my feet were serouisly ten stories down.  It felt as if my vision was going higher and higher into the sky but my head wasn't moving.  It felt as if I was being lifted out of my body.  When I felt this I didn't want to leave so I snapped out of it and then bam I would be right back in normal vision, completely in my body.  I did this a few times and when snapping back into my body it startled me.  Then my whole legs went numb.  My legs and the trashcan next to me started to flash violently like a strobe light going very fast.  My friend and the other smoker I knew best and was sorta cool with came out.  We started to just chill and talk. My friend asked if he could drop us off downtown.  He didn't mind so off we were.</p><p>It was very cold out so after about five minutes me and my friend decided to go back to his house. On the way back is where it hit me harder.  We were skating back and while I wasn't pushing I would zone out.  I had my hand over my mouth and nose so when I breathed it helped heat up my face.  This made my hand in the bottom of my vision.  It seemed my vision was given another dimension.  Like it was just a well draw 2d picture so it looked 3d, but then my hand became the 3rd dimension of depth.  It started to stretch out towards me.  This happened to me about three times and snapped out of it after about ten seconds.  This happened to me several other times but with objects with a color that stuck out.  Like the white road in between the grass.</p><p>We got to my friends house (this was probably about 45 min after we smoked) and went straight downstairs because his mom was home and we didn't wanna walk around the house doing what we wanted all stoned.  He put in bad boys II and lit up some insence.    When I was just sitting there watching it I experienced two more mind boggling effects.  The room was dark and the TV was the only thing on.  I got 'tunnel vision', or so it seemed, but different.  My whole outside vision around the TV turned a deeper black.  You know when you stare at something bright then look away you see bright spots where the light source was in your vision?  Well, where the deeper shade of black was around my vision of the TV those same spots showed up, but there were about 20 of them.  They danced around and turned in circles.  This kind of freaked me out so I blinked and everything turned back to normal.</p><p>The next thing that was very intense, the light of the TV was on my legs, and my legs started to violently flash again like a fast strobe light.  My legs seemed to get a 2d, flat like a piece of paper look.  Then the 2d shape of my legs started to stack on top of each other with a small gap.  They stacked up in an instant.  They stacked up to what seemed to be right under my eyes.  While this happened each layer was still flashing rapidly.  I zoned out like this for about 5 seconds then snapped out of it.</p><p>After all of this I started to come down.  I stayed at my friends house and later smoked 2 Js with the same smokers cept the one I didn't know when they came over.  This was just a normal high.</p>"
}
