{
 "title": "The Hype",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The Hype: experience with Guarana & Chocolate (ID 33751)\". Erowid.org. Jun 25, 2007. erowid.org/exp/33751",
 "substance": "Guarana & Chocolate",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Guarana",
   "(liquid)",
   " ",
   "0.75 Tbsp",
   "oral",
   "Chocolate",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33751",
   "Male",
   " ",
   "Not Given",
   "Jun 25, 2007",
   "Views: 23933",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ive been looking for a coffee substitute forever.  Not because of the caffeine but because I personally think that coffee tastes like shit.  Also, if I drink just a little too much it gives me the jitters.  Anyways, I stumbled onto some literature about Guarana in one of my herb books and decided to look into it a little further.  I purchased the seeds at the herb shop, deshelled them, roasted them at 150 degrees C. for three hours, grinded them up in the coffee bean grinder (a must for these seeds), and made some coffee out of them using 1 tablespoon of powder per two cups of water.  Then I also added 0.75 tablespoons of cocoa powder and 0.75 tablespoons of sugar.  Cocoa has a theobromine content of around 3 percent.  P. cupana has a caffeine content of around 3  5 percent whereas Coffea arabica is only 1  2 percent (Lewis, Elvin  Lewis, 2003).  </p><p>The coffee is very stimulating and allows for a clear head, relieves any tension, and is a very good agent to study with, unlike C. arabica, which seems to cause a lot of anxiety and completely ruins my ability to concentrate.  It also tasted really good and I didnt even add a fourth as much sugar as I usually do to make my regular coffee drinkable.  However, I have a very strong feeling that the theobromine from the cocoa has a lot to do with the stimulation and ability of the admixture to not cause any anxiety.  </p><p>I used to take meth or just plain old amphetamines but I think that Guarana will take their places quite nicely.</p><p>Works Cited</p><p>Lewis, Walter and Memory Elvin-Lewis. Medical Botany: Plants Affecting Human Health. second Ed. John Wiley and Sons, NJ. 2003.</p>"
}
