{
 "title": "Accented Bass with the Ache of a Workout",
 "author": "Maas",
 "citation": "Citation:   Maas. \"Accented Bass with the Ache of a Workout: experience with Heima spp. (Sinicuichi) & Salvia divinorium (ID 33762)\". Erowid.org. Feb 23, 2010. erowid.org/exp/33762",
 "substance": "Heima spp. (Sinicuichi) & Salvia divinorium",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 g",
   "oral",
   "Heimia myrtifolia",
   "(tea)",
   "  T+ 1:00",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33762",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 23, 2010",
   "Views: 6203",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is my second try at an experience with sinicuichi. This time the tea had been prepaired with approximately 15-20grams of sinicuichi that had, unlike my previous attempt, been cut to very small pieces. It sat for a little over a day in the sun. This time the brew was an opaque brown color, with a very bitter (disgusting) taste. While I could get down the liquid without difficulties, it was not a pleasent experience.\r\nSome effects were felt almost immediately (t+0:10). A feeling a sedation and a slight laxative effect which went away in 5-10 minutes. The sedation however, persisted. Music sounded phenominal - more resonant and bassy than usual. I put on an awesome song called 'Archie Shepp - Blues for Brother George Jackson (Mondo Grosso remix)' and waited for work. I'm really getting caught up in the music, more than usual. I feel cold. I belive that this is because of the sinicuichi rather than the ambient tempiture.\r\nAn achy feeling pervades my body, as if I had done a workout the day before, which I had not. I also had this side effect the last time I drank sinicuichi tea, but had put it down to a great deal of walking I had done the previous day. There is also a slight but ignorable nausea. I decide to hit a bowl of salvia at t+1:00, as much out of a desire to rid myself of the nausea as much as to trip (a oft missed fact about salvia is that smoking psychoactive amounts of it *temporarily* banishes nausea). Salvia wow... I think I smoked more than I intended. My sense of reality was distorted in ways that are impossible to explain.\r\nThe soreness is strange - it permeates every muscle in my body but I don't really mind. It's an almost relaxing feeling, more the ache of your body after a satisfying workout than anything else. \r\nThe auditory hallucinations are even stranger. It's nothing like the 'distant' sounds I was lead to believe I would hear. Instead, the effects resemble a low dose of DIPT, a substance I have had the pleasure of being entertained by only once. The EQing of sounds is off, bass and lower midrange sounds are accented, giving music a warm bassy feeling. The letter 'S' seems to stick out or be overly pronounced - to my ears it gives everyone a slight lisp. Harmonics are frequently changed and emphasised to the point at which one note sounds like 2 or more in tandem. This also gives voices a strange, robotic sound. It does not, however, interfear with my enjoyment of music.\r\nOne last note: this substance does not impair my ablity to think or physical coordination in the slightest. I feel quite clearheaded. About recalling memories from the distant past - well that has failed to happen.\n\n\n"
}