{
 "title": "A Synergy Between Plants",
 "author": "TheYakster",
 "citation": " TheYakster. \"A Synergy Between Plants: experience with Salvia divinorum (20x extract), Cannabis & Alcohol (ID 33772)\". Erowid.org. Aug 16, 2007. erowid.org/exp/33772",
 "substance": "Salvia divinorum (20x extract), Cannabis & Alcohol",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " T+ 1:20",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 2:05",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33772",
   "Male",
   "",
   "Not Given",
   "Aug 16, 2007",
   "3822",
   " "
  ]
 ],
 "report": "<p>The experience took place on a Friday night and I am writing this the next day. Previously to this experience I have only done weed and alcohol, though I am very experienced with both of those.  I had been interested in trying either Salvia or Shrooms for a long time. But where I live chances to get either pop up sparingly. I will call the two people with me x and y, both friends of mine.  I am a sophomore in high school.</p><p>At school on Friday I made plans to hang out with y, smoke some weed, eat pizza, and listen to some music, a typical Friday night for me.  When I called him after school he was already hanging out with x, so I invited both of them over.  My Parents were not going to be home that night as they were at a party.  Both x and y arrived at about 6:50.  Then x told me that he had just recieved some 20x Salvia extract in the mail.  x had been doing Salvia for a couple moths and had done it many times while y and I had never done it.  So we decided to smoke some Salvia. All the smoking done in this experience was through a small metal pipe bought at the local head shop.</p><p>We went outside to a ittle spot in my yard that is semi-concealded by some trees. Since it was x's Salvia we decided to let him some the first bowl. After he packed it, it looked to me like a medium weed bowl. He started to take his hit, but right at the end of the hit and after he had the smoke in for a little bit he coughed and blew the rest of the Salvia out of the bowl.  But he had already done most of it.</p><p>After about thirty second he said he was feeling some Salvia gravity that was pulling him in some direction.  He started walking. He was walking in a zig zag.  He kept leaning in the direction of the 'gravity'. After a while he sat down on a bench on my porch and asked us if we were feeling it. I reminded him that we had not smoked any.</p><p>So around 7:10, I loaded up what I thought was a small bowl.  I then took a pretty big hit keeping the lighter on the whole as x had told me too. My first thought was that this was the worst tasting stuff I had ever smoked. The worst weed in the world would have tasted better than this stuff. After about thirty seconds I felt a buzz. Meanwhile y loaded up a bowl and did his hit.</p><p>The buzz was different than a weed buzz I did not feel stoned at all. I felt like walking around. After a couple minutes the buzz was pretty intense. When I would close my eyes I would see lots of patterns going around. Even with my eyes open everything looked a little different. We went inside and just chilled on my coach. Y was having a more intense experience than I was. He talked about how green my yard was and that my house was a doll house. While sitting on the coach we all felt like we were melting into the coach. Around 7:20 I came down a bit which kind of surprised me, but I was still high just a lot less intense. The same had happened with x and y.</p><p>So I called up dominoes and ordered two large cheese pizzas and three orders of cinna-sticks(the best muchie food by the way). While we waited we listed to some music on cable radio. The pizza arrived around 8:00. By now, none of us felt high from Salvia any more. Around 8:20 x had to leave for a little bit to go pick up his sister some where. He said that he was ok to drive though I never drive the same day that I have ingested a pyschoactive substance. After he left y and I decided to smoke one bowl of weed now and some more when x came back.</p><p>We went back to the same place in the yard as before. Around 8:30 I loaded and pretty big bowl of some Jamaican Orange short hair (some of my favorite weed) which I had gotten about a week before.  I got about eight deceant hits of the bowl and I think y got about the same. We thought about smoking another bowl but I was already feeling pretty high.</p><p>We went back inside and I was feeling incredibly high especially for just one bowl of weed. We immediately ate some more pizza and listened to some music. Y claims that every ten seconds I would say, 'Woah, I am pretty high'. I remember saying that but not every ten seconds. Then y did an impersonation of me high and I thought it was the most funny thing in the world. I laughed so hard that I fell on the floor and when I was finished laughing my cheek muscles hurt.</p><p>I then started dancing to a Jefferson Starship song and y thought my dance was incredibly funny and did an impression of it which again made me laugh incredibly hard. Everything kind of looked different. After I looked at y's face for a while it kind of looked like a bird for a couple seconds. After a couple more laughing fits we ended up laying on the floor and just chilling.</p><p>X came back around 9:15 and both y and I were still crazily high. At first we tried to lie for some reason and say we had not smoked but he figured it out pretty fast. We each did about two shots of tequila which I did not really feel that much because I was so high.  We then went upstaris and listened to some more music (Hendrix, Gratefule Dead, Led Zeppelin, etc.).  Listening to music was a very intense experience. </p><p>Around 10:00 x and I played some guitar (Wish you were here by Pink Floyd) and I still had not come down. Around 10:45 x and y left. I started to come down a little bit, to a normal weed high.  I took a shower which was very nice. ARound 11:30 I came down some more and got really tired all of a sudden and just fell asleep on my bed.  The next day I feel fine. Actually I feel very good because I slept very well.</p><p>In Conclusion, I think I just touched the tip of the iceberg with the Salvia as I only had a small hit. But I think the Salvia increased the effect of the weed many times. When I was peaking on the weed I could barely hold a conversation without laughing.</p>"
}
