{
 "title": "Nausea Notes",
 "author": "Strungs",
 "citation": "   Strungs. \"Nausea Notes: experience with 5-Meo-AMT (ID 33783)\". Erowid.org. Mar 12, 2008. erowid.org/exp/33783",
 "substance": "5-Meo-AMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "AMT"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33783",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Mar 12, 2008",
   "Views: 5078",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThis is basically a summary of a handful of friends' reactions to 5-MeO-AMT, centered around nausea.</p><p>All doses were measured using the alcohol solution method.  All subjects were male, varying greatly in size and weight.  Some used cannabis during the experience, some xanax, some nothing at all.  </p><p>1. D - 250lbs - 12mg taken orally.  Small snack about 7 hours before dosing and nothing after that but liquids.  Mild nausea about 1 and a half hours after dosing.  Nausea lasts for about 2 hours and is temporarily relieved when gases leave the body.  After the nausea passes, the familiar stomach feeling of acid sets in - not quite nausea, just an indescribable odd feeling that is easily ignored.  12 hours after dosing, almost all effects are gone. (Note: cannabis smoked frequently during experience probably helped prevent nausea)</p><p>2. F - 150lbs - 8mg taken orally.  Again, small snack about 7 hours before dosing.  Same effects as D. (Note: Cannabis smoked during experience)</p><p>3. C - 170lbs - 8mg taken orally.  Same as above except nausea is noticeable throughout experience, no vomitting or diarrhea though.  Effects subsided about 14 hours after dosing.</p><p>4. L - 175lbs - 8mg taken orally.  2mg xanax taken an hour before dosing.  Same as D and F. (Note: Cannabis smoked during experience)</p><p>5. E - 170lbs - 8mg taken orally.  2mg xanax taken an hour before dosing.  Nausea and paranoia set in within 1 hour.  Uses bathroom 2 or 3 times and finally decides to induce vomitting.  By 2 hours E decides to go to his house and sleep, thinking the drug was expelled.  (Note: E's trip comes on about 1 hour after leaving but was able to sleep easily after an hour or 2 of visuals.)</p><p>6. S - 150lbs - 7mg taken orally on first occasion and 8mg on second.  First time - dosed on full stomach, diarrhea and vomit an hour after.  The drug produced no other effects.  Second time - S fasted all day and vomitted again an hour after dosing.  The drug produced no other effects.    </p><p>7. M - 150lbs - 8mg taken orally on full stomach.  Vomitting occurs an hour after dosing, but strong effects are noted 3 hours after dosing.  After vomitting, M takes half a tab of MDMA to try to enjoy the night, not thinking the trip would come on.  Both drugs became extremely overwhelming and unpleasant when M was peaking.  </p><p>All subjects that did not vomit noted feeling 'funny' for 1 or 2 days after the experience. </p><p>Conclusion: 5-meo-amt can be very uncomfortable if you have not prepared properly for it.  I find it best not to have any plans for at least two days.  If that's not possible, I at least try to clear out 10 hours for it.  Second of all, eating a small, light meal 2 - 8 hours before dosing seems to help reduce nausea greatly.  Cannabis also helps nausea, but can increase intensity of the experience greatly.  Third, I avoid combinations unless I am positive I am prepared for the (probably not yet documented) combined effects. Finally, I take a good vitamin supplement that morning and keep a good supply of Vitamin C on me, it helps a lot.  Tripping this long without eating a lot puts a heavy load on my body.  Many users report headaches the next day, probably attributed to staying up a while on an empty stomach while under the influence of hallucinogens.  </p><p>After discussing all negative effects we experienced, i should add that 5 out of the 7 said they enjoyed the experience in varying degrees and would love to try it again.  the super-summarized version of the positive effects in one word: 'electric.'  some users reported it feeling extremely clean and natural, even moreso than LSD.  some have said it feels too much like a chemical and it is not natural at all.  the 5 of us did agree that it felt very calm, gentle, relaxed, and positive when compared to the anxious 'mindfuck' LSD and other hallucinogens can sometimes produce.  This chemical can be many different things, good and bad, so I am prepared for both.</p>"
}
