{
 "title": "I'm Getting a New Cat",
 "author": "mGoLos",
 "citation": "   mGoLos. \"I'm Getting a New Cat: experience with Cacti - T. Peruvianus (ID 33803)\". Erowid.org. Jan 16, 2007. erowid.org/exp/33803",
 "substance": "Cacti - T. Peruvianus",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "25 g",
   "oral",
   "Cacti - T. peruvianus",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33803",
   "Male",
   " ",
   "Not Given",
   "Jan 16, 2007",
   "Views: 4336",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Preparation:</p><p>I ground up 50 grams of dried peruvian torch and jammed it all into 82 gel-caps. Took me around three hours, not including the swallowing, which was awful. I managed to swallow them three at a time. My stomach and my throat did not enjoy this, but I finally picked up the last two and forced them down. 41 Capsules.</p><p>Man. Tripping is hard work sometimes, I sure hope this is worth it. Price, including shipping and caps is around $40. My only concern is that I took too little, we'll soon find out.</p><p>I ate a healthy meal approx. 1 hour ago, mindset is good, I'm relaxed and enjoying my computer, setting is my appartment, I'm alone and not expecting visitors.</p><p>T-0.30: Nothing, my stomach has settled, but my throat is a little sore.</p><p>T-1.00: Stomach and general muscle-tissue are tensing a little bit, still feeling pretty good, the little 'something is about to happen'-feeling is present.</p><p>T-1.30: Getting bodychills, feeling slightly stoned, stomach tension is intensifying.</p><p>T-2.00: I feel so good, so awesome, everything is great, every breath is a new thing, every chill makes me shiver, oh my god, this stuff is the real deal.</p><p>Wow, just got an amazing chill all through my body. Typing is surprisingly easy, another chill. Amazing stuff, feeling warm all over as well. Intense body high, tingles, chills, smiling, much like MDMA just much, much more relaxed. The BIG high comes periodically with very intense chills that has me gasping.</p><p>T-2.30: Slight visuals, colours are more interesting and white walls are waving ever so softly. Tripping very hard now. Body high is intense and all empowering. Typing is still easy. Very strange indeed.</p><p>Feeling very high now, extremely high. Its so mellow, no paranoia, no nausea, nothing but extreem highness ;)</p><p>T-4.00: cacti burp...utterly disgusting. Body high can't get more intense then this or I'll start spewing chunks (graphical I know). </p><p>Music is a world onto itself. I seem to be more and more confused over everything, like I'm rediscovering the world, its not bad, its just very, very strange. Pupils are extremely dialated, the visuals is intensifying as I write, big tracers. wow. </p><p>Body high is starting to freak me out a little bit.</p><p>I will stop taking time now, I've deffinantly peaked. I was just outside taking a breath of fresh air. I never noticed but the tree next to my building is very beautiful and old. Its in full bloom now and I think about the cat I had, he used to sit out in that tree when he was a kitten. He'd get up there alright, but when it came to coming back down again, well. He died a few months ago, I really miss him.</p><p>I think I've just decided to get another cat. I'll have to read this report again tomorrow and think further about it. The main reason for not getting another cat was the fear of losing him again. I see now that that is just silly. If something's going to happen, then it's going to happen and in the meanwhile I gave that cat love and food, that was all that mattered to him. Not the future nor the past was his concern, his main concern was being loved and I loved to love him, so what is holding me back. Nothing! I'm getting a new cat!</p><p>This is an utterly mind opening, amazing experience and I feel that nothing will be the same after this night. </p><p>With shame I remember why I did this. I did this as part of my addiction. Just looking for something to get smacked out on. I recently lost my connection to hash, something I've smoked daily for years and now I suddenly see with clarity that that addiction is not so much something I have to get rid of, but a part of me that I have to accept, its in my life and most likely I'll always have that craving. I'm gonna put a jacket on and go outside, this needs more thinking. </p><p>It was cold outside. I sat under the tree and smoked a couple of cigarettes. I liked it, but sadly a little too cold and I came back inside. Time dialation is definantly present, but its not a bad thing. One hour is more like two hours. </p><p>Feeling a little nausea now. Damn! Gonna try lying down. That didn't work, I'm gonna have to do some nasty business. Throwing up was very painfull and not very successful. I did feel a little better though.</p><p>The day after:</p><p>Mescaline is not my drug, it was a really funny when it came on, but in the end I was left with visuals, nausea and self-loathing. I felt like shit and I knew I wouldn't get any sleep for a long time, I stayed up for as long as I could and then moved to my bed.</p><p>Just as feared the closed-eye visuals and auditory hallucinations were violent and scary. I tossed and turned for around 3 hours and finally falling asleep around 8 hours after peaking. I woke up only an hour later still tripping and extremely freaked out. I must've dreamed something, but I can't remember what. I managed to sleep again, this time undisturbed for around 6 hours and woke up in a trance-like state.</p><p>It feels like a sleepiness that wont leave my body. Typing is very slow. Coffee tastes funny and even though I should be, I'm not hungry. I'm just relieved that the trip is over. I don't feel like I've learned anything and all in all I just managed to abuse another drug and that's it.</p><p>...but I am getting a new cat.</p>"
}
