{
 "title": "Everything & Nothing",
 "author": "Gumby",
 "citation": "Citation:   Gumby. \"Everything & Nothing: experience with Mushrooms - P. cubensis (ID 33814)\". Erowid.org. Jan 23, 2007. erowid.org/exp/33814",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33814",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 23, 2007",
   "Views: 2695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first experience with mushrooms was at a weekend music festival, and it was good, but I didnt think that I really maximized the substance's potential. looking to try them again, I acquired about 8 grams of very good mushrooms from a friend at school. me and 5 other friends had planned to get together that weekend, and only one of us was not planning to trip. \r\nThe setting was good; friends and good music and trees and clouds on a sticky summer night, but the only problem was that to avoid having to deal with my friend's little brother and parents, we had to eat them really late at night, and, from my previous experience, I know that it is almost impossible to sleep very well while still tripping (well, at least for me). Earlier that night I had smoked one bowl of some very good pot, and was still feeling it for a long time after. A few hours later, still feeling relaxed albeit excited, we all ate the shrooms in my friends room, and sat around and talked (besides one other person, it was everyone's first time shrooming). \r\nAfter about 25 minutes, I started to notice the usual come-up effects, I.e. laughter and tingly legs, also the swaying/drunk feeling. It came on fairly quick for such a moderate dose. I was planning on having a bowl while coming up to set my trip in motion and help me relax, but I  started to feel like that would have been too much. \r\nJust like my first experience with mushrooms, it comes on very subtly at first but then hit me like a train; lines on the walls became wavy and colors intensified, music sounded better and I drifted away into a higher level of consciousness. Relaxing music was put on, and we all just sat around and laughed and talked for a while. I laid on the bed looking out the window at the purple/blue/pink sky, the trees laughing with me and all around, with the music coming from the walls. When I finally got up, I felt like I was swimming through the air; this thick gooey mass of colorless ooze, and gravity showed up at random points in time and space. At first, I started to worry about myself and how deep I was willing to go, but after a while you I just had to accept that the mushrooms are taking their course and I might as well enjoy it. Time began to die, or at least fade out until only random moments of reality could feebly to grasp my slowly-drifting consciousness. After the 'point of no return', I began to just relax and roll with it. Standing up and moving wasnt something I could will myself to do, it was a completely impulsive action. Some interesting things were said, and meanings of words were dissected (comfortable, pain, etc). Everything became quite hazy, with everything seeming so abstract and surreal, but not in a blatantly obvious way; throughout the night I felt like I was an observer in a movie, that it didnt matter what I said because the world was already ridiculous, but I still had lucid thoughts and made decisions, but they werent as interesting as what was going on Im my head, so I didnt pay as much attention to my actions as normal. \r\nThe most amazing part of all this was that it felt like time had halted; school didnt matter, homework, projects, stress, all of that was put on hold as I got in touch with what really mattered. The most comforting thoughts came from that aspect; that there was a reality waiting for me but for right now I can enjoy my break from everything; and if I ever got nervous all I had to think about was what a normal day was for me; my normal thoughts, interactions, multi-tasking, everything, whereas that night everything was separate; each thought could be digested and analyzed, each movement, each sound, each image, each touch of skin could be loved and obsessed over; and then always making sure to remember to take deep breaths of the surreal air which fueled my lungs and organs and brain and capillaries and each indescribably complicated and perfect cell throughout my body and that of every being on this earth. \r\nAt that moment, everything was beautiful and perfect; my friends, the music, the air, the time, the nothing and the everything; all in a series of moments that meant nothing except they were everything, dualism, I guess, in how the two ends of infinity converging and repelling, grasping, gnashing, fighting and brawling, and here we are, stuck in the middle of the conflict of the ultimate opposites. \r\nAt that time there were only three of us awake, sitting in almost silence in the living room, with the air form outside streaming in, and we were all touching, moving, whispering, and sharing the same thoughts at the same time. It was so beautiful, being there, and then going outside for another bowl (to try to help me sleep, because I had too much stuff to do the next day). All this accomplished was making everything so much more intense; and thinking about the words 'I love you' that I had whispered quietly in the witness of nature to an incredible person that I love so much. When I closed my eyes, my imagination took hold and I became engulfed in memories and thoughts for what seemed like eternity, only to open my eyes and find that only a fraction of a second has gone by. I managed to get to sleep at about 6 in the morning, and felt groggy, happy, but exhausted the next day.\n\n\n"
}