{
 "title": "Great Sex",
 "author": "Dr. Demento",
 "citation": "Citation:   Dr. Demento. \"Great Sex: experience with 4-Acetoxy-DiPT (ID 33825)\". Erowid.org. Jun 4, 2004. erowid.org/exp/33825",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "(capsule)",
   "  T+ 1:00",
   "10 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33825",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 4, 2004",
   "Views: 22997",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAbstract:  20mg of 4-Ac0-DiPT, taken on a full stomach as two 10-mg doses taken one hour apart, resulted in a smooth come-up and a very enjoyable trip that lasted approximately seven hours.  Effects included marked enhancement of tactile sensation, marked enhancement of music appreciation, mild empathogenic effects, and closed-eye visuals.  Insomnia was the only notable side effect, and there was no hangover the next day.\r\nReport:\r\n4-Ac0-DiPT, received from the usual source, was a grayish granular powder that tended to stick to instruments and the sides of the container.  10mg samples, measured on an electronic scale accurate to 2mg, were placed into gelcaps.\r\nApproximately six mg, left over after repackaging, was taken in 6oz of cold water.  The substance dissolved without difficulty.  A markedly bitter taste was noted.  Definite, albeit mild psychedelic effects were noted at approximately 45 minutes, characterized by slight muddle-headedness.  The effect was approximately equal in intensity to a normal dose of an antihistamine.  Noticeable effects lasted for about three hours.  There may have been some enhancement of music appreciation during this time.  There were no side effects or after effects.  \r\nAbout a week later, I had an opportunity to try a therapeutic dose.  I ate dinner with some fairly good friends, and we all decided to hang out in the lounge together.  My state of mind was far from ideal; I've had a lot of sticks in the fire lately, and the evening started off with considerable agitation because I thought I had lost my cell phone.  \r\nMy first dose of 10mg was consumed at 9pm, about one hour after a dinner of chicken and rice.  I took this along with one dose of immodium.  First effects were noted at the half hour mark, with slight non-linearity, and very slight clumsiness.  I noticed a considerable amount of 'psychedelic disorganization' by which I refer to the tendency to lose things easily, which prompts me to check my pockets every five minutes.  I noticed a slightly increased sweat production. Nevertheless, I noticed a bit of euphoria.\r\nOne hour post dose, not noticing any adverse effects, I took a second 10 mg dose.  Over the next hour, there was a very gradual come-up to a plateau that lasted for hours.  There was no detectable peak; I was still feeling pretty darn good when I finally went to bed at 4am.  About two hours after the first dose, I noticed a feeling of slight tremulousness, which felt a lot like being intensely aroused sexually.   There was no nausea, nor any other side effects.\r\nConversation was very easy.  These were among the more appropriate conversations I've had while tripping.  I met one very cute girl, and we got along well.  She was kind of 'touchy' and I noticed it felt very good to be touched.  After a while, the conversation turned to 'deep thoughts' and I took off on some tangent about Eastern philosophy.    I think I got just a little too manicky, because she took off after a while, which I thought was just hilarious.  I noticed that while speaking with people, I had a tendency to think the best of them, but I would not say that any deep bonding occurred.  \r\nMusic just sounded extraordinarily good.  There was a certain clarity and immediateness to music.   Listening to Andain's 'Beautiful Things,' it was like the vocalist wrapped her arms around my neck and whispered the words into my ear.  Selections from Schulz's 'Coldharbour Sessions' were so intense it was almost vertiginous, which after a point struck me as hilariously funny.\r\nOther than occasional trails, no open eye visuals were noted.  \r\nI made it home to wifey to tell her all about it.  She tells me I was quite perky, in an entertaining way.  I suppose I did feel very euphoric; I had a good time explaining to her what a 'contact high' is.  I found this substance to be somewhat of a stimulant, in fact is was very difficult to get to sleep that night.   \r\nI was pretty horny, something that started about an hour and a half after the first dose.  That, combined with the enhanced tactile sensation made me very interested in sex, and I am pleased to report that the equipment worked just fine.  Orgasm was not at all delayed, in fact everything felt so durn good it was difficult to make it last very long.  The act of sex was absolutely incredible, setting off intricately detailed closed eye visuals of geometric patterns, which interestingly enough were in black-and-white at first.  Later I noticed sheets and blooms of iridescent colors.  As I was trying to go to sleep, it was like cartoons in my head, which struck me as funny.  'Settle down guys, can't you see I'm trying to sleep?'\r\nI was rudely awakened about eight am -- four hours of sleep, if you can call it that -- but after a stiff jolt of caffeine, I was good to go.  I noticed no side effects whatsoever, except for a warm glow that could have been related to the absolutely mind-blowing sex I had the night before, as much as the chemical.    \r\nComparisons: 4-Aco-DiPT is less stimulating than amphetamine, MDMA, or 2C-I; but it is a stimulant nonetheless.  Like MDMA, visuals are minimal.  It is every bit the equal of MDMA as an entactogen, and is vastly superior as a sex enhancer because of the lack of anorgasmia.  It is more empathogenic than 2C-I but much less than MDMA.  Side effects were less than I've encountered with any PEA.  I've not tried any other tryptamines and in particular, unfortunately i cannot compare this with 4-HO-DiPT.  \r\nOverall, I would say that this was an enjoyable experience.  My mind-set was a setup for a bad trip I suppose, but instead I found myself in a very durable state of euphoria.  Although I was stimulated, other than mild sweatiness, I did not notice much in the way of sympathetic overload, such as tachycardia.   I would imagine that the energy surging through me (the tremulousness) could be tricky to handle if the dose were much higher though.   This is a very social experience with the potential for insights if the conversation goes that way.  It is a definite entactogen -- better than anything else I've tried -- and a modest empathogen.  Definitely worth doing again.\n\n\n"
}