{
 "title": "Milder Trip",
 "author": "Elly",
 "citation": "   Elly. \"Milder Trip: experience with Nutmeg (ID 33823)\". Erowid.org. Apr 29, 2007. erowid.org/exp/33823",
 "substance": "Nutmeg",
 "bodyweight": "74 kg",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33823",
   "Female",
   " ",
   "Not Given",
   "Apr 29, 2007",
   "Views: 13790",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>While I was stoned after smoking Mugwort and Wormwood, I started reading the entries for nutmeg. I'd heard about it before and had bought some powdered nutmeg from the supermarket to try out some time.</p><p>I tried to make up a dose using a litre of strong ginger cordial (mostly to mask the taste) with about 15g of the ground herb. About two thirds through the vile substance I came out of my stoned haze and decided this was a stupid way to blow my evening and threw the rest out.</p><p>I forgot about the whole thing and sat down to eat, watch Memento, which I had seen before, on tv and finish an essay. About three hours after I taken the drink and half way through the movie I started getting really confused about the plot and the characters. I'd managed to work out a lot more that I assumed that I had missed the last time, but it all took me much longer to do. And each time I turned back to write my essay in the breaks I'd completely forget what I was doing and found myself unable to retain recent memories (which if you've seen the movie, is the whole point of the story). Only after the movie had ended and I got up to have a shower did I remember the nutmeg and suspect it had kicked in. But I honestly couldn't tell for about forty minutes of standing in the shower just staring blankly. Every thing that passed through my head just disappeared straight afterwards and could not recall it at all. I then started worrying that my skin wasn't clean and could really feel any oils still on me. I scrubbed furiously for a while, until I just forgot about what I had been doing.</p><p>Once I'd worked out what was going on I started feeling better, and the memory thing slowly lessened. However, I started picking up small noises, which sounded much louder than they should have from other flats and began freaking out at being home alone, locking the doors and watching my back. This thankfully only lasted about half and hour, after which I sat down and watched cartoons that I've seen a hundred times before.</p><p>If I had been high on pot or the wormwood/nutmeg mix, I know the shows would have been much funnier than usual. On the nutmeg, I didn't feel this at all. I felt really placid now and the cartoons felt really disjointed. I couldn't remember the scenes I'd just seen, but I started picking up more about the episodes that I hadn't noticed ever before. I began hearing lines I'd missed earlier. At one point it flashed through my mind that maybe something was talking to me through them, but I forgot about it just as quickly.</p><p>Through the whole thing and well into the next day my mouth was really dry no matter how much I drank, just like all the other entries had warned. All up the actual feeling was like being lightly stoned on pot without ever getting the giggles. It was a good feeling all up. The paranoia throughout was a little unsettling, especially since I've never had that with other drugs, but I can't tell if I'd get that next time or if it was just the result of the movie beforehand. I'd do this again, but I would definitely plan better what I was doing before.</p><p>After experiencing it myself I suspect most people have had bad results through simply taking too much. I'd deliberately taken less because I certainly didn't want to be out of it for 24 hours like some accounts, and I thought I should underestimate what I needed since it was the first time. I would never take more than about 15g of it, even with my body weight, considering what an effect just 10g had on me. It had taken about three hours to start and I fell asleep only a coulple of hours into it, although I could still feel it slightly in the morning.</p>"
}
