{
 "title": "Enhancement of Reality",
 "author": "sepulfreak",
 "citation": "   sepulfreak. \"Enhancement of Reality: experience with 2C-D (ID 33837)\". Erowid.org. Jun 4, 2004. erowid.org/exp/33837",
 "substance": "2C-D",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "2C-D",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33837",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 4, 2004",
   "Views: 12973",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Experience: First time with 2C-D. I also have experience with Mescaline, 2C-I, 2C-E, LSD, LSA, Mushrooms, 4-HO-DiPT, Salvia, DXM, Ketamine, MDMA, MDA, Methylone, and Cannabis as for the 'mind' drugs. </p><p>Mindset: Very relaxed. </p><p>Method of dosing: Liquid measurement with distilled water. </p><p>Trip Dose and Duration: 40mg, 6:00PM to 10:00PM </p><p>Medications: None </p><p>This was my first time around with the Phenethylamine 2C-D.  I'll have to say I was quite impressed.  It was me and my friend 'X' that were planning on using it together, since me and him have a special mind connection with philosophy, psychology, and such, and it seems as though 2C-D has a certain deep psychological social component to it.  </p><p>Anyway, me and X both took 40mgs of 2C-D orally at his house at 6:00PM, and we headed to his dock, as he lives at a lake.  There are many other people that live around this lake, and it is just such a beautiful, homely place.  We slowly stepped into deep conversation as the chemical started providing a comfortable stimulation.  There was a very significant feeling coming up in the body.  It was very pleasurable, yet there was definitely a mildly uncomfortable aspect at times, most comparable to that of around 13-14mgs of 2C-I.  In fact, the whole experience was somewhat comparable to 2C-I, yet there were many differences, especially when talking in terms of depth.  </p><p>There was a feeling brewing up in me that felt very entactogenic at times, but instead of the feeling rooting itself within, and rushing out like a flood as with MDMA/MDA, it was mostly from external stimuli.  The feeling was coming from nature itself, and it was flowing into me instead of rushing out.  The mental aspect was very light, yet very profound at the same time.  It was its greatest quality.  There was a beauty in everything, reminiscent of that which is seen from the 2C-I experience, but there was much more psychological thought floating around.  Ideas and conversation were more important, and my senses, especially sight, hearing, and smell were greatly enhanced.  I wasn't very far from reality.  In fact, it seemed to be an intense enhancement of reality instead of an emersion into the fantasy world.</p><p>As the experience fully manifested itself, I noticed that there was much emphasis on the physical feeling.  With 2C-I, I feel a strong feeling within the body, both positive and negative, yet the positive isn't anything profound or 'special.'  With 2C-D, there was a very 'special' feeling in the body.  It probably seems odd that I haven't yet mentioned visuals.  Well, the visual aspect was quite in the background.  Don't get me wrong, there were definitely visuals, but I didn't really have many full hallucinations.  There was a very thin patterning around leaves and trees, the wind rippling the water across the lake was extremely fascinating, and there was a time when I was talking to X, with the woods in the background, and the green leaves were patterning behind him.  The patterns turned into star shapes, and many geometrical patterns, but it never took the form of</p><p>Tryptamine/LSD style visuals which are what this sounds like in a basic sense.  It still had that 'deep' Phenethylamine feel.</p><p>Sometime during all of this we smoked a bowl of high-grade Cannabis, and as always, it synergized awesomely.  It kicked the trip (if you can even really call it that) up a notch.  I say this, because there was no 'classic' feeling of tripping.  It was all a play on the senses and psychological thought.  I can't imagine the normal LSD/mushroom tripper greatly enjoying this.  However, I am very open-minded towards things, and I take whatever the experience has to offer.  </p><p>Next, X's girlfriend 'L' stopped down and had a puppy with her.  There was a certain connection I felt to the animal, yet it wasn't quite as profound as one might experience with mushrooms or MDMA/MDA/Methylone.  Also, L's friend 'S' and her boyfriend came down, and the social aspect of the drug started really working.  I found myself very comfortable around people, even though I didn't know the two other people there.</p><p>Me and X climbed back up the steps leading away from his dock, and we sat in the grass to observe the people there.  L and S were having a conversation, and X was telling me how S is L's only real friend.  S's boyfriend was fishing, and he caught a couple Crappy, which made me smile because I am fond of fishing.  Anyhow, as I was analyzing this conversation going on, I realized that there was a bond/connection between the two girls that neither me nor X could really understand.  It was the magic of friendship.  X looked at me and asked if I understood what they were talking about and laughing about, and I calmly said 'no.'  We had plenty of good vibes and emotional feelings towards it, and I imagine he felt it more so than me because L is his girlfriend.  It was an awesome introspective moment.  Me and X spent a little more time talking about those unexplainable things in life, and just some of the things that make people happy and make life worthwhile.  </p><p>Most of the trip was over by 10:00PM.  The wearing off was much like the coming up, though it was very relaxed instead of stimulating.  I should also mention that the coming up was slow and easy, much like the other Phenethylamines Ive tried.   </p><p>Overall, 2C-D is definitely not the 2C-E that I've been used to using lately.  2C-D is both light in intensity of experience, as well as light hearted, while still remaining much deeper than 2C-I.  2C-E is very serious, and can really show me true aspects of life that I sometimes don't really want to see.  It is dark, and the depth of things pierce through me.  2C-D seemed to show me wonderful things, things that were pleasurable to look at.  It seemed to be more on the side of the good things in life.  Like I said, it was an enhancement of reality.</p>"
}
