{
 "title": "Various Insufflated Experiences",
 "author": "Flying Finn",
 "citation": "   Flying Finn. \"Various Insufflated Experiences: experience with 2C-I (ID 33858)\". Erowid.org. Mar 4, 2008. erowid.org/exp/33858",
 "substance": "2C-I",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "insufflated",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33858",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 4, 2008",
   "Views: 8032",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wanted to include my report due to the less researched method of administration, insufflation. I have also tried oral and smoked doses.</p><p>I came into possession of 500mg (verified by mg scale) of 2C-I obtained from a reputable rc vendor. This was dissolved into 100ml of vodka (5mg/1ml)and evaporated to obtain desirable and accurate doses.</p><p>I am 30 years old, a smoker and enjoy having a drink. Previous experience with MDMA, LSD, Mushrooms, Meth, Weed and various others. I am not on any medication but drink coffee and smoke cigarettes.</p><p>I've yet to research oral doses more fully, but have tried it in the 10mg range (next time I'll try 20mg), which I compare to 3-5mg insufflated. I've tried smoking 5-10mg with subtle effects, and found it wasteful. I have yet to vapourize it cleanly. It does leave a black residue-yuck.</p><p>I found that 2.5-5mg insufflated is a pleasant threshold dose that would able me to go about my daily activities. This would give me a sense of wellbeing and happiness that lasts a few hours. I found synergy with alcohol and weed. While drinking I found that it is beneficial to drink water in between to combat dehydration and a possible headache.</p><p>My last trial was with 5x5mg insufflated over a period of 10 hrs. I would typically boost every 1-2 hours to chase and increase effects. On my last line I experienced shifting/swirling/digital effects for the first time, that were intriguing and by no means overpowering. Insufflation has always been accompanied by euphoria and often with a MDMA type body glow.</p><p>The benefit of insufflating this product is the fast come up. Typically a few minutes to 1/2hr to peak. I have not tried insufflating larger amounts and would not attempt doses over 7.5mg due to possible nausea and other unknown side effects.</p><p>I really enjoy 2C-I and plan to experiment with oral doses in the future, with a further 5mg insufflated if need be. I find 2C-I quite habit forming insufflated, in that I feel a need to redose to maintain or increase the experienced high. There is also some tolerance developing with daily use. I did it on 4 out of 6 days. It just feels too good.  Not enough is known about 2C-I to warrant reckless experimenting. Nor is it a good idea to experiment daily. Who knows what neurochemicals it may deplete or if it affects the immune system.</p><p>To date I have not experienced a hangover with 2C-I but came up with the flu a few days later.</p><p>For me it increases sexual pleasure (more primal)and is a great mood enhancer. I enjoy weed and alcohol while on it and found it to synergise incredibly with BZP. I plan to experiment further.</p><p>My 2 cents.</p><p>Take care everyone and experiment in moderation. Thank You Shulgin.</p>"
}
