{
 "title": "The Pleasant Nut",
 "author": "Lescuyer",
 "citation": "   Lescuyer. \"The Pleasant Nut: experience with Nutmeg (ID 33879)\". Erowid.org. Jun 22, 2007. erowid.org/exp/33879",
 "substance": "Nutmeg",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "6 tsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 33879",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 22, 2007",
   "Views: 4103",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>When I discovered nutmeg by diverse articles on the internet, it seemed like two separate substances were called nutmeg. One that totally wreaks havoc in your digestive system, brain, nerves, muscles and every other part of your body; and another that gives a pleasant, long lasting feeling of bliss at the expense of a terrible taste. I seem to have tried the second onewithout the bad taste.</p><p>The trip:</p><p>4h00 to 4h30 pm: My friend and me ground up a couple of fresh nutmeg and prepared to eat three tablespoons of the stuff. Then, before we did it, we just figured out that six teaspoons would be so much easier to eat. It sure was! We are still wondering what is all about its mythical bad taste because it is, in fact, mostly pleasant with a glass of water between each spoonful.</p><p>4h30 to 8h30 pm: Nothing is happening, we remain patient while watching a movie. After that, we made an important discovery that definitely gave a nice twist to our buzz a few hours later - my friends dads vinyl discs collection.</p><p>8h30 to 9h30 pm: Light, pleasant buzz. It seems like we are getting slightly dumber and laugh about it. We drink water on a regular basis to reduce the side effects.</p><p>9h30 to 10h00 pm: The showdown. Friends come over. We felt like we were still acting quite normally, yet the day after, we were told that it was far from being so. We were lost, jumping from an idea to another, laughing all the time while telling puzzling jokes. It seems like we were always talking about music and the discs (i.e.: Look! This one is just hilarious! Oh, and that one is amazing!). Our two friends parted half a hour later.</p><p>10h00 to 11h30 pm: The music keeps playing and everything is magnificent or magnificently funny. We feel deeply relaxed and always dumber. Short-term memory swiftly fades away, which creates hilarious situations like forgetting what the two of us were talking about even if we were in the middle of a conversation. We smoked a bit of pot in a hookah pipe and kept drinking water regularly through all that time.</p><p>11h30 pm to 1h00 am: Another friend comes by and tells us how freaky we look. We try to talk with him, hold a conversation but it is almost impossible to do so due to memory shortage. It is a very funny experience. Later, I got incredibly sleepy, too relax to stay awake. I fell asleep on the couch, woke up a few minutes later just to sleep again until early morning.</p><p>6h00 am: The awakening. Horrible hang-over? Head-ache? Nausea? None of these came up, I felt incredibly fine and relaxed.</p><p>Have fun!</p>"
}
