{
 "title": "Historical Notes",
 "author": "Pharm",
 "citation": "   Pharm. \"Historical Notes: experience with Amphetamines (Adderall) (ID 33877)\". Erowid.org. Nov 11, 2006. erowid.org/exp/33877",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Amphetamines"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33877",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 11, 2006",
   "Views: 41599",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a report detailing observations about my Adderall experiences. Just for background info, I'm a 17 year old guy. I've used cannabis, alcohol, LSD, mushrooms, DXM, various amphetamines, various pharmaceutical opiates, heroin, cocaine, barbiturates, and a number of other miscellaneous substances and pharmaceuticals.</p><p>I began using Adderall recreationally about a year and a half ago, buying it from friends who had prescriptions. I liked it because of the increased energy, concentration, and motivation it provided me. I soon devised a plan to get my own prescription for it by using my diagnosis for ADHD from 4 years ago. This was easily done,</p><p>As I started taking it everyday (20mgs of Adderall XR every morning), I realized that it was changing me. I wasnt using it recreationally anymore, rather, I was using it to treat a disorder that didnt bother me anymore, at least not as badly. I had learned to cope with my ADHD and work around it. I'm usually a very laid-back, relaxed, easy going person, but the Adderall made me feel more uptight and negative. I can't put my finger on it, but I didnt feel right. My girlfriend noticed it too, as well as a few other friends. It still helped me with school work and whatnot, but I didnt like the idea of being dependent on a pill to succeed. So I cut back, then completely stopped eating it, got my dosage raised to 30mg XR, and began selling it. I wonder how much Adderall that gets prescribed actually gets eaten by the person its prescribed to.</p><p>I only too it once after that, about 6 months later, because my parents were watching me when I was supposed to take it and I couldnt get around it. Much like before, I hated the way it made me feel. To me, Adderall became the 'Anti-Chill'. However, about 3 months ago (5 months after that time I just mentioned), I decided to see how it would make me feel again, this time not under pressure by my parents. This time it wasnt that bad, it aided my school work a lot too. I started taking it once or twice a week, then a little more, and finally every weekday except sometimes not Friday. Throughout my usage of Adderall, I have concluded a number of things:</p><p>Adderall: In the beginning of the experience, I feel very talkative, very positive, and a bit happy. After the first hour, I feel a rush of energy. Not as much physically, more mentally. I feel like I can do all the work I have to do in a day in an hour, and I usually try to. Sometimes if I dont have anything to do, I'll do other peoples work. But mostly I just end up drawing. I've drawn some of my best pictures on Adderall. I cant say the same for my poetry though. The rhymes come more easily but I hardly ever actually feel inspired to write anything, except reports like this. Its like the Adderall blocks that part of me, which is part of the reason I didnt like it before. Every so often, a slightly euphoric rise hits me and motivates me. My heartbeat definitely increases, as well as perspiration. Pissing is harder sometimes. Random colors and specks of color swirl around my vision. Nothing like the hallucinogens, just small visual disturbances. Maybe thats cause of the pupil dilation. </p><p>Sometimes I get vertigo and lightheadedness when I stand up. Theres nothing too negative anymore, but I still dont feel as talkative or sociable. It's easier to feel annoyed. My wits are quicker and thought processes faster. Sometimes time it feels like time too some uppers too, and is speeding along with me. I'll be concentrating on doing something then sudden realize an hour has gone by. All of those things continue throughout the experience, with random moments of anxiety or dysphoria, but they dont last long. During the come down, the energy wanes and I feel much less motivated. On Mondays, after not taking it over the weekend, its kind of hard to get to sleep, but not too bad. Nothing like coming off coke, or what I imagine a methamphetamine come down would be like. One thing I have definitely noticed about Adderall, and other amphetamines is that they don't give me some sort of magic, temporary abilities. They simply make it easier to use the skills I already have, and makes me want to use them. </p><p>Notes on Combinations</p><p>At first, using other substances while under the influence of Adderall worried me. But after a while, I got tired of not being able to use other drugs 5 days of the week, and I also got curious, so I said what the hell and started experimenting. About the only thing I wouldn't want to mix Adderall with would be any sort of hallucinogen or other strong stimulant such as cocaine or methamphetamine. </p><p>Adderall and Caffiene:</p><p> * Faster Heartbeat</p><p>* Can't keep limbs still (tapping feet, fingers, etc)</p><p>* Increased appriceation for music</p><p>* Desire to do everything at once</p><p>* Easier to relax, socialize</p><p>* Head and body have subtle tingling, like I feel the energy inside me</p><p>Adderall and Alcohol: </p><p>*Slight confusion and paranoia</p><p>*Intense desire to talk</p><p>*Strung-outness</p><p>*Unbalance of feelings(torn between feeling stimulated and feeling drunk, they dont mesh together well)</p><p>*Uncomfortable feelings in body(the subtle tingling I mentioned earlier becomes too overpowering, and feels nasty)</p><p>\tSome of my friends have told me that they really enjoy mixing alcohol and Adderall. Just goes to show how everybody feels and interprets things differently.</p><p>Adderall And Cannibus: </p><p>Anytime I'm tired of feeling the Adderall, I light up a nice bowl of herb. It significantly alters the adderall's effects, or at least how I perceive them.</p><p>My motivation to do everything at once and to do a lot of work decreases. If I HAVE to do something I'll bust out the good work ethic just like on Adderall, but otherwise I prefer not to. I can definitely relax more easily. Thinking is slower but by no means harder. Memory decreases a bit The usual effects of marijuana are present, but not as intense. However, the initial high from the weed feels different, a lot more strong in the body. The feeling lingers throughout the high. Much less paranoia, unless I get caught in one of those 'random bursts-of-negative-feeling' moments on Adderall. Concentration isnt affected very much, usually I notice things on weed I wouldnt otherwise pay attention to but I soon forget them, but combined with Adderall, I stare at/think about whatever I noticed for a long time, then suddenly realize I've been zoning out. Overall, cannabis helps to balance out the Adderall if your not doing anything important.</p><p>Adderall and Opiates:</p><p>Mostly, the Adderall decreases the mental part of the opiate high, but nothing major. Not like a speed ball or anything.</p><p>Adderall and Barbiturates: They basically just neutralize each other, leaving me feeling kind of weird, and still a little drowsy from the barbiturates. However, if I take the barbituate after the Adderall has run its 6 or 12(for XR) hour course, then it makes it wonderfully easy to fall asleep.</p><p>Adderall and Valerian Root (Valeric Acid):  Okay, Valerian isnt really a drug, and doesnt change much psychoactivity except by making me more relaxed, sleepy, and causing vivid dreams. When taken after the main effects of Adderall are over, Valerian makes it much easier to get to sleep.</p><p>I still love to chill but I've got to make sacrifices until the school year is over. Adderall has lost all its recreational value/appeal to me. Being strung up and wanting to do a lot of work doesnt seem like very good recreation to me.</p>"
}
