{
 "title": "Make It Stop",
 "author": "Alice",
 "citation": "   Alice. \"Make It Stop: experience with Morning Glory Seeds (ID 3390)\". Erowid.org. Oct 20, 2000. erowid.org/exp/3390",
 "substance": "Morning Glory Seeds",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   "  T+ 1:00",
   "275 seeds",
   "oral",
   "Morning Glory",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3390",
   "Female",
   " ",
   "Not Given",
   "Oct 20, 2000",
   "26081",
   " "
  ]
 ],
 "report": "<p>\nI bought a coffee grinder from Wal*Mart and 6 packages of Heavenly Blue seeds.  I ground 4 packs up at work and soaked them in a cup of warm water for 6 hrs, stiring every 15mins or so.  Before I left to go home I took 2 Dramamine, thank God.  *I STRONGLY URGE YOU NOT TO TRY THE SEEDS WITH OUT MOTION SICKNESS PILLS!*  When I got home I used a tea strainer to filter the bulk.  Then I used a straw to drink the putrid liquid quickly.  I had a tape of The Simpsons where Homer eats the Guatamalan insanity peppers and trips out, expecting to fry like acid or shrooms.  I've done these a few times, and smoked pot quite often.  </p><p>After maybe an hour I started to feel dizzy.  I was laying out in the living room, and knew I needed to get to my room.  My body did not want to move.  I got in my bed under the covers.  It slowly got worse.  I had to shut my eyes because light hurt.  But I had to keep the tv on, because I couldn't stand the thought of silence.  I was a little scared where my mind would go with out a distraction.  The tv was all I foucus on besides how sick I was.  I wanted to take another motion sickness pill, but was afraid of what might happen.  I was thinking what if I started to fry on those on top of the MG seeds?  I had no visuals whatsoever.  </p><p>I felt like someone had taken my brain out of my body and put it on the Gravitron.  If you don't know what that is, it's a ride a our fair.  You stand around against the walls in this big round room, and then it spins around super-fast in place.  Then you start to slide up the wall.  It's exactly like if you were standing against the inside of a washing machine on the spin cycle.  I couldn't stop feeling like this.  I knew it was only the motion sickness pills that were keeping me from puking.  </p><p>Eventually, they stopped working so well, so I did start puking.  This only helped for about 5 mins at a time.  But it did make my stomach not hurt so much.  So I decided to take a few hits of weed.  I would suggest you have this around too.  This helped me get a grip on it enough to stand up straight at least, until I could lie back down.  I have to smoke out my window, because I live with my parents.</p><p>I did ok.  I wanted to fall asleep, so this would end, but I couldn't.  Star Trek Voyager had been on at sometime, and it seemed to last 3 hours.  It made me feel gross to move, but at some point I rolled over to see if the show really was still on, and it was.  It had only been 10 minutes.  I also felt like gravity was pushing on me very hard, like it was hard to breathe.  I remember being afraid if I fell asleep I would stop breathing.  Then when Voyager was over, I still kept hearing it, even though it was Saturday Night Live.  I tried to make myself pay attention to it, so I would stop thinking about dying.  </p><p>Overall this was the worst thing I've ever did.  The body high was awful feeling.  I may try eating natural seeds straight out of the plant, because maybe it had something to do with coated seeds.  But I'm not in any hurry.</p>"
}
