{
 "title": "No Time but Now",
 "author": "Pharm",
 "citation": "   Pharm. \"No Time but Now: experience with Heroin (ID 33914)\". Erowid.org. Mar 28, 2007. erowid.org/exp/33914",
 "substance": "Heroin",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "0.5 capsls",
   "insufflated",
   "Heroin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33914",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 28, 2007",
   "Views: 52233",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ahh, yet another report. These things are becoming like a religion to me or somthing.</p><p>About ten minutes has passed since I stuffed a good chunk of raw heroin up my nosehole. Since then, I have been overcome by a beautiful rush of euphoria. Warmth encompasses my body, spreading throughout my limbs, but more importantly, my mind. No, the warmth hasnt entered my mind...somthing else has. Numbness perhaps? This night represents the culmination of my hopes and dreams of the last few days. No dope has entered my being for quite awhile, maybe two weeks at most. Two caps were insufflated 3 nights ago, but my noseholes were clogged and ruined the experience. A few oxycontins also went up a week or so ago, but this is the real deal. No cut dope in caps, no pharmecutical substitute. This is raw heroin, digging deep into the core of my being, causing raw pleasure. </p><p>Heroin has always given me a sense of wonderful feelings over my body, but a sense of dark, mysterious nothingness in my mind. Its not that I stop thinking, I simply reach a deeper level within myself. LSD and most hallucinogens broaden your mind and thoughts to cosmic levels beyond yourself, but it seems that heroin opens a door to places deeper in yourself. I feel at peace with myself and everything around me. I've had a long hard week at work, but it doesnt matter now. Nothing matters now, except the very concept of 'now'. 'Now' is the only thing I can prove...my memories fade, my future is foggy and could happen any number of ways, or not at all. All my conciousness percieves is this moment I am in, which is always gone as soon as it is there. </p><p>If memories are simply our interpretation of what we percieved in moments before now, and the moments we are in now always leave, how do I know this isnt a memory? Am I constantly one step behind my life? Things happen, THEN they go through my senses to my brain, perception isnt simultaneous. So for all I know, things are happening 'now' but I'm still stuck percieving the moments prior to now. Geezus man, that was more LSD than heroin it seems. Anyway, the raw heroin has produced raw pleasure. Oh I already said that. Looks like a memory was reproduced in the 'now'. But its gone now too. How do I know it wasnt the same memory or moment and I was stuck in it? Hell, maybe i still am man. </p><p>The storm outside reflects my inner feelings. At first, a storm seems loud, violent, scary, and harsh. But it has a dark sense of beauty to it. All dark things are beautiful to me. Thats part of the reason I started doing heroin the the first place. The storm may sem scary but its just nature repleneshing itself. its just another part of Nature's constant cycle. Like day and night, joy and melancholy, euphoria and dysphoria, light and dark, all are both two halves of a great whole. Am I half of something? if so, which half? The storm seems to mirror my inner being, having been reached with the aid of the dopeness. I am both dark and light inside. Both appeal to me, just in different ways. By light and dark, I don't mean 'good' and 'evil'. To me, those are just a matter of interpretation, of opinion. Like the storm, like my inner core, light and dark are more fundemental things in life. they are deeper, more subtle, but still important parts of life. </p><p>Maybe life and death are just two more halves. If so, what is the whole? Man, heroin definitly puts me in tune with the deep, primal, basic things in life. If LSD and its hallucinogenic cousins are 'thinking' drugs, then heroin (and its opiate cousins such as morphine, hydrocodone, oxycodone, fenatyl, etc., but mostly heroin) is definitly a 'feeling' drug. Its not just feeling 'good', not just the rush, its about feeling the things we usually don't because we are too busy thinking about things, analzying them, braking them down, trying to understand everything. What I've learned to do is stop thinking so damn much and just exist. Before we learned a language, we couldnt think in words. Part of the magic of childhood was being able to percieve entire ideas without breaking them down and labeling their parts with words. Words put definite, closed-minded definitions on things. When I think without words, or just exist as I said, I simply feel whats going on. I get the entire  spectrum of an idea without having to think about it. </p><p>I think thats why heroin puts me even more in touch with the feelings, away from the thoughts. I won't think unless I have to, but when I do its like I already know what i'm about to think. Thats probably becuase I already had the whole idea, the whole expanse of it, and the sum of its parts. Thinking is useful somtimes, but a lot of people need to stop thinking so much and simply get in touch with the quieter, subtler, more hidden things in life. They're only hidden because we're too busy to notice them, or to take the time to feel what they have to offer. </p><p>You dont need heroin to do this, or any substance, I just had a revelation about it tonight, thats all. Isn't it ironic how I had to express my feelings through words to get you to think about not thinking so much? Aah, Paradox is beautiful. Heroin has always given me a sense of paradox, and of oblivion. But theyre not bad feelings, I simply accept them as the parts of the sum that I'm feeling and move on. Time for a tad bit more dope then the rapture of sleep, enhanced by the itchy warm dope love.              </p><p>                                       Peace,</p><p>                                         The Pharm</p>"
}
