{
 "title": "Pass Out...",
 "author": "dudeguy",
 "citation": "   dudeguy. \"Pass Out...: experience with Hyperventilation (ID 33938)\". Erowid.org. Jun 11, 2004. erowid.org/exp/33938",
 "substance": "Hyperventilation",
 "bodyweight": "145 lb",
 "header": [],
 "footer": [
  [
   "2003",
   "ID: 33938",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2004",
   "Views: 15932",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nTrying this technique came to me at the beginning of 2003, my friend recommended a fun thing to do where he told me to sit in a chair with my head between my knees and hyperventalate for 30-40 breaths or until I became very light headed then put my hands in a v shape at the heels of them and strangle myself, after a few seconds I should be getting this incredible feeling of a bloodrush and weakness and to keep hanging on to my neck. Then I'd wake up.</p><p>I asked him what he meant by just wake up, he told me to just try and I'd see. Well I told him to fuck off, I didn't want to die. After being assured many times I would be fine I said maybe one day I'll try it. A few days later I was sitting around bored with absolutley nothing to do so I thought 'screw it you only live once'. So I sat on the couch, put my head between my knees and started taking deep quick breaths, after 20 or 30 I felt already like I would pass out so I stood up and put the choke hold on, I remember the room got fuzzy and I felt weak, then I woke up from the most indescribable 10 second dream, it was like all the noise around me was still audible but nothing was comprehendable, it felt like a struggle back to conciousness and when I did come to I was like 'Hey why the hell am I laying here asleep?...' then within a few seconds everything comes back to me and I was back to normal. Very awsome experience worth at least 1 try.</p><p>Since I first started doing this I've done it countless times with no side effects what-so-ever. All in all the dream I have while under is an incredible experience, probably not as good as acid, DXM or a good datura trip (I don't do drugs so this is what I do when I'm bored, other than the odd drink or two) but its free, legal, and low risk.</p>"
}
