{
 "title": "Overrated, a Drug for Tossers",
 "author": "Sam",
 "citation": "   Sam. \"Overrated, a Drug for Tossers: experience with Cocaine (ID 33933)\". Erowid.org. Jun 25, 2007. erowid.org/exp/33933",
 "substance": "Cocaine",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 33933",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2007",
   "Views: 4669",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have tried a lot of drugs, but I only use a handful now and again. These are cannabis, mushrooms, ecstasy and my drug of choice, LSD. It was on this drug, having a very fun day chilling with friends in the park that I pigeon holed the different drugs I'd done. \r\nI've tried cocaine on 3 separate occasions. It is a drug surrounded by a lot of hype and I wanted to see what it was like for myself. The effects each time are quite subtle, which isn't a bad thing. Talking became easier, and I simply felt good just relaxing. I felt more confident-it seems quite a selfish effect.  On trying it with two other friends, 1 friend (who did twice as much as us my other friend and I) became irritated. She couldn't stop walking everywhere and after saying its a good idea to treat coke with respect, as it can be quite addictive, she became very irritated and left the room to the surprise of my friends and I.\r\nI wouldn't say I have an addictive personality. I don't smoke and only drink occasionally. I have no urge to repeat the experience with cocaine. It is massively overhyped and expensive. Coke heads often have something not right in their personality that allows their obsession to form in the first place. I have reports of family friends getting enraged loosing what could be only a few milligrams into the carpet. \r\nCocaine appears to me as an overly selfish drug-Im mainly worried about how you feel. Ecstasy is an overly selfless drug-Im mainly worried about how everyone else feels. On acid there is a perfect balance between these two extremes-I want myself and my friends to be happy.\n\n\n"
}
