{
 "title": "Nirvana",
 "author": "Jaesboxer",
 "citation": " Jaesboxer. \"Nirvana: experience with 2C-B & LSD (ID 33936)\". Erowid.org. Feb 20, 2008. erowid.org/exp/33936",
 "substance": "2C-B & LSD",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "2 ",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   " ",
   "insufflated",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "33936",
   "Male",
   "",
   "Not Given",
   "Feb 20, 2008",
   "10026",
   " "
  ]
 ],
 "report": "<p>I have been using hallucinogens recreationally for the past few years.  Through a friend of mine who has unfortunately passed away, I have had the opportunity to utilize many different drugs.  I have experiences with LSD, Mushrooms, DMT, AMT, 5-Meo-DMT, Salvia, Cocaine, Methamphetamine, Heroin, Ketamine, GHB, MDMA, PCP, DXM and, of course, Cannabis.  My experiences have ranged from one near ego death, to mystical journeys through time.  </p><p>After recently converting to BUddhism, and following my friend's overdose death, I have been doubting the very nature of reality.  I have always considered myself a romantic at heart and have always believed in good humanity and the beauty of the human soul.  I have decided, for personal reasons, to quit hard drugs.  It was with this mentality that yesterday I discovered, on what is probably my last trip, a truly lifechanging understanding.  </p><p>I cannot document this very well, for it was not my original intention to do so, and given the hard nature of the trip, certainly the hardest I have ever been on, I would be lying if I said I had any conception of time or individual effects.  For my last trip I chose 2-CB, a drug I have being trying to obtain for quite some time, along with acid.  I have read reports about the painful, but fruitful results of insufflating 2-CB and had decided to do this in order to realize the full potential of this psychedelic cocktail.  </p><p>The setting was my friend's basement, a place I have often tripped in before.  I arrived at around 8:00, only to find him in his typical tripping moodset, along with dimmed lighting and gentle classical Adagios playing on the radio.  I am not exactly certain of the dosage of 2-CB, but I do know I took 2 tabs of acid almost as soon as I walked in the door.  I was truly looking to trip hard.</p><p>Before the acid could kick in, I quickly insufflated the 2-CB, assuring myself that however bad the pain was, I could handle it.  Holy fuck!  Within a few minutes I was on my back, screaming, my fingers up my nose trying to bore the powder out of the nasal passages.  I was certain I had done permanent nose damage, although now it seems to be fine, despite being a little swollen.  My friend insufflated his line, and within a minute, joined me in screaming.  </p><p>Just as I was noticing the pain was starting to subside, I also began to notice the first feelings of fear I get at the start of any trip.  I got up to try and walk and calm myself.  My heart had started pounding.  I noticed a huge tension in my stomach, and suddenly the world was filled with pain.  I ran to the washroom and vomited for several minutes.  Feeling better, I returned to the basement to let the drugs take affect, my final hurrah in the world of psychedelics.  </p><p>I cannot give exact details as to how it came about, for a uncertain period of time, I existed in a realm of ethereal consciousness.  I don't think I even breathed.  The world was changing.  Immense masses of colour danced on the waves of the music.  My friend was saying something, but the words sounded almost demonically unreal.  My next realization was that I had been folded out of reality and was existing in the space between atoms.  I was dark matter.  I closed my eyes but could still see through my eyelids.  </p><p>For one instant it occured to me that my last trip should be something special, so I pushed.  I pushed my mind to think, to remember, to experience.  It was an action equivalent to being launched out of a missile silo.  I was flying through colours beyond reality, colours that had no right to exist.  I was in limbo, purgatory, a world between worlds.  In the mass of twirling realities, I saw my entire life.  And I truly mean my entire life.  The moment of my birth seemed clear to me, and every second up until this very minute appeared, no as a chaotic series of events, but as a path already laid.  </p><p>Then it happened.  A sudden moment of pure energy and merging.  I saw beauty as a pure form.  Thoughts, tastes, smells, sounds and sights were no longer seperate.  They merged in a explosion, as though every beautiful and exquisite moment of my life had been taken, stripped of defining characteristics such as person or place, stripped down to a pure form of love and peace, and then condensed into an infinite point.  This point was me, and I felt bliss in every bone of my body.  At this moment, I was exploding with love for every single little thing in the entire universe.  And I felt it in me, the pure beauty.  I cannot describe it in one billionth of its glory, but when it hit me, I lost all sense of self and reality and thought.  I simply was.  I was the whole world, I was god.  Imagine if all the wonderful things in your life were made of the same essence.  Now imagine the essence returns to the source of its origin, and you discover its source of origin is your own mind.  </p><p>This nirvana like state lasted for no perceivable amount of time.  It was at once a thousand years and a millisecond.  And then it was shadow.  As though my mind had been exhausted by this discovery, it retreated into a state of psychedelic stupor.  I arose from this state several hours later, suffering from what I would characterize as the level of a strong acid trip.  </p><p>Now, I still cannot believe I saw what I saw.  I think this really is my last trip, because nothing could ever, ever top this.  This particular mixture served me as a window into the very essence of my soul.  And now, I sit here, drug free, and filled with a glowing feeling of love.  I meditated for several hours today, and found peace within myself.  This is the most exceptional experience of my life, and I truly think I am a better person because of it.</p>"
}
