{
 "title": "Familiar Feeling - Yep",
 "author": "Anzo",
 "citation": "   Anzo. \"Familiar Feeling - Yep: experience with 2C-I (ID 33943)\". Erowid.org. Mar 9, 2006. erowid.org/exp/33943",
 "substance": "2C-I",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "2004",
   "33943",
   "Male",
   " ",
   "Not Given",
   "Mar 9, 2006",
   "3201",
   " "
  ]
 ],
 "report": "<p>I will start by saying, two weeks ago I tried shrooms for the first time with 4 other people. We all had a great time for quite some time, then a little paranoia crept in. One of my friends was having a very bad time. Talking to him didn't help at all. </p><p>A week ago a friend of mine ordered some 2C-I. I figured this would be a lot like 5-meo-amt (nasea, puking, harsh body load). I figured I'd try it anyways. The same group of people did it, with two extra. Oddly enough, the trip proceeded exactly the same as our shroom trip did. We were all having a great time, talking, video taping profound situations (so we thought). I've noticed while tripping I don't appreciate my surroundings as much as I would if I was alone. Through the experience I did a lot of observation of other people. Everyone had their own group, or had several groups they would bounce between. We had two sober people in the group, one of which annoyed the hell out of all of us. The other was chill, didn't make many waves. Half way through the trip one person was having a hard time with the drug. Him and someone else went downstairs, before any of us knew it, both of them were having a very tough time accepting some realities in their life. One of which had the same problem while on shrooms in our last trip. One of the annoying sober people were getting on our nerves, she was immature and has never done any type of drug like this, hence didn't know what was going on.</p><p>At one point the people having a hard time were downstairs and didn't want to be bothered by anyone. So I let them be. The girl who was with us didn't make the situation any better, saying unnecessary comments toward the people downstairs. I finally kicked her out of my house. Once she was gone everything slowly came back to normal, as we all also came down off the drug.</p><p>If I was going to do this again with a group of people I would make sure that they knew what they were getting into. I don't think this drug is for anyone.</p><p>One thing I've personally learned is, this drug can make thoughts go anywhere, it just depends on if I let the thoughts go far enough. Think good thoughts, feel good. Think bad thoughts, and if I let myself keep thinking these bad thoughts, then I feel bad, and it keeps on rolling up into a big ball of depression. I am very careful before I start my trip. I get a gallon of water ready. I get good music ready, and prepare something to do for the 8 hours, if its either partying with friends, or if I'm alone playing computer games or reading. TV isn't all that interesting. It seems that my mind always needs something to do or else i'll become restless and bored (which can also lead to thinking too much!)</p><p>Description of effects: @ 1 hour I start to feel it, it makes my body wired, every once in awhile I need to stretch out my body. @ 1 hour 10 mins my tapestry started to wave. I don't know how to describe it exactly, but it wasn't like an acid hallucination. I couldn't control the visuals as much as I could with acid. All colors around me got darker, richer. I also could see mild trails when I would walk by a door, poll, or something standing. The coming up wasn't bad at all, small bit of nausea, not enough to care though. I had nothing to eat beforehand. Coming down wasn't bad, my back hurt a bit but compared to 5-meo-amt it was much better. It felt a little bit like coming down off ecstasy, body had almost a tingling feeling, felt good, still happy.</p><p>I will do this again, preferrably with people I know will have a good time with the drug. Doing it alone isn't as much fun, but I have found things to do that make the night a lot more interesting than it would be without it ! :)</p>"
}
