{
 "title": "Mind Expansion",
 "author": "Crazy Steve",
 "citation": "   Crazy Steve. \"Mind Expansion: experience with DXM & Diphenhydramine (ID 33999)\". Erowid.org. Dec 14, 2004. erowid.org/exp/33999",
 "substance": "DXM & Diphenhydramine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 1:40",
   "150 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 33999",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 14, 2004",
   "Views: 38544",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>6:00 PM----I drank 4 oz of Robotussin Maximum strength cough syrup at Fred Meyers around 6 PM somewhere on the edge of the Pacific Northwest. </p><p>7:00 PM----At home loading the groceries, the DXM began to take hold. I retreated to the computer/(anti-drug) parents room  and started to robototize rapidly . Surfed to RateMyThong.com and stared at the beautiful asses.</p><p>Gave the ol parents a Master and Commander DVD so I could be left in cyber-peace. I love Erowid. Ive grown up with this site and Im proud of it.</p><p>7:40 PM----Thought about Rubix cube and what we have in common with it. I just realized I am in a different life than I was in 2002. Maybe its all a big reality show and Im like Jim Carrey in The Truman Show. Nirvana is speaking to me.</p><p>Ate (6) 25 mg Benadryl tablets. </p><p>9:00 PM----Master and Commander is almost over. I will retreat to bedroom at sign of parents looking in my googly eyes and booting  my ass out for the |||| |||| |||| || 14th time. Good thing I have potential. Cannabis would be great with this high. If I had weed I would have black butter knives.</p><p>9:25 PM----Cant you trip like I do? Fog in the computer room. This keyboard is hard to see with nothing but monitor light. Im so fucking high and my parents are watching Russelle Crowes British George Washington Wig-style Ship crews fight Napolean in the 1600s.</p><p>10:00 PM----Parents are in bed. Watch TV with no concentration skills. Mind expanding as I smoke a cigarette and see a big ass white sheet fly by out of the corner of my eye. I am tripping nicely. Happy high. Motor skills altered if not somewhat hindered. Im getting tired.</p><p>11:45 PM----Dont know what Ive been doing except for thinking and staring at things. Perfect combo of DXM and Diphenhydramine.</p><p>Off to bed to watch the shadows and closed eye TV. Nice tripping with you. Signing out.</p>"
}
