{
 "title": "Awakening",
 "author": "Trippin Bitch",
 "citation": "   Trippin Bitch. \"Awakening: experience with Mushrooms (ID 3401)\". Erowid.org. Oct 22, 2000. erowid.org/exp/3401",
 "substance": "Mushrooms",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "2 caps",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3401",
   "Female",
   " ",
   "Not Given",
   "Oct 22, 2000",
   "Views: 10422",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSo I've been a weekend hard drug-experimenter (not user -- too harsh) for about a year. Until then, the only illegal thing I'd done was smoked a lot of pot, but more recently I've tried acid, coke, tina, K, and ecstasy.  I'd always wanted to try mushrooms, but they're a scarce commodity around here, so I was ecstatic when a friend of mine just gave me 6 caps.  He warned me that they were pretty strong; he said he'd taken only one cap the night before and had been well fucked.  I decided to get myself in the mood and venture into the world of mushrooms with two of my friends.  We gathered at my apartment and lit a ton of candles and incense, put on some trance music, and smoked a few bowls.  Then we ate our mushrooms, each taking 2 caps apiece.  From the experience reports I'd read on Erowid, I expected them to taste like shit, but they weren't all that bad.  I just washed down the mushrooms with water, went back to smoking a joint we had going, and waited.</p><p>Well, when they kicked in, I was REALLY glad that I'd read up on mushrooms.  I started to feel some weird body sensations: a freaky numb feeling through my whole body and then a churning motion in my stomach.  It didn't feel like nausea, more that there was something in there squirming to get out.  I briefly panicked, but then figured, 'Hey, it's cool, I've read about this' and concentrated on a candle on the table.  Suddenly, I looked at my friends, and their faces started to morph.  I thought I could see the veins under one of my friend's cheeks, and the other's nose seemed way too big for his face.  Suddenly, I thought it was all hysterical and started to laugh.  I spent the next hour cracking up over the stupid things I was seeing and the weird shit that was going through my head.  For example, one of my friends was sitting with his arms crossed, and I got this thought that he looked like a high priest.  Then I went back to staring at this candle on the table.  The light seemed to be shooting out the top and formed a figure that looked like a bare tree.  My other friend (not the high priest dude) was wearing a ton of rings, and whenever she moved her hands, she sent tiny specks of light into the room.  I was also really into the music, not as much as when I roll, but almost, and I kept having these spiritual thoughts, like that love is the answer to all things and that I shouldn't be as hard on myself as I am because my life will turn out fine.  These are things that I've kept in the back of my mind since that night.</p><p>About 3 hours later, my friends had to leave, and I just sat in my living room (still smoking pot, of course -- hehe) staring out the window.  The silhouette of the trees were forming faces, and at one point, it looked like there was a huge green giant outside of my window that was reaching in to get me.  That scared me a little, but then I thought, oh well, I'm just fucked up.  I went to the bathroom to get ready for bed.  When I looked in the mirror, the person staring back at me seemed to be another person, and I thought that she was evil.  Luckily, I'd read reports about things like this, so I wasn't too worried.  I just went to bed and had no trouble getting to sleep.  I woke up the next day exhausted, but for the most part, I felt great.</p><p>Anyway, I'd definitely recommend shrooms to anyone.  I got a lot of of this experience and haven't been the same since, for the better; I'm much more tolerant of people and relaxed about my life.  I think in moderation, drugs can improve your quality of life, but there are two things I'd tell someone who is getting into them: First, they're not something to do all the time, and second, know the effects that you should expect.  I've never freaked out on anything because I always read up on whatever I'm trying.  I'd discourage meth and coke use because it gets out of hand, but mushrooms are another story.  Be safe, do it for the right reasons, and they can change your life.</p>"
}
