{
 "title": "Blinky on the Brain",
 "author": "Laconian_Polymath",
 "citation": "   Laconian_Polymath. \"Blinky on the Brain: experience with Methamphetamine (ID 34036)\". Erowid.org. Jun 20, 2007. erowid.org/exp/34036",
 "substance": "Methamphetamine",
 "bodyweight": "226 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34036",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 20, 2007",
   "Views: 11586",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n1750 - Friday Evening\r\nOrchestrating a 'trial run' for Speed my dealer got us all a nice big chunk to eat before work. It was, indeed, an exhilarating experience as I'd never used it before and the concept of snorting the stuff never truly appealed in the first place.\r\nHaving had nothing to eat that day, I swallowed the roll-up skin with the help of some Coca-Cola and went to my desk. I was unsure as to the effects of the drug as a whole but hoped they would not interfere with my job as a CSR. I was wrong.\r\nKicking in within thirty minutes of ingestion I was experiencing the feeling that my body/stomach was going over nice big bumps in the road. This was followed neatly by the concentrated ball of energy and need to move which filled the upper-area of my stomach.\r\nSpeech became obsessive. Fast, furious with many slips and mistakes I simply had to talk - whether to those on the other end of the phone or my work mates. Emotional, with feelings that I had a personal quest to aid these customers, I found myself spouting forth streams of heart-felt suggestions whilst also making myself almost incomprehensible due to the mistakes within and the rapidity of my speech.\r\nI found a great sense of well-being, self-esteem and almost being truly content as the sensations delivered from the speed sent shivers up my spine, made my feet tap away on the floor and my body swivel in my work chair. I felt gleeful.\r\nSweating, as my body temperature rose, I went to the bathroom to relieve myself. I found my body didn't wish to part with fluids in the usual manner and understood that it may have, indeed, adjusted by ADH levels as 'Stacy does. Half finished sentences and an inability to keep but one conversation going at a time (even with the same person) ensued during my break.\r\nI was obvious and tweaking greatly - the wideness of my eyes, the dilation of my pupils coupled with my constant and almost cartoon-like blinking had be pegged. I was easily spotted as I continued to talk to anyone who'd take the time in-between calls to listen to myself. \r\nAt more than one point in the evening I found myself almost moved to tears. Beyond the usual sympathetic response to a 'sad' story from a friend I found myself fighting back floods of tears to stories which had no profound effect or meaning to myself except knowing they were unhappy times for the person in question.\r\n2200 - Friday Night\r\nHitting the bar I found myself continuing to blab anything I could find the fill the silence. I managed a can of juice but nothing alcoholic at the bar - I felt as if my stomach had shrunk to the size of a walnut and it was intoxicating. I continued to blink like a mad-man as we entered the nightclub.\r\n0000 - Saturday Morning\r\nIt's not the same now. I've lost the magic and I'm developing a headache as I continue to dance. My mouth is as dry as an Arab's sandals and no volume of water will quench such. \r\nI'm awake, alert and perceiving the faces of people I know on random strangers in an attempt to find someone to talk to. Must dance.\r\nShaky legs and a throbbing head made for an interesting dancefloor debut but I continued - the entire night. Stopping for the occasional glass of water and to prevent hyperthermia. I couldn't grasp the same 'loved-up' feeling my friend was experiencing on 'Stacy at the time and found my temper a little short when listening to his 'Stacy babble. \r\nMy jaws hurt - I've been grinding them without noticing. I've worn away the skin on my lower lip and chewed the inside of my cheeks too. Also, the area at the top of my nostrils is sore.\r\nHeading home for around 5am - I'm unable to eat or drink anything more than water. \r\n0600 - Saturday Morning\r\nVery much awake and alone. My friend is sleeping beside me and unable to grasp my distress at being unable to sleep for I do, truly, enjoy such. I manage around 15 minutes of disturbed 'sleep' before I give up.\r\nEyes feel weird from blinking so much the entire night.\r\n1400 - Saturday Afternoon\r\nIll. It's like having the 'flu hail down upon me from the sky. The come down hangs over me and I feel truly unable to do anything more than sit and feel sorry for myself having lost my magic and buzz from the night before. The headache has remained.\r\nGoing away to lay on some grass I crashed out - finding myself waking at 1700 in the city centre of Glasgow undisturbed as I slumbered in full view of the public. No longer ill I head off to McDonalds to find my friends.\r\n1800 - Saturday Evening\r\nCan't eat - still. 'Happy Meal' causes my mouth to feel like I'm attempting to chew and swallow razor blades and gravel. Manage to eat something through the pain but decide just to stick with smoking until I'm positive the experience of swallowing won't reduce me to tears. \r\n**As the night wore on any residual effects left myself - although the feeling of being 'less' alive stayed with myself. I enjoyed who I was whilst on speed, despite the side-effects and nosebleeds, so continue to use it - as well as for its appetite curbing abilities.**\n\n\n"
}
