{
 "title": "Cerebral Journey",
 "author": "John",
 "citation": "   John. \"Cerebral Journey: experience with Copelandia cyanescens (ID 34080)\". Erowid.org. Jun 14, 2004. erowid.org/exp/34080",
 "substance": "Copelandia cyanescens",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "0.07 g",
   "oral",
   "Mushrooms - C. cyanescens"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 34080",
   "Male",
   " ",
   "Not Given",
   "Jun 14, 2004",
   "Views: 7411",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday at around 1 am I took about half a gram [0.6-0.8 grams] of Copelandia cyanenscens. The Effects took about an our to kick in. After a while I found myself lying on my couch giggling and repeating phrases that seem totally useless to me now like: 'I do what I do, and why..just for its own sake', 'There's no god, where should he be?' or 'Damn, I'm coming down' followed by endless laughter. I felt like I had solved all the mysteries of perception, mind and spirit and was perfectly happy. Now, I don't, but the most intresting thing about all this nonsense is that I could 'feel' the cerebral nature of my brain. You might ask 'cerebral nature', what's that supposed to mean? I'll try to explain: My conclusion was that that thing, located from behind my eyes down to my spinal cord and from there reaching into every part of my body, was actually myself. I was absolutely sure that the whole discussion about the nature and location of the mind or spirit is totally obsolete. </p><p>Now I think it's not, because it's very intresting to listen to other people's opinion. What I mean is: I could watch 'myself' constructing the reality around me, instrumentalizing all the wonders of nature for its own ability to sit around, take some shrooms, smoke some weed and laugh its ass off, not knowing why or how. If you know Leary you got a glimpse of what I mean, it's the neuroelectric circuit, the awareness of constructing perception, damn cybernetic consciousness, man! I was able to imagine everything I wanted, like flowing through my bloodstream, finally coming out of one of the pores of my arm. Then, my skin was like the bark of a tree, protecting the inside, nothing more. When I finally came down I felt very exhausted (its hard to laugh for hours) and pissed off, since reality became what it was before. Now I feel gratitude for the wonders of the world but there is also sadness because of the cruelty and greed in human society. I'll never be able to understand how people can sell their soul for materialistic advantages. Wealth is a matter of perception and perception can be changed by most simple means.</p>"
}
