{
 "title": "First Time User with High BP",
 "author": "Max",
 "citation": "   Max. \"First Time User with High BP: experience with Ecstasy (ID 34093)\". Erowid.org. Mar 15, 2007. erowid.org/exp/34093",
 "substance": "Ecstasy",
 "bodyweight": "54 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "  T+ 1:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "  T+ 3:00",
   "0.25 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2004",
   "34093",
   "Female",
   " ",
   "Not Given",
   "Mar 15, 2007",
   "40546",
   " "
  ]
 ],
 "report": "<p>The crowd that I am with have always taken E when partying, but being pretty much anti-drugs my answer was always, I can party without it. Nevertheless, I would max out by 2:00am being tired and irritable and just couldn't understand how they could still want to be on the dance floor listening to repetitive music. Lately I have unanswered questions so after doing some considerable research decided to try E.</p><p>I might add here that one of the things that has been holding me back is that I have essential high blood pressure. Every single test that can be done to determine the cause has been, but the doctors have pretty much come up empty handed and have concluded that it's hereditary. I have had my heart checked from every angle by cardiologists and they say the problem does not lie there. With that, I am on 2.5mg of bisoprolol fumarate daily to keep the BP under control, which without it would register a moderately high systolic pressure and a high diastolic, at its worse 160/118, with daily medication 120/90. </p><p>Considering the warnings on hypertension and E, I weighed up a lot of factors personal to me before attempting it. My BP was completely under control with medication and I had recently done extensive cardio check ups that came back 100%.</p><p>We all went to a rave club. I had decided that due to my small body weight would try half first and see how it went. After an hour I felt nothing, except maybe a slight increase in energy levels, so I took another half of a different pill. There was no expected warmth or tingling feeling as friends had reported, but an intense surge of energy. Not a paranoid or frenzied energy, but very stable and extremely sensual connected energy. I had no desire to leave the dancefloor. For some reason I could pick out every one on the dance floor that was also on E, there was a strange connection to them. I extremely aware of details that would have totally escaped me. I saw people popping pills and people touching each other. I know I miss details like this normally. The music was crystal clear, my contact lenses that normally irritate my eyes after spending a while in a closed club environment; I couldn't feel them at all.</p><p>There was no jaw clenching, but I had a perpetual smile plastered on my face. I felt unbelievably powerful and confident within myself. I don't normally venture away from friends at clubs, but I felt so at ease with everyone there that I was confidently moving in and out of the crowd alone. The time flew passed. By 4:00am friends wanted to leave. I could have easily stayed another 3 -4 hours.</p><p>I got to bed by 6:00am and woke up at 10:30am now with slight trembling in my body, very low grade headache but still feeling very relaxed and energetic, took my BP medication. Got back into bed at 12:00pm and woke at 4:00pm, now feeling very lethargic, bored and slightly depressed. The energy had gone but I still felt trembling within my body. Heart felt like it was beating harder than normal, but it wasn't. Was in bed by 8:00pm, next day more than 24 hours after taking E, felt definite loss of concentration, unstable heart beat and out of breath at the slightest exertion, very low grade headache came and went thoughout the day. Pulse was normal though at 68 bpm. </p><p>48 hours after dosing woke up with slight chest pains, heart feels slightly constricted, still experiencing loss of concentration especially trying to focus on conversations and slight trembling in body but pulse still normal at 60 bpm. Ironically, its always after the fact, when things are not going 100% that you start to wonder if you maybe overdid things. Checked BP and pulse throughout the day and was normal, chest pains went away completely in the afternoon. Finally, 72 hours after dosing woke up and felt completely normal, concentration levels and fitness levels back to normal, no trembling or pain anywhere. Considering it took three days for me to feel completely comfortable again, definitely will only go to half a pill next time and stay there. Do I want to do E again? Absolutely. Definitely recreationally in small doses and with time in between parties. I have never felt such a surge of freedom and control all at oncetruly amazing night.</p><p>Adding: Two weeks after dosing had a full medical, BP completely normal, all after effects gone.</p>"
}
