{
 "title": "Are They Evolving as a Species?",
 "author": "psilly_cube",
 "citation": "Citation:   psilly_cube. \"Are They Evolving as a Species?: experience with Mushrooms - P. cubensis (ID 34108)\". Erowid.org. May 1, 2006. erowid.org/exp/34108",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 2:00",
   "5.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34108",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 1, 2006",
   "Views: 3411",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r[Erowid Note: Author reported ingesting 3 grams of Kava, but does not mention it below.]\r\nLately, I've been doing a substantial amount of mescaline, mushrooms, & DMT. The last time I did mushrooms, it was under a new moon...I had an amazing experience & planned to trip on the mushrooms by moon phases(every 2 weeks - new moon/full moon) & do the mescaline in between...& the DMT in between that. Planning the mushroom trip for the full moon, I knew something wasn't quite right...everything felt wrong. Building up to it, the amount of obvious synchronicities were overwhelming...left & right, my inner feelings seemed to be externalizing. The mushrooms we had planned to ingest for the excursion were new to us...the field was just discovered & has not been touched, to my knowledge, until now. Four days prior the experience, I took 21 dried grams of the mushrooms, shredded them, & mixed them in w/ some chocolate I had been melting in a double boiler. I seperated that into four foil cup cake holders, & let them solidify in the refrigerator. \r\nThe day before we ingest them, a friend comes to me...a friend that has never tripped...& requests that I dose him on enough to let him 'see' what all of the fuss is about. I fed him & another fellow an eyed-out 5-7 grams of the new, untouched batch. For about 2 hours he had a wonderful time...then his head dropped. He was in a trance for about 20 min. When he raised his head, his eyes were blank. 'Get the fuck out of my house...I'm on to you now...you're the devil...good one, but I'm on to you...now, GET THE FUCK OUT OF MY HOUSE. He started at me & I left. His friends later told me that he screamed until around 2:30am...then he fell asleep mumbling. \r\nWith all of this on my mind, I met w/ my friends at 5:00pm, smoked until 6:30pm, & ingested the sacriment at 7:00pm. The chocolate was very hard to get down...almost like a mental block...like I knew I didn't need to keep eating it. An hour after ingestion, the anxiety/stomacheache was unlike any I have ever felt. As the effects came on, so did a thunder storm. Clouds gathered above our heads & commenced to swirl. Lightning raged & intensified w/ the mushrooms. 'Something's wrong' I said. 'This doesn't feel like mushrooms...this feels like LSD, but much more frightening.' Everyone was getting uneasy, & then it hit us. All reality was removed. No connection to my body. My friends were terrified, huddled up in chairs...no more smiles. I stand up & walk inside the house...my vision splits, & my left eye seems to be seeing lower then my right...a visible line down the middle. I felt as if the two hemispheres of my brain had seperated, & my eyes were responding to that. 'I've overdosed on psilocybin' I thought...this sounds stupid, even to me...I have eaten up to 70 caps of p.cubensis, & have never gone this far. I've ingested 30 hits of LSD in one sitting, & still never saw of felt anything like this. \r\nI stuck my fingers down my throat, & seemed to heave forever before the chocolate/mushrooms came up. 'What have we done?' I thought...I felt as if we had cracked open the spirit of this field & it was running wild through our minds. 'This doesn't feel like psilocybin' I said again...'this can't be psilocybin'...'either the psilocybin content in them is INSANELY high, or maybe the mushrooms are evolving as a species...changing into something much more sinister & alien, more concentrated...or maybe just like people, all fields have different personalities, & this one was just negative.' I was spinning in confusion...my face was covered in busted blood vessels...red spots mottled my eye balls. I went into the bedroom & turned on the fan. I layed on the bed & begged the mushrooms to slow down...for my friends' sake...slow down, please...then, time stopped. Everything chrystalized & a web shot out from my middle & covered the entire universe. Everything was an extension of me, & I was the spiraling center of the web...my spirit the spider. This was an utterly terrifying experience. I jumped out of the bed & tried to get the positive vibes flowing, but they were nowhere to be found. \r\nI located my girlfriend & told her that I was ready to go home & lay in my bed. 'We can't go anywhere' says my friend...'We're gonna die if we leave.' I put the keys in the ignition, & they won't turn. I wrestle w/ them for 3 min. or so, w/ no luck. After around five min., it cranked, but it wouldn't come out of park. It was STUCK, & so were we. The car starts to close in on me & I open the door to get out...but I can't. When the door opened, the seatbelt closed in on me. I closed the door back, & the seatbelt releases. 'What the fuck is going on here?' I exclaim, & I rip the belt off of me, & exit the car. I went inside & smoked some more pot & tried to calm down, but I was BLITZED. I got back in the car & everything happened in order. It cranked...went into reverse...& we left. All seemed well. 'I need some cigarettes' my friend exclaims after hours of silence. 'Can you buy them for me?' I walk into the gas station, & realize that I'm entering a program. It's set up just like all of the other gas stations... bright colors, all lined up in a row, & an attendant at the counter. She seemed to say the same combination of words over & over again... anyone could have walked in & I feel that they would have heard the same thing. I left w/ an understanding of why I can't get hired at certain establishments... b/c I'm not compatible w/ their program... something I still can't shake. \r\nWe finally made it home okay, & we spent the rest of the night trying to figure out what happened earlier...weighing out the possible factors that may have affected our trip. I've been tripping for years. I've tasted many fields & many substances in many different combinations & ratios, & never have I seen what I saw on those mushrooms. They are more powerful than any I have encountered in literature or personal experience. From now on, I test mushrooms w/ VERY low doses (1-2g) before taking full blown excursions. I wouldn't wish that trip on anyone, unless that was their goal...it might not have been so bad if I had any prior idea of these particular mushrooms' potential.\n\n\n"
}