{
 "title": "Wigged Out?",
 "author": "Chloe",
 "citation": "   Chloe. \"Wigged Out?: experience with Cyclobenzaprine, Cannabis & Alcohol - Hard (ID 34100)\". Erowid.org. Nov 28, 2006. erowid.org/exp/34100",
 "substance": "Cyclobenzaprine, Cannabis & Alcohol - Hard",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)",
   "  T+ 2:30",
   "10 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   " ",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34100",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2006",
   "Views: 32969",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first experience with the drug was snorting 5 mg of it about a week and a half ago. It took an hour to kick in, but once it did, I was high for the rest of the night. I felt relaxed, but energetic, almost like I'd just taken a line of speed and drank with it, only better. <br>The next day, I took a 10mg line, and the effects were the same, but more intense, and I was even having mild hallucinations. I awoke the next day not buzzed, but refreshed and ready to face the day. I smoked a couple bowls in the afternoon, like I do almost every day, and found myself tweaking out again. It was still pleasant, so I didn't worry. The next day, I awoke energized again, but when I smoked in the afternoon, I only got a marijuana high.<br>I waited about 4 days, and I was feeling completely normal, so I orally took a 10 mg tablet. After 2 and a half hours, none of us were feeling very high, so we decided to take another one. We started drinking (not a lot, even though I found it going down very easily), and in about an hour we were all IRRITABLE, pissed off over every stupid thing. I felt tired, not energized, and I laid down and passed out.<br>An hour later, I was shaken out of my sleep. I was bitter and tired, still cranky, not even feeling buzzed except for being drowsy, and now there were three people standing over me screaming at me for no reason.<br>'YOU MUST BE HARDCORE TRIPPING. I'M NEVER DRINKING WITH YOU AGAIN!' my fiance yelled.<br>'Huh? I'm not even buzzing! I've been asleep for the past hour!'<br>'YOU DON'T EVEN REMEMBER? JESUS, YOU'RE TRIPPING HARDCORE!'<br>Assuming that THEY were the ones messed up and acting stupid, I rolled over and tried to go back to sleep. One of my friends pulled me off the couch by my foot.<br>They had reason to be pissed. I was sleepwalking, functioning perfectly but living in my dream. Only in my dream, I pissed in the toilet, not my best friend's shoe...<br>I sleepwalked again when I got home, I guess. I had a dream about chasing the cats outside my window, because they were fighting and waking me up. I awoke on my bathroom floor past noon, which is not like me. I was still deathly tired, depressed, and irritated. My fiance and I had a misunderstanding, and since we were both in such horrible moods, ended up getting into an argument that had both of us in tears and ready to call off the wedding over nothing. After we sorted it out, we decided to smoke a bowl to calm us down, since neither of us could seem to snap out of our anger. I smoked a bowl and started tweaking a bit, feeling a little tired, and having mild hallucinations. It wasn't a bad feeling, and it was controllable.<br>Only now, 5 days later, I'm still feeling it. My back hurts. I puke everything that I eat. I can't concentrate, I'm always dizzy, lightheaded, and dehydrated. Whenever I drink water, my stomach hurts and it passes through me in less than half an hour. I haven't touched alcohol and I've only been able to keep down a couple crackers. I puked in my sleep a few days ago, and I puke every morning. My personality changed... I've been dressing differently, acting differently, and even thinking differently. I've had thoughts of suicide, running away, and leaving my friends, fiance (!), and family in this area to start a different life further upstate, something that my family up there has always tried to encourage me to do, but I've always dismissed the thought as soon as it was brought up. Two weeks ago, I LOVED THIS LIFE, and now I feel like I'm on the worst drug trip that I've ever been on. I smoked a bowl last night and ended up hallucinating and hardcore tripping, more heavily than any time I took cyclobenzaprine. And I know my sources, it was NOT LACED.<br>I do feel like I'm getting better, especially after taking today off from work, school, hanging out, and any mind altering substances besides tobacco. I've been forcing water down with Pepto-Bismol and toast, and it hasn't come back up or gone through me yet, although it still hurts. However, if in a week, I'm still feeling this, I'm checking myself into a psychiatric hospital... I think I messed something up.\n\n\n"
}
