{
 "title": "The 'Smart Pill'",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The 'Smart Pill': experience with Amphetamines (Adderall) (ID 34115)\". Erowid.org. Jun 4, 2004. erowid.org/exp/34115",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34115",
   "Female",
   " ",
   "Not Given",
   "Jun 4, 2004",
   "18949",
   " "
  ]
 ],
 "report": "<p>I've always been a very slow learner and a big time day-dreamer, but my teachers and parents never thought anything of it. They just figured it took me longer than most people to catch on to things. I made pretty good grades all through middle school and worked very hard for every one. When highschool rolled around I maintained my motivation for good grades, but school was suddenly becoming a major bore...gee what a suprise. 10th grade got harder and as my grades began dropping, so did my strive to improve them. I passed everything, but not as much as I had hoped. I made it a mission to do better in 11th and 12th grade. For our summer reading project for junior english we had to read a few books and a few confusing short stories by authors of the 18th century, then we had to do a detailed report for each one. </p><p>I procrastinated for the longest time, and with school starting a week later I hadn't read one damn sentence in any of the required material. I was chatting with a friend about this and told him how screwed I would be if I didn't start working hard again. He told me he had ADD and he was prescribed to adderall, which is suppose to help you focus and concentrate. He offered to give me a few to see if they could help. Keep in mind I'd never been a big pill popper, hell I was ify about taking a tylonal. But at that time I was willing to try anything, so I took 1/2 of a 30mg adderall.</p><p>I finished all of my english work in oneday and never felt so intrested and focused on school work in my life. After that, I went to my room and cleaned it from top to bottem for 4 hours. I continued to buy Adderall from my friend every few weeks for the rest of the year. One time when I took it everyday for a week I lost about 10 Ibs and looked like a sick drug addict. Eventually I became so addicted to Adderall that I convinced myself that I had ADD. I looked up all the symptoms and played each one off perfectly in front of my parents for the next few weeks and in front of my doctor.</p><p>At the beginning of my senior year I finally got my own prescription of 5mg a day. I was used to 30mg or 35mg but I couldn't tell my doctor that or he would take me off of it in a second. So I sneaked 6 or 7 pills a day until the bottle was empty long before my next re-fill. Oh yeah, did I forget to mention that I'm manic-depressive and one of the side-effects of coming down from Adderall is depression, so for me it was 5 times worse. I had the time release capsules and I'd open them up and pour the contents in my mouth at certain times durring the school day so I could focus even better in class. I tried to commit suicide a little before Christmas break but I never have to this day told anyone that one of the reasons I did it was because I was coming down extremely hard that night, I didn't want my precious Adderall to be taken from me.</p><p>Eventually my doctor upped my dose to 20mg. a day (30 pills a month). I'd finish my bottle in about 10 days and bought what I needed from friends until my next re-fill. I just graduated about a week ago and the only thing that runs through my mind is how I'm going to stock up some Adderall for college. My heart beats twice as fast as normal and I can't even climb the stairs anymore without stopping to take a breather. I've damaged my once-healthy 18 year old heart and added about 20 years to it. I'm also taking 3 diffrent anti-depressants since my depression has worsened in the past 2 years.</p><p>I have no idea how much longer I can maintain this habit but I pray every night that I will oneday have the strength to confront my doctor about my problem before it's too late. To anyone who reads this and wants to fake the symptoms of ADD to get a prescription, please know that if you start to abuse it, your craving for this drug may just get worse and worse, as for your physical and mental health. I wish there was no such thing as adderall...in my eyes it's prescription cocaine and it's ruining my life.</p>"
}
