{
 "title": "Precision Attention",
 "author": "The Brave Cowboy",
 "citation": " The Brave Cowboy. \"Precision Attention: experience with Modafinil (ID 34158)\". Erowid.org. Nov 12, 2004. erowid.org/exp/34158",
 "substance": "Modafinil",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Modafinil",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34158",
   "Male",
   "",
   "Not Given",
   "Nov 12, 2004",
   "34157",
   " "
  ]
 ],
 "report": "<p>I've suffered from long term depression for nearly 6 years now.  My experience has included severe HPPD and psychotic symptoms for the past two years since a hit and run incident with yage.  But this is about modafinil. The defining characteristic of my depression for as long as I can recall is fatigue, lack of motivation and excessive sleepiness (called a dysthymic profile by the psychiatric profession).  These symptoms flair up exceptionally badly in the winter time when the light is low (seasonal affective disorder).  This winter, going to school in Vermont, was especially bad. I lay in bed much of the day watching movies.  After waking up I would need to go back to bed in a few hours. I happened across reports of Modafinil that sounded promising, so when things failed to improve over winter break I got a prescription from my hometown mental health professional.</p><p>I was doing a little bit of meth (a quarter gram over 2 weeks) during break and didn't notice much improvement from the modafinil at first. Ampthetamines seem to render modafinil useless (this experience was reconfirmed later during finals this spring) and vice versa with the crash still there but no rush (bad deal!).</p><p>A week after discontinuing meth use and 2 weeks after beginning modafinil therapy, at arond 6 pm (6 hours after my daily dose), standing in line to get dinner, a light switch flipped in my head.  All of the sudden the cloudiness and fatigued fog was gone. The effect was euphoric.  Living under that cloud every waking moment for 2 months had been taking its toll.  I wasn't sure the effect was real because it was so sudden and pronounced, like bumping a line of something motivating.  But it lasted.  I had terrifically increased attention, energy and motivation.  I was able to cut back from sleeping 9 or 10 hours a day to 6.  Rather than getting bored of writing or doing other work after 40 minutes or so, I found myself working for hours on end, absorbed in creativity.  There were never any side effects, including sleep related ones.</p><p>This lasted for around 2 months and the motivating effects slowly tapered away.  The wakefulness persisted however, with sleep remaining around 6 hours a night.  After 5 months, even the sleep effects are wearing off and the drug seems nearly useless.  </p><p>A summary of my findings:</p><p>- This is not a one-off recreational drug.  It gave me a mild lift the first two times I did it, but not in a remarkable way.  This is something that should build up gradually in my system.  When it does, sleep is dramatically reduced in length (though not quality) and concentration is improved. </p><p>- This is nothing like amphetamines or other dopaminergic drugs.  There's no 'boost' like I get with any of the amphetamines.  I don't get revved up.  It's very much just a natural feeling of not being tired.  I don't think it's likely that there would be much mood effect for me if I weren't  depressed. The euphoria I felt was actually relief at no longer being sleepy.  In fact, after a while it felt weird to be so motivated and energetic without being all that happy.  The sleep effects are pronounced no matter what.  This also doesn't keep me up at night if you take it at a reasonable hour.</p><p>- I found that for best effects, once blood serum levels were up, my daily dose primarily affected the next day's energy levels, not the current day's.  For instance an extra 200-300mg in the afternoon or early evening didn't affect my sleep quality but allowed me to get up extra early feeling peppy the next day.</p><p>- Increasing dosages did very little.  I experimented with dosages up to 800mg a day with no difference from a 400mg/day dose.  400mg/day is the highest level used in clinical studies.  I feel as if, because of the extremely targeted nature of the substance, there's only so much it can do at once.  I don't think it's possible to get over a certain level of wakefulness, but if I keep taking it over a period of time (every 12 hours would suit the pharmacokinetics), I'll stay wakeful (up to a point, 24 hours being mine).  It's pro-histaminergic compound, though, so perhaps histamine precursors are a limiting factor.  I've never heard of anyone taking supplements for that, but you never know . . . </p><p>- I tried smoking with no effect.  Snorting yields exactly the same results as oral ingestion but it's not a particularly tasty substance.  The peak action is reached at 4 hours no matter how I ingest it it seems.</p><p>- This drug is EXPENSIVE! It's not worth doing if you're not going to take in a regular fashion so you better have [a] a prescription and [b] good health insurance.  Prescriptions aren't hard to come by like they are for Adderall since Provigil (the trade name) is Schedule IV rather than II.  The cost is $5 a pill, with the largest size being 200mg.  That works out to 7.50-10 a day without insurance.  Modafinil is only FDA approved for narcolepsy not ADD or depression, so many HMOs and PPOs jump at the opportunity to not pay.  The manufacturer, to their credit, has a program set up to help you coax your insurance to pay for it.</p><p>To sum up, this substance was a life saver for me to get through an extremely hard period, but not a cure for anything or an interesting recreational drug.  For the overstressed student this could be the ultimate drug, though -- endless wakefulness and concentration with little  side effects.</p>"
}
