{
 "title": "Unexpected Reactions...",
 "author": "vicarious",
 "citation": "   vicarious. \"Unexpected Reactions...: experience with Hashish (ID 3415)\". Erowid.org. Dec 18, 2001. erowid.org/exp/3415",
 "substance": "Hashish",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cannabis - Hash"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3415",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 18, 2001",
   "Views: 9163",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been a smoker of hash for over 3 years now, and only once have I had a bad experience.</p><p>At a party one of my friends was having, we broke open our hash reserves. I smoked 2 joints, and had a few hits from a bong. I left the party feeling normal. A day later, at roughly 11:00 pm, I found a lump of hash in my wallet (about the size of a thumb nail). I decided to eat it, not suspecting it would be bad, even though it was from the same source that I was smoking the night before.</p><p>After a couple of hours of no reaction, my pulse suddenly rocketed to over 130 bpm. My muscles felt like they were on fire, and my vision had become disassociated with what was going on around me. Paranoia levels shot up. My thoughts and emotions pumped dangerously high. For example, I thought 'this isn't good. this should not be happening' and my anxiety made my heart beat even faster. It felt like I was tripping. I was not hallucinating, though. I did imagine things, and I became fixated on the noises I heard (the buzzing of a fridge, hum of a radiator).</p><p>I finally managed to get off to sleep after it had died down a little. I woke up the next day feeling slightly as if I had been regularly stoned. But 15 mins after getting up, the effects came on slightly. My heart fluttered occasionally, and my muscles twitched randomly.</p><p>I could not do anything for the 2 days these symptoms stayed with me. After they died down, I didn't touch hash again for quite some time.</p><p>To summarise: It may not have been bad, but that certainly isn't my normal reaction.</p>"
}
