{
 "title": "Like Snorting Pop Rocks",
 "author": "Unicron",
 "citation": "   Unicron. \"Like Snorting Pop Rocks: experience with DPT (ID 34186)\". Erowid.org. Jul 20, 2013. erowid.org/exp/34186",
 "substance": "DPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34186",
   "Male",
   " ",
   "Not Given",
   "Jul 20, 2013",
   "640",
   " "
  ]
 ],
 "report": "<p>I'm a long time drug explorer / user / whatever. Long time as in I've got about a 7 year history going now. So yeah, maybe it's not really all that long in the grand scheme of things, but it's a long time to this lovesick suburban whiteboy. Long enough for me to have thoroughly tasted most drugs readily available on the american black market. </p><p>Now, my favorite of all these uppers, downers, and hallucinogens, has always been good 'ol LSD; and it probably always will be. For me, LSD is just where it's at and always has been, a beautiful place that can make you feel like god one second and a tiny baby the next. And strangely enough, oftentimes a place where things make a good amount of sense.</p><p>Well, LSD being my favorite chemical was all well and good about 3 years ago when one could buy large quantities easily, and it was plentiful on these clean suburban streets. Yet since it's last great influx of LSD, my area has hit a dry spell the likes of which it's going to take some large amount of action to pull itself back out of. I dug shrooms till I got bored with them, and they are a hassle to either go pick myself or pay someone for. Maybe some day I'll grow shrooms and horde DPT. Shit, maybe someday LSD will be legal. Shit, maybe someday.</p><p>This LSD ruckus (or lack of ruckus, or ruck-lack) led me to research chemicals like AMT, 5-meo-DMT,  and DPT. AMT was ok, kinda like a Trip Lite if ya know what I'm saying. It lasted mad long but it didn't quite have that oomf, that power, or that feeling for which I look.</p><p>Then last thursday, came my 5-meo-DMT and my DPT (I did the AMT back when it was legal). The 5-meo-DMT was cool but a little too far out, a bit too wierd, and just a tad much lung-rasping plastic tasting for me. </p><p>I skeptically turned to my other bottle, a pretty blue bottle filled with a fluffy, light, white powder that smelled like nail polish remover. The label said DPT. My friends say it doesn't smell like nail polish remover. Whatever, they can get off their lazy asses and write down their own opinions when they stop smoking pot, eating beef jerky, and watching The Last Samurai ('well it beats the ass raping that is LOTR, right?')</p><p>This shit SUCKS TO HAVE IN YOUR NOSE. BLEH. BLAH. BLEEEH. It's like snorting pop rocks, yeah for the first few mins your cool but if you breath out your nose it hurts (hot), and it feels good when you breath in (cold). It leaves your nose feeling raw as hell and hurts the roof of your mouth. I've found through experience that it's better to just breath out my mouth until this shit has done it's vile business with my nose. This is my ONLY qualm so far with insufflated DPT. I have insufflated it 3 times.</p><p>The first night I did it was the first night I recieved it in the mail. I had no scale but I estimate my dose based on later use of a scale with DPT to be about 65 mg. It was a medium sized line and a half. It came on and the body vibe felt pretty much like acid, I had solid visuals but nothing too crazy, I was baseline in about 4 hours.\r[Erowid Note: Two samples of powder (even of the same chemical) with equivalent volumes won't necessarily weigh the same. For this reason, eyeballing is an inaccurate and potentially dangerous method of measuring, particularly for substances that are active in very small amounts. See related article]</p><p>The next night I took considerably more, probably around 90 - 100 mg's, a couple big sized lines.</p><p>Again, the body vibe felt like LSD, the order whent, </p><p>1. insufflate</p><p>2. Body vibe starts coming on, start to feel trippy / sometimes giggly.</p><p>3. Body vibe in full effect, cue visuals.</p><p>4. Body vibe and visuals platue at peak lvls for about an hour.</p><p>5. everything slowly goes away till baseline.</p><p>This time I saw intricate patterns and occasionally 3 dimensional images with closed eyes. The similarity to LSD was mental kungfulisciously striking.</p><p>The next night I took a weighed out dose of 75mg insufflated. This time I got some body vibe and visuals but it was pretty toned down. Tolerance, built up from the aforementioned nights previous, most definately had it's way this time.</p><p>For me, this is the next best thing to acid, I like it more than shrooms. The time limit is kinda nice too cause you can have the whole thing exploded and wrapped up in a good 4 hours. All in all the sweetest deal this side of the real. Damn nice stuff.</p><p>For me, this stuff blows all other research chem's I've tried out of the water and seems like something I'll try to have easily accessable when I want it, becuase it's a gauranteed good solid trip if I dose right. Visuals, mental states and all, later this week I will delve even further, and I know it's gonna be some fun exploration.</p><p>Love,</p><p>Unicron.</p>"
}
