{
 "title": "Tripping in the Woods Late at Night",
 "author": "Keith McGinnis",
 "citation": "   Keith McGinnis. \"Tripping in the Woods Late at Night: experience with Mushrooms, Cannabis & Alcohol (ID 34183)\". Erowid.org. May 9, 2007. erowid.org/exp/34183",
 "substance": "Mushrooms, Cannabis & Alcohol",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(cookie / food)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34183",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 9, 2007",
   "Views: 3185",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWe had a warm evening, for February at least. I had a brand new car, a full tank of gas, mushroom chocolates, plenty of pot, a six pack, and some firewood. Lazor and I went to the purchase, but before doing so we each ate half of a chocolate bar containing 2.5 grams of psilocybin extract. What followed was extravagant fun: a trek through a snowy path lit only by a bright moon, leading to a lake entirely frozen over. We had a fire set up in no time. \r\nThe two of us sat next to our new flame and smoked a couple of bowls of pot allowing the drugs to take hold. Soon I noticed the body high, a feeling linked closely to my diaphragm, breathing deeply leads to an intense sensation throughout my torso which quickly waves out to my limbs, and then back. My head becomes lighter as well and the nerves become very sensitive to touch. I stood still for a few moments, composing myself before I eased out to the lake, taking it slow as I was still gathering my bearings under these strange chemicals' influence. I walked out about fifteen feet onto the ice and looked around. The sky's colors grew tremendously vibrant, soaked in deep blues and cool purples. The glow from Danbury below the horizon was reflecting off of a tiny patch of clouds in the distance and from there came the oranges, and violets, and thick, rich reds. But further up into the sky I could see the stars, they were engulfing themselves and coruscating with the colors I saw everywhere else. Even though the moon was in its first quarter I could see the outline of the dark portion. It was bloating and sheering into various potato shapes pounding out intense yellows saturating the shadows caused by craters.  \r\nThe ice became a treat in itself. Standing way out there on it gave me a grand feeling of solitude exaggerated by the hard cracks and clunks resonating hundreds of yards across the entire lake. Looking across it was like watching the earth after peeling off its crust, bare tectonic plates, with ridges where one plate of ice was sliding faster than the plate next to it. There were patches that shimmered with light and sound as I stepped through them. Like walking through a field of leaves, only the leaves were made of paper-thin glass and with each tread a mist of this shattered glass sound exploded into a soft glaze over the ice. This occupied me for a long time. There's no way I could explain how long, as time was in complete distortion at that point. But between lying on the ice, looking at the sky, and playing with the red-hot coals from the fire we occupied ourselves for multiple hours.\r\nSitting by the fire at one point I grew deep into personal thought, I went off all spiritual-like in my mind for a few minutes. First I thought of the fire as a living thing, then I thought that it would be the perfect archaic representation of 'god'. A creature that eats and sleeps, feeds off the air and the carbon, siring tremendous light and heat. It can be predicted with all our scientific developments, yet still feels alive and uncontrollable as it feasts on the wood and grows stronger with the larger gusts of wind. Then I thought about it for a moment more, and realized it's a story direct from Exodus, Moses has a revelation one afternoon while tending to his father-in-laws livestock and the lord spoke to him through the guise of a burning bush. So disregarded that thought as a memory, just some ancient archetype that stayed with me since my religious teachings.\r\nStarring deeper into the fire I was thinking of the country I live in, the last sixty years of its history and its future. Its trend toward efficiency and in so its conversion of the human identity into a number invariably designed to log our every move thus allowing a subtle control over our actions. Cities and towns are all designed so efficiently, they are all structured in much the same way. Around here they all have their main street commercial district, which looks the same no matter where you are.  But something different comes from each one, something characteristic. And that's exactly it. Character. It causes a disruption in the structure and efficiency, like a vine of human character meandering through a major metropolis, with different strains of the vine fitting into various niches of the city like the unmistakable scent of little Italy. Or the feeling I get from standing at the end of a pier looking over the east village. As much as the city itself might resist, it's infested with this character. \r\nThis all stopped in an instant as soon as lazor yelled 'Look' to me as he pointed toward the moon, there was a thin strip arcing to the left of it.\r\n'What is that' I pondered with him, it looked like a cloud, perhaps a jet stream, but it dazzled with color that vibrated up and down its length, it slowly drifted away from the moon toward the crisper skies. We stood there watching it drift for some minutes dubbing it the Night Rainbow. \r\nSo eventually the fire grew nil and we had some laughs kicking the cinders around and throwing some burning logs onto the ice, we concurred it was time to get moving and we packed our belongings and began a haul back to the car. Once back inside of it I took a sigh, one of relief and contentment. I asked in a sort of haggard manner for my water bottle. Which he handed it to me, it was shorter than usual, and fatter too, it had some unfamiliar curves and bends in it. I looked at lazor:\r\n'Umm, I'm still tripping.'\r\n'Yeah,' he said, 'Now that you mention it I'm seeing a lot of movement too' and he pointed to the pattern on the cars upholstery, which was flowing along the entire length of the seats very naturally. I shifted into drive and we hit the road.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] \r\nOnce we had gotten to he bottom of my road, where his car was we decided it wasn't time to end this adventure, and so the adventure just about started. Originally we planned to intertwine with the usual suspects and see out the rest of the evening with some familiar faces, but my buddy Wendle lost his cell phone again and we had no way to make a connection with him.\r\nSo we drove. We pressed on toward Hartford looking for a 24 hour diner, but hadn't any idea what towns to look in. We figured east would be as good a direction as any, toward Middletown. But in my disoriented state I missed the exit. So I began a new search, this time for a way back on the highway in the direction we'd come from. To our drug-riddled minds' dismay however, we found ourselves in foreign territory. A land riddled with cop cars and closed shops and gas stations. Highways in every direction, but which way to one we could use? Hell it was terrifying enough just to turn around as every other car in this hung-over town was a pig and Lazor and I were zonked out in classic form. We were out of our element. At one point I lost all hope, I was sure we were finished after I cut into the road dangerously close to another car just after seeing two cops moving in to separate directions, junctioning right where I had laid down this grossly illegal and wholly irresponsible maneuver. But through sheer pity on the part of some celestial we were allowed to move on unrestrained.\r\nWe were clearly lost in the vast noise of interstate highways and windy little towns each with its own cloned version of the commercial district main street completely devoid of character this time of night. And teaming with speed traps to keep its lack of character rampant. Eventually though we found our way back to the highway but the promise of a worthy eatery seemed dismal. We were merely trudging through a vast interstate desert with unmarked, impossible to find outposts scattered in who knows what order. Shit the only character here was the random chaos of where our destination might be. \r\nThe Athenian Diner. So we found it, in Middletown, the only town with anything run-down in it, a rusty train bridge climbing over the street and into the woods, and a quiet little inn where we stopped to piss. And most important: a 24-hour diner. The Diner was a funhouse, mirrored walls did nothing but disorient our sense of direction, neither of us even dared attempt to explore the premises for fear of never finding our way back, or bumping into a mirror disguised as a hallway. Hell, I was afraid that I'd meet a tall fat man who looked strikingly similar to myself, and that I'd begin a conversation with him. No sir, I was not about to make a dupe out of myself in this twisted carnival. We just sat. \r\nh Fries with cheese and gravy\r\nh Onion rings\r\nh Two coffees, one w/ cream, no sugar.\r\n---\r\nThe ride back was somber and we were both complacent in the best of senses; without a single worry. I sipped on a beer most of the way home and Reminisced with a kind of lucid thought that hours of hallucination leaves me with. As soon as I walked in my door I cracked another beer and began to scribble notes for the night down, maybe it was just the alcohol but dimly I could still feel the effects of some drug as I wrote.\n\n\n"
}
