{
 "title": "One Thousand Years of Lupin III",
 "author": "Osirisisdead",
 "citation": "   Osirisisdead. \"One Thousand Years of Lupin III: experience with 2C-B (ID 34193)\". Erowid.org. Sep 16, 2008. erowid.org/exp/34193",
 "substance": "2C-B",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "18 mg",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2004",
   "34193",
   "Male",
   " ",
   "Not Given",
   "Sep 16, 2008",
   "Views: 3295",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had my first heavy psychadelic experience this past Friday evening.</p><p>I spent the weekend at the annual Anime convention that is always the first week in June. Imagine 10,000+ nerds, goths, ravers, freaks etc. All staying in a hotel for three days. It's a weird place without drugs. I hadn't slept since Thursday morning because we just did stuff all Thursday night and I never got a chance to sleep.</p><p>At 9pm I ingested ~18mg of 2C-B in a gelcap. The onset and coming up lasted for quite a long time. I was hanging out with a bunch of goons who were causing trouble and gooning around as well as some of my non-goon pals. My two other friends also took some other drugs. AMT ~25mg (I think), and 2C-T-7 (I don't remember his dose) respectively.</p><p>Open eye visuals started getting really intense at about midnight, I think. After the 2C-B really kicked in, time and perspective didn't make much sense and I couldn't really tell how far away things were or how much time had passed. Sound was echoing into infinity whenever I closed my eyes and it felt like I was falling into an empty space, I knew that I couldn't go there because I was in a public place, so I opened my eyes and snapped back into the real world. </p><p>At some point, some of the goons left and we were going to head up to the observation deck at the hotel, so my friends led me to an elevator and we got inside. I don't know how long I was on that elevator, but it seemed like a long, long time. It was one of my more lucid moments with only a minimum in weirdness. We couldn't get to the observation deck because the floor was closed so we went back down and exited the elevator. We got on another elevator to go back to the room... it might have been the other way around, but I can't remember. I had an impression of two different elevators in my memory, but I can't place the order.</p><p>After the elevators we went inside the hotel room and everything was glowing in the darkness, in retrospect it was just because my pupils were incredibly dialated. We sat outside of the room on the floor for awhile, the patterns on the carpet were shifting and moving. At some point I dropped off all of my stuff except for the room key, my Con badge, and a schedule. They took me down to the video rooms where they were showing some anime around 1am. At this point I wasn't capable of walking in a straight line and I had to be held onto. The world was bright light and color until we sat down to watch the last half of Lupin III. </p><p>Talking with my friends after the experience, I didn't understand what the hell was going on with the anime, the characters were morphing back and forth and time was flowing in both directions at once. Every once and a while things would slip back a few seconds and repeat. The very end of the movie had this scene where the bad guy gets crushed between the hands of this huge clock tower. I remember my jaw dropping in awe when the tower started collapsing (I don't know why it was collapsing) and I realized that it was the end of the Lupin universe. </p><p>After Lupin, this weird show that was a live action version of Boogiepop Phantom came on. I didn't really know what was going on, but it was creepy. During this entire experience there was some Japanese pop group giving a concert next door. All of the screaming con-goers sounded like the screams of the damned. So I was watching Lupin with demons screaming in the background, it was... interesting. At this point, I think it was about 3am, and we wandered around, I think we went back up to the room and bullshitted for a few hours about our experience. We sat in the dark and the lights on the buildings outside were hopping rooms and then snapping back to their original position. </p><p>I was able to get some gum from one of my friends because I was grinding my teeth so hard I was afraid I was going to break something. After an hour or so of sitting in the dark we grabbed the TV and the GameCube out of the room, set it up out in the elevator lobby on our floor and played an imported japanese fighting game, Naruto 2, for a long time. My friend who took the 2C-T-7 and I thought we were done with our jouney, but we realized that the shadows down the hall were shifting back and forth like the lights were swinging, but the lights were fixed into the ceiling so that would have been impossible. The patterns on the floor looked like they wanted to move but they were being held into place against their will. We weren't quite done. We played the fighting game until 6 or 7, and I decided it would be a good time to take a shower. I got in the shower and enjoyed the hot water and washed up, my legs seemed like they were about to collapse, I was going on 42 hours with no sleep at this point so that was most likely the cause. I ended up falling asleep on the floor for about 3 hours from 8am-11am (I think) and woke up feeling like a million bucks. I then got up and continued the con with no ill effects.</p><p>As I said, this was my first heavy psychadelic experience, and it was a doozy. I will probably be doing something similar again in the future when I have the time and inclination.</p>"
}
