{
 "title": "Be Careful!",
 "author": "OSKR",
 "citation": "   OSKR. \"Be Careful!: experience with Salvia divinorum (ID 34242)\". Erowid.org. Jun 9, 2004. erowid.org/exp/34242",
 "substance": "Salvia divinorum",
 "bodyweight": "68 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34242",
   "Male",
   " ",
   "Not Given",
   "Jun 9, 2004",
   "Views: 10421",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I consider myself to be a very experienced user of recreational drugs, but nothing I've ever tried has come close to this. I now think Salvia is extremely dangerous, read on to see why!</p><p>I was at a festival in Brockwell Park London, the annual Free Cannabis festival, which I have attended before and love to death. It is perhaps the biggest free festival in London. It was about five pm in the afternoon, and there were about ten thousand people in the park, almost all of them intoxicated on some substance or other. People could be heard calling out their wares: 'ecstasy, three for ten pounds!' etc. In short, it was a very strange environment to be in, and not the most pleasant to undergo an intense hallucinogenic experience.</p><p>I taken a few different substances already that day, a bulb of nitrous oxide, half a joint of marijuana, and two glasses of red wine. I had also consumed about half the cap of a very small pcylocybin mushroom (also legal in London) about an hour previously. I have generally a good tolerance for these substances, and felt more or less sober.</p><p>An excited friend directed me to a stall where people were smoking salvia divinorum. I had smoked the salvia extract on two separate occasions, each time displaying the appropriate austerity. On these prior occasions the drug had absolutely minimal affect. This time there was only the herb, not the extract on offer, so I considered that there was nothing to fear. How dangerous can it be? It's legal and it only costs one pound to try.</p><p>I smoked a large cone of the herb from a highly efficient water pipe, held the smoke in my lungs until I began to cough, and then went back for another lungful. That was the last thing I remembered. My friends told me later that I collapsed on the ground with my eyes rolling back in their sockets. Apparently after a minute I stood up and began walking randomly accross the park, stumbling and falling over sporadically.</p><p>The first image I can place is sitting in a circle with some of my friends around me, and the man who was running the salvia stall looking very concerned. The world had the texture of rubber, and I regarded it as a two-dimensional object which I was trying to crawl back into. The object was comprised of legs and arms and the sounds of the festival. It seemed as if I could crawl back into my life at any point I wanted to, or access all points of my life simultaneously. It was utterly horrific and I felt incredibly alone (amongst ten thousand people!). I had a strong solipsistic impression, of being alone in a void, or a cell, with all the colour, smells, noises, stimulation of the outside world blurred together into a nameless white and raining down on me. There was nothing particularly enlightening about this experience, it was equivalent to being flushed down a sewer. I felt an intense psychic pain and I repeatedly asked my friends to make it stop. They were also shit-scared. I would have screamed or cried, but I was incapable of it.</p><p>It was about ten minutes after this that I could accept that I had taken a psychedelic drug. It seemed incredibly difficult to remember who and where I was. I asked my friends how long it had been since I took the salvia, and it had been about twenty minutes. In short, there were about ten minutes which I couldn't account for. The guy who was running the stall had been with me the whole time, and feeling very guilty. He said about one in a hundred people suffered such a strong effect. I experienced minor symptoms for about the next half hour, but remained shell-shocked for about an hour after that.</p><p>So I think this is dangerous for a few reasons. One, it produced a black-out affect in me, where I wandered around utterly senseless. Do not do this alone. Two, it is legal, cheap and readily available, without any warning or indication of effect. Three, I had taken it twice before in stronger doses, so why the hell was the effect so remarkably intense this time? It seems to affect people much more randomly than most drugs. </p><p>Be careful!</p>"
}
