{
 "title": "A Beautiful, Natural Experience...",
 "author": "Khayman",
 "citation": "   Khayman. \"A Beautiful, Natural Experience...: experience with Mushrooms - P. cubensis (in Chocolate) (ID 34246)\". Erowid.org. Oct 14, 2004. erowid.org/exp/34246",
 "substance": "Mushrooms - P. cubensis (in Chocolate)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms - P. cubensis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 34246",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 14, 2004",
   "Views: 7247",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had taken psychadelic mushrooms on two seperate occasions before.  Both times, I had experienced very strong trips, however both times I had done close to twice the recommended dosage.  My most recent experience had been somewhat of a scare for me, and I had spent much of that trip experiencing very bad thoughts and hallucinations.  In retrospect I had thought about what that might've been meant to teach me and I felt prepared to approach the mushroom again, this time with more respect and a proper attitude.  My advice: Mushrooms are more than a 'drug', there is something magic about them, but one should respect them and not approach them from a purely hedonistic standpoint.</p><p>My friend invited me to a small party he was having where some folks were going to be doing them.  I was especially excited for two of my friends who were going to be trying them for their first time.  He had obtained some chocolates with the mushroom ground into a powder and mixed in.  He said that 3/4 of a chocolate had 'put [him] on the moon', however there was no exact measure of potency or quantity. I cut my chocolate in half and gave the other half to my friend.  It tasted very much like plain dark chocolate but there was that faint aftertaste that indicated what was really going on.  I sat alone for a while and chewed slowly and calmly, focusing on my breathing and practicing paying attention, trying to overcome my fear and trepidation.  When all of us had finished our chocolates, my girlfriend who was staying sober drove us over to a nature preserve nearby for a hike.</p><p>In the car on the way I started to feel the effects.  First a slight numbing of my sensations and a little feeling of being too cramped in the back of the car.  We were only a few blocks away at that point, however, and I was able to get out in the parking lot and get a little space.  I stayed with my two friends who were experiencing for the first time while my girlfriend went to ferry back the rest of our party.  We talked a little bit and I began to point out to them the lovely reds of the poison oak plants that were covering the trees, and how amazing the trees were as they waved back and forth in the breeze.  I took them over to look at an anthill and pointed out the smooth stones at the bottom of a nearby dry creekbed.  They were starting to feel the effects and were responding really well to the visual stimulations and things I told them to think about.  The world around me was almost slowly rippling, as if I was looking out from a still pool.  Colors started to seem more vivid and I felt an intense connection to nature.  It was early evening, about 45 minutes before the sun started to set and very comfortable.  Once the rest of our group arrived, we began walking.</p><p>After a little bit of walking I began to experience the flood of thoughts that come at me while experiencing mushrooms.  I had very light visual hallucinations, more a feeling of greater appreciation for the beauty around us.  I put on my headphones and tuned my mp3 player to a series of tribal percussion performances and traditional songs from around the world.  Though I didn't know the words, I could feel the celebration within the songs.  People singing about life, the earth, nature, the harvest... and there I was amidst such a beautiful setting.</p><p>We reached the end of the trail about a half hour later.  It wound up a steep hill to a little sitting area at the top.  Some of us chose to climb all the way up and watch the setting sun.  It was slightly overcast during the day, so the rays cut colorful swaths through the clouds as the sun set and the evening breeze tickled us.  I stood with my friend, L, and we would just look out and watch it all and then smile or laugh at each other at how beautiful it all was.  I felt so amazingly connected to nature and to my friends all I could do was laugh...  so much joy.</p><p>As the sun hit the horizon, we started walking back towards the cars.  I talked with some friends as we walked for a while, but eventually put my headphones back on.  This time listening to a live album by a melodic trance group called Hybrid.  With mushrooms I pay attention to details that would otherwise be lost.  I was thinking about my place in the world, my connection, and thinking of the earth as a mother to me.  At that time a song called 'High Life' came on.  Part of it has a woman's voice repeating over and over 'Together...  forever...'.  Usually it fades in and out of the track, however this time I heard it clearly and danced along the trail back to the cars with a huge smile on my face.</p><p>All in all, I wish I had taken a little more than I did.  I wanted something a bit stronger, however I think that the experience being with nature was definitely one of the best I've ever had.  I intend to repeat the experience before too long.</p>"
}
