{
 "title": "Too Easy To Fall In",
 "author": "Mr. Clean",
 "citation": "   Mr. Clean. \"Too Easy To Fall In: experience with Cocaine (ID 34256)\". Erowid.org. Dec 12, 2007. erowid.org/exp/34256",
 "substance": "Cocaine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 34256",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 12, 2007",
   "Views: 3950",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>These are my experiences with coke, first a little background.</p><p>Most people start young, I didn't really do anything until I was 18 and working, so I already had a fair bit of life experience before trying any drugs. I became an avid pothead for about 3 years, and they were the best years of my life in many ways! I wish I could go back, but coke changed it all.</p><p>I had tried a line here and there in the end of high school, but I didn't buy any until the fall of 2002 when I had a good job and my pot dealer could get me blow regularly and it was easy. So I bought some. I was so excited about finally having my own stash to try, and the first little line or two I took it easy, and only felt the effects a little bit.</p><p>Then I took a gagger (a fat rail) and it hit me fully for the first time ever. 'Go' by Moby was on my stereo, and my heart started beating to the beat. I felt so alive, I can't remember but I think I danced around my room for a bit. Then I snorted another line and sat back with my guitar. I played some of the best riffs I've ever come up with, I never had that much creative energy when smoking pot. Then I settled down as I had work the next day and I did not want any kind of hangover. I remember feeling euphoric the next couple days at work, kinda like the big man around the job. I got in the habit of having one or two lines after work, and that was it. Just to feel it's effects and 'experiment' in my mind. I told myself I was only going to buy one 8 ball (3.5 grams) and that would be it.</p><p>Well my mom was getting on my nerves, and I decided to buy a second ball when the first ran out. That's when the trouble started. I started taking a line after my mom would fight with me, to forget about the bullshit and feel better. It helped and she calmed down, and I was doing really well at work. This went on for a little while and I felt fine, a couple times taking the train to work in the morning I still felt mashed from the night before, but rarely did it affect my work.</p><p>Two things happened to me that scared the shit out of me. I was staying in a motel once and I had work the next day. I didn't even realize the time fly by, but all the sudden I looked up and it was 5 in the morning and I was still doing rails. I tried so hard to look sober at work, and I don't think anyone noticed, but it scared me. Another time I had to go pick up a relative on short notice, and I was already fried, and I was starting to sketch out while driving. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I'd rather not repeat everything that happened but the whole event made me see myself from other peoples eyes. It scared the shit out of me. I never bought it again after that. I did finish what I had though.</p><p>Since then I haven't been able to smoke pot, and it took me almost a year to feel 'normal' around people again. I never had an addictive personality before this experience, but it really changed me. It's been over a year and a half since I touched the stuff, and every once in a while I think about it and my heart starts to beat. I could get it in a second if I wanted it, but I don't. In the long run the only thing coke gave me was a long lasting headache. Many people will tell you it's very bad, but when you try it you think 'Hey, this doesn't affect me that much' but it's a habit, and once it's in you it's hard to get out.</p><p>I'm glad I came out clean, I've got the same job still and it's going great, and my life is really starting to come together piece by piece. I wish I could say the same for friends of mine that got caught in the same trap.</p>"
}
