{
 "title": "Magnificent Connection",
 "author": "Nuclearnavyman",
 "citation": "   Nuclearnavyman. \"Magnificent Connection: experience with MBDB (ID 34265)\". Erowid.org. Jun 11, 2004. erowid.org/exp/34265",
 "substance": "MBDB",
 "bodyweight": "156 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "MBDB",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 34265",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2004",
   "Views: 11055",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The setting was my house with my girlfriend and one of her friends. For the first hour and a half we spent inside the house but then moved outside for the remainder of the experience. Being outside (It was a warm, cloudless night) made the experience much more introspective. I suggest to anyone trying this drug to spend thier time outside,  because it really let us get the most out of the experience. Both my girlfriend (Jackie) and her friend (Lauren) took 250 mg and then at the 3 hour point took another 250mg. The booster dose was not as effective as I had thought it would be. I definitly reccomend against redosing. All it does is drag out the uncomfortable comedown. Jackie, who has done almost no drugs her entire life, had a little bit of a rough time but still enjoyed the experience very much. It seems that in less experienced drug users, the drug could take longer to kick in and last longer than in the experienced drug  users. This can be dangerous because when everyone else starts feeling it and one person doesn't they might try to take more. Don't do this. In my experience the substance can take anywhere from 30 min. to 2 hours to kick in, so be patient. </p><p>Onset time is very dependant on stomach contents. The less I have in my stomach the quicker it will kick in. Also, eating is easy while on this substance so if I am hungry, I take it before eating. I nor anyone else I have used this with has ever had a problem with nausea. What I try to do is go 12 hours without eating, take the pill and then eat a huge meal. This seems to increase the intensity and comfortablness of the experience. Communication was great. Worked out alot of problems with Jackie. This substance proved to be a very theraputic tool for my relationship. It allowed us to talk about emotional issues without holding back and also helped in recieving what the other was saying without judgement. I could really start to see where she was coming from, when before I could not understand her at all. The effects lasted about 7 hours for me. Jackie and Lauren had to go to work that morning so they stayed up until they had to go to work. I got about 6.5 hours of sleep before going to work. Jackie and Lauren said the effects lasted for most of the day. This might have something to do with the lack of sleep though. </p><p>As far as aftereffects the next day, they were all positive. I had alot of energy. I work in a highly technical facility which requires alot of concentration and quick reaction time. Neither of these were affected. In fact I found it easier to concentrate. But this could be because I am a more expirienced drug user. (Jackie who had a somewhat difficult time coming back to reallity and functioning at her job). There was a slight headache when I woke up but it was easily remedied by drinking a big glass of water. I can definitely compare this drug to ecstasy only it doesn't last as long and isn't as intense. The initial rush is just like 'E' but it fades after about 45 min. Taking more really doesn't help this much. It seems that there is a certain point were taking a higher dose doesn't make the trip better but makes it uncomfortable. So don't think that if you take more it will be more like E. PLEASE!!!, do not use it irresponsibly. One person could ruin it for everyone. Don't give law enforcement agencies a reason to make these legal research chemicals illegal.</p><p>May all your experiences be extrodinary ones,</p><p>                  Steve</p>"
}
