{
 "title": "Just  Awesome!!",
 "author": "Maddog",
 "citation": "Citation:   Maddog. \"Just  Awesome!!: experience with 2C-I (ID 34276)\". Erowid.org. Feb 29, 2008. erowid.org/exp/34276",
 "substance": "2C-I",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-I",
   "(capsule)",
   "  T+ 0:00",
   "1 repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 1:30",
   "1 repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 2:30",
   "1 repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 5:30",
   "1 repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34276",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 29, 2008",
   "Views: 3579",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had wanted to try 2C-I for a little while now, and last night, me and my friend tried it for the first time with another friend who's done it before. It was around 5pm and me and my friend were smoking bong after bong...waiting for our friend to show up with the 2C-I. Finally, around 7:30 ish, he shows up with 3 doses. We each take our 20 mg dose which was inside a gelcap just before 8pm and we start waiting. We took it on an almost empty stomach so we would wait until we start tripping to eat and drink. We were all anticipating a great experience from this drug. We chill and talk for almost an hour, then we started smoking more bongs and watching tv at around 9.\r\n9:00pm: Moderate body buzz... i feel really good and energized. Also noticed light visuals (tracers), a sign of things to come. We start eating and drinking light snacks, the weed made us hungry and a bit thirsty, i think the 2C-I also increased our thirst a bit.  \r\nWe kept watching tv, Pitch Black started a 9 and it prooved to be an awesome movie to watch!\r\n10:00pm: Really good visuals and excellent body buzz going strong. The sound coming from my crappy 100 watt 2 speaker setup for the tv now sounds like its coming from a 500 watt high tech 5.1 (5 speaker setup) surround sound system. In other words,the movie sounds amazing (sounds 3D), i can definitely feel and even see sound (especially when theres lots of bass). I look at my shag carpet on the floor and it looks like its alive and moving. It's Very hard to focus on specific objects and my pupils are heavily dilated as i look in the miror and see my blurred face shifting and melting. Cartoons look awesome too, i see lots of patterns and bright lights/colors; when i look at the tv, everything actually seems brighter and seems to be shifting or transforming before my eyes. We keep smoking weed and have a cigarette. \r\n10:30pm: Probably peaking at this point. Feeling same as described above but slightly more intense, no paranoia at all at any time. \r\n11:00pm: Visuals are still going strong, Pitch Black was so awesome to watch! Pupils are still very dilated and we're all wide awake, no loss of coordination whatsoever, feels like i could run around the block.\r\n12:00am: We go out for a drive and walk in a public park to shoot some flares. It's a really nice mid-june evening out and the sky looks more interesting than usual. The flares are really bright and loud, we get back home before we attrack any unwanted attention. Visuals are starting to come down, and i hardly notice a body buzz anymore, but everything still sounds better and louder. \r\n1:00am: We're still smoking bongs and listening to some tunes, the weed buzz starts to overpower the 2c-i buzz, our bodies are exhausted, yet we've been sitting down almost all night. Pupils are still huge!\r\n2:00am: Coming down, we hardly feel anything significant from the 2c-i, i just feel really baked. My pupils are still dilated, hardly any more visuals, my 2 friends are about to leave  so we have a last cigarette and a last bong. \r\n3:00am: I keep listening to music and watching tv until 3am when i start feeling a little tired. I go bed and try to sleep, probably takes me about 30 minuted to fall asleep.\r\n11:00am: Wake up feeling really good, no hangover of any kind, i feel awake and energized and ready to go to work in a few hours. \r\nOverall i really enjoyed this chemical. Some of the best visuals and sound i've ever experienced and a great body buzz to boot with absolutely no paranoia during the whole trip. Definitely something worth experiencing.\n\n\n"
}