{
 "title": "The End of the World Behind an Eyelid",
 "author": "Todd",
 "citation": "   Todd. \"The End of the World Behind an Eyelid: experience with Cannabis & Hydrocodone (ID 34283)\". Erowid.org. Jul 5, 2007. erowid.org/exp/34283",
 "substance": "Cannabis & Hydrocodone",
 "bodyweight": "152 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 tablets",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 1:00",
   "10 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 34283",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 5, 2007",
   "Views: 14990",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This particular experience blessed me about a week ago.  I had just recently gotten my wisdom teeth out and had a plethora of Maxidone (vicodin) painkillers remaining.  I decided to take a little more than the recommended dosage and see where it left me.  </p><p>At about ten o' clock at night I dropped three Maxidones, 2 is the recommended dosage for 'high' pain, and waited for them to kick in.  As I had not eaten for a few hours, the effects hit me pretty quickly.  After about twenty minutes my limbs took on a numbing sensation, something I can equate to weightlifting for a prolonged period of time.  The feeling worked its way up my legs into my torso and finally, after about a half an hour, I was beginning to have a hard time reading the font on my computer screen.  Words blurred together and the music I was listening to began to take on a relaxing hum.  About an hour after ingestion the effects were peaking, and I was having a tough time concentrating my eyes on things that required attention to detail.  I stood up and observed a sort of floating sensation, then the feeling that I was going to fall over.  I steadied myself and thought that it would be a good time to try out some spectacular bud I had recently purchased.  </p><p>I hobbled to my bedroom (the rest of my family was fast asleep upstairs) and pulled out my pipe and my stash.  By now I was having a moderately tough time moving in coordinated strides, something I'm not usually used to in that I've played football for six years now.  I faught what I could then bobbed my way outside.  The pot was covered in white crystals that I was actually afraid was cocaine or pcp at first, but my long-time dealer told me it was just loaded with thc.  Indeed, it was.  In two years of smoking I had never seen such dank material.</p><p>I loaded a moderate bowl, and in a haze smoked it in deep, prolonged hits.  Usually I cough a bit when smoking, as I don't smoke more than twice a week, but I've figured that the codeine in my system laid back my cough reflex.  The effects came almost immediately, and I felt that if I didn't get back to my room fast I was going to fall over and not get back up.  I walked - more disoriented and slower than ever - back to my room and waited for the herb to peak.  It didn't take long.</p><p>Let me say now that the marijuana I smoked that day will never be beat by anything I will ever smoke again.  It was gorgeous.  I put on some 'Thirteenth Step' by A Perfect Circle and just disappeared into a haze of nothingness.  My body floated around a void that circled into a drain, I felt like I was being tugged into a black hole from which there was no escape.</p><p>However, I feared nothing.  I opened my eyes, seeing my ceiling as never before.  I was actually on the ceiling now, the fan above me spinning below me.  Somehow gravity had shifted during the past few moments and I was floating.  I closed my eyes again and enjoyed a mass of spiraling textures and suddenly darkness.  A child walked across a plain behind my eyelids and sat on a swing, beginning to rock back and forth.  The music determined his rhythm.  I began to drift again, simply a human brain being taken through a tour of the universe.</p><p>I started to hear voices, something I contribute to the hydrocodone, in that when I get relaxed while using opiates I usually hallucinate, somewhat, voices. I opened my eyes.  Nothing.  It was complete darkness, my life had ended but my brain and mind had somehow prevailed, living together in what was left of the universe.  I saw how it ended, a massive explosion beginning with a large star and evaporating everything in the supernova's path.  I opened my eyes.  A clock on my right told me that it was now two thirty in the morning; my high had taken up almost five hours of my life, something that seemed to take mere seconds.  I sat up, the vicodin reminding me that using a machine now would not be a good idea and laid back down.  The music drifted on, and I drifted off.  </p><p>I had a vivid dream about aliens visiting our planet, offering peace that night.  I woke up very well rested, however a bit groggy and unmotivated. I spent the rest of the day watching movies and going over the night before.  I'll never forget that night.</p>"
}
