{
 "title": "Oneness",
 "author": "Patience Little Bear",
 "citation": " Patience Little Bear. \"Oneness: experience with 5-MeO-DMT (ID 3429)\". Erowid.org. Oct 22, 2000. erowid.org/exp/3429",
 "substance": "5-MeO-DMT",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3429",
   "Female",
   "",
   "Not Given",
   "Oct 22, 2000",
   "9458",
   " "
  ]
 ],
 "report": "<p>\nHonor and respect for this substance are crucial as well as the mindset of being open and present to all that occurs. It is a purification of the highest order. </p><p>Smoking 5 to 10 mg. the higher the dose the more the death/rebirthing quailites surface. It is an experience of oneness, and the Divinity within each of us that I experience as Being One with the Source. When you can surrender completely and allow the experience to unfold you will be shown the True nature of the Divine we all are. I can feel my body clearing and shifting on a cellular level, there is a lot of cranial shifting that occurs for me, and a sense of total surrender and letting go. It took me 3 journeys to finally surrender completely the first time I encountered 'soma'. </p><p>I will describe the first journey on 10mg. I could see tons of information coming through me. I was not able to surrender completely and felt like the funk of 26 thousand years was passing through me as the birther and the birthee. As I was coming back into my body and the ego self was returning I was rather pissed off at having to hang on to a body, but I saw how much of my authentic self I had already recovered from previous healing work I had done in the past. The next day I went again, (10mg). I was able to surrender to the place I had gotten to the day before quickly and move past that to experiencing life flow through me without trying to hold on to anything and just being the observer. later that night I developed a migraine as the last remnants of resistance in me were building, and the ego was dying a slow death. The next am I took (10mg) for my last journey for I knew what I was looking for was in there somewhere..PEACE. I surrendered quickly and after sometime  of floating in the 'void' </p><p>I experienced myself decending into the earth dying and staying in that space for a while then being pulled up into heaven with God and experiencing a beautiful light and then being resurrected back into my body. this total experience which is challenging to describe, there is so much wonder, healing, clearing, awe and LOVE.</p><p>It was actually my 9th or 10th journey before I was able to bring the Love back with me.. I also try to connect with the space naturally as often as possible to where you can tap back in with one breath and then deepen in to it. This is a HUGE Teacher for me..it shows me things I need to let go of to BE in that place of oneness/the void all the times..to be at peace with myself, and all my relations and healing for the planet.</p><p>I highly recommend having someone facilitate you who can hold the Space of Oneness while you are on this Journey.</p>"
}
