{
 "title": "Almost too Much",
 "author": "Begbie",
 "citation": "   Begbie. \"Almost too Much: experience with 5-MeO-AMT (ID 34305)\". Erowid.org. Mar 12, 2008. erowid.org/exp/34305",
 "substance": "5-MeO-AMT",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34305",
   "Male",
   " ",
   "Not Given",
   "Mar 12, 2008",
   "5748",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had orderd some 5meoAMT to try it out I had read alot of the reports here online and the drug sounded to be pretty good overall. I was not worried about taking a drrug like this because I have had many experiences with acid, shrooms, mescaline, and almost any other drug you can name.</p><p>When the stuff finally arrived I attempted to weigh it out. I warn anyone that is using a scale that weighs to the nearest 10mg to be careful. First off it is nearly impossible to get an accurate reading and you could get anything between 10-20mg. I had decided to take 10mg of the stuff for my first time having much experince. When I tryed to weigh it out though I could only get the scale to read 20mg so I said screw it and took it anyway. I warn anyone who does this this substance was extremly strong and I could have taken as much as 29mg a huge dose espically for first time use.</p><p>I dosed at 8:00 p.m. the powder was consumed straight up. It was bitter but not that bad. Within 10 to 20 min. I felt sick, this continued for 45min. It was rough but easier to hold down than a bottle of cough surup. The rise up to the trip was similar to DXMin that I felt sick but had a buzz at the same time. At the hour mark the nausea was gone I remember the visuals hit me very quickly. </p><p>I was in my friends basement watching t.v. and when the person moved their hand a noticed a tracer. When I looked at the room everything was alive.It was wonderful the visual were amazing for this early in the trip. When walking home the clouds were amazing they swirled around in the sky I felt like the whole world was a painting. Standing outside my house the grass was sparkaling (sorry about the spelling) and looked as if it was growing right in front of me. I was great until I got inside my house. I started feeling very shut in and nervous someone in my house would see me tripping. So I bit the bullet and went up to my room and laid down with the lights off to avoid anyone. From here the trip became stronger than anything I have every experienced full on CEV's and OEV's to the point that I could no longer tell if my eyes were opened or closed. Sound were completly distorted and digital. </p><p>Then I had to piss so I had to walk to the bathroom in the dark (could not of found lightswitch) I made it and just prayed I was pissing in the toliet because visuals were very strong looked in the mirror and supprisingly my pupils were bigger than normal but not completely dialated.Motor functions were shot like being drunk and I felt very hot like I had a fever. The visuals lasted 13 hours before they tappered off I did not feel the same for at least 2 days after though.</p><p>In retrospect this stuff is great I think I took way to much but then again it could not have been to much because I am still alive. Be careful this stuff is really strong. No craps after dosing but a little hangover and i had tremors in my hand the next day. I will try it agian because well I bought a good amount.</p>"
}
