{
 "title": "Mild Stimulation, Slight Visuals",
 "author": "Persistent",
 "citation": "   Persistent. \"Mild Stimulation, Slight Visuals: experience with 2C-C, Heroin, Cannabis & Zolpidem (Ambien) (ID 34312)\". Erowid.org. Jan 10, 2010. erowid.org/exp/34312",
 "substance": "2C-C, Heroin, Cannabis & Zolpidem (Ambien)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "IV",
   "Heroin",
   "(tar / resin)",
   "  T+ 0:30",
   "12 mg",
   "oral",
   "2C-C",
   "(powder / crystals)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 6:00",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 34312",
   "Male",
   " ",
   "Not Given",
   "Jan 10, 2010",
   "Views: 5499",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>Last night I tried 12 mg 2C-C orally. Oddly, this was stronger than the 15 mg insufflated that I did for my first experience. I had taken 35 mg methadone at about 5:30 am, then worked on some tree trimming all morning, got paid about 4:00 pm and by 5:00 I did my first shot of heroin. My tolerance is such that this shot only made me feel normal, no intoxication. At 5:30 I took the 12 mg 2C-C.</p><p>Pretty much nothing but mild stimulation for 2 hrs, some relaxation and empathic feelings with slight visuals at the 3 hr point. About the time I had peaked I left my friend J's house, hopped in the car, pulled out in front of a cop and was immediately pulled over. I had weed, AMT and 2C-T-21 on me, but for some reason didn't panic. I said something like ' I'msorrysirImisjudgedhowfastyouweregoingI'msorryI'musuallymorecareful' and amazingly he said 'Have a good night, be careful.'</p><p>I then drove very carefully to my friend B's house and hung out there smoking weed until I was nearly sober. We had long animated discussions about our experiences with various psychedelics and I felt very clear-headed and social.</p><p>I drove home about 10:30, felt perfectly clear and sober but vision is still slightly altered. Once home I inject the rest of my impure Mexican Tar heroin and read some trip reports. This shot I felt a little, and with the help of a little weed and 10 mg Ambien at 11:00 I am sound asleep by midnight.</p><p>It is very interesting that I had such a noticeable 2C-B-like effect this time when I barely felt a larger insufflated dose last week. Perhaps it has something to do with all the low dose AMT I've been doing every day as an antidepressant, or perhaps I just needed to learn this material.</p>"
}
