{
 "title": "My Awesome Night",
 "author": "D-man",
 "citation": "   D-man. \"My Awesome Night: experience with Morning Glory (ID 34325)\". Erowid.org. Jun 10, 2007. erowid.org/exp/34325",
 "substance": "Morning Glory",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "310 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34325",
   "Male",
   " ",
   "Not Given",
   "Jun 10, 2007",
   "Views: 3838",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me start with some background, I am a junior in high school and I am experianced with a few drugs, including alcohol, weed, dxm, codeine, I took a lot of ridlen and Adderall because I loved the effects (helped in school), nutmeg, which I love, and pain pills. I've never had any hardcore drugs such as acid, crack, cocain, heroin, or shrooms. Tho have tried to buy acid and shrooms, but where I live is hard to obtain drugs of that magnitude. So I figure I'd try the next best thing. </p><p>Well, yesterday I thought it was all good and fun to have my mom go to the store to get some seeds that I would 'Plant'. As the situation prevailed, they had no seeds, neither did the second or third stores I tried. So I tried another store, and finally success! I bought about a bunch of packs of morning glory seeds and 2 packs of other plants to actually plant, lol!</p><p>So, I took the 310 seeds at about an hour after work on Friday, so about 10:35. I didn't wash them, witch was stupid. I didn't grind them up or anything, just tossed em in my mouth and chewed, it was a disgusting taste. At first its not bad, then when I started getten nauseated and I despise that taste in my system. </p><p>10:40 - I stayed on the internet and talked to two people to help guide me thru the trip.   One is straight edge and the other is a frequent acid user. So I felt like I was in good hands in 2 ways. </p><p>10:50 - Starting feeling nauseated, at first minimal nausea.</p><p>11:10 - I was extremely nauseated, started to shake my head to see if I had the slow motion effect and I did, EXTREMELY STRONG SLOW MOTION EFFECT! It was insane! Like I was extremely drunk as hell or popped a million codeine.</p><p>11:20-11:50 - I was just walking around my room and noticing the amazing things that were happining. I became aware of how interesting things were. I became incresingly hungry. I went to the bathroom in my room and TRIED to puke so many times, I was FUCKEN SICK of that feeling! </p><p>12:00 - Slight decrease in nausea.</p><p>12:10 - Nausea gone completely. </p><p>12:15 - I got lost in how interesting my carpet, mousepad, bed sheets, bed coverings, and posters on my wall were.</p><p>12:20 - I was completely MINDFUCKED. I was sitting in my swivel chair next to my computer totally mindfucked!! I was sitting there looken at my big huge poster of a surfer and I wasn't thinking of anything. Then all the sudden it started rolling slightly like a big ball was under it, then it stopped! I WAS AMAZED! I'd never seen anything like this before! I immediatly alerted my friends about this amazing specticle!!</p><p>12:20 - 1:00 - Watched how amazing the visual halucinations where. At one point I went to my kitchen and tasted all the food we had cause it tasted SO AMAZINGLY GOOD! I especially loved a box of strawberry shortcake ice creams and brought them down to my room and ate them all. Throughout this entire experiance I had a smile STUCK to my face, and was acting very very drunk and kid like,which the frequent lsd user assured me is normal, Except for the drunk part, Morning Glory Side Effect!</p><p>Between 12:20 - 1:00 I called my friend J and was talking to him who he said I sounded so stupid and laughed a lot about me, and I rolled down the side of my bed on the fone and landed on the carpet...lol. I also could barely walk at all. My muscles were so tired, I had to crawl or carry myself by holding onto my dressors.</p><p>At about 1:25 I laid down after signing offline. I kept feeling like someone was hammering my knees down into the bed, it was awesome. And when I closed my eyes I dont think I 'saw' anything but the entire intensity of the trip would get insanely worse! Like I would close my eyes and feel the room flip upside down, or feel me sink spiriling into the bed! Actually feel it, it was amazing! 1:30 came around and I was tired and worn out. 1:45 came and I noticed the huge tracers off my digital clock, like the green color from the #'s went up to like 4 ft off of it. </p><p>I wanted to go to bed so bad. I ate to much food and my stomach was hurting like crap. I tried to lay on my pillow which was way to big, so I went to my bro's room and grabbed a bear which was better :) O yeah and durring the time layen on the bed I watched Z3 on disney, Zennon 3, and I think that girl was the hottest girl Ive ever seen. I think differently after watchen it again, but last night she was amazing :)</p><p>Well I finally dozed off after finding a comfortable position. The reason I had a buncha bad feelings after Ilaid down for a while was because my stomache started hurten then that caused a headache, then Ifreaked out a lil, and that caused uncomfortableness and a lil bad trip, no biggy tho at all. </p><p>I fell asleep at 2:00 or so, and i had no dreams. I woke up at 2:25 and was so tired, mindfucked, so I pulled the covers up to look at the clock and all I saw were tracers 5 feet off the clock so I went back to sleep with a smile and happy thoughts! My mom woke me up at 7:45 to go to work at 8. I Felt really disoriented. I Got to the store as they were opening, and I felt like crap until I ate breakfest and had a nice coke. I felt a LOT BETTER. So the hangover only lasted an hour or so.</p><p>I'm off to take my 4 remaining bags in about 2 hours.</p>"
}
