{
 "title": "Very Nice",
 "author": "tallia",
 "citation": "   tallia. \"Very Nice: experience with 2C-I (ID 34323)\". Erowid.org. Aug 16, 2004. erowid.org/exp/34323",
 "substance": "2C-I",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "18 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 3:00",
   "20 mg",
   "oral",
   "Pharms - Diazepam",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34323",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2004",
   "Views: 5732",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I finally got around to trying 2C-I after sitting on my shelf for two months, the first of the 2C drugs since my last horrible experience with 2C-T-2. From all reports, this chemical seemed to avoid some of the negative side effects of 2C-T-2, and I found this to be absolutely true.</p><p>Carefully measured out 18mg of the substance, put into a pill, and down the hatch. After 1 hour, I started to feel it coming on, very slowly, and got the usual psychedelic anxiety, which disappeared after another hour when noticeable effects began. I was very skeptical about reports that 2C-I resembled ecstasy, and yet this is exactly what I found on 2C-I, a mix between ecstasy and mild 2C-T-2, without any negative body feelings; no nausea, no body pains... only a feeling of utter lightness and mental clarity. The mind set was similar to the euphoria of a light ecstasy trip, without the speediness, and total mental clarity. I spent most of my trip talking with my roommate, a sociologist, about his 'life mission' and it was very rewarding with 2C-I. Mental barriers dropped, and I found the substance to be more effective for interpersonal communication than even Ecstasy, which exerts a little too much control over the mind for this degree of mental clarity and agility. While we were talking, I saw light trails and color enhancement, but this was secondary to the psychedelic part. </p><p>After a long talk with my roommate (around 3 hours) I was feeling a bit tired mentally, and felt like I'd dealt with a lot of life material during my trip, so I took 20mg diazepam to help end the experience, then skated across campus to my girlfriends apartment, and this was amazing! My body felt light, the colors pronounced, similar to mushrooms or acid. Overall, this trip helped me in life planning and meta-programming. I felt like 2C-I had helped me to get closer to my roommate than I'd ever been able to do, quickly getting to 'central life issues' and exploring them deeply. He said that I seemed 'normal' to him while tripping, except for the profound mental clarity. This is a wonderful substance, and I hope more research is done to assure its safety.</p>"
}
