{
 "title": "First Real Addiction",
 "author": "D",
 "citation": "   D. \"First Real Addiction: experience with Tramadol (Ultram) (ID 34402)\". Erowid.org. Jun 24, 2007. erowid.org/exp/34402",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "225 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34402",
   "Male",
   " ",
   "Not Given",
   "Jun 24, 2007",
   "8179",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>My experience with Tramadol was basically an accident.  My friend Kelly and I were at my apartment when he told me he had found something interesting in my medicine cabinet.  We looked it up on the internet, and, after but a few moments of consideration, we both took a few of the pills.  It was about 5 o'clock, and onset was slow and steady from about 45 minutes in.  </p><p>After an hour and a half, everything was wonderful.  Music was more enjoyable, conversation with my friend was a lot more interesting, and just kicking back in general felt really good.  I had no trouble driving home, and once there, I went right to bed.  The Tramadol didn't help put me to sleep like I thought it would, but instead made lying awake and simply pondering things almost euphoric.  I was also pleased that when I woke up, I was still slightly affected.  This lingering high lasted well into the school day, and I had some trouble concentrating on my work.  </p><p>The only other negative notes I have about Tramadol are that I had slight trouble urinating on some occasions, and, after I used it frequently for about a month, I found I was slightly addicted and went through mild withdrawals. I should also add that Tramadol was my first foray into the world of pain killers.   After I tried several other drugs, including Oxycodone and Hydrocodone, I found that I enjoy Tramadol more.</p>"
}
