{
 "title": "Beta Blocker Warning",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Beta Blocker Warning: experience with 2C-T-7 (ID 3442)\". Erowid.org. Oct 23, 2000. erowid.org/exp/3442",
 "substance": "2C-T-7",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6.0 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3442",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 23, 2000",
   "Views: 22633",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Summary: People with many PVCs (premature ventricular contractions) should think twice before using 2CT7. 2CT7 taken with a beta blocker may dramatically increase PVCs for several days.</p><p>The Story: I was experiencing more than the usual number of PVCs on the day that I decided to try a first tenuous dose of 2CT7. I took a beta blocker, metoprolol, and this brought the PVCs down to a negligible level. I didn't know until mid-afternoon that I would have the rest of the day free, so to avoid having the drug keep me up all night, I decided to snort it because I knew that most snorted drugs have a shorter duration than when they are ingested. Being a cautious person, I decided to first try 6 mg. My balance only weighs to +or- 2 mg, but I did the best I could weighing it. It was really a nasty bitch to snort. Damn it hurt, and for about 20 minutes! I have snorted speed, coke, MDMA, and 2C-I, but this stuff is nasty! Anyways, within 10 minutes I was definitely getting off. Not only that, I was getting more PVCs than I've ever had in my life. I took more metoprolol under my tongue, but it didn't seem to help. The trip itself wasn't that enjoyable. The 2CT7 just doesn't feel good to me. What was interesting about it was that I perceived everything in terms of energy.</p><p>The next day I was still having lots of PVCs (a few to several per minute). Being almost out of metoprolol, I decided to start taking atenolol, which my doctor had switched me to. The atenolol seemed to work (or not work) as well as the metoprolol, so I kept using it for the rest of the week. As the week went on, my heart-related symptoms became worse. I was experiencing 'bigeminy', where every other beat is a PVC, for several beats in a row. Sometimes I got so light headed I almost passed out. My doctor scheduled a halter monitor for me, which I wore for a day to record my EKG. He reassured me that some people 'miss' every other beat for their whole life and it doesn't seem to be a problem for them.</p><p>After a week of this shit, I finally realized that the more atenolol I took, the more PVCs, light-headedness, and shortness of breath I felt. I stopped the atenolol and felt 80% better within 2 days. After about 3 weeks my PVCs were almost completely gone. It's been about 2 months now and I am now completely recovered.</p><p>I may or may not have been OK with the 2CT7 if I had not taken the metoprolol that day. Metoprolol has never caused any problems before in me, and I have taken it with MDMA and with mushrooms, as well as when I am sick, which is the usual cause of my PVCs. The atenolol definitely made me worse, but I didn't start that until the day after the 2CT7. Perhaps I was sick but didn't feel sick, and the PVCs would have increased dramatically without the 2CT7.</p><p>I am sending this through an anonymous remailer and do not know how to write to a specific thread this way, so I will not be able to answer questions about this.</p>"
}
