{
 "title": "We're Gonna Have a Wonderful Trip",
 "author": "Flynn",
 "citation": "Citation:   Flynn. \"We're Gonna Have a Wonderful Trip: experience with Ecstasy & LSD (ID 3444)\". Erowid.org. Oct 24, 2000. erowid.org/exp/3444",
 "substance": "Ecstasy & LSD",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 2:15",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3444",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 24, 2000",
   "Views: 13175",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMy experience with psycho-active drugs is very limited, restricted until recently to MDMA.  Some trusted sources offered positive feedback regarding LSD, so I decided to try some about a week ago.  The experience (and apparently, the quality of the dosage) was very mild, so it seemed that the emotional effect of MDMA mixed with the hallucinogenic effect of the LSD would make for quite an experience.\r\nI decided I wanted to be alone for this, because I did not want the distraction of another person involved.  I stocked up on fluids and food, so I wouldn't need to leave the house.  I notified a couple of friends, who would be close at hand if needed.  I created a comfortable nesting environment in my home theater room, viewing chair in front of a 59' television, beverages, remote controls and phone within immediate reach.  I turned down the AC to get the room to about 74 degrees F.\r\nI was definitely *excited* about seeing what this was like.  My experiences with MDMA had been consistently positive, and my one prior experience with acid, while mild, was also quite positive.\r\nI injested the acid at about 5pm.  I knew it would take several hours to generate it's peak effects, so I waited patiently, distracting myself with television and some reading.  At about 7:15, I took a dose of MDMA (a speckled fish-mark, stacked, which I'd had before to very positive effect.)  I waited for that to kick in while watching an episode of Star Trek: Voyager -- which I think had a fair amount to do with my later experience.\r\nAt about 8, I started to experience the early speed effects I usually get with X.  I fired up my PC, which I'd earlier connected to the big screen.  I had the sound connected to the home theater (5.1 Bang & Olufsen -- yeah!).  I put on a collection of Juno Reactor, Orbital, Crystal Method and FSOL MP3s through WinAmp, and turned on the G-Force visualization program in full screen.  All the lights in the room were off, and the screen began cascading in the color rush produced by WinAmp visual programs.  I sat in the center of the music, subwoofer pounding my chair, in front of a screen with a wild, moving array of light and color.\r\nUp to this point, I'd had very mild visual effects from the acid.  I hadn't noticed visual alterations on acid before to any great extent -- particularly when watching a limited medium such as television.  The color splashes from the screen were interesting, but the effect was still isolated.  It was a TV screen, and I knew that without hesitation.\r\nEven without psycho-actives, Juno Reactor plus the G-Force visualization program is *very* entrancing.  So I had no trouble remaining beneath my blanket and watching what was happening before me.  After about 2 songs, the elation effect of the X started to kick in and that's when the subjective experience got interesting.\r\nI could feel my mind start to ignore the surroundings in the room, and focus only on the impact of the images in front of me.  The movement on the screen became the only perception of my existence, making me feel like I was *in* the swirls of color on the screen.  This effect is very hard to describe, but imagine simply standing in the midst of an environment that looks like a Star Trek special effect, and you'll be fairly close.  Or perhaps the worm-hole travel concept from the movie Contact.  I was blasted back by movement while remaining very still.\r\nThe physical effects are similarly difficult to describe.  I made a very specific effort to remain aware of what my body was doing, but even so, it was difficult to pay attention.  I knew I was trembling from the body temperature adjustments of the drugs.  I also felt that I was extremely still, even though I was rolling my head back and forth.  The movement of my head was somewhat hypnotic, amplifying the immersive effect of the screen visuals, since it felt as though I was still looking to the left and the right as I watched the screen.\r\nEvery few minutes, I would tear my eyes away from the screen and look at some other part of the room, to reground myself.  I'd see the door to the hallway and the door to the bath room.  I'd look down and see my hands as normal silhouettes against the bath of light from the screen.  I'd see the speakers and the edge of the television, and I'd remember that I was in my own home, that it was Sunday night, and that I was candyflipping in my theater room.\r\nI think this part of the experience was important for me mentally, to avoid the dangers of going through the experience alone.  Had I had a guide, I suspect I could have readily lost myself in the screen for hours -- but without accompanyment, I needed to maintain enough of a grip on my situation to avoid ignoring possible danger signals from my body.\r\nIt was in these moments that I remembered to remain hydrated, to relieve myself, and to confirm that the phone was in reach.\r\nOutside of that, the subjective experience itself was *AMAZING*.  When the color phasings on the screen would shift, my mind made incredible environments out of it.  Blue hues blended into flourescent liquids, and reds poured like fiery plasma across my awareness.  Tunnels streamed forth.  Cascading star fields crossed my vision, shifting planes, spirals and swirls.  After a while, I realized I could add my own effects, simply by thinking of them.   I'd ponder the idea of a swirl becoming a naked woman, and there it would be (picture the intro sequences to James Bond films).  I'd think that a color pattern flying across a plane looked like newspaper on a printing press, and suddenly, that's what it was.  The pulsing of the music set the experience against a tempo that was perfect for travel.  And as far as I was concerned, the experience put me in another galaxy.\r\nI phoned one of those friends in the middle of it all -- to let him know I was okay.  'There is a God,' I said to him, 'and we're having a conversation right now.'  He laughed and asked 'so you're having a good time?'  'Oh yes,' I replied, 'I'm travelling all through the universe.'\r\nI also found that if I chose to imagine a real life setting, I had no problems conjuring up images of perfect reality and dimension.  A lover appeared before me, smiling at my journey.  I found myself in my car, at the wheel of a ski boat, and with huge arcing tendrils of wings stretching beside me.\r\nThe trip lasted for about 2.5-3 hours.  But I cannot say how long it *felt*.  I was trying to reground myself every 2 songs or so, but I'd discover that I'd go to a place and snap myself back inside of 30 seconds, and then go somewhere else for 7 or 8 minutes without realizing.  It was the nexus from Star Trek: 'Time has no meaning there.  The predator has no teeth.'\r\nAt one point, I realized I'd been running my fingers through my own hair for 5 minutes!  The tactile sensation was simply incredible.  I ran my fingers along the arms of my chair like the skin of a lover, feeling the voltage up the length of my arms.\r\nI had wondered why it was called a trip, and now I know without any doubt -- though I might never have left that chair, as far as I was concerned, I explored the far reaches of the galaxy.  Dreams which feel like they last for hours in reality only take a few minutes -- and that's ultimately the best comparison I can offer here.  I dreamt experiences lasting only a few minutes, but they seemed to be journeys of days at a time -- packing a tremendous amout of experience into a few hours.\r\nIt is important to note that throughout the entire experience, I had *NO NEGATIVE SENSATIONS WHATSOEVER*.  There was no pain, no monstrous distortion, no uncontrollable imagery.  I was in a known, comfortable setting with inputs that were familiar to me.  Reality was a turn of the head away -- once I stopped looking at the screen, I could remember who and where I was, and what I was doing.  That trip through the screen pulled at me -- I *wanted* to go where it took me, but I didn't *have* to go.\r\nAfter the peak, the effects of both the drugs slid down simultaneously.  This was a bit troubling -- and left me feeling antsy and indecisive.  The feeling was not unfamiliar, as I've had it many times coming down off X, but it was amplified by the intensity of my earlier journey.  However, this lasted only about 5 minutes.  I changed my setting -- going and lying on the bed for a few minutes, then went back and watched some light pornography to divert the feeling.  It worked, and I calmed and fell asleep at about midnight.\r\nSomewhat tragically, this isn't an experience I'll get to repeat.  A commitment to a friend prevents me from doing this again.  But there are a few lessons I take with me about the experience...\r\n1) Doing it alone was risky.  I really don't think I would have taken the kind of trip that I did had anyone else been there, but it also forced me to maintain a closer grip on reality, to not lose myself in case there was a problem.\r\n2) The come down is a little tricky -- it's rather anxious, and the temptation for a lot of people would probably be to take *more*.  I have excellent experience in controlling that urge, so it wasn't a problem to find a path through it.\r\n3) Environment is everything.  Psycho-active drugs are incredibly subjective, and it seemed virtually everything about my experience was based on whatever I decided it to be based on.  So setting and mindset are key to having a positive experience.  I put myself in a familiar environment with a genuine desire to have a positive experience, and that's what happened.  Had I entered with a different expectation or had I put myself in a setting I didn't know, it could have been a *very* different experience.\r\n4) Keep an exit handy.  In this case, it was the phone and the door to the room.  If I needed to leave the transcental for a minute or two, and get back to the real, it was very easy for me to do.  I can see why people who forget to do this become frightened into negative experiences -- had I felt like this was my *only* reality, it could have been quite overwhelming.  But learning to control the trip was paramount to having a good time, and as long as I did that, it was a wonderful ride.\n\n\n"
}