{
 "title": "Watching CNN with Suits",
 "author": "Bob the Stoner",
 "citation": "   Bob the Stoner. \"Watching CNN with Suits: experience with Mushrooms & Cannabis (ID 34458)\". Erowid.org. Jul 6, 2007. erowid.org/exp/34458",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "2.1 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 34458",
   "Male",
   " ",
   "Not Given",
   "Jul 6, 2007",
   "Views: 2823",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Now, the following is my third time eating mushrooms, at the dose of 2.1 grams. Previous to this, I have done 1.2 grams and 1.0 gram, once with the same two friends as here, and once alone. So this whopping 2.1 grams would be my highest shroom dose yet. Furthermore, my friends and I tend to have a lot of trouble finding this fungus in my city, it just seems that everybody can get them, but when it comes down to it, their connect is out of town, or their mother died, or something or another comes up to prevent us from getting our mushrooms. Which is funny, because for the third time, we got our shrooms and took them at a last second decision, choosing to take them only because they were finally there.</p><p>Last night at about 9:30 my friend gives me a call. He says dude, homie's got that half o of shrooms NOW. I need the money bring a bill, Ill pay you back peace. So I cruise over. Its getting late, we dont actually get them till about 11:45. We decide fuck it, we might as well just eat them. We divided it 3 ways, 4.6 grams each, but we didnt want to eat nearly 5 grams so we decided to just pick a dose and save the rest for another time. I put a fat stem and a cap on and it came up to 2.1, leaving me 2.5 for next time. So I ate my 2.1 in a peanut butter and fungus sandwich, at right around midnight, as did my two friends, one of which took 3.6 grams, the other took 2.6.</p><p>We're watching 'in living color', its hilarious, but definitely not what Im wanting to watch on shrooms. We're starting to trip at the 45 minute point. We're not paying any attention to the tv, rather we're laughing and sharing each others visual experiences. Except the one who ate 3.6; she wasnt feeling anything, according to her. She has a lot of experience with acid and ecstasy, so it seemed like she was just not getting what she expected from them, while my friend and I were FADED and not even peaking yet with our lower doses.</p><p>I remember looking at the corner of my friends bed, he has a trippy design on his comforter that seemed to be breathing and swirling a little bit. Then I took notice of the contrast between the comforter, and the carpet which was lined up next to it. As I looked at the corner of the bed, focusing on both the bed and the carpet, I noticed that there was like this continuous 'focusing' effect, like the bed was zooming in and out, as was the carpet, but like, at different times, making it look like my vision was constantly focusing, getting closer and closer to being focused, but still just moving. Everything was moving, come to think of it. I also recall looking at the carpet, and seeing it swirl around into like a whirlpool, and it appeared to be sucking the dresser into it.</p><p>Some time after we both got into this state, where we were clearly tripping and coming up fast (I exclude the other friend because, although she was apparently tripping, she honestly wasnt having as much fun as us, or experiencing what we were). We were talking and laughing loud, chilin, being on mushrooms. Then a knock at the door. Fuck. So I open the door, it only opens about a foot because the chair Im sitting in is blocking it. My friend gets up to talk to his mom, standing at the door. She says we're being too loud (its about 1:30 at this point), and my friend does his best to look sober, apologise, and promise to keep it down. </p><p>From this second on, we spend frantically wondering where we can go. We keep getting loud and reminding each other to quiet down, and we all agree that we need to get at least outside, so we can talk and laugh like we should be. We wanted to get out of the house for the peak, basically. So we scurry around the room cleaning up like a bunch of kids on mushrooms, for some reason taking a loooooong time to finally get on our way outside. This pressure on us was a little too much for all of our nerves, but finally we get outside, and to the car, where we head to the gas station for gas and cigarettes.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>In the car, we laugh hard for a long time because, as always, everything is hilarious on shrooms. After getting gas and shit we just drive, with no particular destination. We do a big loop all around town, past my house, and back to my friends house, where we knew we couldnt go back because we would wake his parents. The peak pretty much occupied all this driving, I think we were all peaking for the most part when we were at the gas station. Oh, I forgot, I bought a giant slurpee and spilled it all over myself. It was good.</p><p>So after this big (pointless) drive, we were all beginning to come down. It was about 3:00, the friend who ate 3.6 was tired, probably bored, and not tripping like we were, so she wanted to go home. She left us at my truck, parked on the street in a neighborhood, where we smoked a bowl, then headed to my house. Got here at about 3:15 or so. When I got home, I realized how hard I was still tripping, and wondered how the fuck I drove home like this. We were both coming down, but wide awake. I looked at myself in the mirror, and my eyes were about to pop out, my pupils about the size of a marble.</p><p>We smoked a good gram or so out of my bong, and at 6:30 went to mc donalds for some breakfast (only thing they're good for). We were probably still lookin a little tripped out at that point. I found it funny we were drinking coffee and watching CNN at 6:30 in the morning around a bunch of people in suits on their way to work. I guess the caffeine helped keep me up till now, its 10:13 right as I type this. I dont know if I should go to sleep now, wake up around 5 in the afternoon, and fuck up my whole sleep cycle, or just force myself to stay up till tonight so I can normalize myself, and get a goood nights sleep later. I think thats what Im gonna do. Im really really drained right now but I also really dont want to sleep my day away.</p><p>I got 2.6 left. We're gonna save them for Saturday. Probably.</p>"
}
