{
 "title": "Like Datura",
 "author": "Dram-head",
 "citation": "   Dram-head. \"Like Datura: experience with Dimenhydranate (ID 34465)\". Erowid.org. Dec 13, 2007. erowid.org/exp/34465",
 "substance": "Dimenhydranate",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "900 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34465",
   "Male",
   " ",
   "Not Given",
   "Dec 13, 2007",
   "7140",
   " "
  ]
 ],
 "report": "<p>After reading numerous reports on dramamine as a Psychoactive, I decided to embark on a mind journey my self. I rounded up some of my friends J, A, and me, we walked up to the local grocery store and searched for dramamine. We found some eventually but we didnt want to spend that much money so I pocketed A's and mine and j paid for his (if you buy something the people at the store dont suspect anything.) so we went back to my house and asked my parents if J and A could sleep over. at this point it was about 5:20 pm or so. When it started getting dark and my parents went to sleep we took the pills, I took 18, J took 12 and A took 18.</p><p>It was about 9PM when we popped the pills, which if they get stuck to my toungue taste like immortal hell. Then we turned out the lights and turned on the TV. then about 11PM or so we started feeling it. I was gone, the high was something like datura or a strong dxm trip (without the euphoria). Soon after onset I realized that my walls were breathing and everything in my house moved shook and had waves coming off of them. at one point I looked at the chair in front of my computer and saw it fold itself in half. at this point we were all flipping out. A said he saw someone outside my window dancing in mid air, and j was confused, he kept seeing friends come in the room and start a conversation with him. It was now 12PM and everything I looked at had either distortion, waves coming off of it or did not exist.</p><p>After a while I started to forget everything, I couldn't complete a sentence, I would forget what I was talking about. And I couldnt laugh, I dont know why. I would chuckle at funny things but not as much as I would usually. Then I started to see geometric shapes that looked like snowflakes sometimes. The only bad thing was that they would float towards me and that was kinda creepy. I also saw alot of spiders. Go figure, this happens with a lot of anticholergens.</p><p>So at about 1:00Am we went out for a smoke. when I walked outside I saw my mom standing on the porch and I thought 'Oh no she knows, Im in so much trouble!' and A reassured me that it wasnt real. J was smoking away and he started talking to thin air. About that time his brother appeared in my backyard and I started talking to him. J was also talking to him and I thought he was real, a told us that no one was there. I turned to look at A and when I turned back J's brother was gone. So after a couple of smokes we went inside.</p><p>As soon as I got settled I saw a box of crayons floating in front of me, it was kinda funny because I thought it was perfectly normal. So I made a grab at it, when I did my hand went through it and erased part of it, I thought that was weird so I made a couple more grabs at it and made it disappear completely. At about 3:00 AM, I fell asleep and woke up talking. I did this alot and then fell asleep and woke up the next morning still hallucinating a little. I couldnt hold anything in my hands without shaking. My hands quivered alot. And I had a long comedown it took two days to become completely sober.</p><p>Over all we all had a great time, there are some downsides, cotton mouth, extreme lack of balance, and confusion/forgetfulness.</p>"
}
