{
 "title": "Two Weeks",
 "author": "Global",
 "citation": "   Global. \"Two Weeks: experience with Melatonin (ID 34473)\". Erowid.org. Apr 18, 2006. erowid.org/exp/34473",
 "substance": "Melatonin",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "sublingual",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34473",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 18, 2006",
   "Views: 8885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBackground: I'm 20 years old, in OK physical/mental shape, and I don't use any drug with any sort regular frequency. Rarely do I do any drugs at all at this point in my life.<br>Normally, I have a hard time getting to sleep. It takes me anywhere from 30 minutes to 2 hours to get so sleep after going to bed, usually.<br>In short, my 'sleeping schedule' is all fucked up. When I have no commitments and I just go to sleep when I'm tired, I end up staying up for about 20 hours and sleeping for around 10 hours. I also tend to be awake more at night and less during the day. My body seems to be happy with this schedule, but socioty does not.<br>So, I decided to try some melatonin for a while to see if it will help me. I've been getting to bed around 5:00 AM for the last 3 nights (it was a weekend), and I have work tomorrow at 1:00 PM.<br>These are my notes on 1-day-short-of two weeks of using 1mg melatonin sublingual tablets as a sleep aid.<br>May 31 @ 2:50 AM<br>1mg melatonin sublingual<br>May 31 @ 3:30 AM<br>Another 1mg melatonin sublingual<br>Fell asleep: ~4:00 AM<br>June 1 @ ~3:00 AM<br>2mg melatonin sublingual<br>Fell asleep: ~4:00 AM<br>June 2 @ 2:30 AM<br>4mg melatonin sublingual<br>I'm finally tired @ 2:51 AM<br>Fell asleep: ~3:10<br>I am very tired upon waking.<br>June 2 @ 2:11 AM<br>4mg melatonin sublingual<br>Fell asleep: ~2:30<br>I am extremely tired upon waking.<br>June 4th @ 2:20 AM<br>4mg melatonin sublingual<br>Fell asleep: ~3:00 AM<br>I am very tired upon waking.<br>June 5th @ around 4: something AM<br>4mg melatonin sublingual<br>Fell asleep: around 5:00 - 6:00 AM <br>I am very tired upon waking.<br>June 6th @ 3:30 AM<br>3mg melatonin sublingual<br>I am suddenly tired at 3:45 AM, went to bed.<br>No notes written down.<br>June 7th @ 1:00 AM<br>4mg melatonin sublingual<br>I awoke 6 to 7 hours later not 'groggy' or tired.<br>June 8th @ 1:50 AM<br>4mg melatonin sublingual<br>I didn't get to sleep for at least 45 minutes.<br>I slept 12 hours.<br>I am very tired upon awaking.<br>June 9th @ 4:09 AM<br>4mg melatonin sublingual<br>I went to bed at 4:14 AM.<br>I have to get up at 8:00 AM.<br>I slept 4 hours and got up, a little bit (but not very) tired.<br>June 10 @ 1:19 AM<br>4mg melatonin sublingual (after not sleeping all day)<br>I have to get up ~7:30 AM.<br>I got ~5-6 hours of sleep.<br>I was tired most of the day after waking up.<br>June 11 @ 3:05 AM<br>4mg melatonin sublingual<br>June 11 @ 3:20 AM<br>1mg melatonin sublingual<br>I become tired @ 3:41 AM and go to bed. <br>I obtained sleep @ 4: something AM.<br>I got up @ 1:00 PM, but could have sleep for many hours more.<br>I am very tired upon awaking. <br>June 12 @ 5:52 AM<br>2mg melatonin sublingual<br>I'm tired anyway, but I'm taking two.<br>Thank God I don't have work tomorrow.<br>Basically, this stuff isn't helping, or I'm becoming too tolerant. It would be OK if I wasn't so tired in the mornings.<br>I noticed no diffence in the frequency or vividness of my dreams when I was taking it from when I wasn't.<br>Once this bottle runs out, I'm not buying another, but I'll use it untill it's all gone.\n\n\n"
}
