{
 "title": "Better Than Ecstacy",
 "author": "TheStealthSmoker",
 "citation": "   TheStealthSmoker. \"Better Than Ecstacy: experience with Amphetamines (Adderall) (ID 34480)\". Erowid.org. Jun 21, 2004. erowid.org/exp/34480",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34480",
   "Male",
   " ",
   "Not Given",
   "Jun 21, 2004",
   "Views: 24029",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am diagnosed ADD since childhood and have also had prescriptions for amphetamines, methylphenidate (ritalin, concerta), and even Strattera for a good portion of my life. Adderall is my favourite and the one I would like to focus on. </p><p>My doctor currently has me on a hard to work with regimen. I am rationed 60 5mg blue tablets that are mostly made of sugar and amphetamines per month. When I wanna get a good high, I take 35mg+. I usually settle with doses of 50mg pretty well. I do not snort it. I swallow it, preferably on an empty stomach and it kicks in well and soon enough. I think if a person can't wait 15 minutes or less for it to come on then that is lame. I'm saying it's not smart to tear up one's nasal and sinus membranes. To potentiate the Adderall I drink caffeinated beverages. I know Adderall, amphetamines, and methylphenidate really well and if I go over 50mg I usually risk having some of the toxic side affects that come with a dose higher than that. </p><p>A bad crash is terrible from higher doses. I cannot work well at all without my Adderall and it helps in many ways. It makes me feel very high, yet totally focused on what's going on and makes me use my mind. It's definitely a very effective drug that can treat much more than most people, psychiatrists and physicians included especially give credit for. But also, very very recreational and safe if taken wisely. Unlike the more psychadelic amphetamine MDMA, Adderall and pharmaceutical amphetamine leaves me a clearheaded aware high, often giving me insight into my life. I lose your ability to think critical thoughts when under the influence of MDMA. Just for the record, it's odd to me that drug dealers don't sell this kind of stuff often. They usually stick to selling pain pills and benzodiazapine pills. Guess what kiddies, pharmaceutical speed is better than ecstacy.</p>"
}
