{
 "title": "A Night of Nirvana and Passion",
 "author": "Danny and Devan",
 "citation": "   Danny and Devan. \"A Night of Nirvana and Passion: experience with Hydrocodone with Acetaminophen (ID 34545)\". Erowid.org. Dec 13, 2007. erowid.org/exp/34545",
 "substance": "Hydrocodone with Acetaminophen",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 0:45",
   "10 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34545",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 13, 2007",
   "Views: 17954",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One Saturday night, I received some Vicodin pills from a friend, (x5) 5/500 MG ones to be exact, equalling 25MG. My experience is written below as followed. Also, I have had many experiences with psychoactives, mostly pills. </p><p>Location: House, Computer Room.</p><p>Dosage: 25 MG Vicodin</p><p>People: Danny and Devan.</p><p>10:00 PM- Ingested three of the five Vicodin pills, I had received from a great friend.</p><p>10:15 PM- Feeling mildly warm, browsing the web and starting to feel a sense of well being.</p><p>10:26 PM- Feeling tingly in my fingers and toes. Feeling quite happy. Listening to FLOWING by 311.</p><p>10:45 PM- Ingest the two remaining, 5 MG Vicodin pills. </p><p>11:00 PM- Feeling quite wonderful, and wish this would last forever. I have tooken over 35 MG of Vicodin before, but 17-25 MG seems to work for me. Many thoughts race through my head, and nirvana seems to cloud my mind.</p><p>11:20 PM- I watched the end of Matrix: Revolutions, and enjoy the spectacular special effects, that seem to look even more amazing than usually. My girlfriend Devan stops by, and is on 2 Oxycodone pills. We begin to make love, and the joys of this world rush through every fiber in my body, as well as Devans.</p><p>11:45 PM- Still making love with Devan. Feeling overpowered by Passion. Our eyes meet and she is more beautiful then a breath of spring air. True love is experienced, as we reach the peak of the sacred act. Devan and I both experience an Orgasm, which to this day, is undescribable by my tounge. </p><p>12:00 AM- Finished making love. I feel extreme joy, and happy to be alive. We both get into the bathtub, and bath each other. The water tempature was perfect and I wouldn't have changed anything was felt, as we cleansed each other.  </p><p>12:20 AM- We lie down together and fall asleep into a great slumber, and heavenly dreams came upon me. I dreamt I was flowing in space, passing many stars and planets. It was amazing. Everything was perfect that night. </p><p>NEXT DAY: I wake up, and Devan is still asleep. It's 10:00 AM, and I get ready for work. I will never forget that night. It was one of the greatest trips and most passionate night I have ever had. </p><p>EXTRA NOTES: I enjoyed Vicodin very much, considering it to be a mild psychoactive. Devan was on Oxycodone, which is also an Opiate as you know, so I must thank the Opiate drug family for such an incredibly journey that we were tooken on. There was no hallucinations or Mind-Body Seperation that DXM, MDMA or Mushrooms have brought before, but that night, I felt something else, and the power of love was shone upon me like the blazing sun as it shines her light to the ground in which we stand upon.</p>"
}
