{
 "title": "Perfection",
 "author": "opiateboi",
 "citation": "   opiateboi. \"Perfection: experience with Alcohol (ID 34548)\". Erowid.org. Dec 5, 2007. erowid.org/exp/34548",
 "substance": "Alcohol",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34548",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2007",
   "Views: 6606",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've tried numerous drugs.  I've ingested so many pharms it might make your head spin.  Smoked too much weed and definately inhaled way to much blow.  But last night was my first night with alcohol.<br>It was 1 AM and me and my friend Jo popped the bottle of port we'd been sitting on for god knows how long.  it was a 50 year old tawny and at first we had intended on just sipping the fine wine...turns out after dessert and the second glass we just passed it back and forth like a couple of lose and satiated winos.<br>About fifteen minutes passed and I realized how alcoholism is a valid addiction.  The extreme euphoria followed by muscle relaxation and then that wave of, 'Hey I want to be a social person.'  Passed over me.  At this point I called my girlfriend and began to talk.  Jo and I kept drinking during the conversation.<br>The aire of the conversation was nothing but joy.  I was aloof and  relaxed the entire time.  Jo pitched in his two cents every now and then which made it interesting.  We talked for about and hour and then hung up.  Through the whole conversation Jo and I passed the bottle back and forth.<br>The euphoria continued until about 4 AM.  During this time we slap boxed, played risk, and talked about things that neither of us would have spoken about had it not been for the influence of alcohol.<br>Last night Jo and I bonded, we got closer than I had ever expected, and I know he feels the same way.  We've always been close, but now its different.  We're confiding in one another and we're close...its become brotherly.<br>In conclusion:  Until last night I had tried everything but alcohol.  I mean everything, tryptamines, opiates, benzos, pot, shrooms, crystal, you name it I've got it under my belt.  But now I'm sticking to alcohol its cheaper and legal.<br>Good luck to all of you in your drug experiments I hope you find the one that suites you best, I know I have.\n\n\n"
}
