{
 "title": "The Power of Speed",
 "author": "D",
 "citation": "   D. \"The Power of Speed: experience with Amphetamines (Adderall) (ID 34558)\". Erowid.org. Dec 13, 2007. erowid.org/exp/34558",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 34558",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 13, 2007",
   "Views: 8908",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Were to begin...</p><p>The past 10 months I have been on Adderall, because of my ADHD. I receive 20mg pills each month, 30 to be exact. My mom has a safe she keeps them in, so I do not steal them, thou I cannot help myself. I usually find the key to the safe and take them. I now do not do this anymore, though I used to. This experience might sound negative, but Adderall has brought me to so many thoughts and ideas, I couldn't thank it enough.. The come down though, is quite painful. Nausea, Depression, Paranoia, Fast heart beat.. they all are the consequences that Adderall has upon me. I have done it well over 50 times (abused adderall), not to mention the one 20MG Adderall I receive every day. My name is D, and here is just one of the many journeys I was taken on.</p><p>Location -- my house</p><p>Dosage   -- (x4) 20MG Adderall pills = 80MG</p><p>(T 0:00) Ingested 4 Adderall Pills.</p><p>(T 0:15) Feeling mildy concentrated, joy spreads through me.</p><p>(T 0:30) Feeling quite concentrated, happy as hell.</p><p>(T 0:45) I am now beggining to see this world as it really is. I feel like there are really things worth fighting for now. I feel relaxed, but extremely hyper at the same time. I get many ideas. Fast heartbeat</p><p>(T 1:00) Every thought I think seems to have a hidden joy behind it. I think of my friends, school, and interests. Things that I once feared or dis-liked, felt very right to me. I understood that some people are just the way they are, and life can't always be perfect.</p><p>(T 1:30) The Peak. Radical, the word that can only describe how I am feeling. The greatest happiness can only be attained by conqouring your fears, and realizing some things are how they are. My limbs feel heavy but relaxed, and my body is loving this more than I am. I am in no way hungry at all and am not the rest of my trip. I still consume a bowl of cereal, just to be safe. Thank God for the substance known as Adderall, even though I'm sweating more than Bill Clinton at the confession booth. Not to mention my speeding heart! Still I didn't think much about it.</p><p>(T 2:00) Still Peaking. Cleaned my room, finished homework, got things straightened out with a friend, that I had problems with for many years. Were now good friends to this day, but keep reading.</p><p>(T 3:00) Still feeling amazing, and continue to, for another hour.</p><p>(T 4:00) Feeling the peak still, but if the peak was 100, I was 95.</p><p>(T 5:00) Get rushes of happiness through my body, and of course great ideas, still loving this.</p><p>(T 6:00) After 6 hours into this trip, I still feel amazing. Obviously 4 Adderall Pills will do the trick.</p><p>(T 8:00) Finnally begin to feel the trip is less intense, though it's hardly noticable.</p><p>(T 9:00) I feel like you do, right before you hit the peak of Adderall. I consume a yogurt and some breadsticks, just to be safe.</p><p>(T 10:00) Coming down more, but like I said, 80MG is just amazing, and its now getting dark outside. I have had a simply wonderful day. I don't mind coming down, because this come down is great!</p><p>After Effects... I am up all night of course, having a groovy time (lol). In the morning I feel just about normal. I threw up a couple of times, and had mild depression, but then quite painful depression came upon me near noon (both mental and physical pain). I ate a shitload after coming off adderall. (even though I made sure I ate the night before)I take two Tylenol PM's and some TUMS at 4PM and when evening arrives I finnaly fell asleep. I awoke the next morning refreshed and happy to be alive. 18 hours of sleep brought me back to a normal pace. </p><p>AFTER NOTES: It was an amazing night, though the after effects hurt like a bitch, and the depression was quite annoying. My trip lasted over 12 hours though, and that's just of good feeling. Thank you Adderall, for all that you have gaven to me.</p><p>WRITTEN: June 21st, 2004.</p><p>EXPERIENCE: January 23rd-25th, 2004.</p>"
}
