{
 "title": "Ruined My Marriage",
 "author": "Thing",
 "citation": "   Thing. \"Ruined My Marriage: experience with Methylphenidate (Ritalin) & Amphetamines (Adderall) (ID 34587)\". Erowid.org. Jul 5, 2007. erowid.org/exp/34587",
 "substance": "Methylphenidate (Ritalin) & Amphetamines (Adderall)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   " ",
   "Pharms - Methylphenidate",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34587",
   "Female",
   " ",
   "Not Given",
   "Jul 5, 2007",
   "16449",
   " "
  ]
 ],
 "report": "<p>6-21-04</p><p>Our marriage was blessed, based on a profound trust in each other, we never had a fight, we always worked problems out together, when time would get hard we would emerge stronger and more in love. We joked that we were 'living on love'. During this time she could sit down and read a book cover-to-cover without a break.</p><p>Then a friend of her's brought over a tab of her child's ritalin, she crushed it and snorted it. She was very happy the rest of the day. Able to do all her housework, cook dinner, and accomplish all she set out to do. After that she looked up ritalin in a Nurses Drug Handbook, she learned what symptoms to complain about. Dr S---- gave her the prescription without any trouble, her symptoms were right out of the book. He never even consulted me (her husband) about it.</p><p>For the first 2 months she was very happy on the drug, when the prescrition ran out and she would happily anticipate her next appt with Dr S---- for a refill. Then things started to change, she would run out in a week and go into withdrawal and depression. She asked me to meter them out to her as prescribed and I did it strictly, she didn't go through withdrawal, but she didn't get the euphoria that she wanted, this was the last time I ever saw her pill bottles. When she ran out of ritalin the next time, she frantically tried to get more and was labled as having 'drug seeking behavior' from a doctor in the next state. Doctor S---- removed this entry in her chart and refilled her drug.</p><p>Her personality gradually changed, she said all her friends were using her drugs and not repaying her with the same, she has very few friends now, and all of them use drugs. In the last 3 months she has stolen my pain med, vicoden (I have suffered from this as well), used the money for bills, and sold her drugs (other than ritalin and adderal) to obtain more ritalin, if I objected she would make life very difficult for me and for her daughter. She began going out all night, not telling me or her daughter where she was going, if I tried to find out where she went, she would verbally and psychologically abuse me.</p><p>Eventually I got a Dear-John Letter from ex-wife, I haven't seen her for weeks, I rellay don't want her anymore.</p><p>In conclusion, Dr S----'s negligence has turned a loving careing wife, into a rude hateful stranger that I don't know anymore. His over prescribing of this very abused drug has ruined my marriage and created tremendous hardship for me and my step-daughter. She doesn't yet realize what harm has been done. She is showing all the classic signs of amphetamine abuse. Obviously Doctor S---- has never shined a light up her nare as she has been snorting this drug from day-one and would show damage to this area.</p>"
}
