{
 "title": "Salvia and Sleep, Warning",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Salvia and Sleep, Warning: experience with Salvia divinorum (ID 3460)\". Erowid.org. Dec 18, 2001. erowid.org/exp/3460",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "  ",
   "oral",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3460",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 18, 2001",
   "Views: 29803",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI percured some Salvia leaves from a reputable web-based distributor with outstanding service.  These were the natural Mexican variety, said to be more potent than the Hawaiian variety, and they were very dry.</p><p>I tried first smoking from a tobacco pipe.  I saw visual effects which would quickly dissipate, and felt a lingering cerebral indica-like buzz, without the body component.  Did this about four times that evening, enjoying the dreamy visuals, and retired.  I was awakened twice with bright light in my eyes, only to find myself in darkness.  My sleep wasn't peaceful, but it wasn't very bad either.</p><p>Next day, tried a water pipe.  I was getting a little more out of it, maybe three hits per dosing.  It wasn't easy for me to hold it down, and I probably only lasted 30 seconds tops per hit.  I think the night before was more enlightning; I couldn't break any new barriers with the visuals.</p><p>Next day, day off.  Next day, tried chewing the 'quid'.  All I've to say is this is nasty.  Yes, I experienced the feelings, but it was just so nasty.  Perhaps fresh leaves are a must, rehydrated leaves just disintegrate too easily.  All the same, it tastes like ass.</p><p>Now, this whole week my sleep has been difficult to emerge from.  My friend who smoked with me from the tobacco pipe claims to have felt rather hazey the next day, and from my experiences with him I feel he is VERY in tune with his body.  I didn't feel hazy or not right, but I had such difficulties emerging from sleep, my dreaming was very active into the later parts of my sleep.  This is normal for me, but I can also normally emerge to greet the day.</p><p>A few days later, I smoke again from the bong.  I'm getting better at holding down the smoke, and this evening I decide to smoke freely for two hours.  I probably smoked from the bong about four times, three to four hits each time.  My lungs didn't bother me at all, and I rarely smoke, this is a relatively smooth smoke, making multiple hits across an evening quite possible.  I had good visuals, and a few times I crossed into the dream state, but never fully.  I've been trying, but unfortified leaves just aren't going to get me there until I obtain a vaporizer.  This night I slept horribly, waking up every half an hour.  Certainly the worst post-Salvia sleep yet.</p><p>I'm not sure if I'm going to try this again, until I can get a vaporizer, or make an extract.  The dreams I had weren't amazing, in fact now that the effects seem worn off (two-three days later) my normal dreaming is better than I remember.  Just be warned that Salvia may mess with sleep in heavy dreamers, like myself.</p>"
}
