{
 "title": "A Different World",
 "author": "Peaceful_Tripper05",
 "citation": "   Peaceful_Tripper05. \"A Different World: experience with Datura (ID 34633)\". Erowid.org. Jun 27, 2004. erowid.org/exp/34633",
 "substance": "Datura",
 "bodyweight": "138 lb",
 "header": [
  [
   "DOSE:",
   "2 shots",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34633",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2004",
   "Views: 10695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe last few years of my life have been full of highs, trips, and life changing experiences. First it was weed, then shrooms, on past peyote and acid.....and finally to datura.\r\nThe illusive datura is, as it turns out, not so illusive in the city of Austin, Texas. A year back some of my friends, looking for a new kind of trip, discovered Datura growing in the yard of a neighbor. They made tea from it and had what they said to be a 'strange, scary, yet awesome experience. At the time I was still striving to sample lsd and decided to stay away from datura. But as time went on I too desired a different trip......\r\nIt was April, 2004. Two days after the conclusion of the local Bob Marley Fest, the day after a bud filled 420. A friend and I went to the house where the datura was said to be found. Having researched the plant and its appearance, we easily identified it and dug up 3 plants, taking the root bulbs, the leaves, the seed pods, and the flowers. We then took our prize back to my house. My parents were asleep so we commensed in brewing a tea. We chopped up 2 of the root bulbs, 2 seed pods, and about 8 good sized leaves. We then threw that in a pot with 3 cups of water and let it boil on medium heat for about an hour and a half. We then strained it untill it came to a about 1.5 cups of dark amber liquid. \r\nBoth of us drank about 2-3 shots of the liquid and sat down to watch the movie 'Fear and Loathing in Las Vegas'. About half way through the movie my friend got up to get a glass of water, commenting that his mouth was incredibly dry. It was only when he said this that I realized my mouth too was really dry. We went into the kitchen and both got cold glasses of water. We continued this way for awhile, constantly drinking. About an hour and fifteen minutes after I had drinken the tea, I began to feel almost drunk, my movements were stiff and I once ran into the side of the doorway when walking through it. About the time the movie ended my friend said he had to go outside to take piss. After he left things began to change. The room around me seemed to be enveloped in a haze. Dave Chappelle's face started to melt on the screen of the tv, then the whole screen seemed to drip out of the box. Slightly alarmed by this new developement, I left the living room and walked down the hall to my room. Upon arriving in my room, I turned on some music and lit up a joint. As I was sitting in the EZ chair, the joint in my hand abruptly vanished, enlightening me to the fact that there had never been a joint. As I was sitting there trying to come to terms with the fact that I had been smoking an imaginary joint and wondering what had ever happened to my friend, the room around me began to breath. Walls moving in and out rythmically, and a strange, high pitched screaming in the distance. Without warning, tiny 6 inch tall green men began to materialize all around my feet. They appeared to be busy little fellows, seeing as how they were scurrying this way and that. I walked from my room to the front yard, where I saw my friend standing in the street having a conversation with my Moms car. It turns out there was a woman on the car, with whom he talked for about an hour. About this time, many people began to appear to me, some I recognized and some I did not. The night from here on out was only a haze, though I vaguely remember dancing with nude tree spirits, and playing chess in the middle of the street with my friend and an assortment of strange beings.\r\nOver all, my experience with datura was peaceful and enchanting, it is a drug both dangerous and magical, and it can change one's life, and their perception of the world in which we live.\n\n\n"
}
