{
 "title": "5-Day Binge",
 "author": "Dr. Demento",
 "citation": "   Dr. Demento. \"5-Day Binge: experience with 4-Acetoxy-DiPT (ID 34653)\". Erowid.org. Jun 28, 2004. erowid.org/exp/34653",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "  T+ 48:00",
   "16 mg",
   "oral",
   "2C-I",
   "  T+ 61:00",
   "20 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "  T+ 64:00",
   "20 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "  T+ 85:00",
   "20 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "  T+ 88:00",
   "20 mg",
   "oral",
   "4-Acetoxy-DiPT"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 34653",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2004",
   "Views: 13299",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Abstract:  A five-day Ipracetyl binge is experienced with no evidence of tolerance.  Little in the way of side effects are encountered, although a serotonin-depletion type hangover occurs at the end.  The higher dose range is associated with open eye visuals.</p><p>Background: I am not particularly experienced as a psychonaut; 4-aco-dipt is the first tryptamine I've used.  I am pretty susceptible to the psychedelics I've used; for example, 16mg of 2c-i, 6mg of 2c-t-21, and 20mg of Ipracetyl are usually quite enough. </p><p>I took a fair amount of Ipracetyl (for me) over the course of five days while on vacation.  Although I was concerned about tolerance, it turns out my concern was, for the most part, unfounded.</p><p>Day 1: 20mg Ipracetyl taken on a full stomach at 8pm.  Having been travelling all day, I fell asleep almost immediately, waking two hours later in the midst of a light 3+ experience.  It was a fairly typical experience, with euphoria, somewhat increased empathy, markedly increased sexuality with very good results during sex (three orgasms, marked closed-eye visuals).  Felt fine the next day.</p><p>Day 2: Drug free.</p><p>Day 3: 16 mg 2c-I.  Typical experience with euphoria and visual effects.  Felt fine the next day.</p><p>Day 4: 20mg Ipracetyl taken at 9pm on an empty stomach.  Fairly rapid onset of 3+ effects, consisting of euphoria and increased tactile sensation, increased appreciation of music beginning at 45 minute mark.  No difficulty with conversations.  At midnight, another 20mg dose taken.  Within one hour, beautiful visual effects are noted: fractal patterns on the surface of things.  Light seems to come off on my fingers when I touch it.  Solid objects are 'breathing.'  Still, surprisingly little difficulty with conversations, easy to meet strangers.  Effects last well past sunrise, still tripping when I go to bed at 8am.  Euphoria the next day (am I still tripping?)</p><p>Day 5: 20mg Ipracetyl taken at 9pm, with a booster dose of 20mg at midnight.  Again, a strong 3+ experience, with increased tactile sensation, stimulation, increased appreciation of music.  Visual effects noticed very quickly after first dose, 30-45 minutes, making me think I never really came down from last night.    Felt great to dance.  However, I noticed some dysphoric effects.  Difficult to follow conversations, or to tell exactly where others are coming from.  Kind of sad and weepy the next morning.   Hung over for five days, with lack of energy and disruption of sleep pattern.</p><p>All doses of Ipracetyl were associated with mild cathartic effects (ie, laxative effects) but no nausea. </p><p>Overall, a couple of things were worth mentioning.</p><p>The first is that, quantitatively, there was no noticeable tolerance over the course of this five day binge; the last experience was as intoxicating as the first.  The qualitative experience did change, however, with considerable irritability coming with the last dose.  A hangover reminiscent of a serotonin depletion syndrome is noted at the conclusion.   Beautiful visuals occurred in the context of a strong 3+ experience noted with a relatively high dose of Ipracetyl with little in the way of side effects, other than some stimulation of the gut.  On the down side, people with mood disorders such as depression should think several times before binging on Ipracetyl.</p>"
}
