{
 "title": "Mind Flower of Alternating Realities",
 "author": "Wisdomtroll",
 "citation": " Wisdomtroll. \"Mind Flower of Alternating Realities: experience with 2C-D (ID 34656)\". Erowid.org. Jan 10, 2007. erowid.org/exp/34656",
 "substance": "2C-D",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "2C-D",
   "(powder / crystals)",
   "",
   "20 mg",
   "insufflated",
   "2C-D",
   "(powder / crystals)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34656",
   "Male",
   "",
   "Not Given",
   "Jan 10, 2007",
   "8688",
   " "
  ]
 ],
 "report": "<p>I've had some experience with 2C-d Salvia marijuana and psilocybin mushrooms before but I've never had quite a rocket ride of a trip as this. I ingested 80mg of 2C-d powder in a pill that I made from the container of multivitamin powder. Two of My friends both took approx. the same amount at 10pm. I started feeling the effects first because I had the emptiest stomach. After 30 mins I felt some nausea. I took some Emetrol to fight that and it certainly helped ease my transition from one mental state to the other. </p><p>1.5 hours I was tripping, really truely tripping. I was seeing a black, yellow and red aura like tracer on everyones body, I was fascinated to look at anything and see millions of shades of news colors which seemed to make a noise. I was really enjoying that groove until another friend arrived with some marijuana. I gave him one 80mg pill and I snorted about 20mg of the remaining powder. Snorting it burned so incredibly bad I thought I would die, but I was able to completly ease the pain when me and the late arrival smoked a fat blunt. </p><p>As I was sitting.. waiting for the nasal dose to kick in, as I felt the marijuana come up I was completely transformed into another being. I was witnessing beautiful daylight in the night-time and everything was contained within it's own universe. I was truely hullucinating. Wonderful visions of alternating perceptions realities and emotions opening up like a flower in my mind. I stopped in the middle of all this madness to feel my pulse and I noticed it was a little high. (about 115 b.p.m.) Because theres a history of heart disease in my family I decided to take some Aspirin (and later some Adalat a beta blocker) which eventually got me down to a Resting pulse of 85 b.p.m. I remember when I swallowed the orange flavored aspirin with some water it all turned into a wonderful dreamsickle flavored river, a raging torrent flowing into my gullet, that was a bottomless pit of delightful excess. I also remember laying in my yard crying out 'water! water! bring me water!' like some kind of deserted dehydrated emperor. My friend not yet understanding the plain of existence I was on got pissed off talking about 'curtesy of others'. </p><p>Anyways I dosed at 10pm and started to come down at about 2am. Right when the drugs hit the late arrival. I remember him turning to me and saying with glassy eyes 'You know that warm feeling inside?? That's God!' My other friends were staring at a led zeppelin cloth poster in my room tlaking about how it moved. Then one of them was standing shirtless staring at the mirror talking to himself for about 30mins. Also one of them noted an exprience to me involving the corner of my yard. He was walking to this corner being drawn in by an 'entity'. I felt the presence too but I was afraid because I thought it was my neighbour. He said as we walking over to this corner the grass around him started to come up to waste high, he looked through a crack in the fence and through the crack he saw a plain of green grass. In the grass was written in glowing letters 'Forget us for we have not forgotten'</p><p>Anyways. start with a lower dose... like 40mg, its just more enjoyable that way. There were alot of times that I said to myself 'God I wish I wasn't high anymore, at least not THIS high' Really there were points where I wasn't sure if I was alive or dead, or if what I was thinking was what I was saying. This, (and I'm sure because I've had a similar Oral dose before), was all due to the fact that I SNORTED. Insuflated dose of 2C-D is MUCH lower than you think and my advice is to just not do it with this chemical.</p>"
}
