{
 "title": "Best Visuals Ever",
 "author": "Psychonautofgod",
 "citation": "   Psychonautofgod. \"Best Visuals Ever: experience with 2C-I & 2C-C (ID 34686)\". Erowid.org. Jan 25, 2007. erowid.org/exp/34686",
 "substance": "2C-I & 2C-C",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "insufflated",
   "2C-I",
   "(powder / crystals)",
   " ",
   "25 mg",
   "insufflated",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 34686",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2007",
   "Views: 7411",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast year or to be precise the year 2003, November to be exact I had one of the most profound experiences ever. I am not new to psychelics and that said, was truly not ready for what my night was to entail.  To give a little foreground on this experience, 3 months earlier I had tried this with my then girlfriend and I only felt the 2C-I but she was having a wild time and was describing things to me that I couldn't see. She was somewhere else indeed. Well, at anyrate, a few months go by and she wanted the experience again, so I got things together and tried it again. <br>First, let me say, THIS BURNS. Still, within 5 minutes I was launched. For me the first 5 minutes felt like 2 hours and had a deep sense that I had just taken a nice bump of K. Totally disassociated. A +3 in 5 minutes! I am still amazed by how perceptually I lost time, as I can almost always tell you the time without looking at a clock for hours. Next thing I know both her and I are just in awe, and now I'm seeing what she was talking about. The room was vibrating and the space and depth peception were almost inverted. As I would approach her, she would get smaller instead of bigger, but at the same time, I saw her get bigger instead of smaller. Also, colors were shifting in the most glorious ways. I only had one incandecant bulb on the house and colors were shifting into neon hues and light would light up in one corner of my flat and then to the other and then to another yet with one stationary bulb. Also, everything became fractalized. As in there was an overlay of mad oil-on-water overlay swirls on everything and that went on for quite some time. Amazing. To quote my ex, 'It's like looking at the world through one of those metallic notebook covers and going crazy with squiggles of neon markers.' and I agree fully.   <br>As for my mental state during this whole amazing night, I was fragile and succeptable to say the least. Hell, I was spending my night with a girl that didn't want me anymore and hadn't spoken to me in more than two weeks for no reason. I'll spare all the details, but I had a total breakdown and cried and sobbed and then got better after I said the things that I could never have said without the aid of the combination. Truly deep thoughts and feelings were released like a flood and I felt clean, emotionally cleaned. <br>I am truly amazed by this combination and am gratful for the time that I spent on it. It is most certainly the most emotionally sensitive I have ever been on any substance though, so I imagine that for therapy it would make a most profound tool. As for the visual aspect, I have yet to beat it and am up for a challenge. I felt kinda stiff afterwards though and had difficulty sleeping, but I imagine that an Ambien or bezo would have fixed that. The only down side however to the whole combination though is that I have never been able to reproduce the experience. My only thought is possible potency differences between batches, but I will again reach that magical number again.\n\n\n"
}
