{
 "title": "Permanent Smile on My Face",
 "author": "Dexedrine",
 "citation": "   Dexedrine. \"Permanent Smile on My Face: experience with Amphetamines (Speed, Adderall, Dexedrine) (ID 34704)\". Erowid.org. Jul 21, 2013. erowid.org/exp/34704",
 "substance": "Amphetamines (Speed, Adderall, Dexedrine)",
 "bodyweight": "143 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34704",
   "Gender: Male",
   " ",
   "Age at time of experience: 17",
   "Added: Jul 21, 2013",
   "Views: 756",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is by far the best drug experience I've ever had in my entire life...so far!  I just took 30mg of dexedrine about an hour ago.  It kicked in after about 35 minutes.  Right now I have more energy than I've ever had.  I've never felt soo great.  This is the first time I've ever done speed...I'm 17 years old.  I got it from a friend at a party last night but it was too late in the night to do it...and I had already drank waaay too much alcohol and smoked waaay too much pot.  All my friends were already ripped off of speed and blow (I'm planning on trying coke for the first time next weekend!  I will definately have to post THAT experience!)  I tried playing my guitar, and I can play everything twice as good and twice as fast!  I decided to write this while I'm on the drug because it seems like a good idea.  But, the bad part about that is that I won't be able to say anything about what it's like coming down off of the drug.  But whatever.  I have an addictive personality and it may not be wise to do this drug because it is sooo fucking amazing!  I want more already!  I never want this high to stop!  My mind is racing, but I find myself relatively focused.  I feel slightly euphoric and I swear I have a permanent smile on my face!  I'm in the best mood of my life!  All I want to do is talk to people, listen to music, play guitar, and have a great fucking time!  I'm listening to Metallica (one of the greatest fucking metal bands ever!) and slipknot, pink floyd, smashing pumpkins, rolling stones, led zeppelin.....it's great!  Music seems to help put me in a better mood.  My mouth is dry though and I'm not even remotely hungry.  But as much as I would love to keep sitting here describing how great it is...I'm going to fucking party!!   Cya!\n\n\n"
}
