{
 "title": "Highly Overrated",
 "author": "J Dog",
 "citation": "   J Dog. \"Highly Overrated: experience with Cocaine (ID 34714)\". Erowid.org. Jan 24, 2007. erowid.org/exp/34714",
 "substance": "Cocaine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34714",
   "Male",
   " ",
   "Not Given",
   "Jan 24, 2007",
   "12112",
   " "
  ]
 ],
 "report": "<p>This was my third time trying cocaine.  The other 2 times I did it, I really didn't do enough to feel much of anything.  So I was hanging out at my friends house, it's around 11pm, friday night.  Me, him, his older brother, and another friend of ours were all just hanging out on his front porch.  To make a long story short, they acquired around 1.5grams of cocaine later that night.  Now it's around midnight, and one of them starts cutting out lines.  We each take our turns snorting our lines.  At the rate we were going, I didn't have a line but every 20-30 minutes, and I only had 4 lines.</p><p>Now were all just sitting there hanging out, and everyone one of the people I'm with is just talking about how great coke is.  How they feel so good, and just want to hang out, and they were saying it's just such a great feeling, giving them a good mood and all.</p><p>I don't understand what they were talking about.  I was definately feeling something, but nothing like what they were describing.  I just felt kind of good, I guess.  I was tired before doing the coke, and then afterwards I was more awake.  I'm almost always in a good mood and usually have a low stress level.  I did feel alittle different, like the other 2 times I tried coke, but I still can't quite put my finger on what the different feeling was.  I don't know, I just feel dissapointed.  You know how you hear all this talk and whatnot from different people about how coke is so great and how it's so addicting.  If I'm not mistaken, it is one of the most mentally addictive drugs.  I don't know, I just don't understand how.</p><p>Cocaine just doesn't work for me.  That 'effect' that it's supposed to have, it just doesn't happen for me.  I've heard of this being the case with some people.</p>"
}
