{
 "title": "Stroboscopic Programmed Hypnosis",
 "author": "Harbonic_Older",
 "citation": "   Harbonic_Older. \"Stroboscopic Programmed Hypnosis: experience with Devices - Mind Machine (ID 34731)\". Erowid.org. Dec 20, 2006. erowid.org/exp/34731",
 "substance": "Devices - Mind Machine",
 "bodyweight": "155 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34731",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 20, 2006",
   "Views: 14757",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nIn 2000, I bought an Orion. I saw it at a health-food and natural clothing hippy store where I went to school. It put me in mind of a device I used at a concert-the man who invented it used to advertise in the back of Rolling Stone. 'Simulated LSD experience! Rainbow colors without drugs!' The guy had me sit down and look toward the sun. He put a curious pair of goggles on my face and told me to blow through a tube. Sure enough, it simulated an LSD trip. So I read the promotional literature and resolved to order one when I got a chance.\r\nThe Orion consists of a hardware package resembling an mp3 player and a pair of goggles. The goggles consist of a pair of biker's sunglasses and an LED array which sits inside the lenses. The manufacturer also includes a patch cable to plug into an audio device. The strobes will run according to: 21 or so pre-programmed displays; Audiostrobe (c) CD's, which have a coded display in the music; manual real-time control; or your own audio device, using the beat-detection feature.\r\nThe pre-sets work for me. They include therapeutic intents such as Visualization, Concentration Before Exams, Mind Sauna, and Peak Athletic Performance. I have used the Learning With Tapes option with a Hemi-Synch CD for memory enhancement to good effect. I used to suffer from short-term memory loss, but not any more. These options put me in a relaxed trance, kind of a parasympathetic state. My autonomic nervous system takes over as my ego grows fascinated by the lights. Even without music, the refraction of the LED's through my eyelids' cellular fluid causes beautiful rainbow patterns. I find this alone refreshing to my spirit. Just seeing the rainbow spectrum gives me a charge. After many sessions, sometimes the pre-sets replay in my memory; Mind Sauna in particular has a distinctive echo.\r\nThe Audiostrobe CD's, two of which came with the Orion, paint a brightly-colored scene with each tune. Tasteful and fanciful, these CD's make a delightful diversion. Beat detection runs very tight, since the manufacturer codes the signal to the Orion's own specifications. Very pretty, very nice.\r\nThe beat detection did not work very well with my own audio, but with all the other options, I consider Orion a good investment anyway. \r\nOnce I had run all the pre-sets I wanted, I explored two additional options the Orion had to offer. The last pre-set, called Random Sweep, can enliven a dull afternoon, certainly! Just as the name suggests, the Orion runs through a random array of frequencies, orientations (left/right vs. alternating vs. both simultaneously) and brightness levels. Whatever effect it has on you, you never know until it happens! One day on break at work, I turned on Random Sweep and had a Cosmic Experience: an enduring, three-dimensional full face entity appeared in the lights. It looked like the Alex Grey 'Cosmic Christ' painting, and it spoke. The Man said, cold and slow like mountain wind, 'Imagine infinite light, infinite life.' Whether that objectively occurred or not, I found it profoundly inspiring and uplifting.\r\nAs far as personal insight experiences go, Orion leads me to deeper awareness of life and myself. I have used Orion along with classical music and thrash punk. I do not agree that 'slaying dragons' has no place in spiritual development; therefore, if I find myself facing a baneful and parasitic personal defect, I might just charge up with Sepultura and leave the Chakra Meditation for another day. And I have done so. I have found that combining Orion with drug sessions does not have a synergistic effect: neither Morning Glories nor Amanitas worked well with it. The electric esthetic of Orion's rainbows clashed with the earthy feel of the natural drugs. So, no fireworks.\r\nHowever, as an everyday therapeutic tool, I like Orion. I find that it gives me an edge at work because, as relatively unknown technology, its signature remains cryptic. It gives me a mystique that my rivals cannot out-think; they simply cannot define my confidence. Psychotherapy, 12-step groups, self-improvement and religion all belie themselves in language, but Orion does not use words. Therefore, in 'Survivor'-type interpersonal competition, I have an advantage none can psyche out.\r\nFor a professional, Orion does not cost much. IMHO, it pays for itself quickly and delivers what the manufacturer promises.\r\nH_O\n\n\n"
}
