{
 "title": "Aids for Facing My Withdrawal",
 "author": "Persistent",
 "citation": "   Persistent. \"Aids for Facing My Withdrawal: experience with Tramadol, Propoxyphene & AMT (ID 34745)\". Erowid.org. Jun 27, 2007. erowid.org/exp/34745",
 "substance": "Tramadol, Propoxyphene & AMT",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Methadone",
   "(daily)",
   " ",
   "250 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " ",
   "300 mg",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)",
   " ",
   "  ",
   " ",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34745",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2007",
   "Views: 19622",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs is usual for me, I was unable to stretch my take home methadone all the way through the weekend. Sunday morning I only had 15 mg left of my 35 mg bottle, and was therefore facing a day and night of fairly severe withdrawals. Shorting my dose by as little as 5 mg is quite noticeably uncomfortable, 10 mg and I am essentially non-functional, so 20 mg short is pretty scary.\r\nI had taken a small dose of tramadol previously without suffering any drug-induced withdrawal, so I decided to experiment further. I started with 100 mg followed by another 50 in a couple of hours. 2 hrs after 1st dose, withdrawal symptoms begin to be attenuated, and by 3 hrs are almost gone. Due to my tolerance to opioids, I could not feel any opioid-like effects aside from withdrawal attenuation, but by T+1:00 I could already feel the hyperserotonergic component. If I took this when already well, I doubt I would recognize it as an opioid. The ssri-like effects were very strong, with considerable jaw-clenching, especially near come-up and come-down, a fuzzy-headed or light-headed feeling, dulled emotions and strange ideation.\r\nI took 50 mg more in the afternoon and another that night, but the ssri effects were getting to be a bit much, so I stopped the tramadol at 250 mg total for the day, and supplemented with propoxyphene.\r\nI was quite surprised at this drugs effectiveness at alleviating opioid withdrawal. Though it is very weak, propoxyphene has been my favorite booster for shorted doses because of the longer duration. Well, this tramadol is far more effective and longer lasting than propoxyphene, and I would say that each 50 mg tramadol provides more well-time than 10 mg hydrocodone. I also really like the fact that there is no APAP in these pills, which makes them perfect for mixing with APAP containing pills. \r\nOn the other hand, the ssri-like effects were very strong and barely tolerable at this dosage. I will only take this stuff when I am very desperate, which is perfect, as I have great difficulty holding on to emergency stashes of opioids. I really can not describe the intensity and bizarreness of the mind state created by this drug.\r\nAMT does indeed help a little with opioid tolerance/withdrawal, but I am finding that AMT is about as habit forming as methamphetamine.\n\n\n"
}
