{
 "title": "An Eye Opening Drug, Mentally That Is",
 "author": "Stupidpunker88",
 "citation": "   Stupidpunker88. \"An Eye Opening Drug, Mentally That Is: experience with Methylphenidate & Oxycodone (ID 34759)\". Erowid.org. Feb 27, 2007. erowid.org/exp/34759",
 "substance": "Methylphenidate & Oxycodone",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   "  T+ 1:25",
   "25 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   "  T+ 3:25",
   "50 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   "  T+ 5:05",
   "10 mg",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34759",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 27, 2007",
   "Views: 10849",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nbefore I start this report I would just like to say that ritalin is an amazing drug that gets a bad reputation because it isn't as intense as amphetamine salts or the most powerful methamphetamine.<br>11:05pm, first dose of ritalin is snorted ~ 75 mg. I like to just be thrown into the speediness.<br>11:15pm, the drug has kicked in and I feel the familiar light euphoria, warmthness, and sudden rush of energy. I have my strobe light going and techno music playing. I start to just dance because I need to vent my energy. I use glow sticks and start to rave. I enjoy how my mind is very sharp and I can think clearly and intelligenlty but my 5 senses are dulled. The trails from the glowsticks and the way the light hits objects in a rythmic pattern are especially noteworthy.<br>11:45pm I feel winded from the dancing, I sit down and trick water as to make sure im safe and do not pass out or dehydrate myself. I logged on to AIM on my computer and open a word processor program. I seem to think of great ideas, concepts, etc. that help me better understand life and such when I'm on ritalin, so I keep a place handy where I can write them and read them in the morning b/c I have a tendency to forgot or confuse myself about what I saying if I try to remember from memory. So anyways I start writing about society and religion and my drug use, etc. I have some really fantastic points (or at least I believe so) that have open my eyes and taught me a lot about myself.<br>12:30am I rail 2 lines, pretty short maybe 25 mg total and I start dancing again to techno, I love feeling the warmth and rush overtake me and I move to the music under the flashes of light emited by the strobe<br>1:00am well at this point I think I took too much too quickly and the right side of my chest hurts, I stop dancing sit on the couch, turn off the strobe and music and just watch tv and slow down my heart.<br>1:20am after I've calmed down, I hop onto the computer and find several people that had found that I had posted on a forum that I would be tweaking and would enjoy company to talk to. So I have about 4 people I think I'm talking to simotaneuosly. One is curious about dxm and the other just wanna chat, so I copy and paste my rants and they agree wholeheardtly (sp?) woohoo!!! my tweaked out brain said.<br>1:25am At this point I am so absolved in talking to them that the only thing that stops me is finishing the ritalin around 2:30 am and the frequent bathroom visits. I make sure to keep myself hydrated while on amphetamines, but ritalin seems to have a strong direutic affect, so that kinda blows but for the effects of clarity in my mind it gives me, frequent urges to urinate is small price to pay. So I'm talking to these kids on the west coast who are fascinated and amazed at what I have to say and realize how true my findings are.<br>Next thing I know, its 4 am. Well its a weeknight, my parents are up at 5:30 getting ready for work. I don't want them asking me why I am up at 5:30 and if I slept and then they are gonna wanna know why I didn't sleep and what I was doing. So I decide I better start getting my s*** together and get to sleep. I swallow 2 5/325 generic oxyocodone tablets to ease my comedown and have me sound asleep at 5:30. so I take the oxy's at 4:10am.<br>I then clean up and stop the music and lights (in my tweakness I must've turned them on while I was at the computer typing away and I was so focused on what they were saying it didn't register in my head that I had turned them on again. So I turn it off, turn on a small bedside lamp, and watch tv till I fall asleep around 5 am. The opiate warmth and my soft huge bed put me right to sleep. I slept about 8 hours and wake up at 1pm refreshed no hangover or any kind of lingering after effects b/c I kept myself hydrated.<br>All in all an amazing expierence I don't know if the words I used to convey the sharpness of my thinking and the nice euphoria which dulled my senses. Its interesting, this stimulant makes me want to physical activity but not carefully. And as for mental work, it made me sharp as a hawk. I started solving math problems b/c it was so entertaining for me.\n\n\n"
}
