{
 "title": "Absolute Complacency",
 "author": "Ops",
 "citation": "   Ops. \"Absolute Complacency: experience with Diazepam (Valium), Alcohol & Cannabis (ID 34792)\". Erowid.org. Mar 2, 2007. erowid.org/exp/34792",
 "substance": "Diazepam (Valium), Alcohol & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   "  T+ 0:30",
   "2 cups",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 2:00",
   "5.0 mg",
   "insufflated",
   "Pharms - Diazepam",
   "(ground / crushed)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34792",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 2, 2007",
   "Views: 48494",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well I should start of by saying all dosages are prefaced with 'at least'.  I make this point because I still don't entirely recall how much of what I had that night beyond a certain point.  I do know the dosages listed above where at the minimum what I had.</p><p>This experience took place about 1.5 weeks ago. I'm 21 and until the past year I was a firm anti-any type of substance believer. That being said the past year has been experimental and I have done things I regret I hadn't looked into before hand. The main reason I write this is I hope somebody someday will come across this account before they do something without knowing the possible results.  I came here looking for help to piece together my experience and found reports I wish I had read. So here is mine:</p><p>The night was a usual one for me and one of my two roomates: Lots of cannibus. We chilled out for a while and my friend who does a lot more and has tried a lot more (subsance wise) than I have asked if I wanted to get down on some valium with him. Not really knowing what it was I agreed after trying to get a few details out of him. One- because I had never heard anything especially negative about valium before, or anything for that matter,  2- I didn't want to appear the 'chicken' (I realize this in retrospect) and 3 - because I had been itching to get into something more shall I say 'altering' than cannibus.</p><p>So he had a small sheet of them and gave me two and he took two, which we took orally. They were white so I suppose they were 2.5mgs each. This was about 11:00 pm.  After a little while I broke out the Blackberry brandy and we polished it off. I just filled up the empty bottle and poured it out into cups to see how much it was, I guess I had about 2 cups worth since it was just the two of us. We did it shot by shot and after the first couple combined with the cannibus they rest of the alcohol went down supprisingly easy for me.\r[Erowid Note: Driving while intoxicated is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Around 12:15 am we went out driving (mistake #? of the night) to a friends to get some more valium. By this time I was feeling something, which was if nothing else the alcohol but I suspect the first dose of valium had started to kick in because I recall feeling quiet complacent with everything. Including the fact that at some point I was driving very sporadically as was my friend.</p><p>When we got back home I remember that I had started to snort at least 2 more of the valiums, as I saw my friend doing it earlier, though my first 2 I had taken orally.</p><p>By 1:00 ish I only have partial comprehension of what is going on because I had a lot of alcohol (for me) and the valium had made me very VERY complacent with everything. We are driving, almost hiting guardrails, going off road etc. But it was weird because my feelings towards what was going on were very 3rd person. Like I was aware that some things were not right but I didn't particuraly care.</p><p>This is about as much of the night as I remember. After this point in the evening the next thing I remember is waking up in the hospital with an iv in me. People that were aware of what happened that evening thought it was maybe for dehydration. I refer to these people as opposed to what the hospital said because the hospital treated me like an animal and would not tell me anything short of I was allowed to remove the iv and other patches and such stuck on me. And that I needed to leave immediately - as I repeatedly tried to find out what the hell had happened and where my friend was.</p><p>To wrap this part of the experience up, I sustained only superficial wounds meaning as bad and as numeriful as they were nothing serious had occured to me. However my car's clutch was completely destryoed, out of gas and numerous parts had been stolen in the time between me being brought to hospital and the tow company being called (air filter, cd player) Also to this date there are large scratches running from the front left bumber to the drivers side mirror that have yet to be explained though it looks like we had hit a guardrail or something not a direct hit but had drove up along side of it or something. My friend had been arrested for driving under the influence.</p><p>The main part of this story or what I want to say to anyone considering using valium for first time: be careful about mixing it with alcohol, and beware of extreme complacency. I say this because that was the main feeling I had from what I can remember. I just remember realizing I was snorting a substance into my nose, when a year ago I hadn't as much as touched a cigarette.  Its the worst feeling in retrospect because I remember thinking at one point how great it was to not care about anything and that I would have (and may have) done any substances available at the time.</p><p>As far as physical effects, my friend told me I had completely went down like I had no control of my legs when I stepped out of the car, which is weird because while I was sitting I had no recollection of a feeling of loss of muscle control. Like I said I didn't sustain serious injury that night but I feel I was very lucky because we were driving around quite drunk. Which I feel awful about the more it sinks in- the lack of concern about anything extended to possible consequences and to what might happen if we were to endanger anyone else.</p><p>I don't recall much of what happened between the point when I snorted the valium and waking up in the hospital aside from a shocking amount of complacency. I don't know if it was because it was my first time or becaues of the alcohol I had that evening but my friend reports aside from throwing up all over myself, driving erratically, and collapsing, I was 'speaking in tounges' to this date I have not been able to get much more out of anybody.</p><p>I am just trying to warn anybody who might be looking into using it. not because I think its bad but make sure to think twice before you mix it with alcohol and make sure you are with people who wont let you make bad decisions, i.e. driving while boozed up and under the influence of valium for the first time. It would seem that I am very biased now towards using valium, and for the most part I am. There is the potential I feel for stress relief - just know what you're getting into.</p>"
}
