{
 "title": "Second Time is Far Better",
 "author": "Alex",
 "citation": "   Alex. \"Second Time is Far Better: experience with Nutmeg (ID 34800)\". Erowid.org. Dec 14, 2007. erowid.org/exp/34800",
 "substance": "Nutmeg",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "5 Tbsp",
   "oral",
   "Nutmeg",
   "(powder / crystals)",
   " ",
   "1 Tbsp",
   "oral",
   "Nutmeg",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 34800",
   "Male",
   " ",
   "Not Given",
   "Dec 14, 2007",
   "Views: 5654",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This little writing is about my two nutmeg experiences.  The first was bad and the second was very good.  After reading some stories and learning from my two experiences, I have decided that certain things seem to be in common with bad trips which I will relate at the end.  Side note, I did not take any other drugs either time.  All that I did was smoke cigarettes.  I no longer smoke so that is a bonus.</p><p>I was in the library of my college when I saw a book about drugs.  I read it and thats how I discovered nutmeg.  I was interested to try but having finals around I decided to wait so the attempt did not come until after school let out.  This first time I took four tablespoons, maybe five around 4pm.  I took three or four at first.  The stuff was disgusting.  At first it was do-able but after awhile it got really hard.  After word I was unable to drink eggnog for a while.  I tried dumping a tablespoon in my mouth then pouring some water in so get it soggy then swallow, it help somewhat but was still nasty.  After awhile I figured that I had not taken enough so I took another tablespoon.  This I was sure of and pretty much the last thing I was sure of.</p><p>It took five hours to kick in and it kicked in strong.  I would turn my head and there would be a delay of about a second where my eyes still saw forward before my vision would show the change in focus.  It was like there was a delay in time between what my eyes saw and it getting to my brain.  Looking forward, seeing forward.  Turn head right, wait one second, see head turning right.  This went on for a while until I decided to throw up the nutmeg and then pass out.  Let it be known that throwing that crap up is worse than getting that crap down.  The next two days was a lethargic version of me.  It was summer so I didnt have to worry about missing any college.  The drug that keeps on giving.</p><p>The second time is far better.  This time, I was able to do a better research on the stuff than I did before.  This time I only took one tablespoon.  And this time I also did not take it orally.  I boiled it in water and let the oil rise to the top.  I cooked out this oil about three times.  I left it in the frig until morning.  At around 9pm I took this now soup skin like substance.  It was a lot easier to down.  The gritty sand texture was gone, and the flavor was a lot milder.</p><p>I was expecting this stuff to start its effects in about 4 hours but they started a good 20 minutes in, probably because I didnt eat a breakfast.  I got the idea to walk down to the drugstore for some munchies, by the time I got there I was pretty high and trying to act normal, I was paranoid that everyone was watching me but it was a good kind of paranoid.  On my way back some guy was on his truck playing a piano.  He was advertising the cities park theatre.  What an Fed up thing to see so I waved and clapped him when he finished his ragtime music.  The dry mouth was countered with me drinking lots of water.  I had two hallucinations.  One was of a bird flying by the back of my neck.  I really felt a bird flutter by my neck, it was cool.  The other was a multicolor potted plant in my dining room.  It was in mainly the black and purple hues with a little red, blue and green and it changed colors like liquid crystal.  In all it lasted about 4 hours</p><p>What I have learned with the drugs.  Big doses are bad.  Just like beer, it makes you sick.  The one tablespoon per 120 pounds is a good ratio to start with.  Cooking out the oil seemed to make it get into your system better since your stomach doesnt have to break down the nutmeg mulch first.  Water helps the side effects, that second time I had no dry mouth, headache or stomach ache.  I also took it in the morning so that I would not fall asleep during the big hit.  By allowing it to war off(like with beer) I was able to avoid the hangover, although I was still pretty groovy the next day, but in a good way.  When you know what you are doing, this is a great legal high.  I would prefer it to cough syrup though I was unable to get my hands on nutmeg while in the army so I had to use the cough syrup to get high in basic.  Next time I plan on cooking one tablespoon of nutmeg again, take it in the morning along with one tablespoon of ground crap.  So that the cooked stuff kicks in and just about when its wearing off the ground stuff starts up.</p>"
}
