{
 "title": "Stepping Stone Back to the Real Me",
 "author": "Eternity",
 "citation": "   Eternity. \"Stepping Stone Back to the Real Me: experience with Venlafaxine (Effexor) (ID 34880)\". Erowid.org. Jul 31, 2006. erowid.org/exp/34880",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34880",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 31, 2006",
   "Views: 8102",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My whole family has a history of depression so it was not an unusual thing that I also experience it. I've been depressed basically my whole life. Not every part in deep despair, but just many ups and downs. I would feel down and suicidal sometimes for no reason, which was even more frustrating because I could not place a cause to why I was so upset. I would just have this utter feeling of despair and loneliness that I felt I could not escape from. I experimented, with the recommendation of my psychiatrist, with several anti-depressants, including what I can remember Zoloft and Paxil. I wasn't receiving the desired results with either one of these prescriptions, so my doctor recommended Effexor. I ramped up started with 37.5mg, then 75mg...  </p><p>I am currently taking 300mg a day (that's 150mg twice a day). I have to say that it has worked wonders in my life. I still have my ups and downs, but my downs are not so deep-in-the-pits-of-despair as they were before. I've gotten more of a handle on my emotions instead of being the constant emotional rollercoaster. </p><p>I do not even begin to state that Effexor is a fix-all wonder drug. I would describe it as a stepping stone and crutch to help solve depression. I do believe that I have a chemical imbalance in my brain that is fixed by effexor, but I have also been incredibly helped by weekly therapy by a counselor plus my own road to self discovery to help sort out my issues and bottled of emotions. </p><p>The only negative aspect of taking effexor was that I had to always make sure that I took it. If I skipped a dose, I would feel slightly down....if I skipped more than 2 days, I would be completely emotionally and mentally unstable and suicidal at times... but that seems to be a common withdrawal effect for all anti-depressants, maybe not to the same extent as me, but still the same.</p>"
}
