{
 "title": "Journey to the Center of the Onion",
 "author": "Harbonic_Older",
 "citation": "   Harbonic_Older. \"Journey to the Center of the Onion: experience with 5-MeO-DMT (ID 34918)\". Erowid.org. Nov 1, 2004. erowid.org/exp/34918",
 "substance": "5-MeO-DMT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "insufflated",
   "5-MeO-DMT",
   "(powder / crystals)",
   "  T+ 0:20",
   "10 mg",
   "insufflated",
   "5-MeO-DMT",
   "(powder / crystals)",
   "  T+ 0:45",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34918",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 1, 2004",
   "Views: 12822",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAt age 28, I have had my bouts of depression, rebellion, and a long and largely unfruitful transit through the psychology/psychiatry branch of medicine. I eventually gave up on taking meds because of the lies of the doctors, the corruption of the industry, and the side-effects. Since replacing the disease model of mental health with another as-yet-undocumented, I have had to live with conditions of the psyche for which one normally suffers incarceration in a mental ward. however, turning to the books of religion and history, I find myself in there. I do not take any kind of psychiatric medicine whatsoever, no matter what. \r\nI decided to take 5-meo-DMT because I felt I had reached a large, isolated, boring plateau in my life. I felt traumatized and elated at the same time, both concerned for the future of humanity and willing to see it all end tomorrow. Maybe I wanted a peak experience to mitigate the loneliness. I bought 200 mg of The Void from an on-line supplier.\r\nI made virtually no preparations. I did not fast or take supplements. I simply waited for everyone to leave the house, then put on a chakra meditation CD. I insufflated approx. 10 mg and experienced no results recognizable from the prior experience posts. I felt rather relaxed, although a little anxious about what would transpire. I felt a little drifty. \r\nAt about T+0:20, I insufflated approximately another 10 mg. After another ten minutes I felt a clearly trippy sensation, a little loss of the left/right duality. At this point a very gentle centering began. It felt like journeying to the center of the onion. I felt like myself for the first time in I-dont-know-when. The kitchen, the hallway, the smell of the air all reminded me of my grandmothers house during my childhood. The precise definition of the difference initiated by the 5-meo-DMT eluded me. \r\nT+0:45 Having experienced very little in the way of striking departures from everyday reality, I chased approx. 10 mg on aluminum foil. It vaporized instantly. I did not notice any burning plastic taste as in the posts I read; the smoke tasted more like cornmeal, weirdly.  The trippy feeling increased slightly. I walked aimlessly from room to room, feeling a little bit lost. Then I put my finger on what had changed. My self-image had changed back to reflect my exterior appearance. \r\nFor perhaps as much as eight months to a year, my self-image has suffered a near-total disintegration. Following the death of my father, the image projected inside the concave face-dish, if you can understand that, my image of me-to-myself, constantly shifted. It felt like a total loss of identity, coupled with a nonstop invasion of privacy by others. As if the plot of Being John Malkovich had come true, with me starring as Malkovich. As if others had discovered the hidden doorway leading to my head. I had no privacy, I thought. My ex-g/f, housemates, managers, co-workers, or strangers on the street could pop up inside my faceplate and harass me. But suddenly that had changed, and i returned, not to baseline of T-0:01, but baseline of 1985. All the trauma and guilt and grief had disintegrated away. \r\nTwo days later, I still retain my original personality. The Return feels like reincarnation. Where did this I go? How did I get back? Will it last? I still feel kind of stunned, on a different level, as if this previously-dead and younger Me cant quite believe he came back. I feel as if I took not a recreational drug, but some miracle drug that restored the sanity which grief and time had destroyed.\r\nH_O\n\n\n"
}
