{
 "title": "Combining: Your Mileage May Vary",
 "author": "FlowGnome",
 "citation": "Citation:   FlowGnome. \"Combining: Your Mileage May Vary: experience with Alcohol & Various (ID 34929)\". Erowid.org. Jul 8, 2005. erowid.org/exp/34929",
 "substance": "Alcohol & Various",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   " ",
   "Various",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 34929",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 8, 2005",
   "Views: 6286",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs a former alcohol abuser, I thought I'd do a short writeup on the varying effects of different psychedelics when combined with alcohol, along with some warnings and good combinations.  Effects varied from great to horrible, generally relating to the order in which the two were ingested.  I have quit drinking but this information may be useful to those who drink.  I generally prefer the effects of these substances when taken alone but all of these have been tried at varying times.    YMMV. \r\nLSD + Alcohol - LSD tends to override the effects of even large amounts of alcohol almost completely, regardless of the order in which they are taken.   This becomes a problem, because mass quantities can be consumed and the effects will not be noted until the LSD is wearing off and my head feels like its been beaten about by a crew of LA police officers for a good part of the evening.   I found it very easy to drink more than necessary or more than I wanted to on this combo.  Not recommended. \r\nPsylocybin + Alcohol - Fine to mix in small amounts, better if the mushrooms are consumed first.   Still easy to gauge the level of alcohol intoxication, sort of a synergy with the body buzz and mental is affected by the alcohol less than usual, but still noticeable.  Ok with a beer or two, no need or real desire to drink more than that.  GI problems usually noted. \r\n2C-T-x + Alcohol - Unknown safety.   Alcohol is felt but functions remain.   Almost guaranteed vomiting if alcohol is consumed prior to ingestion of the 2C-T-x, some GI distress.  These do not seem to mix very well at all.   Drinking late in the trip (T+8h or so depending on the chemical) is ok, but not something I'd repeat.   Drinking before can cause some seriously bad bodily feelings lasting hours into the trip, even with minor (1 beer) amounts of alcohol.   2C-T-2 never causes vomiting or nausea for me normally, did in the case of 1 beer beforehand.  2C-T-21 caused 6 hours of a horrible sick feeling and lack of energy / near catatonia when ingested after 3 drinks.   Not recommended.  \r\n2C-I + Alcohol - Only tried late in the trip, not something I would repeat.  Predict similar reaction as 2C-T-xs if drinking beforehand.  \r\n2C-E + Alcohol - Similar to 2C-T-21.  Light drinking beforehand, severe nausea but no vomiting, hours of feeling very ill which evolved into an extreme paranoia and fear during the peak, recovered slowly afterwards.   Low dose 2C-E with alcohol consumed afterwards (T+4) was ok, but not good.   \r\nKetamine + Alcohol - Vaguely recall.   Dizziness and vertigo, would not repeat.  Similar stories from everyone else I've talked to. \r\nMDMA + Alcohol - Good if low amounts of alcohol are consumed after the trip starts, especially as the peak starts wearing down as they can bring it back up for a short duration.  Easy to drink too much and completely override the MDMA effects.  MDMA 'hangover' is much worsened with small amounts, but this isn't a bad combo as long as one remembers to drink enough water.  Could be dangerous otherwise.  \r\nMethylone + Alcohol - Even large amounts do not seem to affect the empathic push of this substance, but strange 'stuttering' of memory was noted although not that much alcohol had been consumed.   Would be nice if it wasn't for this, might be better in a private environment, but is probably better alone.  Same hydration advice applies, probably not too great on the body.  \r\nSalvia Divinorum + Alcohol - Anesthetic effect during peak is increased greatly enough to make this pointless.  Ego reintegration is much more confusing, not recommended.  \r\nThese are all that have been tried at some point.  Generally the alcohol amounts are around 2-3 beers max, although noted exceptions are the Methylone (ingested 180mg Methylone after 2nd beer, continued drinking beer and water for remainder of the night with no decrease in effects but various short periods of memory loss), and LSD (drank heavily a few times on it and didn't realize it until the next morning).    The general trend has been that the tryptamines tend to be ok, or even kind of good in the case of mushrooms with low amounts, phens just shouldn't be combined with alcohol at all, and the MDxxs are kind of iffy.   \r\nBe careful and keep your water intake on par with your alcohol intake, and watch for signs of dehydration.   Alcohol and psychedelics are on the opposite ends of the good/evil spectrum in my opinion and probably shouldn't be mixed, but some like to drink, as I did, and you may find this useful.\n\n\n"
}