{
 "title": "What Was I Thinking When I Wrote That?",
 "author": "Graham",
 "citation": "   Graham. \"What Was I Thinking When I Wrote That?: experience with Cannabis (ID 34933)\". Erowid.org. Nov 1, 2004. erowid.org/exp/34933",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34933",
   "Male",
   " ",
   "Not Given",
   "Nov 1, 2004",
   "8349",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I live in a suburb of a major city and have been smoking cannabis for about two years.  Usually it is locally grown 'schwag', which is sometimes good, and sometimes isn't.  When I have the money, I buy locally grown hydroponic marijuana, but this is not very often.  I have not taken any prescription drugs or any other drugs except for Ibuprofen (Advil) in 3 or more years. I do not engage in any other drugs except for marijuana and alcohol. </p><p>This expierence began when my friend was recently in the closest major city (about 90 miles away) and purchased a bag of very high grade hydroponically grown marijuana.  You could really tell the difference, just by looking at it, than our locally grown weed.  It was bright, almost neon green, with what looked like white crystals all over it (I assure you there was not any other substance mixed in).  At 7:00 PM, my friend and I smoked a bowl out of a pipe, then we also smoked another bowl right after that, in a bong with ice water in it.  The ice water makes the smoke almost flavorless and is highly recommened, especially if you do not smoke often or are worried about lung disease and the such.  After smoking we grabbed some snacks and walked to his guest house and sat down.  After about 2 minutes of silence, my friend asked 'Are you high?'  I could barely respond 'Yes' because it hit me so hard.  After smoking weed for two plus years I had never felt so 'high.'  I was somewhat worried about things that had happened earlier that day with another friend of mine, and these feelings completely vanished.  I was in a completely euphoric state of mind.  </p><p>After sitting around until about 7:30, we decided we would play a game of pool.  The game seemed to be endless and we were almost in tears laughing the whole time.  It would be completely quiet and we'd say something completely off the wall or make up some gibberish like 'Scahhshsawashy' and fall to the floor laughing every time.  The conversations we had are almost completely a blur. All I can remember from about 7:30 to 8:00 is laughing.  Finally somehow we managed to finish the game, and we decided to go for a ride. [Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't Do It!]  We decided it would be appropriate to listen to a reggae radio station, and there was an instrumental song that played.  Songs with no vocals have never  been a huge favorite of mine but this song envoked responses in us like 'Holy Shit!' and 'Oh my God!' but for no apparent reason, except for a new instrument being introduced or a change in tempo.  </p><p>All of the sudden, about 100 feet in front of us, I saw a 80 or so degree curve in the road.  As we approached I became very nervous and was afraid we were going too fast to negotiate the curve.  I looked at the speedometer and we were only going 5 miles per hour but for some reason I screamed at my friend 'SLOW DOWN!!!'  As I said this I ducked my head down into my lap and prepared for a crash.  Of course, there was no crash, and in retrospect, the situation wasn't dangerous at all, but feelings of fear swept over my body, and once it was over, it was like nothing in the world mattered anymore.  Seemingly, I thought that if I had just survived that, that I was invincible and could survive anything.  I laid back in my seat and smiled and began to focus on the music playing.  For some reason, we decided to listen to classical music, and it was really quite beautiful, and kept us quiet the whole ride home.  Being an avid guitar-player, I really enjoy listening to music after smoking weed anyway. </p><p>It was about 8:25 by this time and we were at his house.  We smoked another bowl in the bong at 8:35 and decided to go swimming.  Normally, although I am a good swimmer, I have an irrational fear of deep water and swimming, but still feeling fearless, I had no problem.  I could have done anything at that moment.  There was not a single feeling of doubt inside of me, and I realized that I could be or do anything I want to be.  I got in the hot tub and began to relax.  I started thinking about life and what it means to be successful, and how success is so easily achieved.  I became very philosophical and decided I needed to record these thoughts, and after reviewing it the next day, some weird things were written.  I got up and found a paper and pen inside and went to work.  Here is what I wrote, it makes sense gramatically for the most part but I can't really figure out what I meant:</p><p>'Achieving success is easy.  Success is seen, visualized, and a desire for success is instilled in the mind.  After seeing success, one yearns for it, and will mentally prepare themself to do whatever it takes to achieve it.  This is how I feel, and I don't know if others feel the same way.  I feel that there is nothing I can't do, realistically, or unrealistically, and some people can't handle that.  I'm stupid in a sense, because I'm young, and I still go out doing stupid things.  I'm the punk kid who broke your mailbox.  I picture you going to get your paper in your robe and seeing your mailbox laying on the ground.  You begin cussing and this ruins your entire day, and after momentary guilt, I never think of it again, and I don't hesitate to break another one, or do anything else.  You curse whoever did this to your precious mailbox, and hope that something equally as terrible or worse will happen to me.  Maybe one day I'll go out to get my paper and see my mailbox broken, or maybe I'll go get my newspaper and someone will put a bullet in my head.  But life is like a ladder, you can't let anything unimportant like your precious trinkets get in the way, because you have to climb to the top.  This is how success is achieved.'</p><p>Well, I have broken peoples mailboxes before and never thought twice about it, but i guess that was guilt surfacing in the back of my mind, but also thoughts of how stupid the things we think are important really are.   It was about 9:10 or so and I decided I wanted to be alone for the rest of the night.  I told my friend goodbye and drove home.  Wanting to re-experience the joy that the classical music gave me earlier, I put my radio on the classical music station and fell into a deep sleep.  I woke up the next morning feeling refreshed, and everything was pretty vivid except for the pool game, all I can remember about it is laughing and making weird noises. I really enjoyed the feelings this weed gave me, and it seemed to me that hydroponic weed really is stronger and better than what is grown in my town.  Overall, this was a very unique and enjoyable expierence, and I hope to feel what I felt sometime again.</p>"
}
