{
 "title": "Holy Shit, Intense!",
 "author": "The Fat Man",
 "citation": "   The Fat Man. \"Holy Shit, Intense!: experience with Morning Glory (Heavenly Blue) & Cannabis (ID 34957)\". Erowid.org. Jul 27, 2004. erowid.org/exp/34957",
 "substance": "Morning Glory (Heavenly Blue) & Cannabis",
 "bodyweight": "295 lb",
 "header": [
  [
   "DOSE:",
   "350 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "34957",
   "Male",
   " ",
   "Not Given",
   "Jul 27, 2004",
   "17948",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Like many normal American teenagers, I had done my fair share of experiments with drugs. I have done the usual like cigarettes and alcohol at first, and then later on marijuana. I continually smoked pot 3 or 4 days a week. Usually, numerous hits on the pipe or bong would be enough to give me a strong 'high'. However, some of my friends began trippin on  mushrooms. Because of the rare availability of mushrooms in our town, I decided my first trip was going to be on DXM, before I shell out money for mushrooms. The DXM trip was pretty good. I had taken 12 robitussin capsules and half a bottle of cough syrup. It was enough for me to trip on in the first plateau. I had felt extreme euphoria with a sense of robotic or mechanical movement and overall no nauseau. I had a positive trip on DXM and I felt on trippin on something different another day. Little did I know I was going to regret it................</p><p>It was the second to last day of school. I decided to trip hard afterschool and not come to the last day of school. I went to my friends house hopin to get really wasted. I finally arrived, and my friends little brother gave me a bag of about 350 morning glory seeds. Usually I wouldnt take in anything before researching it, but I had 'the end of school so fuck it' attitude. I put the seeds in a cup and swallowed it with orange juice. He warned me of nauseau, but i didnt worry because i didnt eat anything before. </p><p>About 1 hour after I ate the seeds, more people started to comeover to my friends house. A total of about 9 of us were at my friends house. Me and two others decided to throw down for pot. I threw down and between the 3 of us, we smoked 2 joints and one blunt. I was pretty stoned after awhile. I decided to just rest on the couch waitin for the morning glory seeds to kick in. After about 2 hours since I took em, I started to feel it. First, I only felt euphoria like i did in my DXM trip, but everytime I stood up to walk, I felt extremely dizzy. So I decided to lie on my friends couch while I tripped.</p><p>During the first few hours, all I felt was a sudden increase in body temperature and dizzyness. It was almost like I had a fever or sumthin. I was just layin there listenin to a friend playin guitar, but my head was not into it. I felt so sick and paranoid with so many thoughts, that I prayed for God to let this trip end. However, there was still more to come. About 30 minutes later, I suddenly felt totally connected to the sounds of the guitar. It was as if each note was striking me with a back blow. At first I couldnt take it, so I moved from the couch to a nearby bed and layed down. By that time, my friend stopped playing guitar. All the others decided to play hackey sack outside in the lawn, so it was just me in the room laying in the bed. Now on top of the bed was a shirt hanging from a hanger. Everytime i looked up, it seemed as if the sleeves were waving uncontrollably and seemed to reach down to me on the bed. </p><p>By this time, I was trippin pretty hard and the marijuana had totally worn off. I sat up in the bed only to see every object in the room glaring with intense color. The color was almost vibrant like and it also gave off a sound, but in a very low tone. Yes, the colors gave off sound! By this time, I was freakin out.....this was nothin like my DXM trip! I struggled to stand up from the bed, and I experienced intense dizzyness. However, I managed to walk from the house and into the outside where everyone was playing hacky sack. I sat down by a nearby bench, however, I felt no comfort watsoever. I was in HELL. Every thought in my head portruded a pain of nervousness, fear, and extreme discomfort. I was so scared for some reason or another. I was actually scared of dying, but on the other hand, I had a feeling of not caring and wanting to kill myself for this trip to end. Overall I began to cry. I havent cried since I was a baby. I closed my eyes then opened them again only to see the grass on the ground breathing very heavily. Then I looked up in the clouds to see two faces and an eagle. </p><p>By this time, the hallucinations took hold of me. I tried very hard to stand up, however by this time, I had almost no control of my body. I went to the circle of people playin hack sack and I was blown away by the brightness of their shirts. I decided to sit my ass back down and just try to chill. Then out of nowhere, i felt something comin up. I stood up, walked like a drunkard, and threw up the orange juice very violently. When I mean violently, I mean violently! Then after that, I threw up again 2 minutes later. By this time, I collapsed and layed down on the grass. Good thing I didnt pass out. It was like I still had my consciousness, but no control......it was a weird feeling. I sat down for like 25-30 minutes, then I got a ride home to my house. I tried to act normal when i saw my mom, but it was very hard. Imagine tryin to act normal in front of your parents after drinkin 15 shots of vodka! Yes, it was like that. I did my chores as best as I could and went to my room to chill. My parents didnt notice anything. </p><p>I took the morning glory seeds around 1 p.m and I went home exactly 6 p.m. I still had mild hallucinations like shapes of balls everytime I closed my eyes,, brightness of color, and just sounds that I heard, but didnt really werent there. All sorts of hallucinations ended around 10 p.m, however I was stuck with a fever like feeling. I felt very numb in trying to go to sleep and sleepin alone was a bitch. I took 2 tynenols and I think I passed out in my bed in sleep. The next day, I felt totally fine and back to normal. However, I advise anyone to trip on sumthin else other than morning glory because this is serious shit right here. Or if u had to trip on morning glory, I advise to trip on sumthin less than 350 seeds,(I was told by a friend the next day that I took a fairly large dose of morning glory). For me, this trip was HELL itself. I dont think I could trip on anything else for awhile or at least, def. not morning glory seeds. That was my first and probably last trip on morning glory.</p>"
}
