{
 "title": "An Appreciation of Retail Therapy",
 "author": "Mantaraydrink",
 "citation": "   Mantaraydrink. \"An Appreciation of Retail Therapy: experience with 2C-T-21; Amphetamine and cannabis (ID 34974)\". Erowid.org. Jul 14, 2004. erowid.org/exp/34974",
 "substance": "2C-T-21; Amphetamine and cannabis",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "8.0 mg",
   "oral",
   "2C-T-21",
   "(powder / crystals)",
   " ",
   "10 mg",
   "oral",
   "Amphetamines",
   "(powder / crystals)",
   "  T+ 0:30",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34974",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 14, 2004",
   "Views: 22338",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>0:00\t8mg, 2C-T-21, oral</p><p>0:00\t10mg, amphetamine sulphate, oral</p><p>0:30 \thalf a spliffs worth, cannabis, smoked</p><p>Ive noticed that I do seem to have a habit, once having tried a psychedelic, of exploring how amphetamine taken in conjunction, changes the experience. This stems from a handful of experiences of taking amphetamine with LSD, psilocybin and cannabis in my late teens/early twenties. Id heard rumours that speed would straighten your head out if you were tripping. How far from the truth that was; it actually pushes the psychedelic into a much more bizarre realm (I found amphetamine/psilocybin, when taken in solution  mushroom tea with a bit of speed dissolved in it  is a good preparatory exercise in preparing for a first DMT experience). Anyway, since then, Ive developed a method for testing the safety of amphetamine in conjunction with a psychedelic. First, have a record of your pulse rate and blood pressure for a fixed, known dose of amphetamine (I use 5mg), taking readings every 15 mins for 2-3 hours. Then (a few days later to prevent tolerance skewing results), try another 5mg with between 5-15% of a mild dose of the psychedelic in question. If your b.p. or pulse rate increases by more than 20%, best to not try any speed with a full dose: other than that, increase cautiously (if no pharmaceutical prep i.e. a known dose, then street speed needs to be recrystallized a couple of times before using to give reliable data)</p><p>Back with 2C-T-21; on its own, 10mg, felt slightly like the effects noticed during first few days of taking an SSRI combined with a non-descript psychedelic feel. I must admit to feeling a slight disappointment after my first experience, so set about investigating if it would be OK with amphetamine. So eventually, the days here:</p><p>13:00 ( T +0:00 )</p><p>Consumed the 2C-T-21 and amphetamine in the same capsule. Had consumed about 200g of yoghurt for breakfast at 09:00, only liquids since then.</p><p>T + 1:00</p><p>Can feel beginnings of something, but still vague and undefined. At this point, I decided to smoke some bud to pre-empt any nausea that might start.</p><p>T + 1:15</p><p>Feel very warm and comfortable, and decide to go to supermarket to get a few essentials (bread, milk and the never ending quest for more cat food). Smoke a bit more, then head out. Christ, the sun feels nice, in fact so nice that I have to suppress the urge to keep my eyes closed while walking.</p><p>T + 1:30</p><p>Get to supermarket, get basket and smile at everyone as I begin to move past shelves full of wonderful things. Even the music they normally play has improved (todays play list  Kinks; Badfinger; Thunderclap Newman etc), so by now (paraphrasing Hunter S. Thomson, about ether) Im grinning like the village idiot from some Victorian Irish novel. I am filled with the urge to buy treats for my partner and our cats. The cats get some organic, shrimp flavoured dried biscuits, and some extra virgin olive oil for my wife. I realize I am in a different frame of mind as I spend some 15 mins trying to select the oil I think she would like best (15 seconds is more the norm for me), but feel quite pleased when I eventually decide on one.</p><p>The 2C-T-21/amphetamine/cannabis combo is not going to give you any epiphanies, but everything is soooo nice.</p><p>T + 2:00</p><p>Finish shopping and start good-natured conversation with girl on checkout. This combo has a degree of warm sociability that I have only before encountered from MDMA and the start of AMT. Even so, there is no definite peak to this, just a very broad plateau where its difficult to pinpoint any stages normally encountered with psychedelics. I decide to walk back to my house the scenic route (my town has a big park with a river running through it). Colours seem much brighter, but there is no visual distortion other than a slight semblance of trails from objects in motion (its more like the thought of trails, rather than actually seeing any)</p><p>T + 2:50</p><p>Eventually get back home, everything still pretty much the same. Definitely does not lend itself to producing insights, but it does allow me to enjoy all of the little things in life, that normally would have gone by unnoticed. In those terms, it does seem a bit like IAP, but also distinct from it in other ways. I start unpacking, and realize that although I only went for milk, bread etc, that I have managed to spend £27, but it did feel good. At this point I think, is this the buzz that some people get from going out shopping?. If it is, I can now understand why its called retail therapy.</p><p>T + 7:00</p><p>Its now 7pm and I can still feel the initial warm feeling, although it is much weaker now. Eating was exquisite; normally psychedelics destroy my appetite, so this is a bit of a first in that it actually worked with the cannabis in producing a bout of the munchies, but with the emphasis is on variety rather than quantity.</p><p>I do feel myself agreeing with Shulgin in that it is primarily a mood enhancer, rather than a true psychedelic, but dont think any less of it for all that. From what Ive got from it, I would reckon on it being one of the best mood-enhancers as it has a bit of everything, but no one property stands out. As it produced no real body load issues, I would like to try it in the 14-18mg range, only not quite yet; Im quite happy with how it feels at the moment, and thats enough for now.</p>"
}
