{
 "title": "A Suicide Attempt",
 "author": "Wednesday",
 "citation": "   Wednesday. \"A Suicide Attempt: experience with Diphenhydramine (ID 34975)\". Erowid.org. May 20, 2005. erowid.org/exp/34975",
 "substance": "Diphenhydramine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34975",
   "Female",
   " ",
   "Not Given",
   "May 20, 2005",
   "49781",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In a motel room, I took a handful [btw 16 and 32 50-mg capsules] of sleeping pills as a supplement to my suicide plan.  I assume I fell asleep before I finished the preparations. </p><p>The next thing I remember, it's the middle of the night and I was outside and I couldn't get back into my motel room.  I went to the front desk for help and was trying to tell the clerk what room I was in, but I wasn't making any sense.  She said she knew which room I was in because she had rented it to me, so I followed her.  She got to the door and said that the spare key didn't work.  (I don't know if this was true, or if she decided she didn't want to let me back in because I was clearly intoxicated.  I can't even be sure things happened as I remember them, because a lot of what I remember was hallucinations, and I couldn't tell the difference until I was sober again.)</p><p>We went back to the office, and the woman was trying to figure the problem out when I looked outside and saw my family and friends waiting in the car for me.  I told the woman I had to leave.  She protested that the car I was pointing to belonged to her and was empty, but I didn't believe her.  I went outside and the car was, in fact, empty.  Discovering this, however, I didn't really even remember about the motel room anymore.  It was very much like the way a dream feels, with nothing really making sense but I don't really notice.  I wandered off. I should mention that, at this time, I was wearing a sports bra, and a pair of jeans, and that's all.  No shirt, no shoes, no socks.  </p><p>I remember things from that night the way a person remembers a dream...disconnected images, out of order, not really making a lot of sense.  I saw people I knew and talked to them, I met new people, I went to a carnival... As far as I know, I did not actually see any of the people I thought I saw that night, luckily.  Eventually the sun came up and someone saw me wandering around in the mall parking lot and called the police.  My apartment was in one direction and my brother's house was in the other, and I kept getting confused and changing my mind about which one I wanted to go to.  I would be walking towards my brother's house, for instance, and forget where I was going.  'Then I would think, silly me!  My house is the other way!'  During this whole time I was not at all aware that I was intoxicated or that I had tried to commit suicide.  I was only vaguely and occasionally aware that I was inappropriately dressed, and most of the time I believed that I was just uncomfortably or unflatteringly dressed, rather than nearly naked. </p><p>I am very lucky.  Wandering around at night with no clothes on, completely intoxicated, all kinds of terrible things could have happened to me.  And I'm also lucky I didn't take a lethal dose, because, having researched diphenhydramine after this experience, its a horribly painful and grotesque death. </p><p>Unlike other hallucinogens I've tried (LSD, etc.) I had no idea that I was intoxicated and no sense or control over what I was doing.  Plus, although I was hallucinating, it wasn't 'fun' the way recreational drugs are.  I didn't feel happy or marvel at the things I was seeing.</p>"
}
