{
 "title": "Complete Unity with the World",
 "author": "Midnight Toker",
 "citation": "   Midnight Toker. \"Complete Unity with the World: experience with Cannabis & Alcohol (ID 34988)\". Erowid.org. Dec 14, 2007. erowid.org/exp/34988",
 "substance": "Cannabis & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 34988",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 14, 2007",
   "Views: 2564",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is not my first expirience and it is not my last, I dont believe in doing hardcore drugs, and the only drugs that I have ever done or ever will do are weed, shrooms, alcohol and tobacco.</p><p>I start by getting some high quality buds from a friend. The going rate for green bud was 1.5 grams for 20 dollars. I have a glass hand pipe that I used. Marijuana really needs no preperation because it really goes with any setting, and if you act cool, and take care of yourself it can be rather inconspicuous. Me and my friend (let's call him X) were sitting on the roof of his house enjoying the beautiful summer night. We loaded up a bowl from the 1/8th we had bought earlier. We took turns taking hits until all of it was gone. When I smoke nearly 2 grams of white rhino, I get extrmemly high. The effects hit instantly after my first hit. A 'headchange' is what I had. A feeling just a little better than sobriety.</p><p>During the 45 min period X and I were smoking we engaged in delightful conversation. Having company while I am high is extremly delightful, but the conversations can tend to start and stop at random, or veer off into completely different directions from the original subject. X and I talked about legalization of marijuana, our dreams and ambitions, how to make money, friends and family, we also made up a game where we sit and try to name the cars that pass, since he lives on a busy street in the busy capitol of oregon. Now if I smoke enough weed I get mixed feelings, I felt overly euphoric, happy and content, my body tingled from head to toe. My vision was distorted into 'frames', like watching and old reel to reel movie in slow motion. The cotton mouth was unbelievable but luckily there was a water bottle sitting on the roof that we had left there from the night before.</p><p>We smoked a cigarette, which many people (including me) believe increases you high dramatically. We went inside and playd video games, X ran downstairs to get some brownies. I personally don't get the 'munchies', but some people do. I was lying on the bed on a pile of pillows and bunched up blankets, comfort was at an all time high. X returned with brownies and doctor pepper. We played crazy taxi on the PS2, which the weed made more enjoyable due to increased appreciation for light, color, sound, and movement.</p><p>After each smoking another cigarette (full flavor work best in my opinion, lights just dont hit the spot), X and I went downstairs and watched some TV. Now I'm not one of those greasy stoner kids, who have ripped and dirty clothes, long hair and talk like a hippie. I am a respectable, cool guy to be around, so we went next door, to X2's house to chill and listen to music. We drank a couple beers and I got pretty twisted. I felt good, I never wanted it to end, but like always, all good things must come to an end. We went back to X's house and went to bed. I woke up the next morning feeling great, no hangover, and I felt fully rested. </p><p>So in my opinion Marijuana is not a drug, it is a way of life and I live it.</p>"
}
