{
 "title": "Food and Drugs Don't Mix",
 "author": "Mixt Image",
 "citation": "   Mixt Image. \"Food and Drugs Don't Mix: experience with 2C-E (ID 35007)\". Erowid.org. Jul 23, 2005. erowid.org/exp/35007",
 "substance": "2C-E",
 "bodyweight": "76 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "2C-E",
   "(powder / crystals)",
   "  T+ 3:00",
   "15 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35007",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2005",
   "Views: 5218",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFor me, drugs are best taken on an empty stomach. That way I know at least something about the dosage, the onset and the duration of the trip to come. I won´t do again what I just did: eat a huge, delicious meal in the company of friends, be the only one to feel it necessary to do 15 mg's of 2C-E for dessert, and if I do, not get surprised when nothing has happened 3-4 hours later.  And most importantly: won´t be a dumbass and take 15 mills more because I figure 'hey, it´s weak shit.' It´s a childish thing to do. And I was in for a ride. On my own.<br>Now, contrary to my behaviour in the last few hours, I´m an experianced user of psychoactives. So now, about 5 hours later, when the world around me is sucked up in a strange tornado I know what to do. But for an unexperienced tripper this might be really scary. First of all, my friends are all asleep, going to work tomorrow. It would be pretty egoistic of me to put them in the situation of having to stay up all night comforting a sobbing wreck. I took the stuff, they didn´t. When I trip, I trip alone, even if there´s people around me. Secondly, I have to rescedule my coming day quite a bit. The key was to make the best of the situation at hand, go with the flow, so to speak. So when I finally gave up on trying to sleep (almost hilarious now that I think of it) due to some bodily discomfort... or wait. Discomfort is not the word. It´s more like rushes of energy spreading through my body in pleasant vibrations, but for an outside wiever it would probably look very strange indeed. Convulsions, no more, no less. But I´m having a ball. It´s an almost pre-orgastic feeling concentrating to one part of my anatomy at a time. Just minutes ago it was in my right thigh, now it´s in my shoulders. Incredybly pleasant and a bit unnerving at the same time. Really interesting. No nausea, no stomach pains, nothing physically negative in any way.<br>Facing the risk of possible arrest I put on some kind of clothes and went for cigarettes at the nearby 7-11. The street behaved in an unorderly fashion, the trees shimmered in emerald variations, the sky was glowing in azur-neon-flowing-glowing- nyances and everything is just beutiful, hilarious and very very strange. This was much like a mushroom trip, throw in a high-energy electric cord up your ass. Some sort of buzzing feeling goes through the whole of my body. I´m not familiar with Shugins scale for experiences of this kind, but I guess this is a big bunch of +'s and superlatives all wrapped  up in a big bliss. Pretty faschinating that I´m still able to operate a keyboard and write english even though the computer screen is playng tricks on me, flowing, bulging, rearanging itself, moving around and all-in-all beeing a pain in the ass. This has actually been my experience with phenetylamines in high doses, that I always remain in some basic control of myself even though the world around you is really acting up. Or maybe that´s just my way of tripping, I don´t know.<br>Compared to other substances, I´d say mushrooms are close, but if I was this high on mushrooms I wouldn´t even find the computer. Acid is more strange, more of a short-term psychosis. This is easier to distance yourself from. I´ve done and loved 2C-I quite a few times, and that´s more calm, more mellow and not so energetic. I mixed 2C-I and 2C-E, creating an effect I named 2C-EYE!, and that was way more intense than this, way more intense (but then again, that time I was so beyond this world that I don´t know how much I ended up taking. Otherwise that could´ve been a trip report for the records). Generally I would say if I´ve got experience and know how to handle myself when I'm strange, I don´t hesitate to go for a full ride. I will do 30 mg or even a bit more. I can handle acid, and compare this to childsplay. If I wasn't so experianced, I would have stuck to a medium dose of 15- to max 20 mills and have people around me.<br>Anyway, on autopilot I got my beloved fags and somehow made it home again. I have just made myself a bath, lit some candles and put on some nice ambient. I´m planning to spend the next hour in the bath, watching interesting fractal patterns on the tiles and contemplating myself and the rest of the world a lot. Now, beeing an experienced tripper, I have my parachute ready: a few nice blue diazepams if things get too wacky or if I´m just bored and need to sleep. Sleeping pills did nicely too when valium was out of stock, but in my experiance a parachute is a nice thing to have, if nothing else for my peace of mind. Like a little chemical amulette around my neck to keep me safe from harm. All in all this has been, and will probably continue to be for some hours, a pleasantly strange mildly phenomenal helluva ride. Recommended. <br>Love <br>Mix<br>P.s Any misspellings, uncoherancys or bad english should be forgiven considering the facts that a) I´m not english, I´m swedish, and b) I´ve taken 30 mg's for christssake\n\n\n"
}
