{
 "title": "A Walk Among Majesty and Memory",
 "author": "Superkitten",
 "citation": "   Superkitten. \"A Walk Among Majesty and Memory: experience with Mushrooms & Cannabis (ID 35013)\". Erowid.org. May 27, 2007. erowid.org/exp/35013",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1.75 ml",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35013",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 27, 2007",
   "Views: 2680",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It started quite spontaneously. I've been a drug user for close to a year, and hadn't really done much in the way of psychedelics. Going to events with my brother, who was my main source for these sorts of things, my supply was limited based upon what he thought I could handle. As of this writing, the experience is very fresh in my mind. It happened 6 days ago, at a pre-burn event called Burn on the 4th of July.</p><p>I had done ecstasy the night before, and figured I'd probably just go out and dance, then crash in the trailer before everyone else, because I'd be sober and they would all be doing 2C-E and awake until dawn. Then a friend of my brother's offered me an eighth of mushrooms, still very fresh and recently dried, for $20. Half of this dose, I figured, was sufficient. And I was right.</p><p>I ate three of the six mushrooms in my bag, caps, stems, and all, without problem. They only taste like plain mushrooms to me, as my palate hasn't picked up on the magic that makes everyone else I know turn to grinding them and putting them in sandwiches or something similar. I also ate a cheese sandwich. Food in my stomach didn't seem to have any effect on my trip, and I had no nausea to speak of. I think I dosed around 7:00 PM or so, but I have no idea of telling. Time becomes a meaningless abstract to me in these events, and none of us were carrying watches.</p><p>I was spinning poi when they took effect, simply standing there and suddenly feeling strangely altered. There were no visuals yet, but I knew something was different, that I really couldn't describe. From there it rose to a sensation of moving, a pleasant dizziness that added a sway to my motions without really being a hindrance. And further from there, if I moved my eyes too quickly, certain objects would leave trails, not unlike someone were applying Photoshop's 'smudge' tool to reality. It was getting dark and everyone who hadn't done mushrooms dosed on their 2C-E and so we headed out for the main stage where Mutaytor was playing. The mushrooms hit me hard as I walked through the forest path at night.</p><p>I cannot say for certain if I actually had seen anything to hint at where I felt I suddenly was, but I felt as if I was in a past memory of mine. A flashback. I was not walking upon the dusty dirt road in my head, but rather, I had returned, in spirits at least, to the Amazon Rainforest, in particular to a night hike my guide had taken me on. I didn't question this sudden change in setting, or even realize it until the sky came into view again, and the moonlight fell upon the dust at my feet. The veil was pulled aside, and I again remembered where I was, and that certain friends present hadn't even accompanied me on that vacation to Peru in May.</p><p>The stars were beautiful that night on their own, but they had taken on new life. They were dancing to a beat that went unheard, and yet, as they cast off their familiar white hues and became the unheard-of stars of blue, yellow, red, and green, I wish I could have shared with them in that experience. My view of the stars was short-lived as again we passed through the trees, and I was once more transported to the jungle of mind and memory. This time I had a better idea of where I was, sure. I was at the forest and yet, somehow, at some kind of Burning Man-like event. That's all I cared about.</p><p>My body-sense felt quite different. My mouth seemed unfamiliar, and a numbness seemed to pass over my body from time to time, along with that strange dizziness. My mind had a tendancy to wander over subjects where I(and others who know me) feel I need improvement. The night before I'd broken new ground in social behavior with the realization that it's not that hard to say 'hello' to people, to start a conversation and keep it going. To put it simply, I tend to be very timid, but the night before, on ecstasy, I discovered many things I had liked about myself and about other people, and this new mind-state gave me a new way to evaluate the experience all over. I'd also thought a lot about good friends, particularly a girl whom I've grown close to, and yet, lacked the balls to tell her my feelings. Not mushroom thoughts as I were led to believe, but nonetheless a road that the mushrooms felt I needed to walk along, and I followed, liking the things I was learning.</p><p>The walk down memory lane had changed to something different when we had reached a stretch of forest road where other Burners had camped all along it. Suddenly there were people to catch my interest, moving through the darkness wearing all manner of glowsticks. This was when I had started to notice my vision seemed very flat, and what's more, had sort of a stained glass look to it, with very intricate patterns shaping the world as I saw it. Color was in abundance when I closed my eyes, and the patterns ranged from very geometric ones, to intricate Celtic knotwork.</p><p>We had reached the main stage, which was bursting with people like the previous night. Some of my friends sat down in the dirt, while my brother got up to dance. I joined him, of course. Mutaytor has a very unique live show, and here they were, quite simply, blowing my mind. I kept on dancing into my brother due to my lack of depth perception. Everything appeared so near, and so flat, as if I were gazing upon the world through a looking glass. It didn't take me long to decide to simply head back over to sit with my friends.</p><p>In this state of mind, dirt didn't really mean too much to me. I sat, feeling my hands along the soil and noting the strange selective numbness I was experiencing.  I played with my lightsticks a little, and considered spinning poi, but I decided against it. I was too fucked up for that. The other shroomers, more experienced in the ways of the fungus, were not quite so low-functioning, and they picked up poi a few times to twirl them. I tried dancing with my brother a few more times, but, however amazing it felt, I couldn't really bring myself to stay up that long.</p><p>Eventually my brother left the improvised dance floor and asked me if I was up for a walk. I left my jacket with a friend, and headed back off into the dark forest with him. He held a flashlight and I stumbled behind him in a stupor. Occasionally I'd try to communicate a thought I was experiencing, but basic communication skills were one thing I left behind in reality. We ended up walking off a road and getting lost. I managed not to freak out, despite being on a hallucinogenic drug, and being somewhat of an anxious person. It was a challenge, sure, but I felt no fear, only trust in my brother who navigated us back onto the roads by following music.</p><p>This time the walk through the dark forest reminded me of Alice's Adventures in Wonderland, in particular where she met the Cheshire Cat in the forest, and he gave her the best advice of anyone in the book: 'Oh, you're sure to do that,' said the Cat, 'If you only walk long enough.' Of course communicating this thought to my brother was hopeless. I stuttered, 'I-I'm in the forest,' many times before giving up trying to communicate that concept.</p><p>We reached the campsite eventually and I had the sudden urge for something cold to drink. There was a pepsi machine in the RV park, and so my brother and I headed over to that first. Fishing a dollar out of my wallet showed me that manual dexterity I had also left behind. I pushed a button and recieved the wrong soda. Then the machine had broken somehow, and sodas just started falling out. A soda machine breaking spontaneously was, at that point, the most hilarious thing in the world to my brother and I. He made a remark about how weird shit always happens to people when they're tripping. Then we hurriedly grabbed two sodas each and ran like hell to the the trailer.</p><p>Once there, I thought about doing a balloon of nitrous but decided to save it for later. There weren't many nox cartridges left. This is the only decision I regret, as not only would that balloon have probably propelled me to another plane of existance, but I'd forgotten about it entirely at the end of the evening. Nonetheless, drinking a soda was a unique experience with no real sense of much more than the bubbles tingling in my mouth. My brother and I sat around there a while, put on deoderant and returned to the main stage.</p><p>The rest of the night for me was basically a lot of walking through that eerie forest, followed by the occasional stops to dance at one of the secondary stages, where some damned good breakbeat music was blasting. At this point, the main change in perception that persisted was that odd stained glass effect. Dancing was easier as I came down, and certainly pleasant, even if my body was clearly exhausted. I'd regained a lot of my clarity when a friend took me back to the trailer to smoke a bowl, but retained a lot of the visuals. I still wasn't quite in reality, but the weed had definitely done something to lessen my trip.</p><p>When my brother was having me watch his record bag at the stage, I basically laid around with my eyes closed, watching those infinitely complex patterns swirl in around themselves like many colorful tendrils of smoke, tied artfully into celtic knotwork by a skillful wind. I smoked more bud, and was feeling pretty good, if a bit cold. When my brother had returned, I was exhausted, however. I waited around for a bit more, and moved my body to the beat, but I tired too easily. My whole body was exhausted from too much dancing the previous night on E. I waited around a bit to see if the other DJ's set would end so I could catch some of my brother's, but that wasn't going to happen. I was cold, and hadn't really packed sufficient clothes for the weather. I ended up walking down the forest path alone with a flashlight, smiling as rabbits played in the woods around me as I walked. I returned to the trailer and climbed over a few friends who had already crashed, and went to sleep. One hell of a first mushroom trip.</p>"
}
