{
 "title": "Good Grades and Headaches",
 "author": "LYRATyME",
 "citation": "   LYRATyME. \"Good Grades and Headaches: experience with Amphetamines - Adderall (ID 35036)\". Erowid.org. Apr 24, 2007. erowid.org/exp/35036",
 "substance": "Amphetamines - Adderall",
 "bodyweight": "122 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35036",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 24, 2007",
   "Views: 21133",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWHO SHOULD READ THIS: Anyone interested in learning about the effects of taking a daily dose of Adderall XR(20mg).\r\nBACKGROUND: I am a 17 year old, and have had ADHD for as long as I can remember.  I was not taken in for testing of ADHD because parents didnt want there to be anything wrong with their child.  I was taken in about a year and 5 months ago to see if I really had ADHD, and sure enough, I had it.\r\nSCHOOL LIFE BEFORE ADDERALL XR: I always didnt do too well in school (kept a 65-70 out of 100 average).  Every day would take forever and I didn't want to do anything but play, talk, draw or space off.\r\nSTARTING ADDERALL XR: The VERY first day I took ADDERALL XR, was on a SUNDAY.  About 15 minutes after takeing, I saw towels on the couch from dryer that needed to be folded.  I didn't want to, I think, but I went over there and folded EVERY SINGLE TOWEL.  When I was done, I felt like I had accomplished something.  I went to my room, and saw it was messy.  Now, usually I am the person who will 'Put off' untill later.  But, I stared at the mess, then started to clean it up.  I don't really know why, still to this day, but I did.  To make a long story short, I ended up cleaning almost the ENTIRE HOUSE.  From vaccuming, to throwing away trash, to cleaning dishes, to mopping, taking out trash, ect...  The wierd part was, was that I LIKED IT!!!\r\n1-3 MONTHS INTO THE MED:  I liked taking it.  I felt like my life had changed so much.  In school I could READ!!! (which is a maricle for me)  I mean it, I could seriously concentrate better!  My grades were coming up to a high B(85-90 out of 100).  I listened well, and payed attention to what not only the teachers were saying, but what firends would say, and how I would always work on what I was supposed to work on when I am supposed to.  Life was great!  The only bad part at this time, was getting home exhausted, and wouldn't be able to sleep very well.\r\n3-8 MONTHS INTO THE MED:  Things were about the same, but I would sometimes space out and started to get nervious about some things.  It didnt feel as strong as when I had started, but still had the same basic effect.  Started to draw-back from talking with friends, and social life started to deplete.  Sometimes would get headaches, and felt medicine wear-off quicker than normal.  Sleeping became less of a problem for me.  Appetite was not there.  I stopped eating lunches, and would come home and just eat and eat and eat.  I didn't gain or lose a pound.  My weight stayed the same.\r\n8-15 MONTHS INTO THE MED:  I still have the same effect as when I started Adderall XR, but now, I space out more.  My social life is sometimes nothing, when I know I need to pay attention.  When I don't need to pay attention, I just keep talking and talking untill people literally have to say 'SHUT-UP!'  Still didn't eat much during day, but when night time came, I was raiding the pantry.  Medicine wore off same time as in the 3-8 monthe period, but when I got home I HAD TO take a nap!  Just felt so exhausted!  Also, my blood was thinker than it usually was sometimes, and got perscribed 'MIGRAZONE', explination on bottom.  I also found that I NEEDED to take it EVERYDAY, not just the week-days, to prevent me from not sleeping monday nights.  I also have a mild depression now, which goes away if I stop taking Adderall XR for about 6 days.\r\nMIGRAZONE AND HEADACHES:  I was perscribed Migrazone, for I started to develop high amounts of thinker than normal blood going through my brain.  This thick blood gives migrane like headaches, with many more and harmful effects.  These Migranes take about 1 and 1/2 days to go away.  With Migrazone, it helps the blood not be so thick, so when onset of a headache, I will take it and it will go away.  Alone, Migrazone will make me feel like I have no worries in the world, and like I am flying/floating.\r\nMIGRAZONE AND ADDERALL:  When taking Adderall with Migrazone, I still feel like I get the benifits of the Adderall, but also feel REALLY LIGHT and almost floating when taken with Migrazone.\r\nADDICTED?: I have wondered if I have become addicted to Adderall now.  I have tried going without it for up to 3 weeks, and I had no dependency for it at all.  I have even tried taking 3-4 of them, and go cold turkey for about a week, and I still had no effects of addiction.\r\nTHE GOOD:)\r\n1.  concentrate much easier\r\n2.  wake up in the mornings\r\n3.  great outlook on life\r\n4.  feel like I have made a difference in my life for the better.\r\n5.  GET THINGS DONE, even if I want to put them off.\r\n6.  just plain feel better about life\r\nTHE BAD:(\r\n1.  Sleep depravation\r\n2.  Loss of appetite\r\n3.  Headaches\r\n4.  Depression\r\n5.  Loss of happiness\r\n6.  loss of communication\r\nHave fun, and be safe.\r\nLYRATyME\n\n\n"
}
