{
 "title": "Ripped and Pulled Towards the Void",
 "author": "The Orange Monk",
 "citation": "   The Orange Monk. \"Ripped and Pulled Towards the Void: experience with Salvia divinorum (dried leaves) (ID 35095)\". Erowid.org. Jun 3, 2007. erowid.org/exp/35095",
 "substance": "Salvia divinorum (dried leaves)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35095",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 3, 2007",
   "Views: 3518",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a 17 year old male, very experienced with drugs of all types (alcohol, cannabis, tobacco, MDMA, amphetamine, LSD, magic mushrooms, Vicodin, DXM, Ambien, Valium) but my experience with Salvia was more intense than any other (barring LSD perhaps).</p><p>The trip took place last night at around 11:30 pm. My friend Z and I had purchased a bag of dried leaves from a neighboring town, before spending the better part of the evening participating in an open mic. Having read my poetry for an actual audience the first time that evening, I was feeling creative, fulfilled and optimistic. We parked my car near Z's condo, and prepared his water bong. Before taking the first hit I was apphrensive. Not so much apprhrensive about the trip, but the fact that I was about to partake of a drug, however legal, after attempting total sobriety. I had been mulling over in my mind all day whether or not taking salvia would 'count', if it would mean that I had failed at staying sober, but my curiosity and desire to experience the psychedelic experience again won out.</p><p>So nervously in my backseat, in the rain, I loaded a large bowl, probably a little over a quarter of the baggy into the bowl and took in my first hit. The smoke burned in my throat but was not unpleasant, it's harshness didn't leave me with the urge to cough that I used to often get when smoking cannabis. I took three or four large hits before the bowl was finished, and Z quickly loaded the rest of my portion into the bowl, about two hits worth. I took the next two hits down in a frenzy, holding the burning smoke in my lungs for as long as possible before exhaling. On my last exhale it began.</p><p>Z had been laughing as I exhaled the last hit and I turned my head to look at him, his skin grew quickly pale and flat before literally disintegrating before my eyes. I turned my head towards the horizon and saw what I have termed The Funnel. I saw The Funnel the very first time I tried a hallucinogen, about 5 hits of LSD, and again when I ate an eighth of magic mushrooms. In both senses The Funnel was a vibrating, colorful funnel which encompassed *all* of reality. After my acid trip I had determined that The Funnel represented the passage of time, or what our consciousness perceived as the passage of time, and at the end of it was death. Outside of The Funnel was the void, or absolute non-existance. While on LSD I managed to pass into the void for a moment or to, and when I did my ego evaporated. The Funnel was different on salvia.</p><p>Both times I had encountered it before the Funnel was gentle and slow, vibrating with energy and slowly passing towards the end at a steady pace. On salvia that pace was accelarated a million-fold, I was not stepping towards the end but hurtling, and the Funnel did not simply vibrate this time around. Well, it did, but so violently that it literally tore into my phsyical body and consciousness, tearing my into thousands of paper thin 'sheets' that all continued down the funnel towards nothingness. The experience was at once exhilerating and terrifying, as I watched my body literally shredded, my perception torn into several tiny pieces.</p><p>This encounter could not have lasted more than five minutes as my speed gradually slowed, the pieces of my body calmly re-attaching as if nothing had happened. It was at this point that I remembered that I had just smoked salvia, the water bong sat undisturbed inches from me. From the point of my final exhale until now I had not realized I was on a drug, I had not realized anything, my past and future had ceased to exist and all that had mattered was my hurtling through time and space, the stripping of my psyche down to the essential energies that made it up.</p><p>After two more minutes or so I regained enough grounding in empirical reality to exclaim 'My God! We're sitting in my car!' to which Z laughed hysterically.</p><p>About twenty minutes later we proceeded inside to sleep, I was mostly down to normal, although my perception of colors was still somewhat 'off.' I noticed that my vision registered the scenery around us for a split second to be bright and sunny, though it was a little after midnight and raining, and when we entered the house and turned on a light, it appeared a reddish-orange. I then quickly drifted off into a fitful sleep racked with vivid dreams which I cannot remember beyond the fact that they were more vivid than normal, and nearly hourly awakenings.</p><p>In conclusion I must say that salvia is a difficult psychedilic for me to truly wrap my head around. The sensations, though short-lived were more intense than those experienced on high doses of LSD, and more intense than magic mushrooms thousands of times over. As for my ability to integrate the experience I found salvia easier to integrate than LSD, which left me anxious, confused and perplexed for a week or so, but more difficult to integrate than magic mushrooms, which did not require any work on my part for integrating, everything I experienced on magic mushrooms made absolute sense, so much so that I woke the next morning with a sense of understanding, not confusion. This is definitely a hallucinogen to respect, it's intensity is not for the inexperienced or weak of mind. The experience is overall not one that is enjoyed, but often exploration is unpleasant. I do plan on experimenting with salvia further in the future, in different settings and mindsets.</p><p>-The Orange Monk-</p>"
}
