{
 "title": "Just a Lick",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"Just a Lick: experience with 4-Acetoxy-MiPT (ID 35118)\". Erowid.org. Jul 12, 2004. erowid.org/exp/35118",
 "substance": "4-Acetoxy-MiPT",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "4-Acetoxy-MiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35118",
   "Male",
   " ",
   "Not Given",
   "Jul 12, 2004",
   "Views: 11629",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This will be a very short report, but I wanted to share the experience.</p><p>October 2003</p><p>An unknown, but small amount of 4-acetoxy-N-methyl-N-isopropyltryptamine hcl</p><p>I was transferring some 4-AcO-MiPT sent to me from the baggie it came in, to a glass vial for long-term storage.  This material was sticky and very difficult to handle.  It kept sticking to the razor and my small spatula that I use to handle and transfer powders, so I licked what I could not get into the vial off of the spatula and the corners of the bag it came in.  I also licked a bit off the razor after I managed to get most of the rest into the vial.  I know, I knownot the wisest thing to do.  But I didn't think such a small amount would do anything.  I'd say I took no more than 8mg based on what the 4-AcO-DET freebase goo looks like that Ive worked with in the past.  They seemed to be of similar density.</p><p>As said, I didn't think anything would happen.  And I went about recording an acoustic guitar part on a song that I had been working on.  Then about forty-five minutes later I suddenly reached a very, very mild plus-two after having forgotten I even took something.  Obviously, this material had a very smooth onset.  At least at the dosage I took.  It was enough to notice incredible color enhancement, mild trails, a great tryptamine body-high, some visual movement, some CEVs, but most importantly...an incredible state of introspection and wonderment about everything.</p><p>After an hour or so, I smoked a bowl of cannabis and then hopped on my bike to get a good view of the mountains.  And that view was simply overwhelming!  My mind was incredibly active and imaginative.  Colors were so intense.  With the sun was setting overhead, I felt as if I were in a painting.  Very dream-like at times.  This material filled me with a great sense of happiness that lasted the entire ride home, and even the rest of the evening.</p><p>After some four-hours or so of effects, the pleasant entheogenic state quickly faded into a warm afterglow.  By bedtime, no residue remained and sleep was easy.  Easy on, and easy off.  I was left in a state of intrigue over this chemical.  It seemed to be excellent material, and I was curious how a full dose would compare to my favorite orally-consumed tryptamines, which are psilocybin and iprocin.</p><p>Conclusion</p><p>This feels like it has the makings of a great entheogenic tryptamine.  No GI problems or other negative body-effects previously noted with a few other synthetic tryptamines Ive tried.  I recall a feeling of being chilled during the onset, but it wasnt really very annoying.  While the mental effects were relatively mild, and I got no higher than a gentle plus-twothere was a lot of 'content' for such a tiny dose.  I feel confident 4-AcO-MiPT will be a winner, even after trying it only once at a low level.  </p><p>I look forward to dosing a known amount of 4-AcO-MiPT sometime this summer.  I also look forward to experiments with its free phenol, miprocin (4-Ho-MiPT.)  Both molecules seem to have much promise.</p>"
}
