{
 "title": "The Pleasures of Floating",
 "author": "X-Man",
 "citation": "   X-Man. \"The Pleasures of Floating: experience with Poppies - Opium (ID 35159)\". Erowid.org. May 31, 2006. erowid.org/exp/35159",
 "substance": "Poppies - Opium",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Vitamin C",
   "(ground / crushed)",
   " ",
   "  ",
   "oral",
   "Opium",
   "(tar / resin)",
   " ",
   "  ",
   "oral",
   "Poppies - Opium",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35159",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 31, 2006",
   "Views: 22717",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI tried the poppy pod tea first, with a minimal amount of pods (6) and shared the tea with a friend. I felt a VERY mild euphoria, and later I tried a poppy seed mixture and really got nothing from it.</p><p>But I later decided to retry these experiences, and make sure I did everything correctly and use large dosages, and these were my experiences.</p><p>Poppy seed tea</p><p>I purchased 840 grams of poppy seeds. I put this in a saucepan, and the juice of 1 lemon and ground down some vitamin C then added hot water until the level of water rose about 1cm over the top of the seeds. I left this to soak for half an hour, and then removed the water into another saucepan, and simmered (not boiled) the amount of water down until only a brown tar was left at the bottom of the saucepan. I put this on some toast and ate it. within half an hour the effects came on, I felt a light sense of well-being (quite subtle) after an hour or so this subsided into feeling very relaxed and calm. I went to sleep and felt extreme physical comfort, and slept very well.\r[Erowid Note: 40 poppy pods can be an extremely high dose and could be very dangerous.  The potency of plant materials can vary substantially and tolerance of opiates increases dramatically with use.  Overly high doses of opiates and poppy extracts can be life threatening.]</p><p>I did the same with 40 poppy pods. Then boiled the plant matter with the liquid for 2 minutes, sifted out the plant matter, and simmered the liquid down to a black tar, and ate it on toast (btw used 500ml of lemon juice this time and added bicarb so it wasnt so damn sour!)</p><p>This time effects were stronger, went into a dream world for about 4 hours just kinda thinking/dreaming really positive stuff and feeling incredibly comfortable. felt mildly euphoric for the next day.</p><p>It was very enjoyable, but not overwhelmingly physical/intense, in future I would like to try a more powerful combination so the effects are more overwhelming, as everything I felt was quite subtle and I am more keen on more powerful experiences.</p>"
}
