{
 "title": "Chemical Lobotomy",
 "author": "Crasswired",
 "citation": "   Crasswired. \"Chemical Lobotomy: experience with Quetiapine (Seroquel) (ID 35163)\". Erowid.org. Jun 12, 2006. erowid.org/exp/35163",
 "substance": "Quetiapine (Seroquel)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "550 mg",
   "oral",
   "Pharms - Quetiapine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35163",
   "Male",
   " ",
   "Not Given",
   "Jun 12, 2006",
   "Views: 15421",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I got prescribed some anti-psychotics after having a break down.  I've had a lot of fun with pharms over the years and I noticed at small doses these things made me feel a bit funny.  I decided to push it, just felt like getting loaded, not in the best of moods.  No real preparations were made, I made sure I had cigarettes near by and a lighter and some water.  I had fucked around with this stuff before, at like 300 mg, but I knew that I could push it farther based on what my doctors had told me and knowing how I handle pharmos.  </p><p>I have developed a tolerance to anti-psychotics due to taking them for bipolar disorder.  Anyways, about an hour later, my whole body went emotionally numb, not unpleasantly.  The opposite of excitement, brain flat line, nothing mattered. Difficulty swallowing and with mouth motions, a bit of dry mouth, smoking and cigarettes feel indescribably different. Definitely somewhat incapacitated when walking, stumbling around a bit. I could drool on this shit for hours and have the best time of my life. </p><p>I decide to go to bed, stumble there anyways, and I lay down.  This stuff has the rare side effect of hallucinations, I experienced some unpleasant auditory hallucinations of someone crying and whispering, I was so high it didn't matter though, although deep down I was terrified but I really couldn't feel it.  I fell asleep, woke up the next day fine but somewhat brain-dead for a while. </p><p>Anyways, it was actually the first time I got worried that I had overdosed.  This is some pretty serious stuff. Anyways, thats my 2 cents.</p>"
}
