{
 "title": "Realms of Reality",
 "author": "Realms of Reality",
 "citation": "   Realms of Reality. \"Realms of Reality: experience with Mushrooms - P. cubensis (ID 35189)\". Erowid.org. Dec 14, 2007. erowid.org/exp/35189",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35189",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 14, 2007",
   "Views: 2323",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hello, my name is Chris,  I have a long time Marijuana and Mushroom user. I have been doing mushrooms for 2 years now. Please allow me to tell you a background of my life.</p><p>I had grown up thinking drugs where horrible, until I had tried Marijuana and thought completely different ever since. I have lost a lot of friends because I decided to do drugs, but I didn't quit because these drugs make me complete. Anyways on with the story.</p><p>It was a cold day and I had 30 dollars so instead of getting the usual bag of marijuana I had called up a buddy and asked if he had some mushrooms to sell me. He said he had the last 7 grams of the shrooms and said he would give them to me for 30 dollars. I said ok and agreed to meet up with him up town. I walked uptown and saw him right away, I met him in the alley nearby where we had swapped the money with the shrooms. He had left and I went home. I waited until late night. I was in a happy mood and had nothing troubling me. I had nothing to finish up and no work to do.</p><p>At around 9pm, I chewed the mushrooms. Chewing them for about 2 minutes then swallowing. I had T.V,PS2 and Gamecube for entertainment and orange juice so I would have something trippy. About 40 minutes later I felt a buzz going on. At about 10:10pm while watching family guy, the colors began to get brighter. I looked at the wall, a single line spread across the wall, the line spread out like a wave and began to make zig-zags on the wall, when the zig-zag lines had spread out, one more wave shot from the middle, out of the wall and the wall started to breath, giving life to it instantly. The world had become my domain, all up in my brain. My mind had been released and was showing me the real world. Everything was alive, everything was moving.</p><p>At this point, my feet had melted into the floor and I felt stranded, like on an island, I began to think about the carribeans and of the life I wanted, a life in paradise, after this I thought that a half hour should have passed, when I checked the time it was only 10:23. I then got up and went onto the computer. I opened up to a message board and started recording my experience on text. The letters appeared out of nowhere, as if they had just came out of a wormhole leading to another dimension. Then, as my window was open, a breeze had came threw, knocking my thoughts out of my mind and taking them with it. My mind was blank, zoning out on the wall, then, my mind kicked in again.</p><p>I decided then, going to the mirror would be trippy, so I went. Walking felt strange, as if my legs where moving on thin air and I was hovering. I arrived in the bathroom and looked into the mirror. My face began to shrink, I was getting older, my face was being covered in zits. Then it went back to normal. I closed my eyes and then I saw thousands of blue dots, showering down my vision, tickling my brain. I looked at the mirror again, then left. I went back to the computer and checked the time. It was now 11:43. Time had slowed down then sped up.</p><p>I opened Quake 3 and went on a freeze tag server. I was fighting a whole bunch of monsters and the computer screen was glowing brightly, looking like it was a floating portal. It seemed as if this was another dimension, into the 'un-realistic world'. The person I was controlling, seemed like someone I was trying to control away from the people chasing him. I was trying to protect him. I ran but wouldn't keep attention, for at least 2 hours I was doing this. Until I noticed it was almost 2 am. The trip was coming down. I had regained a normal state of mind with mild visuals(Mist mainly). My body felt weird and I was happy with the experience. Since this I have treasured the mushroom as a delicacy.</p><p>Overall, My trip was decent and was the last one I had done. I will soon do mushrooms again, this time, I'm aiming for some really potent ones.</p>"
}
