{
 "title": "The Pleasantness of a Pipe",
 "author": "character",
 "citation": "   character. \"The Pleasantness of a Pipe: experience with Anadenanthera colubrina & Damiana (ID 35194)\". Erowid.org. Nov 22, 2004. erowid.org/exp/35194",
 "substance": "Anadenanthera colubrina & Damiana",
 "bodyweight": "198 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Anadenanthera colubrina",
   "(ground / crushed)",
   " ",
   "  ",
   "smoked",
   "Damiana",
   "(ground / crushed)",
   " ",
   "  ",
   " ",
   "Pharms - Fluoxetine",
   "(daily)",
   " ",
   "  ",
   " ",
   "Pharms - Risperidone",
   "(daily)",
   " ",
   "  ",
   " ",
   "Pharms - Topiramate",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35194",
   "Not Specified",
   " ",
   "Not Given",
   "Nov 22, 2004",
   "Views: 24513",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The colubrine seeds were heated till they expanded  much to my delight  and popped. A light smell came throughout the kitchen because of the seeds; I didnt cover the pan I was using to heat them or to turn on the extractor fan because of it. The smell was like burnt marshmallow jellybeans mixed with the smell of your nearest Indo-Pak market. It was pleasant. The beans were removed from the heat to reduce chance of burning after three of them had popped. At this point I lightly smashed them with my wooden spoon to see the insides and do the grinders work for it.</p><p>Into the grinder: The five heated colubrine seeds went first and alone until a good even consistency. Then, as much Damiana was added and ground again  until a good even consistency. The Damiana wasnt added for its effects so much as it was added to help the powdered seeds burn. I had been told that it burns to a goo by itself. The result was the same Regan-bean / Indo-Pak market store smell, a light gold and black speckled powder and slightly stupefying just sniffing it. It was put into the corner of a ripped up plastic baggie twisty-tied shut and put in my pocket for my three hour Thursday job.</p><p>Work was dumb. I was glad to be home.</p><p>At home I devoured one big cookie. It was the only thing I had ate all day. A tall glass of apple juice soon followed. I found a piece to use, a filter, lighter, large open room, and the cat. The cat as I decided- should not go near the smoke. Somehow the powder had transferred itself to my left shirt pocket from my right pants pocket. I was searching for a while for it. After this moment of distress I gathered my senses and took my first puff.</p><p>The smoke was not harsh as was expected from reports read though similar to other writers I found that the last few hits could be held in much longer than the first few which added to and was the experience for that leg of the journey. Holding my breath I found that I could inhale a second time a wondrous thing but perfectly explainable if I only took shallow breaths. At the same time I worried that because I didnt see any smoke exhaled when I did this sometimes that I had lost it in my lungs that I would hurt myself I didnt linger too long on the subject. What was important was the task at hand - that was no chore -finishing the bowl. It took about 12 puffs. This had taken four minutes.</p><p>When I stood up I was very very tall. **no nausea noticed** Immediately I wanted to tell my cat without words that I was sorry he couldnt come in the room with me. The ceiling fan was switched on and the door leading outside was opened in hopes of expelling the smoke. It looked like it sunk it was rather heavy. He was fine. He did want to go outside though. I told him in words no.</p><p>I lied down with no pillows and thought about thinky things. I could easily control my bodys sensations just by applying existential patterns to my meditation. I chose to feel sexual and boy did I ever. If my thought did linger my sensations follow. It was good. I wanted to feel sexual and I kept on feeling it.  I choose to feel this way  I choose to perceive this sensation as the next step before my chosen point of climax  This same pattern could be used for any sensation. One could use it for depression and choose to feel uplifted or one could choose to feel what its like to feel otherwise upset. Orgasmic is the first feeling that came to mind that day.</p><p>At four o Clock I had a doctors appointment that day, I wasnt baseline by then only enough that I would notice. I had dosed at around 12.30. The doctor gave me a refill (times 12 holy shit man!) for my medicines. Topomax  mood stabilizer, Risperdal  Antispyschotic and Fluoxotine  SSRI type anti-depressant. </p><p>The pleasantness of this compared to railing the powder has galaxies of range. A good cap for Thursday for certain.</p>"
}
