{
 "title": "Spinning Circus",
 "author": "Patryn",
 "citation": "   Patryn. \"Spinning Circus: experience with Salvia divinorum (15X Extract) (ID 35219)\". Erowid.org. May 9, 2007. erowid.org/exp/35219",
 "substance": "Salvia divinorum (15X Extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35219",
   "Male",
   " ",
   "Not Given",
   "May 9, 2007",
   "Views: 2783",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I experienced salvia divinorum for the first time last spring. I had read and heard plenty about it, and was expecting an interesting trip. It was a good time for experimenting. I bought the 15x extract from a local headshop ($30 for 2 grams, more than enough for several hits), and my friend, gf, and I settled into the apartment. Preparation involved being a little anxious for a trip, but no special accomodations were made prior to testing.</p><p>We tried a few small hits (a tiny pinch) on the patio and received an interesting sensation. It was as if everything suddenly became 2D. It was encouraging. Having tested it in this manner, we moved inside to the bedroom. My friend took a larger hit (a generous pinch), wandered into the bedroom and plopped onto the bed. This stuff works really, really fast (mere seconds), and once it hit, he lost all sense of reality. My friend's face looked like it just melted, every muscle went lax, and he was gone. I took my hit, and before I even exhaled the world changed. I was no longer a human, I was a one wall of my bedroom, my friend was another, and my gf (tripsitting) was yet another. We were all spinning, each flattened against a different wall, like in some insane clothesdryer. My arms were stretched to infinity, plastered to the wall, one with the wall.</p><p>Reality had always been like this, I was always like this. All my life was a lie, a distant dream. It had never existed. I was a mere side of a vast, whirling universe, a facet of some demented jewel. A voice in my head was laughing at my predicament, a maddening laugh that stirred anger within me. Strange sensations surged throught my body. My hairs prickled; I felt like I was a cactus that had become aware of its spikes, only that I was feeling them poke into me. My limbs coursed with obnoxious pulses, and their being stretched to infinity was not as exhilarating as it sounds. My jaw was separate from my skull, my teeth felt like repelling magnets, and I had the odd thought (and compulsion) that I could rip it off. All in all some very unpleasant feelings. Fortunately, my gf turned on some tunes, but she was having trouble choosing them, and this annoyed me to no end. </p><p>I ceased my rolling on the floor next to the bed (probably accounts for the spinning), and got up to pick some good music on the computer. My friend had already returned to some semblance of coherence, and I was fast on my way, too. I was still annoyed with the ghoulish laugh, and my gf's fumbling at the computer. My limbs didn't want to respond according to my commands, and this boiled my blood even more (which probably accounts for that odd pulsing sensation). The more I regained control of my body, the more the unpleasant sensations faded. Faster and faster they subsided, and I was back to cognizance, with some residual effects still lingering. My skin and hair felt itchy (probably the spiny prickles), so I had to scratch for a while to relieve it. The circus clown laugh was all that remained, somehow etched in my mind, stuck in some sickening loop in my head. A few more seconds of music resolved this effect and I was left feeling a bit shaken.</p><p>I would recommend this to someone who knows how to handle it. I was cocky and arrogant in my approach. 'What a fun trip we'll all have!' I thought I could tame this plant, having tried various other psychedelics with much success. I was wrong to mess with this crazed circus elephant. It squished me flat and put me in my place. My gf and I still have it in a little baggy, hidden away somewhere. I doubt I would try it again, if I did, it would be at a much lower dosage, with a much slower onset. Some nice THC would help, too. Setting and warranted preconceived notions are the key to effective use of this substance. Treat the plant with respect, and don't be fooled into believing that because it is legal it is mild or ineffective. Enjoy your trips, fellow psychonauts!</p>"
}
