{
 "title": "Uncured Variety",
 "author": "kleineskind",
 "citation": "   kleineskind. \"Uncured Variety: experience with Tobacco & Catnip (ID 35229)\". Erowid.org. May 30, 2009. erowid.org/exp/35229",
 "substance": "Tobacco & Catnip",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco",
   " ",
   "  ",
   "smoked",
   "Catnip"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35229",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 30, 2009",
   "Views: 9541",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been reading on many different legal forms of medicinal herbs.  I felt rather compelled to test a few out.  My first mix was that of uncured tobacco and catnip.</p><p>The Indians have been using this form of tobacco for hundreds of years and I became interested in the power that it was written to have.  Various books and online sources specify that the dose of the uncured is rather dangerous compared to the dose of the cured form.  The chemical perspective of the whole theory is that a lot of the alkaloids are destroyed during the curing process and because the Indians would let them dry in the shade, the final product was potent enough to cause unconsciousness after as little as a cigarette.</p><p>I live in the middle of farm land and get free stock all time; this stock season, I asked for uncured tobacco.  I let it dry in my closet (dark, dry environment).</p><p>I have a pipe and papers to see the different effects (there can be noted differences due to the heat in a pipe compared to the heat in a joint).</p><p>2 grams of uncured tobacco in my pipe (take note, it is a stone pipe; not too sure on how it affects the overall temperature).</p><p>I noticed a bit more than the normal tobacco.... It wasn't much, I wouldn't say that I wanted to pass out.  It made me a bit lightheaded, as a lot of smokes would, but nothing too out of the ordinary. The slight euphoric feel subsided quickly. </p><p>1.5 grams of uncured tobacco in my papers.</p><p>Nothing far from the experience from my pipe.  I did get knocked with a quicker delivery of the drug, but as it states above, it subsided rather quickly.</p><p>I tried a lot of mixing with the catnip.  I got very little varying results.  There was a slower impact of the euphoria feel the more catnip I put into the mix.  I did notice that the hyperactivity/uneasy feeling lasted longer with the tobacco. </p><p>My conclusion on the matter of uncured tobacco is that it was quite unimpressive.  It is not as powerful as I had read it to be.  Now, it could be the species of the tobacco.  There are a lot of variations to this plant, the Indians may have used a hybrid of some sort due to their relative isolation.</p>"
}
