{
 "title": "The Blue Room",
 "author": "The Reverend Jim",
 "citation": "   The Reverend Jim. \"The Blue Room: experience with Salvia divinorum (ID 3524)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3524",
 "substance": "Salvia divinorum",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3524",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 3405",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt's now 30 minutes since I made my second attempt at smoking Salvia. Having been interested in psychoactive plants for some time now, and after researching the subject well I decided upon salvia as being my plant of choice.</p><p>My first attempt had produced a mild stoned effect and I had noticed a marked change in my response to colours and patterns (my carpet), but hadn't had any real visual disturbances nor found myself in the deep state which others report. But this was my first time, and I was quite taken aback by the strength of the smoke.</p><p>For my second attempt, I made sure I was relaxed and in a comfortable and quiet environment and started my quest. I lit up my small pipe, and took back one large hit of salvia and held in the smoke. As I exhaled I felt the effects hit me, and started quite shakily to fill the pipe and take a second hit. After the second hit I put down the pipe and as I exhaled the effects hit me.</p><p>Firstly I started to try to say to myself how odd I felt, but my mouth sounded odd and I started to laugh. As I looked round objects in the room started to distort and I carried on laughing at the oddness of it all. I stood up and realised how dizzy I was, and that my vision wasn't accurately reporting what I knew was normal (or is it?!). I layed back down and carried on laughing at the absurdity of it all. The effects wore off after about 10 minutes and I felt normal again. There was still some mild after effects, including a slight feeling of enhanced visual senses.</p><p>Right now, I am still feeling a bit different but in a positive way. </p><p>I am looking forward to trying another time, and hopefully feeling the full effects of salvia. </p><p>It was a very powerful experience and I got the feeling I was just scratching the surface.</p>"
}
