{
 "title": "The Celery Psychedelic",
 "author": "Pseudanonymous",
 "citation": "   Pseudanonymous. \"The Celery Psychedelic: experience with 2C-T-4 (ID 35243)\". Erowid.org. Jul 19, 2004. erowid.org/exp/35243",
 "substance": "2C-T-4",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-T-4",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35243",
   "Male",
   " ",
   "Not Given",
   "Jul 19, 2004",
   "13853",
   " "
  ]
 ],
 "report": "<p>8:30 am - planning to take 30mg 2C-T-4 HCl orally.  is my first time with this substance.  i am interested to see what my experience will be like.  </p><p>- expectations: this is supposed to be a long-lasting substance (12-16 hours)  The come-up period is long, occurring over about 3 hours.  I am assuming that the high dose may extend the length of effects to perhaps 20 hours.  the substance is not reported to have a strong body load compared to 2C-T-7 or 2C-T-2, however there were a few reports of brief nausea or stomach discomfort and muscle tension.  Many of the reports described a psychedelic state 'different' than that of 2C-T-7 or 2C-T-2.  Some suggested that the visual component was less prominent.</p><p>reason for higher than usual dose: experiences with 2C-T-7 were most rewarding for me at 40 - 50 mg oral dosages (compared to PiHKAL dosage range of 10 - 30 mg)... by analogy I choose to take 30 mg compared to PiHKAL dosage range of 8 - 20 mg.  </p><p>9 am - ingest 30 mg of 2C-T-4 HCl in a gel cap.  gel cap ingested without any difficulty, washed down with a swig of iced root beer.  NPR is playing in the background.</p><p>9:30 am - not feeling much of anything yet, perhaps a mild sensation of looseness or indifference... however, computer screen seems to have greater than usual brightness contrast.  what this will develop into, let's see...</p><p>10:00 am - Still not feeling much... there are some effects, but they are very indistinct and mild.  turn off NPR and put on the movie 'eXistenZ'</p><p>10:30 am - effects becoming noticeable.  there is some visual alteration but it is different than that of other psychedelics -- no breathing or patterning, just a change in the quality of light and depth.  Things seem slightly tinged green-blue.  Lots of paraesthesia, some chilly feelings, body stretches.  A slight queasiness and a couple episodes of shivers, shakes and retching, but these are perceived as minor & not really distracting or unpleasant.  Overall feeling is calm.  So far this is feeling pretty good, and different than other psychedelics.  There does not seem to be a stimulant aspect; I feel as though i could even go to sleep if desired.  It is interesting that people report not being able to sleep at the tail end of the experience.  There is no great enhancement of the thought process.  Physically, this does not feel like sensitization, more like 'flowing'.</p><p>11:30 am - effects are strong and still gaining in strength.  there are still no traditional psychedelic visuals, although the visual field is altered and enhanced in a shimmering way.  CEVs are present but modest.  Body feel is pleasant and relaxed... good tone, yawning, a unique buzzfeel, limited bandwidth.  Sense of queasiness has dissipated, was never significant.  emotional feeling is calm and good natured.  movie eXistenZ has finished.  enhanced appreciation for conceptual play in the movie, picked up on some new insinuations.  There was a lucidity of vision; faces of characters stood out, facial expressions were experienced with great clarity, body language and vocal inflection were perceived as an open, literal, intelligible information channel.</p><p>There does not seem to be a sense of intense sensory or emotional drama with this compound, especially compared to some of the tryptamines.  Also it does not seem possible to 'curl' the experience into a greater degree of intensity by interior concentration (in contrast to 2C-I)  Yet the sense of alteration is very distinct and strong: a physical and mental feeling of being 'spaced out', yet still focused on the immediate surroundings.   Thinking is clear, somewhat dispassionate.  putting NPR back on and lying down.</p><p>12:00 pm -3:00 pm - effects at a plateau for the last 3 hours.  +++, intense (would not want to be in public) but definitely manageable (no trouble typing).  feeling is comfortable and 'unique'.  there are no spectacular fireworks on the upside (no explosion of thoughts, insights, visions or perceptions), and no dark corners or body load on the downside.  Absolutely no muscle tension.   Tactile is somewhat velvety, but totally non-erotic.  this is not an escapist material; presence is firmly grounded in the surroundings.  30 mg seems to be a good level of 2C-T-4 for me.  Ate some celery  It was considered that 2C-T-4 is the 'celery' psychedelic.   </p><p>3:30 pm - effects are diminishing in intensity.  at a ++.  it seems that there is indeed a lot of variability between individuals in the dosage and duration of this compound  </p><p>5:30 pm - at a pleasant + and a half,</p><p>10:30 pm - at a bland +.  </p><p>3:00 am - threshold effects still present.  no headache, no muscle tension, no peripheral stimulation.  on the other hand, no meaningful effects, and sleepy but somehow no sleep possible.  the first 8 hours of 2C-T-4 are good, the last 8 hours I could do without.  Feel like taking a shower.</p><p>Overall, much different than 2C-T-7 or any of the other psychedelics I have tried.  Pleasant, unique, but unspectacular.</p>"
}
