{
 "title": "Visions of the Past",
 "author": "Mcnail",
 "citation": "   Mcnail. \"Visions of the Past: experience with Inhalants (Gasoline) (ID 35308)\". Erowid.org. Jun 19, 2007. erowid.org/exp/35308",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35308",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 6427",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I've been addicted to many drugs in my life time ranging from coke to meth but nothing is worse than an addiction to huffing gasoline.  Its a mind trip that no one should be asked to handle.  This account of my worst trip ever will forever haunt my mind.</p><p>It was a sunny morning in my small hometown and I was feeling a bit perturbed because it had been several days since I'd done any sort of drug.  For me, not consuming any kind of drug for more than a 24 hour period is incredible, so I was ready to get back to my usual habits not knowing that the worst was yet to come.</p><p>As any other day I was glued in front of the television trying to control my boredom, when the 'unforgettable' taste came lingering into my mouth.  I knew the taste well, it was the haunting taste of gas.  At this moment I immediately searched for any money to buy something else so I could fight the urge.  I was panicked because I knew if I couldnt find money I would cave in to temptation.  Sweaty from anxiety I ended up empty handed and the urge to huff was still running strong.  I said to myself, ' I'll just huff a little', but knew that I would fail.</p><p>I quickly ran to the kitchen and grabbed one of those plastic freezer bags from the drawer.  As I walked towards my garage I felt a sort of eeriness but decided to forget about it.  Grabbing the red gas can out of the corner I filled the plastic bag half full and began to huff.  After about 15 mins I started to feel the incredible buzz, I huffed a bit more(5mins) and then it hit me!</p><p>The high started out like it usually did, me wandering around in my backyard thinking I was in a magical land of freedom.  The sounds of birds chirping, cars passing and lawnmowers starting, created a sort of dream like state of mind.  Getting nauseous and a bit lightheaded I sat on my swing to relax.  As I sat there, I heard a tremendous Mac truck flying towards my house(didnt know if it was real or a figment of my imagination) getting scared as it came close, I closed my eyes and it seemed as if the truck hit me and all at once this vision of my self appeared  on the other seat on my swing.  It came down in 3-D pieces and had a weird echo to it and then I snapped back into reality.</p><p>That was the last time I have ever huffed anything and still to this day fear the sound of passing big rigs.</p>"
}
