{
 "title": "Haven't Cried like that for Years",
 "author": "UmbrellaTools",
 "citation": "   UmbrellaTools. \"Haven't Cried like that for Years: experience with Toad Venom (ID 35304)\". Erowid.org. Mar 5, 2008. erowid.org/exp/35304",
 "substance": "Toad Venom",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Toad Venom",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35304",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2008",
   "Views: 22495",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI got back from Arizona, and had collected the venom I promised to bring back. I only found 3 toads, but one was a large female, so she blessed me with a large amount of venom. I've never 'tripped' before, and had only smoked marijuana, speed by products and most legal highs. Anyways..I loaded my freebase pipe up with around a match size head and lit the bottom with a standard lighter. The dried venom began to crackle and smoke while I proceeded to inhale. I dident take a large hit in fear of over doing it, but I got a strange buzz. I quickly looked around to catch anything morphing or moving. I stood up and stumbled through my room and out into the bathroom to check out my face.\r\nNothing was happening except for this strange buzz. A mixture of being high and drunk. I went back in the closet, and decided I wasent gonna fuck around and beast it. I finished the rest in one hit and thats when the shit took over. While I held the smoke in I felt a wave of electricity and numbness sweep up my spine, into my neck and around the back of my skull. My body went into a tremor, and my arms,hands and stomach vibrated violently. I looked up at my savanna monitor lizard and watched his neck inflate and head move. The come up was to intense and it felt as if I had hundreds of razor blades stuck inbetween my spine and nerve cords. The feeling was that of electricty jolting up my spine. My world split apart and I had the feeling of being not of my body, but being inside. \r\nI was blacked out, but awake. Numb, but cringed at the intense wave of electricty. I began to panic and stumbled out into the dark room lit with black light. I tried to grab onto anything to hold on and not loose the world. I wouldent close my eyes, and I couldent stop grabbing myself. My hands felt like they would melt into me and everything else I touched began to melt into me. My head could be molded like puddy, as well as anything else I got ahold of. My blanket began to slide from me, and melt into my grasp. I thought I was having a bad reaction, and was gonna die. I grabbed the phone and called my g/f to help talk me through it, and it helped a bit. I slowly came down and enjoyed a nice blissful high. \r\nSome people compare this feeling to 'E'. I wouldent know however.... All I know is I had a smile plastered on my face.  After the peak, things seem warped and out of place. I noticed things were amplified and everythings size was fucked up. I felt my head wasent attached to my body and that my arms were stretched way out.\r\nAll in all it was a crazy fucking expirence.  I dident really hallucinate, so dont go thinking its like shrooms or acid. I never tried those either, but all my friends have and they said this was alot more intense. All but one felt they were dying. Im sure if I take enough, I'll trip hard but.....its a fucked up drug that takes time to get used to. Total ego loss and 100% unexpected effects. I honestly havent cried like that for years.....I was that certain I was gonna die.  \r\nIt was intense. I had no closed eye visuals, or much open eyed ones either....\n\n\n"
}
