{
 "title": "Diddlesticks",
 "author": "Pipesmoker",
 "citation": "   Pipesmoker. \"Diddlesticks: experience with Mushrooms - P. Cubensis (ID 35311)\". Erowid.org. Jul 31, 2007. erowid.org/exp/35311",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)",
   "  T+ 3:00",
   "20 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35311",
   "Male",
   " ",
   "Not Given",
   "Jul 31, 2007",
   "Views: 3968",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been smoking weed frequently, and opium now and then for a while now. I'd tripped three times on morning glory (LSA) (levels 2, 2 and 3 in that order) and I wanted to try mushrooms for a change in the hope of a more intense experience. I bought 60g of fresh Indian cubes, and shared them out between myself, my Dad and my brother. I took around 35g, my bro around 15g and my Dad around 5g. Boy, I was in for a hell of a ride! </p><p>It was about 10pm and all three of us were lying on my bedroom floor, and listening to Bob Marley when I dished them out. I took 15g at first, and coming up was pretty uncomfortable, but no more so than the morning glory. Everything just seemed weird, and strange. After about 90 minutes, some visuals started, but not in the way I expected. With high doses of weed I get coloured dots, and lattice patterns overlaying my whole visual field, but I didn't get that with the mushrooms at all. The visuals were clear and lucid and I wasn't expecting this. The walls seemed very tall and concave, and my saxophone was bending and waving from side to side, and the chequered patterns on my curtains were flowing. At this point I wasn't getting any colours. </p><p>I remember saying to my Dad 'What the fuck am I?' but he was just enjoying mild effects, and went to bed after about 2 hours quite happy and content. Myself and my brother went into my bro's room and we wrote some very strange, but funny e-mails to his friends, in between uncontrollable fits of laughter. I walked into the bathroom - I felt like I was about 16 feet tall, and looking down at the world below. I looked in the mirror - I looked like a madman! My pupils were bloody huge, and I was dripping with sweat and my hair was sticking up everywhere! Me and my brother then, for some reason stripped off naked. My bro then went into the bathroom proceeded to pour a can of coke-cola all over himself, while laughing. I then happend to notice I was on the floor, creased with laughter. </p><p>We then spent the next hour making some really outrageous, abstract images on the computer using photoshop, in between picking ourselves off the floor from laughing. Everything was funny, the computer, my brother, the floor, even my lavalamp, it was all so funny I couldn't stop laughing.</p><p>Towards the end of the hour though we both got really sedated and couldn't be bothered to even move an arm, but this passed fairly quickly. I remember thinking how I couldn't understand how anybody could have a bad trip from this, because it was so FUCKING GREAT! He said he was really tired, and wanted to go to bed. So I said goodnight, and went into my room again. I decided I was having so much fun that I'd take the rest of my mushrooms and redosed with 20g at 1am, which would be hour three. I was still very heavy and sedated. I lay down listening to music, watching the swirling colours on my walls, and I was getting really weird 3d closed eye visuals.</p><p>After two hours of this, I suddenly found myself amazingly stimulated, and jumped up out of bed, only to feel my feet sink into the ground and ripples spreading across the floor from where my feet were - Pictures and other things on the wall were moving around as if they were fridge magnets being pushed around. I went downstairs, still naked but it seemed to take ages as the stairs seemed to get longer and longer. I made into the kitchen, where, after picking myself off the floor from laughing I put utensils like serving spoons into the holes in the cupboard door handles, and arranged food in seeming meaningful symbolic arrangements.</p><p>Then I got a notepad, and with a big pen wrote strange messages about 'Diddlesticks' - I couldn't control myself! I was like a kid. After writing every single word, I would have to pick myself off the floor from laughing to write the next one. I have NO idea what the FUCK a diddlestick is by the way. Some of the messages were things like </p><p>'Mmmmm......for breakfast I think I'll have DIDDLESTICKS' </p><p>'Can I buy you a DIDDLESTICK?!' </p><p>'LOOK! Another DIDDLESTICK!!' </p><p>'Would this be a DIDDLESTICK?!' </p><p>'What the FUCK is a DIDDLESTICK anyway?' </p><p>'Welcome, my dear DIDDLESTICK!!!' </p><p>'I AM A DIDDLESTICK' </p><p>I then used some glue, to stick these messages ALL over the kitchen!! I then wrote one final one saying 'I apologise for the DIDDLESTICKS!' and stuck it on the kitchen door, and closed the door and went back upstairs.</p><p>The next bit is a bit of a blur, because reality faded into a wacky world of colours and hilarity. But I did manage to get back upstairs somehow, inbetween picking myself off the floor from laughing. I remember talking to objects, and having conversations with the toilet. Somehow, I managed to pass 3 hours with those diddlesticks, and it was 6am, and starting to get light outside. I wasn't coming down, and my pupils were still as large as ever. Around 7am, while still tripping balls I feel into a strange sleep, with very vivid dreams. I woke up at 12noon, and the first thing that popped into my head was 'WHAT THE FUCK?' I have never had such a night in my life! </p><p>Compared to LSA, mushrooms seem to mess with my thought patterns more, are definitely more visual, and I had much more laughter. However, on the LSA I enjoyed music more, felt more at peace and more content with myself. Also I grew more, and had a deeper more mystical experince on the LSA.</p>"
}
