{
 "title": "Cancelled Effects?",
 "author": "JF",
 "citation": "   JF. \"Cancelled Effects?: experience with Salvia divinorum & Buprenorphine (ID 35324)\". Erowid.org. Jul 21, 2004. erowid.org/exp/35324",
 "substance": "Salvia divinorum & Buprenorphine",
 "bodyweight": "78 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Buprenorphine",
   "(daily)",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "35324",
   "Male",
   " ",
   "Not Given",
   "Jul 21, 2004",
   "Views: 17129",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have a medical treatment: 0.4 mg X 4= 0.16 mg (near to the classical dose of  2 mg) of Subutex (buprenorphine) per day.</p><p>I noticed that Salvia divinorum doesn't work as usual, even with good extracts (X5 from a good store). Just this feeling of salvia gravity, bouncy effects, sweating and nothing else, except being tired.  I noticed the same thing  with codeine...but a little bit less. I wonder if it's because of the gaba & kappa receptors.</p><p>So, the first time I took Salvia, I was not on Subutex at all; I smoked just some dried leaves in a water pipe, and I felt  a change in my mind and body. Bouncy effects, laughing a lot, irrationnal thoughts...and sweat!  </p><p>The second time,it was an extract 5X and I've been a bit scared! I just took a hit in my korean pipe and I lost my body! I was in a very old country house in britanny, and I was near the cheminey. And,I became the cheminey!!! out of body experience. My girl friend, who is a doctor, laughed at me! I could'nt move at all and I was really impressed; But, I was nervous: I told her:'You can't imagine what's happened.....Ha,I lost my body!!!'.</p><p>Again,with extract, I tripped really hard: I became an animal! and i realized my dreams were coming true. After, I used normal dried leaves, and it was really intense, but a bit less hard; Sounds and musics were really intense, the furnitures of my appartement were shining....etc...</p><p>I have a good experience of  a salvia trip (I made myself an elixir, but it was too strong: nothing happened and suddenly....wow!I was on my bed, thinking I was in a little village in Spain at the dawn! (I was in Paris,hum...).</p><p>Since I'm on subutex, it's quite different. The trip doesn't really start....and the few effects are vey short. I want to stop this horrible subutex, if my doctor is okay, and back to my very philosophical diviner's sage!</p><p>--------------------</p><p>Aug 24 2004 update:</p><p>I stopped Subutex and I noticed S.D was much more active. The only problem with this horrible Subutex, it's quite hard to stop using it. So,I had to get back on it, 'cause I was not very well. Anxiety, panic and bad sleep....</p><p>I was only addicted to codeine, so I don't think it's a good way to get out of this stuff with Subutex. I guess, it's a good product for people who are on heroin.</p><p>So,if you want to slow down on Subutex, please, do it very, very slowly!</p>"
}
