{
 "title": "Panic Ensued",
 "author": "Always up",
 "citation": "Citation:   Always up. \"Panic Ensued: experience with Amitriptyline (Elavil), Sertraline (Zoloft) & Cannabis (ID 35338)\". Erowid.org. Aug 21, 2007. erowid.org/exp/35338",
 "substance": "Amitriptyline (Elavil), Sertraline (Zoloft) & Cannabis",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)",
   " ",
   "50 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(pill / tablet)",
   " ",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35338",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 21, 2007",
   "Views: 11086",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOk, so I was not ready for this.  I am actually prescibed the medications listed above for a combination of anxiety/depression.  This was my first day to have the Elavil and so I took 2 of the new pills, plus my zoloft and smoked a couple of chillums of cannabis.  I smoke cannabis on average of 10 times a day, so I don't really get 'high' anymore.  But after smoking these chillums I started to feel really high, which was weird.  Then I went to walk to the TV room, and was stumbling. I layed and watched tv, not really able to move, and my vision was completely messed up.  I had tunnel vision in on the tv, and nothing seemed to be real.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r\nSo then I left my friends house and proceeded home, felt like I was driving a space ship or something, nothing seemed real, and I could feel myself just blanking staring at the road, not really even realising I was driving.  I got home and all I wanted to do was pass out and get a good nights sleep.  But instead when I layed down, I felt like a ton of bricks was on top of me and it felt like a huge ball was in my mouth, and felt like I couldn't swallow or breathe.\r\nWent down to get some water and hopefully feel better.  It took about an hour for this feeling to go away before I could pass out.  By the time all of this was over it had been nearly 3 and 1/2 hours since I had smoked, and I still felt high.  It was the craziest thing I have ever experienced when I wasn't planning on having a psychological event, like with mushrooms or lsd.  I don't know if it was a combination of the drugs or just the new elavil, but I never want to feel that again.\n\n\n"
}