{
 "title": "Trip of a Lifetime",
 "author": "Bozo the Clown",
 "citation": "Citation:   Bozo the Clown. \"Trip of a Lifetime: experience with DXM (ID 35352)\". Erowid.org. Mar 26, 2008. erowid.org/exp/35352",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "8 oz",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 1:00",
   "8 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35352",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 26, 2008",
   "Views: 4544",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am currently in the Military, not only that but I am in Iraq. I have been here since the beginning of 2004. After a while the boredom really starts to set in. So one day after an 8 hour shift at work, I returned to my sleeping area. I had received a bunch of bottles of Robitusin DM in the mail from a friend. I had tripped before and decided I was going to push off. At around 8:00 am I took one 8oz bottle orally. After about an hour or so, I took the second 8oz bottle. I sat down and started watching a movie, just waiting for the effects to kick in.\r\nNext thing I know, I am waking up. I was feeling kind of sick, so I stood up. When I stood up I was really dizzy and couldn't remember where I was or what I was doing. On top of that, I couldn't see very clearly. So I stumbled out the door and tried to make it to the bathroom. I made it and stuck my head in the toilet. Nothing wanted to come out, so I got up and walked back into the room. I sat on my bed for a second. I was so hot that I need to get some air, so I curled up right next to the A/C.\r\nMy buddy who sleeps right there woke up to me laying on the corner of his bed. Then I stood up again and fell over. Apparently from what my friends told me, one of our doctors came in after someone went and got him, he asked me a bunch of questions. First question he asked was what my name was, and I couldn't tell him. Then he asked me where I was, and I couldn't tell him that. Then I said I had to puke, so he and a buddy picked me up and put my arms around the backs of their necks. Once the door opened and the heat from outside hit me, I decided that I didn't want to go outside anymore. So I sat back down. I couldn't really walk, so the doc picked me up and carried me to other room that was colder. After that I got a bunch of IV's. Then a shot of phenegrin. After that I was stupider than ever. All and all the trip was tons of fun, once I could see again and was able to not want to puke.\n\n\n"
}