{
 "title": "Nasty Body Feeling",
 "author": "Jesper",
 "citation": "   Jesper. \"Nasty Body Feeling: experience with Caffeine (ID 35369)\". Erowid.org. Dec 7, 2004. erowid.org/exp/35369",
 "substance": "Caffeine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 35369",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 7, 2004",
   "Views: 13851",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report does not refer to a single experience, but instead multiple experiences throughout the past several years, up until I completely quit using even small amounts (5 mg) of caffeine.</p><p>I've always, since childhood, felt I reacted strangely to caffeine, but nonetheless consumed sodas nearly every day throughout childhood and adolescence.  This never caused me any trouble, but I often could swear that the stuff made me tired.</p><p>Fast forward to about age 19. (It is noteworthy that from age 18 - 20 I took Effexor at 275-300 mg daily) Sometimes, after consuming 50-100 mg of caffeine, and especially in combination with moderate amounts of cannabis, I would get a really nasty feeling throughout my body.  The feeling is best described lethargy, achiness, and overstimulation all at once. It is akin to the nasty body feeling of having a bad cold, minus the respiratory symptoms, fever, and headache. Since this only happened on occasion, I never really connected it with caffeine consumption.</p><p>Fast forward again to age 23. I seldom used caffeine over the past several years, but occasionlly did and would find that I would get EXTREMELY JACKED on just a cup of coffee (at least as stimulated as 15 or 20 mg of Adderall will get me).  50-200 mg of caffeine, again especially (but not necessarily) in combination with cannabis, begins to consistently produce that nasty feeling.  It would typically take about a day after drinking a Mountain Dew or a cup of coffee for it to manifest. But then I'd feel the malaise coming on, and it would remain for longer and longer periods of time, eventually lasting as long as a week after a single consumption!  The body feeling also became stronger, intensely unpleasurable, and affected my sleep.  I made a certain correlation with caffeine and stopped its use (including chocolate) entirely.</p><p>Now, I NEVER get that feeling UNLESS I accidentally consume caffeine.  The last time it happened was after I drank a mixed alcoholic drink containing about a third of a Coke.  I initially assumed that such a small amount would certainly not cause any trouble, but sure enough, the next day I felt the malaise, which continued for 3 days total!</p><p>Maybe I just metabolize the stuff in a strange way.  Cannabis and past use of Effexor may contribute through means of norepinephrine modulation, though I don't know enough about this to do anything but guess.  I have read that with caffeine, one is more likely to develop an allergy with increased exposure, so perhaps this is the case.</p><p>I do know that other stimulants such as ephedrine, cocaine, amphetamines, and even ginger and ginseng never cause this problem for me.  Another strange thing I have noticed is that chocolate combined with cannabis will almost definitely create an extremely apathetic and depressed state in me.  Since theobromine is a caffeine relative, perhaps there is a connection here.</p><p>It really sucks because I do have to resort to using possibly more dangerous stimulants when I need a boost.  Caffeine is also in SO many things that I'm constantly on guard for it.  Trust me, the nasty feeling is truly awful for me - so bad, that I'd rather have an alcohol hangover any day than to experience it again.</p>"
}
