{
 "title": "Friendly but Heavy...",
 "author": "Kales002",
 "citation": "   Kales002. \"Friendly but Heavy...: experience with 4-Acetoxy-MiPT & Ditropan (ID 35366)\". Erowid.org. Sep 8, 2005. erowid.org/exp/35366",
 "substance": "4-Acetoxy-MiPT & Ditropan",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   " ",
   "Pharms - Alprazolam",
   "(daily)",
   " ",
   "1.0 mg",
   " ",
   "Pharms - Clonazepam",
   "(daily)",
   " ",
   "15 mg",
   " ",
   "Pharmaceuticals",
   "(daily)",
   " ",
   "6.0 mg",
   "oral",
   "4-Acetoxy-MiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35366",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 8, 2005",
   "Views: 9148",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First of all a little about me. So far I took about 200 XTC pills, MDMA, MDEA, and MDA, Ive also taken Shrooms (P. Cubensis) about 20 times, 2C-I once, Methamphetamine, LSA, Salvia Divinorum and Cannabis. I also take Xanax (2mg/day), Clonopin (1mg/day) and Ditropan XL (15mg/day).  [Erowid Note: Ditropan is for the treatment of overactive bladder, reducing the symptoms of urge incontinence, urgency, and frequent urination.]</p><p>Why 6mg of 4-AcO-MiPT, because Im very, very..... sensitive to any substance. I have not read of anyone seeing OEV patterns after dropping a 2nd pill of MDMA 2 hours after the first one. When it comes to shrooms, Ive never taken more than 1.6g. 0.7g lets me see patterns if I focus, 1.2g gives me nice level 3 experience, patterns everywhere I look beautiful colors, ego softening light disconnection from reality. 1.6g Total Ego loss. I have no idea what I am. Where I am streets and grass look more like a sea, waves everywhere, thinking my aquarium is a portal to some other reality, body load extreme, can barely walk. Cars appear to be 30ft long and such :) Fun times but never took more than that. Just dont want to go there. So When I take 1.6g of P. Cubensis, it like some people who take 15g of it. </p><p>Back to 4-AcO-MiPT: First time I took it, it was 4mg just to see what its like. It was nice not too intense, so I decided a week later to add another 50% to get somewhere. I sure did.</p><p>T 0:00 I take 6mg (on empty stomach), my Buddy V takes 20mg also has not eaten for 6 hours and another friend takes 15mg. </p><p>T 0:10 This stuff comes on quickly, I can feel a hint already. </p><p>T 0:20 Now its very noticeable feels like E coming up but 10 fold. </p><p>T 0:40 Very heavy on the body, I feel overwhelmed, more like coming up on shrooms, restless pain in the shoulders area and kinda pressure on the kidneys. Breathing feels hard, but no real trouble, could be just being overwhelmed by the come up.</p><p>T 1:00 OEV very present nothing impressive, not too many colors. Everything is just wavy, trees seem to be jumping in all directions, but Im having trouble focusing on any of them. Pressure on kidneys and pain in shoulders is more present. Mind wise, Im so loaded that I cannot worry about my state, if I have learned anything from tripping, is to let it happen and see where I end up. Im laughing at a lot of things. Laughing seems to be the theme of this drug.</p><p>T 1:10 Im now stable, still coming up a little, but I can breathe and I can focus very much like a combination of E and Shrooms. I feel clearheaded like on E (no euphoria and other properties) just clear, all I say is not being judged by my ego. Feels nice to talk and even nicer to laugh or make jokes. Only side effect: Kidneys... shoulders dont hurt any more. </p><p>T 1:20 Peak about the same like before</p><p>T 1:30 - 4:30 the vibes are the same slowly coming down but stable. Its there the whole time and you cant deny it. Talking is a lot of fun, unlike shrooms. But nothing like E where I feel I have to talk all the time. </p><p>T 4:45 a snap I detect for the first time in the last 4 hours that Ive said something and judged it to make sure Im saying what Im supposed to. I consider this the end of the trip. The visuals are gone, only thing left is the clarity and pain in the kidneys. I go home and fall asleep no problem. </p><p>Next Day: Feel completely normal except for the kidneys a little pain still there. Even 2 days after the pain was there.</p><p>Conclusion: It seems to be very friendly drug. Lots of talking and enjoying it. Lots of laughter. CEV were present but uncomparable with shrooms or even MDA. I would love to take this one more often but the deal with the kidneys scares me and BTW I have been drinking plenty of water. On the scale from 1 to 10 I would give it 7, if it was not for the kidneys it would be a 9. Be careful with dosing this one.</p>"
}
