{
 "title": "Time Trip",
 "author": "Felix Cattus",
 "citation": "   Felix Cattus. \"Time Trip: experience with Catnip, Hops & Cannabis (ID 35375)\". Erowid.org. Jan 25, 2007. erowid.org/exp/35375",
 "substance": "Catnip, Hops & Cannabis",
 "bodyweight": "82 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.25 g",
   "oral",
   "Catnip",
   "(tea)",
   "  T+ 0:30",
   "1 cig.",
   "smoked",
   "Hops",
   "(tar / resin)",
   "  T+ 0:30",
   "1 cig.",
   "smoked",
   "Tobacco",
   "(tar / resin)",
   "  T+ 2:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "35375",
   "Male",
   " ",
   "Not Given",
   "Jan 25, 2007",
   "21372",
   " "
  ]
 ],
 "report": "<p>I had this weird experience on Catnip once. I smoke Mariuhana regularly from since I was seventeen years of age and have developed an experience with different psychedelic drugs over the years, including Psilocybin Mushrooms, Morning Glory, H.B.Woodrose, Calamus, Ephedra, MDMA and all kind of herbs I buy at my local Smartshop. I'm a social drinker, absolutely not regularly but I can get really drunk sometimes. I love Cats, I've got four now and during the time of the experience and previous experience with Catnip by smoking it with Weed and Tobacco, gave me kind of a fluffy feeling, nice and relaxed. I also drank the tea sometimes.</p><p>This particular evening was at a friday in the summer of 2002. I was alone at home as I usualy am when I'm using some mushrooms or other more trip-related substances. MDMA is more of a social drug to me but I 'experiment' on my own mostly, I think it's more honest to the experience itself to be by myself and enjoying the full experience, rather than to have a paranoia experience because people around me don't understand what's happening. And I enjoy it this way, I never have much trouble being alone anyway and I found that as long as I'm alone I really do have the most useful/intense experiences. I only make a Mushroom-trip together with other people if I realy trust them and they are of equal mind-set like me.</p><p>So here I was with a new brand of Catnip wich smelled surprisingly fresh and a kind of lemon-minty, other than I was used to. I was in a chill mood, refreshed from a long shower and made up my usual mushroom-set with dimmed lights and lots of burning candles accompanied by some spacey ambient. I had some of this stuff the week before (the Catnip that is) so I knew it was stronger than usual but that time I was pretty strung out from work and only noticed that it made me very heavy, sleepy and relaxed. </p><p>This time I was much more up to realy explore this. I was expecting something more than usual but this was a complete surprise. So I had boiled some water (I always use 0,5l. as a standard with my experiences) put in it 25gr. of Catnip, let it stand for about 30min. and filtered it in a paper cofee filter. The dark-brown strong tea has a very pleasant lemon-mint-tea taste. I felt the first effects while I was drinking it, a subtle feeling of increasing heaviness and relaxation and after that a very mild visual distortion, vibrating as a Cat's purr in my eyes. This came up in the first 15 to 30min. after drinking the tea.</p><p>I remembered than I had some Hop-resin left and decided to try it with the Catnip. I smeared a thin film of the Golden Honey Fluid on a cigarette paper, rolled it around a Camel with filter, took out the filter and replaced it with a little cardpaper filtertip. When I light it up it had a bitter taste to it, not to bad thou, weird enough a little bit like smoking beer. But it get's worse nearer to the bottom. </p><p>Only after a few hits I felt everything changing. I hadn't done Mushrooms in a while, but I felt this same sensation I sometimes feel when the mushrooms kick in, like something is taking over. My vision became very clear with almost shining colors and gradually everything became to move slowly in a fluid kind of motion.</p><p>By this time my cats dropped in one by one. Of course I gave them some to see if Cats and people could be high together and I could be having a wild immagination at that moment but during the 'trip' I certainly had a stronger feeling of connecting with my animals with mostly body-language, purring and meowing sounds and a strange feeling of just knowing that there was 'something' between us. Very mysterious, very loving. </p><p>After a while, maybe half an hour after the cigarette, I noticed that the effect of the Catnip was still going sronger. Everything became very fluid when I sat on the couch but I was very able to walk around and do stuff. When I sat down the fluidness returned.</p><p>It must be one and a half hour after smoking the Hop-cigarette now and I haven't smoked a joint or pipe from a few hours before taking the Catnip. I decide to roll a nice one and the effect surprises me again. Instead of feeling a Mariuhana-high, the effect of the Catnip and Hop increases a few times and it's like time is starting to slow down, everything inside feels calm, still and loving and music sounds slow and with extremely prolonged tones.</p><p>I'm so in love with my cats without wanting to cuddle them to death. Just seeing the look in there eyes when they look at me is enough. Their defenitely is some kind of Bastet-spirit around and I'm totally in awe. I didn't expect this. And after the next one and a half hour I smoked another joint and the same feelings and effects came on although somewhat less strong. After this the effects gradually wore off slowly to be replaced by a mild relaxing Mariuhana-Catnip high.</p><p>But by then I was wondering how in the hell I was getting there in the first place and I have to admit, after nummerous experiments afterward, also in the same kind of setting, even the same substances didn't give the same as that evening did.</p><p>Concluding: Maybe a once in a lifetime experience. The build up of the 'trip' was very much like with mushrooms but also very different of caracter. Whereas Mushrooms give me a very active and constantly changing mindset (busy with this, thinking about, extremely giggely and so on) this made me very serene and still. the whole trip had a very mysterious glow in it's appearance and like I said there was a very strong time-manipulative edge to it, although it felt also like time didn't matter very much. It very much felt like I really encountered some different type of dimension not to far away from ours with different types of rules about time and the substance of reality. I felt very much at one also with my environment as if my mind was flowing into it and out of it into me again. Very very fuid, serene, mysterious and loving.</p><p>The next day after a not to long but very sound sleep I felt completely revitalized and renewed. And after all this I regret one thing, and that is that I can't seem to create this state of mind again for a second time. But it still inspires me too, just thinking about it. And maybe that was all that Bastet/Catnip wanted me to learn, that I can find a true ally in her.</p>"
}
