{
 "title": "Kids of the Black Hole (book excerpt)",
 "author": "Noah Levine",
 "citation": "   Noah Levine. \"Kids of the Black Hole (book excerpt): experience with Mushrooms & Cannabis (ID 35374)\". Erowid.org. Jul 23, 2004. erowid.org/exp/35374",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1981",
   "ID: 35374",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2004",
   "Views: 4064",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>From pp 10-11 of Dharma Punx: A Memoir</p><p>At some point that year my big sister showed me that our mom had a couple of grocery bags full of some kind of pot that was called 'mushrooms.' My sister said you didn't smoke them you ate them and they made you see cool stuff. She wanted me to steal some for her so that if we got caught I would be to blame. So I did and I kept a few for Toby and me to try the next weekend. It was perfect because we were planning to go see a surf move with Toby's cousin, Jason, that weekend.</p><p>Toby's cousin was a few years older than we were. I guess my sister knew him from school or something. Jason was the first punk rocker I ever met: he had a bleached white flattop spiked straight up and wore big pointy-toed shoes called creepers. But he was also a really good surfer and skater. On the way to the movie Jason played a tape of a band called the Sex Pistols for us. I couldn't believe it; it was like hearing the voice of God. The high energy and fast style of music just made me want to break something, which was how I felt most fo the time anyway. I knew from that moment on that I wanted to be a punk rocker too.</p><p>At the surf movie we ate the mushrooms, one each. They were the most awful, wretched, digusting things that I had ever tasted. I almost barfed all over the place. We got Cokes to wash them down. When the move started we smoked some pot and waited for the mushhooms to work their magic. That's what my sister had called them, magic mushrooms. But all I felt was sick to my stomach and a little stoned from the pot. I couldn't stop thinking about that music. I kept remembering one line, 'there no future, there's no future for me,' and I repeated it over and over in my head. I don't know exactly when the magic hit me but all of the sudden I looked up at the screen and rather than seeing the surfers and waves that I expected, I was shocked to see only a whirling mass of color and trail-like designs that seemed to be melting off the screen and overflowing the Civic Auditorium like and old horror movie I had once seen called The Blob. It was both awesome and overwhelming. I felt so fully alive and at the same time completely removed from my experience. It was like I had become the movie, the  colors, and the movement. </p><p>Toby and I began eating mushrooms almost every weekend for a couple months.   Jason made me a couple of punk rock tapes that I listened to all the time. My big sister and I fought almost daily but I hung around as much as possible to meet her friends and find out about punk and ska bands.  My mom  discovered that several ounces of her mushrooms wer missing; my sister blamed me, and I took the fall. Things at school were bad and getting worse....</p><p>------------------</p>"
}
