{
 "title": "Comedown Cure",
 "author": "AC",
 "citation": "   AC. \"Comedown Cure: experience with MDMA & Valerian (ID 35378)\". Erowid.org. Jul 27, 2004. erowid.org/exp/35378",
 "substance": "MDMA & Valerian",
 "bodyweight": "100 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "oral",
   "MDMA",
   "(powder / crystals)",
   "  T+ 6:00",
   "20 drops",
   "oral",
   "Valerian",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35378",
   "Male",
   " ",
   "Not Given",
   "Jul 27, 2004",
   "22241",
   " "
  ]
 ],
 "report": "<p>I recently attended a dance music festival in England where there was a fully stocked herbalist on site. I decided to buy some Valerian extract specifically for it's sedative effects and at the recommendation of a friend who is studying herbal medicine at university.</p><p>I take stimulants such as MDMA and Methamphetamine fairly regularly when I go out clubbing, I find they give me the lift I need to enjoy enjoy the music to the full and keep my energy levels at maximum. The only problem with this is, what goes up must come down! I've found the intensity and length of my comedowns have increased with the length of time i've been taking these drugs and recently have been on the lookout for something which will allow me to get a proper nights sleep and avoid the more pronounced psychological after-effects of speed + ecstasy.</p><p>After getting home from the festival I decided to try the Valerian as a comedown cure. That weekend I attended one the big local techno clubs here in Edinburgh, Scotland. I took a fairly large single dose of crystal MDMA quite early on in the night, once the club was over and I realised there was going to be no after-party, I decided to head home. On the way home I was starting to feel the MDMA rush wear off and turn into the recogniseable 'comedown head'. When I got home, I fished out a half bottle of tonic wine, drank most of it, and dispensed the Valerian extract into the last mouthful before swallowing it. About 30 minutes later the Valerian kicked in. I felt tired, but relaxed and calm. I retired to bed shortly afterwards and slept like a baby. I had no bad dreams and the next day I felt properly refreshed. It was as if I had never taken the MDMA the night before.</p><p>I would recommend this herb to anyone who takes stimulants on a regular basis. I would also recommend it to anyone who suffers  from mild anxiety or insomnia. It really is a wonder of nature!</p>"
}
