{
 "title": "Walking Through Hell with Gasoline Boots",
 "author": "Duckhouse",
 "citation": "   Duckhouse. \"Walking Through Hell with Gasoline Boots: experience with Crack (ID 35389)\". Erowid.org. Nov 28, 2006. erowid.org/exp/35389",
 "substance": "Crack",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Crack",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35389",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2006",
   "Views: 14482",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBecoming a chronic potsmoker was one of the worst things that have ever happened to me. My grasp on reality has been slipping, inch by inch, for the last few years. At first smoking marijuana endlessly had left my senses dulled and lethargic. From here I graduated to LSD. After my first LSD trip, people noticed a change in me. Just a few months ago, I tried cocaine for the first time.<br>What can really be said about cocaine? Unlike Marijuana, LSD, and mushshrooms, what they told me is the truth. <br>Cocaine will make me confident. It'll give me the confidence of alcohol, with the clarity of caffeine. It'll give me a rush. I'll feel something that's hard to describe just a few minutes after my line. For lack of a better word, lets call it an orgasm.<br>I'd been doing cocaine with a few friends for a couple of months at this point, and I only really just started to like it. I never had to pay for it, so I didn't complain.<br>Then last night, I tried crack.<br>We met a friend of ours in a parking lot, who was fucked up on K. we asked him if he'd get us some yayo from his buddy. so he returns 5 minutes later. He hands me the baggie. My friend takes one look, and shakes his head.<br>'This is crack you fucking idiot'<br>'Wait, you wanted cookies right?'<br>'No. Not cookies. Coke.'<br>'Well sorry man!'<br>Well sorry man. We were now in possession of 200 dollars worth of crack cocaine. Well sorry man! What an asshole.<br>When we got back to the house, we honestly didn't want to do it. We considered crushing it up, cutting it with icing sugar and re-selling it. My friend, who had done it before, looked at me and said '...Forget it. Lets go'<br>We burned a cigarette down all the way, never flicking the ash. We then used the ash to coat the bowl. He took his first hit, and held it in for what seemed like a minute. my heart was racing in anticipation. The look on my friend's face dazzled me. He looked a combination of someone so drunk they're about to puke, and someone who just got a battering ram to the nads.<br>He coated the bowl with ashes again, and loaded up my hit.<br>Surprisingly enough, it tasted good.<br>That feeling I was describing earlier? The 'orgasm?' Multiply it by 100. <br>I took a morphine pill, and drank it down with some beer. I was sure I was going to wake up in the hospital last night.<br>We smoked all of it, and there's none left. on 10-20 minute intervals, a constant never ending high so intense that I'm having trouble forming thoughts still.<br>Its been exactly 11 hours since I tried crack for the first time.<br>Do I want it again? Yeah. Yeah I really do.<br>Will I do it again? Oh god.<br>In the middle of my rush on the first puff I took, I was thinking about all the lives this drug has ruined. And I just looked over at my friend, and said in a whispy voice,<br>'No wonder.'\n\n\n"
}
