{
 "title": "Not the Next E",
 "author": "Passthevicks",
 "citation": "Citation:   Passthevicks. \"Not the Next E: experience with 2C-I & Alcohol (ID 35399)\". Erowid.org. Jun 28, 2005. erowid.org/exp/35399",
 "substance": "2C-I & Alcohol",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 1:15",
   "10 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 2:40",
   "10 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35399",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2005",
   "Views: 4143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me start by saying that I might have been misled by other reports and comments about this PEA. I was expecting 2C-T-7 or 5-MeO-DIPT, altho not literally but in rank. For the first time, I actually took notes during the trip so I can get it out to as many ppl that this pea sucks. \r\nMy history is as follows\r\nMDMA- heavy\r\nLSD- moderate\r\n2C-T-7 - once\r\n5-MeO-DIPT - 4 times\r\nKetamine - heavy\r\n... and other insignificant stuff\r\nIll write down what I have in my notes exactly and then comment on the experience. I started off with 3-5mgs.\r\nT+00:30 - Maybe placebo or anticipation, but clear headedness sets in.\r\nT+00:50 - Feels like didnt take enough, but will wait till the 1:15hr mark from readings. Without realizing, I start resolving very important issues that have been bothering me lately. (Not 100% sure of of the word Introspective, so maybe this is it) Given that my current emotional problems have curbed my perceived intelligence, this head trip feels as of a smart drug, altho Ive not taken any smart drugs ever.\r\nT+00:55 - Four beers by now. Face is getting warm, and feel some sort of energy. I think it important to tell you that my emotional state blocks out alot of the positive efefcts of things like K, and MDMA, so maybe this 2C-I is 'alright' but Im just 'immune'... just like with the rest. I try to forget about these problems that are curbing my day to day apreciation of life and mental clarity and start bouncing to the music for a couple of seconds on the dance channel on digital cable.\r\nT+01:00 - \r\nT+01:10 - First CEV, altho extremely mediocre and short lived.\r\nT+01:12 - No visuals yet but visuals were not was I was in for. Feeling cheery but nothing spectacular. Shit, finding a quarter on the sidewalk would make me happier. Not a drugged up/hallucinogen so far at treshold dose. Thinking about a booster. \r\nI start to distantly feel my spiritual/music loving nature. It had some how been hidden from me for a long time (again, deep mental/emotional problems). Feels like the vocals mimic the effect of the vocals (cheesy trance) right after the peak of an MDMA exp. (again, this is all distant)\r\nTrip has arrived to a 0.5+, and note that im very easily stimulated (normally, not lately - so that might not apply) So its barely a trip up to now.\r\nT+01:15 - Add another 6-10mg for a total of 9-15.\r\nT+02:05 - Its now been 50min since the booster and the increase is significant yet helpless to put a smile on my face. Relaxation (achieved from mental effort) has conevrted to body and spirit one-ness. this is not similar to the MDMA bliss, this is quit mentally taxing. Negative issued seem to have been put on standby. My notes say very indeed psychotherapeutical. Although ym mind is flooded with mental activity and revelations, there is no fun head trip like the giggles I get on shrooms. Note that this is now a common dose of 9-15mg. \r\nI put further effort into relaxing and clearingmy mind and some contentment sets in. Comparing that contentment to the one from T7 would be insulting. If there was a half brother to the word contentment, that would be it.  The ceiling starts making visuals at me similar to the onesI get after 3 or more MDMA beans.\r\nT+02:40 - Add another 6-10mg for a total of 15-25.  I was thinking maybe it was the lower dose of my calculations or that I was unsensitive to this.\r\nT+03:10 - Starting to expect an ok ride, altho that never arrived. Trip comparable to 70-80ug of acid. Im pretty sure the trip will get more noticeable.\r\nCOMMENTS:\r\nI tried 2C-I again days later and got nothing better so...\r\nAt the end of the night, I felt a real dirty industrial high. My skin felt yucky (kind of like a fired up version of the ketamine buzz), I was mentally drained. It felt like my mind could just get so tired to the point of collapsing. If introspection means digging into my day to day thoughts and consciousness, well this does THAT job but was worthless in every other area including euphoria, giggles, and fun visuals. The visuals ended up manifesting themseleves but theyre not the fun kind of visuals like LSD or T7. Its more like really boring visuals and felt liek probably caused from strain to your system. Visuals were not interactive, they were just there. I didn't see paintings come to life or drip, or see the ocean outside the window. Or create a fantasy world like the 5-MeO-DIPT/MDMA combo, no, it was just there and got pretty annoying to the end since they were non-interactive. I consider myself to have very little control with my drug consumption, but 2C-I didnt make me want to keep the party going. No continuance effect like MDMA and cocaine. Neither a quest for a higher high. I was feeling vert bummed out at the last quarter of the experience as my expectations were not nearly met.\r\nKeep in mind everyone is different, and this might even be usless but here it is anyways...\r\nJaw clenching: minor\r\nNausea: 0\r\nbodyBuzz: Crap \r\nHead trip: Neutral in lightness/darkness (I can guess this is why 2C-I is regarded as gentle) Yet this doesnt mean theres no mental activity.\r\nFun/party value: Could be up to a 7 of 10 in a party setting but a 1 at home chillin or with some company.\r\nIm pretty certain that this 2C-B brother lets the family down. Comparing 2C-I to 2C-T-7 or 2C-B is like comparing a Corolla to a Supra. Though this is still pretty tough.\r\nMuch of the trip was just taxing, ie, I did resove issues as it feels like I am a mechanic of reality. I came up with some really interesting solutions to most of my problems and the best part is I didnt forget about them and Ive been applying these new found screws and bolts and my days are more logical now. Its either Im snapping out of this 18month bad trip/delusion or the opposite (which is bad).\r\nsummary:\r\n2C-T-7 blows it away.\r\nSo does MDMA.\r\nLSD has no rival.\r\n5-MeO-DIPT kicks it ass.\r\nNot the next E by a long shot.\r\nNot even a party contender to Ketamine (tho K is not that social, it still makes a better after party supplement)\r\nDont waste your money, 4-ho-mipt sounds way better, so does 2C-E.\n\n\n"
}