{
 "title": "Hands of Power",
 "author": "Sayjo",
 "citation": "   Sayjo. \"Hands of Power: experience with Salvia divinorum (20x extract) (ID 35395)\". Erowid.org. May 23, 2007. erowid.org/exp/35395",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35395",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 23, 2007",
   "Views: 3231",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI tripped on Salvia a total of three times in one night. This was my second time experiencing Salvia and I decided to test it under three different circumstances. For Salvia we use our foot long bong with the butane lighter. The first trip took place in my roommates bedroom where we usually chill. The room had a black light that gave everything an eerie look before I started tripping. The walls had random posters and miscellaneous items on the walls that a mix of people hung up. No one in the apartment had ever tried the 20 Extract so since I bought it I was the designated tester.\r\nI sat on the floor with my back leaning against a two-foot high pile of clothing and a little section of wall. After relaxing my lungs. I brought the bong to my mouth and inhaled. I sat there holding my breath while a semi-circle of friends watched me in anticipation. I exhaled after a sufficient amount of time and waited a few moments to feel it rush through my body. Not satisfied with the amount I received I proceeded to take another hit. As I was hitting the bong I started to feel the effects of the first hit start to gradually increase.\r\nI immediately began to feel as if I was falling. I felt as if hands were on my shoulder pulling me back towards the ground. As I started falling the pile of clothes started looking bigger and higher up. A friend who was on the other side of the clothes started saying things to me as I fell back. I remember getting scared and I started resisting the drug. My friend was on top of a cliff made of clothing yelling out towards me as I was falling to what I thought was going to be the ground and my eventual death. In a panic I remember grabbing onto the clothing cliff and trying to pull myself up. My arms felt like they stretched a little as I pulled myself towards the cliff and pile of clothes and I remembered the Salvia.\r\nI then sat there and looked around at my friends and saw them looking at me. I felt so uncomfortable that I decided the next trip was going to be less weird (I could not describe it sufficient enough so I went with an ambiguous term) by not have people watching me. As I felt all motor skills and control regain I started rambling about stuff that I didnt want to say because I felt it would all be misunderstood. By them reading this they should better understand what they saw and heard from me on my trip. I can more easily organize my thoughts by typing them in this form so I decided this was the best way to go about explaining it. \r\nAfter regaining all my composure and sense of self I decided it was time for the second experiment. For this one, we decided to move into the living room and set up a different atmosphere. The room was made completely dark except a computer monitor that lighted up a circular area around where I was sitting. We decided that we should smoke some good Purple Skunk to relax and hopefully increase the effects of the Salvia. We had music from the Chillout channel playing in the background. A friend of mine was sitting across from me in a computer chair ready to experience the trip from the strange smelling leaves. I sat there and took a rip from the bong greater then the ones I had inhaled in the other room.\r\nAs I sat there feeling the effects take on I noticed something happening across from me behind my friend. As I sat there watching something that didnt exist but somehow felt its existence I saw it. Two giant hands obviously female hands started materializing before me. At first I didnt know what it was because it started at the wrist and moved its way up until both the hands were complete. The hands looked out of focus and had a peach coloring to it. As if they knew when I was ready for more the hands began to reach up towards my friend and grabbed his chair. I immediately became worried that he was going to be pulled down and felt as if I could do nothing. \r\nAs I sat there I realized the hands werent actually pulling him down but just resting on the chair. Immediately my friend and I moved around and I was ready to take some more. I sat near the spot where I saw the hands and my friend decided to sit on the recliner that I was originally leaning against. After he had his fill I took the bong and ripped it harder then I had previously. This time the Salvia took into effect much quicker and I was feeling a tingly sensation all over my body. I felt a little wobbly but could retain all my motor skills enough to refill the bowl and rip another. As I was filling the bowl my arms looked as if they were stretched to about 1.5 to 2 times the normal length. As I watched this while loading the bowl I actually enjoyed seeing my arms in that weird fashion.\r\nWhen the second rip took into effect is when I slipped into a world I had not previously experienced. Immediately I noted the floor, it looked as if it was a giant roll of black cat fireworks and was shifting across to the West. I noticed I was sitting at the edge of it and to my right and down I noticed that this brick of fireworks were on top of another and another and I realized there were endless layers of them. As I watched in awe they started shifting in different direction and speeds. \r\nThe next part of the trip has escaped from my mind and I have a gap in my trip. I am not sure how I should feel about that but I wish that I could know what happened. The next thing I remember is looking up at my friend and seeing him in the recliner doing nothing but sitting there. To his right I noticed my other friend hovering there. That is when I noticed I was inside of something big. I felt 4 inches tall in a giant refrigerator. Out of nowhere between my recliner friend and I the two hands appeared again. I tried to will the hands away but they wouldnt leave. I wanted to be alone but she persisted. I started getting agitated and tried with every ounce of mental energy I had to push her away.\r\nThen it happened, the hands were gone and I felt a weird sense of relief. Thats when I noticed it started to get really cold and realized I couldnt move, I was an ice cube! The hands came back as if to taunt me I thought, and that angered me further. I wasnt sure how to react because of the swirl of emotions going through my head at once. Never before had I felt so many emotions at once. I felt anger towards the hands, happiness at how good I felt as an ice cube, fear of not being able to control my mind, compassion for the others in the fridge with me, and confusion, confusion as to what was happening and why.\r\nAll of a sudden I realized that this was all just a Salvia trip and I was back in the living room. When I looked up to see everything around me I saw my friend still sitting in the recliner in the exact same position as if nothing had happened. Then I noticed the music, I forgot music was playing, the music beat started pulling at everything around me. The recliner and everything I looked at was being pulled and sucked away with the beat of the music. That is when I told my friend who was in control of the music to turn it off. When he did this I was completely pulled out of the trip like I wanted, I had had enough and not sure if I mentally wanted more at the time.\r\nAfter being pulled out of the trip I started to feel weird, I didnt like not hearing the music that I had been hearing the entire trip. I felt something was missing when it was just the feeling the music gave me that I missed. That is when both my friend in the recliner and I decided that the music needed to be turned on. With the music back on I felt at ease and my mind immediately started racing over what had just happened. I couldnt explain it well at the time and my thoughts we jumping all over the place so I decided to write it now, after a night of rest so that my mind could organize my thoughts. After only 15 minutes I had already lost a gap in my trip and couldnt recall what had happened in between those two events.\r\nA little more then an hour went by before my recliner friend and I decided that we were ready to trip again. We had just watched three friends trip in that wait and couldnt resist another go. We went back into the chill room and specified to our friends that we wanted to be alone. This time we turned off the black light and turned on our lamp with a green light bulb in it. It gave the room a nice warm green glow and the ambient light gave me the feeling that the trip would be completely different, I was more right then I could have imagined. My friend sat on the couch under a sleeping bag and hit the bong. I then proceeded to take it from him and sat two feet away on the floor waiting. When I was assured he had enough and was into a trip I took my rip and waited.\r\nI went from sitting on the floor to lie down and look around. I began to feel a pulling sensation and I looked towards the direction of the pull. I looked in the direction of my feet because that is where the pull came from and noticed that the bathroom door was open. I felt as if there was some sort of vortex that was trying to pull me in and I panicked. I started grabbing onto the bed and floor as it was pulling me towards the bathroom. I was then pulled across the bedroom floor and was half in the bathroom and half out as I was grabbing on the pile of clothes that I sat by in the earlier trip. It was the most frightened I had ever been in my life and I was holding on with all my strength.  That is when the door busted open and one of my roommates came in yelling about how loud we were being. This was a huge rush as I was pulled out of my trip and it made the rest of the night feel very unpleasant, I guess this is why they suggest a sitter. ^_^\r\nSalvia is by far one of the most interesting drugs I have ever taken in my life. I am about to go on a camping trip so I am going to have to conclude this now. I am about to go on a Salvia adventure in the forest. Write about it when I get back so youll know how that goes. Have a good day and safe experimenting, \r\nJa ne  -Sayjo\n\n\n"
}
