{
 "title": "Tastes Sweet and Satisfying",
 "author": "gonzoalaska",
 "citation": " gonzoalaska. \"Tastes Sweet and Satisfying: experience with Blue Lotus (15x extract) (ID 35429)\". Erowid.org. Mar 13, 2007. erowid.org/exp/35429",
 "substance": "Blue Lotus (15x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35429",
   "Male",
   "",
   "Not Given",
   "Mar 13, 2007",
   "11277",
   " "
  ]
 ],
 "report": "<p>I recently purchased some Blue Lotus 15x extract from an online supplier  in search of a pain-therapy alternative to marijuana. </p><p>My package arrived on time via USPS parcel, and I hurried home and into my room for a look. First off, this stuff looks better than any other 'legal' opiates I have bought online such as the Mexican Prickly Poppy which turned out to be bunk as hell. </p><p>Secondly, just the smell and the green oil associated with this black hard gunk made me start to think, 'Hey, I might just have something here.' And lastly, the taste is something like a blast from the past like we have all smoked this stuff before (maybe its just my own reality created through the deja vu I get daily around my present group of friends). </p><p>The smell and taste is sweet like a Blue flower would be expected to be. Very attractive. However, to achieve full potential of this flower (which I have only smoked it) is difficult because my pipe eventually gets to hot to smoke out of. And when it comes to me and entheogens I always prefer smoking them first instead of oral dosing because of the time duration being much shorter usually via smoking. </p><p>So I have still not drank it, but I will eventually. I am out right now and waiting for the next order. </p><p>However, smoking is very mild and pleasant. I cant say it would ever replace pot because of marijuanas psychological addictive qualities, but it makes me not miss real morphine as much. A lot funner than crushing pills and putting them up my nose anyways. </p><p>I like to smoke about 1/4 of a gram at a sitting to myself. It is fun also sharing with friends, but again, my smoking utensil usually gets too hot to fast. After a while, it can get slightly difficult to even relight my lighter, or hold the pipe up.  </p><p>The effects are quite subtle, mellow and numbing. And absolutely no side effects except sleep of course. I recently had found myself in a phase of insomnia in my life and this was truly a cure-all, or at least I would sleep four to six hours instead of not at all. </p><p>So medicinally, on a scale of 1 to 10 for the price and ease of use via smoking, I would give it an 8. I am sure if I got the balls to finally drink some mixed with water or alcohol I would rate it a 10. </p><p>Hell, I even mix it with pot to find a nice synergy there. Not bad, not bad.</p>"
}
