{
 "title": "Ultimate Relaxation",
 "author": "Flipper",
 "citation": "   Flipper. \"Ultimate Relaxation: experience with Cannabis - Hash (ID 35430)\". Erowid.org. Jan 16, 2007. erowid.org/exp/35430",
 "substance": "Cannabis - Hash",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cannabis - Hash",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35430",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 16, 2007",
   "Views: 7255",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Self employed and very busy my work ranges from being very intense and stressful to being very challenging and rewarding. I usually go through phases of being stressed whereby everything seems to just mound up on my shoulders - i decided upon coming home from work i'd take some hash to 'reset' myself.  On my way home i stopped at the store and purchased some natural yogurt, i arrived home and took out my stash, putting some olive oil into a large spoon i dropped a marble sized amount of hash into the oil on the spoon - using a candle i melted it all up and stirred the cooled mixture into the yogurt. I knocked it all back by washing it back with some water and waited for the effects to kick :)</p><p>Where I live there's a wood nearby so i decided to take a trip there and walk around by myself until the effects started to take hold. I brought some headphones with me.. About T+0.40 i started to feel the first effects, feeling very deep and relaxed i danced through the wood until finally finding a nice place to sit down and enjoy nature.  Staring at the trees the forrest floor seemed to liquify into what was waves of the ocean. I headed back to my house at T+1.00 and could now feel the effects coming on quite strongly.. I got a huge bag a potatoe chips and headed back ot the forrest and ate them *ALL* at this stage the music in my headphones was beginning to sound incredibly 3d, it was the most amazingly sounding music i have ever put my ears to. Everything seemed to merge into a perfect synergy, i felt completely relaxed and unthreatened by anything or anyone, i felt at one with nature. It was a wonderful feeling.</p><p>It began to get dark so i decided to follow an animal trial back to my house as opposed to the normal path. I pranced and jumped through the forrest until reaching my house. I decided to take my laptop and sit on my bed as to avoid any contact with my family members who would not be happy to find out i was spaced to the nines! The effects came on stronger and stronger - i could feel waves from the music i was listening, different music gave off different waves of energy and i could feel it actually effect me in a conscious level.. something i truely believe effects us without us knowing. I think the pot allowed me to really feel what i was feeling at an unconscious level. i switched the music on my headphones to leftfield.. what a fantastic choice of music to listen to whilst stoned! I became extremely high at this point and some intruments in the music began to startle me.. noises coming into the tune i thought were buzzing in my head! this was not an unpleasent feeling but rather wonderful! </p><p>I also went through a stage of giggles at approx T+3.00, i spent almost 1 hour laughing solid at the simplist things - it was great. I could not wipe the smile from my face.</p><p>I became very sleepy at approx T+5.00 and found i could stay awake whilst on the very verge of falling asleep. When i yawned it could make the yawns last which what seemed to be 5 minutes at a go and each yawn felt absolutely wonderful. I began flipping between what seemed a TV/OBE view of myself. It was like jumping out of my body - a wonderful experience.</p><p>I woke the next day feeling completely refreshed and on my way to work was extremely happy to be alive and appreciated things i would not normally notice or care about.</p><p>All in all a wonderfully relaxing experience.</p>"
}
