{
 "title": "Park Overhangs and Dog Hair",
 "author": "SistersWithSalvia",
 "citation": "   SistersWithSalvia. \"Park Overhangs and Dog Hair: experience with Salvia divinorum (6x extract) (ID 35443)\". Erowid.org. Aug 1, 2005. erowid.org/exp/35443",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "2 bowls",
   "smoked",
   "Damiana",
   "(dried)",
   " ",
   "3 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35443",
   "Female",
   " ",
   "Not Given",
   "Aug 1, 2005",
   "Views: 3317",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had an interesting experience with Salvia D a few nights ago and want to share it.</p><p>I went out with two friends for the night. We ended up drinking about a pitcher each of beer. Somehow, we started talking on the subject of Damiana. Thus, we all ended up back at my house to experiment with smoking the damiana.</p><p>Everyone loved the damiana! I smoked about 2 bowls of damiana and could feel a definite 'high' feeling. I had been pretty drained earlier in the day, but now I had lots of energy. I felt tingly all over as if I itched for more damiana or something to keep the feeling going. That's when I decided to smoke some salvia 6x.</p><p>First, I told the other two that I would be outside on the back porch smoking Salvia D. In case I tripped or did anything weird, I wanted them to know what I was doing. They stayed inside as I sat ouside the back door with it opened. It was about 11 pm and it was raining. This is strange weather for the middle of summer. So, I positioned myself to be able to stare out into the dark rain while I was smoking. I felt vary safe and knew I had two sitters inside in case I went wacko. Luckily, damiana didn't seem to make them too out of it to watch me.</p><p>After 2 bowls, I was a little annoyed because normally I only need one for a decent small salvia trip. But, the third one knocked me into salvialand finally! I was whooshed forward at the speed of light into the darkness of the rain. I then landed in a childhood park during a birthday party. I was without my body, and only observing. The party was under an overhang with a cement base. This was in the middle of the park that has benches and barbeques underneath it. Suddenly, the overhang took off and was flying through space with everyone on board as if they were on a ship. I remember laughing as I thought it was so funny at the time. People were sitting down and positioning themselves on the benches as it flew. I also heard a distinct sound everytime it moved to another place like a loud electrical pop. It mostly was moving back and forth through the darkness. It was like the dragon swing ride had come unhinged and was traveling on it's own! The overhang finally landed on the back of a dog and I could see that this overhang and all the people on it actually made up this one set of white hairs on the dog's back. Everytime the dog moved or scratched this set of hairs, the people in the overhang were sailing around to another place. I was amazed at the simplicity of seeing that everything in the world is interconnected. Childhood places, travel, darkness, light, and my dog's hair. It was enlightening and hysterically funny at the same time.</p><p>When I came to, I was rolling around on the patio laughing. I had lost the pipe back where I had been sitting and spilt the leftover ashes. My jack russell was over in the corner of the patio staring at me. I couldn't stop laughing. It was her back that I saw with the white hair. The thought of those people riding on her back was sending me into hysterics laughing at the thought of it. Of course, this prompted me to run into the house and tell the other two that they should try it and how fun it was. I couldn't hardly talk I was still so high. However, they came outside to try it.</p><p>Neither knew much about salvia, but I wasn't thinking straight and gave them it anyway. I was still laughing uncontrollably and kept thinking how funny it would be to watch them trip. It was really mean of me and not how I am normally! The first person took about 4 bowls and nothing happened. His only comment was that the rain seemed to slow down and he couldn't stop laughing. I was taking the leftover smoke from him when he finished each time. These small hits seemed to fuel my laughing because I never stopped.</p><p>The other person took one hit from the pipe and went to walk inside. He was about 2 steps in the door and said, 'This shit works!' and then he walked about two more steps and said he had to pee. Well, he didn't move from his spot. He turned around and stared at us. We busted up laughing at him, but he looked as frightened as hell. He said he couldn't get back through the doorway to us that there were lines going through the doorway he couldn't cross. On his side the lines were all messed up as if he was in another world and we were outside in the normal world. When he finally stepped through the door, it was like he was walking through a big spider web. Once he came down, he said he would never smoke salvia again. Even today, he won't talk much about the experience. I feel kind of bad that it scared him, but I have a feeling that he saw more and isn't telling us about it.</p><p>To date, I have had a few side affects from our experience. First, my dreams every night since have been 100 times greater in vividness. I can remember just about every detail. Also, I can see auras around everyday items. I used to only be able to do that with meditation, now they are just there without trying to find them. This can be a distraction as well as neat sometimes. Lastly, I have this relaxed sense that there is no place for stress in my life. I seem to have decided to let things get to me so much. I just feel much more at ease with everything. Everytime I look at my dog, I think of the fact that I am somehow connected to everything in the universe, and this makes me really happy!</p>"
}
