{
 "title": "What's in the Mystery Pill?",
 "author": "DAKS",
 "citation": "   DAKS. \"What's in the Mystery Pill?: experience with Unknown (sold as Ecstasy) (ID 3544)\". Erowid.org. Feb 17, 2001. erowid.org/exp/3544",
 "substance": "Unknown (sold as Ecstasy)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3544",
   "Male",
   " ",
   "Not Given",
   "Feb 17, 2001",
   "9086",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFriday night I went to a rave and bought X for my girlfriend and I.  It was going under the supposedly reputable brandname (like that means anything) 'yellow C.K.' and I trusted my source.  However I didn't exactly get what I bargained for.</p><p>My girlfriend, M____, and I dropped before 1 AM and went out onto the floor.  She bit her tablet in half while I took all of mine.  After over an hour neither of us were affected so she finished hers off.  By 2:30 AM a friend of mine, G____, found me and asked how my high was.  Nothing typical of a X high was happening.  I had plenty of energy, dancing was rad, but nothing had hit me with the usual 'ton-o-bricks.'  There was no tactile effects, and little euphoria.  He bought the same and was unimpressed with the results.  He wandered off to start digging around to see if anyone had tested it, or knew anything about 'yellow C.K.' while I went to the Chill room to find M____.  </p><p>   When I found her we sat down on a mattress and started talking, and talking, and talking...  By nearly 4 AM we started feeling a worthwhile X high, but it felt like we skipped the peak and went to the plataeu.  I was also INCREDIBLY fidgety...  I have never felt such a need to play with something.  Not on anything.</p><p>   I also felt more talkative than ever in my lifetime.  I debated/talked about a myriad different things (worthwhile or not) with everyone who came by, my level of understanding was huge.  I tried dancing for a while and had a seemingly endless energy supply.  But I wanted to talk too much.  I spent the rest of the night in nearly the same place talking to whomever wandered by.  </p><p>   M___ and I left the party and were back at my place by 8 AM.  When we stopped the car I started talking again, in the driveway, for another hour and a half...  Common sense more than anything told us we SHOULD be tired so went went to bed.  In bed we talked...  And talked...  By this point we were obviously suspicious that there was a little (a lot?) more in our X than MDMA or MDA.</p><p>   As interesting as my high was, the comedown was shit, just utter shit.  Not like after a night on X.  My pupils were dilated, sometimes painfully, until I woke up Sunday morning (I dropped on Fri.)  I didn't even sleep until 5AM Saturday night, even then I had to force myself.  I spent all Saturday in bed, dizzy, sick, headache, everything.  I knew I was hungry and thirsty, but I couldn't hold anything down.  I tried to sleep it off but my eyelids refused to stay shut.  M___ felt the same, so did everyone I've talked to since who tried the same stuff.</p><p>   I heard from G___ that 'yellow C.K.' was supposedly stuffed full of meth...  Could be, it makes sense, but I'd never been on meth before (didn't plan on it either).  Nothing like the reliability that comes with buying Ecstacy huh?</p>"
}
