{
 "title": "Crackling with Energy",
 "author": "free spirit",
 "citation": "   free spirit. \"Crackling with Energy: experience with 2C-I (ID 35454)\". Erowid.org. Apr 21, 2005. erowid.org/exp/35454",
 "substance": "2C-I",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "35 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 5:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 8:00",
   "  ",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35454",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 21, 2005",
   "Views: 6097",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ended up being a very odd and wonderful ride.</p><p>8:00 I dosed the 2C-I... Im told it was between 30-40 mgs. (yes I know thats a big difference but he and I both lack super accurate scales) took it on my tongue and a sip of water... Wasnt too bad tasting at all because there is so little of it to take. (which is a plus in my book).... It should be noted that I had eaten dinner at 5:45. Had not had any alcohol in a week or so, and was fairly stoned.</p><p>8:15- start feeling the jitters... Tingly and going all throughout my body. Like through all my nerve endings... Sorta pulsingly. I found this odd because my last and only 2C-I experience had been on between 15-20 mgs and I had been sorta drunk before taking, and I really hadn't felt any of this energy and tingles this quickly at all. I started to get excited! It seemed like this was going to be quite the ride.</p><p>8:30- Oh Im definitely feeling it at this point... Full energy is pulsing through me. At a vibrational rate... And constant... Going down each nerve from base to tip it felt. Im also starting to get some odd CEV's at this point... Mostly spiralish designs. Helixish in nature... Perhaps maybe they were dna strands. The previous 2C-I trip I had not had hardly any visuals at all. And then only at the tail end of the trip. </p><p>I get up and walk around... And go into the room gmg is in and tell her how great I feel. That I have all this energy inside me... She just smiles and asks if Im ok with it. And I smile and say yah... At this point Im feeling sort of like I took a speedy roll (mdma) and its pretty damned good! </p><p>8:45- Time has started to slow down considerably... The past 15 minutes seemed more like an hour... My perception is noting much more at a much quicker duration. Im feeling EXTREMELY GOOD... But not as much like mdma... Sure my external body felt good being manipulated. (rubbing my neck and arms and legs and feet and etc...) But it was how it felt inside my skin in the muscles acting by itself was what felt the best! It was very reminiscent of riding the crest of an amped up lsd trip...except with more energy. And feeling like I might just burst... Like if it keeps up too much... I might just not be able to handle it...</p><p>I immediately realize the bad thought loop trying to rudely interupt my good times... </p><p>I decide that I KNOW that I can handle a whole helluva lot. And typically am smiling ear to ear by the time Im done... Its only when I freak out and worry about not being able to handle it that trauma and drama ever ensue. I smile and tell myself that I will ride this one out. That it will be fun and that I will learn from it! (that loop stopped right there)</p><p>Before I had done 2C-I the first time, I had asked voodoo what he thought of it. And he described it as gentle. My first trip I totally agreed. It was very enjoyable and controllable and just gentle... </p><p>This trip was not very gentle. It was like taking off strapped into a high powered firework. And having it about to blow up inside me... But feeling all the power and energy just crackling inside was a rush! I started to REALLY enjoy it... And couldnt believe how hard I was tripping out at just 45 mins since taking. I knew this would be a great trip! My grin started to get wider......</p><p>Visuals at this point are starting to take affect w/ open eyes to a lesser degree... The contrast of shadows and lines was much more in detail. My focus was both clearer in the center of my view and somewhat cloudy in the peripheral view. Objects that had lots of lines to them seems to swell and stretch a bit... Wallls breathed a lil bit. Very reminiscent of acid... Objects that were layered seem to move around on their own a little bit... Peoples eyes looked a bit off... Something about pupil to whiteness ratio... Im not sure... CEV's at this point are fantastic... Multicolored hues of the strands are still forming ever more and more complex helixs... Sometimes I see what appear to be nebulas and stars in some strange cosmos... Lots of crazy ass mandalas. Fractal and geometric designs. It was really cool...</p><p>9:30- WOW This is a great drug! I cant believe I still havent peaked yet!... This is something else... I am watching a movie... And think I hear rain. But the movies volume is up. And suprisingly... It is raining... I had heard correctly. I decide to go outside to make sure our windows were rolled up and to cover up the grill.... It felt pretty cool outside... All thes drops sending rippling energy vibrations all over my exposed skin... It enjoyed just standing there... But didnt want to get too soaked so I only stayed out there for a afew minutes... But it was beautiful. The sky was dark and hte moon was barely out... But I could see perfectly well. Everything seemed awash with the life that the water was bringing to us all.</p><p>I go back inside and go listen to some music and watch milkdrop... Put some good trance on (pvd live at radio sunshine) and sorta tripped out for a bit... Was fun. My visuals hadnt really progressed too much... At least oevs... Mostly distortion based... But seemed controllable... My cevs were still wonderful... Full of color. And sometimes whole scenes would come on... With like stages sometimes. And othertimes more galaxies. And interactions of all sorts of different lifeforms... Or entities. I dont know. They didnt talk to me... Or threaten me. Or appear to interact with me at all. But each other. And they would make lines making complex designs... Its hard to describe...</p><p>My energy level at this point is through the roof... But Im sitting down... Its all in my mind ... But my body is feeling crazy! A shimmer of doubt came and left as I just smiled and really started to think I had caught a great wave and that the ride was gonna be one to remember.</p><p>10:00- well I remember the last time I did some 2C-I... Sex was fantastic.... So I started thinking about it.... Only thing is. I had a LOT more mindfuck going on this time as compared to last. And didnt know if I would be able to concentrate enough... But eventually decide it would be fun and talk my mate into it... Skip the details. But I had my eyes closed the whole time. And seeing all these cevs that kept evolving and morphing made it pretty incredible... Almost like making love to a swirling cosmos writhing this way and that... With huge circles full of fractal based designs started wrapping around teh cosmos and it kept moving and as it moved the fractals morphed with it... </p><p>It was intense! I started seeing all sorts of hues of color change as the base for all the interactoins... Starting with dark woody colors and getting lighter and with more flare... Ending with this brilliant white light with all the other designs that were still going on contrasting in a green so dark it was almost black...</p><p>10:30- man that was great!! Even if a bit quick! It took almost all the focus I could gather just to participate!! Im feeeling WONDERFUL!! Im now fully charged and crackling with energy! I feel it go from my feet up to my head like a tesla coil over and over again! I decide a shower is in order! Left all the lights off and the door open for a bit of light.... Shower felt good! Not as good as the last time tho... (last 2C-I experience. Which was alot more like mdma) </p><p>Sat there for a good 10 minutes with a goofball smile on my face staring at the light fixture... Thinking how wonderful a job it was doing... Even technically it was taking a break (I had it off) and how I was grateful for it for being slack at the right time... And how this was backwards as I would feel in other situations... But fit just perfect here....</p><p>Go to 1:00- ok... Well Im much more into an introspective mindset... Im really thinking about things and meanings and reasonings and motivations and priorities and good and bad and yin and yang and all sortsa odd stuff.... Sorta off into my own world for a little bit... And I start to get a bit sad as I reflect on how my current perception of the people of the area I live in. And people in the world in general and how my faith in basic goodness dimishes each day...</p><p>So. I hop onto mirc! Good place to get cheered up.... I pack up the bowl... Get a couple hits in me. And enter the chatroom... Got some cool friends in there tonight... One who I was hoping to see, john! As I knew he had taken some mesc earlier. Sandra was in there was well and she had taken some mesc earlier as well... Talked with inquiring about life for some time. As well as mindy. Ralf too@! And clint and bee popped in at the end of the night! Lots of good friends to sit back and trip out with and just share great conversation and times with. I was smiling the majority of the evening... Kept packing the bowl... And really lost track of time. I love chatting with some of these people... Its just good fun. And its always fun to trip with other trippers. Even if just thru a computer monitor... I had a real blast!</p><p>But as 4 am rolled by... I decided. I wasnt going to sleep without anything to help me out... So I took the last of the xanax I had.....</p><p>45 mins I get off chat... Starting to feel a bit sluggish...</p><p>By 5:15 I am in la la land right up until 2:00 pm!</p><p>I had a GREAT time. Very good . Very intense . Very love filled trip...</p><p>I think this drug has a great potential for exploration in the future. Anyways. That was the trip.... Not too much out there about 2C-I... Never done 2C-B but this was something else man.... Very very good stuff!</p>"
}
