{
 "title": "Beautifully Intense",
 "author": "excellent",
 "citation": "   excellent. \"Beautifully Intense: experience with IAP (ID 35499)\". Erowid.org. Oct 29, 2004. erowid.org/exp/35499",
 "substance": "IAP",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "IAP",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35499",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 29, 2004",
   "Views: 14158",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Many of the reports I have seen here have confused me.  What I felt on IAP was very similar to what people here wrote, but I found the experience to be much more psychadelic than anybody mentioned.  </p><p>It was midnight and I had accquired two hits of IAP from a friend who ordered from an online research chemical website.  He had already tried the IAP and told me that it was 'fucked up' to be precise; which coming from him, I knew it must be pretty good.  So we took it and walked to a park to hang around and smoke weed in. We were smoking weed by the swings and I started to feel very speedy, almost like caffeine but not as strong, this was twenty minutes after taking it.  We started to walk back to my friends house where a small gathering was occuring.</p><p>Once we got there things started to get strange. I sat on the couch observing the people. My best friend happened was sitting next to me and I looked at him, and he gave me this look out of the corner of his eye which could silence the wail of any coyote. Although things were pretty upbeat at this party, things in my mind immediately turned serious and very ominous. I needed to get to the other room so I did. Downstairs my friend was playing the guitar which sounded brilliant. I started to play it and wrote a song which I still play to this day. When I played it I saw vibrant golden rays shooting from the guitar and luminating the ceiling. It was brilliant. My friend then suggested that we have a fight to see what it would feel like. So we had a fight, it hurt but the pain felt good after a while. </p><p>My friend who did the IAP with me was feeling the same way I was so we decided to take a walk to the street and be away from the people not under the influence.  We walked down the street and into grass. While walking on the grass I felt like god. I felt powerful. It felt good. Speedy and colorful. Colors were changing, trees were bending. Almost kaleidiscope-like vision. I would say that compared to entheogenic mushrooms, IAP produces stronger visuals and a more constant euphoria, as opposed to the seldom mushroom visuals and fluctuating emotions.  </p><p>IAP is worth the price.  55 dollars for 10 hits is what it was where we got it from.</p>"
}
