{
 "title": "Angelic Women and Black Holes",
 "author": "Spiro of the pent",
 "citation": " Spiro of the pent. \"Angelic Women and Black Holes: experience with Salvia divinorum (ID 35508)\". Erowid.org. Jan 14, 2007. erowid.org/exp/35508",
 "substance": "Salvia divinorum",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35508",
   "Male",
   "",
   "Not Given",
   "Jan 14, 2007",
   "3646",
   " "
  ]
 ],
 "report": "<p>I hit the pipe hard, taking as much as I can until I start to 'weed cough'. I hold it for 20 seconds, and then hit it again just as hard. Starting to feel 'something', a mild tingling feeling. I set the pipe and lighter down, put my head back and close my eyes. The tingling feeling lasts 15 seconds then, nothing. I open my eyes and look around. Nothing, nothing happened. I relay my experience to my friend sitting across from me on the couch. He is my 'sitter' for the evening, and he will also be taking a written record of my experience.</p><p>Disappointed with my results with the 5x, I pull the 20x from my pocket. I fill the bowl plump full. I take a monster toke. I hold this one for maybe 10 seconds, exhale, and then I suck-down another. Again, I set the pipe and lighter down, put my head back and close my eyes. Something is definitely happening. The familiar tingling sensation is back, but more intense. I start to get the feeling that I am falling backward into complete darkness. After a few seconds, BAMB! What I can only describe as the 'warp-speed' effect. Like that scene in Star Wars where the Millennium Falcon makes the jump to light speed. </p><p>** Commentary ** -- At this point in my experience, I am aware that I exist, but I don't understand my relationship between where I am at that given point in time, and where I am in the physical world. In other words, I am completely unaware that I am actually sitting in a chair at a friend's house, and not traveling at the speed of light.</p><p>Moments later, my 'warp-speed' travel comes to an instantaneous stop. Now I find my self as a child standing in the middle of the kitchen in the house I grew up in. I look up, and I immediately recognize my mother with my sister standing next to her. While I am a child in this vision, both my mother and sister appear to be the same age as they are in the real world. </p><p>My mother and sister tower over me as I look at them. They both have a goldish/white light emitting from them. The background is a brilliantly bright and warm white light, yet comfortable to the eyes. I stand in awe at the site of these two giant angelic women. They smile down at me. I get the feeling there are others looking down at me. I can't see there faces, but I know they are there.</p><p>I look behind me and notice the kitchen floor is starting to swirl, morphing into what looks like a black hole. Suddenly my legs begin to melt into the floor. I am stuck, and I am being drawn into the black hole. I franticly try to break free of the floor, but it's useless. I am both melting and being drawn into a black hole. Now I feel very frightened. I look at my mother and sister, and they are both still there smiling down at me. I reach for them with my arms begging for help, but they do nothing. My cries for help quickly turn to screams of fear, as the black hole engulfs my body. I look up at them again. My mother and sister now appear sad, and they are waving goodbye to me. I get the feeling that they want to help me, but they can't. I am completely terrified... am I going to hell?</p><p>Eyes open, I see light. I can barely move. Where am I? What happened? I can't talk. I am dreaming? I think I am dreaming. No wait, something happened. I know him, he's my friend. I can kind of move my arms now. I am starting to speak. I did something, I smoked some Salvia. Ooooo my god.</p><p>After 15-20 of utter confusion I put all the peaces back together. Everything was becoming clear again. WOW!!! That was a fucking wacky experience. I sit there for a few minutes just going over what happened in my head, and then started to recall my experience with my friend.</p><p>My thoughts were heavy with that experience for the rest of that night. Weeks later, and I still think about it several times a day. Something's not quite right; I don't quite know how to explain it. My experience or vision has left me with a dreadful feeling that I have done something terribly wrong and I need to fix it.  I guess my journey has just begun...</p>"
}
