{
 "title": "Methanpheta Cream Pie",
 "author": "Julianne",
 "citation": "Citation:   Julianne. \"Methanpheta Cream Pie: experience with Methamphetamine (ID 35518)\". Erowid.org. Jan 14, 2007. erowid.org/exp/35518",
 "substance": "Methamphetamine",
 "bodyweight": "118 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35518",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 14, 2007",
   "Views: 41175",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm giving you a piece of my life.  I'm giving you an opportunity to decide for yourself what you want your life to become.  I write what I know and know that what I write is me.  I am 18 years old and, like most of my peers, I saw college as the freedom to party.\r\nAs long as there was something to drink, then there was something to drink about.  Hangovers in class the next day didn't go over so well, and my beautiful MaryJane would have me wandering around campus not able to remember which class I had scheduled in the first place.  Coke was around when the right people were around.  The short-term effects had me disappointed and fiending, though, so I gave up on getting messed up.  Then I got frostbite in September by Mr. Ice.  \r\nI was taking 19 hours at the time, so all the benefits got me through mid-terms great.  A quarter of a gram (25 dollars worth) would get me through two nights of studying, two nights of partying, and two nights of no sleep easily.  I was very pleased to see I was losing weight I didn't have in the first place.  For some reason, it seemed to me that everything that came out of my mouth was the most profound statement in the history of mankind.  I never realized that maybe I was running from something - something inside that your body hides deep within itself so you don't have to look.  \r\nI began to feel the weight of addiction heavy in my lungs when I started dating my dealer and dropped a half gram a day by myself.  I had forgotten or just stopped caring about everyone, everything, every place, every memory I had ever had and just kept hitting that pipe.  I knew I had a problem when a guy knocked the pipe to the floor, and I had already started crying before it shattered.  I began to get used to speedboats, (tinfoil folded in half - shiny side down! - and lit from the underside), and could feel my brain baking twice as much.  I then began eating the stuff.  I would hit almost a gram in one capsule and be up for days without any refills.  My insides burned all the time and I thought I was getting a hole in my Liver.  This was always my favorite way to get spun though.  I was able to concentrate on one thing and work on it for hours on end.  I'm naturally hyper, so Ice relaxes me.  I was never big on cleaning the whole apartment in 10 minutes.  \r\nI began to hallucinate all the time, and at one point I lost sight of reality.  I would wake up to the images of the nightmare I just had dancing on my ceiling.  For a week, (and this is no joke) I would have sworn that Bin Laden was hiding in my closet - I kept seeing a white turban which was really a white sweater.  I began making myself do something - anything - while high, (which was either when I was alone or with other people).  So I found my beloved journal under my dorm bed.  I figured it would at least keep me from giving myself a mental disorder.\r\nIt was amazing to think of the girl I used to be in those beginning pages.  I almost felt nervous, like I was sneaking a look at somebody else's secrets and dreams.  The ink turned from my usual loopy cursive to skinny lines, (vertical and horizontal) of smashed words flying all over the page.  I had lost my gift.  I had forgotten about all the passion I had for the world.  Everything that forced my hand to write page after page about freedom, beauty, truth and life.  I could only write about drugs.  Once I spent 13 hours sitting in my car at the park doing nothing but writing.  Ice made me focused, efficient, horny, mean, anxious, euphoric, anorexic, guilty, and so very shameful.\r\nShortly after, I found myself in a rehab outside Lubbock, TX.  I never knew how sickening sober could feel.  A month later I thought I could start my new life, since Ice had ruined the old one.  The thought of snorting a bump, smoking a bohl, or sucking alumminum through a straw disgusted me - or so I thought.\r\nBoys and Girls, hear me now: if you want drugs you will have to give your right arm to find them, and if you are trying to stay away from them - they will find you - EVERYTIME!  I hit my rock bottom harder this time.  I began to get mad at God for my being born an addict.  I stopped praying, I stopped listening, and inevitably - I stopped caring.  \r\nI lost my apartment, my boyfriend, my car, and my respect in less than a month.  I had no money for Ice so I started dancing at a local strip bar where I knew my drug house would be the dressing room - I was right.\r\nLooking again like a Holocaust victim, I stared at myself in the mirror for 15 minutes trying with everything I had to see something I liked.  When that didn't work I did what any decent young girl would do.  I went on another binge.  I was a shell, an empty shell filled with smoke.  I tried to kill myself.\r\nI woke up in a mental hospital.  That very moment I opened my eyes I found a peace that was given to me from above, serenity from within, and some words I had forgotten months ago.  There was a homeless man that always went to the same Alcoholics Annonymous meeting I did, and one day I told him that I hoped the worst was over.  He said to me that you hit rock bottom when you stop digging.  I threw down my shovel immediately.\r\nSwinging my feet out of the bed, (and noticing the stitches on my wrist), I took what felt like the first step.  Somehow, the tiny bit of dignity I had left had fought every dark corner of my soul and body while I slept - I guess it won. \r\nI breathed a new breath, and I said a new prayer.  It said:  God, may my burdens always be too great to carry so I may be driven back to you for strength.  That's all it took for me - a second chance to wake up.  \r\nOh, and that 13-hour writing session in the park?  I was able to decipher one poem I wrote.  It's about Meth, it's about me, it's about truth.   - Julianne - 7-29-2004\r\nMethanpheta Cream Pie\r\nThe making of your soul - \r\n  i see the image of God \r\n    racing to reach my faltering heart \r\nWill you have the battered shreds \r\n  of my corroded love? \r\n    Or will it rust the gleam from the \r\n      polished grace you swept \r\n        beneath my heart \r\nWill you ripen the bruises i cannot cut \r\n  and piece whole my curse of glass? \r\nMy mind became an icy embrace \r\n  smoldering with \r\n    the seduction of betrayal \r\nYou made the light that ate \r\n  the shards of shadow \r\n    from the spark of your words \r\n      and the glow of your touch \r\n        that burns deeper than \r\n          desire dare reach \r\nThe thoughts pierce serrated claws \r\n  into my throat to slice the voice \r\n    that fingers your name with \r\n      broken nails pointing to wrists \r\n        gushing crystal waves of \r\n          crimson treason desperate \r\n            to divorce the mind \r\n              of free thought \r\ni pine, i press, i gasp for the breath \r\n  of my bitter beauty that crackles \r\n    over the infected flesh of my \r\n      lungs who whore over every \r\n        frozen street to lick \r\n          the frost between the blocks \r\n            of jagged pavement \r\ni collapse to the blindingly \r\n  impure rock of angel-white sin \r\n    to feed my frigid soul with the \r\n      combustion of shady snowflakes \r\n        torched on crinkled silver \r\n          over a flaccid flame of \r\n            fractured frustration \r\nThis whore bears not my name \r\nLike a pathetic squatter in an \r\n  unwanted home, she sucks the barren \r\n    the moisture of my mind \r\n      then brings forth a torturous \r\n        aura of ravished despair that \r\n          crashes with craving to \r\n            display her humble \r\n              appreciation of services \r\n                granted by myself \r\nThe slave to the slut of sensation \r\nThe sleet blackens and my sight \r\n  of nothing grows dim \r\nNow i fall \r\n  i scream \r\n    at nothing \r\n      and everything \r\n        for something \r\n          someone \r\nThe weight of my limbs are pulled \r\n  and the star-warmed \r\n    mercy of God \r\n      allows the blades to \r\n        release me as they fall \r\n          below to cut slices out \r\n            of the darkness \r\n  - Like Methanpheta Cream Pie \r\ni feel the soft grip of a feather \r\n  as it beckons me to the surface \r\n    of my immortal sea of delusion \r\nA beating of wings wraps me \r\n  in the arms of a dream \r\n    i lost in the folds of my soul \r\n      as i crippled beneath \r\n        His tears that fall with the rain. \r\n3-12-2004\n\n\n"
}