{
 "title": "Aliens in Hyperspace",
 "author": "Terence",
 "citation": "   Terence. \"Aliens in Hyperspace: experience with Mushrooms (ID 35516)\". Erowid.org. Dec 17, 2007. erowid.org/exp/35516",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35516",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 17, 2007",
   "Views: 204088",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI took two ass-kicking mushroom chocolates. I finally know what Terence Mckenna is talking about, when he says you need to take high, high doses. I think I took the equivalent of at least 5 dried grams of cubensis. I was sitting at my computer looking up some shit on the internet, and it hit me all at once. I couldn't move, I couldn't function at all. I was completely immersed in an other dimensional world, the hallucinations came on very strong and very fast, non-sensical images and patterns exploded out of the blackness. They built up and built up. I thought, oh shit, I took waaaay too much. I tried to just go with the flow, but this was way more intense than any drug I've ever done.<br>The patterns melded into machines and weird technology, which evolved in a matter of seconds into super-dimensional hyperspace technology, but it was organic and everything was shades of green and yellow and brown. I saw several little green beings who beamed visual and auditory hallucinations directly into my brain. It was like the static noise on a tv with the volume turned all the way up. They were speaking some language that I'd never heard before. It was like english, but infintely more complex, and every once in a while I could make out an english word, but it was complete nonsense, like 'televisual orderment cantalize qualities mourn cotterize' and then another burst of deafening static. They seemed desparate to tell me something, I could understand what they were saying visually, but it wasn't anything that could be explained in words. <br>Images were shooting by me at lightening speed, the most bizarrre imagery you could imagine. Aliens committing strange pseudo-sexual acts on each other, more and more technology, technology that as it evolved melded more and more with these beings, and they became one with all the matter around them. It felt like they were grabbing me by the arms and yelling at me. I could feel them pulling me one way and another, as they desperately beamed this information to me faster and faster, more and more intensely. I couldn't take it, I thought for sure I've gone insane, I've completely blown my mind, I'm never coming back from this.<br>If I turned my head and looked somewhere else, sometimes the hallucinations would start to disperse, but then all the geometrical shapes in my field of vision would meld to together and rush at me, and I'd be back in this alien world. The biggest underlying theme of the trip was technology. It was like I was being imparted with knowloedge about the human potential and the infinte other worlds and civilizations out there. It didn't seem like the kind of shit that my subconscious mind would create. It was completely alien, completely real, and unlike anything I could have begun to imagine. I don't know what mushrooms are, but I think they are a key to understanding the nature of reality and the nature of the human mind. I was not prepared for anything I saw, even if you're an experienced tripper, this is intense shit, it totally fucks with your head. Proceed with caution, but if you think you can handle it, a level 5 trip is truly something else and it's absolutely mindlblowing.\n\n\n"
}
