{
 "title": "An Unexpected and Frightening trip",
 "author": "Paul C",
 "citation": "   Paul C. \"An Unexpected and Frightening trip: experience with Cannabis (ID 35510)\". Erowid.org. Apr 26, 2005. erowid.org/exp/35510",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35510",
   "Male",
   " ",
   "Not Given",
   "Apr 26, 2005",
   "Views: 4929",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been smoking pot for almost a year now.  I smoke kind of regulary, but not a whole lot; maybe about 5 or 6 times a month.  I always have fun times while high, and after I am done smoking, I always want to take in more.  But one night, I had a totally different experience.  It was so frightening that I promised myself while I was high never to smoke again.  This trip made me think how mind-controlling marijuana really is.</p><p>I was at my friend's house to sleep over one Tuesday night.  We packed a bowl at 11:45 using half of his weed and half of mine (which I had not tried yet).  We sat there blazing watching Seinfeld.  I tried to hold in the hits as long as i could before exhaling; something I had never done before.  It was because of this I think I got extremely high.  At first everything was fine; Kramer seems 10 times funnier while stoned.  After the show, my friend went down to have a cigerette outside.  As I followed him downstairs, I felt the power of the weed take over me.  I couldn't stop shaking.  I got a glass of water in the kitchen and went back up to the room as my friend was smoking outside.  I laid down and flipped through the tv channels. My hand shook as i put down my glass of water on the nightstand.  My mind and heart began to race ridiculously as i laid there.  I tried following the Drew Carey show, but physically couldnt just lie there and watch just one thing.  I flipped through the channels and found an old show on Nickelodeon called 'Kablam!'.  Oh man did it bring back memeories.  </p><p>I closed my eyes and imagined watching the show when I was a kid.  I opened my eyes and realized my friend's room looked completley different; like I had never been there before.  I kept uttering to myself out loud 'man I am so high' and kept shaking to the point that the bed was shaking.  Anxious to 'de-high' myself, I went into the bathroom and spalshed cold water on my face.  My friend then came up and I told him I was going to sleep; my voice shook as I talked.  I then immediatly walked down the hall to the room I was gonna sleep in.  I kept telling myself to calm down; that the high should be done peaking.  I looked at the clock and it was 12:10; only 15 minutes after we finished smoking.  The time lapse was unbelievable; my high was just beginning.  </p><p>I laid in my bed with the lights on.  The central air conditioner never sounded so loud.  Then all of a sudden it shut off, and all I could hear was my heart beating rapidily.  I then thought I was going to have a heart attack for sure.  I thought I was going to die.  I focused on my breathing, but everytime I breathed slow, my heart involuntary started beating fast again.  My mouth was so try, it felt like I was chewing on sand, and my tongue couldn't provide saliva anymore.  I had trouble breathing and swallowing.  It was a nightmare.</p><p>Panicing, I walked over to my friend's room because I just need someone to talk to.  I tried to act cool and not let him know I was stoned to the point of almost freaking out.  I tried sitting there watching TV, but I had to change my position about every 5 seconds.  I told my friend I had to walk around.  He was too stoned to see that I wasn't alright.  I went back to my room.  I figured I really needed to calm down or I would just go insane.  So I got in the shower in the bathroom which was in my bedroom hoping that would bring me down.  After finally figuring out how to turn on the shower instead of the tub faucet, I stood there trying to calm down.  I turned the water on hot, but then the steam from the water started almost choking me.  I turned it cooler, and leaned against the shower wall and had the water beating on my head.  I felt like I was in a water park and was standing under one of those fountains.  I constantly kept changing the water from hot to cold.  I tried to get my mind off of being stoned, so I started singing.  Then I thought to myself 'This is silly, it's just a drug screwing with my head, I'm sure I am coming down by now, I'll be fine.'  </p><p>As soon as I said that, my mind raced again and my heart beated uncontrollably and I convinced myself I was going to be this high for the rest of my life.  I felt there was 2 worlds, the high world and reality.  I'd calm myself down to think I was not high anymore and in the reality world, and then my mind told me I was stoned as hell and I panicked as I entered the high world again.  The shower wasn't helping at all.  </p><p>After a good half hour in the shower, I got out only to find I that hadn't closed the shower liner all the way and the bathroom floor was covered entirly in water.  Believe it or not, trying to solve this problem of drying the floor had brought my high down and gave me something else to focus on.  As I blotted the floor with towls and my clothes, the high went from scary and tense to calm and relaxing. I then finally went to sleep at 2:30 and experienced some closed-eyed visuals as I went to sleep. </p><p>This experience terrified me.  I am typing this one day after it happened.  I will deffinitly smoke again (I'm seeing Phish in 2 weeks) but I am going to take it real easy and take very few hits.</p>"
}
