{
 "title": "More Intellectual Than Visual",
 "author": "LouieDog",
 "citation": "   LouieDog. \"More Intellectual Than Visual: experience with Mushrooms (ID 35521)\". Erowid.org. Jul 28, 2007. erowid.org/exp/35521",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35521",
   "Male",
   " ",
   "Not Given",
   "Jul 28, 2007",
   "3174",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Earlier this week I had recently purchased an eighth of gold capped psilocybin mushrooms from a friend who I had trusted and purchased mushrooms from before. This would be the second time doing mushrooms and I wanted to try them again but at night instead of day which I had done the first time.</p><p>I was going to trip with my friends M and R. They had bought some mushrooms from the same person but only had an eighth to share where as I ate a whole eighth. The setting of the place we were going to shroom was in R's room but we had to be careful not to be loud because R's parents were still around. R's room also has a door that leads outside so we could wander around his property fine.</p><p>At 10:00pm we chewed up the mushrooms with only a little Gatorade to wash them down. Knowing that I had done twice as much than either of my friends I informed them what to do if I started having a bad trip because my first experience with mushrooms was pleasant for the first hour but after that I went into a crazy psychoactive deja vu and informed my mom that I had done the illegal substance. We put on the movie Finding Nemo because we thought it would have some interesting visuals in it.</p><p>About a half hour later I felt this intense body high and an appreciation for the sounds in the movie. The movie itself was uninteresting so we put on Pink Floyd's 'Wish You Were Here' to get us tripped out. Fifteen minutes later I was looking at the carpet and trying to figure out where the ends of the patterns were. I look up and see patterns all over M's face and R is under his covers looking around his room. I began to become very annoyed by M because I felt that he was the only sober one (obviously he wasn't) and I went under my covers and just looked around the room.</p><p>I was becoming very paranoid because R's room had tons of posters and Spanish architecture. Voices appeared in my head saying that I was going to stay in this state of mind forever and never recover. I kept on telling myself that I would be fine but the voices persisted. I looked at the walls and realized the posters on the wall were the voices talking to me. I needed to get out of the room. M was enjoying his experience so much that all he wanted to do was go out and explore. I agreed to join him because I needed to get out of the room. R apparently was too scared to get out of his bed so we left him there because he wouldn't budge.</p><p>We walked outside and I told M how the voices were in the room and I needed to get out. Outside was very nice with the breeze and the stars. Though it had been over an hour since I had taken the shrooms, the visuals were not as strong as they had been the first time I had done them but I was feeling totally shroomed up and tracers were everywhere. We decided to go to my car and lay on the hood and windshield and just look at the stars. I don't know what it is about shrooming but every car looks like an aerodynamic speed demon. My banged up slow ass car now looked like it could outrun a Ferrari. We laid down on my hood and just stared at the stars.</p><p>For some reason it felt as if were laying totally flat even though we were at an angle. M was telling me how much he was enjoying the feeling. I agreed with him and told him tell me if he was scared or beginning to have a bad trip at all. We sat on the car and just talked about the beauty of this drug and why we did it. It was just fun to discuss topics we liked. We decided to go inside my car and listen to some music because it sounded so good. We put the AFI song Morningstar on repeat and analyzed how perfect that song was and how it related exactly to how we were feeling.</p><p>At 11:45 M said he needed to take a piss we walked back up to R's room and saw his dad talking to him. For some reason this made me laugh but made M go in a completely different place. He became very paranoid and didn't even want to go inside. When R's dad left I knocked on the window and R just looked at me and closed the blinds and walked away. It seemed as if R was in a horrible place. I felt bad for him and I started getting in a bad place. M would have totally freaked out if he had to go inside to take a leak so I told him to piss in the bushes instead. We decided to just leave R alone because he told us all he wanted to do was sleep. We wanted to explore so we left his room and continued our journey.</p><p>M and I made our way to the bottom of the street (R lives in a gated community) and just walked around for a little bit. Suddenly a rent-a-cop came around the street. I told M to act like we went outside to smoke a cigarette. The cop shined his flashlight on us and then drove away. M was angered because the flashlight but I was too busy staring at the neighbor's house because it looked like some Polynesian tiki mansion to me. M informed me that he was going to a bad place so we went back to my car. The inside of my car seemed like a place of comfort for I have probably spent weeks in total driving time in that piece of junk.</p><p>The AFI music was too harsh so we put a sublime CD and talked about how Bradley Nowell did drugs and died. It reminded me of how numerous amounts of my friends had been strung out on drugs. My best friend had been strung out on pills and sent to Utah. My girlfriend was expelled from school because of her meth addiction. Other friends had been strung out on coke, heroin, LSD, a lot on meth, and one had been raped because of drugs. Not that this put me in a bad place but instead it put me in a place where I realized that I would not fuck up my life with drugs. My life was just too much fun and too important to use drugs as an escape. M and I got to the point where we said that all we would do was drink occasionally and if any drugs only safe ones like shrooms and once every four months. It also gave me a sense of hope by helping my friends.</p><p>Without knowing R's dad came out to the car around 1:00 and asked us what we were doing. For some reason I felt completely sober while talking to him and told him that we were listening to music in my car because R didn't want us around him. For some reason the dad believed us and said 'Ok just don't drive around because your mom doesn't want you to drive after midnight.' M was scared because he didn't know what to say but I assured him that he didn't think we were on anything because he said don't drive after midnight. I felt a since of accomplishment for pulling that task off. We were good for the night but I wasn't too sure about R.</p><p>After that we talked about religion and how there has to be a god because life couldn't be this beautiful from some big bang thing. We talked for hours about random topics. We even got to a point where we thought that shrooms could make blind people see by using CEV or closed eye visuals. The entire time we were talking I was still seeing the car stretch out and little things in the car move and change. I remember going outside to take a piss and I pissed on a plant and the plant seemed to grow and bloom when I pissed on it. It felt like a burden was being pulled off my back and made my night. Earlier M left to take a piss and I remember feeling scared because I wasn't with anyone and I was going to die alone but he came back and I was fine.</p><p>We were both getting tired and agreed that at 3:30 we would go inside and go to sleep. When we went inside all the lights were off. I called R's name and all I heard was some evil laughter. M turned the light on and we saw R in the corner with an evil grin and he had pissed himself. We led him into the bathroom and told him to put some new pants on and go to sleep. I grabbed a new pair of pants and he pulled his pants down and looked in the mirror at his penis. He seemed very amused at it. This was very weird because it had been almost six hours since we did the shrooms and it seemed like he hadn't come down at all, almost as if he was still peaking.</p><p>This scared me, he was almost possessed like having half as much shrooms as me and I was almost completely back to baseline. We eventually put him in the bed and M and I tried to go to sleep but couldn't. M went to sleep in his car. When M left I felt a since of loneliness. The room started tripping me out again. I needed to leave the room. I left the room and went to M's car to try to go to sleep.</p><p>I struggled for what seemed like an eternity to go to sleep though it was only an hour. During that time I made calls to everyone I knew and just lied down for a while. At about 5:00am I just decided I was completely sober, no need to be worried of the room or loneliness. I went back to the room and it was locked. I went back to my car to go to sleep. I got a call from M when I was in my car he said he couldn't go to sleep and I told him R locked his door. We both decided to go home. I didn't fall asleep until 7:00 in the morning in my own bed.</p><p>In conclusion, this trip was very much different than my first trip. It was more of an intellectual journey than a visual journey. Since that trip M and I are much better friends. We bonded so much that he is almost like my brother. We also agreed to stop doing any hard drugs. R's dad found out that he did the shrooms that night and called both M and my parents. He doesn't believe that we did shrooms but he did make us explain some stuff. Also a big thing I learned was that everyone has different reactions to shrooms and even though people may be experienced with psychedelics they still have bad trips. M and I had just the right amount of shrooms to have a good time but R being a lightweight had a little too much and had one of the most horrible experiences of his life. I do believe I will try shrooms again but it won't be for at least a few months.</p>"
}
