{
 "title": "How to Achieve Insanity",
 "author": "The White Knight",
 "citation": "   The White Knight. \"How to Achieve Insanity: experience with Salvia divinorum (leaves) (ID 35557)\". Erowid.org. Nov 7, 2007. erowid.org/exp/35557",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35557",
   "Male",
   " ",
   "Not Given",
   "Nov 7, 2007",
   "Views: 24494",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started this out in the name of pure scientific knowlegde. My plan: to document the effects of a daily dose of salvia for spiritual/mental health purposes. Everyday at about the same time, around 10 PM, I smoked a bowel of salvia divinorum leaf. Everyday I got the same effect, a sense of well being and feelings of connection. I also got a slight taste of the salvia body high. I continued this for a total of 2 weeks.</p><p>About halfway through the first week my mood seemed very up, nobody seemed to notice anything different about my character and I felt more in contact with the gods, the earth, people, animals, everything. By the end of the first week my recollection starts to get hazy. I still felt in very high spirits, but my friends said I was acting a little odd, randomly blurting out whatever popped into my head. They all seemed to enjoy it and I enjoyed myself too.</p><p>Halfway through the second week my thinking and memory was extremely erratic but never dangerous. I can't quite remember my state of mind during that time but I know I was considering giving up on the experiment. At the end of the second week I ended the experiment when a friend expressed concern for my well being. We had smoked some weed and during my high there was a time where I layed back onto the couch, my eyes rolled back into my head and I suddenly exclaimed MASHED POTATOES! I preceded to be barely reachable for the next 30 minutes. I remember smoking the pot but don't remember that half an hour.</p><p>My thinking was erratic for the next 3-4 days or so but it eventually went back to normal. I guess here is where I make my conclusions but personally I don't want to influence you, the reader, either way on trying what I did. Just be careful.</p>"
}
