{
 "title": "Unusual Mixed Party",
 "author": "Selene",
 "citation": "   Selene. \"Unusual Mixed Party: experience with MDMA (ID 3555)\". Erowid.org. Oct 31, 2000. erowid.org/exp/3555",
 "substance": "MDMA",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3555",
   "Female",
   " ",
   "Not Given",
   "Oct 31, 2000",
   "Views: 23312",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n**Desc. of mindset & setting: </p><p>When I started taking ecstacy, I would experience the most beautiful and fullfilling things --from the simple, connecting conversations with strangers, to expanding my already incredible relationship with my husband of 6 years. </p><p>But, the very first time, I entered a nearly debilitating 2 month depression afterward --the massive serotonin dump was total, leaving me with little ability to cope with life in general. I am back to fully functioning, and I would even say that the extended Dark Period helped me to confront things inside myself--making me an even better person. (Dose: 1 pill/tablet MDMA *small, smooth, unprinted pure white tablet, high quality cannabis on the back end. Had a great 'tour guide' who supported me and was always there for me and my safety/health.</p><p>Last night was an all-together different experience; instead of taking it in a small group with a positive, 'controlled' environment, we were at a party of 250+ people. I hadn't done E in over 3 months, and was looking forward to whatever the experience offered me. Generally, E makes me 'more' of what I already am naturally, so I am very comfortable with the Experiences I have had.</p><p>This party was 50% people in their 30's, the other 50% were under 22 years old. I mention it because it was interesting how the two age groups stayed separated, even with the E-mpathy.</p><p>First, the E was delivered 3 hours late....and I was frightened how many people weren't waiting for the E they talked about taking, instead proceeding to drink a great deal of beer/cocktails, smoke pot, do meth, etc. I chose to wait for the E, drinking only orange juice and water, even refraining from cigarettes. I hadn't eaten in about 6 hours, but was feeling great. Bottom line on this Trip: onset varied from 35-50 minutes, Roll lasted 3.5-4 hours, back end 'speed' lasted nearly a day, with small E-like surges throughout the day.</p><p>My preparations for the evening were (two weeks prior to Rolling); reading the books '5-htp' and 'Mind Boosters' (both by Ray Sahelian, M.D.), and doing as much research on E and all its permutations, effects... I started a daily program of 5-htp in the morning, with Gingko Biloba or St. John's Wort, followed by 5-htp and Valerian at night before bed. </p><p>Not only is 5-htp an OTC-available precursor to serotonin production, it also helped add 2-3 hours of deep, quality sleep to my (usual) 4 hours of sleep, increased my mental acuity and emotional stability, it even helped curb my sometimes overly ambitious appetite. This is a supplement that should be taken only by people who read these books, not for people prone to mindless pill-popping. Also, it can affect SSRI's and MAO-inhibitors, so be INFORMED before you take it. </p><p>Back to the E Party:</p><p>I took one pill/tablet, and within 30-45 minutes felt the first glow of the Rush. This was slower, more subtle than the other E I had had, and to some extent I was spending more of that time trying to help people who had been drinking and taking E, and helping lonely 1st timers who had no idea what to expect/do to enjoy their Roll. I was saddened that many people there had NO CLUE how E works, why it does what it does, and what mixing their drugs might do to the Experience. A small group of us was concerned about what first aid emergencies might crop up because of this, and kept aware of those people. Luckily, nothing awful happened to them. Equally disturbing was the number of people taking *2* pills, and they didn't even test them first. From what I have heard, one DXM pill is enough, much less two! and no one here knew for sure what these pills contained. A large percentage of Rollers were 1st timers who were scared, and a little frantic. I was all about Respecting how they wanted to roll, but I was really concerned for them, and it almost hurt me to watch them do this (unwittingly? uncaringly?) to themselves.</p><p>I continued enjoying my Rush, I was elated and had an incredible mental acuity throughout the experience. I did notice this E had more of a speed-y character to it than other batches. Still, I loved touching and feeling, being touched and felt (sometimes in sensual/sexual ways; feeling up and being felt-up), dancing...I was even reveling in my clean sweat from the initial Rush. I was all about Giving and Caring, and had some incredible opportunities to indulge in my bisexuality, with and without my husband. (We have an incredible Connection, and have been 'threesoming' for a while now...) I was in love with women's feet, and one woman had her shoes off, her boyfriend was rubbing one foot, so I sat down next to them, smiling and Loving. They invited me into their experience, and there we sat on the couch, rubbing her feet....she was so Blissed. I am a massage therapist, and quickly became popular *grin*. I remember looking into her eyes as I brought her foot up to my mouth and gently, languidly ran my tongue along her arch, sucking her big toe, we looked INTO each other as my satin-gloved hand slowly massaged up her ankle to her knee and inner thigh. She was definitely into all the attention, and I was just glad that we offered each other something unique and pleasurable. </p><p>I was having so much fun talking and listening, touching and feeling, and I realized that my Roll was all about unconditional acceptance, and open appreciation, of people I interacted meaningfully with. This was different from other E-trips, which were more sensually selfish. My husband did not take Viagra with the E this time, he took it later, when we got home. We decided to leave when we realized the Roll was down-plateauing, but still viable. We grabbed a cab, and came home to our satin sheets and fur throws (prepared special for the evening), and continued drinking water.</p><p>We had mind-blowing sex, and door-opening connection with each other, and then settled in to talk into the morning hours. When I realized I was not Rolling any longer, I felt that I had a choice; either let the Crash ruin me like it had the first time, or Move Through It, positively. I chose doing it Positively, and felt a surge of Self Empowerment. I also knew I was coming into the back end speediness, so I ate some wonderful cannabis-butter chocolate truffles. We talked and shared and petted each other in the most loving, giving, receptive way. That quiet, connecting touching really seemed to last forever...A few hours later (7am) we went to sleep, but only for about 3 hours. We spent the rest of the day in bed, talking, watching movies, relaxing.</p><p>I highly recommend 5-HTP supplements, and paying close attention to general health for at least 2 weeks before Rolling, and probably even 2 weeks afterward. Read all you can about E, and really listen to your body while you are on it. Also, TEST TEST TEST those pills/tablets, before taking them!!! </p><p>I love E, and will continue to do it, as long as I adequately prepare my mind and body for the load.</p>"
}
