{
 "title": "Definitely Synergistic",
 "author": "MezzaTheCat",
 "citation": "   MezzaTheCat. \"Definitely Synergistic: experience with Cannabis & Calea zacatechichi (ID 35587)\". Erowid.org. Nov 14, 2004. erowid.org/exp/35587",
 "substance": "Cannabis & Calea zacatechichi",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Calea zacatechichi",
   "(plant material)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35587",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 14, 2004",
   "Views: 17108",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI bought some Calea Zacatechici, interested in its dream stimulating effects.  I didnt even attempt making the tea, believe me I've had my share of foul-tasting concoctions in the name of physical and mental exploration and I wasnt up for it this time around:)<br>I tried smoking it a few times, definately noticed a very pleasant, mild buzz but hadn't really recieved the lucid dreaming qualities.  If I had, I couldnt remember them.<br>Id been at baseline for quite sometime, having to put aside my beloved psychedelic voyages and focus on a real job, paying off some bills, getting life started post-college, etc.  I had been talking to a good friend who told me all about a great MDMA+Mushroom trip he just had, and it put me in the mood for some experimentation. <br>So I dipped into my stash and packed a small bowl of some finely aged and cured Bubblegum.  I packed another bowl with crushed Calea Zacatechichi leaves and flowers.  After little moment to prepare myself, I took a long, smooth hit of the marijuana pipe. I hadn't smoked or done much of anything in a long time, after being a once a day smoker for nearly 3 years - I was welcoming the change in mental state.  Felt the the slow build of a long awaited high, warming up my toes and working its way up to my head.  I took a hit from the Calea pipe...tasted good, a menthol/minty taste on top of the subtle sweetness of the Bubblegum smoke.<br>A few more tokes of MJ/Calea and I sat back on the couch, basking in nice warm glow as the experience built up to a peak.  And that's when things got interesting.<br>Ive used a few psychoactive compounds, Marijuana, San Pedro, LSA, LSD, Mushrooms - you get the idea.  As the weed+Calea combo built up, it definately had other aspects to it than just MJ alone.  I started to get a bit paranoid, and I closed my eyes and just 'pushed' any negativity away and out of me.  As soon as I did that, I could feel my consiousness expand and was bathed in a warm, euphoric body rush.  My auditory field noticeably expanded to 'super stereo', and I was buzzing so hard It felt like I wasnt aware of my physical self for a few moments.  I just kind of became one with the couch, just melted into my furniture.  I closed my eyes and felt like I was rotating slowly through space.  At the time, It almost felt like a small slice from a good mushroom trip...<br>This feeling lasted for a short time, and then I came off the peak.  Visually, everything was sparkly and sort of hazy, like you would expect on a good dose of MJ, but I had barely smoked a small bowl of a type of weed I am very acclimated to.  Of course, I hadnt smoked in about a month, and it had been 3 months before that...but still.  I had been smoking this same bud for nearly 2 years and I never had an effect quite like that. The Calea definately imparted something of its own to the high, it made it much more intense and, deeper than it should have been after only a few hits.  The two plants are definately synergistic.<br>I took a few more hits off the Calea pipe to try and gauge the effects, and it did bump me back up toward that 'peak space'.<br>So, feeling quite content, I flipped the TV to some cheesy dating shows and proceeded to laugh my ass off for the next hour or so, thuroughly enjoying my high.<br>Combining Marijuana and Calea Zacatechichi added another dimension to what should have been a 'light' MJ experience, and Ill surely try it again.<br>I still havent experienced and lucid dreaming with Calea, but after this experience, I am confident that Ive found another great plant ally on this crazy planet.:)\n\n\n"
}
