{
 "title": "'Psychosis' That Utterly Surprised Me",
 "author": "Bambi",
 "citation": "   Bambi. \"'Psychosis' That Utterly Surprised Me: experience with Amphetamines, Caffeine, Albuterol & Sleep Deprivation (ID 35612)\". Erowid.org. Oct 13, 2006. erowid.org/exp/35612",
 "substance": "Amphetamines, Caffeine, Albuterol & Sleep Deprivation",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 38:00",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)",
   "  T+ 38:00",
   "100 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   "  T+ 38:00",
   "  ",
   "inhaled",
   "Pharms - Albuterol",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35612",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 13, 2006",
   "Views: 35836",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I thought that Amphetamine Psychosis only happened in heavy users after a very long binge.  My dose was comparatively small and the Psychosis utterly suprised me.  I would also like to point out that I have never been on perscription drugs.  I am not depressed or psychotic, so I can safely say that this experience could happen to any 'normal' person.</p><p>I maintained a consistantly mild buzz for about 21 hours by gradually taking four 10mg Adderall pills (Generic). The session started at 9 am on Wednesday. I began coming down around 6 am on Thursday.  </p><p>Visual disturbances began to appear as I had expected (wavelike ripples, Floaters, small flashes). This didnt seem to be a major problem.  Throughout the day I felt like a lazy piece of shit and had little appetite and motivation, which was also expected.  I found myself very tired but refused to sleep during the day b/c I didn't want to throw off my night-time sleep schedue anymore than it already was. So I found myself still awake at 10 pm with 38 hours void of sleep (no big deal, really)</p><p>Chronology:</p><p>10 pm Thurs</p><p>-I forced myself to remain awake b/c I had a shit-load of cleaning to get done in my apartment.  The obvious solution would have been to take more amphetamines but that would have ended up making matters worse.</p><p>10:30</p><p>-My girlfriend came over to assist with the the cleanup. I kept feeling myself trying to nod off, even while standing.  Caffiene sounded like a good idea.  </p><p>11:00</p><p>-Drank 3 cups of soda and took 100mg of No-Doz.  Felt slightly more awake.  Soon, my heart was rapidly beating and I had shortness of breath.  I reached for a seldom used Albuterol inhaler thinking that it may be some type of unusal asthma problem.  The albuterol only made it worse. (I think it was an axiety attack)</p><p>11.15</p><p>-Suddenly went from dead-tired to totally jacked....it was almost like an ephedrine buzz with alot of anxiety.  </p><p>-Girlfriend kept noticing me space out.  At one point, I forgot she was in the room and almost shit my pants when I turned around to see her.  This totally freaked me out.  </p><p>12.00</p><p>-Girlfriend went to sleep and kept bugging me to join her but I wanted to surf the internet.  My 'body' kept trying to nod off but my 'mind' was wide awake and totally seperate.  Very strange feeling. Almost like my mind was saying 'what the hell are you doing, you lazy bastard' everytime my head tried to slump onto my desk.  I kept seeing things move out of the corner of my eyes and began hearing small, un-natural beeps and such. I also began to feel a very large 'presence' as if a stranger or intruder was in the room with me.</p><p>2.00 am Friday</p><p>-I finally decided that it was time to try and sleep. (I hate sleeping, even when not under the influence) When I laid down my body was having sporadic twitching episodes.  As soon as I closed my eyes, I could see my racing thoughts being played out in a very vivid 'daydream'.  I say day-dream b/c I experienced the 'visual' of random thoughts but never actually had any real visual stimulation.  They were very 'stream of conciousness' type visions and were likewise quite frightening images due to the anxiety and paranoia that I had been experiencing. I kept my cool however, because I kept reassuring myself that it was just an imbalance of chemicals and such in my brain. I finally fell into a shallow sleep.</p><p>- I awoke several times with extreme disorientation, more intense and frightening that I can ever remember having.  I had totally forgotten where I was at and who was lying beside of me.  My heart was beating rapidly accompanied by a cold sweat during the awakenings.  I don't remember having any dreams, although I'm positive that I did.  I'm also pretty sure that they were horrifying.  I'm glad I don't remember.</p><p>-The next morning I asked my girlfriend if she noticed me acting strange during the night.  She said that I sat up several times looking around like I was lost and then staring off into space.  The most disturbing thing was that on one occasion she woke up to find me standing on top of the mattress with my head nearly to the ceiling and staring straight down at her very strangely.  I have no recollection of this.  I have no history of ever having done crazy stuff in my sleep, either.</p><p>This interrupted series of small naps left me with only about 3 hours of productive rest after having been awake for 42 hours.  I had to get up early and go for an eye exam.</p><p>My psychotic episode was indeed both directly and indirectly caused by the day long amphetamine dosage.  The actual drug withdrawal, coupled with sleep deprivation and very little food created the absolute STRANGEST experience of my life.  </p><p>I experienced acute visual/auditory hallucinations, intense paranoia, my first-ever anxiety attacks, random thought patterns, disturbing mental images, physical tremors and zombie-like awakenings from sleep.  I never experienced the deep depression that many people report, but that may be because I'm not a very depressed person to begin with.</p><p>I conjecture that my experience was VERY mild compared with what true addicts might experience.  Despite the discomfort of the occurance, I would be willing to intentionally repeat this strange experience to futher observe how much stress the body can take before the mind goes totally bonkers.</p><p>Lessons I learned:  To avoid such symptoms, force myself to eat, drink water and take vitamins before, during, and after amphetamine use.  Also, allow myself to 'sleep it off' after the drug's major effects are gone and not take other various stimulants to remain awake.  I would also assume that taking a quick, higher dosage would lead to a milder come-down than repeatedly taking small doses over a long period of time.</p><p>Oh, I almost forgot the funniest part of the actual Aderall high.  I usually try to do something productive when on stimulants.  That night, I started out playing my guitar and writing a damn good song.  Then the little bastard broke a string and left me without an agenda for the rest of the buzz.  Somehow I started looking at internet porn and plunged head-first into a 7 hour marathon session of wonderful masturbation!!!</p>"
}
