{
 "title": "My Time with the Seeds",
 "author": "The Novice",
 "citation": " The Novice. \"My Time with the Seeds: experience with H. B. Woodrose (ID 35631)\". Erowid.org. Dec 18, 2007. erowid.org/exp/35631",
 "substance": "H. B. Woodrose",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "1997",
   "35631",
   "Male",
   "",
   "Not Given",
   "Dec 18, 2007",
   "8168",
   " "
  ]
 ],
 "report": "<p>Wanting to experience a psychedelic, during my first year of college my roommate and I ordered Hawiaan Baby Rosewood seeds.  This eventually led to four years of experimentation with psychedelics and other drugs.  All said I did H.B.W.R. 3 times, acid twice, X twice, and I smoked pot until it became commonplace (what a way to make your life boring).</p><p>Anyway, about the H.B.W.R.  First, I feel that I have lost memory capacity due to this drug.  I, of course, cannot confirm this.  However, I believe it strongly enough to reccomend against anyone taking these seeds.  Before I ever experimented I really had a mind for retaining facts (no matter how useless), and now I feel that it is difficult to retain the simplest information.  For instance, I really have trouble with driving directions that are more than a few steps if I do not write them down.  Albeit I was smoking pot most of this time, but I have not smoked in a couple months and I am still plagued with these memory problems.</p><p>Anyway, about H.W.B.R. -- well, at the best of times I felt a connection with everyone.  I arrogantly thought those who had taken them were enlightened, and those who had not were innocents -- unenlightened.  At the worst of times -- I was violently puking.  The actually--intelligent probably thought -- 'He is puking, therefore what he ingested was probably a bad decision.'</p><p>What I remember most clearly about all the experiences, was the feeling of steadfastness.  Unlike acid, when I was on H.W.B.R. I felt like my bed was my home.  In fact, the force of gravity was so apparent that I felt that I was being forced to lay down when I sat on my bed, or forced to sit when i stood above a chair.  This was fortunate because it quelled my desire to seek out 'bigger and better things' and forced me to explore exactly what I was experiencing at the moment.  Both times I did acid I felt compelled to immediately drop anything I was doing with the hope that what was next would be more exciting. </p><p>At any rate, my three experiences with H.W.B.R. were all positive but I feel they may of had lasting negative effects.  Maybe I will take H.B.W.R. once or twice more in my life but no more.</p>"
}
