{
 "title": "Singing Furniture",
 "author": "Sktslime",
 "citation": " Sktslime. \"Singing Furniture: experience with Salvia divinorum (leaves & 5x extract) (ID 35646)\". Erowid.org. Dec 18, 2007. erowid.org/exp/35646",
 "substance": "Salvia divinorum (leaves & 5x extract)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   "",
   " repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35646",
   "Male",
   "",
   "Not Given",
   "Dec 18, 2007",
   "2318",
   " "
  ]
 ],
 "report": "<p>Hey! Just this Monday I got a box with an oz leaf, 5x, 10x, 20x. so I have been experimenting with salvia. First I did some of the leaf, I was planning to just trip on that (leaf alone).</p><p>I toked a large bowl of leaf, dumped the leaf out while holding the hit in. I got another bowl of leaf ready, exhaled and grabbed the next bowl and started smoking it. While I was holding the hit in, I started packing the next bowl and then exhaled and inhaled the next bowl. This is where things got kind of strange.</p><p>Each of these hits I had timed with my stop watch on my phone to get to at least 23, and on this last hit I didnt think I could hold it in that long but in my head I heard voices of encourgement. These voices sounded like people Ive heard throughout my life. So I made it. Then I exhaled the hit toward my phone and I was supposed to do it the other way because my phone was talking to me, so I appoligized to my sink counter. Then I realized I was appoligizing because I didnt smoke enough.</p><p>So I loaded a bowl of 5x and after I exhaled the 5x, I realized the furniture was telling me my trip area wasnt very good through song. The carpet was singing to me how I should pull it up the wall or something, then the counter was telling me how one of my foot was cold and stuff I dont remember but that was the theme. I was looking for a visual experience that wasnt about my surroundings, so I loaded a bowl of 10x and proceeded to toke it. I held in the large hit for 25 or so seconds. This is where it gets crazy.</p><p>I barely remember anything except for the end of the trip, where Im like on something, some weird furniture, and theres some song being sung by inanimate objects that are so weird I can not explain them. I keep going with the song, until it becomes clear to me that the song is kind of like repeating the same thing having me do different things over and over and over and over, until I stop doing it. I have feelings of me being in trouble or when I was in trouble when I was a kid. T objects Im looking at are the ones Im around. I realize Im sober and for some reason the come down I hated. I was cold, uncomfortable, probably just the drug still being in lesser effect. But like 5 minutes later I was fine.</p><p>Now I went online to talk to some people and in a little while I decide to try a hit of 5x again. I lie on my bed, remembering the bad vibes from my bathroom, and toke a big hit of 5x. It felt like I was being pushed against my wall, which my bed was against, but I was still on my bed. Then the extension cord I saw on my dresser was talking to me and I was like no you dont understand and then I was like oh I dont understand. I looked and everything wood was smiling at me, and the beams were surrounding me, but not in a scary way. They were telling me I forgot to turn the light off, because I was meaning to take hit then turn light off but I forgot. By the time I turned it off now it was too late. </p><p>Now I tried taking 2 more hits of 5x on seperate occasions and all that happens is the furniture joins with me in singing and its kinda annoying because I dont like to sing. I never sing. I enjoyed all of those experiences, even though some were scary the scary part goes away fast like the trip. Also people say how harsh salvia is but I had no trouble at all smoking out of a can, I didnt even cough once all of those times. Weird huh?</p>"
}
