{
 "title": "Seizure",
 "author": "trilobite",
 "citation": "   trilobite. \"Seizure: experience with Mushrooms (ID 35682)\". Erowid.org. Oct 20, 2005. erowid.org/exp/35682",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "1991",
   "35682",
   "Male",
   " ",
   "Not Given",
   "Oct 20, 2005",
   "26371",
   " "
  ]
 ],
 "report": "<p>This experience was a long time ago, but I think it's still worth recording, as it's apparently an unusual one and I still don't really understand what happened.</p><p>My first experience with psychedelics was when I shared a low dose of psilocybin mushrooms with my wife and two friends in 1989, as we sat together in a forest glade.  The effect was pleasant but subtle - I remember seeing mild hallucinations with my eyes closed, like more intense versions of the patterns I normally see when I squeeze my eyes shut.  The main effect, though, was a relaxed feeling of childish playfulness - very enjoyable.  </p><p>After that I was interested in repeating the experience, and a year later obtained a larger dose of psylocybin which my wife and I planned to share on our anniversary.  Unlike me she had tried all manner of drugs in her mis-spent youth, and was experienced with psilocybin.  We took half the mushrooms in the early afternoon in a seaside hotel room, and sat on the balcony waiting for the effects, which when they came were much stronger than the previous time.  For a while the effects were mostly visual, and my mind was clear and I could observe them with great interest and enjoyment.  The clouds took on repeating fractal shapes, and I was fascinated that my brain would interpret the usual visual stimuli in this strangely distorted way.</p><p>At some point we ate the rest of the mushrooms, and the effects became stronger still - I remember going inside to lie on the bed, surrounded by swirling patterns and a wonderful feeling of euphoria - I think I said something like 'why would anyone not want to do this?'.  Then I pleasantly lost awareness of my surroundings, feeling like I'd dissolved into myself.  This was maybe an hour after taking the first dose.  </p><p>Next thing I knew my wife was looking at me with a panicked expression, asking if I knew who and where I was.  I had been hugging her on the bed and she'd felt me suddenly go rigid, and then I'd had a full-blow epileptic seizure.  She'd been in the middle of phoning for help, but when I regained conciousness she didn't complete the call.  She told me about the seizure, but I was now fairly befuddled and couldn't take in the information - I couldn't understand why she was so upset.</p><p>For the next several hours I continued in this confused state - if I concentrated hard I could bring myself back to reality and talk to my wife, who was still pretty freaked out, but mostly I was off in some other place.  I remember smiling at her for minutes at a time while she tried to talk to me - I felt that smiling was all the communication that was necessary.  I was still having hallucinations but was getting bored with them, and eventually I just waited for the drug effects to go away, which they did after the usual six hours or so.</p><p>My wife had felt only mild effects from the mushrooms, and these had evaporated with the shock of my seizure, though she had taken a dose similar to mine. </p><p>I felt groggy the next day, and didn't feel right for several days after that, and I continued to have vague feelings of being unwell for a long time afterwards.  I was really afraid that I'd damaged my brain, and this feeling persisted despite subsequent reassurances from doctors who couldn't find anything wrong.  It was several *years* before I convinced myself that my only problem was hypochondria triggered by the shock of the experience, and I was finally able to put my fears behind me.  So while I don't think I suffered any lasting physical damage from the seizure, the damage to my mental equilibrium was considerable.</p><p>There was an interesting postscript six years later, when I ate some wild puffball mushrooms (with gastronomic, not psychedelic, intent) and briefly blacked out, twice, about an hour later.  I don't know if I had a seizure as no-one else was in the room at the time, but there were no lasting after-effects.  That experience suggested to me that I have a general allergy to some kinds of mushrooms, rather than a problem with psychedelics per se.  But I'm playing safe and haven't taken any psychedelics since that day in 1991.  Too bad - but for the minor detail of the seizure, it would have been a great experience.</p>"
}
