{
 "title": "Moon Screen",
 "author": "JLKnockout",
 "citation": " JLKnockout. \"Moon Screen: experience with Cannabis & Salvia divinorum(20x extract) (ID 35691)\". Erowid.org. Jul 28, 2007. erowid.org/exp/35691",
 "substance": "Cannabis & Salvia divinorum(20x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35691",
   "Male",
   "",
   "Not Given",
   "Jul 28, 2007",
   "4324",
   " "
  ]
 ],
 "report": "<p>I had taken no supplements or perscription drugs within the past month or so and was ready to explore my thoughts and the effects of weed and salvia laced in a fat blunt. We were at Navarre Beach, Florida on our spring break and were glad to be in the warm sunny weather of Florida. But by nightfall, we were ready to trip.</p><p>My friend Adam and his buddy had a fresh half ounce for the whole week along with my other friend David's eighter so we were set. The first night we were there are parents were at the beach bar and karyoking all night and just havin' a good ole' time, so we had the time and the urge to all get fucked up. We had been anticipating smoking the weed, but more so my friends 18g of 20x salvia that he had brought along. </p><p>The setting was a big long vast beach around 12:00 am and the air was so crisp and the breeze was soo cool coming in from the ocean with the waves clashing on the shoreline. It made everything seem so perfect and tranquil; even mystical. It was time to toke. My friend was rolling up a fat blunt and Dave suggests to Adam that we should lace a little savlia in with the weed to enhance the high, so Adam, being the hardcore kid he is, dumps a whole vial of the shit in.</p><p>I've smoked straight salvia before three or four times, but never with weed so I was a little hesitant to smoking the blunt. Adam encouraged me to do it aloing with my bro and some other friends and some chicks that were there, so I did. We puffed on the blunt, taking maybe one or two hits and passing it and that fucker burned for a while, so I got a good eleven hits in. </p><p>The Experience</p><p>At first I felt the onset of the weed was feelin' just like a normal high, but that soon would fade into a whole new feeling for me. We sat in then sand just chillin and chattin with the girls and enjoying ourselves until something really strange took effect. I looked at a light up at the moon and all of the sudden, not expecting a thing, I shoot out of my body towards the moon and the moon turned into this crazy face and this whole movie screen was reflecting on the face of the moon and the segment where ET the extra terrestrial is running in the cornfield towards his ship played out on it. It actually seemed like I had left my body and was watching it as a real life incident.</p><p>And then as quick as you could say apple juice I was back into my body sitting on the beach with my friend. I was astonished amazed, and dumfonded all at the same time. It was truly the  weirdest thing ever. Im not gonna go into too much detail abou the trip itself, but it was great. Things would sway in my vision slightly, you'd recognize or percieve things from every day life as whole different things, I'd leave my body into really visual and realistic but short trips, some of them in which my friends were involved themselves.(Tripping with me) </p><p>Towards the come down I felt warm, secure and at one with myself and God. I'd stare at the black and mysterious abyss of a sky and see really really vivid patterns and colours just moving around in segmented motion, short and sporadic bursts. I was so lost in it all that I wouldn't be able to here noises around me and lost a grasp of reality. It ws such a blissful oblivion and I loved it.</p>"
}
