{
 "title": "Tripping with My Lady",
 "author": "Munky",
 "citation": "   Munky. \"Tripping with My Lady: experience with Mushrooms & Cannabis (ID 35690)\". Erowid.org. Jul 28, 2007. erowid.org/exp/35690",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35690",
   "Male",
   " ",
   "Not Given",
   "Jul 28, 2007",
   "Views: 2775",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My girlfriend Kitty and I decided we wanted to have a trip with just us - we'd tripped together on 3 or 4 different occasions, but there were always other people there. So anyways, we get a half ounce and made it into some iced tea, stick it in a bottle and we're off. </p><p>We had planned to trip out in a beautiful park called Confederation Park. Our motivation for this was this one ginormous house we always passed on the bus and wanted to investigate, not to mention the fact that the scenery was amazing. We'd stocked up with plenty of candy, water, and other supplies before hand and stuck them in my backpack with my gasmask. We'd been sipping at the tea for an hour or so before we got off the bus at the park, and at that point we were both pretty high. </p><p>Anyways, there was some really cool weather that night, and it had been raining fairly constantly all day, though not too hard. Perfect mushroom weather, or at least I think so. It all just smelled so fresh and wonderful. When we first get off the bus and come to the park, we're both so overwhelmed by the intense visuals we sit on a hill for ten minutes or so tripping out on the swaying trees, and the crazy cloud formations. Daffy Duck was laughing at me. From here we venture on down to the big house and explore there for a bit. We walk down the path, just talking and generally being high. A kilometer or so down the road, we realise we're now minus one backpack, and one very new gasmask (only had it 6 days :), so we return to where we got off the bus, and after a few minutes of checking out areas we visited, we both came to the conclusion we weren't going to find it. </p><p>At this point we can hear a group of rowdy drunks walking towards us, and the rain began to pick up so we sat on the back porch of that big house. We just talked, smoked a few bowls, cigarettes, whatever, and mushroom time kicked in. Next thing we know, an hour and a half has passed, so we both drink down a few more large gulps of the oh-so-special mushroom concoction. </p><p>The rain had died down to a drizzle again, and we heard some more voices on the path below us. As we were both squinting in the darkness to see who it was, the biggest bolt of lightning I have ever seen came. It literally lit the whole park up like daylight. Not two seconds later, it was followed by the loudest thunderclap I've ever heard. It quite literally rattled my teeth. What seemed to strange about this was it was perfectly calm before it, and the rain only picked up a little bit afterwards. Nothing more was heard as far as thunder/lightning goes. We couldn't believe there wasn't a huge downpour to go with it - mushrooms are right fucked</p><p>Feeling quite high once again, we venture on down the path once more. We come across a sweet little bridge with a creek running lazily underneath it. We were there for probably fifteen or twenty minutes, just talking about everything and anything (or is it anything and everything?). We decided to move on, and this is where things got interesting. </p><p>The last dose of mushrooms I'd taken was reaching the peak, and my body was feeling pretty heavy so we found a bench to sit on. As soon as I sat down, my body was dead-weight. I tried to keep my eyes open, but it was just not possible. When I closed them, I saw the most intense CEV's of my life. Earlier that day I had been looking at some of Alex Gray's artwork, and I saw images of it all flashing before my (closed) eyes. A minute later, they were all swirling too fast to even begin to guess what they might have been. An infinite array of blindingly vibrant colors was speeding before me at 100 miles an hour. I've done alot of mushrooms, and never experienced anything like this, besides on acid.</p><p>All of a sudden I had to wrench myself off the bench, crawled a few paces away and threw up everything I had in my stomach. Interestingly enough, that was the first and only time I've ever puked on mushrooms, or felt even remotely close to hurling. It had the very distinct taste of those pink and blue sour bottle candies, mmmmmmm so damn good. At least it wasn't the undeniable taste of bile.  </p><p>At this point, we checked the time and it was 12:30 or so, and the last bus came at 1; we had a way's back and had to hurry. After my upchuck I was feeling like a million dollars, so that was no problem. We were both absolutely and completely drenched, but it didn't bother us in the slighest. As we were sitting at the bus stop waiting for it to come, we were smoking a bowl and a cop car passed just as I was taking my hoot. We both saw him crane his neck to look at us, smile and keep driving. This goes to prove not all cops are assholes. </p><p>Anyhow, we get home, get naked and snuggle into a warm bed (oh my god, so inviting) and once again, the mushroom time kicked in. We talked for four hours, and I would've bet money that no more than forty minutes had passed. Tops. These last few hours, just cuddling and talking though, were, without a shadow of a doubt, the pinnacle of that trip. That night I came to the realisation that I love Kitty. I've thought I loved past girlfriends, but this is simply an undeniable truth. Out of the blue we said it at almost the exact same time, and we both had tears streaming down our faces. It was fucking fantastic. </p><p>We didn't end up getting any sleep that night, but it didn't bother me any. When my mom left for work, we got up, made a big breakfast, and reflected on the night we'd just shared</p>"
}
