{
 "title": "Recreational Nutmeg Experiment",
 "author": "Karlos Fandango",
 "citation": "   Karlos Fandango. \"Recreational Nutmeg Experiment: experience with Nutmeg (ID 3570)\". Erowid.org. Dec 13, 2001. erowid.org/exp/3570",
 "substance": "Nutmeg",
 "bodyweight": "12 kg",
 "header": [],
 "footer": [
  [
   "Exp Year: 1988",
   "ID: 3570",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 13, 2001",
   "Views: 62628",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn the summer of 1988, my friend and I travelled from Northern Ireland to Amsterdam for a holiday and to experience some quality marijuana in a paranoia-free setting (supply back home being underweight, of appalling quality and sold by paramilitary groups). While we were there we purchased some interesting literature - one book being 'Mary Jane Superweed's Book of Herbal Highs' (Stone Kingdom 1970), which listed, among other plants, the hallucinogenic properties of nutmeg. Back in N.Ireland we decided to experiment with some of the less risky items in the book and nutmeg seemed to be the most user-friendly. At first we tried to eat the nutmegs in their raw state, but this merely made us feel sick before we could eat the required quantity! We decided to try extracting the active oil through boiling using the following method:\r\n20 whole nutmegs (crushed in a cloth using a hammer!)\r\n3 pans of simmering water\r\nWe placed the crushed nutmeg into the largest of the pans and after 10 minutes of boiling, an oily film began to develop on the surface of the water. We removed it using a spoon and placed it into the second pot. The reason for this being that the oil became solid at room temperature and carried with it a lot of the plant matter. Once in the second pot the oil became clearer and, once removed into the third pot, became virtually free of any nutmeg pieces. After an hour we had extracted everything, since no more oil was being given off in the main pot. We allowed the water in the third pot to cool and the oil formed a buttery/waxy layer on the top of the water. Once completely cold the oil was removable as a solid disc, which we divided between us and consumed in a sandwich with lots of brown sauce to disguise the flavour of the oil.\r\nAfter one hour there was no discernible difference and after two hours we decided nothing was going to happen. In view of this, we decided to walk to the pub for a drink. The walk took about 20 minutes and about 5 minutes into our journey we realised that a subtle change of consciousness was taking place - a growing sense of euphoria, accompanied by excessive smiling - so much so that our faces began to hurt!! As we drew closer to the pub the euphoria rose to a plateau and cars travelling past us left trails in their wake. If I had to use an illegal drug frame of reference, it was very akin to amphetamine and mild LSD. We had a few pints at the pub and smoked a joint back at my friend's flat, which had an incredibly strong effect in relation to the potency of the dope. I went home after this and had trouble sleeping - the taste of nutmeg still incredibly strong in my mouth 8 hours after ingestion. The following day I felt incredibly mellow, though the proper term should really be lethargic, with residual hazy vision and thought. By the next day, I felt normal again. I tried it twice more over the next couple of years (when I had little money) with similar effects (some highly hallucinogenic), but sometimes accompanied by palpitations and sweating, which were less than pleasant. I last took it in 1992 and ceased usage altogether when I read of the carcinogenic properties of safrole. Legal it may be but illegal substances are safer. I read that ecstasy was originally derived from safrole and having sampled ecstasy a few times see similarity in effects - especially the euphoria and sleeplessness. These days I treat my body with more respect with the occasional smoke being my only poison, but I am glad of the nutmeg experience!\n\n\n"
}
