{
 "title": "Big Grin",
 "author": "el_naturale_gal",
 "citation": "   el_naturale_gal. \"Big Grin: experience with Leonotis leonurus (ID 35710)\". Erowid.org. Aug 6, 2004. erowid.org/exp/35710",
 "substance": "Leonotis leonurus",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "sublingual",
   "Leonotis leonurus",
   "(leaves)",
   " ",
   "  ",
   "smoked",
   "Leonotis leonurus",
   "(flowers)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(flowers)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35710",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 6, 2004",
   "Views: 20255",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I remember buying this plant over 10 years ago.  It was the most unusual in the local garden store, and it sought a reasonable price.  I now find out its Wild Dagga.  Spring on the East Coast is bringing on the new growth for this season, a few flowers and some very *stinkin' strong green foliage.  So, I searched deeper into your web-site for others experiences whilst indulging in Lions Tail.</p><p>Yes, I smoke cigarettes, and mj, and love to indulge in a drink of wine most days.  But yesterday, I wanted something different. So I took the best tops of foliage from the plant, and chewed them, just the freshest most darkest green leaves, and what came upon me was a strong flavour similar to mj dusted with * resinous coating.  about 8 fresh leaves held and squeezed around the mouth for 2 minutes.  Strong minty taste...worth holding it in for the amazing relaxant that came over me.  My mind was sharp, my body was relaxed and weightless, my grin grew wider across my face.  I could have controlled it if i wanted to, but the desire to grin further made others look at me as if i had a secret.  My mind was focused, i didnt make note of the time, there wasnt any need to, I lost about an hour in 5 minutes...</p><p>I couldnt keep the secret so I told everyone in the house. My husband was keen to try it, so having previously gathered in a few fresh flowers and dried n cut ready to smoke, I invited him to share it with me...i mixed it with mj, the resin was yellow and potent smelling, i knew the freshly dried flowers mixed with sativa mj was gonna be gooooooD.  Double skinner paper and i put in 9 fresh dried flowers and a nice thick sprinkle of mj.  I lit it, his first puff slightly jolted him back in the chair, he couldnt believe it. We had wine and a few cold beers and watched the full moon rising behind the forest.  Time flew... but the grins couldnt be faded.</p><p>I write this having shared a Big smoke combo sativa+9 flowers.  Awesome.</p>"
}
