{
 "title": "My Possessions Are Links on My Comfort Chain",
 "author": "Lucidistortions",
 "citation": "   Lucidistortions. \"My Possessions Are Links on My Comfort Chain: experience with DiPT & DXM (ID 35736)\". Erowid.org. Jul 14, 2006. erowid.org/exp/35736",
 "substance": "DiPT & DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "DiPT",
   "(powder / crystals)",
   " ",
   "354 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35736",
   "Male",
   " ",
   "Not Given",
   "Jul 14, 2006",
   "Views: 8041",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>That surmounting Tryptamine buzz, it feels like I could cry, laugh, and scream all the same time, some shrug it off as anxiety but I ride it until I'm a metallic slow frame rate of dissociative fear, it begins as a dose of perhaps 25mg of DiPT followed by the ever so foolish 354mg of DXM. </p><p>Fleeing the bounds of text and severed emotion, I put on my hood to travel this hood, nightfall approaching while my father sat at the couch. Our conversation as many evenings before changed rapidly, but this time more set into my future. He was looking for a basis, something to sigh in relief, but the only selfish relief I had was to leave that evening. </p><p>I placed 25mg of DiPT, a minor dose compared to my later that week initial journey of 100mg, but 25mg is enough to make men sound like princes of frogs, women to be flanged angels and children to be chaos-creating siren songs of banshees who reign over shattering my nerves into wishing to be singing among whale songs, not this insectoid aural cataclysm that that dose brings, this would be a taste of that. </p><p>And yes, the taste was quite bitter. Smelling the fall of rain that had already fell, I wished to smell only this as the 4oz generic tussin in my side pocket altered my gait. I set out past this urban wasteland of tolache, drunkards and competition.</p><p>The park was on the horizon by now, it contained a view of the entire town, green in the middle surrounded by desperation, like ants swarmed around one stream of residue. As this thought was taking place the sublingual DiPT enhanced the grin that was beginning to form as children played around in their shared reality/escapes, people kissing, I abhorred it all but found escape here in my own way, acceptance must come to those torn by doubt. </p><p>Settling down behind some shade on the left side, furthest from town, I cracked open this familiar site of thick syrup, not minding anything else but the sole action of soul travel, I downed it. </p><p>Closing my eyes, the usual human action of scrambling around while making wild faces and spitting out spit and chugging down a chaser of about 1oz Dr. pepper took over my human form, but the eternal feeling that these chemicals bring stopped the etching of memory and lead unto just seeing, just feeling, just being. People who witnessed this ghastly act, appeared to be provoked with questions of why, how, and what, but slowly dissuaded when my smile overtook their question. Some had their own accepted intoxicants, any question into morality was to be ignored by me, I had no place in dictating what is right or wrong over them. But this sense of duality was quickly beginning to fade into action, cause, and reactions of certainty. Moreover, uncertainty and its cause were flooding my mind.. </p><p>The sun had left an orange and red in the clouded sky, the typical Indian portraits were reminders as I slumped over in the grass, beer bottles etching the side lines as children ignorant to this adult candy had enjoyed their ice cream. The wailing of the damned ice cream man's hideous song further pushed me to become scrunched up into a ball of nausea and hate, as sounds became slower and slower, disharmonious ice cream men smiled in my after imagery and I grabbed unto the grass hard. </p><p>It was fading away, that sound of spiritual suicide. Children laughed, echoing and phasing, what was this man, a rave? No, this flashing in my vision is from the spatial/movement/balance centers in my brain being inhibited and vacuolated, these rushes of joy and love while my body fought to be either over receptive and forgetful of the area around me eventually lead to just being in the area. I saw it all around me now. This was a water color of frequency unbound by simple matters of relative space, now that all was Is. I couldn't be in a public area in this deep of a state, I thought. As I opened my eyes to escape the thousand petals opening above my third eye, multicolored and figurative, my arms upon my rising seemed to have lifted from the ground 20 times. Eidietic imagery, tracers, and strobing of vision. ++/+++.</p><p>Walking home was a dream. It was dark by now, the barking of dogs took on a Cerberus-like howl, I knew it was the effect of the drug and my own association, but this still verged on lunacy.. The full moon that seemed to be whistling at me as well had no help in this matter. I rushed home. My parents were asleep, thank god. I softly closed the door and set down my hood, In my room I turned on some acoustic. Holy fuck. The sounds were warped like they had been put into a machine that down tuned every note about a full step, like that on a guitar, an added a flange, distortion, and disharmony effect. In this world of disharmony that familiar feeling of laughter and extreme manic sorrow over took me once again, I put on deftones' knife party and was greeted to chino moreno as the frog king and the guitarist as a bee about to become his lunch. I couldn't stand for this lack of harmony as a guitarist. I went into silence. And now darkness. </p><p>The disharmony was fading as the familiar onset of tussin space's synthesia-patterning visuals greeted me, I let myself merge into these cracks in the wall, Fleeing ever so higher into this opening opium pod of familiar uncertainty, a whirlwind reminiscent of salvia's fragmentation overtook me. This was no ordinary space. The cracks in the wall were that of fragmented after-imagery of my room turned into symbolic giger-esque relation of how I have acted this week, my anxieties played into the landscapes this took part in, the characters being my thoughts traveling these landscapes in almost a war-like fashion. I was battling for acceptance of my own self, I thought. The sound distortion no longer had part, but DiPT is not merely an aural drug. Its emotional outlet is invaluable for this continual dexer, and allowing emotion to take part in the visions was amazing. I faded out my trance like I was rising out of the sand, molded by my memory and associative environ into what I call my 'self' today. It all took on a different light. And so did the flanging bathroom light that abruptly came on. </p><p>I threw up violently after hearing deep frog laughter coming from the house next door. It was cathartic beyond compare. I came to one more conclusion during this trip.</p><p>My possessions are links on my comforting chain of oppressive governing. And I accept it only to understand how it effects me using these sacraments.</p>"
}
