{
 "title": "A Journey Inward",
 "author": "Cosmic Charlie",
 "citation": "   Cosmic Charlie. \"A Journey Inward: experience with LSD & Cannabis (ID 35767)\". Erowid.org. Mar 6, 2007. erowid.org/exp/35767",
 "substance": "LSD & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:00",
   "3 hits",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 3:30",
   "1 hit",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35767",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2007",
   "Views: 4278",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThis experience happened yesterday and I believe that it has had and will continue to have a positive effect on my life.</p><p>It was the day of The Dead concert. I knew what kind of people went to those shows, this not being my first dead experience, and I had saved my money for weeks before hand. I had a total of $130, and I was hoping to spend it all on some tabs of acid.</p><p>It was me, my friend Rob, his dad and my other friend Mike. Out of the 4 of us I was the biggest Dead-head. On the way to the show we smoked a couple bowls and enjoyed a pleasant ride. When we finally reached the venue it was about 3:30, with 2 and a half hours to kill in the parking lot.</p><p>If you've ever been to a dead show you know that the parking lot is the place to be. All the while I was hopeful I would score, but I was really just happy to be among my fellow dead-heads. Well, 2 and a half hours flew by and we entered the venue. I now had $120, having given $10 to a homeless person.</p><p>The concert began and I had a hell-of-a time. We all danced, sang, smoked and smiled. They finished the 1st set with Casey Jones, a HUGE crowd pleaser. As we all sat down on the grass waiting for the next set I heard a faint voice in the distance. 'Doses, Doses, LSD.' I saw the chick who was selling it and stopped her. Before I knew it her partner was next to me and I was buying 3 hits of liquid LSD for $20. She put the drops in my palm and I lapped them up.</p><p>Rob watched in some-what of a stupor. The moment he was waiting for had passed him by and now I was dosed and he wasn't. Mike wasn't really interested in acid, but he just wanted to fuck himself up as much as possible that night. Rob finally snapped out of it and ran for the girl, but she was gone.</p><p>The 2nd set started. I was waiting very anxiously for the first signs. Though this was my 1st acid trip, I had researched it for the past 2 years and knew everything about it, with the exception of first-hand experience. Acid's really hard to find. </p><p>I felt the anxiety, the pressure in my pelvis, the little twinkle to the lights. It was REAL acid! Things got more and more magical as the time went on. Up in the sky I saw hundreds of butterflies flying in the dark, and I knew I was safe. I could see with great clarity; every piece of trash on the ground, the intricate patterns on people's clothes, everything. That's when I heard it again.</p><p>'Doses, doses.' Rob was all over the guy. He bought 3 drops for $30 and he bought Mike 2 hits. I bought another one and the guy, who was completely fried, sold some acid to the people behind us. But before he could move on Rob bought another drop. The total now being: Me, 4 hits. Rob, 4 hits. Mike, 2 hits.</p><p>The concert ended and we made our way to the car. The acid they had gotten hadn't kicked in yet, and neither had the extra drop I bought. From here the car ride turned magical.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>I kept feeling these surges of pleasure rocketing up my spine. I had NEVER experienced something like that before. It was 5 times more pleasurable than any orgasm. I was beaming with love and happiness. The dead played an awesome set and I was on my first acid trip, it was truly a magical night.</p><p>BAM! The acid we all took kicked in. The center console on the dashboard turned into kaleidoscopic lights. Everywhere I looked I saw kaleidoscopes. Then I remembered that acid is a sacrament, and I closed my eyes. Into my head I went, hundreds of miles away. Hurtling forward in not only the car but in my head. Patterns and colors swirled behind my eyes. My spine was a-blaze with orgasmic fire. My ego was completely dead, and there was no fear, no panic.</p><p>We got home and Rob's dad and Mike went inside while me and Rob tried to get my Cds out of the car. When we emerged I looked up at the sky. 10,000 stars were twinkling up in the heavens. We ran inside only to go out on the back porch to star-gaze.</p><p>The sky was covered in millions of stars. Connecting them were the outlines of constellations I had never seen before. Stars were shooting in every direction. I don't think I will ever forget the beauty I saw in the skies that night.</p><p>We finally went inside after we thought that a dumpster under a streetlight was plotting against us. Of course we weren't truly scared, we were just re-claiming the innocence and wonder of early childhood.</p><p>Inside Mike came downstairs and we stared at the floor's amazing grooves and markings. But we knew we had to get upstairs to listen to sitar music and to smoke a little pot. Upstairs we each sank into our own chairs and filled the CD player with the spiritual sounds of Ravi Shankar. Closing my eyes I journeyed inward. Explosions of pleasure ripped through my body and the trip turned spiritual. </p><p>The evening wound down and we all fell asleep. I woke up at 9 in the morning having only slept 3 hours. I called my mom to let her know I was OK and I plopped on the couch. I was still not completely in my body at this time but I wasn't hallucinating anymore. Emotions were very deep and extraordinary. Looking back on the evening that had just happened I found myself crying with such joy for how right things had become with the universe.</p><p>Everybody woke up and we went out on the back porch so they could smoke a cig. The cloud cover overhead was beautiful, but I noticed something even more special. Straight above me was a HUGE rainbow. I asked the others if they saw it and they did, so it wasn't my mind! I really believe this was a sign of peace and happiness from the cosmos. I was so overwhelmed with the beauty of it all that a single tear rolled down my cheek.</p><p>After that I went home, showered and went to sleep for a couple hours. I awoke feeling refreshed and cleansed at 7:30 tonight. Last night's experience was very life-affirming, embracing, and beautiful. I am left with a profoundly uplifted spirit and a heart filled with love and compassion.</p>"
}
