{
 "title": "Regretful Reflections",
 "author": "Bengt",
 "citation": "   Bengt. \"Regretful Reflections: experience with Dimenhydrinate (ID 35765)\". Erowid.org. Jul 28, 2007. erowid.org/exp/35765",
 "substance": "Dimenhydrinate",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35765",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2007",
   "Views: 11621",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOf the many drugs I have experimented with, I believe that Dramamine was probably the most detrimental to my health. The 'buzz' is exactly how it's explained to be - delusional, confusing, exhausting, and I forget every bit of it. There's no benefit of any matter that I would expect a 'trip' to provide. It isn't psychedelic, it isn't introspective, it isn't anything. Physical and mental zombification. I'm literally incapacitated and delusional for however long it is before I pass out into an extremely uncomfortable sleep. <br>I've tried it maybe a total of four times, increasing dosage with each experiment. Each time I hoped that if I just entered with a different mindstate that I could benefit from the effects but each time it was the same. If I was lucid enough to be aware of my physical body, the experience was ruined by the intense discomfort in my legs, like the bones were trying to grow larger than my skin would allow. If there was any interesting part of the experience, my brain was either too fucked up to actually process it or I would forget it within 5 seconds anyways.<br>Coming out of the experience, dramamine left me feeling mentally/physically fucked up for long periods of time. Inability to concentrate, increased depression, decrease in short-term memory. I used to have a really small case of athletic-induced asthma and after using dramamine my asthma became noticeably worse to the point of not being able to smoke and using a preventative inhaler medication. I would wake up the next day wheezing and it felt like I had just smoked a carton of cigarettes while running a marathon.<br>Watching someone under the effects of dramamine is almost laughable if it wasn't so pathetic that I feel sorry for them. If they're able to walk, they stagger around completely oblivious like a zombie. If they can talk, it comes out as incoherent mumbling. Most of the time, they sit with a blank half-stare and every couple of minutes have a full-body muscle spasm that looks like a seizure. You can't communicate with them, they're completely brain-dead. This might seem like it could put a person in a high-risk situation but I would bet 9 times out of 10 a person under the influence won't move from the spot that they were in when the drug really started hitting them. <br>So why did I do it? It was cheap, I was young and adventurous and stupid. I didn't have as much experience with or access to MUCH better and more gratifying psychedelics. In my opinion, don't even risk it. There is absolutely no benefit to the high, and the effects it had on both my mind and body make it one of the few things I regret ever doing.\n\n\n"
}
