{
 "title": "My Own Birth",
 "author": "Zoink",
 "citation": "   Zoink. \"My Own Birth: experience with Alcohol & Cannabis (ID 35784)\". Erowid.org. Feb 15, 2007. erowid.org/exp/35784",
 "substance": "Alcohol & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "4 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "4 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35784",
   "Male",
   " ",
   "Not Given",
   "Feb 15, 2007",
   "Views: 11080",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Sunday, the Dave matthews concert. After arriving, we find a lawn spot and chill out. I take about two hitters of MJ, and maybe 4 or 5 shots or vodka. This put me in a pretty happy go lucky state, and I could easily distinguish the different effects from each substance. After a few hours, this started to wear off. We made our way to the gates, and I had maybe another four shots. I hardly felt this. As the opening bands played on, I had a few cigarettes and more hitters. Also some more shots, and a few beers.</p><p>It began to come to me. As soon as guster started playing, I began laughing. Everything was funny. I could not stop laughing, no matter what I did, how hard I tried. I was sitting down, and put my head between my legs in a semi-fetal position, and just laughed. Occasionally I looked up when someone talked to me, which made me laugh more. I just could not stop. Soon enough, my world as I knew it began to swirl, and I was begining to SEE the music, though my eyes were closed. The music swirled about, in the sky, through people, around my head. </p><p>After having one foot in the water of this new reality, a pang of nausea hit. Not so much nausea, but a erupting feeling, which obviously came out in the form of multiple occurances of vomiting. This didn't feel great, so I remaining in the fetal position, oblivious of the outside world. Slowly, the elements that consist of my humanity began to dematerialize. In my new world, I watched my brain slowly break apart, as if it were some picture on my computer, and pixel after pixels just broke off and dissipated. First went my non-essential emotions, anger, fear, jealousy, dismay, apathy. These were first, and where I was, were non-essential to the human exsitance, and if anything, made things worse in a world that could be perfect. Next, comprehension of sight, sound, and feeling left me. Next, happiness, love, excitement, and energy left me. Slowly, as my brain de-pixelated, my body lost its essence, and I became nothing but an empty shell.  All I had was my basic motor skills, which were not so great either. </p><p>I was nothing. I had been deconstructed. My brain, my body, my soul, my essence, and my humanity. The world meant nothing, and I sat, head between my legs. I should have been scared, but fear was not even an emotion. Emotion did not exist. This was the core of being. This was it, the center of everything. </p><p>I pondered this alternate universe, and explored what I was. What I was, my past, my present, meant nothing. I looked up, and around. Now everyone was standing, but this meant nothing. It mean nothing in a sense that it did not make sense to me, and I could not comprehend the point of standing, of being, of dancing, or kissing, or even the point of names, clothes, hair color, height, width, or the indivdual character that we all are. I did not know what confusion was, so it meant nothing. There was no way I could respond. I put my head back down. </p><p>Slowly, my core senses began to rematerialize. Sight, feel, and sound was slowly starting to come back, and had an increasing feeling that it should mean somthing, that I should be reacting to it, but I still did not have my emotions. I began to notice people around me. People were trying to comfort me, and hugging me, telling me it would be fine. One girl in particular, who I did not know, was very helpful. She told me I'd be fine, and held me from time to time. I was not scared, but everyone must have assumed I felt like crap and drank too much. I was not scared, and in fact, was begining to understand my mental trip. I also noticed people stepping on me, tripping over me, and even I kick to the ribcage from someone. I could tell I was kicked, but pain did not exist, yet. This is when it began to really come back. I felt angry. Not that I was kicked, but that someone dare ruin my mental voyage with a careless swing of their leg. </p><p>My energy came back. My motor skills began to come back. So I stood up. I looked around, like a newborn. Wow. I just could not understand all of this. I looked at the stage, at the lights, and at the screen. Wow. I looked around at people dancing. I noticed girls with guys. One in particular, entangled in his arms. I always like this girl, but now, it did not matter. I did not understand why they danced, or why they kissed. Some of my emotions came back, but the non essential ones did not. They just danced, and I knew, that normally I would be mad, but now I didn't care. It was bliss in the form of pure ignorance. I remained standing, and closed my eyes. Again, I could see the music in such forms and colors I was astounded. My sense of belonging did not exist, and I stood, gently nodding my head, one with the music. The CEVS continued through the concert, and I slowly began to get into it. I danced, and sang, but I was still coming back from wherever I went, and was not yet grounded. </p><p>I missed a chunk of the concert, sitting in the fetal position and in my own world, and was somewhat remorseful, but I beleive that what happened mentally was so positively insightful that it outweighed that in value. To others, I might have just looked like I made a fool of myself. But inside, I was reborn.</p><p>After the harsh breakdown of everything I was, I was born again, as an empty shell. Much like an infant, I did not know how to react to this weird world, and did not know of emotion past that that was neccesary. I had to look, live, and learn everything again, and rebuild myself, to come back to the world I know.  To break down the human mind this much, I could better understand how we work and why we think what we do. And though this probably took quite a toll on my body, I have been reborn, and feel great. </p><p>I have never had such a reaction from just alcohal and MJ together. This was more of a trip than a high or drunkeness. CEVS and very minor OEVS. It was very insightful, but the intensity and vomitting are not something I would like to repeat but whatever. Party on.</p>"
}
