{
 "title": "I Give it a B Minus",
 "author": "Duke Durden",
 "citation": "   Duke Durden. \"I Give it a B Minus: experience with Nutmeg (ID 35807)\". Erowid.org. Jan 21, 2007. erowid.org/exp/35807",
 "substance": "Nutmeg",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "4 nuts",
   "oral",
   "Nutmeg",
   "(capsule)",
   " ",
   "7 nuts",
   "oral",
   "Nutmeg",
   "(capsule)",
   " ",
   "9 nuts",
   "oral",
   "Nutmeg",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35807",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 21, 2007",
   "Views: 37439",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I should begin by saying that I take Zyprexa for bipolar disorder.  Unfortunately, Zyprexa is also an antipsychotic, so my tolerance for certain hallucinogens is sky high.  As fate would have it, I also love to trip.  This is a problem.  Thus, I have been searching for drugs that can put their effects past the medication.  Some drugs that work are salvia, weed, dissociatives, amphetamines, opiates, nutmeg, and pretty much any other non-hallucinogen.  LSD, mushrooms, and similar drugs either dont work at all or only work in extremely high doses.  As I understand the situation it is physically safe to do the doses I list in the main body of the report, but keep in mind that your experience will likely be much more intense than mine at the same dose.  Everybody reacts differently to every chemical.</p><p>That said, here are the accounts of my first few experiences with nutmeg.</p><p>||| Experience 1 -- 4 nuts (17 grams) |||</p><p>[6:45pm]  Ground up 4 whole nuts (approximately 15 grams), put them into 50 capsules, and downed them with a Coke and some Gatorade.</p><p>[7:15]  Feeling  bit euphoric.  This could just be excitement and anticipation, though.</p><p>[8:15]  Still just a bit euphoric, but no other effects yet except some pleasantly nutmeg-flavored burps.  I am drinking lots of Gatorade, as I read that it helps with the hangovers sometimes caused by nutmeg.</p><p>[8:45]  Feeling light waves of something inexplicable.  I think the nutmeg is kicking in.</p><p>[9:05]  I feel slightly inebriated, like I had taken maybe a hit of weed.</p><p>[10:00]  Every once in awhile I get a nice wave of euphoria accompanied by a great body buzz, but after about 60 seconds I return to baseline.</p><p>[10:45]  Instead of waves it is pretty much constant now.  We smoked a big joint of Dragon Smoke herb blend (primarily Damiana) to heighten the mood further.</p><p>[11:00]  I am beginning to feel waves of something powerful.</p><p>[12:30am]  We just got back from Waffle house.  My friends heavy metal that we listened to during the car ride engulfed me, although normally I would have been indifferent to it.</p><p>[3:00]  We just watched Waking Life, and my God I swear I understood that movie on an intuitive level I had never experienced before, even though I have seen it countless times.</p><p>I felt mildly stoned the rest of the day.  No hangover whatsoever.</p><p>||| Experience 2 -- 7 nuts (28 grams) |||</p><p>Ground up 7 whole nuts and packed them into 58 capsules.</p><p>[12:30pm]  Dropped all 58 capsules over the course of 10 minutes.</p><p>[2:30]  Felling very euphoric.</p><p>[3:00]  The euphoria has subsided; I think the nutmeg must not have kicked in yet.</p><p>[3:15]  I am beginning to get nice waves.</p><p>[4:45]  This feels almost like the beginning of an acid trip.  Colors are brighter and my vision is sharper, almost hyper-real.  My eyes, mouth and throat are very dry.</p><p>[5:00]  I see patterns on all of the walls.  As I stared at my bedroom door, a blue and green tornado of bright spots appeared and whirled around for a few seconds.  I feel a bit stoned in general.  I see barely visible trails if I concentrate on it.</p><p>[5:15]  This light trip continues to increase in waves.  The patterns are a bit brighter.  I feel a little drunk or high or something similar.</p><p>[5:45]  I feel markedly stoned.</p><p>[6:30]  I hear piano music for some reason.  I think it may be my first aural hallucination.</p><p>[7:15]  Life feels more like a lucid dream than reality.</p><p>[8:00]  My appetite is apparently endless.  I remain very stoned.</p><p>[9:00]  I find it very easy to construct elaborate scenes in my head.  The images on the TV seem made of leggos.  The patterns are even brighter. I feel like Im on acid and very high at the same time.</p><p>[10:00]  Sex is greatly improved in this state, much more satisfying.</p><p>[11:00]  Still very stoned.  The patterns on the wall are as bright and colorful as ever.  I keep getting lost in the TV shows; I just zone out and lose awareness of anything outside the program.</p><p>[12:45am]  I feel now as if I just smoked a bowl of swag; very tired, dry red eyes, dry throat, and slight headache.  The patterns are, if anything, brighter.</p><p>[6:00pm]  Almost baseline, but I feel very chilled out and the patterns are just barely visible.</p><p>[7:30]  No patterns, but very chilled out.</p><p>[11:45]  Baseline.</p><p>||| Experience 3 -- 9 nuts (35 grams) |||</p><p>[8:00am]  Downed 9 ground nuts in 66 capsules and went back to sleep.</p><p>[3:15pm]  Finally getting some waves.</p><p>[4:00]  I feel generally high.  Not very intense.</p><p>[4:45]  Colors are brighter, vision super-crisp.</p><p>[6:15]  I now have a horrendous headache.</p><p>[9:15]  Still moderately stoned, head still pounding.  No patterns this time.</p><p>[11:30]  I keep getting zoned out watching TV.  The headache is gone.  Blobs of color seem to cover the walls.  There is not a noticeable difference between 7 and 9 nuts, aside from the headache.</p><p>||| Experience 4 -- smoked, 1 bowl |||</p><p>No apparent effects.</p><p>||| Experience 5 -- insufflated, .25 nuts |||</p><p>No apparent effects.</p><p>Overall, I give nutmeg a B minus.  Its nice, especially for a legal, cheap drug, but its really not that fantastic either.  I think that drinking lots of liquids helped prevent hangovers, because I did not experience a single one.  Supposedly nutmeg is active when insufflated, but I could not force down more than a quarter of a nut, which may not be enough.  I do not recommend eating more than 7 nuts; the effects were not any greater with 9 nuts, but I did experience a horrible headache which was not present with 7 nuts.</p><p>Have fun and be careful.</p>"
}
