{
 "title": "Pillar of Thought, Mother of Mind",
 "author": "Just-ice",
 "citation": "   Just-ice. \"Pillar of Thought, Mother of Mind: experience with Salvia divinorium (extract) (ID 35834)\". Erowid.org. Jul 28, 2007. erowid.org/exp/35834",
 "substance": "Salvia divinorium (extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 35834",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2007",
   "Views: 6840",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been altering my mindstate for as long as I can remember. When I was young I would spin in circles, lay on my back, and watch the sky toss back and forth.  I've found I'm a natural at altering my mind without the use of plants, and that with them I'm keen to learn thier ways.  The most helpful and varied of the plants I've tryed so far is Salvia divinorum.</p><p>I've taken salvia now for about three years.  When I say 'taken' I mean once a month, skipping a month, rarely more than that.  I find it hard to make myself take more, because, I think, I know it will change me for a while.  Most of the reports I've read have mentioned the experience lasting from minutes to hours, smoked, but have failed to mention any lasting effects.  It is the lasting effects that I would like to discuss here.</p><p>I've yet to try a tinicture or chewing and have only delt with the smoked effects.  For me these effects are usually quite mild in regards to visuals, entities, or extatic experiences, but very vivid are my thoughts, feeling, and especially memories.   There was only once, which I won't get into now, when I left my body in an ocean of stars and traveled to a place with many entities all talking at once in thier native languages.  So, I do appreciate this plant's ability to evoke such travels.  However, as I've said, for me it's a rare event.  It's the lasting effects which interest me more than the experience it's self.</p><p>When I smoke I take about one to three lungfulls of enhanced leaf.  I greatly recomend using enhanced leaf it's 'cleaner.'  I lay still on my back hands at my sides and concentrate on my breathing.  Very quickly I feel my body become intensly sensitive, and any desire to move or do anything fades.  I sometimes see dots of light, but usually I dream.  There's a voice and a definate presence during the experiece; the presence of the female spirt of salvia.  Memories are brought before me, mostly from childhood, and the clarity of these memories is astounding.  Events from the age of five, which I didn't have even a single mental image, are shown to me in COMPLEATE detail.  This 'time of remebering' is brief, usually about an hour, but the lasting effects continue, depending on my willingness, for another few days to a week.</p><p>The change is hard to discribe, and is far from subtle.  Why I haven't heard tell of it I don't know.  My memory and cognative ability is increased for may days.  Anything to do with numbers becomes absurdly easy.  And I find my emotions become in the days after smoking deeply grounded.  Ordinarily my sense of direction is terrible.  I was shown one day, the day after an experience, that I can call up a 3-D map of ANY area I've EVER been and fallow all the paths from where I am to my destination.</p><p>Many of the effects take practice, and aren't caused by the plant but rather are done by me with her help.  For example, she has shown me that it is possibe to see, with your eyes, great distances away.  A bird in a tree a hundred yards away can appear, at will, as though seen through a telescope.  Or, as I walk down the street I'll become aware of a conversation I had with someone along the same path I now tred from years ago.  The most important part is will.  One must believe that such abilities are theirs to begin with for the path to be revealed to them.</p><p>This is truely a most remarkable herb.  The most profound I've seen so far.  Mary Jane has been a good friend in many times of need, but has never in the wildest hash dreams given the level of clarity from one hit of Salvia.  Mushrooms have shown, do show, worlds and thoughts I would have never dreamed otherwise, but for all the ways they change me, never have they hit so near the core of my being as Salvia.</p><p>She has great power and keen eyes.  Seen by the right person she will show abilities latent, memories thought long gone, hang-ups which need your attention, and a profound connection to your own body.  Usen wisely, you will be satisfied.</p>"
}
