{
 "title": "New Person",
 "author": "expers",
 "citation": "   expers. \"New Person: experience with Nicotine (Gum) (ID 35860)\". Erowid.org. Jun 5, 2009. erowid.org/exp/35860",
 "substance": "Nicotine (Gum)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   "buccal",
   "Nicotine"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35860",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 5, 2009",
   "Views: 17060",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>All my life I've been told how addictive cigarettes are, and how they'll cause this or that disease. Consequently, I always avoided them during my teenage years. Around age 20 I experienced a severe heartbreak, and I made my first attempt at smoking. Immediately I felt calm and good, like everything was okay. I only smoked that one pack--I hated the way the stink accumulated on everything--and by the time I got to the end of the pack something in me could 'taste' some poison in it, which made me feel sick after even a single puff. I used cigarettes in this way in subsequent years, as an antidepressant during periods of turmoil in my life.</p><p>In the past two months I discovered nicotine gum (Nicorette). It's everything I could have hoped for. It provides me with the buzz and calming effects, which seem to last days afterward, without any fear of major health problems or stink. It's also much cheaper than cigarettes. I usually buy the 4 mg gum and cut it in half; not as much fun having less gum to chew, but it provides the same hit. The 2 mg gum really seems like a money-grab; they even specifically warn on the 4 mg gum package not to cut it in half, as if there's some valid medical reason for this. I feel like it's given me a throttle to control both mind and body energy levels. I can instantly shift gears to new highs or lows. That power has had a very 'normalizing' effect on me: I'm typically a very low-energy body, high-energy brain person, which accounts for my laziness and depression (a consequence of over-thinking). The nicotine seems to slow down my mind, turning off the lingering thoughts that cause so much anxiety and depression while at the same time speeding up my body, giving me newfound stamina and strength.</p><p>I still fear addiction and tolerance. I've been intentionally keeping my dosage down to 2 mg in the morning, and sometimes 2 mg at night, taking days off here and there. I'm not sure how this will work in the long run, and whether addiction is unavoidable with regular usage or not. However, I think it is a fair price to pay for this marvelous drug. Also, the nicotine gum has the added advantage that its peak hits at about the half-hour mark, as opposed to two minutes or so with a cigarette, decreasing its addictiveness and tolerance and offsetting the psychological addiction. The gum tastes neutral; there's no sensory imprinting like with cigarettes, where I begin associating smells and tastes with the effect or with the fulfillment of craving.</p><p>I've found 2 mg is the best dose for me personally. I've tried 3 mg, which gives a better buzz, but it also causes some mild to strong nausea and lightheadedness for about an hour. And 4 mg is an amazing feeling, but the pain is not worth it for me (half an hour of extreme pain, and another half hour of mild pain), although I suppose it's a small price to pay compared to alcohol.</p><p>I feel like a new person. I've always envied people who were calm and collected, and now I feel this drug has somehow given my brain what it's needed to normalize things out. I've grown to love it.</p>"
}
