{
 "title": "Getting in the Way of My Beauty",
 "author": "Justcuzyoufeelit",
 "citation": "   Justcuzyoufeelit. \"Getting in the Way of My Beauty: experience with Mushrooms (ID 35902)\". Erowid.org. Mar 6, 2007. erowid.org/exp/35902",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35902",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Mar 6, 2007",
   "Views: 2803",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first time doing shrooms. It was a very hot summer day, about 90, but dry and beautifully sunny.</p><p>I wasn't too nervous because I had two of my closest friends there and my boyfriend, Joel, was trip-sitting. I chewed a cap and then decided I wouldn't chew them anymore. I chopped them into smaller pieces and swallowed each piece individually with apple jucie. My girl friend, Cathy, chewed all of hers up in one giant mass and my gay friend, Sam, chewed a bunch and drank a mug of shroom shrapnel tea. These different methods would attribute to the onsets of our experiences. </p><p>We had planned to go to the Arboretum/Park/Playground that spawned beautiful green miles and overlooked the city. It was Cathy's car we were using, but I didn't want her to drive. 'She'll be fine,' Joel said, 'It doesn't set in for like a half hour.' Ten minutes into driving she couldn't feel her feet and we decided to let Joel drive.</p><p>We turned on the soundtrack to Aladdin insanely loud and I felt very important, like I was the one they were singing about. I couldn't help from signing and laughing. This is when the insane laughter started. We stopped up at the park and started walking down a trail, the heat was bothering me less and less. I found a huge seqouia tree and the sensation that I wanted to touch it and be friendly towards it grabbed me. I figured it was placebo.</p><p>Then I see Cathy, standing in the midst of a bunch of mole hills. She's looking down at them and her mouth is dropping wider and wider. 'They are moving!' It is noon, the sun is bright gold, and I am upset because nothing is doing that for me yet. I walk behind with Joel, who seems semi-excited that they aren't working for me, they hadn't worked for him the day before and he had been very disapointed. </p><p>We jump down a huge hill and I realize that it is getting very hard for me to move properly. My brain feels very clear however, and everything is fun to look at. We decided to go to the playground, so us three shroomers (Cathy, Sam, and I) wait while Joel got the car. This is when I noticed the shrooms. I looked down at the bark and it appeared to be moving. It was so real to me that I literally thought it was acutally doing that, and I kept asking who was rolling the log. Of course they weren't, they were laughing hysterically, as was I. We laughed for what seemed like hours and then Joel appeared in the car and we all jumped because it was scary.</p><p>He drove us down to a viewpoint where Cathy attempted to buy a snowcone, but couldn't, because she was laughing too hard in the woman's face. Joel bought it for her. It was bright yellow passion fruit, and the most beautiful thing I'd ever seen, it was glowing from the inside and I didn't want to eat it - but when I did, I felt a huge connectedness to it's beauty.  A bunch of old people sitting near us, I was sure, knew we were absolutely nuts. I was drinking out of the water fountain and feeling like I was a part of it, like I was connecting my blood through it. </p><p>We walked down to the playground and this is when I knew I had plateued at the highest place I would be. Everything was SO BEAUTIFUL. I went down a blue tube slide and felt like I was being born out of it. I was curled up at the bottom of the tube,  the top of it was covered with shadows from the trees, which melted. I yelled for my friends to come look, it was so beautiful. </p><p>Then we moved down to a covered picnic area, which had a mosiac racoon on the side of it. I layed down next to it and looked up, where I could make it's eyes melt together. Then we went down to a grassy area with sun splashed all around. It amazing. I loved the sound of my own voice. I understood nature and the reason for living. Sam and I were verbalizaing our feelings the whole time, and I realized I was coming down.  But while lying there I kept getting this feeling of an overwhelming beauty that was strangling me, that choking feeling I get when I get really into a song and tears pour down my face. I felt like I was sinking into the sunlight. It was to beautiful, and I knew that I could further immerse myself in it but that it would be so beautiful I would die. I was laughing so hard that I said, 'Guys, your emptying my laughter box. If it is completely empty, I will die. So stop making me laugh about a goddamned squirrel that crossed the road!'</p><p>At this point Joel came back (he had left to drive a friend home). His skin was like mother-of-pearl, or the surface of oil. The greeness of everything was bleeding into his normally intense eyes and I felt like he was a wood nymph, or like Peter Pan. But I could tell he was upset. And that wasn't what I wanted. At some times I would feel the most overwhelming love for him and it would be so intense, other times I'd feel absolutely nothing and almost forget who he was to me. </p><p>'If your upset, just go home!' I kept saying over and over again.</p><p>He walked out to the middle of a nearby soccer field, and I followed him. He was lying there shirtless, and I kept recognizing familiar things about him and realizing he was the link to the outside world and it wasn't what I wanted. He tried to hold me to him, but it was too, too weird. It made me understand just how fucked up I was, that something so ordinary and routine had become so foreign and surreal. Same with kissing, I felt like I was falling into the blackness of his insides.</p><p>I found a piece of foam in the center of the field and got very angry at it, saying that it was 'Getting in the way of my beauty,' and I threw it. Afterwards I said, 'You know whats funny guys, is that if I had looked long enough at that foam - I would have found something special and beautiful about it and wanted it to stay. But I just threw it and now it's abondoned and lonely.' </p><p>The trees were amazing. A myraid of green and yellow shifting squares always moving, always shifting. Joel later yelled at me for 'putting words into his mouth' which was the SCARIEST thing, I'd ever seen in my life, despite him chasing me earlier on (I forget to write about that, he was playing around with us.) Cathy and Sam both looked at me, also terrified. </p><p>Rolling through the grass was the most amazing sensation I'd ever felt. I felt like I was being unrolled from a giant blanket. Mmmmm. Then we fully came down and Sam and I had the most amazing conversation about life and drugs.</p><p>It was, bar none, the best drug experience of my life. Maybe even the best 'experience.'</p>"
}
