{
 "title": "Crossing Borders",
 "author": "Blind Squid",
 "citation": "   Blind Squid. \"Crossing Borders: experience with Heroin (ID 35928)\". Erowid.org. Feb 27, 2007. erowid.org/exp/35928",
 "substance": "Heroin",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "IV",
   "Heroin",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35928",
   "Male",
   " ",
   "Not Given",
   "Feb 27, 2007",
   "Views: 37534",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I came about drugs in the strangest of ways. I guess I used to think it would be unimaginable for me to even smoke pot. That was the 'big evil.' But now as I look back I believe it was inevitable. I love my mind. I love it so much. I love searching the depths of it. I was a child prodigy in music, and I experience overlapping of the senses. When I hear music, I see colors as tangeable as the computer screen in front of me. As I grew up, I spent so much time alone, and being creative. I had to. It was compulsive.</p><p>But when I first tried pot, suddenly my mind was opened to a whole new world of colors, and music that was sensational! Since then my friends have passed different drugs around such as the white turkeys, coke, shrooms, but none of them did heroin. The thought of trying that would make me stand out, or maybe different. I really don't know what drove me to want to try it. I have read all the shit on the net about what it does and it seemed like it would be a great experience.</p><p>It was a saturday night. My friend james and I decided that we would go to juarez. He and I went through some rough times on the street together. It was actually my first time to walk across the international border. It was creepy at first cause all the Mexican grafitti covers walls saying 'kill whiteys, send them back to england.' The good thing, (since I am not 21, only 20) about juarez is you can chill and have some beers and no one bothers you about age. James told me at the bar that he was moving to juarez, and he wanted to show me where he was moving to. We went. The place was a brothel run by an older couple. James said 'any kind of shit you might be looking for, these guys can get it.' So I tested his statement and when the old woman asked what I wanted, I said: 'Yo quiero la heroina.' </p><p>She nodded. She demanded five dollars, and said she would be back in a few minutes. I gave it to her against my better judgment. I honestly thought she was going to run away with it. But then its just five bucks and hey, it helps someone in need. I shrugged it off. But she surprised me. She came back and handed me a rolled up piece of foil, diameter about one fourth of your thumbnail. She handed me a needle that was in the package, so I KNOW it was unused. She took me and James to her private room where I could get high. We went, and James sat flirting with some girl that lived there.</p><p>When I unraveled the foil, it was a sticky lump of shit that smelled POTENTLY like vinegar. That is called Mexican black tar. They stopped as they watched me boil it in a spoon with some water. Nobody in that room ever did heroin. I was the only one doing it relying on what I saw in pulp fiction. I got out the syringe and sucked up some of the solution, and shot it up. It kinda stung when I shot it, but that sensation dissappeared within 30 secs. I was so smacked out it wasn't even funny.</p><p>Suddenly I was withdrawn from everything. A wave of heat consumed me so strong. I was so comfortable, and so happy. I felt like a super star, kinda like everyone was in the room cause I was there. I was the cool one cause I did heroin and the others were pussies. I could have been robbed, shot and have my id cards taken, all that crazy shit that happens to americans that go down there after dusk. But I simply didn't give a fuck. I felt so good. Nothing could go wrong.</p><p>We left just afterward to find another club. I felt like cameras were watching me as me the big hero was walking down the street. I felt like a bridge, as I was the first to cross the borders, and now that I knew where to find heroin, I could be other people's bridge. I felt important. I felt liked. Things I haven't felt much in my life.</p><p>We sat in a bar, and I stared at balloons and, don't get me wrong I didn't trip out or anything, just focused. At the moment I could see how the balloons could be having a conversation if only they could talk. Then I imagined what they would be saying, and how I could fuel a conversation. I was talkative for a minute and suddenly silent and then suddenly talkative. My mind wondered everywhere over the strangest things. Music that was played in the bar was an instant conversation. Suddenly tones along with those colors I always saw became words, and chords had personalities allowing me to dig to depths of my own sense of expression that I had never before been to. </p><p>Coming down. I itched after six hours of shooting up. Everywhere in my body it felt like the creepy crawlers were racing under my skin. That didn't last but an hour. After that I was home and passed out. It took me three or four days to fully come down off of it, or so it seemed. I had mild sores. Basically I just felt very drained physically, mentally and emotionally. I was lazy and just wanted to rest. After those couple days, I felt normal.</p><p>I had a great experience. I don't, however, encourage anyone to try it. That is your own choice. If you do decide to try make sure you know that is what you want to do. I, personally wouldn't do it again, cause I enjoyed it way too much the first time. Its been about a month and a half now, so I don't think I got addicted.</p><p>Blind Squid</p>"
}
