{
 "title": "A Country Ride",
 "author": "Gitboy",
 "citation": "   Gitboy. \"A Country Ride: experience with MDMA (ID 35976)\". Erowid.org. May 4, 2007. erowid.org/exp/35976",
 "substance": "MDMA",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35976",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 4, 2007",
   "Views: 2844",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I work the night shift, and every morning I cycle eight miles home along country roads.  Despite my tiredness and desire to get home, the route is always very pretty, and it occured to me one day that I should try it on pills.</p><p>I'd slept at the weekend, which is a rare enough event for me these days, so i was bursting with energy towards the end of the shift, helped by the anticipation of the ride home.  I had with me two of the batch I'd used at the weekend.  Bearing in mind that it had taken me around sixty minutes to come up, and that they hadnt been the best id ever had, I slipped to the toilets fifty minutes before the end of my shift and double-dropped.</p><p>Thirty-five minutes later, I was beginning to feel the pre-rush warnings, and was hoping they wouldnt kick in too early.  I was in the yard at this point, and then suddenly all the colours became fresher, richer, more real.  I returned inside thinking along the lines of 'oh crap' when the kick hit me and then i didnt really care much anymore.  I went back to packing apples with a grin and more motivation than I've ever displayed in that place.</p><p>About five minutes later I got another kick (clearly the second pill had taken a bit longer) and began merrily blethering crap to my coworker, who fortunately doesnt speak much english, so she just smiled politely and ignored me.  I was starting to wonder whether this had been such a good idea after all.</p><p>After the shift finally ended, I got on my bike and cycled round the corner of the warehouse.  And that was when I knew it was worth it.  The sun was low in the sky, filling it with a beautiful golden glow that almost blinded me.  Further up, the sky became a rich, deep blue, a more lovely sky than i had ever seen before.  The clouds, torn by winds, looked almost to be melting as they hung in the sky.  That moment will stay with me forever.</p><p>After a few minutes I got back on the bike and cycled on, admiring everything as I went.  Ocasionally I would stop to gaze in fascination and wonder at the sky, or the shade of a ploughed field, or the architecture of a local pub.  I passed a cemetary on my left, as I do every day, when it occured to me I had never been there.  I found an open side entrance and left the bike leaning against the tree.</p><p>The cemetary was wonderful in the morning light.  The sun burst through the trees, rabbits ran amongst the graves.  At the far end, there was some undug ground and a line of graves facing into the sun and the symoblism of the new dawn.  I filled a watering can in memory of a Martin Williams and watered the wildflowers on a neglected-looking hundred year old grave.  The whole time, I felt calm, at peace.  There was an atmosphere of rest, patience, safety.</p><p>A little further down the road I stopped off at the Pocket Park, which I had also never visited.  Walking amongst the trees I felt completely attuned to my surroundings, completely at one with nature.  I emerged into a small clearing where everything was bathed in the warm yellowish glow of the sun.  Sitting on a bench, I texted my mother to say I would be late home and that I loved her.  Then I texted my sister to say that I loved her too.  I wanted to text my closest friend, but was worried about waking her up.  I shall text her later, when I have written this, to tell her what she means to me.</p><p>After this I continued along the roads, giving cheery grins and 'peace' signs to lorries and other regular road users.  Car drivers never seemed to respond.  I pondered for a while whether the career driver sees his vehicle as more an extension of himself, rather than a barrier against the outside world.  Several drivers waved back, and I wondered if I had made their day better, happier.  This thought filled me with a sense of wellbeing and happiness.</p><p>I stopped a local couple to wish them good morning, but they seemed unsure how to react and disengaged.  I cycled on, stopping frequently to admire each new stunning vista as they opened up.  I had cycled this route so many times and never really seen it, never appreciated it.  Down by the canal I stopped for a while to watch the swans and the fish and the ducks.  I noticed that female mallards, when they spread their wings, have the most beautiful shade of deep purple on some of their feathers.  I thought fondly about and old friend who no longer speaks to me, and resolved to text him later too.  To let him know that although he feels we should go our seperate ways, he has always been a great mate and will always mean a lot to me.</p><p>I ride on into the country park, where again I feel at one with the woods.  I stop and have a lovely long conversation with an old woman and her dog, Rilo.  A truly lovely woman, and a gorgeous soppy dog too.  Riding into my mass-produced village is depressing, so I turn my thoughts to my friends again and recall many fond memories with them.  Then my legs speed up, seemingly of their own accord, I switch to top gear to give them something to push against, and we speed home, pausing only to graciously give way to a car, the driver of whom shakes her head in confused exasperation.  I was only obeying the highway code, love.</p><p>Nobody is home when I get in, but I need to stay up to wish my mother goodbye before she leaves for edinburgh.  I pet my cat for a while.  She knows full well what I've done, and is a little miffed to be left out, so after a while she leaves.  I have a shower - I'd highly recommend this whilst pilling.  Its an indescripable experience, and I've never have felt so clean afterwards.</p><p>And then, of course, I decided that I was so inspired by the experience that I should submit it.  And now my mother is back, so I must go and hug her and tell her how much I love her.  I hurt her too much these days, and apologise not enough.</p><p>-Gitboy :)</p>"
}
