{
 "title": "Didn't Live Up to My Expectations",
 "author": "Highfield",
 "citation": "   Highfield. \"Didn't Live Up to My Expectations: experience with Mugwort (ID 35978)\". Erowid.org. Aug 18, 2004. erowid.org/exp/35978",
 "substance": "Mugwort",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "6 bowls",
   "smoked",
   "Mugwort",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "35978",
   "Male",
   " ",
   "Not Given",
   "Aug 18, 2004",
   "25014",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After word of mouth from my friends and some internet research on this herb, I was eager to try it out.  I have a big interest in the dreaming state and the claims of this herb were good enough to warrant a trial of sorts.  I found a bag of it for sale while on a roadtrip and eagerly awaited nightfall.  </p><p>The first couple of times I had it mixed with some pot but I didn't notice much difference other than the extra smell.  After falling short on pot I decided to just try it on its own.  It was incredibly smooth to smoke, compared to pot at least, it just seemed to roll down my throat.  </p><p>The night i'm referring to I ended up having 6 cones (or 'bowls' for you Americans, as this was the most of it i've had).  I found the experience underwhelming, and pretty dull.  I'd relate it to having one hit of pot, a very very mild buzz.  That wasn't what I was interested in though.  I immediately went to bed, intent on experiencing the wonders of this so called 'dream' herb.  This too was rather underwhelming.  My mind is a bit fuzzy as to the actual content of the dreams I had, but I definitely had more of them (or I just remembered having more of them than I usually would).  The main thing I can remember though is watching my car fall into a river and jumping in after it.  I clearly remember opening the door and hopping into the almost flooded compartment as it sank to the bottom.  When it hit the bottom I somehow drove it around like a Submarine.  Cool stuff.  This was in the context of a bigger plot which involved me trying to escape from an evil camp where they were after me (my dreams ALWAYS seem to contain anxiety, loneliness, paranoia or fear in some form.  Very depressing.)  </p><p>I woke up in the morning quite relaxed and went about my day as I normally would.  It was quite harmless stuff, it was worth a try but it definitely didn't live up to my expectations (Lucid dreaming, some astral projection, anything above the ordinary would have been pretty great).  I'll definitely try it again in time, boredom always gets the best of me.</p>"
}
