{
 "title": "On and Off, Up and Out",
 "author": "Alex",
 "citation": "   Alex. \"On and Off, Up and Out: experience with Herion (ID 35982)\". Erowid.org. Nov 7, 2007. erowid.org/exp/35982",
 "substance": "Herion",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 line",
   "insufflated",
   "Heroin",
   "(powder / crystals)",
   "  T+ 1:00",
   "1 line",
   "insufflated",
   "Heroin",
   "(powder / crystals)",
   "  T+ 2:00",
   "1 line",
   "insufflated",
   "Heroin",
   "(powder / crystals)",
   "  T+ 3:00",
   "1 line",
   "insufflated",
   "Heroin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 35982",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2007",
   "Views: 31074",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have used Herion three times now.  Every experience is better than the last and I seem to suffer no penalties of addiction, but time shall tell on that.  I've spaced my uses each about 3 months apart due to the fact that I've seen many friends slip into the perils of addiction.</p><p>My most recent use was this past friday.  I was having a party at my house and everyone was into their own thing, J on the pipes with Ang and Drew.  Sara and H cutting lines and drinking.  It was a very relaxed environment so I seeing the oppurtunity decided to find my rather large stash of Herion.  After about 20 minutes of digging I found it, a wooden box with an intricate design on it, very old.  I proceeded to cut a very small line and breathe in.</p><p>The come up was swift and smooth euphoria passed over me within three seconds of the inhale and I sat back.  Sarah and I began to talk about nothing in particular, but it all seems very deep and involved.  Our conversation moves for about an hour the effects of the Herion still coming on in waves, one after another; Euphoria, Warmth, Euphoria, Warmth, and then it just starts to slur into one great feeling.  </p><p>The clock struck 9 and I cut the next line, this one about the same as the last one.  I breathe it in deep and Sarah looks at me with a sure smile.  'Whats that like?'  Our conversation moves on each of us disscussing our drug of choice.  Hers Cocaine, Mine herion.  We discuss our drug use since the start of college which is when we all fell into our vices.  We all met 9 months ago as freshman and now we're practically inseperable, all 6 of us.</p><p>I continue using for the next four hours doing a line at the strike of the clock until midnight and then just riding the high until about 4AM when it finally tampered off.  Herion is my drug of choice, no doubt about it in my mind.  I love everything about it, because it tends to make eveything so relaxed and pleasant.</p>"
}
