{
 "title": "Very Fun but a Bit Strange",
 "author": "Holy",
 "citation": "Citation:   Holy. \"Very Fun but a Bit Strange: experience with Catnip (ID 35985)\". Erowid.org. Mar 30, 2006. erowid.org/exp/35985",
 "substance": "Catnip",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Catnip",
   "(plant material)",
   " ",
   "3.0 g",
   "oral",
   "Catnip",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35985",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 30, 2006",
   "Views: 32157",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nYesterday I was bored. So I though I would stay up all night just for the fun of it. I spend the whole night, watching TV, recording a couple of guitar riffs on my multitrack recorder and surfing on the web while drinking Green Tea. Then I discovered online that Catnip could get you a little bit high for a low price, so I thought 'Why not?'.\r\nThis morning I went at the local Pet Shop to get some of the stuff. It costed only 2$ for a 15g bag, so the term 'cheap high' is well justified in this case. I opened up the bag, stuffed about a gram or so in the bowl and lit the whole thing.\r\nUpon smoking, I felt a kinda congestionned-like cramp in the heart area and immediately stopped smoking. I didn't like it at all... but I decided to continue anyway, taking less amount of smoke in my lungs. After a couple of hit on the bowl I looked at my hand while moving it and I could clearly see that moving objects got blurry, I thought it was pretty cool... but shortly afterwards, the effects worn off and all that was left was a saltiated taste in my mouth and a kinda cookie odor in my nose. I was a bit disappointed, but felt somewhat relaxed so I thought it was alright this way. Also as I was considering not to eat anything while my 3-day sleep deprivation, the catnip helped a lot to keep myself thinking about food\r\nThen I got the idea of making some Tea out of it. I emptied a tea bag, put about 3g of catnip and let steam it into hot water. It tasted very good; a bit minty and salty at the same time. I listened to some Ukrainian music and started to feel euphoric. I felt a kind of reconforting heat wave traveling through my body as I was driking. It was very pleasant.\r\nThen, things bengan to get strange. When I finished the cup, my thoughts were still clean but none of what I was thinking seemed to make sense, even if it did. I had difficulty to find words, althought I could easily speak. I felt like someone entered my mind and falsified all my thoughts so I wouldn't recongize them.\r\nI don't know if being tired from a 1 day sleep deprivation had something to do with the whole trip, but it was cool enough! Some prefer to smoke it. The only thing that I didn't like was the cramp I felt in my chest upon smoking the stuff, very unpleasant...\r\nThere's 2 days left for my sleep-deprivation experiement... Hope, i'll manage to stay awake. Catnip will accompany me througout this whole experience, for sure.\n\n\n"
}