{
 "title": "I Sense There is More Behind This",
 "author": "Xalithan",
 "citation": "   Xalithan. \"I Sense There is More Behind This: experience with Salvia divinorum (5x extract) (ID 35995)\". Erowid.org. Dec 31, 2007. erowid.org/exp/35995",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 35995",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 31, 2007",
   "Views: 2380",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter some completely unsuccesful attempts in smoking regular salvia leaf, with hindsight this was probably due to insufficient vaporization of Salvinorin A. in the pipe, my girlfriend and I acquired some 5x fortified leaf.<br>This report describes briefly my side of our last 2 experiences. We did an early try with each about 1/12th of the bottle (containing 1/2 gram in total) which was interesting, but was not more than 'above-baseline'. The 2 experiences I am writing about were with 'a bit' more, calculated as appr. 0.05 gr 5x extract each, smoked with a bong.<br>Setting: Both times, we act as each other's sitter. The other only starts with the Salvia when the other has recovered to reality enough to be safe. Although aftereffects remain for awhile, I can 'feel' the point where I'm back in reality as we know it.<br>1. Bedroom, on the bed with curtains closed, soft red light and some 'sounds of nature' in the CD player.<br>2. Living room, lava & plasma lamps and a blacklight, an ambient synth track by 'Burzum' in the CD player.<br>Procedure: Both times. Filled bowl with S.divinorum, held lighter to the bowl and inhaled deeply, while keeping the lighter to the bowl.<br>1. Closing eyes immediately after onset<br>2. Keeping eyes open throughout.<br>The smoke itself is, incidentally, very gentle, helped by the fact that I don't need much of it with a fortified leaf. No problems holding it down, although I personally seem to drool ever so slightly after holding it for appr. 20 seconds.<br>The experience: Both times there is a very short period where I simply loose my consciousness of my existence. This sounds weird, but it is as if I inhale, and then there's a very short period of 'nothing in particular' and then I am starting to be aware of what is happening.<br>1. After closing eyes I see some kind of outer-space pattern to my left. I watch the pattern. The music becomes sort of a wave, and it _becomes_ the pattern. The pattern rotates clockwise around me until it envelops me, as a tunnel. When it has fully enveloped me, I hear a slight noise, made by my girlfriend/sitter, which snaps me out of the experience. After this, I realize I'm perspiring a lot and just 'sit out the ride'. There are still CEV, but not as overwhelming as the first. What I notice above all is purely physical: A sort of prickling on the skin. I can best describe it as if some glass sheets are placed perpendicular to my torso, running through my legs and arms. Weird.<br>2. After I feel the onset I am struck by a shape in the lava lamp. Imperceptably this changes to the peak of the experience. There is (in reality) a green plant behind the lava lamp. Two of its stems and leafs turn into some  kind of supporting beams for a white hood, like in a settler's cart, but then 'from outer space'. It is back again to a 'tunnel-like' form, through which I'm watching. I have to say it's immensely beautiful with white, blue, green and yellow colors (the blue and yellow from the lava lamp). The lava lamp is now a center beam of the tunnel. I want to say something, but no...I feel to enthralled by the visual to speak.<br>After a bit, I am able to speak and tell my girlfriend what I'm seeing. I sense that I am able to speak fully coherently. I realize at a certain point that something I'm saying sounds weird and I tell her about it and clarify myself. Through this I'm fully conscious that I'm under the influence of Salvia and I am fully aware of what I am saying. I hear my girlfriend writing down what I say in our 'trip notebook'. As I'm talking the effects wear off and I return to the normal world. At this point I have no wish but to sit and 'feel'. My girlfriend switches off the CD and puts on some Led Zeppelin (one of my divinities, normally) since our neighbour is playing extremely loud house again, which boinks over our Ambient music. The Led Zep is extremely annoying though, even after 'returning to reality'. I think one shouldn't play anything rhytmically complex or fast together with Salvia.<br>Aftereffects: Both times sleepiness and a sense of wonder. Up till two days afterwards. <br>A sudden realisation : 'O my God, this stuff is really very powerful'. The knowledge that this definitely was not yet the full breakthrough Salvia experience, but still very intense.<br>I feel a wish to try a bit more next time, see when the real breakthrough comes. I have to say my girlfriend had a rather different experience with the same amount of Salvia. She described a real loss of this reality. A very disorienting, but very intriguing experience. This sounds like a trip higher on the SALVIA scale to me, but strangely she said she had hardly any visuals.<br>Typically, we both had some kind of rotation together with all our Salvia experiences. For me it was clockwise, for my girlfriend it was backward. I have read though, that this too is typically Salvia. Also, for the both of us the music/sound became something which we could actually feel. It is like a wave splashing over you, very hard to describe.<br>Salvia doesn't f*ck with my memory, at least not in the doses I tried. I remember vividly what I saw and felt, it's just that this is very hard to put in words. Anyway, I can feel that there is still far more to discover. Even with this relatively mild dosage the experience is very strong. I respect the herb very much and am curious what it will bring me.\n\n\n"
}
