{
 "title": "Lollipops vs. Patches",
 "author": "ML",
 "citation": "   ML. \"Lollipops vs. Patches: experience with Fentanyl (ID 36010)\". Erowid.org. Aug 18, 2004. erowid.org/exp/36010",
 "substance": "Fentanyl",
 "bodyweight": "113 lb",
 "header": [
  [
   "DOSE:",
   "800 ug",
   "buccal",
   "Pharms - Fentanyl",
   " ",
   "25 ug",
   "transdermal",
   "Pharms - Fentanyl"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36010",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 18, 2004",
   "Views: 29034",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report would be much more useful to those with a considerably low tolerance to opiates. The first time I tried a Fentanyl Lollipop I liked it very much. My friend sold me the 800mcg kind, and I must say it tasted pretty good. I kept it under my tongue (the chemical is absorbed through the mucous membranes under the tongue) for about a minute or two and felt the effects not more than 10min later. It was a euphoric and very pleasant feeling that gave me energy and made my day at work (waitressing) a whole lot better. Every couple of hours I sucked on it a little bit more to keep the high going. When I finally got to sleep that night I had a good 12hrs of sleep and did it again the next day. The lollipop lasted me about 2 or 3 days. (let's keep in mind I have a low tolerance). I would certainly do it again. It's worth the 30 bucks.</p><p>The fentanyl patches, however, are a different story. A month straight of daily doses of opiates later, I bought a 25mcg/hr patch from a friend, and I stuck it on at about 9 in the morning. I felt nothing all day except for some mild overheating and I felt out of breath from time to time--but nothing major. I also felt unusually tired and fell asleep late afternoon. 17hrs rolls by and still, nothing. Finally, at 2am I got pissed and took it off. I decided to try eating the gel inside the next morning since there was still about half of it left inside the patch. The next day I put like 4 drops under my tongue and went to work. I started to feel a very tired and irritable high 20min later. I felt like if I tried to take anymore of the stuff I would throw up. so I threw the damn thing out and I took a couple of percocet, and I was all better again. So, in conclusion, the patch sucks.</p>"
}
