{
 "title": "Loss of Everything",
 "author": "Seph",
 "citation": "   Seph. \"Loss of Everything: experience with Salvia divinorum (5x extract) (ID 36042)\". Erowid.org. May 10, 2007. erowid.org/exp/36042",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36042",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 10, 2007",
   "Views: 3043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my first experience with Salvia so I put in quite a lot of research before I fired the bowl. I informed my girlfriend of my plans to experiment while she slept. We are both rather experienced trippers, so I didn't feel the need to use her as a direct sitter, but she was just a room away.</p><p>In my water pipe, I smoked a small bowl to get a feel for the smoke. Then about 10 minutes later, I smoked another small bowl to try and find a slight feeling of the plant's effect. The smoke is pleasant. The feeling after two small bowls was slightly sleepy but not reflective of the true nature of the later trip.  </p><p>After an half hour, I darkened my office and relaxed back into a big, reclining leather chair and smoked a large bowl. The dry material ignites easily and burns fast.</p><p>I concentrated on putting the water pipe down before exhaling and accomplished that. Then I exhaled, blacked out, and here is what I wrote an hour after:</p><p>'Salvia is like falling through yourself and ending up on the other side of everything, naked, strapped to the nose of a rocket, confused and half-heart-filled.  ...And then I was someone else's body--in pain--and slowly peeling myself off of that dimension felt like my flesh was ripped off. Excruciating. Yellow. ...The whole while, I remembered something--someone. Her, asleep. SHE is there. Where am I? Who am I/are we? Who is she? She is. She is asleep. Okay...She is... Sally. I am okay. I need her. ... Positive & negative & in the middle where the thing is played out. Life is but one of these swirrling concessions. Love is another.'</p><p>The first rush is similar to 5-Me0-DMT, where God's screaming everything at once and I can't remember any questions. Or as another person put it, like an elephant sitting on your head. But 5-Me0-DMT doesn't seem to take you to the same place that Salvia does, which is a full, complete and new appreciation of being within the consiousness of some other thing, without a speck of residual personality left of you to figure it out.</p><p>In the experience, I believe I was, for a time, the space between someone's leg and a yellow laquered loveseat. There was a whole history to it, too. A story in there, a lifetime that I was aware of, but not impressed by. I wanted out. Despirately. I started to remember another half to what would be me, and ached with the incompleteness, so I started peeling myself out of the dimension. Meanwhile in the real world, I had leaned forward to dump myself onto the floor. And by 'myself' I mean the simple core of me that could feel: confused, frightened and in a great deal of pain. </p><p>I experienced excruciating pain throughout my body throughout the trip. It is perhaps the most complete pain I have ever felt of dull pain mixed with sharp pain both pulsing and remaining constant. Sterio pain surging throughout my body lasting 5-10 minutes. I think that the pain may have manifested from fighting my way out of the surreal environment in search of a touchstone. My other half. Sally. </p><p>I began to recognize the small computer lights in the office and shadows and shapes haunted until they became objects. I remembered what I had smoked and hoped that I would not suffer anymore strangeness as I was still raw. So I stayed and calmed myself on the floor until I could climb in bed with Sally. Her sleeping presense helped bring me back around. I got back up and thought about what had happened.</p><p>I'm happy that I'd been crushed by 5-Me0-DMT many times, as that prepared me for this most intence 5-10 minutes of my brain's existence. Unfamiliar travellers be warned. </p><p>In spite of the pain, I will experiment with Salvia again. There is something real there.</p>"
}
