{
 "title": "Lost Mind on 4/20",
 "author": "Mimi",
 "citation": "   Mimi. \"Lost Mind on 4/20: experience with Cannabis (ID 36056)\". Erowid.org. Apr 20, 2012. erowid.org/exp/36056",
 "substance": "Cannabis",
 "bodyweight": "90 lb",
 "header": [
  [
   "DOSE:",
   "repeated hits",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36056",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 20, 2012",
   "Views: 1278",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was another 420 but first for me to actually experience. My friend Binx and I made a plan to skip the day and smoke the ounze we bought with 2 other people. We went to a guys house with 4 joints, two bongs and 2 gravity bongs. We started off with the joints, one each. That got me nowhere. We filled the bowls of the bongs and started taking hit after hit, that's when it all started. It seemed as if I wasn't really there, I thought I was just a video camera vie of the house. I had no control of what my legs did and I decided it would be best for me to just sit.\r\nI took a few gravity bongs hits and then I started getting in a major panic about how Binx and I forgot about our other friend. I rapidly started dialing a number that I thought was my other friend's cell phone number.I sat in a bedroom alone with the telephone, I though thought this was a castle dungeon. I felt as if I was a trapped princess. When Binx came in giggling I snapped out of that thought. I still had no control of my body and I looked down to see myself scatching my legs this tripped me out, I stopped but would once again look down and see I was doing it again. I started thinking things were funny but no one else knew what I was thinking so I just laughed to myself. I started to just think there was no one else but us four when suddenly the guy's mom came home, I don't remember what she looked like but I remember looking back at her as Binx and I ran through the back yard. The walking I completely don't remember but Binx said that two guys jumped out and I started dancing, I still don't know if that's true. I was dragged to a group of people that all went to my school except one girl who to me looked like a pixie. \r\nWe smoked some more weed which I did just as a habit. We staggered from the group and walked to the back of a Safeway. I left Binx cause I had to go to the counsellour. I went in and started uncontrollably talked right upclose in his face, he asked 'Are you ok?' and I don't remember answering. I picked up the phone and called a cab. Then I just said 'I can't talk, bye'. In the cab I started to think a bit more clearly and the figitting stopped along with the wild thoughts and random laughter that had carried on through the past hours. This was by far the wildest experience but next 420 I need a camera.\n\n\n"
}
