{
 "title": "A Lasting Euphoria",
 "author": "Prisoner of Society",
 "citation": "   Prisoner of Society. \"A Lasting Euphoria: experience with Caffeine (ID 3606)\". Erowid.org. Mar 5, 2001. erowid.org/exp/3606",
 "substance": "Caffeine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   "  T+ 8:00",
   "100 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3606",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 5, 2001",
   "Views: 44232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt was about 7:15am and I decided to take a caffeine pill.  I took it because I heard it would make you more hyper and more attentive.  I also took it because I had absolutely no motivation in my life.  I popped one caffeine pill and drove to school.  I was expecting another boring day, the same damn daily routine.  When I got to school, which was around 7:50, I looked at my pain-in-the-ass friend as being one of the most interesting people I'd ever seen.  I looked around the halls of the school that I normally hate because my peers don't treat me that well as not being a nuisance, but as being irrelevant.  I didn't care if I was looked down upon or if I was called a fag or weird.  I had total apathy, and I chatted with my friend with the most enthusiasm I ever had in my life.</p><p>The euphoria cooled down and I was just feeling content, nothing more than that.  Then, at around 10:30, we had a school mass (I go to a catholic school).  Everyone else was paralyzed, but my friend told me a couple of jokes and I felt awake.  Then, while my friend started to doze off, I fell into a state of complete laughter.  I laughed for about 20 minutes straight, trying painfully to hide it.</p><p>Throughout the rest of the day I was more sociable, and society's prejudices were swept away.  I felt more alive, and my pessimism seemed to disappear.</p><p>But when I went home I was hit with astonishingly severe depression and I never felt worse in my life.  Everything was boring, plain, disgusting.  So I decided to take another pill.  I took half (100mg), and before I knew it I was happy as hell the rest of the day, and I crashed at 10:30, and I had a good night's sleep.</p><p>It has been 6 months since that experience, and my entire personality has changed.  I changed from a pessimist to an optimist, depressed to being happy, and I finally have some motivation (or a source of it anyway).</p><p>Here's my advice.  If you have the above symptoms or you're bored off your ass, or if you feel that you are going to have another boring routine tomorrow, take 100-300mg when you wake up.  The crash should occur at around three.  There are 2 solutions, take 1 more pill or take a nap.  I prefer taking a nap.  If this routine works out, then you're definitely a sucker for stimulants.  My emotional withdrawal for everyday life has vanished.  Give it a try.</p>"
}
