{
 "title": "Dunes of Pure Delight",
 "author": "psilo",
 "citation": "Citation:   psilo. \"Dunes of Pure Delight: experience with MDMA (ID 3609)\". Erowid.org. Nov 5, 2000. erowid.org/exp/3609",
 "substance": "MDMA",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1996",
   "ID: 3609",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 5, 2000",
   "Views: 7534",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nNote: This experience was posted to a mailing list some years ago.  It is one of my favorite trip reports, and I thought I would share it.  It is pretty long, but that's because I wrote it just after the weekend it happened, wanting to get as much down as I could.  Enjoy.\r\nWell, if you haven't noticed, I have been particularly interested in MDMA in the past month or so.  I have had the chance to have 3 very good strong trips with a large group of beautiful, energy filled people.  I thought it might be a good idea if I tossed out some of the things that came up on our last trip, which happened this past friday.\r\nAll 18 of us arrived at the campsite at about 7:30 or 8:00 pm.  After some setup and initial minor problems we finally dropped at 9:00.  We were camping at Honeyman Camp grounds, right next to the sand dunes, 9 miles south of Florence, Oregon.  Once we dropped, we grabbed all our stuff and headed for the dunes.\r\nAfter the first dune we had to climb from the road in the campground, our hearts were pumping.  We sat down just at the top and rested for a bit.  One of our group walked off to a higher point and begged all of us to follow.  Upong getting to the spot he had found, we saw in the western sky the full moon just beginning to rise.  It was colored a deep yellow orange. As it slowly/quickly rose (as you stared at it, it took for ever, but if you looked away and looked back it had jumped up), the feelings in me rose.  I got my first real taste of the trip when I felt some tingles and decided to run down the dune we were on.  Oh the rush!\r\nA particularly interesting thing I noticed and have noticed the other two times is the initial period of discomfort that some people feel just at the onset, particularly novices (I got it for a minute or two on the first trip in the beginning of April, though my second MDMA trip altogether).  The discomfort would last no longer than 10 or 15 minutes, then the person would suddenly feel better, charged, and eXtatic.  My theory on this discomfort is that as the drug begins to take effect, the mind and body are not prepared for the new sensations and energies that are flowing through them, and a discord is struck until the mental patterns harmonize with the X induced waveform (if that makes any sense).\r\nAnyway, we ended up breaking up into small groups and running back into each other for a while.  At one point, I searched out three others who were two dunes away.  As I crested one dune and made my way into the valley of the next, something was nagging at my brain.  When I stopped in the valley between the two dunes I noticed what it was: silence, absolute silence.  At the crest, you could here the ocean rumbling, some birds, some frogs, and some talking in the distance.  But in the valley, there was nothing.  It is really rare in this day and age to experience pure absolute silence and it was beautiful.  I proceeded to find the three others, whereupon two of them initated a bout of singing 'Wish You Were Here' by Pink Floyd.  I love to sing normally, and singing with the two other guys was such a thrill!\r\nWe were keeping perfect time with each other, and it sounded (and felt) marvelous.  The girl that was with us at this time was feeling a little discomfort, and I needed some water, and one of the guys needed to ramble, so we split, with the lone guy wandering off, and three of us walking back to the moon spot.  After getting some water,and mulling about I decide wanted to ramble too.  At about this point, me and a friend realized that we were soon apporaching the point where those who were going to take supplements should be taking them. The friend who wandered off alone was taking one, but didnt know.  So three of us set off to find him.  When we reached the spot of splitting up, he was not within hearing range (we have a HEMP call that we use to find each other).\r\nSo two of us decided to press on while the other went back to take his and inform the others (us two weren't taking the supplement).  We proceeded on, over a couple of dunes, calling now and then, talking to each other (this was the guy's first MDMA trip, so great time to open himself up and connect with each other).  We passed a pool and proceed up another dune.  About half-way up we decided to stop, rest have a cig., and that we would call at the top of the dune, and if we couldnt find him, go back to the others (we knew the wanderer would be allright, he likes to ramble off a lot, experienced tripper, done X a couple times, all of the three in the last month with me).\r\nWe turned around and sat down and were at the most BEAUTIFUL spot.  There was a little fat-bannana shaped pool of water, with a little hump in the middle-curve of it, with some forest to the right, moon reflecting of the pond, wavering in the ripples, sky full of stars (perfectly clear night), frogs croaking in their oh so trippy way.  We sat there for awhile talking, looking at the stars (at one point we saw a star moving, then stop, thought it might be a ufo, but I was having star waverings all night).\r\nAt one point we were laying on the dune, and I felt totally pure, clean, and comfortable.  My mind was an absolute blank.  I didnt have a thought in my head.  I was just lying on a huge dune of sand, absorbing the energies of the stars.  I turned and asked my friend if his mind was just totally clear like mine and he replied with a really mellow 'yea...'. We continued to kick it there, where he confessed some cool out-of-body dreams he had had to me, when suddenly we heard in the distance: 'heMP!'.  \r\nI let him finish his dream talk when I proceeded to  bellow out my reply.  The wanderer followed our voices to The Spot (a good thing too, he was heading in the wrong direction).  We went back, met up with the group, and proceeded to drag them to The Spot (which took like half an hour :) ).  Of course they loved it, took off their shoes and walked in the water, tried to catch frogs, etc.  We trudged on to find some huge angles to run/jump down (most of us would fall, but it was worth it).  Mushed around here for a bit, started getting really cold (were off and on cold through the night, movement helped a lot), so most of us proceeded back.  Slowly but surely made it back to the warm fire (which we had thankfully started before we left).  We smoked a bowl or two and got REALLY tired (my lids were already drooping on the walk back).  We found our appropriate spots and went to sleep.\r\nI left out a lot, as per my hazy memory, and much of it would have to be taken in context.  On the whole it was an incredible trip.  I highly reccomend taking MDMA with a LARGE group of friends.  Each time I trip with these people, I feel we get closer and closer.  I have a piece of every single one of their hearts residing inside me know.  We have tasted each others' energies and loved it.  One of the fun things about a big group trip is that it is inevitable that you will break up into splinter groups, but keep meeting back up in the whole, and get stoked every time :).  And of course, the more hugs you can get in a row, the better :)!!!\n\n\n"
}