{
 "title": "The Imaginary City",
 "author": "Croc_HunterDM",
 "citation": "   Croc_HunterDM. \"The Imaginary City: experience with DXM & Cannabis (ID 3610)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3610",
 "substance": "DXM & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6 oz",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 0:00",
   "800 mg",
   "oral",
   "DXM",
   "(powder / crystals)",
   "  T+ 1:00",
   "200 mg",
   "oral",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3610",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 20145",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nDXM is seen as a 'loser' drug by many in modern day drug culture, and as such it isn't really seen as a serious tool for visionary or spiritual purposes.  I feel quite differently based on my experiences. </p><p>On the day of my trip, I skipped dinner and instead drank Robitussin Maximum Strength Cough Syrup, about 6oz.  Real Robo, as opposed to generic Tussin, is far too disgusting for me so I had to stop early.  After taking in the 6oz, though, I took an additional 800mgs in powder.  I was shooting for a total dose of 1500mg, planning to work my way up to it, though I only totalled around 1300mg for the day.</p><p>An hour or so after dosing I felt the effects coming on very strong.  My vision doubled and I started to become dissociated.  I was chatting on IRC when someone just had to mention puking, which in my just starting to trip state caused a bad reaction.  I lurched to the bathroom and vomited fiercely, though I maintained control after the initial 'thrusts' because I wanted to preserve that I dosed.  My rule of thumb with DXM is if it's been in your stomach an hour, you've adsorbed it.  Still, I wanted to keep the mixture in my stomach.  This vomiting killed off my dissociation though, and I went back up to my room and took 200mgs more to supplement what I had just lost.  </p><p>So at about T+3hrs, when I my trip was in full blast, I robowalked to my smoking chamber, turned off the lights, and let the DXM play with the slight amount of ambient light in the room.  I began to smoke a pipe of herb; the flicker of my lighter being the brightest and most mysterious thing I could comprehend in my tripping state.  I was observing the 'DXM pattern,' a fractal image of abstract blobs and simple shapes in low hue colors.  While looking at one blob in particular, my trip suddenly became unlike any other DXM experience I have ever had, on any dosage and under and other circumstances.</p><p>One moment I was sitting back, looking into the pattern, and the next, the pattern seemed to approach me and I was drawn in.  Suddenly the shapes and patterns became much more clean, defined, and vibrant.  Out of nothing, buildings suddenly arose around me;  gigantic structures with fantastic sci-fi kinds of architecture!  One in particular amazed me, it was pyramid-shaped on the base, but at the top where the tip of the pyramid would be, there was a large sphere.  I'm not any sort of engineer or architect, but I'm sure that such a structure would not hold up under 'normal' conditions.</p><p>As I continued my fly-by of these buildings, I looked closer and got a shock.  The buildings were built out of DXM powder!  I know and realize this was a hallucination, and that you can't build a safe structure out of DXM powder, but while I was in this state it seemed to be a logical building material.  I looked around at the buildings a little more, but by then I was drifting down the ground, very gently, very controlled.  I saw people.  </p><p>There were all sorts of people, those in business suits, those in casual, mothers, fathers, children, people of all ages.  A few cars were driving on the street, but there didn't seem to be an emphasis on motorized travel, there were far too many sidewalks and paths in the City.  The streets and cars, of course, were made out of DXM powder.  As with the buildings (and please do bear with me, I know it gets really strange at this point), the people were made out of DXM powder.  There was no 'black,' no 'white,' no 'asian,' no race of any distinguishable sort.  All the people were the same brilliant but dulled white of DXM powder.  They looked normal, except for being made out of the powder form of a dissociative anesthetic.  One of them, a middle aged man in a hat, smiled at me and pointed.  </p><p>My gaze was drawn to a huge tree planted in a pot of soil (which, surprise, was DXM powder).  As I looked a little more, I came to yet another realization-  The giant tree was a fantastically large cannabis plant!  It must have been twenty to thirty feet high, thick and 'juicy' looking.  It was bright neon green with red/orange hairs which stuck out like leaves.  I know cannabis plants can grow into trees if they're left alone and allowed to grow, but certainly they would never reach the stature of the plant which stood before me.  </p><p>I took in everything for a moment, the entire City with it's foundations to its buildings and people, all made out of DXM powder.  Standing in vibrant contrast were the cannabis trees, which were numerous on every block.  A though skirted across my mind, 'How is all of this possible?'  And I began to sink again.  I now travelled under the ground, and began to shrink in some way as a molecule of DXM was presented to me.  I'm not a chemical genius, either (if you're wondering, I'm a Communications major), and thus could barely follow what I was being shown, but it seemed that DXM, when manipulated in the right way, turns into a very flexible crystal.  These crystals gave life to everything in the City, from the people to the plants to the buildings, and thus life is supported.</p><p>Back in the 'real world,' I lit my bowl, and in an instant the vision ended.  As I was still tripping I didn't really think much of the vision at the time, but in retrospect I can appreciate how beautiful it was to me.  Let me stress that I'm a rational fellow, though.  Maybe it's not too surprising that I happened to be taking a hallucination-causing substance and that I hallucinated about the substances which I was ingesting.  My peers told me something along the lines of, 'When you see a world made completely out of drugs, you know you're really messed up!'  But the City was so much more than that.  I've never had a visual effect from DXM like the City, and I don't know that I ever will again.  Perhaps with luck I will one day see the City.  A lot of other people often see fantastic things on high level doses of DXM, but this was the first I had ever experienced, and it just seemed so crisp and real.  Again I stress that this was the first time I had ever seen something so complex on DXM.  As such, I can only consider it a vision.</p>"
}
