{
 "title": "Born Again",
 "author": "Arrowhead",
 "citation": "   Arrowhead. \"Born Again: experience with 2C-T-2 (ID 36175)\". Erowid.org. Feb 1, 2005. erowid.org/exp/36175",
 "substance": "2C-T-2",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-T-2",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36175",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 1, 2005",
   "Views: 10680",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was given a capsule with 20 mg of 2C-T-2 by a friend while the two of were camping by a lake.<br>T+ 30 min;  Nothing.  I begin to forget about the possiblity of the drug having any effect on me.  <br>T+ 1:00;  With surprising speed, a warm body high swells in my stomach and fills my legs, much like a dose of Percocet or Vicoden.<br>T+ 1:10;  Blades of grass seem particularly pronounced in color and texture.  Little things begin to seem amplified.<br>T+ 1:15;  Blades of grass have started twinkling and wavering as if underwater.  The campfire, including the metal ring around it, is wobbling and rising into the air.  Wonderful body high and a warm flush of lucidity throughout come-up.<br>T+ 1:50;  Incredible visuals!  Tracers, patterns and shape-shifting is astounding, especially due to the lucidity of the drug.  The best part:  Conversation is free-flowing, meaningful, and far beyond 'coherent.'  Oddly, it feels like the drug is restoring coherence to both internal and external dialogues.  Feelings of warmth, safety, peace, well-being and love flow between us and between nature around us.  Time seems to move incredibly slowly.  We keep laughing at our discovery that everything is going to be alright - not with us and the drug, but with the world and humanity and death and family.  Perhaps this is a typical response to the drug, but it can't be overstated.<br>T+ 7:00;  Effects (visual and emotional) are still mild when we fell asleep in our tent.<br>T+ 5 months:  This trip was life-changing.  2C-T-2 can absolutely blow doors off their hinges with respect to ego, fear, anger and anxiety.  This could have been a lucky trip...it certainly seemed sanctioned by the universe at the time.  I would recommend handling this substance with extreme care and respect, because its effects can be way, way out there.\n\n\n"
}
