{
 "title": "Almost As Good",
 "author": "Kutch",
 "citation": "   Kutch. \"Almost As Good: experience with Ultracet (Tramadol) & Methocarbamol (Robaxin) (ID 36236)\". Erowid.org. Jan 6, 2008. erowid.org/exp/36236",
 "substance": "Ultracet (Tramadol) & Methocarbamol (Robaxin)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "225 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 0:00",
   "4500 mg",
   "oral",
   "Methocarbamol",
   " ",
   "  T+ 2:30",
   "150 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "36236",
   "Male",
   " ",
   "Not Given",
   "Jan 6, 2008",
   "44437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After a pretty serious skateboarding accident involving a concussion, contusions, ligament and tendon damage, back and neck injuries, and numerous abrasions, I went to the ER in hopes of receiving medication for the pain. After all of the X-rays, CT scans, etc., I finally saw the ER doctor. She explained everything to me and I made sure to ask for pain medication so she told me she would prescribe me Ultracet. I had been prescribed Ultracet for pain before, and even a double dose was completely ineffective. I informed her of this, but she said they would work fine in combination with the muscle relaxers (robaxin). I decided I would give it a try, and if it wasn't effective, I would see my regular physician for hydrocodone with ibuprofen.</p><p>The day after the accident, I tried a triple dose of the Ultracet (225mg) and it felt like a very weak hydrocodone or codeine pill, in a very low dose. So tonight, three days after the accident, I'll be taking a triple dose of both medications, and documenting my experience.</p><p>00:00 - Swallowed all 12 pills with as cup of water, on a semi-full stomach. I'm going to play Grand Theft Auto: Vice City until the medications take effect.</p><p>00:30 - I'm feeling only slightly inebriated. Nothing too distinct, just a little 'different'.</p><p>01:00 - I feel just about the same as I did at the 30 minute mark, but this time there's a little bit of pleasant numbness, and a slight hint of the 'opiod itchies'.</p><p>02:00 - I stopped the video gaming about 30 minutes ago so I could enjoy the euphoria. I now feel like I have taken a slightly-less-than-recreational dose of hydrocodone. The muscle relaxers have loosened me up and caused a bit of pleasant drowsiness, so I'm very relaxed. My mood is great, but I will attribute that to the gaming, as I'm sure I could be angered or saddened if I experienced something negative. </p><p>02:30 - I'm taking 4 more Ultracets, putting my total at 375mg. I'm turning everything off, and about to lie in bed, to enjoy this. </p><p>03:00 - Lying down intensified the euphoria and pleasant feelings greatly. I think I'll be falling asleep pretty soon here.</p><p>12:00 - I've just woken up from some of the best sleep of my life. Every once in a while, I would drift in and out of sleep, all the time with a grin on my face and my body feeling amazing. I had short, but unusually pleasant dreams. Upon waking, up, I felt exactly like I did at the 3 hour mark, incredible.</p><p>13:30 - The effects are still going strong.</p><p>16:00 - I can still feel the effects, but only barely.</p><p>18:00 - Effects are now completely gone</p><p>Conclusion: Robaxin is a much better muscle relaxer than the commonly prescribed Skelaxin. Ultracet, while much weaker than and not nearly as good as opiods like codeine, hydrocodone, oxycodone, etc., can still be very effective and, if it's what youre looking to do, can give you a pretty nice high.</p>"
}
