{
 "title": "Body More Sensitive",
 "author": "Japanfreak",
 "citation": "   Japanfreak. \"Body More Sensitive: experience with H.B. Woodrose Seeds (ID 3637)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3637",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "10 seeds",
   "oral",
   "H.B. Woodrose",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3637",
   "Male",
   " ",
   "Not Given",
   "Dec 25, 2001",
   "Views: 15545",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI live in Japan where it is very hard and expensive to find good drugs. Recently I decided to give legal drugs a try and ordered some hawaiian woodrose from the net. Now before I did this I read through these posts and people had all different types of experiences. Some people raved about the seeds and some people seem to think they are a hoax. </p><p>Preparation</p><p>I removed the coating off 10 seeds. This is very easy to do. I managed to get them clean with a spoon, I didn't even need a knife. I then grounded them up in a mini cuisinart. I then put the seeds in a bottle of mineral water and let them soak for 4 hours. I was concerned about the vomit effect everybody seems to have, so I then filtered the green water through a coffee filter to make sure there was no seed material in the water.</p><p>Effects</p><p>15 min after drinking - My mouth started to get a tingling sensation</p><p>25 min - The trance music was really sounding good</p><p>40 min - I started to get a huge energy boost. I was ready for the clubs. My eyes were fully dilated</p><p>50 min - I stopped at a bar on the way to the club, but they were playing country music (yes even in Japan). I had too much energy to sit down anyway. This was also the first time I noticed that my sense of time was screwed up. i was in the bar for about 20 minutes, but it felt like 2 hours. </p><p>2 hours</p><p>I got to the club and was about to go in when I got a phone call from a girl I know. She said she wanted to try it also, and since I had prepared two portions for such an event I went to her apartment.</p><p>3 hours</p><p>She had drunk done her bottle and about 30 minutes had past. We were staring at a toy I bought at toys r us that lights up and moves around. We were getting nice trails off of it. It was just really pretty.</p><p>4 hours</p><p>I noticed that my body was feeling more sensitive, especially the bottoms of my feet. I think an hour before this I couldn't have sex if I wanted to, but now I could, so I did. I don't know if this was because of the seeds or not, but the sex was harder then usual and I couldn't cum. Once again time was messed up because we thought we were at it for 4 hours, but it had only been an hour and a half.</p><p>5 1/2 hours</p><p>I went home and on my way home I noticed how pretty all the lights looked. My night vision was great. I drive a motorcycle so I had a great time looking around and feeling the night.</p><p>6 hours</p><p>When I finally decided to lay down and go to sleep I was in for a surprise. I kept thinking that it wasn't anything like LSD, but I was too pumped up for it to notice. As soon as I closed my eyes and relaxed I was tripping big time. My limbs and body were shrinking and enlongating and doing all kinds of funky things.  Finally I fell asleep at 6 in the morning, 9 hours after drinking the seeds.</p>"
}
