{
 "title": "I Thought I Was Ready",
 "author": "Anonymous",
 "citation": "   Anonymous. \"I Thought I Was Ready: experience with Salvia divinorum (10x extract) (ID 36384)\". Erowid.org. Jan 6, 2008. erowid.org/exp/36384",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   "  T+ 2:00",
   "150 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "36384",
   "Male",
   " ",
   "Not Given",
   "Jan 6, 2008",
   "2738",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was excited and not in the least bit apprehensive about asking Sally out.  I had done weeks worth of thorough research and I fully understood that Salvia was a drug that demanded respect. Let me explain the situation briefly, a friend and I prepared tonight to try Salvia for the first time.  We intended to take a small dose each (0.05g) and then a large dose a few hours later (0.15g).  The purpose being that we hoped the small dose would give us the slight euphoric effects, then we would dose large to see if we couldn't visit space. We had no sitter, so we agreed not to dose simultaneously if it looked like one of us was 'going away' for awhile</p><p>The small dose went as expected.  I dosed first, then he waited to take his.  I had slight euphoric feeling in my body, and colors brightened much in the same way that they do during the onset of an LSD trip.  It was nice!  Time passed, and we decided we would go ahead with our plans.  My friend took his entire .15g dose, but didn't seem to go very deep.  I waited 10 minutes to alot him some time to think clearly and then I fired away.</p><p>One large hit is all it took.  As I placed the bowl to my mouth for a second hit I began to feel the world unravel and melt.  The slight pain in my throat from smoking intensified to an almost choking feel.  I never 'went away', but I was on the border, and *terrified*.  I never took that second hit, but was not composed enough to know why I wasn't taking the hit.  Keeping my mind on the bowl kept me slightly grounded, but I was freaking out inside.</p><p>I tried to speak to my friend as my brain sank.  I almost felt as though I was asking for his help, but he was a much different person than I had known before.  All of a sudden I felt as though he was empty, that he wasn't going to speak back to me, that I was all on my own.  In reality, he was speaking to me (when I spoke to him first).  He said I told him 'go ahead', but I swear that what I intended to say was 'that's enough for me, I'm losing it, I need you to help me calm down'.  Of course, when you place a bowl on the table and say 'go ahead', your buddy is going to interpret that as 'hit this shit'.  He reached for the bowl, which I was at this point aware enough to realize, and I panicked and yelled at him.  No way was he going through this while I needed his help.</p><p>Of course, I never needed his help.  I was having a bad 1-minute trip, and I just needed a human there.  The 1-minute felt like it simultaneously lasted an entire hour.  I couldn't understand how I got in that lost situation or why I so desperately needed my friend to be there for me.  I knew I took a hit of something, but I still couldn't make the connection!  This may be what people meant when they said that time unravelled.</p><p>The ensuing 10 minutes after that mindfuck were a thousand times more sober, but still disturbing to my mind.  I was unsettled and sweating like a pig.  I felt slightly abandoned by my friend, who didn't do anything wrong.  I felt violated by the drug which I spent a significant amount of time preparing myself for.  I felt like I was going to cry because I wasn't getting the human attention that I was craving from my friend (he was not tripping, he just doesn't talk much).  I thought it was the worst trip I had ever had, and was only slightly relieved that the brunt of it lasted a minute.</p><p>An hour later, I felt much more at peace, and actually feeling good about the experience.  This was about 3 1/2 hours ago, so I haven't spent enough time analyzing my trip yet, but I wanted to give an account of the emotions I went through, rather than the visual trip I went on.</p><p>Retrospect:  I definitely needed my fiancee to be my sober sitter.  She's not interested in trying Salvia, but is more than happy to be there for me if I need her.  We are very much in love and I think that would be a huge help for that downtime immediately after the heavy trip.  I also did not go into outer space (the term I use for a trip where you completely lose track of your physical being), but I got as close to it as I could handle.  The trip only lasted 1 minute as opposed to the 5-10 I hear about.  I think this happened because a) I did not smoke the entire .15g, only about half of it, and b) I tried really hard to ground myself the first instant I knew I could.</p><p>I will do Salvia again in time.  I now have touched it on the surface and feel a little more prepared for it.  The crappiness I felt about the bad trip was replaced an hour later with satisfaction and joy, and I'm taking that as a good sign.  I have a lot more travelling to do, but it's going to be very carefully executed.  There are factors of the environment that I would change in hopes of having a more confident entry into space.  I thought I was ready...</p>"
}
