{
 "title": "What the Hell Was I Thinking",
 "author": "BongLoad",
 "citation": "   BongLoad. \"What the Hell Was I Thinking: experience with Methamphetamine (ID 36408)\". Erowid.org. Aug 10, 2005. erowid.org/exp/36408",
 "substance": "Methamphetamine",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   " ",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "36408",
   "Male",
   " ",
   "Not Given",
   "Aug 10, 2005",
   "Views: 30444",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well this just happened to me recently. I must first say I used to do meth quite frequently but due to location changes and lack of resources I had not done any for a long period of time. I had been smoking marijuana daily and been using oxycontin 80mg from time to time. I have used many drugs but have retired from most due to the fact that I developed bi-polar disorder with schizoid tendancies and they tend to make me even worse. I knew from the start it was not a good idea to be fucking with meth when it could damn well throw me into a full psychotic episode. </p><p>Well now you know a little about my situation. So going on, as luck would have it somebody I met recently hooked me up with a gram of shards. I was excited and had accepted what might come later as part of the experience. What the hell was I thinking. The first night there were no delusions or psychotic episodes to speak of so I decided to go a little heavier on my dosage. So to make a long story short the gram lasted maybe three days. On the last day it happened... I started to see clear outlines of people everywhere. I went kinda like predator when he goes invisible in the movie. I knew this was a bad sign. Things started to get real wierd. Liquid smoke was filling my whole field of vision and I remember the outlined people getting more vivid. They would smile at me with these evil faces and wave and shit. It was scary as hell. I would be having a conversation with somebody and realise I was totally alone. Lots of times I would find myself chasing imaginary intruders out of my yard. I would see people plain as day and then when I got up close they would be a chair or lawn ornament. A lot more things happened I can't even explain like hands touching me all over. </p><p>It all went away with time but it was a very traumatic experience. It felt like a intense dramamine trip that wouldn't go away. I am posting this report to warn anybody who suffers from mental illness be careful what they put in your body.</p>"
}
