{
 "title": "One Movement Into a Million Thoughts...",
 "author": "Odie",
 "citation": "   Odie. \"One Movement Into a Million Thoughts...: experience with Mushrooms - P. semilanceata (ID 36433)\". Erowid.org. Oct 12, 2005. erowid.org/exp/36433",
 "substance": "Mushrooms - P. semilanceata",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms - P. semilanceata",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Mushrooms - P. semilanceata",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 36433",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 12, 2005",
   "Views: 3376",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIts a Halloween night, I'm dressed up as a soldier. I get in around 8:00pm and I take my first 2.5gs orally in a tea. After a few minutes of finishing them off, my friend tells me that I shouldnt have eaten so much because Im real little both short and skinny and that I dont know what Im in for. I shrug.  We proceed to the 'Floyd Room.' This 'Floyd Room', is a pitch-black room where theres nothing but Pink Floyd playing sometimes other bands like The Doors, or The Beatles.  While Im in there waiting for the mushrooms to kick in Im thinking about a movie I last watched 'Apocalypse Now' which is my favorite [Vietnam] war movie and eventually after sitting thinking about that movie, I can feel the room Im in expand, it feels as if it grew about another 20 feet and all the objects in there disappear besides me and my friend because I can hear him giggling and breathing, I begin to grow confused as to what Im feeling because this is my first time trying shrooms.  \r\nAfter the effects kick in a bit more, I get a hold of what I think the trip will be like. I begin to giggle so I lie down to see what visuals I get if any, I close my eyes and nothing seems to happen, all of a sudden I feel the room shrink, so I quickly open my eyes, and in front of me it seems as if the wall moved really close to me and there were many different colors, in a plaid pattern, I reach out to see if I can touch this pattern but with no luck it just moves further away. I then notice a small stream of light coming through a small crack in the window, it begins giving off little waves of shadows through the darkness, I begin opening and closing my eyes, playing with the vibes from the stream of light and the Plaid pattern that keeps appearing. \r\nAll of a sudden my friend lights a match and moves it slowly until it burns out, it boggled my mind, it made many thoughts go through my head and my body began to feel like it was full of sand. He continued to do so, I eventually became use to it and knew how to play with the bright light of the flame. Every time the flame would glow I would try and absorb it into my body, so I could feel this warm sensation go through my entire body.  \r\nAfter what seemed like an eternity of playing with those matches, my reality was shattered. Another friend who was also on shrooms came crashing through the door and whipped on the light, I felt like I was a rat in a sewer and some kids shined a flashlight on me. My first instinct was to flee just in case it was danger so I scurried underneath a desk but then after that blindness went away from it going from pitch black to fluorescent light bright I came out and he was sitting there with another bowl with about three or four grams of dried shrooms in it. Him and my other friend starting eating them so I thought to myself I think Im at my peak so I began munching down as well like they we're potato chips. But I glanced at his watch and I found out it has been only 30 minutes and my trip had only began and I now have more shrooms in me. So the lights go back off, and I begin thinking of things in my life, looking for answers to some things, and questioning myself with everyday questions but I think of nothing that I havent thought of before while sober. So I get my lighter out and start flickering it, making the flame dance for me as if it was my own little friend. I called him my own little friend because I could get him to dance and move and stay however long as I pleased as well as somehow absorbing the energy it would be giving off sending that sensation through my body. \r\nI put my lighter away because the metal on it grew too hot and I burnt myself and it scared me and sent a feeling of anxiety through my body so I sat against the wall and concentrated on breathing. My friend then starting playing with his matches while he was doing this 'The End' by 'The Doors' came on. Which made me think of 'Apocalypse Now'  again because its the intro song on that movie.  At this time the shrooms have kicked in a lot more and I remember Im in my soldier costume, and that at the Beginning of the movie during this song there was napalm falling everywhere and my friends matches also resembled that, so I started breathing really fast and thinking/feeling there could be a war on the go and Im part of it. So I try and control myself so I get back into my shelter (Under the desk) and I begin giggling and laughing and breathing fast because everything was so perfect and intertwining so beautiful. [The End Playing, Me Dressed up as a Soldier, Matches being lit resembling napalm a fair bit] I felt as if I was in the movie. But soon enough the song changed, and the matches ran out.\r\nAfter about 60-90 minutes the mushrooms have started to hit me really hard, I start breathing a lot faster, shorter quick breaths. It makes me worry, and makes me start to think again, about everything. This time Life. Which is where my trip began to go downhill. I begin questioning life, and trying to figure out the meaning. I narrowed down everything. I made everything in life seem like it had no point or meaning, because we all die in the end. I thought it would make a difference if I went out and started tearing my friends house apart because the worst that would happen to me is that I go to jail, get beat up etc..etc... and Id just die in the end, which was the outcome to any situation I put in front of me, 'Id just die in the end' so I started getting really scared at this point. Also upstairs people are jumping up and down banging on the floor, for some reason I think its a fight breaking out. And all these thought of life being pointless, a fight breaking out upstairs, me dying in the end is all racing through my mind. So I get up as fast as I can I race out to a half well lighted room I open a window or two, I sit down and I start controlling my breathing again. I then begin to shoot some Jack Daniels to help waken me up/(sober me up [yeah, right]) and come to realization of its just the mushrooms. I then get complete control of my trip again.\r\nThe last part seemed really scary at first but when I thought about it, I came to the conclusion I actually enjoyed it, I enjoyed the thrill and the adrenaline that shot through my body while I was really scared and in attack mode (when I thought the fight broke out). \r\nAt first I thought that shrooms would ressemble acid, but I was wrong. Mushrooms are much darker and I have to have a lot more self control when using them.\n\n\n"
}
