{
 "title": "A Rocky Ride",
 "author": "DJ Digitek",
 "citation": "   DJ Digitek. \"A Rocky Ride: experience with 5-MeO-AMT (ID 36454)\". Erowid.org. Jan 22, 2008. erowid.org/exp/36454",
 "substance": "5-MeO-AMT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "5-MeO-AMT",
   "(pill / tablet)",
   "  T+ 1:30",
   "20 mg",
   "oral",
   "5-MeO-AMT",
   "(pill / tablet)",
   "  T+ 2:45",
   "45 mg",
   "insufflated",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 36454",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 22, 2008",
   "Views: 5457",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSetting: College Apartment in Tampa with Dali paintings and 5 friends experienced in tripping.\r\nMindset: Testing/Openminded willing to push the envelope.\r\nPreparation: German mg scale and cut with 200 mg's effedrine and  softpressed with pencil pressure, isopropy alchohol, melted capsules,  and  compressed using plastic cylinders on a'0' size capsule filling machine.\r\n15mg's was also prepared in plastic dime baggie weighted with mg scale, and snorted with straw.\r\nPrescription Medications Taken Daily:  1 Aderal 20mg XR every morning and 1 Xanax generic 1mg when aniexty attacks occur.\r\nInitial Dose & Time: 10 mg soft pressed tablet 4:00pm\r\n4:30pm-No intial effects\r\n5:00pm-Still no physical or mental effects\r\n5:30pm-2 more softpressed 10mg tablets taken\r\n6:00pm-slight speedy sensation like that of an amphetamine rush. No nausea, vomiting or physical/mental effects\r\n6:45pm-2 doses of 30mg's messured out in two dime baggies.  I snort one baggie and half of the other bagie that the other dose(e) couldn't finish himself. [Erowid Note: A combined dose of 75 mgs of 5-MeO-AMT is considered an extremely high dose, see 5-MeO-AMT Dose Chart]\r\n6:47pm-Instantanious vomitting By this time 2 of the other test(e)'s have vomited and 3 others are vomiting: one guy was puking in a bucket I use to wash me car,..the other was puking in my kitchen sink,...and I and my girlfriend were puking in the bathroom,..she took the tub while I choose to hug the toilet and pray as I claimed the toilet to be my only friend!\r\n7:38pm-vissuals persist and noises echo my girlfriend grows horns (the apparent cause was pony buns she put on before relaizing we would'nt be able to leave the house),...the noise distortion is so extream all dose(e)'s are screaming to try to find each other. The teath clenching is so unbearable I cry in pain and fear that the grinding will strip all ennamel off my teath. Physical restlessness and strentching is extreamily painful and uncomfortable,...i look as throw i've come down with cerbal palsey and my hands, feet, and head all pursue different directions (as confirmed by a sober neighbor and classmate babysitting the group).\r\n12:17am-I wake up in my bed with my girl stroking my hair and telling me they gave me a couple Xanax's to keep me from screaming as the security guard for the apartment comunity knocked on the door to make sure we ok cause I was yelling so loudly. The vissuals are still persistant and the body load is still quite rough but not unbearable.\r\n4:35am- a 15 year old runner who worked for me needed a place to stay and asked for a ride. We drive to pick him up and it apears as though we stepped into a space craft and are traveling at light speed as we talk on a cell phone to get step by step directions to pick him up as we're uncapable of realizing our surroundings. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r\n5:13am- back at the apartment the 15 year old also had a girlfriend he had brought over for the night. He kept asking if we were tripping and saying things like fuck you,....and shut-up to try to make us trip harder or just plain get mad at him. At one point he asked to take his girl in my bedroom and proceed to fuck her in my bed and that was the breaking point. I began screaming and telling him to shut up and he kept challenging me for some reason. Well it got to a point where I pulled my hangun out on him full blown vissuals and paranoia and he pulled his gun on me as well,....my friends interjected to a point where we both put out handguns down and they locked them in a small safe at the back of the apartment.\r\n6:56am-we come to an agreement to rid our selves of the 15 year old and his whore for the evening. 2 of my friends barrow my car and drop him off when $20 at a burger king. While I was still in the apartment I would up taking 5 more xanax's to sleep off the rest of the trip which was getting agonizely painful as the nausea and teath clentching began to return.\r\n9:00pm- I awaken to see my girlfriend lying next to me still tripping and I'm still tripping a tiny bit with minimal tracers and and color distortions.\r\nAfter going back to sleep I awoke at 2:37pm the next day and concered the minus the nausea and phyiscal pain and drama with the gun that I had enjoyed the experience. \r\nIt's now been a year after begining my journey with 5-meo-amt. I didn't ever do over 3-10mg's again but i found that after use I would build a tollerence and have persitent pain in my chest and kidney area's and lung area's too. This would only occure if I didnt take 5-meo-amt every other week,..and would discontiue if i fasted off the substance for over a month.\n\n\n"
}
