{
 "title": "Lucidity from the Great Randomizer",
 "author": "Game Cat",
 "citation": "   Game Cat. \"Lucidity from the Great Randomizer: experience with Yarrow & Alcohol (ID 36470)\". Erowid.org. Mar 21, 2006. erowid.org/exp/36470",
 "substance": "Yarrow & Alcohol",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Yarrow",
   "(extract)",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "36470",
   "Male",
   " ",
   "Not Given",
   "Mar 21, 2006",
   "16794",
   " "
  ]
 ],
 "report": "<p>So last night, I tested a curious potion. Tincture of yarrow herb in shitty vodka. (Flowering stalks harvested from Pacific Northwest roadside and dried in a paper bag. Plus the leftovers from a plastic handle of Monarch. Plus about 7 days.) </p><p>The impetus for this was a brief collection of recipes exploiting yarrow's synergistic properties, which was tacked to the end of an article on its medicinal uses. For a couple of reasons (among others, it was the first herb I learned to recognize by smell), I consider yarrow to be a special plant, and since I had some dried herb hanging around for other purposes, I decided to go for it. </p><p>After soaking for a week, the vodka had turned a light golden color (about the shade of  basic tequila), and after being strained through a coffee filter, it no longer smelled or tasted like vodka. Instead, it had an almost overwhelming floral odour and taste - more like a flowery schnappes than basic hard liquor. My total dose ended up being a little less than three shots worth, plus a cigarette and a reasonably strong gin and tonic. (The lot was spread out several hours.)</p><p>In terms of straight alcohol, the amount I consumed over the night would have been enough to get me reasonably ruined. Yarrow, however, seems to make the effects of the alcohol significantly different. </p><p>Although there's a loss of motor control, it's significantly less than I expect from the same amount of plain alcohol. The real defining characteristic of this brew is lucidity - to a nearly supernatural extent. Although I could feel the alcohol in my system, it was matched by a feeling that I was in complete control; that I was capable of taking in, synthesizing, and understanding information at a rate that dwarfed what I was usually capable of. A yarrow tincture gives the euphoria of alcohol without the stupidity. </p><p>Interestingly, there was even a visual aspect to this effect. Everything looked sharper, somehow - I was intensely aware of the outlines and locations of everything in the immediate environment, as opposed to the blurring that alcohol generally engenders. When I was smoking the aforementioned cigarette (I smoke only occasionally, so a fag is a special occasion for contemplation and enjoyment), I had an amazing sense of the fluid dynamics of the smoke particles in the air, and could track the exhaled smoke much farther through the local atmosphere than I would expect to be able to.</p><p>Overall, yarrow+alcohol made me feel simultaneously smarter and crazier. I feel like this would be a fantastic group drug, leading to some truly impressive exchanges of ideas and clashes of personalities, and I'm currently wondering what it could do when mixed with an inherently 'talky' flavour of alcohol, such as red wine or schnapps. (I see vodka as being a more stoic sort of trashed - it's the mascot drink of suffering in silence.) </p><p>The hangover was rather odd, though. Normally, I'm superman w/r/t aftereffects (my most epic benders typically end with me getting up at 10 AM ready to take over the world), but this had some wierd stuff attached to the morning after. (Note that part of this might have had to do with being woken up way early by a phone call from the landlord and then going back to bed.) For one thing, this was my first specifically identifiable experience with sleep paralysis - I had this hallucination that there was a rodent of some sort running around in my bed, and I couldn't move enough to scare it off. There was also a headache of the sort that I usually manage to avoid with alcohol.</p>"
}
