{
 "title": "Difficult? You Betcha!",
 "author": "TrippeRATwerk",
 "citation": "   TrippeRATwerk. \"Difficult? You Betcha!: experience with 2C-C (ID 36482)\". Erowid.org. Jan 25, 2007. erowid.org/exp/36482",
 "substance": "2C-C",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "2C-C",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "36482",
   "Male",
   " ",
   "Not Given",
   "Jan 25, 2007",
   "11033",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>~~WARNING~~WARNING~~WARNING~~                              </p><p>I submit this report with the sincere desire to alert future users of taking this, or any drug, in unknown quantities.  </p><p>Where to begin?  I have had numerous experiences with mind-altering substances, including LSD, mescaline, psylocibin, and various other chemicals.  I've even had a few trips with 2C-E. 2C-I, 2C-D, and even 2C-C, with no real adverse side-effects.  I do take an SSRI anti-depressant and a benzodiazepine, along with various vitamins and herbs.  </p><p>OK, here we go.  I arrive at work in the a.m., check the assignment list.  Good, only some computer reports, and not much else but some 'manual' labor.  I take my capsule (an empty one that had an herbal mixture in it) which I had pretty much filled to about 75% with 2C-C.  [Erowid Note: 100 mgs of 2C-C is considered a very high dose, see 2C-C Dose Chart]</p><p>After reading the rather benign reports about this substance I was expecting a slow and easy ride, somewhat 'trippy,' but also lethargic.  I didn't notice much for about 2 hours, and was able to concentrate on my computer work without any problems.  I thought it would be like most other times at work: a nice buzz, good visuals, little communication problems, and so on.  Then it happened.  </p><p>I was somewhere totally out of my ability to describe.  My body was miserable, my mind was going.  The people I worked with that day began to look at me funny.  I know my eyes were HUGE.  All effort was put into one thing - keeping my sanity.  My body felt like it was alternately hot and cold for every millimeter of skin.  I thought seriously about going to the ER, as I felt like I was about to have a stroke.  Lunch time was worse.  Some movie was on, and this woman with black, drippy eyes was sitting in her warped bed, turning the light on and off, on and off.  </p><p>What was happening to me?  I realized I had taken too much.  Diarrhea, chills, hot flashes, lack of coordination - NOTHING was pleasant, EVERYTHING was awful!  Why did I do this stupid thing?  </p><p>Hours later when it was time to go home, I was still sick as a dog.  A huge thunderstorm was raging outside, and the lightning and thunder were a suitable backdrop to my damaged mind.  My good wife (who knows nothing of my experiments) had fixed a wonderful meal, which I could not appreciate at all.  I feigned sickness and took a hot shower.  I found some powerful benzos in the cabinet, also some Darvon - took that too.  Hours later I was still sick, and took some antipsychotics that had belonged to a family member.  Put me to sleep, but I was literally sick for 5 days.  </p><p>Two weeks later I was still seeing trails.  In short, I came close to doing permanent damage to my mind and body.  PLEASE don't play around with the dosages of this or any chemical, regardless of how glowing the reports might be.  As my name implies, I do most of my tripping at work, but after this time, I felt like a RAT.</p>"
}
