{
 "title": "Conversational Weirdness",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Conversational Weirdness: experience with Amanita muscaria (ID 365)\". Erowid.org. Jun 11, 2000. erowid.org/exp/365",
 "substance": "Amanita muscaria",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Amanitas",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "",
   "365",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 11, 2000",
   "Views: 48821",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was in the woods of oregon and found some A. muscaria, one 'medium sized' mushroom was split between three people (as stated by others, a low dose was desired in order not to be caught off-guard, as it was a first experience for all three people). The cap was about 4 1/2 inches in diameter. the entire mushroom was split between three people, with the smallest person taking none of the stem (thus the other two people consumed more matter).</p><p>The effects noted began manifesting shortly, although subtly at first. A distinct nausea was noted by all, which was probably not added to by the consumption of burritos. =)</p><p>All three agreed that things appeared to not remain true to their typical proportions, although the smallest of the three individuals appeared to experience it most prominently. that is, although nothing really grew or shrank, things (desk, window, etc.) somehow seemed as though they were bigger or smaller than they were normally.</p><p>A body euphoria was experienced as well, although the nausea was the main stumbling block in this experience. Motor impairment was also experienced, although it seemed that said impairment would not detract from the pleasure of movement. Unfortunately, the nausea in the case of the smallest individual was severe enough to prevent the desire for most movement.</p><p>Desire for linear conversation also diminished, and the experiencing of the senses dominated the occasion. music appreciation was enhanced, but one of the people opined as to how it was not enhanced to nearly the same degree as would be experienced with lysergic acid, psilocybin-based mushrooms, c. sativa, or GHB.</p><p>There was a degree of mental 'discomfort' in the mind of the smallest individual (who most likely took the largest dose based on body weight, despite the attempts to even it out). As described my others a great deal of 'conversational weirdness' took place, in the forms of inadequate expression and unusual lines of conversation. the 'hallucinosis' described occurred also, as previously mentioned. not out-and-out visual hallucination, but rather a sense that things 'seemed' as though one were hallucinating quite prominently. This, I believe, could relate to A. muscaria's reputation as a deliriogen, causing the individuals to *believe* that things were moving and growing/shrinking, although they did not necessarily look as though they were.</p><p>Eventually, the smallest person in the dream excused herself to the bathroom to vomit, having not been able to conquer the nausea. She returned and reported that she felt much better, and the experience proceeded without the impairment of that negative feeling. Effects lasted probably a total of three hours. although, this is an inaccurate estimate, since once the three trippers felt they had returned to baseline, they proceeded to consume 1/4 dried oz each of cubensis mushrooms (spread over a period of one hour).</p><p>A. muscaria seemed to be an interesting and different experience from more usual entheogens. It also seemed like something that should be approached with extreme care. A higher dose for the trippers quite possibly would have caused more prominent and possibly unusual effects (such as much more vivid delusions). It seems an avenue worth exploring (from the land of Nod, of course), but also one that should be approached with respect and with caution.</p>"
}
