{
 "title": "Cell of Insanity",
 "author": "Nikki6",
 "citation": " Nikki6. \"Cell of Insanity: experience with Mushrooms (ID 36518)\". Erowid.org. Feb 25, 2008. erowid.org/exp/36518",
 "substance": "Mushrooms",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "2 caps",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2004",
   "36518",
   "Male",
   "",
   "Not Given",
   "Feb 25, 2008",
   "3468",
   " "
  ]
 ],
 "report": "<p>At the time this took place i was 17 years old and i had only tried shrooms 2 times prior to this. Those 2 experiences were both very fun and introspective trips. </p><p>It all started off on a friday night. I was sitting alone in my living room when my cell phone rang. It was a guy i knew named Jeremy. he explained to me that he had just gone shroom picking and asked if i had wanted to buy any, i was ecstatic to hear this because shrooms had been very hard to come by for many months prior to this, so i responded by saying 'Hell ya!'. He said 'Alright man meet me at the grocery store and ill hook you up.' </p><p>Before i left for the store i called my friends Jake and  Adam because they had been telling me they were dying to try shrooms, and i told them 'Jeremy just called and has some shrooms, yall want any?' they told me to just buy however many i would for them and they would pay me back. so i bought a total of 10 shrooms for i think $10-$15 i dont really remember and i headed over to my friend Mike's house to meet everyone who were all there having a Reno 911! party. </p><p>When i arrived there was about 12 people there including adam and jake, i told them to come outside and i gave adam 3 shrooms and jake 5 and told them to down them with the donuts inside. I only ate 2 shrooms but it is important to note that i am a big person and one of these mushrooms was as big as my whole hand extended. It was the biggest one ive ever seen in my life, eating it was probably like eating 4-5 regular sized mushrooms. </p><p>While we were eating our shrooms Adam asked if we were supposed to eat the stems of the mushrooms, i did not know because i was also relatively inexperienced with shrooms and had not done them in years so i called my friend charles. I asked him 'Hey dude are you supposed to eat the stems on shrooms' i dont know if he was trying to mess with me or if he was serious but he said 'Yah man get all that stuff up in ya' so we ate all our shrooms, stems and all.  </p><p>We waited about 20 minutes before we all had to part ways due to curfew (midnight). As i got home i was completely sober so i decided to put on Lord of the rings: Return of the King and wait for my trip to begin. i remember feeling incredibly iritated while watching the movie, constantly tossing and turning and feeling a little bit different. about half way through the movie i looked at my shutters and they were swirling slightly. Since this was about 1 1/2 hours after i had eaten the mushrooms and i was only slightly tripping i thought i had not eaten enough so i decided to go to sleep. As i tried to sleep i kept getting a pain in all of my joints that made me cringe up in a fetal position over time. i started getting very angry laying in my bed in pain not able to sleep. </p><p>This is when reality and all that is good and sane in my world plummeted into the abyss. i remember stretching my neck into the air and moving my mouth in weird motions. all of a sudden i started howling. i recognized in my mind that i was acting like a madman but i could not control it no matter how hard i tried. my mind and body were 2 seperate beings. my joints ached horribly and i was still cringed up in a fetal position but i decided to walk across my room to my computer to talk to someone and hopefully regain control. As i walked my knees were bent as were my arms, i looked like i was about to pounce on someone. I then got on the computer and tried to talk to a friend of mine and telling her that i was in hell. she had no clue what i was talking about and said 'your creeping me out, goodbye' and she signed off. </p><p>No one else to talk to was online so i decided id try to go back to sleep, as i walked back to my bed my bones ached with unbearable pain. when i got in the bed i remember lying there laughing with the most insane, evil laughter i had ever heard in my life. it seemed i laughed for hours. it was at this point at which the thought that i was possessed crossed my mind. It made so much sense at the time that a demon was controlling me and that is why my mind could not control my own actions. as i laid in my bed i began to try and give myself an exorcism. i remember whispering to myself the name 'michael' over and over again.(when i was younger my friend had told me that the archangel michael had banished all the demons from heaven and if you said his name in the presence of a demon the demon would lose its power and run away in fear). it didnt work, so i walked into the bathroom to look at my newly immortal and evil self. </p><p>As i stared at my face in the mirror my skin pulsated and my face would be as fat as a pumpkin then as small as a wine bottle. it was in my bathroom that i started to plan out world domination while sitting on my toilet and how i would terrorize the world when i became the leader, as my armies of darkness walked the land. my maniacal laughter continued. heavy visuals started setting in, the room was spinning and it looked like a painting that had been  slighty smeared everywhere. i decided i needed help to regain my sanity because i was going somewhere psychologically that no human should experience. i didnt have my cell phone in the room with me, it was in the kitchen, i feared leaving my brothers room to get it because i didnt want to wake my parents, so i grabbed the house phone in his room and dialed the only number i could remember off the top of my head, my friend corey. </p><p>At this point it was about 2:30 am so when he answered he was half asleep. i remember him saying 'Will, is that you?' i said 'Will, isnt with us anymore, only i am here, and i have gone insane.' He was still half asleep and just said 'what the hell are you talking about', i responded 'He ate mushrooms and lost his mind, there is no longer Will.' he said 'Ummmm OK, why are you calling', i said 'I want Jakes number', he gave me the number and i thanked him and hung up. around this time i couldnt stop itching myself on my arms and my neck and i started howling involuntarily again. I managed to dial jake's number and when he answered all i heard was chewing. I said 'Ive gone insane Jake, my mind is gone' then i laughed evilly again. all i heard was chewing still. I got annoyed and hung up. </p><p>I laid in my bed and decided to myself that i had to regain some control over the mushrooms. I decided to put in my Kiss:Symphony DVD. as i tried to watch it the DVD seemed to play much faster than normal, so fast that the songs were undistinguishable to me. every 5 seconds seemed to take a second to play, and the pictures moved so fast it hurt my eyes. i turned off the dvd and laid in darkness. i realized that this was not a normal trip nor a bad trip, that something was incredibly wrong here. I started thinking about how jeremy wasnt a company with a license to pick shrooms and he might easily mess up and pick the wrong ones. this scared my incredibly because i knew the wrong kind of shrooms could kill you if eaten. </p><p>I began to have the most morib thoughts of death that no person who has never experienced  a 'bad trip' could possibly fathom. I went in my bathroom for one last chance to get myself together before i knew i would have to tell my parents what happened so they could get me to the hospital. This was something i did not want to do because a few people had recently told my parents i did cocaine and they were royally pissed at me. as i stared at myself in the mirror my eyes began swirling in my head, i started to cry because i 'knew' i was dying and there was no doubt about it that i wasnt going to live through this. i grabbed the phone and tried to call my brother and ask him what to do (who was at college at the time) and he did not answer. I tried to call corey back and he didnt answer. i said to myself 'This is it, you have to put your pants on and go face the music, you screwed up and you have to pay for it.' </p><p>I stood in the middle of my brothers room crying with the phone in my hand trying desperately (and failing) to put my pants on. at this point the visuals were so heavy it looked like someone had put an oil painting in a lake and smeared the colors everywhere. I no longer knew where i was. I tried to call corey one last time but i couldnt see the phone anymore. I felt myself beginning to fall and in an instant all the thoughts id had of death raced through my head, i thought that was the last moment of my life and i was falling to death. </p><p>I screamed in fear and ran torwards the door hurdling over things and i threw the door open to find my dad in the living room watching tv ( hes an insomniac) and i threw the phone across the room and told him i was dying. he said 'what the hell!?!' I said ' someone sold me some bad mushrooms and im dying man, im F*cking dying). he stared at me with a pissed off look and said 'go back to bed now'. All i could say was 'F*ck' over and over. i went to bed and he came in there and slept in the room with me, we laid there both awake and i tried to talk to him like he was my friend, i said 'Dude, you wont believe what im seeing', and he said 'Shut Up!' </p><p>Around 4:30am the phone rang, my dad answered, it was jake's dad. jake was in the hospital they didnt know what was wrong with him, they had walked in his room and he had eaten his retainers, and was chewing on an extension chord. they couldnt make him talk to them for about 10 minutes so they called an ambulance. They thought he had overdosed on meth or something but my dad told them what happened. </p><p>I didnt see anyone i knew for like a week after because i was grounded. finally i saw adam again and i asked what had happened to him but to this day im not really sure, he doesnt like to talk about it. jake and me obviously got in a shite load of trouble. so thats it, i hope you enjoyed it, i know it was really long but i didnt want to leave out any details. i hope my story might have helped someone out there, anyway in the future be safe and cautious. always have a sitter. Good luck.</p>"
}
