{
 "title": "The Good and the Bad",
 "author": "Sekktor",
 "citation": "   Sekktor. \"The Good and the Bad: experience with H. B. Woodrose & Cannabis (ID 36524)\". Erowid.org. Jan 8, 2008. erowid.org/exp/36524",
 "substance": "H. B. Woodrose & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)",
   "  T+ 2:30",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   " ",
   "  T+ 3:41",
   "9 seeds",
   "oral",
   "H.B. Woodrose",
   " ",
   "  T+ 8:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "36524",
   "Male",
   " ",
   "Not Given",
   "Jan 8, 2008",
   "3172",
   " "
  ]
 ],
 "report": "<p>I had been reading about a bunch of different `legal' highs that I could purchase, and came across `Hawaiian Baby Woodrose' seeds. Up until now, the only other hallucinogens I've ever tried are shrooms and DXM. I'm also a frequent cannabis smoker and also smoke cigarettes.</p><p>The day started out good, I awoke at 8:00, went to my only class of the day, and came back to my dorm, where a package was waiting for me. It contained a package of 50 Hawaiian Baby Woodrose seeds (Hawaiian strain). Mindset was great, I sat down and meditated for a while. I hadn't eaten anything that day, took my daily vitamins (Multivitamin, Vitamin C (500mg), and Vitamin B). Earlier in the day I chewed on a package of Betel Nut chew.</p><p>10:30: I scraped off 7 seeds, put into a coffee grinder, let sit in cold water.</p><p>11:26: Drank the mixture. Didn't taste bad, although it was a bit gritty.</p><p>11:56: A bit of nausea, vision was a little strobey, a body buzz started to come on. At this time, my friend M came over, and I walked over to his dorm to hang out for a little bit. Decided to go back when he finished packing to go home.</p><p>12:11: Back in the dorm room, starting to feel something a bit different. Vision wasn't much different, although colours were quite a bit brighter.</p><p>1:00: My log says `Yep.', so I'm guessing this was when I started seeing visuals. During the majority of my trip I was laying down on my bed, back down, looking at the ceiling. My ceiling is heavily textured, and I began to see what looked to be writing. I couldn't make out what it said, but it definately looked like some sort of cursive. About this time, I started noticing a bit of fluttering in the walls and celing. I decided to take 4 more seeds to bring me up to 11. </p><p>1:52: Full blown visuals, body buzz built up to an amazing jolt of energy. Smoked some weed to get rid of nausea. Thought patterns were extremely racy, I couldn't get a hold on a specific thought.</p><p>2:11: A maintenance worker came in to check to see if my roommate's light had been fixed, I managed to tell him that it was and that they were out of town. I acted like I was sleeping. Looked in the mirror, eyes were extremely dilated, couldn't see my iris anymore. Bad move, took 9 more seeds. My thought was `Well, I can only live once'.</p><p>(Lost track of time for a few hours after this)</p><p>3:00-5:00: We had 3 fire alarms during this two hour block. I was tripping very heavily, and felt very afraid that everyone knew that I was tripping. This is where the trip turned bad. Every time I would go back to my room, I would keep hearing the fire alarms, and it began to make me very agitated and worried. </p><p>6:30: I tried to smoke some weed, but the second the hit came into my lungs, I vomited. And if I thought it couldn't get any worse, it did. I began to think `Oh my god. I am not going to come down. I am going to die. I will never do drugs again.'. This continued for about an hour and a half. I was sweating profusely. Vision was something I had no recollection of. Everything was rocking, spinning. The celing was tilting. My television began to look like it was melting. In a more positive state of mind, I would have enjoyed this thorougly, but due to the circumstances, It disturbed me terribly.</p><p>8:00: Still tripping, but more managable. I talked to a friend of mine online, trying to get him to help me make sense of this whole ordeal. I decided to go take a shower. Very good idea. It was extremely enjoyable. Each individual drop looked like it was dancing; The warm water felt very good on my body. I get dressed in my pajamas, and head to the kitchen for a glass of water and a bowl of miso soup. Return to my room and listen to some music (Pinback).</p><p>9:30: My roommate comes home. Our dorms are actually apartments, so everyone has a seperate bedroom. My door was locked, but he loves to chatter about random stuff, so he knocked on my door. I acted like I was asleep.</p><p>3:30: What happened? I don't think I went to sleep (Although I could have, since I was lying under my blankets, pulled over my head so I could have complete darkness. Still having minor visuals, vision started to fade a bit, but then came back, and I saw a fractal pattern covering everything.</p><p>4:20 (Ironic): I smoke some weed to calm down, works well, and am able to sleep.</p><p>The next day I awoke, actually feeling refreshed, although I have this nasty taste in my mouth; A nasty, eartly flavour, almost like the scent of compost. I tried to make out what happened, and I'm guessing that after the fire alarms sounded, I got extremely nervous, or that extremely large dosage could've hit during that time, and I wasn't ready for it.</p>"
}
