{
 "title": "The Love",
 "author": "Kanonpfj",
 "citation": "Citation:   Kanonpfj. \"The Love: experience with MDMA (Ecstasy) (ID 36561)\". Erowid.org. May 30, 2007. erowid.org/exp/36561",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36561",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 30, 2007",
   "Views: 4032",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nIts hard to write this and not feel a vague sense of loss.  Im actually writing this the day after an E trip, so naturally I feel a little drained.  The comedown wasnt that hard this time, which is surprising.  For me, it was mind over matter, and thus I dont really feel that harsh comedown that sometimes accompanies an E trip.  I only say this as I intend to explain how ecstasy has fit into my life, and how Ive learned to take it.\r\nFirst off, I havent taken E a lot; as of this writing, Im still a relative amateur to the E scene.  Im not an amateur to drugs- I smoke pot every day and dabble in the occasional hallucinogen.  Every drug I have done has been a learning experience for me.  In a sense, for me, its not just about the recreational use of the drugs; I love it, dont get me wrong, but Ive always felt that drugs, when used exactly right and exactly at the right time, can give us a glimpse of pure enlightenment.  I dont think such a state can be fully reached with the aid of drugs, because the effects of drugs are only temporary, but in the meantime, at least we can get a glimpse of what it feels like to be at peace with the world.\r\nWell, no other drug has taken me as close as ecstasy has.  Its a powerful drug; I learned that the first night I took it.  The first night felt like there was magic in the air and all of the people around me, just a large group of friends dancing and talking in someones basement.  It was the perfect atmosphere, perfect vibe.  Those are the two key elements to a brilliant roll, whether I do it at a rave or in the company of close friends, or even by myself.  Without the proper setting, the experience will be noticeably muted in comparison to the untapped potential.\r\nIts hard to know how to begin talking about the actual experiences Ive had.  Where do I start, to the music Ive danced to, or the intense conversations Ive had with people?  I found myself engaged in wonderful conversation with a small group of us that were rolling.  I found out they all had the same interests as I did, and we talked openly about our own writing, not feeling inhibited by our own ideas and listening to each others ideas with equal utmost attention.  I loved it, and it helped me open up to new parts of the ecstasy experience; listening to each other.  I find myself engaged in anything anyone has to say, and I find it terribly fascinating.  Because we all had a connection.  We were all rolling, but it wasnt just the synthetic pill.  It was the time, the place, the people.\r\nSome people wonder what happened to the love generation of the 60s.  I myself would have liked to have grown up in that time, but I find myself enthralled to be able to reach a state of mind where everyone has nothing but love for one another.  Im heterosexual, but while on E it just didnt matter.  I let a guy sit on my lap, and there wasnt one feeling of ambivalence, not one feeling that I was doing something wrong.  I was just sharing a connection.  Thats what rolling is about, sharing the magic with each other through any form of communication, whether it is through speech or touch.  At one point, someone asked the crowd, Cant you feel the love in this room?  And yes, we all could.  It was about the love and the acceptance we had for one another.\r\nTaking ecstasy is akin to sprinkling magic dust over my surroundings, but the downside is that the magic does not last forever.  It is a beautiful drug and a beautiful feeling, but when the come down begins, there is sometimes a sense that something has been lost and will never be obtained again.  I remember the first time I rolled, I wanted the night to last forever.  When I realized it couldnt, that such nights never last forever or even half as long as you want them to, it brought me down.  I was given a taste of pure enlightenment and then had it yanked from me as fast as it came.\r\nBut thats not really the case.  I always take something away from my rolls.  I became much more outgoing after the ex had worn off.  This time, the comedown was not harsh for me at all.  Smoking weed at the end of it did help, but what also helped was knowing that the magic from that night may be gone, but Im still here and Im a better person for it.  There was so much bonding that went on between us, and there is a twinge of melancholy knowing that Ill never have another night that will be exactly the same as that.  But at the same time, Im going to go off and make better experiences for myself.  I dont need to roll all the time, but I do need that reminder from time to time about how beautiful and wonderful we can all allow ourselves to be to each other.  \r\nI look at every person as Im rolling, and I love every one of them.  While on E, I dont mind kissing a guy or girl at all, because I see them as beautiful and compassionate human beings, all of which deserve love.  Sure, Id like to live my life feeling like I do when Im rolling all the time, but I know that such magic is powerful and doesnt last forever, as much as wed like it to.  We can use drugs for enlightenment, but we also must realize that there is a world outside of us too that doesnt condone what we do.  We cant explain to the people that live in utter complacency how wonderful our drug experiences are, because they will not open their mind to the possibility.  Thats unfortunate, but its up to us, our generation, to make sure we never slip into a complacent state of mind like our elders.\r\nThe ad slogans say that drugs arent the answer.  Of course they arent.  But what is?  Maybe its not important to look for an answer, because I doubt well ever find one.  We need to do what feels right for us.  I dont know if I can ever reach pure enlightenment, but in the meantime, I can get a tantalizing glimpse into it.  For me, thats all I need.\n\n\n"
}