{
 "title": "Where is Reality?",
 "author": "raynetre",
 "citation": "   raynetre. \"Where is Reality?: experience with Salvia divinorum (ID 3656)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3656",
 "substance": "Salvia divinorum",
 "bodyweight": "93 lb",
 "header": [
  [
   "DOSE:",
   "333 mg",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3656",
   "Female",
   " ",
   "Not Given",
   "Dec 25, 2001",
   "Views: 3612",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was reacently told about the mighty salvia plant by a friend of mine.  He was well aware that I am into psychedelics and thought that I might be interested in the salvia experience.  He briefly told me about the basics of the plant.  I decided that I was going to do some research and then I would decided whether or not to try it.  After a few days of research, especially on erowid, I decided that I wanted this new experience.  My friend informed me that i could purchase the dried leaves for $4.00 a gram at a smoke shop near by.  I bought my salvia and smoked three small bowls of the plant with two other frineds.  It was the first encounter of the plant for all three of us.  Unfortunatly none of us felt any effects, or so we think.  I knew that this might happen.  I had be notified from my friend that told me about salvia that it takes a few times for it to work.</p><p>A couple days later my friend Jaden and I decided to try smoking the 1/2-1/3 gram that I had left.  We smoked two large bowls back to back.  After we were done we went into the other room.  Walking was incredibly hard.  I wanted to walk, but my legs didn't, so I decided to lay on the couch and relax.  In Jaden's room the perimeter of the walls are lined with the backs of audio cd's.  I was looking at the prisims that reflected light created on the cd.  Some prisims contained all color of light and others reflected only one or two colors strongly.  The way I perceived this image was that the full prisims were new souls, the new borns, that had the full prisim or characteristics.  As these souls grow these characteristics are filtered and become that part of the soul.  The cd's that had only a few distinct visible colors were older souls that had gone through the 'growth' or chracter filtration process.  There were other cd's that had a spliting prism in the center of the cd.  These were the 'teenager' souls that were going through the filtration process in order to find their true self.</p><p>This evalutaion of prisims lasted about twenty to thirty minutes.  Which was the peak of my salvia experience.  After a while, about thirty more minutes, most effects were gone.  At around 4:30am I decided to go back to my place to crash.  Unfortuanly I couldn't go to sleep due to a 2am nap I had had earlier.  At around 7:30am I decided to force myself to sleep.  Due to the fact that I was forcing myself to sleep it wasn't a very resting one.  I kept waking up and tossing.  Finally I got to sleep a little deeper, but my pet mouse;Rikki, had somehow escaped out of her cage and climbed in my bed to convenantly wake me up.  I tossed and turned a bit and decided to worry about her damaged cage later and just let her run around while I slept.  As I was asleep I could feel her running over my legs and eventually next to my left side.  I opened my eyes to see her, but to my suprise i saw a white rabbit.  I don't own a white rabbit.  I figured that i had just woken up into a dream.  I'm sure all of us have done this at least once in our lives.  I rolled back over and went to sleep, or continued to sleep depending on how you look at it.</p><p>Later that morning i was shooken awake by my friend greg who wanted me to go to lunch with him.  I told him to give me five more mintues of sleep.  He agreed and I went back to my resting state.  A little bit later a loud noise woke me up again and I found greg and his roommate waiting for me.  At this point in time i was confused on what was reality.  I had been waking and sleeping back and forth all night, and I was begining to get realities confused.  I turned towards my friend and said,'I'm going to sound crazy, but I've had a rough night.  Please just answer me one thing.  Are you real?'  He said,' Yes sweetie I am real.'  At that I reached over and gave him a huge hug to prove to my self that I had found reality.  'Maybe you should get a few more minutes of sleep.' Greg said.  I agreed and rolled back over.  In what seemed like a few minutes later I woke up again.  I looked around my room to find it empty.  Greg and his roommate were nowhere to be found, the door to my room was dead bolted and locked, and my pet mouse was sound asleep in her perfect condition cage.  Everything was a dream, in a dream, in a dream, in a dream, in a dream.  None of it was reality even though that I perceived it as reality and would have sworn that it was reality.  It was not reality.</p><p>The next day I was talking to my friend that had first told me about salvia.  I told him about my dream/reality experience.  I explained that Jaden had thought that I had had a flashback from other psychedelic experinces when I was sleeping.  However, my friend said that he found it very interesting that I had had that dream/reality experience.  Apparently he had a simliar experience after smoking salvia.</p><p>One night he smoked some of the dried leaves.  Afterwards he was a bit tired, so he layed down to sleep. When he woke up he was in Mertyl Beach.  He remembers walking up and down the board walk, relaxing on the beach, and even riding the rollercoasters on the pier.  He woke up to find himself in his room, even though he would have sworn that he was in Mertyl Beach minutes before.</p><p>Even though salvia was a wonderful experience.  The dream/reality experience isn't something I want to strive for again.  However, I am still willing to take that chance in order to see what the green plant has in store for me in the future.</p>"
}
