{
 "title": "Constant Loop of Trying to Get Away",
 "author": "Adam",
 "citation": "   Adam. \"Constant Loop of Trying to Get Away: experience with Salvia  divinorum (15x extract) (ID 36579)\". Erowid.org. Sep 15, 2004. erowid.org/exp/36579",
 "substance": "Salvia  divinorum (15x extract)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36579",
   "Male",
   " ",
   "Not Given",
   "Sep 15, 2004",
   "Views: 6977",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was saturday afternoon and I was in my girlfriends apartment in the St. Petersburg, FL area during Hurricane Francis. My good friend went to a local smoke shop and purchased the 15X salvia the night before and tried it once himself. He had a hard time explaining his experience and its intensity so decided to come over and let my girlfriend and I try it (only after warning us). He showed up at 2:00 pm where we headed into this small bathroom, being the only place smoking isn't prohibited. My girlfriend took what seemed like three good hits and soon started laughing hysterically and speaking in word salads. She then proceded to go out of the bathroom and lay in her bed. She told me 'her skin felt as if it was boiling from the inside out' and just wanted to lie down. </p><p>I saw how she was mildly coherent, so I figured all was well and went back into the bathroom. My friend who was currently in there had cleared the rest of the contents of the previous bowl and packed a new one for me. I was smoking out of a 12' water pipe with ice in it. I didn't know how easy it was to inhale with ice cold water so I hit as hard as I could. I managed to smoke the entire contents of the bowl and held it in as long as I could. The last thing experienced in 'this' reality was answering my friend that I was ok, seeing smoke come out of my mouth while doing so. Patterns shifted on the floor and then dissappeared into a black void.</p><p>The next thing I realize is that I am in an atmospherically void area, and there was nothing around. I understood that I was a presence but I had no physical characteristics, just an entity. I could feel myself taking shape almost as if I had just been born, and in the process of myself taking shape and entity of some sort appeared beside me. I could feel him try to communite [?] with me but I was so confused that in this realm I could only do a short quick movement almost like I was trying to run away. But in the middle of my sprint I was pulled back into the same position that I had started from. From there on out I was stuck in this constant loop of trying get away but being pulled back, identical from the experience seconds ago. I thought that I was experiencing death and I was on the journey to enter another existence even though my movements made no advance in this void that I was currently existing in. I was panicking, I didn't know what to make of anything, and worse yet I didn't know if was going to stop. </p><p>Finally after what seemed like 10 minutes the entity that was controlling my actions appeared clearly before me (before it was just a presence) and It was my friend who was actually taking care of me (even if I didn't know it at the time) and asked if I was ok. As that happened the violent spinning led to feeling pushed, as if my spirit was pushed back into my body, where I came to in her living room, head leaned up against the wall.  Later on my friend told me that however quiet and belligerent I was I was responsive to him interacting with me, but I wasn't the same person. My general mannerisms were that of someone else, and I took on that different form when I unlocked the bathroom door, walked slowly into the living room, yelled lightly 'Oh my god!' and then banged my head against the wall. The noises startled my girlfriend, where she proceded to run out of the bedroom to check on me. After I realized that I was back in my reality I couldn't make sense of what happened and felt mildly irritable. Within a 1/2 hour I felt as if nothing had happened and could barely remember the experience until I dreamt my experience that evening, hearing a pleasant woman say 'Its okay' when I woke up from the dream.</p>"
}
