{
 "title": "Fever",
 "author": "Some dumb kid",
 "citation": "   Some dumb kid. \"Fever: experience with Diphenhydramine (Benadryl) (ID 36577)\". Erowid.org. Sep 28, 2004. erowid.org/exp/36577",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "6 tablets",
   "oral",
   "Diphenhydramine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36577",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 28, 2004",
   "Views: 14665",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had just got back from my friends house, which was after my friday night football game.  I was fairly tired and sore/weak, and went there so I could socialize and smoke some 27's before I left for the labor day weekend.  I'd been researching all kinds of drugs on erowid.org, and had decided to try benadryl, since it was readily available (everyone in my family is an allery-sufferer). So I got home at about 11:20, very fatigued and bored.  I popped in my 'SNL-The Best of Will Ferrel' DVD and plopped into my comfy leather recliner for some relaxation.  I had nothin to drink, so I decided to go upstairs and get whatever benadryl I could muster.  I found 6 of them, and immediately took them, it was about 11:35 now. I had never taken any hallucinogen so naturally I was pumped up for some flying elephant images and such, but I found out that I was just ignorant...<br>I sat back down on my recliner and started watching my DVD.  About ten minutes into the movie I suddenly realized that I had to go piss, so I did.  I felt like I was pissing razor blades and I don't know why. At almost 12:00, I was still watching the movie, but I felt euphoric for the first time, laughing quietly to myself about anything and everything.  I went to piss again. When I got up to use the facilities the second time, my body was very heavy and I almost fell several times upon my sister who was sleeping on my family room floor.  I also almost lost my balance when I was going pee, and couldn't quite hit the hole very well.  I finished the movie and stumbled upstair to go to sleep, because I hadn't seen any visual effects for the last hour or so.  So I turned on my room's stereo and listened to music from the Diablo II soundtrack (some erie instrumental type music) and thought that sleep would come easily.  But it didn't.<br>I kept hearing things that I knew were not from the music, just wierd noises that I can't really explain.  I kept on hearing someone calling my name, and I kept yelling ,'WHAT?!' even though no one was awake at my house until my mom heard me yelling and came in.  She said that no one was calling for me.  She said to go to bed because we were going to travel to the Twin Cities in the morning (6 hours from my Iowa residence). I forgot that I was even listening to music and just layed awake on my futon.  I felt very cold and uncomfortable.  I began twitching at about 1:10 still lying in bed.  These were uncontrollable and frequent, about once every 10 seconds or so.  I was grinding my teeth to try and forget about them.  I soon fell asleep after about 20 minutes of twitching. <br>I awoke the next morning at about 9 o'clock and felt like crap.  My head hurt like hell and I felt very very hot, like there was a heater right next to me.  I went downstairs for some coffee and went back to bed 10 minutes later.  My mom came in and asked how I was, and I told her that I didn't feel good.  She took my temperature and reported that I had a slight fever of 99 degrees or so.  I got in my van and slept for 6 hours all the way to Minneapolis and felt like shit for the rest of the day at the Mall of America, and was very irritable.<br>I wouldn't highly recommend this to anyone, but I think (as stupid as this may sound) that I might try it again another time when I wasn't fatigued and tired, so that I might see some visuals.\n\n\n"
}
