{
 "title": "Neverending Night",
 "author": "VeXor",
 "citation": "   VeXor. \"Neverending Night: experience with LSD & Cannabis (ID 36596)\". Erowid.org. Nov 3, 2007. erowid.org/exp/36596",
 "substance": "LSD & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 3:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 4:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "36596",
   "Male",
   " ",
   "Not Given",
   "Nov 3, 2007",
   "3028",
   " "
  ]
 ],
 "report": "<p>December 31, 2003 new years eve - parents are gone for 8 days</p><p>Well my cousin (Ill just refer to him as Chad) was telling me about acid for a while and all the stuff that can happen. He told me that things will bend, strech, change colors, and change sizes. He also told me that when I trip I should always be with someone, never leave their side. Im up to try any drug as long as I have a safe environment to do it in. Because I get really messed up when I smoke pot I was thinking that I should just try a little hit of acid to make sure I dont freak out, this is 3 days prior to the night of 4 hits. I get some from a good friend across the street, I take the half a hit and I get mild bendings with the walls in my basement, thats all. So I decided that Im fine with it and that next time I do it Ill go all the way.</p><p>Im at work a couple block down the street and Chad pulls up completely out of nowhere. I didnt realize it was him because he lives about 1 hour away. He shows up at my work and tells me that he has acid in his car, and that he can stay the night and stuff. My work closed early for New Years Eve at 8 pm. So I punch out and as soon as we get in the car to ride back to my house and are pulling out of my work we each take 1 tab. He tells me that it wont kick in for about an hour. So we go back to my house and drink as much orange juice as we possible can.</p><p>9:00 pm</p><p>We popped another tab. Then I tell Chad about my friend across the street who gave me some before (Ill refer to him as Carey). We decide to go to his house and buy some more, so he says he has this Willy Wonka acid, so I buy 5 hits. Then Carey and is little sister (12 years old) along with me and Chad go to my house and wait for it to kick in. We get the acid that I just bought out and cut it with scissors/tweezers combo. I give a hit to Carey. We talk for about a half an hour then I start to feel like I wanted to just listen to music and be calm. </p><p>10:00 pm</p><p>So I go into my room and put on some techno. I proceed to turn it up very loud, I have no clue why I did this. Then I close my door and lay on the ground while I listen and feel the music flowing around the room. I felt like I fell asleep and then woke up feeling rejuvenated, I thought I had been there about 3-4 hours maybe.</p><p>10:05</p><p>I walk back into my kitchen and see that everyone is still there. I ask them why they are still here and how they have been talking all this time, I mention that I must have been in my room for about 4 hours. They tell me that Im just trippin already and that Ive only been gone 5 minutes. I looked at the clock and was amazed about how this could be possible. We then go up on top of my balcony and roll this fat joint which we all smoked. (keep in mind that I havent actually seen anything yet). Then the visuals kicked in for me and I was seeing all this crazy shit that I cant really explain. Ive seen my neighbors house get blown away in the wind, all the tress surrounding we reaching towards me trying to grab me. The shadows of the tree branches on my deck danced around playfully and I was in my own world all by myself.</p><p>I remember rolling around the floor and saying 'woooooooo', 'weeeeeeeeeeee'. This is when we went inside, Carey and his sister we going to be going soon. We walked outside with them and I wanted to smoke a cigarette, so I pulled out a lighter and acted as if the cigarette was a bong. Then I saw my wall that had dirt on it but it looked like crawling ants all over the wall. Carey and his sister left. I then staggered over to my refrigerator and grabbed nacho cheese sauce, frozen soft pretzels and frozen waffles. I put all this huge bowl of nacho cheese into the microwave then when it was really hot I took it out. </p><p>Then I put the frozen pretzel in, which I was watching through the microwave glass. This pretzel had some kid of power than was drawing me to it, and I couldnt look away, this pretzel in about 30 seconds time slowly formed the outline of a face that kept popping out, and I was scared and I told Chad what I had seen, and I think he just laughed. We then turned on the tv to some stupid late night show, and neither of us cared so we just turned it on and left it. Then we started to eat the pretzels and they were good, then we for some reason opened the frozen waffles and started dipping them into the nacho cheese sauce and trying to eat them. Then I took one of the frozen waffles and threw it into the bowl of nacho cheese sauce splashing it all over us and on the counter top. </p><p>11:00 pm</p><p>We then popped another tab. Then we went down into my basement where my computer is and looked for trippy pictures to look at. We stared at the 'vortex space' windows desktop wallpaper for a good 20 min. During this time I was explaining how I was flying through this space tunnel with all these flashing colors flying by me and I was going so fast. Chad was trying to picture it as well, then we were both zoooming down this space tunnel in a matter of minutes. Then we started reading stuff about random drugs and the such. During the whole trip I might add Ive been in this what I called a 'fish bowl', which is kind of like being underwater. Things all around me were changing so fast I felt like I was underwater. Not really sure how to explain it.</p><p>Then as we were reading paragraphs and stuff the letters started to become matrix style but horizontally moving instead of vertically moving like in the movie. Then im guessing since my mind was on the subject of the matrix I saw a white rabbit run across the computer screen. After this I went upstairs forgetting that I would be left alone and I heard my dog coming into the kitchen, and I havent been this scared in my whole life, I had this horrible feeling that my dog was coming to eat me and he came towards me and I slowly backed up into the corner, I thought I was done for, I was huddled up into a ball on the floor, and I said in a very scared voice 'nice doggy'. He eventually left and I ran back downstairs and told Chad that my dog was trying to eat me.</p><p>Midnight</p><p>We decide to go for a walk. We brung all the neccessary supplies: a blunt; and cigarettes, I took a cigarette and put it in my mouth and acted like I was smoking it even thought I didnt light it yet, and us just standing there for what seemed about 10 minutes, then we figured the cigarettes weren't lit, so we lit them and started to walk around the block. it was fun and we walked back to my house.</p><p>12:30 pm</p><p>We went upstairs to my deck and while we were walking up the stairs I broke the corner piece of wood off of the top step and I started freaking out about how Im going to caught and that some how I was going to die because my parents have this strict rule that no one is allowed upstaris while they are gone, Ive totally lost my mind I was walking around in a rush talking to myself as fast as my mouth would speak and trying to find a solution to this problem of the broken step. Chad told me that acid takes emotions and make them more intense so just chill out and it will be ok, its only a little piece missing from the step. I hid the piece under my carpet in the basement.</p><p>We then went onto the deck to smoke some cigarettes, we were just smoking and talking and then all of a sudden Chad says something along the lines of hey did you see that ape? I said what ape? He said look here he comes again right over there and he pointed to my neighbors house. I looked and when I did I saw a black ape run from the side of my neighbors house to this little shack in the other yard. I said ya I seen him. Then I was staring at the ground from the deck and letters in order of the alphabet started forming out of the ground. Then I told Chad what I had seen and he was talking about how he wanted to see all the stuff I had been talking about, so we took another tab. I had lost total control over the tabs that I had been eating. Its like I had no choice because no matter what I did, I would just think in my head like a recollection of a memory that I had taken another one. I was realizing everything I did about 5 minutes after it already happened and it came to me as a memory. It was very wierd, but a good wierd.</p><p>2:00 am</p><p>We started to watch tv and I kept seeing out of the corner of my eyes the blinds on the windows being dragged down by some unknown force. I didnt say anything. We watched some sci-fi show that was on and I kept seeing faces being formed inside the characters faces kind of like the pretzel in the microwave, then on the commercials we saw a taco bell commercial. I saw the taco talk to the man holding it in gibberish. And I turned to my right and saw the plant in the corner of the room start to move, it didnt grow legs, it looked like it just started hovering.</p><p>4:00 am </p><p>About at this time we went back down into the basement and sat and talked for a about 3 hours, and I seen Chads face melt off, a floating chair, and the couch I was on turned into a fish tank looking thing where I was sitting on top of all these fish, huge schools of them and I just sat there and looked at them. </p><p>7:00 am</p><p>This is about when I remembered I had to be at work at 9 am. I was trying to figure out how much time this leaves me to sleep. We got an alarm clock from my room upstairs and put it down in the basement and set it for 8:30. But we couldnt sleep. I eventually fell asleep at 8 o clock and got a half an hour of sleep before the alarm woke me up. When I woke up my brain felt like it had been bruised, like it was just worn out and wasnt going to work anymore. I got a ride to work from Chad who drove home after and worked from 9 til 4. I talked to Carey a couple days after, and he said that he went home and watched south park in 3D that night.</p><p>In conclusion, it was one crazy/fun ride and I would definitely do it again. Acid changed me as a person, the way I look at things and how I interpret them. Im changed for the better. I havent felt the same as before I took the acid.</p>"
}
