{
 "title": "Tea Time",
 "author": "Unknown",
 "citation": "   Unknown. \"Tea Time: experience with Ephedra, Cannabis, Lobelia & Lactuca - L. canadensis (ID 36618)\". Erowid.org. May 8, 2007. erowid.org/exp/36618",
 "substance": "Ephedra, Cannabis, Lobelia & Lactuca - L. canadensis",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Ephedra sinica",
   "(tea)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:30",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 6:00",
   "1 cig.",
   "smoked",
   "Lobelia spp.",
   "(plant material)",
   "  T+ 10:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 10:00",
   "  ",
   "smoked",
   "Lactuca - L. canadensis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36618",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 8, 2007",
   "Views: 22029",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>me :</p><p>male</p><p>40 years</p><p>65 kg</p><p>rather good health</p><p>regular pot smoker for several years</p><p>former heavy tobacco smoker, quit around 7 months ago with the help of nicotine patches (for 5 months). Eating a lot of licorice candies, which are bad for blood pressure.</p><p>mindset : interested in trying a psychoactive product.</p><p>preparation :</p><p>About 2 g of ephedra stems (ma huang, ephedra vulgaris)into cold water slowly heated to boiling point, let boiling for 10 minutes, cooled down for 20 minutes.</p><p>T : I drank the tea quickly. There was a brown powder in my cup, I swallowed it to. Ephedra tea had a very good taste and didnt need any sugar. It's one of the best tasting herbal tea I ever drank.</p><p>T + 15mn : My vision seemed a little more accurate, colors were fine. In fact there was no real change but I was more concentrated on my senses. </p><p>T+30 mn : I was feeling a little stupid. When I tried cocaine one year ago, it drove me to a stupid state of mind too, although the claims it makes thoughts fast and clear. I was feeling mildly happy. I started to make grapevine juice with the fruits I collected from my grapevine plant. Breathing was easier than ever, and very pleasant.</p><p>T + 1 h : Time passed quick, I was deeply concentrated on my manual task. I was feeling fine.</p><p>T + 2 h : I finished with the grapevine juice. I was feeling like having energy to spend. I smoked a very little MJ stick. It didnt change my state of mind, except I was more likely to laugh.</p><p>T + 2 h 30 : I smoked a bigger joint with the same result. I'd like to take a walk, but I couldn't cause I was waiting for a friend. I started to worry a bit about my blood pressure because I'm a 'heavy' (5 g / day) licorice eater. </p><p>T + 3 h : I felt something weird with my heart. My heart was pounding at a slightly accelerated rate. I was feeling something weird with my heart, but I guess it had something to do with pot paranoia.</p><p>T + 4h / 4h 30 : At this time, the mental effects like concentration and happyness were fading, while the feeling of having a physical energy didn't change. I started to feel a little tired. Then, my friend arrived and we worked in the garden for an hour. I stopped to care about my heart and I didn't feel tired while working.</p><p>T + 6 h : I was feeling tired. I got a slight ache in the heart area. I was a bit worried about it. I was 'wanting to take something'. Since I quit smoking, psychoactives often ended by the need, sometimes very strong, to smoke tobacco. As time has passed, it was replaced by a slighter need to take some psychoactive substance. So I smoked a cigarette of Lobelia inflata dried leaves. </p><p>I spent the evening working on my computer and then watched a movie. There were unpleasant feelings in the heart area. I had no depression or even pessimistic state of mind when the effects were fading away. I smoked pot mixed with wild lettuce more than 10 hours after having drunk the ephedra and fell asleep very quickly. </p><p>Next morning I woke up early, feeling fine. </p><p>I think that the effects on the heart started 1 hour after the mental effects, a bit like with caffeine, and lasted longer. It was a pleasant experiment. The effects were mild, but long lasting. I'll try it again, but with a lower dose. It's obvious that the toxic dose is not a lot larger than the effective dose and that trying to get a massive high from ephedra could lead very easily to a major heart problem.</p>"
}
