{
 "title": "Up in Smoke",
 "author": "Captain Tripps",
 "citation": "   Captain Tripps. \"Up in Smoke: experience with 2C-I (ID 36693)\". Erowid.org. Sep 12, 2004. erowid.org/exp/36693",
 "substance": "2C-I",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 mg",
   "smoked",
   "2C-I",
   "(powder / crystals)",
   "  T+ 4:00",
   "4.0 mg",
   "smoked",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36693",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 12, 2004",
   "Views: 5307",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I received my package on a Friday and was in a hurry to try it out.  None of my friends have had any experiences with 2C-I so all I knew was from the net.  I had not fasted and did not have the time for a full blown experiment that night so I decided to smoke some.  </p><p>I do not have a scale so I eyed what I believe was 3-5 mg into a test tube that I torched and sucked the smoke up with a straw.  The taste is a lot like freebasing.  A burning plastic chemical taste.  I am sure some smoke was wasted in the process but here are the results.</p><p>Initially a light foggy visual, body high and slight confusion.  I thought that it would hit me hard and fast all at once but this was not the case at all.  A slow progressive experience of the same as the initial.  I never peaked, saw visuals nor did I have profound thoughts.  I went to the movies and saw Resident Evil: Apocalypse which is a fast paced visually stimulating movie anyway so I do not think that the 2C-I made much of a difference.  Within 1 hour I felt normal again without the 'Profound Enlightenment' that I had hoped for.</p><p>I returned from the movies and did the same again.  3-5 mg, in a tube smoked.  This was pleasant although still nothing tripendiculas.  I played on the computer, thought a bit and eventually went to bed where I had wonderful thoughts just prior to falling asleep that I only remembered in the morning.</p><p>Now this whole experience seems like a waste however, it was not.  It was a nice light way to work myself into bigger and better.  I relay this to those that want to try smoking it first or solo.  From what I have read and what I experienced I recommend that you save your stash for a real experience and take it orally.  I will relay my new experienced of oral when I do it till then I hope this helps.</p>"
}
