{
 "title": "The Tome",
 "author": "BTJ",
 "citation": "   BTJ. \"The Tome: experience with 2C-I (ID 36733)\". Erowid.org. Sep 16, 2008. erowid.org/exp/36733",
 "substance": "2C-I",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 36733",
   "Male",
   " ",
   "Not Given",
   "Sep 16, 2008",
   "Views: 2885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took 15 mg of 2c-I orally along with three friends in a dormitory. I cant recall how long it took the effects to begin, but it wasnt like other hallucinogens in that it slowly and steadily over the course of about two hours rose to its peak then tapered off just as slowly and steadily, rather than peaking right away or coming in waves as psilocybin does. </p><p>The effects were first noticeable when one of the friends showed me a popup book of fears. It had a fear of public speaking page with a pop out podium and a picture of an angry looking audience, a fear of the dentist page with a popup drill and a picture of the dentist holding it, and other very clever depictions of phobias. When I got to the claustrophobia page I felt strongly that I was in the small wooden room pictured. The fear of heights page had a popup skyscraper with an image of city streets beneath it. My shirt and tie (I wasnt actually wearing one) flapped in the breeze blowing over the rooftop as I contemplated jumping. Closing the book made me feel as if I had passed some mystical test of my ability to conquer fear-as if the book were some ancient tome designed as some sort of rite of passage. </p><p>By this time I was noticing that the trip didnt assault me with a barrage of wild arbitrary sensory impressions as many hallucinogens do. It created more of a delusional than hallucinatory form of insanity. Also, it left my ability to form and maintain coherent ideas intact so that I could consider what I was seeing not only as a very intense sensory perception, but also as a symbolic phenomenon. From this point out I began to think that there was an obvious message in everything I saw.</p><p>Im ashamed to confess that we spent the peak of this trip watching Orgasmo. At the time, however, I felt it was the most brilliant thing ever to be put on film. I interpreted it as a profound allegory. I dont remember specifically what I was thinking, but, still thinking in terms of the first person perspective of the popup book, I thought the movie intended the viewer to feel as if he were the director. Since a mans ass pops onto the screen each time the viewer expects to see some boobs, I thought the intended message was that the viewer/director was causing himself a lot of distress by wanting to see boobs (as the viewer), but throwing in a shot of the mans ass (as the director). I related my interpretation to the Kaon about the monk who cant see whats ahead because hes standing in his own way, but therell be no one to see it if he moves. I had to turn my eyes away from the screen several times, thinking that I had too much emotion invested in the picture. Afterward it seemed it was the last part of the test of fear.</p><p>I could think speak with almost completely uninhibited clarity the whole time, which gave a false sense of control. The next time I took the drug I was drunk off my ass. I broke into a building and stole some expensive equipment which I blatantly walked down the street with thinking Why havent I already done this? Ive wanted this stuff and its been right here, I guess I just never thought of moving it to where I can access it more easily. It didnt occur to me that it was theft. I would reccomend not mixing this stuff with alcohol and keeping someone else around to babysit as the delusions, unlike intense hallucinations, maintain themselves for a very long time and don't incopasitate me at all whatsoever.</p>"
}
