{
 "title": "The Formation of Time/Parallel Universes",
 "author": "Ruzala",
 "citation": "   Ruzala. \"The Formation of Time/Parallel Universes: experience with Salvia divinorum (5x extract) (ID 36768)\". Erowid.org. Nov 7, 2007. erowid.org/exp/36768",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36768",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2007",
   "Views: 2696",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So one day in mid-August of 2004, me and two of my friends went down to my beach house for some summer fun. We made our usual rounds up and down the boardwalk checkin the headshops for fun/unusual stuff. At one, the clerk tried sellin us some Salvia Divinorum. I smoked Salvia once previous to this time and the effects were VERY minimal. No hallucinations whatsoever, just got a lil drowsy. So I figured it would be a rip off, and I told the guy that. He said they had it available in a $5 sample pack which included 0.4grams of the 5x extract. Again, I figured the effects would be minimal considering the fact that every other pack they sold there was 1gram and was either the 10x or 20x extract. </p><p>We got back to my beach house, and keep in mind, all along the way, my two friends were pestering me to do it right when I got back. I myself am normally very in-touch with my body and I preferred to wait a little bit, read the packaging, collect my knowledge of the drug/its effects, and prepare for the trip, or the 'experience' as it was referred to on the packaging. Nevertheless, my two friends, let's call them Bear and Newt, to keep them anonyous, kept bugging me, calling me a pussy for not smoking it the second I got back. So instead of dealing with their bs, I decided to smoke it.</p><p>I smoked it through my brand new bong, took one big hit, which was only about .25 or .3grams. I held it in for about 20seconds and the second I exhaled I was just gone. The next few events were very fuzzy to me, but over a couple hours of reflecting and asking Bear and Newt, I collected my thought and figured out what went on. I remember my vision immediately zoomed out like 20fold and my peripheral vision was about 1/20 of what I saw. The rest was just an infinite black void. All of a sudden, the images began stacking up upon one another as if they were frames of time being refreshed and stacked on top of each other, in a sense like a computer monitor. This whole time I didn't know what was going on in reality, but according to Bear and Newt, I pointed towards the dresser in the room, kept trying to say words, but just kept saying things like  'theeeee....looook....whhhaaattt?....hooollly shiiiiit....heeeeelp me.' They also said that I began sweating massive amounts as soon as I exhaled and my facial expression kept switching from being completely blank to scared shitless.</p><p>Then all of a sudden, in my 'world' the stacks of frames of 'time' duplicated into an infinite amount of others. Each stack of frames was a different universe where everything was different in some way or another. For instance, in one I remember Bear and Newt being gay, in another I remember them being really smart, basically everything they weren't. At this point there were so many parallel universes that I got confused and didn't know which one was the real one. Then all of a sudden, I felt like I was a frame and was frefalling into place in the stack of frames. I felt like 1 billionth of myself, basically I felt like nothing, and that I would never return to normality. According to Bear and Newt, at this point I ran into the kitchen and back REALLY fast, which would explain the frefalling sensation although I don't recall moving at all, no less knowing when/where to move and turn in order to avoid walls and other objects in the house. When I returned from my run, they said I looked like I wasn't from this world and was freaked out by it. Also, they said that I kept looking around really quickly as if I was on coke or some other hardcore stimulant.</p><p>I was. When I returned, which in my world was when I was thrown into a random parallel dimension I thought they were both aliens who wanted to kill me. Hence the fear. At this point I sat down on the bed again in the exact same spot/position as I previously was, and they kept asking me questions. Here's the weird part. During their questioning, I heard what they were saying like 3seconds before they actually said it, and when they did it kept echoing endlessly, which gave me a massive headache within 5minutes. So I said, 'I gotta chill out, I'm goin to my room. You don't understand, I'm really buggin out. I'm never doin this again.'</p><p>As I sat in my room contemplating what the fuck just happened, things slowly started coming back to me. For example, I remembered who I was, what I enjoyed to do, basically felt kind of like my old self again. However, I was still freaked out cuz I thought I was in a different dimension and everything would be screwed up once I return back home from my shore house. About 15 minutes later, I returned to Bear and Newt's room and as soon as I walked in I was like 'Oh my god, I never ever thought I'd be this glad to see the two of you...ever.' And then the enlightenment of the trip hit me. Before I took the hit, they were bitching at me to do it, which really pissed me off, until I eventually said what the hell and did it. The trip made me realize, yeah, they can be assholes sometimes, but that is only now, not forever. In the future when I go off to college and move on with my life, I probably won't see them for a really long time if ever again. I realized that I had to make the best of a bad situation, or else once it's gone, I'll really regret it and reflect on all the times that I could've had fun, but instead chose to be pissed off at them and ignore them.</p>"
}
