{
 "title": "How to Kill a Good Trip",
 "author": "Buddhist Bill",
 "citation": "   Buddhist Bill. \"How to Kill a Good Trip: experience with Mushrooms & Cocaine (ID 36762)\". Erowid.org. Sep 16, 2004. erowid.org/exp/36762",
 "substance": "Mushrooms & Cocaine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 4:00",
   "0.25 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36762",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 16, 2004",
   "Views: 20878",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Out of some fluke of luck, I got a call from an old friend who said that she was with someone who was willing to trade an ounce of shrooms for 'a few grams' of weed.  I don't think I ever found weed so fast.  I bought an 1/8th (approx 3.5 grams) for $20 and traded it for a bag of shrooms that wieghed a little more than an ounce (it was aprrox 30 grams).  The average cap was 2 to 3 inches in diameter, I was very impressed, though skeptical considering the circumstances under which I aquired them.</p><p>My skepticism was completely unfounded.  About 45 minutes after eating a quarter inside a PB+J sandwich I was tripping balls.  I hadn't tripped this hard off of mushrooms in years.  The first hour was so good it didn't even seem like shrooms, it was reminiscent of my last mescaline trip.  After the first hour, things calmed down a bit and, though I was still tripping off my ass, it was clear to me that these were just Psilocybes albeit very good ones.</p><p>After another two and a half hours or so I decided to part ways with the rest of the guys are head home.  My trip was slowing down and I had some blow at home so I thought maybe combining the two would be interesting.  One I reached my car and started moving, I realized that my trip hadn't slowed down nearly as much as I thought, I was pleasantly surprised, though getting home became a daunting task even though I only live about 5 minutes from the friend's house where I had been for the last several hours.</p><p>I got home, put on some Radiohead, turned on my various lightning balls and glowing apparatuses, and proceeded to bust out the yayo I had bought earlier that evening.  I did a line, smoked a cigarette, bumped another line's worth out of a Parliament recessed filter, and smoked that.  All of this happened within 20 minutes.  After another ten minutes I suddenly realized that I wasn't tripping anymore.  Not even close.  The coke seemed to be working fine, but all aspects of the trip were gone.</p><p>I had never bought from the guy I got the coke from before that night, but I trusted him because I used to go to high school with him and knew him pretty well.  A couple days later I did some more of the coke, and it was just as good as he had been boasting.  The night I mixed it with Shrooms it didn't quite live up to said boasting.  From this I have concluded that mixing cocaine with mushrooms not only kills your trip, it somewhat lessens the effects of the cocaine.  I didn't have any other negative affects such as vomiting, but I did experience a bit of nausea for a couple minutes after I did the second line of coke, so it could easily cause someone with a weaker stomach to vomit.</p><p>The moral of the story... don't mix shrooms with coke.</p>"
}
