{
 "title": "Energetic, Sexy, and Happy",
 "author": "meekrob",
 "citation": "   meekrob. \"Energetic, Sexy, and Happy: experience with AMT (ID 36777)\". Erowid.org. Sep 17, 2004. erowid.org/exp/36777",
 "substance": "AMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 36777",
   "Male",
   " ",
   "Not Given",
   "Sep 17, 2004",
   "Views: 9427",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I love hallucinogens and amphetamines, and had extensive previous experience with each at the time. I dosed at noon and went to my afternoon university classes. I felt effects starting at t + 0:45 or so but i was seated in a classroom. I really realized something was happening as my physics instructor showed the film of the Tacoma Narrows Bridge disaster, and I felt as if I was swaying with the bridge. Class ended and I walked to a friend's house. t+2:00 During the walk, I experienced swirling and spatial auditory hallucinations, and colors appeared brighter. I was extremely purposeful and alert, as if on some kind of speed. I hung out at the friend's house and had several hours of intense philosophical and sociocultural conversation and enjoyed the feeling of being propelled into logical dissection and analysis of issues and arguments. Fearing that this lucidity was just another circular, hallucinogen-induced, pie-in-the-sky, cognitive jerk-off session. I wrote down my arguments for later examination. For the most part they, upon inspection the following week, turned out to be coherent, clever, and reasonably good ideas. </p><p>During this time, we listened to music, which began to draw my attention away from rational thought. I was fascinated by sonic textures and the spaces in which recorded sounds existed at the time they were recorded. 8PM, I was completely distracted by music and, I decided to walk to my place and listen to my own. This walk was different. I was getting mild visuals, experiencing intense auditory hallucinations, still feeling speedy, and working on a body high similar to MDMA. I was also sweating like crazy, and when i arrived at home, I promptly drank several glasses of water. (Keep yourself hydrated; It's just like speed.) I noticed that i smelled horrible, and I decided to shower. 9PM. Looking at myself in my bathroom mirror, I get a surprise. My pupils are very dilated, as expected, but rather than feeling that i looked strange, as i usually do with LSD or Mushrooms, I feel incredibly attractive. (Think cocaine) I shower, which i prolong with a very satisfying solo sexual excursion, shave, (amazingly I didn't cut myself) and dress up in the craziest clothing i could find. (I like dressing up, and am in a drag-rock band.). </p><p>My roommate came home, and we went to another friend's house. 10:30 PM. I was coming off of the intense hallucinations and body high, but I still felt energetic, sexy, and happy. I had some body aches, but i didn't really mind. At the friend's house, I ate a sandwich, not because I wanted to, but because i thought i should, and had a few drinks. We went to the bar and had a few more, and I found that i didn't feel drunk at all, but that i still felt interesting, smart, and sexy, in an exaggerated way, which exceeded my usual narcissism by far. 2:00 AM, we went home and I polished off the last of some whiskey I had in the freezer, hoping it would make me tired enough to sleep. It took a little while, but i fell asleep around 3:30 AM. I had intense dreams, for several days, and it took a couple of days to feel exactly normal. I was fully funtional, but a little wierd. I liked it, but I hate weed, while being a big fan of LSD, MDMA, and Methamphetamine. If you dislike any of these, this may not be for you.</p>"
}
