{
 "title": "Set, Setting, Strain?",
 "author": "bengt",
 "citation": "   bengt. \"Set, Setting, Strain?: experience with Mushrooms - P. cubensis (ID 36799)\". Erowid.org. Feb 2, 2005. erowid.org/exp/36799",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36799",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 2, 2005",
   "Views: 26556",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nEveryone knows that when it comes to drugs, set and setting can make or break an experience... and in my opinion, when it comes to mushrooms the strain plays just as big a part as well. Having tried my luck at growing the sacred mushrooms, I would like to share the whole of my experience with the rest of you.<br>GROWING:<br>Growing seems almost too easy to be true, but once you get into it you realize just how delicate a process it is. Sterility is the name of the game. My spores arrived without complication (2 each of two different thailand varieties, 2 B+, and 2 equador). 1/2 pint ball jars were filled with PF Tek substrate mix. I don't have a pressure cooker available so the jars were placed in a large pot, covered tightly, and boiled (rolling boil) for an hour, and left to cool overnight. The innoculation is easy enough. Between each jar I would alcohol flame the needle and then wipe it with rubbing alcohol. Sterility cannot be stressed enough. After this they were placed in my basement, where a very small amount of light might be on them for a few hours total a day, and the temp stayed around 72 degrees farenheit. After a little more than a month, most of the cakes would be fully colonized (the Thailand species colonizes quicker than the others). The jars were then placed in my bedroom where they recieved indirect light for most of the day (temp 73-76F). After a few weeks, pinning begins and I spray the room with 1/2 water 1/2 bleach from a spray bottle, and then fan it out. The cakes were placed in a rubbermaid terrarium with perlite, and pretty much left them alone for a week or so. I picked them as soon as the veil broke, and the ones I didnt sell (or eat :D) wet I dried with dessicant. Each cake usually fruited around 3-5 grams (dry). On my first try, 7 jars were prepared and I lost 3 to either mold or the cakes being too wet/dry.<br>Just be cautious in every aspect through every step.<br>EXPERIENCE: <br>Each strain that I grew produced a noticeably distinct trip, confirmed by almost everyone who had experienced mushrooms before and tried one or more of the strains I grew. <br>Thailand: My personal favorite, and definitely the one that will distinguish the difference between two strains. Extremely potent, these are the 'run around, energetic body buzz, look at all the cool visuals, mind racing at lightspeed, feel like an animal' shrooms. I grew two different Thailand strains, although I didn't notice a huge difference in effects, but they did grow differently. I don't know if it was just the fact that I grew an outstanding batch or if the thailand are just that good, but I've had harder trips off 1 gram of these than 4 grams of others. I've never gone over 1.75 grams of this strain, and those who took 3.5 grams completely lost it by the time they peaked and complained that they were too strong. These are for a weekend getaway in nature or a trip hard in a 'social' setting. More 'outward' tripping (visual and audio hallucinations like CRAZY) than 'inward'. *note: these shrooms are very reminiscent of my experiences with LSD, and the only other person I know who has taken acid before agrees.<br>Equador: So you want to chill out... these are the 'light some incense, put on your favorite music, close your eyes and see what there is to be learned' shrooms. Really happy, floaty body buzz, and good if you're looking for a introspective experience. Although I enjoy these for the most part, they don't really give the feeling of a 'recreational' trip. <br>B+: And then there's the B+. After distinguishing between different strains, I'm fairly positive that previous shrooms I've bought from local dealers have all been B+ with the exception of one batch that everyone RAVED about (which I strongly believe was thailand). B+ is your pretty basic shroom. Nothing outstanding, but all the standard effects that you expect. I've taken this shroom in a variety of settings, from house parties to amusement parks with frightening halloween themes (not recommended), and have noted that I personally feel more succeptable to a bad trip on this strain than others. For some reason I just get to thinking way too heavily on this strain, mostly because I get stuck in a loop something like 'okay... it's not really hitting me that hard, why isn't it working? I feel weird, but I'm not tripping. Wait, am I tripping? No, no, I'm not tripping, just sorta feeling it. Or am I tripping really hard? Wait... wait...' and it goes on like that until I dig my own mental grave for a few hours. Kinda like I'm waiting for the effects to come on, when really I'm peaking and don't realize it. This doesn't happen all the time, but more often than others. I don't knock any mushroom, but this isn't my personal favorite.<br>Now there are many, many more strains than just the three I've named, but those just happen to be the three I grew and the most common out of the strains that I have seen around my area. The different strains aren't always recognizable just by looking at themm and the visual descriptions are hard to explain without pictures... but everyone who has tried the above strains have agreed with the effects I have described, so hopefully it will help distinguish between one of the most important elements of the mushroom experience.\n\n\n"
}
