{
 "title": "Hallucinating in the Mind",
 "author": "Petri",
 "citation": "   Petri. \"Hallucinating in the Mind: experience with Amanita muscaria (ID 368)\". Erowid.org. Jun 11, 2000. erowid.org/exp/368",
 "substance": "Amanita muscaria",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Amanitas - A. muscaria",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 368",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2000",
   "Views: 109065",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Petri's updated preparation info also available</p><p>Over in Finland A. muscaria grows all over the place - it's very common and it's maybe the most common mushroom that you can find in city area (it's grow in parks, woods, cemeteries, etc.). At first time we (one friends of mine and I) took about five grams of dried cap and smoked some pot (to prevent nausea and to potentiate the trip. We didn't get much out of it so we tried two week later 15g each and only the best part of the mushroom - yellow flesh just under the skin (we ate skin too but I think it doesn't change the experient in anyway because there is so little of it). Both times we made soup out of the mushrooms. All you people should also remember they say that American and European mushrooms contains different amount of different alkaloids in them ... but they also say that it's FDA/DEA's rumour to make people to think that American ones are toxic.</p><p>Anyway - the trip was weird. It was kind of sleepy, but not like I have heard people telling that it's makes you to go very sleep like state with losing your memory. Mushrooms made me feel nausea, but this was prevented with pot. Nausea from A. muscaria was pretty bad so we waited as long as we could and then smoked pot and after one toke it was gone! Pot works somehow for all the nauseas but it's totally awesome for A.muscaria. We smoked some more pot though because we figured out that it blows us much higher than only the shrooms. Trip was hallucinating but there was no color patterns and other visuals. It was more like hallucinating in the mind and other ones were very real like we saw fog all over the place (we were hanging around the town) and we saw that water on the pavement was frozen, but later we heard that there was neather fog nor temperature below 50F. When I'm talking about 'we' I really mean it - WE BOTH SAW THOSE THINGS and I can't think why it was like that. One example of those in-mind hallucinations that I saw ... no I imagined that there was open field with red colored devils coming out of the ground and smiling to me. It was very wierd all those devil looked totally the same and there looked like devil should :) - They had horns, there skin was likes fish's skin and they had that 'devils fork' on their hand. That was kind of funny/scarey, but it didn't last more than few seconds.</p><p>The trip was also very confusing. We lost sense of the place and we got lost in my hometown that we knew very well. Next morning we remembered where we had been, but on the trip we didn't. My friend also got lost on the parking lot were I left him while I was going to buy some fast food (he was scared to go with me to the fast food place because there were too many people). When I came back he was like 'oh thanks! I didn't know how to get out of the parking lot'. The Trip was also very euphoric, aphrodisiactic and funny. We were laughing very spontaneously and at one moment we just started to laugh with no reason and then we ran away because we were in public place and there was people. At one moment I even felt that I couldn't prevent to cum in my pants - it felt that good! (I didn't come in my pants though ... really :) ). Anyway when I bought that fast food we went to eat near by the soccer field and my friend told that the field was glowing yellow and there was men playing soccer (one of those 'in-mind' hallucinations) and I was hearing the sounds of the game.</p><p>I haven't take it for two years because I thought that it's toxic and bad for brain cells (so is ethanol, but I don't do that either). It would be really nice if someone had information about it's long time toxity. Now when I refreshed my memory I remember that it was nice I'll maybe do it again at next fall! Next time I would like to take more though (maybe 20-25 g), but I'm kind scared because of it's possible toxity.</p>"
}
