{
 "title": "Creative Mental Clarity",
 "author": "bompaztic",
 "citation": "Citation:   bompaztic. \"Creative Mental Clarity: experience with Sea Wormwood (Artemisia maritima) (ID 36809)\". Erowid.org. Jul 24, 2006. erowid.org/exp/36809",
 "substance": "Sea Wormwood (Artemisia maritima)",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "2 joints/cigs",
   "smoked",
   "Wormwood",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36809",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 24, 2006",
   "Views: 21218",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI happened to obtain a bundle of Sea Wormwood (Artemisia Maritima) from a trusted friend and was really interested to try not only it's psychoactive properties but also and especially it's anti-inflammatory and medicinal aspects (I'm suffering and has been diagnosed with a rheumatic disease called spondyloarthropathy with is primarily affecting my spine but also causes chronic inflammation of internal organs etc. -> in short, a very nasty case).\r\nI'm somehow experienced tripper with psychoactive substances and\r\nhas been smoking good-grade cannabis almost daily for years (part for my rheumatic case (it really helps with it, as you can imagine) and part for my meditation practice, kundalini rising and general carnival) - so I think I can fairly clearly say my opinion of the differences between Sea Wormwood and and Cannabis.\r\nThe experience:\r\nAfter drying the Wormwood (hanging from my kitchen wall) I first got used to it's smell, which was first a little bit frightening to me but then became pleasant. I read *a lot* on the substance, and as I'm familiar with good absinthe (meaning: containing enough thujone) I pondered what could be the best way to ingest it first? I decided to first smoke it a little bit and then try it as a tea (which I have not done yet but will do in the future: I will report later). One important thing to note: from what I have read the Sea Wormwood (Artemisia Maritima) is less effective when compared to Common Wormwood (Artemisia Absinthum).\r\nThe day had been overcast and I had a bicycle trip and walked in the forest. My mind was calm and relaxed, I took a shower and put some woolly clothes on - a pleasant evening at home listening to music. In the calm of the night at the peace of my home I rolled one little cigarette with my cigarette machine, using *only* crushed leaves of the Artemisia Maritima (no tobacco or additional smoking substances). I had not smoked pot that day, only drank 2 cups of coffee earlier at daytime). I was a little tired and yawning but I sat down, lit up and smoked slowly. The smoke wasn't at all harsh and I experienced it as very pleasant. I was a little bit afraid what would happen, but everything went really fine! After 5-10 minutes I experienced slight distortions in my visual field, which were enjoyable. Then came a slight 'coldness' in my body, shivers and a little perspiration with some muscle spasms - all this was not unpleasant. I felt that my body was light and there was little analgesic properties (pain relief). But the most interesting part is that I experienced a sedative state which was nothing like opiates or downers in general - but a very calm, creative state where my thoughts seemed to *flow* freely. Definitely a mildly (at this dosage) psychoactive stimulant, with very interesting sedative qualities!\r\nI sat down and decided to roll another, bigger one. I smoked it and then the thing really began: I was in my chair and my perception of the room was changed, I was 'more in my body' and felt weirdly 'snakelike' & old in a good sense. I felt calm, creative and everything was *fine*. A very lucid state, with some aphrodisiac qualities also. I tried to work a little on my computer but then decided to go to bed.\r\nLying on my bed I felt that it was winter (although it was autumn) \r\nand felt a very open, an endless world opening outside my windows. Endless possibilities. I was really happy and thought that it was almost years ago when I experienced a state like this - I felt you ng and sexual! I watched the pines waving slowly with the wind and was feeling generally great with some 'rushing' of creative thoughts in short bursts. I felt horny and started to masturbate, which slowly builded up to an explosive and uncontrollable orgasm - very pleasant! Definitely stimulating - sleep was not possible for a while, and when it started the dreams were *very lucid* and I woke at the morning refreshed, a little bit groggy, but with marked pain relief and muscle relaxation continuing.\r\nNow, after being awake for almost an hour, I can still feel clearly the effects of smoking last night. For the conclusion, I must say Wormwood isn't for me a 'marijuana-like substance', because it is much more a stimulant. Not coffee-like stimulant, but something that I have not felt before. There are definitely mild cannabis-like effects for me, but this is clearly a very different substance that needs to be researched throughly.\r\nWorth the try, but be very careful. You are on your own on this. Don't be stupid and overuse it. Also, I'm not sure what are the long term effects, considering that many people seem to think that thujone is very toxic (although this seems to be very controversial). *I'm* not going to use it too often. For the future, I think I'm trying it next as a mild tea for researching the medicinal properties. Of course, the 'mental' effects are and were also 'medicinal' - but I'm very interested in the claimed anti-inflammatory properties which should be greater when drunk as tea.\r\nMaybe someone *very* experienced with long-term use (not just reading books, thank you!) could tell her opinion? Or if anyone has Ott's Pharmacotheon at hand, maybe she could type the 'wormwood smoking' -section here for reference (I do not own the book)?\r\nThere seems to be some people trying smoking wormwood these days - all data would be necessary - please write your experiences with the Artemisia family!\r\nPeace to all -\r\nOm Namah Ganesha!\n\n\n"
}