{
 "title": "Music As a Base",
 "author": "Troll",
 "citation": " Troll. \"Music As a Base: experience with 5-MeO-DiPT (ID 36831)\". Erowid.org. Aug 1, 2006. erowid.org/exp/36831",
 "substance": "5-MeO-DiPT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "2004",
   "36831",
   "Male",
   "",
   "Not Given",
   "Aug 1, 2006",
   "3193",
   " "
  ]
 ],
 "report": "<p>First a little background information about my self. I do not take any medications, I do not have depression, I have been taking this substance for about 3 years on a regular basis.</p><p>Setting:  Well known area with 2 friends in the house.</p><p>Time: Dropped at 9:00 p.m.</p><p>Mood: above average</p><p>I had been taking doses from the 20 - 30 mg range for the last few months and this night I wanted to see if there were any advantages to lower doses.  The 20 - 30 range has always produced a high euphoria with please visualizations, but the body load came some times be too much.  This night was to be an experiment to see if I could keep the high without the load.  I will describe what happened.</p><p>9:00 p.m.  Dropped</p><p>9:00 - 11:00 p.m. Slight giddiness but mostly nothing</p><p>11:15 p.m. I noticed that my stomach was getting the usual upset rumbling that it some times gets on foxy.  I ate some BK chicken to settle it down.  Effects are coming on like other experiences I've had.</p><p>11:30 p.m.  I got up to move and enjoy a new poster I got called 'mind warp.'  Its a poster with many overlapping circles that, even when sober, tend to move when I try to focus on any one circle.  It was definitely going about it's business swirling.  I noticed the usual foxy patterns and brightness in colors.  My body felt normal.</p><p>1:30 p.m.  Still had flowing patterns and brightness in colors.  Around midnight I began to think things through much more in depth.  Still no overloaded body feelings.</p><p>2:30 p.m.  Coming down, should be able to sleep soon.</p><p>Overall the night was a success.  I am able to lose my self like I normally do on this substance but with much less body load. From now on, I'll be taking lower doses.</p>"
}
