{
 "title": "Just a Little Something",
 "author": "DevilDoc",
 "citation": "   Devil Doc. \"Just a Little Something: experience with 2C-E & 2C-I (ID 36839)\". Erowid.org. Nov 22, 2006. erowid.org/exp/36839",
 "substance": "2C-E & 2C-I",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-E",
   "(capsule)",
   " ",
   "5.0 mg",
   "oral",
   "2C-I",
   "(liquid)",
   " ",
   "6 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36839",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 22, 2006",
   "Views: 6275",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Tonight I find myself with 3 substances that have been collecting dust for a little while - IAP, 2C-I and 2C-E. It's been a while, and I don't want to go overboard... but I want a little something. Not seeing any reports combining the two I decide on a combination of 2C-I and 2-CE. I have about 50mg of 2C-E, and about 3-5mg of residue of 2C-I. I decide on 10mg of 2-CE and what was left of the 2C-I - not even sure if I'll get anything out of it, but I have an early morning and feel the need for SOMETHING. So, here we go...</p><p>T+0:30 - 6oz 40 proof port (was a tad anxious, so I thought it would help a little)</p><p>T+0:00 - 10mg 2C-E in a gelcap and approx 5mg 2C-I dissolved in 6oz 40 proof Port.</p><p>T+0:30 - feeling first alert</p><p>T+1:00 - definitely feel it in me, but very weak. Decide to dose with another 5mg</p><p>T+1:30 - I'm at a definite +3. Wow. There's no way I could carry on a convo right now, </p><p>or, lol, drive. </p><p>T+2:30 - I don't think I've ever tripped this hard and maintained control of my faculties. Incredible OEV's (no CEV's) - I have a stucco ceiling and it looks like worms are crawling everywhere. Also, the walls are breathing like I've never seen before.</p><p>T+4:00 - Spent the last couple of hours just staring at my ceiling and walls. My mind is a complete jumble - anxious from time to time. Have a hint of that 'oh no, too much' feeling, but then it subsides. I'm glad I bumped it up 5mg, but any more and I might have lost it. A little hungry, so I had some crackers and cheese - nothing spectacular.</p><p>T+5:00 - Starting to come down. There are still marked visuals, but my mind is definitely clearing.</p><p>T+6:30 - Almost back to baseline. wow. what a trip.</p><p>I've used both of these chems independently and neither produced anything close to this. 2C-I was masked by the 2C-E, but the intensity was increased by maybe 2 orders of magnitude... and just from 3-5mg of 2C-I. </p><p>Just a follow up note - there was a significant 'hangover' the following day. I felt a little spaced out... almost like that after a night using DXM. No other side or after effects to speak of.</p>"
}
