{
 "title": "Forgetting My Divorce",
 "author": "Adempha",
 "citation": "   Adempha. \"Forgetting My Divorce: experience with Diphenhydramine (ID 36862)\". Erowid.org. Jan 12, 2008. erowid.org/exp/36862",
 "substance": "Diphenhydramine",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 0:45",
   "75 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 1:39",
   "50 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 36862",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2008",
   "Views: 7661",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nGoing through a divorce, I decided to get drunk a few times but it got boring. I had only tried weed one time, wanted to try something that would make me 'see' things.  I didn't want to try acid or stronger and didn't realize how strong this was.<br>12:15am - I took 6 25mb tabs of diphenhydramine.<br>12:45am - Noticed a little dizziness, as if I had downed 2 shots of 80 proof and waited 15 minutes.<br>1:00am - Still just stoned, but took 3 more tablets.<br>1:15am - Went to smoke a ciggarette, dizzy is stronger, but managable easily. I feel like I've smoked weed and am stoned, not annihilated. I feel like I should also add that I felt JUST like being stoned at this point - no different.  Even the pressure behind my head was the same. Attempting to play Literati via yahoo (kinda like scrabble), but I'm having trouble constructing words<br>1:30am - Body is numb all over. Touching my face tingles, still no visual or audio hallucigens. (Trouble spelling that word) I can still focus on my computer monitor, but its getting difficult. Its much easier to simply relax my eyes and go cross eyed.<br>1:54am - Still very dizzy but it doesn't seem to be getting worse. I'm not seeing anything of notability, just dizzy like hell - took 2 more tabs, for a total now of 275mG. Is this is?<br>2:01am - I noticed the walls breathing thing, faintly.<br>2:20am - Nothing really to report. The 'breathing' walls aren't any worse, but it startled me quite a bit when I first saw it.<br>2:27am - I take that back, theyre really moving now, and I am noticing what someone else said about music being more in stereo.  When I look at a shadow of an object cast on to a wall, the shadow seems to rise up like it were smoking.  I'm also seeing shadows move and shake related to the music I'm listening too.  This was the first 'synthasia' I ever experienced.  It was very slight, not strong, I could only see it in a poorly lit room.  In a well lit room it was not existant.<br>About this time I forgot my computer was on and was unable to continue logging the event.  I do remember several interesting things before I fell asleep.<br>-The cherry of my cigarette had red and orange glowing lines coming out from it in a star pattern.<br>-My walls at some point were not only moving, but talked to me. I remember having to tell a wall in my bedroom to 'shut the fuck up' because I was trying to sleep.<br>-Objects with edges had mirror images of them 'echoing' from the real image, as if I was looking into two mirrors facing each other.<br>-I referred to a friend of mine as a hoebag, forgetting who she was.<br>-A Lava Lamp with glitter instead of lava in it, in my room cast purple light on the wall, but the light this time looked like souls floating up from hell, and I could hear them screaming.<br>I guess I went to bed around 4am and woke up at 4pm the next day. I felt stoned the entire day, depleted of all energy.  I just wanted to go back to sleep, but I couldn't.  Around 9pm the effects were almost gone, but it wasn't until the NEXT morning that I felt normal again.<br>Overall, if you can't find some stronger drugs, this is easy to come by and has a strong effect.  I will probably try it again, probably 300mg for 200 pounds is about good.  I felt like I was right on the edge of it being REALLY cool, and one more pill might have done it.  Despite the horror stories, I had no bad experience with it, especially considering my week old divorce as a mind set, and nobody was here to watch me.  Indeed there was some weird shit happening, but non of it was scary.  The talking walls were not scaring me, they were making fun of mexicans. It seemed more like the experience you get when you wake up in the hospital after surgery, and you've stolen a wheelchair and gone down the hall with it because your drugs haven't worn off yet, perhaps this mixed with a fucked up dream.<br>I'll try it again to be sure.\n\n\n"
}
