{
 "title": "The Night at the Golf Course",
 "author": "Mushrooms",
 "citation": "   Mushrooms. \"The Night at the Golf Course: experience with Mushrooms & Cannabis (ID 36879)\". Erowid.org. Jul 28, 2007. erowid.org/exp/36879",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "36879",
   "Male",
   " ",
   "Not Given",
   "Jul 28, 2007",
   "3200",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a Thursday night and I was planning on ripping mushrooms with 2 of my good friends L and D.  They had both done mushrooms before.  L had some good trips and one bad trip but had an overall positive attitude towards the substance.  D, on the other hand, had only done mushrooms once and had a very bad trip.  He ended up naked in a corner freaking on the people who tried to talk to him.  He was going to try them again and he was going to be with L and I, people he trusts, so he felt good about it.  I had done mushrooms once before and had an amazing time.  I have a very open mind and before doing mushrooms took an interest in the universe, and other intriguing subjects that require a mind such as mine.  I was excited to do them and the vibe was right.</p><p>We had trouble finding the mushrooms because my city was rather dry at the time.  After making a few calls, and driving to this dude's house named K, we got our mushrooms.  K decided to trip with us. He had done mushrooms over a hundred times and ended up guiding me through my entire trip.  My other two friends C and T decided to join us.  This made me a little weary as I wasn't sure if D was going to have a bad trip as he is not completely comfortable around the three who decided to join last-minute.</p><p>L, D and I headed out to the place where we were going to trip.  It was about 10:00 and we were at a golf course in my end of town, the perfect place to trip.  L is a member there, so he knew his way around.  There were lakes, many trees and hills.  It couldn't have been better.  It had been raining and cloudy all week but for whatever reason, the skies were completely clear.  It was almost like it was meant to be.  D, L and I began our journey through the golf course.  We were going to meet up with K, T and C later.</p><p>It took a pretty long time to start feeling the mushrooms, but soon, mild hallucinations started.  It was dark except for the lights from the city about a kilometer away.  I would sometimes see the shadows of people running by on the golf course.  The mushrooms were not in full effect, but I felt as though the trip was coming on strong, and it was going to keep coming on strong until I was completely messed up.  It was a good feeling!  As we journeyed, we would stop and look at the stars and become amazed at the sheer simplicity and complexity of the universe.  We all got pretty laughy and during a conversation about the size of whales we ran into the rest of the crew (K, C and T).</p><p>They had all consumed their mushrooms and were in mid-trip.  We stood around and talked about the universe, society, etc as we smoked some weed.  D was tripping about the stars.  The sky was incredible.  I was seeing shades of purple and green in the backdrop to the stars.  We smoked two bowls and kept on.  As D, L and T talked rather superficially about deep topics, K stood quiet.  He and I got to talking and he quided me through my trip.  We discussed prophecies, fate, the media and other such subjects as we walked.</p><p>I could feel an energy between us.  It was a feeling I'd never had before.  It was a very positive energy, almost a telepathic energy.  I was seeing through all of my other friends, and receving negative energy from them all except for C and K.  I could even feel energy off of the plantlife, the trees and bushes.  I can definitely say that mushrooms connect me with nature and anything else living in a way that I can not connect to them otherwise.</p><p>We stopped at the clubhouse of the course and sat on the patio which was completely lit.  There, D walked around alone for about an hour, C sat in silence and K, T and I talked.  I was losing control of my hands and legs.  I felt as though I was about three feet tall.  I kept rearranging my shoulder bag but could not, for the life of me, figure out how to move my hands and appendages correctly.  D mentioned something about a car he saw in the parking lot and we told him he was just tripping.  Then, someone pointed out that the lights inside the clubhouse were now on.  Someone was there!!!</p><p>We were scared so we ran away from the clubhouse into the bushes and trees of the course.  We decided we would go back to my car and listen to some music for awhile then maybe drive somewhere else to trip.  As we were walking back, someone said 'Where is C?'  C was gone.  He had been sitting in silence the entire trip, looking at each of us intently, trying to read our minds.  He is a very experienced tripper.  He has done mushrooms probably about 30 or 40 times.  He had disappeared now, but he had also driven there, so we were going to walk to my car to see if he was at his car, or wait to see if was going to come.  He never came.  D started to trip pretty bad about being caught and was constantly asking me to turn down my radio, roll up the windows, etc.  Finally, L and K stepped out of my car and I drove D home.  He only lived about 5 minutes away.  T also caught a ride.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>I was a good driver while tripping, probably even better than when I am high on cannabis.  I got back to the golfcourse and we decided to go look for C.  We were worried about him as he was pretty messed up and K had a feeling something was wrong.  We made our way back to the clubhouse and suddenly saw a parked car and a man standing outisde of the clubhouse.  There was not supposed to be anyone there!  It was 2:30am.  They obviously knew that we were there and were trying to find us.  We retreated and agreed that there was nothing we could do about C.</p><p>As we walked back to my car, we saw another car right by mine.  It looked like a cop car because there was a bright white light on top.  We chilled out in the trees for a bit until it left.  C talked to me about the end of the world.  He said things that changed my life that night.  He told me that mushrooms are the best thing that ever happened to him and I could tell because his mind was so sharp and he was easily able to think way outside of the box.  When we talked about the end of the world he said 'Dh you think you are going to see the end of the world?'  I responded, 'I think that we won't but our kids will.'  He said, 'Hmm, well I think we are going to see it.  Doesn't it just make sense that you are going to be alive when the world ends?  Because you are the only thing that matters.'  It made complete sense to me.  I tried explaining it to my girlfriend, but I was unable to because of the language barrier.  Try digesting it on some mushrooms.</p><p>Finally, the car left so we went back to my car and wrapped up the night.  Turns out, the RCMP (cops) came to the golf course and were looking for us.  They found C wandering around and drove him back to his house.  We were lucky we didn't get caught, I had a pipe on me and a little weed and K had some mushrooms and some weed as well on him.</p><p>All in all, this was one of the most exhilerating and enlightening nights ever.  I have never felt so much energy between me, the universe, other humans and plantlife.  And the feeling that I had done mushrooms (while I was tripping) was such an amazing one.  If you have a very open mind and are interested in trying to see your inner self from the third person, I highly recommend eating mushrooms.  My girlfriend and I plan to do them in the next 2 months.  Hopefully I don't have to wait that long to do them again!  I love mushrooms!</p>"
}
