{
 "title": "Nasty Buzz, Nastier Crash",
 "author": "TeKtonik",
 "citation": "   TeKtonik. \"Nasty Buzz, Nastier Crash: experience with Atomoxetine (ID 36883)\". Erowid.org. Oct 18, 2004. erowid.org/exp/36883",
 "substance": "Atomoxetine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "160 mg",
   "oral",
   "Pharms - Atomoxetine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "36883",
   "Male",
   " ",
   "Not Given",
   "Oct 18, 2004",
   "24036",
   " "
  ]
 ],
 "report": "<p>I noticed that my roommate had a bottle of strattera, the non-stimulant ADD medication, sitting on his dresser. I was bored, and even though I knew it wasn't the same, I figured that since most attention-sharpening medications were fun, I'd give it a try.</p><p>I popped 4 40mg capsules at about 12:30pm, and didn't really feel anything until about 2:00pm.  The buzz wasn't intense, but was far beyond placebo. By around 3:00pm, it had become an odd feeling in my stomach, a heavy head, and sensitive eyes. I thought for sure that my pupils were dilated, but when I checked in a mirror, they looked normal. The stomach feeling was ok at first, but eventually was uncomfortable and just plain annoying. I had trouble keeping my eyes focused, and I started to get really tired.</p><p>I left and went over to a friend's room, when I started to crash.  I felt like I was walking in rapidly-drying wet cement on the way there. So, rather than hanging out, I asked if I could lie down in my friend's bed, and I did. I felt like absolute crap. My head was still swimming, but my body felt like I had been awake for days.</p><p>One interesting thing that did happen though was a tiny psychedelic effect. As I laid in bed, someone was below me watching tv.  I can never sleep with a tv on in any normal circumstances, because I can't help paying attention to the sound. By listening to what was playing on the television, I was making a mental picture of what was on, and every time the channel would change the 'movie' in my mind would keep playing the same as it had, as if there had just been a change in the storyline. It was as one linear story, with many very odd plot turns. I would catch myself doing this, stop, but then it would happen again. I think it was because for the longest time I was stuck between sleeping and being awake.</p><p>Once I finally did get to sleep, I slept for about 3 hours. When I stood up my head felt very tired, with a little headache, and my body was still exhausted. I went to sleep again at about 1am, and still felt the after-affects all through the next day.</p><p>I will not be using atomoxetine again. The buzz is definately not worth the crash that it causes.</p><p>Stay Safe.</p>"
}
