{
 "title": "Ambitious Fungus",
 "author": "CanTheAssWonder",
 "citation": "   CanTheAssWonder. \"Ambitious Fungus: experience with Mushrooms - P. cubensis (ID 36913)\". Erowid.org. Jul 24, 2007. erowid.org/exp/36913",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 36913",
   "Male",
   " ",
   "Not Given",
   "Jul 24, 2007",
   "Views: 2482",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\\April 2nd, 2004. 7:00 PM. My mouth tasted like dogshit and newspaper.</p><p>Two years of naïve anticipation had passed prior to that night. What part of my mind had longed for the sanctity of pseudo mental instability? After a few hours, I wouldnt care.</p><p>I swallowed my sophomoric security and answered the fleeting cries of some idiot on the telephone. She was my cousin, and I existed only to cater to her seldom deprived entertainment wants and needs. As I had done too many times in the past, she wanted me to meet her, on foot, half way to her house from mine. Fortunately, we were just over a mile apart, and she was traveling by bike. What a better thing to do in the slack of time I had to encounter some way or another, I thought to myself. I moved, sluggishly and apathetic in my nature, through my Mothers musky, 90s basement. Subtle odors of cat litter and incense had been acknowledged and discounted as fast as it had came as I skipped two steps up the stairs. I looked right; my eyes scanned the gold hued living room looking for my guest. Finding him and the inherit insignificance of the situation, I informed him of my departure,</p><p>She wants me to walk and get her, I announced, looking forward to an appropriate, timely, and convenient stroll through our humanly twisted interpretation of Mother Nature, Ill be back in a few minutes. Without an apparent vocal approval or reply, I automatically implied the unworthy nature of the situation, and left.</p><p>A surprisingly warm night pleased my nerves as I stepped out of my damp garage and walked down my driveway toward the perpendicular road. I wondered what might have been here before it was desecrated and replaced with these singular accommodations. I followed the establishment down a fairly steep road, my D.A.R.E. shirt providing the ideal amount of warmth for my body. The sky was beginning to darken; I guessed it would have been dark by the time I got back to my house. A few minutes after watching four consecutive white cars pass me; I saw a dampened image of a figure riding towards me. Realizing it was her, I continued my slow paced walk until I casually caught up with her.</p><p>Im taking your bike, my voice was monotone and uncaring, and apparently she wasnt objecting. </p><p>From that point on vocal communication became an inadequate manner of expressing thought. I hopped onto the lethargic tool and began to pedal. The mechanics felt like buttered gears to my legs, as the energy they produced was far more than I put into them. The bike floated across the haze-ridden right side of that paved, polluted blacktop; my confined side of the road seemed to be leading me in arbitrary gravitational motions more so than it seemed to be leading me to a destination.</p><p>These minor sensory alterations were constantly replaced with an accentuated parallel notion. My excitement climaxed as we discussed irrelevant things that pass my memory, riding up the same hill that I declined earlier. The trees were oddly 3-dimensional; they looked as though they were a graphic that belonged in some astounding video game. They took on a new meaning of life, they embodied the random nature of evolution and the inherit aspect of something from nothing. How could such complex life be birthed by an initial planet built of nothing more than simple compounds?</p><p>We reached my house at a grueling pace, as I had to utilize the improper use of the bike; I had to go at the speed of walking to keep my cousin content. Putting the bike inside the garage, I went inside my house to see the curious faces of my guest and my sister staring at my own. I immediately went to the couch and began my long, plastic journey to uncovering questions more or less irrelevant to my life as an American. The neurons in my brain fired in places that had lain dormant since my birth; cobwebbed corners of my psychological being were being swept by a strangely familiar experience. Could it be that chemical intoxication was a naturally synthetic simulation of abnormal mentality in the past?</p><p>Geometric nature is present in everything: plants, cells, bacteria, DNA, rock formations, light, sound, heat, sensory perception, every aspect of science hints at this notion, unless our empirical knowledge is faulty beyond our comprehension. Our brain MUST attain these functions from extremely complex geometric mathematics at hand in every aspect of our chemical being. Our perception is nothing more than a random musing of these theories? Our thoughts, volition, memory, experience are formed by nothing more than this? The introduction of a simple chemical attests that our perception is sculpted by nothing more than intrinsic chemical reactions. How hard it was to conceive an idea like this. Every breath brought a new unattainable climax of artificial spirituality to my mind and body. </p><p>Why are you on the floor? he asked, dumbfounded, as I lay on my carpet, staring into the depths of my altered visual cortex. The carpet looked like it had a constantly changing oceanic film laid out across it. Why was I confined in this stereotypical human space? I needed to get out. I needed to feel at least partly included in someone that understood and would answer all the questions that had been dug out from my unconsciousness; Nature. I fled down my stairs and opened my backdoor without notifying anyone of my leave. I couldnt have cared less.</p><p>My thoughts, senses, ideas, questions, perception, all took on this radical notion of human geometricity. As I lied, sprawled out on the cool, wet grass, my vision became coated with geometric patterns that I never knew my brain had the nature to produce. Colored lines in the millions swam in symmetrical, fractal means before my visual field. From depths of my brain, beyond my control, were birthed these incredibly complex mathematical functions, lied out before my eyes and far, far away from my comprehension. Was I too weak minded to conceive these ideas without the aid of foreign organics? The American paradigm was non-inclusive of radical ideas like this.</p><p>The trees bloomed with more life before; they took on an incredibly wise human personification. Multiple limbed, armed with the knowledge of all the questions wed never understand and misjudge as God. Yet why would they have cared if I was alive or dead? Wasnt I part of that collective conglomerate bringing their timeless information to hell? They hated me. I couldve never felt at home in their sanctity. I went back inside. I denied the cool breeze of the temperate earth tasting my nerves.</p><p>The geometric patterns still lathed my every sense as I opened up the door and headed upstairs, ignoring everyones questions and comments. My ears rang with graphs of impossible tangent functions. I heard mathematics in my head. My closed eyes revealed a myriad of intangible ideas strung out across a 3 dimensional graph. My consciousness was like a cumulonimbus cloud of questionable thought, questions and answers came and were answered as fast as the metaphorical bold of lightning. </p><p>Inconclusive, I told myself. I denied a logical explanation to any of the thoughts running through my head, the plausible notion of the possibility of this state of mind. It seemed unreal, more unreal than a dream. We were so unfamiliar with any perception not existent in our daily lives. It was horrifying yet gratifying to me. </p><p>Three hours had passed, and metabolism had decreased the level of my confused perception, yet the doors were left open. I remained stuck in the millions of neuronal pathways opened by such a simple molecule, and I struggled to answer the slowing bombardment of questions. Not only did the answer seem more abstract than the questions by the minute, but both became more irrelevant. Hours of this perceptive cocktail had worn out my mental comprehensive capacity. I no longer found this declining state so profound, as it was replaced by my human need to sleep and return to normality. Visual alterations still occurred, yet they werent accompanied by the former ideas. </p><p>Coincidentally, it was a few meaningless hours before I decided to go to bed. I endured even more hours lying in bed trying to sleep. My mentality was totally recovered, but my senses were still tainted with electronic sounds, visions, feelings and abstract thoughts that tingled my every being, keeping me from falling asleep. The faint light in my window looked like a bloodied plane flying across my visual field. My vision was filled with annoying, popping, colored neurons that wouldnt dissipate. My feeling was unnatural and extremely heightened, making the normal comfort of blankets seem like tiny, innumerable mechanic sensations that wouldnt ease. My sound was tainted like the former two senses. I finally reached the orgasmic state of sleep to the random, extremely redundant thought of half naked gray-haired man building a sand castle. </p><p>I awoke anew and conscious as ever in the morning, imbued with a new sense of ambition and motivation. Throughout the course of my life, I saw no greater use of it than to answer any philosophical insertions that experience would grant me. </p><p>Equipped only with minimal spiritual and empirical knowledge, every day since then has been an extension of this adolescent aspiration.</p>"
}
