{
 "title": "Ergoloid Miracle Drug; Psychic Penicillin",
 "author": "Dr. J.G. Knaapen",
 "citation": "   Dr. J.G. Knaapen. \"Ergoloid Miracle Drug; Psychic Penicillin: experience with Hydergine (ID 36966)\". Erowid.org. Sep 25, 2004. erowid.org/exp/36966",
 "substance": "Hydergine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "sublingual",
   "Hydergine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "36966",
   "Male",
   " ",
   "Not Given",
   "Sep 25, 2004",
   "33260",
   " "
  ]
 ],
 "report": "<p>In the continual self-proscribed courses of study we follow through entheogenic illumination, there are pitfalls of the flesh... the meat puppet takes damage for the sake of the soul. For milennia, the idea of salvation from mistaken dosages and purposed extremeties of conscious state gone awry have culminated into many medicines and practices designed to prevent, assist in the resistance of or heal the wounds of our magical obsessions. Most of these, I have found through my short tenure indulging in entheogenic extrapolations, are based on symptomatic progressions, and thus do not, I feel, always reach into the actualities of our variuos dilemmas. Hydergine, to all my faculties (real/imaginery, intellectual/emotional, mystical/scientific) reaches deeper than most, if not all, other 'smart' drugs. </p><p>Two hours after sublingual ingestion of a single pill, I attempted to smoke a cigarette, one of my more deplorable habits. I found myself nauseous, blissfully so, at the first puff. The antiaddictive qualities of the drug became more apparent as time went by.(this may be due to the 'law of fives', but I think there is far more to it than that... I have tempted insanity often enough to recognize the veil between egotistic projection and honest experience, for the most part). I flew through games of Go (Baduk, Weichi), with an understanding which bordered on constant gnosis during the performance of each move of the game.</p><p>The binary nature of perception became subtly more pronounced in my life during the time of my usage, and I fully intend to resume usage of the substance as soon as it becomes economically viable to do so.</p><p>I recommend careful experimentation to any and all entheogenicists, shamans, sorcerors, artists, scientists, etc. Honestly, sisters and brothers, the idea of 'feeling smarter' has never been so thorough, benign, and foundational as with this substance. There is a clue in this drug of the Way... a minor glyph for psychographical recapitulations...</p>"
}
