{
 "title": "A Trap Door",
 "author": "CactusBrain",
 "citation": "   CactusBrain. \"A Trap Door: experience with Salvia divinorum & Meditation (ID 37000)\". Erowid.org. Feb 23, 2007. erowid.org/exp/37000",
 "substance": "Salvia divinorum & Meditation",
 "bodyweight": "112 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "sublingual",
   "Salvia divinorum",
   "(leaves)",
   "  T+ 3:00",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 37000",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 23, 2007",
   "Views: 9190",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently, I have been able to try Salvia. This plant is absolutely fantastic! I have always been a person who looks for new experiences of the mind; my past psychadellic drug use consists of Mushrooms, LSD, Mescaline, Ketamine, DXM, PCP (by accident, and that stuff really sucks), MDMA, and San Pedro. I purchased some 10x extract and have used it in quite a few settings. The first few times I used Salvia, I was really in awe of what a unique and powerful experience it was; quite frankly, I couldn't make heads or tails of what was going on. However, I have been using it more and trying to get a better feeling for the trip and find out where I can go with it.<br>The last time I used Salvia, I chewed two grams of leaves in my mouth for 30 minutes, and as the effects came on, loaded three hits of 10x extract into 3 seperate bowls. Anyways, I hit each one, practically gasping for air afterward (I hate holding my breath for so long) and laid back onto my bed. I decided this time that I would attempt to meditate while riding the Salvia high. I have gotten to amazing states of mind through meditation alone, but Salvia struck me as a drug that induces a mindset very similar to deep mediation.<br>I felt as though I were part of some strange reality, but quickly and quickly, it would shift into being a different reality. For example, the first reality I would feel as though I was actually part of my bed, that we were the same structure. However, I wouldn't feel like I was lying down and looking up; rather, it seemed that the bed was like a rock jutting from the side of a cliff. I was no longer looking up, rather I was looking forward. I don't know if it makes sense, but I was the end of a bed that was vertical, not horizontal.<br>That would be one reality, and then it would suddenly shift. Now it is some reality where my upper body, and my lower body, are in two different dimentions, or two different lines of existence. However, I am fully aware of both simultaneously, and fully experiencing both at the same time. In one line of existence, my legs and abdomen are connected to and part of the bed, whereas my torso and head are the same as usual, just lying on the bed. <br>So, realities were shifting faster and faster (in the span of what would be a minute I guess) but I realized I didn't have to experience or even exist in any of those realities if I didn't want to. They kept changing, but I got to the point where I could stay in a reality that I liked, or let one pass that I didn't like. Basically choose which reality I wanted to be in. <br>Instead of staying in any of the realities and marveling at the closed eye visuals, I decided to not accept any of the realities that I was noticing. The more 'stubborn' I was about not accepting any of the realities, the faster and more furiously they changed about. However, I wouldn't accept any of them. Suddenly, I went through something like an existence trap door. You know in movies when you see Indian Jones or somebody go up to a wall or a bookcase, and then push it and they rotate into a secret room? That what it felt like, but instead of it being a rotation into a different physical place, this was a transcendence into a different space and time. <br>It felt like I just left the world, my body, and my mind, continue to function in its' world, but I on the other hand, would go check out another dimention. I suppose it was dissociative in a way, but I felt more like myself than almost any other time in my life. It was like letting go of all the heavy baggage that comes with being a human and living a life, and taking a short vacation to see what other forms of existence there might be. Eventually, I decided it as time to go back.<br>I opened my eyes, and I'm not sure how much time went by. I am still very high on the Salvia, but I am definately back to this dimention. I feel absolutely great, very refreshed. I feel as though I just got back from a week long vacation, very light. Anyway, I've continued to use salvia and meditation together. Sometimes I use smaller amounts, but it's gotten easier and easier, to find that existence trap door. After practice, I realized that the trip can be very controllable. In fact, the trip can be transcended completely.<br>On a serious note, I know the DEA is working on making Salvia illegal, and it's really awful. This plant has so much untapped potential for mental/spiritual uses, it should be a crime to criminalize this drug. We live in a hypocritical society that hates 'recreational' drugs, but is so dependent on pharmacuetical drugs. Chemicals that stabilize, or control, how you think are OK (anti-depressants, anti-psychotics, and mood-stabilizers). Chemicals that make you think differently, that open you to experience other forms of consciousness are abolished.<br>Drugs such as mushrooms, salvia, and peyote have been used by civilizations for thousands of years for their spiritual and psychological values. However, in less than 50 years, our government has been bold and arrogant enough to abolish, criminalize, and denounce drugs that have these roots. The fact that people have used these drugs for so long demands that we study them more, not get rid of them and become ignorant of what they can teach us. Well, Salvia is going to be one of their next targets, and it's a real shame. Try it now while there is still time. (sigh)... The drug war really needs to head in a new direction.\n\n\n"
}
