{
 "title": "Honing My Recipe",
 "author": "The Wizard",
 "citation": "Citation:   The Wizard. \"Honing My Recipe: experience with Banisteriopsis caapi & Psychotria viridis (ID 37069)\". Erowid.org. Sep 30, 2004. erowid.org/exp/37069",
 "substance": "Banisteriopsis caapi & Psychotria viridis",
 "bodyweight": "68 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Banisteriopsis caapi",
   "(tea)",
   " ",
   "  ",
   "oral",
   "Psychotria viridis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 37069",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 30, 2004",
   "Views: 37923",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe Ayahuasca Experiments\r\n~~~~~~~~~~~~~~~~~~~~~~~~~\r\nFirst of all let me state that I am interested in the exploration of consciousness, spiritual growth and healing. I am not interested in tripping or getting high.\r\nMy interest in Ayahuasca started around New Year 2000 when I was on a trip to South America and I came across it. Unfortunately my attempts at having Ayahuasca in Peru were unsuccessful due to the only ï¿½realï¿½ shaman we found after days of looking being drunk and very anti-western. Since then I have kept a look out for Ayahuascaï¿½ much to my delight I have found a supply of all the ingredients I could ever want.\r\nMy experiments are aimed at have a traditional Ayahuasca experience. For this reason I choose the most traditional mixture. I was very cautious about dosage due to everything I read about Ayahuasca being so strong. Please note: Ayahuasca is the name of the vine Banisteriopsis Caapi as well as of the drink made from the vine and admixtures such as Psychotria Viridis\r\nRecipe: \r\nhttp://www.ayahuasca.com/cgi-bin/faq.pl#2.USE \r\nIngredients: \r\nDried Banisteriopsis Caapi (Ayahuasca) Black vine, Shipibo-Conibo, Peru \r\nDried Psychotria Viridis (Chacruna) Puccallpa, Peru \r\nDosage: \r\nBased on extensive research. I decided to base my dose calculations on Jonathan Ott's Ayahuasca Analogues: http://www.serendipity.li/dmt/hoasca.html \r\nVerified on: http://www.erowid.org/chemicals/ayahuasca/ayahuasca_info8.shtml\r\nBody Weight 68 kg \r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nPotion (1): \r\nBanisteriopsis Caapi 15 grams \r\nPsychotria Viridis 34 grams \r\nResults (1): \r\nFailed. No Effects. Single purge. Something wrong. Assumption: Dosage is too low.\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nPotion (2): \r\nBanisteriopsis Caapi 30 grams \r\nPsychotria Viridis 70 grams \r\nResults (2):\r\nFailed. No effects except some Nausea. No purge. Assumption: Dosage wrong again.\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nPotion (3):\r\nBanisteriopsis Caapi 70 grams \r\nPsychotria Viridis 70 grams \r\nPotion (3) Results: \r\nFailed. B. Caapi went off because I decided to soak it in water with lemon juice for a few days before brewing. You can smell it was bad. It gives you this feeling of wanted to puke just smelling it.\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nPotion (4):\r\nBanisteriopsis Caapi 100 grams (Red, Equador)\r\nPsychotria Viridis 100 grams \r\nPotion (4) Results: \r\nSuccess: Good strong purging. No psychedelic effects for two hours and then mild effects for 3 hours. The effects include: \r\nï¿½\tMild C.E.H. (closed eye hallucinations)\r\nï¿½\tSlight buzzing sound which was irritating\r\nï¿½\tFeeling of energy ï¿½fieldï¿½ in my body\r\nï¿½\tSlightly altered thoughts, colours and perception\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nConclusion:\r\nI am no where near the level of mystical experience. I have decided to change my DMT source to M. Hostilis or D. Cabrerana. Both are used in South America so can still be considered traditional admixtures although less common than P. viridis.\n\n\n"
}