{
 "title": "Geology Field Trip 101",
 "author": "Mobius",
 "citation": "   Mobius. \"Geology Field Trip 101: experience with LSD & Cannabis (ID 3707)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3707",
 "substance": "LSD & Cannabis",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3707",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 13337",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA few weeks ago I had an interesting experience during an overnight geology field trip to the New England fold belt in NSW, Australia. We were staying overnight in a little motel in a rather isolated area, and it seemed that everyone's plans for the evening involved getting drunk. I have never really enjoyed this activity very much, so I decided that some other form of chemical recreation was in order. Entheogens being in short supply, I had to make do with the single hit of acid and 1/2 gram of weed I had on me.\r\nMe and a friend decided to split the acid tab, for a relatively mild experience. I had taken acid a number of times before, but this was only her second experience. We dropped the acid after dinner, and patiently awaited the effects.\r\nAfter about 30 minutes I could feel the first effects of the acid, during a game of pool. We decided to head outside to the fire that had been set up, and as we left the pool room my friend indicated that she was also starting to feel mild effects, most noticably a perceived increase in temperature. \r\nWe sat around the fire for a while, enjoying observing and analysing the behaviour of our inebriated colleagues (an activity which I find very interesting while tripping), and then wandered down to a little stream nearby. By now I was well and truly feeling the acid, and I was pleasantly suprised by the potency, given the small dose. Notable effects were the intricate patterns formed by the tall trees as a slight breeze blew through their leaves, and the various images visible in the reflections off the surface of the water. My friend pointed out something on the other side of the stream (I think it was a rock) that looked exactly like a monk sitting in a full lotus. The next couple of hours were spent moving between pool room, fire and stream, with pleasant, but not mind-blowing, entheogenic effects.\r\nAt around 2am (I think), most people had turned in for the night, and we decided a joint was in order to help us get to sleep (we had to leave at 7 the next morning). I got the joint that I had rolled earlier out of our room and we took it down to the fire, sharing it amongst a few friends. I should mention that I have smoked weed while tripping on numerous occasions, usually with disapointing effect, ranging from nothing at all to an irritable tiredness, like coming down from a speed run. This joint, on the other hand, totally blew me away. I found it extremely hard to communicate verbally, or even to move. Looking into the fire produced an instant display of fluid images, and the drunken antics of those around me took on such an hilarious aspect that I could not refrain from occasionally breaking into hysterical giggles. One guy in particular was telling a story and it was the funniest thing I had ever head in my life. This effect was similar to my first few experiences with marijuana. \r\nEventually we decided to go to bed to try and get a bit of sleep. There were 4 other people sleeping in our room when we got there, and we tried to be as quiet as possible (with very little success, I should add). It was when I lay down in that pitch black room that I had one of the strongest entheogenic experiences of my life. Closed eye visuals consisted of the typical swirling patterns and colours, but their intensity and richness rivalled my strongest acid experiences - all this off 1/2 a tab! More intense still were the physical and aural effects, no doubt aided by the weed. The sound of everyone breathing made me aware of a connection I had with each of them, in that we were all sharing each others' air. This gave rise to a feeling of physical connection, like we were all joined in a sort of spiderweb pattern. At this point I openned my eyes, and immediately became aware that I was no longer inside my physical body. I was a single point of conciousness, floating in a dome-like space. I (the point) started to emit music, of a very peculiar kind. I should mention that the previous day, during one of many long bus rides, the radio was tuned to some sort of '80's Marathon'. I guess I must have been heavily influenced by that, because the music I was making (inside this dome, not in the outside world) was sort of a hybrid of 80's new wave and psychedelic trance. This music was so beautiful, and its beauty was enhanced by the way it circled around the domed walls and returned to my point-conciousness with added singing, in some strange language I could not understand. \r\nNeedless to say, I did not get any sleep that night, as the worlds I was visiting were far too interesting. As I mentioned earlier, this was one of my most intense entheogenic experiences to date, despite the extremely low dosage. The synergy of the acid and marijuana was undoubtedly responsible, as throughout the experience I could feel myself as a mediator between the acid's celestial energy and the marijuana's terrestrial energy. The experience was also enhanced by the setting, very secluded and relaxing, especially down by the stream. In all, this was definitely a 10/10 experience.\n\n\n"
}
