{
 "title": "50 Hit Accident",
 "author": "Futants",
 "citation": "Citation:   Futants. \"50 Hit Accident: experience with LSD (ID 3708)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3708",
 "substance": "LSD",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "50 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3708",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 5713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA few weekends ago some of my friends and I went to a rave in Austin.  I had some LSD to sell and take.  I was really stupid about obtaining it becuase I didn't 'try before you buy.'  which I normaly do when buying any large amount of drugs.  I sold it to about 30 people right away.  It turned out that it was incredibly weak.  The potencey was about 8=1.  I was screwed.  People were mad and I had to give out some refunds (I'm a small person and they were large persons)\r\nBecause mine was so weak my friend found another dealer and payed for two drops.  He held out his hand to get the drops on the back of his hand, but the guy said, no stick out your tounge.  He felt a stream pour into his mouth.  The dealer didn't notice that he had just poured half his acid into my friends mouth.\r\nIt has taken him a long time to remember all of the things that happened that night.  He ran up to one of our friends and told him the story rather excitedly.  5 minutes later he was sitting on a chair when I saw him.  I asked him if he found any, and he told me the story a little less excited as it was kicking in hard.\r\nAbout 30 minutes later he was climbing all over people and asking what his name was.  At the party he knew 3 sentences:  'Whats my name,' 'this is not reality,' and 'where am I'  Our ride was tired and wanted to go home.  So we decided to leave.  My friend hadn't tried to walk until this happened...  We discovered that he couldn't walk or even stand.\r\nThe place was crawling with cops for some reason (PMA scare most likely)  They kept walking past him when he was on the chair and looking at him funny.  We got to the door where two officers were standing.  He fell to the ground unexpectedly.  The cops looked at us and started talking, then looked back.  His girlfriend was so mad at this point that she said to leave him.  We put him back on the chair and were going to leave two of my friends to look after him.\r\nI followed my ride out reluctantly.  We got in the car and started to pull out.  I saw a different friend standing in the parking lot looking very lost.  We stoped and rolled down the window.  she franticly told us that some one had told the cops what was going on...  we know the owner of the venue so he grabed us and ran us back to my tripping friend.  There were about 6 cops circleing him and shineing flash lights in his eyes.  his girlfriend cryed at two of the cops and they agreed to let us take him home.\r\nWe picked him up and started walking out.  he put a smoke in his mouth, looked at a cop, said 'shit, dude, is that a cop' and pointed at another cop.  The cop said to me 'are you sure you know how to handle this?'  I said yes we will get him some sleeping pills.\r\nwe took him to the car with all the cops at the place following us.  They told us that we should take him to the emergency room to get checked out.  They bid us good luck and we set off.  He learned to say : I want some pot, I want some coke, and I want a cigarette.  on top of the others.  we remembered that we had a video camera with us and decided to tape him.  not to be mean, but to show him what he looks like when he does lots of drugs.\r\nWe got to the store at about 4 am to buy the sleeping pills.  we parked in the furthest spot from the store in order to keep my tripping friend away from people he didn't know.  I ran into the store and got the pills.  When I got back we sat around for about an hour taping him and calming him down.  He learned about 10 new phrases during this hour.\r\nWe got home, snuck him in, and went to his room.  He didnt know what we were saying.  He didnt understand what be quiet meant.  He was talking loudly.  My friends mom woke up and came in.  We told her that we came home early and that we were just talking about the party.\r\nThat was the scary part for all of us.  he remembered his visuals the next day.  he said it went beyond acid visuals.  he was almost in another demention.  when people walked they would melt into the floor, then a line would apear right on the path that they were walking, then if they stopped, they would re-appear.  he said that he could not see himself in anyway.  things melted onto things and stayed that way for minutes at a time.  His body felt normal yet he was totaly in a pschotic state.  He also thought that he was gay for two days afterwards.\r\nAfter seeing this I would never let anybody dose me directly.\n\n\n"
}