{
 "title": "The Mystical Amanita",
 "author": "Pedro Aguaro",
 "citation": "   Pedro Aguaro. \"The Mystical Amanita: experience with Amanita muscaria & LSD (ID 371)\". Erowid.org. Jun 11, 2000. erowid.org/exp/371",
 "substance": "Amanita muscaria & LSD",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "3.5 caps",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)",
   " ",
   "1 hit",
   "oral",
   "LSD",
   " "
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 371",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 11, 2000",
   "Views: 15596",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI recently found a treasure growing in my back yard. I live in the foothills of the Adirondacks with a lake in my back yard. Many different kinds of mushrooms grow in my back yard. one i happened to notice was a psychedelic variety named the 'fly agaric' Amanita Muscaria. I harvested and dried 4 caps. Around 1:30 pm after i completed the latter process i ate 3 1/2 caps over 6 slices of homemade pizza with a glass of whisky and coke. I continued back to school for my final period of the day. During that period i felt extreme nausea and salivation. A light trippy buzz followed till someone offered me a hit of LSD which i readily accepted. At that time i realized i must go to soccer practice. I dressed on the field feeling euphoric and dizzy. Then as i started running the distant view became a mesh of undulating colors. I ran as quickly as i could and the distant blur became quickly closer to my vision. The grass seemed to move around in a spiraling fashion changing to brilliant colors of red, blue, and yellow. The people around me became just figures of color and movement and my mouth filled with saliva. The time passed quickly and i returned home for a meal with my mom. The plate and food were as indistinguishable as her words but i struggled and went to my room after dinner. the world went black as I laid down and visions of all kinds started. i lost time then and was brought to consciousness again 2 hours later. i sat on my floor with a voice talking to me. its words i cannot remember but it was coupled with faces whirling past me down the tunnel of my vision. my history notes were spit on and stuck to the insides of my arms but i still ran through my room of psychedelic colors. Thoughts raged through my head at incomprehensible speeds. Till i walked from my room and followed my visions through the house were they ended in the bathroom. The mild visions for the rest of the night were easy to handle after that.</p>"
}
