{
 "title": "Violent Blackouts",
 "author": "Better Now",
 "citation": "   Better Now. \"Violent Blackouts: experience with Zolpidem, Cocaine & Bupropion (ID 37127)\". Erowid.org. Oct 5, 2004. erowid.org/exp/37127",
 "substance": "Zolpidem, Cocaine & Bupropion",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Pharms - Bupropion",
   "(daily)",
   " ",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 37127",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 5, 2004",
   "Views: 21848",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was taking wellbutrin for depression and having problems sleeping, so my doctor prescribed 10 mg of ambien as needed. It worked really well and I didn't need it anymore after about 2 weeks. I would also use it when I stayed up all night doing lines of coke. I took 1 pill right after the peak from my last line and I would drift off into a restful sleep without any of the unpleasant feelings of coming down. Sometimes I would get up after 'falling asleep' and get something to eat, talk to my sister, or start cleaning something - none of which I had any memory of when I really woke up that evening or the next day. But that was the extent of it and the sleepwalking/blackouts seemed harmless.</p><p>So, I recommended the routine to a friend. He was taking effexor, which is the only real difference I can think of. Either that or guys have more violent tendencies, but that's a questionable theory too. We did about a gram each of coke throughout the night and then settled down for bed with our one 10 mg ambien each. About 15 minutes later, when I started to feel really drowsy and about to drop off, my friend got really animated and energetic. He started talking and wandering about the room from thing to thing with no real purpose. Then he went outside to smoke a cigarette. He came running back in and said he had to show me something. He wouldn't tell me what, but said it was really cool and I just had to see it. When I flatly refused - being mostly asleep - he grabbed my arm and actually physically dragged me through the house and outside onto the lawn. I was struggling and fighting him but he seemed incredibly determined. Then when we got outside he didn't know why he wanted me there. This is a close friend and someone who has never been anywhere near violent with me in the past. When we got up about 6 hours later all he could remember was taking the pill and getting into bed.</p><p>We had one other similar experience, but this time we were only drinking. He had several red bull & vodkas and thought the caffeine would keep him up. We had talked about the earlier incident (about 3 weeks earlier) and decided it was a freak thing that probably had more to do with the coke. So he took a half pill to be on the safe side (5mg). He walked his girlfriend out to the car and she said he started to get really argumentative after a few minutes. It escalated into a full scale fight where he slapped her hard across the face. Once again, this is totally out of character. She was pregnant and he treated her like a goddess; he was really paranoid about getting her upset or hurting the baby. He ended up storming off, falling down a 30 or 40 foot hill in front of my house, and somehow got into a fist fight with some high school kids hanging out across the street. He just walked off into the neighborhood and returned about an hour later. He was beat up and his shirt was torn, he kept asking me what happened and what he did. His girlfriend and I filled in the blank spots, and he thought we were messing with him. </p><p>The only reason he believed it in the end was because he remembered picking a fight for no reason and then kind of coming to walking around the neighborhood. I think you should be really careful taking this drug with anything else. You could be fine like me, or have really crazy reactions at a really low dose like my friend. He really couldn't get over how total the blackout was. It wasn't like dreaming or that hazy rememberence you get from drinking too much. He compared it to the time he was under anasthesia for surgery.</p>"
}
