{
 "title": "It Has Made Me Ill",
 "author": "Unregistered",
 "citation": "   Unregistered. \"It Has Made Me Ill: experience with Ephedra sinica (ID 37179)\". Erowid.org. Oct 4, 2004. erowid.org/exp/37179",
 "substance": "Ephedra sinica",
 "bodyweight": "67 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 0:00",
   "4.5 g",
   "oral",
   "Ephedra sinica",
   "(tea)",
   "  T+ 1:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "37179",
   "Male",
   " ",
   "Not Given",
   "Oct 4, 2004",
   "18372",
   " "
  ]
 ],
 "report": "<p>I'm male, 40 years old, 67kg and 1.70 m. I dont know if ephedra alone is responsible for what happened.</p><p>I had drunk some brandy after my noon meal, which is unusual for me (3 little liquor glasses). I had drunk some on the eve's evening  (3 or 4 little liquor glasses). I had some repetitive work to do in the afternoon, so, in order not to get bored and to avoid the tiredness due to the alcohol coming down, I brewed some ephedra tea. I've boiled something like 4 or 5 grams. It produced 2 cups that I've drunk quickly. I had the usual ephedra effect, but stronger (my 'normal use' is 2 grams). I was a bit nervous. I smoked some pot and the mix gave me some vertigo for 10 minutes, one hour after having drunk the tea. I checked my heart beat, which was around 75 bpm. The whole ephedra effect lasted 3 hours before wearing off. A little time before it wore off, I felt some pain in the kidneys area, both sides. The pain slowly faded in the evening, but I was very tired, but I woke up in the night and the pain was back. The day after, I was in pain all day. I guess that my kidneys had no real problem and that the pain came from a belly spasm. Now, 2 days after, the pain is still here but lighter, and I'm feeling really tired (because of the spasm).</p><p>I dont know what caused this. Ephedra seems cool but has a lot of heavy side effects. I read that Canada health warns not to use ephedra constantly and to avoid quantities over 1.5 g. I guess they're right. I'll use it again, but at very low doses, and not before a few weeks.</p>"
}
