{
 "title": "My Goddess and My Destroyer",
 "author": "Never Green",
 "citation": "   Never Green. \"My Goddess and My Destroyer: experience with Caffeine (ID 3720)\". Erowid.org. Mar 5, 2001. erowid.org/exp/3720",
 "substance": "Caffeine",
 "bodyweight": "155 lb",
 "header": [],
 "footer": [
  [
   "1998",
   "ID: 3720",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2001",
   "Views: 21919",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was a Sophomore in college, and I had this really awful math test coming up, Multivariate Calculus. And I got 100 mg of free Vivarin with my lunch that day (Vivarin likes to market at colleges). So, I take the 100 mg, and study like mad. I could totally focus, locked away in the basement of my dorm, with no sound, no people, just me, the math books, and the caffeine. Sometime around 3:00 AM, I got sleepy, so I went hunting for anyone awake who might have another. Didn't find any, so I drank 3 cokes. Studied more, and eventually walked to a convenience store before dawn to get more pills, this time 200 mg ones, not 100. I kept going till the math test, aced it, and crashed. I don't remember a damned thing about Multivariate Calculus anymore, but the A is on my transcript, so I don't care.</p><p>One year later, I end up in the same situation with a new math test, this time Linear Algebra. Repeat exactly:  I ace it, then crash and forget the whole deal. Only this time, I was tempted by the mega box of pills at the store - 80 pills, 200 mg apiece, for under 20 bucks! Long after my math test is finished, I still have this giant stash of caffeine, and I'm gulping down two, three, four a day. They make me feel great, energetic, and special. I have a new best friend, pressed neatly in line, 8 at a time in foil packets. Nothing could be better. My new hobby is downing two pills and playing loud punk music till 4  in the morning. I also like to create new religions for fun, and scribble funny symbols down in notebooks. Anything that's mindless and fast amuses me endlessly.</p><p>And then it's sort of a blur. I had no knowledge of stimulants and didn't know that I was crashing. Sometimes, I'd be all up and excited, like everything in life was perfect and no one could touch me. At other times, I'd mope about the futility of existence, personality quirks I didn't have the power to overcome, and how everyone at my job was plotting against me. Then I quit the job and got another one. Then I got fired. Then I failed a whole lot of courses, got thrown on Prozac, tried harder drugs, blew $3,000 on random junk, failed more courses, got fired from a new job, dropped out of school, etc. Pretty standard story. I don't think caffeine screwed me up this much all on its own, it just got me rolling. I was depressed and used the pills to self-medicate, but stimulants, even weak ones like caffeine, are a lousy way to treat depression and just made it worse.</p>"
}
