{
 "title": "Wake-Mare",
 "author": "Sands",
 "citation": " Sands. \"Wake-Mare: experience with Mushrooms & Cannabis (ID 37227)\". Erowid.org. Jan 26, 2008. erowid.org/exp/37227",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE:",
   "2.2 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "37227",
   "Not Specified",
   "",
   "Not Given",
   "Jan 26, 2008",
   "2620",
   " "
  ]
 ],
 "report": "<p>During the summer, as we attempted to stave off boredom, my friends and I were usually found sitting around the campfire at our friend H's house, taking hits off pipes and bongs and playing video games long into the night. By this point in my life my only experience with drugs was weed, and I considered myself a fairly experienced smoker. My best friend in the group, B, had told me on many an occasion about the effects of taking shrooms, and the intensely amazing trip that one could take off of them. However, due to the fact that I am a very nervous person, and have been known to become extremely anxious from time to time, I was worried about what effects losing touch with my reality would have on my pysche. It was for this reason that I rejected, time and time again, any offers to do the drug, for fear that what I would see would be too intense for my liking.</p><p>This all changed at the end of July when three of us, myself and B, and a friend of ours, J, decided to take some mush on a whim. Being that it was my first time, and I felt safe tripping with my two experienced friends, I took a very small amount, a little over 1.5, and let the two of them have the rest. After we ate the mush, we settled down and took a few hits off of a lung. For the rest of the night, I enjoyed a very carefree state of mind, with a feeling of child like energy; however, I did not hallucinate, and I was completely aware of my surroundings at all times. It was my view that I had not taken enough to feel the full effects the first time out.</p><p>Three weeks later a small group of us got together at B's house while his parents were out of town; I was there, along with B, J, H, and a good friend of ours named D. We received our shrooms at around 11:00 p.m. from a friend, and we downed our respective doses with some O.J. </p><p>The high came on almost immediately.</p><p>H, who had taken an 8th, was the first to react strongly; he started laughing and screaming in the kitchen, commenting that he had never felt the onset hit him so quickly. The rest of us could feel it coming on, but we were in no way effected in the same manner. After about ten minutes, we all decided to go downstairs for a session. At this point I felt great, and I watched everyone around me with keen interest, feeling as though they were all characters in some kind of vast story that I was creating; everything seemed very vivid and dreamlike and I recall marveling at the creative thoughts flowing out of me. The basement floor we were seated on felt like a great ocean, and J and I took turns attempting to cross it on a boogie board. By this point J, having taken 4 grams to himself, was off in his own world.</p><p>I'm not sure how much time passed, because by now I was in the throes of my trip, but at some point we had all gone back upstairs, where H was listening to music and watching the patterns in the rug, saying he could see a tiger face popping out at him. I asked him if he wanted to go out for some air, and he said that he did. We had been sitting on the porch for a few minutes before H decided he wanted to walk down the street; I followed alongside him, still feeling good. However, after taking a few steps from the house, I began to feel an unparralled sense of dread which could not be explained. I looked around and the night seemed to be menacing, reaching out to get me, and I had no idea why. I suggested we go back to the house, trying to hide my apprehension.</p><p>When we got home, B was standing on his deck looking out to the sky. I joined him and looked North towards the downtown skyline; a red haze was slowly rising and falling, and the night sky seemed a pale purple full of bright twinkling stars that would blink on and off in time with one another; it all looked very surreal and phony to me, and I got the feeling that this whole thing was getting too out there for me. I went back inside, and tried to splash some cold water on my face, meaning to calm down. Things started getting worse from there; by this point I realized I was tripping hard, even though I tried to convince myself that I hadn't taken enough to be completely fuc*ked up. The justifying did no good; I am a lightweight when it comes to substances, and I knew that I was in a very real state of pyschological turmoil. I suddenly had the urge to go home -- I wanted out of the house very quickly, but B, knowing what I was going through, convinced me it was a bad idea, and that I just needed to relax. I decided to take a shower because it always helps to ease my mind.</p><p>When I got upstairs, I still felt weird, but I seemingly had control; I talked myself down quietly, and convinced myself that while I was stupid in taking the drug, I had done it and there was no way out, so I just needed to get by. I knew I could outlast it. Feeling in power of the situation, I looked myself over in the mirror; when I saw how dilated and strange my pupils were I realized I was still tripping hard and this scared me very badly. I just couldn't calm down. I stepped in the shower and instantly felt like I were in the movie 'Pyscho;' I had the notion that everything in the shower was against me and very soon the curtain would fling open and someone would kill me. I nearly leapt out and into to a towel, sat on the floor and contemplated.</p><p>I remember thinking that we were all in a movie, and that some unseen force had trapped us inside the house, and that one by one we would simply be killed off; I became convinced that if I left the house I would be killed by whatever monster was waiting outside, but I was becoming increasingly claustrophobic of my surroundings and wanted out. The fact that I was hiding all of this from everyone else, merely made the inner conflict that much stronger.</p><p>About fours hours in, I started to come down, and I realized so much about myself as a person, and felt like I understood everything about my life and the lives of those around me. I declared myself fit to return home, but B told me the mush was sure to kick back in. I ignored him.</p><p>When I got home I was met with bad vibes; I felt guilty by what I had done, and felt like I had failed everyone who loved me. The house seemed accusing, like it knew what I had been up to and it wasn't pleased with me. I tried to go to sleep, but I saw terrible images when I closed my eyes; people with gaping mouths screaming soundless screams, and horrible images of people being slaughtered. When I opened my eyes, the room looked warped and distorted, like I was looking at it through some kind of fogged over lens. I hyperventilated, and felt panicked for a good hour or so after having left the house.</p><p>Around 4, I listened to some Nirvana, and it helped calm me down, I finally slept, and woke up the next day groggy, but alright. This was the last time I will ever take shrooms again, and while I will never say don't try them, as some people have great trips, I will say that if something goes wrong, as it did for me, you will be in the throes of your own personal Hell for many hours. I'm just thankful I took a small dosage, and don't even want to think about what could have happened had I taken a dosage similar to that of some of my friends. That trip put me off drugs almost completely, and I don't even enjoy smoking weed as much anymore for fear I will lose control in the same fashion.</p>"
}
