{
 "title": "The Loop",
 "author": "CuriousJim",
 "citation": " CuriousJim. \"The Loop: experience with Amanita muscaria (ID 37239)\". Erowid.org. Oct 7, 2004. erowid.org/exp/37239",
 "substance": "Amanita muscaria",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Amanitas - A. muscaria",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2003",
   "37239",
   "Male",
   "",
   "Not Given",
   "Oct 7, 2004",
   "45791",
   " "
  ]
 ],
 "report": "<p>From an early age I had been told to stay away from the red and white mushrooms that grow abundantly in my area because they are deadly poisonous. I easily believed this because the eye-catching red coloring and the strange white warts just screamed out 'WARNING'. It was only in my early 20s that I discovered that that the danger associated with this mushroom had been grossly exaggerated. While the Amanitas in general are a  dangerous family, a correctly identified Amanita muscaria poses very little threat on your life and in fact can have some interesting psychoactive effects.</p><p>It was psilocybin mushrooms that led (through web research) to my new found knowledge on the very different effects of Amanitas, and it was after a successful hunt for liberty caps that I decided to have a quick look for some Fly Agarics on my way home. I didn't have to look far, they appeared under most pines in my area. I picked a plastic shopping bag full of partially sun dried Amanita muscaria. Once at home I dried the caps completely on an oil fin heater. The dry caps sat unused for about a month due to psilocybin mushroom season being in full swing. </p><p>Some background on me. With the knowledge that risk is fairly low I am confident when it comes to trying new substances. I would class myself as a semi-regular drug user, since I was 16 I have tripped on various substances on average about 3-4 times a year. While I enjoy high doses, I do so almost exclusively alone, it is a big block to me to have other people present while delving deep into my mind. In contrast, with light to medium doses I almost crave human contact.</p><p>On the day of ingestion I was in a good frame of mind although I had a strange feeling due to 2 of my good friends leaving the country in the next few days. I wasn't feeling sad, maybe a little nostalgic and a feeling that life is constantly changing. When I finally got around to trying them I simply blended several large caps into a course powder, measured out 10 grams and layered it thickly in a peanut butter sandwich. I had fasted for a full 24 hours and the sandwich went down with no problem. The taste was weird, not bad but far from good. I had decided to experiment alone but had told several people of my plans, everyone said that they were only a phone call away if I needed them, that made me feel good.</p><p>A couple of hours had passed. Initially I had felt nausea but that had passed in about 30 minutes after ingestion and I was now feeling fine but a little sleepy. I decided to head out to my back yard as there are many trees and a beanbag that I love to sit in. I had laid on my bed since ingestion and was surprised when I got up. It has happened to me many times, finding out a substance is actually in full swing only upon moving from my current place. My whole self seemed centered in my head and my body felt foreign and ill equipped for the task of walking to the back door.</p><p>I reached the garden, pulled out a cigarette and decided to sit on the grass instead of the beanbag that I only then realized had been gone for months. Sitting on the grass I began to take notice of the changes that were happening. I felt good but somehow detached from my body, not in the sense of a dissociative drug but more like sitting in a car without petrol, a useful thing to have but useless in its present state. My vision was also strange, patterns were swirling around but not in the slow gentle spiraling fashion I had experienced on other drugs. These visuals were a fast paced flickering of mostly oranges, blues and purples and held no beauty or real interest.</p><p>Then lying on the ground staring at the night sky, I passed out.</p><p>The loop was horrible, the worst thing I have ever encounted with any drug. While caught in the most insanely real dream world I've ever been in, it seemed as though I would never be the same again. </p><p>This is very hard to put into words but I'll try:</p><p>It was like knowing everything and knowing nothing at the same time. Always learning in the hope of finding out and getting ever closer to the goal, but then realising that it's all been done before and that I was never meant to find out at all. Realization that I'll never get there fades to a memory and then back to blissful obscurity only to be rediscovered after another heart breaking journey of discovery and failure. On and on, faster and faster. Each rotation of the loop getting smaller and smaller, faster and faster. This must be what it's all about, this is going to be the real lesson here I can feel it. The loop turns into a blur and I'm obviously at the end of it. </p><p>Then BANG. The loop was part of a loop.</p><p>Frustration, disappointment, fear, anger. </p><p>Scary stuff. Unlike anything Ive ever experienced. It seemed to go on forever and I knew I would be stuck in that loop forever. I vaguely remember other parts of that night but nothing else compares to the loop. At one point remembering that I could fly and the only reason that I normally couldnt was that I had never tried. Ridiculous, but so very real.</p><p>I woke late the next morning in my bed. This worried me because I had no recollection of getting into bed or what I might have done on my way there. I felt pretty spaced but was in full control and very groggy. I lay in bed for a long time going over the previous night and couldnt make much sense of it. I checked the house for any obvious signs of a freak out that might have occurred in my blackout, the only things I found were a knocked over computer chair and a broken plastercast of my hand that I made in primary school, all the fingers were broken off except for the thumb. I found my smokes outside exactly where they had been last night. I concluded that I had gone straight to bed from the garden. I was spaced out for the whole of that day but felt more or less normal the day after that. </p><p>In conclusion, well Im not sure what to make of this. This happened about a year ago and while Im sure I am going to try Amanitas again I have no intentions of doing it any time soon. Im almost certain that my experience would have been completely different if I had not passed out, but in saying that Im not sure how I could have stopped it. I definitely should have started with a lower dose to gauge my reaction, but in my haste I didnt even consider it. The experience was not pleasant but I think the substance does have definite possibilities for being very fulfilling.</p><p>So take heed of the advice given about Amanita muscaria all over the internet. My 2 cents, be sure of your ID, there are some nasty Amanitas out there and don't expect a psilocybin trip. </p><p>Have fun but beware.</p>"
}
