{
 "title": "Wobbly gravity",
 "author": "Doooofus",
 "citation": "   Doooofus. \"Wobbly gravity: experience with Codeine (ID 37242)\". Erowid.org. May 30, 2007. erowid.org/exp/37242",
 "substance": "Codeine",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Codeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 37242",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 30, 2007",
   "Views: 44647",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPrevious drug experience: weed, alcohol, nitrous, kava, ecstasy. I am in quite good general health, and take a multivitamin, vitamin C and folic acid every day.<br>I ate quite a large dinner at 5.30pm so I decided to wait until I thought my stomach would be close to empty to maximise absorption of the pills. I set about preparing my room - making my bed nice and comfy, choosing a chill playlist on Winamp, grabbing a few bottles of water and some chips in case I got hungry halfway through. Satisfied that everything was ready, I went about swallowing my 12 tabs of codeine. <br>There was quite a bit of mass to get through, it took a few minutes to get them all down. I noticed a strange taste on my tongue, not dissimilar to the numbing I get on my tongue from Kava, but nowhere near as intense.<br>(10.15pm) t+0: All the pills are down the hatch. Surf the net while I wait for something to happen.<br>t+3: I feel a small wave of warmth move over my body. I put it down to placebo or anticipation.<br>t+10: A strange wave of energy momentarily moves through my body. It feels like wobbly gravity moving through my system. The wave returns and begins to build in intensity over the next few minutes. The feeling changes from waves to a constant feeling of wobbly gravity. I noticed my feet feel quite warm, like they are wrapped in a blanket. Even though it is quite a hot night, the feeling of being wrapped in a blanket isn't uncomfortable. It is as if the temperature is regulated perfectly for comfort. It is at this point I decide to clamber into bed and put my headphones on.<br>t+13: My body feels quite heavy in bed, I notice that I am a little fidgety, and my muscles feel sensitive, almost ticklish. My mouth feels dry so I sip on my water. I keep glancing at the clock on the computer and notice that my perception of time has changed. Not to a huge degree but what I think is five minutes is only around 2 or 3 minutes. I settle back and concentrate on what my body is feeling. I feel as though warm, soft electricity is gently humming through my body. Music sounds a little more dynamic and rich.<br>t+40: I am definitely up (or is it down??) by now, very relaxed. I noticed that my face is particularly relaxed, I can do nothing but lie in bed with my mouth open and eyes drooping. I feel tired, but not in a sleepy way. I would liken the feeling to when I just wake up and roll over in bed on a cold winter's morning - the warm covers surrounding me and I know I've got nowhere to be for the next few hours.... bliss!!<br>I go over a few thoughts in my head, my thought processes are a little altered, I am thinking about things a little more deeply than I normally would. I imagine myself being one of those Chinese opium smokers, and I reflect on how drug culture has changed compared to the chinese guys - here I am, an 18 year old college student, getting high in my dorm room off over the counter opiates :).<br>At this point I notice the opiate itch present itself. The itch isn't unbearable, but I decide I will take some antihistamines next time to minimise the effect. The itch is localised to specific points on my body - the back left of my neck, my right palm and my inner left groin. I get out of bed, surf the net for a while. <br>t+80: I get the feeling that the codeine is starting to wear off. This strikes me as peculiar, I didn't expect it to wear off this early, and I didn't want the feeling to go! I decide to get back into bed to see if I can get the feeling back. I do so, and within minutes I realise that codeine rewards me nicely for staying still! When I was sitting at the computer, I was moving around a little, but in bed I lay motionless and the buzz returned strongly. From this point on the experience gets a little fuzzy, as I close my eyes and I think I may have been getting close to sleep. <br>With each different song coming through the headphones I would get a different mini-dream. As the song ended, I would snap out of the dream, and think about what had just happened, analyse the dream. Before long, the next song would start and I would get dragged into another daydream. This continued for quite a while, maybe 10-15 songs, it was comparable to nitrous, the feeling of drifting away from reality into a dream world.<br>t+180: The daydreams are still continuing, though the body buzz has dimmed considerably. The experience feels a lot more psychological now, compared to the start where it was mainly physical sensations. I decide to turn the music off and try to get some sleep.<br>I toss and turn for a few hours, not getting any real decent sleep until 5am (nearly 7 hours after dropping). From here I sleep quite well until 10.30am. I had very strange dreams in this period, some which seemed extremely realistic. I wake up feeling a little worse for wear, a few body aches and a mild headache. I notice these symptoms stick with me throughout the day, even now the next night after the experience I am getting warm flushes, have a headache and sore eyes.<br>I am quite impressed with codeine, it is cheap and readily available and provides what I regard as a decent high. It's not mindblowing, but nice for a quiet night in. I remember thinking that codeine would go quite nicely with nitrous or weed. The after effects of codeine are a bit of an annoyance, but I think it is worth it. Overall something I would recommend to everyone to try - just remember that all opiates are addictive.<br>Thanks for reading! Be safe.\n\n\n"
}
