{
 "title": "Daily Regimen",
 "author": "Dr. Hector P.",
 "citation": "   Dr. Hector P.. \"Daily Regimen: experience with Hydergine & Piracetam (ID 37335)\". Erowid.org. Oct 12, 2004. erowid.org/exp/37335",
 "substance": "Hydergine & Piracetam",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "Hydergine",
   " ",
   " ",
   "1600 mg",
   "oral",
   "Piracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37335",
   "Male",
   " ",
   "Not Given",
   "Oct 12, 2004",
   "Views: 30168",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have taken Hydergine for more than 10 years with a few breaks of 1 month or more for various reasons.  Going off Hydergine left me with a noticeable deficit in retention and recall of learned information.  It takes about a week of a daily regime of 1mg in the morning and 1mg in the evening sublingually. One word of caution, Hydergine has been linked to plaque build up on a valve in the heart.  This is a very rare condition.  Talk to a medical professional if you are concerned about this. Another draw back is that Hydergine is quite expensive.     </p><p>About 8 years ago I added Nootropil to my daily regime. When first starting or starting over after a break of a week or more I'd need to take an attack dose of 5000-6000 mg.  Nootropil has no has no LD (lethal dose) and has no know side effects at very high dosage. </p><p>I discovered that if I take 2 mg Hydergine with Nootropil at the suggested dosage 2 x 800 mg morning and evening (3200 mg daily) that I lost the ability to take what my mind was thinking and easily put it into words. I did several experiments and this is definitely a real effect.</p><p>Nootropil is much less expensive than Hydergine and I found that if I cut my daily intake of Nootropil down to 800mg twice a day that I could get maximum benefit from Hydergine with no side effects at 1 mg every other day.</p><p>My recall and ability to articulate complex concepts is greatly improved while on Hydergine and Nootropil.  I can truly tell the difference when I stop taking them.</p>"
}
