{
 "title": "Very Trippy High Dose",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Very Trippy High Dose: experience with 5-MeO-DiPT & Cannabis (ID 3733)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3733",
 "substance": "5-MeO-DiPT & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "18 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "2000",
   "3733",
   "Male",
   " ",
   "Not Given",
   "Dec 25, 2001",
   "4174",
   " "
  ]
 ],
 "report": "<p>\nI had already tripped on 5-MeO-DiPT 4 times before a friend and I decided to independently try a high dose. (he's going to dose next weekend) Here's what I remember:</p><p>At 6:30pm I measured out 18mL of 5-MeO-DiPT solution. I drank it down and ate some chocolate to get rid of the awful taste. (my friend and I had just discovered this) I called up some friends and headed over to their apartment on foot. After about a 20 minute walk I arrived at their place. I was starting to feel it come on at this point.</p><p>At about T+1hr we passed a joint around. I only took a couple hits off it. After that things started to get really weird. Time was _very_ distorted.</p><p>Around T+2hr (I think :) we popped in a movie and turned the lights off. I'd say that around this time I peaked. Things were much more visual than they normally are on 5-MeO-DiPT. I was getting some light open eye visuals and very strong closed eye visuals. We all lost interest in the movie after about 30 minutes and proceeded into a lit room. I was still tripping pretty hard at this point and we all had a nice mellow conversation. Time was still moving very slowly.</p><p>The next couple hours were rather uneventful. At approximately T+5 hours we busted out the bong since we were about to go to the movie theater. Things had calmed down at this point, but after a couple hits I was back to the strange land of a few hours before.</p><p>At T+5:30 we arrived at the movie theater. As we were walking in I knew I was in for a very strange movie. About all can say about how I felt at this point was that I didn't feel like I was inside my body. Everything felt very far away. I must admit that this was the weirdest trip I had ever experienced. (even weirder than 4 hits of acid)</p><p>Well T+7:30 and the movie was over. I was still tripping. (still...) The movie left me in a very introspective mood. I bid my friends farewell and walked home alone. A short while later I was home and quite hungry. (I had skipped dinner to trip) After a quick meal I attempted to sleep. It was T+8 or T+8:30 and I had considerable difficulty getting to bed.</p><p>That's it. I can't say that I will ever do more than 12mg of 5-MeO-DiPT again, but I will try smoking pot with a lower dosage to see how that is. I will say that I _never_ thought I would trip that hard on 5-MeO-DiPT. All my previous trips had been pretty uneventful. If this stuff was better known and didn't leave such a nasty taste in my mouth then it would be very worthwhile.</p>"
}
