{
 "title": "The First Time I Knew Fear...",
 "author": "Radagast",
 "citation": "   Radagast. \"The First Time I Knew Fear...: experience with Ecstasy (ID 3744)\". Erowid.org. Feb 11, 2001. erowid.org/exp/3744",
 "substance": "Ecstasy",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3744",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 11, 2001",
   "Views: 8748",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy girlfriend and I smoke pot fairly regularly, but had never tried any other drugs.  One night we were visiting with a friend of hers who's really into the rave scene. She was trying to unload some extra ecstasy she had.  We decided to buy it and give it a whirl.</p><p>We took the little white pills with the Nike logo on them about two weeks later.  After about half an hour I decided that ecstasy didn't do anything at all and was very disappointed.  Within five minutes after that I felt like I was twelve feet tall and our tiny little apartment was about the size of a football stadium.  Lights got much brighter and I started hearing little noises everywhere.</p><p>Within a few minutes both of us were absolutely terrified of EVERYTHING.  I didn't want to move because I thought I would fall.  My girlfriend didn't want to be away from me, but she was scared of me touching her.  We managed to talk each other through moving to the bed and laying down.  We got into the spooning position and both of us were too frightened to move even the slightest bit for over an hour.  If she hadn't been there to talk to me and make me feel more comfortable, I think I would have completely lost it.  </p><p>Eventually, about two hours after we had taken the pills, the fear started to lift and we were able to move again.  We have no idea how it happened, but a few minutes later we had absolutely incredible sex.  We decided to go to bed.</p><p>The Ecstasy experience changed my view of the world for weeks.  Things looked a little different and I noticed tiny details I would never have seen before.  To this day, several months later, I still occassionally notice and effect on my perception.</p><p>All in all, the experience was one of the worst of my life.  I think we may have just done it in the wrong circumstances.  The girl who sold them to us later told us that it's best to do it the first time with someone who's familiar with it.  She said two Ecstasy virgins can just freak each other out like we did.</p>"
}
