{
 "title": "Chasing the Dragon",
 "author": "shiva",
 "citation": "   shiva. \"Chasing the Dragon: experience with Fentanyl (ID 37460)\". Erowid.org. Oct 20, 2004. erowid.org/exp/37460",
 "substance": "Fentanyl",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 drop",
   "smoked",
   "Pharms - Fentanyl",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37460",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 20, 2004",
   "Views: 42366",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI obtained eight fentanyl patches (each one containing 5 mg fentanyl - 50 mcg/hr time released) which I found in the garbage of my grandma who has died of cancer recently.</p><p>There are numerous descriptions on how to use the fentanyl from time-released patches. Some sources recommend against cutting it open, saying it is a waste, but I have found a good way. If I make a small hole in the plastic patches, for instance, with a needle, and firmly press on the patch, I can easily push the gel out. I'm careful not to push the needle through the entire patch, just reaching the middle layer with the gel in it. Only need a tiny drop, am careful not too use too much. It is possible to build up the dose slowly: within 30 seconds after inhaling I can feel the effect. Don't want to take too much of this powerful stuff. When I have obtained enough gel out of the patch, I close the hole with a piece of tape, pressing firmly, it must be closed well for storage. This way I can use a bit of the patch many times.</p><p>I use a spoon to put the gel on a piece of tinfoil and have to remember where, because the gel is transparent. I fold the tin foil inwards horizontally and vertically and folding outwards again, so I see two folding lines making a cross, and putting the stuff there - I know where to heat and inhale.</p><p>Then I need a lighter and a little tube or pipe, or any other small, hollow, cylinder-shaped object. Don't need a very big one. I just make sure to hold it just above the gel when I heat it, otherwise the smoke which is not or barely visible may go somewhere else - this happened to me the first few times. So I hold the tinfoil with one hand, the tube in my mouth just above the gel, and heat it underneath with a lighter (or candle). Inhale. Hold it and exhale. Wait a few seconds to see if I already feel any effect. Repeat the process until I no longer hear the sishing sound from the heated gel, then it's gone.</p><p>When I follow these simple steps, I feel warm and nice and forget my problems and worries. If I take more the effect becomes even better. But if I take too much, I'll feel itching all over my body and will be unable to go to the toilet. I've never had vomiting problems with it but it is possible. I have experienced blurry vision many times with fentanyl.</p><p>It is very addictive too.</p>"
}
