{
 "title": "Salt Vapor",
 "author": "Hieroclasm",
 "citation": "Citation:   Hieroclasm. \"Salt Vapor: experience with 5-MeO-DMT (ID 37491)\". Erowid.org. Oct 18, 2004. erowid.org/exp/37491",
 "substance": "5-MeO-DMT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "inhaled",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 37491",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 18, 2004",
   "Views: 17978",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was sitting on my computer reading the news present on my ISP homepage and I noticed an article about a man in England who was selling machines to vaporize alcohal for consumption. The article mentioned his invention was based on nebulizer technology. Being curious, My friend and I succesfully nebulized vodka and became intoxicated. on returning home that night I began to wonder what else I could nebulize successfully, when it occured to me that 5-MEO-DMT may work. \r\nOn a later day the same friend and I discussed how to nebulize the 5-MeO-DMT. The 5-MeO-DMT I had was in freebase form, hence was not readily soluble in many things that we could safely consume. My friend had the idea to convert the freebase 5-MeO-DMT into salt form useing an acid of some sort. We decided that vinegar would do the job well. In the nebulizer's recieving container we mixed an estimated 60% rice vinegar with 40% water. We then added 25 mg of the freebase 5-MeO-DMT. With a small amount of agitation the 5-MeO-DMT began to dissolve into the vinegar solution. The 5-MeO-DMT was now in salt form.\r\nWe each inhaled one fifth of the fluid in vapor and began to feel some mild perceptual changes. Having done 5-MeO-DMT many times I could recognize the intoxication. The effects were slightly less intense, and slightly more drawn out than that of vaporized freebase 5-MeO-DMT, but the effects were definate. After about 30 minutes we were at baseline and decided we both had the expected effects, our experiment worked. \r\nIt is my conclusion that salt form 5-MeO-DMT can be nebulized with results akin to those of vaporized freebase 5-MeO-DMT. Next time I plan to use citric acid because the vapor produced by the vinegar solution was vary unpleasant, I would describe it as harsh and pungent (and obviously sour). This method of consumption is vary good because there in no waste due to heat or escaped smoke (though if your not carefull some vapor may escape). Also there is no hot sticky smoke to burn the lungs, and I would assume that is safer. I plan to experiment with other acids to find the most pleasant one.\n\n\n"
}