{
 "title": "Scary Trip",
 "author": "Kevin",
 "citation": "   Kevin. \"Scary Trip: experience with Cannabis (ID 37505)\". Erowid.org. Mar 4, 2008. erowid.org/exp/37505",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 37505",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 4, 2008",
   "Views: 5479",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'd first like to mention that I have smoked plenty of times before. The first time I smoked pot was in 7th grade(about 12 or 13). Most of the time when I use to smoke I would smoke mid-grade weed and hardly ever touched any bud, mostly because its more expensive. I've also tried shrooms(tea) and a few other weak drugs. </p><p>After a pretty much sober summer(as odd as that is) I started smoking again. Most of my friends are into drugs more now than they ever have been. So, I figured, why not?</p><p>One Friday night, around 8pm a friend of mine came over because he was bored and I was as well. We were going to go do something, but I wanted to smoke before we did anything. We finally decided to go eat, then decide what we wanted to do from there. My mom was home so we went to his house. My friend couldn't smoke because his job did drug tests, so I was the only one doing it(my bud). I ended up taking a lot of hits, not really thinking about what I was doing. The first bowl was rather big. I got about 5-6 hits out of it before it was cashed. Then I decided to smoke a little more real quick, so I loaded the bowl up again, but this time it wasn't quite as much.</p><p>When I was done we went back inside and were getting ready to leave when all of a sudden I had a rush. I felt like I was getting dizzy...then I felt like I was speeding, almost like a caffeine rush. I was laughing a little. By the time I got to his car I was feeling really dizzy and almost drunk. I got in and felt better, but really high. By the time we got out of his n'hood, my heart started racing and my mind was in a spin. I told him to get to McDonald's as fast as he could so I could get some food, hoping that would make me feel better. My mouth was now getting dry and my throat was closing(it felt like). I clumsily walked in the McDonald's and ordered a Big Mac. I had to sit down, so I did and then laid my head down on the table. After getting the food, he sat down also and I tried to drink something for my throat. My hand was shaking so bad as I moved the cup to my mouth. Whenever I looked up or stood up I felt like I as escaping reality....like distant inside my body...almost like I was just riding along inside my head.</p><p>I finally told my friend I wanted to leave and go home. He got some bags and we loaded the food up and left. As we left, I could feel my heart...beating...faster and faster. I had no since of time at all. All I could think about was why this was happening and if I was going to die. I thought of everything I had taken or eaten and put them in equations with the pot. The first thing I asked myself was if the weed was laced. Then I asked if it was reacting with my meds I was taking for my staph infection on my knee(Naproxen and Augmentin). Then I thought I had taken in too much aluminum fumes since I was using a homemade bong. Thoughts were constantly racing through my head.</p><p>I was laying my head between my knees with my arms crossed on my waist. I felt like we were going fast, but whenever I looked up we hadn't gone that far. By the time we got in front of my house my heart was pounding so hard and I was so scared I thought it was going to just bust out. My friend ask me if I needed to go to the hospital. I said no. We go to my driveway and I jumped out with my food. I ran in the front door. My mom was in her room. As I ran upstairs I told her I wasn't feeling good so we decided to come back to eat. I got to my room and layed on the floor, disoriented. Then I decided to get up and take off my clothes. I was only in my boxers, then I climbed in bed. I was trying to calm myself and get my heartbeat down. My friend came in a little while after that. I told him to sit down beside me in a chair and help me come down. I told him to go ahead and eat. Since my light was off my mom was suspicious and came upstairs. She came over and asked me what was wrong. I told her I just wasn't feeling well. I closed my eyes and all I saw was a dark black tunnel and I felt like I was spiraling down it.</p><p>Finally, My mom convinced me to go downstairs and figured I'd try to eat. I couldn't. My mouth was dry and I couldn't taste anything. I tried watching TV, thinking that concentrating on something would help. It did for a short time, then my heart started up again. I went into the bathroom and laid my head on the toilet. I felt so bad. Usually, im not all that scared of death. I think if I were in a situation where I was going to die, it wouldn't be that bad. But that wasn't the case here. I thought I was going to die. I prayed God to live, even though in reality I'm not as concerned. I curled up in the corner of the bathroom and prayed for my heart to calm down. I've never wanted to live so bad.</p><p>Eventually my mom came in and my friend left after he ate. My mom kept asking if I had taken any drugs, I denied it all. I went to her room and laid on her bed on my stomach. My heart was still beating pretty fast. I couldn't lay still for long. I had to get up and walk around. She followed me, cautiously. I drank an ass load of water because I felt so dehydrated. She decided to go to bed so she was watching TV. I eventually joined in watching and as I concentrated on the TV, I became more and more calm. By 12 am I was better. I got up and ate my unfinished Big Mac(woofed it down as a matter of fact). Then laid back in bed. My mom pretty much checked my heartrate all night. While I was still having trouble(earlier while I was in her bed), she kept asking me what I had taken, but I avoided it as much as I could. She suggested that I had taken speed, and that's why my heart was racing. I wanted to disappoint her by saying I smoked weed, but I didn't want her to get mad.</p><p>I woke up the next day, feeling rather well. I got up and ate breakfast. I noticed I kept feeling my heart, like it was a habit. I kept thinking 'what if I have another one?!?'. At this point I still didn't know what had caused the reaction. Then I decided to read the negative effects for pot. Then I realized I had just smoked too much and my meds may have played a role in my episode that, together, caused a panic attack. I still plan on smoking weed, but I do plan on being more prepared about it and not smoking more than I need to.</p>"
}
