{
 "title": "Bi-Polar Trip",
 "author": "Burnout",
 "citation": "   Burnout. \"Bi-Polar Trip: experience with 2C-I (ID 37515)\". Erowid.org. Mar 11, 2008. erowid.org/exp/37515",
 "substance": "2C-I",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-I",
   "(capsule)",
   "  T+ 0:00",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 3:15",
   "0.5 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37515",
   "Male",
   " ",
   "Not Given",
   "Mar 11, 2008",
   "Views: 3037",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I picked up my 5 gel-caps filled with 2-ci on a friday night.  They were supposedly filled with 20 mg of 2-ci each.  This is an account of a very rare and eventful night where I had a little too much fun, and it bit me in the ass.</p><p>10:15 pm - T+0:00</p><p>I took my pill along with two of my friends.  One of them, named S, took 20 mg as well, the other, his name will be M, took 10 mg.  Although S reported a very intense body high and slight visuals between T+0:50 and T+1:30 then slowly fading until T+3:00 or so, and M had some closed eye visuals during about the same time period, I will not talk about them because they did not have effects as intense as mine.  We also smoked a couple joints around this time.  About .25 grams in each.</p><p>11:30 pm - T+1:15</p><p>I start noticing a devloping body high and some visuals forming in my peripheral vision and when I stare at patterns.  I spend a few minutes laying on a couch and watching the pattern in a wood door.  I try playing some videogames but my coordination is slowly failing and the game becomes more difficult.  Then, while waiting for my friends to get ready for a night out, I lay on the couch, the effects slowly building.</p><p>12:00 pm - T+1:45</p><p>I am having very real open eye visuals.  Patterns moving, shadows breathing, blurred vision.  I wasn't expecting this ammount of visuals from it.  I can only compare it at this point to Psilocybin.  I decide to stand up and put on my Chemical Brothers CD.  I also inform my friends that I'll be staying in for a little longer while they go out and that I'd meet back up with them later.  </p><p>Now, the first few tracks of the CD were pretty terrifying and I was in a bad place, mentally.  While my eyes were closed I would see horribly dark images of patterns and dripping blood and stuff like that.  At one point I felt like I was standing in the middle of the highway with cars coming at me from behind.  I decide to sit up again and change the song to something happier and more relaxing.  I then felt waves of warmth, tingles, chills, and feelings I had never felt before rushing over my body in waves every minute or so.  I was very relaxed for most of the time, enjoying this part of the visuals.</p><p>1:00 am - T+2:45</p><p>I start feeling much better, and attempt going to the bathroom to pee.  My coordination isn't so bad anymore and I'm not having as many hallucinations.  I go outside for a cigarette and begin having waves of hallucinations.  I'd be fine at one point and then the next minute I'd feel like I needed to sit down because of the visuals.  I went back inside and I decided to go with a friend to meet up with my other friends that left earlier, S and M.  We started walking and time seemed to pass very slowly.  We passed by a gate with bright lights near it and the shadows danced wildly.  We walked down a dark alley in order to get to the apartment and I suddenly felt scared that my friend was going to murder.  This feeling quickly subsided, but it was very weird, and worth mentioning.</p><p>1:30 am - T+3:15</p><p>For some reason, beyond me, I decide to do a half line of cocaine.  I'm still slightly tripping and shadows are still moving, all though I'm more coherent and I'm not hallucinating as much.  Within minutes of taking the small line, I started hallucinating more again.  Patterns moved again, shadows danced more, people seemed more awkward, and I felt more vulnerable.  We went outside for a cigarette and I put an altoid in my mouth to fight the nasal drip.  I'm about half way through my cigarette when I finally gag, cough, and puke.  I felt much better after puking, but it came on very suddenly.</p><p>2:30 am - T+4:15</p><p>I puke again on the way home.  Once again it was very short and surprising, luckily I was outside again while this happened.  We get back to my friend's place and I sit on his couch and turn on the heat.  I notice that if I concentrate on something for 3 seconds or longer, I start seeing things again.  So I start looking at everything I can to see it's, sort of, other side.  The part of something we don't see in our every day lives.  This is my favorite part of the trip because I was very relaxed  and only hallucinated when I wanted to.</p><p>3:15 am - T+5:00</p><p>I the effects have mostly worn off, still a little body high.  Sleep is somewhat difficult, but I eventually fall asleep and sleep soundly, for the most part.  I liked this, FOR THE MOST PART.  At first it was surprising and scary, but then it was magical and amazing, although somewhat nausieting.  If I were to do it again, and I might, I'd so 15 mg instead.  Until I've become used to the effects.</p>"
}
