{
 "title": "Don't Do It Before Bed",
 "author": "elduderino",
 "citation": "   elduderino. \"Don't Do It Before Bed: experience with Mushrooms & Cannabis (ID 37535)\". Erowid.org. Mar 6, 2007. erowid.org/exp/37535",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Hard",
   " ",
   " ",
   "4.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "37535",
   "Male",
   " ",
   "Not Given",
   "Mar 6, 2007",
   "Views: 4529",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I like mushrooms as an occasional recreational activity and passtime, gnerally with friends.  I had eaten mushrooms on this particular day with some friends at a concert after the concert we went to a football game.  As the even came on I found the mushrooms had already worn off to my dismay and as I went home that evening I decided maybe it would be fun to eat them alone then watch a movie or something to chill out.  Earlier in the day I had smoked alot of weed and had drinken (this was part of the reason my trip ended earlier that day I believe) This was my 6th time eating mushrooms and I had eatin a half an eighth ounce of mushrooms 7 hours earlier.  </p><p>I hate the taste of mushrooms and as a good stoner I made myself a hotpocket and put several full- unbroken dried mushrooms (roughly 4-5 grams) on my hotpocket.  After listening to music for a half an hour the effects rapidly kicked in and far stronger than I had anticipated and far stronger than anything I had experienced or had been prepared to experience at that time.  I quickly found my self anamored by clouds out my skylight window.  They began swirling in a way I immediately recognized to be unnatural and attributed it to the shrooms.  From this point on everything went downhill.  I quickly noticed that the skylight suddenly seemed to be getting closer than farther away.  I immediately developed an inexplicable panic and fear.  I first decided that if I just went to sleep the panic would end however it only magnified and manifested itself in my overtiredness from not getting enough sleep and having gone through the many activities of that particular day.  Everytime I went to lay my head down on my pillow I heard the song White tee by crime mob (a song I had heard all day at the football game and at the dance I was at that evening) this was frightening and distracting because I really didnt like that song after I heard it the 2nd time. </p><p>Quickly a few hours had passed by and the room I was in seemed to expand and shrink as I tried desparately to sleep and ignore the hallucinations.  after roughly 4 hours the trip had not ended and I developed an unusual fear that it would never end and I would permanently trip.  I feared my life would fall into disarray in the panic and confusion I felt.  In my panic I remembered one thing I had learned on a previous experience with shrooms and that was that alcohol generally ended hallucinations. So I got my flask still full of apple vodka from the previous day and drank a good 3rd of it (maybe a few shots) after that my panic quickly subsided. like the ending of an unusual horror story I was finally able to rest.  I fell asleep listening to sweet emotion by aerosmith and the horrible trip had ended.  This experience taught me to respect psilocybin and made me consider not trying acid until I had a very controlled environment.</p>"
}
