{
 "title": "Really, Really Horrible (Overdose)",
 "author": "TeKtonik",
 "citation": "   TeKtonik. \"Really, Really Horrible (Overdose): experience with Syrian Rue (ID 37645)\". Erowid.org. Oct 22, 2004. erowid.org/exp/37645",
 "substance": "Syrian Rue",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "6 tsp",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37645",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 22, 2004",
   "Views: 13505",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have a couple of ounces of syrian rue that I use in ayahuasca analogues. I was feeling kind of down on myself, for various reasons, and I absolutely could not find any type of substance to drown my feelings other than pot, which was never that overly euphoric for me anyway.</p><p>I knew from my MAO inhibiting ayahuasca excursions that the seeds of Peganum harmala are mildly psychedelic at doses in the 2tsp magnitude, so I decided that since I was using the rue by itself, I'd take a triple dose. I hoped that the antidepressant qualities of harmaline would lift my spirits as well.</p><p>I ground 6 teaspoons of seeds in my coffee grinder, which actually ended up being more around 7 teaspoons of ground material. I wrapped each teaspoon individually in toilet paper and swallowed them in turn.</p><p>About 30 minutes after ingestion I was feeling warm and slightly stoned, but nothing any more intense than the times I had taken 2tsp. </p><p>15 minutes later, however, I shot up at an uncomfortable rate. I instantly noticed the psychedelia, as sounds all seemed phased and mechanical. My head was being treated to an expansive, sickly, marijuana high that was increasing at a very fast rate. I was becoming very uncomfortable, so I walked over to a friend's place to lie down. I was relatively steady on the way over, but the unpleasant trip intensified. My vision was put through urine-colored filter, giving everything an odd yellow hue. The sound distortions increased, and my footsteps sounded something like a rubberband being snapped.</p><p>I arrived at my friend's, explained my situation, and plopped down on the couch.  I closed my eyes and noticed somewhat familiar ayahuasca patterns behind my eyelids. My body was buzzing, sort of like the classic tryptamine vibration, but more 'solid' and uncomfortable. The buzz moved from the internal to the external, and I began shaking all over. The tremors were absolutely persistent, and were very strong and annoying.</p><p>I began to feel very, very sick. If I moved any thing on my body, especially my head, waves of nausea racked my body.  Inevitably, I vomited with force unmatched by any of the numerous times I'd puked from ayahuasca. This was the worst part of the entire experience. When I threw up, the ground rue stuck to every inch of my mouth and throat, making me puke more from the taste, smell, and texture. I puked 5 more times that day, each worse than the last. After each session of throw up, more moisture was eliminated from my body. By the final 2 or 3 times, I felt like I was hacking up slightly damp coffee grounds, except worse (and yes, I puked out rue every single time, I never ran out).</p><p>Aside from the disgusting unpleasantries, this was one of my most visually intense trips I've had in a long time. Once I finally plateaued the CEV's became full out hallucinations. I saw many odd faces and pictures with my eyes closed, not all of which I remember, but one that sticks in my mind was a close-up of a capillary pumping blood, and the cells moving through it. I had intensely immersive daydreams, more of what I'd call deleriations. I'd close my eyes and imagine doing something, not weird or crazy things mind you, things like just being up walking around, going to the bathroom etc., then opening them and realizing I was lying on the couch, sick. I'd experienced this type of thing only one other time before, when I was younger, with a high dose of DXM. I didn't really enjoy these little episodes either, because the sedating qualities of the rue made me tired, and I wanted to sleep to escape the nausea, but everytime I tried to sleep I ended up snapping out of one of these little 'dreams'. Eventually I was seeing trails quite thickly, and these also further increased my sickness.</p><p>The television was on the entire time I was lying there, which was for a long time, probably at least 5 hours. I listened to it on and off, to occupy my misery. Much much later, I heard the same things again that I'd heard earlier. I'm not sure if the same shows were being replayed or what, but there were numerous lines that I was able to recite in my head, just before they were played on the tv. I only had experience deja vu of this intensity on an absolutely insane amanita pantherina trip.</p><p>The parallels of this experience to the dxm trip and the one with the amanitas, both of which were my only memorably uncomfortable drug experiences, makes me think that perhaps the rue wasn't producing these effects directly. My theory is that the psychedlic properties of the rue, coupled with the misery I was experiencing reawakened the feelings from my other less-than-fun trips.</p><p>So, if you're looking for a fun, mood-lifting trip, I would say DON'T TAKE SYRIAN RUE. It has its rightful place as a potentiator, but by itself gave me my worst experience I've ever had with drugs, including alcohol, hands down. It took me 2 days to get over the hangover and I hope I haven't done any serious damage.</p><p>Do I regret it? No, I like to look at is as a learning experience. I just hope someone out there that is contemplating taking syrian rue for its psychedelic properties reads this and at least thinks twice.</p><p>Have fun, </p><p>stay safe</p>"
}
