{
 "title": "Kratopium",
 "author": "Mason",
 "citation": "   Mason. \"Kratopium: experience with Kratom & Hydrocodone (ID 37666)\". Erowid.org. Oct 24, 2004. erowid.org/exp/37666",
 "substance": "Kratom & Hydrocodone",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.8 g",
   "oral",
   "Kratom",
   "(tar / resin)",
   " ",
   "15 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "37666",
   "Male",
   " ",
   "Not Given",
   "Oct 24, 2004",
   "28318",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been curious about Kratom for some time now and, having recently moved into my own house, decided that it was time to give it a try. I ordered some resin extract from a reputable website and it arrived in two days. I was suprised to find that the extract resembled that of 'red lava' opium except for the fact that, when stretched out under a light, I could see some pieces of leaves and plant matter in the resin itself. This led me to believe what I had gotten was the real deal and not some type of incense of something like that. I proceeded to roll about a gram of the blood colored resin into a ball and swallow it with some water. </p><p>About 20 to 30 minutes later I was high to about the level of what I would consider a moderate to high dose of codeine. I must mention that fact that I have used almost every type of opiate available, barring heroin, so I am able to compare Kratom to other opiates pretty accurately. I should also mention that every gram of the kratom resin is, as stated by the website, equal to 7 grams of dried kratom leaves. Satisfied with the results of my first time eating kratom by itself, I decided that if it really is a mu receptor agonist, it should work great in combination with other opioids. </p><p>So, the following night, I ate about 1.8 grams of the kratom resin followed by 15 mg of hydrocodone. (Note the fact that, due to tolerance, it takes at least 25 mg of hydro to even get me off baseline.) Thinking that I wasn't going to get more than a moderate body buzz, I was pleasantly surprised when, about 25 minutes later, I was becoming increasingly 'narced out'. I would compare the feeling at the peak of my high to be just a little bit less than when I had a 10 mg shot of morphine combined with a 40 mg oxycontin at the hospital some time ago. I also must note that I did vomit 3 times throughout the night. Although I could have done without the vomiting, the over-all high was unexpectedly strong and a lot of fun. In combination with the other opioid kratom easily knocked tolerance down a few notches while adding a subtle but different aspect to the high. I also must stress that it could be dangerous if you underestimate the strength of your combination and to start off slow if you plan to take my advice.</p>"
}
