{
 "title": "My Sister and the Showers",
 "author": "Floss",
 "citation": "   Floss. \"My Sister and the Showers: experience with 2C-E (ID 37670)\". Erowid.org. Jun 21, 2007. erowid.org/exp/37670",
 "substance": "2C-E",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "sublingual",
   "2C-E",
   "(powder / crystals)",
   " ",
   "  repeated",
   "insufflated",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 37670",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2007",
   "Views: 3116",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article]<br>I found 2C-E to make me feel very disturbed when I first tried it I had a friend who bought 350mg of it. I told him I didn't want to sniff it because I have never done anything like that before I have never done anything except for smoke cannabis. He tells me that I can just stick some under my tounge and get an effect so I start off with 20mg. The taste was pretty bland not something I favor absorbed nicely. I waited 25 minutes and nothing happened I think I need a higher dose to get an effect so I put about 10mg more under my tongue. <br>After 45 minutes of waiting to feel different. I decide that this stuff is just full of shit and my friend tells me to try sniffing some so I decided to. I sniffed half of a line and my sister sniffed the other half. Our faces and the sides of our body of which we sniffed it with went numb and burned. I had a dry, burning, itching sensation in my throat and my eyes where watering. <br>Still 10 minutes after that....nothing. I just think of it as a joke and he tricked me into doing some BS that isn't anything. I then repeatedly stick my wet licked finger into the baggy and stick it under my tongue my sister said: quote Your going to die if you keep eating it like powdered sugar but of course she was laughing along with me b/c she didn't get side-effects either. She started doing it along with me and my friend said I was crazy. <br>A whole 2 hours later, it just hits me like a brick wall I was suddenly laughing and listening to music with my friend and sister and suddenly I just get straight knocked out into my own world only I was staring at the ceiling fan. I could not move or blink and I could feel tears rolling down my cheeks from being dried out and the wind blowing directly in them. My sister became scarred and 6 minutes later I came out of the trance but of course by that time it had hit her to but not like it did me. We where both tripping saying this is awesome in shit b/c it was our first experience with anything besides cannabis. Hours go by and we are talking about the experiences it is giving us. Everything had its own design so to say whether you understand or not. <br>Anything and everything gave off like some wave of energy that carried a design so when they ran into each other it was all mixed up. My posters in my room came alive and I knew I was tripping hard, I still did not know how to react b/c this was our first time doing this. Everything then started looking distorted and I could not tell reality from fantasy. My sister looked like some human fish and she said that I looked like a really old person with long arms and legs. We had both felt nauseated for a while but got over it. We looked at the time and it had been 6 hours of straight tripping. <br>We then begin to think we are going crazy because we can't even talk right our image of reality is so distorted everything looks fake. Me and my sister lay on my bed and begin to feel like we are floating and we talked about when it would end because we could not take any more. We waited 2 more hours 8 total now and still tripping our asses off only a paranoid worried kind of way. I end up certain places in my house instantly and don't know how I get there and my sister says I just suddenly disappear. <br>We both take showers trying to rid this never ending trip but that had failed. We had considered puking but since we had sniffed most of it, it had seemed pointless. We force fed ourselves breakfast (we really did not feel like eating) and still it failed though after 16 hours and 20 minutes of tripping it finally ended I swore never to do anything again besides cannabis.\n\n\n"
}
