{
 "title": "What I Learned",
 "author": "SmokaH",
 "citation": "   SmokaH. \"What I Learned: experience with DOB (ID 37704)\". Erowid.org. Oct 25, 2004. erowid.org/exp/37704",
 "substance": "DOB",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 mg",
   "smoked",
   "DOB",
   "(powder / crystals)",
   "  T+ 2:00",
   "3.5 mg",
   "smoked",
   "DOB",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 37704",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 25, 2004",
   "Views: 21198",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI first heard of DOB when I moved back to my homecountry of Russia when a friend of mine offered it to me.  The only phenethylamines that I had experience with prior to these experiences were 2C-I and 2C-B. I've done a plethora of other psychoactive chemicals, however, and I consider myself somewhat experienced.<br>I cannot explain why but I really liked DOB for some reason. It is kind of hard to describe the trip itself, but it is about 3-4 hours of good visuals and 18-20 hours of side effects. To me it is a less powerful and more 'evil' version of 2C-B which I like a lot better. The only thing available for our psychonautic weekends was DOB so we did it a lot and soon got accustomed to its effects. Here are some of the things I learned about DOB over the course of 20+ high dose experiences: <br>The duration of the whole experience seems to be close to 24 hours throughout the dosage range - if you take less you will not have any visuals but just a weird amphetamine-like stimulant effect. In Russia, a 'standard dose' of DOB is around 2.5 mg; when administered orally, this dose seems optimal for a full psychedelic experience. This, of course varies from one method of administration to another. I haven't seen it mentioned anywhere, but DOB can easily be smoked resulting in immediate onset of the experience. It is not a good idea to smoke more than 3.5mg and you'll read why below ;) Some of my friends also used DOB through i/v administration with doses usually around 1.5-2.0 mg. This is said to result in a somewhat more intense come-up, though not as effective as smoking. <br>DOB does not combine too well with other stimulants, though low-dose experiments could be fun at a club or party or something; it combines very well with weed (like just about all the drugs out there) while alcohol seems to intensify the experience slightly. Because of the long duration, you'll likely get annoyed by the side effects so taking some benzodiazepines could be a good way to pass the time. Benzos such as Clonazepam and Nitrazepam also seem to have a synergicstic effect with DOB, increasing the psychedelic aspects of the experience (which is weird); they also relax you a great deal and take the edge of in general, but it is unlikely that you'll be able to fully 'come down' while DOB is in your system no matter how many you take. I also attempted a combination with BZP which seemed to make the first few hours of DOB more 'serotogenic' with pleasant body effects very remotely resembling MDA, but it is not a good idea to redose and DOB eventually 'takes over' so that BZP's effects become virtually unnoticeable. We also attempted a low-dose combination of DOB and another similar phenetylamine (possibly DOM or DOI) which seemed to increase the side effects too much and kind of 'smothers' the two chemicals together, making for a somewhat unpleasant experience. <br>Speaking of experience, here is a brief report of my most intense DOB trip ever which could have ended very badly...<br>Setting: Friend's apartment (it was decorated under the influence of DOB, so needless to say it is the 'perfect' setting)<br>Mindset: Not much different from regular, as I got used to the drug's effects by then.<br>Preparations: Obtained some gigantic 2mg Clonazepam pills which we always keep handy for emergencies. <br>Dosage: 3.5mg (smoked)<br>T+2:00 3.5mg (smoked)<br>As it always happened, I was not planning on doing DOB that day, but since we had so much layin' around, I decided to smoke 3.5mg  from a foil. I usually do not 'prepare' myself for psychedelic experiences beforehand, as I'm not much of a 'psychonaut' really.<br>This was my first time smoking it and I was pleasantly surprised that as soon as I exhaled, it hit me full force. <br>The chemical itself did not taste that bad and for about 2hrs I was enjoying a typical DOB trip which included me sittin' on the floor and laughing like an idiot and discussing various 'thought loops' with your co-trippers. For some reason I did not feel completely 'fucked' by that time even though the visuals were really strong. So I thought we should smoke more!! BIG MISTAKE! <br>The next dose was around the same as the first one and within 20 minutes of exhaling the chemical smoke it started getting a little bit TOO INTENSE. A neighbor walked into the room just as this was happening; he smelled like alcohol and was obviously drunk and as soon as I realized that everything started spinning just like it does when u're intoxicated with alcohol, but by visual field was so distorted that each spin presented a whirlwind of insane visuals. That is about the last I remember for a while. My friends watched me have a bout of epilepsy and gave me some clonazepam which is used for this purpose in medicine. After I came to my senses the epilepsy was gone but I was still tripping EXTREMELY HARD. The visuals were about the same level of intensity as 40mg of 2C-B but much more 'evil' as I said before. A sign drawn on the wall turned sideways and then morphed into mall 'propellers' which filled up the room. Everything was pixelized and the only thought that I had was: 'I read somewhere that people go to a psych ward after ODing on DOB...I believe that!!! This seemed to be another dimension as NOTHING reminded me of the regular world. Everything had DOB written all over it. Shortly afterwards the effects started to subside and soon I was on the long 'plateau' stage contemplating the experience. I guess even though smoking does hit you right away it still does not gain 'full force' for a few hours so redosing was definitely a mistake. <br>After this experience my brain seems to have been 'modified' kind of in a weird way; we all noticed that over time, DOB made us more emotionally open to others and gave us a weird ability to 'read' people's minds - I sometimes feel like I know what someone's thinking and the weird thing is if I say it out loud I often hear 'Hey, I was about to say that'. Go figure. <br>I've done DOB at lower doses since that time with no adverse effects.<br>I guess the bottom line about this substance is that it's a test more than anything. Having to stay up on this drug for long periods of time made me somewhat tougher I think.. That's DOB for ya!\n\n\n"
}
