{
 "title": "From Good to Terrible",
 "author": "HBWR lsa",
 "citation": "   HBWR lsa. \"From Good to Terrible: experience with H.B. Woodrose Seeds (ID 3771)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3771",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3771",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 13897",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had just ordered 10 grams of Hawaiian baby wood rose seeds off the net.  I couldn't wait to get them and try them. I had done other drugs MJ,pain killers, etc.</p><p>5:35 pm - I ate the seeds on a pretty empty stomach (didnt eat much all day.) and got on the computer to screw around while I waited.</p><p>6:30 pm - I noticed a little bit of a high coming on and a heavy feeling in my stomach.</p><p>7:00 pm - I was extremely high, like I had just smoked many joints of marijuana.  I was very happy that it worked and things were going great, sounds were awesome, lights, just all out good.</p><p>7:30 - 8:00 pm - I was totaly fucked up, I could hardly walk or talk and my toughts were racing.  I was getting alot of closed eye halucinations and alot of distortion in things.  But it was good and I was very very happy giggly mood.</p><p>Then about 15 minutes later something happened.  I wanted to watch this stupid drama show on tv.  I didn't even think about how it could make me trip bad, that just did not enter my mind.</p><p>Well I started watching it and sure enough I started feeling sick so I went to my room and threw up like crazy.  I cant even explain what was happening my mind was racing I was seeing colors lights hearing old songs my muscles were extremely weak.  I did everything I knew to come out of a bad trip but it was not working, nothing was.  So I just layed there praying that it would end I would feel normal again. ALL IN ALL it was the worste freaking time I've ever had on any drug and it goes to show how quickly things can turn bad.  This stuff sucked.  I'm going to stick to Marijuana or beer.</p>"
}
