{
 "title": "Tripping in the City",
 "author": "Jerry",
 "citation": " Jerry. \"Tripping in the City: experience with LSD (ID 3774)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3774",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   "5 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "",
   " T+ 2:00",
   "5 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3774",
   "Male",
   "",
   "Not Given",
   "Dec 26, 2001",
   "4970",
   " "
  ]
 ],
 "report": "<p>\nI had never tried LSD, but when a friend failed to come through with some shrooms, she offered tabs of blotter acid to me and some college buddies. Most of them had tried it, but I never had. I was a little nervous at the thought of tripping on acid, but I after consulting with my brother, who has tried it twice, and looking it up on Erowid.org I gave it a go.</p><p>I dropped around 10:30pm in a small apartment in the Beacon Hill </p><p>section of Boston. My friends wanted to go back to the dorms, but I had promised a friend I would stop by her party, so I walked over with a roommate who was not tripping that night. I figured I would leave before the peak.</p><p>I drank a few beers, and was relaxing at the party talking to friends. I started feeling the minor threshold effects around 11:30 or so. A friend of mine came over and asked me to walk to his apartment on a nearby street to retrieve his three foot glass bong, so I went. It had begun to lightly rain and I remember being awed by the neon lights reflecting in the pools of rainwater.  We got the bong and went back to the party to rip hits. I smoked 5 bongloads out of the three footer, and then sat down and passed the next one as it came around. I was feeling very disoriented and confused, but didn't realize that I had begun to trip hard. I glanced at the clock, which said 12:30. I looked around the table and saw everyone's heads looking huge while their bodies were disproportionately small. I looked all around the apartment and was amazed at how different everything looked. The floor was beginning to move, and I was starting to panic, so I begged my roommate to walk me back to the dorms. I was sick of being the only tripper, and I felt very isolated and alone. </p><p>I got outside and was completely overcome by the LSD. My mind felt like it was leaving my body, and I became worried I would be unable to find my way back. I grabbed my roommate's arm and did not let go, because I was worried if I did I would drift off. It took an immense deal of concentration to focus and see the sidewalk and city streets, when my mind wandered I would see alien landscapes. If I focused on Boston, then my mind wandered again I never returned to the previous hallucination, it was always new. I felt that the world was extremely fluid and I could reshape and distort the picture of it in my mind. At this point I began to enjoy the experience and tried to relate this to my roommate, who later said I was incomprehensible. I began to believe I was a snake or at least had assumed the form of a snake. Finally, I made it back to the dorm. The rain was pouring now and it was completely overwhelming my senses. I tried my hardest not to make a scene in front of the security guards. </p><p>I went up to my room and played some videogames with my roommate, but found it difficult to concentrate on it because of the visual distortions and my mind trailing off. Finally he drifted off to sleep around 3am, so I went downstairs to find the other trippers. I found that I was too paranoid to go in the elevator alone, so I ran down six flights of stairs. Finally I found them and stayed in their room for the remainder of the night. Other significant hallucinations included 'breathing' walls, melting faces, I felt that one of my arms had disappeared for a period. I saw neon streaks of rapidly changing colors on the walls that faded in and out. I experienced one point of total ego loss when I became confused as to who I was and what had happened to me. This and the previously mentioned paranoia were the only scary parts of the trip.</p><p>After a time they suggested we watch Alice in Wonderland, which was very trippy. After it was over I went outside to watch the dawn in the Boston Common with one other tripper. We were beginning to come down from the more intense portion of the trip, but we still weren't sober. After a time I went inside and tried to sleep, but couldn't. Eventually I fell asleep around 1pm and slept for three hours. When I woke up I felt sober, but less intelligent than usual. That night I experienced a very brief flashback of the part when I thought I was a snake. I believe it happened because I was smoking pot. The next day I awoke feeling refreshed with no ill effects.</p><p>All in all it was a positive experience. Next time I'll skip the drinking and wait until I'm coming down to smoke pot. Also, I won't take acid as a substitute for shrooms because it is a totally different ballgame. I went into the experience nervous but confident, and came out with a very intense memory of some eye opening psychedelics. I remember feeling like I had learned a lot, but was unable to recall what. Next time I want to try and see what insights I can retain by writing or recording them.</p>"
}
