{
 "title": "Can Be Dangerously Different",
 "author": "Gumby",
 "citation": "   Gumby. \"Can Be Dangerously Different: experience with AMT & Salvia divinorum (ID 37763)\". Erowid.org. Oct 28, 2004. erowid.org/exp/37763",
 "substance": "AMT & Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   "  T+ 2:00",
   "400 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 37763",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 28, 2004",
   "Views: 13326",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me start by saying that I have been a 'hard-head' with the vast majority of substances I have tried.  This dose level could be much more dangerous to someone with typical response to salvinorin.</p><p>Here are what my experiences were like prior to my last one (read very mild)</p><p>http://www.erowid.org/experiences/exp.php?ID=497</p><p>My last experience with sally: </p><p>Situation.  I had taken 50 mg of AMT a couple hours prior, and was not impressed with the effects.  Overall, I would say that the effect of AMT was irrelevant to the experience I am about to describe.  I had found Salvia to be fairly mild and short acting, and was going to try a much higher dose to find out it it was worth pursuing any more.  It was about noon, and I loaded a tradtional tobacco pipe with all the remaining 5x salvia I had - about 400 mg.  I went outside on my porch and sat down.  I looked around the residential neighborhood, and figured I would be inconspicuous in the middle of the day smoking a tobacco pipe.  I was pretty efficient at smoking the pipe - taking long deep hits, and holding them in for almost a minute each.  I would say that I smoked most of the material that I had put in the pipe.  </p><p>The experience began with my legs turning into a combination of vines and leaves.  This was not your typical hallucination.  I didn't have a sensation of vines and leaves growing on me.  I didn't feel them.  I didn't look down and see them.  I knew that it was happening.  It started at my feet, and worked it's way up my entire body.  I was turning into a human shaped plant creature.  This is the only time in my life (and that with a lot of drug experience) that I was something else.  Sure, I have lost control of my actions, or been completly overwhelmed and unable to move.  This was different.  I wasn't me, but just fucked up.  I wasn't totally lost in hyperspace.  I was gone, but another being was sitting on the porch.  </p><p>The leaves of the tree in front of me took on an extra waxy, extra-3-D look, as if they were much thicker and full of life.  About this time, a mother and daughter came into view walking on the sidewalk - maybe a block away.  The girl was maybe 5, and talking to her mom.  Remember, there is a plant creature sitting on the porch.  I don't understand what the girl is saying.  I don't speak English.  I just have animal instincts.  Fortunately for all involved, my animal instincts tell me to run away from people and hide.  Due to a genetic throwback or something, I am able to operate the door, run into the house, know which room belongs to me (ie is safe), shut the door and jump on the bed.  As I lay on the bed, I look up at the plain white walls and see ribbons of color hanging from the edges between the ceiling and wall.  It's moving clockwise around the room. </p><p>I am now a couch.  Once again, I am not absorbed into the couch.  I am not a couch with eyes.  I am, and have always been a couch.  I think about what it's like being a couch - just sitting there all day.  That's all I do.  Sometimes people sit on me, but I don't feel it.  I don't have skin or nerve cells.  I'm just made of cloth and wood and metal and am a couch.  I never move.  I don't care.  I just am.</p><p>Finally, I come back.  I realize that I am laying on my futon, and that I was recently a couch, and before that, a plant primate of some sort that has never existed.  I feel glad that I didn't hurt anyone or get myself in trouble, and feel lucky that I made it through this without a sitter.  OEVs are fading fast.  CEVs are still there.  A bunch of weirdness, but nothing special to mention.</p><p>I realized that Salvia does contain a lot of power, and is to be respected.  I don't find it to be of much value at lower doses, and find it to be surprisingly, perhaps scarily 'different' at higher values.  I wouldn't describe it as overly intense, but to be completely subject to the wills of other beings than yourself is pretty risky.</p><p>This was about 4 years ago.  I keep salvia available, but have not gone back to it yet.  Two things keep me away.  One is fear that the being I become will do something bad.  The other is that, while I found the experience remarkable, I really wish the experience could be longer than the 10 minutes or so that it lasted, so I turn to other things that last longer.</p><p>If Salvia could be made to last an hour, I think it would be an amazing thing to explore.  As it stands, I keep it in my toolbox, and mostly just warn others not to take it lightly.</p>"
}
