{
 "title": "Intense Trip... or No Trip at All?",
 "author": "Fly",
 "citation": "   Fly. \"Intense Trip... or No Trip at All?: experience with MUshrooms - P. cubensis (ID 37788)\". Erowid.org. Aug 13, 2005. erowid.org/exp/37788",
 "substance": "MUshrooms - P. cubensis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "2004",
   "37788",
   "Male",
   " ",
   "Not Given",
   "Aug 13, 2005",
   "3551",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night I tripped on *many* (~20) dried cubes. It was really an experience... or was it? The whole trip was marked by a common thought: 'this is no different from usual.' I had the distinct notion that tripping was in reality no different from normal thought; instead, I was just more focused on normal things. I was as in awe of the LACK of color enhancement as I've been at the INTENSITY of color enhancement from my first trip.</p><p>With eyes closed, it seemed vaguely hilarious that these could be called 'closed eye visuals.' After all, if I really tried to LOOK at them, they weren't there at all! Instead, they were just the familiar shapes and colors that I'd been failing to notice most of the time while 'sober.' Music DIDN'T sound better, colors DIDN'T look sharper, visuals WEREN'T more vivid... and THAT was the epiphany. Things always just WERE! There was no 'trip.' Things just were.</p><p>Before the trip, I had planned out a list of things to do while tripping. A list of songs that evoked nostalgia, a list of memories to recall with enhanced clarity, a bunch of pictures that I'd always found stunning. During the trip, none of that mattered. There was no 'better' or 'worse.' I didn't like these songs and not those. I didn't want this feeling and not that. Everything was equally valid. It was all just experience.</p><p>It really made me laugh to think about trip reports. How can anyone report on the experience of Teonanacatl? How could people use words to describe things like 'closed eye visuals,' or 'walls breathing,' or 'enhanced colors?' There was nothing at all... and it was so intense! The kaleidoscopic purple patterns swirling on my tan towel... that wasn't a hallucination. That was ME, for the first time noticing how it all looked and fit together. As if to confirm this, a closer inspection showed that the towel really just was a towel.</p><p>And why was I so paranoid talking to people while 'tripping?' After all, there IS no tripping. My mother called, my father called, my sister called. None of them suspected anything. And what would they suspect? That I was me? The only thing to fear was fear itself. When I stopped and asked myself how my fingers could type so fast, they would refuse to move. When I didn't think about them, I was in awe of how they did their thing without my awareness of it. How could they move SO FAST without my direct supervision?! And why did they stop when I asked them how they did it? Without interference, my typing was as good as normal, and so was my speech. How could I ever think otherwise?</p><p>And from whence it came, it sank back. It was never anything at all.</p><p>Thanks for reading up til here. I hope others can relate.</p>"
}
