{
 "title": "My Other Family",
 "author": "C-rad",
 "citation": "   C-rad. \"My Other Family: experience with Salvia divinorum (6x extract) (ID 37809)\". Erowid.org. Oct 29, 2004. erowid.org/exp/37809",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37809",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 29, 2004",
   "Views: 6461",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have experienced Salvia quite a few times, but it had been about 8 months since I had used it. I am a fairly experienced user, with substances including DXM, pot, alcohol, LSA, and Salvia. Salvia never gets old for me because it keeps unraveling a greater story of my existance.</p><p>I bought some Salvia online and it had arrived on Thursday night, so Friday morning I decided to try it out and see what it had to tell me. One of my friends had recommended me to video tape my experience so I could go back and possibly piece together what happened afterwords.</p><p>Thursday night I had read quite a few different trip stories from salvia with one saying I should well prepare my room and settings, so I did. I cleaned the room and put offerings of candles and fruit for the Gods.</p><p>I turned on my video camera, packed the bowl and ripped it down my homemade waterbottle bong using the recommended torch lighter. I took to hits and WAM, I went down laying on the floor.</p><p>This trip was a continuation of the trips that Salvia has given me so far. All of a sudden my 'salvia' brothers, sisters, and mother appeared. My father wasn't home yet, but he would be mad if I was smoking salvia so I got up and put away all my stuff. I put away my things.</p><p>I like to call this place 'Salvia land' because its always pretty much the same. In my trip I could see my future trips that I will take on salvia and how each one would be slightly different. </p><p>As I watched the video tape I remembered that before I hit the salvia I had no recollection whatsoever of my salvia brothers and sisters.</p><p>They were 'happy to see me' but dissappointed that I couldn't stay. On the tape I remember saying 'remember the mother and the kids and trying to get away' then its like another instance of myself said 'and you'll remember trying to be here, trying to get back' I did not remember saying this at all. Its almost as if different people were passing through my body saying different things, my mannerisms were completely changed. After this I came back to my 'normal self' and said 'WOW' then 'I'm back' really amazed and I shut off my camera.</p><p>After this  I decided to play my guitar, I felt as if I was at a very elementary stage of learning guitar and that I should pursue other areas of my life. I should get back to my more complex thoughts in coding and webdesign.</p><p>This trip revealed to me how lazy I've been and what I need to do to get my life back on the right track. I need to get up a lot more money for college, and need to work harder all together. Salvia is definately a teaching drug, and if you are at a crossroads or down point in your life, I would recommend you try it.</p>"
}
