{
 "title": "A Spiritual Journey",
 "author": "Chris",
 "citation": "   Chris. \"A Spiritual Journey: experience with Mushrooms (ID 3781)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3781",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2000",
   "3781",
   "Male",
   " ",
   "Not Given",
   "Dec 26, 2001",
   "4403",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA night of self-discovery and realization, this is my story. </p><p>I was in the military at the time stationed in Okinawa Japan. Shrooms are legal there as well as GHB, rush, valium, codeine and several other drugs banned in the USA. Me and a friend (P) had been talking about the various times we had tripped. I had not done it that often but he had. I told him I knew of someone who sold shrooms. They were expensive $100 for a bag good for 2-3 people, but we decided to do it that Friday night anyway. </p><p>I had read a lot on shrooms online and knew that many people approach the trip in a spiritual manner. I had been studying the worlds major as well as minor religions and native cultures looking for answers. So far I had found similarities between all cultures, religions, and trip experiences. I had also been reading on spiritweb.com about out of body experiences and channeling of other spirits so I was pretty open to the possibility of a multidimensional soul and the existence of spirits and higher powers.</p><p>I did not eat much that day and also was taking St. Johns Wort because I had read it had MAOI properties and would double the potency of the shrooms. I took a few earlier in the day and about 10 right before I ate the shrooms. I do not know how potent the MAOI properties of St. Johns Wort are but this did it for me. </p><p>We bought the shrooms and walked to the seawall to divide them up. It was a good mouthful of dried shrooms with about half of it caps. I held mine in my mouth for a few minuets before swallowing them. We then walked back to a table by the beach where there were lots of bushes and woodwork around. About thirty minutes later we could just begin to tell the effects were setting in. Patterns seemed to move slightly and colors were brighter. Everything seemed funny and I was expressing a lot of emotion when I would talk about anything or crack a joke. I remember thinking I wish I could do that more without any chemical. P wanted some cigarettes but we were starting to trip then so we did not want to walk into a store and try and buy any so we went looking for a machine. </p><p>The effects were very noticeable then. We decided to walk down a path further down the beach. I could still interact with people by then but we were definitely starting to act weird. There was this huge Ferris wheel with tons of neon lights that would go in all sorts of patterns that was starting to become very intense. Reality was very altered by that time and we were still coming up. Tracers were starting to appear and the lights from the Ferris wheel seemed to radiate energy that I could feel in my mind. I started having so many different feelings. I could not tell if I had to go to the bathroom or eat or if I was cold, kind of a little of everything. </p><p>I decided I needed to go to the bathroom so we walked down the beach till we found one. That was a weird experience. Then I decided I was hungry so we went on the quest for food. We ordered a snack plate and sat down to eat. Eating was one of the weirdest feelings I have ever experienced. My lips were super sensitive. It was hard to swallow because of the dry mouth. The coke was very good tasting and had an exotic feel to it to. We started to become self conscious because there were people everywhere and it was really bright and the shrooms were so strong we could not talk to normal people for more than a minute without them knowing something was up. </p><p>We decided to take a cab back to our rooms so we started walking down the street. I was still a little hungry so I stopped at a roadside cookie shop. By then simple things like ordering food or especially paying for it seemed very foreign and complex. I could not really remember exactly what I had to do and I felt like the woman was sensing something was up and I got very self-conscious. I barely managed to pay for the cookies and we kept walking down the street looking for a cab. P and he went to his room and I went to mine. He was going to change clothes and come down to mine and was going to watch a movie. </p><p>The place seemed much brighter. I went into my room and felt much better that I could lock the door and shut the window and not have to worry about anyone. My room appeared to have a thick mist in it but it went away after a minute or two. I turned on my computer and connected to the internet. At this point I could not make my mind up about anything. I wanted to find my friend on ICQ and tell him I was tripping but he was not there. Then I wanted to email him and started to write one but it was getting too weird and I thought he would think I was nuts so I did not send it. Then I wanted to tell anyone I was tripping and someone popped in on random. I got nervous about telling her because I did not want her to judge me and think I was a bad person. This whole time the screen was blazing in colors. The windows on the screen were distorting and all had color outlines. I would want to watch a movie then change my mind. I was trying to get everything perfect but I could not figure out what that was. I remembered I had some really good ambient trippy mp3s so I decided to put them on. </p><p>This is where the really weird stuff started to happen. I was alone with some really trippy music playing and was right in the middle of my trip. It had been like 3 hours since we had eaten the shrooms so I knew that I had about 3 more hours to go. I closed my eyes and the music seemed to take me on a journey in my mind. Here are some of the realizations I had. </p><p>I was a multidimensional being existing on multiple planes of counsciounsious at once. The shrooms freed my counsciouncious so I could see the different levels of myself. I had to remember which plane of existence I freed my counsciounsious at. The concept of me I or mine became very foreign. I realized one of the main reasons we are existing on the physical plane is to learn the lesson that no matter how many things you try to get or needs you try to fulfill there will always be more there waiting for you when you are done fulfilling those. If someone could learn not to seek constant gratification on the physical plane they will have advanced their soul very far towards the final goal witch I think is pure existence or being one. I was then shown what it would take to achieve that on this plane. That would have meant a total change of lifestyle and the little bit of me as the physical self defines it was not ready to go that far. I understood that that was ok. I would be allowed to move at my one pace and there would always be nurturing spirits that would help me along. There was no such thing as failure, you just would make less progress than you could have. </p><p>I can see how some people have went crazy on shrooms or acid because it totally gets rid of the concept of the self and could make this existence seem not important, or maybe they fully regained the concept of self and the real world would seem like a faded painting, never fully there. I also sensed a very powerful and loving thought that I believe come from another spirit on a much higher plane than mine. Its message was to exist, to be one, it said that the more I realized the concept the further the thought of the concept would fade till nothing but pure existence remained. At that time the thought started to fade along with the rest of the world as I drifted towards pure existence. I never got totally there. </p><p>I started having thoughts about the spirit of my mother, father and brother, not their physical selves and sensed great love for them. I realized that a mother is who I need her to be. I thought how these spirits devoted much of their energy towards nurturing me and I felt great love towards them for that. I also felt great shame at a society that would look down on someone for doing something like shrooms. </p><p>The intensity seemed to come in waves. By this time the physical sensations were very strong and I was feeling a little uneasy. I was ready to come back down. I could tell the physical effects were starting to be a little less intense but the mind-expanding effects were still in full effect. The screen was still moving and letters would change shape and it was hard to read words. I wanted to pull up a program out of My Documents and the since of me seemed so selfish I did not even want to have a My Documents folder on my computer. I also realized that synthetic drugs as well as alcohol if used to get drunk was a form of senseless self-indulgence. I then laid down on my bed and closed my eyes ready to take another journey into the mind. </p><p>The music seemed to surround me, carrying me on its rhythms. A song by Deep Forest came on called Hunting. The words are some kind of chant but the music was being played really slowly in my mind and I started to understand the words. They said, Hold me briefly and let me go. I sensed it was about souls who had ventured too far or had somehow been trapped by some being or force. Once they were caught up they could not get loose and they were crying to be set free. I sensed some evil spirits then. I knew they could not harm me if I did not want them to or let them so I was not too scared. There seemed to be faces coming out of my walls but could not break free. I felt sad for them and a little scared at the same time knowing there was evil out there. I dont know if I was supposed to help them or if I had been shown this for a reason.</p>"
}
