{
 "title": "Chasing the Dragon",
 "author": "SS",
 "citation": "   SS. \"Chasing the Dragon: experience with Heroin (ID 3784)\". Erowid.org. Feb 21, 2001. erowid.org/exp/3784",
 "substance": "Heroin",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3784",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2001",
   "Views: 94238",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\ni'm 19 years old, a college student in new delhi, india. my first experience with smack was in february this year. we always chased it, on aluminum foil. partially because we were too chickenshit to shoot in the first place, and partially because it's cut with so much shit it's suicide unless you know for sure.</p><p>there are enough kids here who have money to spend on drugs - mostly it's papa who pays. practically everyone smokes weed, and we're learning to rave, so there you have the psychedelic angle, so to speak. heroin, though, remains the rag-picker's trip, the poverty-stricken beggar's high. we were curious, bored and H isn't hard to find. just go to the filthiest slum and voila. unless you're a woman or the cops get you. then it's catch you laters, in the next life, brother.</p><p>anyway, this is just the background. i started doing H every day in july this year. given the horror stories one hears, the idea was, dude, i'm not dead yet, so it's all good. i don't need to tell you about the high and the peace, etc. if you're reading this, you know. what i do want to say is that smack was the one true thing in my life. truer than love, clearer than pain, as gentle as rain. it made me happier than I'd ever been. scoring wasn't a problem either for me, i had obliging friends and enough money. </p><p>but things happened, only partially related to my smack habit. i had to go home. no more smack, hello misery. cold turkey, man, my goose was cooked. end of story.  </p><p>it's been only three weeks since i said bye-bye to smack. my parents don't know about the drugs, or the lack of them. that's excellent, but i can't wait for the next hit. like neil young said in 'the needle and the damage done,' every junkie is like the setting sun.</p><p>as for me, i don't give a fuck.</p>"
}
