{
 "title": "Everything Felt Like Rubber",
 "author": "Pinky",
 "citation": "   Pinky. \"Everything Felt Like Rubber: experience with Mushrooms (ID 37851)\". Erowid.org. Feb 29, 2008. erowid.org/exp/37851",
 "substance": "Mushrooms",
 "bodyweight": "131 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mulberry",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37851",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 29, 2008",
   "Views: 2807",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There were two of us indulging and two of us watching . I was one of the indulgers, as was my friend A. B and C 'baby-sat' us, to make sure we didn't do anything stupid or dangerous. Upon first consuming the mushrooms, I noticed they tasted somewhat like peanut shells, as did A. When they were all eaten, we sat down in chairs to prepare for the onslaught of psychological, physical, visual, auditory, and spiritual stimulation we expected.</p><p>The first sign of the effects occurred within about five minutes. My left leg started twitching up and down, and then my right leg joined in. It was as if I stayed awake for several days while eating nothing but coffee beans or something. A lot of excitement in my lower body, mostly legs. Then we started to notice eyes in the wall, which were actually knotholes, but they all looked like eyes or faces. It was pretty cool, but not intense at all. Suddenly, I fell out of the chair, started laughing, groped my head and face, rolled around on the floor, grabbed things and tried to put them in my mouth, all at the same time. No visual hallucinations yet. As I was rolling on the floor, C gave A a tape recorder, so as to record his experience. I had an otherworldly feeling, and I couldn't stop laughing, but I could hear A talking into his tape recorder. 'So many dots,', he'd say. 'Look at this card, dude, it's a five of clubs and it's everywhere.'</p><p>As he was saying these things, I kept laughing, and then the world started to spin, but not all at once. Like on the brick wall, each individual brick spun around, all clockwise, but separate from each other. Things changed colors, and when I turned my head, there was a visual of water flowing and melting the images together. There were colors I'd never seen before, in patterns I never knew existed. And they kept weaving back and forth, in and out of each other, so that I could barely stand it. When I tried to talk, all that came out was a thought; there were no verbs involved. We were listening to Sgt. Pepper's Lonely Hearts Club Band, and there are parts in the album that I only noticed when high. The words I said most were: 'Discovery....' 'You gotta DO this....' 'Experience..... an experience from one mushroom.....' and 'This guy..... different.......... disCOVery.........' all in a really breathy voice, which changed from high to low without warning.</p><p>Muppet Treasure Island was playing, and A kept saying 'Island of the druggies' and 'This movie has it all', into his tape recorder. I kept seeing weird patterns and images floating and swimming on the walls, in space, around things that were printed on boxes. I went into another room, and there was this wooden snake which I clutched to my body and held near my mouth. It felt like rubber, EVERYTHING felt like rubber. My face was soft and squishy, and my hands kept moving without my brain telling them to, usually around my mouth and nose, or the back of my head. As I was dancing on the ground, the rest of the world left and disappeared. I kept trying to explain to B what it was like, but without verbs it's really difficult to explain a thought, and coupled with my ADHD, it was impossible to stay focused on one thing anyway. </p><p>I ended up smacking my face with my knee as I danced on the ground, which resulted in a nosebleed. In C's bathroom, I sat on the floor, holding my nose, talking, looking at curtains which kept moving around, and looking at the flowered wall tiles. They didn't look like flowers until the next day, there were a lion and lioness, which transformed into a head of a human being, and other things which I don't remember.</p><p>We kept on this way for a while, until R said we should go upstairs. I was adamant; the vehement opposition I proclaimed was fascinating to B and C. I was saying things like 'The stairs are bad, and scary.' and C would say 'I'll help you up the stairs' and I tried to tell him that it was the concept of stairs that I was so opposed to, but he didn't get it. We did end up going up the stairs, which led to us going to the park. On the way, a car past and I hid behind a mailbox because I was afraid of the lights. The trees at the park were insane, they were like the Nightmare Before Christmas or something. There were pumpkins everywhere, and dragons, and I kept trying to chew things. I was like a little kid. The path we walked down was curved normally, but on mushrooms it twisted upside down and around and it went through itself. The regular street looked normal, but everything else was incredibly trippy.</p><p>When we returned to C's house, we watched The Wall, which didn't actually work out as well as it should have, because the hallucinations had stopped halfway back to the house. I still felt a little weird, but the colors were gone.</p><p>That was my first psychedelic experience. I loved it.</p>"
}
