{
 "title": "Reassembling Reality",
 "author": "Pdoubleu",
 "citation": "Citation:   Pdoubleu. \"Reassembling Reality: experience with Mushrooms (ID 37865)\". Erowid.org. Feb 29, 2008. erowid.org/exp/37865",
 "substance": "Mushrooms",
 "bodyweight": "152 lb",
 "header": [
  [
   "DOSE:",
   "1.8 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 37865",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 29, 2008",
   "Views: 2700",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was about the same time that I started smoking pot regularly that I began to hear friends talk about tripping on mushrooms. I soon started researching and have read just about everything I could find about the experience. It all intrigued me and for over a year I tried to get the combination of the right time and the right place and physically having the mushrooms. Finally, last week my best friend since before high school (we're 20 now) got his hands on a quarter of the fungus. We were to eat them on Friday night in the basement of his parents house, the site of many of our high school drunken nights, a place where we could be somewhat loud or rowdy and be undisturbed while at the same time not disturbing his sleeping parents. \r\n10:00 pm: My friend and I eat the mushrooms. I ate 1.8 grams, which consisted of a large cap and a few small stems. My friend, having experienced this before, ate 3.5 grams, a cap and several larger stems. \r\n10:15: Neither of us notice any effects, but the excitement and anticipation itself is making us giggly and talkative. \r\n10:25: I am looking at light reflections on the wall that I have never noticed so vividly before, wondering if it was working or if this was me wanting it to work, when all of a sudden, out of the corner of my eye, I see a picture on the wall twist and hang at a different angle. Within minutes of this all of the pictures are glowing with color and swaying, the window is taking deep breaths, the mounted deer head on the wall we had named 'buck' was singing along w/ led zeppelin, and the two of us are on the ground laughing hysterically. \r\n10:30: The trip has officially begun. For now I am simply fascinated with the changing colors I see in the lights and the wonderful brightness of the pictures on the wall. But with each coming moment, I can feel everything I know slipping away and this strange, new, moving world taking hold of my brain. A little while after, our girlfriends come back from their drive around town. They come down and inform us that the clock on the wall is an hour slow, but when I look to the clock, it means absolutely NOTHING. I come to the conclusion that time is just a stupid little obsession that humans have and for some reason are always trying to beat the clock. I turn the clock face down and declare problem solved. It is quite scary at how easily one can become obsessed with trying to understand what the time actually means while tripping.\r\nMy girlfriend hands us a bottle of Nantucket Nectars juice that I decide is the most important part of the survival kit for the journey I now see myself setting out on. The strangest thing for me was trying to communicate with the 2 girls who were not tripping. I felt as though I could physically see that they were not on the same planet as me and my friend. They decide to leave us to ourselves. The visuals all the while had been becoming steadily more intense. My friend tells me that it is time to leave the room and explore this strange land.\r\nFirst we go into the other bedroom, which is silent and pitch black. I realized that in the dark, it didnt matter whether my eyes were open or closed, either way I saw moving patterns, peace signs colored in rainbow running up the wall, blue springs floating in the air with the dust particles. We go back into the original room and I am ecstatic to find that it is still the same room behind the door, although it has taken on a completely different appearance. We ventured out the back slider, after concluding that glass was amazing because light and nothing else could get through it, and onto the patio.\r\nThe moon was full and beautiful and made a wall of light come down in front of the deck above us. My friend said 'now we go to the golf course' (which was through the woods behind his house). This petrified me. It was dark, I was seeing things, and he wanted me to walk through the woods to the golf course, which was known to be regularly visited by our town's ever growing coyote population. I said 'No way man we should wait. I cant do it !!' and he responded to me by saying 'It doesn't matter! You can do anything you want! All you have to do is want to do it!!! Just let it go and come with me!!!!' and with that he took off through the woods. I walked slowly. A cluster of bushes made a hideous evil face at me, like a goblin getting ready for halloween (which was 2 nites away) and looking to make me his appetizer. With my friend's words still echoing through my head, I looked at the monster, and told him out loud 'Fuck off.' He smiled at me and allowed me to pass.\r\nThe journey through the woods was amazing. The trees were dancing with the breeze, tickled by the streams of colorful peace signs running up their trunks. I made it through to the 12th green and my buddy and guide was there waiting for me. We ran as fast as we could through the grass, my head disconnected from my body and just floated effortlessly over the wonderful green ground. We soon found out that running was not a good idea and I felt a slight bubbling in my stomach, a faint reminder that I was putting my body through hell to release my mind. We both laid down and watched the stars and moon in their beautiful patterns that spread through the whole universe. My friend and I got into a very deep conversation about laws and money and how none of it was real and we found ourselves screaming 'FUCK THE RULES' and laughing hysterically.\r\nThen, out of nowhere, my guide stood up, took off his clothes, screamed 'Nothing matters!!' and split the scene. I was alone on the golf course. At first I almost followed him, but something in me told me not to. I wandered around the course, whispering words of encouragement and thanks to my body that I could barely feel in my state of pure bliss. I suddenly realized that there was probably a hungry coyote stalking me like I was a deer, and that was ok because that was what he did, and walking around was what I did, and as long as we did our things no matter what happened it would be all fine.\r\nI finally made it back to the strange castle that the house had become. Upon stepping inside, my world disintegrated into disarray. I found the floor soaking wet, my friend in his jeans crying in the shower. He puked up his mushrooms, although I was convinced it was only pineapples. I tried to help his girlfriend clean up the water but I didnt know what to make of the paper towels I found in the closet. This is when I felt telepathically connected to my friend. He came out of the shower and said 'Can I...' and I got him a towel, then he said 'I need...' and I left him to get dressed while I put his wet clothes on a pile on the floor. I found him lying on his bed, face down, in the dark, silent. I said to him 'Hey buddy...you should think about things, Im gonna be outside' and he didnt answer but I felt him start to concentrate on his problems. I went outside, on the way grabbing a wool blanket, a flashlight just in case, and my wonderful juice. As I was going out the door I explained to my friend's girlfriend that I knew he was going to be ok, he needed to think, and that the light in the ceiling should be turned down a few notches to reset the mood.\r\nI sat outside and talked to myself and the trees about life for what seemed days. I listened to the wind telling me of what people all around the world were doing, and how every person had the same exact right to do whatever it was they wanted as long as nobody was bothered, and that if anyone could do what they want nobody would need to bother anyone else. I realized that all humans have little things that they allow themselves to become obsessed with, and when they could incorporate that obsession into their work life they would be happy with their jobs. I thought of my girlfriend, and how badly I wanted to take her into this world, how well I knew she would be able to understand it all, and how I absolutely knew we would have trips that followed each other.\r\nAfter a few lifetimes of this I went inside and listened to some phish. I felt the visuals disappearing, but my mind was still going. This was the time of reflection, where I would sit and think about all of the weird crazy things that had just happened to me and what it all meant. I concluded that a trip is a very fragile thing. It is extremely sensitive to vibes and moods of other people and of yourself. I can feel someone's mood before I even say one word to them, and if the vibe is strange, it makes me feel VERY strange. Everything that happened was so intense and realistic even though I knew, and had to consistently remind myself, that it was all in my head.\r\nFinally my friend had finished his thought train, and when he popped his head into the room and I saw a smile on his face, I laughed out loud with joy for him. We talked for the next 3 hours (time slowly made more sense) about all that we had learned about ourselves. That there is nothing in life to be afraid of. I gave my friend my warm blanket as an offering of comfort. He smiled. We talked and talked about it all into the early hours of the morning, me sipping my wonderful juice the whole time.\r\nI would definitely do this again. It turns out that my friend's trip went bad because of a single thought that his parents knew what was up. When I came into the house to find chaos, it nearly sent me over the edge, I felt my whole understanding of everything melt away, and I HAD to go outside to piece it all back together. I felt vibes coming out of everyone and every room and light and the slightest change was felt intensely. It was the most weird, scary, fun, exciting, and confusing thing all at the same time that I have every experienced.\n\n\n"
}