{
 "title": "Defragmentation of Reality",
 "author": "Cat",
 "citation": "   Cat. \"Defragmentation of Reality: experience with Salvia divinorium (10x extract) (ID 37871)\". Erowid.org. Aug 1, 2007. erowid.org/exp/37871",
 "substance": "Salvia divinorium (10x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37871",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 1, 2007",
   "Views: 3153",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had my first experience with Salvia dinivorum last nite. I shared a bowl with four people where we all took hits. I was the first one to take a hit and felt a strange change in perception. I continued to give the bowl to my friend. After a split second he manages to give the bowl to the next person and I hear him say I'm tripping so hard. Dissapointed I didn't get the same feelings as him I took another hit. Again nothing but a strange alteration of my perception. Things looked brighter, objects were further away than they were, ect.</p><p>I was determined to get soemthing out of this so I took one last hit at that time. This time my friend was lighting the bowl for me so kept it going for a long long time. The hit was not even over yet and it hit me. It was a rush of energy and visuals. It lasted for about 3 to 5 minutes. The onset and peak of this substance is so quick that can be overwheliming. I didn't freak out but I was very eager for the other girls to have another hit and experience and what I was feeling.</p><p>The most interesting visual at that time was the colorful worm like pattern that went fromt the carpet to the bed. One of the girls was sittign on the bed and the pattern of worms crawled up to her and her bed. It was an amazing sight. And as probably quick as you read this, the pattern was gone. I never lost my mind or memory. I also experienced a very strong pull in my legs. It almost felt as if someone was grabbing my legs extremely hard making them numb. Another very interesting feeling was the sudden alteration of everything around me. Although the peak had been the worm like patterns, the come down is somehow slower and my visual perception remained changed. I look at a picture on the wall. I was so convinced it was a picture, I could see it, feel it and smell it. I was very surprised to see that when I got my sanity back I was actually staring at a pot of flowers. Well the flowers did'nt look like flowers, their colors were painted on the wall and the patterns formed by these colors made up different figures on the wall. It wasn't as intense as my first visual but I felt as if I could play around with it.</p><p>I completly came down about 10 minutes later. During the experince I found it difficult to find words to describe what I was feeling. I managed to say that I would tell them about it as soon as I came down. I completly came down and to my surprise it had only been 10 minutes. There was no confusion, over the top anxiety or paranoia. I was feeling very relaxed and calmed. My friends that by this time were very high offered me a hit but I decieded to keep my experience with salvia as clean as possible. Smoking cannabis had taken me into a very bad trip on shrooms before. A very interesting after effect was the fact that focuss was completly lost. I had a hard time watching a movie. I couldn;t follow it I kept gettign distracted by sounds, lights, my friends and the room in general. This feeling lasted for aobut 20 minutes, then it vanished.</p><p>On the way home I decided that I was gonna take one more last hit before bed. As my friend was driving I took a hit and I was surprised to see that I only got a very light effect, change in perception for most of the time. A little disapointed I decieded to wait around for the next hit. My friend parked the car and I took one more last hit. This was by far the strongest experience, it went a little bit like this.</p><p>T+0 Taking the hit. Nothing happened. I was again very disapointed.</p><p>T+30 seconds: I tell my friend im going to take another hit.</p><p>T+45 seconds: I sit up, put the pipe up to my mouth and I was completly taken, I didn't even take the hit.</p><p>This is what I call the degragmentation of reality. I had a very strong body and visual trip. Everything, even myself, became a puzzle. The pieces of this puzzle were extremely colorful and the pieces began to fall off. It was very hard to move and talk. My friend heard me trying to say what I was feeling but I quickly gave up since it was impossible to describe. As the pieces of the puzzle were falling I saw pieces of the puzzle in my body falling off too! As this was happening I had a very strange body sensation. I felt like I was beign pulled apart. I know this sounds like a horrible experience but the pulling and falling of pieces didn't hurt but amazed me. As this was happening I had the urge to tell my friend what was happening, but once again I couldn't.</p><p>This trip lasted a little longer than the preceding one. I could still see the pieces falling off everywhere off the car, myself and my friend. The experience was very colorful since every color in the car and the both of us turned either red, yellow, green or blue. Each of these colors was a differnet piece. The pieces were small and to my surprise they didn't look like puzzle pieces but I knew in my head it was a puzzle.</p><p>This experience was very enjoyable yet I see the potential on how scary it could be to someone else. I was glad I had a sitter the whole time. I am a little scared of doing this by myself since during both of the trips I could not handle reality whatsoever. If I talked to someone else that didn't know I was tripping they would def know I was on something bc the words out of my mouth did not make sense at all, most of them were an effort to descirbe the experience.</p><p>From my experience I can def say that after doing salvia D I had no desire to anything else, drinking or smoking, the whole nite. I was extremely tired. I felt like all my energy was used in the trips. This second experince left me feeling calmed and relaxed once again, only this time I was ready for bed.</p>"
}
