{
 "title": "The Mismarketed Antidepressant",
 "author": "Greg's Cortex",
 "citation": "   Greg's Cortex. \"The Mismarketed Antidepressant: experience with Tramadol (Ultram) (ID 37930)\". Erowid.org. Dec 6, 2004. erowid.org/exp/37930",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 37930",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 6, 2004",
   "Views: 35736",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Upon reading reports all over the internet, it seems apparent that different people have different reactions to this drug.  I suppose that, until you find out how it works for you, you should use caution and discretion because it seems to be quite a scourge to some.  I, on the other hand, have had very positive experiences.  I have been taking 100mg to 500mgs a day for 6 months to relieve my chronic lower back pain.  I have been addicted to morphine for a year in 2001 and I know the depths of addiction and withdrawal.  When I was coming off of morphine I felt like I had a horrible flu for about 4 or 5 days and I couldn't sleep for about 3 weeks or more due to my involuntary leg writhing when I tried to stay in bed (this was, by far, the worst part for me).  So, I made my bed and I lied in it. Luckily, I was in a position then to take a week off from life and get better.  </p><p>Ultram, on the other hand, does not seem to be physically addictive to me.  I vary my dose to fit my pain and my mood by the day, I think that this is part of the trick.  If I keep varying the dose and occasionally substituting other opiates, my body doesn't seem to set a solid dependence from forging the long lasting neurological changes that it does when the same amount is taken routinely at the same time every day.  In fact, my tolerance fluctuates all the time, keeping the brain plastic seems to help a lot in avoiding real addiction.  When I stop, my chronic back pain comes back, but thats pretty much it.  I might not be as talkative or outgoing for a few days, but so what? Not the end of the world. When I take the drug, I do not experience any real side effects except for stomach pain when I take more than 2 at a time before noon, it helps to eat something, even though the packaging says that it can be taken on an empty stomach. I also have trouble finishing during sex, if at all.  This can be a good thing for about 45 minutes, after that it sucks.</p><p>This drug, like I said before, is a great mood regulator, many marketed anti-depressants provide their action through mechanisms that result in an increase in norepinephrine and serotonin in the synapses of certain regions of the brain.  This is also how ultram works, and because some of these pathways innervate our pain perception centers causing inhibition of pain impulses, it also regulates pain.  So we have a dose dependant, short acting (6-8 hours vs. 2-4 weeks with many anti-depressants) but effective anti-depressant pain reliever...What a great drug.  I would have to guess that many of the people with ongoing addiction problems might be mildly depressed and so the medication provides relief and restores 'normal' function.  To a certain extent I am self medicating to make up for the deficit and to restore a more proper neurotransmitter balance. </p><p>All in all, this is a wonderful drug, very few side effects and many benefits.  No constipation like traditional opiates and a long duration of action relative to hydro or oxycodone.  The mood effects seem to last a good 8 hours with a pleasant light buzz, then the residual positive mood effects can last 2 days sometimes.  The analgesia, depending on the severity of the pain, follows a similar pattern.  I do not find it addictive physically, I wouldn't stop cold turkey after taking 500mgs every day for a month, but I can easily taper down from 300mgs one day to 100 or 150 mgs the next with no ill effects at all.  After a few days at 100 or 150, I can just stop.  No real adverse effects except that my back hurts again (that is what I take it for, in addition to mood elevation and social lubrication).  </p><p>I understand that, although my story is very common (ultram is available without a prescription in 40 countries), it is not this way for everyone.  To those who have an addiction to tramadol, I would suggest assessing whether it is a mental or physical addiction.  If it is mental, you need to do some soul searching, switch to another medication that satisfies your needs (zyban and wellbutrin are reported to help greatly), or shed the stigma of this drug and accept your use as a medical and psychological treatment, as long as it doesn't prove detrimental to you or those around you.  If you find yourself physically addicted, perhaps you can just accept it if the pain outweighs the prospect of addiction, or you can taper off of it as slowly as necessary.  If you find this hard because you don't feel the buzz anymore, you might want to re-assess your mental addiction situation.  Whatever you do, keep your head about you and good luck.</p>"
}
