{
 "title": "Aurora of Faces",
 "author": "Outtatheframe",
 "citation": "   Outtatheframe. \"Aurora of Faces: experience with 2C-I (ID 37953)\". Erowid.org. Sep 26, 2008. erowid.org/exp/37953",
 "substance": "2C-I",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "37953",
   "Male",
   " ",
   "Not Given",
   "Sep 26, 2008",
   "Views: 2622",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently purchased 100 mg of 2C-i. I was a little worried about the quality and whether or not this stuff would even work at all. </p><p>Immediately after i received the package I decided to take just a little to get a feel for it. I would estimate that I took 6-8 mg orally (no scale). The effects were promising, and at least now I knew that it was the real deal. Very mild visuals, and a very speedy rush accompanied this dosage for a few hours after dropping it. Similar to a 1/4-1/2 hit of good lsd. I tried this dose 2 more times and noticed no side effects. At this level it is really good for social situations. It makes it really easy to talk and there is not any paranioia, very enjoyable!</p><p>I was really excited about taking a full dose, and I was going to try it with a friend on a saturday. Anticipation got the best of me, and since I didn't have to work Friday, Thursday night seemed like a good time to give it a try. :)</p><p>Setting- At home, roomates sleeping, comfortable surroundings, tv and computer to keep me occupied.</p><p>Dose- 18-25 mg orally (no scale) It is important to get a scale... I really wish I knew exactly how much I took, because this was the perfect level for me and when I do it again, I would like to have the same experiance. A little more might have been too much, and maybe a little less enjoyable... \r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>9:45 pm- I took 2 small scoops of the 2c-i and put it into a cup and put a little tea in with it. Swallowed it down, no taste at all when mixed with sweet tea. </p><p>10:15- At this point I am feeling a little excited and my body is starting to tingle, similar to extacy coming on, but that is the only thing these 2 drugs have in common...</p><p>10:45- Starting to notice mild oev's now, very speedy now and I am having trouble sitting still. Everything stays the same and slowly builds for the next hour.</p><p>11:45- DAMN!!! All of the sudden it just kicked in hard. Very intense visuals. I am watching tv and peoples faces are stretching, and when they talk there mouths are distorted. I also notice that even in the tv I am catching trails off of things moving around. I am watchin american chopper and when they are welding the sparks seem to fly out of the tv and onto the floor. This stuff is really cool!</p><p>12:30- Stronger, stronger, stronger!!! It is still picking up the pace. At this point I would compare it to about 2 hits of really good lsd. No negative thoughts though, and not very mental at all. Just tripping really hard... Everything is moving and swaying, patterns everywhere, walls moving. I am still very full of energy and keep going outside to smoke. Outside in the yard it is so completely opposite from the inside. </p><p>Everything seems so much more intense. The sky is the most beautiful thing I have ever seen! The clouds are rolling across the sky like the aurora, and there are faces all in the clouds, part of the whole show, the stars I can see are darting around like comets, with rainbow tails, and the trees are all dancing like verticle snakes, waving from top to bottom. I have never seen anything like this, not even on acid. I just want to lay in the driveway and watch the whole show. I cannot explain everything that i was seeing, or express how beautiful it was, but i liked it!</p><p>12:45- 3:00- This peak continued the rest of the time, i watched tv and got on the net for a while, still completely amazed the whole time at the visuals. Every bit as intense as what I descibed above. I didnt want it to end, but I knew I needed to get some sleep soon...</p><p>4:00-6:00- Slowly fading, trying to sleep but I cannot. Still tripping, even with my eyes closed. The only 2 side effects I noticed kicked in now. My neck hurt really bad, and I couldnt sleep at all. I think my neck hurt from being so tense during the whole trip (very intense). I finally fell asleep around 6:00 and slept well. I also noticed I felt great the next day too, after about 6 hours of sleep...</p><p>Summary- I really can't wait to try it again. Other experiances that I read on here made me think that it wasnt that strong and that it was like extacy. This stuff is like strong acid without the paranoia. I definately got my moneys worth!!!!  Enjoy!</p>"
}
