{
 "title": "Living Dollhouse Sounds Right",
 "author": "taz",
 "citation": "Citation:   taz. \"Living Dollhouse Sounds Right: experience with Wormwood & Salvia divinorum (10x extract) (ID 38085)\". Erowid.org. Aug 6, 2007. erowid.org/exp/38085",
 "substance": "Wormwood & Salvia divinorum (10x extract)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "smoked",
   "Wormwood",
   "(extract)",
   " ",
   "200 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38085",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 6, 2007",
   "Views: 6550",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirst let me start with describing the wormwood extract.  I bought about 2 oz of fresh wormwood leaves from an online supplier.  I dried all the leaves under shade and then ground them into powder or very small chunks.  I then filled the jar about halfway with them and then filled the jar with acetone completely.  With the cover on the jar, I shook the jar while watching TV for about half an hour.  The acetone, a very murky green at this point, was then strained through a coffee filter and left to dry on top of a hot plate for about 12 hours until it left a hash-like substance on the bottom of the jar, like described in a report I'd read.  It was a very thin layer, somewhat sticky, and I rolled it up into balls. \r\nI then loaded up a very large glass-blown 'tobacco' pipe with weighed 0.75 of the wormwood extract and 0.2g of the salvia extract.  I'm somewhat familiar with each substance so I knew how to recognize the effects of both.\r\nI found that the wormwood extract made the salvia significantly easier to smoke, compared to the normally harsh hits I must take to trip off salvia.  After holding about 3 hits in as long as I could, I put down the bowl and laid down with all the lights off and closed my eyes.\r\nThe salvia hit me very fast.  I lost most of the perception of who I was and then experienced a whole new plain.  I was walking through a forest of completely black and white, with deer ducking in and out of the trees.  However, unlike other normal salvia trips, I was completely aware that this wasn't real.  I also felt as if this new world was very clean, and the trees were almost texture-less, with brilliant, contrasted white and black outlines similar to birch trees.  The deer frankly scared me, I was sprinting through the forest while feeling their prying eyes on me.  I suddenly saw a vision of a friend of mine, he was telling me 'Wake up, wake up.'.  The deer began to laugh and the sound surrounded me.  I then felt this world sucking back and, although I had not initially realized that it was gone, the realization of the true world was quickly coming back to me.  I opened my eyes and was laying in my bed.\r\nAt this point, I was feeling some of the aftermath of the salvia along with the odd effects of thujone.  Many times after I use salvia, my scalp and my feet feel almost raw.  My reality was shifting in and out of perspective like I was in an Escher-esque world, the dimensions of time and space felt almost meaningless.  At this point, however, I could consciously attribute these happenings to the psychoactives.  I sat down and watched a 'Recess' marathon for the next 2 hours or so, and the effects of thujone wore off.  I was feeling very inspired, however, during the comedown, and I made two very interesting acrylic paintings. \r\nThese two psychoactives are quite fun seperately, but together, they slightly detract from each other.  However, it is not enough to discredit the experience, as it is something I would definitely try again.\n\n\n"
}