{
 "title": "Nice Afternoon Out",
 "author": "flow in",
 "citation": "   flow in. \"Nice Afternoon Out: experience with Belladonna & Cannabis (ID 38106)\". Erowid.org. Dec 20, 2004. erowid.org/exp/38106",
 "substance": "Belladonna & Cannabis",
 "bodyweight": "83 kg",
 "header": [
  [
   "DOSE:",
   "2 berries",
   "oral",
   "Belladonna",
   "(fresh)",
   " ",
   "  ",
   " ",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38106",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Dec 20, 2004",
   "Views: 23592",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I work in a fluid realm, so all information is pertinent if present. On seeing the belladonna plant, I knew we would work together, so I picked three berries (there were three of us). I remembered hearing the ripe berries would kill if three were taken. My fellows declined, so I ate two. I found them most pleasant.</p><p>A 10 minute stroll later and we reached the sea (the day was warm, maybe 11 degrees). I had a couple of tokes on a pipe. I hooked into / merged with my friend's energies, then, as the sun fed my body, I ran to the sea for a swim. I found no hallucinations, the sea played more tricks than normal (waves coming from 3 opposite angles, spinning me around. I found it very easy to visualise dolphin and whale energies, and to swim freely. It was beautiful.  I was allowed to return after I had established that home was on land. I came in after about 30 minute, then found that I had lost all feeling in my mouth and throat and speech was tricky, which I ascribe partly to the belladonna, although the sea was cold, so my body took a long time to warm up. As usual, I ran until my limbs felt human. I had no other difficulties.</p><p>My two companions had managed to resolve their differences, and a great deal of emotional blockages had shifted. I felt like a small child, and was aware of strong attachments.</p><p>I was later told that the unripe berries were more toxic, so I took two of them to compare. The flavour was disgusting, and I later felt a similar numbness in the mouth, plus slight stomach disturbances. Nothing of note occured, beyond affirmation that CURRENT information (i.e., what I remember and feel) is worth listening to. They taste _disgusting_ when unripe. A quote 'it is against spiritual law to interfere with a pregnant woman, as it is unwise to act on incomplete understanding', or eat an unripe seed?</p><p>I am now growing the stuff, since the flavour was so pleasant.</p>"
}
