{
 "title": "Craving One Before I Even Started",
 "author": "AmoebaMan",
 "citation": " AmoebaMan. \"Craving One Before I Even Started: experience with Tobacco - Cigarettes (ID 38133)\". Erowid.org. Jun 12, 2007. erowid.org/exp/38133",
 "substance": "Tobacco - Cigarettes",
 "bodyweight": "137 lb",
 "header": [
  [
   "DOSE:",
   "2.5 joints/cigs",
   "smoked",
   "Tobacco - Cigarettes"
  ]
 ],
 "footer": [
  [
   "2004",
   "38133",
   "Male",
   "",
   "Not Given",
   "Jun 12, 2007",
   "22055",
   " "
  ]
 ],
 "report": "<p>If you asked me, I would say that I have very loving parents and a good upbringing. But today, I succumbed to the urge to try something that my folks would tear me apart for if they were to discover. The answer is Marlboro cigarettes.</p><p>I was taught at an early age that smoking, drinking, and drug use can destroy your life, lead to disease, or kill you, so I was more than confident that you'd never find me taking a drag off a cigarette. My mother smoked and drank when she was pregnant with my sister, and then also smoked when she was pregnant with me, but we were both born with no illnesses and were both well-developed babies thankfully. Feeling guilty about being a nicotine addict, my mother, after trying countless methods to quit, finally gave up smoking in 1991 when I was about 2 years old. She's been clean ever since. My dad only smoked for a brief period for social reasons and easily gave it up because of his worries about becoming addicted, I'd assume.</p><p>A friend I've been hanging out with quite regularly for the past year and a half has given me and him some memorable experiences. We've done fun things, stupid things, funny things, but all-in-all, we just try to have a good time. To get ourselves and our friends a goofy laugh, we took a lighter one time about six months ago and smoked a portion of plain old typing paper rolled up like a joint. Needless to say, it was like being in a room full of tear gas; nothing but coughing, spitting, stinging, and teary eyes. The odd and dumbly ironic thing about it was, we found that we continued to do it. Don't ask why. It didn't do anything for us except just to be able to smoke something while we were sitting and talking.</p><p>We had been dying to try marijuana to have some kind of psychadelic experience since we had plenty of free time on our hands. I guess smoking the paper gave us that feeling of being there with our pot, rolling a joint and lighting up. Fortunately, we finally realized how idiotic it was when we said to ourselves, 'We're sitting here smoking fucking paper.' We quit immediately, but the urge to smoke something has not. This is why I say that I felt I was craving a cigarette before I even tried one.</p><p>About two weeks ago, my parents had left on a Saturday for a pool tournament my dad was participating in. He had had some of his buddies over earlier, and one of them smoked one cigarette, and for some strange reason, left a brand new full cigarette lying in our garage instead of taking it with him. Being out in the garage skating and listening to music that afternoon, I was unpleasantly surprised to find that I was dying to smoke it. I had never touched tobacco in my life, and here I was with my fingers itching to grab that cig and my lighter. I couldn't describe the feeling. It was like having a physically deformed person out of the corner of my eye and being told not to look at them. And if you catch my drift, that's incredibly hard to do. The most I could do was hold it in my hands and in my mouth, but I'm proud to say that I resisted the urge and did NOT smoke it, for fear of being caught or smelling bad in front of my folks.</p><p>Today, that urge was there again. My friend, J, and myself were at his grandparents' house, who are both about 2-packs-a-day smokers. Since me and him had both partaken in the dumb act of smoking paper for a laugh, we were wanting badly to steal a cig from them. Finally, he found a partially smoked cig of theirs on the lawn and took their torch lighter around back. It wouldn't stay lit because of the breeze, but we managed to get a few drags and I became strangely satisfied. The taste of the Marlboro sat well with my senses and put me in an even-keel mood. J didn't get much of a drag, so we gave up the idea but I was craving for another, better cigarette.</p><p>So we resorted to looking around the food mart or by parking lots for partially smoked cigarettes. We found several half-smoked ones, and the amount I myself used came to about two whole cigarettes when combined. J's usage was probably only one whole cig, but my urge was greater than his. We headed down by the river and sucked them down in only a couple of minutes at about 4:30 in the afternoon. Since we didn't find a couple more half-cigs until later, there was about a 10-minute interum in between each usage, but I did notice one thing crystal clear each time: I found myself getting horny each time. Don't mean to be obscene, but with about the first two drags, I got an instant erection and became strangely horny. I had nothing on my mind but smoking, so I had no reason to be aroused and yet I was. After I finished it, the erection disappeared. But then, we found the next couple butts, lit them up, inhaled, and I was horny again. I couldn't explain it, but I've accepted the fact that it must have been my body's personal reaction to the tobacco.</p><p>I've assumed now that maybe my craving to have a cigarette before I'd even tried one was that I'd already smoked something before. This might have explained why I was was dying to go through the sneaky, yet fun preparation of obtaining the drug, lighting it, inhaling, and seeing in what weird way I can exhale the smoke out of my body. I also think the paper toking maybe prepared me for actual cigs. They always say you cough on the first drag, but I found the cigarette smoke very soothing and never coughed once. It's probably mellow compared to the very harsh chemicals in regular typing paper.</p><p>Even now, I have the undying urge for another even though I would most definitely smell. I managed to wash out the smell on my hands and mask my breath by brushing my teeth and using mouthwash. Unfortunately, I've only had about two cigs and feel that I would get addicted easily if I continued. I would like to do it in social situations with my friend, but I feel that it's simply not an option at my age. Don't be like us and get yourself drawn in by the act of smoking something. It only really satisfies you temporarily. It's like eating only in reverse effect. The more you eat, the more your hunger grows.</p>"
}
