{
 "title": "Sleepwalking",
 "author": "Swede",
 "citation": "   Swede. \"Sleepwalking: experience with Amitriptyline  (Tryptizol) (ID 3815)\". Erowid.org. Apr 8, 2001. erowid.org/exp/3815",
 "substance": "Amitriptyline  (Tryptizol)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3815",
   "Male",
   " ",
   "Not Given",
   "Apr 8, 2001",
   "38715",
   " "
  ]
 ],
 "report": "</p>\nThis friday I wanted to do something wierd, so at about 7.30 AM I took two 10mg tablets of the antidepressant Tryptizol on an empty stomach. After my breakfast, approx. 7.50 AM, I took two more tablets together with my allergy medication (a very mild one called Clarityn). Then I headed off for school.</p><p>After my first class I began to feel a bit tired (this was around 9 AM), and went for a walk around the school grounds. My legs seemed to operate without me thinking about it.</p><p>The second class (maths) wasn't very fun. I felt sleepy and worn out. I couldn't concentrate on the book or the teacher, and nearly fell asleep a couple of times. Finaly the class ended, and I could leave the classroom and take a walk along the corridors.</p><p>When the third class began I felt like I hadn't slept in 36 hours. My eyes moved in a jerky manner, my mouth was dry and I couldn't keep my eyes open because then the light would hurt my dialated pupils. It was a biology class, and we were supposed to write about blood. The teacher sounded far off, and everything was black for periods (I don't know if I blacked out, fell asleep or just closed my eyes). When I began to write I lost my train of thought quite a few times. Sometimes I also wrote the wrong words, and I had some strange dream-hallucinations (right before I fall asleep I sometimes get strange ideas and see things that aren't happening). The girl who sat next to me asked if I've been smoking weed, probably because I looked wierd and mumbled strange things.</p><p>In some way, I managed to get through the class, even succeeding in dissecting a heart while half asleep and sometimes nodding off. When I got home at 12 AM I fell asleep the moment I laid down on my couch and slept deeply for three hours.</p><p>All in all, a _very_ strange trip.  To do it in school was pretty stupid, since I couldn't get much done. Maybe if I had combined the Tryptizol with Adderall or caffeine it could be a more exciting thing. Something to try next time...</p>"
}
