{
 "title": "A Pleasant Escape",
 "author": "Emerald",
 "citation": "   Emerald. \"A Pleasant Escape: experience with Alcohol - Hard (ID 38179)\". Erowid.org. May 26, 2006. erowid.org/exp/38179",
 "substance": "Alcohol - Hard",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38179",
   "Female",
   " ",
   "Not Given",
   "May 26, 2006",
   "Views: 16785",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I tried alcohol, I was a bit nervous about its effects (having heard all the hangover stories). I was browsing online one night feeling a bit bored, looking for a lift in my mood. I had tried wine before, but it did almost nothing to me- what's more, it also tasted horrible. Around 10:30pm I took about 4 sips of some generic chardonnay. but I was up for something a little stronger, so I decided to try some hard liquor.</p><p>At about 11:00pm, I happened to find some 80 proof Vodka under the kitchen sink and decided to give it a go. I was shocked to find that it was a crystal clear liquid, like water (don't laugh, remember I'd never seen it before.). I poured about 1/8 cup into a small glass as its strong antiseptic smell stung my nose. I managed to down the stuff in three gulps; it tasted so horrible I could barely keep myself from gagging. It tasted like I had swallowed a bottle of rubbing alcohol.</p><p>I was surprised to feel the back of my throat burning and numbing, as if I had just gargled listerine. It produced a warm, burning sensation down the center of my chest, not necessarily pleasurable but not unpleasant either. I became aware of the drug working after only a few minutes; the tips of my fingers tingled and felt a bit numb, and I felt heavier somehow- slow and sedated into my chair. Everything seemed sort of calm and peaceful, very happy and wonderful. I also felt what I later described as a kind of 'delayed reaction'- my body would move, and then my brain would have to 'catch up' with what I was doing. Feeling this, I quickly realized why it was so dangerous to drink and drive- my muscle coordination had decreased quite a bit; I felt lazy and relaxed. </p><p>At about 11:30pm, I figured I could go for a bit more. This time I pulled out a bottle of tequila and poured the same 1/8 cup dose into a small glass, and managed to down it in two gulps. Another half hour after this, I began to experience some typical 'drunk' symptoms; random things seemed unusually funny, I tilted a bit (though not much) when walking to the bathroom, and I even fell into a temporary period where I wasn't quite sure of what had happened. I recall doing something on my computer, and I suddenly realized that there were random popup messages there and add-on sidebars that I hadn't even noticed! How on earth they got there, and for how long they'd been there, I couldn't remember at all. But for the most part, it was quite fun. I felt a sense of inner well-being and had almost no cares in the world. Everything was warm and comfortable, a mild high.</p><p>Finally, after deciding I should get some sleep, I stumbled in a happy dream-like state to the bathroom at 2:00am, where I took a bath and prepared for bed. I fell heavily onto the bed, almost as if weights forced me down onto the mattress. I felt a slight vertigo- things around me were spinning, and it was actually pleasurable- I was not nauseated. I woke up several hours later at 8am feeling intense thrist; I drank several gulps from a water bottle and went back to bed until around noon. The next day I still felt a bit sedated but not significantly impared, and I was relieved to find that I didn't experience a hangover.</p><p>Overall, I'd say it was a fairly good experience.</p>"
}
