{
 "title": "LSD and Color-Blindness",
 "author": "Phyrexia",
 "citation": "   Phyrexia. \"LSD and Color-Blindness: experience with LSD (ID 382)\". Erowid.org. Jun 13, 2000. erowid.org/exp/382",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2000",
   "382",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 13, 2000",
   "10674",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was surfing through your pages here and I ran across the article on LSD and Color-Blindness.  Having color-blindness myself and having done LSD, I thought I'd share with others how my color blindness affects my vision, and what if anything LSD has done for me.</p><p>First I will explain my color blindness condition.  I am a red/green color blind person.  This does not mean, however, that I confuse red and green, like in the article that prompted this email.  The best way I can think of to explain it is that I seem to a) confuse similar colors and b) 'forget' the identification of a color.  The most prominent of these are between brown and green, red and brown (sometimes), as well as blue and purple.  If two colors (such as blue and purple) are placed next to one another, I can often tell that they are in fact two seperate colors, though I can't tell which one is purple and which is blue.</p><p>Having (hopefully) explained that, I must say that in all my trips colors have appeared brighter or sharper, all beautiful, though I still could not tell blue from purple.  The most likely reason for this is that i've lived with my colorblindness for so long i've stopped trying to identify them.  Also most likely the reason for this is that I can still distinguish between those certain colors but not figure out which is which.</p><p>I hope this helps some people better understand one of the few types (yes, there's more then one) of color-blindness.  At the very least it's enlightened at least one person.</p><p>\n"
}
