{
 "title": "Boundaries",
 "author": "Spiritual Quester",
 "citation": "   Spiritual Quester. \"Boundaries: experience with MDMA (Ecstasy) & Cannabis (ID 38217)\". Erowid.org. May 22, 2007. erowid.org/exp/38217",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "6 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38217",
   "Female",
   " ",
   "Not Given",
   "May 22, 2007",
   "10853",
   " "
  ]
 ],
 "report": "<p>Last month I took MDMA for my first time and it was relatively enjoyable. It wasn't too harsh or too out of control and I thought the drug had potential.  A couple of weeks later I finally took a full cap, not knowing it was double stacked at the time. I was with 2 other people who had tones of experience so I felt relatively safe. An hour after injestion and my friends were incredibly high but I was still waiting. This automaticly gave me the impression that something was off or a bit wrong.</p><p>After another half an hour, we stepped outside to smoke some mary-jane. We started smoking and I could feel the weed high very clearly but still no MDMA effects. Suddenly, one of my friends (call him Mike) turns to me and tells me he loves me and begins hugging me very tightly. I hug back but deffinately didn't feel the same way. My other friend (call her Lala) turns around and then does the same thing to me. Still no MDMA high.</p><p>Alas, I thought my night was wasted but then I instantly felt something swelling inside of me. I could feel a peek coming and it was massive. Imagine looking up and seeing a 400 foot tidal wave about to hit you in the next 2 seconds. And just like that I took off for a hell of a ride.  I began hugging my friends back and vehemently telling them I loved them. We sparked another joint (#2) and decided we should try making out with each other. This was fine and I didn't feel like I have over stepped my boundries.</p><p>We went inside soon after and found ourselves EXTREMELY turned on. Lala and I are both lesbians so I began pawing her to get some attention. Despite her lesbianism, Lala was also pawing at Mike to get his attention. Ironicly, Mike is gay as well but he was responding to her. I began telling them my fantasies and we shared intimate details about our sexual wants and desires. I found this fascinating and enlightening. I no longer felt as guilt about my desires and I still carry that lack of guilt with me today. However, we all knew we had to calm down since my sister was upstairs sleeping so we decided to go for a walk.</p><p>Before we made it outside for our walk, we stopped off in another room and before I knew it, Lala had Mike's pants down around his ankles and was performing a sexual act which shall not be mentioned. This is when I turned pale and crashed from my peek. My boundries had been destroyed right there in that second. I began dry heaving and immediately told my friends to leave the room. I felt disgusted and impure. I needed time alone.</p><p>Thankfully, I'm a councellor for those who have negative drug experiences while high. Because of this and the trainning I had received prior, I was able to talk my-self back into the high and calm my nerves. Still to this day I suffer strong emotional issues with what happened that night.</p><p>But I was peeking again and joined my friends outside to smoke another joint (#3). After that we began walking without destination. I'm a firm believer that the high takes you where you should go and that you should follow it. It was about 10 minutes into the walk that I realised I was in serious trouble. Due to the large quantity I had taken and my lack of experience, I found my-self hyperventilating and extremely over stimulated. This problem lasted for the entire duration of my high (12 hours).</p><p>Despite all that had happened I was still ejected into euphoria and found my self skipping down the streets of my city without real care or worry. Then I found a flower garden. Flowers are God's gift to humanity while on MDMA. Never in my life had I seen color so bright and so clear. I could have spent hours rolling around in that garden had it not been for the fact that it was on private property.</p><p>I also found that I wanted to take a lot of things home with me and I did. I was stealing freely from people's property. The next morning I found a shrine dedicated to MDMA on my street corner. It was a 10 pound bag of sand, a cone from a construction site and a rotten cucumber. interesting...</p><p>The rest of the 12 hours was spent walking around and observing the city in all it's glory. I wish I had been able to be alone with my high more that night. I wish I could have used it in a meditative state. Alas, it wasn't meant to be.</p><p>Three days later, I found my-self hospitalized for a fever that was potential deadly. I had the runs and still do even though it has been three weeks since. I was dehydrated despite the fact that I drank PLENTY of water. I had the shakes and muscles spasms. I had major depression and lock jaw. I had even contracted a severe tonsil infections that if left untreated could have killed me.</p><p>As a result, I will no longer take any drugs other than cannabis or magic mushrooms. I don't want to have that kind of high ever again even though it had it's high lights.</p><p>I advise to set CLEAR boundries while on this drug. Repeat them to yourself, out loud, when you feel your first peek coming. Make sure you take a small amount for you first time and second time. Be with trust worthy people who can help you if you take too much like I did. Know your source, know your body and be safe.</p>"
}
