{
 "title": "Almost Too Easy",
 "author": "eG",
 "citation": "Citation:   eG. \"Almost Too Easy: experience with Urinalysis (the NIDA 5-Drug Panel) (ID 3821)\". Erowid.org. Nov 18, 2000. erowid.org/exp/3821",
 "substance": "Urinalysis (the NIDA 5-Drug Panel)",
 "bodyweight": "165 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3821",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 18, 2000",
   "Views: 110669",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently I was offered a job that paid significantly more than the one I had most previously. At this point I had been unemployed for a bit over two months. \r\nEverything was going peachy-keen until I showed up to officially receive the offer. My prospective employer apologetically informed me that they had forgotten to tell me that I was required to undergo a 'drug test' prior to actually starting employment, as required by the company that had recently bought them out. Having been a regular daily cannabis user for the past seven years or so, I figured I was screwed.\r\nAfter several days of despair and depression, I began researching ways to beat a drug test. I had been provided with a Chain of Custody form, which told me that I was getting a 5-drug urinalysis panel (for cannabis, cocaine, opiates, amphetamines, and PCP -- the 'NIDA 5', the most common urinalyses). The Web site for the lab where I was to be tested bragged about their adulterant detection skills (I highly recommend researching the tests and the lab prior to any screening!), so I knew that route was out. They even test for glutaraldehyde.\r\nAfter more research, I formulated a plan using only methods that had been proven to be reliable, with a low margin of error. Being extremely averse to risk with so much cash on the line, I invested $30 in Concentrated Urine (CU) from a fine online merchant, and a few bucks at GNC for B-vitamins and creatine, and CVS for condoms.\r\nThe plan was this: Just prior to the test, stop at a restaurant to use the restroom. Mix one vial of CU with piss-warm tap water (3 oz per vial in an unlubricated condom. Tie off the top. Strap to upper inner thigh, wedged against scrotum, with masking tape, to bring the sample to and maintain it at body temperature. This way I could prick the condom and 'naturally' donate 'my sample'. However, in case this substitution was risky (due to observation), I had Plan B. \r\nPlan B was the usual dilution trick -- drink loads of water. Take a B-vitamin to make the watery pee nice and yellow. Eat some creatine so the lab won't suspect dilution and summarily flunk you (they test for it -- even if you aren't diluting or on drugs, a vegetarian should always eat some creatine before the test). Actually peeing carried a much higher risk, but there were no other options.\r\nI arrived at the lab and did all the paperwork stuff. They looked under my hat to see if I was carrying a substitute sample. (Ha!) I was led to a restroom and told not to flush or turn on the sink until I had donated and handed it over. I was alone and unobserved in the stall. (No Plan B needed!)\r\nI unzipped and pricked the condom, and 'pissed' into the little cup (with a temperature strip on the side of it), making sure to drench all inner and outer surfaces of the cup with piss (take that!). It made a nice realistic pissing noise, and I had enough extra left in the condom to pee some into the toilet ('added touch of authenticity').\r\nI said 'I'm done' and the lady came in and took the cup, scrutinized the temperature, and found it to be normal. A week later I started my job (and have held it a while) so apparently the CU passed the test (for creatine and all). I was alarmed when I mixed it because it doesn't stink -- but it's just really clean pee. I was almost surprised that it worked, figuring that CU might be a scam like those 'detox' products are. It Isn't. This Shit Works.\n\n\n"
}