{
 "title": "Scientific Journey",
 "author": "Dilemma",
 "citation": "   Dilemma. \"Scientific Journey: experience with Anadenanthera colubrina, Cannabis sativa,  & Dextroamphetamine (ID 38231)\". Erowid.org. Nov 18, 2004. erowid.org/exp/38231",
 "substance": "Anadenanthera colubrina, Cannabis sativa,  & Dextroamphetamine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 16:00",
   "0.25 g",
   "smoked",
   "Cannabis",
   "(flowers)",
   "  T+ 18:00",
   "250 mg",
   "insufflated",
   "Anadenanthera colubrina",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38231",
   "Male",
   " ",
   "Not Given",
   "Nov 18, 2004",
   "42391",
   " "
  ]
 ],
 "report": "<p>Methods and Materials: Toasted and pulverized A. colubrina seeds, free of pods, over gentle heat on a fry pan.  This was added in three part to one part of baking soda.  It was then mixed and sifted out with a fine screen.  Stored cool and dry for 6 months, then shaken.  500mg of substance was weighed out, and formed into two lines.</p><p>Route: Insufflated</p><p>Influences: C. Sativa 0.25g smoked, 2 hours previous Dextroamphetamine 10mg slow release oral, 18 hours previous</p><p>Set: </p><p>Feeling positive, scientific and philosophical.  Wanting to experiment, curious and excited.  Enthusiastic.  Im quite high from the cannabis and know that the snuff will rocket me.</p><p>Setting:</p><p>At my own home, no one around and its dark.  Im in my room at my computer.  My computer has its visualization program on, and its screen saver activates to show the streaming stars, set at 200stars.   Listening to a mix of Bob Marley and some deep jungle beats.  House is warm and Im comfortable.  I have a bowl of peanut butter ice cream pie beside me. </p><p>T + 0:00-0:05 </p><p>note that not all of this dose was taken, as nasal burning set in half way, therefore, only 250mg was insufflated.  Nose was blown to eject the bulk of material after two minutes of mucous membrane contact. Intense nasal burning , tears, inflamation, runny nose, excess mucous, light dizzy feeling, euphoria in stomach, mild visual hallucinations set in</p><p>T+0:05-0:30</p><p>Too intense to type, rushes across body, strong euphoric rushes inside, moderate closed eye visuals, textural distortion, distinct tripping feeling, synergism with amphetamine, keyboard and fingers looked distorted and large, I fumbled in confusion with my computer, but not wanting to waste this feeling fumbling, I lay on my bed.  At this point I noticed mild open eye visuals, and strong closed eye visuals.  My mind is rushing, analyzing my life and my future.  I have vivid daydreams of my career, and future scientific exploits.   The marijuana shortens my attention, while the dex lengthens my attention span and the snuff leads my imaginations.  Looking at my screen saver it looks like hundreds of metallic tentacles rolling over each other.  Continual, mild rushes rolled over my body.  I would very much describe most of this as mental euphoria.  My base personality didnt seem to change much though, but my body and soul felt strongly tickled.  </p><p>T+0:30-1:00</p><p>I would take bites from the ice cream pie, and it tasted so wonderful.  A must try experience for a DMT trip.  The hunger was most likely from the cannabis.  In between bites I would think rapidly for a few minutes about biological problems and innovations that I would be interested in tackling.  Everything seemed very attainable if I worked on it.  I felt pleasantly intoxicated and philosophical at this point.  Tiredness was setting in, but my thoughts, dreams and hallucinations kept my mind occupied for the next little while.  I slowly lulled myself to sleep, thinking happy thoughts.   This morning I woke and felt refreshed, a little changed and with a slight buzz.  I feel ready to tackle the day with my new insight.  A must try experience, and I will follow up with a slightly higher dose without other drug influences at a later date.</p>"
}
