{
 "title": "Boring yet Fluffy",
 "author": "Grace",
 "citation": "   Grace. \"Boring yet Fluffy: experience with Cyclobenzaprine (ID 38284)\". Erowid.org. Jun 27, 2007. erowid.org/exp/38284",
 "substance": "Cyclobenzaprine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Tobacco - Cigarettes",
   " ",
   "  T+ 0:00",
   "5.0 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)",
   "  T+ 0:15",
   "5.0 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)",
   "  T+ 1:45",
   "10 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)",
   "  T+ 2:15",
   "10 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38284",
   "Female",
   " ",
   "Not Given",
   "Jun 27, 2007",
   "Views: 41277",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I complained to the doctor of severe back pain and tenseness that prevented me from getting adequate sleep, just to see what I might get.  I ended up with a prescription for cyclobenzaprine.</p><p>At the time that I ingested the cyclobenzaprine, I did indeed have a fair bit of muscular pain in my lower and mid-back.  The doctor and pharmacist both cautioned me against taking it during the day and certainly not before driving or operating heavy machinery, saying that it would cause extreme drowsiness/sedation, and they said to absolutely not drink alcohol while taking it (ha ha...right).  The doc also told me that many people feel woozy the day after taking it and suggested I try it first on a weekend.  </p><p>I had a rather bad case of bronchitis and had just started on an antibiotic (cephalexin) that day.  I had three beers in the early evening just before I took the first dose of cyclobenzaprine, and continued sipping two more beers over the course of the evening.  I drink frequently, so I only had a slight beer buzz as my tolerance for alcohol is high.  I also smoke quite a lot, so I was probably having a cigarette every half-hour or so (yes, even with the bronchitis).</p><p>Knowing that I had to work the next morning, I started slowly, taking the 1/2 pill dose (5 mg) recommended by the doctor (just to see if it did anything for my back).  After about 15 minutes, I started to feel sleepy, but that subsided quickly.  My back felt exactly the same.  I took the other half and waited another half an hour.  Everything felt the same.  Didn't get tired.  About an hour later, I took an additional 10 mg.  It did nothing. Thought I'd smoke some pot, but decided against it since I had to work the next day and I didn't know how it might interact. A half hour later, I took another 10 mg, and still, it seemed to do nothing.  I still felt like I had a normal beer buzz, and my back still hurt.</p><p>I was a bit bored and annoyed by this point, so I decided to forget about it and go to bed early so I could get plenty of sleep.  Then came the only noticeable effect of the drug.  As soon as I got into the half-dream state before sleeping, I felt like I was in the fluffiest, most comfortable bed ever conceived.  Toward early morning, I half-awakened several times and each time, the bed felt incredibly good.  Like I had several layers of goose-down under and over me.  My bed is pretty damn comfortable anyway, but it felt really good, even the covers over me felt different, like I had a big fluffy cloud hugging me.  It was a very nice feeling and I hated to get out of bed.</p><p>So basically, I suppose it does what I asked for: Makes sleeping more comfy when my back hurts.  And not a damn thing more.  The next day, I didn't feel particularly 'woozy'.  Just normal for someone with infected bronchial tubes.  Had a fine day.  The stuff isn't terribly toxic as far as I understand, so I may try a larger dosage all at once the next time and see if it does anything more profound.</p>"
}
