{
 "title": "My Brother Became a Retarded Dinosaur",
 "author": "Sister",
 "citation": " Sister. \"My Brother Became a Retarded Dinosaur: experience with DXM with CPM (ID 38288)\". Erowid.org. Jan 30, 2010. erowid.org/exp/38288",
 "substance": "DXM with CPM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38288",
   "Male",
   "",
   "19",
   "Jan 30, 2010",
   "14968",
   " "
  ]
 ],
 "report": "</p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]  </p><p>I was a seventeen-year-old senior in high school when I spent a week home alone with my nineteen-year-old brother. He had had problems with cocaine in the past, so I always worried about him. But I came home from school one day that week and saw a bunch of empty cough and cold pill packages on the kitchen counter. There were at least 40 pills missing. I found my brother and a friend of his lying on the floor in another room of the house, listening to techno music, completely out of it.</p><p>That week was one of the worst weeks of my life. I hardly slept. I cleaned some random guy's vomit out of a full kitchen sink because he was a first time Robo-tripper and couldn't stomach it. I watched my brother walk around the house like a retarded dinosaur, his arms held close to his chest, leaning forward as he walked on his toes. I fed my big brother his cereal because he couldn't grasp the concept of holding his own spoon. I grabbed the skin on his forearm and it stretched like mozzarella. I saw him contort his body like he was in the Matrix. I watched him lose his mind and then slowly get it back.</p><p>Of course, I told no one. I had no idea that people got high from cough medicine. Unfortunately, now I'm as much an expert as a non-user can be. I have watched my brother since that week and he is not the same person. For a while after he stopped using, his speech was fucked up. His voice was different and it sounded like his tongue was enlarged. He had facial ticks, like someone with Tourettes. They were slight, but I noticed them. It took him much longer to withdraw information from his brain. He lied all the time. He felt horribly guilty and hated himself. For Christ's sake, he was addicted to cough medicine. Who wouldn't hate themselves? He also has since told me that after using coricidin three times in one week, about a week later, he was having sober hallucinations. He would lie in his bed and feel paralyzed. He would feel something underneath his bed, pushing him up. He would jump out of bed, frantically searching for whatever was underneath his bed. He was royally fucked up, and he was sober.</p>"
}
