{
 "title": "God Misplaced My Soul",
 "author": "DontFeelSoGood",
 "citation": "   DontFeelSoGood. \"God Misplaced My Soul: experience with Salvia divinorum (extract - 6x) (ID 38321)\". Erowid.org. Jul 27, 2005. erowid.org/exp/38321",
 "substance": "Salvia divinorum (extract - 6x)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38321",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2005",
   "Views: 3430",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night I had my first breakthrough with Salvia divinorum. It was the fifth time that I've smoked it, but the first time that anything out of the ordinary happened. My first two times were with untreated leaves. They made me a little lightheaded. The next two times, I used about 3/4 leaves with a pinch of 6x extract. This fifth time, I used a tiny amount of leaves as a screen to keep the finely ground extract from falling into the bong. The rest of the bowl was filled with the extract. </p><p>I prepared the Salvia as suggested by others here and elsewhere. I used a bong, torch lighter and kept the flame on the leaf as I inhaled. I held it in for about fifteen seconds.</p><p>After I exhaled, I felt the same lightheadedness of the previous 4 times I used it. Then something new and terrifying. I had this sensation all over my body like I was standing in hundred mile per hour winds. Like my body was being blown away and my blood was boiling.</p><p>That sensation faded slightly and over the next ten minutes or so my peripheral vision was completely blurred. I was sitting and staring at the floor/wall in front of me. I had no sense of vertical or horizontal. Everything was on the same plane - it was all two dimensional. My computer was running on the other side of the room and the fan sounded DEAFENING. It was drowning out my own thoughts. I was also unable to move this whole time. I don't even think I blinked throughout these ten minutes.</p><p>My mind was racing. I was terrified having never experienced anything like this before. For a time I thought that I had died. I thought that my soul had fallen through a crack in the universe. I had a feeling of total isolation, like God himself was unable to find me and that I was going to be stuck in this place for eternity. Stuck staring at this two dimensional vision with the buzzing of my computer fan echoing through my head. I thought that I had unplugged myself from 'The Matrix' and that maybe this was reality. I was thrown into a new world without a physical body and without physical limits and I had no idea how I was going to navigate it. </p><p>After about ten minutes of complete shock I began to be able to turn my head from side to side. I realized that I wasn't dead after all. That's when I noticed that I was standing up. I don't know how I managed to do that without falling over. My body continued to have a very disconnected feeling for the next 20 minutes or so. I was still scared and started sweating like I had just sprinted a mile. I drank some water and sat down until the feeling left me completely.</p><p>Overall, it was a horrifying experience. It was like waking from a bad nightmare that sticks with you for the rest of the day. I had this incredible fear of dying for some time afterward. Thinking that I had already experienced death and the afterlife and it was worse than any description of hell I'd ever imagined. I do not plan to use this drug again.</p>"
}
