{
 "title": "A Near Fatal Decision?",
 "author": "NorthernCalifornia",
 "citation": "   NorthernCalifornia. \"A Near Fatal Decision?: experience with Mushrooms & Thorazine (ID 38350)\". Erowid.org. Feb 19, 2007. erowid.org/exp/38350",
 "substance": "Mushrooms & Thorazine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Chlorpromazine",
   "(pill / tablet)",
   " ",
   "3.75 g",
   "oral",
   "Mushrooms",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "38350",
   "Male",
   " ",
   "Not Given",
   "Feb 19, 2007",
   "34449",
   " "
  ]
 ],
 "report": "<p>Be aware:  what I chose to do was dangerous and should be warned against!!!! Always beware of drugs that you do not know about...</p><p>So yesterday was a normal day just like every other one, with a few exceptions.  One, I had found a bottle of Thorazine in my moms drawer and had heard it was a mood elevator, so I took two of them to get high, which i was.  Then I met up with my friend, and he had the idea of taking mushrooms.  It was a beautiful day in the bay area, and that sounded like a grand idea.  We found the mushrooms as easily as possible, ate them, and headed out to the headlands for an excursion in the sun.  </p><p>My friend decided to take a walk down to the beach and i stayed on our perch, when I noticed the sun was beating down on me.  I was squinting almost uncontrollably and my cheek muscles felt tense.  when he came back, I decided I didn't like where we were sitting, and we started to walk away.  </p><p>This is when I noticed that the squinting wasnt stopping.  In fact, I wasnt facing the sun, yet my face felt like it was permanently stuck in a squinting smile. At first I ignored it, and then i told my friend that I felt something was wrong.  My jaw was moving uncontrollably and causing me to lose my ability to speak clearly, I had developed a lisp.  My friend and I were scared shitless because we had no idea who to turn to.  We started driving when I started to scare myself into thinking I had done irreversable damage too myself - I tried several times to throw up the mushrooms, and when nothing worked I decided my best bet was to ride it out. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>If you are currently suffering through these symptoms, stay calm.  I did the research, and the condition is called Psuedoparkinsonism.  thats right, false symptoms of a disease that makes you lose ALL CONTROL of your bodily functions.  and thats exactly what happened, it got worse, EXTREMELY worse, before it got better.  what began as minor jaw clenching and uncontrollable tongue movements became seemingly complete loss of my voice box, and I suddenly was unable to put together a sentence.  My jaw was pulling itself open and the only comforting thing to do was to continue to push my jaw open.  I thank god for my friend who stuck with me through this because I would've broken down without a friend.  I couldn't allow my parents, or other friends to see me because they would not have understood my condition.</p><p>I'm still unsure as to whether some of the conditions were psychologically kick started or whether the symptoms just simply came to a halt, but the way that the symptoms ended was peculiar.  My friend and I decided it was time to go back to my house and research my condition.  Once I set foot inside my home i was suddenly comfortable, and within moments, I regained all my ability to speak and move my jaw comfortable.  I was sore for the next day or so, at times feeling my teeth clenched together, but the feeling of regaining control of my face was an amazing relief.  I'll NEVER mix drugs that I'm aren't sure about because something worse COULD happen.</p>"
}
