{
 "title": "The Inner Workings",
 "author": "S",
 "citation": "   S. \"The Inner Workings: experience with Salvia divinorum (5x extract) (ID 3836)\". Erowid.org. Dec 24, 2001. erowid.org/exp/3836",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3836",
   "Male",
   " ",
   "Not Given",
   "Dec 24, 2001",
   "Views: 5158",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is based on two combined experiences I've had. The first on a few weeks ago and the second today, which I'm still under the post peak madness off.</p><p>On both these experiences I've smoked 1/2 a bong and on each occasion heard a voice saying 'right come with me, we don't have much time'. On friday night it wanted me to take my couch (which I was lying on) to add to a machine that was being built, at which time I jumped at to do just that, in doing so I opened my eyes, washing away the illusion. Around me the room had taken on a blue tinge and I could hear chattery laughter. </p><p>I then lay back on the couch again, closed my eyes and it was like I was falling past a red brick building with yellow rectangles where windows should of been, this faded after about 30 seconds and it was then I the inside of my mouth went cold and I could taste a metalish taste, I then devoloped the same sensation of cold on my hands, and after a minute my hands could taste the flavour in my mouth. Tonight after i heard the voice entities who's faces I couldn't see started lifting the walls of my room to bits (which I could still see even though I had my eyes closed), I unfortunately couldn't see these beings. Once they had completely removed my room I was left suspended in darkness, until slowly small figures started to appear and dance in front of me. Then about all that happened is it ended.</p><p>I'm quite an experienced drug user, but this was like nothing else, reading all the trip reports in the world will never, never prepare you for it.</p>"
}
