{
 "title": "A Little Extra Something",
 "author": "Budlighter",
 "citation": "   Budlighter. \"A Little Extra Something: experience with Yohimbe (ID 38387)\". Erowid.org. Oct 27, 2006. erowid.org/exp/38387",
 "substance": "Yohimbe",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "2 capsls",
   "oral",
   "Yohimbe"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38387",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 27, 2006",
   "Views: 17985",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm 21 years old and by no means have trouble performing in the bedroom.  However, I saw on a news magazine show that many herbs really can boost sexual performance.  So I decided to do some investigating.</p><p>I was casually strolling through my local pharmacy when I stumbled across a bottle of yohimbe.  It was on sale to my surprise.  Buy one get one even!  That was a deal I couldn't pass up.  I got 2 bottles of 135 500mg capsules for ten bucks.</p><p>Before consuming any of the pills I did a little research. </p><p>The recommended dosage on the bottle stated 3 caps a day with meals.  However, I found in my research many other brand of yohimbe recommending up to 2000mg in a single dose.  I figured somewhere in between would be safe.</p><p>I took 2 capsule with about 12 oz. of water to help the coating on the caps dissolve more quickly.  I then waited 30 minutes.  I called my girlfriend to see if she could come over but she was working.  Disappointed, I engaged in some self-stimulation and got an erection that made me feel like I was built from steel.</p><p>The effects peaked about 2 hours after I initially took the caps and slowly tapered off to my normal, healthy libido after another 2 hours.  Needless to say, I was impressed.</p><p>I tried the same dosage later that night when my girlfriend was off from work.  She told me she noticed a difference in my energy levels among other things (alright!).</p><p>The only unpleasant side effects I encountered were some mild abdominal cramps and I became quite flushed toward the end of our encounter.</p>"
}
