{
 "title": "Incredible Experience",
 "author": "violator c",
 "citation": "   violator c. \"Incredible Experience: experience with Salvia divinorum (ID 3848)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3848",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3848",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 26, 2001",
   "Views: 13845",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI was in for quite a surprise on saturday November 11th. I had heard and read about the effects of Salvia, saw someone influenced by it, then decided to try it for myself. I got a hold of a vial of 10x extract and proceeded to smoke it out of a bong. I took a long hard hit, stood up and walked a few steps away and held the smoke in for over 20 sconds. Within seconds, I could feel its effects on my brain, like a dreamy state. My friend held his hand over the bong to keep the smoke from getting out, giving me a second chance to get the remaining smoke into my lungs. I walked over to the bong with a fat grin on my face (I do remember that) and I tried to hit it again while feeling very disoriented. I immediately coughed out the smoke, it was impossible to hold it in.\r\nI felt a quick rush, and then reality faded out, and I felt as if I left my body. I was suddenly warped in the middle of a circle of people. Some had the face like of my friend, some had no face at all. They didn't have legs or feet, just arms and a body and the odd thing was that they were all connected ,(like an accordion). They began to throw and toss me around like a dodgeball. The feeling I got from this was extremely intense. As I was being hurled in the air, the circle of people began to rotate like a wheel. They began going faster and I, too was being thrown faster, which was even more intense. \r\nI saw a door beyond the circle and I struggled to break free. I made it over top of them and as soon as I opened the door, there was a quick blur and I found myself back in the middle of the circle again. My view faded out again, I felt a powerful jolt and I found myself back in my body again, back in the real world. Even though I was back in my body, I could not control it. I felt as if the world were a big joke and it made me laugh....hard. I felt a benevolent pull of gravity from all directions, it was quite an odd feeling. I tried to sit down and relax, but my body didn't. I ran off into the backyard. It was damn cold that night and I was only wearing a t-shirt, yet the cold weather didn't bother me one bit. I thought, 'what the hell am I doing out here?' I went back inside. I heard someone playing a game on their computer and I thought it said snoop doggy dog, but I know that I was just hearing things. From the time since I came back to reality, I felt an incredibly exhilarating body high.\r\nThese are the things that my friend saw me do that I was not aware of doing (I don't remember doing them) :\r\n-The first thing I did after I became affected was that I grabbed the lamp post and I said  'I am part of the pole'\r\n-I picked up a piece of aluminum foil and asked, 'what the hell is this??'\r\n-I sat on top of the sink's counter-top\r\n-I kept saying, 'they're not real, they're not real'\r\n-I repeatedly mumbled about 'a game'\r\n-I tore out a cushion from the couch and threw it to the floor\r\n-I walked on my hands and knees shouting gibberish and nonsense\r\nThis was an incredible experience for me, but it is an extremely powerful psychoactive that I would never do alone.\n\n\n"
}
