{
 "title": "First For Everything",
 "author": "The One",
 "citation": "   The One. \"First For Everything: experience with Methadone (ID 38492)\". Erowid.org. Feb 25, 2008. erowid.org/exp/38492",
 "substance": "Methadone",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "Methadone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38492",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2008",
   "Views: 20491",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n'First time for everything' they say. Well, this was my first time ever trying Methadone. I didn't really know what it was when I had the pills in front of me. Only had heard the name. So I decided I would look it up to find out what it is and the effects of it. I found out that Heorin users take it to keep from having with drawls. I myself use drugs on a daily basis, and have been looking for a drug that will give me a ride. After reading about Methadone, I thought for sure I found the perfect drug. Oh boy, was I wrong.<br>I took all 3 of the pills I had and eagerly waited for the high of my life. I sat calmly at my computer, chatting and downloading music. After about 30 minutes I started feeling somewhat dizzy and didn't know if it was the pills or if my chain smoking had gotten to me. I tried to pay no attention to the feeling and continued to go about my business until I started twitching and itching and wondered if this was the beginning of the high. I didn't let the twitching and constant itching get to me. I had to pee, so of course, I went to the bathroom. As I stood up, I noticed how everything seemed to appear different, but everything looked the same. I began walking towards the bathroom looking down at the ground thinking about how I felt. I loved it. I felt like running and jumping. Screaming with glee. Well, all this thinking made me NOT think about where I was going and the next thing I knew, I was on the floor. I had done walked right into the wall and knocked myself down on my ass. Looking around for a moment, I started to laugh at my clumsiness.<br>Finally I make it to the bathroom. I sat on the toilet and just thought. I had zoned out for a good 20 minutes. Once I snapped back to reality I noticed I was still in the bathroom and still had to pee. So I went ahead and did my duty and went back to my room. About the time I got to my room, was when it all hit me. I started spinning and getting sick, having hot flashes. My thinking increased and I started thinking about all the negative things that could come from these pills. I instantly went to my bed and layed down. As I lay there, feeling as if I'm about to hurl everywhere, I start thinking, was it worth it? I close my eyes in hope that I will just fall asleep and when I woke up, everything would be better. WRONG!<br>I fell asleep for about 2 hours. I woke up, even more high and fucked up then I was when I had first crawled into bed. I didn't want to move, I didn't even want to breathe. I was on a ride alright. A ride I didn't happen to like. I pushed myself to get up and put on some music, in hope that it would calm me down. There was my first mistake. I got sick, and vomited in the floor. I dropped to me knees because I was heaving so hard. After about 10 minutes of sitting there and five of those minutes which I was puking, I noticed there was music. I couldn't stand up. So I leaned back and let myself fall back into the floor. I felt like I was falling for hours. I was gone. I zoned into the music. I was listening to Into Eternity. <br>This was an odd feeling indeed. Never have I felt such fear and depression from music. I was worried. I started thinking negative thoughts again, and by doing this, I began to trip out. I'm not sure how long I layed there, but I know it was a good while. After I finally came back and noticed I was in the floor, I sprung up and hoped back into bed. I wanted to go to sleep. The sickness had came back. I must have laid there for a good couple hours tossing and turning trying to go to sleep. I closed my eyes.<br>When I opened them back up, it was day. To be exact, it was 5:30 pm. I slept for about 15 hours. After I was awake, I sat up and still felt fucked up, but in a sick nasueated way. I didn't want to get out of bed, so of course, I laid there thinking of the fucked up thoughts and feelings from these pills. Methadone was a ride. Yes indeed it was. Try it again? I'm not for sure. We will just have to see when that opportunity comes again.\n\n\n"
}
