{
 "title": "My Pain and Addiction",
 "author": "Zach",
 "citation": "   Zach. \"My Pain and Addiction: experience with Oxycodone (Oxycontin) (ID 38513)\". Erowid.org. Jun 25, 2007. erowid.org/exp/38513",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38513",
   "Male",
   " ",
   "Not Given",
   "Jun 25, 2007",
   "19115",
   " "
  ]
 ],
 "report": "<p>Having used many opiates (opium, vicoden, percocet, endocet, vicoprofen, morphine, oxycontin, etc...) I consider myself a relatively experienced opiate user. Now I have started using OxyContin on an extremely frequent basis (Pretty much every day), and have found my 'sweet spot' for dosage. </p><p>My first bad experience from Oxy came not too long ago. I had arrived home from work at about midnight, and had a terrible migraine. I sat down at my desk, and got out my bag of pills and took one 40 mg Oxy. Up until this point, I had never insufflated Oxy. To my dismay, the effects were extremely weak, and hardly noticeable. </p><p>At this point my head was feeling awful and I needed immediate relief to take away the pain and put me in a better mood. I chopped up another 40 mg pill and made it into one line with my ID, rolled up a $20 bill and snorted it. I got up to get a drink and by the time I reached the stairs I got hit, and quite hard I should add. I realized moving was pretty much out of the question after about 15 minutes. However, the pain was gone and I felt an overwhelming euphoria, even though I was exhausted and there was nothing to do, I was in extremely high spirits. I then got a little angry that I had been wasting my Oxy taking it orally, but figured what the hell, I still have a lot left. </p><p>After about 2 hours, the euphoria began to wear off, and then I began to feel ill. I had never taken more than a whole Oxy before, and snorting the pills or breaking them up produce a much greater effect than taken whole. I threw up a few times, and then passed out. The next morning I returned to work at about 9 a.m., still feeling sick. I threw up and swore off Oxy altogether. However, when I got home I decided to snort more, but this time only half a pill (20 mg). This dosage I found to be my 'sweet spot', where I felt strong euphoric effects, and minimal constipation/nausea. I usually redose another 20 mg every 5-6 hours for optimal usage. </p><p>I take a good amount, usually 20-40 mg. This dosage allows me to feel amazing, be void of pain, and function in daily life. I still managed to work 40 hours and week and maintain good grades, despite daily use of OxyContin for about a year now. OxyContin is easily my favorite.</p>"
}
