{
 "title": "Should Not Have Dosed Again",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Should Not Have Dosed Again: experience with AMT (ID 38525)\". Erowid.org. Nov 28, 2004. erowid.org/exp/38525",
 "substance": "AMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "60 mg",
   "oral",
   "AMT",
   "  T+ 2:00",
   "60 mg",
   "oral",
   "AMT"
  ]
 ],
 "footer": [
  [
   "1967",
   "38525",
   "Male",
   " ",
   "Not Given",
   "Nov 28, 2004",
   "Views: 14935",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I overdosed on AMT in 1967.  I am a professional chemist and ordered AMT directly from the manufacturer.   The quantity was precisely weighed on the balance in the university chemistry department's lab.  (At that time, 1966/1967, LSD was still legal in England and we ordered some of that directly from Sandoz.) </p><p>My friends and I were among the first to experiment with AMT. Based on a research report in the professional literature, I took an initial dose of 60 mg.  After about 2 hours, nothing much was happening, so I took an additional 60 mg.  Half an hour later, I went on a big trip.  Lots of attractive red/violet/brown hallucinatory animals and people superimposed on the wallpaper and floor, like LSD but more euphoric, not as edgy as LSD.  The colors were more subdued -- mostly brown, purple, red rather than the flashy yellow, green and blue that is typical of LSD.  Then I realize that this was merely the first 60 mg taking effect and that the second 60 mg had not even begun to work.  My body weight at that time was 150 lb.</p><p>I became apprehensive and told my friends that I had probably overdosed.   When the second dose kicked in, I started shaking and sweating profusely.   My pulse rate went up to about 220 per minute and I felt certain that I was going to die.  I remember my friends standing around me discussing where to dump the body -- in a nearby canal or in a ditch in the countryside.</p><p>By then the hallucinations had stopped and I went through two time dimensions.  The first was where time stood still.  The next was where I could move forward and backward through time at will.  My experience was that of being in a 'hypercube' superimposed on normal reality.  I projected myself forward and saw that I was still alive after 10 hours, so I told my friends that I would not die and that everything would be okay.</p><p>After a while the shaking and sweating subsided and my pulse slowed down and I began to take stock of where I was.  My trip consisted of zooming forwards and backwards in time, exploring the time continuum.  My 'speedometer' was a clock, and I watched the hands literally spin forward and backward as I accelerated or decelerated through the time continuum.  It was an amazing sight, watching the hands actually rotate backward -- not an hallucination.   As this was happening, the people in the room were zooming around going forward in time or retracing their steps.  After what seemed a very long time playing with the time continuum, I finally started to come down.  I popped out of the hypercube and spent a few hours watching the hallucinatory figures on the wallpaper and floor. The trip was much smoother than LSD, no anxiety or fear -- even when I thought I was going to die.</p><p>It took me several days before I was able to sleep, and about 3 months before I felt completely down and back to normal, to the point where I felt I had completely come down.  During this period, I felt 'displaced' from the everyday world as if everything wasn't quite real.  Knowing about the two additional time dimensions was difficult to integrate into my normal life and I felt as if I was 'living a lie'.  Gradually this feeling wore off and I felt more comfortable living in linear time. There was no apparent brain damage and I continued my work without any loss of mental ability.</p><p>In spite of this experience, I really enjoyed smaller doses of AMT. I used it several more times at lower doses (15 mg to 40 mg) and found it a very pleasant and rewarding experience without any side effects apart from the initial nausea.  A very nice euphoric psychedelic, not as razzle-dazzle as LSD but without the edginess and anxiety that sometime happens on LSD15 mg induced a euphoric contemplative non-hallucinogenic state that we called the 'philosopher's stone' in which the world seemed bathed in a mellow golden light and creative thinking was enhanced.  25 mg was the threshold for hallucination.  AMT takes longer to come on than LSD -- about 3 hours, and lasts about 10 hours.  Although I stopped using psychedelics in 1969, if I were ever to do another trip it would be AMT -- which I understand was still legal until a few months ago.</p><p>AMT is not to be trifled with. I think its really important to wait </p><p>3 hours before taking a second dose, especially if food has been eaten.  In </p><p>view of the fact that AMT is slow acting, 2 hours is not enough time -- as </p><p>in my own case.</p>"
}
