{
 "title": "Cure for Bad Trips?",
 "author": "Spiritual quester",
 "citation": "   Spiritual quester. \"Cure for Bad Trips?: experience with Mushrooms & Valerian (ID 38576)\". Erowid.org. Oct 28, 2009. erowid.org/exp/38576",
 "substance": "Mushrooms & Valerian",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 g",
   "oral",
   "Mushrooms",
   "  T+ 0:15",
   "1600 mg",
   "oral",
   "Valerian"
  ]
 ],
 "footer": [
  [
   "2004",
   "38576",
   "Female",
   " ",
   "Not Given",
   "Oct 28, 2009",
   "7869",
   " "
  ]
 ],
 "report": "<p>A couple weeks ago I decided it was a good time to give up drugs because I was starting to have some severe health problems that might have been caused by the drugs. However, I've been under a lot of stress lately and found my-self needing a release. I was deathly afraid to take anything that would make me loose all self control but the only thing I had available was mushrooms. I quickly threw them in my mouth and sucked them for 15 minutes as I waited to the first sign of abandon. Yet, after 15 minutes there was nothing so I swallowed them and figured I was at a loss. I was also having a severe mania attack at the time (I'm Bi-polar) and needed something else to help that. The mushrooms would make my mania worse and I was very scared to see the consequences of my irrational dission.</p><p>I had resently read a ton of information concerning the use of valerian in psychotropic context. Based on my readng I decided that using a substancial amount of valerian would relieve my panic attack and also keep the mushrooms from causing any unwanted 'bad trips.' I took them both within 15 minutes of each other and simultaniously felt their effects within an hour.</p><p>When I started to feel the effects of both drugs mixing I found my-self on a couch with my sister in our house. I felt heavy yet excited. I was giddy and not afraid to voice my-self. However, the most interesting thing by far was that every time I began to feel panic or intense fear caused by the shrooms, the valerian took hold and IMMEDIATELY calmed me down. Also, it seemed that valerian took some of the shrooms high away from me but this wasn't really all that bad since it was replaced with extreme drowsiness. </p><p>Later on that night I was laying in bed and found my-self experiences symptoms of ego death for the first time in my life. Normally, I couldn't achieve ego death on mushrooms because I wasn't calm enough. Valerian calmed me down enough to EASILY have access to ego death.</p><p>Also, I have a pretty intense heart condition (reason why I stopped) but amazingly felt no pain at all last night. This is the first time in the last two months that I have been pain free while high on anything.</p>"
}
