{
 "title": "Visions from God 'Oohoohoo'",
 "author": "Darren",
 "citation": "   Darren. \"Visions from God 'Oohoohoo': experience with Mushrooms (in chocolate) (ID 38570)\". Erowid.org. Sep 27, 2005. erowid.org/exp/38570",
 "substance": "Mushrooms (in chocolate)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38570",
   "Male",
   " ",
   "Not Given",
   "Sep 27, 2005",
   "Views: 3387",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I went to a buddy's house over the weekend as a sort of vacation.  He was supposed to call off from work so we could hang out but he never did so I had to chill in his house alone aaaalll day long.  He gave me some chocolates with a quarter of shrooms in them and told me to have a good day, I agreed and said gracias and I was on my way to have a good day.  Please understand that I have only tripped a handful of times and everytime I did I would put strange concepts in my mind and think about them the whole time so I would create a mammoth headfuck for myself.  Hehe it was alot of fun until I reached what I have always believed to be 'the edge'.  </p><p>So he leaves for work, his girlfriend leaves, and the roommates leave to go get beer and other errands.  I sit alone eat the mushrooms and decide to watch FINDING NEMO because I wanted to know how a family related concept mixed with a life in the ocean was like.  So finding nemo starts and so does the trip.  Everything was all cute and cudly until the barracuda in the beginning when the wife and children get eaten.  At that point everything turned to shit I no longer wished to be a fish in the ocean.  The sharks and the clear and present danger of being a fish in the ocean had made me very ill and I decided to distract myself from this terrible lifestyle of a fish in the ocean.  So I reached onto the floor with my one hand and turned it into a strange little animal for him to walk strangly but spider-like on the floor.  The carpet was shaggy so it made for cool open field effect.  Then as my little hand creature was walking around some damn thing just popped into my head the concept; heaven and hell.  </p><p>As soon as this idea popped into my head I had such a frightning feeling shine from inside me.  I said aloud to myself 'no, no darren dont think about this no good will come of it.'  Weeeell I couldnt stop I just had to go there I could not distract myself from this perfect chance to trip balls and ponder GOD. The next thing I know I have to puke.  And I mean this is a serious problem I MUST puke now for all that is sacred.  So I run upstairs and I sit on the edge of the bathtub with my face over the toilet and I let it FLYYYYY! I opened my eyes and looked into the toilet and saw a pretty brown (that was the chocolate :)) spiral galaxy twirling in the water with a sort of translucent cloudlike structure trailing it.  Then I close my eyes and rest on my knees and then I saw it...</p><p>Three MASSIVE golden pyramids made of perfectly cut brick, the largest in the front the two others at either side and to the back in the distance.  They were twinkling so beautifully it really was breathtaking.  They were all twinkling upward to the sky and the point of view scaled the pyramids to a smoky sky that was red and pearl towards the edges from the centered sun. Then I heard the voice (of course there just haaad to be a f***ing voice talking to me DAMNIT!!)  The told me about heaven and hell which basically summed up the point that, with respect to our lives, you get what you get then you die and get to experience what nothing is.  Then the voice explained to me that I must save others by showing them the glory and the healing powers of art (art in general).  Then I made very fast other prophets connections in example moses.  I felt like moses maybe felt when he heard the voice of god.  Yea whatever I bet his was much better but whatever this was how I felt.  </p><p>So then I cant handle the bathroom anymore and I lay in the bed.  I close my eyes and see a slideshow of faces of different races.  All saying 'PROPHET FROM GOD!'  as they zoom past me.  Coming down off of this trip I finally decided what I was going to think about all this.  I decided not to be the crazy guy that runs around saying god talked to him and yada yada.  You know what these people are like every town has a legendary person like this and quite honestly they are looked down on.  So I decided to call it a fluke and turn my back on the concept of heaven, hell and a god who is consciously controlling where we go after death.  Turning my back on god took about a week in total but I finally got over it.</p><p>And now comes the part where I try to make sense of this friggin experience.  Well....I find no coincidence that the concept (which my writing above does no justice) of heaven and hell is the same damn thing that I thought was right initially before the trip.  So woopdeedoo.  I also find no surprise that I am totally obsessed with art.  I swear to you I am all about it and it helps me cope with the pressures in life.  It is a sort of tool I use to bring me back to the neutral. Whether writing, painting, photography, or my favorite researching all these different focuses in art and trying to find and learn about the best ones.  Whatever.  And as far as the guiding light voice.  I dont know if you ever noticed this but I have a voice that narrarates myself my entire life.  It is the one that says the alarm is going off get up and go to work.  And it is the same voice that speaks when I am thinking or writing a long story.  So essentially this is what I think this all was.  </p><p>So maybe I really was touched by god and I am a fool for believing it was all in my head or perhaps the planet Earth really is the insane asylum of the universe.</p>"
}
