{
 "title": "The Illusion of Autonomous Existence",
 "author": "Heretic",
 "citation": " Heretic. \"The Illusion of Autonomous Existence: experience with Salvia divinorum (5x extract) (ID 38596)\". Erowid.org. Jun 22, 2007. erowid.org/exp/38596",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38596",
   "Male",
   "",
   "Not Given",
   "Jun 22, 2007",
   "2996",
   " "
  ]
 ],
 "report": "<p>An Important Introduction:</p><p>The first time I tried salvia it was a pretty intense experience. I had heard about it before, but wasn't really too excited about it. I have taken hallucinogens on a number of different occasions, including shrooms, acid, dxm, etc. but I never actually enjoy it that much. The idea of hallucinating is so much more appealing when youre sane and sober; unfortunately, you have to endure temporary insanity in order to receive these sorts of visions. Still, I've always been ok with that because despite the fact that I don't like being crazy, I do believe that crossing over into the realm of altered consciousness provides a number of extremely important revelations, whether they be spiritual, sociopolitical, or individually/existentially introspective.</p><p>Anyway, salvia can be a great tool for this type of thinker, especially if the individual is not prepared to give themselves over to the possibility of having a bad trip. Therefore, salvia is perhaps the better choice for those of us who are experimentally cautious, seeing as how its effects last only about 10-20 minutes, and yet the revelations can be just as profound and pervasive.</p><p>And Now On To The Experience:</p><p>So I took five (at least I think it was five, I can't exactly remember) pretty large hits of salvia 5x from a bong I made out of an empty water bottle and some duct tape. I could see the smoke entering the litre bottle because of the way I set it up, and by the second hit when the smoke poured in I imagined it like it was a huge waterfall; tremendous quantities of smoke seemed to be filling the bottle and it all looked so smooth, so full. After the third or fourth hit I remember looking at the glowing embers still left inside. The glowing embers looked like big bright eyes taunting me with their very existence, as their presence indicated that I had not smoked everything in the piece. After my last hit I sat for a second as the effects hit me like a train. </p><p>It felt as though my body was being pulled apart in all different directions, though not necessarily in a bad way, and yet the ground felt like it was caving in on itself as though all of a sudden there was an earthquake occurring in the middle of my kitchen floor. I got up and ran through my dining room and into my living room, all the while racing against this earthquake which was obviously following me, seeing as how the only thing caving in on itself was my mind.</p><p>I sat for about a minute and all I could think of while I sat there at first was 'Wow, this is . . . wow!' Then after a little while I began looking at this blanket that we have draped over one of the chairs in our living room. It's a bunch of human figures in the shapes of letters. The one that caught my eye - and this was entirely arbitrary - was the 'W'. Because of its shape I started to imagine a sort of waving chain, like a light or sound wave, where each wave is a separate link. I saw this chain moving in a semicircular pattern, although there was no beginning and no end so far as I could see. Each 'link' or set of waves on this chain represented a different person inside of myself.</p><p>There was no longer any such thing as 'me' in the singular sense. My existence had been broken up into hundreds of different me's, and we were each talking with the others; essentially it was like different facets of myself communicating with each other, recognizing their individuality for the first time, and yet recognizing that no single enitity could actually make up a living thing on its own or by itself. There was no such thing as 'the core of my being', because who I was as a person was an existential conglomerate of necessarily unique and equally important parts.</p><p>I remember that there was one of the links that was a mix of red and blue while all the other ones were different shades of grey, and to the best of my knowledge that blue and red link was the notion of my single, autonomous existence. I remember trying to capture that piece and hold onto it, but every time I tried it only pulled away to join its natural procession in the united link parade. There were two rows of waves/links, seen as though I was looking at two mountain ranges, one a little lower than the other, extending into distances that I couldn't see fully, but I'm pretty sure that at the time I assumed they connected at each end, making a great oval, stationary in its shape, but with every link moving together in its circular march.</p><p>For some time now I have been leaning toward a more Hindu idea of human existence, especially when dealing with individuality and personality. I'm not sure whether this philosophy is universal in the realm of Hinduism, as it is a rather diverse religion, prone to complication whenever a person tries to say 'This is what all Hindus believe'. Still, one Hindu idea of human personality is that each 'individual' is not really an individual at all, rather a person's personality is an intricate makeup of unique masks that they wear on different occasions. Each mask represents not just a characteristic of that person, but an entire personality of the individual. Some are more like others, and some are more compatible when paired next to each other, but there is a distinct difference that lies in each one, and no single mask tells either the single truth or the entirety of a person.</p><p>Therefore, when someone says 'That's not who I am,' with regards to something they said or did, they're lying, or at least it's fair to say that they are wrong, whether or not they know it. We are different people at different times, depending on particular circumstances. The only thing that can define our 'true nature' or 'who we really are' is the entire box of masks. Albeit some masks are more prominent, and perhaps even more important, than others, each and everyone counts; they are all extremely important to the personal makeup of all of our 'individual' existences. </p><p>By the way, I used to be a rather conservative Christian; suffice it to say my ideas have changed quite a bit over the last few years with much of the credit due to psychoactive substances and their revelations. I would like to say that I still value faith in Jesus Christ very much, and following His messages/instructions is one of the greatest and wisest decisions one can make. I just believe that we as a people ought to expand our minds and/or souls using a myriad of different tools and methods that that will allow spirituality and human existence to reach us and be revealed to us in all sorts of ways.</p>"
}
