{
 "title": "Divine",
 "author": "Broken_9",
 "citation": "   Broken_9. \"Divine: experience with Salvia Divinorum (ID 38605)\". Erowid.org. Feb 26, 2008. erowid.org/exp/38605",
 "substance": "Salvia Divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38605",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2008",
   "Views: 2463",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had 5 medium sized bowl packed hits layed out ready to go. I started with the first and the feeling hit me almost instantly. I remember standing up to blow the smoke out of my window and feeling a bit woosy and light-headed, not uncommon while holding your breath and standing up, so I loaded up another bowl. The second bowl brought me further into the experience. I couldn't even stand up to blow the smoke out the window. It's what's called 'salvia gravity' or so I've read. My body felt like it was being pulled in all directions, but the only comfortable one that I could go was straight down onto my bed.</p><p>I then proceeded to load a third bowl and I put on 'Thirteenth Step' by A Perfect Circle. Wow. I remember feeling as though I were drawn into my MP3 player and infused inside the music. Find the song 'Halo' and 'Vanishing' if you can and imagine being thrust inside the music itself. I then took the headphones off not wanting to experience just a good musical trip. I took the third bowl and held it in for a good 40 seconds or so. My entire body began to buzz and vibrate and felt as though my limbs were drifting away from me. Then, I watched as the books on my bookshelf started to breathe and the words on their spines vibrate and move in small circular motions. </p><p>Then that's when the Dali-esque visions started to occur. The bookshelf and wall started to melt like wax or paint if you will. I have wood paneling in my room and the grain of the sections started to ripple like water. Have you ever seen the movie 'The Cell' with J. Lo? Well, there's a part where a cow is dissected by glass then stretched apart revealing its sections. That's what the paneling did in my room. The sections all spread apart and dissected the room into about 40 'pieces' with nothing but black space in between. THAT was trippy. I didn't see god or 'Sally' or what have you, but I did feel a presence that I can't quite explain. The shadows of my poem would be the best description I could give of it.</p><p>This all lasted about 20 minutes or so. Then there was a time, ~45 minutes or so, that I felt like I was still between reality and whatever place I had come from, but I was aware that I was in my room and all was ok. That's when I decided to write the experience down in an attempt to make sure I remembered it. Here it is:</p><p>Salvia Divine</p><p>My hands dance upon the ceiling,</p><p>as I lie in my bed, </p><p>slowly swirling puddles,</p><p>cascading in my head.</p><p>Ive become two dimensional,</p><p>floating water,</p><p>dripping wet,</p><p>this feeling - non conventional.</p><p>I float among angels,</p><p>I listen as they sing,</p><p>what horrible thoughts,</p><p>do these tones bring.</p><p>I witness my body,</p><p>as I float above,</p><p>I feel my limbs,</p><p>beginning to buzz.</p><p>the books they laugh -</p><p>a concerning defeat,</p><p>my legs fall to the sky,</p><p>chasing my feet.</p><p>I feel this metal,</p><p>within my soul,</p><p>I watch intently,</p><p>as my body, again - becomes whole.</p><p>I swallow the air,</p><p>it comforts me so,</p><p>as my throat clenches,</p><p>never to let go.</p><p>my heart races -</p><p>feel this thump,</p><p>goddamn my feet,</p><p>resemble a stump.</p><p>my arms branch forth,</p><p>collecting a cool wind,</p><p>my fingertips blistered by the sun,</p><p>once again.</p><p>Im pinned to the floor,</p><p>circles - stars - blue,</p><p>oh, goddamn,</p><p>I shouldnt have tried to move.</p><p>I dance amongst the shadows,</p><p>they caress my skin,</p><p>'come...' they whisper,</p><p>'come on in...'</p><p>I find the path,</p><p>I tremble - I fear,</p><p>I hope that I dont,</p><p>leave myself here.</p><p>I drift from reality,</p><p>this current of color,</p><p>my body in stasis, </p><p>above it I hover.</p><p>I descend rapidly,</p><p>I writhe and spin,</p><p>my mind and body,</p><p>whole - one, again.</p><p>I settle down,</p><p>a blank stare on my face,</p><p>I did not move,</p><p>yet I left this place.</p><p>I blink my eyes,</p><p>I glance at the time,</p><p>damn what a trip,</p><p>Salvia Divine!</p><p>I smoked all 5 bowls within a 35 minute period, but had very minimal effects after the third. It just made the lights and shadows a bit softer around the edges.</p>"
}
