{
 "title": "Black Outs and Refrigerators",
 "author": "Adam",
 "citation": "   Adam. \"Black Outs and Refrigerators: experience with Tiagabine (Gabitril) (ID 38619)\". Erowid.org. Jun 12, 2006. erowid.org/exp/38619",
 "substance": "Tiagabine (Gabitril)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "72 mg",
   "oral",
   "Pharms - Tiagabine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38619",
   "Male",
   " ",
   "Not Given",
   "Jun 12, 2006",
   "Views: 6869",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 72 mgs of Tiagabine is considered a high dose ]</p><p>Well it started off there was a hurricane approaching my town, and as always, a hurricane party was initiated. Since we didn't have any substances and the dope man was currently out of commission because of the storm, we turned to a bottle of Gabitril which my friend is prescribed for bi-polar disorder.</p><p>All I can say is WOW.</p><p>The pills were 12mg each and I immediately popped 4</p><p>About an hour later, I was twitching in the backseat of my friends car talking complete gibberish. I thought I was having a seizure.</p><p>As we were driving I was completely oblivious to everything that was going on around me. My brain knew what I wanted to say, but whenever I opened my mouth all I could say 'Oh, Fuck Yeah!'. My brain felt like silly putty and I was completely annihilated in ways I can't even explain.</p><p>When we got back to the house, my stupid ass decided to eat 2 more Gabitrils. Everybody else I was with was taking more too. Next thing I know, it's 12 hours later, the house is completely trashed, Im waking up and still twitching. My friend shit himself, and a couple of the girls urinated in random parts of the house. I was told I had gotten up and ejaculated all over the refrigerator.. </p><p>All in all, it was fucking insane and kind of awesome at the same time.  The day after the incident, I had an awesome afterglow feeling which made me very content and carefree.  I have vowed to never take Gabitril again, as it is a very evil drug indeed.</p>"
}
