{
 "title": "Slow Visuals",
 "author": "Madcow1041",
 "citation": " Madcow1041. \"Slow Visuals: experience with Zolpidem (Ambien) (ID 38621)\". Erowid.org. Mar 29, 2006. erowid.org/exp/38621",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38621",
   "Male",
   "",
   "Not Given",
   "Mar 29, 2006",
   "18496",
   " "
  ]
 ],
 "report": "<p>This being my first report, and seeing as though I don't remember much about what I did while I was on this substance, I won't take long with this report.</p><p>For a long while, my friend (who is an insomniac) had been taking these pills.  Every night she would get really funky on this stuff and made it sound like a nice experience for me to try.  She actually exaggerated on it a tad bit, saying that her 300 lb. guy friend had taken this stuff and started freaking out with 5 mg.  Now this made me a little wary at first but after thinking it over, and seeing as though she takes 10 mg every night and is only about 112 lbs. I decided to give it a go.</p><p>I had taken the pill at about 11:30 PM just as I got home from hanging out with her and a few other friends.  She had given me 10 mg to try, and I was ready.  I downed the pill and continued on with using my computer.  All of a sudden, after about 15 minutes into waiting for something to happen, my screen seemingly started melting.  Being the casual psychonaut that I am, it was a little shocking, but nothing too drastic.  I felt kind of spacy and also lightheaded but not in a negative sense.  It was relaxing.  I would watch the Instant Message windows on my screen move around like I was watching a movie and they were the actors.  Quite funny and amusing.  After a while, I decided to give my friend a call and share my experience with her.  At that point, I tried to get up, where I found it sort of difficult, but once I was up I was up.  Walking was a very different experience.  Every time I took a step it felt like my feet were slamming on the ground very fast and hard, but my limbs weren't weighted down at all.  And, contrary to what the drug is actually supposed to do, it made me giddy and hyper.  So I just kind of walked around in a circle watching things melt and move around in ways they're not expected to (elasticity =).</p><p>After about an hour and a half, I got the wonderful idea of scrounging up what little resin I had left in my bowl from a long time ago.  I took a few tokes, until I felt too lazy, and waited a few minutes.  THAT was a weird experience.  It felt like they were supposed to go together, and/but I could tell that I was on two different substances at the same time.  Quite nice.</p><p>Overall this was a very pleasant experience.  A mostly light visual/physical high.  A little light on the visuals side, so next time I expect to try 20 mg with a nice bowl of good bud.  But, with all said and done, the best part of the experience HAD to be the depth of sleep I got that night.  It was one of the best sleeps I've had in months =).  I reccomend this for anyone who likes a mellow, chill at home kind of high, although a person who is just getting into psychedelics might want a sitter just to be safe.</p>"
}
