{
 "title": "Soma Analogue Potions",
 "author": "Quetzalcoatl",
 "citation": "   Quetzalcoatl. \"Soma Analogue Potions: experience with Amanita muscaria & Brugmansia (ID 3863)\". Erowid.org. Mar 6, 2001. erowid.org/exp/3863",
 "substance": "Amanita muscaria & Brugmansia",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Amanitas - A. muscaria",
   " ",
   " ",
   "0.5 g",
   "oral",
   "Brugmansia",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3863",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2001",
   "Views: 22123",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nUpon finding and foraging amanita muscaria var. formosa mushrooms in my area, I decided to concoct an admixture of the mushrooms with the leaves of a brugmansia plant.  I had previously used the brugmansia plant in ayahuasca, and decided to pay homage to the plant by using it this time in mushroom tea.\r\nI took one dried orange fly agaric mushroom, which weighed about 1 gram, and three and a half dried brugmansia leaves, about a half gram of plant material, and decocted the substances twice, each time in solutions of about 1 part lemon juice 3 parts water.  The yield was about a cup of yellow potion, which went down easily.  \r\nSoon after ingesting the brew, I noticed definite tropane alkaloid / muscimol-ibotenic acid stimulation.  I felt almost drunk, but experienced more dreamy K-like sedation, with mild hallucinations.  Also, my pupils were immensely dilated, and I felt a sense of pseudo-power, which is typical of amanita intoxication.  The voyage lasted for about five hours, after which I fell into a deep sleep.  The only negative side-effects I experienced were an extreme case of cottonmouth.  \r\nThe admixture of brugmansia/datura plants and fly agaric mushrooms could conceivably be used to yield a variety of Soma-like potions.  I suggest using the most careful methods in identification when foraging and the most cautious dose controls to avoid poisoning.  Use your heads!  With the right people involved, we could se a whole Soma resurgence movement.\n\n\n"
}
