{
 "title": "Power and Commercials",
 "author": "Autumn",
 "citation": "Citation:   Autumn. \"Power and Commercials: experience with Nitrous Oxide (ID 38649)\". Erowid.org. May 2, 2007. erowid.org/exp/38649",
 "substance": "Nitrous Oxide",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38649",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2007",
   "Views: 17911",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI will start out with some background: I am 14 years old, and today i had my first experience with laughing gas in a hospital. I had an upper and lower endoscophy, which is when they stick a camera down your esophaguas and up your ass to take pictures of your insides, and they put me on laughing gas during the procedure. \r\nThe doctor put a sort of cup over my mouth and nose and told me that this was laughing gas, and it might make my ears ring. I  did not notice my ears ringing, and I also did not notice any of the effects until about 20 seconds had passed.\r\nThe doctor standing over me asked me a question, and I stared up at him, and when I opend my mouth to answer the question I noticed that I couldnt hear my voice inside my head which compleetly freaked me out. It was as if I was not there, and there was just another person speaking exactly what I was thinking, and I could hear them talking. For a few seconds this was just freaking me out that I had no control over my body, but then I realized that this was supposed to happen because I was on a drug, and once I accepted it I felt much better. As laughing gas got its name, I was laughing every time I talked, but I didnt think what was happening was funny, unlinke on pot where everything is funny, this stuff just made me laugh.\r\nI then noticed how numb my entire body was, and that the only part of me that was real was my brain, and my thinking. It got me kind of mad at my body for being so fucking sick all the time and making me do this procedure, while my thinking head wasn't even attached to my body. Now that I think of it this was a pretty logical thought. At this point, I was very interested in how my voice wasn't attached to my body, and wasn't under my control, and I was becoming quite talkitive. I told the doctor to give me more, and said I could feel everything, even though really I was numb.\r\nAt this point it got pretty psychedelic. I closed my eyes, and the last thing I looked at before I closed them was that doctor standing over me. I felt like I was an enzyme or something and when I closed my eyes, I went to this other world, and I was helping all these heads of the doctor: there were just all these heads floating around in this diagonal line pattern, and they were helpless, and I went to each one and gave them power, so they could take over the world or something like that. \r\nThen I opend my eyes, and freaked out rembering that I was having a procedure and I was on some drug, and had no idea what was happening to me. I guess the doctor saw I had opened my eyes and he started talking to me, but I got so mad at him. I tried to yell at him for making fun of me when he knew I couldnt control myself on this drug, but I coudlnt even control what I was saying at this point. Or maybe I could, and it just didnt sound right, I coudlnt realy tell what I was saying besides what I heard outside my head, rember, --but after 2 seconds at yelling at him I coudlnt say anything, just laugh, which was somewhat frustrating. \r\nI then got compleetly distracted from my anger when the doctor asked the nurse helper person for some tool, and then moved his body towards her, then shifted back to me. He kept doing this same exact movement over and over, in the same time, so it came into a rythem. I closed my eyes again, and continued seeing the doctor making those rythmic movments, and I started hearing music in the background too, untill I realized it was this commercial for Fuse, (This was not a real commercial, I just made it up in my head), and I realized I was watching a commercial, and then I opened my eyes and the doctor kept doing the same movment over and over, and I was like 'Ooohh, the person who came up with the comercial was probly on laughing gas when they got the idea!'\r\nI then opend my eyes, and freaked out again until I saw the nurse and decided to close my eyes and help her take over the world. I closed my eyes and helped each one of her heads have more power. I then opened my eyes again and saw her, and tried to help her have power, but I couldnt give her power, so I laughed at her because she was so pethetic, and would never have power, while all of the others of her heads did have power. \r\nI think after this point they either put me on a heavier suddative or I just fell asleep. When I woke up, I could still smell and taste the laughing gas, I was neaseaous, my throat hurt, and I could not make myself stop coughing. Some of these symptoms may have been becasue of the actual procedure. Every time I coughed it tasted like the laughing gas, and stil right now I can taste it. Also, my nose is running a lot and when I blow my nose the smell comes back. Its not that great of a flavour, but its not terrible: kind of sweet, kind of almost like pot in that sort of weird way, cant really expliain it I guess.\r\nI must say this stuff had a much stronger effect on me than I expected. I guess because it was in a hospital I was expecting less of a dislocated mind, and more just boring hospital numbness. I would almost call it psychedelic, and I think Nitrous Oxide is deffinatley underrated. I dont see how people say it is addictive like coke though, but maybe they just gave it differently cause it was a hospital.\r\nI dont know if it would be worth doing for thrills, but if I had the choice I would deffinatley do it again in a doctors'\r\nOh and by the way, it never did make my ears ring, forgot to say that.\r\n*peace out\r\nrock on*\n\n\n"
}