{
 "title": "Two Blue Perforations in Reality",
 "author": "polymerslug",
 "citation": "   polymerslug. \"Two Blue Perforations in Reality: experience with Mushrooms - P. cubensis & Cannabis (ID 38659)\". Erowid.org. Dec 4, 2004. erowid.org/exp/38659",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "3.6 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   " ",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38659",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 4, 2004",
   "Views: 9652",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am an 18 year old college student at an art school in Santa Fe, new mexico, experienced in experimenting with psychedelic substance and other traditional shamanic practices such as sensory deprivation and starvation as means of achieving hallucinagenic states. Though having experienced a number of psychoactive drugs in a whole multitude of different settings and situations, I often find recreational drug use as somewhat irritating in a social context, particularly entheogenic mushrooms, which have a proclivity for reducing conversation to nonsensical inconsequence. This was my sixth mushroom trip, though the first in Santa Fe. My 5th had been a most pleasant experience, where I had experienced, at peak, my highest level of hallucination - shifting bars of inverted primary colors, their scheme was of neon, flourescent bands of lime greens, hot pinks, dark purples, indigo, and sky blue. I had irregular breathing for a spell, and elements of the painting I was working on took on a subtle, but unnatural and noticable glow to them. Conditions had been pleasant at the time.\r\nThe circumstances were, understandably, different as is always the case when one changes setting - particularly one as dramatic as the midwest (I'm a Kansan by origin) to the southwest. I love it here, geographically, and love to hike the mountain ranges, useless pork-barrel legislation dams (Gallisteo Dam to all NM readers, is decidedly a great place for drug addled isolation) and vast arroyos along the riparian line. Unfortunately the winter months cause much limitations, and I was thusly forced to experience the duration of the trip in my dorm room. I fasted 3 days in preparation and ordered a vegetarian schlotzky's sandwich to consume immediately after the mushrooms (most recount having to mix them with foods in order to negate their otherwise hardly pallatable taste - I don't think they're bad at all, and have little difficulty eating them). Before taking them, I called a girl who had expressed interest in hanging out and was interested in taking mushrooms for the first time herself in the near future, so I thought it would be a good time to impart my knowledge on her.\r\nUpon her arrival, I ate half the bag (1.25 grams) and we decided to take a drive and smoke a few bowls as they came on (I'm accustomed to doing this, as it expedites and eases the onset.) When you fast, things hit you quick, and I felt it strong. regardless I was in control of my faculties and enjoying a fine conversation with my friend. (I hadn't really hung out with her much alone before. It was pleasant to solidify  a new relationship.) This put me at ease, and the makings for a beautiful NM sunset were setting in. We went back to my room and talked for a bit more as I ate my sandwich.\r\nShortly after that, my vision became fixated on the wooden planks of my cabinets - something I recognized quite distinctly as the onset of the trip. I told her I was beginning some of the stages, and considering she had yet to watch someone trip, I told her she might want to leave. she understood, and I had made my intentions quite clear to her and others in my dorm that I would be ingesting some fungus and working on an art project I had started. They understood, as I'm a private sort of person, and gave me my solitude. I had designated a separate space for the mushroom trance - it's good not to attempt to follow any preconceived pattern or idea and just leave it to distinguish its own form, I've learned. I popped in Aphex Twin's masterful Richard D. James album as I knew it would put me in a comfortable place for the time being and felt the effects increasingly come over me in waves.\r\nI had begun to question my decision, as the potency of these mushrooms had been revealed to me through the trips of 2 of my hallmates I had 'sat' for - particularly my neighbor, who despite being a good 150 lbs. heavier than I, rocked his cazbas with half the dose. he hadn't fasted either. These appeared to me to be outdoor grown as well, as their onset was considerably delayed. After some time of coming up, the onset began. I felt myself immediately in the same place as I had been at the peak of my last trip, though no complications with breathing arose. The familiar bands of color were there, however, and a similar shaking, and apparent breathing quality of the eyes came on. Richard D. James album was becoming a little too fast paced, and I quickly put in a favorite album, Stars of the Lid - The Ballasted Orchestra - an hour of slow, organic ambient movements and noises from the Austin, Tx. duo. This album to me represents the ideal soundtrack to a trip. I felt a slight wave of nauseau and opened a trash bag in case I needed to vomit. \r\nI looked outside and the sunset was in full glory - the staggered clouds were an intense red, and there were what seemed to be hundreds of people, none facing me, all walking towards it (it would have been about 4:56 at this point and the cafeteria was just serving dinner.) This was an increasingly difficult task. I also got some water, a necessity at these altitudes. I decided it would be a good idea to use the restroom, as I hoped not to encounter people later in my trip. I walked down the hall to the bathroom - someone was behind me but I didnt bother to see who it was - I didnt think I could hold it together so I walked calmly and straightly as I could to the bathroom. I tried to read the sign above the stall (it reads give a heads up before flushing, the water turns scalding. its very true, Ive been scalded quite a bit) but I couldnt make sense of the words in context, nor could I recall the significance of the sign. I decided it was time to quickly head back to my room.\r\nThe trip hit me with increasing intensity. and at this point I was experiencing constant, full blown open eyed visuals. My room is filled with patterns, and psychedelic art I created over this past summer. I'm an admittedly prolific and obsessive artist, and make ornate pieces of shifting, busy, nonobjective patterns. These were surprisingly the only static objects in my room - I could view them all with clarity, as I have an intense personal connection to them all, I think. The textures on my cieling, and wall glowed with the familiar bands of color, and undulated into rhythms and breathe-like qualities. I watched this for a bit with wonder and admiration for its beauty, but I soon grew fearful - this was unlike any other trip I had taken and knowing fully I was nowhere near the peak I began to wonder if my dosage had not been too excessive considering my weight and the potency of the mushrooms. \r\nI decided I needed to focus on drawing more - a strong work ethic and drive has been a very powerful theme in my life, and is particularly apparent when confronting issues of self and destiny during mushroom trips. I always draw as a form of mental health, a point of focus, a sense of productivity, and eventually, a map of my trip (I remember every thought I had when I look back at a drawing). Even the blank spots of the paper moved with their own colored bands in complex patterns that breathed in and out like synchronized swimmers. \r\nIt was around this point that I experienced total time dilation. I had never kept a clock handy on any previous trips, as I assumed it would make little sense, but this time I decided to confirm my suspicions and keep a small, digital alarm clock. I noticed that the CD was moving at a very strange pace. the cd was very familiar to me, but I was not understanding how it could be moving so slow. It correlated with the actual timepeace as minutes would take unreasonably long periods of time to turn. I became overcome with pins and needles, and a an occassional wet, sticky film seemed to be accumulating on my fingertips. This effect had never occurred before and slightly worried me - this was not something I had read about in my extensive researching of trip reports. additionally, my long, shoulder length blonde hair felt as though it were becoming terribly soft and brittle - as though it were falling out. My skin appeared to be bright red at some moments, then flacid the next. \r\nThese apparent physical changes caused me much alarm, and I became greatly fearful that I was in fact dying. I am generally not too fearful of death, so I took this objectively and without much panic and a startling sense of acceptance of what I thought was happening to me. I lay down at this point, as my work was of little consequence when I thought I would die, and thought that perhaps I shouldnt have taken the trip alone this time, and began to reflect on how often I was alone. (as said before, Im a private sort of person and am at peace when Im alone in nature) I tried to lay to death/sleep but found it quite impossible with the ever increasing trip. Clearly this was something I would have to ride out and it was all a question of time - which was still moving impossibly slow. I dwelled much upon this concept - time is such a playful, and maleable concept - a total abstraction that we hold a great deal of significance to. In retrospect, I recall having a similar conversation with a good friend while he was tripping once. Time has such arbitrary connotation to it. I continued to draw, slightly more convinced, but still not entirely sure I wasnt going to die.\r\nI continued drawing, and at this point, my eyes were playing new tricks - total distortion of some areas, bulging larger and becoming increasingly more intense and rich. It felt as though blinking was an impossiblity - my eyes were wide open and continued their breathing qualities. At this point my temperature fluctuated wildly, and I put on a patterned grey sweater (which moved in tides, like my rug) My hair continued to feel spidery, and I was certain it was falling out. I pressed on with my drawing, however, certain that destiny required me to finish this piece at least. I paused to take a look around, and at this point experienced the peak of my trip. What I saw will never lose its impression on my mind - a literal and terrible flash of an empty bottle filled with change on my desk appeared right next to the actual bottle, only it was ephemeral, quick, occurred with all the bright blue brilliance of lightning - as I recall a sound even accompanied it. A second flash occurred just under my window on the wall, not an actual object this time, just what seemed to be a tear in the fabric of reality. Ive done my best to recount this peak, but no words could prepare any soul for a similar vision. \r\nI continued to draw for some time, consciously attempting to ignore any other such freak occurrences for some time. I looked at my clock again, and the time was still stuck at 6:15, but changed immediately to 7:15 as I watched it. Seeing now that time was truly passing, simply in an alternate method than I was used to percieving, I became slightly more convinced that I was going to make it through this trip.  around 7:45, a girl I had known from school called, and for some fool reason I answered. She explained that she would be in town and would like to visit me, and thusly asked for an address and the name of my college. This conversation was, needless to say, incredibly difficult to understand - I apologized and blamed reception (though it was bad) for my inability to comprehend what she was attempting to communicate but somehow managed to give her my address and dorm name. Afterwards I apologized and expressed with surprising eloquence an admitted ineptitude with dealing with phones as they mediate human interraction from communication. She agreed and appeared to understand and even empathize. \r\nA little more confident now and having that slight link to reality, I continued to draw, now in a new position, perched at the end of my bed with the drawing propped up on my desk. This perspective proved much simpler to draw on and I was pleased with my enginuity. About heres where I became quite immediately overwhelmed with a sense of happiness and joy - I was quite certain I would live and felt myself coming down (granted I had a very high place to fall from) the experience had not, in fact, overwhelmed me. Bouts of uncontrollable hilarity and laughter - I felt I had truly gained a taste of what it felt like to die, and issues of mortality I thought I had long ago addressed took on an entirely new reality to me. I felt as though I had gained more insight from this trip than any other - giving yourself a strong case of stomach poisoning really puts things into perspective. [Erowid Note: This allusion to stomach poisoning is confusing. Psilocybin intoxication is not equivalent to stomach poisoning] Many things seemed entirely inconsequencial at that point (if schoolwork had felt trivial before,  boy did it seem even moreso now). \r\nSometime later, around 8:20, the heavyset hallmate I had mentioned before knocked and came in. I was coming down, but still experiencing hallucinations. He smiled, and his elongated fang let out an intense glow and sparkle. He knew I had been tripping and was eager to hear about the experience and I told him what I could express about my trip, though finding the words was understandably challenging. \r\nThis marked what would continue to be a series of people barging in my room and asking about my experience, or simply interracting with me (which was weird - I had recently broken up with a girlfriend on fairly sour terms, and thusly didnt really hang out with many people.) A girl I had met only a few times before but on very pleasant circumstances stopped by and had one of those moments that I only have with girls where its pure, immediate, rapidfire conversation where you just spew absolute truth to one another. I was surprised at how easily it flowed considering my prior incapability to express myself. College is strange, because Im always having these unlikely moments with total strangers. My great friend, and former roommate who sold me the shrooms walked by with her and asked how my trip went. I told him it was questions of mortality good he gave me a whatdyaknow look and said oo me too! The girl said that she and I had shared a moment (which was weird because I had not verbalized that I considered it such a moment) and he in all his wit apologized sincerely that I had to experience that moment. \r\nWe exchanged laughter and I felt wonderful - alive with a great sense of comfot and connection with these few on the ball people who surrounded me. A renewed respect and appreciation for life overtook me in the hours and days following. I was still mildly tripping for some time and smoked some pot later which slightly reactivated it, but considering the mental trauma of the onset and peak, it seemed almost nonexistent at that point, and I looked at my creation to map out the trip on the paper. The upper left hand corner is a phosphene tunnel image with hexagons bursting out, deconstructing, and giving way to dendrite images that prevailed through the trip. This corner will always remind me of the trip where I faced what the world looked like in its true reality. I maintain that these forces that I saw are at work anywhere we go at any given time, and that it takes only the right frame of mind to see it, be it entheogen, starvation, sensory deprivation. Shamanism to me is the tangible religion - experiencing reality in terms that elude us in their esotericism - to be unlocked through vision quests which add to our understanding of humanity and wisens us.\n\n\n"
}
