{
 "title": "Losing Reality",
 "author": "Josh Dea",
 "citation": "   Josh Dea. \"Losing Reality: experience with Mushrooms (ID 387)\". Erowid.org. Jun 15, 2000. erowid.org/exp/387",
 "substance": "Mushrooms",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 387",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 15, 2000",
   "Views: 4167",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had done mushrooms on about 8 different occasions prior to this particular experience. We had just purchased about 2 ounces of mushrooms, and decided we'd eat them later the next night. Well, the next night I ended up buying some more and eating about 2 grams before we even broke into the 2 ounces. After about an hour after eating the first mushrooms I began to feel extremly light headed, and in a euphoric state. So I decided to take some knife hits of high grade cannibis, and to eat some more mushrooms.<br>The colors at first, were facinating! I had never seen such tracers and patterns before, and was amazed by the bright and detailed color. They seemed so real! But, out of nowhere, the colors dissapeared, and I suddenly felt alone and confused. I could not figure out what was going on. I got scared, and decided I should go home and sleep it off.<br>After finally finding a ride home, I started to feel a bit better. But as soon as I walked in the house I began to feel scared again. The patterns started to appear again. But now the patterns where consumed in everything I looked at. I was stuck in patterns. My thoughts slowly began to race, I was now unable to concentrate on any single thought. My heart began to race, I felt my soul was being ripped from my body. I thought I was dying, and tried lying down to relax my body, as my mind was telling me, I was preparing my soul for death. Not my body, but my soul. <br>I started to feel better, and felt as though I were slowly falling asleep, but all of a sudden I felt a jolt in my body. My ears began to ring. The most violent sound I have ever yet to hear. And in front of me appeared a solid gas sphere of bright colors, with extensions which grew from all sides of the sphere of colors. The sphere disapeared and my room began to sink in. It felt like my room was actually brathing, and I was stuck inside. Everthing I looked at began to shift shape and warp. I was now unable to concieve what was real and what was not. As things were warping, I felt this was the end, I thought I was going to have to kill myself to end it all. <br>As soon as the warping ended, I felt a urge to get up and leave the house. I jumped out of bed, sweating, and frantic, grabbed my shirt and began to put it on, only to throw it across the room. I don't know why I did, it kinda felt like the shirt was trying to grow onto me. I felt confused, began to put my pants on, but my hand braced up on some gum which mysteriously got stuck on me, I began to pull it off, unaware that it was gum, and thought I was pulling my skin off. I panicked. My body was deteriorating due to the poisons which I felt were slowly killing me. Once I realising it was just gum, reality began to slowly come back to me. I was begining to finally relize it was just a trip and would soon pass. Over the next 6 hours I experienced flashes off the mushrooms kicking in, but a little less powerful each time, until I finally fell alseep.<br>For about the next 4-5 months, I experiend random flashbacks, and anxiety attacks. I have eat mushrooms since the experience, but I was alot more careful with my dosage. I have also done acid on different occainsions, but have had pleasruable experieneces every time.<br>I feel like I made some confrotations with my fears. And feel like I actually got a positive experience out of this. And would one day like to take more, to experinece an even further journey of the mind.\n\n\n"
}
