{
 "title": "Horrible Trip",
 "author": "Babz",
 "citation": "Citation:   Babz. \"Horrible Trip: experience with GHB & Alcohol (ID 38712)\". Erowid.org. Jan 11, 2011. erowid.org/exp/38712",
 "substance": "GHB & Alcohol",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 shots",
   "oral",
   "Alcohol",
   "  T+ 0:00",
   "1 cap",
   "oral",
   "GHB",
   "  T+ 0:15",
   "2 shots",
   "oral",
   "Alcohol",
   "  T+ 0:15",
   "1 cap",
   "oral",
   "GHB"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38712",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 11, 2011",
   "Views: 6167",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI was over at a friends place and we were board sitting around havin a couple of drinks. I had already had around two shots of vodka (straight) and her brother suggested that we try sumthing a little more interesting. Me being new to this whole 'drug taking' scene I eagarly accepted. \r\nHe offered around an  eyedropper full of a clear liquid which he named as ghb. he told us to fill a bottle cap full, mix it into our vodka and sit bak and relax.I did just that and sat bak and listned to the music playing. About fifteen mins later I told him that I couldnt feel a thing, he suggeested I fill another capfull and hav a couple more shots of the alcohol. I did. \r\nThirty mins after I did this I began to feel extreamly realaxed, the music began to feel more intense, my libido increased  and I was having a pretty good time. I decided to go for a walk to the corner gas station. Her brother and I got up and I was drifting in and out of a hazy euphoric feeling. I cant remember exactly what happened threrafter but I woke up in the morning with my underwear gone and a rather bad stomach ache.\r\nI didnt know what happened the night befor so I spoke to her brother and he informed me that I was feeling rather horny whilst on the drugs. I had had 'concented' sex with him and didnt even know it the next day. \r\nA couple of weeks later I went to the doctor and informed him of my experience. It was later found I was pregnantt and two months later I miscarried and hav not been able to get myself out of a depression since. I blame my miserable experience on ghb and reccomend that if you want to try it for the first time, make sure you are surrounded by people you trust (preferably the same sex). Dont let one ghb trip ruin your life as it did mine. Thanks for listning.\n\n\n"
}