{
 "title": "Very Positive Results",
 "author": "Logical Thinker",
 "citation": "   Logical Thinker. \"Very Positive Results: experience with Alprazolam (ID 38731)\". Erowid.org. Jun 30, 2005. erowid.org/exp/38731",
 "substance": "Alprazolam",
 "bodyweight": "155.4 lb",
 "header": [
  [
   "DOSE:",
   "0.5 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38731",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 30, 2005",
   "Views: 77312",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've generally been one to avoid phamaracuticals. So I thought, until I understood the foundation of ritalin, and other adhd medications I had been prescribed as a child. When I was in elementry school, and even middle school I had a problem with social anxiety and often would cry for no reason. I believe this is attributable to stimulents such as adderall, and ritalin that I had been takeing at the time. In considerably large doses for such a young child.<br>This irrational social phobia I believe manifested into a much more serious problem. Primarily an over whelming fear of meeting new people. Even when I wouldn't meet them I would go to a party and have extreme paranoia. Particularly among members of the opposite sex, even to whom I was not attracted to. I am also one to keep up with regular pop culture, and current trends and by no means self concious about my physical appearance. <br>One day a friend offered to sell me 'z-bars' for what appeared a rational amount. He said they were the maximum dosage 4mg bars. So I did a bit of research, found the exact pill photographed with a 2mg label. With the inscription SYMBOL 039 yellow with 4 indentions each suggesting .50mg. He suggest I take one with 'a few beers'. That seemed unwise being that he wasn't even aware of what he was selling and being 'fucked up' is rarely appealing to me. Being that I acknowledged my social phobia I decided to purchase a 2 months supply at a dose of .50mg a day. <br>As far as the effects, I had relatively no fear of social situations. I even could 'eye flirt' with girls I saw that I normally would shy away from looking at. One day at work while I was on a considerable dose approximately one bar 2.0mg, with a cup of coffee black 12 ounces no cream no sugar. I was doing the normal rounds with the customers, being my newly overly confident uplifted self making eye contact with everyone and smiling confidently. I recieved a call from a girl later that day at work who gave me her phone number, I had seen her previously in the store. I remeber speaking to her, and could sense a general uneasyness, which I believe was due to my artificially inflated confidence obviously such an incident could not be entirely based on just drugs. However that sort of thing has never happened before, and I and plenty of girls go through there daily.<br>That is the positive aspect, however one manager at my work noticed me. He pulled me aside at the end of the day and said that he noticed I had been stumbling and appeared to be almost drunk. He asked me if I was on any drugs, and I promptly replied that I was indeed on drugs and explaned the situation. While it would seemingly appear as though he was looking out for my best intentions which he claimed, I don't believe that to be the case. As he is a notorious power tripper, and would pick on me much more than other managers. In fact, he was the only manager that wouldn't relax and get a long with my positive additude. I recieved twenty compliments that day three of those suggested I deserved a raise, and I sold 45% of the stores 7,000 dollar gross sales. Those are very uncommon things to occur, my manager Eric and Rohber both complimented my ability to dose myself and said they didn't notice anything wrong with me other than that customers loved my upbeat, and positive additude. <br>DETECTED SIDE EFFECTS: MILD Clumsiness, Decreased sex drive. <br>This drug can be appreciated for its own individuals effects. It is not a good drug for combinations. I advise all to be smart, and avoid self destructive behavior.\n\n\n"
}
