{
 "title": "Experience, Understanding, Contentment",
 "author": "EMAGDNIM",
 "citation": "Citation:   EMAGDNIM. \"Experience, Understanding, Contentment: experience with Mushrooms (ID 38761)\". Erowid.org. Feb 28, 2007. erowid.org/exp/38761",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38761",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2007",
   "Views: 2544",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nNote: E and J are my fellow trippers, both female.  All other names are non-trippers and close friends.\r\nThe setting is the basement of a friend during the evening.  It is very comfortable and during the course of the night many non-trippers came in and out.\r\nIn preparation I researched the drug extensively and ate nothing the day of the experience.\r\nT +0:00  (6:35) I chopped up three portions of mushrooms and divided them among three peanut butter sandwiches.  J, E and I each ingested the sandwiches and waited for the effects to begin.\r\nT +0:10  I start to feel mildly stoned, but am unsure of whether this is attributed to the placebo effect or not.  I choose not to say anything and E and J claim to feel nothing.\r\nT +0:20 The effects are definitely noticeable, although it is hard to say in what way.  My thoughts seem quicker and spacier.\r\nT +0:45 Visuals are just beginning and sense of time is deteriorating.  I notice light tracers when I wave my hands and the room seems to take on new dimensions.  I start to have a strange feeling of déjà vu, or coming home.  It is as if I have experienced the effects of mushrooms before and it is totally natural.\r\nT +1:00  Speaking is becoming more difficult and the visuals are becoming powerful.  I am amazingly content to just observe the actions of others and seem to be able to comprehend their motives in a more profound way.  Absolutely everything is amusing and I laugh a lot, although it is not uncontrollable.  E appears to be totally silent and introspective where as J is conversing actively about her experiences.  The pillars in the basement begin to shift and bend in relation to each other and the paintings seem animated.\r\nT +1:30?  I am now starting to become overcome by the visual and physical effects.  My body awareness is noticeable altered and touching my face becomes a strange experience.  Textures also take on a distorted proportion and my face sometimes feels slippery, I begin touching many things around me.  I decide I would be more comfortable lying down on the couch, which E has been doing for some time now.  Shawn turns out the lights and I enjoy the effect.  J has been upstairs for sometime writing in a journal.  Many of the non-trippers appear to be uneasy about our physical state and many comments are made about the size and depth of my pupils.  My sense of time at this point is nearly non existent.\r\nT +2:00 Lisa, who has been upstairs with J returns to the basement and the lights are turned back on.  She and Shawn start a game of pool while E and I stare at the room.  The intense movement in the pictures and the dimensions of the walls are interrupted only by Es periodic outbursts of laughter, which I find very amusing.\r\nT +2:20 J returns with the contents of her journal and so does Eric, with Kathleen.  Both are amazed by my physical condition.  After hearing J talk about her similarity with Angelica from Rugrats, which made all too much sense to me, I sat down with Eric and Kathleen to decipher J's writing.  Although the content was confusing it was visually very pleasing and I assumed her circling of Is had to do with some sort of ego struggle she had had in Lisas room.  I circled some other Is and an l to and tried to explain that in the incoherent context Is and ls are the same thing, but Eric didnt appear to understand.\r\nT +2:45 I go upstairs to use the bathroom and marvel at how interesting everything in the house is.  I suspect that this is what a child feels like when experiencing the world for the first time.  I have no prejudices.  I experience each object for exactly what it is as my mind refuses to fill in any blanks for me.  I look in the mirror for awhile in the bathroom.  I see no visual distortions and assume this to mean that I have a balanced and positive view of myself.  This makes me feel good.  I had promised Kevin that I would play guitar with him, but when I leave the bathroom I find J in the family room and we stare at some photos for awhile, both seeing the same distortions.  We then sit down and I experience a strong mental connection with her.  This is the beginning of the telepathy that will continue between Me, E and J for the whole night.  We both talk about how we wish we could share this understanding with others, but there is a verbal and experiential barrier.\r\nT +3:15 I return back downstairs and try to play the guitar.  The orders of the frets and notes have no meaning anymore and the guitar is out of tune.  This bothers me but I am unable to tune it so I stop playing.  I then watch footage of myself and E from earlier in the night and am surprised to see how intoxicated I appear.  I wonder if I am still acting that way, and assume I am.\r\nT +3:30 Kevin has me look at fractals with him on the computer.  The sense of inifinity is amazing, not to mention the fact that they are constantly in motion.  However the visuals are either not as strong now or I have gotten used to them.  I seem to have a better verbal command now so I describe to him my experiences thus far.  He seems very interested, and I remember that he has just insufflated one of his ADHD pills.\r\nT +3:45 Many people start showing up at Lisas house and I am a little uncomfortable with some of the unfamiliar faces.  Everyone is immediately able to discern that I am tripping.  I see E and J talking together in a corner of the basement and decide that it would be nice to be alone with other trippers.  I sit down and immediately realize that I have a profound connection with the both of them.  The ability that I have to understand what they are thinking and vice versa borders on telepathy.  We all find each other finishing the others sentences or even understanding things merely based on looks.  I can hear their thoughts forming in my head.\r\nT +4:00  Kevin comes over and sits with us and although he doesnt experience the same connection he tries his best to follow to conversation.  I have been feeling words throughout the whole trip, the most powerful of which was experience, at the height of my visuals.  Now all I can think about are contentment and understanding.  I simultaneously feel more fulfilled than I ever have in my entire life and as if I can comprehend anything and anyone in the universe.  Everything appears to be exactly how it should be and my thoughts are more cohesive than they have ever been.  There exist no words to explain the sheer dimensions that my mind was able to take on.  Our conversations continued for almost an hour and forty-five minutes.  Every single thought I had seemed to be a revelation of unspeakable magnitude.  I commented several times that I never wanted any of this to end, and J and E expressed their agreement.\r\nT +5:45  At this point aside from minor tracers I felt totally in control and barely under the influence.  However, I still felt the afterglow and mild euphoria that I had been experiencing before.  I made the decision that I was ok to drive, and in hindsight it appears to have been a sound one.  I dropped off E and J still in awe of the power of the experience and then drove myself home.  I talked to my mother for about ten minutes, hoping that my eyes had returned to normal and then went right to bed.  Although I felt physically exhausted my mind would not stop racing and it took me nearly an hour to fall asleep.\r\nT +15:00  I awoke the next morning still feeling very content and aside from being a bit thirsty I felt absolutely no negative after effects.\n\n\n"
}