{
 "title": "My Buddy and Me",
 "author": "Snail",
 "citation": "   Snail. \"My Buddy and Me: experience with Levorphanol (ID 38779)\". Erowid.org. Nov 10, 2006. erowid.org/exp/38779",
 "substance": "Levorphanol",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "3.0 mg",
   "oral",
   "Opiates",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "1999",
   "38779",
   "Male",
   " ",
   "Not Given",
   "Nov 10, 2006",
   "9749",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been on lots of narcotics for chronic pain, from methadone to hydrocodone to morphine. All of them made the pain better, methadone most of all, but left me feeling that my get-up-and-go just... got up and went. Necessary evil, right? I was constipated, bored, and just plain sick of being on the drugs. Then I got levorphanol. I had to call a bunch of different pharmacies to get the stuff. At this point, I get it compounded. The brand-name pills are tiny little things that you can split in half with a bit of luck. They're not too much smaller than the little blue MS Contin skittles, and they come in 2mg size.</p><p>Enough of the intro - here's the lowdown on levorphanol: constipation is largely absent at my dosage. Low doses (1-2 mg) can be almost stimulating, leading to more excitement about things as opposed to the severe detachment of morphine. I only take 1 mg at a time (= 3-6 mg/day) - I'm a college student trying to handle organic chemistry with a clear head - and this dose works for pain, taken every few hours. Higher doses (~ 4mg, which, admittedly, I do not fuck with) have been reported to be quite nice by my friends, who enjoy my liberal attitude about my extra medication. On that note, no, I'm not a narcotics abuser. I've played that game, and it just does not work well for things I'm gonna be taking long-term as a medication. The thought of abusing opioids makes me sick at this point. </p><p>Anyway, the effects kick in at about the 45-60 minute point and last for 8-10 hours. The pain relief lasts a bit longer than the psychological effect, but levorphanol is subtle. It tapers off very slowly. I might not even notice it wear down. I just kinda settle back down to baseline softly with no trouble at all. It's actually more likely I'll go to bed at the end of the day with a good bit still in the system. The euphoria isn't as strong as hydrocodone. It's less sharp, more just warm and happy and subtle. This is more of a soft-landing drug than a take-off of its own. I've used it (say, taking an extra 1 mg) to ease up the end of a day of psychedelic use. It'll cut down on the activated shakiness of 2c-t-2 and the 'what now' feeling of the end of an acid or 'shroom trip. Everyone seems to like it. I'm not of the opinion that it's an awesome experience in its own right, but if I need a little extra chillness sprinkled on my naughty salad, it does the trick. I've combined this stuff with just about *everything* (2c-t-2, LSD, mushrooms, methamphetamine, temazepam, ambien, MDMA, MDA, etc.) but alcohol (I don't drink) with no ill effect.</p><p>Side effects? Some people seem prone to nausea, as with any opioid, but it's not as bad as some of the other ones. Individual variations all over the place on this one. Most people I know, at 2-3 mg, don't have trouble with it. Itchiness is present but minimal. The constipation doesn't seem to be there. In fact, at my doses, it seems to be a bit of a laxative, which is weird. Its cough-suppressive effects don't seem to be as strong as hydrocodone's. I dunno. What else can I say? It's really probably the most tolerable, least 'fucked-up' feeling opioid out there.</p><p>Levorphanol's some good drugs. I mean, if you have to be on a narcotic, you should know about this one. I can look at the bottle without that feeling of simultaneous loathing and dependency brought on by glancing at a bottle of Vicodin or morphine. Happy trails, guys... and remember: Don't party with your medication, be it for ADD, sleep, or pain. You wanna prolong the love, not blow your load wit' a quickness like some dumb high school kid. Share with your friends instead. Let them have the good times. I respect levorphanol, and levorphanol respects me.</p>"
}
