{
 "title": "A Guide to a Successful Trip",
 "author": "Kindbudz",
 "citation": "Citation:   Kindbudz. \"A Guide to a Successful Trip: experience with Mushrooms (ID 388)\". Erowid.org. Jun 15, 2000. erowid.org/exp/388",
 "substance": "Mushrooms",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 388",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 15, 2000",
   "Views: 16841",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nIt was my freshman year at college and my friend and I were seriously considering tripping shroom style.  The college I attend is dense with drugs and the like, so getting them was not an issue.  On the night of our foray into psychedelics, we made perfectly sure that all people that were not tripping with us were not around, and the select few that were, were in our dorm room with us.  It was time.  At about 7 o'clock in the p.m., we ate the mushrooms in hamburgers from Hot n Now, which is a restaurant frequented by college students simply for it's low prices-highly recommended.  About a half and hour to an hour later, my two friends and I were sitting on the couch, and all simultaneously burst out into laughter.\r\nWe sat there laughing for about 20 minutes, about nothing.  We then went to our neighbors room and borrowed his strobe light.  We turned it on high, turned on number 6 from the Mortal Kombat soundtrack (i know, it sounds stupid, but when you hear the song you'll know why) Sitting there, smoking cigarettes, and listening to this intense music with the strobe light kicking was the single most mind-bending experience of the night....until we went outside.  The weather was incredible-it nearing the end of August.  We went on a walk to the local 7-11 to buy smokes because in a matter of hours we had all smoked a pack a piece.(like I say, smoking feels great) So on the way we went on a path that is now known as Disney Land, because of the vibrant colors on the trees and the lighting scheme.  It was unbelievable.  It is now our designated spot to visit when we trip.  All nature is good.  Frequent any woody area, or riverbank-type area, and you will be astounded by the things that you see.  They are things that you see everyday, but at the state that we were in, the most simple things seemed so complex and intricate.  We got our smokes, went back to the dorm, and it had seemed like we were only gone for 15 minutes, when in reality we were gone for about an hour.  \r\nWe stood outside playing hackysack for about 3 hours, and then went back upstairs where we listened to music, drew pictures, and smoked.  All in all, it was a very pleasant experience, and to all those that have the means, I say go for it.  It is all natural, I've heard VERY few bad stories about it, and the memories you have from it are unforgettable.  Some say it is life changing.  I just regard it as a great time, provided by mother nature.  So good luck, and happy shrooming. P.S. remember to have some kind budz on hand to burn soon after shroom consumption-it helps them kick in, or at least for us it helped.  peace.\n\n\n"
}