{
 "title": "Confused ... Michael Moore",
 "author": "Heebyjeeby",
 "citation": "   Heebyjeeby. \"Confused ... Michael Moore: experience with Diphenhydramine (Benadryl) (ID 38862)\". Erowid.org. May 10, 2007. erowid.org/exp/38862",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38862",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 10, 2007",
   "Views: 35444",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is an experience of mine that I look back on and wonder what the hell I was thinking.  First of all, I purchased this confusing night at a dollar store.  I had heard through a few folks at my school that there was this thing called Diphedryl you could get for $1.06 that was a really crazy trip.  Now I, being always intrigued by a new trip (especially one that's $1.06), decided to do a little research. After a little convincing from one of my friends, we took our four dollars and marched down to the store to buy some fun.</p><p>It was me and three other friends that night nestled in my cozy basement.  Keep in mind this room was practically decorated for people who are tripping, so we were all pretty excited about what was going to go down.  Slowly, starting at about 9:30, we all started taking these pills.  I finished my box (12) about forty-five minutes later and sat patiently on the couch with my friends, waiting.  </p><p>All our excitement had sort of dissolved into being a little nervous.  We all smoke pot, rarely drink, and often enjoy mushrooms, but we've never been fond of taking large amounts of pills. Then, it began.</p><p>10:20 - The joints in my hands became very, very stiff.  I began to get the 'shakes' a little bit and my head was lighter than ever.</p><p>10:30 - It really kicked in.  I couldn't believe how hard and fast the trip had actually hit.  Most things in the room (which was lit dimly) were in fact shimmering.  Practically vibrating.  I was really enjoying it at this point.</p><p>10:50 - midnight:  I was REALLY wrong about thinking it had kicked in before.  Really.  Suddenly, next to my tv, was a full scale drawing of satan standing sideways.  I rubbed my eyes thinking it would be gone when I opened them, and it actually turned its head and smiled at me.  My heart jumped.  From that point on, there was no reality.  It was gone.  I would have conversations with people who ended up never even being at my house.  Things would dissapear out of my hands.  Things would often appear to be on fire. </p><p>I've seen movies where they show people eating mushrooms and then show HORRIBLE renditions of a trip.  Like bunnies and monsters and flying pie graphs.  Well, this was about the closest thing to a 'movie' trip. This trip is JUST hallucinating.  That's all it is.  At first it is quite exhilerating, but as time passed I really started to lose grip.  It's not like mushrooms or acid where my emotions are ever-changing.  There are no emotions.  I can't think about anything, my head is empty.  All we did that night was sit quietly in the dark and see crazy, unnearthly shit with the occasional 'Wait, what are you talking about?'  'I'm not talking' 'Shit'.  Like I said, I kept thinking I was talking to someone next to me and then say, 'You know?', when really it never even happened.  </p><p>Right before I passed about from confusion, I had a hallucination that made the whole thing worthwhile.  I was watching the blank t.v. screen (go figure) when suddenly I saw Michael Moore standing on a table on and empty stage wearing red pajamas, the ones that button in the back.  He had his arms shrugged and he kept saying 'What, what's so funny?' and the audience was laughing hysterically and then it was gone.  I will never forget that image.</p><p>REVIEW:  Just not worth it.  Sure its cheap and easy, but it was just WAY too intense for me or anyone else in my basement that night. By midnight, a mere 2.5 hours after I took it, I needed it to stop.  There's a fine line fun and scary when your tripping.  And when your friends and stuff you were about to eat start dissapearing and the devils on your wall, you know where I'm going. Unless you REALLY want to to try something new and have a sober friend and an entire night, well, I just wouldn't.</p>"
}
