{
 "title": "Chaotic Chems",
 "author": "Big Jilm",
 "citation": "   Big Jilm. \"Chaotic Chems: experience with 5-MeO-AMT & 2C-T-2 (ID 38887)\". Erowid.org. Sep 14, 2005. erowid.org/exp/38887",
 "substance": "5-MeO-AMT & 2C-T-2",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   " ",
   "15 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38887",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 14, 2005",
   "Views: 9155",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have A lot of experiences with many different tryptamines and phenethylamines, and to be honest me and my friends usually like the heavy, long lasting doses. But when we combined these two chemicals we found the true meaning of 'heavy & long lasting', so in a way this is sort of a warning to other researchers or what have you. \r\nSo we were already tripping hard off of two 15mg doses of 2c-t-2 that we each took before a Skinny Puppy concert and it was now several hours later after the show and we decide to dose about 15mg of 5-meo-amt. By the time we came up to the effects of the \r\n5-meo-amt we were tripping extremely hard and because of the intensity, it was quite an uncomfortable body load, extremely speedy. Despite the major fear & loathing, I was still able to pull through mentally but my other friend was not, let's just say that I had to talk him out of very psychotic and violent decisions that he was making in this delerious state, I felt like I was a hostage negotiator. Anyway after about 6 to 8 hours of talking my friend out of crazy, drastic decisions and pretty much just pure insanity, he started to come back to reality; but we were still tripping amazingly hard and in the end we didn't come down until about the t+48 hours, 36 of which I considered peaking. By the time I came down I was so mentally exhausted that I was practically begging to stop tripping.\r\nSo this is just a word to the wise (even though combining research chemicals may not be considered wise) to be very careful when combining 5-meo-amt with any 2c-t-x. I have experienced this potentiation not only with 2c-t-2, but with 2c-t-21, 2c-t-4, and \r\n2c-t-7; even if the doses are extremely low. I've never had a negative experience with any research chemical out of literally years of use and thousands of doses, but it's only because I respect their power and use them only as a TOOL for cognitive expansion. \n\n\n"
}
