{
 "title": "Like a Narcotic - Not as Much Euphoria",
 "author": "whitegreyhat",
 "citation": "Citation:   whitegreyhat. \"Like a Narcotic - Not as Much Euphoria: experience with Kratom (ID 38910)\". Erowid.org. Dec 27, 2004. erowid.org/exp/38910",
 "substance": "Kratom",
 "bodyweight": "176 lb",
 "header": [
  [
   "DOSE:",
   "8.0 g",
   "oral",
   "Kratom",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38910",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 27, 2004",
   "Views: 15356",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMe and a friend ordered some premium powdered kratom from an online vendor. It arrived a couple days later, we were apprehensive because we heard it was like oxycontin or hydrocodone. We bought 100 empty gel-caps from a local health store, and begin filling all of the 25g into the caps. (it took about 30 or so capsules) We consumed a little over half of the total between the two of us on accident.\r\nAbout 20 minutes later, we began to experience a fluttering feeling in our stomachs. As if something was going to happen. At the 'peak' I didnt feel much euphoria, just really disoriented and time was somewhat distorted. I felt as if I wasnt fully conscious at some points, like I wasnt sure whether it had been a second or about 2 minutes. Also mild 'brown-outs' with my mind. Just a strong confusion I suppose. That phase passed and I began to feel very relaxed, with that small amount of energy that comes from taking an opiate. Like my body is so relaxed but my mind is focused and on point.\r\nMy friend became very nauseous and vomited a couple of times. I felt fine. He has a reputation of not being able to handle larger doses of opiates.\r\nOverall I would never compare it to hydrocodone or codeine, but I can definately feel that it is an opiate like substance. The experience lasted about 2-3 hours for me. It is fun yet I wouldn't expect too much.\n\n\n"
}