{
 "title": "An Extremely Enjoyable Evening",
 "author": "Wozza",
 "citation": "   Wozza. \"An Extremely Enjoyable Evening: experience with Poppies (extract) (ID 38944)\". Erowid.org. Jul 20, 2007. erowid.org/exp/38944",
 "substance": "Poppies (extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 g",
   "oral",
   "Poppies - Opium",
   "(extract)",
   "  T+ 3:15",
   "300 g",
   "oral",
   "Poppies - Opium",
   "(extract)",
   "  T+ 4:15",
   "300 g",
   "oral",
   "Poppies - Opium",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 38944",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 20, 2007",
   "Views: 30656",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm a 20 year old male, about 200lb (100kg, give or take). This was my first experience with opiates, and, apart from nitrous and alcohol, my first experience with a psychoactive. I read of 'poppy seed tea' on a forum one night, completely by accident, while searching for more information on nutmeg. All the reports I read seemed to be fairly positive, much more so than reports on nutmeg, although of course the experience is rather different, so I decided to give it a try.</p><p>I obtained the seeds from work (I work in a bakery), and I'll say now that I believe they were very 'weak' yielded less morphine than most brands. As with anything new, start small! I should mention that I tried 2 doses of 200g of seeds the day before, spaced 2 hours apart, and experienced slight light-headedness after 3 hours, and a very deep, pleasant sleep with extremely vivid dreams after 9 hours.</p><p>I brought the seeds home on a Sunday afternoon (I have Mondays and Tuesdays off), in 3 bags of 300g each, having decided that 300g should be a good starting point. After reading everything I could find, and trying each method, I found that the following one was by far the easiest and cleanest. I poured the first 300g of seeds into a 2.25 litre Coke bottle, using a rolled up piece of paper for a funnel. To that, I added hot water from the tap until there was about an inch covering the seeds. The water takes a minute or so to settle through the seeds. I then put the lid on, and spent 15 minutes shaking the living hell out of the bottle. =P After the initial shaking, I let it sit for an hour, shaking it every few minutes. At the end of an hour, I turned the bottle upside down over a large glass, unscrewed the lid slightly, and simply squeezed the fluid out through the threads of the lid. MAGIC! No seeds all over the kitchen! Once I'd squeezed out all the liquid, I let the bottle sit upside down for a while, squeezing periodically, to extract the last of the liquid.</p><p>What I ended up with was about 300ml of liquid, the colour of milky coffee. I divided this into two glasses, and topped each up with orange juice. The orange juice really masked the flavour of the seeds as I drank, although there was a little after-taste. Another glass of juice took care of that.</p><p>And now, the interesting bits ;) I hadn't eaten since breakfast at 4.30am. I was about to take my first dose when my mother called, asking if I wanted to have dinner with her. I said sure, and she said she'd pick my up at 7pm. I took the first dose (yield from 300g of seeds) at 6pm, and spent an hour reading Adbusters. No effects yet. In the car on the way to Mum's, I began to feel noticeably, but not overly, relaxed and talkative. I was also a little light-headed. Not dizzy, but 'floaty'. This didn't affect my ability to interact, and we had dinner and a glass of white wine, then I headed home.</p><p>I arrived home about 9.15pm, still feeling a little 'floaty', and reasonably relaxed, and decided to take another dose. I drank this at 9.30pm (First Dose + 3:15). I should mention that I never felt any nausea. I've put this down to simply mixing the 'tea' with plenty of orange juice. I spent another hour on the web, and messing about on a couple of MUDs. Come 10.30, the relaxed feeling was a little more pronounced, but the effects didn't seem greatly increased. At this point, my first dose, which according to reports should take 1-3 hours to peak, was 4 hours in the past, my second should have been coming on, and I decided that the seeds were indeed somewhat weak, and that I'd take my last 300g dose.</p><p>More orange juice, and down the hatch it went at 10.30 (First Dose + 4:15, Second + 1) I sat down to my reading again. Over the next 30 minutes, the relaxation I had been feeling became very intense, very pleasant. My eyes stopped focusing on the page. It was not at all difficult to focus and read, I just didn't feel inclined to. I had an overall feeling of warmth and well-being. I found that soft, gentle music (Cowboy Junkies, instrumental Floyd, Air, Selmonella Dub) was extremely pleasant to listen to, while anything harder seemed to jar, it was almost painful to my ears.</p><p>At this point, I began to notice that things were coming in waves. I would get a very pleasant feeling in my stomach, similar to intense 'butterflies', that would spread slowly through my legs and chest, then slowly subside. At the same time, I would become even more relaxed (stoned is probably more accurate), not even bothering to focus on the computer, just staring into space, digging the music. After a minute or two, this would fade a little, and I'd get back to reading, although listening to the music seemed more important, and was much more enjoyable.</p><p>This peak continued for an hour or so, before the 'waves' began subsiding, leaving me still very relaxed and receptive to music, but not as intensely affected. By 12.30, I decided to go to bed after listening to Shine On You Crazy Diamond Part I, which was unspeakably beautiful. I was feeling very drowsy, but as I climbed into bed I began to notice random itches, more or less one at a time, all over my body. I scratched them, naturally, which took care of them, and although it was annoying, it didn't actually get to me all that much. I think my ability to be pissed off was fairly diminished. </p><p>Up until now, I hadn't hallucinated at all, but I found that every time I closed my eyes, I would drift off into some new reality. This couldn't really be called a hallucination, and it's fairly hard to describe, similar to the feeling I get on a couple of canisters of nitrous, I just forget what reality is for a while and get absorbed by something else. This wasn't entirely pleasant; these other realities seemed rather noisy and busy, completely at odds to the way I felt. I would say I spent an hour or so drifting like this, scratching, and wondering about getting up to put some music on. After an hour, though, the itching and drifting seemed to fade, and I was left with a simple feeling of pleasure and comfort at being in bed. Strangely enough, I don't think I slept between then and the time I got up, about 10.30am. I got up feeling rested and relaxed, and more or less normal apart from a few lingering itches.</p><p>Overall, I found this to be a very enjoyable experience, and one I'll most definitely repeat (I intend to experiment with other brands of seed). However, I can also certainly see how easy it would be to become addicted to something like this, and I'll treat it with the utmost respect.</p>"
}
