{
 "title": "Apocalyptic Thoughts",
 "author": "Raven Ivory",
 "citation": "   Raven Ivory. \"Apocalyptic Thoughts: experience with Nutmeg (ID 3895)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3895",
 "substance": "Nutmeg",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "25 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3895",
   "Female",
   " ",
   "Not Given",
   "Dec 26, 2001",
   "4339",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWell, as I said in a previous posting, I was looking forward to trying nutmeg again. Well, I did.</p><p>7:30 - I think I took about 25 grams of pre-ground nutmeg, but while I was measuring it out, I just used a small container that saig 25g on it, so it's possible I really took more or less than that. I made a vanilla milkshake and dumped all the nutmeg into the blender with it. I was surprised because the ice cream really covered most of the heinous taste, so it was really easy to take. </p><p>8:00-8:30 - I was waiting for the nutmeg to kick in, so I sat back to watch tv. I'm not sure how long I sat staring at the tube, but after a while I started hearing these strange rumbling noises, which I identified as thunder. It was raining really heavily, an uncommon experience for Arizona. </p><p>10:00 - I started getting tired, but I was enjoying the light-headed stupid feeling I had, so I layed in bed and put on some music. It was the Riven soundtrack, which is very jungley (reminiscent of the jungle and not jungle techno) and percussive. I drifted off, but I was still awake. My stereo has a little green light on it, and after some time, I realized that I was staring at the light. It was a story-teller to me, like it had something amazing to say, so I just stared and listen to the music. I believed I was in a cave. </p><p>11:00 - After the Riven music ended, I lay in bed staring at the ceiling. I closed my eyes; I was trying to sleep, but I kept hearing strange noises, so I looked out my window. I thought it was raining, but it wasn't. I decided to leave my curtains open so I could stare out at the moonlit night. It was so beautiful in a surreal, doomed way. I found myself just staring into space, and I kept hearing the pattering of rain, even though it wasn't raining.</p><p>4:30 - I don't know what happened in the last hours, but I didn't sleep and my eyes starting stinging; they felt as dry as sand. I was staring at the wall of my house ( my window faces the wash, and another wall of the house.). I saw a flashing light somewhere in the distance, and I knew the end was near. I *knew* there was an alien race that was coming to rid the planet of humans. At some point, I knew they had landed, and I knew that only a few miles away there was a battle and people were dying, but the human race was giving its all. I saw things that I couldn't see from my eyes. I remembered old dreams that I haven't thought of since the morning after I had them. I felt alone.. I felt like I was the last person on the planet, and instead of fighting I was sitting in my bedroom. </p><p>-I can't remember the beginning of the next day, I think it was a asaturday, though, because I don't recall going to school.. I think I slept all day.-</p><p>Approx. 6pm - I was sitting down for dinner. I was having black-eyed peas and cornbread. I sat, just staring at my peas while my mother asked me why I was so tired and why my eyes were so red, but I had been home since about 5 the previous night and she knew I hadn't been our and getting stoned. I felt so blown away. The peas were somehow the end of the world and I felt so sorry eating the apocalypse, but I pushed it around my plate and felt sad.</p><p>-those are really all the specific things I can remember, but I totally remember it being the end of something and feeling alone and sad, but somehow in a comforting way.-</p><p>*the 3rd dose*</p><p>It was about 7 pm and I was soooo bored. My German exchange student had just gotten there and we were hanging around, doing homework. I took quite a bit of nutmeg, but I didn't measure it, but I do know it wasn't as much as the dose I had done a few months before.</p><p>Around 8 it started to kick in and I got really tired. My eyes couldn't stay open, but my brain was working perfectly. I was really hungry, though.</p><p>I got a bag of rice, and while I was looking for something to measure it with, I was carrying it around the kitchen, propped against my hip (the way people hold young kid.) I was soothing it, and being very protective. My exchange student was just laughing at me because no matter how hard I looked, I couldn't find the measuring cup and I continued to walk around the kitchen, aimless.</p><p>I can't remember what I did in the house before I went to sleep, but when I got into bed, I saw fireworks in this great sphere around me. They were pink and red, but not very bright. It was like I knew they were there, but I couldn't really see them, I just had the impression of them.</p><p>I also saw what I can only compare to play-dough shapes swirling around my ceiling like a giant wave, swirling. I slept really well, too.</p><p>Nutmeg is an odd drug, out of the three times I've dosed, I have never had a trip that's been even remotely the same as the others. The thing I gained most was knowledge. When I was on nutmeg, I knew.. and it was the most amazing thing. It was way deeper than any high I've ever had. Sometimes i'll feel sleepy and tired, others I won't, but I have great visuals.</p>"
}
