{
 "title": "A Minimalist Perspective",
 "author": "Brady",
 "citation": "   Brady. \"A Minimalist Perspective: experience with Mushrooms (ID 38963)\". Erowid.org. Apr 10, 2007. erowid.org/exp/38963",
 "substance": "Mushrooms",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 38963",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2007",
   "Views: 2702",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am attending college and my day started normally, classes, lunch, and a return to my fraternity for the rest of the day.  It was around eight o'clock in the evening when a member of my fraternity approached me and offered to sell me 1/8 of shrooms.  I acqueiesed and convinced my friend, R, to buy some of his own.  Roughly ten people in my house bought and consumed an eighth of mushrooms each.  R and myself ate the shrooms at roughly 8:30pm ignoring the fact that it was a Wednesday and we had classes tomorrow.  For an hour there were no affects.  I figured I'd been robbed, but I decided to give it time and go visit my friend who was strumming his guitar in his room.  </p><p>The minute I stood up I began to notice a perception change.  A sort of luminesence fell over all of my surroundings.  I convinced R to watch 'Yellow Submarine' with me and several other 'trippers' (For those who have not done mushrooms previously, I would strongly recommend the movie).  As I watched the movie sitting in a recliner I began to notice that the room around me seemed to be convulsing as if it was breathing, the blue walls bending in and out as if something was trying to break through.  The movie, as interesting as it was, seemed far too long and tedious for me.  I left the room along with R who was regretting having consumed a Mountain Dew during the trip.  As we stepped out into the hallway adjacent to the TV room a new reality seemed to have descended upon us.  Everything seemed so real, so incredibly finite.  At this point R left and I began one of the most deep-thinking life-changing experiences of my life.</p><p>I walked to the second floor of our house (the basement held the TV room) and entered a W's room.  He had some rave and trance music blaring over some speakers which I considered most unenjoyable, he told me to sit down and proceeded to take a glow-stick and swirl it around in quick motions in the darkness, I was uninterested.  I staggered out onto the balcony with W and we began to discuss something that was occupying my mind.</p><p>To me, myself, those around me, and our actions were of infintesimal importance in our universe.  I began to question everything, why do we continually attend jobs when they seem to get us nowhere in life, only adding to our personal leisure.  Even when I viewed the world as a whole in my mind, I was able to zoom out and see how incredibly unimportant and small our planet was in the universe.  I could visualize it in any manner I chose, though my mind prefered some interesting analogies in the form of the Earth as an atom-sized particle buried in all the grains of sand from the entire planet (I am an avid reader of cosmology).  Then W brought up an even more engrossing topic, time dialation, I won't delve into it, but it was an incredibly enjoyable experience to talk about theories of spacetime, relativity, and black holes.  In our state of mind (W was tripping also) we understood the concepts with remarkable clarity and developed theories (probably not very good ones) ourselves.  We felt that there was no problem in the universe that we could not solve, we felt as though our minds had been able to realize their full potential.  We could think as big or as small as we wanted.  </p><p>We then decided to add visual substance to all of our deep thinking.  We visited a website on W's computer showing a type of art known as spacescapes (digitally-rendered art of the cosmos).  The images were incredibly appealing and even more interesting.  After observing the images for a few minutes we would lay back in our chairs and close our eyes.  After that, all I had to do is tell myself I was travelling through space and that was all my mind needed.  I was transported to galaxies thousands of light-years away, I visited alien cultures that thought in mindsets so different from that of humanity as to seem impossible, I saw supernovae, black holes, and a myriad of stars and planets.</p><p>After this incredibly delightful experience, we walked out on the balcony overlooking the yard.  It was winter and a fresh blanket of 2 inches of powder had fallen the night before.  The cold seemed to return us to a measure of sobriety as we could not understand why the world outside wasn't nearly as fucked up as the inside of the house seemed to be.  The snow was fascinating.  It looked so uniform, so comfortable, and the feeling in our mouths was that of pure joy.  We quickly retreated inside and W and I split up.</p><p>I went up to see how R was doing (even though I was in no condition to accurately evaluate anything), he was staring at his computer clutching his stomach, obviously deeply regretting his soda.  In order to comfort him, we talked about the same things as W and I had talked about, I was as fascinated as ever and so I picked up W's guitar and set the bass on the highest setting and the treble on its lowest, and strummed the C string as we looked up images and information on black holes and time travel on his computer.  The sound of the single string was deeply comforting.  </p><p>After an indeterminant period had elapsed, I decided to turn in, so we split up at about two in the morning and I staggered back to my room, fell on my bed and closed my eyes, but to no avail, for three hours I lay sitting there, wondering about the purpose of human existence and what my purpose was before finally dozing off at about five in the morning. After such an incredible trip, I roused myself out of bed and made all my classes.  </p><p>A Personal View: If one uses psychedelics responsibly (ones that have no detrimental permanent affects), balancing their work, social life, school, and their 'play' time, then there should be no conflicts, it's worked for me, so that means that anybody can do it, the trick is to not do it very often.</p>"
}
