{
 "title": "Thoughts 10 Years After Quitting",
 "author": "James",
 "citation": "Citation:   James. \"Thoughts 10 Years After Quitting: experience with Cocaine (ID 38987)\". Erowid.org. Nov 27, 2006. erowid.org/exp/38987",
 "substance": "Cocaine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 38987",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 27, 2006",
   "Views: 12768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt has now been exactly ten years since I quit a daily cocaine habit for good. A few years ago I decided I'd write a little something on this occasion, to see how the experience stacks up from a distance. So here goes.\r\nI used about a gram of coke a day or more on average for about 2 years when I was in my early 20s. Probably most reasonable people would call that 'heavy use,' but in fact I've seen wealthy people deep into the cocaine world who can do much more. It's amazing what some people's bodies can handle...homo sapiens remains such a mystery. But from my perspective, a gram a day was enough to keep me pretty much perma-wired. \r\nPrior to my coke days, I had had plenty of experience with weed and psychedelics. When I was 21, I had a lucky stroke of fortune. I had previously invested a small amount in a friend's business venture, which then took off and landed me a big payout. I could theoretically have gone to medical or law school, started my own business, put a down-payment on a big piece of property, or re-invested the money in a rising market. Instead I blew it on 2 years of solid cocaine use, non-stop partying, and entertaining trashy women. Well, that's humanity for you. At least I can say I reached pinnacles of ecstasy and pleasure I never would have known otherwise.\r\nA typical day would begin with me waking up in mid-afternoon with a terrible hangover, reaching over from my bed to smoke a big fat joint of the finest kind bud available at the time. Then I'd start doing lines with whoever else was around. Pretty much all day would be alternating joints and lines, sitting cross-legged in the living room. I'd have deep, earnest discussions about life and the human soul with people I though were my best friends but whose names I can no longer even remember. Sometimes I'd read a whole book at a single sitting, or write in my journal for hours on end. Other times I'd go driving, prowling around the city looking for a certain type of woman to pick up for fantastic sex. Sex on coke is amazing; every neuron is alive in a sophisticated dance, and it seems to turn many women into sex fiends. Ah, sweet youth. Then when the night rolled round I'd start drinking pretty heavily, straight scotch or vodka, and do more lines periodically. I'd often go out to clubs and so on. The liquor took the harsh edge off the coke, and the only way I could go to sleep at night would often be to kill a fifth of hard liquor. \r\nSometimes I stayed up for days on end and even the liquor didn't work. I was a mess. On the rare occasions I ran out of coke and crashed, I suffered the most painful hangover/comedown experiences I have ever known, before or since. I can imagine nothing more nightmarish than memories of looking at the dawn coming up with an empty mirror and empty bottles of liquor everywhere and suddenly thinking with foreboding, 'shit, very soon I will be writhing in exquisite agony.' There was always a single moment, like a fulcrum, upon which the whole experience turned. Suddenly the good times would be over and I'd have a skitterish thought, an ill wind that would signal 'from here on out its downhill, kid.' \r\nMy poor serotonin levels were already rocked from an adolescence of psychedelia, and I must have really shocked the system with the coke. I think its only fair to admit I may have damaged myself permanently in some respects, although it is difficult to say for sure, having nothing to compare it to (how could I possibly know what my mind would be like if I had never done drugs?). The damage in my case is, I believe, primarily emotional. I remain prone to bouts of deep anxiety and depression. And I still have an addictive personality, a craving and a bone-deep oral need that I have learned to accept will never leave me. All of these factors entered my life during or after cocaine use, and never really left. \r\nTo me, every drug is like a woman. Cocaine is a dangerous, expensive, high-maintenance supermodel that flies into irrational rages and makes me drain my bank-account trying to make her happy. You know the one, with the deep tan, the long straight hair, the killer bod and the designer clothes. That's lady coke. She's a real bitch and a half, and she won't take no for an answer. I tried to break up with her several times before I was able to quit. I finally did it by removing myself to a location deep in the countryside  where there was no way I could get coke, and doing farm work for 6 months as a farmhand. I was prudent enough to kick the habit before I completely ran out of money, although at the end of the day I had no savings left. \r\nEventually I was able to get back up on my feet, quit drinking as well, and go back into business. There've been ups and downs, but all in all things are going well for me these days. I've brought my addictive personality to bear on my work and become a workaholic, and I also have a great wife and a nice place in the city. Looking at me today you'd never know I was a coke fiend years ago. I suppose many aren't so lucky.\n\n\n"
}