{
 "title": "I'm a Plane",
 "author": "General Mitchell",
 "citation": "   General Mitchell. \"I'm a Plane: experience with Inhalants: Freon (ID 39)\". Erowid.org. Sep 10, 2000. erowid.org/exp/39",
 "substance": "Inhalants: Freon",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 39",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 24504",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>In college my friends Craig, Erik, Todd and myself decided to purchase 4 cans of Freon from the local auto parts store and inhale one can per person.  I won't go into the details of anyone's experience save for Craig.</p><p>Immediately after inhaling the Freon he began to salivate and speak like 'Lucifer'...no lie!  His voice became very deep and onimous and he began babbling this and that...that is, nothing profound enought to capture my attention as I was under the influence myself.  Then he said something I will never forget, 'Look, I'm a plane!'</p><p>He extended his arms from his side and began to run around in circles.  The joy on his face was readily obvious, that is until he 'crash landed' onto his face with his tongue sticking out.  Needless to say we had him to the hospital to repair his tongue which was severed.</p><p>All in all, I would not recommend Freon to the light hearted.  And it may just be moot as you currently need a license to purchase it anyway.  As Grandmaster Flash and the Furious Five once said, '...don't do it!'</p>"
}
