{
 "title": "Duster Danger",
 "author": "Eric",
 "citation": "   Eric. \"Duster Danger: experience with Inhalants - Duster (ID 39000)\". Erowid.org. Mar 1, 2008. erowid.org/exp/39000",
 "substance": "Inhalants - Duster",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39000",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 1, 2008",
   "Views: 21547",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Huffing.  The stupidest thing in the world.  I had never done any type of mind altering drug before this.  I was completely unprepared for the experience.</p><p>My inexplainably horrible experience started, as most bad experiences start, when me and my friends were indefinetly bored.  We were sitting around and thinking of something to do.  Man there had to be something to do.  Then my friend brings up the bright idea of huffing air duster.  He said he had done it before and it was so much fun.  He said you can buy it at any store and it is legal.  To myself I thought, why not? I had never done anything, and hey, if it is legal....  </p><p>So we got a can.  </p><p>We went to his house and they started sucking on the can.  They seemed to be having fun so I grabbed the can and sucked some in.  Nothing happend, so I opted for more.  Still nothing.  I took a couple more breathes and then it started to happen.  I don't remember when it started to happen but when it did I sure knew it.  Suddenly everything went into slow motion.  Everything was choppy.  I read in another explanation of huffing that explained it as one frame for every 5 seconds.  That is very accurate.  I don't know how I found my way to a chair, but I was in it.  Suddenly my hand was gone.  What?! I couldn't feel my hand.  My head was spinning, what was happening.  I thought I would die.  I prayed to God that I wouldn't die.  Out of my choppy vision I saw my friends throw the can of air duster at me.  I couldn't catch it for my life.  It fell to the side.</p><p>I continued to sit there and I become panicked beyond the point of panic.  When would this hell end?  When will I come to my senses?  What was happening?  I thought this would be fun?  I was on the brink of conciousness, and I don't know if I passed out.  I stumbled to my feet and ran to the stereo, I needed music, something to connect me to the world.  I was detached.  Withdrawn into myself, but yet I was not myself.  Everything seemed to be just there.  I listened to the music, but I was still too panicked.  Slowly this began to wear off.  I walked around.  I was out of it for the rest of the day.  I felt really anxious.</p><p>This became the worst experience of my life so far.  There is no way, as with all bodily experiences, I can explain this to you.  The only advice I can give is that I would never do it again!  The physical effects are extremely bad.  I have read that it eats away at the mylean sheath, the covering of the brain, and many people have suddenly died from heart arrythmias which in turn lead to cardiac arrest.  Many people suffocate on their own vomit while passed out.  Be smart and stay away.</p>"
}
