{
 "title": "Deep Psychedelic Trance",
 "author": "J",
 "citation": "   J. \"Deep Psychedelic Trance: experience with Mushrooms, Cannabis & Nitrous Oxide (ID 39068)\". Erowid.org. Oct 19, 2007. erowid.org/exp/39068",
 "substance": "Mushrooms, Cannabis & Nitrous Oxide",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(tea)",
   " ",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39068",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 19, 2007",
   "Views: 4233",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I first tried mushrooms in the winter prior to this experience, and subsequently a few times in the spring and several times during the summer.  The only consistent aspect of my 15 or so trips prior to this point was their inconsistency; the same substance could never be counted on to produce the same effects, and I had experienced both glowing magical experiences with close friends and profoundly disturbing dissociation and confusion.  My previous trips pale in comparison, however, to this one.</p><p>As the summer drew to a close, I was to have one of my final psychedelic experiences at my friend W's house with him and his lady friend S.  We had about 7.5 grams of shrooms between the three of us.  Upon arriving at his house W decided he would prefer a milder trip and we divided the bag into 3 piles of crushed shrooms, approximately 3, 3, and 1.5 grams each.  Each of us prepared an infusion of the shrooms and drank it out on W's back porch; S and I each had 3 grams, and W had 1.5.  Upon finishing the tea, we decided it would be appropriate to load up my trusty 1.5 foot bong and burn one down to prepare to come up.  We each ripped about 2 hits; it was then time to break out the whippets.  Each of us loaded one cartridge into a whipped cream dispenser and inhaled it; the usual wah-wah's, ego splitting and brief dissociation set in.</p><p>As soon as I came down fully from the nitrous, about 2 minutes or so after inhaling it, things started to get interesting.  It seemed like the tea was already starting to hit me not more than 10 minutes after I started drinking it.  I had had little to eat prior to this, and I often find that mushroom tea, with the active chemicals dissolved in water, affects me much faster than actually eating the shrooms. With the added advantage that, sweetened with honey or juice, I don't have to taste the nasty little fuckers.  This, however, was more, and faster, than I had bargained for.</p><p>The first thing I noticed was that the curvature of the hill in W's backyard had sharply increased.  It appeared to be bent into a portion of a sphere.  I had been to and even tripped in this backyard several times before and it definitely did not normally look like this.  The pine trees at the edge of the hill also appeared to be bending along a similar curve and distorting in size and shape.  Around the same time that this occurred, I noticed an intense rush of feeling to my head, a sure sign that I was rapidly coming up.  I looked up at the sky; to my surprise, all I saw was a single cloud, but it had a deep blue hue and was shaped exactly like a Mandelbrot set. Fractal vision, to which I am now more accustomed.</p><p>These visuals were a lot more than I was used to for the first 20-30 minutes after consuming mushrooms!  A bit overwhelmed by the outdoor visuals, I decided to go inside W's house.  Well, if my intention was to climb out of the psychedelic hole I was rapidly falling into, that was a big mistake.  I began getting crazy patterning off of every object in the house that I looked at.  Nothing would sit still, and if I looked at any object for even a few seconds it would begin to come alive.  I went upstairs into W's bedroom and there observed a certificate on his wall from his fraternity at college.  I knew what this object was because that is what W told me, and I knew that the text on this certificate was written in Greek, but that is not the language that I saw.  Instead, I saw warped, alien characters that I believed to be the language in which is expressed the ancient knowledge of the sacred fungus I had ingested.  Still overwhelmed and now beginning to reach the peak of the experience, I excused myself and meandered downstairs.</p><p>The dimensions of the room I was in now were continually shifting.  I could not orient myself and my thinking was extremely clouded.  I could feel and hear only some kind of bizarre, ancient chant pulsating within my brain.  Unable to do anything else, I lay down on a couch and closed my eyes.  Wave after wave of psychedelia washed over me as patterns exploded before my closed eyes.  I saw pulsating connected bars of a thousand colors extending out toward infinity, and rotating, expanding grid mesh connected in circles and other geometric shapes spinning around.  The line from the Wilco song 'Radio Cure,' 'My mind is filled with silvery stars' quite accurately describes my condition at this point.</p><p>I do not know exactly how long I lay in this condition; what I do know is that when I finally experienced a lucid moment I began to walk toward the window and found S.  I looked out onto the pine trees again; both the trunks and their individual branches and needles were even further bent along this space-time curve than before.  Upon closer inspection any one of the trees would assume the shape of a bent snowflake fractal.  It was almost sunset at this point, and the entire outside world had assumed a deep purple hue.  I requested drawing materials from W, since I had used art to calm and focus myself previously during overpowering mushroom experiences.  My attempts were fruitless this time, however, since all I could manage to put on paper were a few lines representing an infinitesimally small part of my closed-eye visual field and the scribbled phrase 'Deep Psychedelic Trance'.</p><p>As I went upstairs again, the peak continued, and S and I experienced what can only be described as telepathy.  Both overwhelmed by intense visual and psychological trips, we found comfort in each other and together rode out the next several hours of the trip.  By approximately 5 or 6 hours after we first started to come up, we felt ready to return to the dorms where we were staying for the summer.  The intense visual effects did not subside fully, however, until a good 8 hours after the trip began, and I continued to have altered thoughts and consciousness for a long time thereafter.  I was unable to fall asleep until almost 8:00 in the morning, from tea that I drank at 4 the previous afternoon.  I smoked another bowl sometime between 4 and 5 AM, and that helped to finally calm me down.</p><p>Overall, it was definitely the most intense drug experience I have ever had.  Anyone who says that mushrooms are not as strong of a hallucinogen as LSD or what have you does not know what they are talking about.  I do not know exactly why this trip was so much more intense than my others, but my theories include the quality of the fungus, aspects of the setting, and the opening whippet which I had not experienced together with a psychedelic in any sense before.  It was a difficult experience to get through at the time but quite powerful and life-changing, and I am glad it happened to me.</p>"
}
