{
 "title": "Can't Live With It, Sick Without It",
 "author": "Jackal",
 "citation": "   Jackal. \"Can't Live With It, Sick Without It: experience with Venlafaxine (ID 39088)\". Erowid.org. Apr 15, 2007. erowid.org/exp/39088",
 "substance": "Venlafaxine",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39088",
   "Male",
   " ",
   "Not Given",
   "Apr 15, 2007",
   "Views: 7511",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On November 8 2004 my psychiatrist prescribed me to a new Anti-Depressant. My Doctor prescribed me 35 mg the first week and to take 75 mg the next week. I followed instructions very well. </p><p>2 weeks went by and I thought it had only been a couple of days since I'd been taking them. Everything became so confusing. I started withdrawing from society, and began to recluse into a full-size camper. It was so hard to think so I started a diary to keep track of what I couldn't remember.</p><p>After 22 days of taking 75 mg a day I realized from reading my diary I had been taking between 300 mg to 675 mg a day. This began to scare me so I stopped taking them, cold-turkey. What I didn't realize was that the medication had withdrawl symptoms. The next morning after stopping taking them, I felt extremely light headed. After I got out of bed I was so dizzy and light headed that I had to carry myself across the walls to use the bathroom. I made my way to the living room to watch television and felt like I need to lie down. After laying down my body felt very comfortable but the dizziness became so severe I started to get neausous so I sat up. I took every ounce of energy in me to hold my self up so I propped myself up against the arm of the couch. I felt really tired and started to doze off.</p><p>Later that day me and my friend were going to drive to a friends house to pick up some bud and possibly smoke a little. We drove the 30 mile trip and arrived without having any problems but a little twitchy-ness and some light headedness and proceeded to go to her bedroom. Me and 4 of my friends were passing around a bowl. I began to cough so severly I vomited on her carpet. We wrapped everything up and left. We decided to leave early because I was feeling so sick.</p><p>On the trip home my friend asked me if the bud was making me feel any worse and I told him that the buzz hadn't set all the way in yet and I told him that at the moment I felt a little twitchy and neausiated. We drove about 2 miles and he asked me if I felt okay and I told him the buzz set in and I felt alot better. The bud made it feel as if the buzz I had was the greatest buzz ever and I felt wonderful.</p><p>The next 3 mornings I woke up and felt the same way so I was always in a hurry to smoke a bowl because I feel less sick. The withdrawl symptoms I feel are twitchiness, neausous, headaches, back pains, slight narcolepsy, confusion, vomiting, diarrhea, stiffness, severe constant toughts of suicide (worse than before I started the medication), and chest pains.</p><p>If you are taking Effexor XR PLEASE I advise you not to stop cold turkey. Work your way off of it. Stay away from this medication and please research all of the foriegn substances you digest.</p>"
}
