{
 "title": "Failed to Enhance Creativity",
 "author": "Elric",
 "citation": "   Elric. \"Failed to Enhance Creativity: experience with Modafinil (ID 39124)\". Erowid.org. Jul 3, 2006. erowid.org/exp/39124",
 "substance": "Modafinil",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Modafinil",
   "(daily)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Bupropion",
   "(daily)",
   " ",
   "  repeated",
   "oral",
   "Lecithin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39124",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 3, 2006",
   "Views: 9915",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As a longtime user of coffee and yerba mate for my get-up-n-go. </p><p>In combination with</p><p> - Bupropion tapered off in preceding weeks</p><p> - soy lecithin/flax oil/fruit smoothy 1x day</p><p>Day 1 - 100 mg and I noticed very subtle increase in alertness and attention. Had some trouble falling to sleep that night, including some minor heart palpitations. </p><p>Then I took from 100 to 400 mg a day in 1-2 doses, for about 2 weeks. </p><p>Side Effects</p><p>Minor headache a couple of times (possible caffeine withdrawal or just dehydration?) and odd smelling pee after taking Modafinil on empty stomach. Slight reduction in appetite also. The appetite reduction also could be caffeine cessation related. In my experience caffeine use causes cravings of starch and carbs.</p><p>I went 1 week without have a single coffee and very little yerba mate and experienced no caffeine headaches or coffee urges. That is highly unusual for me. </p><p>Having sans-coffee 'fresh breath'! Ccoffee is a much stronger stimulant for me - it amps me up and slams me down more so than modafinil.</p><p>Coworker made a comment about the strong intensity of my concentration during this time  (coincidence?) </p><p>Several instances I definitely noticed being 'in the zone' for a extended periods of time. This is surprising considering I was sleep deprived and not drinking coffee.</p><p>Metabolism</p><p>During exercise, the Modafinil really kicked in. A serious adrenaline rush and cheshire cat grin on my face after only a few minutes of bicycling.</p><p>Sleep</p><p>Unlike amphetamines and caffeine, modafinil does not conflict with my sleep at all, that is, after night 1. In fact I think I had a heightened sensitivity to sleep requirements. I think I pulled only 1 all nighter during this 2 week period. Other nights I slept anywhere from 2 hours to 10 hours. It's a strange feeling to be physically and mentally tired but not feeling drowsy at all. At those times I was able to acknowledge that feeling and lay down for some easy sleep. Even if dose had recently been taken! If I want to sleep it's no problem. If I don't want to sleep, then it's no problem to stay up. </p><p>Motivation, Creativity</p><p>Although it gets rid of drowsiness very effectively, it does not do much for my motivation and creativity. This is worse in a sleep deprived state- in fact it's quite boring to be awake for a long time unless I am motivated and creative as well. </p><p>Conversely my peak experiences with modafinil were definitely when taking it in combination with good sleep, exercise, and meals. This is reassuring - for me it could fit into a daily regimen very easily. </p><p>Looking forward to generic modafinil in the meantime I plan to try adrafinil.</p>"
}
