{
 "title": "Mercury Rivers Flowing Through a City of Fear",
 "author": "Amittlmr",
 "citation": "   Amittlmr. \"Mercury Rivers Flowing Through a City of Fear: experience with Salvia divinorum  (20x extract) (ID 39131)\". Erowid.org. Mar 28, 2008. erowid.org/exp/39131",
 "substance": "Salvia divinorum  (20x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "45 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39131",
   "Male",
   " ",
   "Not Given",
   "Mar 28, 2008",
   "3140",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Day: The First</p><p>I get home from work shortly before midnite, say hello to my cat Isis and go to the fridge for the Honey Brown that had been calling my name.  It was a horrible night at work, my car had broken down, and a new stack of bills sat waiting on the computer desk for me.  My roommate walks into the kitchen while I grab the leftovers and the beer out of the fridge and hands me a little tube.  What's this, I quiz myself out loud.  Matt, my best friend, best roommate, and the ultimate babysitter just tells me to read it.</p><p>'Warning: not for human consumption!  For use as an incense component only!' - Written in bold, black letters, this is the first thing we see on the back of the bottle of standardized Salvia 20x tincture.  I quit reading the back of the bottle and turned to Matt.</p><p>We each smiled knowingly, realizing that the warning was soon to be ignored.  We conversed momentarily about when and where we were going to partake of Mother Mary's Herb and decided that my room on my bed would work for me.  It was already pretty late, my work day had been far less than great, and I hadn't been preparing myself for an experience, so we opted to wait until tomorrow.  </p><p>Day: The Second</p><p>I woke up today, well-rested, but with a sore back from having fallen asleep on the couch.  I remembered the plan but the soreness and sleepy eyes prevented me from wanting to do anything quite yet.  After a shower and a hot meal, I felt vastly more relaxed, jovial, and in-tune with my body.  It was time.</p><p>Matt and I venture to my room where I open the box of collected goodies and take out the Oaxaca Salvia foliage.  The sunlight broke through the window and cast beautiful cross-blind patterns across the comforter and added another sense of warmth and well-being to the scenario.  We dumped some of the almost powdered extract into my 10 mg scales and carefully weighed out a proper dose in the vicinity of 50mg.  We added that minute spoonful to the larger bowl of packed Divinorum.  I was in my room, ready, and willing.  Thoughts of previous 5x roller-coaster rides, 10x incapacitation and visits to other realms, and the 15x warpspeed space-shattering voyage I had before layered themselves on my psyche while Matt lit the torch.</p><p>The seemingly toxic smoke filled my lungs and burnt away all remaining sense of being.  Reality quickly shifted to what I can only describe as a Dali painting.  He removed the torch and the ashes remaining slowly faded into the patterning of the bowl.  The onset was too swift!  I was instantly debilitated and tried to hand the waterpipe to Matt.  I don't know if the pass was successful before I fell backward into the pillow.</p><p>All color, sound, and material was transforming before me to the same static blur.  Technicolor turned to black, and I laid alone, helpless to the effects that transcended me.  A chilling rush was felt around me.  This blackness was overwhelming, thicker than any void I've ever experienced.  I was cold.  I was scared.  I felt icy black hands grapple my back and then become part of me, pulling me, sucking me down.  I couldn't stop it.  These beings had a grip that only God himself could've loosened.  </p><p>As velocity increased proportionally with fear and tension, traveling at speeds only Salvia could propel, I saw a pinprick of light through the black velvet canvas.  That minute spark of something known breathed a sense of hope back into me.  As that singularity rapidly came closer, it geometrically spiderwebbed into streetlight shaped veins.  I recognized it.  It was the skeleton of a city, building itself from darkness.  </p><p>My speed began to decline abruptly, but I didn't really notice it until I was stopped.  I could see the tops of buildings, and thought that I recognized the town, but every time I shifted view, and then reverted, the town would change to a different one.  I stared hard downward trying to see the hustle and bustle of the street.  I focused my eyes clearly from thousands of feet up to catch a glimpse of life, but there was none to be had.  This was a city of movement, but nothing seemed be generating it.  I turned around noticing that the frigid fingers were no longer part of my flesh, no longer grasping me inside.  </p><p>I looked back down, and the town was again morphing, but this time it was no longer reforming itself.  Again, I stared hard at the streets, which were now wobbling, flowing, ebbing like a tide on the night of a full moon.  A strange light started eminating from the depth of the roads, from the bowels of this metropolitan beast.  The mercury-like water started lapping up the sides of the buildings, pulling portions of them asunder, gripping them like those hands had gripped me.  </p><p>Memories of real things began to invade these visions, and soon, non-deceptive eyesight found me again.  I blinked and there was the ceiling staring back at me once more.  There was my friend, at the foot of the bed, waiting for my trance to subside.  I shook off the last shreds of darkness along with the comforter that Matt had covered me with during my visit.  He was grinning, ear-to-ear.  He looked at me quizically, facially asking me how it was.  Vocally, I asked him for 5 minutes so that I had some time to regain myself.  Which is exactly what I needed to do, after having lost myself for so long.  </p><p>It was his turn next.</p>"
}
