{
 "title": "Insomnia Cure?",
 "author": "Sue",
 "citation": "   Sue. \"Insomnia Cure?: experience with Melatonin (ID 39140)\". Erowid.org. Jun 21, 2007. erowid.org/exp/39140",
 "substance": "Melatonin",
 "bodyweight": "201 lb",
 "header": [
  [
   "DOSE:",
   "3.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39140",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2007",
   "Views: 13885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have suffered from mild to moderate insomnia since high school, Im currently 21, and after reading many glowing testimonials about melatonin I decided to give it a try.  I have taken valium, both prescribed for sleep and recreationally, Vistaryl, a prescription antihistamine, and trazadone, an anti-depressant also used sometimes for sleep. None of those have been good long term solutions for me, I experienced bad side effects from the trazadone and with the valium and Vistaryl I would experience rebound insomnia that would keep me up for days. About the only thing that has reliably gotten my to sleep on time has been smoking some pot before going to bed. </p><p>I had been on something of a bender the last week, kind of heavy drinking for the last five days, and had gone through a bottle of hydrocodone (Vicodin) syrup and a few pills. The next few days I had some extreme trouble sleeping and was very irratible. I bought a bottle of melatonin tablets at my local atore, it was pretty inexpensive at 120 3mg tablets for six bucks. I took one 3mg tablet, according to the directions on the bottle, at around midnight. </p><p>In about two hours I found myself very tired, almost akin to the way I get after shooting a little dilaudid. I woke up several times during the night, probably around three and slept till nearly twelve the next night.  I was a little groggy in the morning but the way a period of overindulgence will screw up my sleep cycle the melatonin was like a miracle. I'm taking half the dose tonight, 1.5 mg, since I have to get up early tomorrow and I am not sure if my morning grogginess was a result of the melatonin or not.</p>"
}
