{
 "title": "Life Through Weird Colored Glasses",
 "author": "AmBien1",
 "citation": "   AmBien1. \"Life Through Weird Colored Glasses: experience with Zolpidem (Ambien) (ID 3915)\". Erowid.org. Apr 10, 2001. erowid.org/exp/3915",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3915",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2001",
   "Views: 125997",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was about 7:00PM on a Friday when a friend and I decided to dose up on the prescription drug AmBien. Pharmacutical companies developed it to have a lower abuse potential than benzodiazepines but that's really not the case. Anyway, each of us took one 10mg tab (Me 120lb, him about 170lb) and waited 15 minutes to start our journy on foot across town to another friend's house to watch a movie.<br>About one minute into the trek the drug started to kick in. Suddenly it seemed that the only things that existed were just us and everything else was just, well, ambient. The way I began to look at things changed in a way it's almost impossible to describe. Seeing the cars and the hills and the stores it's as if the world's 'personality' had changed. Cold and rainy nights have a personality, warm and sunny spring mornings have a personality, swaying wheat on autum hillsides have a personality; AmBien just changes it into something friendly and dare I say strangely omniconscious.<br>That sense of social 'togetherness' in mind, ravers would almost certainly find this drug appealing.<br>It wears off gradually and by the time we got to our destination it was pretty much over (about 45 minutes later).<br>As far as more traditional effects go, a slight depression of inner ear function, loss of inhibitions, and a difficulty in doing mental tasks are about it. A lot of people report memory loss at even low doses. Also, I've seen cases where at high doses there is a loss of motor control.<br>By the way, difference between 10mg and 20mg is pretty big, so remember (or don't remember) that amnesia is very common at doses 20mg and above. 30mg is liable to give someone 180lbs a total loss of motor control.<br>Overall, AmBien is one of my favorite drugs.\n\n\n"
}
