{
 "title": "Much Mellower",
 "author": "Reynaldo",
 "citation": "   Reynaldo. \"Much Mellower: experience with Morning Glory (Pearly Gates) (ID 39163)\". Erowid.org. Apr 18, 2007. erowid.org/exp/39163",
 "substance": "Morning Glory (Pearly Gates)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "550 seeds",
   "oral",
   "Morning Glory",
   "(ground / crushed)",
   " ",
   "  ",
   "smoked",
   "Cannabis - Hash",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "39163",
   "Male",
   " ",
   "Not Given",
   "Apr 18, 2007",
   "3147",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I think that my experiences have been quite a bit less paranoid in nature than those that I've read here. I may be a bit older than some of these people and have had some experience eating Mexican MG seeds (rivea corymbosa) mushrooms and peyote with the Mazatec and Huichol Indians in Oaxaca and Nayarit Mexico.</p><p>I ground the seeds in an electric coffee grinder that I only use for Kava, peyote and MG seeds.I mixed them with water and drank the whole thing down followed by a large glass of water. It seemed to take a good two hours to come on. It did make me slightly queezy but not actually sick or nauseous. I took a walk in a quiet country place where I wouldn't be likely to see anyone. I did take a few hits on the hash pipe just to encourage it a little. Shortly afterward,about two hours after eating the seeds, things started to move around, trees seeemed to get up and dance around a bit. The effect was pleasant, but starting to get strong and acid like.Within minutes a had a strong peak reminiscent of a peyote trip. The overall feeling it gave me was grounded and earthy. I felt as though I could sense my footsteps resounding deep into the earth and my hallucinations were colorful flowing Aztec/Maya patterns that lasted late into the night. It was a very refreshing experience.</p><p>I should also say that I grow my own seeds and wouldn't trust the store bought variety which can occasionally be treated with disagreeable chemicals. I really like the seeds and I think they are better than the best acid. Pearly gates kick serious booty!</p>"
}
