{
 "title": "Rebirth",
 "author": "Shouhei",
 "citation": "   Shouhei. \"Rebirth: experience with Syrian Rue, Mushrooms - P. Cubensis, H.B. Woodrose Seeds & Cannabis (ID 39173)\". Erowid.org. Jul 10, 2007. erowid.org/exp/39173",
 "substance": "Syrian Rue, Mushrooms - P. Cubensis, H.B. Woodrose Seeds & Cannabis",
 "bodyweight": "11 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 capsls",
   "oral",
   "Syrian Rue",
   "(capsule)",
   "  T+ 0:15",
   "25 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)",
   "  T+ 0:15",
   "10 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39173",
   "Male",
   " ",
   "Not Given",
   "Jul 10, 2007",
   "3933",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: Combining MAOIs with other psychoactive drugs carries serious medical risks and can result in extremely unpleasant side effects, overheating, nausea, confusion, heart problems, and even death. Please see Erowid's MAOI Vault]</p><p>I took 2 capsules of syrian rue around 11:45, at 12:00 I ate 25g of Mushrooms, and also drank a solution containing 10 Hawaiian Baby Woodrose Seeds that I had made the night before. I noticed stomach irritation as I was drinking the solution, and retched when I got to the bottom, where all the bits of seeds had sunk.</p><p>For around an hour after this everything was fine, a normal trip, great OEVs, no noticable CEVs. By around 12:45 I decided to have a little smoke of some cannabis, to soothe my stomach, as I was feeling very groggy by then. The cannabis helped slightly, but at approximately 13:00 I vomited violently, which put me into major shock. The trip was coming on very very strong, and the shock of being sick made me want to go to sleep. This was very traumatic, I thought I was going to die, my breath was short, and I was shaking.</p><p>I proceeded to go to the bathroom at the other end of the house, with the intention of having a shower. Once I got there I couldn't walk properly, and managed to sit on the side of the bath, before I half-collapsed on the floor, unable to stand. This is where I stayed for the most part of the trip. I was sure I had died, by around 13:45 my trip sitter was very worried, and offered to call an ambulance, but I told him not to knowing that this would cause unnecessary stress on me, and my other friend who was also tripping on just mushrooms. </p><p>My trip sitter had to leave at 14:00, so I was alone in the bathroom. I have never experienced a trip of this magnitude, for the most part I had my eyes shut, in a sort of half sleep state. I felt like I was in another world, I was experiencing major auditory hallucinations, as well as OEVs and CEVs. I was convinced that I was going to be born again, as I had died. I felt like I was back in the womb, I could imagine anywhere and feel as if I was there.</p><p>The trip got stronger as I peaked, it must have been around 15:00 - 16:00 and I was still stuck in this catatonic state, singing and laughing to myself on the bathroom floor. By this time I think the shock had worn off, but I didn't try and get up. I felt like there was a warm blanket around me, protecting me. I can't explain in detail what was going through my mind at the time, as I can't fully remember. When I stretched I felt like I was a million miles long, I could perceive anything I wanted to by this stage. </p><p>By around 17:00 I had started to come down, my parents returned. I started to reawaken and by about 18:00 I emerged from my sanctuary. I still felt as if I had died, and I thought I may have gone to heaven, or been given a second chance. I couldn't understand what had happened. I was still seeing things in the wrong colours at around 19:00 and I think the effects only really wore off around 21:00. </p><p>This trip was possibly the most emotional experience of my life, I can't explain how mind blowing it was. I urge anyone who tries this combination to have a good trip sitter around, and to be prepared to vomit. I really wasn't expecting the vomit, and I think that is what sent this trip on a downward spiral. I would consider myself an experienced tripper, and I've experienced all these substances before, but this trip was much much much more intense than anything I have ever experienced before.</p>"
}
