{
 "title": "Untold Truth",
 "author": "Pappy",
 "citation": "   Pappy. \"Untold Truth: experience with Datura (ID 39179)\". Erowid.org. Aug 16, 2006. erowid.org/exp/39179",
 "substance": "Datura",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "800 seeds",
   "oral",
   "Datura"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39179",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2006",
   "Views: 29731",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: 800+ Datura Seeds is considered an extremely high dose, see Datura Dosage]\r\nSummary:\r\nDose: 800-850 Datura Inoxia Seeds\r\nTime until trip: Approx 20 mins\r\nTotal trip length: Approx 28 hours\r\nMost memorable effect: 'God Feeling'\r\nOther effects: SEVERE distortion of time perception, memory loss, pain when memories return, mental confusion, stupidity, slightly itchy throat, extreme mydriasis (dilated pupils), horrid BOREDOM, stimulating effect, trouble reading\r\nThis wasn't my first time trying Datura. Me and my friends had been experimenting with it for quite a while, but all the doses that worked for them did nothing for me. One day I came home and I was just depressed and I didn't care about living anymore. I read so many times about how high doses of Datura can cause death, and since they've never effected me before I figured I would go ahead and take all the seeds I had left.\r\nTo prepare for this I started a journal and I wrote down the time and what I did. I wanted to mark down everything I did, and see if hopefully I would write something while tripping. I didn't take any other safety precautions, since I really didn't care.\r\nAt 3:40 I started to eat the seeds. I just put them in my mouth, chewed them, swished them in my spit a bit, and sucked them dry then swallowed. I was done with this around 3:55, having eaten a little more than 800 seeds. This was well over my usual dose of 80-120. I then just sat in my room for like 10 mins, thinking about how horrible the taste was and how much I wanted to throw up. Then I got up and went to the bathroom about 20 mins after taking the seeds. I went in, did my business, and opened the door to leave. It would be 4 hours until I realized what I was doing again. \r\nThe next thing I remember is being in my kitchen, completely soaked, wearing nothing but my underwear and ranting about how we needed to put the syrup packets in the freezer right away. The rest of the night was spent walking around my house talking to a bunch of friends of mine and my sister. My tuxedo came to life and floated around my room, then morphed into a giant, horrid, grotesquely deformed head. I can't remember much, just little snippets. I remember sitting down on my bed and being transported to school and having to go through half a day of school without a shirt on. I would also keep coming into my room, sitting down for 5-7 minutes, and then think 'oh my god, I've been sitting here for like 40 mins now, I'm so BORED!' and get up and walk around again. I didn't get to bed until around 4:30 AM the next day.\r\nThe description of how I felt during this is hard to give. I felt like there was 2 worlds I would go between. I wouldn't say I was worried about ever doing anything stupid in the 'real world' because as soon as I would hear a loud sound, or anything would move fast, or I would feel threatened in any other way I would instantly snap back and be almost completely normal. I would only hallucinate if real people weren't talking to me. Talking to me was hard, it seems, because unless you did something to bring me back to this world I didn't really do anything except sit there and stare at you with my mouth open. The feeling of the other world was strange. I felt dead to everything around me. My senses didn't seem like they were working. I would hear things but I wouldn't feel like I was actually hearing them. I would see things without feeling like I was using my eyes. There was something huge missing, but I can't describe it. I just felt dead.\r\nThe second day was the best, after most of the seeds had been digested and a majority of the toxin had worn off. I decided to walk outside for some reason, I can't remember why, but I'm glad I did. When I opened my door and stepped outside I looked around at everything and I started talking to myself in my head, but it wasn't me talking. It was my voice and everything, but I wasn't telling it what to say. It told me that everything around me that I saw I created myself. It told me that it was all created from my mind, that everything in the world was from me. \r\nI saw things the way I did only because that's how my mind chose to show them to me. He told me that if I could learn to change my thoughts, I could change the way everything in the world looked and reacted. I could manipulate every facet of reality, because reality doesn't exist. Everything is an illusion, the only real thing is yourself. It was an incredible feeling of power and control, but also made me feel empty inside. If everything in life is really decided and created by my mind, then what's the point of living? Life isn't random, the outcome of the future is decided by you. What's the point in going on then? But I didn't feel like dying.\r\nAnyway, the rest of that day was spent talking to other friends that weren't really there. It was much better the second day, because I could tell they weren't really there. I also did a lot of sleeping, since the seeds seemed to have a stimulating effect. \r\nAn interesting side note: About 2 or 3 days after taking the seeds, I was just down in my basement doing some stuff and I started getting flashbacks of what I did during those 4 hours I can't remember. They were VERY painful mentally and physically. My mind would flare all sorts of images, in fast motion, then slow motion, then normal, then slow, then fast, etc. I would feel nauseous and get dizzy. This was always accompanied by headaches that didn't last too long.\r\nOverall my experience wasn't bad. Wasn't that great either. My one friend was hospitalized off of 300 from the same plant.\n\n\n"
}
