{
 "title": "Not A Great One",
 "author": "Kizer T",
 "citation": " Kizer T. \"Not A Great One: experience with 3C-P (ID 39180)\". Erowid.org. Dec 23, 2004. erowid.org/exp/39180",
 "substance": "3C-P",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "3C-P",
   " T+ 4:00",
   "25 mg",
   "oral",
   "3C-P"
  ]
 ],
 "footer": [
  [
   "2003",
   "39180",
   "Male",
   "",
   "Not Given",
   "Dec 23, 2004",
   "16687",
   " "
  ]
 ],
 "report": "<p>Had 50 mg of 3CP. Have never done this before, or know anyone that has, not even the individual who gave it to me knew of anyone trying it. However I was told it was active in the 50 mg range. I was very cautious, and didn't want to do the full 50 mg, in case it was too much (other rc's it would be too much). So I did 25 mg, told my girlfriend, and she drove into the country so we could hike with our dogs. I'm having to recall upon memory as it was over a year ago since I did it, but with no reports available I felt I should throw in my two cents, sorry it's not in proper report format, too much time has elapsed.</p><p>It came on ok, wasn't too strong, not exceptionally stimulating, sort of 'like' 2ct2, but not quite as good, didn't feel as happy as on 2ct2. After what had to be three or four hours, when I was sure there where no surprises waiting for me, I'd past peak, I took the other 25 mg. It seemed a waste not to, it wouldn't do much for me at this dose, so might as well piggy back on what I had going on. After a couple hours or so the effects went up a notch, and overall it lasted (taken this way) about eight hours. I wasn't that impressed with it, but I'm not much for amphetamines. It didn't feel like an amphetamine, it was definately psychedelic. But not a great one. I was grateful for the opportunity to try it. I felt it made me a little irritable (but that might have been external influences), but my partner never knew that or even suspected it, so it wasn't a heavy component, something I could easily cover up. She'd ask me occasionally how my experiment was going, so she couldn't tell I'd taken anything. Could definately interact with anyone if needed. </p><p>Thats about it. I dont think I'd try it again, wasn't that great for me (didn't dislike it), but very valuable for experience sake. </p><p>If you come across some, do start small (safety, safety, safety), I see that the listed dosages here are considerably smaller than I did. I'm not a hard head, in fact I usually require only about 50% of the listed dose for full effects.</p><p>I hope that my two cents helps, but it's still very little to go by.</p>"
}
