{
 "title": "Tripping with my Girlfriend ... Sort Of",
 "author": "Caveman",
 "citation": "   Caveman. \"Tripping with my Girlfriend ... Sort Of: experience with Mushrooms & Cannabis (ID 39191)\". Erowid.org. Apr 29, 2007. erowid.org/exp/39191",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39191",
   "Male",
   " ",
   "Not Given",
   "Apr 29, 2007",
   "7021",
   " "
  ]
 ],
 "report": "<p>I've took shrooms quite a few times before this time and for some reason I've always taken them with a girl named Carissa(who is my girlfriend now and at the time of this trip) which I have now decided isn't really the best idea because shrooms can make me real emotional and she can make me real emotional even without shrooms. I had picked up an 1/8 of some shrooms that I had been told were good and potent. Even before we were going to eat them me and carissa couldn't agree on where to go, what to do, or even when we wanted to eat them. I finally agreed to eat them at her house a day before I wanted.</p><p>So I met her at her house after she got home from school. We split the 1/8 drinking it down with big glasses of O.J. We watched t.v. for probobly 20 min. then decided to toke up a bowl to pass the time while we wait. So we got nice and stoned right as the shrooms started to kick in. We had decided earlier it would be cool to walk her dog so we took a walk down the street while the shrooms took effect. It was a windy day with a bright blue sky. The large leafless trees swaying were really cool to watch and could actually be mesmerizing. The day was beautiful, perfect for shroomin. But once we reached the corner of her block she decided she wanted to visit someone. I really dont like very many of her friends and most definatly didn't want to see them while baking. So I went back to her house and she went and saw a friend of hers with the dog.</p><p>She wasnt frying nearly as much as I was. She seems to have a much higher tolerance than I do. My walk back to her house was a fun happy journy of blue trees and a beautifuly bright shining sky. I returned to her house sitting in her driveway then her back yard just enjoying the beauty of the day and also a fun array of objects forming in the walls. Carissa returned 15-20 min. later. Now I could tell she was frying pretty good. She then brought me inside where her older brother was chillin watching t.v. This was not really the coolest thing. Neither me or carissa wanted to sit and watch t.v. so we decided to go on a walk again. And once again at the street corner she decided she wanted to go visit people.</p><p>So once again, even though she knew I didn't want her to, she took off and told me she wouldn't be long. I told her please be quick. I mean shit, I split them with her because I wanted to hang out with her. This lone trip back to the house was not like the first one. This one was more one of disapointment that she wouldn't just hang and fry with me.</p><p>But luckily I pushed it out of my mind just sitting in her driveway up against the garage door. I was just feelin to damn good on such a beautiful day to get down. So there alone in front of her house I started to peak. It was most definatly great! I felt a real sense of oneness with the world. Lots of things were just changing from one color to the next. The brick wall across the street was fun to just form objects in with my mind.</p><p>After 10-15min., which seemed much longer, a couple friends of mine happened to walk by and see me sitting in the driveway. Wondering what the hell I was doing just sitting there they came over. Neither of them had ever shroomed so when I let them know I was fried, they got big kick out of it. I was still peaking and they could tell I was in a different world than they were. They asked questions and I tried to explain but it's not easy to describe how your feeling when your shroomin. About  10-15 min. after they showed up carissa returned. Since the wind was blowing pretty hard carissa opened the garage for us so we could smoke up another bowl.</p><p>Being in the garage was kind of wierd it killed my sense of oneness with the world anyway. I really just wanted to watch and love the sky and trees in the wind. After we smoked the bowl carissa went inside. I wasn't really feelin going inside so I stayed out just tried to enjoy myself. My friends were still just chillin out front with me even though I was paying little attention to them. 5-10 min. later I decided I'd go inside and maybe try and be with carissa now like I had wanted to begin.</p><p>But when I entered carissa came at me kind of angry because I hadn't come right in and she had wanted my buddies to leave because she said they were killing her trip and (once again) she wanted to leave to her friends house again and felt she couldn't leave with them there. Just coming from the serene beauty outside the sense of her being angry really sucked. I really really did not want to fuck up her trip and felt real bad that I had upset her. The fact that she wanted to leave again upset me even more.</p><p>I asked her please not to leave. She then started to accuse me of ruining her trip and I'm not sure exactly but we began argueing and this arguement with my girlfriend made me feel real bad. I began to wish I had not eaten the shrooms. I just wanted her to want to be with me and it wasn't going to happen. I broke down. I started to cry. I didn't want to be crying. Carissa immediatly stoped arguing with me and said 'fine' she wouldn't leave. I only cried for proboly 30 sec. but still didn't feel any better afterward. I felt even more like a piece of shit because I felt I was ruining her trip.</p><p>I was still much more fried than her. I had put in some laundry before we started trippin so to get my mind off of feeling like shit I went to the dryer and decided to fold my clothes. I asked carissa to please not tell anyone I had cried like that. I then sat on the couch next to the t.v. and just put all my attention into it. It actually helped little by little. Me and carissa then decided it was a better idea to call her friend and have her come down there with us instead. I watched t.v. and gradually felt better thanks to the aid of the simpsons and king of the hill. </p><p>Carissa's friend elaine showed up. I was still feeling bad over the whole incident but not letting it affect me. My fry was dying and I was in the last satge of shroomin where my brain is still all mixed up and my body just feels lazy. So we smoked somemore dank then just sat in the livingroom talking and watching cartoons. About an hour or so later elaine took off and I finally got to just chill and sit with my girl like I wanted all along.</p><p>The next couple days I felt really down even though afterward I was glad I had took them because for alot of the trip I did have alot of fun. But now me and my girl are't getting along and it really sucks for me because I love her alot. The trip really reflected our lives and just exagerated problems we already have without being on shrooms. But the days after shrooming are always days where I don't feel like doing much except thinking and reflecting and I have learned alot and feel I am going to be able to do a much better job working things out with her. Now here in a week or so I plan to get a good sized batch of some more fungus. I may or may not shroom with her again but if not I will definetly hook her up with a little so she can go and shroom out and visit her friends like she wants.</p>"
}
