{
 "title": "Blue Lotus Super Tea!",
 "author": "Catfish Rivers",
 "citation": "   Catfish Rivers. \"Blue Lotus Super Tea!: experience with Blue Lotus (15x extract) (ID 3919)\". Erowid.org. Apr 8, 2001. erowid.org/exp/3919",
 "substance": "Blue Lotus (15x extract)",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3919",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 8, 2001",
   "Views: 71741",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have tried to make a tea prior to this experience straight from crushed plant material to a mild effect. Having aquired 60g of 15x extract from an online vendor, I tried to make a tea out of it, The extract came as a black tar that smelled very much like a raisin. So, I broke 1/5 of a 20g bar of tar off, tore it into small rat turd looking peices, placed them in an oversized mug, added hot water (about 1 1/2 cups), 2 cap fulls of lemon juice, and some yummy honey. I had to stir it for about 10 minutes to let all of the extract dissolve. </p><p>Despite the water turning muddy brown, the tea actually had a distinctly pleasant taste to it. The whole cup was drunk in about 15 minutes. Within 30 minutes I could feel effects. Something of a pleasant sedation, a little bit like eating marijuana, but more lucid. This intensified over the next 2 hours. I felt a pleasant activation in my temples and third eye area. I almost felt as if I was tripping slightly. No visuals or anything, but a somewhat altered head space. My body also became very relaxed. After 2 hours I decided it was time for a bowl of MJ, which synergized well with the tea. However, I did fall asleep soon after. </p><p>The tea provided a very relaxed state, slightly euphoric but more hypnotic in nature. I have used this tea to take the edge off of a 2C-T-2 trip, and also several times to relax after a long day of working. It is very nice to take a hot bath while drinking a cup of the tea. I am very satisfied with the 15x extract and am planning to use it in conjunction with some TFMPP, as both have been compared to MDMA here and there on the web.</p>"
}
