{
 "title": "Chatting with Friends",
 "author": "Rolandofgilead",
 "citation": "   Rolandofgilead. \"Chatting with Friends: experience with Cocaine (ID 39222)\". Erowid.org. May 22, 2007. erowid.org/exp/39222",
 "substance": "Cocaine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39222",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 22, 2007",
   "Views: 9694",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off, I like drugs. I have had many trips on shrooms, acid and e. I have always enjoyed the way my mind reacts and operates in different manners from my regular view of reality.  I thought I was set with the hallucinogens and ecstacy, but i tried cocaine for the first time this winter.  My roommate who is a common trip companion and a couple other friends introduced me to yayo, and it was fantastic.</p><p>We had gotten out of work one night and were hanging at my apartment.  One guy, the dealer in the group, said that he had a gram and that everyone was welcome to it.  My roommate then confessed that he had tried it a week earlier.  The fourth friend said he had used it for a few years off and on.  We busted out the mirror, razor and pen tube and went to town. </p><p>I sat there for a few minutes after my line. First thing I noticed was my front teeth being completely numb.  I told the group that and they chuckled.  After those first words, I didn't shut up til I crashed.  I felt complete euphoria.  We did lines about every 15 minutes until the stash was gone.  It was abosuletly phenomenal.  When each line hit me, I just had another jolt of the feeling that everything was good.  and i mean everything.  and I just wanted to talk about it.</p><p>I just kept telling stories about my past and the emotions they brought up when I remembered things.  I told my friends how much I loved them, what I loved about them, what I didn't (and friendly advice on how to change), my memories of them.</p><p>I was in a state of calm, even though my body was uncontrollably jittery.  But I didn't care, in fact I loved it.  Everything was just cool.  I was the fonz.</p><p>Everybody else was real cool during the whole thing, even with me blabbering away like a fool most of the night.</p><p>We listened to a lot of music that night while stuffing our noses.  We just kept playing songs from my roommate's mp3 collection that had emotional connections for each of us.  With each new one, we would point out the emotion connected to it and the lyrics we loved.  Each story led to another and another and another.  I have never had that much fun listening to music and talking.  I've had good times doing it clean, but with the coke I just on top of the world.</p><p>I kept suggesting we do more lines, but my friends kept the pace down since it was my first time.  We still killed the gram in only a couple hours, which was longer than I expected to last.  The whole time there were 3 main feelings I had. First, I definately wanted more and more (still do the couple times I have done it since the first).  I see where this could lead to a nasty habit.  My roommate and I made a pact to only do it around each other and to discuss our dosage.</p><p>Second, I could not believe how wired I was.  It was like a gallon of espresso was hooked into my veins. I was bouncing to the music.  I was clenching my teeth something fierce (gum helped alleviate that).  I had no desire for food, even though I knew I was starving.  I forced myself to drink water to keep myself hyrdated which I recommend for any drug.  I did not have any trouble going to sleep that night when I finally decided I should.</p><p>Third, I had a couple emotions that were prevalant througout the whole thing.  One was a feeling of everything being 'cool.'  everything was right with the world.  I compare it to a low level ecstasy trip.  The other was the confidence I had.  I felt I was in complete control of my life and, there was nothing I couldn't accomplish.  Top of the world.  It was exhilirating.</p><p>The next day I was groggy and felt no worse than a bad night of drinking.  All in all, it was a very positive experience.  Since that time, I have done it 4 more times.  Everytime has been a great experience.  A bit on the expensive side, but it is a rush and the after effects are not that bad.</p>"
}
