{
 "title": "A Date with Lucy",
 "author": "High0",
 "citation": "   High0. \"A Date with Lucy: experience with LSD (ID 39249)\". Erowid.org. Feb 15, 2007. erowid.org/exp/39249",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39249",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 15, 2007",
   "Views: 4036",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Mindset:</p><p>Having done acid for the first time previously less that a few days before this trip, and having found it to be a truly mind expanding, soul cleaning, positive, wonderful, and fulfilling experience, my personal mindset for this particular trip could not have been better.</p><p>Myself and two other close friends, both of whom had been present at my first trip, which also happened to be collectively, our first trip. We decided to plan a trip into a small country house located in a small village somewhere along the west cost of the UK. As with any well planed trip we came prepared with all the usual suspects, namely shit loads of top notch music, some hash, food, an open mind and youthful sprit. When we arrived it was within an hour of dusk. We each dropped a trip of strong acid. As we waited for the trip to come on, lets call him bob, set up the sound system, while I rolled a joint. Nothing like a smoke to kill the jittery first hour or so before the onset of the trip. In retrospect nothing could have prepared me for this trip.</p><p>To set the scene, we were in a large 120 year old house, the kind with walls that are about 11ft high. The walls were ordained with green wallpaper depicting flowers, and vines. The carpets are red and cream also with interesting visual patterns. We were located in one of the upstairs rooms and had moved beds and comfortable armchairs up there on a very drunken previous party. Suffice it to say there was more than enough room for the 3 of us. So there we were, the three of us, set up comfortable wise, beckoning the onset of the trip.</p><p>As the music began to echo and reverberate through the room, I noticed that the patterns on the wall paper were starting to twirl slightly, this was about 1 hour after dropping. Within 2-3 mins I was seeing strange cartoon faces in the walls and textures appeared sharper, the trip had begun and I was loving it. In retrospect I got the most trip out this trip for some reason. The other 2 were still coming up. We decided to go for a walk around the house, it now being dusk and with poor lighting in the other rooms, they took on the twilight of the night. There was this fantastic energy flowing through my veins; I loved every blissful second. </p><p>My recollection is slightly faded of the events on that night. We wandered the house, exploring rooms, and watching the shadows morph and attack each other, forming a vivid and brilliant visual symphony. I felt like a child again, every object having a life of its own bestowed upon it by LSD. Every nerve in my body was suddenly awakened, charged with a glories energy. We may have spent 45-60min wandering the downstairs like 3 doped-up headless chickens. The other two enjoyed the experience also.</p><p>We then went back up stairs for a smoke. I had discovered on the pervious trip, that while on LSD I enjoyed to draw with a pen a paper. So I began, I could fell every movement of the pen as it glided over the page, and did some really nice and highly creative stuff.  Again in retrospect LSD unlocked in me the ability to draw and not only when Im on it, so I recommend that everyone give it a go. I did this for about 1 hour, stopping some times to chat to the others and laugh at things, and sometimes even trying to communicate the incomprehensible joy that is LSD, finding that a knowing glance is all it takes. This was one of the most pleasant and relaxing times in my life.</p><p>For a change scene we migrated into one of the other rooms. It was small and had no working lights, and a bed. The others got up and stood on the bed and started laughing and walking around on the bed, then left the room. I had to give this a try. By this time I was tripping balls and the world had become a complete symphony which I had become completely immersed in, it was awesome. Getting up on the bed I stood there, and couldnt not see what all the fuse was about, then as I walked around, it felt like a water bed, I stared to sink into it laughing my arse off. I got off the bed and proceeded to look out the window and I began to hallucinate. I saw this army guy swinging in a tree just outside the window dressed in full military fatigue with a gun, and some other really cool shit. I called the other two back in to have a look, but they failed to see anything. For some reason they werent trip as hard as me. </p><p>I went back into one of the other rooms to relax, chill and begin to draw again. I did this for a while. The next thing I know, after drawing some great stuff, was that when the other 2 talked to me there voices sounded metallic and echoed. I was really wasted, they asked me if I was ok, and I reassured them that I was. I was loving every second of this. Then the other two went back into the other room where the music setup was. I stayed alone in the other room drawing for about 30 mins drawing. Then bob came in to get me and took me back into the other room for a smoke.</p><p>Im not sure what happened next but as I sat there I had this wave of joy, and extreme lack of concern for every thing, as I just experienced pure, simple elementary existence. As far as I could see all that existed was my joy. It was the most peaceful I have ever felt and something I will never forget. I think my friends were getting concerned about me, the ask me if I was ok, I could not even talk I just sat there nodded and smiled. I will never forget that feeling. I think it lasted for 5mins. It was extremely profound. After that extreme high the trip began to decline.</p>"
}
