{
 "title": "An Accidental Overdose",
 "author": "Mia",
 "citation": "   Mia. \"An Accidental Overdose: experience with Bupropion SR (ID 39289)\". Erowid.org. Dec 27, 2004. erowid.org/exp/39289",
 "substance": "Bupropion SR",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39289",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 27, 2004",
   "Views: 29552",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am prescribed 300mg of Bupropion (2 100mg in the morning and 1 at night). I got impatient and decided to take all 3 in the morning. I had done this before with no problems so I didn't think twice about it. I've been on it for about 7 years and the only problem was a seizure about 2 years ago that came about from the Bupropion mixed with a hypoglycemic episode (I hadn't had anything to eat other than a coke). </p><p>About 2 hours after I had taken it I went to wake up my fiance and all of a sudden felt as though I was having a dizzy spell so I went and laid down. After about 10 minutes it seemed much better so I stood up but as soon as I did so it started again. It wasn't too much longer until my whole body started to shake uncontrollably. Next, I couldn't feel my legs. This scared me tremendously. After about 45 minutes of this I started having tunnel vision which quickly worsened. If I would just stare I would have black outs but as soon as I moved my eyes my vision came back but not for but a few seconds. I had to keep looking around if I didn't want to completely black out. Everything was roaring in my head. Everything was so loud and the ringing in my ears was terrible. I started to sweat and I felt as though I was laying under a heater of some sort. I was given a cold rag but it cooled off quickly. I started to stare at it and I began to see people in the rag. It looked like a black and white roughly sketched animation. This was even more disturbing. My body was still shaking. </p><p>Next I started heaving but since I hadn't eaten anything that day nothing came up. After about 3 hours of this I was finally able to feel and got up to walk. I was extremely wobbly but with help I made it to the bathroom. It took about 8 hours for the shaking to stop (the lasting effect of it). I did research on Wellbutrin the next day and read up on the kind of seizures it can cause and found that a 'sensory seizure' described my experiance perfectly. My doctor said it sounded as though I did have one. </p><p>I would never recommend taking this recreationally and if you take it for a prescription TAKE IT AS DIRECTED! I do consider myself to be an experienced drug user and I must admit that this is the worst I have ever felt. I've had bad trips before but this was horrible. It's not worth it.</p>"
}
