{
 "title": "Bizarre Roll",
 "author": "DT",
 "citation": "   DT. \"Bizarre Roll: experience with Methamphetamine, Cannabis, Caffeine & DMAE (ID 39312)\". Erowid.org. Dec 29, 2004. erowid.org/exp/39312",
 "substance": "Methamphetamine, Cannabis, Caffeine & DMAE",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)",
   "  T+ 6:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 8:00",
   "1 tablet",
   "oral",
   "Vitamins / Supplements",
   " ",
   " ",
   "  ",
   "oral",
   "Caffeine",
   " ",
   " ",
   "  ",
   "oral",
   "DMAE",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39312",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 29, 2004",
   "Views: 13507",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few days ago, my friend M and I decided to try smoking meth. It was the second time I'd ever done it. The first time, I'd smoked a really LARGE crystal in the house of an old dealer friend of my ex-partner's in Southern California. At that time about a year and a half ago, I had taken two large hits off of a crystal meth equivalent of a water bong. The smoke was REALLY thick and white, and after two hits, I was off the fucking wall. I don't really remember much about that time, because I had followed up the meth experience with GHB, and I did not have a really good gauge about the effects of meth by itself or anything, but I remember the most intense euphoria in my life, and INCREDIBLE amounts of horniness.</p><p>This time, my friend M had some low grade, small crystals, that we smoked out of a simple glass meth pipe. We started at 3 o clock in the afternoon (approximately) and ended our session at 9 o clock. The hits were never quite as strong as my first time, but it was certainly very very addictive. We spent the whole afternoon catching up on old times, conversation about our lovers and our lives. I had not spent much time with her in a year, and so the meth helped facilitate really good conversation. The euphoria was mild, although moderately intense with some of the larger hits that I took. All in all, we used hardly any meth at all, perhaps a total (in small crystals) about half the size of a normal-sized tablet (not sure how much that is in mg), shared between the two of us over an extended period of time.</p><p>We stopped at 9, and cooked dinner back at my place. However, neither of us could eat anything, so we smoked some weed. At 11pm, we began to feel a little bit tired, so we each popped one diet pill that contained a proprietary blend of various Central Nervous System stimulants, like caffeine, synephrine, etc. However, this product also contains DMAE, which I'd read elsewhere as being a so-called 'Smart Drug' which affects people similar to Ritalin, and has been shown to be effective in treating people with ADD/ADHD. I am upset that the product doesn't list the exact amount of DMAE.</p><p>When that pill kicked in, as both M and I were high, and our feelings of meth were wearing down, I started to feel like I was beginning to roll, at around 12 midnight. I could not stop grinding my teeth, and I felt on top of the world, and that everything would be ok. it was VERY VERY strange. I was not expecting that, because I'd taken each of these three substances by themselves before (meth, weed and this energy pill containing DMAE), and none of them had this effect on me this intensely. It was EXACTLY like I was on MDMA.</p><p>Anyway, M and I ended up watching Michel Gondry music videos on my computer. She left at 3am, and I could not sleep until well into the next day, at around 7am...</p><p>I have negotiated doing meth again, but because I know it is extremely addictive, and I have a very addictive personality, I am going to wait for awhile before I do it. All in all, this experience was very very good, and I was particularly happy that I bonded with a very good old friend of mine, and though it may have been partially drug facilitated, all of our feelings came from the heart.</p>"
}
