{
 "title": "Don't Combine with Sports",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Don't Combine with Sports: experience with Amphetamines (Adderall) (ID 39337)\". Erowid.org. Apr 18, 2007. erowid.org/exp/39337",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39337",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Apr 18, 2007",
   "Views: 8793",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took Adderall for the first time after getting 6 hours of sleep the past three nights combined.  I simply took the 20mg extended release pill. It helped me tremendously on my calculus test, allowed me to read 80 pages of a book that I had a test on 7th period over an hour and a half. I did perfectly on my socratic seminar in english, and, once I reached it, the test 7th period.  I crashed after school (about 7 hours after taking the pill).  </p><p>For school, the Adderall helped.  Once, however, I was high on Adderall while playing field hockey.  I was able to hit the ball 3 times harder than usual, and was sprinting non-stop.  I couldn't stop moving, and the more I exercised, the more obsessed I became with it, wanting to run faster and faster.  When I went for a run, I ran faster and longer than usual.  When I lifted weights, I lifted more weight for more reps than usual.</p><p>This may seem great, and it was for the time being.  But the next day I could hardly move.  I had over-exerted myself without even realizing it.  I had pulled 3 different muscles, and the tendonitis in my wrists prevented me from even turning a doorknob.</p><p>Don't combine sports with adderall.  Adderall speeds up your heart rate enough without you running around.  You won't realize what you're doing, and you could seriously injure yourself.  If you do happen to play sports while on the drug, don't do anything that you know you couldn't normally do.  Don't run an extra mile just because you're not tired.  Don't lift an extra 20 pounds on each machine just because you can't feel it.  You may feel invincible, but the next day you'll regret it.  I was lucky to not get more severely injured.</p>"
}
