{
 "title": "5-HTP the savior for stoners?",
 "author": "J-Stone",
 "citation": "   J-Stone. \"5-HTP the savior for stoners?: experience with 5-HTP (ID 39364)\". Erowid.org. Dec 18, 2007. erowid.org/exp/39364",
 "substance": "5-HTP",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Tryptophan",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39364",
   "Male",
   " ",
   "Not Given",
   "Dec 18, 2007",
   "55740",
   " "
  ]
 ],
 "report": "<p>I have been an avid weed smoker for the last six years, and in the last two years I have only taken a 1 month break and a few 3-4 day breaks here and there.  My friend had told me about 5-HTP before, and I had seen it mentioned in much literature as well.  Seeing as it was finals week at college, I was seeking some sort of aid to help me focus on studying (and to not want to smoke herb so much... heh).  I did NOT want to use ritalin/aderall as I am generally against it.  So first day of the week, I got up early and decided to go buy some 5-HTP and do some studying.  I had a small breakfast around 10:00AM, including 2 cups of Oolong Tea, and at this time I ingested 2 x 50mg 5-HTP.  Then I went to the library and studied...</p><p>11:30AM - T+1:30 - What I noticed at this time was that I was very motivated to do the work.  Reading was easy, my mind was focused and I was not worried about how much work I had to do or how much time I had to do it.  Time almost passed faster. At first I thought, maybe it's just the caffeine, but there was definitely a clarity of thought not present before.</p><p>1:00PM - T+3:00 - After working for 2 hours, I let myself have a small smoking break.  I didn't want to ruin being in the 'work zone' so I packed only a medium sized bowl of some commercial level chronic.  It was strange... I seemed to notice some effects that I hadn't noticed in a long time, like an extra vibrance to music and excessive mood enhancement.  I decided to smoke a little bit more, and I was blown away!  It almost felt like my tolerance had been reduced, yet it wasn't.</p><p>5:00PM - T+7:00 - Even after coming down from the the high, I could still be focused on the work.  Also, the clarity of thought is amazing.  It is like a cloud has been lifted off my head: the last few years of smoking a lot and not taking many breaks has generally made me feel less alert.  The 5-HTP seemed to take it away.  The kind of intuitive thinking I gained from smoking a lot also seemed to go well with this new ability to focus... schoolwork/studying seemed to go extra easily.</p><p>I have used 5-HTP almost daily since this experience and have continued to feel this clarity of thought which was long missing.  I suggested it to several stoner friends whom I gave samples to... they noticed similar effects to a more or less degree.  One of them now takes it regularly.  I would recommend it to any heavy stoner as part of a healthy diet in order to maintain adequate serotonin levels in the brain.</p>"
}
