{
 "title": "Why Not?",
 "author": "Tinax",
 "citation": "   Tinax. \"Why Not?: experience with Methamphetamine (ID 3937)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3937",
 "substance": "Methamphetamine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "3937",
   "Female",
   " ",
   "Not Given",
   "Dec 26, 2001",
   "13559",
   " "
  ]
 ],
 "report": "<p>\nMy cousin had a weekend habit: Meet up with some friends on Friday night, do a bump or line of meth, and then he was off, no coming home for the whole weekend, no sleeping, no eating, no slowing, no nothing except for the chain-smoking and occasional biting remark to any unlucky fuck who happened to piss him off.  Meth made him unpleasant; it made him irritable.  He dropped forty pounds in three months.  He lost his job when he couldn't wake up for work several days in a row after a long weekend, then he fell $5000 in debt.  It was over after that.  He finally tweaked out and dropped out of school, moved 12 hours away to live with his parents again, and swore he'd be back for the occasional bump or two.  His visit with tina, you know?  These visits were the same as any other weekend.  Forty-eight-plus hours on the run, constant dancing, binge-sex, and the crash at the end.  Then he'd go back home to sleep off the fun.</p><p>That got me wondering what was so fascinating about crystal meth.  I'd been cautioned by friends not to try it, and I'd seen more people strung out on it than any other drug, including alcohol (which, by the way, is by far my least favorite drug).  But for some dumbass reason I assumed I could keep the ordeal under control.  I accumulated $60 worth of pure crystal meth and prepared for the experience alone in my room.  Having read up on the first-time dosage for someone my age and weight, I filled ONLY the end of a pen cap with the powder and snorted it.  As it turns out, that was more than enough.</p><p>The onset was immediate.  The first thing I noticed is my heart jumped up to racing about 130 beats/minute.  I started clenching my jaw so about twice as hard as when I'm on ecstasy, and my eyes were the size of ping-pong balls.  The next thing I knew, I was angry as hell.  I was convinced I would have a heart attack, neurotically paranoid, and I wanted to kill someone.  I got up to pace around my room, sqeezing a pillow, just trying to work off the horrible anger and the need to kick the shit out of someone.  The next thing I knew, my roommate was standing next to me. He asked if I was OK, and I said no, I was flipping out, please get away from me, get the FUCK away from me.  He reached out to hold my arm.  That's when I got violent.  I pushed this six-foot guy away from me with enough force to slam him against the wall and kept swearing at him, Get the FUCK away from my arm.  I was feeling neauseous and kept thinking that if I threw up I would die, it would make my heart explode.  I kept pacing around the room and tried not to keep from crying.  It's the most terrified I've ever been.</p><p>Luckily, my roommate was an ex-speed freak himself and knew what to do.  He just sort of talked me down and asked if I wanted a backrub.  I said yes and somehow managed to mellow out.  When I did come down a little, I was insanely euphoric.  All I wanted to do was talk to people and dance.  Despite the horrible onset, I wanted more.  Later on, I took another bump.  Almost the exact same thing happened.</p>"
}
