{
 "title": "Comfortably Numb All Day Long...",
 "author": "op4u",
 "citation": "Citation:   op4u. \"Comfortably Numb All Day Long...: experience with Poppies - Opium & Fluoxetine (ID 39401)\". Erowid.org. Jan 25, 2005. erowid.org/exp/39401",
 "substance": "Poppies - Opium & Fluoxetine",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "3 capsls",
   "oral",
   "Poppies - Opium",
   "(ground / crushed)",
   " ",
   "40 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39401",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2005",
   "Views: 30469",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently, after being in a accident and breaking a couple of bones, I was given oxycodone hcl for the pain. In fact I was on oxy for nearly a month afterwards. During this time I contracted a nasty cold and found that oxy makes the best cold medicine I've ever had. It dries up the nasal passages and serves as an excellent anti-tussive.  It was at this point that I decided to do a little research on opiates and discovered that they were easily obtainable in the form of dry poppy pods. I decided to order some online and try them out, primarily for medical reasons. A day or two later my perscription of oxy ran out, and even though I had been on oxy for nearly a month I had very little withdrawal symptoms. My pods arrived over a week later. At this point I was still in some pain from the accident and decided to immediately try them. \r\nNow I had heard that poppies make a most vile tasting tea, and that the alkaloids were best extracted with an acid, so I ground  up two medium pods in a coffee grinder and put them in a coffee filter, then I put some coffee in another filter and placed it on top of the ground pods and proceeded to brew the coffee/opium tea. The resulting brew tasted mostly like coffee and didn't do much even after 1.5 hours. \r\nAfter making the tea I decided to taste the poppy solids and discovered that they didn't taste as bad as people had said, in fact compared to some of the herbs I've had in my life it was quite pleasant, though I wouldn't say that it exactly tasted good. So after a bit of trial and error I found that a relatively easy way to take it was to mix finely ground pods in orange juice and drink quickly. This results a pleasant opiate experience that takes anywhere from 15-45 minutes to kick in depending on how full my stomach is. \r\nThe next day, before going to work, I ground up three medium pods as fine as I could and mixed them in orange juice and proceeded to drink the mixture on an empty stomach. This was about 7:30am. About 15-20 minutes later I was driving to work and felt the effects come on very strongly. [Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't Do It!] In fact it was similar to the feeling a somewhat intolerant person would have with about 10mg of oxy, yet without as much sleepiness. The effects continued at about the same level until about 12:00pm, then very slowly decreased, though I could still feel the euphoric and analgesic effects at 7:00pm that evening!\r\nI suspect that ingesting the poppy pod solids results in time release of the alkaloids as the solids move through the digestive system. While I wouldn't classify the effects of poppy pods as being as good as oxy, probably because of the mixture of alkaloids  all having slightly different effects, I would say that it is pleasant and effective, with relatively few side effects. The only side effect I noticed was mild to moderate constipation, not nearly as bad as oxy.\r\nI keep a few of these pods on hand to ease discomfort when aspirin isn't enough, or when I am unable to sleep or function well because of a bad cold or flu (need to remember to cough up & spit out phlegm because it suppresses productive coughs). Opiates can help distance me from physical distractions such as these without over intoxicating me and preventing me from getting work done. At least that has been my experience. A great deal of respect must be given to the poppy because while it has many theraputic properties it can cause addiction and physical dependence, and could result in some nasty withdrawls after prolonged daily use.\n\n\n"
}