{
 "title": "Is It Really That Great?",
 "author": "Dee",
 "citation": "Citation:   Dee. \"Is It Really That Great?: experience with Cocaine (ID 39441)\". Erowid.org. Jun 25, 2007. erowid.org/exp/39441",
 "substance": "Cocaine",
 "bodyweight": "113 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39441",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2007",
   "Views: 3599",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nCocaine. I asked my sister if she wanted to do some cocaine with me. I had never done it before and she had told me many different stories of parties and friends that shes gotten high on coke with. I had to know what the whole big deal was. Even my boyfriend had tried it in my presence and yet, I had no idea. \r\nSo my sister agreed to buy some coke with me. In total we bought a regular gram ($60). We drove around the city then finally parked in an underground parking lot. She opened the tiny sixty dollars bag and made four lines. She told me to choose which lines I wanted and handed me a twenty dollar bill rolled up. I took the bill and snorted my two lines. Instantly I was high. Though, the high was great, the drip absolutely sucked. The only interesting thing about the drip is that my nose and not to mention my throat were completely numb. \r\nMy sister and I then drove home...we sat in my basement for about ten minutes after we got home and then she continued with forming more lines of coka for the two of us. We finished off that whole gram together in a matter of two hours. I had eight and a half lines that night.\r\nThe high was sweet for what the drug was, my sister and I have never talked more in our lives about our personal life and everything felt in place in consideration of my life. Eventually her and I parted ways to bed. Bed. Trying to sleep was hell. I couldn't sleep, I couldn't stop thinking, and my head just wanted to turn off and go back to being sober. I had horrible chills, and I almost felt nauseous in a mental sort of way. The come down was hell and because of the hell I felt that night, I'm sure if I was to try coke once more, it would be with someone I love and someone that I can spend the whole night with, to be in hell with someone I love is better than being alone. \r\nI still don't understand how people can get addicted to something like this. I mean, I watched my sister fiend over her lines, but I assume I looked the same. I just wish my experience could have been something perfect!\n\n\n"
}