{
 "title": "Some Things I Know",
 "author": "Cactushead",
 "citation": "   Cactushead. \"Some Things I Know: experience with 2C-I (ID 39456)\". Erowid.org. Mar 18, 2006. erowid.org/exp/39456",
 "substance": "2C-I",
 "bodyweight": "120 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "2005",
   "39456",
   "Male",
   " ",
   "Not Given",
   "Mar 18, 2006",
   "Views: 3222",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My roommate and I tried 2C-I last night and I thought I'd mention some things I experienced.</p><p>1) I took 2c-i during a very mild cold and I had tons of mucus pouring into my throat and lungs all night. It did not give me a bad trip, but it certainly would've been better without that aspect.</p><p>2) I experienced a moderate headache towards the end of the trip. It lasted about an hour or two and went away.</p><p>3) I did find that many areas in my apartment looked darker than usual, or that regular shadows were somewhat thicker than usual.</p><p>4) My roommate and I had a lot of trouble communicating throughout the first half of the trip. Usually we communicate very well. However, we were also empathetic, so we didn't get too concerned when we couldn't word our thoughts well. Also, my cat who is always friendly, got a wierd vibe and tried to scratch me during the trip. While this off-vibe was a little uncomfortable at first, my roommate and I eventually got used to it.</p><p>5) The visuals were definately of a nature different than any hallucinogen I've tried. They were most comparable with 2C-B, but with trails, long-lasting ghost images, and moving images of my thoughts super-imposed onto my surroundings (on a dark wall for example.) There were also some color-shifts as well (ie: white walls looked slightly red, then slightly violet, then slightly blue, ect.)</p><p>6) I have heard others experience problems from greasy food, but I ate fried rice during the trip and was fine.</p><p>7) The body high was similar to 2C-B, but subdued. There was less physical stimulation, and no negative physical effects besides the mucus. There were occasional chills.</p><p>8) The visuals, emotions, and overall vibe of 2C-I was a little darker than 2C-B. Definately not 'worse' than 2C-B, just 'darker' and a little more serious. I did not experience the pleasant electric buzz that I get from 2C-B either. However, 2C-I had much more fascinating visuals. 2C-B seems more recreational whereas 2C-I seems more psychedelic.</p><p>In the end, both my roommate and myself really enjoyed the experience. It is a very balanced trip, and the visuals are great. I have heard 2c-i labeled as a 'generic' trip, which I thought it was until I reached hour #3 and experienced psychedelic effects like none I've had before.</p>"
}
