{
 "title": "Mildly Addicting",
 "author": "Cocafairies",
 "citation": "Citation:   Cocafairies. \"Mildly Addicting: experience with Cocaine (ID 39463)\". Erowid.org. Mar 28, 2008. erowid.org/exp/39463",
 "substance": "Cocaine",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39463",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 28, 2008",
   "Views: 3585",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOver the last few years I have experimented with many substances. Cannabis, daily for 4 years. MDMA over 100 times. Amphetamines 5 - 10 times. LSD 2 times. Mushrooms 10+ times. Salvia, once was more than enough. \r\nIt was'nt until about 2 years ago that came across cocaine. I fell in love from the very first line. There was no mental effects like LSD or Salvia and no obvious signs I was on it compared to 'face pulling' experienced on MDMA or Speed. In fact I felt no different than normal and could pass for straight. \r\nWhat I liked about cocaine was that it gave me confidence and peace of mind. After a while I gave up clubbing and MDMA and replaced it with a gram of coke every weekend. I would have a great time going out on cocaine. I could'nt care what people had to say and felt like I was on top of the world. I could consume more alcohol than I could without it and still not feel too drunk and I could sleep easily and not feel all spaced out and 'on the comedown' for days after.\r\nBut unlike MDMA, which I believe to be unaddictive. I found out for myself this was untrue for cocaine. After a while I began to start thinking about coke during the week when I was at work and I found myself buying it on a Wednesday or Thursday and sniffing it all before the weekend had even arrived. I started to waste all my hard earned cash on dust and started to feel quite down about it. I don't think it had any effect on me anymore but I still continued to buy it anyway.\r\nIt's been 2 years now since I started sniffing snow and I have cut it down to a gram at the end of every month when going out and try to avoid places where I know people will be using it.\n\n\n"
}