{
 "title": "Clear, Bright and Nicey",
 "author": "Willem",
 "citation": "   Willem. \"Clear, Bright and Nicey: experience with TMA-2 (ID 3948)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3948",
 "substance": "TMA-2",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "12.5 mg",
   "oral",
   "TMA-2",
   "(powder / crystals)",
   "  T+ 0:45",
   "12.5 mg",
   "insufflated",
   "TMA-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 3948",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 26, 2001",
   "Views: 12371",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI was unable to find much information about TMA-2 except for a few patchy trip reports and Shulgin's info about it in Phikal...so here is my understanding of this substance and what it is like. <br>I was going to subcutaneously inject (below the skin, a technique that has worked with 2-CB quite nicely...at least more nicely than snorting it!) but the material wouldn't dissolve. It was like a more kind of powdery organic compound than 2-CB. <br>So I took 12.5mg orally...it tasted a bit like herbal washing up powder, and then 45 minutes later snorted the other 12.5mg. This didn't hurt really at all...though the powder was quite thick. <br>15 minutes later the substance began to come on and took about 30 minutes to come up to a baseline. It was very clear the material I had was very clear and pure...and I concluded very quickly: this is basically just like mescaline, with more focused twinges to it perhaps. There is the same clarity, mindfullness and clean 'high' of Mescaline. I was walking along the empty beach...working through a few things...and it just allowed this clarity and mild psychic opening that I needed. Somewhat gentle...no real visuals...no nausea or the yawning or the physical strain I get with mescaline. <br>I find 2-CB more useful for deeper somatic and whole understanding of my reality. Mescaline for me has always been quite a contemplative psychedelic, though I have always taken low dosages. <br>I haven't tried 2CT7, I imagine it being somethign of a cross between TMA-2 and 2-CB, with wildcat elements thrown in.\n\n\n"
}
