{
 "title": "Brain Pulsating in Alprazo-land",
 "author": "anxiolytic",
 "citation": "   anxiolytic. \"Brain Pulsating in Alprazo-land: experience with Alprazolam & Cannabis (ID 39505)\". Erowid.org. Nov 15, 2005. erowid.org/exp/39505",
 "substance": "Alprazolam & Cannabis",
 "bodyweight": "129 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "  ",
   "insufflated",
   "Pharms - Alprazolam",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 39505",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Nov 15, 2005",
   "Views: 127745",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've had an interest in benzodiazepines for some time. Most likely because of the perpetual stress and occasional anxiety that I suffer from (along with many others, I'm sure). I'm also Schizotypal, causing me to loath and avoid people, society, and conformity. Since I find psychiatrists to be egotistical and eagerly supportive of masochism with their patients, I've always explored my own methods of self-medication. </p><p>For the past few years this has been done with alot of marijuana and psychedelic self-exploration but more recently I've been seeking out drugs that seem specifically useful for stress/anxiety. This leads up to a few months ago when an acquaintance of mine told me of his Xanax contact and I (of course) was looking forward to making a purchase. I bought a few 3.0mg generic Xanax (Alprazolam) 'bars'.</p><p>I had tried Xanax one previous time at a pretty low dose (0.5mg orally) with very minimal effects. This time I was determined to explore all that Alprazo-land had to offer, now fully armed with several high dose bars. The seller of the pills insisted that I snort the pills for the best effect. I wanted to try a higher oral dose before resorting to insufflation, though.</p><p>Attempt 1   (1.5mg oral)</p><p>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=</p><p>For the first attempt I split one of the unusually long white Xanax bars in half, chewed it thoroughly before swallowing (as always), and washed it down with water. The chemical taste of Alprazolam was somewhat bitter and understandably 'unnatural' but didn't cause any nausea. Since I was still in the midst of habitually smoking marijuana daily, I smoked a few routine bowls after eating the Xanax. Over the next hour I felt increasingly high but with something different protruding from the high. </p><p>The high had a more stoning aspect to it and was slightly more sedative, which was expected. I tried to think of situations that caused anxiety but just couldn't. It was absolutely impossible. The anxious and overly-analytical thoughts that usually plague my mind felt like they were being blocked with a chemical gate (and I suppose that they were). Unfortunately, though, it felt like the Xanax replaced the usual cannabis euphoria with pure apathy. I didn't get the very sedate benzodiazepine effect that I was looking for. I eventually fell asleep and although I stayed asleep longer than usual, my sleep quality wasn't much better than usual (and I usually wake up feeling like I didn't even sleep at all).</p><p>Attempt 2   (3.0mg insufflated)</p><p>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=</p><p>I grew impatient and was curious to try to snort the Xanax the next day (without smoking any pot with it). It was Thanksgiving day and a few members of my immediate family came to my house to 'celebrate'. As always with holidays, I felt anxious and even more introverted than my usual reclusiveness. I stayed in my room during the majority of the day, avoiding social contact and the obligatory family greetings. </p><p>I crushed the remaining half of the Xanax bar from the previous night with a lighter and made a long, fluffy, white line. I'm assuming this line was around 1.5mg. Into the nasal cavity it went. *Insert sniffing noise*. It really wasn't unpleasant to snort. It didn't compare to other harsh material that has traveled into the tunnels of my nose. The drip was hard to notice and the bitter chemical taste was not unbearable...just strange in its metallic pharmaceutical taste. </p><p>Within minutes I felt the effects pretty strongly. It didn't feel pleasant, though. As a matter of fact, it just was overwhelming apathy (which doesn't seem possible). I decided to snort a booster dose of another 1.5mg. After this I decided that I was definitely feeling the full potential of Xanax through insufflation. Unfortunately I soon found that snorting Xanax is about the same as being in a state of emotionless catatonia for 45 minutes. </p><p>Around 20 minutes after snorting the second line of Xanax, I walked to get a glass of water from my kitchen and stumbled around feeling pretty fucked up. It felt like walking around while drunk but with no emotion or nausea. The bodyload was heavy and flexible at the same time. There really wasn't anything fun about this. </p><p>After returning to my room, I laid down and began to feel unpleasant pulses rushing through my head. It felt like an electric train was rushing through my brain every so often. To make it even more uncomfortable, my sister's 27 year old boyfriend came into my room and conveniently brought his Playstation 2 to play in my room in an attempt to avoid having to talk with my parents. I laid there fidgeting with the electric pulses continuing and a growing sense of apathetic stupor and drowsiness while my sister's boyfriend assembled cables and played video games. I fought off falling asleep and the effects ended 45 minutes after snorting the second line. I noticed later on that I had some loss of memory of the experience.</p><p>Attempts 3, 4, and 5   (3.0mg oral)</p><p>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=</p><p>Over the next few days I tried three final attempts with Xanax. 3.0mg was taken orally on all three attempts. On no occasion did I find the euphoric or overly sedative effect that I was looking for. It was alot more tolerable as compared to snorting the same amount but that is all that it was, tolerable. During the last three uses of Xanax I found that I just wanted to sit and watch TV for the duration of the experience (which was around an hour or two with both attempts). Anxiety felt like it was still present in the back of mind, just that it was only transiently hidden by the drug. This fact in itself gave me even more anxiety. It really didn't even help me fall asleep any easier than usual.</p><p>Conclusion</p><p>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=</p><p>I found Alprazolam to be unenjoyable and ineffective in reducing anxiety in any beneficial way. I'm apathetic and emotionless enough as it is. I personally can't understand how it could be addictive unless it was forcibly prescribed to someone and taken every day. Of course, everyone is very different.</p>"
}
