{
 "title": "First Experience Ever!",
 "author": "MysteryMatt",
 "citation": "   MysteryMatt. \"First Experience Ever!: experience with 2C-B (ID 39513)\". Erowid.org. Nov 12, 2008. erowid.org/exp/39513",
 "substance": "2C-B",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 39513",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 12, 2008",
   "Views: 4007",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>2C-B was my first use of a hallucinagin. My expierence is from nearly a year and half ago, but I remember it well. I want to post my expierences and I figured this is where I would begin. </p><p>A good friend of mine, who we'll call Greg, called me up and said he could get a drug called 2C-B. I knew barely anything about it, and checked online to learn more about the drug. After decided it sounded like a desirable drug to imbibe, I contacted my friend and said I'd like one. After contacting our other friend, we were getting 3 2C-B capsules. </p><p>The capsules were large, and there was a small amount of powder inside them. This worried me, 'was there enough in there to be effective?' We each swallowed the capsules. At that point, I had only smoked marijuana and drank alcohol, or I would have known better to open the capsules and swollow the powder. </p><p>Me and Greg seperated from our other friend and went in the area around my house to trip.About an hour or so passed, and I began to feel sick to my stomach. I never felt the urge to vomit, but it felt unsettled and slighty nausated. About another half hour passed, and I layed around and did nothing. Suddenly I remember feeling like a shivery feeling down my spine. This continued the entire time. </p><p>Greg and I were the only ones on the drug, and the other 2 people, including my girlfriend(now), wanted to watch scarface. I had a feeling similiar to tripping, but not quite. The movie seemed sort of surreal, the chainsaw scene sticks in my head still after watching it that evening. There were still really no visuals, but I could feel the drug. At one point during the movie I went to put my arm around a girl, who is now my girlfriend, but I got up suddenly. For some reason I felt like my other 2 friends were laughing at me for putting my arm around her. I walked out of the room for a minute, got my bearing, and realized they were laughing at the movie. I didn't really freak out, nobody else probably even noticed I really left the room. </p><p>After watching the movie for a bit, I hop in the car and drop my girlfriend off at work, which was about 2 minutes away. My driving wasn't effected by the drug really, but still things had a surreal feeling to them. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>When I get back to my house, me and Greg are chilling in the kitchen. When I look at the wall edge, it looks like it is waving. A closer examination of the carpet reveals some swirling motions. The visuals were much clearer than acid, and had no fuzzy look to them. When I walked out into the back yard the ground looked like it was rolling a little. The drug still gave me that shivery body feeling. Probably within an hour or two we started coming down.</p><p>We went into my garage to smoke some KB. An odd thing the drug did to me, was make me feel really spent when I was coming down. It took us forever to pack up a bowl or two. </p><p>In conclusion, the capsule probably made the drug less effective on me. It was very mellow, perfect for a first time hallicinagin though.  I have not been able to obtain any more 2C-B since that expierence. Also, due to the length of time since I did the drug and that it was my first time, I cannot say much about the self-introspection or anything.</p>"
}
