{
 "title": "Teeth Gnashing Withdrawal",
 "author": "David C.",
 "citation": "   David C.. \"Teeth Gnashing Withdrawal: experience with Venlafaxine (Effexor) & Alcohol (ID 39526)\". Erowid.org. Jun 27, 2007. erowid.org/exp/39526",
 "substance": "Venlafaxine (Effexor) & Alcohol",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol",
   "(daily)",
   " ",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39526",
   "Male",
   " ",
   "Not Given",
   "Jun 27, 2007",
   "Views: 10932",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On the fifth day of no booze or Effexor-- after almost a week of teeth-gnashing-- bedridden depression a neighbor woke me to get back a copy of The Fog of War a documentary on Joe McNamera (secretary of war during Vietnam) in order to take it back to the video store.  I came to the door in a haze-- having worn the same shirt and boxers for 5 days.  I hadnt showered since two days after Christmas.  Personal hygiene isnt high on the list when Im pondering committing yourself or leaping into on coming traffic.  </p><p>I handed him the DVD and returned to my room --putting a shirt over my head to shield my usually sensitive eyes from afternoon sunlight which was peering through cracks in my blinds.  My mattress was on the floor-- as I had never bothered to obtain a proper bed, there were no sheets, only a denim comforter that I snuggled with in the classic fetal position.   This was the only way I could sleep as it gave me a feeling of comfort and safety. </p><p>Upon cessation of Effexor, I had been sleeping 16 hours a day during the ordeal-- fortunately I was able to trade some of my Adderall for Klonopins. I was certainly experiencing both SSRI and alcohol withdrawal simultaneously-- I had been drinking as well as experiencing depression to a debilitating degree for over a month and I felt it was time to get my mind back-- what was left of it.</p><p>After my neighbor left I was unable to sleep so  I made coffee and smoked half a cigarette lying in my ashtray.  I finally felt close to normal.   After a shower and clean clothes I felt almost normal. No electric shocks or clouded memory. </p><p>Another side-effect of Effexor withdrawal that I experienced was pressure in the eyes.  Im not certain the cause-- though I expect it could be a indication of pressure somehow exerted on the brain.  </p><p>The withdrawal period wasnt as bad as it had been during previous attempts to stop despite the fact I didnt taper down gradually as recommended by others that had gone through a similar withdrawal.  The sedative definitely helped me with the insomnia and other physical symptoms.  I seriously doubt I would have been able to abstain from Effexor with out them.  </p><p>My dreams were so vivid during the detox period that I often mistook them for reality-- I attribute this to a mixture of REM rebound from the cessation of my alcohol consumption and the absence of the SSRI in my bloodstream.  They were 100 times more concrete and my mind seemed to be sharper in dream than it was in reality.  I can only compare it to the several times I intentionally fell asleep while wearing nicotine patches-- most of which warn against applying them before sleep due to Vivid Dreaming.  </p><p>The metabolic process of alcoholism have stopped functioning-- hopefully leaving me with only a psychological addiction, which I intend to battle feverishly.  I no longer crave booze in any form, though my craving for cigarettes has probably doubled.  I took a triple dose of multivitamins because cells inundated with alcohol have a terribly difficult time obtaining nutrients and most alcoholics suffer from vitamin deficiencies.</p>"
}
