{
 "title": "Not Depressed, But Not Happy",
 "author": "Piedro The Mighty",
 "citation": "   Piedro The Mighty. \"Not Depressed, But Not Happy: experience with Bupropion (Wellbutrin) (ID 39542)\". Erowid.org. Jan 1, 2011. erowid.org/exp/39542",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39542",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 1, 2011",
   "Views: 6057",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I stopped taking wellbutrin a week ago, after a 10 month course.</p><p>After going through a difficult time in my life, I finally gave in and admitted that I had a problem with depression. I was prescribed Wellbutrin by my gp, as it did not have the sexual side effects ascociated with traditional SSRI's. I started at 150mg a day and after a week raised it to 150*2 (1 a.m., one p.m.)</p><p>I was at first scared, as the list of side effects and the fact that I was taking these drugs every day indicated that they could have a profound affect on my body. </p><p>The side effects were generally mild; I had dry mouth throughout my  treatment, and insomnia for the first month (off and on). The pills themselves gave me gas, and the dry mouth contributed to bad breath, so if these things concern you, take note. Altogether the side effects were less than I expected.</p><p>The phycological effects are harder to describe... but there were some major ones.</p><p>1.My appetite was really only there after I worked out, otherwise I had to remember to eat, I can see why this is used as a smoking cessation drug.</p><p>2. I was generally more irritable than usual. I am a moody person, so this was hard on my SO</p><p>I stopped taking wellbutrin a week ago, after a 10 month course.</p><p>After going through a difficult time in my life, I finally gave in and admitted that I had a problem with depression. I was prescribed Wellbutrin by my gp, as it did not have the sexual side effects ascociated with traditional SSRI's. I started at 150mg a day and after a week raised it to 150*2 (1 a.m., one p.m.) I was at first scared, as the list of side effects and the fact that I was taking these drugs every day indicated that they could have a profound affect on my body.</p><p>The side effects were generally mild; I had dry mouth throughout my treatment, and insomnia for the first month (off and on). The pills themselves gave me gas, and the dry mouth contributed to bad breath. Altogether the side effects were less than I expected.</p><p>The phycological effects are harder to describe... but there were some major ones.</p><p>1. My appetite was really only there after I worked out, otherwise I had to remember to eat, I can see why this is used as a smoking cessation drug.</p><p>2. I was generally more irritable than usual. I am a moody person, so this was hard on my SO</p><p>3. I was not depressed, they actually worked!!</p><p>4. Apathy. I was not depressed, but I could no longer feel truly happy. I was on wellbutrin for 10 months, and in the end I grew to hate it terribly, I just wanted to feel, even if I was still depressed.</p><p>About a week ago, I quit cold turkey. I had developed a plan to taper off the pills, but I just wanted to stop taking pills... I wanted to be me again.</p><p>I have to say, I'm very happy I did. I'd be lying if I said I felt great, but my 10 months on antidepresants taught me that the (sometimes wild) swings in life are natural and part of me. I don't think this is the case for everyone, but I *want* to hurt sometimes; if I am only going to live once, I want to *know* that I'm alive. If I had the opportunity to make my decision again, I would do the same thing. I learned one of those lessons that can only really be learned through experience. There are no magic pills I can take that will make my life better without compromise, and pain is part of life, a very important part. I guess this is the classic situation of 'you never really know what you have until it is taken away.' I think I was expecting a quick fix for my problems through pills, as if admitting I was depressed would suddenly make it easy to get 'cured'. This is not the case. Life is the way it is: no quick fixes, sometimes pretty shitty, almost always lonely, and all that we have.</p>"
}
