{
 "title": "Learning Not to Force it",
 "author": "Jack Dracona",
 "citation": "   Jack Dracona. \"Learning Not to Force it: experience with Salvia divinorum (Leaf) (ID 39557)\". Erowid.org. Aug 1, 2007. erowid.org/exp/39557",
 "substance": "Salvia divinorum (Leaf)",
 "bodyweight": "265 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 g",
   "sublingual",
   "Salvia divinorum",
   "(leaves)",
   "  T+ 0:15",
   "3.0 g",
   "sublingual",
   "Salvia divinorum",
   "(leaves)",
   "  T+ 0:25",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39557",
   "Male",
   " ",
   "Not Given",
   "Aug 1, 2007",
   "Views: 3482",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have never really been interested in recreational drug use.  I've never gotten stoned, even though I've had the chance many times, and I very rarely get drunk because I just don't see the point.  However, ever since reading the first Carlos Casteneda book and the LSD experiments of the 60s, I've been fascinated, you might say obsessed, with psychedelics and the spiritual lessons they can teach us.   I had never really done much myself, however, out of fear of legal repercussions and fear of just getting lost in the positive feelings and not learning any spiritual lessons.</p><p>Then I heard about Salvia Divinorum.  I did a lot of research and decided I had to try this.  Being cautious and responsible, I had worked up from small doses.  My first few experiences were interesting but not profound.  A combination of low doses, poor smoking technique, large body weight and the fact that I seem to have a natural tolerance to any substance I've ever taken, kept me from getting past the L level of the S-A-L-V-I-A scale.</p><p>This was my 4th experience with Salvia, about a month after I had first smoked it.  I had been thinking a LOT in the last week about entheogens.  My mind was saturated with the idea.  A few days earlier I had had a very unusual experience, you could say a psychedelic experience, just from this saturation, lack of sleep and a strong emotional state. This breakthrough, this Eureka! experience had left me feeling strangely hollow, rather than enlightened. I was feeling 'stuck' spiritually, and was almost desperate for a true psychedelic experience.  </p><p>I went to my friend's apartment.  I measured out doses (1/4 gram for him, 3/8 for me), we turned out the lights, except for candlelight and a very soft ambient blue light, and meditated in preparation.  It should be noted that my friend J and I have been working spiritually together for going on 10 years.  Our spiritual/psychic bond is stronger than with anyone else in my life.  He's like a brother to me, or maybe a soul mate would better describe it.  On our first experience with Salvia together, we both felt this bond become MUCH stronger, almost like telepathy, but while the OTHER person was under.  As we meditated we started becoming hyper aware of each other and I felt a feminine, goddess like presence.  I was sure I was going to have a profound experience.  </p><p>I went first.  I smoked 3/8 of a gram in 4 hits.  I'm not very practiced with a water pipe.  I didn't get much smoke.  I coughed out all the smoke one time and didn't hold the last toke in long enough.  I was too anxious and jittery.  I got some tactile sensations and what I've come to call 'on the surface' visuals.  I've gotten it every time with Salvia.  It's stronger than 'behind the eye' hallucinations, but still 2-D, though stretched out as if on the surface of a membrane.  It seems very 'close' and there is a senesia blending of the visual and tactile.  It's almost as if I'm having visual hallucinations with my skin.  I felt very disappointed.</p><p>Once I was close to baseline (about 15 minutes) my friend took his 3 hits.  When he came back, he told me of a wonderful experience he had just had.  I had felt the spiritual bond between us when he was under and had felt a sense of joy.  I felt more than a little jealous.  I was feeling a little cheated, a little frustrated. Although I had a spiritual intent, my mindset at that moment was more of frustration, even mild desperation. </p><p>Looking back, I realize this was entirely the wrong mindset.  Lady Salvia will teach and show you what she will, when she will.  So I tried again, and went for a balls-to the wall method.  I took about 6 grams of dried leaf and reconstituted them, drained and mashed them into two bite sized piles.  I chewed the first quid for 15 minutes, though the leaves were too broken up to really be called a quid.  It was more like Salvia mash.  I spit it out, took in the second.  These were the worst tasting things I have EVER tasted.  The taste wouldn't get out of my mouth for days.  I almost gagged a few times.  The taste was so bad, that I started getting anxious.  At about 25 minutes I spit out the second quid.  I was already feeling the 'drunk without the buzz' feeling I get with Salvia.</p><p>I took the pipe loaded full of leaf from J and took as big a hit as possible.  I had a really, really hard time concentrating to count to 20.  I let out the breath before I got there.  I remember, as the 'behind the eye' visuals began, thinking 'take me to the moon, Salvia, take me to the moon.' I was trying to force it.  I was trying to shove my mind in some mindset to make myself have a powerful experience, but instead just made myself tense.  I was anti-Zen.</p><p>I completely forgot what I was doing.  I just experienced sensations in that same forgetfulness that we experience dreams in.  I was leaning back, molded to the sofa, I never made it to laying down.  At some point I remember what I was doing, and felt profoundly wrong.  I felt intense gravity pulling me down, making me feel trapped.  If I hadn't become anxious, this would have been interesting.  I was so heavy.  Also, I wasn't being pulled down, I was being pulled back.  It was as if the couch had been tipped back and I was facing the ceiling, or as if gravity had been turned 90 degrees.  </p><p>I experienced several things superimposed at once: one was my physical body on my friend's couch feeling VERY disoriented.  Another thing I was experiencing was laying IN the ground somewhere, part of the dirt.  I was also having very strong 'on the surface' visuals.  There were all these colors, formed into long cylindrical tubes. And there were all wiggling around like worms.  There was a strong sensesia of visual/tactile blending in this.  It wasn't as gross/creepy I would imagine, but it was unpleasant.  </p><p>I started to feel a presence, an intelligence guiding me.  Except She (it was definitely feminine) wasn't helping me out of this increasingly bad experience.  It almost seemed like she was forcing it on me.  I got the feeling that She was tormenting me.  But then I knew She wasn't, She was watching, waiting, even helping in a subtle way.  And I recognized a different presence, this one WAS tormenting me.  It felt much more embodied, more solid than the feminine presence.  I got the impression of it, no, not it, he, I got the impression of him standing over me in the 'in the dirt' reality I was experiencing, digging into the dirt with a sharp object.</p><p>He was saying to me (though, not with words, just with ideas) that this was all my fault, I hadn't done anything right, I wasn't worthy of having a good experience, etc. etc.  And as he jabbed into my dirt-self, the 'on the surface' visuals expanded, taking on a 3-D quality.  These color tubes stretched out for a very, very long way.  And they were woven together into these color tornados that were pushing down on me along with his cutting into the dirt, and it was VERY unpleasant, almost painful.  </p><p>I struggled and struggled, and the more I struggled the worse it became.  Soon I had the idea that I had done something horribly wrong, that I had somehow overdosed (even though I knew Salvia overdose is unheard of) and I was going to die. This didn't really disturb me, though it was unpleasant. Then the feminine prescience took on a more assertive guiding role, and she told me, no commanded me, to roll off the couch and lay on the floor.  I did this with extreme difficulty.  As soon as I had lied down on the floor, the couch and coffee table on either side of me suddenly seemed to become walls of a coffin.  I knew I was going to die.</p><p>But my spiritual ideas of death are much, much different from most westerners.  I was OK with dying.  I didn't want to, but I relaxed into it.  The feminine presence asked me, 'Are you enjoying your death?'  Immediately, some membrane, or maybe the lid of the coffin, opened and I saw my tormenter.  He was this wicked green guy.  Only he was me.  He was a mirror to my self.  He was an embodiment of my inner cynic.  He was my own efforts in struggling to fight the experience, to force it.  And I knew immediately what to do.  I reached up and hugged him/me.  I didn't actually move my physical body, I just imagined it, but the imagination was much more intense and 'real' than normal imagination.  I felt him struggle against it.  But I kept hugging, summoning all the love and forgiveness within my soul.  </p><p>I was still in 'bad trip' mode, but I was feeling much, much better.  I got back up on the couch and tried to just relax and go with it.  The visuals were completely replaced by that of a place of darkness.  Not in a bad way, but just a place of quiet, of calm.  I could see, but it was just a soothing dark grey with an ambient twilight.  There was fog/smoke drifting through this 'place' and it all felt very peaceful.  Then I felt another presence.</p><p>This one was definitely masculine.  I saw him as a blacker than black silhouette.  It was like he was a negative space, an emptiness.  And when I'd try to look right at him, he'd fade away and reform again in the corner of my vision.  And he emanated the most powerful sense of love and compassion.  And I got the impression of him stroking my head like a parent comforting a child and he told me, over and over, 'it's all right.  Everything is all right.'  I relaxed and let him comfort me.  I lost all track of time.  I couldn't have said if it had been 15 minutes or 5 hours.  J told me, however, that 40 minutes had passed.</p><p>I was left feeling shaken, and none too keen to do drugs again.  But I truly feel myself to be a modern shaman-in-training, being pushed along by spiritual forces, or maybe I should say spirits.  And I didn't let myself dwell on the negative aspect, but rather the lesson learned.  Or I should say, lessons.  I still feel the presence of the three 'entities' I encountered, whenever I think about them.  I realize that the 'green demon' is me, is my own struggle against myself, and that I'm my own tormentor whether tripping or in regular consciousness.  I also feel, though it is subtle, the presence of the feminine guiding force/goddess and the loving, comforting god.</p>"
}
