{
 "title": "Thyroid Problems Associated With Use",
 "author": "Awareness",
 "citation": "   Awareness. \"Thyroid Problems Associated With Use: experience with 2C-I (ID 39567)\". Erowid.org. Jan 14, 2005. erowid.org/exp/39567",
 "substance": "2C-I",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39567",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 14, 2005",
   "Views: 19931",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe year was 2004, and 2C-I had made a pretty significant impact on the underground club/rave/afterhours scene in my city. There was a general knowledge of what it was, what it did, and how to get it; moreover, most people seemed to agree that it was a lot of fun! \r\nMy friend B is a big fan of psychedelics; he's considered a hardhead with LSD and mushrooms, and he's tried a cornucopia of other research chemicals (DMT, AMT, 2C-T-7, 2C-T-2, MDA, MBDB, etc.) as well. Nothing he had tried, however, would change his life quite like 2C-I would.\r\nYou see, B was a person suffering from (or being blessed by) hyperthyroidism, a condition caused by overactivity of the thyroid gland. Symptoms included AD/HD-like hyperactivity, excessive amounts of energy (only 3-4 hours of sleep a night!), and an EXTREMELY fast metabolism (he was thin, constantly hungry, and would have bowel movements 2-3 times a day). All of this was occurring while he was being treated with the antithyroidal drug methimazole; imagine what he would have been like if his thyroid had been left to go totally unchecked!\r\nDespite his condition, B didn't think twice about trying 16 milligrams of 2C-I one summer evening. He had a great time, experiencing all of the light mescaline-like visual patterning, increased humor and joy, and energetic sociability commonly found in taking this substance. Upon coming down from his psychedelic foray, he reported getting one of the most restful sleeps in his memory, a whole 16 hours!\r\nThat long sleep was the first of many changes B was to undergo. In the next 2 months he went through, in no particular order, COMPLETE energy loss, 20+ lbs. of weight gain, loss of mood and motivation, and a decreased libido. A typical person would have seen all this as the signs of a major depressive episode. During this time, B continued to take his methimazole as directed. \r\nUpon seeing his endocrinologist at his regularly scheduled bi-monthly examination, the real story came out: B was suffering from HYPOthyroidism, a low-to-no functioning of the thyroid gland! The doctor was dumbfounded; this type of thyroid gland reversal was almost unknown. What could have caused this? \r\nB decided to tell his doctor about 2C-I; instead of being dismissed or rejected, the doctor took a true interest in his case. B is now taking liothyronine, an isomer of thyroxine (T4) one of the main products of the thyroid gland. Although stabilized and out of his depression, B says he will never be the same again. Gone are the days of unending energy and being able to eat whatever he wanted, when he wanted. In fact, B seems to have acquired 15 pounds that just won't seem to go away!\r\nUpon personal investigation of relevant information, I've found:\r\n1.The thyroid gland helps to regulate many key body functions, including the production and release of human growth hormone (HGH), Vitamin K production and regulation (Vitamin K regulates how much oxygen that blood platelets can carry), production and regulation of epinephrine (adrenaline), and to a lesser (but seemingly just as important) extent, the regulation of the mood regulating chemicals serotonin, norepinephrine, and dopamine.\r\n2. 2C-I is a iodinated chemical structurally related to epinephrine, norepinephrine, and dopamine. \r\n3. Iodine is the heaviest halogen available (there is one heavier, Astatine, but it is a rare, radioactive, and completely unusable atom in pharmacology).\r\n4. Iodine has NEVER been used in any psychotropic (mood-altering) chemicals other than thyroid medications.\r\nWhile many of Shulgin's chemicals employed halogens (ie. 2C-C, 2C-B, 2C-F, 2C-T-21, and also their amphetamine homologues), all of them, with the exception of 2C-I and its amphetamine homologue DOI, employ the lighter, and consequently 'friendlier' halogens fluorine, chlorine, and bromine. Even in medical pharmacology, iodine is never used outside thyroid treatments. For example Wellbutrin (bupropion) uses chlorine, and Prozac (fluoxetine) uses fluorine. \r\n5. 2C-I has a high affinity for serotonin HT2-type receptors, and to a lesser extent norepinephrine and dopamine receptors, all of which control critical aspects in regulating mood.\r\nEven without testing or any kind of clinical evidence, one could conclude that by introducing a chemical into the body that has a high affinity for mood-regulating receptors, contains a halogen that not only is much heavier that anything that normally enters said receptors, but also is used in the regulation of an important endocrine gland, there is going to be trouble.\r\nWho knows what kind of long-term damage 2C-I may have on people, not only those with thyroid problems, but healthy individuals as well!? Until some clinical data exists that shows 2C-I as not being neurotoxic, I would recommend that you stay away from taking this chemical.\r\nAlthough I respect and admire Alexander Shulgin a great deal, this much needs to be said: Just because someone produces data on hundreds of psychoactive substances does not mean all of those substances are safe, sound, and secure.\r\nMy opinion is: Stick with mescaline and mushrooms if you must do something, or better yet, find a more wholesome hobby. Psychedelic experiences are all fine and well, but do you really want to be your own guinea pig? You only have one life to live, and a few hours of fun aren't worth a lifetime of misery...\r\nPeace.\n\n\n"
}
