{
 "title": "Suffused and Eulogistic",
 "author": "Cosmo",
 "citation": "   Cosmo. \"Suffused and Eulogistic: experience with AET (ID 39572)\". Erowid.org. Dec 16, 2006. erowid.org/exp/39572",
 "substance": "AET",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "AET",
   "(capsule)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 39572",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 16, 2006",
   "Views: 8659",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a eulogistic experience, while feeling emotional charge and strike. this was my first experience with (AET) but I was not too nervous about talking it. I remember getting out of school and taking the train in Manhattan. I was going to meet w/ this friend of mine who had got Xanax and Zoloft for me. When I got to the city I gave him a call and went to his apartment. He showed me the things he had gotten and he asked me if I wanted to take some AET. I had no idea what it was, & I was originally planning on taking some acid or smoking hash. Sadly neither acid nor hash was around and I was in no mood to walk all the way over to the Park just for some acid. So I decided to stick with the idea about taking AET, and I was very spirited when I found out how similar the drug is to MDMA.</p><p>I took the AET around 5:30pm, it took about half an hour to start in. around 6:00pm I was totally fucking wired. I was sitting on the couch and could not feel my legs. The room got very dim and I felt a peaceful yet aggressive vibe. It was like a trance. It was like having dreams while wide awake. AET is basically a hypnotic induced drug, & I was very easily sedated while on it. There was very mild euphoria which surprised me, & the effects of Ecstasy were just way more vibrant in some aspects. with AET their is no bright light effect, colors dont get vivid they only appear with much more range. I smoked some haze that I found lying around to intensify the AET. when I stopped smoking I could feel the rush in my arms. I was not expecting the pot to kick into the AET that fast.</p><p>Unlike E their were no comedown effects. I felt very pleased, I had no disappointments about anything from the AET, it was a generally all around good experience.</p>"
}
