{
 "title": "The Oddest Three of Four Hours of My Life",
 "author": "spigot",
 "citation": "   spigot. \"The Oddest Three of Four Hours of My Life: experience with Cannabis (ID 3962)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3962",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 3962",
   "Not Specified",
   " ",
   "Not Given",
   "Dec 25, 2001",
   "Views: 4364",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At about eight oclock I met my friend, whom I'll call Kathy. She and I walked to a small wooded park, where earlier that afternoon we'd found a perfect place to smoke. We arrived at the designated area, I packed a bowl, and we lit up. We got about two hits apiece off each bowl (I packed them really small because I knew how potent it was) and after the third bowl, we decided to stop. I was feeling a little buzzed and Kathy said she wasn't really feeling it at all. So we packed up the dope, the flashlight we'd brought, and the lighters and set out for the road. </p><p>However, as soon as we stepped off the small concrete platform where we'd been standing onto the grass, it hit. Everything that I looked at was very, very pixellated, as though I were looking at a low-resolution digital image. Each separate part of my body, especially my hands and feet, felt like they were in different, discrete planes of existence. All of my senses, except touch in certain cases, were incredibly heightened. I especially remember thinking that my hearing had been augmented. I was twitching, slightly. I was so unable to judge distances that I didn't trust myself to light a cigarette.</p><p>However, without a doubt the strangest part of this whole experience was the way in which I perceived reality and the passage of time. For at least two and a half hours (in real-time...For me it seemed like days), I had a feeling of unreality. At first I thought I was dreaming, but I realized that that didn't quite cover what I was feeling. So I thought some more, and the best explanation that I can come up with is that I felt like I was an image on a movie screen...That I was a physical piece of a movie that someone else was watching. I had a pervasive, at times frightening feeling that nothing I did had any consequences because none of it was real. </p><p>In terms of my awareness of my surroundings...It's difficult to describe this without being really confusing and roundabout...The way I saw and thought about things was very similar to any movie or movie preview or something where the editors take several clips of a particular scene and place them all one after the other, even though in reality five or ten minutes may have passed between each clip. I would exchange a few words with Kathy, then we'd both fall into silence for a moment, and then I'd look back up at her and realize that I'd completely forgotten she was there, and I would have no memory of just having talked to her. Usually for those first few moments of realization I'd think she was a hallucination I was having (eventually, that began really to unnerve me, so I asked her to hold onto my arm, which made it a little better, but I was still pretty startled every time I looked at her). I had many consecutive trains of thought, but they were all very brief and died out one after the other. So, the end result of all of that is that everything felt incredibly disjointed. </p><p>That, combined with the fact that I felt like I was in a film, made last night one of the strangest nights of my life. I think I enjoyed it, though I think I would have enjoyed it more if Kathy and I had spent most of the night in a place where we knew we were going to be safe, such as one of our houses (both of our sets of parents were home, which is why we stayed out until it wore off a little, and that took about three hours).</p>"
}
