{
 "title": "It Must Have Been the Rain",
 "author": "Dan",
 "citation": "   Dan. \"It Must Have Been the Rain: experience with Cannabis (ID 39688)\". Erowid.org. Mar 31, 2008. erowid.org/exp/39688",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39688",
   "Male",
   " ",
   "Not Given",
   "Mar 31, 2008",
   "Views: 3284",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience happened several days ago in the city where I live in Southern California. I'm in high school, and have been smoking for about 9 months. At the time of this experience I was in a very good mood. I had gotten in trouble with my parents for smoking and for the last several months had smoked very rarely, but had just recently passed a drug test. My parents became much less restrictive and I was free again to hang out with friends.</p><p>As sort of a celebration two of my friends and I put our money together and bought around $180 dollars of marijuana, which gave us something around half an ounce. We smoked two blunts between us the day before this experience happened and discovered this marijuana was extremely powerful. Normally one blunt among friends will give me sort of a head change, and then another will get me moderately high. With this stuff, just one blunt had blazed all of us out of our minds. We were very eager to smoke more the next day.</p><p>It was a Saturday afternoon and it had been raining all day. My friend J and I took a cab from her house to my other friend's (L) house. Since her two little brothers were playing video games we went out to L's garage. L's garage is one of my top places I like to smoke. She has a couch and chairs, a heater, a tv, a cd player, and all kinds of movies and albums. We all sat down on the couch and talked while J rolled three blunts with some Strawberry Swishers. This weed was dark and very dense. When first looking at the sack it seemed like we'd gotten ripped off. Later on we discovered how densely packed it was. I don't know if it was hydro or from any particular place, but it was high quality stuff.</p><p>The timeline of events goes something like this:</p><p>4:40: J and I take the cab to L's house</p><p>5:00-5:30: J rolls the blunts while we sit around in the garage talking and listening to music. We light some incense so that it'll help cover the smell.</p><p>5:35: We get a great idea. We were somewhat limited timewise, and we all wanted to have as much fun as possible. J proposed that instead of doing three blunts in a rotation, like we normally would, we should each smoke a blunt simultaneously. This was perfect. Not only would all of our highs be enhanced, but it would significantly cut down on the amount of time it would take to smoke.</p><p>5:40-5:55: After some confusion about where J's blunt had been placed we were ready to smoke. L put on some Bob Marley, we lit up our blunts and started puffing away. The weed hit me very quickly. It felt so strange to just keep hitting the blunt again and again instead of passing it around to people. I remember feeling strongly like it was some kind of decadent treat or reward. The one thing that especially came to mind was that feeling of when you have a really large, tasty dessert or meal, and it feels like you won't be able to finish it. Towards the end of smoking the blunt it felt like I was sort of becoming 'full' and that I had bitten off more than I could chew. However, we all managed to finish our blunts, and the effect was amazing. We took pictures of ourselves on J's digital camera while we smoked, and there was something sort of crazy about seeing ourselves in this way.</p><p>The last several times I had smoked I'd noticed I hadn't really been getting the effects that I used to. This time the high came on as strong, maybe even stronger, as it had in the past, back when I'd been smoking during the middle of the summer. My friend's garage was super smoky. I felt like I was trapped in this thick haze and needed to get out for a little bit. I stepped outside into her backyard and that was when it really hit me!</p><p>I think it must have been the rain. It felt like I could see every single individual drop from where it started to where it fell, like everything had been drawn out perfectly in my mind. The feeling of the rain on my body gave me a very strange, indescriable feeling. If it'd been up to me I would've spent some more time outside, but my friends wanted to go into L's house.</p><p>6:00-6:30: We sprayed Lysol everywhere, lit some more incense, and then went into L's kitchen, where we each poured a huge bowl of Coco Puff's cereal. It was the classic munchies. The cereal tasted so good, and every little thing about it made me happy. The way it crunched, the tasty chocolate, the delcious milk at the end. While we were sitting there eating I began to start having very strong visual and audio hallucinations, which hadn't happened to me since the first ten or so times I've smoked. </p><p>L's brothers were still playing video games, and the sounds that the game was making seemed intensely real, like there was some insane battle actually going on in the next room. This one certain noise that kept repeating over and over made me start thinking the kitchen was shaking. It felt like whole room was vibrating back and forth to sounds of the battle. It was like one of those buses they bring to schools where they simulate an earthquake.</p><p>After eating the cereal I got up and went to the bathroom where I put some Visine in my eyes. While I was doing this I kept hearing things. I could've sworn on my life I'd heard L's mom come in the house and start yelling, that we'd gotten in trouble and we had to go somewhere else. When I came out nobody had come of course, and it was about time that J and I had to leave. We called another cab, and I found it very hard to give the cabbie directions.</p><p>6:40: I came home and went up to my room for awhile, as I was still very high. I changed my clothes and about twenty minutes later came down and ate dinner with my family. I was worried that they'd notice but I pulled it off pretty well and didn't act suspicious.</p><p>8:00-10:00: My family started watching a movie together. At this time I started to come down and become tired very quickly. I kept drifting in and out of sleep, and when the movie was finally over I went straight upstairs and fell asleep for 10 hours. The sleep was great and when I woke up the next day I felt totally rested.</p><p>This was an extremely fun experience. It was definitely one of the most powerful highs I've had in a long time. It reminded me why I really enjoy marijuana and smoking it with my friends. Probably the most intense part was when I was out there standing in the rain. It's hard to describe, but I had this huge feeling of wonderment; like it was amazing the way things were designed just right so that water could fall from the sky and bring life to everything. I really enjoyed it and am looking forward to the next time when I'll get to smoke, especially if it's raining.</p>"
}
