{
 "title": "Shaking Hands with Death",
 "author": "Brain damage",
 "citation": "   Brain damage. \"Shaking Hands with Death: experience with MDMA (Ecstasy), AMT, 5-MeO-DiPT & Cannabis (ID 39755)\". Erowid.org. Sep 15, 2005. erowid.org/exp/39755",
 "substance": "MDMA (Ecstasy), AMT, 5-MeO-DiPT & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 4:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:00",
   "5.0 mg",
   "smoked",
   "5-MeO-DiPT",
   "(powder / crystals)",
   "  T+ 0:00",
   "8.0 mg",
   "smoked",
   "AMT",
   "(powder / crystals)",
   "  T+ 4:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:00",
   "1 repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 39755",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 15, 2005",
   "Views: 5862",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is not your typical 'It was so good, nothing bad will happen to you,' kind of report. This is a serious warning to never take this combination of drugs (MDMA and AMT). I have took a lot of drugs over the years, but I have never been so afraid that I would die in my life.</p><p>The day started out just fine. I never saw it coming. A few hours after I woke up, I decided to smoke a bowl containing weed, around 8 mg of AMT, and around 5 mg of 5-MeO-DiPT. Although those doses were eyeballed, they were divided up from  known amounts. I wasn't super wasted from this, but I did have a nice tryptamine buzz that I eventually forgot about.</p><p>Later in the day, along with a few friends we rented a hotel room to chill in for the night. Before we got there, 'H' bought a half oz. of bad pot and 3 ecstasy pills. Wanting to have fun that night turned out to be a huge mistake. I completely forgot that I had smoked research chemicals (up to four hours earlier). 'H' set a 'goldfish' right in front of me; could I say no? If I had been thinking I would have turned him down. While waiting for it to come on, we smoked bowl after bowl of some really bad pot.</p><p>The more the pill kicked in, the worse I felt. Normally, I would be starting to feel good right about now. But the pill was doing something to me that it had never done before. It felt so wrong. It was like my body was doing nothing to break down the chemical. It hit me harder than it ever did before. Instead of feeling on top of the world, I felt like I was about to pass out. I couldn't see straight because my eyes were twitching nonstop. After a few minutes, things got really bad and I could hardly breathe or walk. I stumbled into the bathroom to try and force myself to expell the pill, but I hadn't eaten enough. There was no turning back. I have never been so scared. For about fifteen minutes I was on the bathroom floor, hands and knees, just forcing myself to breathe. I could feel every part of me being devastated.</p><p>Luckily, the feeling of passing out became less while the roll became stronger. After about 20 minutes, I no longer felt like my body was about to give out. Ecstasy has never affected me so much, even on my first time or with multiple pills, nothing like this happened. Normally the roll has a numbing quality so I can't feel my mind being fried, but this time, I could. I felt so much better than the last few rolls I took, but the toll it took was way worse.</p><p>'S' ordered some food and we sat around the hotel room rambling nonstop and eating a couple bites of burger when we could. I am sure some of the people staying there knew we were wasted, one guy offered to sell us weed. We messed around the hotel all night playing games, going into the sauna, and just roaming around. I'm surprised that we didn't get kicked out for keeping somebody awake. After 'H' and 'B''s rolls started to wear off, they began drinking. I couldn't bear to drink because these drugs burned me out more than anything I had ever taken. I did drink a little the next morning to counteract the feeling of scumminess. I really don't drink unless I am desperate. By 4 AM (5-6 hours after taking the roll), everybody CRASHED. We passed right out.</p><p>I still get a strange feeling in my upper back just thinking about it. I was really lucky not to end up in the emergency room.</p>"
}
