{
 "title": "Two Opposing Trips",
 "author": "killjoy",
 "citation": "   killjoy. \"Two Opposing Trips: experience with Cacti - T. pachanoi (ID 39822)\". Erowid.org. Jul 27, 2005. erowid.org/exp/39822",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "450 mg",
   "oral",
   "Mescaline"
  ]
 ],
 "footer": [
  [
   "2004",
   "39822",
   "Male",
   " ",
   "Not Given",
   "Jul 27, 2005",
   "Views: 8042",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I find mescaline to be a ridiculously unpredictable drug, the three times I have ingested it over the past 6 months have all been totally different experiences, however the last two were so opposed to one another that I will think much more seriously about the circumstances in which I take mescaline again. The first experience was a fantastic trip, using Kerry's black-green plastic balls method (see cacti recipes). Myself and three other good male friends took what turned out to be a medium size dose, the trip was interesting for several reasons, but mostly because of the strong bond established very early in the trip between the four of us.</p><p>This led to a hilarious night where everyone seemed to be a comic genius, the conversation basically consisted of elaborate jokes that everyone slowly added to, it was fantastic and many of them have found their way into our normal lives. I highly doubt that any night for the rest of my live could eclipse the hilarity of that trip; the mindset was astonishing, I tend to be over-analytical in most aspects of my live, and any substance seems to magnify this, including the first time I took mescaline, it doesnt really bother me but this trip had a magic complacency to it, I could relax and know that I could say anything to my buds and not be judged.</p><p>\nThe second trip was only twelve days later, at the same place, and all the guys from the previous trip plus eight others were ingesting, also, three or four others were present but not tripping. We brewed cacti from the same plant in the same way, which took about five hours due to the numbers, and ended up eating it at about 3 am, myself and T, whose was present the last time, went hell for leather, mainly because we feared there was not enough there, and thus ended up taking about 20 more balls than everyone else, around 70 I imagine. This trip came on remarkably quickly, like 45 minutes instead of the usual two hours, I wasnt tripping hard till three hours later but I could definitely feel it.</p><p>As usual with a large number of people tripping, we split into three groups, this was not pleasant, I couldnt help but think it seemed very unsociable, for the rest of the night I could never truly comprehend the people from the other groups, I simply couldnt read their expressions or tone of voice, it was very unnerving. Particularly disturbing were the girls there, six or so were tripping, and they were good friends, but I found it intensely uncomfortable being around them, the basic mental differences between girls and boys became glaringly obvious to me. None of the freedom of speech so important to the last trip was present or possible around the girls, and they cast collective judgements (mostly negative) freely, which was indescribably awful.</p><p>Eventually I gave up on trying to enjoy spending time with anyone but T, because I knew he was tripping as hard as I was I could comfortably relate to him, we had some good hallucinations and went swimming with a few others which was ridiculously fun. By 10 am everyone was back to normal and we got along fine, I dont think the girls realised that almost all the guys found them uncomfortable to trip with. Nevermind. As I said earlier, I will be more conscious of the circumstances I trip in from now. Good mates, preferably of the same gender, isolated from others, on exactly the same dose is the only way to trip.</p>"
}
