{
 "title": "Fun Little Additive",
 "author": "Rayzak",
 "citation": "   Rayzak. \"Fun Little Additive: experience with Catnip & Alcohol (ID 39854)\". Erowid.org. May 30, 2007. erowid.org/exp/39854",
 "substance": "Catnip & Alcohol",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "24 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "2 bowls",
   "smoked",
   "Catnip",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "39854",
   "Male",
   " ",
   "Not Given",
   "May 30, 2007",
   "10578",
   " "
  ]
 ],
 "report": "<p>In November of 2002, I was a college senior and quite the chemical sponge. I was experimenting with many different combinations of substances and settings, as I was free to do so at that stage in my life. Most of my experiences started with research on Erowid, and ended in a pleasant nights sleep. With graduation on the horizon, and that inevitable search for my first internship, I knew I had to keep my body clean of illegal substances, or at least less riddled with them. For the past few weeks, I had been experimenting with legal highs with mixed results. Passion Flower, Salvia, Nutmeg, and Catnip, my choice for this particular night. </p><p>My setting should sound familiar to most people. A 10 by 15 college dorm, lit with clear Christmas tree lights. Comfy chair, computer, and soft music. My mind, as with every time I indulge, was very excited, eager, and slightly nervous. By this time, I knew what preparations to take, environment wise, to ensure I would not be caught doing whatever I was doing, so that eased my mind slightly. This included taping doors to prevent smoke from escaping, a fan in the window, and help if something bad happened, like having a friend only two doors down. However, I was trying something new, so I was more excited than normal.</p><p>I had read weeks earlier that Catnip could be used to alter a persons mental state to some degree. I had purchased and smoked some a few days before, but with no results to speak of. However, I've read enough experiences to know if at first you don't succeed, try mixing things. This night I just happened to have a six pack of Smirnoff Ice to go along with my Catnip. I chugged the first bottle, and started a second. I could feel the warm sensation in my belly that alcohol causes, then packed and quickly smoked a bowl of Catnip using my water bong.</p><p>At this point I must say that Catnip is by no means smooth or pleasant. It's harsh, it stinks, and tastes pretty bad. This only caused me to drink more. This pattern continued for about 10 minutes until I had smoked two full bowls and drank two and a half bottles of the sugary brew. At first I noticed nothing out of the ordinary. I decided to visit a friend of mine at work (he worked unsupervised at a computer lab) to kill some time. </p><p>Over the next 15 minutes, I noticed that my vision became much sharper, almost pixilated. As I walked to the computer lab, passing people, I felt very paranoid. However it was a very fun paranoid, like I know something you don't. When I reached the computer lab, my friend noted that I was grinning. After sitting down, I realized that I felt much more drunk than I should have, considering the small amount of alcohol I actually consumed. I was somewhat giddy, drunk, and slightly euphoric all at the same time. I had never had alcohol effect me in this way, so it must have been the addition of the catnip. Colors were slightly more vivid, my vision was sharper, and everything sounded tinny. These effects lasted for about an hour, which is about how long that much alcohol could possibly effect my body. </p><p>His shift ended, we got some food, and headed to his dorm and invited some friends. Within 30 minutes, I was very tired. I drifted off to sleep for about 30 minutes, then woke, and returned to my own room where I slept very deeply for 9 hours. I woke up the next day tired, but it was a pleasant tired, like I had just made love. After getting around, I felt no negative side effects from either the alcohol or catnip and was able to function normally. </p><p>I feel that, had I continued both drinking and smoking the catnip, I could have maintained those sensations I described. In a bar setting, I could see catnip being a very nice friend. I must note one possible negative effect of catnip outside of its bad taste. I've read from several sources that catnip stimulates the bowels. I myself experienced this, it was similar to a normal dose of laxative the day after I smoked it. Not enough to cause discomfort, but it was noticeable.</p>"
}
