{
 "title": "Unpleasant Jolt of Electricity",
 "author": "Mark",
 "citation": "   Mark. \"Unpleasant Jolt of Electricity: experience with Out of Body Experience (ID 39855)\". Erowid.org. Jan 25, 2005. erowid.org/exp/39855",
 "substance": "Out of Body Experience",
 "bodyweight": "150 lb",
 "header": [],
 "footer": [
  [
   "2004",
   "39855",
   "Male",
   " ",
   "Not Given",
   "Jan 25, 2005",
   "12452",
   " "
  ]
 ],
 "report": "</p>\nI woke up one morning at around 6 AM feeling thirsty. I got up and went to the kitchen to drink a glass of water. I returned to bed, and began drifting off. As I was re-entering sleep, I began had a rather uncomfortable feeling of electricity jolting through my brain and diffusing through my entire nervous system. I managed to fall asleep nonetheless. </p><p>The next thing I knew, I was serenely floating about three feet above my bed, looking straight ahead. I calmly noted that my room appeared absolutely real down to minute details, and even the amount of light coming through the windows was correct for that time of morning. Thoughts occured to me in this state. No effort was involved in thinking, however, as my thought was actually pure impression arising within my consciousness, devoid of language and symbolism. </p><p>Presently I drifted down through the bed and to the floor. Drifting through the bed felt incredibly peaceful, even blissful. I figured I would go straight through the floor and right down into the earth. The hardwood floor, however, proved to be a formidable obstacle. I 'pressed' against the floor for a time, and finally succeeded in breaking through. There was a flash of color, then all went dark.</p><p>The next state of consciousness to which I was privy lacked qualities, making it difficult to describe. It was, of course, the famed and highly sought after egoless state of the mystics and drug users alike. Somehow, I was able to retain a fragment of awareness in this state. The feeling was timeless, eternal, still. No thoughts, no perceptions, only a feeling of deep bliss and awareness abstracted to the highest degree. I believe that we likely enter this state every night as we sleep, but are very rarely if ever aware during it. To achieve awareness during deep dreamless sleep has been a desire of mine ever since that experience.</p><p>I came out of the timeless expanse of pure radical consciousness only to find that now my mind was being radically conjoined with physical space. I felt 'projected' on to the ceiling above me, merged with the space in front of me, 'one with' my room, so to speak. I laughed at this, because the sensation was surprisingly pleasant. Of course, in retrospect, it seems bizarre indeed!</p><p>I then had several lucid dreams, one of which involved me deliberately and willfuly creating a Pac-Man video game console and playing it. I recall that I made the ghosts much too fast, and I lost at my own game! After this, I re-entered normal sleep.</p><p>I have had several of these experiences, all of which seemed to be accompanied by that unpleasant jolt of electricity as I fall asleep. Truly I have realized that the human brain is one of God's most fascinating, and mysterious creations.</p><p>I personally believe that the image of my room as I floated above my body was a strikingly accurate representation made by my brain, and that I was not actually detatched from my body.</p>"
}
