{
 "title": "Life in Motion",
 "author": "Noone",
 "citation": "   Noone. \"Life in Motion: experience with Cacti - T. Peruvianus (Peruvian Torch) (ID 39872)\". Erowid.org. Nov 30, 2006. erowid.org/exp/39872",
 "substance": "Cacti - T. Peruvianus (Peruvian Torch)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.75 oz",
   "oral",
   "Cacti - T. peruvianus",
   "(capsule)",
   "  T+ 15:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "39872",
   "Male",
   " ",
   "Not Given",
   "Nov 30, 2006",
   "4232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Up to this experience, I've tried mushrooms and various reasearch chemicals, nothing too untested.  I'd done lots of reading on the traditional psychedelics, and found the descriptions of mescaline quite intriguing.  so, I did some research and found that it could be obtained through a couple different cacti.  As you can imagine it didn't take long for me to acquire some peruvian torch.</p><p>My friend D and I decided to give it a go.  I set it up so I would dose in the morning close to upon waking.  Dose time being about noon on a wednesday, with no prior obligations or responsibilties.  On that particular morning I was feeling pretty good emotionaly, despite the fact I had just quit my job.  Anyone who has ever consumed cactus I'm sure knows how utterly bitter it is, so I decided to crush it and capsulate it.  After the dose of 1.5 oz of dried material had been capsuled it came out to around 80 capsules, that were then taken over the coarse of 45 minutes.</p><p>The action of the drug came on very subtley, unlike any other psychedelic I have tried. I felt like I had slowly careened into the peak, which didn't come on till about 3 hours after the final capsule had been swallowed.  The effect of the drug were quite different than any other I had tried before.  Tactile sense had been increased more than it had ever been, and the visualization were very profound, far more so than on mushrooms.  One particular occasion I was staring out a window at the lawn and I felt that I was truly watching life in motion in the grass, and that every second was an infinance of life happeing in front of my eyes.  After that particular vision I began thinking about how perfect the individual truly is and how sad it is that no one really sees it in themselves, which brought me to an incredible feeling of joy that eclipsed all other feeling of elation I think I have ever expierienced. </p><p>As body load goes it was one of the most relaxing trips I've ever had, but also it was the most intense trip I ever had. The only problem that occures was about half way through the trip my friend D got a little freaked out and hid away in a closet giggling maniacially,and would not remove himself.  Finally, to get him out I had to tell him I was departing and leaving him there by himself.  It worked, luckily, because he was breaking up, but after he came out he calmed down considerably, and had no more problems.  </p><p>Finally around 1 in the morning the visual distortions ceased, and I was pretty much at base line and able to sleep around 3 with the help of a little pot.  A truly life changing expierience.</p>"
}
