{
 "title": "The Horrible New Way",
 "author": "D-eViL",
 "citation": "   D-eViL. \"The Horrible New Way: experience with Various (Drug Testing) (ID 39873)\". Erowid.org. Jan 18, 2005. erowid.org/exp/39873",
 "substance": "Various (Drug Testing)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 39873",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2005",
   "Views: 19993",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI need help!!!! I dont know if anyone has heard about the horrible news... I live in Florida and in 2 counties (I live in one of them) they have a new way of drug testing. No more blood testing, no more hair testing, no more urine testing. The new test is a retinal scan.  Yes, its hard to believe but I swear to you it is true (I'm stuck testing on it every week after going through Drug Court!). It as called 'pass-point'. The machine is about the size of a slot machine and is located in both dade and martin counties. This machine supposedly costs $25,000 and is impassable. <br>The test works like this, first you must be 'baselined' into the machine 3 times. The test must be done with your right eye only. You look into the machine and rest your forhead on a platform. There is a green dot at the end of a short tube. You enter your # into the machine and line up your eye with the green dot, then you press a green button to begin the test. The machine will make a high-pitched sound letting you know it's found your retina. Then the green light moves back and forth from right to left 6-8 times (this is to track eye movement as well as scan the retina). The dot then returns to the middle for 8 seconds giving you time to blink and relubricate your eye (you cannot blink from the time of the sound to this time or you will fault the test and have to retake it). After the 8 seconds the small dot is in the center again and 4 large green dots flash around it. The large dots are 1/2 second flashes and they flash another 6-8 times (this checks for pupil dilation). If you did the test correctly the machine will make another high-pitched sound telling you that you took the test correctly (doesn't mean you passed....). If at any time you move or blink during the test the machine will make an error sound and you will have to retest. <br>After you get through the test then your results are printed. The results either say low-risk (your eye tested close enough to your baseline so you are at 'low risk' of being negative aka you passed) or high-risk (your eye was not close enough to your baseline). If you low-risk, you have passed an you are done. If you are high-risk then you must wait 5 minutes and retest. If after you retest you get high risk for the 2nd time, you fail the retinal scan and then they crossreference it with a lab-urine test (very strict urine test the also tests for dilutes, additives, adulterants, ect.). I get this test once every week plus randoms!!! I want to know if anyone knows any ways to beat this machine so I can smoke a god damn blunt! Most people have never even heard of this since it is so new but they better start learning.\n\n\n"
}
