{
 "title": "Dark Metal and a Dead Patient",
 "author": "Archer",
 "citation": "   Archer. \"Dark Metal and a Dead Patient: experience with Mushrooms & Cannabis (ID 39927)\". Erowid.org. Apr 3, 2008. erowid.org/exp/39927",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "245 lb",
 "header": [
  [
   "DOSE:",
   "0.6667 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 39927",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 3, 2008",
   "Views: 2762",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA little background: This experience happened when I was 18. I had been smoking pot since I was around 13, but not regularly until I turned 17. I had also used prescription drugs (numerous painkillers, tranquilizers, and muscle relaxants) that pretty much demolished my memory of my 10th grade year. A close friend got sent to rehab for that stuff, so that scared me straight. Other than alcohol, cigarettes, and opium once or twice, that's the extent of my drug experience. This was my first time trying mushrooms.\r\nIn December of 2004, my friend Rob brought back 3 grams of supposedly pretty decent mushrooms from the mountains. The plan was to trip and have a kick ass band practice - we'd often practiced after smoking a few bowls, and other than a tendency to not remember awesome riffs and arrangements, it was pretty good. About 8 PM, we (myself, Will, and Rob - the latter is a fairly experienced tripper) smoked two bowls of fairly good weed, then ate a gram of mushrooms each (around 9 PM). We started playing music, and around 9:35 PM or so, I began to get fairly giggly and generally started acting stupid. During breaks between songs, it was difficult for me to complete a sentence without laughing about something. \r\nOur band plays fairly heavy material - think Tool combined with a healthy dose of Swedish/American death and grindcore. Now, I had heard before hand that it's VERY IMPORTANT to be in a positive mindframe and be in a generally happy environment prior and during a trip. That said, it probably wasn't such a good idea to be playing dark and fairly sinister music while on a first trip. During one of our songs, I began to experience my first visuals - slight tracers, an intensifying of colors. Will (the drummer) had his kit set up in front of a wall of shelves that had several red gasoline cans on it. For some reason, this red stuck out incredibly, and began reflecting off his cymbals. I began to see Will bathed in red light, and got the idea that Will was somehow working in Hell - he was hammering away at his kit, and I imagined that he was toiling in Hades, constructing something that would never be completed. An incredible wave of overpowering evil came over me - the music and the image of this demon came together in a diabolic wave of darkness. Oddly enough, this didn't frighten me - I felt a surge of adrenaline and it really 'pumped me up,' for lack of a better phrase.\r\nWe eventually finished playing (10:30 PM) and went out on the deck for a cigarette. It was here that I began to experience my first feelings of anxiety and depression. I must admit the visuals were spectacular - it was a nearly full moon, and it seemed that everything was bathed in a cold blue light. The sky was amazing large and vivid, and the moon looked bigger than I'd ever seen. However, I couldn't enjoy these for long, as I began experiencing waves of sadness and depression. I felt as if my life were falling apart, and I was terrified at the thought that I would feel this way for the rest of my life. I managed to keep my emotions under control and laughed along with my friends, generally discussing typical drug conversations ('Dude! What if the universe was, like...').\r\nAt about 11:15 PM, after multiple cigarettes and mounting tension for me, we went inside. Time was moving quite slowly by now - I felt that it had been hours since we had finished playing. I started feeling sick to my stomach and ended up vomiting into the kitchen sink. I could see chunks of mushroom in my vomit, which leads me to believe that I hadn't received the full effect of the gram. I felt absolutely terrible at this point - there were continual feelings of anxiety and confusion, and I told my bandmates that I wanted to call it a night and pretty much get out of the house. I'd had a few run-ins with some of the other housemates, nothing serious, but at the time they loomed very large in my mind, and at some points, I had an intense feeling that these housemates were in the other room talking about me. I later learned that we were the only ones in the house. \r\nWhile we were packing up our gear, I told Rob that I thought I was having a bad trip. He encouraged me to push the bad thoughts out of my mind and think happy, but at this point I felt as if I was in a well; every happy thought I attempted to bring up was immediately pushed aside by some unhappy idea. I told him that I thought I should just go home, but he told me (rightly, I believe) that I didn't want to be alone right now, and that I should come home with him. We finished packing and arrived at Rob's house at about 11:45.\r\nSurprise! Rob's parents are still up, watching 'ER'. Knowing that tripping around authority figures is always a bad idea, Rob asks his parents if there's any way that they could go watch 'ER' on the TV in their bedroom so we could play some video games.\r\n'Sure - ,' Rob's mom starts to say.\r\n'Well, it's just 10 more minutes. We'll just finish it here.' Rob's dad says.\r\nAwesome. I am watching one of the most dramatic and intense TV shows out there with one of my best friends VERY conservative parents, and I am tripping my balls off. NOT GOOD. Thus began the longest and most excruciating 10 minutes of my life. On the show, a patient had died and a doctor was convinced that it was her fault.\r\n'Doctor, you removed the air tube too early and now your patient is DEAD.'\r\nNo! My soul wept for this patient, whose life had been stolen from her at such a young age. Now, I can look back and laugh (albeit, fairly bitterly) at my reaction, but at the time I was freaking out. I remember sweating profusely and feeling the need to yell and cry out. I felt as if I had known 'the patient', and honestly, I cannot explain the depths of my sadness at her death. I knew that if I didn't leave, I would go crazy - and probably stay that way for the rest of my life. I excused myself and went outside and called my girlfriend, who, thank god, calmed me down quite a bit - reminded me that in a few hours, I would be fine, and that it WAS, after all, a hallucinogenic drug and it was all in my head. I really don't know what would've happened if my girlfriend had not been there for me, and I'm truly thankful for her.\r\nI collected myself and went back inside, where 'ER' was thankfully drawing to a close. I sat in a chair and watched Will and Rob play Halo 2, which, oddly enough, had a very calming effect on me - I'm guessing it's due to the fact that I had played the game before when not under the influence, and watching it sort of returned me to reality. I was still experiencing waves of depression, hopelessness, and despair, but they came less frequently. The relief when one wave passed and I was in the 'trough', so to speak, is one of the greatest feelings I have ever experienced - the knowledge that I was going to be fine, and the world was not such a horrible place after all. \r\nFinally, around 1 AM, I had come down a great deal. I noticed that I appreciated everything much more - everything seemed so clear and clean. Smoking a cigarette outside with my bandmates seemed like such a privilege, and I remember marveling at the moonlight passing through the ice on the branches of trees. It was an almost euphoric rush, knowing that I was past the worse and I could enjoy the world again. I went home around 2:30 AM, and though I experienced some very mild visuals while in bed waiting to go to sleep, they were more of the 'Hmm, did that just happen?' variety rather than the 'Holy shit' kind. I slept like a rock and felt very good in the morning.\r\nSo that's it. I've tried shrooms once since then, in a much smaller dosage - not sure the exact amount, but I ate one Reese's peanut butter cup-sized chocolate with several different friends, and while I did get a pleasant body buzz at first, again I experienced a (much milder this time) sense of anxiety and general unease. \r\nI've since concluded that mushrooms are not for me - maybe I will give them a shot in the future, but I believe that my personality does not mix well with heavy hallucinogens. I am a somewhat anxious and/or paranoid guy, due to a random assault wherein a schizophrenic guy kicked my ass in a McDonald's, and I tend to dwell on negative thoughts waaaayyy more than anyone should.\n\n\n"
}
