{
 "title": "Raw",
 "author": "Eyesoulate",
 "citation": "   Eyesoulate. \"Raw: experience with Diphenhydramine (ID 39969)\". Erowid.org. Apr 3, 2008. erowid.org/exp/39969",
 "substance": "Diphenhydramine",
 "bodyweight": "11 kg",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "39969",
   "Male",
   " ",
   "Not Given",
   "Apr 3, 2008",
   "Views: 15243",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>2:25 - Took 6 Nytol One-A-Day Tablets (300mg Diphenhydramine BP)</p><p>[Note: Equivalent to 12 regular Nytol Tablets]</p><p>2:40 - So far feeling *very* drowsy, slight difficulty typing; could fall asleep any second.</p><p>2:47 - Just got a completely weird static-shock like feeling in the tip of my left hand's index finger. Very weird. I had been in a trance, reading off the web when it happened. Now I feel slightly disassociated, drowsy, and slightly itchy.</p><p>2:54 - Im so hungry but I don't want to leave the sanctity of my room. It's become a real challenge to type now; I feel as though the faster I type the more correct my words will come out. My throat feels tight, and Im taking deep breaths; not out of necessity, but because it feels really good. Music sounds really good; Im currently playing atmospheric choons from the FFX OST.</p><p>3:26 - Im pretty clapped. Just grilled up some boom chicken. I kept hearing weird sounds. When I move and look at a window, my reflection is delayed, and has shadows. I heard someone get up and walk around; but no one was there. Im talking pure reality walking around; I could have sworn someone was there. Weird as fuck. This is so not as raw and scarey as people said it would be.</p><p>3:32 - The effects have suddenly intensified. Typing is really hard; lights are super bright and it's really hard to think. Just had an involuntary spasm in my left arm; sending some chicken flying. It's getting pretty damn strong; not bad. Oh my god eating feels so weird. I don't know how my chicken transformed into beef but it has. I see little black dots whizzing past in the corner of my eye. This is fucking strange.</p><p>3:35 - SHIT. I just ran my fingers through my hair and it was fucking amazing. Super soft; my fingers felt like someone elses. My blinking is really slow. Typing gets harder and harder. My nose was just itching; I tried to scratch it and completely missed. This shit is gettin raw and strong. OH SHIT. Not good. Just got a full body shudder; and heard my dads footsteps outside my room. This is fucking crazy. I feel mental. I keep forgetting that Im high.</p><p>3:40 - ok now Im officially SCARED. I had a teaspoon on my desk. It dropped with the sound of THUNDER; like a window being smashed. It's really hard to stay focused. Oh my good I keep seeing this it's not good. The light keeps blinking on and off. This is fucking FUCK.  I keep seeing little insects fly across my point of view. I feel really schizo. In the corner of my eye I see things morphing. This is definately the craziest thing. Im gonna go lie in bed soon this is too much. My words keep typing backward. AH FUCK...the computer screen just randomly changed to some weird thing and then back again. FUCK Im all jerky.</p><p>3:41 - I can't believe I just typed all that so fast. I keep hearing my dads footsteps, it's fucking horrible. And the fucking shock that comes with it is ridiculously not nice. Full body tremors when I get shocked. I keep coming close to blacking out. The walls are tricking paint UPWARDS.</p><p>3:44 - It's just getting stronger and stronger. Im not sure whether to love it or hate it. Im closer to hate right now; Im really scared. Fuckin hell. Chatting to Toni online; can't understand a word he's saying. It's all gravey as long as my parent's don't come. Fuck, how did I start typing that I was gonna go chat to Toni. The lights keep flickering its so scarey. FUCK. The luminosity of my ENTIRE ROOM just went sky high. Everyhings so bright. I keep getting spasms in my body and hearing popping noises.</p><p>3:47 - Ive totally FORGOTTEN how to drink from a glass. It's fucking weird. And the juice tasted like pussy, I'm involuntarily crossing my legs, I have no control over them. I almost didn't finish that sentence because I had forgotten what I was doing. My hands are cold. I feel really heavy in weight. My face feels so different.</p><p>3:59 - My motor reflexes are gone now; touching my own face with my hands is really hard. My perception is fucked; I tried to lean back but for some reason the back of the chair disapeared. Oh well. Putting my tongue in my cheek is amusing. The thing with this shit is; it's not a constant trip, shit POPS UP in a scarey way. It's so fucking crazy, instantly the lights clapped up; Ive forgotten what I was chatting about, argh. Oh yeah the walls are dribbling; tick final fantasy music and such. Looking down at the keyboard gives me a massive head rush and I keep licking my lips without knowing why. FUCK I thought it was a tonk fly but on of the black dots just whizzed past in a raw movement. Fuck it, I don't think I can carry this. This shit is raw. Im gonna chill for a bit.</p><p>4:12 - I just got up and walked, perception is completely destroyed. EVERYTHING is really heavy in terms of weight, sounds are amplified so hard that I jump. I just lay in bed and looked at the wall; it started shimmering; then I SWEAR I so the hugest tarantula, no fucking joke it was on the wall adjacent to my bed; fucking as big as 4 fists, wiggling all it's legs furiously. It looks so real it's amazing. If I hadn't mentally prepared for shit like this I'd be crying. The tarantula disappeared and now there are a few normal sized spiders. I hit one with a book and powdery residue scattered everywhere so I thought it was actually real and that I had killed it; I looked away for a second and looked back and there it was again, crawling about. I keep seeing the rawest things. There's too much to explain and quite frankly I don't want to see anymore of this shit.</p><p>*edit* 4:30 - 6:30 or something stupid like that - (NOTE: this is written now as I have woken up and am sober; at 3:00 pm, but is an interesting account of what happened after I logged off):</p><p>I had been trying to fall asleep for ages and it was literally IMPOSSIBLE. An immense amount of energy was running through my body for hours; every once in a while I spasmed to try and get the annoying feeling of energy out of me, through my right arm and leg mostly. When I lay down in my bed, it was like falling into a massive black hole or some shit, the feeling when Im on a rollercoaster and go down super fast, yeah that feeling; and my blankets went black and tried to swallow me. I gave out a little scream which to me sounded like an army of banshees wailing but that was probably in my head. </p><p>I *so* regret turning the lights off to sleep; horrible scraping sounds, gunshot sounds, my dad kept opening my door and bursting in; my heart would jump because I didn't know what to say; then Id look up and no one would be there; the door was closed. I had to get up about 8 times to piss, each time more horrifying than the last. When I looked in the mirror I saw a wide-eyed psycho staring back. It really didn't look like me. I tried making my eyes look smaller but it was impossible, I guess that's a physical side-effect. Walking felt so weird; I had no balance, and I felt huge. I can't describe how ridiculously raw this experience is. I honestly don't think anyone that I know could handle this kind of 'trip'. I use the term loosely; because what it actually is, is a temporary state of induced acute psychosis.</p>"
}
