{
 "title": "Fun at New Year's Eve",
 "author": "Greengills",
 "citation": "   Greengills. \"Fun at New Year's Eve: experience with Absinthe & Cannabis (ID 39996)\". Erowid.org. Jan 23, 2007. erowid.org/exp/39996",
 "substance": "Absinthe & Cannabis",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 oz",
   "oral",
   "Absinthe",
   "(liquid)",
   "  T+ 0:45",
   "1.5 oz",
   "oral",
   "Absinthe",
   "(liquid)",
   "  T+ 1:30",
   "1.5 oz",
   "oral",
   "Absinthe",
   "(liquid)",
   "  T+ 0:00",
   "4 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "39996",
   "Male",
   " ",
   "Not Given",
   "Jan 23, 2007",
   "16378",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend, D, and I decided to get a bottle of absinthe from the czech rep. for New Years Eve this year.  I ordered it online and it showed up in about 2 weeks descretly packaged.  I opened the package to reveal a 750mL bottle of a cool green 140 proof liquor named Absinthium 1792.  I was told that the Thujone level was pretty high (30-34 ppm) aproaching the legal limit for European liquor of 35 ppm.</p><p>I had the bottle sitting on the counter for a while as it was a week or so before New Years Eve.  People that came by asked me about it and I was excited to tell them everything I knew about it.  I couldn't wait to try it.</p><p>New Years Eve came up and D and I got together at my appt.  We wanted to try the sugar water ritual first (for shits and giggles).  We didn't really do the ritual correctly because we just ended up mixing sugar with water in a glass and then pouring it into a glass containing a shot of Absinthe.  The mixture clouded into a nice looking louche.  it was opaque and soft-colored.  I took my first sip and the taste wasn't too bad.  The anise in it was very apparent and me, not liking the taste of licorice too much, had to get used to it a bit.</p><p>My friend D took his first sip and I think he said something like 'wow...so this tastes like shit'.  We sat around and sipped on our drinks for abour 45 minutes.  I felt a little buzzed, but nothing more than I would expect from a drink of 140 proof vodka.  </p><p>We made ourselves another drink in the same fashion and took about the same ammount of time to drink them down.  I was getting used to the flavor and I was starting to feel a little warm and relaxed.  D said he didn't really feel too much and seemed a little disappointed.</p><p>He had to take off so we decided to do a straight shot each to see what we could get out of it.  We were a little apprehensive to the idea of going overboard with it on our first time.  We cheers for the New Year and took down the shot and chased it with some half-full bottles of sprite I found in my fridge.  I didn't really need to chase the shot because it was of high proof like one might think, but because the taste was so strong and aromatic that you just need to get it out of your mouth.  I found that it was pretty amazing that the flavor of a liquor could be so concentrated that it didn't even taste like alcohol.</p><p>D left, his girlfriend driving him.  I went into the living room with my girlfriend and we turned on the TV.  I layed on the couch and was talking to her about something.  Suddenly I noticed that the Absinthe was actually effecting me.  I have quite a bit of drinking experience and it was dramatically different from an alcohol buzz to me.</p><p>I got quiet.  I didn't feel like talking.  I felt like listening to people on TV talk.  My girlfriend was also talking on her cell phone to some of her friends and I liked watching her talk.  I was happy that my money didn't go into fake absinthe, because it's one of the biggest problems with ordering it these days.</p><p>As I layed there, feeling relaxed, warm, and very content with life I noticed my girlfriend was getting a little concerned with my sudden quiet behavior.  She kept asking me if I was okay and I just replied 'yeah, I'm fine'.  I didn't feel like explaining myself.  I was just concentrated on continuing my experience.</p><p>At one point my girlfriend felt my pulse because she noticed that I got a little cold.  She said it was a little slow but I wasn't too concerned.  I felt that I knew myself very well and I wasn't even slightly worried that something could be wrong.  My thoughts were intense and focused.  I felt like my body was a little drunk, but I had precice control of my motor-skills.</p><p>I could compare my experience to the feeling of a couple of Codine downed with 3-4 beers.  Those were my physical feelings, but my metal feelings were much different.  I don't know what I could compare to that.  </p><p>Probably about an hour after my shot, maybe a little more, is when I 'came down' from it.  I was left with a little alcohol buzz.  I felt a little drained from the experience.  I figured it was just mental fatigue from the intense focusing I was doing with everything.</p><p>D came back around 2 am with his girlfriend and she brought her bowl and some bud.  We decided to watch a movie (Napoleon Dynomite, which is awesome by the way) and smoke a little bit.  I got a nice high and sunk into my chair for a while until I decided to finally give in and go to bed. Overall it was a really fun night.  </p><p>Since then I have finished the rest of my Absinthe, sharing it with some of my friends at school.  It seems that it hits me much faster on my more recent experiences with it.  I'm not sure why, really.  My latest drink of it was 2 mixed cups in about 1.5 hours.  My roommates and I then listened to some music on our surround sound in the dark for a while.  We all stared straight forward for about 30 minutes and didn't say anything.  Doing this was probably the most rewarding thing I could of used the Absinthe for.  The music felt so clean and crisp.  Kind of like the effects of pot on me with music.  There are several parts of the songs I could almost disect and listen to on a more intimate level.  I can appreiciate the music much more when I am drinking absinthe or smoking, and when my friends can experience it with me is when it becomes exponentially rewarding to me.</p>"
}
