{
 "title": "Spectrum of Effects",
 "author": "Elfstone",
 "citation": "   Elfstone. \"Spectrum of Effects: experience with 2C-T-7 (ID 4)\". Erowid.org. May 31, 2000. erowid.org/exp/4",
 "substance": "2C-T-7",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "37 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "4",
   "Male",
   " ",
   "Not Given",
   "May 31, 2000",
   "4063",
   " "
  ]
 ],
 "report": "<p>\nI have had the opportunity to try 2C-T-7 on three separate occasions; in a group setting at 30mg, alone at 30mg, and with my wife, Evenstar, at 37mg (she took 20).  Unlike some others, neither Evenstar nor I experienced any nausea from this material; and it should be noted that Evenstar has a tendency to become nauseous from MDMA.  All three experiences were some of the most positive psychedelic experiences I have ever had.</p><p>The group setting was quite enjoyable, spending time with like-minded friends who were all quite excited by the prospect of exploring this new material together.  The experience was quite empathogenic and heart warming all round.</p><p>The solo flight at 30mg was quite pleasant as well.  Being something of a hard head, I had no visuals at 30mg, and found it to be a pleasant, heart opening and heart warming material.  Some tiredness was noted the following day, but recovery was pretty uneventful.</p><p>Reading over the reports of intense visuals from other explorers, I decided to gradually inch the dose up to see if I could access that level with this material, as I am not especially prone to visuals.  Since I had had no visuals at 30, I chose to weigh up 37mg; a conservative addition of the magic number 7.  As the material began to ramp up, it became clear that the addition of the 7mg brought out quite another aspect of 2CT7; I was soon into some amazing visuals, images of interstellar sunrises, with sunlight gleaming around the edge of planetary bodies, which eventually converged on the emergence of a warm, intensely illuminating experience that was simultaneously a deep spiritual opening.  This was definitely one of those elusive +4 experiences.  Evenstar and I spent the day together pleasantly exploring the nature of this material and generally had a wonderful time together.  We slept well that night and woke up the next morning feeling very good.  Overall, this is now one of our favorite materials.  But it seems that a word of caution is in order as some people are apparently quite sensitive to this material and perhaps not prepared to be launched into a powerful entheogenic experience.  Be advised that this is one of the big ones!</p>"
}
