{
 "title": "I Can't Get Off the Couch",
 "author": "KeiserSosay",
 "citation": "   KeiserSosay. \"I Can't Get Off the Couch: experience with Salvia divinorum (10x extract), Cannabis & Alcohol (ID 40009)\". Erowid.org. Jul 7, 2007. erowid.org/exp/40009",
 "substance": "Salvia divinorum (10x extract), Cannabis & Alcohol",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 40009",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 7, 2007",
   "Views: 2814",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One Bad Trip</p><p>Im in a world that I cant control, my mind cant make sense of it, and running away is the only way to escape. I had a very bad experience using 10X salvia for the first time and Im going to share every detail so you can have a good idea of what exactly happened to me. The reason Im writing this trip report is because I can actually remember every detail involving everything that happened, that I experienced, and thought about during the trip. This story will slowly explain what happened to me and why my brain made it happen in that way.</p><p>I bought some 10X from the local head shop and me and 4 friends went to try it for the first time. Right before we smoked the salvia extract we drank some beer and smoked some weed. We then turned off the lights and put on some low volume reggae to set the mood. Keep in mind that I dont normally smoke weed, I quit a long time ago and I am now a lightweight again, the only reason I smoked was to boost the salvia effects. I was feeling pretty messed up before I even started smoking the salvia, so I was a little scared before I tried it.</p><p>I sat on the couch and took a huge hit of the salvia and held it down for as long as I could. Then immediately after I blew out the smoke I took another smaller hit and started holding it in. All of a sudden I could feel myself starting to almost dream. I felt myself falling back into the green couch / futon and then I realized that people were watching me. It seemed funny to me so I laughed, and as I laughed I realized that I was blowing out smoke. The laugh was described as insanely weird. I couldnt laugh in a normal way for long. Halfway threw blowing out the hit I started making what was described as a horrible noise. It sounded like if you pinch the middle of your tongue to the top of your mouth and blow out air very hard and it was mixed with me trying to laugh very hard. </p><p>Right after that I started to black out a little bit, and I could hear somebody say, Oh my god! I could feel myself falling back into the couch farther and farther. I could only see a black void and some weird lights and moving objects floating in my head. I think my eyes were still closed at this point. When I opened my eyes I realized that I was stuck in the couch for real. I started to fall back into the void of the couch even further and faster with my eyes clearly open, but now I could see the opening of the couch. The opening was very small, it looked like I was looking threw a dark traffic cone. I could see my friends looking at me threw the small little opening. The opening was getting smaller and smaller because I was falling farther back. I couldnt feel my butt sitting down. The sides of the cone hole were swirled with gray lines. They were also like liquid, I couldnt get a good grab on the edges, but I could reach the opening of the hole. </p><p>Finally I became aggravated. I decided to fight my way out. It felt like I was fighting to escape a whirlpool under water. I swung and flailed my arms but my legs would not work. I could hear people commenting on it, it was like they were cheering for me to get out of the hole. But I was so mad because nobody would help me out, I thought Why wont they take my hand. I kept fighting and fighting. Finally I gained control of my legs but they werent helping me at all.</p><p>I started to dream that I was actually not sitting on the couch anymore, and that I had gotten up. But I knew that I was still in the couch because I had no recollection of actually getting up from the couch, and I could feel and see the couch around me. I had finally broken from the deep hole but now I was sitting on the couch as normal. But I still wanted to escape from the couch because I didnt want to be sucked in again. I could feel the suction pulling me back, I could see the couch behind me, and I was even able to feel the couch under my ass again. But the dream was so weird because at times I could see myself in the room standing up. I felt like I could control the dream almost like it was real life and walk around. But every second I was reminded that I was sitting on the couch. I was reminded over and over again, but the dream of walking around kept repeating its self also.</p><p>Finally the dream was starting to convince me that I really was in the room standing. So I decided to prove that I was in the room standing. I walked farther and went out of the room into the hallway, but I still had a strong sensation that I was sitting on the couch. The sensation would keep getting stronger if I didnt try to convince myself that I really was standing in the hallway.</p><p>Soon the dream started to make sense. My friends walked to me and they seemed really scared. They started yelling my name in my face. I couldnt talk normal because I was so freaked out by not knowing if I was standing in the hallway or if I was sitting on the couch being sucked in more. The senses of me sitting on the couch and of me walking around the house were confronting each other back and forth, over and over again about 100 times a minute. If I looked at the floor and grabbed my friend I would figure out that I was standing, but If I just stood in one place and tried to figure it out with logic I would then start to get pulled back into the couch. I could even see the couch creeping up around me on the right side of my face. It was most noticeable on the right side of my face as a dark green curved swirl that came and went. It was usually seeing the distorted piece of the couch that brought me to believe more and more that I was sitting down.</p><p>In case you havent figured it out; I wasnt actually sitting on the couch, I really was walking around the house trying to prove that I wasnt sitting down. I believe that one part of my brain couldnt fully explain to another part that I had gotten up from the couch. The reason being because I didnt remember standing up or escaping from the black void. I still thought that I had failed in escaping from the couch the whole time. It was a very scary experience. As I was walking they said I was crouched over like I was still trying to sit up and get off of the couch.</p><p>I had to explain to my friends what was happening so they could help me. I constantly tried to prove to myself that I wasnt still sitting on the couch. I went up into the kitchen and opened the refrigerator and grabbed anything that would remind/prove to me that I was in another part of the house. I constantly checked my back to see if the couch was really behind me. The couch would always creep up from another direction after I proved that it wasnt behind me. I then grabbed the shoulders of every person in the room and asked them where I was and explained that my brain still believes I am on the couch. I kept trying to tell them that I could see the couch on the right side of my face. I had tunnel vision, it seemed like my peripheral vision was that of the dark room I smoked in and the couch I had been sitting on. I couldnt actually put a sentence together. Each time I tried to talk I would forget my main point half way through the sentence, or sometimes when I was talking the couch sensation would come back stronger and I would grab the floor or somebodys shoulders, or look behind me like I was a paranoid skitso.</p><p>At this point I was really embarrassed. I didnt know if it permanently messed up my brain or not. I thought to my self that it would ware off. But then I imagined how I would explain to my mom that for the rest of my life I was gonna go in and out of beleiving I was sitting on my friends couch being sucked in. I thought to myself, Should I live my life as a crazy person if this is permanent or could I commit suicide? Suicide would only be worse for my mom, just let it ware off. Then I sat my friend down on a bed and tried to explain to him what I was feeling. I said to him, You are sitting, imagine your self sitting I then stood him up and said Now imagine that your brain still thinks your sitting! My brain doesnt know that I stood up from the couch!</p><p>My friend thought of a way to reverse the sensation. He said for me to go back to the couch and sit as I was. We all sat in the same positions and then I was going to stand up and try to remember that I had stood up from the couch. As soon as I sat on the couch I had flashbacks of the tunnel pulling me in so I stood up before I was unable to escape again. It helped me a little bit, I wasnt sure if I tricked my brain into making it stop or if the effects of the salvia wore off a little bit. So I sat back down on the couch for another treatment. I let myself relax and go into another weird state, but I tried my hardest to stay strait and keep cool. </p><p>Then I looked up and saw my friend hitting the bowl. OH my fucking god I couldnt believe it! Apparently they thought I was faking it because they wanted to see for themselves if it was as bad as I made it out to be. I started to dream again while sitting on the couch in the dark room. I felt uncomfortable because I couldnt see my surroundings to check if I was falling into the couch again. So I got up and decided to leave the room. My friend looked close at my face and started laughing and smiling, he said, Dude I know what you are talking about, this is insane Im melting. </p><p>I had to leave because I couldnt take the idea of being in a dark room with another person acting crazy. I then heard my other friend say, I wanna try it, I wanna get messed up to! I went to go sleep the effects off. It had only been 5 minutes and I still felt like I was sitting on the couch. The effects were a lot more bearable and I knew 90% of the time that I was walking around the house, But I could still see the couch and feel it pulling me. I had to lie down on the bed with the lights on. I tried to sleep but I found myself opening my eyes every 5 seconds to see where I was. Time made the effect of the couch go away slowly.</p><p>After my friends realized how insane the stuff really was they went looking for me. One person told me they thought I would probably be running in the street by now. I had been laying down for about 10 minutes maybe. One friend busted in the room laughing and saying he just experienced being trapped in space looking at planets. I got up and noticed that I was still feeling the couch behind me. I suggested that they lay down for a while but they were not tripping as bad as I was. I was way more messed up initially from the weed and beer and I took an extra hit than they did. Later on they explained to me that my other friend ran around the room back and forth saying he was melting. He told me that he kept shrinking and growing and then he finally turned into a chair. He thought that he was gonna be a chair for the rest of his life. We both had a pretty bad trip but the other two that tried it didnt take as big of a hit because they were a bit scared.</p>"
}
