{
 "title": "What's the Big Deal?",
 "author": "Drunkmonk",
 "citation": "   Drunkmonk. \"What's the Big Deal?: experience with Cocaine (ID 40034)\". Erowid.org. Jun 25, 2007. erowid.org/exp/40034",
 "substance": "Cocaine",
 "bodyweight": "10.5 kg",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "40034",
   "Male",
   " ",
   "Not Given",
   "Jun 25, 2007",
   "Views: 3198",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been taking drugs for the past 3 to 4 years and would say I am an experienced user with many substances. I started off with weed as most people do and then eventually tried mushrooms, amphetamines, ecstasy, LSD. But enough about that, until recently I have not been able to get a hold of coke but have wanted to try it for a while, I eventually got hold of a dealers number of a friend.</p><p>The first few times I had tried coke were in small amounts(shared with friends) and felt good whilst on it but I never felt it really pushed the boundaries of the feeling of body and mind so I decided to try it properly.</p><p>One Saturday night after work I gave my local dealer a call and  got me the goods and took it home and split it into 6 lines. 5 of the lines were fairly big sized and the last one was a lot bigger than the rest. I proceed to snort two of the lines straight away and more or less instantly I was given a feeling of well being, Im not saying I didnt enjoy this feeling but didnt really stack up very high against ecstasy and acid. </p><p>About every 15 minutes I snorted another line, expecting to get higher and higher but this never came, the same feeling of well being lasted throughout the whole bag. The high lasted for about two hours all together and was quite disappointed with the outcome as it cost me 35 of my English pounds. Afterwards I had no comedown and felt no need to repeat the dose, I have read a lot of reports where users feel they need to redose and also comedown quite badly, this was not the case for me. I havent touched coke for two months now.</p>"
}
