{
 "title": "Generating the Dream-Matrix in this Reality",
 "author": "Booyea",
 "citation": "   Booyea. \"Generating the Dream-Matrix in this Reality: experience with Salvia divinorum (10x extract) (ID 40053)\". Erowid.org. Jan 26, 2005. erowid.org/exp/40053",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 40053",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 26, 2005",
   "Views: 10718",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a report from the place of having-mostly-just-returned-from-the-Void-this-minute-</p><p>Once again, after many months, I have just taken myself into the salvia space, for inspiration, for awe, for that reliable immersion into pure Mystery.... I want to describe what this experience is like as best as I can, with notes of suggestions for fellow journey-folk into this realm.</p><p>A few words about me. I have been exploring the salvia space for about a decade and have found it to be about the single most interesting thing I have ever encountered. As a scientist who is interested in the nature of consciousness, I feel that the mystery of what this substance does is utterly profound when it is taken very carefully, with a sense of calmness and true curiousity as to what the mind/spacetime/reality are all about...</p><p>First- the setting. My bed, alone, sitting up on pillows, very physically comfortable, dried sage lit and single candle. Sound - Robert Rich's 'Hyagrava' from 'Trances/Drones'. A classic of deep ambient, this 20-minute wordless piece is as slow and deep as rolling waves on the sea, so serene and mysterious, perfect sonic fluid for the voyage...</p><p>I light the glass bowl, take a single enormous hit with lungs emptied, hold, pull the Mindfold (foam-padded opaque plastic mask) over my eyes and...</p><p>....and hold completely still.</p><p>Do....not....move.....</p><p>Moving the body during a deep salvia session feels somehow like getting up and screaming while sitting in the audience for a performance...it feels almost like a violation of some kind. Staying still is critical, and I feel is the singular skill to be learned by the salvianaut. It is not easy to do, and I always sit in meditation for several minutes prior to having salvia in order to calm the body. I also believe that moving the body after smoking can become very physically disorienting and dangerous. Movement can seem like flailing around in unfamiliar territory. This may not be safe. Imagine, for instance, running around in a pitch black maze -- better to sit still until someone turns the lights back on in 10 minutes. Thus it is always better to smoke in a soft, comfortable, safe place with no risk of intrusion or interruption. </p><p>The first thing noticed is the sense several seconds after inhaling of a sort of grid materializing throughout the visual field. Each part of it echoes all the others, and it is difficult to tell what the parts resemble, as the seem as close as the patterns seen when rubbing closed eyes. Then there is a feeling of melting into some substance or matrix that composes all of the space around me. This is extremely bizarre to experience but is familiar to me by now as it is exactly the same each time I smoke. The feeling of losing any connection to this reality is aided by having the mask on with no light coming in. Equally important as stillness to the experience is having no light get in. I immediately noticed this the very first time I smoked a decade ago. light during salvia feels to me like being engrossed in watching a movie in a theater and having someone turn the lights on. </p><p>The experience after this in incredibly hard to describe, despite the fact that each time I smoke my mind searches for ways of making sense of what just happened. It is utterly bizarre but as familiar as sleeping. It is both terrifying and infinately comical. In fact, many times I have found it impossible to keep from laughing hysterically, the same way that it feels impossible to keep from screaming on a rollercoaster as it drops straight down. It feels, literally, like Getting the Cosmic Joke. The Punchline of the Cosmic Joke, of course, is that everything is One, and that being re-united with the One is incredibly funny in just how obvious ths fact is.</p><p>Here is what I think is really happening on salvia.</p><p>The brain is forced to begin fabricating a dream, overlayed on top of this reality. The higher the dose, the more one becomes anchored in dream space instead of normal consensus reality.</p><p>The space in the room becomes a sort of matrix that is no longer normal space. It has the actual substance of dream space itself superimposed.</p><p>The result is somehow that the sense of self - what we feel is 'me' - loses ground and drifts inside this matrix. It feels somehow like being underwater, at night. </p><p>Thoughts now are no longer coming from what I thought was 'me'. They seem to be emanating from something else, from a Consciousness much, much vaster than 'me'. These thoughts seem to divide, looking for something to identify with. This is so utterly strange as to defy words. Metaphor helps. Imagine a single computer that for 10 minutes realizes that its true self is not actually a single terminal but is connected to the entire World Wide Web, and identifies temporarily with being the entire Web. Later it will find the idea of a single disconnected computer absurd.</p><p>Or consider a single island in the ocean. From above sea level it appears seperate. But if you follow the shoreline down you realize it is eventually connected with all other islands and continents, deep underwater. No longer can you think of it as an isolated island.</p><p>'Out-of-body' may sound trite, but it is a great way of describing the feeling. What 'I' am sort of drifts somewhere else, so that the idea of a seperate self seems absurd. </p><p>I think the idea of dream matrix superimposed on normal physical reality works when you consider that many people's experiences seem like dream worlds and with dream beings intersecting normal waking consciousness. This can be very unpleasant, frightening, or even dangerous. I find that salvia's true essence only comes out in near silence, darkness, and complete stillness. It takes practice, too. I don't recommend going alone until you have some experience with this herb. </p><p>After about 5 minutes of utter jaw-dropping awe, I open my eyes. The bed is there, with a lot of visual stuff overlayed. It feels good to be back, safe, after feeling my Ego clawing for stable ground in this reality. My thoughts focus on 'how the hell can I possibly describe what just happened? It is too fucked up. No one would believe this is possible', etc. Finally I decide it is time to share this in a trip report. I get my computer. Here it is.</p><p>Please, if you decide to use salvia, go with safety. Its secrets can be almost unbearably intense. Remember, though salvia is everywhere now, it may not be legal for long. And many people who try it never really are able to experience its true essence, unfolding to reveal the matrix of the Dream itself....</p><p>May this plant bless you with Awe and Wisdom.</p>"
}
