{
 "title": "Withdrawal from Hell....",
 "author": "FuzzySpud",
 "citation": "   FuzzySpud. \"Withdrawal from Hell....: experience with Venlafaxine (Effexor) (ID 40099)\". Erowid.org. Jul 31, 2006. erowid.org/exp/40099",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "260 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 40099",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 31, 2006",
   "Views: 10858",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy experience with Venlafaxine (Effexor) was not one of pleasure. I had been through a tough time in my marriage, and I was referred to a physician. I had major depression, and I was prescribed Effexor as a cure-all to this. My doctor seemed to fit all the stereotypes of the ones listed in other effexor stories, with my first doses being 'samples'. I was started off on 37.5mg, and I have to admit that for the first couple of months, I felt better. Not that my life was any better, it is just that the things that caused me so much pain now seemed to cause me little if any anxiety. I felt numb to the world surrounding me. This was somewhat of a relief as compared to what I had been going through. \r\nThis continued for a couple of months, and then I noticed a big change. Having experimented with several drugs, I began noticing that my beloved effexor was losing its effects. 'No problem' retorted the doc, 'this is normal. We just need to increase your dose to 75mg.' I seemed to go through this pattern many more times over the next year. When 75 wasn't enough, then I went to 150mg. When that lost its effects, I went to 300mg. Long story short...I ended up being prescribed 600mg a day of this crap. I continued to go through this horrible pattern for nearly two years. That was when I had reached my end. I consulted the doctor. I said: 'You know, doc..this stuff really isn't helping me anymore. Can we try something else?' Her response, as usual: 'Oh, it's OK.' Me: 'No, doc...it isn't OK. I feel like a heroin junkie. I want off this crap, NOW' She still wasn't having it. Apparently, she knew more about me than I did. I decided once and for all, I was going to get off this stuff, doctor or not. \r\nWhat I went through the next 2 weeks was pure hell. I couldn't concentrate. I couldn't sleep. I couldn't eat. I couldn't even hold my head up most of the time. It was agony. I have experienced cocaine withdrawal before, and it paled in comparison to this. When everything was said and done, I finally rid myself of the terrible Effexor demon. I feel better now than I ever have before. The depression in my life was nothing compared to the horrors of this drug. I will NEVER EVER seek the help of an anti-depressant again. This drug turned me inside-out for nearly two years. People...just a word of advice. Check your facts before starting any anti-depressant. The outcome may not be worth the few moments of relief that you might get from it at first.\n\n\n"
}
