{
 "title": "The Dance Between Salvia and Calea",
 "author": "ConsciousDreamer",
 "citation": "   ConsciousDreamer. \"The Dance Between Salvia and Calea: experience with Salvia divinorum (6x extract) & Calea zacatechichi (10x extract) (ID 40137)\". Erowid.org. Feb 5, 2005. erowid.org/exp/40137",
 "substance": "Salvia divinorum (6x extract) & Calea zacatechichi (10x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   " ",
   "150 mg",
   "smoked",
   "Calea zacatechichi",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40137",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 5, 2005",
   "Views: 15828",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I tried Salvia Divinorum for the first time just a couple weeks ago and found its effects quite pleasant and safe. It gave me this sense of power that I could recollect any distant memory with sharp precision. I saw a very detailed picture of the memories I chose to visit, I felt the emotions I felt, and I smelt the same odors. They were all pleasant memories, so those experiences left me quite peaceful and serene. But, I was in complete control over what I wanted to see.</p><p>I had a few capsules left of the 10:1 Calea extract I purchased. After several nights of very mildly successful results with Calea, I wanted to find a way to enhance its qualities. I also needed something to induce its burning since I got it in powder form. I read a lot about the effects of Salvia and the effects of Calea Zacatechichi, and felt that they would go good together. So I tried it.</p><p>Last night, I mixed a 0.25 grams of Salvia with about 150mg of the powdered Calea. Most of the powder sifted to the bottom of the bowl, but I was pleased that the chopped dry Salvia leaves had a thin coat of Calea around them. I filled one bowl of the mixture in my bong, went outside, and proceeded.</p><p>The first hit was all it took to hit me.  I suddenly felt the familiar sense of Salvia gravity, except this was much different than my previous experiences. This was a lot more intense. </p><p>I struggled to be in control of myself this night since I was with my sober friend, but there were just some things that were out of my hands. Even though I didn't eat anything, I felt a really comfortable feeling of having had a good meal. Which is possibly why, for three minutes or so, I was trying to remember if I took the mixture by inhalation or by consuming a luscious gel. </p><p>One thing that people should do when having a sitter though, is tell them not to say anything except at appropriate times. For the rest of the trip, I did not experience much of anything because I kept on being pulled back into reality on the account of my friend saying things like I was leaning this direction or that direction. At one point, I thought he was saying that because I was on the railing of the balcony, or somewhere where I was potentially going to hurt myself. After struggling to regain control of myself to see where I actually was, I knew I have been sitting on the floor the whole time. I became annoyed at my friend at that point... which possibly catalyzed other annoyances, like when he would keep asking me if I wanted to take another hit after I said I didn't want anymore. *sigh*</p><p>On the come-down of the experience, I became a lot more talkative than usual. I told my friend about my past experiences with Salvia, and the memories I was able to recollect. It was a reminiscing moment for me.</p><p>I went to bed soon afterward, and experienced a long, epic, and very vivid dream. It wasn't lucid however, but it was interesting. I attributed that to the Calea I smoked.</p><p>I felt that the Calea enhanced Salvia's power with the added benefit of causing dreams in the end. The experience was potentially great, but short-lived on the account of an excessively talkative sitter. :) I'll definately try this combination again in the future under different circumstances.</p>"
}
