{
 "title": "Drunkenness",
 "author": "Toni G.",
 "citation": "   Toni G.. \"Drunkenness: experience with Alcohol (ID 4017)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4017",
 "substance": "Alcohol",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "15 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4017",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 11993",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n     It was a Wednesday night in my dorm room at about 7.  I was drinking straight vodka from a bottle that was actually a used water bottle so that it could be snuck into my dorm room without notice.  We finished the bottle in about a half an hour. </p><p>     I didn't even want to drink that night, because I had a test in my 8AM class the next morning.  But I was upset over the troubled relationship that I have with my boyfriend, so I drank more than I should have in a very short period of time.</p><p>     I passed out at about 7:30 and didn't wake up until 9:30.  I had an overwholelming urge to throw up.  My boyfriend grabbed the garbage can and so I didn't get the puke all over.  I called one of my friends, but I don't remember what was said.  I had to walk my boyfriend out at 10:30 and I barely made it up to my room.  I stipped off my jeans and passed out in my bed.</p><p>     My head felt like an overfilled balloon.  Everything was spinning too quickly for me to keep up and I kept thinking how much I didn't want to get up the next morning.  My arms and legs felt like lead and I kept leaning off of my bed to throw up into my garbage can.  I slept soundly between throwing up though.  I realized this morning that I was throwing up blood.  That must have been alcohol poisoning.</p><p>At 12:30, my boyfriend called because he was worried about me.  About the same time, the resident director of our building came to check on me and asked 'Do you have alcohol poisoning?'  When I said no, she walked away and that was it.  I laid back down in my bed and passed out till 7AM.</p><p>I went to take a shower and I fell down 3 times in the stall because everything was spinning so badly.  I threw up three times after my shower, but I hadn't eaten since lunch (about 11:30) the day before, so I threw up some of the water that I had had to drink that morning.  I made it to my class and looked at the test and noticed that it was spinning really quickly.  I wanted to throw up, but I didn't.  I came home at about 8:30 AM and slept until 12:30.  </p><p>Drinking isn't bad, but I really should have paced myself.  I had too much in too short of a time period.  And I hate being sick and throwing up!!</p>"
}
