{
 "title": "The Frog Attacks",
 "author": "Grizz",
 "citation": "   Grizz. \"The Frog Attacks: experience with Syrian Rue, Diplopterys cabrerana & Salvia divinorum (ID 40236)\". Erowid.org. Mar 29, 2005. erowid.org/exp/40236",
 "substance": "Syrian Rue, Diplopterys cabrerana & Salvia divinorum",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Syrian Rue",
   "(capsule)",
   "  T+ 0:30",
   "12 g",
   "oral",
   "Diplopterys cabrerana",
   "(tea)",
   " ",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40236",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 29, 2005",
   "Views: 11171",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLeading up to this trip, not to lie, I was scared.  I heard some pretty intense stuff about DMT and I wasn't sure what to expect.  After preparing the D. cabrerana and putting the syrian rue into capsule form, my roomate and I took the capsules.  We did it about a half hour before drinking the potion.  After drinking the potion I began to voluntarily meditate.  It did upset my stomach, so I used the meditation to help calm myself.  About 35 mins. later I puked.  I puked so hard that all of the blood vessles around my eyes burst leaving small little red dots (like pin pricks).  The trip began just before I vomited.  The next three hours were amazing.  The trip set on fast, not like drinking tea made from San Pedro.  I was tripping before my friend who had eaten shrooms at the same time I drank the potion was tripping.  The next 2 hours consisted of AMAZING color visuals.  <br>When my roomate and I felt that we hit our peak, we decided to smoke some salvia.  We did it in a completely dark room. for the next 10 mins, I tripped harder than I ever had before, and I am a pretty experienced tripper.  Color visuals gave way to hallucinations.  My roomates laser printer turned into a large monstrous frog.  I was so scared of this frog eating my leg that I sat indian style hunched over at the waist to protect them from its venomous bite.  I began to come down.  The salvia sort of killed the D. cabrerana buzz, because it was so intense that the D. cabrerana seemed to do nothin to me.  I passed out a midnight about 3.5 hours after the initial consumption.  <br>The next day I slept for about 14 hours, I was totally drained from the night before.  For the price and ease of preparation this was better that anything done before (including LSD and PCP).  Next time however, we are going to experiment with more syrian rue to prolong the tripping experience.\n\n\n"
}
