{
 "title": "Wall of Noise for Buddha",
 "author": "Catfish Rivers",
 "citation": "   Catfish Rivers. \"Wall of Noise for Buddha: experience with 2C-T-2 & Clonazepam (ID 4023)\". Erowid.org. Feb 6, 2001. erowid.org/exp/4023",
 "substance": "2C-T-2 & Clonazepam",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE:",
   "33 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   " ",
   "0.5 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4023",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 6, 2001",
   "Views: 26866",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nEcstatic bliss buddha guitarhood. Lemme just say, that this chemical has unleashed unknown mystical musical currents within me. For once, the mad tinkerer was left behind to watch as the strings vibrated in sacred intervals of unkown devise. Every note comingling with my chest, everything in sync, breathing is deep and natural. At several points I am aware of nothing but musical vibrations 'I' has a sign in the window that says OUT TO LUNCH...the sound of water performing its nightly cycling through the pipes in my wall provides a strange counterpoint to my wall of noise, digital delay.  All in all, I was in my god space(and using headphones didn't hurt either!). I was music pure. Probably the closest I have ever been to that elusive state of 'I am.' This is happeneing at 2:30 into the trip. There is a very erotic undercurrent going on here tonight as well. If 5Meo-Dipt and MDMA were neighbors, and their dogs got loose and had puppies together...that's about how my erotic feels. Like a cross bred puppy. It's not the tidal wave of warmth of MDMA, but very tactile. Touch is electric. The warmth I'm feeling is actually directed towards myself...oh my god, could it be...self love. Hallehluyah!</p><p>After the 3:30 point (I'm in my basement next to a space heater), a pleasant amount of MJ is imbibed through my favorite utensil. It is a glass bowel shaped like a turtle, the bowl being in the turtle's underside. What holds the earth up? A tortiose of course. Although, my totem animal for the evening is actually Owl. He who asks,'Who?' over and over until no one remains to answer. And then the owl falls silent. And just watches. I am nice and warm all over and I keep having the good pins and needle tingles. Unfortunatley for me, the parental unit is due to get up for work (oh yeah, the real world...)which means RUN FOREST RUN...the rest of this beatiful ride will be stuck pretending I'm asleep until the parent has left. Interesting way to meditate: try pretending you're asleep. Your mind gathers room to wander for sure. For sure dude.</p><p>To not describe my self as ++++ is an impossible action.</p>"
}
