{
 "title": "Mental Paralysis",
 "author": "Gailen",
 "citation": "   Gailen. \"Mental Paralysis: experience with Salvia divinorum (leaves) & Blus Lotus (ID 40249)\". Erowid.org. Apr 19, 2008. erowid.org/exp/40249",
 "substance": "Salvia divinorum (leaves) & Blus Lotus",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 cup",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(tea)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 40249",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 19, 2008",
   "Views: 6524",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This wasnt the first time I tried salvia, but it was my first salvia experience. I had tried it previously but the dose was so small it didnt do anything other then get me high similar to that of a marijuana high for a very short time. This time, my friend had a bag of the leaves, we had tried some 'special tea' and it wasnt taking effect so he suggested we try some salvia, he suggested that we should smoke about four bowls of it for a good experience.</p><p>He was like 'Do you think we will be able to fill the bowls once we have smoked one bowl?' I seemed to be certain we would be able to, so I took my first hit, one hit from the water pipe, a large hit yes, and I held in my lungs for not a very long amount of time. I exhaled and he asked if I was ready for my next hit, 'Or are you high already?' My mind literally changed mid-sentence. 'No, no Im not. Omg yes, yes Im very,' now I began to panick, I was VERY high at this point, and I do mean very. I yelled at him 'Why didnt you tell me it would take effect this fast!!' and after that moment I lost complete control of what was real.</p><p>I was no longer in my body, reality was completely altered. During this state, I had no idea what I was actually doing, all that I was sensing was, I couldnt move, not to save my life, I was stuck in some sort of warped reality. Some womans voice, a mean voice, was yelling at me, of course I dont remember what she was saying. My vision was very strange, everything seemed to be on its side and she was yelling that something I did was wrong, something in my life and I needed to get away. For some reason I was seeing street cones, the orange safety ones, and having thoughts about two people close to me, they were in my mind very vaguely but still there. </p><p>After some amount of time, who knows how long, I snapped out of that state. Now I was in full panic mode, I couldnt seem to be able to speak correctly, I felt as if my tongue weighed a ton, or something was holding it down, I felt that maybe I was drooling uncontrollably (I wasnt). I had the horrible let me stress the word HORRIBLE feeling that some force was holding me down and not letting me be free. My normal state was gone, I felt what people who are paralyzed must somewhat feel. I mean, I could move, but something was holding me and not letting me go. I cant describe how horrible that feeling was.</p><p>My friend and I went in his house, with much difficulty for me, I had very much trouble walking and concentrating on anything. Suddenly the voices where there again, very demanding, more than one, they told me to leave the house immediately, all my attention was on leaving, I screamed at my friend 'I GOTTA GET OUT OF HERE!' but no words seemed to leave my mouth. No! My tongue! It weighed a ton and was burning, I rushed to the bathroom, it was apparent to me now I was going out of my mind. I looked in the mirror, and suddenly my tongue felt fine, I turned my head to look at the blue wallpaper, it seemed to be flashing and burning at me. I couldnt look at it because it scared me so I fled the bathroom.</p><p>My friend was waiting in the living room. I began to feel very very tired and unable to move, I had to lay down, I also realized I had half a boner going, but I would be damned if I was going to worry about that! I layed on the couch, and curled in a ball and tried to figure out what was happening, this is when all of it seemed to be subsiding. My friend asked if we should work on a song, so we tried to play one of our songs, but quite simply, we just werent feeling up for that at the moment, wasnt working.</p><p>About this time the high was pretty much gone. Difficult to explain why my high was so intensely bad for me, I cant stress how intense it was, but it was, and why after just one hit!? If you want to know what the magic tea was, it was blue lotus tea, but I dont think that had anything to do with it, because apparently we made it wrong and had no effects of it at all. Or perhaps mine was strange, just due to my chemical make-up, because everyone is different? Im so scared if I ever try it again my experience will be like that again, intensely unpleasant. My friend described his experience as nothing like mine, I may try it again.</p>"
}
