{
 "title": "Not Having Any Fun",
 "author": "Ian",
 "citation": "Citation:   Ian. \"Not Having Any Fun: experience with Amitriptyline (Elavil) (ID 4031)\". Erowid.org. Apr 8, 2001. erowid.org/exp/4031",
 "substance": "Amitriptyline (Elavil)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "Pharms - Amitriptyline",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 4031",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 8, 2001",
   "Views: 48773",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI see that there are few personal experience reports for the perscription drug Elavil (Amitriptyline).  Well, here's mine.  This happened a few years ago, I suppose I was 16 or 17.  I was in kind of a low period in my life and was using more drugs than would be considered healthy for anyone...  \r\nAnyway, a friend and I were talking about drugs and she said that one of her favorite 'Psike' pills was Elavil.  Ok, whatever, I had never even heard of them.  Well, a few weeks later my grandma came to town and viola, there in her purse (I said this was a low point) was a bottle of Tylenol-3  and another bottle of Elavil, I was using heroin on and off at this point so I left the Tylenol-3s alone, I took 3 of the Elavils just to try:)  \r\nThe next morning I left for school, I popped 1 of the pills to see if I could feel anything, about 1 hour later...nothing, so I took another one.  10 min later I could not hold my head up or focus my eyes, this was not cool.  My first period teacher liked me, but she knew I was a druggy.  I started to fall asleep, meaning I was visably noding,  She asked me if I was ok, and I said I was fine.  At this point I was more fucked up than I generally like to be, and I was starting to get scared.  I did not feel that that I was in danger of ODing, however, I was in danger of losing consciousness, and did not want to end up in the ER... So, rather suddenly, I stood up and 'staggered' out of the classroom, my teacher was 'yelling'  'Ian, get back here, where are you going, whats wrong with you?!?'  I managed so slur out 'I feel sick' and with that, I was out of the classroom, I managed 'somehow' to avoid school security and get off school grounds.  From there, I stumbled/staggered apx. 1/2 mile to a local park where I promptly fell asleep...\r\n...about 10 hours later (9:30-10:00pm) I woke up, feeling ok, but not great, I walked home apx. 3 miles.  I had some explaining to do when I got home, but I managed to lie, lie, lie my way out of it.\r\nTo that end Elavil is a VERY strong substance, it came on strong and suddenly, it made me feel as though I had drunk a gallon of liquer and smoked a pound of pot without the 'sick' feeling, the 'scared' feeling I decribed earlier was more the very small fuctioning portion of my brain saying in a very plain and Spok-ish voice that if I did not leave I could get in seroius trouble.  Emotional sensation was dulled almost to the point of non-existance, colors were dulled, and I didn't have any fun.\n\n\n"
}