{
 "title": "A Potent Hallucinogen?",
 "author": "nitrous",
 "citation": "   nitrous. \"A Potent Hallucinogen?: experience with Mirtazapine (Remeron) (ID 40319)\". Erowid.org. Aug 12, 2005. erowid.org/exp/40319",
 "substance": "Mirtazapine (Remeron)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 40319",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 12, 2005",
   "Views: 22571",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few months back I had seen my doctor about general anxiety. I was having a great deal of unwanted and unwarranted stress. Everyone goes through this from time to time, and I decided to give modern pharmacology a try. I'm impatient so I didn't want to work through it.</p><p>My doctor prescribed a generous amount of Xanax to deal with my immediate stress and Remeron as a longer lasting agent. I didn't want to take an anti-depressant, but he assured me that it would work well after it had gotten into my system. I was to take it before bed every night for at least two weeks. I felt the effect on the very first night.</p><p>I took my dose an hour before bed and it kicked in after only 30 minutes. The power LED on my air purifier turned from green to red and started to create wisps of red smoke. I rubbed my eyes and sat up. It was still there. By this time, everything was extremely vivid and flowing, if not constant.</p><p>The smoke now resembled a flowing red cape, like Spawn's. It enveloped my entire field of vision. I wanted to stay awake but it did make me a little drowsy. Despite the intensity of the hallucinations, I felt pretty good about them. This drug is definitely weird stuff. These persistent hallucinations weren't perceptual oddities, they were fully constructed and very long lasting.</p><p>These 'visions' persisted each and every time I took a dose. I rather enjoyed the visuals, so I began taking it earlier so I could stay awake and enjoy the experience. The scary thing about the stuff was how complacent it made me while it fried my brain. I decided to stop, since the 'side effects' were becoming more pronounced (think opposite of male enhancement).</p><p>After a week of not taking this stuff, I left on vacation to visit friends. I brought the Remeron with me, even though I wasn't using it. Having quite a few left, I passed them around like M&M's, curious if the effects would be the same. Sure enough, the reports were glowing. Everyone, five in all, that took one had intense visual hallucinations and a sense of well being.</p><p>I fully support drugs that create pleasant side effects. The problem with this one was the lack of warning. In my humble opinion, Remeron might just be a milder and faster acting alternative to harder hallucinogens.</p>"
}
