{
 "title": "Snorting Extract",
 "author": "Nag",
 "citation": "   Nag. \"Snorting Extract: experience with Anadenanthera colubrina (extract) (ID 40334)\". Erowid.org. Dec 5, 2006. erowid.org/exp/40334",
 "substance": "Anadenanthera colubrina (extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Anadenanthera colubrina",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "40334",
   "Male",
   " ",
   "Not Given",
   "Dec 5, 2006",
   "16162",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I try out ethnobotanicals frequently, considering I love psychedelics but they're pretty rare on the street around connecticut.  I've been playing around with extractions, and naturally since a dealer in sacred herbs sent me a free packet of Anadenanthera colubrina, I've been playing with those too.  My prefered method is smoking them, although I have made a supply of the traditional toasted snuff using ash, and in fact some B. Caapi 10x extract powder.  This works very well and I would describe it as generally a high and somewhat speedy feeling.</p><p>Recently I made a methanol extract of the seeds, trying to get some form of smokeable DMT.  I extracted 14 seeds and made a goodly ammount of extract substance, perhaps as much as two or three seeds ground up, so it was an approximately 5x extract.  Smoking this was very potent and made for an instant stoned and wierd feeling, but with a powerful aching body load that seemed to travel from the back of my head down through my limbs.</p><p>I always make very sure about evaporating methanol, but none-the-less this was a little alarming and so I was ready to give up on the stuff, until I thought of snorting it.  </p><p>This was last night, maybe 2 in the morning, I had Fear and Loathing in Los Vegas playing over and over on mute in the background, I was tripping on some pure DXM I'd ordered mixed in with LSA I'd extracted from woodrose (report later).  It was a sort of, passing the time sort of trip, great and fun but nothing magnificent, the LSA had worn down and the DXM was at sort of cruising altitude, but wanting a final extra boost to the night as I'd just started talking to a friend at another college on AIM.  And I came to the idea of snorting the extract, I had sort of wondered about it before, and I felt it was time to have at it.</p><p>Realising it was potent, I just scraped myself out some flakes, maybe about the amount of material you'd get off of your pinkie cuticle if you scraped some dead skin off, lined it up with some of the traditional yopo, and took it in.  Immediately there was a distinct sting where the bits of extract hit, and the speedy effects were immediately felt absorbing through my nasal cavity like it would with aderal (I don't do coke so that's my comparison for nasal drugs), and I sort of recoiled a bit.  It continued stinging, but there was so little stinging material that it was totally fine and tolerable.</p><p>Everything went tense and the feeling in my head went higher and higher.  Thoughts weren't racing so much as my mind was racing, my brain felt electrified.  The world around me took around this 'picturesque' quality I'd noticed before smoking this extract and that I always get in the afterglow of a major psychedelic trip, I just want to take pictures of pretty much anything, anywhere I look there's a lovely little scene/arrangement.  </p><p>Anyway, things went on being racy and me feeling wierd for maybe an hour.  The next morning I tried a more precise testing of this stuff and it is indeed excelent, comming down the effect is relaxing, the high is very social and thoughtful and racy, and it can be produced in massive amounts for nothing.  </p><p>For those interested in the extraction method, I bought some high-grade alcohol, ground the seeds and soaked them in it for a day, stirring occasionally. I then removed the alcohol and evaporated it on a dish, repeating and accumulating residue left behind from each evaporation until the alcohol stops being colored by picking up stuff in the seeds.</p>"
}
