{
 "title": "A Blessing and a Curse",
 "author": "Jst",
 "citation": "   Jst. \"A Blessing and a Curse: experience with Amphetamines (Adderall) (ID 40346)\". Erowid.org. Apr 19, 2008. erowid.org/exp/40346",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Amphetamines"
  ]
 ],
 "footer": [
  [
   "2005",
   "40346",
   "Male",
   " ",
   "Not Given",
   "Apr 19, 2008",
   "4638",
   " "
  ]
 ],
 "report": "<p>I've been taking 20 mg of the extended release version of Adderall as prescribed for the last three years and had taken it to study or as a 'social lubricant' very sporadically from the age of 18 on. Needless to say I have a few opinions, good and bad.</p><p>One thing is that without a doubt, I'm addicted - both psychologically and physically. The feeling of control that I get and the complete lucidity of thought is unparalleled and something that I am hard pressed to give up. Going from introvert to extrovert in the time it takes for a pill to come on - without it being apparent to others that there's some sort of intoxicant involved - is a godsend. In controlled doses taken for a small period of time Adderall is unbelievably helpful for any number of things. Early on, it reminded me of a more restrained ecstacy high. Over time though, I become stuck in a 'can't live with it, can't live without it' cycle of dependency which I'm currently - and unsuccessfully - trying to end. </p><p>A few things I've noticed. One - It does affect judgement in certain situations. The feeling of control that comes with an amphetamine high can quickly turn into a feeling of invincibility and a blindness to the consequences of spending, talking out my ass, or spending 5 hours of my time organizing something as trivial as my closet. The strength of focus on Adderall is a double-edged sword, often rendering anything peripheral to the task I've set for myself almost invisible.</p><p>Two - my stomach has suffered greatly. I've noticed that myself and a few (but not all) of the people I know taking it, now have serious - at times dehabilitating -  digestion problems. It might not sound like such a big deal, but I know that if I take it before a meal I'll be in the bathroom soon after and it won't be pretty. Too much info? Too bad.</p><p>Three - Physical and mental exhaustion. To take Adderall with any frequency requires quite a bit from my mind and body. I've found that with prolonged use, the Adderall euphoria and focus can sometimes be replaced by restlessness and complete lethargy and it was all a crap shoot. Some days are fine, others I'll take it and end up exhausted and moody within an hour or so.</p><p>And four - the withdrawl. Enough has been written here on the withdrawl so I'll cut it short.</p>"
}
