{
 "title": "Competitive Edge",
 "author": "Worker Bee",
 "citation": "   Worker Bee. \"Competitive Edge: experience with Modafinil (ID 40350)\". Erowid.org. Feb 7, 2005. erowid.org/exp/40350",
 "substance": "Modafinil",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "40350",
   "Male",
   " ",
   "Not Given",
   "Feb 7, 2005",
   "24006",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been experimenting with modafinil for the past year. I do shift work, meaning I start work in the afternoon and generally wrap up around midnight. The work requires focus and concentration, office skills, creativity. I decided to try this drug because I had heard that it promoted wakefulness without keeping you up all night, like coffee. Many days, family responsibilities require that I wake up early in the morning with no time for a nap, which means I could end up exhausted as I am starting my afternoon/night at the office. </p><p>I started with 100mg but found the experience a bit unpleasant. It kept me awake, caused me to grind my teeth in my sleep, dehydrated me, etc. I experienced a pain in the side of my neck after continued use. So I tried reducing it to the minimal useful dose, which seems to be in the 50 to 75 mg range; I was also motivated by the expense. I have ordered 100 and 200 mg pills and used a pill cutter. I take the dose immediately upon waking up, on an empty stomach. It kicks in after about 45 minutes to an hour. Weariness falls away. Sometimes there's something resembling not so much euphoria (ie, a buzz), but an overall feeling of confidence, well-being, a rightness with the world, I'm ready for the day. I get the best results using it 3-4 times a week with as little as five hours of sleep per night. But all in all, I would prefer sleep and look forward to a day when my responsibilities allow me to return to my preferred eight or nine hours a night. Most sites seem to recommend much higher doses, but I assume those are for people with severe narcolepsy. </p><p>Pluses:</p><p>--No nodding off, but not the nasty body buzz of caffeine. My mind is awake. I don't make the sloppy mistakes that sleepiness causes. I can focus on a task. Memory and creativity seem to be enhanced -- or, at least, I am better able to tap into these things if I have a good memory and am creative.</p><p>--My body might still feel pretty tired, but there are even some enhancements to physical activity -- I swim more laps (whereas I doubt I would even drag myself to the pool with just a few hours of sleep).</p><p>--I can extend my productive day, meaning I have time to read or pursue hobbies, or non-work committments either before or after work. No collapsing, having given the best hours of my day to the office. </p><p>--It is easier to put myself almost in a zenlike state of no thought, in which I am completely in the moment, completely aware of everything around me. The internal</p><p>commentary seems to be on mute. I am, I do, and that is all. </p><p>--That said, it's not euphoria, or a kick or a buzz or something I will find myself </p><p>addicted to seeking. It seems more like a useful tool -- for an all nighter, a road trip, etc.</p><p>Minuses:</p><p>--A reckoning eventually comes. I can cut sleep quite short in emergencies, but</p><p>after several days of minimal sleep my body will shut down on me even with the drug. I'll sleep through the alarm or nod off in front of the tv at night.</p><p>--Beware excessive alcohol use. A wide awake drunk risks consuming booze long past the point when they would normally pass out. I am quite convinced, from a couple of unpleasant experiences, that I could actually drink myself to death on this drug and be awake at the moment my organs fail. </p><p>--I can get too focused, sometimes on a trivial task. It is hard to break out of the focus, even if co-workers or family want my attention. I may get so focused on my work that I become unaware of the passage of time and miss appointments.</p><p>--Some occasional or possible psychological side effects: anger, irritability, conversational digression, impulsiveness. Since I am less self conscious and more extroverted on modafinil I sometimes say things that I would normally reconsider or keep to myself, and probably should. I can't decide if this is simply the way extroverts normally operate, but for me it is a mild personality change. If I have been shorting my sleep time for several days, my judgment is impaired and I find myself saying oddball things, laughing inappropriately, etc.</p><p>--I am concerned about long-term physical effects to my brain or body, either</p><p>from the drug itself or from continued sleep deprivation. While I'm not likely to get addicted to the physical sensation -- although there's something subtly appealing about it -- I do fear becoming 'addicted' to the lifestyle enhancement, the greater productivity in my work and personal life. I'm getting a lot of reading done when in the past I used to read a page or two then get drowsy after work.</p><p>--I miss coffee and its rituals. I find that if I combine coffee with modafinil, insominia results. I've taken to drinking decaf, when I even remember -- which I don't always, since I'm quite awake.  </p><p>--I miss sleeping in, but that is not practical at the moment because of my work and family responsibilities. </p><p>--Occasional unpleasant physical side effects include headaches, stiff neck, fogginess on days I skip a dose but don't catch up on sleep, twitchiness, scratching, picking at skin. In the morning, as it kicks in, it seems to intensify hunger, but later in the day it is possible to simply get so focused or lose track of time that one forgets to eat. Or one is so anxious to continue with a task that one eats junk from the vending machine. </p><p>--Dehydration seems to be a problem -- forgetting to drink water. Remembering to stand up and stretch is also important; repetitive strain injury from typing without a break is also a possibility.</p><p>The drug seems to speed up digestion, resulting in several bowel movements over the day. From time to time the gastro effects have been more severe. All in all, </p><p>the lower the dose, the fewer the side effects, with no apparent change in the drug's effectiveness -- in other words, 100 mg or 200 mg does not make me feel twice or four times as awake as 50 mg, nor will they keep me awake for a longer time. </p><p>All in all, this is not a party drug, but it might just help a person create some time to do the things they need to do.</p>"
}
