{
 "title": "Not As Bad As They Say",
 "author": "Mobius",
 "citation": "   Mobius. \"Not As Bad As They Say: experience with Kava Kava (ID 4037)\". Erowid.org. Mar 3, 2001. erowid.org/exp/4037",
 "substance": "Kava Kava",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 4037",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 3, 2001",
   "Views: 20365",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAbout 20g of Waka grade root powder bought from an online supplier was tied up in a hankerchief and kneaded in a bowl with about 3 cups of water for 30 minutes, and the resultant murky brown liquid drunk, Contrary to what I had been led to believe by reading the reports at this site and elsewhere, the taste was not that bad at all, in fact I could probably learn to like it. Very earthy and spicy. \r\nIt was initially drunk at room temperature, but I found it went down alot easier with the addition of some ice cubes. It would probably be nice warm as well. The two others with whom I shared the experience did not share my opinion however, one finding it so nauseating he did not finish his cup, the other finding it not so bad, but definitely not so good either. \r\nAs for effects, I noticed a physical and mental calm coming on about 30 minutes after drinking, though not strong enough to totally discount placebo effect. We then smoked a joint, and the kava definately enhanced the experience, both mentally, by calming my mind, and physically, due to a pleasant floating sensation. Later we smoked some salvia, and the shear power of that divine herb overshadowed the kava effects, so any further report on the kava is difficult. Suffice to say that my first experience with this drink was very pleasant, much better tasting than expected, and nice combination with cannabis, and probably salvia too.\n\n\n"
}
