{
 "title": "Sameness of the Music",
 "author": "Slug",
 "citation": "   Slug. \"Sameness of the Music: experience with 5-MeO-DiPT (ID 40399)\". Erowid.org. Aug 2, 2006. erowid.org/exp/40399",
 "substance": "5-MeO-DiPT",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "5-MeO-DiPT",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40399",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 2, 2006",
   "Views: 3104",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First of a word on the dosage: lacking an accurate scale I decided to guesstimate a rough dose and dissolve this in a 600 ml bottle of water and cordial so that it could be consumed bit by bit with breaks to wait for the effects in case I had indeed over-estimated. (as it turned out I would have liked a bit more was still nice though.)</p><p>With cordial/foxy mixture prepared  'A' and I set our on our 4 hour the road trip. ( I was the passenger)</p><p>Over the first hour I am very cautious and only have a symbolic amount, but by the time of our first pit stop (about 2 hours) I have had about half my bottle and half my estimated dose, subtle but noticeable is a pleasure in the body, a warmness.</p><p>we move on and I finish the rest of my drink in a few minutes and within 20 minutes things begin to happen... my description of the effects are as follows:</p><p>Very nice pleasure in the body I remember describing it as a warm massage, the mind was quite clear and unaltered. Sight was acute sharp and focused which evolved to a hypersensitivity to color, and later an almost un-natural and quite surreal alteration in colors there was a blue tinge to all and everything was vibrant, the sky was amazing hypocolor blue there seemed to be a lot more interest and curiosity in the way things looked, its great for the aesthetics of my visual world, at the height of it there was a demonic atmosphere around my friend  A reddishness to her normally green eyes... quite amusing.. a spooky but  friendly thing.. made me smile to perceive such a thing.  </p><p>But predominantly this is a drug of the physical sensations, which is I think a difficult   aspect to describe without comparing to other substances like MDMA. Warm comfortable happy with a slight tension. there were points however that this sensation made me nervous as though there was something wrong as I had not been accustomed to the sensation this substance produces but I calmed my self down and proceeded to enjoy the body buzz a lot. </p><p>At one point I lent forward in my seat to test how that would feel and it was very lovely and to my surprise produced an erection.</p><p>There was a point where we decided to listen to a Ramstine song which was unusually uncomfortable for me, being a musician (and raging metal head) I generally revel in music and enjoy letting it take the forefront in  my attention, yet I found that very difficult this time. even though the stereo was blaring it seemed to be in the background.. Concentration on the road side scenery seemed to refuse to let my attention go. It was unpleasant.</p><p>It was turned off and conversation continued as normal (I found myself completely capable of holding a conversation using a map etc, pupils did not dilate either.)  </p><p>Later slipknot's first album was put on and this too was strange, not unpleasant. Just altered, slower perhaps, unusually pitched, imperfections in the vocal were a lot more apparent (or perhaps they were imagined) and generally sounded like a different versions of the songs, though I could recognize them as the same, it is as odd to describe as it was to experIence. The warmness of the mix was comforting.. Unlike the coldness of Ramstine.</p><p>The effects wore off as we reached our destination. But unevenly there remained a tension in the body which was present through the duration. But without the warmth I felt a little clamped up. A nervousness in the body. Similar to coming down from MDXX substances. Not as strong though. Food was uninteresting and it was difficult to find appetite though my stomach was empty.  Half a bottle of absinthe was  more than adequate for loosening the body up again. </p><p>It was overall a nice experience.</p>"
}
