{
 "title": "Being Tortured From Beyond",
 "author": "Ellis Dee",
 "citation": "   Ellis Dee. \"Being Tortured From Beyond: experience with Salvia divinorum (20x extract) & MDMA (Ecstasy) (ID 40408)\". Erowid.org. May 20, 2008. erowid.org/exp/40408",
 "substance": "Salvia divinorum (20x extract) & MDMA (Ecstasy)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "2C-B",
   " ",
   " ",
   "  ",
   " ",
   "LSD",
   " ",
   " ",
   "1 line",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "40408",
   "Male",
   " ",
   "Not Given",
   "May 20, 2008",
   "3890",
   " "
  ]
 ],
 "report": "<p>I have smoked salvia probably almost a dozen times, but I've only had it work for me two times. This experience is about the second of these terrifying journeys.</p><p>To give just a little background, I started off my psychedelic expeditions with mushrooms and LSD, but, because of availability, moved onto research chemicals. I've done 2C-T-2, 2C-T-4, 2C-T-21, 5-MeO-DiPT, 2C-I, 2C-B, DXM, LSA, LSD, MDMA, mushrooms, etc. I tend to be a little on the heavy side with dosing in general and I've never really had any freak outs. Salvia would be the one exception.</p><p>I dosed a few weeks ago on the comedown from a 2C-B/LSD trip just minutes after I insufflated a nice sized line of MDMA that was cut with some methamphetamine. I smoked a humongous bowl of 20X extract and I immediately felt the weird salvia 'warning' that comes a few seconds before it blows your head off.</p><p>The next second I was in a strange world where I was surrounded by millions of people. They all looked exactly alike and they were wearing all white clothing with red scarves wrapped around their necks. They seemed intrigued by my presence, but not surprised. They gathered around me and I started to get very claustrophobic. I could see in this strange salvia world that I was near the bed I had been in before I smoked. I desperately tried to scramble back into the area of the bed because I recognized it subconsciously as something familiar. As I crawled towards it, the weird salvia people got right up in my face and kept repeating 'You can't do that here, only we can move around.' As hard as I tried to move they kept restraining me in different ways. For instance, one time I finally started to get close to the bed and then I fell through a hole in the universe and fell back into the room through the ceiling. I was, predictably, on the other side of the room from where I had been going.</p><p>There was also a lot of space distortion during this trip. I would be trying to walk on the ground and then suddenly I'd be on the wall or the ceiling. The people kept taunting me, but in a really sinister way. Imagine you were in a world where everything you said was right, but all the millions of people in the world agreed that you were totally wrong. How can you talk to such people? I'll never forget the evil looks on their faces.</p><p>Soon the millions of people became a maze that I had to get through. A maze of people is trickier than it sounds, however, because the maze is constantly changing as they move. People would try to grab me, tackle me, yell at me, argue with me, etc. By this time I realized I was never going to get back to the bed I had started at and I started to freak out a lot. The people around me slowly evolved (devolved?) into living things made out of edible clay that started breaking off everywhere as the trip continued. I got an overwhelming feel that the world was going to end. Before I could mention it to the people around me, however, they all started repeating 'Only YOUR World Is Going To End' over and over.</p><p>At this point I started coming down, so I still saw the weird salvia people and the extremely distorted dimensions, but I also saw my girlfriend who was right next to me. I instinctively reached out to grab her, hoping, in my delirium, that she would pull me out of this hellhole of a trip. I kept falling back into the trip and losing sight of my girlfriend and the room I was in, but slowly, over five or ten minutes, I came mostly back. For about an hour after the trip I kept falling back into it whenever I thought of salvia or the image of all those weird looking salvia people.</p><p>I will never ever ever ever smoke salvia again.</p>"
}
