{
 "title": "Careful on Dosage",
 "author": "f",
 "citation": "   f. \"Careful on Dosage: experience with Kratom (ID 40466)\". Erowid.org. Feb 18, 2005. erowid.org/exp/40466",
 "substance": "Kratom",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "23 g",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 40466",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 18, 2005",
   "Views: 36799",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been curious about trying kratom for a year or so, and decided I was ready to spend the money to do so.  I ordered 1 oz from a website I trusted.  </p><p>I followed the directions on the infusion on their website, boiling 23 grams of the leaves in two 1-liter changes of water, straining, and boiling down the infusion until there was only about 100 ml.  The preparation was brown-red and tasted very bitter.  My dosage was, according to the instructions, just above a 'strong' dose (20-50 grams).</p><p>About 15 minutes after drinking the tea at 10 pm, I was already flying.  My heart rate had jumped through the roof, and I had the feeling that everything was moving very fast all around me/through me.  Another half hour of this made it necessary to lie on the couch and not to anything but stare at a mandala on the wall.  I was simultaneously sped up and unable to budge from my spot on the couch.  Nausea began to increase in waves at this time, each wave (5 or 10 minutes between) stronger than the one before.  </p><p>I had to close my eyes, and began to hallucinate somewhat.  The hallucinogenic aspect to this was not like other psychedelics.  I had powerful visual impressions in a way, and they were vivid, but I didn't exactly see them.  It was more that I had the feeling that I was seeing them and experiencing them, very hard to explain.  But the scenarios I was perceiving were getting stranger and much faster.  Finally the nausea was just way too much, and I sprinted to the bathroom projectile vomiting.  This was now probably 90 minutes into the experience.</p><p>I was in the bathroom for 1-2 hours, vomiting and heaving, unable/willing to move.  The body feeling was related to the feeling of an anxiety attack or the onset of a bad trip, although I didn't literally feel anxious.  Mentally. It was just a blur. Impressions like above just blasted through my mind constantly, so quickly I only had the sensation of the rate of change of the hallucinations and not of any one hallucination.  Again this is very hard to explain.</p><p>After the bathroom, my roommate helped me back to the couch (my leg had fallen asleep in the bathroom to the point where I couldn't walk) and I heaved there for the next 3 or 4 hours.  The effects of the drug were slowing down somewhat, except for the feeling of my heart wanting to escape my chest.  Hallucinations diminished.  After this, I heaved in my bed for the following 11 hours or so, with multiple attempts to keep down food in between bouts of heaving.  Not until 3 pm the following day was I able to keep food down.  I also noticed that sitting or standing up made nausea increase rapidly during this time.</p><p>So the moral here is to be careful on your dosages.  The site I looked at claims this is barely even a strong dose, but I imagine that if I had taken the upper end of a strong dose I may have required hospitalization.  If my dose had been more like 8-12 grams this experience would likely have been rewarding.</p>"
}
