{
 "title": "Reverberations in the Mind",
 "author": "Miro",
 "citation": "   Miro. \"Reverberations in the Mind: experience with Nitrous Oxide (ID 4047)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4047",
 "substance": "Nitrous Oxide",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4047",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 15091",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA friend of mine asked me to take care of his place for the weekend while he went to tahoe.  I said sure, his place is just spectacular with a beautiful view and just plain beautiful surroundings.  On my way up, I decided to find a head shop and get some nitrous.  I had never done it before, and was becoming increasingly curious with its effects.  The only other drugs I have ever done are pot and ecstasy.  </p><p>I got out some pot I had, and smoked a nice bowl.  it was really good pot, and gave a really nice high, very smooth and mellow. After a little while, I started getting curious about the bag full of whippets that was on the chair next to me... </p><p>I decided to start small, and inhaled only half of the balloon.  I held it for a few seconds, let it go, and then decided to inhale the other half.  I didnt hold it for long and just let it go.  I was not immediately comfortable with the concept of breathing in this gas that tasted sweet.  For some reason, there was just this subconscious twinge saying no.  I got through that quickly though.  After inhaling that one balloon, I slowly started to feel the effects.  They were very interesting, and just about indescribable.  I learned later that it was a very mild experience.  At the time, I thought it was just cool.</p><p>I didnt have a huge desire to try any more right away.  I waited a few hours and tried another one.  This time I just did the whole balloon, held it for as long as I possibly could, breathed back into the balloon, and repeated 3-4 more times, although in between each breath of nitrous, I made sure to take a few breaths of real air to make sure I didnt deprive myself of too much oxygen. What was to come, I was totally unprepared for. </p><p>I had some classical music on, and was lounging in a comfortable reclining armchair.  Suddenly, after inhaling it the 2nd time, I noticed that things did NOT sound the same anymore.  It was like the same few BEAUTIFUL violin and piano notes were playing over and over.  They had this amazing flanger effect to the sound.  It was amazing.  Over and over, for a good 30 seconds.  </p><p>The second, great thing about it was the body high.  I have never experienced that before.  Every time a wave of the sound hit me, it went through my whole body.  It was a bit overwhelming at first.  It was like my entire body tensed up, almost like that slightly orgasmic feeling through the whole body just before a full on orgasm.  Needless to say, it felt good.</p><p>The third element to it was my mind.  It was very different than anything I have experienced.  I had my eyes closed, and it was like my consciousness was moving up out of my body.  Not like it was really moving, just being elevated just slightly inside my body.  I lost all contact with what I was feeling, what I was doing, and just experienced what it is like to be just thought.  It was quite intense.  My mind hadnt really gotten past the amazement of the audio, so I cant say that I have any great insights.  </p><p>All in all, this was a very nice experience.  I repeated it a few times throughout the night, and it was getting a bit stronger each time.</p><p>I am very interested in experiencing acid and mushrooms too, and will share my experiences when I have them...</p><p>All I can say is that nitrous was really a nice thing to experience...much more powerful than I could have ever thought.</p>"
}
