{
 "title": "Time Displacement, Residuals and Fear, Oh My",
 "author": "Texture",
 "citation": "   Texture. \"Time Displacement, Residuals and Fear, Oh My: experience with LSD (ID 4048)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4048",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4048",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 25, 2001",
   "Views: 10464",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI went to visit some friends in college, and had never tripped before. I had rolled on ecstasy, and that was pretty much the only drug I had ever done. Unless you count Yellow Jackets (Ma Huang). Which aren't really a drug, they're just fucking terrible. I don't even smoke weed or do legal drugs (drink). It's a power play in my mind, because those drugs are so much easier to get. But no one ever really understands, so I'll spare you all. </p><p>I went to see my friends where they went to college, and a friend and I picked up some acid on the way up there. I'm not really sure of any of the times or anything, but I'll do my best to be relative. Anyway, my friend and I got to the college that night. We took our acid about 30 minutes after we got there. Before and after I took the hit, I was constantly meeting new people, and while I was tripping, I felt like I had the memory of meeting those people before I met them. </p><p>At the first part of the trip, I just felt a little off, a little goofy. I was talking to people I knew, and their faces would kind of fluctuate in size. I always remained aware that anything weird was due to the drug though. I walked around with some other friends to different rooms, talking to people, and just watching them. We sat in one of my friend's rooms for a while, I attempted to draw, and I could direcly put what was in my mind on the paper as long as I didn't realize what was happening, once I realized I was drawing, I would fuck it up. </p><p>I went to my other friend's room where they were watching the presidential election unfold. I just sat back with some headphones and listened to massive attack for a long while, it was really nice. I was having fairly bad cyclic thoughts... where I would think something, and it would just manifest until I realized it, and forced myself to think of something else. I could easily see how someone would have a bad trip if they got a negative thought. (analyzing that when I was tripping was pretty hard, because I had to think about negative thoughts, which had a tendency to throw me into a negative thought pattern. But I realized that whenever something is bad, it just gets better...)  I was also experiencing massive time distortion, I don't know really how to explain it, but it felt like everything that was going to happen, everything that had just happened, and everything that was happening for about 3 seconds before and 3 seconds after where I was in time, was condensed into one moment. </p><p>A little diagram:</p><p>normal time </p><p>--before----|</p><p>            |now</p><p>            |---after----</p><p>acid time</p><p>--before----|</p><p>         |now</p><p>      |-------after----</p><p>Overall description of experience: Time distortion, slight alteration of things that were already there, no real hallucinations. More a psychological drug than a hallucinagen. Altered Where, How, and When I felt things. Things easily manifested in my mind, made it easy to get bad thoughts stuck in my head, but it made it easy to get good thoughts stuck in my head. </p><p>After effects: The next day everything seemed a little colder, and more distant. I still felt a slight seperation of my senses. Things still seem a little colder and more distant almost a month later, not near as bad as the first day after though. Also there have been residuals that last longer than normal in my vision from bright lights.  It's similar to when someone takes a picture and I have the spot in my eyes for a while, but it lasts longer. I don't know if this is from the acid, but I don't believe it was there before, at least not to this extent. Plus there's just an overall feeling that *something* has changed, but I don't really know what. </p><p>Overall: I don't believe the experience was entirely negative, nor do I believe it was entirely positive. I don't know that I would suggest it to anyone else, but I wouldn't necessarily tell anyone not to do it. I'm entirely sure what I experienced, what I felt, and how it has affected me. But I do believe it changed something. As for if I'll ever do it again, only time can tell.</p>"
}
