{
 "title": "Hope",
 "author": "Coujoe",
 "citation": "   Coujoe. \"Hope: experience with Heroin (ID 40482)\". Erowid.org. May 20, 2008. erowid.org/exp/40482",
 "substance": "Heroin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 40482",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 20, 2008",
   "Views: 7630",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I remember being bored over the summer in high school so I began smoking pot when I was around 14, no harm or intent to destroy my life.  It took about five months before I discovered DXM and soon began mixing the two.  This seemed to be a lot of fun, always reading experiences on Erowid and actually believing there was a spiritual nature to getting fucked up.</p><p>At 15 I was offered Vicodin by a friend who had broke a wrist.  Again, no harm or intent to become dependent.  There have been many reports comparing opiates to warm feelings of summer rain and such, this is very true.  It was wonderful; I didnt have to deal with anything anymore.  If I was bored, agitated, or pained all I had to do was take some Vicodin and smoke pot.  Like magic 30 mins later the day would just be magic.  Everything was better.  I finally feel comfortable in my own skin.  </p><p>It didnt take long to realize it was cheaper to snort Oxycontin.  After all, when youre addicted most anything seems rational.  One thing I noticed during this period, my friends had the ability to stop using whenever they wanted or control how much they took in.  I had no control whatsoever.  Weeks later I was cooking shots for myself, because after all, heroin is FAR CHEAPER than Oxy is.  I was down to 105 lbs at age 16 being 59 this is not something normal people do.</p><p>I got sent away for 10 months and experienced sheer hell for the first 2 months.  I dont remember much of anything from the age of 16-18.  Basically, just nodding in consciousness and feeling complete and utter terror or loneliness.  I found out that I was a rare breed of a person.  A disease called drug addiction.  Meaning one out of every ten users who cannot for whatever reason stop using drugs. </p><p>I had to swallow my pride and seek help.  An anonymous program worked best for me.  I could not beat drug addiction by myself.  I would have died painfully trying, guaranteed.  I have been homeless, locked up, and addicted to drugs to the point of being pronounced schizophrenic.  I now live in a college dorm, have friends, and live a completely normal life.  I even go to parties and hang out occasionally at bars.  However I cant drink or use drugs.  I have seen and done things most people will never see or experience.  I have seen first hand friends die or commit suicide from addiction.  But with hope, I found the light at the end of the tunnel.</p>"
}
