{
 "title": "Deeply Relaxing and Refreshing",
 "author": "Jimmy Jive",
 "citation": "   Jimmy Jive. \"Deeply Relaxing and Refreshing: experience with Methamphetamine & Meditation (ID 40522)\". Erowid.org. Jul 26, 2005. erowid.org/exp/40522",
 "substance": "Methamphetamine & Meditation",
 "bodyweight": "198 lb",
 "header": [
  [
   "DOSE:",
   "65 mg",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 40522",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 26, 2005",
   "Views: 16939",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a frequent methamphetamine user. I dont use every day, but I use it anywhere from 3 to 5 days a week. I feel that there is good documentation on the subjective effects. This report deals with how I manage to cope with my least favorite effects: the drowsiness and mental sluggishness caused by frequent use.</p><p>I should also include a description of the rarely mentioned effect of greatly improved self awareness. When I am high, I notice my thought processes, how Im moving, my mood, and even (to some extent) physical processes like where my blood is flowing.</p><p>I have found a form of meditation that is deeply relaxing and refreshing, especially when I am wired out of my mind. I start by removing the blankets (other than the cover sheet) and pillow from my bed, then take off my clothes, but leave on my boxers if someone else is home. I lay on my back, finding a position in which I will not have to move, making sure my hands and feet arent dangling off the edge, and close my eyes.</p><p>It is important to relax the jaw and move the tongue as little as possible, and the compulsion to swallow more than necessary can ruin a good meditation on upper. I have found that after I swallow, there is a greater urge to swallow, and it grows every time, but if I concentrate on not swallowing, it goes away.</p><p>After I close my eyes, I try to clear my head of all thoughts and slowly repeat relax in my head. My mind relaxes followed by my muscles, but oddly enough my heart speeds up at first, although it relaxes later. I feel my skin, hands, and feet warm up, probably because of vasodilatation caused by relaxation of the sympathetic nervous system (sometimes I start feeling itches, if I ignore them, they eventually go away, if I move my arm to scratch them, I lose some of the relaxation). I feel more blood flow to my stomach, probably speeding digestion (one of the effects of stimulants is that digestion slows to a crawl). I feel a not unpleasant tingling in my balls and the shrinkage caused by the upper I feel being reversed. I feel increased genital sensation, sometimes even getting an erection. The mental relaxation seems to start at a localized point and spread throughout my head. Sometimes I forget to keep thinking relax and my mind wanders, but as soon as I remember to clear my head, I start sinking. I sometimes get the sensation of floating, and often see hypnogogic images behind my eyelids.</p><p>When I feel as though I have meditated for a sufficient amount of time, I first open my eyes slowly, then move my arms and legs around a little before I get up, because the muscles are deeply relaxed and I might stumble if I get up too quickly. I get cold quickly, and the deep relaxation is slowly replaced by a mild euphoria, an increased sense of alertness, and greater mental coherence.</p><p>The first few times I did this, it was difficult and had little effect, but practice really does help, and this meditation can be extremely useful and powerful, to the point that I can now use it sometimes to get actual sleep at night.</p>"
}
