{
 "title": "Closer to the Truth",
 "author": "TrippedTiff7",
 "citation": "   TrippedTiff7. \"Closer to the Truth: experience with Mushrooms & Cannabis (ID 40552)\". Erowid.org. Aug 13, 2007. erowid.org/exp/40552",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3 cups",
   "oral",
   "Mushrooms",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40552",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 13, 2007",
   "Views: 2514",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nAfter a fairly boring night with some friends, which included drinking and a bonfire, myself and a friend I shall call Alice decided we would head over to her brother's new apartment to check it out. This was at approximately 12:30 in the morning. We walk into Alice's brother's house and there were about 8 guys sitting around passing joints and drinking mushroom tea.</p><p>Originally, my plan was to stay relatively sober that night, however, someone offered me some tea at around 1 and since I'd never done mushrooms before, I decided to try it. Because of this I do not know what kind of mushrooms they were, nor my exact dosage. What I do know is that the guys in the house were all chronic users, therefore more likely to use higher dosages, and the tea had been steeping for over an hour by the time we got there. I drank 3 small cups of the tea.</p><p>Nothing really out of the ordinary happened for the first half an hour, we were all just sitting around talking to each other in the living room. I also noted at that time that even the people who'd already been drinking the tea seemed to be acting relatively normal. I first began to realize how high I was when I was stroking fuzzy wallpaper and thoroughly enjoying myself. Music was clearer in my mind, I began to notice things about it I'd never noticed before. I was deeply introspective.</p><p>After I pet the wallpaper, I sat back down in my chair and didn't talk much, just listened to what everyone had to say and everything had so much meaning. I studied people's faces like I never had before. Even though my movements were slow and fairly sluggish, my mind was racing. I was acting quite impulsive. If I felt like a cigarette, it was like I desperately needed one and would race around to try and find one even though my body was actually moving fairly slow.</p><p>Smoking was bizarre, it was like I could feel the smoke moving in and out of my lungs, and I liked to watch it come out of mouth and make shapes that probably weren't even there. All in all the first hour of being high was very positive. My friend Alice, also high, was talking non stop. Not jabbering, because everything she was saying made sense, but talking really quickly and barely stopping for air even though no one in the room really noticed. We were staring at each other, Alice and I. </p><p>Then she decided to play a trick on me. She told me I had amnesia. I said that no, I didn't have amnesia because I remember what happened yesterday and the day before etc. She countered with, 'That's what you say all of the time, but deep down you don't really believe it'. I once again shook my head no, refusing to believe what she was saying. She started to tell me that some days were better than others, but some days when faced with the truth about my amnesia I would cry and break down. She told me that I had a complex fake memory built up in my mind, but that really none of it was real.</p><p>Please understand that this is not a nice thing to do to someone when they are high on mushrooms. My universe immediately seemed to shatter. I looked around the room and it was spinning in a circle, Alice was smiling and laughing, the music suddenly took a dark turn and pulsed inside my brain. Immediately I began to question EVERYTHING that I thought I knew. Paranoia. Was Alice joking? Did I really have amnesia? Was I high, or was it the first time in my life I was immersed in the truth? If it was the truth then my life was meaningless.</p><p>The room continued to spin in an up and down parallel sort of circle, the tv was on and was casting an odd coloured glow on the rest of the room. I looked over at the TV since it was casting such a bright glow on everything, only to realize that the tv had never been on. It was a black screen, sitting in the corner. The music continued to pulse violently in my mind, I think we were listening to GWAR and it was just a little to heavy for my liking at the time.</p><p>Alice realized what she had done, and that I didn't think she was joking. She told me over and over she was just kidding, I didn't have amnesia and it was something that was played on her when she was on mushrooms and it was now up to me to pass it along. It took me a very long time to believe her since my mind's natural instinct at the time was not to trust her. As soon as I let myself believe she had tricked me, the music lightened up, the paranoia subsided, and I felt better.</p><p>I had long conversations with the other people in the room, nothing earth shattering, nothing too memorable, but enjoyable at the time. My sentences, for the most part, made sense, but sometimes I would just trail off when something else decided to occupy my racing mind. Alice's brother decided that I needed to do 'buckets' which is, if you are unfamiliar with the slang term, a very concentrated way to smoke pot. You put a bowl on top of a 2 litre plastic bottle, and put it in a bucket of water. After waiting for the smoke to fill the bottle, you open the lid and inhale the smoke while pushing the bottle down in the bucket, which forces a lot of smoke into your lungs at once. I also decided that doing buckets was a good idea at the time, despite being very very high already. The bucket ended up crecendoing my high even more.</p><p>It was now around 2:30 in the morning. Despite having been up early, I was not tired. Alice and I toured the house, hand in hand, stopping occasionally to look at intersting plants, books, things that were bright coloured, just things that would be overlooked normally but were SO interesting at the time. Alice looked at me and said, 'Doesn't it feel like you are just closer to the truth?' I agreed with her, that's how I can think to summarize it, Feeling closer to the truth.</p><p>Alice and I sat back down on opposite ends of the room, both of us were engaged in in-depth conversations, most of which I can't even remember. We would stop once and a while to listen intently to the music, or to walk around studyign our surroundings. All in all it sounds really boring, but I was never bored, just content with my brain taking itself away. Even when I closed my eyes, There were swirls of colour that vibrated in time with the music. Time either went really slow, or went really fast. Actually, time was moving slow, but as a whole chunk it went by fast because Alice and I checked the time and it was almost 5 am.</p><p>Since no one in the house was capable of driving anywhere, Alice and I decided we should probably head home and walk. Unfortunately, Alice lives way way on the other side of town, about a 45 minute to an hour walk. I began to become afriad of the walk ahead, because I knew how incapacited I was and how easily destracted I'd become. It's ironic, I thought in my mind of Alice as my protector, the leader of this high, she would take care of me since she had done mushrooms before, but she was as high, if not more high than I was and probably not capable of taking care of herself nevermind me.</p><p>I became seized with paranoia as we prepared to leave the house, I was scared because I KNEW that I was unable to look after myself and we were leaving the safety of being around others and venturing out by ourselves. I remember whispering in Alice's ear, 'I'm too fucked up to walk, friend'. It was cold outside so we put jackets on, but once we ventured outside it wasn't cold at all.  I held Alice's hand because I was still afraid. Despite my paranoia, it was nice outside. At 5:30 am, it was still dark outside and the stars were out. They were blazing in the sky. There's still snow on the ground where I live, and it was fascinating stuff at the time. From time to time on our walk home, I thought I heard scurrying and little voices around me, but I wanted to 'be strong' and just ignored them.</p><p>Streetlights were casting light on us, it seemed so pure, and it was warm. Alice was loudly chattering non stop, ranting and raving about various aspects of life. I was scared she was going to wake people up and was shussing her. Either she thought she was talking quietly and wasn't, or I thought she was talking loudly and she wasn't. I wasn't sure. The walk home was fairly pleasant, although the paranoia in me would sometimes make me think we'd get lost and never get there, or that Alice's house was too far away and we'd wander perpetually. Alice decided on a whim that she wanted to jump a puddle in front of us. It wasn't that long, I'd say about three feet across. Unfortunately for Alice she was too uncoordinated to pull it off, and the puddle was actually a sheet of ice. She slid and fell on her ankle. This is not a good thing to inflict upon a paranoid person on mushrooms.</p><p>Alice had been my rock that night, she'd been on mushrooms lots of times and was helping me through the situation. Now she was potentially hurt, and potentially too fucked up to deal with it. She got up and was walking with a limp. Neither of us knew how serious her injury was. She brushed it off and tried to tell me it was okay, but how was I supposed to know? I had no idea what to do, I was on mushrooms for godssakes! There was a tight knot in my stomach. Worrying about Alice, worrying about myself. Even though I'd been through town many many times myself I had no idea where we were or how to get to Alice's from where we were. Every time she told me she was okay, it made me feel a little bit better, but everytime I watched her limping on her ankle it made me feel worse.</p><p>Finally we made it in view of her house, a burden had been lifted off my fragile self. I began to enjoy myself again, and Alice's limp had almost gone away by this time. We had been walking at least an hour, but it felt like we'd been travelling for many days and nights. We got into her house and I felt much better since I was in familiar surroundings again. Unlike myself, Alice still lives with parents. I was really worried about her mom waking up, it was a big fear of mine at the time. Alice went out to the shed in the backyard and started hitting her windchimes because she said it was like hearing 'Angels singing'. I was too worried about waking her mom and the neighbourhood up to enjoy the sound.</p><p>We went back inside and decided we were hungry. Everything from the rustle of packaging to crunching on crackers felt like it was roaring loud and that any moment Alice's mom would wake up. We ate crackers and a variety of random cheeses, they tasted really good. I noticed textures and smells and tastes a lot differently high on mushrooms. Then another onset of paranoia came. Alice made me some tea and I thought she was trying to poison me, but I drank it anyways. Then I had one of those canned fruit salad cups, and as I swallowed it down, I thought I was swallowing chopped up slimy body parts. I looked at the fruit, confirmed it was fruit, swallowed again but still it felt like chopped up body. I ate some more crackers to make myself feel better.</p><p>Alice and I went to sleep in seperate rooms. She gave me lots of sketch pads and colours and pencils. I drew and painted and wrote things down, none of it made sense in the morning. There were a lot of wingless butterflies, and some rant about the movie 'Matchstick men', I have no recollection of this part of the night. After I was done with that, I shoved it aside and tried to sleep, at this point it was about 6:30 am. I had vivid swirls and dreams and heard voices. There was a plant above my head that I would occasionally wake up and gaze at. I got 4 hours of sleep, woke up Alice still slightly feeling the after effects (most likely just the coming down) and went out for breakfast. Overall I had a good first experience, albeit a wierd one, and I can't wait to do mushrooms again.</p>"
}
