{
 "title": "Mushrooms & Migraines",
 "author": "AJ",
 "citation": " AJ. \"Mushrooms & Migraines: experience with Liberty Cap Mushrooms (ID 40586)\". Erowid.org. Jul 4, 2005. erowid.org/exp/40586",
 "substance": "Liberty Cap Mushrooms",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Mushrooms - P. semilanceata",
   "(tea)",
   " T+ 4:00",
   "2.0 g",
   "oral",
   "Mushrooms - P. semilanceata",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "40586",
   "Female",
   "",
   "Not Given",
   "Jul 4, 2005",
   "17051",
   " "
  ]
 ],
 "report": "<p>I would first like to note that until I found this web-page in a google site about mushrooms, I refused to try any sort of psychedelic drugs. I began to read about the mushrooms and how they affect your body. Just before I exited the site I saw a link that said 'Mushrooms and Migraines.'</p><p>Unfortunately I began having migraines when I was six. They stopped, and now I am 19 and experiencing them worse than before. I let my boyfriend convince me to take the mushrooms to help take care of my migraines.</p><p>First I took 2 grams of mushrooms and chopped them up finely and boiled them in one cup of water for fifteen minutes. I drained them with a coffee filter and into a cup. I drank that first cup and boiled the mushrooms for fifteen more minutes in another cup of water, followed by the straining method once more. I drank this second cup and left the rest of the mushrooms in cup of water for two hours. </p><p>I waited a half an hour and began tripping. This was an absolutely wonderful experience, I believe the trip with the mushroom tea is most definitely the way to go. Even for a person who just wants a good trip. I tripped so sweetly, and I was able to watch the walls and the floors melt while I watched a Color show on an Apple Computer. This was amazing.</p><p>After four hours my trip began to dissipate, and this is where I messed up. Instead of making more tea, I just ate another two grams and waited for the effects. For someone with migraines, this doesn't help. </p><p>I went about a month or so with no migraines, just a cloudy headache instead. Soon after I began to have migraines daily, disabling me. I got fired from my job and I am still looking. I am also a college student and am unable to attend a lot of my classes due to these daily migraines. </p><p>I believe that if I had not eaten the second dose I would not have regained the migraines so badly. I am hoping to try it again someday to get rid of these migraines, but for now I am going to see a nuerologist to see what they can do for me.</p><p>Thanks Erowid for the idea and the directions on how to get rid of my migraines, even if it was only for a little while.</p>"
}
