{
 "title": "Just a Pinch",
 "author": "Pinkdiamondgnome",
 "citation": "   Pinkdiamondgnome. \"Just a Pinch: experience with Salvia divinorum (extract) (ID 40610)\". Erowid.org. May 22, 2008. erowid.org/exp/40610",
 "substance": "Salvia divinorum (extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 40610",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 22, 2008",
   "Views: 3137",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I will do my best to describe the first experiences I had with homemade Salvia divinorum extract.  I obtained it from my friend who had purchased some Salvia over the internet and went about making his own extract.  Due to this I cannot tell you what the intensity of the extract was; only that it rocked my world.</p><p>Background:  I would consider myself a somewhat experienced drug user.  I have done shrooms twice (once with a good trip, once with a bad trip), I have had vast experiences with painkillers of all sorts, nitrous, speed, DXM, and an uncountable amount of experiences with weed and alcohol.  I have also read tons of material on the internet on drugs as well as the drug culture.  I have recently turned 18 and have for the most part been doing quite well with school, friends and family life.</p><p>I came across Salvia about a year ago when I was looking for a legal way to get high.  Having done DXM countless times I figured there were probably many other equally easy and legal ways to do so.  So after reading a large amount of material on Salvia I began my search.  For the most part I came up with nothing.  However when a friend of mine said he had made some Salvia extract and that it was quite potent, I made sure to get the rest of what he had.  Holding the baggie of black shake I was quite taken back by how plain it looked. Having built up this drug so high in my head I expected something quite different; however I was not picky and quickly paid.</p><p>Remember he said. Just a pinch will do you! as he smiled and walked away.</p><p>The following are the 2 experiences that took place that same day.</p><p>The First Experience:</p><p>I went home and had the house all to myself; it was 11:30 a.m. on a Monday in February so this was of no surprise to me.  I took my mothers butane torch and my small glass piece and went up to the bathroom.  I packed one pinch, it looked so small but while I was considering packing more I decided to start small and work my way up.  I opened the window and the screen and leaned out the window, after pushing a towel under the door for precautionary reasons I decided to go for it.  The substance burned fast and easily and was noticeably easier on the lungs than previously expected. I took the entire pinch in one hit and held for as long as I could.</p><p>After about 20 seconds I exhaled and to my surprise I could already feel something rushing towards me.  I felt like there was a great rush for some reason and quickly put the bowl in my pocket and closed the window and turned off the bathroom light, and rushed down the stairs to put away the butane lighter.  After doing so it fully hit me. It felt like there was a huge wind or some unseen force pushing me forward telling me that I had to get up and go.  This propelled me to the computer where I had the Garden State Soundtrack playingthe music was nothing but pure bliss.</p><p>After a failed attempt to turn on the internet, I finally succeeded.  However a porn site popped up. Now dont get me wrong I like porn as much as the next guy but for some reason I found the act crude and was about to close it when the visuals began to take hold.  It appeared the mans member was singing to the womans vagina.  The very thought of this made me laugh harder and louder and longer than I ever had in my entire life.  There was something so exhilarating and fulfilling by that wholesome laughter that put me in an awesome mood.  As I looked up, refreshed, it appeared that this draping on the wall was slightly blowinglike there was a breeze in the room, only the doors and windows were closed and locked.  This made me realize that the Salvia was not just a plant, it was also a spirit.  This spirit was the one that foreshadowed the rushing feeling in the beginning, as well as the thing that pushed me forward and told me to get up and go, and finally it was the spirit that freed me of all chains and made me laugh in pure joy earlier.  This discovery made me very happy and for the rest of the time I grooved silently, occasionally laughing to myself to the music playing from the computer.</p><p>The entire experience lasted about 20-30 min, and when it was over I felt pretty much normally, most just feeling I was coming down off of shrooms and really high at the same time.  I then drove back to school to spread the word of this legal wonder drug to all of my non-believing friends.</p><p>Time Between Trips (At school): My friends for the most part were happy the drug worked and laughed at the fact that I would do it in the middle of a school day. However none of them said they wanted to try it after school. I started hunting for a person that had a bong (I heard water pipes work better with Salvia) and that wanted to smoke.  I finally found the person I was looking for. T was a Caribbean junior whom I had recently grown a marijuana plant with (great home grown dank!) and have smoked with on many occasions.  We set the time as after school, and the place in his garage.  T has smoked and drank on my occasions but has had no previous experiences with any sort of psychedelic substance.</p><p>The Second Experience:</p><p>Because I knew what to expect I let T take the first hit.  The smoke quickly filled the glass chamber and he inhaled and kept the breath for quite a while.  I than took my hit and held it in.  We both held it the same amount of time and it wasnt until I exhaled did I feel the presence of my lady again.  She was blowing again and I went over to T and touched him on the arm to see if he was feeling anything.  He spun around and looked OUT of it.  I quickly put down the bong, scared to break it, and looked again at T. The drug was now in full effect and he was looking out of the garage out into the rain.  He seemed to be having a good time and this made me very very happy.  My lady crept into me and told me to celebrate Ts happiness.  So I laughed and laughed and laughed, harder and longer than ever before in my life.  I laughed so hard for so long that I literally pissed my pants.  But I didnt care because I was just too happy.</p><p>We ran into the rain and into the safety of my car, where we had Pink Floyds Dark Side of the Moon playing.  We grooved in the car for the remainder of the trip, T kept talking about how he couldnt remember anything that had just happened and that he would like to try it again sometime when it was warm and sunny outside because now he knows what he is dealing with.  The stoned feeling came over the two of us and we just chilled out in the car for awhile.  He than went inside and I drove home.</p><p>After Thoughts:  There is no real way to prepare for this experience. It is mind blowing and conveniently lasts only about 30-45 min to get back to baseline, although most of the time I wish it was longer!  Although a trip sitter wasnt necessary, it is more fun to do it with someone.  I will certainly be doing it again, but only on special occasions.  This spirit has the power to relieve, release, and enchant.</p>"
}
