{
 "title": "What I Like, What I Stay Away From",
 "author": "DTR",
 "citation": "   DTR. \"What I Like, What I Stay Away From: experience with Various (ID 40654)\". Erowid.org. Mar 18, 2005. erowid.org/exp/40654",
 "substance": "Various",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "2005",
   "40654",
   "Male",
   " ",
   "Not Given",
   "Mar 18, 2005",
   "16280",
   " "
  ]
 ],
 "report": "<p>2.8g Kanna:</p><p>I took the equivalent of 2800 mg worth of Kanna pills, which should be quite a high dose I was willing to take of it. myself nor either of my friends felt much of anything above baseline. It definitely felt different a little relaxing, but def not worth it. I don't recommend Kanna.  </p><p>25g Blue Lotus:</p><p>I've also tried blue lotus. It is claimed to have mild relaxant and euphoria inducing properties. Without mixing it in wine first, there is absolutely no effect. Overall, very mild. Don't waste your money on lotus.</p><p>28g Kratom:</p><p>Kratom is one that is actually worth it! I extracted about 28 grams of the normally leaf by boiling. All I have to say is WOW! my body felt very tingly, warm, and there was intense euphoria. I could see how this could be addictive, which I see as the only drawback. It upset my friends stomach, but I was totally fine. This one is worth trying.</p><p>10g Wild dagga:\t\t\t</p><p>Wild dagga again falls in the not worth it category. Very small effects. I tried it as a tea, to no substantial reward. Very nasty tasting. </p><p>1g Wild lettuce:</p><p>I made some tea from Wild Lettuce resin, i.e. Lettuce Opium. Such a disgusting taste! It was like drinking the bitterest & grossiest lemon juice and battery juice. no/little effect, not worth it. </p><p>15g Calea:</p><p>I tried ingesting the equivalent of 2g, 10g and 15g worth of Calea, the 'dream herb'. neither of the three attempts produced any increased dream vividity/lucidity. Tastes abysmal too, stay away. Adding valerian, wild lettuce, and African dream herb did make me drowsy, but did little to dream recall. Overall, just liquid crap.</p><p>7g Damiana:</p><p>Damiana is interesting stuff. As usual it tasted bad, but not unbearable. I took about 7g, and there was a slight mood elevation. Despite this, it did give me very sexual dreams, both times I try it. I believe in its aphrodisiac ability. Somewhat worth it.</p><p>6 inches Calamus:</p><p>I stay away from calamus at costs. It smells like dead fish when the root is broken. A 6 inch section apparently is the effective dose. I found it unbearable to take as a drink, i.e. instant vomiting. I eventual swallowed cut sections. my stomach hurt for days, and I experienced no good effects from it. Absolutely not worth it!</p><p>21g Ashwaghanda:</p><p>Ashwaghanda pills only made me drowsy. Even when taking the equivalent of 21g of plant. nothing special.</p><p>1gm Wormwood</p><p>Wormwood tea, tasted as bad as wild dagga. no real effects, not worth it.</p><p>2 droperfulls Salvia Divinorum:\t\t</p><p>I tried the Salvia Divinorum tincture. Damn does it burn my mouth! It definetely worked. I recommend using listerine before hand.  It made my limbs numb and gave a good sense of well being. Decent stuff, but kratom is better orally. Salvia is most effective smoked as a 10x or 20x extract. But I don't like smoking. The tincture is probably worth trying once.</p><p>Conclusion: Kratom is the best i've tried so far, orally.</p>"
}
