{
 "title": "Different Over Time",
 "author": "Potty Mouth",
 "citation": "   Potty Mouth. \"Different Over Time: experience with Cannabis (ID 40662)\". Erowid.org. Jun 2, 2007. erowid.org/exp/40662",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "40662",
   "Male",
   " ",
   "Not Given",
   "Jun 2, 2007",
   "4616",
   " "
  ]
 ],
 "report": "<p>The first time I smoked weed was six years ago, and in the meantime I've tried many different drugs: psychedelics, E, coke, crack, meth, LOTS of pharms, etc.  My illegal drug use has toned down quite a bit in the last few years, pretty much since I came to college, ironically.  I hardly ever trip (I've discovered I'm not really in an emotional place to do that right now), do coke once every couple months or so, and I've said goodbye to E for good.  I am, however, a pretty regular pot smoker and too regular drinker, and I'm about a pack a day smoker.</p><p>I've noticed shifts over time in my subjective experience with marijuana, and most people I've talked to about it seem to report a similar gradual change, especially in their first years of pot smoking.  My question for the community is this: Is this caused by greater experience with pot?  If so, is it neurological in nature or purely subjective, i.e. do you just get used to it, or is there something in your brain that decays or changes?  Or...is it caused by mental maturity?  Everyone I know who has a history with the drug to speak of started in their early or mid teens.  Do younger brains process pot differently?</p><p>The first time I smoked pot was drastically different from every other time I've gotten high.  I was a Freshman in highschool and just itching to start doing drugs.  I was nerdy, too smart for my own good, and I figured it would help me socially, which it did in some ways, but I think it's hampered my maturity a lot in the meantime.  I got invited to this girl's birthday party where there would be weed, and I lied about having smoked before.</p><p>Meh, I was young, and in fact I'm still great friends with a lot of the people who were at that party.  We all took a walk down to the park by her house to smoke up.  The first trip out I didn't get high.  I thought I did, but in retrospect I didn't.  It was just excitement, pretty much.  I've smoked up a few weed virgins and the meantime, and from what I hear this is pretty typical.  Lots of people don't even get high the first time they smoke pot.  Neither did I, at first.</p><p>A few more people showed up at the party, one of whom was a friend of mine and would become a source and partner in crime for me later in my drug career.  So I went out to smoke with them.  We smoked a few bowls, and initially there was no change in my mental state.  We might have been gone a little bit too long because the mother of the girl at whose house we were partying came out to find us.  Luckily we were already on our way back.  As she was leading us back to the house I had a DRASTIC shift in my brainpan.</p><p>I felt like I was sitting WAY back in my head, or wearing a mask or something.  Everything seemed incredibly far away.  Sight and sound.  When we got back inside, I got a sort of 'pins and needles' feeling all over my body an conjunction with this feeling of dissociation (if you want to call it that).  This was physically painful.  Really painful.  It lasted pretty much the whole night.  I just sacked myself out on the couch and didn't move.  I got a ride home from my sister, who was less than sympathetic (hypocrite).</p><p>The next day I was spent, and my brain felt like mush.  I've only heard the pins-and-needles phenomenon described by one other person, who attributed it to some medication they were taking or something.  I find this explanation unlikely because I was on no medication at the time and the pills he was referring to were azithromycin, an antibiotic which is not, to my knowledge, psychoactive.</p><p>Subsequent occasions were never like this.  In fact not at all.  Sometimes I would get a sort of detached feeling, but never in that exact way.  For the first year or two of smoking pot, I would experience a 'strobing' effect in all my senses.  This was a pretty consistent feature and I would actually get somewhat debilitating 'flashbacks' during my sober life.  Sometimes it would get incredibly intense in the tactile sense.</p><p>When mildly stoned it felt like my whole body was sort of 'blinking' and with higher doses it almost seemed like individual square patches of skin were strobing on and off in some sort of pattern.  The higher the dose, the smaller and more numerous the patches of skin.  Once it felt like I had broken up into little cubes that shifted around so that I could move.  This isn't a very good explanation of the sensation, but you kind of had to be there.  The funny part about this is that when I looked for the breaks, the 'off' cycle of the strobe, I could never find it.  I've heard strobe vision described by a few people, but never the tactile weirdness.</p><p>All this gradually diminished until I became a true pothead the summer after my sophomore year of high school.  I can point to the week it all changed, at it was the week of the camping trip where it suddenly became normal to smoke several times a day.  Since then, the experience of smoking pot has been about the same.  You know, you just get stoned.  No strange sensory effects, just a pleasant slowing-down and an inability to concentrate.  The sensory enhancement lasted longer than just about anything else, but it's mostly gone now...*sigh* The giggles were gone about the third year of pot smoking.  At least now I can relax.</p><p>No matter how long I abstain, I can never seem to get back the feelings I had for the first year, although one time I felt extremely cold after getting stoned and had to go wrap myself up in a blanket and calm down because I couldn't stop shaking, this happened like a year ago. Also, ingesting marijuana can make me exceptionally stoned and bring back the giggles and sometimes, sometimes, the strobes.</p>"
}
