{
 "title": "My Daily Cycle",
 "author": "Dustin",
 "citation": "   Dustin. \"My Daily Cycle: experience with Amphetamines (Adderall XR) (ID 40693)\". Erowid.org. May 25, 2008. erowid.org/exp/40693",
 "substance": "Amphetamines (Adderall XR)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40693",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 25, 2008",
   "Views: 10665",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHi, I'm 15, and I take prescription Adderall for ADD/ADHD. This is just explaining how it helps me in school/makes me feel for those who are considering an Adderall prescription, or using it for recreation. I've never experienced it, but I've heard if you don't have ADD/ADHD the results of Adderall are similar to stimulants and NOTHING like I experience. Please be aware of this.<br>First let me explain my dosage of Adderall to avoid confusion. Adderall XR is an Adderall pill which releases the drug at two different points. It's in two sections, one obviously darker than the other. The first section dissolves immediately, the second has a thick coating which takes a few hours to dissolve in the stomach, than releases the remainder of the medicine.<br>I'm currently prescribed 40mg of Adderall XR daily, for ADD/ADHD. This leads to 20mg of medicine when I take it, and 20mg later, but I usually take 2 pills. As for caffeine, I usually walk past a gas station on the way to school, and it being 7:30am, A soda or raspberry tea is usually good, and helps me concentrate even better in school. I'm not sure if this is because it is a stimulant, like adderall, or because it simply helps wake me up.<br>Now on to the effects. I'll break them down in a list first, then go in depth.<br>Positive: Relaxed and Happy Feeling, Alertness, Ease of studying/learning in school. (all when medicated)<br>Moderate: Quietness/Lack of Sociability, Loss of Appetite, Shortness of Breath, Can feel blood pumping (weird.)<br>Negative: Shakes, Irratability, Headaches, Extreme Hunger, Dizzyness. (all when coming down)<br>OK, so basically when I'm on adderall, I get a very relaxed feeling, like being very at home and relaxed. In all of my classes I find it much easier to concentrate, and I'm able to find some interest in any topic. This stays the same until around 11:30 (pills taken 7-ish) Around 12:30 I can feel it wearing off, and I have trouble focusing, I become more talkative, and begin to feel hungry. I feel the feeling coming back around 1, and I have a 1:30 lunch though, so by the time I get to lunch The medicine has kicked back in, and I am no longer hungry. The feeling is pretty enjoyable, just pretty much euphoric, but then I'm able to work hard at something. It's real unique, because as far as the other drugs I've experienced, euphoria comes with sillyness, giddyness, or at least lethargy, but with this, I feel content, and don't have any trouble working.<br>Now coming down is a different story, about the time I've been home for an hour (usually done with my homework) I become STARVING because I haven't felt the slightest hunger all day except for a small gap between releases, and feel just plain tired and exhausted. Also, I usually have a headache, and occasionally have trouble eating food, like the 'I'm so hungry, but can't eat' feeling I have when sick, nothing is appealing. Usually I can force down half a sandwich or some chips, and drink a lot of juice, the comedown usually goes away shortly after this.\n\n\n"
}
