{
 "title": "Interesting Day at Work",
 "author": "Towlie",
 "citation": "   Towlie. \"Interesting Day at Work: experience with Turbina corymbosa (ID 40708)\". Erowid.org. Jul 23, 2007. erowid.org/exp/40708",
 "substance": "Turbina corymbosa",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "50 seeds",
   "oral",
   "Turbina corymbosa",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40708",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2007",
   "Views: 12306",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter learning of it a little over a year ago, I have really wanted to have an experience with LSA.  Having tried Hawaiian Baby Woodrose seeds with no affect (I think I bought inferior quality seeds and did not take a high enough dose), I have tried quite a few different drugs but would consider myself pretty new to physcoactives.  Having read a lot about HBWR and morning glory I came across rivea corymbrosa seeds and as there was only one report on someone taking just one seed I thought it would be good to explore this plant.  I read about two different methods of taking the seeds of which I tried both.  The first time I took around 15 seeds crushed them up and soaked them in water for 12hours.  I then drank the LSA water and ate the seed pulp.  The affects were barely noticeable and not really worth writing about.<br>The second time was a lot more rewarding.  I have a very boring weekend job so I thought I would try these seeds a second time just before I left for work one day.  This time I took around 45-50 seeds and chewed them up for about 30minutes then swallowed them.  After I'd swallowed the pulp I sat down to put my work shoes on and looked around the room.  I was already noticing visual distortions, as I looked at a chair across the room the legs looked as if they were bending and distorting and the cushion on top of it appeared to be melting.  I only noticed these visual affects when I looked at something for more than a couple of seconds.<br>I walked to work feeling a bit strange, kind of a slightly stoned feeling I guess.  About 30 minutes into work the visual distortions were getting stronger.  The floor looked as if it was flowing and moving up and down like water.  Things on the shelves (I work in a supermarket) appeared to move apart then get closer to each other.  Work was certainly beginning to be a lot more fun!  Another 30 minutes on I was feeling really happy and was smiling a lot.  I also kept humming without realising I was until someone went to talk to me.  The stupidest things would make me laugh and everything appeared more interesting  than it actually was.<br>2 hours into the experience I was feeling a bit ill, I hadn't eaten anything since the night before so thought I might just be a bit hungry.  I had my lunch and shortly afterwards began suffering from quite a bad stomach ache.  But after a while I was able to ignore it and it didn't really bother me that much so I got back to work.  I started finding it very hard to concentrate on anything and was still in a quite euphoric mood.<br>The visual distortions and euphoria lasted for around 6 hours, my entire shift at work, and was a really enjoyable experience.  Although it made my job a lot harder to do since I kept getting  distracted by the liquid floor and moving shelves, work was a lot more fun that day\n\n\n"
}
