{
 "title": "Hyper and Cold, Too Much",
 "author": "Ovation",
 "citation": "   Ovation. \"Hyper and Cold, Too Much: experience with Methylphenidate (Ritalin) (ID 40710)\". Erowid.org. Sep 14, 2005. erowid.org/exp/40710",
 "substance": "Methylphenidate (Ritalin)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40710",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 14, 2005",
   "Views: 17389",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've been prescribed to ritalin for a while now, but haven't been taking it regularly for reasons I won't reveal here. I don't know what kind of tolerance to this drug can be built up, but if you can build one up, I would have a next to nothing tolerance. I've snorted it three times. The first time I snorted 40 mgs. I didn't really feel anything, maybe I was just more used to heavier effects from other drugs. The second time I snorted 60 mgs. I just remember getting lots of chills and being very comfortable and sociable.<br>Three nights ago, however, I decided to up the dosage to 80 mgs, or four crushed up extended release 20 mg pills. I don't know if the fact that they were extended release pills had anything to do with what happened, but I thought I'd note that. After I snorted the powder (at about 10:30), I could sense a general feeling of comfort. I was on the phone for a few hours afterwards. The ritalin high was normal, and I was a bit disappointed that it wasn't more intense. However, I tried to go to sleep at about 2 o'clock, and couldn't stop bouncing my leg, or just generally calming myself down. I was extremely hyper, and very cold, even though I was under my blanket in my room, which is generally the hottest room in the house. I slept for periods of about 15 minutes at a time, waking up to wipe myself clean of the cold sweat accumulating on my body and to try to calm myself down to repeat the process again. <br>The next day, I couldn't see straight. It sort of reminded me of being drunk, but without the mental obstacles. My head hurt if I rotated my eyeballs too much in any direction, or if I moved my head too much. My joints ached, and I was extremely fatigued. Walking up and down the stairs made me very tired, and I was very very cold, even when others made comments that it was really hot in a room. Chills were frequent, and even wrapping myself in blankets wouldn't warm me up. These symptoms slightly lessened as the day went on, and I slept very badly but frequently that day. The next day I slept much better, but again, alot. Today, I feel much better, I can eat again, sleep normally. The vision is still vaguely impaired, and my joints still hurt a bit, but this should be completely gone by tomorrow or so. Just be careful and don't go over 60 mgs I'd say. Not even that good of a drug.\n\n\n"
}
