{
 "title": "Spiders and Shadows",
 "author": "RealityBenderZz",
 "citation": "   RealityBenderZz. \"Spiders and Shadows: experience with Dimenhydrinate (Dramamine) (ID 40771)\". Erowid.org. Jun 24, 2008. erowid.org/exp/40771",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40771",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2008",
   "Views: 5426",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe time was about 6:00 in the afternoon and me and my friend J had been attempting to get high off banana peels. Well that failed, but I'm still going to try it again. After a while J says to me 'I've got something but you can't tell anybody we're doing it.'<br>'Ok' I think to myself, and he goes to his bedroom and he comes back with a bottle of generic motion sickness pills, 50 milligrams each, 100 pills he got for four bucks, who could pass that up? I've done dramamine many times before, so I decided to increase the dosage this time. Around 7:00 we took the pills, I took 24, I'm not sure how many he took.<br>8:00pm - By this time I'm feeling nice and relaxed, don't really want to talk to anybody, just kinda want to play Nintendo 64, kickin it old school.<br>8:30pm - I'm become very confused, shadows are there that have nothing to cast them, I'm hearing lots of whispering when nobody's talking, and I've got a very nice body buzz going on.<br>9:00pm - This is when the trip started to slide down the hill it had been climbing, though it didn't slide to far. Small invisible spiders were crawling all over me, all I could see was the outlines of their bodies, but I could feel their tiny claws running across me. I swatted madly at them but that seemed to cause very large goosebumps all over my body. I soon decided to go home.<br>9:30pm - As I'm walking home I'm cutting through yards and a notice a small brown rabbit run past me, not to odd. Then it got strange, 3 more ran past me. Soon, dozens of small brown hares were dashing around me. I was loosing my sense of reality. Its a very short walk from J's house so I was home in about 4 minutes, I quickly got into bed, and after a few hours of swatting spiders and scratching itchy goosebumps I finally fell asleep. That was about 1:30 in the morning.<br>7:40am - I wake up covered in those invisible spiders, I was still tripping hard, I got on my computer, never ceasing my attempts at ridding myself of this infestation. I was being driven to insanity.<br>8:30am - I'm sitting on my computer and the shadows in my room begin to assemble on one spot on one wall, I shook, fearing what was going to happen. The shadows then violently burst out of the wall in the shape of a Jet Black boxer with nintendo 64 type graphics. Ok, who remembers nintendo 64 graphics? They were blocky yet still 3d, overall decent looking. It began swinging madly around the room and I caught everything it knocked down (don't ask, I was trashed). It soon faded away and the shadows returned to normal. I ended up bug bombing my bedroom to get rid of the spiders. After that and a quick shower I went back to J's house.<br>9:00pm - I'm back at home, typing up my experience, not quite trippin', but I'm still definitely feeling those pills. About to pass out, just hopin there's no god damn spiders, they never used to, but those thing scare the shit out of me now.\n\n\n"
}
