{
 "title": "They Work on This Stuff?",
 "author": "Chretien S",
 "citation": "   Chretien S. \"They Work on This Stuff?: experience with Kratom (ID 40793)\". Erowid.org. Oct 31, 2006. erowid.org/exp/40793",
 "substance": "Kratom",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 g",
   "oral",
   "Kratom",
   "(tea)",
   "  T+ 2:00",
   "0.5 g",
   "smoked",
   "Kratom",
   "(dried)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 40793",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 31, 2006",
   "Views: 8650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>4 grams of finely powdered Kratom put in cup with the juice of 1 lime and freshly boiled water was poured in. I let it steep for 30 minutes, added suger, then toasted the gods and drank it all down (about 10 minutes of tea ceremony), including plant material sludge. taste was bitter but not bad, like a very dank green tea.</p><p>T+0:15</p><p>Numbing of the lips and tongue. chalky taste in mouth.</p><p>T+0:30</p><p>Mild body warmth, mild euphoria, physically relaxed, mild stimulation.</p><p>T+0:45</p><p>Mental well being, creative flavor.</p><p>T+1:00</p><p>Still feeling about the same as the 45 minute mark, perhaps slightly intensified.</p><p>T+1:30</p><p>Riding the same flavor as the 45 minute mark. some itching, the classic opiate itch.</p><p>T+2:00</p><p>I threw some cannabis/Kratom smoke mix into the picture. Pleasantly smooth smoke. Definite feeling other than thc. But then cannabis seems to synergize quite nicely with most things.</p><p>T+2:15</p><p>Now I definitely feel opiate-like effects. Laid down and listening to the music. Quite a nice euphoria. Apparently still felt physically stimulated, when I noticed my feet tapping to the rhythm, which wouldn't be normal for me and opiates. Got up to walk to the bathroom and noticed how quickly my energy came back and focused. Looked at my face in the mirror. No noticeable facial muscle relaxation, like that made-out-of-stone look. pupils seem slightly constricted. Laid back down and thought about a few things. How it had been quite a long while since I had felt this kind of euphoria. </p><p>T+2:45</p><p>First signs of subsiding. slight headache or fogginess. Feeling more sluggish.</p><p>T+3:15</p><p>Cook and eat. Coming back to baseline.</p><p>T+4:45</p><p>Still there. Still the slight headache/fogginess. I'm surprised, I was expecting to be back at homebase already but here I am at nearly the 5th hour. If they use this stuff for laborious tasks in Thailand it must be in small quantities. music, art, etc., sure... but digging ditches, no thank you. sleep sounds good about now...</p><p>Took me awhile to get to sleep, effects lasting a atleast a total of 6 hours. woke up feeling pleasant, slight after-buzz. Feeling a little drifty in the mind, not much motivation other than to kick back and relax.</p><p>Kratom is quite curious. it feels like an indole, I can feel a very mild sense of psychedelia (especially at the start), and I can feel the opiate-like effects (especially towards the peak to end). I had no stomach discomfort or nausea.</p>"
}
