{
 "title": "Self-Control",
 "author": "Xavier",
 "citation": "   Xavier. \"Self-Control: experience with Cocaine (ID 40820)\". Erowid.org. Jun 25, 2007. erowid.org/exp/40820",
 "substance": "Cocaine",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 40820",
   "Male",
   " ",
   "Not Given",
   "Jun 25, 2007",
   "Views: 2145",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First, I would like to tell a little bit about myself. Right now I am going in college. It is one of the top engineering Colleges in the country. I am Chemistry major and going to med-school after I get my degree. As of now my cumulative GPA is 3.650. </p><p>Moving on, when I was in high school I did a lot of drugs, starting with THC first as a sophomore. Unlike many addicts, I always researched drugs very in-depth before I took them. By the time I was a junior, I realized that I was getting dumb. I could no longer perform complex mental operations, especially in math which used to be my best subject. I then got upset and quit. I stuck to drinking of a while until I became a senior. </p><p>In February, my best friend asked me if I wanted to go to Mexico for spring break, I said yes, and he said to pull together $1500 in a little over a month. I wanted with all my heart to go to I resorted to selling cocaine. I had a very strong connection that could get the best cocaine in America; he would go to Texas and pick it up as soon as it crossed the Rio-Grande. I would get it dirt cheap because there was a minimal amount of 'middle men'. I would sell in large quantities of about a half oz to an ounce (28 grams), I would make between $200-$600 a sale. </p><p>As you can imagine, being around it as much as I was, I was tempted to do it. So I researched it, after reading scientific reports and experiences, I came to the conclusion that for the most part cocaine was not that bad. Every site would negatively represent it by talking about the addictive qualities. None talked about how long they lasted, what they would be like, or about permanent mental effects. Of coarse, there were some physical ones, as there are with every drug, but they are close to the same as any stimulant, such as caffeine. Anyway, I tried it and liked it as anyone would. When I was on it I felt stronger, faster, more alert, flawless. Then I would come down, it was bad for about 3 hours, then settle.  Within about 24 hours I would feel as if I had never done anything. I went on spring break, had a great time, came back to Minnesota and started selling again. </p><p>Over time I kept doing cocaine more and more. I had so much of it. I was not getting dumber; I would get my stuff done while I was 'zooked out'. It really wasn't having many negative effects. I would do about 0.25g to 0.5g two or three times a day. It was great. Then one night, I sold an oz to my biggest customer. She was a 30 year-old who was very rich, and trying to lose weight. </p><p>When I first started to sell to her she was 300lbs, by this time she was 190lbs. She hardly ate and would mix the cocaine with Glass (in my opinion the most dangerous of drugs). She was a very nasty woman, alone, and would always try to get me to lay her. I hated this, her actions were demeaning me but the money was well worth it. She asked I would do some of the cocaine I had sold her with her. I said I couldn't afford it and she said it would be on her. So we went to town, in the coarse of about and hour and a half, I had done an eight-ball worth of cocaine(3.5g). This is enough to kill almost anyone and the most I had ever done by far. </p><p>I went home, did all my homework, cleaned my room, and got an empty nasal spray container to put water in so everything in my nose would dissolve. At about three in the morning I had nothing else to do, no coke, no cleaning, nothing. So I got in an argument with myself.  Very interesting, my heart felt like it was going to explode, I needed sleep, Instead of the normal 45 min high, I was going on 2 hours. I convinced myself to lay on my bed, when I blinked, It was morning and time for me to go to school. I was still partially high; it was not until third hour when I finally slept until the end of the day. I realized that I had gone too far, so I stopped. Just like that. I didn't feel right for a few days but I held myself back, even while still selling. </p><p>I only sold for a short time after that and then felt like I had done enough. I had made $4000 in a little over 3 months. I would get the random nosebleeds, for a short time after taking the drug I would feign for it. However, control was key, and thats what I had. I personally think that THC is much worse. </p><p>I will say that out of all of the drugs I've done: THC, Cocaine, Shrooms, LSD (unintentionally), Opium, and alcohol. Alcohol is still my favorite; also it seems to be the least damaging. I have had what I have considered a happy ending.</p>"
}
