{
 "title": "Mind's Eye Implosion",
 "author": "Brokenstoner",
 "citation": "   Brokenstoner. \"Mind's Eye Implosion: experience with DXM (ID 409)\". Erowid.org. Jun 29, 2000. erowid.org/exp/409",
 "substance": "DXM",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "12 ",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2000",
   "409",
   "Male",
   " ",
   "Not Given",
   "Jun 29, 2000",
   "5645",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWhen I was a more experimental youth I usd to get high off cough syrup, but I stopped after the fifth trip, the trip described in the following report. It was the highest I have ever been in my life. </p><p>My friend G and I were hiking through Tilden on an effort to get high. We had only the shakiest of the schwag, so we had to look to other options if we wanted to cop a decent buzz. I happened to choose cough syrup, while G chose budweiser. The form I took the DXM in was easier to swallow than syrup: these little red pills called Drixoral Cough Pills or something like that, each containing about 50 -100mg of DXM. I chased about a dozen of these little suckers with budweiser, which my stomach quickly expelled, but not before I had absorbed a fair amount of the drug.</p><p>Before I came up completely my friend had decided we leave the wilderness (I recall laying down and complaining of sleepiness) and travel to our buddy M's house. Along the way I lost my stomach, but this made me feel alot better. By the time we got to my friends house, the initial confusion of the trip was giving way to true psychedelic experience.</p><p>Before I had felt extremmely dizzy and tired, but after puking the dizziness left me feeling light headed and somehow disconnected from my body. Walking felt more like swimming, and images of rooms and people flowed past me as if i were stationary. Soon my visual field broke down completely. This lasted for an infinite stretch of time. My friends tell me I sat in a chair without really moving for hours on end, staring at blank space without aknowledging anyone or even accepting a joint as it was handed to me (I do remember accepting a hit one, right before my catatonia hit ...).</p><p>What I experienced was the most amazing visual hallucination I can recall. My minds eye was completely open, and I thought I could view all angles at once. The best analogy would be that normal vision is a 20 inch television, but the mind's eye on DXM is an Imax theater. The boundaries of my vision were gone, and I could focus on everything simultaneously. The lands I visited were infinite and varied, but I forgot most the details. One world was an outer space landscape filled with creatures and objects that were constantly in states of trasmutation. I stayed here fir what felt like eons, before the vision gave way to a Dante's Inferno-esque landscape. The ground was rocky and barren, but the horizon was a sheet of pure hellfire. Within the flames burned the images of the band Metallica (in the real world my friends were blasting 'and Justice'). </p><p>I believe that my spirit had left my body during these experiences, and I actually adventure within some of the realms that exist between the perceptual universe. This experience was incredably exhilirating, and I believe that with further trips soem tangible wisdom can be gained therein. However the drug method of spiritual travel left my body fatigued and my mind weary. My spirit eventually took back my physical body, at which point my eyes snapped open. Of this world I saw only two enormously wrinkled snakes, made out of cotton. They were floating in front of me, then on top of me, then they landed at my waist and formed my legs. I realized that now I could walk, and in an effort to prove it I promptly fell out of the chair that had housed my body while my mind flew between worlds. My friends looked up at me as startled as you might expect an embalmer to feel as if his cleint's rose from their slabs suddenly. It was the first indication of intelligent life I had made in  hours, and I lay strewn across the rug like a bearskin rug. To make a long story short, some beer and pot greatly improved my condition, and in no time I was blathering about my experience to a deaf audience. They had never heard of cough syrup trips, and I think that after my experience, they will never try it themselves. Too bad for them; James Hetfield plays incredibly well as a fifty foot wall of flame.</p>"
}
