{
 "title": "Moderation is the Key",
 "author": "Ginger G",
 "citation": "Citation:   Ginger G. \"Moderation is the Key: experience with Ecstasy, Cocaine & Cannabis (ID 4090)\". Erowid.org. Oct 31, 2001. erowid.org/exp/4090",
 "substance": "Ecstasy, Cocaine & Cannabis",
 "bodyweight": "58 kg",
 "header": [],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 4090",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 31, 2001",
   "Views: 16090",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHaving lived a sheltered life for all of my teenage years and early twenties, I never touched any form of drugs.  I had a very strict mother whose parents had been alcoholics, so drinking anything other than a glass or two of anything was looked down upon.  Smoking cigarettes was another no-no.  I remember being at a school disco (Catholic girls school) at the age of 15 and being caught smoking by mother who slapped my face in front of all my friends.  So, reader, i'm sure you can imagine how an individual like her would feel about her daughter taking drugs.\r\nAt age 21 I first tried marijuana with my first boyfriend.  I was very drunk at the time and smoked a joint with him.  Consequently I spent the rest of the night throwing up and lying at the bottom of a shower.  From that point onwards I smoked pot two or three times over the next few years and never thought much of any sort of drug use as I was more interested in my career.  I was also terrified of my mother, the fear of her finding out that I had even smoked pot was enough to make me never touch anything else.  \r\nLet me also add that having grown up in an environment where I was sheltered by my mother from 'all things bad', I was also controlled in every facet of my life by her.  I did everything that I was told to do.  I left home at the age of 24 after I did the 'right' thing by her and got married to an equally controlling man and found myself in the role of having to be the perfect wife, partner (we had a business together) and of course, the perfect daughter.  It was last year around my 28th birthday that I left my husband after spending nearly eight years of my life with him.  It was at that point that I started challenging my mother's authority and control over me.  I could no longer cope with the relationship I had with her, the impending divorce from my husband, the lack of freedom and the total lack of control of myself and my body.  I had lost myself.\r\nSo I decided to leave the city of my birth and home for all my 28 years.  Six months ago I moved to a new city, and found myself in a new relationship soon after arriving with a man my age.  He was a regular recreational drug user (ecstasy, speed, acid and coke) and smoked pot nearly every day.  He and friends were all very heavy drinkers too, an average evening at the pub meant around eight to ten or more standard drinks.  Feeling depressed, alienated and lonely I happily let myself be drawn into this man's life.  He gave me everything I craved which was attention, company and sex, three things that I had lacking in my life to that point.  I had in the weeks leading up to meeting this man doing things that my mother would never have approved of in a reaction to her: casual sex, alcohol abuse, smoking cigarettes, taking risks.  I was drinking myself into a state where I was so intoxicated I would wake up on the floor of my bathroom in a pool of vomit, not even remembering how i'd gotten home.\r\nI found myself smoking pot with him regularly, and to be perfectly honest, I really didn't like it all that much.  Sure it made me relax, giggle, sleepy, made food taste better etc, but I also found it made me lazy and unmotivated.  One of the main reasons I had moved interstate was to relaunch my career, and I found myself losing interest in that.  I wasn't overly happy in my relationship with my new boyfriend.  I found him lazy, too laid back, he had no responsibility and he was also controlling.  So when he suggested taking ecstasy together at an upcoming dance party, I agreed because I didn't want to say no to him.\r\nSo I took ecstasy at the dance party about two months ago.  I also found myself  taking it because I knew my mother wouldn't approve.  I took half a pill (a white Euro dollar) at 8pm.  I didn't feel the onset at first because I didn't know what to expect, but I started to feel more alert and 'felt' the music more.  I have always loved dancing, but that night I literally started bouncing off the walls.  The happiness was overwhelming.  Everyone I saw that I knew I wanted to hug.  I wanted more so I took another half at 9:30pm.  My boyfriend, however withdrew into his own headspace and hardly said a word to me.  I just wanted to dance and talk, all he wanted to do was sit and smoke and say nothing.  I couldn't get enough of the feeling I was experiencing so I asked for another half and took it at 11pm.  \r\nThere was a fireworks display which was the most incredible thing i'd ever seen.  The colours and lights were so beautiful.  Apparently the pills we'd had were speedy so I couldn't sit down.  I just jumped and danced around and walked from where the dance party was to a club in town in record time.  I was flying I was walking so fast we overtook everybody.  We got to a club at about 1am and he started to talk to me.  He wasn't making much sense and I just wanted to dance.  I danced until 4am when I started to feel tired, we walked around the city and got back to my apartment at about 5:30am.  My body was exhausted but my head was racing, I couldn't close my eyes, my pupils were still dilated.  I took a shower and felt a little better.  He wanted me to talk to him and I talked until 8am, even while we were having sex.  But at about 8am he turned into an asshole and I started to freak out.  I couldn't close my eyes, when I tried to they sprang open again.  I forced them closed by holding them down and I saw things: fireworks, neon type things, monsters coming at me.  It was awful and it was as if he didn't understand and didn't want to know.  He didn't want to talk, just sleep.  I felt so alone and isolated in my come down and as I hadn't experienced it before I didn't understand what was happening.\r\nIt was the following hours and few days after that I experienced a mental anguish that was almost indescribable.  The next day again he wouldn't speak to me.  I felt depression like never before because I knew that he was rejecting me.  I have always been intuitive and have trusted my gut feelings, even though I have chosen many times not to listen to them (nearly always to my detriment).  It was as though the drug had heightened my intuition.  I knew that our relationship wasn't very stable and that our breakup was imminent, but what was disturbing was that I knew how and why we would break up.  I didn't want him around me, but he wouldn't go home.  To keep myself occupied I  did all the house work, and as I was still speeding I did it in record time.  I couldn't sit still, I had to keep moving.  \r\nHe stayed the night and I woke up in the morning hardly able to move.  Every muscle in my body was in agonising pain.  I had not slept that night at all.  It was as though my ears were tuned into every sound in the neighbourhood, I could hear everything.  I had to take four aspirins just to be able to get out of bed.  My head hurt like crazy, it felt like it was in a vice.  I drove him to work and started feeling very light headed and sick on the way home.  I can hardly remember going up the stairs to my apartment.  I lay down on my bed and started to shake.  The following eight hours I thought I was going to die.  It was like a fever I had never experienced before, I was so hot I had sweat running off me but I was cold at the same time.  I had blankets piled on top of me but i was still shaking.  It felt like insects were crawling over my body, my hair was standing on end, my skin hurt, my eyes hurt, my body hurt and I couldn't stop crying.  I took more aspirins and the pain and fever subsided a little.  M\r\ny boyfriend said he'd come over but then rang me to ask if I really needed him there, fully knowing I needed him there.  He came over and brought me a bit of food to eat which I forced down, it made me feel a bit better.  I saw him in a different light.  He wasn't the guy i'd fallen for three months ago, he was a manipulating and controlling man who had more emotional baggage and problems than he or I had cared to admit.\r\nI remember that I couldn't sleep that night again or the next.  All I had were tiny snatches of sleep which were for a few minutes at a time with very intense nightmares.  I dreamt that I was on a raft/boat thing in a town that had flooded.  I was dressed in black robes and didn't want the water to touch my clothes.  It was coming in over the sides of the raft and it was murky and dirty and had bodies, syringes and rubbish floating in it.  My body still hurt and my face looked weird.  My eyelids were droopy, one eye was smaller and the corners of my mouth were turned downwards and I had a sensation in my face that can only be described as something was pulling the muscles in my cheeks and jaw down.  What more, i couldn't stop crying, I wanted to die.  I work on a freelance basis, and thankfully didn't have any work on the monday, tuesday or wednesday.  My work involves great concentration, huge responsibility and a million things can go wrong if i'm not on the ball. I spent that thursday freaking out that I was going to fuck up the job and ruin my reputation.  Fortunately nothing went wrong and I got through the day, even though I was convinced everyone knew that I was drug fucked.\r\nFor the following two weeks I was depressed every day and night.  I cried the whole time and my world was in a fog that wouldn't lift.  I saw a therapist who has loads of experience with drugs who explained the effects of over dosing on ecstasy and the subsequent come down.  She also explained that the insights I was having about my relationship and life were for real.  I tried like crazy to make myself believe that he and I wouldn't break up.  But a month after the night I took the e, it happened.  I knew that he had unresolved issues with his ex girlfriend with whom he'd broken up two months before we met.  I was expecting him over for dinner one evening and he rang to say he was going to be late because he was with his ex 'sorting out some shit'.  I knew he wasn't going to come over and I knew what he was going to do because of the insights i had on the e and during the comedown.  The next day he rang to say he'd stayed the night there.  I told him I didn't want to see him again.\r\nI cried for hours.  I rang a friend and asked him to go out with me and help me 'forget' if even just for a few hours.  I had never experienced betrayal before and I was in agony.  That night I wiped myself out on alcohol and pot and took cocaine for the first time.  My friend had gotten us some coke cut with speed of which I did four lines.  I felt instant relief, I wasn't crying, I felt numb, I was able to talk about what had happened, I felt awake, alert, but I wasn't high.  I stayed out all night just talking to people in a night club and dancing like mad.  I got home after 6am, lay on my bed and saw the fireworks and neon things behind my closed eyelids.  That day I had to work.  I hadn't slept and started to feel very depressed and lonely again.  I went out that night again to a bar where I  met a dolly girl for a cocaine drug lord here in the city in which i live.  The drug lord whom, I was introduced to, was supposedly the city's Columbian connection and THE person to get coke from.  I had a line from him, this time pure cocaine.  It felt different, I felt a little high, but essentially it numbed me as it had the previous night.\r\nMy experience of cocaine was one that the expense (it is anything from $100-$350 a gram here depending on purity) and the prospect of addiction, was a road that I didn't want to go down.  I had wanted to numb myself from the emotional pain I was experiencing, but that was all.  I have enough confidence in myself to not need a drug to help me socialise for example.  A lot of people in my industry (a creative one) take coke because it gives them the confidence to talk to others at a party or it gives their creativity a boost.  What they don't understand is what they are feeling is not real and they are courting an insidious drug.  I believe that recreational drug use in moderation is fine, but I do not like dependency and addiction.  I like control, addicts are out of control.  However, my experience of taking cocaine helped me immensely in coping with an emotional situation in which I felt consumed.  I will not take cocaine again.\r\nThe following three weekends after that I took ecstasy again.  I was offered coke but refused.  Even though the comedown off the first experience of e was horrendous, it still held a certain fascination and I was curious to see how it would affect me in smaller doses.  The second and third time I took only a quarter of a pill.  It didn't have much effect other than taking away the sleepiness I was feeling at the time (around 4am both times) and making me more alert.  The fourth time I took it, which was the weekend before last, I took half of an orange pill with the letters HQ stamped on it.  I was in a hot night club at about 1am.  It crept up slowly and I was dancing and having a wonderful time.  I suddenly felt quite tired and thirsty so I sat down in a lounge.  I then felt as if a tidal wave had hit me.  I was not feeling particularly emotionally stable at the time as I had been feeling a bit depressed lately, and I had hoped that taking a pill would 'cheer' me up.  \r\nAs the pill hit me I felt my eyes widen and anxiety set in.  I went to my friends who were peaking and dancing wildly.  Bodies were blurring and in slow motion.  I went to the toilet and as I entered the walls were moving in on me and shifting perspective.  I sat alone on a chair feeling completely isolated and alienated from everyone else.  I had my knees pressed together and my hands clasped in my lap.  The music was getting louder and the heat was so intense I left the club.  As soon as I hit the cooler air outside I felt better.  I started to walk home at about 2:30am.  \r\nThe streets were deadly quiet, there was no wind, hardly any sound, yet I could hear things that seemed far away.  The pedestrian crossings at the traffic lights were beeping and I could hear the echos of them swirling around my head.  My footsteps were echoing in the street very loudly.  I felt again as though I was flying because I was walking so fast.  I could still hear the beeping of the traffic lights in my head and panic started to set in.  I ran through garden sprinklers and jumped in puddles and the water felt really cold.  I ran into a park and lay down on the grass staring at the clear sky.  The stars were out and as I lay staring up I saw stars appear and disappear before me.  Then the cold became too much so I ran home.  \r\nI had a shower as soon as I got home and felt better.  I live with two other people who were home at the time and I felt incredible relief at the knowledge that someone was home even though I wanted to be alone.  I didn't want to kiss and hug, I didn't want to hear the music, I just wanted to be alone.\r\nWhat I have surmised of my drug experiences of recent weeks, especially with ecstasy, is that not everyone should do it.  The state of your emotional health is dependent on how you react to it.  I heard a story recently of a guy who had broken up with his wife, so he took a pill and cried for six hours straight whilst he was e-ing.  I myself would prefer to stay off any drugs in the immediate future, however I do plan to take ecstasy again though on rare occasions, such as a special rave or dance party, and only if I haven't been depressed, and if I know the pill has come from a good source and is mainly MDMA.  I do not regret any of it and have found the experiences interesting and thought provoking.  I am very adamant that I will not try any other drugs.  I have no room in my life for drug addiction.  If I never smoke pot again I wouldn't care less.  Ecstasy holds a huge fascination with me and I look forward to an experience where I am on something clean, have good friends around me and good music to get off on.  What I like about E is that I can still be mself and remember the experience in its entirety.  I will not do more than half a pill at a time, and I will probably only do it a few more times and not bother again.  I know people who do four to six pills in a night and I believe they are asking for trouble with the quantity and the quality they consume in one time as they usually don't know the source and have no idea of the content.\r\nThe only advice that I would give to a first time user is take it slowly.  Start with a quarter and don't do more than half a pill.  Do not take ecstasy if you are depressed or insecure at the time.  Take it with good friends who will look after you and are experienced.  Make sure you eat well before you take it and don't drink any alcohol.  Drink loads of water, but not too much.  Have a shower as you're starting to come down, it is very soothing.  The day after make sure you continue to drink plenty of water to help clean your body and eat good healthy food, even if you don't feel like it.  I have also found that taking St Johns Wort, or Hypericum as it is also known is good.  It is a herbal anti-depressant.  \r\nThe therapist I saw said that during the come down, which she says whether you realise it or not, is in fact up to eight days, even if you feel good.  She said that it is very important to eat pasta and potatoes as there is something in them which assists in the seratonin production.  And make sure if you are feeling depressed that you talk to your friends, it will help you cope.  Remember that what you are feeling is drug induced and will go away.  So my friends, in conclusion, play safe, have fun and don't get addicted to any shit.  Life is what you make of it, and it can be pretty damn fantastic and you don't need to be drug fucked all the time to enjoy it.  Moderation is the key.\n\n\n"
}