{
 "title": "It Is Going to Be a Good Day",
 "author": "Jammersmurf",
 "citation": "   Jammersmurf. \"It Is Going to Be a Good Day: experience with Smarts - Phenibut (ID 40929)\". Erowid.org. Jun 19, 2006. erowid.org/exp/40929",
 "substance": "Smarts - Phenibut",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Smarts - Phenibut",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40929",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2006",
   "Views: 40823",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSynthetic GABA I think is what this is.  That's at least what I tell my friends when they ask what the new cap that I'm taking is and phenibut sounds like a goofy joke.  I've been taking phenibut for about a month now on and off, mostly because I like trying new substances and seeing how they affect my consciousness.  I've never heard of phenibut in the drug circles that I run with, it's legal as a supplement I'm pretty sure, has a good amount of evidentiary experiences in Russia as a sleep aid and anti-anxiety drug and although it doesn't feel like a benzo exactly, I would have to say I like it better than most of the benzo's I tried.  \r\nI took two grams this morning.  I cap them myself.  I woke up in a hotel -- been traveling for work and invited my girlfriend to stay with me for a week, so we've been staying up late and playing every night.  Dragging myself out of bed is hard, late nights combined with substance use (non-phenibut) always makes 6:45am suck hard.  I'm not a caffeine user, so normally Im groggy for about 45 minutes before Im functional, and then, normally, if I've had as little sleep as I've been going on lately, I can't wait for the end of the day so I can go home and pass out.  Since starting the phenibut this has changed.  \r\nAfter about 25 minutes from taking it, I feel good.  Not adulterated good, but just like, 'this is going to be a good day, I feel positive and that I'm going to be able to function well today.'  Today is the same.  I got out of bed and sat on the corner of the bed for a minute holding my head and trying to talk myself into being ready for my day.  I then got up and took the phenibut and got dressed and drove to work.  I was at work about 15 minutes after getting out of bed, so I'm still groggy at that point.  I'm starting to notice the phenibut as others arrive and I ask them how they're doing and notice that I actually care.... normally without sleep I kinda hide away and don't engage people because I just feel all around icky.  \r\nI would say it's sublime. I like it.\n\n\n"
}
