{
 "title": "In This Respect, Descartes was Right",
 "author": "Droog",
 "citation": "   Droog. \"In This Respect, Descartes was Right: experience with Salvia divinorum (tincture) (ID 40934)\". Erowid.org. Apr 18, 2007. erowid.org/exp/40934",
 "substance": "Salvia divinorum (tincture)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "sublingual",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "40934",
   "Male",
   " ",
   "Not Given",
   "Apr 18, 2007",
   "4460",
   " "
  ]
 ],
 "report": "<p>The following report was written briefly after the peak of the experience.  To honestly, openly and accurately report the effects, including the emotional valence, I have not modified the writing (e.g. grammar, syntax), with the exception of words in parentheses (solely for details). The peak of the experience lasted approximately 20 min.  The entheogen was taken with a close friend (who also imbibed the same dose) in a comfortable environment.  No other chemicals were physiologically active (ingested) during the Salvia experience.</p><p>'On Salvia, 10 minutes of rest in my mouth (sublingual), Salvia volume increasing, mouth sensitivity heightened, the pull of Salvia anthropomorphic, she pull me in.  I began to feel the energy, the external energy rush through me from right to left.  The energy danced with the rhythms of the music playing (electronic/dance).  The energy became tangible in my blood (i.e. my body was not a barrier to it, rather submissive or subject to it) and to my (voluntary) muscles set free from my (mind's) control and tension.  I was pulled into the wave of energy and my arms followed.  They danced with the energy, with Salvia, but without me.  'I' stayed back and watched (I wasn't controlling/dictating my body's movements).  My body had become one with the music, and it with Salvia and Salvia back to me.  I was in its flow, 'I' watched keen, aware, as my arms danced.  It made me smile so wonderfully as I realized (with clear consciousness) my body was, at least partially, separated from my mind! </p><p>Then (the ability to consolidate new, detailed, declarative) memory was shattered, My eyes closed and I began to see visions.  They were 'physically' real.  I was in another world.  I am with all sincerity and 'physiological' honesty saying this.  I was inside a dream. Pictures appeared, then disappeared, present then gone. This is how I knew, cognitively, as my body Godfully felt suspended, that I was in a dream.  No (detailed) memories formed as I can't recall any of the pictures I 'saw.'  But I do remember thinking they represented deep rooted aspects of our lives we rarely consider (the unconscious?).  Alive and well is the spirit... alive and well.  Keep dancing.'</p><p>After the effects subsided, I was very tired, and my emotions were balanced.  Beyond a willingness to share the Salvia experience with mindful friends who are naive to it and freely wish to experience it with a person who has some knowledge of its effects, I have no desire to ingest Salvia again.  I feel it has no addictive properties, psychological and/or physiological.  I think Salvia is another tool to connect with the unconscious, yet I believe other entheogens are much more effective (better clarity and memory, and therefore more psychotherapeutic potential).  Finally, from my experience, Salvia is certainly a dissociative entheogen.</p>"
}
