{
 "title": "Kickback",
 "author": "Jascon",
 "citation": "   Jascon. \"Kickback: experience with Trazodone (Desyrel) (ID 40949)\". Erowid.org. Nov 14, 2006. erowid.org/exp/40949",
 "substance": "Trazodone (Desyrel)",
 "bodyweight": "167 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "Pharms - Trazodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1998",
   "40949",
   "Male",
   " ",
   "Not Given",
   "Nov 14, 2006",
   "42899",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Due to the lethargic side effects of amitrypyline, I had switched to trazodone for mild depression and sleep problems. I started trazodone at 25mg to avoid any personal side effects such as priapism (which never occurred). I worked up to 250mg per day in divided doses. One day I did not take my morning and noon doses because I had to be very alert on a daytime work project. So, I took all 250mg around 7 PM before dinner (200 to 400mg in daily divided doses is a prescribed patient dose for depression problems - which eventually can all be taken at bed time to avoid sleepiness during the daytime). </p><p>Within 45 minutes after dinner I began to feel like something unusual was happening inside my head - a combination of heavy dizziness and euphoria. That only lasted about 2 minutes when the feeling went heavily negative with the sensation that I was about to die. I immediately lay down for about one hour  + before it all went away. The negative sensations included fast heartbeat, heavy breathing, heavy head feeling, slight vertigo, mild nausea and almost no ability to function. If I remained standing I would have fallen to the floor. I knew then that the taking of the whole 250mg on an empty stomach before dinner was a grave mistake for me.  I have never before had such a severe reaction to any medication taken for anything. </p><p>After this experience I went back to amitryptyline after trying trazodone for a period of time in smaller divided doses. Generally, trazodone helped in falling to sleep but, had other strange side effects. One worst effect was coughing in my sleep which eventually caused a sore chest upon awakening. </p><p>Dreams were good and bad but, strangely remembered. I rarely if ever have been able to remember details of a dream. But, with taking trazodone, I could tell everything from beginning to end experienced in a dream. As anyone knows, dreams can be very strange, surreal, obnoxious, weird, complicated and at times totally unimaginable in any sort of reality. For example: flying on a pizza as if it were a magic rug and eating the pizza at the same time ( come to think of it I do remember some early Woody Allen movies where similar things were depicted ).</p><p>As another commentator had mentioned, the morning after taking of trazodone was not comfortable with a negative dragged-out sensation. With me the morning sensation was the opposite - I felt better except for the sore chest if I had coughed in my sleep. There were no bad sexual side effects such as those described with most antidepressants. However, any antidepressant effect I dont remember as I never took much more trazodone after this bad experience.</p>"
}
