{
 "title": "A Little Experiment: Exploring",
 "author": "Gonzo",
 "citation": "   Gonzo. \"A Little Experiment: Exploring: experience with Cocaine (ID 40989)\". Erowid.org. May 16, 2007. erowid.org/exp/40989",
 "substance": "Cocaine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 40989",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 16, 2007",
   "Views: 14958",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBOTTOM LINE: Cocaine was worth doing once for the experience (fun) and to understand the fascination out culture has with the drug. However it is not something I would ever do on a regular basis as it is too expensive. I would also not recommend coke to anyone that has alcoholism in the family or has an addictive personality. Better safe than sorry.\r\nA bit of background on myself; I am an intelligent young male at a good university who has always been interested in experiancing things for myself and finding out the reality behind the hype and lies surrounding various drugs. I have smoked and eaten weed, done various pharmaceutical drugs (both snorted and orally), and enjoy the occasional mushroom trip. I should also mention that I do not have addictive tendency, as evidenced by my abilty to stop smoking cigarettes without experiencing any cravings.\r\nThis year while I was at school I decided I would partake in cocaine in an effort to understand the hype and fears surrounding this drug. I obtained a gram of coke from a friend for $50, intending to experiment with various doses while under supervision of another friend. Upon opening the small baggie that I had I examined the irridescnt white chunks amidst the small pile of powder, which, when smelled reminded me of the odour of a crushed plant leaf. I layed out a little less than a quarter of the cocaine in 2 lines, hoping that I was doing it right as my only experiances with the drug consisted of watching blow, scarface, and glimpsing it at parties that I had attended. I blew my nose a few times to get rid of excess mucus, chopped up the coke with a cedit card until it was as fine a powder as possible which took around 5 min and then snorted the drug. I was pleasently surprised to find that it did not burn or sting, though my nostril did almost immediatly start to feel stuffy and in a few second began to get runny. I followed the dose in my nose with a 'gummer' using the dust left over on my dust as a topical numbing agent on my gums.\r\nThe first effect I felt from the snort was a numbing of my throat from the bitter drip that formed in the back of my mouth. This made it slightly difficult to swallow. Next I felt a slight sense of euphoria accompanied by the numbing of my front teeth and gums. I also felt an increase in energy. Negative effects included the diffulty in swallowing as well as annoying compulsion to swallow nothing and then burp the air back up, I had to concentrate very hard in order to stop this. As the energy rush wore off I felt slightly nauseous. I did not notice an dramatic change in the size of my pupils.\r\nLater in the day I realized that I had not eaten all day though I did feel hungry at all, so coke clearly had a dampening impact on my appetite. I also felt dehydration later in the day, though I would feel full after drinking only a small amount of water. I believe that I did not experience the full effects of the drug becuase I had not taken a large dose. In fact, a I felt more negative effects than positive ones. I resolved to try a slightly larger dose next time.\r\nThe next day I was feeling bored and to be honest I did feel a small craving to try coke again. This time around I did three lines, which I guessed to be about a third of a gram. I did the lines quickly, following the same procedure as before. This time I noticed a larger rush of energy accompanied by a light headed feeling and a feeling of impatience. I also noticed an increase in the speed of my speech other than this I felt the same effects, both good and bad as the previous day. I decided to take a few days off and then to do a larger done, something in the order of a half a gram, or about 5 lines. I did notice, as another wirter put it, a small voice in my head which seemed to say, 'You dont have anything else to do, why dont you do a few more lines,' this other writer also said it well that when he noticed this voice, the desire to do more faded.\r\nI am writing this report on a sunday after I completed my homework for the week two days after my last snort. I've decided to write this report as I do the lines in order to make my writing more accurate and informative. In last few days I had done some more gummers, as I found it very interesting the way my gums, teeth and lips got very numb after a very small amount of cocaine was applied. I would also like to mention that the taste of cocaine was bitter and not very pleasant, tasting like a plant leaf. I decided that this time I would do a more smaller lines instead of fewer larger lines in an effort to decrease the amount of drip I got in the back of my throat, as this was one of the more unpleasant effects. I started off with 4 small lines, waited a bit then did two more before I started feeling the effects of the first ones.\r\nThis time around I felt the largest amount of light headedness, euphoria, increased respiration, uncontrollable, and swallowing and burping. This time around I felt the numbing in my mouth without the application of coke, especially in my two front teeth which happen to be mostly fake. After about 15 minutes in which I began this report my buzz was going stong as well as the runny snot from my nose and I began to feel twitcing in my hand accompanied by tingling in my forearms similar to the feeling of them being asleep. During this time I was sipping on water in attempt to reduce the feeling of dehydration as well as the swallowing thing. I have also been occasionally been checking my pupils in the mirror but have not noticed any significant dialation. \r\nThe euphoria seems to kick in about 3 min after snort and lasts around 10 to 15 minutes before slowely dieing off. The increased energy lasts longer, around an hour with the smaller doses and I assume that it will last a it longer this time. I think I will make a real day of this and do the last three or so lines that I have left all at once. So, a quick break, while listening to Ayo For Yayo by Andre Nickatina and then I'll get down to summarizing the report for those too busy to read my writing. \r\nEnding note- finshed the coke, my nose is running ike crazy, I chose to only use my right nostril. I'm a little jumpy but happy and full of energy. I've finished my coke, it was a positive experience and I might do it again, though I'll definatly save it for special occasions. I also felt a slight loss of balance when I got up to check my pupils which look normal.\r\nSUMMARY OF EXPERIENCE (+=positive effect, -=negative effect, --= least fav effect, ++=fav effect, no sign= neutral effect)\r\nFIRST DOSE - approx .15 grams at one time\r\nIncreased respiration and pulse.\r\n--uncontrollable swallowing and burping.\r\n+increased energy\r\n++rush of euphoria\r\n-nausea\r\n+felt a bit like a strong Adderall high\r\n+felt a light body high along with light headedness, like the beggining of a mushroom body high.\r\n+numb gums\r\n-decrease in appetite\r\n-seemed to get full very quickly when I was drinking water about an hour after snorting\r\n-strong feeling of dehydration\r\nSECOND DOSE - approx .25 grams at one time\r\nsame effects minus the nausea but slightly stronger\r\nincreased speed of speech- harder to talk to sober peaople but not a big deal\r\n+numbs gums and front teeth, and inside of nose used to snort\r\nTHIRD DOSE -  Approx .6 grams over 30 - 40 min (lines every 5min)\r\nsome effects as second trial (no nausea) but much stronger and magnified with each line snorted.\r\n+twitchy finger\r\n++tingling arms and legs\r\n+numb gums, all of front 8 teeth, front of tongue, and roof of mouth\r\n+seems that im hungry this time so maybe that lack of hunger was from something else\r\n+loss of balance, weaved when i stood up to look in the mirror\r\nno effect on pupils\r\nDedicated to Hunter S. Thompson\n\n\n"
}
