{
 "title": "An Ally For Meditation",
 "author": "GreenLeaf",
 "citation": "   GreenLeaf. \"An Ally For Meditation: experience with Salvia divinorum (ID 4100)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4100",
 "substance": "Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4100",
   "Male",
   " ",
   "Not Given",
   "Dec 25, 2001",
   "Views: 18941",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI would like to convey my overall impressions of using Salvia Divinorum as an aid in meditation.</p><p>My ideal setting is in a darkened calm environment, sitting cross legged or reclining in a chair.</p><p>My preferred method is to drip some salvia tincture onto salvia 5x extract, and wait for the plant to be almost dry, still just a bit humid. I then load a smoking pipe with it, and bring the lighter  close enough to burn off the humidity and light some of the plant. This is the first toke, and it is just a wisp of smoke. I may stop there... if I do second or third inhalations, they are deeper, more thorough torchings of the plant material.</p><p>The state that usually envelops me is a calm mentholated tingling that seems to cloak my body with a downward pressure or heaviness. I find that taking an enriched 5x extract as opposed to a 10x extract gives the experience a pleasant light feel, something that I am more likely to be able to understand and flow with. I sometimes feel that  doing deep breathing will allow me to absorb and be more powerfully saturated by the mentholated energy. Occasionally, I have felt like the Salvia plant was showing me how to manipulate the shape of my spirit body: in one experience I may sense myself rolling up like a Persian carpet, during another my being may seem to unfold outwards like a wing.</p><p>I call this meditation, because my focus is directed in a way that reminds me of the one pointed consciousness of certain practices, and because I often stay still in a meditative altered state well beyond the initial effects have faded. It also feels reverential and spiritual, but not in a dogmatic or heavy way. Approaching the Salvia respectfully yet lightheartedly, using small doses, seems to be the most fruitful method for me.</p>"
}
