{
 "title": "A Successful Combination",
 "author": "Zero Contrast",
 "citation": "   Zero Contrast. \"A Successful Combination: experience with Venlafaxine (Effexor) & Mirtazapine (Remeron) (ID 41030)\". Erowid.org. Aug 12, 2005. erowid.org/exp/41030",
 "substance": "Venlafaxine (Effexor) & Mirtazapine (Remeron)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   " ",
   "30 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 41030",
   "Male",
   " ",
   "Not Given",
   "Aug 12, 2005",
   "Views: 27045",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I suffered from depression for several years (before I even knew it was depression that I was feeling). When I heard about what depression really was I figured that must be what was wrong with me. So I told my mom about how I was feeling and she took me to get evaluated.</p><p>I was diagnosed with a typical case of massive depression, and I also suffered from insomnia. I was prescribed with Remeron, which is an antidepressant that serves also as a sleep aid (thus it should be taken at nighttime about an hour before you want to go to bed). I was also prescribed Effexor, which is another antidepressant that can help you feel more energetic (thus by itself it can cause insomnia). This effect is most likely caused by its mild effect on dopamine, which aside from its role in depression is also the chemical that cocaine works on to cause its effects (hence the mild stimulation).</p><p>The Remeron immediately helped me sleep better (causing lethargy actually for the first few days, I fell asleep at school a good bit in the first week of treatment). It's essential to take it fairly early at night (7:00 to 8:30 if you take 30 mg, possibly later if you have a lower dose) that way you won't be tired the next day.</p><p>After the lethargic effects of the Remeron subsided, I began feeling quite energetic. I had already begun feeling better soon after beginning treatment. For the first few weeks of treatment I was lightheaded and out of it a little, though I found the feeling to be quite enjoyable especially after being depressed for so long. </p><p>The only noticeable side effects from Effexor were dry mouth and trouble reaching orgasm, which took some months of gradual lessening to go away completely, though this wasnt completely a bad thing. The main side effects from Remeron were the initial drowsiness, adding to the dry mouth (I often carried a bottle of water around), and extreme appetite right after dosage (comparable to the munchies and usually the more I ate, the harder I slept and vice versa).</p><p>I no longer take Effexor currently, though several times during treatment I would stop taking it for short periods for various reasons. I had some mild withdrawal symptoms whenever I did so. I would feel the same lightheadedness and some dizziness (which was quite enjoyable actually). It's possible that my withdrawal symptoms were mild due to still taking Remeron or possibly just due to my personal body chemistry.</p><p>Now, I realize, of course, some individuals have negative reactions to particular medications, but I believe that in general Effexor is a very effective antidepressant, especially in combination with Remeron, which will counter some of the side effects of Effexor like insomnia and the lack of appetite (Remeron can increase overall appetite).</p>"
}
