{
 "title": "Valuable Lesson",
 "author": "Particle16",
 "citation": "   Particle16. \"Valuable Lesson: experience with DMT (ID 41040)\". Erowid.org. May 3, 2007. erowid.org/exp/41040",
 "substance": "DMT",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41040",
   "Male",
   " ",
   "Not Given",
   "May 3, 2007",
   "Views: 3416",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Preparing for a night out, I had a small bunch of hashish around 4 hours before my next DMT experience. This left me a bit confused, and made me wonder why I bother with marijuana in the first place, it didn't seem to add any value to any experiences. Back at my friends place, we prepared a comfortable spot in the backyard, and as he left to go inside I emptied out my pockets. I felt tired and had a light throb in my head, and deep down probably still felt some effect of the Hashish in my body. </p><p>I lit up, and became annoyed as my sound was not dissapearing, and I was tempted to cough several times and blew out my nose. I was convinced I had stuffed it up, and was filled with a bit of negative energy as suddenly I noticed the clarity of the flame and the plants around me, and once again attempted to relax. By the time I was putting the bong down, I had little control of my body which felt quite sluggish. I leaned back and was transported into a strange colourful sphere, it felt like a night club of some sorts, deep underground and with very intense colours and sounds. </p><p>Soon I was confronted by people, at first colourful and mystical, but quite quickly they merged into stereo-typical cartoony club references, who looked friendly enough but confused me. I felt like I was down below them, probably sitting on the ground at the club, while they stood around me and marvelled at me. They were talking to me quickly, and it felt like I was being re-assured.. but an overarching feeling of 'well its nice you're here, but you're not prepared this time', I tried to convince them that I am, but they looked at me puzzled, and slowly I could feel a wave of coolness and clarity move over my head. It felt like the headache, tiredness and stoned feeling was being removed across my head and as it dissapeared they smiled and walked away.</p><p>I was puzzled further until great metallic shapes appeared before me and melted into each other endlessly. I was in awe at their beauty and as always with DMT, felt as if the lights and colours were actually over me and inside me, rather than right in front of me as I feel on mushrooms. Eventually the colours dissipated but the clear feeling and sharpness remained.</p><p>An enjoyable experience but I felt that I wasnt prepared for the experience and had forced it upon myself. A valuable lesson.</p>"
}
