{
 "title": "The Mushies The Door and the Rabbit Hole",
 "author": "Matt",
 "citation": "   Matt. \"The Mushies The Door and the Rabbit Hole: experience with Mushrooms & Cannabis (ID 41045)\". Erowid.org. May 26, 2007. erowid.org/exp/41045",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "5 caps",
   "oral",
   "Mushrooms",
   "(plant material)",
   " ",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41045",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 26, 2007",
   "Views: 2999",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first experience with psechedelic mushrooms. However I have had a couple of run ins with LSD in the past, so I thought I knew what to expect, but I was wrong.</p><p>So I snuck out to an freind's house, let's call him D, who with my help in acquiring the sufficient funds had purchased 25$ worth of mushrooms, a little over an eighth. I had just come down from the pot we had hit earlier and had just taken another couple of hits. I ingested the psychedelic delicacies at 11:22 pm orally holding the mush my mouth for about 5 minutes, honestly I didn't mind the taste too much. After I had swallowed the mushrooms I grew impatient and got up for a cup of tea.</p><p>While boiling the tea I began to feel ill and really giggly. This was about 15 minutes after ingestion so I quickly fixed the tea (non-caffinated chamomile tea for the record) and back to his room where everyone over at the time was playing ps2. About five minutes later I finished the tea and the nausea had subsided and was experiencing the strangest body high. It was like an orgasm shooting out from my body and covering my entire body. I got a bit disoriented but was not really hallucinating so I began to feel dissapointed.</p><p>About ten minutes later I found myself mindlessly staring at the ceiling which was rolling like the ocean and the walls began to move in and out. Then everyone decided it was a good idea to go out into the woods and smoke some more pot. So I left first still in control physically and mentally. But before we reached our smoking spot I noticed where the ground was moving in and out and saw shapes in the grass and where I looked ahead my destination seemed to be creeping further from me. Next thing I noticed were 'snaking lines' moving like a kaleidoscope when I opened and closed my eyes.</p><p>So before it was my turn to hit the pipe I was looking around at the scenery and noticed the shadows of the brush moving from where they should be and all my feild of vision was rolling giving me the illusion that things were closer than further than in reality. D was changing colors and we his brother Dy was freaking out like he had too much caffeine. D was changing colors and we were all talking about what we were seeing and feeling. So I thus decided it was not a good idea to smoke more pot. we stayed out there sitting and shrooming for about ten more minutes. D and the others were talking and I was rolling aroung on the ground from the 'body orgasm'</p><p>By the time we went inside I was full on shrooming it was about 12:50. I was watching my gnome(I love gnomes) he blinked and smiled and his beard was moving with my breath like in the wind. I tried to play video games but I was too slow and lines kept popping out from nowhere in the game. So I sat on the bed as the walls began to come in on a slant and D wandered into the bathroom tripping hard style. I walked out into the hall and the bathroom door was open he was staring at the walls and I sat and stared with, by this time logic and porportion were out the window and off the property. I watched ants crawl up and down the walls and saw a little landscape in the cracks between the panels. His mom brought us some cigarrettes and I lay on the floor and this is where I started babbling.</p><p>Me- 'Isn't there supposed to be something important?' </p><p>D- 'No nothing's important.'</p><p>Me- 'No, but... isn't there supposed to be something to do while I'm alive?' I went on in my mind, but he said something like. </p><p>D- 'I don't know but our cigarettes are running low.' </p><p>Me- 'I wanna stay in here, I found the door we have to tell everyone about it.' I rambled on</p><p>D- 'No let society live their lies It's our door' or something similar. </p><p>Me-'But we can't open it until everyhone knows about it. There's allready alot of people who know. But there's alot of people who don't, like the christians, all the religions. God is in here.'</p><p>D- 'There is no god... What's past the door?'</p><p>Me- ' I don't know... But we'll see when we get there... Maybe there's someone waiting on the other side of the door? What if there's lot's of doors?' At this point I'm totally freaking out.</p><p>D- 'Just chill and trip, the door isn't important.'</p><p>Me- 'I think I know what the rabbit hole and the rabbit is. The door and the waiters, people waiting to show you what's there and to open the door.'</p><p>D- 'What will you do when you get the other side?'</p><p>Me- 'Keep going till I find another door.'</p><p>At this point he leaves and I lay on the floor and the ceiling dripped down and touched me on the nose.</p><p>I started laughing and almost crying. 'I'm telling you man, there's something in here, something I'm supposed to do. I found the door and everyone needs to know.'</p><p>We eventually left the bathroom and I returned to my gnome. At this point the snake lines were replaced by accented colors and sort of trails and strange cloudy movement. I sat in the corner of the room tripping fascinated by the changing dimensions of the corner and the millions of ants marching up and down the walls. </p><p>Then again I returned to the gnome and thought my hand was sticking to it in the strangest way like little strings attatching to me and the gnome. I kept rambling on about the same thing, the door. I think what I meant was that I've discovered mushrooms and everyone needs to do them. But also that the way I should be living life is one step at a time, and I began to regret not saying and doing alot of things especially in relationships with women folk. At 3:30 I was still tripping and coming down and everyone else was getting ready for bed by time, so I took another cigarrette and left. </p><p>I didn't get home until 4:30, and was seeing snake lines again. I wandered around for about an hour not really knowing what I was doing. I was still feeling funky, but was mentally stable. Mind you that in this state I had to sneak over to by my parents bedroom door, snag their lawn chair sneak back to my window, fit the chair between the bush and the house, open my window, and get in onto the noisest chair in the world, all without making a peepidy-peep-peep.</p><p>Great experience, I thought I would never come down, and hoped I never would. I had so much love and everyone was my brother. Not a bit unpleasant. However I think I should like to try tripping alone next time, a bit more of a sacred setting, a couple of good cigars, some incense, buddha, and my gnome.</p><p>Peace, </p><p>Matt</p>"
}
