{
 "title": "Weird Visual Disturbance",
 "author": "Ripper",
 "citation": "   Ripper. \"Weird Visual Disturbance: experience with B. caapi, Syrian Rue & Amanitas (ID 41049)\". Erowid.org. Mar 28, 2005. erowid.org/exp/41049",
 "substance": "B. caapi, Syrian Rue & Amanitas",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "Amanitas",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Banisteriopsis caapi",
   "(tea)",
   " ",
   "0.25 tsp",
   "oral",
   "Syrian Rue",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41049",
   "Male",
   " ",
   "Not Given",
   "Mar 28, 2005",
   "10275",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been experimenting with B. caapi and Syrian Rue of late.  I had the usual good feelings once I got past the taste of the tea.  One night before my daughter's karate practice, I wanted to see if adding a mushroom would enhance the feeling, it did!  I ate one large mushroom before I made some tea from 5 sticks of Caapi + 1/4 teaspoon Rue, I used hawaiian punch and microwaved the mixture of Caapi and Syrian Rue for 10 minutes. I felt great during the practice, but when I was leaving, I started having 'glitches' in time. It seemed that time was standing still.  </p><p>As I got home, I noticed my vision was switching from near to far and back and forth,  and I was seeing flame-like visions with the changes. I thought it was something like deja vu, one eye registering in short term memory and the other in long term. Then I thought it was my left eye vision registering in my right brain and vice versa, so I closed one eye and to my dismay it was still happening. What a trip! This lasted for about 2 hours then slowly went away. I was seeing geometric shapes, I stared into the light bulb, closed my eyes and focused on the orange circle in my mind, I opened my eyes and the circle was blue and moving on the wall. I will try this mixture again.</p>"
}
