{
 "title": "More Palatable Than Many Homemade Brews",
 "author": "MIM",
 "citation": "   MIM. \"More Palatable Than Many Homemade Brews: experience with Absinthe (ID 41145)\". Erowid.org. Oct 20, 2005. erowid.org/exp/41145",
 "substance": "Absinthe",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3 shots",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41145",
   "Male",
   " ",
   "Not Given",
   "Oct 20, 2005",
   "Views: 23292",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>INTRODUCTION</p><p>Ever since my first experience with absinthe nearly three years ago I have, despite in retrospect that first absinthe having been rather poorly made homemade absinthe, been very much taken with the Green Faerie.  When not at college in Vermont during the school year, I spend a reasonably good amount of time overseas, and, in my times in various countries, have encountered a number of commercially available absinthes (I would say my favorite is probably Deva Absenta, which I obtained, oddly enough, at a grocery store in Beirut, Lebanon).  During the school year, though, I have few opportunities to obtain quality commercial absinthe, and as such have experimented with a number of recipes.  The recipe which follows is one that I found to be particularly 'effective,' and, though it does not taste nearly as good as, say, Deva, it is a lot more palatable than many homemade brews I have had  more so, it can be done in virtually any dorm room:</p><p>NECESSARY INGREDIENTS</p><p>* 750 ml grain alcohol (I use Everclear, though any brand should do)</p><p>* 750 ml gin (I use Tanqueray; any brand should do, but remember youll be drinking this)</p><p>* 2 oz dried chopped wormwood</p><p>* 1 oz aniseed, crushed/powdered</p><p>OPTIONAL INGREDIENTS (DOES make a difference in flavor)</p><p>* a few star anise, whole</p><p>* 1 teaspoon mint</p><p>* 1/2 teaspoon fennel, crushed/powdered</p><p>* 1/4 teaspoon cardamom, crushed/powdered</p><p>* 1/4 teaspoon caraway, crushed/powdered</p><p>* 1/4 teaspoon coriander, crushed/powdered</p><p>NECESSARY APPARATUS</p><p>* wire mesh strainer (and coffee filters for powdered herbs)</p><p>* 3 liters worth of mason jars (make sure there are at least two, though)</p><p>* water boiler with a fully opening top (electric tea kettle)</p><p>* one large basins or bottles (capacity of 1.5 liters or more)</p><p>OPTIONAL APPARATUS (if the first two of these are excluded, skip steps 3-5)</p><p>* pasta/salad strainer or other similar item</p><p>[* the preceding two items may be replaced with a double boiler if you are fortunate enough to have your own, private kitchen]</p><p>* an aesthetic bottle of your choosing</p><p>PREPARATION</p><p>Step 1:  Steep the wormwood in the grain alcohol in the dark for about a week, shaking occasionally (personally, I find this gratifying as it leads to anticipation of the final product) in half the mason jars, filling each halfway with the mixture.</p><p>Step 2:  Three days before the wormwood is due to be strained out, add all the other herbs to the gin, and let that mixture steep in the dark for the remaining three days, also in mason jars as per the wormwood and grain alcohol.</p><p>Step 3:  Fill the water boiler with enough water to last a while, but not so much it is in danger of bubbling to the top.</p><p>Step 4:  Place strainer on top of water boiler and place as many jars as properly fit on the strainer; if you have a double boiler and kitchen, simply use this rather than the strainer/boiler combo.</p><p>Step 5:  Bring the water in the boiler to as gentle a boil as possible and allow the steam from the boiling water to heat the contents of the jar for 20 minutes **KEEP A CAREFUL EYE ON THE JAR THE WHOLE TIME**.</p><p>Step 6:  Strain contents of jar into large basin/bottle, using wire mesh/coffee filters as necessary; strain while contents are STILL HOT, but take care to protect your hands and/or other body parts, clothing, etc.</p><p>Step 7:  Repeat steps 5 and 6 as necessary, combining the two mixtures (order does not particularly matter).</p><p>Step 8:  Pour contents of large basin/bottle into the aesthetic bottle of your choosing (who knows, depending on your taste maybe this will be this initial large bottle)  attractive bottles tend to be rather smaller than 1.5 liters, so store whatever remains in large basin in the dark.</p><p>INTERMEDIATE RESULTS</p><p>* Grain alcohol in which wormwood has been steeped will turn a rich dark green color.</p><p>* Gin in which other herbs have steeped will turn brown.</p><p>END PRODUCT (assuming all optional items/steps are included)</p><p>* Volume: 1.5 liters</p><p>* Color: light brown with a greenish tinge  </p><p>* Louche: will louche nicely (this is when the product turns cloudy when water is added)</p><p>* Taste: the flavor of this absinthe is of course not up to par to the better brands, but it is better than lower-quality commercial brands, such as Pere Kermann)</p><p>* Alcohol content: 130 proof</p><p>EFFECTS OF END PRODUCT</p><p>People who say there are no secondary effects from absinthe either have not had absinthe with a high enough wormwood/thujone content or have had too high expectations (and likely have never tripped before).  The effects of all absinthes (and even of smoked wormwood resin) are quite subtle.  One is slight visual distortions (eg, brightened lights, occasionally a rippling effect if enough is consumed), though much is perceptual (eg, odd depth perception  either exaggerated or far away people/objects look small rather than 'far).  Absinthe also has a stimulating effect, as thujone works in a somewhat opposite way to that of alcohol, in terms of neurotransmitters.  (Again, this effect is subtle, and is not like amphetamine or cocaine stimulation.)  As such, thoughts become quicker and often more deep and creative but remain clear  like the creativity of a weed high without the lethargy and confusion.  Absinthe is really one of the best chemical aides to processes like writing, and, in my case at least, has considerable success in helping me overcome writers block (more effective than amphetamines, and DEFINITELY more effective than weed, which just clutters things further).  </p><p>As with any substance which has perception and cognitive altering properties, absinthe offers a window to the unconscious, and a very unique one it does.  This is very hard to describe.  </p><p>ANECDOTE</p><p>Rather than describing my own personal subjective experience, I will briefly describe the objective/behavioral symptoms exhibited by a friend of mine while intoxicated on my brew.  After having taken three shots within a roughly 45 minutes period, a friend of mine, who is known to hold his alcohol extremely well, started to lose control.  One moment he would be extremely energized and  both humorously and annoyingly  began attacking those others of us in the room with pillows.  The next moment, he would suddenly fall to the floor and lie there nearly motionless, only to return to his aggression/energy again.  He eventually, babbling incomprehensible gibberish, ran out of the room, down the stairs (I followed him to make sure he didnt hurt himself), and out into the snow without his jacket on (at this point I didnt follow him).  None of us heard from him later that night, but he turned out to be fine the next day.  Therefore</p><p>MY DOSAGE</p><p>* Maximum of 2 shots within any given hour, and no more than 4 in any given evening (I once made the mistake of taking 5 within an evening, and the perceptual distortions persisted into the next day in very slight amounts, accompanied but substantial dysphoria throughout the entire following day).  </p><p>* With even one shot most I know experience the stimulatory effects, and at two within the hour everyone I know has had a full absinthe trip.</p>"
}
