{
 "title": "Racism Conquered and Friendships Strengthened",
 "author": "Dan",
 "citation": "   Dan. \"Racism Conquered and Friendships Strengthened: experience with MDMA & LSD (ID 4115)\". Erowid.org. Feb 18, 2001. erowid.org/exp/4115",
 "substance": "MDMA & LSD",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 tablets",
   "sublingual",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:00",
   "0.5 hits",
   "sublingual",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4115",
   "Male",
   " ",
   "Not Given",
   "Feb 18, 2001",
   "Views: 9435",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have tried e twice now, and have found both experiences very rewarding and deeply moving. I wish to share both, one of which I am not too sure was real ecstasy (think so though), but may shed some light on the effects of pre-biased opinions to using ecstasy.</p><p>The first time I tried it was with my best friend at a club in Byron Bay Australia (highly recomended for those into psychedelics). I had never taken any psychoactive apart from alcohol, but had read a great deal about ecstasy, so I was eager to give it a go. Understandably, I was also quite scared about the negative effects... Would there be some sort of strange chemical in the tablet that would turn me into a vegetable or even kill me? I convinced myself that I was paranoid and simply listening to the media's distorted views on illegal drugs, so I made up my mind that I was going to try MDMA once and see what happened.</p><p>Finding a dealer wasn't hard at all. The story behind it is rather amusing actually. I was remarking on how rubbish the music was that we had listened to in the club the last night (I hated psi trance at the time). We stayed simply cause there was nothing better to do. Anyway, scribbled onto a wall was 'the car park is it', so I decided to correct the graffiti with and aptly placed 'sh' if you get my meaning. Well this guy comes round the corner and I ask him if he could read my masterpiece. Turns out he's one of the resident DJs at the club! Doh. Anyway we get talking and somehow we end up talking about e. He tells me that he's got some pretty potent stuff and we did the deal : Au$50 for a single pill! Actually my best bud paid for it, so If you're reading this dude - thanks! We split it down the middle. Later on that evening after a few rounds of tequila we stumbled off to the club laughing our heads off and in good spirits.</p><p>A few minutes later I popped the pill into my mouth and kept it under my tongue as was recommended to me by some guy in a chat room. I hardly felt anything except for a feeling of indigestion, but I was having a ball dancing. I spoke to the dealer, and he was seemingly surprised. He gave me a free blotter of acid, and told me to see him again later if nothing happened. I tore it in half and gave half to my friend who was extremely apprehensive to taking LSD. I was too drunk to care, so I popped mine under my tongue again and waited for stars and stripes. Nothing. An hour later I felt that the music was becoming very intense and the lights where really bright. I looked in the mirror in the bathroom and I had eyes the size of dinner plates. About then the effects of the alcohol where obviously fading. I stopped making a jackass of myself, but started to enjoy the music more and more. I remember sitting down next to a strobe light and staring into it's flashes. I fell into a trance like state for about half an hour I think, and was shaken awake by my friend. </p><p>We left soon after, but this is where the trip really began. We sat down next to an American backpacker surfer dude, and we just related like we where old friends. He was also Eing - heavily. I remember thinking to myself 'This is a really beautiful person, but he is hurting inside' Shaking his hand was an amazing sensation, I felt almost as if we were just projecting love and respect to each other. This must have lasted for 10 seconds, before he turned away and talked to some other people playing guitar along the road side at 4:00 am. My friend and I started talking about stuff that we'd never talked about. About how much we appreciated each other, and the frustrations of us both loosing our girlfriends recently. We really felt much better and hugged for the first time where we (or at least I) didn't feel uncomfortable with it. I felt as if something that I had needed to communicate for a while had been accomplished, and I felt so peaceful. </p><p>We headed back to the apartment, where we overheard the neighbors doing it! We cracked up, but tried to conceal it. I couldn't sleep probably because of the LSD. By the way, I highly recommend candyflipping (E and acid together), but only do a small dose of acid as the stuff can ruin your night as well as make it.</p><p>The second experience was 4 days ago at the Advent*jah (+-20000 people!) rave at the RNA show grounds in Brisbane Australia. GO TO THE NEXT ONE IF YOU CAN! I had arranged for a pill, but my buddy hadn't gotten back to me. When I got to the rave I started dancing to hard house immediately (Tidy Boys = very energetic dancing) I went totally berserk with my glowsticks, and was exhausted two hours later. My friends arrived an hour later, and we danced and chatted a bit. At around 3:30am I asked my bud if he had any extra e to sell me. He said that because he was in such a good mood that he'd share a half with me for free. It's pretty weird how I've never paid for e yet huh! It's a sign from God to Rock and Roll, well maybe just roll! The drug tasted even worse than before as it was in capsule form and the ground powder just stuck to the inside of my mouth no matter how much water I drank. Slowly I started coming up, and felt the cool morning air exhilarating to my skin. I also felt an intense excitement that I was going to have an incredible morning. And I was! I sat down and listened to Robert Miles do his thing on the turntables, and finally got up to dance when Ricemiester (a local legend!) stepped up to the booth. A few minutes later the drug was really taking effect, and I had the hugest cheesy grin on my face. I was so happy and kept smiling at everybody. I just completely ignored those that weren?t interested in being nice back, and felt like I was totally accepted by everybody there. I had this really amazing massage session with these folks from Singapore, something that I'm a little adverse to doing normally because of my stupid engrained slightly racist tendencies. I feel much more accepting of Asians even only four days later, and I will treasure that experience as a real building block to my social maturity and acceptance of others. The girl I gave a massage to showed me a tattoo in a rather erotic place, and while I was highly aroused, it was just another experience for me on e, and felt totally different to being turned on whilst off drugs. It was great though!</p><p>Well I've written allot, and there are heaps of other amazing experiences I had and great people I met on those two evenings, much of which would never have happened if where not on e. Ecstasy has in two sessions made me a much kinder, humble and loving person, now that I realize how good it is to show true compassion and love for others. I've learnt that although it's true that one has to give to receive, it is far better and more rewarding to give than to receive. Ecstasy is a tool to discovering what true love is all about as well as a hell of a lot of fun! Use it carefully and it'll serve you well, but overdo it and it'll become blase` and dull like it has for my first friend. Thanks for reading!</p>"
}
