{
 "title": "Never Ever Again",
 "author": "Fadedxrated",
 "citation": "Citation:   Fadedxrated. \"Never Ever Again: experience with Datura (ID 41157)\". Erowid.org. Aug 27, 2006. erowid.org/exp/41157",
 "substance": "Datura",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "1 cup",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41157",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2006",
   "Views: 13716",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n4 days ago friend of mine showed up to my house telling me he wanted to try making this Tea out of these white/yellow bell looking flowers, he told me the tea would make me see things, I laughed, then humored him , and boiled the flowers to make enough to fill 2 cups.  My friend was about half my body weight, or a little over.\r\nThe drink didnt taste bad at all, actually didnt need sugar or anything. We each drank our cup full, and rolled out for  while to visit friends. This was at about 2pm. By 2:30 I noticed the effects, my vision became framed, each movement was jerky, I noticed the sparkles that we moving from my peripherals to the center, I thought it was wonderful... best trip ever... then worst trip ever.\r\nI had to drop the other back at the house an hour after, not really understanding what he was going through. A bit earlier he was trying to smoke a bowl, using his thumb as the lighter, had me rollin! We were constantly asking him whats the fuck he was doing. He asked us 100x where the pipe, lighter, and weed was, each time having it right in his hand, or his lap.\r\nWe knew he was fucked up, but we were always fucked up, on Chronic, or beer, or something tame. As he was getting out of the back seat of my car he got stuck on STUPID, took him at least 5 mins to get out of the car as me and a few people outside the car laughed. At this point I had no idea that his LEGS DIDNT WORK. So I pushed off and called his sister to pick his ass up at the back of the park. They took him straight to his mother, His mother asked him what was up, and he didnt respond, a complete blank, nothing happened, no response... Straight to the E.R.   I picked his sister up another hour later, and she told me he was all fucked up, talking to people that werent there, and barely able to walk, until he eventually passed out. And was rushed to the hospital.\r\nNow MY TRIP.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] \r\nThings a still a little blurry still it has only been 4 days for me. I remember driving, but not seeing anything... Yes I drove on it... Very very very very stupid, and dangerous for me and my passengers.  I remember not seeing the car in front of my stop, and me having to slam on my brakes, barely missing by millimeters, I should have crashed.   As soon as I slammed on the brakes, I was lost again. Then I heard my buddy in the seat next to make a noise, I nearly freaked, forgetting I wasnt here alone. Minutes later my buddy spoke again, which freaked me out again!!! no shit.  Then I almost crashed again into the back of a stopped car. Dont know how I missed that car. I was fuckin lucky. \r\nI found my self saying my thoughts out loud, it trip my passengers out for real, one asking me if he could drive, and me saying HELL NO. I thought I was in total control. I was wrong.\r\nI cant remember too much right now, but I do remember getting out of my car at 11pm, and not being able to move my legs, like I didnt have any, I had to concentrate on which leg I was moving so I didnt fall over. After I dropped my passenger off to return home I almost turned left in front of another car, but something, or SOMEONE pulled enough sense out my warped reality to avoid accident number 3. \r\nBefore bed each night I read a little to help fall asleep, I couldnt, everything was blurred and double vision, I had to cross my eyes to read one side of the blurred writing, that gave me a bad head rush, got dizzy from it so I just went to sleep. \r\nI didnt trip while I was a sleep, only got 5 hours sleep, woke up fine. Barely any lingering effect... a little confused about the last night, possible still tripping, but no invisible people, dont even remember any pictures, or distant images or ghosts from the previous night... unfortunately  my friend wasnt so lucky.\r\nIts now Friday night, and hes still in hospital, talking to the heart monitor, talking to people that arent really there, raises his hand from his hospital bed, like in School, to go potty, then pissing all over himself, until they gave him an adult diaper, cause he still cant use his legs, and is still trippin.  \r\nIn a couple days they are going to transfer him to the Psych ward at [Erowid Note: Name of Institution expurgated], where he may be deemed FUCKED UP FOR LIFE!\n\n\n"
}