{
 "title": "Withdrawal Isn't So Bad",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Withdrawal Isn't So Bad: experience with Methamphetamine (ID 41216)\". Erowid.org. Jun 27, 2007. erowid.org/exp/41216",
 "substance": "Methamphetamine",
 "bodyweight": "50 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Methamphetamine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 41216",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2007",
   "Views: 5190",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had my first blast when I was 38 years young and had never used anything other than pot before.</p><p>At first it was big fun of course, but it didn't take long for that to wear off. Within four or five blasts, I was hooked.</p><p>After four months I'd become an identifiable junkie. I was staggeringly thin, and people stared at me. </p><p>I quickly lost concentration in anything other than getting from one dose to the next. Within a few months of my first blast, my life began to fall apart: relationships, study/work, friends, self-esteem, body image, my mental health deteriorated. I became a very unpleasant person and everything felt like a huge effort.</p><p>Acquiring a needle fetish wasn't good for me. I was mesmerized by the needle, more so than the meth which soon became a terrible terrible burden. </p><p>The day I couldn't get out of bed without a shot was the day I began to bring myself back to reality. I'd been using continuously for seven months at this stage. I reduced my doses and began to shoot up sterile water when the needle cravings peaked. I got a lot of assistance from the staff at the local detox clinic. They were friendly and understanding.</p><p>After about a month of procrastination, I finally took the plunge. My dealer (yeah can you believe that) agreed to support me. At home, I just sat and stared for hours and hours, retching my guts up quite often, and after three days I was clean. And never looked back. In the meantime I had lost everything, and hurt my family and friends. Now, at least, I have my soul. </p><p>The first few months were hardest because I had to break association with other users and the whole culture of it. I moved out of state, which was a successful tactic. Cravings weren't much of an issue surprisingly !</p><p>Two years later, I've stopped having dreams about it, and I look back on this as a special kind of learning experience.</p>"
}
