{
 "title": "My Own Body Disappearing in the Distance",
 "author": "KJ",
 "citation": "   KJ. \"My Own Body Disappearing in the Distance: experience with Salvia divinorum (20x extract) (ID 41226)\". Erowid.org. Aug 8, 2005. erowid.org/exp/41226",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "0.5 bumps",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41226",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 8, 2005",
   "Views: 6106",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSunday, March 10, Approximately 12:30 p.m.<br>In the outskirts of Atlanta, Georgia, gathered in my car, me and my friends contemplated what we would do for the day. After a few minutes of mindless chatter, seeing as we were all rather high, I remembered the Salvia extract my friend had recently purchased. Being of sound mind and body and considering my self well educated on most drugs, I was excited at this new mind enhancing opportunity.<br>I spoke with my friends Adam and Adam, who had already tried Salvia, and questioned them as to its effects. Both told me that it was an unusual experience that could be very intense, including out of body experiences, bad trips, and points when the body acts even without a will to do so. Interestingly enough, I would experience these effects all first hand. I opened my glove box and pulled out my bowl, loving called 'Mr.Swirly', for the swirls surrounding the length of the bowl. I packed the bowl half full of 20x extract, Salvia divinorum A. Still receiving pointers from my friends on the trip and how to maintain it, they notified me that they had not smoked it out of a bowl, but instead vaporized it in a water bong.<br>Wishing to understand what my friends were talking about, and wanting to open my mind to new experiences, I put the bowl up to my lips and began to light up not caring how it was dosed or administered. I consider myself an experienced smoker, and tried to use a system of altering pulls on one heavy rip. After 30 seconds or so I exhaled a heavy cloud of smoke. At this point in  time, no less than 2 seconds, the Salvia hit me. I only know this because my friends asked me if I felt anything right after finishing hitting the bowl, and before I could set the bowl down I had responded that, 'I could not feel anything', and then seconds later that, 'I was not OK and I wanted to stop'. At first I accepted the high and tried to use some kind of repeating thought process to control my experience. But, nothing, and I mean nothing I had ever done in the past could have prepared me for what was happening to my mind.<br>I looked at both my friends and began to feel as if I was fading away from the front of my eyes. By now the person my friends know was gone. I kept receding further into the distances of my mind. Surging in and out with my friends voices fading as if I was really moving, I became aware of what was happening and forgot that I had administered a drug to myself. I became very scared. In my minds eye I was lunging forward with my arms at my own body disappearing in the distance. My friends' chants of, 'It will be ok' and 'Everything is fine' did nothing but intensify my fear and make me believe they were not going to help me, or could not. I felt hopelessness. I felt that even if I could scream from within my body my friends would never know how to help me. Even though I was completely 'gone' I was able to conjugate the thought of my own death, and that if I could not somehow grip onto my eyes or my arms or anywhere, and hold for dear life, that I would be lost forever in the sinking black I was fading into. For the entire trip this fear remained with me and was clearly in view for me to see. I even saw the thought of my own death. And it terrified me. <br>Everything began to fade away and I could no longer see my friends or anything around me. I felt as if I had been pulled away from my car into the street. And my mind created a fantastic but horrifying view of how life was laid down in sheets by God, and that that is how God fixes us and our paths when we have gone astray. I say this view was horrifying because while I was watching life being assembled in sheets around me, I was being disassembled and a voice was yelling out, 'You are going to die in five'. From these words my mind grasped the fact that it did not want to die and wished to stop the 'ride' because I figured the end was when I would cease to exist, leaving my body behind.<br>Most of this happened within a very short amount of time, one minute, maybe even seconds, and led to the most intense part of the trip. Nearing the end of the trip, and the 'ride' I could not stop, fearing for my life, I accepted and realized I was going to die. At this point both my friends recall me having a 'deer in the headlights' look of imminent doom. Without knowing what I was doing, my body acting completely on will and fear, I grabbed the handle of my car door and made a very intoxicated leap to the pavement below. Trying to get my bearings and return my mind to its senses, I rolled over the ground once and stood up in a matter of seconds after I had hit the ground. However, I was still 'tripping' beyond all imagination. I began to run away from myself, or what I felt was the source of my fear. Both my friends say they have never seen me run as fast in my life (1). I bolted across my friends cul-de-sac and completely regaining sight from the front of my eyes, instead of from behind, I grabbed onto a fence in a random person's yard and tried to grasp the fact that it was all a drug experience and that I was not going to die. At this point in time I still didn't trust my mind and I waited five minutes to see if evertyhing would come collapsing in on itself like I suspected it might.<br>My friend leapt out of the car and came and helped me walk back to my car and then to my friends garage. I began to come down, and became me and one with myself again.<br>Much to my enjoyment I survived my experience with Salvia, however, I would recommend extreme caution in dosing on extracts and that all potential users read as much as possible about Salvia before use. Smoke on, live free, enhance the mind.<br>Trip length - Approximately 5 minutes<br>Trip intensity - Extreme, feelings of fear<br>Dosing - One hit, half bowl, 20x extract Salvia divinorum A from a certified head shop<br>(1) - I feared so badly for my life, I ran faster than either of my friends has ever seen me run, even on track, and I have a broken fibia recently repaired with steel plating that hurts extremely to walk on, let alone run on. I also scraped up my arms and knees during the plunge to the pavement. *The potential for physically hurting yourself during a Salvia trip is enormous*. *Always have a sober sitter to watch you*. **ALWAYS!** **NO EXCEPTIONS!**.\n\n\n"
}
