{
 "title": "Smooth and Wonderfully Warm Come Up",
 "author": "Raven",
 "citation": "   Raven. \"Smooth and Wonderfully Warm Come Up: experience with Methylone (ID 41232)\". Erowid.org. Mar 11, 2005. erowid.org/exp/41232",
 "substance": "Methylone",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Methylone",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "10 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41232",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 11, 2005",
   "Views: 12413",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: At the time this report is published, the actual dose of a unit of Explosion is rumored but unknown. See info about Explosion.]<br>Explosion is the brand name for a 250mg solution of methylone. It's a 'room odouriser' but somehow the cap flipped off and upon trying to save it from falling, it flipped up and I swallowed the whole thing. As did two of my good friends. We shared another two between us and went out to a bar. We'd all had about 400mg (1.6 dose units) each. <br>The come up was smooth and wonderfully warm. The three of us remarked to each other how in control and incredibly happy we were. But thankfully there was none of the lunatic gabbering attendent to MDMA type experiences. I didn't tell them how much I loved them, man. We were all just deeply at ease, outgoing and interested. Conversation was fantastic. Music was enjoyable but not as mesmerizing as MDMA. <br>Soon we left to a warm and inviting house party- where I knew no one. Normally I'd feel slight trepidation and certainly not begin chatting so easily with everyone I felt was alluring. We ended up getting the atmosphere more convival by dancing and playing around - soon the place was buzzing and everyone wanted some of what we were on.<br>All the while we were noticably 'on something' but never out of control . There was no fear nor dread involved in the high. Just warmth, stimulation and a feeling of 'all goodness' and appreciation of friendship. We'd had a few drinks and it seemed to compliment the drug well. Smoking felt great and we toked a lot of weed too. <br>The high lasted about 2 hours. The comedown was pretty fast but I felt irritable as I took the lonesome nightbus home. 10 mg of valium took off the edge and let me drift into sleep. The next day my head was fuzzy, I couldnt think much and I felt a little down in the dumps. This faded after a few meals and by the evening I was tired but pretty much over it.<br>The more I use chemicals to play with my consciousness I realise that nearly everything must be paid for, and not just in terms of money. Comedowns are the rent due for the high, and as long as I'm ready for that, the play is worth it. The transference of energy is all that occurs, the good is bunched up together in a small space of time, and the negative delayed for a few hours- ready to jump out at you as you come down.<br>I should really add a word of warning here. My friends and I take far too many drugs and this amount would most probably be highly overwhelming for many people. <br>We must conclude with the warning that the concentration of this commercial solution is not necessarily known for sure. 400mg of 'Explosion' may not be 400mg of Methylone. Those with pure powder may do well to keep this in mind. I don't need my frontal lobes, but you might need yours. So watch out kids. - 250mg would be a sufficient dose for those expecting a magic glittered two hours. <br>peace.\n\n\n"
}
