{
 "title": "Sleeping with Angels",
 "author": "Bacchus",
 "citation": "   Bacchus. \"Sleeping with Angels: experience with Brugmansia (ID 41256)\". Erowid.org. Nov 9, 2006. erowid.org/exp/41256",
 "substance": "Brugmansia",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "0.5 flowers",
   "oral",
   "Brugmansia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41256",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2006",
   "Views: 12948",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off I'm an experienced psychonaut. I have eaten 1/4 ounces of mushrooms and smiled the whole time, not having one bad thought cross my mind. I've tolerated many a strange DXM trip and eaten 2C-I like candy. Nothing compares to Brugmansia. </p><p>It was a night like any other. I was at a holding camp at a Rainbow Gathering in Florida a few months ago with a friend named J who was traveling with me. We had just eaten dinner and were heading back to camp when this dude yelled at us walking past.</p><p>He said,'Hey! You guys like tripping acid?'</p><p>Of course we immediately said yes. So, he walked over and shinned a flashlight on what at first I thought to be a rather large mushroom stem. Upon further inspection, I recognized it as some sort of flower. I asked him if it was an Angels Trumpet, to which he promptly confirmed. Note: I knew it was an Angels Trumpet and that it was hallucinogenic although I did not know that Angels Trumpets and Brugmansia were one in the same.</p><p>The man gave us the flower which we then broke the stem off of and boiled in about 4 cups of water for a few minutes. I added some cool aid mix to 2 cups of it while J chugged his straight. We waited for about 20 minutes or so before we began to feel the effects. From here all chronology goes out the window, and my recollection of the events is hazy.</p><p>We began to notice it was quite a task to walk. We were off balance as we walked, almost tumbling several times. As with many other people we became tired. We sat down next to the campfire at our camp and waited to start tripping, not realizing that the world around us was becoming very strange. At this point thirst set in and we decided to walk back to get some water. We got water and started walking back. This  is when the delirium became apparent. </p><p>As I walked back with J to camp I was talking to him and then after I said something I noticed he didn't respond, so I turned around and he was about 30 feet away. He hadn't started following behind me yet. It didn't really register in my brain that not only was I talking to someone that wasn't there at the time, but they talked to me as well. So, I waited a second for J to catch back up and as I did I looked out above the tree line on the far side of the lake that I was standing next to. I saw what looked like the moon up in the sky, but as I kept staring at it, it dipped low, shot back up, dipped again, and then shot really fast across the sky to the left. </p><p>After this happened J came to my side and we began walking back to camp for real this time. We got to the fire and sat down, again transfixed by the flame. I was getting sleepy and was for some reason still not convinced I was tripping, though I started hallucinating these little squiggly lines in a square shape just outside in my peripheral vision. We both, at about the same time, decided nothing was happening and retired to the tent to sleep. Then the madness set in. I began talking to people who weren't there, then waiting for a response after some conversation, not receiving one and then getting mad at myself for talking to people who weren't there. I 'woke' up at one point to J whispering my name over and over before I could respond. He was sitting up and I yelled 'What man?!' To which he responded ,'I didn't say anything dude.' </p><p>I was beginning to realize at this point that I was totally out of my head. I tried blowing on logs in the tent to flare up a fire that wasn't there before I realized it wasn't a good idea to have fire in a nylon tent. I got naked and tried, squatting, to dig up the plastic bottom. J said he saw laser sites aiming on the ceiling of the tent, and coal raining down. There were really only 3 people in the tent but I kept thinking there about 6 or 7 for some reason. The next morning when I was a tad bit more coherent I thought 2 people came in the tent and started having sex right in front of me. Me and this imaginary person next to me tried to ignore it and then at some point I left the tent and actually went to sleep for real.</p><p>I really don't remember most of the night. I thought I was sleeping but the 3rd person who was in the tent with us, who was sober said we were up all night mumbling to ourselves and blowing on imaginary fires. I think its important to note that I got this sense of extreme introspection from the experience, like I was shown many things, I just can't remember what they were.</p><p>In conclusion, not a positive or a negative experience but just insane. I have never hade more real hallucinations, nor have I ever blacked out so intensely.</p>"
}
