{
 "title": "Tripping Alone in a Crowd",
 "author": "Jeff",
 "citation": "   Jeff. \"Tripping Alone in a Crowd: experience with LSD (ID 41250)\". Erowid.org. Feb 8, 2007. erowid.org/exp/41250",
 "substance": "LSD",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41250",
   "Male",
   " ",
   "Not Given",
   "Feb 8, 2007",
   "4977",
   " "
  ]
 ],
 "report": "<p>The night begins with my girlfriend K coming over to my house.  We eat dinner and head over to my friend As new place.  The plan was for everyone to do mushrooms.  I had previously done 1 hit of LSD on Monday, which didnt do much for me.  So I decided to up the dosage to 3 hits.  Being my second time ever taking LSD, I found that 3 hits was quite sufficient to push me over the threshold.  </p><p>We arrive at As place and chill with her, K, and D at around 8:30.  Now, I had already purchased my acid the day before so I was prepared, but my friends had left it until the last minute to purchase their mushrooms so we had wait until almost 10:30 until we finally got the call back from our somewhat reliable dealer.  D and I left to pickup the mush from the dealer and I dropped the acid as soon as we left, seeing as I had to work the next morning at 11:30.  We arrive back at around 11pm, D dropped 4 grams, and K dropped 2 grams along with A.  </p><p>From about 11-11:30 I can feel the acid start to come on, and get the same edgy feeling I got last time I dropped it.  My stomach didnt hurt at all this time, Im assuming that is because I spit out the blotter after I had finished sucking on it instead of swallowing them.  </p><p>At almost exactly 11:30 the full effects of the acid came on.  I could not stop smiling and my friends began to notice that I was quite giddy.  Now by this time, D and A knew that I had dropped the acid, but I had not told my girlfriend K so I couldnt talk about my feelings or the acid very openly.  In the living room where we spent most of the night there is a lizard cage, which has 2 red lights for sleeping.  I was constantly attracted to these lights and the color was just incredible. I had a hard time not staring straight into the brightest part of the light bulb.  After a while with the lights I decided to get up and check out the lizard.  This was a little dragon looking type lizard and had two independently moving eyes.  I watching him looking around and staring at me.  I swear I could read his mind thinking, WTF are you looking at you freak go sit down. At this point I almost fell to the floor laughing my ass off but kept control of myself so that I wouldnt get busted by my girlfriend.</p><p>After sitting back down I was still thinking about his eyes and tried to move my own eyes independently.  To me it seemed like I was successful in doing this but Im sure I was only going cross-eyed.  My friends had popped in a Sharks tale.  The main fish made friends with a shark and began to tell the world that he was a shark slayer and that all fish and sharks should make peace.  I dont know whether this was the real plot of the movie but at the time it seemed like an adventure of epic proportions.  </p><p>My friend A invited over 3 friends, which were acquaintances of mine.  Now let me tell you these women are very loud and talk very fast under normal conditions.  Now when they are drinking and talking extremely fast, and Im quite fucked on 3 hits of acid, all I could hear coming out of their mouths were BLAH BLAH BLAH BLAH. Now if I did not have pretty good control of my brain, these women would have drove me completely insane.  The movies helped as I could get into them and ignore the women completely.</p><p>Whenever I heard something interesting come up in conversation, or one of my REAL friends said something to me I would look away from the movie.  But, not wanting to miss any of the movie, I continued to listen to the movie and look at my friends while they were talking.  Now, whatever any of the people in the movie were saying, it seemed to come out of my friends mouths, not the TV.  It was extremely hard to communicate and I had to listen intently and concentrate on ignoring the movie to even understand what they said, let alone answer them coherently.  </p><p>After a while I got bored with the movies and began to just stare at random things throughout the room.  I found that I could use my mind and alter whatever I was looking at.  There was a stack of movies on a bookshelf over the TV and it seemed that the titles of the movies were wandering onto other DVD cases.  I could look over at any of my friends at any time and do anything with their faces.  I played with the concept of beauty in my mind and found I could adjust their faces to make them either better looking or uglier.  I could make their noses longer and make their ears bigger.  I could change the color of their eyes as I was looking at them and even the color of their hair sometimes.  I was quite enjoying this until they began to notice that I was staring at them a little too much so I decided that it would be a good time to stop.</p><p>From then on I decided not to look at them at all unless they were talking, so as not to seem weird or anything.  The roof of the living room was a plain white but it had minor stucco bumps sticking out of them.  These bumps seemed like they were moving up the wall and away from the TV.  The entire roof was moving in complete rhythm in a pulse stop  pulse  stop type motion.  </p><p>All of the real life visuals that I got through the night were strong, but overall I would say that the colors and closed eye patterns were much more intense. I could look at any given color in the room and I could see what colors it was made up of.  For example I could look at the red lizard light and see not only red but also green and blue.  Every room / section of a room seemed to have its own color scheme.  Either Red and Yellow, or Blue and Green, or Red and Blue, or any other random combination, which seemed to be constantly changing through out the night. The closed eyes visuals were the most intense of all.</p><p>I went to the washroom intent on taking a quick piss and then back out to watch the movie.  After waiting a minute or two for the piss to want to come out, I decided I needed a break from the talking women and just chill by myself in the bathroom for a minute.  I sat on counter and closed my eyes, wow.  Not only was this a full spectrum geometric light show, but also it never EVER got old.  It was constantly changing from hexagons to combinations of hexagons and polygons and hundreds of other shapes that I cant put names to.  I went out of the washroom after what seemed like a couple minutes, but apparently I was in there for at least 20 minutes.  </p><p>After this the annoying women FINALLY left.  And my friends began to ask how I was feeling and to describe how I felt to them.  Words at this time seemed so useless and utterly inadequate at describing anything that was going on.  The best explanation that I could think of was to say that If I had a fish bowl full of water and put it in front of my face and looked through it, that is how my vision would be.  After saying this I realized how true was.  It was like being able to draw a circle around the center of my vision, which I could totally focus and be able to see moderately well.  Outside of this field of vision everything was fuzzy.  My peripheral vision was the worst it had ever been in my entire life.</p><p>My hand eye co-ordination was also quite off as well.  Despite this I felt like I was constantly flexing my fists and felt that if I was attacked by someone at that point (not that it could ever happen) that I would be able to defend myself.  Maybe that was just my over confident mindset but I still felt fully capable.  </p><p>All in all Id say it was a good experience.  I know there are a lot of things that I saw that night that I left out.  The fact is that what I was seeing was changing so fast that I had a hard time understanding what I are seeing enough to even describe it in the first place.  And by the time I start to describe it, its already totally different.</p>"
}
