{
 "title": "A Foreign World",
 "author": "BellaLuna",
 "citation": "   BellaLuna. \"A Foreign World: experience with Salvia divinorum (21x extract) (ID 41282)\". Erowid.org. Jul 14, 2008. erowid.org/exp/41282",
 "substance": "Salvia divinorum (21x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41282",
   "Male",
   " ",
   "Not Given",
   "Jul 14, 2008",
   "Views: 2585",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Wow,</p><p>To begin I will describe my entire situation prior to the experience. I had decided to quit marijuana use for a number of months, and this was in the third week of my sobriety. I wanted to try more one-time hallucinogenic drugs and it seemed best to begin with one that I could buy at the local head shop. So I did, I bought 21x salvia, dont remember the original amount but it came in a little cylindrical capsule ($40). I first tried a few hits from a spoon which sent me to the body high and confusion aspect of the drug, but just slightly off baseline. I wanted to get a feel of what to expect before completely emerging myself into the salvorin A. Still I remained just slightly off base line, and I did more later that day and definitely felt the detachment from reality, yet everything was only altered and distorted, unlike my actual salvia 'trip' (if you want to call it that) days later. </p><p>I hired my two friends as a sitters for roughly half an hour while I loaded my friends bong with crushed ice and water. I filled the slide with an amount that I believed I could take in one substantially large bong rip, because I didnt think I could make it to a second one. I noticed I still had a decent amount left which I sold to one of my sitters, and we agreed he could try it once I had reached baseline. I cherried the bowl, and torched it for a good 4 to 5 seconds before removing the lighter (this is customary with SD) and ripped it until I could hear the bowl begin to cash. I handed the bong to my friend as I held the smoke in my lungs and slipped away.</p><p>The sensation always begins with a metallic, yet liquidy yet plasticy body high and a sense of losing touch with reality. Up until this point this was the furthest I had reached from the buzz of salvorin, but soon enough I was continuing to rise past this buzz, into a much deeper much more disturbing loss of my grip on reality. Its a feeling of slipping away, and once Im away I feel I'll never return back. Doing salvia makes me love the feeling of baseline. It is impossible to accurately describe in words the process in which my mind was working, but I will attempt to. For the majority of the experience I was not within any contact with any of my surroundings and it was almost impossible to react with anything around me. It is not so much about the visuals, because when I entered this dimension (known as salvia space) basically everything seemed like a visual, yet it was the only reality I could begin to comprehend. It got to the point where I had entirely forgotten that I was a living breathing being, I felt more like and inanimate object or an ultimate observer. I had an overwhelming feeling that I was in a large foreign place such as an unused warehouse, yet without the desolate emptiness. Everything seemed foreign and also inexperienced, the sense of touch seemed new to me. By this time I was walking around the room as my sitters observed me, absolutely unaware of the place that I was actually in. Motives were rendered by absolute momentary inhibitions, whatever made the most sense (not that anything was making much sense) is what I would do.</p><p>As my vision of the real world was restored, my comprehension remained in the unreality, as I merged from one world to the other I saw my friends face protrude from a wall, and finally realized that I could see things that were real, but it all still seemed very foreign. I had completely lost all recollection that I had a prior relationship to the two people who were in this room with me. I wasnt afraid of their presence, because I was just as confused about why I was here, and where here was, and the whole concept of life outside of my 12 by 20 foot bedroom. It took me a long time to return to baseline, and attempting to communicate with my friends was very complicated. My brain attached a great importance to the lyrics of the music that was playing, not so much that I was hearing the words, but more being guided by them, as if they were an unnamed force rather than actually words being said out loud. At this point it was like a pendulum swinging in and out of reality, at some point I could comprehend the situation, then it was back to complete and utter confusion. </p><p>This drug wiped my slate clean and left random neurons in my brain to write a new temporary slate for me to act upon for 15 minutes or so before the effects wore off. This is why much of it doesnt make sense, and why I felt such disattachment, and out of place. The concept of life, age, time, thought process, perspective, and reality in general go out the window with this one. Legal? I have no idea why hahaha, in a way it is much more intense that LSD, shrooms, etc, because those drugs only distort and alter one's reality through use of creative visuals and heightened emotions. This transported me to a completely different reality and did so quickly and shortly. I do not wish to advertise or discourage use of this substance, only to offer an accurate  (yet somewhat unexplainable) picture of what a salvia high is like.</p>"
}
