{
 "title": "The Big Day Out",
 "author": "Earth Child",
 "citation": "   Earth Child. \"The Big Day Out: experience with Ecstasy (ID 413)\". Erowid.org. Jun 29, 2000. erowid.org/exp/413",
 "substance": "Ecstasy",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 11:29",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 413",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 29, 2000",
   "Views: 3264",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA friend of mine had been using E on a regular basis for quite some time.  I'd heard various stories and naturally, I was curious.  My friend suggested that I do some research on the topic, which led me to this and other sites discussing the effects of E.  After a considerable amount of reading, I decided to give it a try.  What an experience!  I'm so glad I did.<br>We had tickets for 'The Big Day Out' (a major event held in Sydney and New Zealand each year, featuring a whole load of new bands, really good!).  Anyway, my friend decided that because there'd be so much to experience as far as sound & vision was concerned, that this would be the perfect place for my introduction into the wonderful world of E.<br>We'd planned it very carefully, timing etc. Took half a 'dino' at 8.30am.  I felt a little strange, nothing drastic though.  Had a few cones.  <br>At around 12.30 I took the other half, sat down for a while.  Got up to move and WHOAAAAA!!!!!  Suddenly everything seemed to be in incredibly sharp focus.  I could pick out conversations over the crowd noise that I wouldn't normally notice.  I kept wandering off in every direction, forgetting what it was that I was doing in the first place when I got half way to wherever it was that I was going!!  Strangely, I didn't care!  And the music!  Wow!!  I was hearing things I'd never noticed before!  It was hypnotic!  All I could do was stand there, head back, eyes closed, letting the music flow in, out, around & through me.  Listening to the Nine Inch Nails do 'Closer' was the closest I've ever gotten to having a religious experience!!! <br>I went on a couple of amusement park rides, couldn't stop laughing, I was so fascinated with the lights, the music on the ride, the people whizzing past, (it was the hurricane we were on, a fairly fast ride).  My balance was shot to pieces by the time I got off the ride, again...I just didn't seem to care!<br>It was a fairly hot day, so I drank ALOT of water, I'm sure I must've drunk around 5 litres.  My friend was insisting that I buy a bottle of water every half an hour, wether I thought I needed it or not.  He did a very good job of looking after me that day, making sure I didn't wander off and get lost in the crowd, (there were 64,000 people there so it wouldn't have been hard to get lost).<br>We had a few more cones during the day, which seemed to enhance the effect of E...who knows..maybe it was just my imagination?  We chilled for a while, got into some deep and meaningful conversation about life, the universe and everything.  My friend and I found out some things about each other that both amazed and amused us.  I suppose everybody does that though.  By this stage the day was getting on, it was around 8.00pm.  Time seemed to be disappearing in three to four hourly blocks!  The day flew, definately not long enough.  My friend decided that enough time had passed, my tolerance to E seemed to be nothing short of amazing for a first timer, so we decided to take yet another half tablet each just to finish the day off on a high note, so to speak.  <br>We were awake until 4.00am the next day, listening to trippy music, drinking endless cups of coffee and smoking cigarette after cigarette.  I LOVE to smoke on E, I found out (as thousands of other people would already know), that smoking is wonderful!  Especially menthol cigarettes!!   <br>Thanks to my friend I had a GREAT day, my introduction to E was a safe and glorious one.  Needless to say, I'm one of the converted!!!!\n\n\n"
}
