{
 "title": "Eternally Lost in Symbolic Hyperspace",
 "author": "Alex",
 "citation": "   Alex. \"Eternally Lost in Symbolic Hyperspace: experience with Blue Lotus (extract) & Salvia divinorum (10x extract) (ID 41373)\". Erowid.org. Nov 7, 2005. erowid.org/exp/41373",
 "substance": "Blue Lotus (extract) & Salvia divinorum (10x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(extract)",
   "  T+ 2:00",
   "80 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   "  T+ 2:05",
   "150 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41373",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2005",
   "Views: 5893",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSet: I was in a decent mood, but a bit apprehensive of doing a large dose, since I've never done more than 100 mg.\r\nSetting: my completely darkened bedroom, with Once Upon the Sea of Blissful Awareness by Shpongle playing on the system.\r\nAfter drinking the 10 squirts of tincture, the effects of the lotus came on quickly; a subtle sense of euphoric energy compelled me to dance all around my room to Pet Sounds by the Beach Boys.  I did not feel drugged per say, just extremely energized, which faded quickly.  After that I lapsed into a semi-head-space which was extremely mild.  \r\nUpon taking the first small hit of Salvia, I experienced what I would probably rate a Level 2 on the standardized rating system.  Upon opening my eyes, I felt as if I was slightly detached from my ability to control my body, as if something was controlling it for me, commanding me to smoke more salvia.  Part of me was still normal, still human, but the other part was now taking control, something I was glad of because I was no longer nervous to smoke a large bowl.  Everything appeared to be behind a red, shifting layer of saran wrap.  After quickly smoking the second bowl, I was rather forcibly ripped out of my body and inserted into the symbolic universe I had briefly visited on my last voyage.  I had absolutely no concept of having ever been human, or having ever been ANYTHING.  I was simply a lost viewer in the spinning Hassum Yeesum Danns for Joy which defined the entire cosmos.  It was a light brown, glowing substance that seemed to rotate around my field-of-perception, except that isnt quite right because I had no field-of-perception.  I simply was, always had been, part of this bizarre, terrifyingly abstract realm of symbolic space.  \r\nIt is impossible to describe this adequately in words, but it felt eternal in a way that I had never before believed possible.  However, it definitely wasnt a happy eternity.  I kept shifting from one manifestation to another; never settling down for more than a few seconds at a time, terribly confused and worried that I would never achieve stability in any form, let alone a human form.  I just desperately wanted to be something, whether it be a flowerpot or a star.  I cannot emphasize enough the weirdness of this experience...but the most bizarre aspect of all was my synesthetic method of labeling the different environments I was subjected to.  Taste merged with sound merged with sight; rendering the brown hyperspace a name derived from laugh some weep some dance for joy which was mentioned above.  I wonder if anything would have had a name if I hadnt been listening to music, or if the experience would have been terrifying if I had been listening to something like Tool.  Since I had completely lost contact with my physical body, the terrible taste I had experienced on my last trip was no longer present, but I felt a mouth hum which seemed to energize the force fields holding my consciousness in place.  \r\nAfter spinning through this eternally twisted environment for what I assume to be 10 minutes Earth Time, I slowly retreated from the hypnagogic terror of Level 5 and assumed a bemused, rather perplexed existence at Level 4.  At this stage, every object seemed to be a symbol with a purpose, rather than just an object.  I would look at something, and would see all of its possible implications on the world, all of its possible permutations in space and time.  It was like a strange magnifying glass on the substance of reality, allowing me access to the Platonic Form rather than the mere physical manifestation of a thing. Everything I saw in my mind fit together perfectly like some sort of M.C Escher painting. If I looked at a doghouse, it would change color, and jump out of its environment as if I had selected an object on a computer monitor.  Eventually I came down to Level 3, experiencing sobriety with eyes open and dreamlike visuals with eyes closed.  It was as if closing my eyes gave the Salvia permission to exert Her power over me.  \r\nAfter coming down almost completely, I went over to the computer and examined the clock.  The experience had lasted around 45 minutes in total, but as a result of my distorted temporal perception, I have no idea how long each different plateau was actually experienced.  Would I try it again? Probably.  However, it must be stressed that this experience was not exactly what I would call pleasant, or enlightening; it was simply bizarre to the infinite power.\n\n\n"
}
