{
 "title": "Not Great but Interesting",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Not Great but Interesting: experience with TMA-6 (ID 41387)\". Erowid.org. Jun 1, 2006. erowid.org/exp/41387",
 "substance": "TMA-6",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "TMA-6",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41387",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 1, 2006",
   "Views: 7672",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Me and a friend acquired this chemical from an undisclosed internet company, came in 100mg bag and he smoked a little of it one night with a friend, so we had about 80mg left apiece.</p><p>At about 2pm we split the dose and ate it. He didn't eat all his he left like maybe 8mg which he snorted afterwards, said it burned like hell.</p><p>I felt a little tripped out, I giggled a little bit and felt awesome just like I do on LSD or Mushrooms, colors were bright after maybe 2 hours or so (this takes a little while to kick in, although we had just eaten). I saw a little bit of visual distortions, some things looked a little off for a seccond and then went back to normal, a wall moved on it's own once, I could make stuff move, but I can kinda do that when sober so it doesn't really count. There was a tenseness in our necks and our hearts were beating sort of fast, likly due to the Amphetamine in this compound.</p><p>Food tasted exsquisite, music was orgasmic, lights were pretty, I was happy. The ocean looked cool.</p><p>I dose pretty high on halucinagens, I do a full 1/8 of shrooms or more, 3 hits of acid or so, this was not very strong feeling, I would have liked it to be stronger It was sort of like 1 hit of good acid.</p><p>It does last a long time, at about 11pm we went to a friends party, a drink or two proved to relax the tension built up from the TMA-6, but after 4 or 5 I was just drunk feeling with a little bit of giddyness. Sleep was fine for a little while, woke up after 8 hours and couldn't go back to sleep which is unusual for me though. </p><p>I'll probably stick to my LSD.</p>"
}
