{
 "title": "Recreational and Therapeutic Use",
 "author": "Rye",
 "citation": "   Rye. \"Recreational and Therapeutic Use: experience with Gabapentin (Neurontin) (ID 41390)\". Erowid.org. Mar 13, 2007. erowid.org/exp/41390",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1800 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41390",
   "Male",
   " ",
   "Not Given",
   "Mar 13, 2007",
   "54951",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Backround: Im a young male,165 lbs, 6ft.tall.</p><p>Im an avid user of psychoactives, everything from over the counter highs to street drugs such as LSD, marajuana, cocaine...basically whatever comes my way. Ive been diagnosed with GAD (generalized anxiety disorder) for 2 years.</p><p>As of recently Ive been slowing down on heavier psychoactives(LSD and mushrooms)and looking for a less powerful high. I was looking through my medicine cabinet when I found a bottle of 600mg Neurontin(Gabapentin) tablets. I had no clue what the were, so I went to ask my dad. He explained that his doctor prescribed them for nerve pain, and also anxiety. He gave me three and told me to take them when and if I get a bad headache...I popped them ten minutes later and drank a cola for absorption.</p><p>About an hour later I noticed that I was having slight perceptual changes, which greatly increased over the next hour. My head and limbs were numb and I felt very floaty and dizzy. The feeling was actually very euphoric, to my surprise. The euphoria caused by this substance is equal or greater than that caused by codeine. This is when I discovered its recreational effects.</p><p>This drug feels very different than many others I have taken, so I couldnt make a good comparison. Its definitely a downer, but has qualities of a stimulant it also is a great anti-anxiety medication.</p><p>I took my dads pills about two more times before I got a prescription of my own, now I enjoy eating them all day. They make me very comfortable and sociable, something uncharacteristic of myself. Now Im starting to notice the therapeutic effect</p>"
}
