{
 "title": "Road Trip",
 "author": "Paul 99",
 "citation": "   Paul 99. \"Road Trip: experience with LSD (ID 41403)\". Erowid.org. May 5, 2006. erowid.org/exp/41403",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1985",
   "ID: 41403",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 5, 2006",
   "Views: 3952",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>A devious plan is hatched. Supplies must be rounded up, the safe house established and checked beforehand for intruders, phones unplugged, locks secured. I must leave word for everyone that may seek to intrude, that I wont be home, that I wont be available until further notice. Arrangements have to be made with a diligence necessary to preclude any unforeseen interruption. Past experience with paranoia dictates the need for absolute privacy. Any deviation from the plot can result in disastrous consequences. One does not dare run out of cigarettes. More on those goddamn things later.</p><p>I had spent all afternoon rounding up my conspirators, and even with prior notification, and the use of telephones, this can be difficult. Toni had to work, the poor bastard, that night at the bar he worked in, and Ronnie, did not have a phone and was asleep at 4:30 PM when I arrived at his house. This unemployed long haired white boy was always available for a Monday afternoon anything. He was prime pickings for a well laid plan. </p><p>The plan had been for me to pick him up, and we would bug out for the thirty-five mile trip to San Antonio in my turquoise Mustang. The V8 would come in handy when time ran short, and in the haste of a dedicated drug frenzy this could happen sooner than expected. Delays would see to that. </p><p>First Ronnie had to have beer. This was his domain. Large quantities of it would be procured with his expertise, and I dont know how, he had no drivers license, no ID, no chance of legally purchasing it, he was all of seventeen. Luckily the follicles of his unshaven face, and in those days the relatively low drinking age of eighteen, made it somehow manageable. By the second or third attempt, with me nervously chain smoking in the car, Ronnie emerged from a store with two cases, cursing me for not helping him carry it as he dumped it all into the back seat and issued the command for us to jet. Further stops (damnable delays) included pay phone calls to insure his grandmother, in fact, would be out of the house all weekend, it was there we would trip.  Also, we stopped for Ronnies tape collection, which when coupled with mine, netted us over a hundred albums of rock music; surely enough to help us through the difficult journey ahead, not to mention the rest of the night, which promised to challenge our senses at every turn.</p><p>A fallback position was my house, as my parents were away for a couple of days, but the modest residence was less desirable because of the eyes of neighbors who were fond of my parents and known to watch the house when they were away. Finally, after much wrangling, he issued the thumbs up, for use of his grandmothers house. With no fan-fare we booked out of town for San Antonio, the Mustangs triaxle JVCs blasting anthems from Deep Purple and Ozzy Osbourne. Ronnie was already drinking a beer, and I had tossed him my weed, so that he would begin rolling the short, tight bombers that smoked slow and lasted long. This he commenced on one of the cassette boxes from the back seat. We smoked one as he rolled more, for later.</p><p>Our connection in San Antonio lived in a predominately lower middle-class residential neighborhood. He was Hispanic, as was the entire neighborhood, and always seemed to have a crowd on hand. Objects in his home, as well as artifacts adorning the walls told us he was at least part Native American. Some of his hangers-on did not speak English, or chose not to, and our host alternated between Spanish and English. The whole neighborhood, it seemed, was full of acid heads, a drug preferred by them because of its low price. On previous visits we had found that our man usually had acid on hand, and often pot, but some times the scene would be dry, sending us away disappointed. This late afternoon we shot a couple games of pool on his table in the back room, a den of red lights and felt rock posters, where there were often casualties of the failed drug wars expunged by political leaders and police officials. </p><p>Our man had stepped away after asking how much we needed, and accepting the forty dollars I offered. He returned with ten hits as requested and I breathed a sigh of relief: The only remaining obstacle in our mission had dissolved revealing the framework for the gnarly time, in our plan. Ronnie separated two hits each for the two of us and offered two to the Indian, who ate his on the spot. Ronnie and I each took two hits and played another game of pool, and smoked a joint with the Indian and his other guests, before excusing ourselves, as we had to get back before the shit kicked in.</p><p>The madness begins</p><p>Upon reentering the car and making appropriate musical selections, we bugged out for the highway. We headed north, towards sanctuary, the stereo again blasting iconic songs of rebellious youth. </p><p>Soon Ronnie had his ass pointed at the windshield, wrestling with and cursing the mess of beer and cassette tapes in the back seat. What in the fuck are you doing, I asked.</p><p>I thought you had some more sunglasses in here, he said. He checked the glove box: No luck. Mother fucker. Well youre not getting mine. I warned. Those Ray Bans wouldnt leave my face for all the beer in the car, and he knew it. Planning. There is no substitute. I checked my watch. It had been forty minutes since we took the acid, and I wasnt feeling anything yet; everything was cool, the only real concern was the fact we werent yet back in town, it was a few more miles yet.</p><p>About that time the steering wheel of the car seemed to elongate slightly. What the fuck...? I suddenly realized I felt a bit strange. Ronnie was switching tapes, we had voted between Nazareth and Aerosmith. Nazz prevailed. He glanced over, Its rewinding. He had guessed I was wondering why it wasnt jamming already.</p><p>A highway sign came up, and I noticed simultaneously that it was five more miles to town, and that the sign was also displaying a streak of green that extended well past the sign and seemed to remain next to the car as we sped along. I increased speed to eighty: things were getting tight. I didnt want to still be behind the wheel when all hell broke loose, and we had less than a quarter hour till that happened. I fired up another cigarette and saw I only had two left. How in the hell could this happen? Did you see any more packs back there, I shouted over the music. Ronnie looked at me again, but didnt answer; he looked distracted, staring out the windshield. I said, Well Im going to have to stop, soon as we get there, Im almost out. My cohort shrugged, and then announced, Im not going in. Crap be damned, it was getting serious now.</p><p>I whipped the Mustang smoothly into the first convenience store at the edge of town. By my guess we had only minutes and a few short miles to go before we could move indoors to hide. If we were caught by unforeseen circumstances and in any way diverted or delayed, we would be captured and boxed off to rehab faster than you can say, One toke over the line. Ronnie let out a whoosh, as he appeared to be winded by the thirty-minute drive and relieved to be there. His face looked tense, his jaw tight, I didnt want to look at him. There was something wrong with the man. He didnt look right. I stepped out of the car. There seemed to be a lot of chug holes in the pavement of the parking lot, I hadnt seen them when I screeched in, but now they led all the way to the door. One could twist an ankle, or worse, in this goddamn obstacle course. I started forward, ignoring the loud laughter now coming from my car, it told me I was doing something funny, walking wrong perhaps, but I would deal with the madman in the car later, I had to make it inside.</p><p>Bad vibes at the counter </p><p>Once in the store, I was hit with a terrible feeling of, perhaps guilt, or remorse, I couldnt be sure of which. I rushed the counter, but was blocked from it by something, yes someone, it appeared to be a  man, but as I drew closer, it was clearly not human, not quite. I had seen it before, in illustrations of early man in Anthropology textbooks. It was an early form of Australopithecus, or maybe just a Cro-Magnon, it appeared to be counting, (fifty-nine, sixty, sixty-five, was he counting that right?) and the change plinking on the counter did not appear to be American currency. What the fuck is happening in here, I thought. I was already desperate to leave, and here is some weird fucking activities going on. The clerk leaned on the counter watching the proceedings, glanced at me, and resumed his vigilance over the ape counting money.  The clerk's face was a twisted mask, and grotesque. It might as well have been attached by a rubber band strapped to his skull. </p><p>Suddenly I was at a complete loss as to why I was there, and only some forgotten desperation compelled me to stay. I struggled to remember, but couldnt. I cowered behind the Ray Bans, at a loss to explain my presence. Suddenly it hit me, and in fact I did need a cigarette, one thing about a habit, it sticks with me despite myself. The animal cleared the way, shuffling out the door to presumably knuckle-walk to its car. I lumbered up to the counter.</p><p>Cigarette! Red... Marlboro Reds! I blurted, gripping the counter edge until my knuckles went white. There was a mass of cigarette packs on display behind the clerk, all makes, brands, colors darted all over the place: I couldnt read what they were. The clerk hesitated. You want a box or soft, he said.</p><p>What? Oh god, what the fuck does he want? A box? Do I want a whole carton? Next hes going to want me to sign something or fill out a questionnaire. I dont have time for that.</p><p>Not a box, I said finally, and the clerk plopped a pack on the counter. I handed him what I was sure was two ones, and he handed back what was surely some Australopithecus change, hoping I wouldnt notice. But I had him beat: I didnt care if I received change: I had an emergency elsewhere to attend. I grabbed the Marlboro pack and fled: In my mind the clerk was producing his undercover police badge and demanding some ID for the cigarettes. I slid into the Mustangs seat dropping the cigarettes onto the console, and fumbling with the ignition. Ronnie asked if I had seen a large ape running from the store, but I jarred the stereo volume knob next to the ignition key and flooded the car with Nazareth at top volume. Ronnie screamed, and lurched at the knob, bumping it back down. I drove us out of there, back on the road, flooring the car whenever feasible.  He asked if I had stolen the cigarettes. </p><p>Meltdown was under way. The steering will ballooned until it was far too big and out of round to drive comfortably. We made it to his grandmothers house, and Ronnie eventually found the key hidden outside and let us in. He activated a portable stereo unit on the kitchen counter and tuned it to a San Antonio rock station, and turned it up. We secured the house, then peered outside to check the status of the Mustang parked there, and to see that the police werent responding to our presence. </p><p>I emerged from a bathroom break, during which I checked my face in the mirror. My eyes were saucerfied and I had a tense, menacing appearance. Best not to look in there again. I found Ronnie in the kitchen, in front of the refrigerator. He had it open and various objects from within were falling on the floor as he cursed and forced the rest of the beer from the car into it. He gathered what he dropped and returned it to the shelves. All this with one hand as he clenched an open beer with the other, it was foaming and dripping on the floor. Suddenly he set it on the floor, appeared to estimate his degree of balance, and slammed the refrigerator shut. Goddamn, I bet it gets cold now! Do you want one? He picked his up. Theres cool-aid in there if you want that instead. I opened the fridge and found the cool-aid. Red sugar water. I wouldnt be ready for the beer for hours. I sipped from the container. This was the shit-phase. All we could do now was sit down, try to make ourselves comfortable, and wait for the real fireworks.</p><p>In the Vortex </p><p>The radio was going to be a problem. In fact, it already was. For one thing, I cant have an unknown stranger playing DJ for you during all these sensitive moments, besides, who better than us knew what we needed. But as Ronnie unloaded an armload of tapes from the Mustang we soon realized that even the right music wasnt ever going to sound right with the mediocre equipment on hand here, and we couldnt move the Mustangs stereo in here. For the time being we would try the TV, and we knew this would be only a temporary solution for the time being if at all. I surfed through some channels, but we were getting nowhere. I remember saying it would be a fucking miracle if something was on. Ronnie remembered some tapes he recorded on previous visits, and a miracle was at hand. </p><p>He had a movie we both wanted to see, The Vanishing Point  I knew the synopsis: A speed crazed pill head tries to break some kind of land speed record with a hotrod 1970 Dodge Challenger, by driving it nonstop from LA to Las Vegas, in defiance of all imposed laws in between. A good guy, someone we could root for. It would be a football game of road trips. That was the ticket. I pressed play, on the VCR.</p><p>I cant remember all of the diversions of the movie; it was a manic ride that I felt in my bones, at my core, the physicality of the car, the road, the racing. Insane laughter bouts. The movie played out in the room, overstepping the bounds of the TV, it involved the house itself, the roar of engines and sirens compelled us to occasionally check outside, to see that the coast was still clear. The white Challenger at times, was the only thing I could recognize, as it howled along, through dense jungle and under brush that grew out of the set and covered the floor of the house. In reality the driver was driving through desert, but I couldnt tell. It all was happening all around, the TV only the main vortex of the harrowing plot. Hours of hysteria, manic laughing, I would have some sore fucking ribs when this was over, thats for sure. It was a roller coaster of ludicracy, an intangible confused mental reasoning that moved too fast to keep up with. </p><p>We held on to the movie with a death-grip, living it. At times I couldnt remember what we were watching. It didnt seem to matter; it had a continuance that kept us going, alive and excited, deliriously thrilled vicariously through a character we could somehow relate to. A hero blazing his way to infamy in a really cool car, to hell with cops, he couldnt hear no stinkin sirens.  Somehow we missed the mind-fuck they had  set up for us: Im pretty sure we were both having a laughing fit when he crashed the Challenger into the bulldozer road-block the cops had set up, and died. No worry. He was a hoot while he lasted.</p><p>    HEY! Ronnie bellowed, That mother fucker crashed my goddamn car!</p><p>   Collect the insurance, well get a better one! I suggested.</p><p>   The bastard is hamburger, or Id kill his ass.</p><p>   Hes cooked on his own grill, leave that fucker alone.</p><p>We went outside after smoking another bomber and stood in the yard. It was dark outside by then, but I could make out the unmowed grass. It suddenly looked like there was miles of garden hose, all looped up and strung all over the yard, even obscuring from view the yard itself. Laughing, I told Ronnie, Your grandmother sure has a lot of water hose.</p><p>She sure does! he returned, staring into it and evidently fooled by my suggestion. </p><p>As I looked, the hose turned into coils of ribbon, having somewhere lost a dimension. A nearby pear tree looked like a hand, sticking out of the ground with extra fingers; it was a goddamn circus out there. We retreated into the house, to laughing fits about things we couldnt articulate. There were many avenues, hundreds of venues, just no way to keep up, or remember them as they passed.  The mind fuck would go on and on, with few respites, and usually during these we would smoke, or drink, or both. On some plateaus, I liked to drive, at night it was very serene, calming. The stereo I had in the mustang really paid off then, live concert sound during an intensely perceptive time when MY brain is attuned to it can be quite the moving experience.</p>"
}
