{
 "title": "Personal Diminished Long-term Brain Function",
 "author": "frivolous8327",
 "citation": "   frivolous8327. \"Personal Diminished Long-term Brain Function: experience with DXM (ID 41405)\". Erowid.org. Jun 15, 2009. erowid.org/exp/41405",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "oral",
   "DXM",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2003",
   "41405",
   "Male",
   " ",
   "Not Given",
   "Jun 15, 2009",
   "6870",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm just going to get straight to the point I'm trying to make without elaborating on the psychedelic effects of the drug too much...</p><p>I tripped literally every day, ocassionally skipping 1 or 2 days a week, for 4 months. With sporadic use ensuing over the next year and a half. Initial dosage was 1 bottle, which quickly escalated to 2 and 3 and eventually 5 a day. Tolerance to this substance is markedly notable and noticable. </p><p>  Bad trips=none. </p><p>  Philosophical personal insight value=great</p><p>  Social compatibility=good at small doses; impossible at high doses</p><p>The overall effect of the drug is extremely euphoric, however induces fever-like symptoms: flushing/blushing, red ears, general sick feeling.  Fear is a catalyst for a bad trip with any drug... Which I have learned from much experience with many drugs: LSD, mushrooms, 5-meo-amt, GHB, heroin, methamphetamine, ecstasy, cannabis, cocaine and a few others that I'm not going to take the time to recall.  Basically I know what I'm talking about. Prolonged states of lucidity and pseudo OBE experiences are possible from DXM. Music is extremely enjoyable, especially in combination with cannabis, and seems to permeate the neurosomatic barrier giving me the feeling of a 'voyage' via music. With high doses of DXM activity is futile, lending to the possibility of a musically guided trip. Weather affects my mood with psychedelics and the same applies to DXM albeit a disassociative. Tripping while it is raining is an indescribable experience on DXM.</p><p>All this being said I have definitely felt the effects of DXM on my brain. As an experienced DXM user I have an 'electric' feeling post-trip that lasts for about half a day possibly longer. During this 'electric' period brain activity seems heightened, much like methamphetamine: learning, talking, enjoying life is easier. After the 'electric' period I gradually return to baseline and very very mild depression may occur occassionally. </p><p>Long term effects from repeated usage/abusage is said to be unknown.  However, I know. Trouble finding words is a problem  (I know what word I want, however, it is just beyond my grasp), periods of panic (flashbacks), anxiety (not so much anxious; just sweating palms, fast heartbeat), mood swings, memory loss and overall diminished brain functioning. Please note these are effects of extreme abusage of DXM, and these symptoms were not experienced from occasional usage.  They can however become benign by enhance my 'spirit' and imprinting new behavior patterns on my brain through the use of psychedelics: LSD, Mushrooms. They may cause me to feel worse.</p><p>My general rule of psychedelics: if I feel good they will make me feel better; if I feel bad they will make me feel worse. They basically heighten whatever emotional state I am currently in, and my overall feeling of how my life is going.</p><p>DXM is pretty much the worst for my brain as far as long term effects go.....even worse than meth I would dare to say...</p>"
}
