{
 "title": "Ups & Downs",
 "author": "Drew",
 "citation": "   Drew. \"Ups & Downs: experience with Chloroform (ID 41415)\". Erowid.org. Jul 2, 2008. erowid.org/exp/41415",
 "substance": "Chloroform",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "25 ml",
   "inhaled",
   "Chloroform",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 41415",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 2, 2008",
   "Views: 24053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A friend working as a student tech in our biological sciences lab gave me a vial of chloroform -- it was about 25 ml. Willing to try anything at least once, I had a free Saturday to try it out. I did some research on the web but found little about it's recreational use. The goal for this first try was to get high but not to the point of unconsciousness. I decided sitting on a beanbag on a carpeted floor might be the best place to start just in case I got too impaired.</p><p>There's not much in the way of preparing to use chloroform. I simply put the vial close to a nostril and inhaled slowly. I am immediately aware of a sweet taste on the tongue which was more potent if I exhale through my mouth. The mood-altering effect of the liquid is instant. After three shallow inhalations, I could feel my skin warming up. I was very much conscious but had the experience of feeling extracted from the world. I was focusing only on the experience. I decided to breathe in deeply. It was a rush. I was still very much aware but focusing only on what I was doing. It wasn't just light-headed -- I had visual and auditory 'manipulation.' I inhaled twice more deeply then put the cap on the glass vial and set it aside.</p><p>There was no unpleasantness to the experience. Using chloroform has one side-effect that was the most positive of all. I realized as I was laying back, that I was having the most intense hard-on in my life. I swear to God I thought my dick was growing in width and length. Sex with my girlfriend was great -- she felt her lips (you know which ones) were engorging when she shared the vial. The only down side to the sexual experience is that chloroform wears off fairly quickly.</p><p>Another down side to chloroform -- and the one that made me stop using it -- was a medical problem. It seems that chloroform has one long-term problem -- it really screws up the liver.</p>"
}
