{
 "title": "Memories of Birth",
 "author": "e!s",
 "citation": "   e!s. \"Memories of Birth: experience with Nitrous Oxide & Cannabis (ID 41425)\". Erowid.org. Mar 11, 2010. erowid.org/exp/41425",
 "substance": "Nitrous Oxide & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41425",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 11, 2010",
   "Views: 7625",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nJust to set the context, I was with a group of friends smoking high-quality cannabis, of which I'd taken maybe 4-5 solid hits. Someone brought a box of nitrous oxide, which I'd tried once before and discounted as 'like being at the dentist.' <br>This time it was very different, and entirely unbelievable. I was pretty stoned and listening to the drum n bass we had playing. I took a lungful of nitrous and my whole reality suddenly disappeared, replaced foremost by what sounded like a fire alarm amplified ten times over. It was an incredible ringing bell-type cacophony, of course generated by the beat of the music, which had become much higher in pitch, subjectively. <br>My nervous system felt short-circuited, and every cell screamed in unison with the constant RING RING RING RING. By this point, all that I knew existed was a plane covered with checkers composed of triangles (square = 2 triangles) colored white, black, and green, tinged with red (from my closed eyelids), the ringing panic alarm, and this feeling I identified as 'pain,' or 'panic' transmitted from every cell in my body. That was the whole world for a moment. No body, no concepts, no understanding. Just the wide-eyed horror of the panic alarm and the checkers. <br>Suddenly, a very simple thought entered my mind: I'm being born. I suspect the component that triggered my 'memory' was the feeling of horror, or panic that I had, along with the emptiness of mind. I imagine that's what most kids feel like when they're thrown from selfless suspension (like a sensory deprivation chamber) in the womb, and into the cold, bright world, lacking any understanding of what is going on, and being entirely terrified.<br>Then I realized, I'm in this, not my infant self. So I wondered, how do I get out? Well, where was I? Oh, a party with friends. So I should be able to come back. Just by performing the act of opening my eyes, and leaning forward. So I did. And I saw a buddy nagging me for the balloon.\n\n\n"
}
