{
 "title": "My Failure and Success as an Individual",
 "author": "Mushrooms",
 "citation": "   Mushrooms. \"My Failure and Success as an Individual: experience with Mushrooms (ID 41447)\". Erowid.org. Aug 14, 2007. erowid.org/exp/41447",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41447",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 14, 2007",
   "Views: 2976",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm not some sort of drug afficianado. I smoked a lot of weed my first two years of university and drank a lot the last two, but I bristled at the thought of taking anything more severe. However, a group of 6 friends had found a chocolate-shroom hookup and I, for whatever reason, felt that this pallatable opportunity to try shrooms was too good to pass up.  </p><p>My friends recommended buying two chocolates (~full eigth) in order to ensure that I felt the effects, but I instead opted for just one chocolate to make sure everything went well. In hindsight I am VERY glad I only took one. We were all going to take the shrooms on a warm, sunny Saturday afternoon, but about half hour before we were set to trip, I got a call from some relatives about going to dinner. My friends had a great trip and recommended that I dose first thing the next day. I came home on Sunday, did some work, and ended up dosing at about 7 PM (it was dark, raining outside). </p><p>I had no clue what I was going to experience but two of my good friends (not on shrooms) were hanging out with me to see what would happen. For about 15 minutes after I dosed I was listening to some ambient music anticipating some visuals and euphoria while watching the Academy Awards. After about 15 minutes, an actress featured in black and white from the '40s suddenly appeared on screen and turned into a Goblin. I pretty much shit my pants while her face distorted and jumped out at me.</p><p>I quickly ran into another room to try to calm down and browse the internet. My mind was racing with thoughts and my entire body felt like it had been poisoned. Feeling sick to my stomach and unable to tolerate any type of noise, I ran up to my room and curled up, hoping to sleep off the intensity. I ended up laying down in a fetal position for about 20 minutes (T:20-T:40) trying not to vomit.</p><p>I've never felt so horrible in my entire life. I wanted to die. I'm not by any means morbid or sado-masichistic, but whenever I closed my eyes I saw rotting flesh and skinned animals -- it was ridiculous. While curled up I came very close to calling my parents to explain why their oldest son was going to die that night. I couldn't stop shaking and my thoughts and heart were racing. </p><p>I ended up walking back downstairs to watch some more TV and try to calm down, but I couldn't stop thinking about horrible things. I wasn't so much paranoid as I was completely obsessed with self-observation and self-criticism. While trying to watch some British comedies my thoughts kept wandering, exploring my behaviors, successes, and failures in an attempt to deconstruct who I was. I established that I was, inherently, pitifully and selfishly intent on self-preservation at all costs. I realized that, contrary to whatever persona I had maintained before, I was a coward. I systematically tore into my political, social, and personal beliefs, constructing a coherent argument for my failure as a person. Perhaps this experience was unique to me as I had recently been useing academic self-deprecation as an excuse for laziness, but nonetheless I was tearing into myself with such intensity and alacrity that I was alarmed. </p><p>My friends were worried by my inability to speak properly (my thoughts were racing too quickly for me to formulate a sentence properly), but could tell I was in trouble by the look of terror on my face. My entire set of life experiences and interactions for the past 21 years flashed before this little jury in my head as I broke down what was going wrong and why it was going wrong.</p><p>At about T2:00 I was at my nadir. Everything I had previously thought, my entire ego, had been erased. I was nothing and noone and I never would be and it scared me shitless. At the same time, I began thinking about how to improve myself. While my ego was nil (by ego I mean, what I desire and think based on what I believe or have been taught) I highlighted which traits and changes were positive and reorganized my perception of the world. I established a new set of precepts largely revolving around the themes of selflessness and acceptance and saw everything in a completely new light.</p><p>At this point, I began talking to my friends, who were terrified for/of me at this point. Using these precepts I had established just a few seconds ago, I had to re-learn everything about everything all over again. I realized that my previous ego and selfishness had forced me to be closeminded and judgemental and decided that being humble and completely open-minded would be paramount to my success as an individual. I felt like I had JUST been born again but with an entirely new perception of the world and my purpose in it.</p><p>I found that as I talked, or rather, LISTENED to people and probed their experiences with life, I could speak with PERFECT eloquence. I decided that my close-mindedness had even inhibited my vocabulary selection and made me unable to communicate with others effectively. This entire time I was shaking while just absobring knowledge and learning about everything all over again.</p><p>I ended up falling asleep at about (T5:00), unbelievably excited to wakeup the next morning and apply my newfound acceptance of everything to new experiences. Over the next few days I questioned the conclusions I reached and am still unsure if what I learned was real or if I was just going nuts for 5 hours.</p><p>I'm sure lots of psychonauts (or whatever they call themselves) would refer to my experience as the Deconstruction and Rebirth of myself and that because I became a better person it was a positive experience. I have become a better person, even if it's only subconsciously, and I have learned a lot about myself and how I operate because I was on shrooms and was temporarily psychotic enough to thikn about this kind of stuff. </p><p>However, the trip was SO intense and feeling my entire perception of the world unravel was NOT fun. I would NEVER do shrooms again because of what I experienced the first time. My friends who had tripped the day before all reported great visuals (and they'd taken more than I had) and an overall happy time, but noone had had an experience bearing any semblance to the one I had. I was shaking and wanted to die the first half of the trip and then was busy relearning everything the second half. </p><p>It was useful, perhaps necessary, but NOT fun. Others' experiences will undoubtedly vary from mine considerably, but if you have one of these intense thinking trips, goodluck.</p>"
}
