{
 "title": "Prescription for Hallucination",
 "author": "MJ",
 "citation": "   MJ. \"Prescription for Hallucination: experience with Bupropion (Wellbutrin) (ID 41444)\". Erowid.org. Jul 15, 2008. erowid.org/exp/41444",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "600 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   "  T+ 1:30",
   "1500 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41444",
   "Female",
   " ",
   "Not Given",
   "Jul 15, 2008",
   "Views: 14223",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: I love experimenting with drugs, alcohol, anything that can show life to me from a different perspective. One night, I lacked any 'real' drugs, and was feeling pretty desperate. I had heard Wellbutrin could be used recreationally, and decided to try it out. At the time I hadnt really read up on it. This was a gamble. </p><p>The Pill Popping Begins:</p><p>Around 9 I took a couple Wellbutrin XLs, 300mg per pill. After about 1 1/2 hours, I wasnt feeling anything. I was annoyed, and popped a couple more. Then a few more. </p><p>11ish PM. I had taken around 7-8 ((2100-2400mg)). I was on the phone with my boyfriend. We hung up at 12, and, not feeling anything, I gave up and went to sleep. </p><p>The Trip: </p><p>2AM. I wake up, and get out of bed to go to the bathroom. I fall down. Funny, I cant walk. I realize the pills must be kicking in. </p><p>I'm not *quite* clear on what I did all night. At around 3:45 I know I was reading rolling stone, and my mom got up. I started rambling about hate crimes against transsexuals to her. Hallucinations started sometime around then.</p><p>I went back to my room. At this point, walking was slightly difficult. I recall deciding that every day I would have a 'word of the day' so I went and got a dictionary. I printed out the word and definition for quixotic on a notecard. My hand shook and I could barely write. I would keep thinking people were in my room; I checked my closet and would whirl around to check shadows. I was scared out of my mind. This continued the whole night, puncuated by me attempting to sleep with no success. </p><p>At 6ish, I took a shower. When I got out, wrapped in a towel, I was so sure people were watching me that I pulled on clothes while hiding in the towel still. After dressing, I started feeling nauseous. I threw up 3 times. I couldnt eat, couldnt even drink water without feeling so sick. </p><p>At school I had the next 4 hours to sit and take standardized tests. Hell. I was still hallucinating. I had horrible dry mouth and nausea. I kept seeing a mouse under my teachers desk. Thank God I managed to supress the urge to yell 'Dude, theres a mouse under your desk' to my teacher. </p><p>I left at 12, too tired, sick, and scared to care about the next 2 classes. </p><p>I couldnt sleep that day, had a doctors appointment, felt like crap, and couldnt put a bite of food in my mouth till dinnertime. </p><p>All in all, a horrible experience. I later found out the dose I took was incredible but somehow I made it out alive. Hallucinations were terrifying. The experience was horrible, but taught me not to be so foolish with medication.</p>"
}
