{
 "title": "Greatest Experience Ever",
 "author": "JP",
 "citation": "   JP. \"Greatest Experience Ever: experience with Ecstasy (ID 4146)\". Erowid.org. Dec 8, 2000. erowid.org/exp/4146",
 "substance": "Ecstasy",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4146",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 8, 2000",
   "Views: 8917",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nJust last week my friend told me that he was getting several E pills, and wanted to know if I would roll with him. I have done acid and mushrooms before, but never tried ecstacy. I agreed to do it with him, but before I did, I researched it so I could somewhat prepare myself for what was comming. When the day finally came, I was excited, but also slightly nervous. I was at my friends house, and it was about 10:00 at night when he gave me the pill. I only took half, because my friends told me to, since it was my frist time. I swallowed it and sat down to chill for a bit. About 25 minutes into it I felt nothing. Allthough I knew it took at least 30 minutes to kick in, I hoped my pill wasnt faulty. About 15-20 minutes later a great warmth rushed through my body, filling me with a wonderful joy. I rubbed my arms up and down, feeling how good they felt. My friend noticed me and said 'your pill is kicking in'. I nodded my head, which felt amazingly good. I wanted to get up and walk around, feel things, smell things, do anything. I got up and noticed that just walking was fun. I could already tell I very much so liked this drug, and I was only about 15 minutes into it.</p><p>I looked out the window of his house and was amazed by how wonderful the outside looked. I wanted to run outside and lay on the ground to take in all of nature and be enveloped by earth. It was about 30 or 40 minutes into it and I had never felt so good in my entire life. I felt like I could say or do anything. I looked at my friends, who also had taken the drug at the same time. They told me to sit down and listen to some music, so I did. We turned on some Sublime, and my feelings were so intense and dramatic that I can not describe them. My whole body felt as if I was slowly comming apart, limb by limb, then going back together. I rubbed my hands together, noticing they felt like silicon or rubber, some sort of material that felt incredibly good to rub. </p><p>This was when I felt like I was about to explode. I figured I was at my peak, I could barely handle it. It was so glorious that I wanted to sing out in joy. But I just sat there, taking in all of it, letting my body feel etirely nice. I looked at my friend, and his body appeared to be outlined in red, and when I blinked I saw red flashes and dots. But then when I blinked again, it would be gone.</p><p>I could not express how greatly I felt, and I really hope to do this drug again (allthough I will wait for a while). Anyone who does ecstacy is very lucky, for it is, in my opinion, better than acid and mushrooms (or any drug for that matter) and easily the greatest experience imaginable. If I gave any advice, it would be do it with friends. If you are considering doing ecstacy, you will definitely not regret it.</p>"
}
