{
 "title": "Head-On Experience",
 "author": "Uncle Sweetshare",
 "citation": "   Uncle Sweetshare. \"Head-On Experience: experience with Tobacco (ID 41465)\". Erowid.org. Aug 25, 2007. erowid.org/exp/41465",
 "substance": "Tobacco",
 "bodyweight": "114 lb",
 "header": [
  [
   "DOSE:",
   "7 joints/cigs",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 41465",
   "Male",
   " ",
   "Not Given",
   "Aug 25, 2007",
   "Views: 21882",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The following is an account of the first real tobacco experience I had. I started smoking stogues (cigarettes) about 4 years ago, but always failed to inhale, fearing lung cancer, but never understanding why I was not receiving the head rush everyone else seemed to love.</p><p>It was a normal summer day of going to my friend J's house and buying a small sack of weed (today it was $40), and trying to make it last throughout the day & night. J had obtained a pack of Malboro 27's, a cigarette I enjoy more than the rest. At the time I had never felt the intense light-headedness everyone else loved stogues for, and I wasn't expecting to this time. After about a 30 minute walk to a nearby church while listening to J talk about how he thinks hes addicted, making up random facts to support his story. I was in a pretty good mind set, it was summer, no summer school and a little bank, and I was expecting a good time later that day. From what I remember it was just me and J, though my friend R may have been there too, I'm not sure.</p><p>Anyways, we finally reached the church and proceeded to wait for the dealer to arrive, and I decided to have a stogue to pass the time. I lit one and J kept telling me to inhale, and I kept replying that I was. Finally he put it bluntly: Hit it like your hitting a joint. I decided to give it a try, to hell with my lungs. I took a deep breath and immediatly felt a rush of harsh smoke stream down my throat, causing me to cough. At that second I remember thinking 'What a dumb fucking idea', but about 3 seconds after it had felt like I had been sitting for a day and stood up so fast it made my head spin. I had to sit, for fear of falling over. I continued to take huge drags, this time inhaling.</p><p>Finally our dealer come through and arrived on his longboard with the baggie. We paid him and he commented on me looking fucked up on something. I kept babbling about how cigarettes are opening my mind to a new extent, and kept stating that I could think of anything right then and there. I was proven wrong every time when J would respond 'Then think of something smart that will make us rich', and every time I found myself at a loss. Then J and me decided that I should smoke three stogues at a time to rocket my first experience. I was too light headed to argue, and had to admit it sounded like a good idea at the time. We originally decided for me to smoke 5, but my mouth couldn't steadily hold all those at once so we settled for 3.</p><p>Upon placing three cigarettes in my mouth J lit them all up and I took such a fat drag that I filled the empty church hallway with smoke. I immdeiatly felt like I was swimming in mid air, and seconds later found out I had let two of the three stogues fall from my mouth, each landing dangerously close to my clothing. J is the kind of person who would sit and laugh while watching you burn, so that could have been a fatal situation. Fortunatly I came to and gave him one while I smoked both of the others, one in each hand while taking drag after consecutive drag.</p><p>Finally we got to packing a bowl of some silver haze, some of the best damn marijuana I have ever tasted (still to this day, a year later). Walking home was hard, as I smoke stogue after stogue, and by the time we got to J's house, I felt some mild nausea. Which was OK, as we were planning to light a bowl as soon as we got to his room.</p><p>In conclusion, my first experience was a real good one, and to this day I smoke many, many cigarettes to try and get that state of light headedness. I've now found a love for rolling tobacco, as it is so much more effective its not even funny.</p>"
}
