{
 "title": "Riding the Wave of Humanity",
 "author": "Erich",
 "citation": "   Erich. \"Riding the Wave of Humanity: experience with Mushrooms & Cannabis (ID 41472)\". Erowid.org. Jul 15, 2008. erowid.org/exp/41472",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 0:10",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41472",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 15, 2008",
   "Views: 2224",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Additional Psychoactive Use:</p><p>Cannabis at T+10m, 2h, 4h (these times approximate, due to time dilation effects of primary mushroom dose)</p><p>My friend 'Mitch' and I acquired approximately 3.5 grams of an unidentified Psilocybe mushroom from a trustworthy source and then split the bag, each ingesting about 1.75 grams. We ingested the drug at about 12:30 P.M. on a Saturday afternoon, and shortly thereafter smoked a waterpipe of cannabis in order to ease into the drug mind state, a technique that has repeatedly worked very well for us. Other preparations included obtaining the Marijuana, selecting a large amount of music ahead of time in order to prevent having to search for CDs while under the influence, and selecting a movie (Fear and Loathing in Las Vegas) to view as the drug was kicking in. Precautions were limited to informing others (not present) of our ingestion and dosage and hiding our car keys so that a spur of the moment decision to drive somewhere could be circumvented, based on the assumption we probably wouldn't remember where they were while tripping.</p><p>This was my fourth and Mitch's fifth experiment with either mushrooms or LSD, and so we were pretty prepared for the experience. At about 40-50 minutes after ingestion and into Fear and Loathing, the 'body-buzz' effects as well as limited visual distortions began. By the time the movie ended, we were well into the trip. Despite the average size of the dose, we both experienced open-eye hallucinations in the form of cloud turbulence that could not possibly have been real, as well as the standard closed-eye geometric shapes and colors. The drug mindstate was also standard, but for the first time, I was able to hold on to enough of the ideas that I can reconstruct the thought process that I was going through. What follows are those thoughts, written in first-person and present-tense, which are pretty typical of the 'unity/connectivity' mind-state that has been common in my experience with these drugs:</p><p>Looking up at the sky and the trees, I realize how connected humanity is to nature, and then again in reverse to itself. How human existence may most of the time, especially in the depths of a psychedelic experience, seem to be impermeably objective, but that is really only an illusion. Humanity is nearly infinite in its majesty. Take love for example. The thing about love is that it seems so potent when you are smack in the middle of it; the person you love and are loved by seems like another part of you, and the only other part of the world that is real. The world exists only for you. What is so sad is how brief love is; it is over and done with in but the beat of a heart. It doesnt necessarily go out in a fiery crash either, many times, in fact most times, it just fades with a whimper and a breath. But that adds so much to the majesty of it, because something as potent as human love could never be so special if it wasnt so terribly fleeting. Where love goes is the great mystery. The scientific study of the Conservation of Energy seems to indicate that it must go somewhere, or implode. The fading out, the slow and steady dissipation of something as powerful as the most primal forces of nature seems inconceivable, but it exists. I know it. Ive been there.</p><p>And so have others, and thats one of the many things that binds us to the fabric of human experience. Maybe the way I am feeling now, simple, connected to nature, the only being in the world, isnt just the effect of a drug. I remember feeling this way when I was young and new in the world, and somehow I remember feeling it when I was old and senile and didnt know anything anymore except for these inescapable truths that only come to the young, the dying, and the tripping. And maybe that is the real experience this drug imparts. We are born unknowing and utterly subjective, rise above like the high notes of a classical piece of music into the world as members, ourselves, and players in the grand game. Then slowly, as even the most powerful note or highest wave, we fade back into the same state of innocence and wonder, before fading out once again into oblivion. The only way it seems we can approach this region of understanding and acceptance in the prime of our lives seems to be a pharmaceutical substance that renders our higher brain functions inoperable, or perhaps even obsolete. </p><p>And maybe that answers the first question, the initial query. Maybe like consciousness and power, love fades away into the fabric or the sea, or the divine orchestra of humanity. Normally this would seem like a silly concept, but in the middle of a drug experience it makes a certain sort of sense to me. We do fade, and so does love, but in a strange way its ok. That strength and energy goes to others, and we impart it with love and generosity, as well as a sense of wise envy for those just beginning the path that we have tread so long. And that has to make you smile. Its ok because despite the fact that the winter of my life has set in, that my love is gone, and that it is cold outside, somewhere it is not. Somewhere on this vast Earth there is a warm breeze wafting through dense trees. Somewhere birds are twittering and insects are buzzing while a young and innocent couple makes love in a forest clearing, thinking the world only exists for them.</p><p>As long as they are there somewhere and I am still human, I can still feel the buzz of that ultimate high. I am not empty or alone, but merely the base of a wave that they ride upon. So I give it to them with courage and faith, and a sense of wonder at the circular nature of things that seems to be so majestically divine, yet so utterly human. In a short time the effect of this drug will wear off, and I will return to the world of pain and despair, but for now, I am among my greatest loves, and I have nothing but gratitude for the whole thing. That at least, that sense of incredible luck that I am here, was there, and will be somewhere else, will stay with me long after the chemicals depart my brain.</p><p>While I was in this mindstate, Mitch was experiencing a 'so-called' bad trip, he believes caused by the film we were watching, and the intensity of it. He became trapped in a circular-thought pattern that he was unable to escape from, and ended up sitting naked in a bathtub while I was having the above experience. He was able after a time to recover, but the experience prematurely aborted his trip. I continued to experience after-effects for approximately 3-5 hours, for a total trip time of about 6 hours or so. The music proved to be extremely helpful for mood, but a film of significantly less intensity than the one we chose is recommended.</p>"
}
