{
 "title": "Dreams and Nightmares",
 "author": "G-Bot",
 "citation": "   G-Bot. \"Dreams and Nightmares: experience with Salvia divinorium (10x extract) & Cannabis (ID 41507)\". Erowid.org. Aug 15, 2007. erowid.org/exp/41507",
 "substance": "Salvia divinorium (10x extract) & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41507",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 15, 2007",
   "Views: 3368",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was my second time trying my recently purchased salvia 10x fortified leaf. However, this was my first time trying it with cannabis. I first smoked a bowl of marijuana, then about 10 minutes later took one hit the salvia 10x. Held the hit for 25 seconds and let it out. Here is what I wrote immediately after the trip. Unfortunately, I am not the best writer and what I wrote doesn't even come close to representing the true vividness and intensity of the experience. But here is what I wrote:\r\nI was sitting in a comfortable chair. The dream came on quickly. I barely had time to think before my mind was overwhelmed by new thoughts. After about twenty-five seconds, I realized there would be no second toke before the dream began. The gravity came down upon me like a falcon swooping for its prey at dangerously high speeds. I was pulled down and to the left, in a spiral which extended down beyond infinity into the depths of the earth. I fell, straight through floors, ceilings, walls, furniture, everything. Surely falling through the floor would hurt, but I could not feel the pain.\r\nI opened my eyes. I was riding a brown horse through the desert. Plateaus and buttes surrounded me. Up ahead, there was a strange creature at the edge of one plateau. I was dark brown and had scales like a reptile. Its face was in the center of its oddly shaped, almost spherical body. It had many arms, legs, and tentacles protruding from its body. I was drawn to it. I had to climb a strange vine to reach the creature. The leaves were large and veined, and colored a deep crimson. When I reached the creature, he turned to me and snarled, showing his massive mouth full of razor sharp fangs. I was filled with immediate, immense terror. I froze. There was nothing I could do. I fell from the vine, again pulled by the strange gravity. I spiraled towards the desert sands at an alarming rate.\r\nI opened my eyes again, but weren't my eyes already open? Was I still dreaming? I looked around, I was in my room. The walls had a different quality to them. Something was skewed. What exactly was it? Suddenly I realized that walls were crawling with billions of tiny bugs, almost invisible to the naked eye. They were crawling throughout the entire room. I had to find somewhere safe. There was no where to go. I crawled into bed and laid down, waiting for the bugs to dig into my flesh and consume me. As I closed my eyes, I felt a strong wind whirling around my room. It picked me off of my bed. As it carried me away, I could still see my body lying in bed. Then the wind stopped.\r\nI felt myself gently bobbing up and down. I was laying in a boat, floating down an underground river. Ahead of me was only the pitch black depths of the earth. I looked behind me. About 20 feet back, there was a woman standing the right side of the river. She was wearing a long, flowing, light grey nightgown. She had long black hair and a small, serenely beautiful face. On the other side, directly opposite her, stood Jerry Garcia with an acoustic guitar around his neck. The woman called to me, while Jerry softly played a symphonic masterpiece. The woman was calling to me, but I couldn't comprehend. It was jibberish, I had to get closer to her, but I was floating further downstream. Her voice slowly faded as she grew distant, and I could no longer see her. She was lost in the dense fog that had suddenly filled the underground cave.\r\nI fell unconscious in the boat. An indeterminate amount of time passed. Slowly, I regained consciousness. I opened my eyes to see that I was in my room again. Luckily the bugs had all gone back to their homes. Everything was normal again. True journey is return, as they say. The dream was finally over. Only, it wasn't a dream. If it was, it was certainly the most vivid, terrifyingly beautiful dream I had ever had. But it wasn't. It was a real journey. The depths of the human mind is not something take lightly. Scientists say nothing is infinite in the universe. Well, infinity does exist. It's in everyone of us. Most just don't know how to perceive it. But it's there. I've seen it.\n\n\n"
}
