{
 "title": "Luck of the Irish",
 "author": "Margo",
 "citation": "   Margo. \"Luck of the Irish: experience with Acacia (ID 41519)\". Erowid.org. Sep 7, 2005. erowid.org/exp/41519",
 "substance": "Acacia",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41519",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 7, 2005",
   "Views: 17774",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\nWhen I told a friend I was having problems with excessive marijuana smoking, he told me that acacia would solve the problem.  Later that same day, another friend showed up at my house and I asked him if he'd heard of acacia. He said, 'I have some on me!'  A fine synchronicity indeed.\r\nBefore I indulged I felt that something big was in store.  My heart began pounding and I had a thought that this trip would be about connecting my solar plexus chakra (seat of will power) and my heart chakra (seat of love).\r\nI inhaled two big tokes.  An intense sensation of buzzing sound and organic/geometric patterns and colors appeared.  The energy was intense and I got a message to surrender to it.  Many more messages came through next.\r\nI realized that in many ways a weak will has caused intellectual and energetic stagnation in my life for the past few years.  Too much pot smoking certaintly doesn't help with motivation!  I realized that an intestinal condition I've had for the past 3 years was directly connected to this stagnation and the pain there released itself!\r\nI felt heat & energy in my solar plexus and as this chakra opened I could feel that this is where I have been blocked.  I received the message that I can bring my excess mental energy DOWN to my heart & my excess sexual energy UP to it.  \r\nAnother message:  the only thing I need to concern myself with is to radiate from this heart center & live in the moment, as everything else will blossom from that.  I have recently made big changes in my life (quit corporate job & am freelancing from a forest cabin) and though it was a rough transition, I am now very happy and in awe of how cool my life has become.  Radiating from the heart will not be difficult.\r\nI decided to meditate & focus on the color green, which is the color for the heart chakra.  I then saw two infinity symbols radiating from my heart, in the shape of a 4-leaf clover.  I am mostly Irish by heritage and have been identifying with this symbol lately.  It's my avatar on online messageboards!  I have also been reaching out to my ancestors in meditation.  I realized this symbol is ancient and powerful as it can help me remember my heart!  \r\nThis also happened the day after St. Patrick's Day...\n\n\n"
}
