{
 "title": "Perfect Somatic Ecstasy",
 "author": "Alex",
 "citation": "   Alex. \"Perfect Somatic Ecstasy: experience with Blue Lotus (tincture) (ID 41530)\". Erowid.org. Mar 13, 2007. erowid.org/exp/41530",
 "substance": "Blue Lotus (tincture)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "0.5 oz",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41530",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 13, 2007",
   "Views: 24250",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Set: very focused  extensive study of Satanic theory during the day had primed me for a positive experience </p><p>Setting: my room  doors locked  lights on  music blasting</p><p>DOSE: 1/2 oz.\tOral\tBlue Lotus Extract</p><p>This was probably the most positive entheogenic experience I have ever had.  30 minutes after ingesting the lotus seed tincture, I felt a warm glow of happiness, contentment and energy flow through my body, charging my circuits like a hot battery.  The music I was playing on the system had never sounded so good, and I had never felt so alive simply sitting still.  I put on Lateralus by Tool and just let myself get carried away by the music.  Every impulse to jump, twist, bounce, bend, clench, scream, laugh and contort was completely fulfilled.  It was a shamanistic, cathartic purging of emotion through physical expression.  I paid no mind to what I would look like to outsiders; in my room, behind my locked door and the deafening scream of Maynard, I was free.  </p><p>The philosophical insights of the Satanistic theory were just starting to set in; and in this animalistic dance of fury and exaltation, I truly gained a higher appreciation for my Self, for the power of solitude and personal, inner, incommunicable experience, and for the power of Entheogens and music in blissful combination.  During Parabola, I visualized my Self as the center of all creation and the universal energy permeating the cosmos.  Every word was screamed in unison with the speaker, every nuance absorbed through the pounding of the subwoofer and the clenching of my fists on the desk.  I sat, head bowed, letting the music stream over me, dominate me, strike me like a bomb.  I have never before heard Tools music in such greatness.  The next song, Im the Supervisor by Infected Mushroom compelled me to perform a frenzied dance of insane undulations and rapid jumping motions.  Afterward, I felt cleansed and extremely thankful to have been gifted with such an opportunity.  All praise the lotus!</p>"
}
