{
 "title": "Not a Very Good Combination",
 "author": "Biscuit",
 "citation": "Citation:   Biscuit. \"Not a Very Good Combination: experience with LSD, Oxycodone & Cannabis (ID 41565)\". Erowid.org. Dec 7, 2006. erowid.org/exp/41565",
 "substance": "LSD, Oxycodone & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(pill / tablet)",
   "  T+ 0:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:30",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41565",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 7, 2006",
   "Views: 27058",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis all started with Spring Break.  I went to visit one of my buddies in a neighboring city a few days before the start of Spring Break.  While I was visiting I ended up purchashing an Oxycontin 80mg.  I snorted roughly 60mg while I was in town and saved the last 20mg for a 'rainy day.'  Well this happened Thursday night and I arrived home Friday midday. \r\nWarning - Drug combinations don't always turn out pleasant.\r\nAt around 3pm after I'd awoken from my nap I decided to snort the last 20mg I had and then smoke a bowl of chronic.  I had also purchased 5.2 grams of dank while I was out of town.  I snorted the oxy and then smoked the bowl.  Around 5 minutes after I smoked the bowl I was pretty wasted.  I have had a high tolerance to opiates in the past but for some reason this small dosage really got to me.\r\nI ended up leaving my house at around 5pm and hung out with my friends D and W.  D told me, after we'd been driving around for about ten minutes, that he'd sell me two hits of acid.  Well, I do love my acid so I bought them both and dropped them at around 7:30pm.  Now, the really weird part about all of this is what happened next.\r\nI could still feel the oxycontin for some reason.  It usually wears off in about 3 hours or less but even after I ate the acid, I could still feel it.  I felt the acid start hitting me at around 8-8:30pm.  But the come up was different than it usually is, instead of feeling the 'up' and giddiness of LSD, I felt the oxycontin kick in again.  It was probably the weirdest thing that has ever happened to me on an acid trip.  It was like I had just gotten done snorting it all over again, like the LSD re-activated the remaining oxycodone in my system.  Pretty soon I felt like I couldn't walk.\r\nThe acid I'd gotten from D was fairly strong and soon I was tripping my absolute nuts off.  The oxy feeling wore off at about 9:30pm, finally.  It was then that the confusion started.  Acid has a way of getting into my head and making me think crazy thoughts.  I was sitting in my friends room smoking tree and watching television when all of a sudden a car pulled up to his house.  It was a relative, and we had to hide the pot before he came in.  Once he left, I couldn't find my bag.  I was totally convinced the people in the house were fucking with me and hiding my weed.  As it turns out, it had just been misplaced.  While we were in the house I felt the first waves of visuals and emotions that usually hit me on acid.\r\nA blanket of rainbow-colored lights descended on the carpet and the titles of books seems to beam out like halos from the shelf.  The faces on the TV shift and collapsed in on themselves.  The walls twisted and made waves like an ocean.  Finally, when it was time to leave the house, I looked at the stars.  The moon was particularly bright and the stars looked an erie shade of green.  As we drove away, the trees rose out of the ground to meet the sky and I felt very small and perhaps insignificant.\r\nMy sober driver transported me across town to a neighborhood that was fairly quiet.  At least, it's a place where you can get high in peace.  And that we surely did, I noticed later that I had easily smoked a gram that night.  So after that I decided I might as well go back home and ride out my trip.  I arrived home to find the house empty, my parents were obviously still out and as I was in college anyway it didn't really matter.  I started to walk around the house and noticed that it felt like I was wading through some kind of muck.\r\nAll of a sudden I had a vision in my head of all of my childhood problems.  The muck represented all of the bad things that had happened in this house when I was younger.  I had been going through a lot emotionally and I figured this was just the acid getting in my head again.  I sat out on my porch for a long time smoking cigarettes and trying to maintain.  I pulled my stereo onto the porch with me and put on some moe. to try and calm me down.  Eventually, at about one am, I went back into my room.  It had only been about four hours since I started tripping and I knew I still couldn't sleep.\r\nI watched TV for a good three hours trying to stay sane.  Every once in a while the thoughts in my head would gain a voice of their own.  It felt like there was someone else invading my skull and trying to shout down my opinions.  It was a very odd feeling.  Every time I drop acid it only reinforces my original opinion about the drug; that it makes you go crazy.\r\nI'm not sure why the oxycontin and LSD reacted to each other the way they did but I don't recommend that combination to anyone.  Coming down from oxycodone and coming up on acid at the same time will fuck with your head.  You feel the shitty after-effects of the opiate along with the coming up effects of LSD and it all leads to confusion and frustration.  LSD and cannabis is probably your best bet if you're going to combine anything.\r\nI thought it might be useful for some people if I wrote what I had combined with acid and its results.\r\nLSD+Cannabis - makes the trip more bearable and amusing, tends to intensify visuals and takes the edge off\r\nLSD+Alcohol - can be fun on the come down, although being drunk in the middle of a trip can be really disorienting\r\nLSD+Cocaine - tends to make people megalomaniacal and can be very dangerous, because you can feel every individual drug you do on LSD, you also feel the come down from cocaine, and the LSD only intensifies the craving for the drug\r\nLSD+Opiates - see above\r\nLSD+Valium/Xanax - Although this does take the edge off of a trip, it can also lead to more problems, coming down from valium and xanax while on an acid trip can make you extremely irritable\r\nLSD+MDMA - candyflipping can be fun and it can be intense, I don't recommend it but I did have a good time\r\nAll in all, I think LSD is best when it is taken by itself or with cannabis.  All other drugs seem to get in the way of the wonderful experience acid can be.\n\n\n"
}