{
 "title": "The Gift of Reality",
 "author": "Leo",
 "citation": "   Leo. \"The Gift of Reality: experience with Salvia Divinorum (20X Extract) (ID 41619)\". Erowid.org. May 20, 2007. erowid.org/exp/41619",
 "substance": "Salvia Divinorum (20X Extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41619",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 20, 2007",
   "Views: 3561",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe gift of reality\r\nIt really didnt seem to be the ideal time to try Salvia; I was currently involved in a disagreement with my two friends and hadnt seen them for a while. I took my wife with me to the smoke shop to buy some, and she totally gave me a real hard time about buying it, she did not like the idea of spending the money on it. She did say she wanted to try it with me when I told her about it a while back, but I dont think she believed I would really do it. It was something totally unpredictable for me to do. The last time I had even smoked a joint was like 30 years ago, because every time I would smoke I would have flashbacks from a bad LSD trip I had had. You can read about that trip in the LSD reports with the title Daylight. I had after that became a Christian and the last time I had drank any alcohol was 25 years ago.  Now in this stage of my life I have recently been questioning my beliefs regarding Christianity, and a lot of other things, I felt as if at this time of my life I had a lot of problems, financially and with friends, and with repairs needed around the house and with my vehicles.\r\nI planed to do it after dinner, while eating dinner my wife continued to argue with me about it, and knowing from reading the reports I should definitely have a sitter, I didnt really have any one that I really trusted to be a sitter, so I decided to have my wife sit, but as she argued with me I told her that she was going to cause me to have a bad trip.  She reluctantly agreed to sit with me, and I filled her in that she should not panic and remain calm no matter what would happen, which is something that she would not usually do, I realized that the situation was probably not the best, but I knew that it would probably never get any better so I might as well do it under the present conditions.  \r\nBeing in Arizona we went to a desert kind of park, it was a secluded part of the park underneath some trees there was a picnic table I sat on the ground against one of the post of the covering over the picnic table. My wife sat next to me on the bench. From reading the reports I was trying to approach this whole thing reverently, I had asked Jesus to put obstacles in my way if I should not do it, and right before I took a hit I invoked Lady Salvia to be kind and gentle to me.\r\nAs I took a hit, my thoughts were that it kind off tasted and reminded me of smoking pot. I sat there about a minute wondering if anything would happen or if I would need to take another hit, I read that sometimes not much happens, but quickly I realized it was working.  At first I was kind of frightened as I felt something happening, but I just decided to relax and go with it, even though I had the feeling I had just done something that I might regret.\r\nAs I slipped away from reality I felt as if I was slipping in to a new reality the reality that was really real and was there all the time. My problems seemed to disappear it seemed that they werent ever real any way and that my former reality was always just an illusion. And I was returning to the real reality. It seemed that everything that had ever happened to me led up to this point. All that happened is really hard to explain but I will do my best. I seen that all the people who told me not to smoke it before I did was realitys safeguard to try to keep me in the reality that was an illusion, and now that I had went past all the warnings, The illusion of reality was coming to an end.\r\nIt felt like I was on a carnival ride that I chose to end too soon, or like a movie that ended before it was over. I thought that I would never again see my old reality again. I thought of a lot of things and thought about how they were all illusions. I even thought of the trip reports and thought they were all part of the trick to get me to end reality. I felt really sad that my former reality was now gone forever. What was happening while I was having these thoughts was that I was actually a part of a meteor flying through space.  My former reality made up this meteor, Ahead of me my reality was breaking up as it flew through space, and the part of the meteor where I was, was the part that was now starting to break up.\r\nMy legs and arms were starting to dangle out in space with the rest of me soon to follow and then I believed all reality the new and the old would cease to exist. I looked back and I seen the reality that had not broken up yet, but would eventually break up and cease to exist also. I heard some kids playing in the park screaming, but it turned into the sounds of others who were apart of the meteor screaming as they realized that there realities were breaking up. I was comforted looking behind me and seeing reality still there. My wife was rubbing my hair and my face trying to comfort me telling me not to worry and that everything would be alright. I had seen that all through time she was meant to sit at the edge of this meteor to comfort me at this frightening moment. I actually think Lady Salvia possessed her at that moment and was using her to be with me and gently show me all this because I had approached the whole thing reverently and asked her to be kind to me.\r\nI had also seen that she prepared a lot of other things before I had even smoked like the guy at the smoke shop recommending how much to smoke, He told me just to smoke a pinch, I would have smoked a full normal sized bowl.  It was just the right amount. Id hate to think what it would have been like if I would have smoke a bigger bowl. I would say the trip lasted about 10 minutes, I wasnt really sure if it was over when it ended, I was afraid to talk or do anything for another about ten minutes because I had this feeling that things might just start breaking apart again. I asked my wife if it was over thinking that she really knew what was going on and she was all a part of it. As I was returning I felt very glad that reality was not really over for me, I felt that I had to go and talk to my 2 friends, one I needed to tell him he needed to appreciate reality more and my other freind I needed to tell her I could never be mad at her because I felt a bond with her that her and me are so alike trying to figure out what is going on in this crazy world and are positions in the universe together is to watch each others backs and to try and protect each other.\r\nWhen we got over their house (They are husband and wife) I told them about the experience, after the intensity of the trip I would be afraid to be responsible for letting any one try it, But I did let my one friend try it because I thought that he needed to learn the same lesson to appreciate the gift of reality. He tried it but it didnt seem to have quite the intensity, but it was clear that something was happening to him. We made up and kind of joked about how it was like smoking a peace pipe.\r\nThe biggest lesson I learned was to appreciate the gift of reality, I dont really understand why I actually was allowed to continue this reality. So it is a real gift to me.  My experience did not really give me any great insight on what my purpose was or what I should do about my problems; it did not at all conflict with Christianity or religion. It actually strengthened belief in God, because something or someone had to be responsible for constructing this reality and letting me back in to it. I think Salvia compared to LSD was kinder in showing me terrifying and sad realities, Also with LSD it seemed to make me convinced while I was tripping that there was no God.  Now a few days after my experience, everything is back to normal, problems are still there, everything actually feels even more real. I am looking at everything differently though, I feel no need to try it again I feel Lady Salvia showed me all I needed and did not invite me back.\n\n\n"
}
