{
 "title": "Dizzy, Stoned and Disassociated",
 "author": "Gulag",
 "citation": "   Gulag. \"Dizzy, Stoned and Disassociated: experience with Heroin, Cocaine, DXM, Cannabis & Clonazepam (Klonopin) (ID 41623)\". Erowid.org. Mar 25, 2008. erowid.org/exp/41623",
 "substance": "Heroin, Cocaine, DXM, Cannabis & Clonazepam (Klonopin)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "DXM",
   "(capsule)",
   "  T+ 0:00",
   "  ",
   "IV",
   "Heroin",
   " ",
   "  T+ 2:00",
   "  ",
   "IV",
   "Heroin",
   " ",
   "  T+ 2:00",
   "  ",
   "IV",
   "Cocaine",
   " ",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:00",
   "2.0 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41623",
   "Male",
   " ",
   "Not Given",
   "Mar 25, 2008",
   "Views: 11736",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took a whole gar of rob-gels at 6pm and did my first shot of dope (a dime) and a bowl of weed. Nice rush but not enough to get a nod. Slightly above average street dope from NYC. Waiting for the DXM to hit was a while, maybe 2hrs as I recollect. Smoking a joint at this juncture was a mistake as it made me really dizzy. I decided a speedball would clear that up.  I did a shot of twenty each of H and coke.</p><p>Well, it did and it didn't, the H must've reacted with the somewhat opoid cousin DXM to get me even dizzier, and the coke just added an element of stimulation and enhanced visuals. I was in a heavy place and I was around people who, while hard trippers, were not into smack and coke so I couldn't relate what I did to them outside pot and DXM. I decided to be alone and wait it out. It wasn't unpleasnt, just very stoning, and the speediness was of the sort where I cannot function but need to sit and let it take me, like taking too much dexedrine.</p><p>So there I was, chewing my lips like Bling Bling the crackhead and inhaling bowl after bowl of nice dank weed. It was making me spin like cheap wine, but the speediness took precedence and needed cooling off more than the opoid/dissassociative side of things. The closest I can compare that to is like barbiturates and ketamine, a bad mix I had the stupidity of trying a while back. Finally a close friend found me and deduced on his own that I speedballed on top of the DXM, and gave me two 1mg klonopin. If he hadn't given me these I would have chewed my tounge off and gone into and ego-less, wired purgatory for life. The klonopin put just the right edge on things, and the whole DXM-insight thing could now be enjoyed for the rest of the night.</p><p>For two days after, whenever I took my methadone or did and oxy or some H I got that spinning, dizzy barbiturate high. I think the DXM intensifies heroin. They intensify each other.</p>"
}
