{
 "title": "The 20 Hour Nightmare",
 "author": "Bee Gee",
 "citation": "   Bee Gee. \"The 20 Hour Nightmare: experience with Salvia divinorum & Amanita muscaria (ID 417)\". Erowid.org. Jun 29, 2000. erowid.org/exp/417",
 "substance": "Salvia divinorum & Amanita muscaria",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Amanitas - A. muscaria",
   " ",
   " ",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 417",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Jun 29, 2000",
   "Views: 62350",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMyself and a friend of mine recently decided to experience Amanita muscaria, so we placed an order and both consumed around 10 grams each. Roughly an hour and a half later I began having a very pleasent mellow trip. It seemed more relaxed than any other hallucinogen I have ever done, because I was able to think and speak much more clearly than LSD which can sometimes overwhelm me and leave me speechless, but the Amanitas did not and I really enjoyed the trip until I decided to smoke some Salvia. I loaded a full bowl in my water bong and took two deep hits and held them in for awhile. About 5 seconds later my mind began racing out of control. The first thing that crossed my mind was this is never going to end, I stumbled to my quiet dark room to try and get control of my head, but as soon as I laid down my mind (and there's no other way to describe it) got caught in a loop of thought so all I could do was think about the same thing over and over again. My mind was caught in a loop and I thought I would be forced to think the same thing over and over again for the rest of my life. It took me into a whole other reality where I had no control of my body or mind. It was like being caught in a waking dream that basically caused me to go completely catatonic. Nobody could get through to me. This went down around 11:30Pm. My roomate went to bed about 1 AM and when he went to sleep I was sitting on the couch with a blank stare on my face lost in the recesses of my mind. </p><p>When my roomate woke up around noon the next day I was sitting in the same place with my eyes wide open and still totally unreachable. The only reason I can relay this is because this is what I was told I have no memory from right after I took those two hits till about 6 Pm the following day. As I started coming around about 5pm the next day I truly start feeling terrified all over again because I was stuck in between two realities and I felt like I was moving through time differently than everybody else. I started coming out of the haze totally confused and oblivious to what the fuck happened for the last 20 hrs of my life. All I remember is thinking that I had figured out something very profound like a simple truth that would explain everything in life, but I could think of nothing else. It was hell folks. Eventually I tried to sleep but I would lay down and ten minutes would pass but it felt like I was away for hrs. At one point I came out of my room and asked my rommate how long I had been asleep (I thought it was the next day) he replied its been only ten minutes. So I decided to do what I should have done the night before but couldnt and thats pop some Xanax. Usually two footballs put me out but it took 8 of them to finally put me to sleep. As soon as the Zanax kicked in I started feeling normal again but I felt mentally shattered. I have no clue what caused this catastrophy, I felt like I was the brink of insanity when I was coming round, I realized my own mortality very quickly. The best explanation I can come up with and I would like help if anybody knows, is that the salvia was magnified by ten fold by the A. muscaria because very high doses of salvinorin A took people totally out of reality but for 20 hrs? and only two puffs of salvia. Whatever did it beware to all, nobody should have to go through that. If anybody knows why a bomb went off in my head when combining Salvia and Muscarias please reply in a post, this was the most profound and shitty experience of my life.</p>"
}
