{
 "title": "Skydiving on Ecstasy and Beating Tobacco",
 "author": "Desert Diver",
 "citation": "   Desert Diver. \"Skydiving on Ecstasy and Beating Tobacco: experience with Ecstasy (ID 4170)\". Erowid.org. Dec 10, 2000. erowid.org/exp/4170",
 "substance": "Ecstasy",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 4170",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 10, 2000",
   "Views: 10854",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI must first give a brief background on my drug use before submitting my experience.  Prior to my skydive on MDMA, I had taken X about 30 times in the previous year.  I had also been a tobacco smoker for over 3 years.<br>I started planning for my e-dive 3 weeks in advance.  First, I had to make sure I was taking a good pill.  I bought two 4-leaf clovers and took one the next night. It was the best, and I believe most pure, pill I had ever taken.  So I was set as far as the drug itself went.  <br>I must also explain that I had never been skydiving before, and I was searching for the ultimate rush (obviously).  I called a skydiving resort near my home and asked questions concerning my dive.  The first thing was I wanted a tandem dive, which consists of a professional diver strapped to the first-time diver's back to assist in pulling the ripcord for the parachute and in steering towards the landing spot. This was obviously for safety purposes. Also, training was less time consuming for a tandem dive.  I also asked how long I'd be waiting to jump from the time I arrive and check in.  If you're an experienced user of E, then you know there is only a certain time frame for the peak effects.  So I made the appointment for two weeks later and I was set.<br>I arrived at the diving center at ten minutes until 10 am on a monday morning, when I expected it to be the least busy.  I checked in, and saw there was only one person diving with me.  The instructor asked if anyone had to go to the bathroom before we got started, so I said yes, went into a stall, and popped the pill at 10 exactly. <br>The training took about 40 minutes, and the other person jumping volunteered to go first (we had to go in separate planes).  I finally got into the air around 11:15 or so, and I was rolling so hard, at my absolute peak.  I couldn't have timed it any better, or gotten luckier for that matter.  <br>The instructor and I waddled up to the open side of the plane with him strapped to my waist and we squatted down. He leaned his weight on me, and we fell out of the plane at 13,000 feet.  The next thing I know I'm falling in spread-eagle formation at 110 mph with my jaw wired open blowin up harder than I ever thought possible.  I didn't even have to breathe very deep because air was getting shoved down my throat so fast.  All I could hear was the wind just screaming in my ears.  My whole body was numb, and the view I had of the whole scene (mountains, little square farm plots, and a tiny little town to my right) was slightly covered in a white haze and my vision was slightly distorted, which I expected under those circumstances.  I shut my eyes to see what that would be like in the freefall, and about 3 seconds later the instructor pulled the cord.  All the noise stopped, I was sitting upright, and I had a serene 5 minute ride to the ground on a beautiful day in the desert.  <br>The intention of me doing this was to have the hardest blow up possible at the peak effects of ecstasy.  I believe, without a doubt, that I achieved this.  I will never do it again, because I know it won't be as good the second time.  I did get a bonus for my efforts though. I had a tobacco habit of about 3 packs a week. I had a pack of cigarettes for my roll, as I always do.  I smoked on my way home and in my afterglow the rest of the day. I had three left when I woke up the next morning.  I lit one up on my way to work and noticed that I wasn't getting any type of physical pleasure from my cigarette.  No relief, relaxation, nothing at all.  I finished the pack at work, and still nothing.  The remainder of the week I had no physical cravings whatsoever.  Apparantly such a small rush created by nicotine no longer pleasured my body after such a powerful experience.  Now all I had to do was beat the mental habit (smoke on my break, after meals, etc.), and that was the easy part.  The physical addiction was gone.  So I successfully quit smoking after trying on and off for the past year.  I'm not recommending this as a cure for smoking, e-dive at your own risk, but man, what a RUSH!\n\n\n"
}
