{
 "title": "Euphoric Haze",
 "author": "Curiosity",
 "citation": "   Curiosity. \"Euphoric Haze: experience with Zolpidem (Ambien) (ID 41707)\". Erowid.org. Jan 9, 2007. erowid.org/exp/41707",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 1:30",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41707",
   "Male",
   " ",
   "Not Given",
   "Jan 9, 2007",
   "33609",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Alright guys, I was having severe insomnia, there was a stretch of 3 days with NO sleep, so the doc threw me on 10 mg of this special little pill called ambien. Well it turned out I didn't need this perscription for the full 30 days, I had only taken 6 of them. After having the stuff for a couple of weeks unused, my girlfriend complains that she is having insomnia, so I give her some, she told me the next day that she stayed up on it for a while, and it was best high she has ever had. She said that she would zone out and she felt physically great, she was basically numb. So this is where my experience begins.</p><p>The next night I decided that I was going to trip this stuff. I thought that I had probally gotten used to the 10 mg, so I decided to take another pill. It was really the perfect night to do it too, parents were gone, it was a Friday night so everything was basically perfect. I wish that my girlfriend had been there with me, but I'll get to that later. It was about 10:00 at night and I was sitting on my couch watching jimi plays berkley, about 15 minutes from the time of taking the stuff, I started to feel lighter, like I had before, except this time I wasn't going to go to sleep.</p><p>My body started to go a little numb, but not like a tingly numb that I've gotten from pot before, it was a comfortable numb. I was just sitting on my couch watching hendrix play and everything sounded so good. I was listening to the opening riff to purple haze, and then I kind of just dozed off, It felt like I had dozed off forever, by the time I came back I was listening to the ending solo on voodoo child. It wasn't scary to me at that I had blacked out, becuase everything seems to be ok and beautiful on ambien, you are completley euphoric.</p><p>I have expierimented with oxycodone and other opiates, pot, coke, and shrooms, and nothing that I have ever done has made me feel as euphoric as I was feeling. At the time I was going through a lot of shit with my parents and my girlfriend, but nothing mattered while I was on that stuff. At about 11:45 when the dvd ended is when the real fun started.</p><p>I stood up from the couch to do something, and to this day I can't remember what it was I planned on doing. When I got up I went and got Pink Floyd's The Wall and took another ambien, but for some reason I don't think that was really my initial intention to do when I got up. I went to my dvd to put in the cd, put I remeber the open/load button kept on raising and sinking in, and I kept on trying to press when it wasn't moving but I could never get it. The damn button finally stopped raising and sinking, so I went to go press it, and then suddenly it would switch spots with another button, so I'm at my dvd player thinking I'm playing that little game where you have to hit the mole when it pops out from the ground.</p><p>I finally get the damn thing in and sit on the couch. I turn on comfortably numb, and before I was zoning out not really paying attention to anything, but I swear that song was made specifically to trip on ambien. I was listening to it and everything that was going wrong in my life suddenly disappeared. Nothing was bad everything was good. I remember the room went kind of hazy like there was a white haze that had come in the house, and suddenly everything was distant. I don't remember much of anything for about an hour.</p><p>When I came out of this dream state it was about 12:50, and I was still euphoric. Except instead of being completley dazed I was aware of what was going on, but I still had the same euphoric thoughts. I felt like I just smoked a joint. Then for some reason I got all fucking touchy feely, thats when I got up to use the phone, at least attempted to. I went to pick up my legs to walk to the phone which still seemed a little more distant that ususal. I finally got up and the room started to shake it felt like, now that I think back it had to have been my legs wanting to buckle. I had to lay back down, there was no way to move. Thats about it, thats my trips I'll go ahead and list some pros and cons.</p>"
}
