{
 "title": "Posterized and Tinted",
 "author": "Matchstick Man",
 "citation": "Citation:   Matchstick Man. \"Posterized and Tinted: experience with LSD (ID 4171)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4171",
 "substance": "LSD",
 "bodyweight": "142 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1997",
   "ID: 4171",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 25, 2001",
   "Views: 4229",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis was the first LSD experience I had. I was 18. What's kind of interesting is that it was the first real experience with any psychoactive drug I'd had (save for alcohol once when I was 12--different story). I was very straight in High School. I never went to parties, never smoked cigarettes or pot and never drank. I was in good physical condition from working out and running every day... Still, I always loved the culture that seemed to surround acid and wanted to get the inside scoop. An acid fiend I was friendly with gave me a tab which I kept in a little box under my bed which I finally opened one school Sunday. I gathered suggested materials (Sgt. Pepper's Lonely Hearts Club Band, copy of Yellow Submarine) and set off for my friend's house.\r\nI was a little worried because of my lack of experience. None of the drug veterans could relate to me the acid experience to their own satisfaction, but still I was excited. I wanted to see pink clouds swirl around my feet and obscure the ground like a foot of snow and watch tree trunks turn into tornado funnels.\r\nAnyway, I went to my best friend's (a seasoned acid veteran at the time) and put the tab on my tongue as we sat in the wilderness next to his house listening to Mr. Bungle. I drew a little in my sketchbook. An hour passed and the lack of any effects made me worry that it was a dummy tab, or maybe that I was in such good physical condition that the dosage didn't affect me. Two hours passed and we headed back to his house, I guessed I got burned.\r\nAs we ascended the stairway, I looked out the window at the green foliage across the cul-de-sac and felt an inexplicable urge to smile. The image was high-contrast and high-saturation, like the super-glossy cover of some pop album. 'Uhh, I definitely think this stuff is working', I said as I ambled into my friend's room and plopped down next to his bed and watched how the colors were altered and intensified as if under a tinted glass. \r\nBasically it was really fun. At the time I felt bad for doing such a thing to my body but looking back I don't regret it. My friend drove me to a house for some reason where a family was gathered for Superbowl Sunday and I saw the sunset under the effects of LSD: Looking down on the landscape from the hill, horizontal strips of it appeared to be separate and closer than the others, as if the whole image was an illusion concocted inside a stereoscope. Later when I was peaking I saw clouds in the sky turn into trilobytes as Led Zeppelin played on a stereo. Though it was familiar, I perceived passages of music within it that I hadn't before. The comedown was bad but my parents never suspected anything and I had a friend help me through it.\n\n\n"
}