{
 "title": "Experimentation, Relaxation",
 "author": "Ravus",
 "citation": "   Ravus. \"Experimentation, Relaxation: experience with Sceletium tortuosum & Kratom (ID 41712)\". Erowid.org. Oct 11, 2005. erowid.org/exp/41712",
 "substance": "Sceletium tortuosum & Kratom",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 line",
   "insufflated",
   "Sceletium tortuosum",
   "(ground / crushed)",
   "  T+ 2:00",
   "6.0 g",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41712",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 11, 2005",
   "Views: 23729",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nOn this day I was in a mostly neutral attitude, pretty bored as nothing had happened, but I had a shipment of herbs coming in. Among them were Nelumbo nucifera stamens, Klip strain wild dagga, syrian rue, kava, and others, but the two I tried this day were kanna and powdered kratom.</p><p>I started by creating a line of the powdered light green kanna, pulled out a couple small stems and insufflated it with a $20 bill. It surprisingly was smooth to insufflate at first, and while I did sneeze a bit later, and have a sour drip, it was tolerable. After snorting the kanna, I went on the computer and listened to Kashmir by Led Zeppelin, but as the minutes passed I felt nothing. I went on a walk under the moonlight, and half an hour later I felt what may have been simple placebo. Kanna did not do anything, and by 2 hours later I was ready for something else.</p><p>I made some tea with a Green Tea/Earl Grey combination, and poured a spoonful or two of kratom in. I stirred it vigorously, and took a sip. It tasted disgusting, like a sour metal tea, so I poured a shitload of honey into the tea/kratom combination, and finally it was palatable, maybe even good if not for the floating particles of kratom I ingested. I consumed this over a few minute period, and waited.</p><p>At first I felt floaty, and as I moved my neck back my head felt weirdly unhinged. As time went on, I grew relaxed and a bit more open, maybe like I would feel after a couple hits of cannabis, and just chilled out to some Grateful Dead. This relaxation continued for a  few hours, it was nothing too intense. Kratom may be useful for meditation, as it was relaxing and helped quiet the mind, but it wasn't really comparable to any real drugs. Maybe at higher doses kratom would be more recreational, but I took at least a fifth of the ounce bag and only felt this relaxation. Next time I will try a much higher dose, at least doubled, but it is possible that kratom has some potential.</p>"
}
