{
 "title": "Chillingly Beautiful",
 "author": "Komrade",
 "citation": "   Komrade. \"Chillingly Beautiful: experience with 5-MeO-DMT (ID 4172)\". Erowid.org. Mar 2, 2001. erowid.org/exp/4172",
 "substance": "5-MeO-DMT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "4172",
   "Male",
   " ",
   "Not Given",
   "Mar 2, 2001",
   "8636",
   " "
  ]
 ],
 "report": "<p>I must say that this is definately a drug that must be experienced to be known, there is no description that can give you the frame of reference needed to fathom it's sheer power, keep that in mind.</p><p>The setting was a relaxed room with low key ambient lighting.  Three friends and I were taking a break from exam studies and decided to try and smoke some Salvia in a friend's vapourizer.  The vapourizer wasn't hot enough, though, as we had suspected and barely threshold effects were noticed.  The notion of trying some 5-meo (which had shown up in the mail earlier that week) came up and we decided to entertain the idea.  We were going to wait until the next week when exams had finished, but the suspense was killing us (it was all our first times).</p><p>It was decided that I was going first, and I figured I would try a small ~3mg dose in a little glass pipe to 'test the waters'.  With some difficulty, I managed to miss the toke almost completely, though i got a touch of a hit.  I noticed that i was jittery and very tweaky, but no effects other than that.  I decided to load up another hit, this time on top of a very small amount of crushed salvia leaf as a bed (it was close by, there was no other reason to use the salvia, I hear oregano does a fine job and there was nowhere near enough salvia to have an effect).  I put about 8mg on this time, going for a more full blown trip.</p><p>Melting the 5-meo onto the leaf and vapourizing it, the toke went down smoothly.  The effects hit like a mack truck in the span of about 10 seconds.  After 3 or 4 seconds, the visuals we akin to those on about 3 hits of acid with trails and loopy liquidy effects.  This didn't stay for long and by 10 seconds my entire visual field melted into itself.  By this time I was reclined nicely in my bean bag chair and was being rocketed upwards by the 5-Meo force.</p><p>My mind was still sailing further and after a few seconds everything surged into a suprisingly relaxed peak; like racing out of a tunnel at 1000 miles an hour into an infinitely empty space(just close your eyes and imagine it for a second).  It was fantasticly euphoric; I was in the void.  There was me and my senses sucking up input, but not caring about any of it.  The notion of nirvana came to mind where I was simply existing in pure and beautiful bliss.  There was total object dissociation where everything material or sensory was no longer being associated with anything in my brain, it just simply was.  There was a strong sense of oneness; with what, I don't know, but it put me in mind of deep spiritual love.  I'm sure I let out a few deep sighs of total euphoric love.  Near the end of the peak, I was overcome with a sense of intense beauty, a beauty so powerful that it brought a tear to my eye.  </p><p>Soon after the peak wore off and I sat up, totally rocked by the experience.  I shook off the funk and upon looking around, noticed some residual ~2hit acid trails and visuals that quickly wore off over the next 15 minutes or so with a mild euphoric afterglow.  I was told that I sat up at about +5-6 minutes...wow, seemed longer than that!  In turn the rest of the group went, each having a similar experience.</p><p>What is so creepy about 5-Meo-DMT is that the emotions experienced are SO startlingly real.  It's almost chilling in hindsight that a few mg of powder brought out feelings that should be reserved for, as a friend put it, something as profound as witnessing the birth of your first child.  Other empathogens like MDMA feel very artificial in the emotional state they produce, but this was uncanny.  I also think the tone of the trip would change dramatically with higher doses, it seems we hit a sweet spot.  </p><p>If I were to offer any words of advice, it would be this :</p><p>1.  Be prepared.    As with any drug, but especially this one, there is little room for emotional instability.  Make sure you are confident you can handle this trip.  The trick is to let go and let the drug take you, offer no resistance and don't be afraid; feel what the drug wants, it WILL win.</p><p>2.  MEASURE YOUR DOSE!  I don't care how, it's critical with 5-Meo.  I have a very good eye that was calibrated on a digital mg scale :-)</p><p>3.  Let go.  At all stages.  Realize that when it's all over, the emotions didn't mean anything (nothing meant anything) and that there is still a reality out there that offers you experiences beyond what a drug can give you.  While enlightened blissful nirvana is a hell of rewarding experience, it still has nothing on the primitive and promordial meaning that tags along for the bulk of your life.</p><p>Cheers all, be happy!</p>"
}
