{
 "title": "Baking Special Brownies in a Toaster Oven",
 "author": "Pedro",
 "citation": "   Pedro. \"Baking Special Brownies in a Toaster Oven: experience with Cannabis (ID 41767)\". Erowid.org. Aug 15, 2007. erowid.org/exp/41767",
 "substance": "Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41767",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 15, 2007",
   "Views: 17108",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMe and some friends figured out a way to bake special brownies with only a toaster oven. This is great for college students, because of our lack of a tradiational kitchen set-up. Plus, the smell is extremely minimal, so there is hardly any risk of getting caught. The only way, we figured, that we could get caught is the fact that we might set off the smoke alarm. This is easily fixable by simply cleaning the toaster oven till its spotless and make sure you don't spill any batter inside of it.<br>Anyway, onto the requirments.<br>A Toaster Oven - Anyone should be fine, as long as you can set it that it will only heat from the bottom. If you don't have one that does this it may be harder to extract the THC from the marijuana.<br>Small frying pan - Probably only around 6 inches or so. We did NOT have one of these and used a metal measuring cup instead, so I guess you can use anything metal to fry the weed and oil mixture in.<br>Measuring Cup - Not required, but definatly useful. If you don't have one handy, just remember that a cup is equal to 8oz, so you can use anything (i.e a drinking glass) that you know how many ounces it holds and just eye it up.<br>Cake Pan - Small enough to fit it in, we used one that came with the toaster oven. Most brands of toaster ovens have one of these.<br>Mixing bowl<br>Betty Crocker Brownie Mix (or genaric equivilant)<br>One-Half Cup Oil - Not Olive<br>Two Eggs<br>One-Half Cup Water<br>Coffee Filter - NOT required<br>Weed - As much as you want, but not too much because you wont be able to extract all the THC and end up wasting alot of it. We used a little more than an 1/8oz, but next time I would use a 1/4oz or so<br>Instructions:<br>1) Preheat your toaster oven. Set it so the heat only comes from the bottom and is as hot as you can get it. Also, make sure the rack is as low as it can go.<br>2) Break up your weed very(!!) finely and add it to a 1/2 cup of oil in the frying pan (or equivilant)  <br>3) Stick it in the toaster oven. Keep a close eye on it and stir it every 2-3 minutes for around 20 minutes, or until the oil turns a dark brown color.<br>4) You don't need to do this if you don't want, but if you feel that you got all the THC you can from the weed you can strain it from the oil with the coffee filter into a glass or something. MAKE SURE the oil has cooled down enough. I didn't bother straining it because I figured I might get a little more of the THC out by baking it in the brownies. Plus, the brownies would taste better :-P<br>5) Mix the brownie mix, eggs, water and oil together in the mixing bowl.<br>6) Fill your cake pan with batter until it is about 3/4 of the way full. You'll probably have enough for two batches.<br>7) Set your toaster oven to 350 degrees on bake<br>8) Bake for 25-30 Minutes<br>9) Enjoy!\n\n\n"
}
