{
 "title": "A Small Journey",
 "author": "Zlatko",
 "citation": "   Zlatko. \"A Small Journey: experience with DXM (ID 41778)\". Erowid.org. Feb 28, 2008. erowid.org/exp/41778",
 "substance": "DXM",
 "bodyweight": "196 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "236 mg",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 0:26",
   "118 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 41778",
   "Male",
   " ",
   "Not Given",
   "Feb 28, 2008",
   "Views: 5614",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesteday night was my first foray with dissociatives.  After spending two evenings online researching DXM and it's related sources, I decided to try a journy on a relatively small amount.  </p><p>Being thwarted in my attempts to eat magic mushrooms (psilocybin) I drove to the pharmacy to find a product with pure DXM.  I picked up two bottles of Vicks 44 Cough Relief, the only active ingredient 30mg DXM.  Unsure of wether or not to go through with it, and having read the best experiences take place in low light and dark settings, I spent the day in a contemplative state.  I journeyed to waters edge in my hometown and sat on the rocks overlooking the deep-blue pacific ocean.  Around two in the afternoon I saw the movie 'El Mar Adentro,' The Sea Inside.  It is important to note that the argument of the movie was, 'is living a privelage or is it a choice.'  </p><p>A good friend of mine was going to trip sit however before taking the drug I became apprehensive and delayed until after he departed.  Before he left, during his time in my room, between 10:00 and 12:30 at night, we engaged in a serious religious conversation.  The many faces of g-d, right and wrong, interpretation of religious scriptures etc.  </p><p>-- 00:00 (1:50 in the AM) I took my first dose of 236mg, or the equivalent of one, 118ml bottle of Vicks 44 Cough containing only 30mg at 15ml/dose.</p><p>-- +00:26 Feeling no reason to spill my cookies, drank half of another bottle amounting to 118mg and, totalling 354mg</p><p>-- +00:30 Started movie Road Trip, watched for about 50 mins and felt kind of foggy, got bored and changed the channel randomly and hit a science show about lightning. Very cool strobing effects in the room provided ample brain candy and stimulation.  Show ended.</p><p>-- +01:40 Climbed into bed to close eyes and let the drug take full effect.  I know that with any kind of halluicinegenic journey that you should not and cannot fight the feelings, so I let them wash over me.  Could not say how long I was awake before falling asleep.  Some colors and patterns were experienced, no particular shapes or forms.  The coolest feelings came just before I fell asleep.  I felt like I was being lifted from my body by genle hands, but I wazs fully cognitive and able to move if I desired.  I stayed 'above myself' for what seemed like a few minutes and then I think I started dreaming.  </p><p>-- +??:??  The dream, was I awake or asleep? I will never know.  Previously I mentioned that I had wanted to do shrooms that day but was unable to allocate them.  Well, this dream started on an open road with rolling hills, not all that unlike the landscape of Central California at the beginning of the wet season.  It had rained recently and the road was wet and the hills glistened with rain, and greenery sprouted from the barren burnt-out hillsides.  Everything was in extremely great detail and I cannot explain why I was able to smell and to feel temperature in my dream. </p><p>I stopped the car and apperently I had two friends with me because we were suddenly on the hillside and walking through the fields.  Little mushrooms were growing everywhere.  As I mentioned above, I am a very cautious guy and like to know everything before going forward with anyhting that could be risky.  Unfortunately, I was unable to register this as a dream or as a journy/trip, and, having read and knowing that you don't go around just picking mushrooms and imbibing them, felt it necessary to caution my friends about the danger.  No sooner than I mentioned there were mushrooms of any kind is when they started taking handfuls and eating them.  I stayed with them as their trip sitter and was quite sure, but not anxious, that they would throw up and I would need to drive them to the hospital.     </p><p>They were apparently having a wonderful time and I was enjoying the warm breezes and the air of spring while still searching for a mushroom that might 'look right' for consumption.  I decided not to eat any, and as soon as I made up my 'mind' all the mushrooms disappeared.  I was a little sad but found that I was having a great time anyway.  </p><p>I awoke in my room at 8:34 in the morning in a completely calm state with complete recollection of only that dream and the previous evening's events.  I felt like I had had others (dreams) but might never recollect them.  I remained very still and went over in my head the complete journey until I was satisfied I could remember the entire night's events.  </p><p>I will definately journey again into the DXM world and recommend to all that you prepare yourself by stripping away any outside agitation by clearing your mind before the journey.</p>"
}
