{
 "title": "The Song of Heaven & Hell",
 "author": "FlowGnome",
 "citation": "   FlowGnome. \"The Song of Heaven & Hell: experience with 2C-E & Nitrous Oxide (ID 41783)\". Erowid.org. Apr 4, 2005. erowid.org/exp/41783",
 "substance": "2C-E & Nitrous Oxide",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "18 mg",
   "oral",
   "2C-E",
   " ",
   " ",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 41783",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 4, 2005",
   "Views: 36475",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Heaven & Hell are symbolic, not religious, throughout this report.</p><p>A little background.    Since this trip on a combination of 3C-P, 2C-T-2, and P. Cubensis mushrooms, I have not felt the urge to trip as much.   I went so far out there, so deep into the answer, that I had forgotten the question and who was asking it.    I also said that it was impossible to gain anything useful from that trip.   I believed this at the time, but it has slowly been coming to me.   Something like that takes a long time to integrate properly.    </p><p>I was so overwhelmed by the life-death cycle during the first half of the trip that I had nearly forgotten about the song of the second, at least until this: </p><p>Set: I was happy to get the chance to spend a controlled evening of tripping with some friends.  I brought some whippets with, but nobody really thought about them until much, much later. </p><p>Setting:  A friend's apartment, we'll call her G.   Her boyfriend M was being introduced to 2C-E for the first time as well, and her dog was around.  M had tried 2C-I as his first psychedelic experience at my recommendation, and then mushrooms another time.   </p><p>G is an interesting female, she has a very dominant personality and I would consider her one of my best friends.  I've always wished it was more.  She also has more history of psychedelic use than me, and generally tends to be able to control herself better under the influence of phens.  2C-E has always proved to be an intense substance for me, difficult to deal with properly and hard to function on.  I wasn't scared of it but I tend to treat it with more wariness than 2C-T-2 for example. </p><p>I'm going to leave out a timeline as nobody was really paying attention to the clock.   This was done in the evening, however. </p><p>Some 30 minutes after swallowing the 2C-E, I began feeling typical phenethylamine alerts.   Slight increase in tactile function, sharpened vision, slight speediness.  We begin watching some disney cartoons, ending at last on on a short called 'Pluto's Judgement Day' which features Pluto being judged and tormented by a small army of cats moving in clockwork step and sentenced to hell before waking up.   G & I mused that the Disney people really  seemed to know quite a bit about hell.  M was already lost in thought.   This set some of the stage for the rest of the night. </p><p>The Disney cartoons became too much for us as we were becoming increasingly lost in our own minds, and we retired to a more comfortable area of the house, where we lay in a triangle on a soft rug that had been bought for ecstasy experiences of years past.  My mind was racing to seperate from my body.  G put on some music and it wasn't too long before I started noticing strangely familiar.  </p><p>Songs grew more and more cyclic until they were separated completely into a rotating pattern of chord and discord that were both separate and one.    Duality had taken hold.  I was feeling love & hate & joy & despair all as one.   I was scared.   Why was I hearing the pain in these notes when the others seemed oblivious?   There were two songs being played here, one of heaven, and one of hell, and I knew that I had a control over what I would hear and experience, but was unaware of how to exert the control needed.   I would be forced to hear both, alternately.   Sometimes during the limited conversation G & I were having (M was well beyond speech), I would feel the cycling of the song shift so that one side of the music would take over.   </p><p>I began to listen again and realized that I could move my body a certain way, or hum along to the 'good' song and I would begin to experience pure ecstasy.   Failing to follow the rhythm would produce appropriate pain/discomfort.   I didn't understand this.  Why was action required to enjoy simple music?   Was I unable to properly go with the flow of life in such a way as to avoid the negative side?   Of course I was.   There is good and bad in everything all at once, I learned that back at that farm running around naked a year ago.  For every moment of joy there is an equal moment of pain.   I was now seeing this again, in a simpler way, one that didn't involve grandiose visions of love and torture.   </p><p>Still, why did the pain need be there?   I had been lost in thought for a long time, staring at the carpeting.   What few words I had spoken were probably incoherent descriptions of what I was feeling, but they didn't matter anyway.  I was still lost in the song of forever and now.   I wanted to sing along with it and be free from the pain, but any attempts I would make would be woefully inadequate.   I wanted to create music that was good to drown out all that was bad, but I have no musical talent.   </p><p>Somewhere in the middle of all of this, G's dog let M know that he had to go to the bathroom.   He let him know this by running into the room, jumping on his chest, and then urinating while running in circles around all of us.    We all got some dog urine on us, but M got the brunt of it.   This only reinforced my good / bad thought, as M had been enjoying himself more than any of us, writhing on the floor in ecstasy the entire time.  We walked the dog, and the outside world frightened me.  It seemed too cold and too hot at the same time, even though it was just warm outside.  G was unable to care too much about this at the time.  None of us were in the state to do the serious cleaning required to the entire room / rug, and some of it needed a dry cleaner's anyway.   We kind of forgot about it until the next morning, mostly out of necessity. </p><p>My music cycles continued after the excitement was over, and I was in a bit of a thought loop.  </p><p>Around this time G started talking to M about their relationship and where it was going.  I was being included in this conversation  as well, against my will, and this part was personal and need not be mentioned here.  G said something freely that I didn't want to hear about, and I soon after excused myself to the living room to lay down alone for a moment.  I loved her and it was too much.   G followed me out and she took me to the porch for a cigarette.   </p><p>G: 'Why are you always running away?'</p><p>Me: 'Huh?'</p><p>G: 'Every time something gets emotional you want to run.'</p><p>Me: 'I don't know...    I'm scared.'</p><p>Our conversation went on for awhile, we discussed heaven & hell, I was able to relate a little of what I was feeling from the music.   She had a very similar view to me on things, although she hadn't been experiencing them the same way I was.   We talked about our respective pasts, current fears.   A good amount of the burden felt like it was lifted.  After about 30 minutes of this, M wandered out on the porch, wondering where we had been.   Oops.   He had been enjoying himself inside, anyway.   </p><p>I began cycling through different concepts.  Now not good and bad specifically, but more of an experience of several emotions, thoughts, and of being several objects and in many places in an instant.  Time would seperate into frames and I'd flick through them in one quick motion.  I was travelling the world instantaneously, seeing much but forgetting most.     This happened three or four times in a row and then died down.   This part I didn't understand at all, and I get the feeling it will carry over into my next trip, whenever that might occur.   </p><p>I still hadn't worked out exactly what to do with all the information I had been saturated with over the night.    I was starting to come down, and nothing had been resolved really.   Clarified a bit, but not resolved.   I don't know if there was a resolution.   I decided to fill some balloons for everyone.   I took mine last, and was propelled into the euphoric side of the music.  I flicked through the oceans and stars and sky and forests for one last time for the night.   I stared into G's eyes feeling all my thoughts for her laid bare for just a brief instant.   She looked back, and said only:</p><p>'It wasn't meant to be.'</p><p>She knew.  I knew.   We all watched The Last Unicorn and laughed ourselves to near sleep on its strange communist and sexual undertones.   Sleep came slowly for me, G & M went to bed.  I fell asleep on the floor, feeling like a child trying to read an advanced thermodynamics textbook, humbled and confused.    The trip faded away.  </p><p>To be continued, at another time.</p>"
}
