{
 "title": "Enlightening With Vivid Hallucinations",
 "author": "Lisalucy13",
 "citation": "   Lisalucy13. \"Enlightening With Vivid Hallucinations: experience with 5-MeO-AMT (ID 41785)\". Erowid.org. Jan 15, 2008. erowid.org/exp/41785",
 "substance": "5-MeO-AMT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)",
   "  T+ 0:10",
   "1 bowl",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41785",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 15, 2008",
   "Views: 7385",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>9:00pm - Hanging out with some friends at a party, Administered 5mg of 5-meo-AMT, orally. *This dose was eyeballed, not measured with a scale - highly unrecommended when dealing with something so potent.  I'm predicting my dose was between 4 and 6mg in reality. </p><p>A small bowl of marijuana was smoked shortly after to kill the nausea I've read about on this drug.</p><p>9:50pm - Feeling a bit jumpy, rise in mood.  I am more sensitive to touch.</p><p>10:30pm - First hallucinations set it.  Patterns and walls are swirling about constantly, and I am really happy - not euphoric like ecstasy, just an elevated mood in general with a lot of giggling.  I am also experiencing a bit of neck tension - nothing I can't tolerate though.</p><p>10:45pm - Hallucinations are getting more and more intense by the minute, I have never experienced anything like this and am a bit worried - according to what I've read, I shouldn't peak for 2 hours or so...</p><p>These hallucinations are beautiful.  Colors are everywhere, and I notice an electric, colorful light running through a lot of things.  The walls keep morphing and changing color, melting into eachother like paint.  Everything is buzzing.  I have never seen trails like this on any drug - I can draw in the air and it lingers for a while, which is pretty amusing.  For the intensity of these visuals, I am surprisingly clear headed and calm.</p><p>12:00am - Hallucinations are insane - the entire world is a colorful, electric, dancing mural.  I especially enjoy the blacklight with this drug, it adds a purple and blue glow to everything... this appears to radiate sparkles.  They are very cool, but so intense I am unable to move around and function well.  Thank god for trip sitters.  I am starting to get less clear headed, I am finding my thoughts moving fluidly from one subject to another, somewhat like mushrooms but without getting caught up on particular subjects.  I also find myself very calm and at ease with these thoughts.</p><p>2:00am - This is getting really crazy.  Time and space are no longer like reality at all - I feel like I am able to move throughout time, as if it were all occuring at once.  I can move to any stage of my life, including death.  Memories are suddenly very vivid and clear.  Communication, mood, death and the concept of thinking and learning are all fascinating topics to me right now, all interconnected to one and other.  I have lost complete touch with reality at this point, but it isn't frighting.  So far I have maintained a calm, happy mood throughout the entire experiences.  Hallucinations are still very vivid, beautiful and enhance the trip a lot.  Wow.</p><p>I didn't notice this at all at first, but suddenly the drug is becoming very sexual.  My sex drive is definently elevated, although I think I'm hallucinating too much to actually have sex.  </p><p>7:00am - STILL tripping.  It's getting to be a bit too much, I've been out of touch with reality for a long time now and its starting to get a little scary.  The hallucinations are not as intense as before, but are definently still present.  Sleep is impossible.  </p><p>9:30am - Trip is over, I am back in reality and the only hallucinations I'm experiencing are mild trails.  I'm exausted, yet still can't sleep and have a bit of a headache.</p><p>Overall - This was one of my favorite trips ever.  The colors and hallucinations are beautiful, and the fluid thoughts very enlightening.  My mood the day after was excellent, despite my lack of sleep.  I was also very creative after the experience, it left me with a very artistic, positive state of mind.  Next time I do this drug, I might take a bit less of a dose, just because the hallucinations were so intense I couldn't function and the trip was a bit long.  The friends I tried this with were two males - one who had a similar experience to mine without the complete loss of touch with reality, and one who took 10mg and experienced no hallucinations or loss of reality whatsoever!  This drug was a lot fun at a party, but I would like to try it in a quieter setting with a few close friends.  The potency of this drug sketches me out a bit... but I will definently do it again in the future.  I highly recommend having a trip sitter on this drug, just in case.  Happy tripping and be safe!</p>"
}
