{
 "title": "Got Yerba?",
 "author": "twinturbo4",
 "citation": "   twinturbo4. \"Got Yerba?: experience with Yerba Mate (ID 41797)\". Erowid.org. Dec 1, 2005. erowid.org/exp/41797",
 "substance": "Yerba Mate",
 "bodyweight": "161 lb",
 "header": [
  [
   "DOSE:",
   "2.5 Tbsp",
   "oral",
   "Yerba Mate",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41797",
   "Male",
   " ",
   "Not Given",
   "Dec 1, 2005",
   "Views: 11380",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I heard about Yerba from a friend of a friend, in passing, at a restaurant. It sounded interesting. Having made a new year's resolution to quit eating so much garbage food and get healthy, it sounded like something I'd wanna try. My buddy was pumped about it too, so we hit up Save-On Foods on the way home. He got some tea bags and I bought the leaves, with experimentation in mind :P</p><p>The tea bags were good, easy to use and the effects were pronounced enough that I could notice them almost immediately. We both felt extremely centered, fully awake and aware, yet calm and collected, almost like time had slowed a bit for both of us, able to see things in greater detail. Driving around with a dose of yerba in my gut is quite enjoyable ;) I experimented with the loose leaves on my own, first steeping them in a mug of hot water from the tap, then microwaving the water, then heating water in a kettle and steeping the leaves in a coffee press. The coffee press works awesome, although it lets a lot of leaves through if you buy a cheap one (they squirt up the side of the mesh skirt) and I found out later I was making it with the water WAY too hot. Optimal temperature for Mate, in order to retain all the health benefits and taste, is around 70 to 80 degrees Celcius (about 155 to 175 Farenheit).</p><p>In addition to experimenting with different methods for making the tea, I also started increasing the dose, first 1 tablespoon, then 2 tablespoons, 2 and 1/2, etc. I find that 3 tablespoons is almost too much, 2 and 1/2 is a lot easier to handle. I retired the coffee press about a month ago too, having bought a cheap little POS coffee maker from Superstore for about eleven bucks. It takes the little No. 2 filters, and it makes perfect Yerba every time! 75 degrees C, right on the money. No leaves or sediment get through either, which is nice. I also get more mileage from my leaves, running about 3 pots of water through each load to get all the nutrients and stuff out of it.</p><p>Long story short, I now drink a strong pot of Yerba (a pot being about 600 ml, or 4 cups worth, according to the little scale on my coffee pot) every morning before work, made with 2 1/2 tablespoons of loose leaves in my coffee maker, which is now stained a dark green from all the yerba juice :P I also make a 2nd pot and keep it in an empty juice bottle in the fridge at work, mixed with iced tea crystals or Tang crystals. Once the effects from my morning rush wear off, I pound back the cold tea and the rocket-ride starts again! It's great, I love it.</p><p>The effects from a strong dose of yerba are MUCH different from those of a weak dose, like from a tea bag. I liked starting out with 1 tablespoon of the loose leaves and gradually (over the course of a month or 3 weeks) working my way up to 2 1/2 or 3 tablespoons of yerba a day, so my body and heart and brain could get used to it. I  noticed increased awareness of the 3-dimensional sense world, almost like my consciousness is pulled even tighter into my body, and I have TONS of energy. There is a bit of a come-down when the effects wear off too, mostly just a bit of lightheadedness and wobbly, noodly muscles (only if I've been doing physical labour, though), although I have experienced mild irritability and other similar effects to caffiene let-down, though not as strong. I definitely feel much healthier too, due to the multitude of antioxidants and vitamins coursing through my blood :P I REALLY enjoy the taste now too, despite hating it earlier (it really does taste like hay, or alfalfa). That's about it! Enjoy!</p>"
}
