{
 "title": "GHB overdose",
 "author": "Sweetheart",
 "citation": "   Sweetheart. \"GHB overdose: experience with GHB (ID 418)\". Erowid.org. Jun 21, 2000. erowid.org/exp/418",
 "substance": "GHB",
 "bodyweight": "245 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tsp",
   "oral",
   "GHB",
   "(liquid)",
   "  T+ 1:30",
   "2.5 tsp",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 418",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2000",
   "Views: 19763",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMy friend decided to give me a dose of GHB the other day.  I have taken it before and slightly overdosed one other time.  This time however was quite different.  I took a little over a teaspoon and was feeling pretty good about 20 minutes later.  I felt happy, everything was great, nothing seemed wrong, and somewhat dizzy.  The walls kept moving on me...But at the time it seemed almost like a challenge to walk.\r\nAnyways, about an hour and a half later I decided that I wanted to take more.  I took my friends bottle and poured more powder into my drink.  I didn't realize how much it was until I started feeling effects only 10 minutes later.  I realized then I took about 2-3 teaspoons on top of the other teaspoon I had consumed earlier.  10 minutes after taking my G, I felt rather dizzy and couldn't keep my head up very well.  I was also feeling rather tingly all over and I think someone could have probably punched me and I wouldn't have known.  Within 1/2 hour I was feeling incredibly awful and sick.  I felt as though I had to vomit and my mouth was watering way too much.\r\nI insisted on driving to pick up my friend from school and on my way there started to vomit. I threw up only a couple of times.  I sat on the curb at Hardee's in the parking lot and continued to feel messed up.  I got back in the car after a few minutes of gathering myself together and continued to drive.  It was incredibly hard and do not recommend it to anyone.  I felt awful and after I picked my friend up I went back to my house and passed out for 3 hours.  When I woke up my stomache felt a little ill, but after being awake for 1/2 hour or so I felt fine.\r\n[Erowid Note: Driving after a heavy dose of GHB is an incredibly dangerous and stupid thing to do.  Note that shortly after returning home this individual passed out.  Passing out while driving can kill you or someone else.  Please be safe and smart.]   \n\n\n"
}
