{
 "title": "Melted into Computer Screen",
 "author": "Cus",
 "citation": "   Cus. \"Melted into Computer Screen: experience with Zolpidem (Ambien) (ID 41852)\". Erowid.org. Jun 7, 2007. erowid.org/exp/41852",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 0:30",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41852",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 7, 2007",
   "Views: 25478",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me start off by saying that I am an A student in all honors and Advanced Placement classes, and have only recently tried several drugs to experiement with my body and mind to see its effects, and unlock an 'in-touchness' with my mind.  I have explored lucid dreaming, and decided that trying a psychoactive that makes you hallucinate would be the next best thing to dreaming lucidly, so after much research, I decided that Ambien would be a safe first try, being that before this I had only experimented with marijuana, speed, xanax, and alot of alcohol.\r\nI used various websites to determine Ambien's safety, and decided that taking up to 20mg would not put me at too much of a risk, so long as I stayed immobile, and in my room.  So after gathering information, and deciding that it would be worth a try, I attained two 10mg pills from a relative and awaited the right time and place to come  for me to try it in a safe manner without attracting much attention.\r\nSo I decided to first take 10mg, thinking that it would make me hallucinate, and after some time passed I realized that it was not enough.  I had hoped that only one pill would work (10 mg) so that I would have been able to experience the psychoactive effects of Ambien on two separate occasions.\r\n7:53pm- Took 10mg of Ambien, heart racing due to nervousness.\r\n8:05pm- ummm really tired feeling, I could pass out at any moment if I were to close my eyes.\r\n8:30pm- I went to go to the bathroom, and upon getting up I felt a little wobbly and walking straight lines was a task.\r\n8:35pm- I feel as if Im stoned, or just buzzed off a few beers.  Slightly eurphoric. Need some music.\r\n8:49pm- I just took 10mg more of Ambien, because effects as I imagined had not come to be.\r\n8:55pm- Feels good, slight visual distortions, only if I stare. Its a crazy feeling like total euphoria, like nothings real its all dream-like.\r\n9:02pm- Feels like body is drawn into the circle hallucination.\r\n9:05pm- Feels like I am being drawn towards the computer. Another hallucination. \r\nI felt as if I had melted into the computer screen, and I was one with the screen.  I had to remind myself every so often that I was on Ambien, and that it wasn't real what I was seeing or feeling.  I got very confused by the computer and the IM boxes from AOL, which made no sense to me, and they were all highly zoomed and distorted.  I tried talking to friends online, but since my motor skills were totally messed up, by the peak of the sedative effects of the Ambien, I was unable to type correctly and in a coherent manner.\r\nI got frustrated by the confusing boxes appearing on the computer, and my 'melted-ness' into the screen, so then I shut off the computer screen and lied down on my bed--BAD MISTAKE, I last remember watching TV (no recollection of what was on TV), and then  after that I'm guessing I blanked out and fell asleep, but at no time did I consciously make the decision to sleep, or close my eyes.  I awoke the next morning to my mom saying my name and telling me to wake up, ever-so-energetic and awake, feeling 100% rested, and not the least bit groggy.\r\nAmbien was a generally positive experience.  I learned from my experience that 10mg is not enough to hallucinate, it only makes me feel drunk/stoned with a mix of euphoria, but with 20mg, I hallucinated, and felt completely euphoric and generally unaware of my surroundings.  I would definitely try this great drug again, and do it in an environment that is somewhat stimulating, and will not let me fall asleep, Definitely with other people (friends) around to amuse me to help keep me awake to enjoy the effects.\n\n\n"
}
