{
 "title": "Very Mild",
 "author": "Curious Joe",
 "citation": "   Curious Joe. \"Very Mild: experience with Phentermine (ID 41896)\". Erowid.org. May 8, 2006. erowid.org/exp/41896",
 "substance": "Phentermine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Phentermine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41896",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 8, 2006",
   "Views: 23393",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is an account of the recreational use of Phentermine, which is supposedly similar to Amphetamines. The pills are 30mg. For this experience I am only taking 1 pill to see how my body reacts. Note: I have only had one experience with Methamphetamine and I was drunk at the time so I do not remember the feelings other than I could not go to sleep. Therefore, I have no real experience with stimulants to compare this to.\r\n11am  Have the day off so I decided to try Phentermine which my parent uses for weight loss. Decided to eat pizza first because the drug causes a loss in appetite.\r\n12pm  Took one dose of Phentermine 30mg orally.\r\n1pm - Not really feeling Euphoric, just a little speedy as I started to clean my room.\r\n1:30pm  Starting to feel a *very* mild sense of euphoria, a little mood uplift. Still cleaning room, it feels good when I clean.\r\n2pm - No Change  room is cleaned.\r\n3:30pm  Just played my guitar for an hour and a half still feeling the same, I have a feeling either this stuff is time released or that this is the peak. I am going to exercise now.\r\n4:00pm  Finished exercising, it felt great. I cant tell if lack of fatigue was due to the Phentermine or just my muscles becoming more efficient. I still dont notice much of a difference in mood. I am now going to study to see if I can concentrate better.\r\n11:00pm  Studying was a lot easier, my mind was able to absorb the information easier and I was able to concentrate better. Didnt have an appetite (guess the pills work) but ate dinner anyway. Im not tired but I need to force myself to go to bed.\r\nAll in all, it was an interesting experience. Im sure I had increased energy throughout the day not much euphoria but it would be interesting to increase the dosage to see if it brought about euphoric effects.\n\n\n"
}
