{
 "title": "Ah Yes, Now I Remember",
 "author": "Petrus",
 "citation": "   Petrus. \"Ah Yes, Now I Remember: experience with Ecstasy (ID 419)\". Erowid.org. Jun 23, 2000. erowid.org/exp/419",
 "substance": "Ecstasy",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "419",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 23, 2000",
   "Views: 3412",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nthis is the first time i have rolled since October so it has been quite a few months and i was ready to be blown away once again by this wonderful drug. a bunch of friends and i were planning to take it, all at different times of the night, so that couples could have some alone time, and then we would all hang out together. i was going to wait until much later in the evening to take my pills, but then i realized that if i took it early i would have time to be alone and possibly write. i have always wanted to write while on ecstacy so i could go back and read it and see exactly what i was feeling. so, that is what i'm going to post here, what i learned and wrote down while rolling. but before i get into that, i just want to comment on the roll in general. i had 2 pills crushed and in a gel cap. i took the gel cap at around 8:40 with hot tea. by 8:55 my hands were getting tingly. i went downstairs to tell my housemate,  A., that i was starting to roll. when i went back upstairs to my room, it was like *@!POW!@*. i came up very fast and this lasted for approximately 2 hours (it was as i was coming up by myself that i wrote what i am going to post below). then i came down a notch, still rolling but on a plateau. and i've been coming down notch after notch. it's now 12:42 and i'm still getting warm rushes, euphoria from just deep breaths, and occasionally fluttering eyes. so anyhow, here's what i wrote down when i rolled (i hope it doesn't seem cracked out. i apologize if it is= ).</p><p>and i am there you and i and everyone one one together it's everywhere i am seething over flowing blossoming my entirety overcome with joy it has been so long oh how i have missed you yes embrace me on the inside yes that is what i feel and i feel not everyone can comprehend the way everything thing thing just fits together and is as it should be because i can think so lucidly you have no idea i am clear i am one my god my god i have missed you everything is one this pounding pounding bang bang music in my head it drives me i can feel it melting with my mind to touch these limbs that were so tired how could i could i could i forget all this as i do when everything is one and a key unlocks an ornately decorated glass box it's pink and black and blue and swirling and not glass but can change at will and the key opens and out it comes like magic on fire one one  reaching one gathering one collecting wills swirling into one so powerful i can hardly contain it like the top of my head just poof evaporated and at last the positivity was set free  let it touch you too my god let it touch you i think i wish i thought i felt my god my god i'm rising so far up let it touch you too like magic and secrets that you must come this way to understand. </p><p>(btw, the my gods are not a religious thing. for all you rollers out there, i'm sure you know that saying 'oh my god' or 'i feel SO good' are two pretty good ways to describe what you're experiencing. that's what i usually find myself and others saying anyway.)</p><p>\n"
}
