{
 "title": "Surprise, Surprise",
 "author": "Xanthien",
 "citation": "   Xanthien. \"Surprise, Surprise: experience with Salvia divinorum (20x extract) (ID 41938)\". Erowid.org. Aug 16, 2007. erowid.org/exp/41938",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 41938",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2007",
   "Views: 3189",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nUpon my pleasant awakening into a calm 'reality' on a Friday morning, I was struck with the desire to try Salvia. I had read a few trip stories that were extreme (such as living for an eternity as paint on a wall), but had been skeptical to their validity, since I had a friend that had tried the leaves with little or no effect. Couriousity overwhelmed me though, so I gave in to my wishful thoughts of extreme psychodelia.\r\nI went with my friend to a smoke shop and pick up extract x20 and x5, after piquing my brother's interest, and convincing them it was a good idea. Since my friend (Brandon) was so skeptical, he suggested that we hit the x20 on the road. This idea was discarded shortly after, due to our intent to be communal with the Salvia. An hour and a half after the purchase, we were ready to smoke our first dose of the mysterious plant. We gathered around the window in my room, and I dished out a healthy pinch into a small glass pipe. I inhaled until my lungs were entirely filled, and held the smooth smoke in my lungs for 20-30 seconds. Upon exhaling, I found everything to be differant. While passing the pipe off to my brother (Nate), I was suprised to see vivid trails of the pipe in motion. I mumbled something like 'This is weird, I'm tripping out. I'm freakin' out.' and then it hit me. My conciousness died, and I was entirely unaware.\r\nI experianced the feeling of being in eternity, apart from my body and anything that I knew. Suddenly I was being barraged by a steady stream of child hood memories, melded together into one large picture that started replicating relentlessly. The replication was like an enormous roll of rectangular film frames, sprawled out in front of my conciousness's vision, and it was terrifying. I didn't know what was happening to me, or what my proper place in life was, but I knew that I was experiancing something similar to having my sense of being chopped up into pieces and fed into a kalidascope, that I was holding to my vision against my will.\r\nI was laughing. I was confused and scared, since I wasn't aware that I was a teenager that had just smoked a plant. I heard voices, and I became aware of the room again, and aware that there were other people surrounding me, but I wasn't sure of who they were. Nate was helping me from a chair to a couch, and I felt safe for a moment. The moment I was seated on the couch, I looked towards Brandon and Nate, and noticed that they looked extremely far away, and then to my horror, I realized that I was looking through a fuzzy portal into the room that I had just been in, and upon inspecting my current surroundings, found myself in a replica of the real room. I looked at Nate and Brandon, and realized they weren't my real friends, but that my real friends were just out of my reach through this puzzling portal. I looked back into the portal, and saw a room, with a portal in it as well, and this process continued until I was staring down a line of imposter rooms, much like one that angles two mirrors, so as to see an extremely duplicated reflection of themselves. I tried to stand up and run through these portals to the room in which I belonged, but this fake brother of mine was trying to trap me in his reality, by holding my shoulders! In truth he was holding me from plunging face first on my floor.\r\nI started to come back. My room looked normal, but I didn't know what happened. I felt as if I had just been ripped from eternity, and somehow manifested myself as a being in an alien life. Slowly I realized that it was my life I had returned to, and connected in my mind that the whole trip had been a direct result of my willing actions. I felt drunk for a few minutes after, and as I was regaining myself, and struggling to grasp what I had just experianced, Nate packed himself a nice fat bowl and took a hit, entirely unaware of the horrors that I had been through, since I was too stunned to tell him about it as warning. Nate was already wired from cocaine, so the transformation from being externally aware to internally tormented was instant. I can tell by the look upon his face.\r\nHe started to look scared and stood up, and followed this action by saying he needed a dictionary. I informed him that it was ridicoulous to go looking for a dictionary downstairs while under the influence of Salvia. He stood up off the couch, and tried to push past me, but didn't put up to much of a fight while I blocked his exit. He started grabbing his face, and forcing his hand into his mouth. I assumed that his tongue must be numb from the cocaine, and that he was trying to confirm that it was still in his mouth. He looked desperate, and kept clawing at his tongue. I pulled his hands away from his mouth, and he spat on my foot. Then after feeling Brandon's hair, he sat down on the couch and clawed his shirt off.\r\nBeing this exposed must have scared him, since he stood up and quickly put it on, inside out and backwards. I helped him to my bed so he could lie down, and in time he came back to a normal perception. He started talking about it as means of helping him come to grips with the extremely powerful, and extremely negative trip he had had. We had experianced very similar things during our trips. He had had strong feels of someone or something tampering with his life, and that life was nothing more then a big, silly joke played on humans. He looked at Brandon's face at some point, and was sure that he was somehow behind the charade. These feelings faded. Oh, and an explination for his tongue clawing? In his altered state, his only chance for survival was to pull his tongue out, and form it into a real, life sized canoe. This however didn't work in his trip, which might explain why it was such a horrendous experiance. His first thoughts that he expressed were something along the lines of 'I'll never ever put myself through this again.'\r\nThrough-out the duration of these happenings, Brandon had been helping calm Nate, but he didn't understand the intensity, so he packed himself a fresh bowl, and hit it with enthuiasm. After holding it in, I saw the defined change between interal and external reality in his eyes. He stood up, and looked disoriented and scared. He affirmed this by reaching out and grabbing my hand. He was quiet through it all, but was looking around with a look of fear. We guided him to the couch where he peacefully recovered. When he was back with us, he said he didn't want to talk about it, because it couldn't be put to words.\r\nAs time passed though he delved out more details. One of his most intense moments, was a feeling of being part of the couch, and seeing half of my face and half of my brothers face stuck together, as curtains. He felt increased gravity. After we were all on the same level of relief from the trip being over, it was clear we all were reluctant to try it again. Later in the day, while introducing a friend to it, I took another hit of x20 extract mixed with x5, and felt as if I were part of a picture, and whenever I moved, it ripped the picture apart. I fumbled for a cigarette to help me through it, but upon lighting it, found that the entire world was made of cigarettes. The house had cigarette wall paper. The walls WERE cigarettes. The couch, my friends, everything.\r\nI think back on the experiances with a certain awe and fear. I will never be able to describe the extremity of the thoughts or feelings I experianced. Eternity is a hard memory to re-live. My life was changed in many subtle ways. I will most likely smoke Salvia again sometime in the future, but I have the feeling it will be the distant future. For now, I have to come to grips with being an organic being bound by time, once more.\n\n\n"
}
