{
 "title": "Hitting the Restart Button",
 "author": "Lisalucy13",
 "citation": "   Lisalucy13. \"Hitting the Restart Button: experience with Salvia divinorum (13x extract), Alcohol & Cannabis (ID 41978)\". Erowid.org. Jul 20, 2008. erowid.org/exp/41978",
 "substance": "Salvia divinorum (13x extract), Alcohol & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "4 glasses",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "0.5 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41978",
   "Female",
   " ",
   "Not Given",
   "Jul 20, 2008",
   "Views: 2496",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Not fully understanding the potentials of this drug, a friend of mine and I decided to try smoking some 13X salvia that I purchased earlier that day.  I was already under the influence of alcohol.  We smoked a small bowl of high quality marijuana, and proceeded to each take one hit out of a bubbler of the saliva.</p><p>I proceeded to loose consciousness and was told I was moving around the floor with a complete loss of motor control.  I scared the shit out of trip sitter, as I was drooling and my eyes rolled into the back of my head.  When I came to shortly after passing out, I had no idea where I was, who I was, what life was or how to do anything.  The only thing I did know was that something that felt like a layer of plastic was covering everything in the room, and I could not breathe because of it.  My instinct was to escape from the plastic, but it was not fear of death that motivated me, I had no concept of death.  I could not move, and was instantly stricken with panic.  I might note that everything I could see was varying shades of pink pixels, like when you sit too close to the television. </p><p>The first thought I was able to fathom, even before remembering how to breathe, was that I might be a physical character inside a television, not the actor but the actual pixilated person in the TV.  I felt 2-D, and not quite alive, but acting like I was.  As soon as I could breathe, I started screaming.  Every memory I lost started coming back to me, starting with how to breathe and swallow, to what I was seeing and hearing, to the concept of life, to recognizing the people in the room with me.  As I regained more and more knowledge, the pink pixels started fading back to reality.</p><p>As soon as I remembered smoking the salvia and that was what induced the experience, my panic resided.  The closest thing I could relate this to was being born, coming into the world with no knowledge or concept of anything having to do with it, and learning everything about your surroundings for the first time.  For 20 - 30 minutes afterwards, I felt a little dizzy and off, somewhat like being really high on pot.  I was so overwhelmed by my experience that I payed little attention to the after effects.</p><p>That night and the next day, I felt AMAZING.  I felt like I had hit the Restart button on my brain, and suddenly found myself with a new appreciation for life and specifically reality.  The salvia made me question my frequent attempts to avoid reality through the use of drugs, which was a well needed discussion I had to have with myself.  This drug was unlike any other drug I have ever tried, and I would consider myself a fairly experienced drug user.  Overall, I would not recommend trying to recreate this experience with salvia, just because I feel it could be potentially traumatizing instead of enlightening to a lot of people.  I would like to try salvia in the future with more preparation, less alcohol and a smaller dose.</p>"
}
