{
 "title": "Black Bars and Helpful Cars",
 "author": "Frank M",
 "citation": "   Frank M. \"Black Bars and Helpful Cars: experience with Petroleum Ether (ID 41980)\". Erowid.org. Jun 19, 2007. erowid.org/exp/41980",
 "substance": "Petroleum Ether",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Petroleum Ether",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 41980",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 9847",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nWell this inhaling binge started because my friend used to live in this house with two adults that rarely came out of their room and a few other drug friendly young adults. This environment was very open for the use of drugs and alcohol. So one weekend my friend came back from a trip home to New York to visit his real parents. When he got back he found that in his room here in Seattle there were two bottles of white gas used for camping from another kid in the house. I spent the night at his house the first night he got back. We wanted to celebrate his return with some nice hearty weed, but we had no luck. He showed me the bottles and we both talked about huffing it. S\r\nAbout twenty minutes latter we both had our noses buried in the bottles taking enormous inhales. We switched bottles every minute or so because we each felt that the red bottle was 'better'. This went on for about two hours of huffing, talking, and listening to 107.7 the End. Then I started to get really warm and wanted to go for a walk. I proceeded to stand but could hardly keep my limbs from wobbling. I sat back down. \r\nA week later we tried it again but we brought a new member to the experience. He was hesitant at first but soon dived right into it after he saw how giddy Tommy and I got. We passed the bottles around for three hours. I was so deep into the high that when I stood up I had mild hallucinations. I thought I was floating and that my head was bumping the ceiling. Then I wanted to go use the bathroom but I couldn't because impassable black bars would pop up every time I made a motion to leave. Then T and M went to a party and I refused to go because I was a lot deeper in the high than they. I stay quivering on T's bed for hours. Then I took deep gulps from some cheap wine we had gotten a hold of from some other friends who picked them up for the party. I went to drink outside because my body temperature was extremely high. I was burning up. So I went outside and drank deeply. \r\nIn about thirty minutes I was running up and down a cobblestone hill outside the house. I tripped on a stone, fell and then lay there not able to get up. My body felt like warm sand paper and I couldn't get away from the black bars. I held onto the ground for fear of floating up and not being able to come back. Then a car came up the hill. I pretended to be asleep and figured that it would just drive around me. They got out and pulled me to the side of the road on some grass then left. \r\nAfter about an hour of lying on the grass I started to think that my pants were going to get really dirty and I was afraid of that. So I started to mumble to myself plans of how to get the stains out. Two of the others that lived in the house came out for a smoke and saw me there. They told me I'd better get up or else I'd get something called an M.I.C. I knew what an M.I.P was so the only possible thing an M.I.C. could be was a Minor Is Crazy. So I promptly tried to stand up but it felt like I was a half full hot water bottle and when I stood all the body heat rushed from the back of my whole body to just my lower thighs, calves, and feet leaving my whole upper body in violent shivers. I smoked a cigarette with the two then ran inside to get warm.\r\nThe stairs to his bedroom might as well been a mountain because my head was so heavy and cold that I couldn't stand still. I was mumbling nonsense to myself and still trying to get by the black bars. The two came back from their smoke and helped me get up the stairs, then told me to shut up for a while. This struck me with deep fear of them not liking me. \r\nI crawled into bed. I was afraid that I was going to drown in my own spit so I slept with my head hanging off the bed with my mouth open and down so the spit would just drip out. I started to come down off the high after I opened a window and took deep deep breaths of fresh air. Then I got incredibly cold again and bundled up in some blankets to which I fell asleep in. I awoke the next morning with a horrible smell coming from my skin and a severe headache. This was the worst night I've ever had. After that night I realized that I had slight trouble reading out loud and articulating what I was reading. Worst ever.\n\n\n"
}
