{
 "title": "The Gears of Existence",
 "author": "Iknewbetter",
 "citation": "   Iknewbetter. \"The Gears of Existence: experience with Cannabis & Salvia divinorum (leaves & extracts) (ID 41981)\". Erowid.org. Jul 27, 2007. erowid.org/exp/41981",
 "substance": "Cannabis & Salvia divinorum (leaves & extracts)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41981",
   "Male",
   " ",
   "Not Given",
   "Jul 27, 2007",
   "3802",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>We had just gotten back from a big outdoor party, and everyone sat in the dining room and smoked a bowl of weed.  The weed was decent mid-grade stuff.  I had been doing a lot of research on Salvia Divinorum on the internet and had ordered some from the internet about 2 weeks prior to this. I really wanted to try it.  I knew that I was in the wrong setting.  I should have been in a dark room with no sound.  </p><p>Anyway, me and my friend, 'Bob,' decided to spark up the Salvia.  I went first with the regular leaves and he followed.  It was a very enjoyable buzz, yet fleeting.  We then stepped up to the 5x, sprinkled on top of the regular.  This time, Bob went first.  He took a nice hit and passed to me.  I took a nice hit and set it down.  He starts laughing histerically, and I'm still just feeling buzzed.</p><p>About 10 minutes later he is finally 'normal.'  He wants to move up to the 10x.  I'm a little worried about this.  I know it's going to kick my ass, but I do it anyway.  I sprinkled it on, just as before, and I went first.  I handed him the pipe and sat back. </p><p>I immediately feel a much stronger buzz, followed by a slight pressure in my face.  It doesnt hurt, it feels like something was pressing an inch to the right of my right nostril.  I begin to see after images of things I was just looking at.  The whole room starts to get farther away.  I can no longer hear anything but a low rumble.  At this point, everything is ok.  I know that I have just smoked Salvia, but this is where shit hits the fan, folks.  I suddenly become aware of sections in the room that I am now looking at from OUTSIDE of it.  I desperately fight back to reality and try to talk, try to tell someone that I'm freaking out.  I can only get out a few words, 'Turn off the cvd.' This marks the end of the world as I knew it.</p><p>I no longer knew that I was under the influence of salvia.  This was reality to me.  </p><p>The pressure on my face now has multiplied and is now a huge pressure, yet still no pain.  The sections of the room were about One inch in depth and span the entire length of the room.  Think of a small doll house with the open rooms.  Now slice it like a loaf of bread from the ceiling down at 1 inch intervals.  Everything gets sliced, even people. This is what I was seeing.  I became aware that the pressure on my face was because that I was divided into slices with the rest of the room.</p><p>My friends tell me I looked terrified, and said they were trying to talk me back into reality.  This only added to the vision.  I couldn't hear what they were saying, but I knew they were talking.  Anytime there was movement in the room, the SLICE that the movement was on, was replaced by a new slice.  This new slice was rotated into place from the right.  It pushed the 1st slice out and to the left. Each slice was about 1 inch thick.  If someone's nose got chopped off with one of the slices, it was replaced by the next slice to appropriately match the movement that was made.</p><p>I immediately became aware of the bigger picture.  There were thousands of slices, millions.  They were all on a huge set of gears.  The set of slices I was seeing combined to create the 3d image of me and my friends sitting in the dining room.  I saw, as my friends continued to talk, the slices being rotated into place with great speed and force.  This was not a clean process either.  When the slices would rotate, my friend's face would be cut away with that slice, leaving the rest of his head waiting for the next slice, along with a string/trail of body fluid.  I could see the back half of his brain. This didn't cause him pain at all, he didn't even know it was happening to him.</p><p>To make this all worse, something was turning these gears with a crank, and it was only doing so because it wanted to be entertained.  That something was completely black, darkness.  I realized that I was part of a play thing for something much more powerful than me.  The only reason I existed was to be a part of the toy.  I wasn't really alive.  I was a puppet that's movements were pre-determined by a set of gears.  My whole life was an illusion that disguised a much more horrid reality.  My family, my friends, everyone, we were this thing's toy.  All it had to do was stop turning the crank, and everything would stop.  We would be stuck in our positions until 'the thing' decided to crank again.  It was a terrifying reality.</p><p>I highly recommend the use of salvia.  However, do not underestimate it.</p>"
}
