{
 "title": "The Seeds Of Self-Destruction",
 "author": "Klaatu",
 "citation": "   Klaatu. \"The Seeds Of Self-Destruction: experience with Cannabis (ID 42038)\". Erowid.org. Nov 8, 2007. erowid.org/exp/42038",
 "substance": "Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42038",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 8, 2007",
   "Views: 15066",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy highschool days were in the late 60s and early 70s in upstate NY.  My first recollection of ever even wanting to get high came with a school-issued pamphlet entitled 'Drugs: Flight From Reality'.  The drug descriptions were so lurid they were tempting.  The clincher was even moreso: it pissed off your parents, even SCARED them!  This publication made me WANT to do drugs.  I decided then and there that as soon as possible, I would become a head.  <br>Of course my first marijuana experience didn't work.  Nor did my second third or fourth.  Then, in the summer of my 17th year I discovered why this stuff was so popular.  I was waiting for a ride home from and end-of-summer dance when a carload of local freaks pulled up and asked if I wanted to go for a ride.  We smoked six joints in about fifteen minutes. Still no effect. Then they dropped me back off at the dance and WHAM, the minute I stepped out of the car I was high.  It was a long strange ride home.  Euphoria city. I was in love.<br>My use was episodic at first.  These were the Golden Days.  Every high was analyzed, catalogued, and legendary.  Other intoxicants were explored: tranks, speed, sopors...  Then, in Feb.(1972) of my senior year I tripped on acid for the first time.  Oooooooooo, not good...  It was windowpane and very potent.  I had a horrible bummer, just not ready for anything that consuming.  But pot... Always cool and sweet, never nasty.  I had begun buying it.<br>College was a blur.  People say that if you can remember the 70s, you weren't there.  That's somewhat correct.  Pot was everywhere and nobody gave a crap.  I used to look back on those days with fondness.  Now I realize they were the seeds of self-destruction.<br>In the mid-70s cocaine appeared.  Never liked it.  Too jittery, too 'gacky', too expensive...  'Disco-Dope' we called it. I was still a hippie and still in love with marijuana, smoking 1/4 oz a week.  Little did we know, as we were lining our lungs with ever-more-expensive tar, we were also lining the pockets of organized crime and terrorism.  But who cared?  I was stoned all the time.<br>I was married in 77 and for the first time began to experience opposition to my drug habit.  I was unemployed and as she worked two, then three jobs, she became slightly unsettled when she came home from a hard day's work to find the apartment blue with smoke and me still in my bathrobe, eyes glued to 'Bonanza' on TV.<br>Unemployed... Unmotivated...  How do you fund a drug habit?  Sell your shit!  I sold an extremely precious family heirloom, a Model 1842 Springfield cap and ball musket (carried by my great-grandfather in the Civil War) for 2 oz. of pot.  <br>I also grew it. Right in the apartment under lights.  Even got evicted for it.  <br>I finally landed a good job.  But the hours were long and the work tedious.  When could a man get high? My connection was a fellow employee. Little did we know, management was watching. They hired a detective. Soon this guy was part of the 'in' crowd taking names. A bust went down. My contact, and other employees (including the foreman's son) lost the best jobs of their lives and gained criminal records. Me? I had already quit, opting to smoke dope all day.<br>By '79, something had to give.  I was going nowhere in life.  The solution was to LEAVE.  It was this TOWN, it was this STATE, and maybe, just maybe it was this dope habit (but probably not, so I told myself).  We were going to see the world, or at least this country of ours.  For the first time in my life I made an effort to quit pot.  It lasted 2 days. I bummed joints at every stop we made. <br>We ran out of money in Fla. and decided to make a stand. If you're trying to give up pot, Fla. is about the worst place to be. Homesickness, low wages and constant exposure to cocaine drove us back to NY in a year. Next thing you know I'm sitting in a dumpy apartment with no job, the place blue with smoke, eyes glued to 'Bonanza'....<br>We stayed in NY 6 years.  Had a kid.  Once again, I decided to clean up. On my 30th birthday I swore my kid would never see me smoke dope.  But it just wouldn't leave me alone.  Nightmares... Panic attacks...  I lasted 5 weeks.<br>Resuming life in the bag, I had developed a very bad cough.  Shortly after my 31st birthday I got up one morning and coughed up a big glob of blood.  Spent 3 days in hospital and had a bronchoscopy.  No results ('You are healthy sir, that'll be 3,000 dollars, please'). With that news I went right back to the weed.  After all, I had just spent three days without any.<br>Once again though, I felt I was going nowhere in life.  The solution?  Start my own business! Back in Fla.! Now I could get high any time I wanted.  No employees, no boss, torch up! 3 months later I awoke with my usual nasty morning cough and hacked up another glob of blood.  Fear and intense depression descended.  I told my wife.  'Give up pot!' she said.  So I did.  For one day.  <br>It is said old habits never die, you just get better at hiding them. I became real good at it.<br>Before breakfast...  Mid morning... late mid-morning...Before lunch...  Mid-afternoon...  After work...  With cocktails... Before bed...  I was smoking what, 8-10 times a day?  Was I even getting high anymore?  Why was I still doing this?<br>A second child at age 40. At that point, 22 years of dope tar in the lungs.  Coughing like a smoker, facial creases like a smoker, teeth stains like a smoker...  I had to see a doctor about a cold I could not shake.  He asked how many cigarettes I smoked per day. I half-lied and told him none. He smiled and said 'You're smoking SOMETHING, I can tell.  It's not crack, is it?'<br>'No, of course not.'<br>'Good,' he said, 'Because crack after 40 is a death sentence.' Then out of the blue he said 'You know, it's not so important how MUCH marijuana you smoke, as how LONG you've smoked it.  That stuff binds with your fat cells.  You may NEVER be able to pass a drug test.'<br>'Uh, yeah... Right.'<br>'Well,' he sighed,'Someday that may be important information.'<br>That was 11 years ago.  And today, one year after my 50th birthday, I am one-year drug-free. <br>There are several things I find sad to see:<br>   Old, out-of-shape rock musicians, still beating it to death in the bars<br>   Children smoking cigarettes<br>   Bald guys with pony tails<br>   And old dope smokers<br>And after 32 years, I finally do not fit in that last category.<br>The first month was hell--panic attacks, anxiety, anorexia, depression...I'm still having nightmares.  I like to think that's my brain waking up.I still have dreams whhere I am procuring and smoking pot--but not as often as I was. I do not cough anymore--not a bit! And last month I went and bought a drug-testing kit.  Guess what?  I passed! That doctor was right, that information was very important.\n\n\n"
}
