{
 "title": "Third Time's a Charm",
 "author": "Gabrielle",
 "citation": "   Gabrielle. \"Third Time's a Charm: experience with Salvia divinorum (20x extract) (ID 42039)\". Erowid.org. Jul 20, 2008. erowid.org/exp/42039",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 42039",
   "Female",
   " ",
   "Not Given",
   "Jul 20, 2008",
   "Views: 2297",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience was somewhere back in the early spring of last year.  Around March, I suppose.  I was over a my friend's girlfriend's house and he suggested we go out back and smoke some salvia.  He had a particularly strong extraction with him, and I had done it a couple of times before, so I said sure and went with him. I wasn't really expecting anything new.</p><p>Let me add that the first time I smoked sally d, a couple of years before this, not much happened.  The second time, about December of 2003, it just felt like a very intense high.  I was laughing a lot, there was some disorientation, and generally I had a lot of fun acting like an idiot.  This third time though, was like nothing I had ever experienced, or probably ever will again.</p><p>Those first couple of times it had taken a few hits before I felt anything.  But with this stuff, one hit and I was gone.  I was sitting there on the porch steps trying to hold my breath for the full 30 seconds, to get the full effect.  Counting in my head...13...14....15....my friend says I held it for the full 30, but I only remember up to 15, then I felt myself exhale, and everything changed.  It was like my mind left my body with my breath.</p><p>I was somewhere dark, utterly pitch-black, but there was an awareness of light - of what looked like cubes of light, surrounded by brick walls.  I was inside one of these, looking out, and every cube was connected to every other, and there were millions of them.  Somehow I was also inside all of them at once.  I didn't remember any other existence - not this world, not my body, not my friend's house.  All of that was forgotten.  There was an overwhelming feeling of safety, of coming home.</p><p>After what felt like an eternity of this I gradually remembered myself and this reality.  Coming back to my body took effort.  My friend had seen me sitting there with my eyes closed and said something to me, which is what drew me out.  I opened my eyes and the rush of visual information was overwhelming.  My very first thought was 'Is it safe to stand up?'  And thinking, at all, was like yelling across a canyon.  Every thought seemed to echo back and forth in my mind endlessly, blocking out everything else.  Frightened by this, I grabbed my friend's hand frantically enough that I was almost scratching or clawing him, but seeing his scared reaction calmed me down and I got hold of myself.  I remembered that people could be hurt, and I didn't want to hurt him.  It was so strange.  In those few minutes after the first few seconds it was like I had to re-learn the laws of physics very, very quickly.</p><p>For the next 10 to 15 minutes, while the high continued, I pretty much wandered around the backyard looking at things.  Every time I turned around it was like the world was created for the first time in front of me.  I paced in tight circles for a few minutes, watching this.  My friend kept trying to get me to talk about what was going on, but speaking took a huge effort.  It felt like I had to literally reach down and pull the words up from somewhere; the most I could manage was 'Not now.'  After around 20 minutes I was pretty much normal. I had to go to the bathroom, and while in there I looked at myself in the mirror and repeated 'That was INSANE' for a few seconds.  It helped me come back, and I knew it to be true.  Definitely one of the weirdest mental states I've ever experienced.  But those first few seconds made it worth it.  They were beautiful; the feeling was absolutely indescribable.  It felt like I had been looking at my soul, seeing each neuron fire...completely amazing.  I was left with a feeling of exhilaration and gratitude that lasted weeks.</p><p>Salvia spiked my interest in psychedelics.  I actually haven't touched the stuff since; I feel like I've gotten the most out of it that I could.  It was the first time I ever 'tripped' off anything, I had been stoned many times but nothing was like this.  Anyone who's thinking of trying it, please have a healthy respect for the stuff and how unpredictable it can be, and for the love of god use a sitter.  Otherwise, have fun!</p>"
}
