{
 "title": "Vietnam and Baby Heads",
 "author": "TheTruth",
 "citation": " TheTruth. \"Vietnam and Baby Heads: experience with Cannabis (ID 42042)\". Erowid.org. Jul 20, 2008. erowid.org/exp/42042",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42042",
   "Male",
   "",
   "Not Given",
   "Jul 20, 2008",
   "2749",
   " "
  ]
 ],
 "report": "<p>It started out as any other Friday night. My friends and I were upstairs in my house getting ready to smoke some bud. However, there was some confusion in who was bringing how much weed. It ended up that everyone brought what they had which amounted to a total of 10 grams. Now I've been smoking for about 3 years now and I have a pretty good tolerance but 10g sounded a bit extreme. But fuck it we all decided unanimously. So we pull out our 2 foot bong and smoked 10 grams in 30 minutes. That is pretty insane, especially for five people.</p><p>So we finish smoking and we are all sittin around letting everything set in. Before I know it I was high, but this was not the usual high that I feel every Friday I smoke. Time slowed down and everything was spinning, this didn't seem like too big of a deal so I didn't let it bother me. I looked over at my friend Brian, something seemed wrong but I turned back to the TV. Then something clicked in my head, I looked back and he was in full camoflauge. After jumping almost 10 feet in the air, I looked at the rest of my friends and the mirror, we were all in full camo and had M16. Earlier that week I had been watching Dead Presidents (a Vietnam movie) so I tried to convince myself that it was just some type of image I was projecting from my head. But this seemed to real, I had been here before, I could smell the swamps and I could feel the air. The only thing was I couldn't move in this jungle, it was like I was trapped in a painting but I could feel and see everything in it.</p><p>I began feeling afraid and wished to shake this trip, but I was unable. I was stuck in this world despite my best efforts. My friends were all staring at me asking what was wrong as I later found out apparently I had a comatosed look on my face. Just as I seemed to be falling back to reality I heard a voice in my head. It sounded like Brian's only it was muffled, like it was coming through a megaphone. I attempted to listen harder and I could hear the same phrase being repeated over and over again, it was being drilled into my brain, I could feel the words in my head. I realized this must have been the voice of some type of Head Quarters or something, and the voice was saying, 'ELIMINATE THE VIETCONG THREAT!' A feeling of horror and shock came over me and I began to scream for help and to leave this place.</p><p>It seemed like an eternity but I finally touched back with reality and saw my friends standing over me with a confused look on their faces. I explained what had happened and we all tried to make sense of the situation but nothing did. The only some-what logical explanation was that in my past life (as I said somewhat logical) I had been in Vietnam. At least this was the rational of Jeremy. At this point I realized I was beyond high and was somewhere beyond reality.</p><p>I looked over at the coffee table. Upon it were a vase and beautiful roses. They were red but the colors seemed to be more vibrant then ever. I was in a trance and kept staring at the flowers, it seemed there was some sort of shape in the rose. I looked harder and it was a baby girl's face/head. My heart seemed to jump a mile and a feeling of utter horror came over me. I shook my had harder and faster but the face remained and was beginning to come closer. It got closer and closer until it was right in front of my face. It had a demonic smile on it's face and I felt an impending doom set upon me. I closed my eyes and I could see the face ever closer it's mouth began to open and I saw what seemed to be what The Divine Comedy describes as pergatory. I saw bodies mutilated and I could feel fire all around me. I tried to escape and leave but I was unable. I opened my eyes and the visions in my dream spilled into the reality. At that point I felt an enlightenment. I was able to fly and move freely in what seemed like my prison. I flew up and up and up and I was in a land of eternal white.</p><p>The next thing I knew I was sprawled across a green couch and the clock read 10 A.M. I being enfuriated as I realized I had lost a night of being high with my friends and I had experienced a religous awakening and what seemed to be a flash back to Vietnam.</p>"
}
