{
 "title": "Allergy Meds and John Lennon",
 "author": "Killspy",
 "citation": "   Killspy. \"Allergy Meds and John Lennon: experience with Diphenhydramine (ID 42057)\". Erowid.org. Aug 2, 2007. erowid.org/exp/42057",
 "substance": "Diphenhydramine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 1:00",
   "100 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 3:00",
   "75 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42057",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 2, 2007",
   "Views: 5841",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I got 'high' from allergy meds was a complete accident. I misread the package. Nothing too exciting happened other then the fact I thought there were some massive earthquakes, and Full Metal Jacket was talking to me.\r\nThe second time was intentional.\r\n12:00 AM\r\nSwallowed 4 25mg pills. Immediatly felt shakey and somewhat confused. I was drawing pictures and I just couldn't get it right. Soon I began to fill paranoid (as I do right after trying a new psychoactive) so I got online, wrote a will and e-mailed it to my friend. I could feel my heart working harder.\r\n1:00 AM\r\nSwallowed 4 more and started watching 'Syd Barret and the Pink Floyd Story'. It grew more interesting by the minute but I still thought that the pills weren't working very well.\r\nBut wait.. Something caught my eye. The carpet started wavering, like water. I stared at it..nothing happened. What, there it goes again. This time when I looked it was rippling! I got up, turned the tv off and put some music on, waiting for whatever came next.\r\nThrough out this time the carpet was rippling, smoke or steam would creep out from under the desk (only to hide itself again when I looked intently) and the walls were 'breathing'. I say it like that because it was more of a mechanic motion rather then a smooth 'shrink and grow'. The best way I can discribe it as when I'm in a room with a strobe light. How it looks like I'm skipping frames in a movie or something.\r\nMy mind would wander, never staying in one place. It's true what I herd, that it makes you think a lot about drugs and stuff. I can't remember any specifics to what I was thinking, but I was concentrating very hard on them. Things would pull me out of thought like audio distortions or the thought that I saw something out of the corner of my eye. \r\nThings like shadows crawling up the window or creeping across the carpet. Things shrinking and dissapearing only to suddenly reapear agin. Audio distortions of things louder then they were supposed to be..\r\nThe only hallucination I had was just funny. In my room I have wood paneling, so naturaly I was making out a lot of shapes, some I had seen before some I hadn't. I happened to be looking (but not concentrating or even focusing) at one that reminded me of a dog. While I was deep in thought I watched as a white English dog danced around playing a fiddle. The second I realized what I was watching it dissapeared though. It wasn't a solid hallucination.\r\n3:00 AM\r\nSwallowed 3 more pills.. I didn't want to go overboared. Well right after that the old paranoia kicked in again. I threw out the remaining pills, told myself I would never touch any drugs ever again and decided I had taken two pills to much. I was sure I would OD and have a heart attack or something. So I decided to just sleep it off. I whimped out.\r\nI restarted the cd changer and laid there listening. My body started to feel really heavy. I tried lifting my fingers and managed only by straining myself. In my head I knew that it really wasn't that heavy but it didn't help. My legs were stone. I felt half awake and half in a dream, a deep dream. I moved and shifted into a comfortable postion.\r\nIt was hard to fall asleep. Those last three pills knocked me down, but I wasn't out. So what if I can't move or sleep. I stared at the wall looking at a picture of a hot celebrity. Thats when I got angry. The damn picture kept on moving in a circle mocking me.. After cursing didn't stop it I guess I just closed my eyes.\r\nAt some point Pink Floyd was playing. 'Shine on You Crazy Diamond Prt I'. I've always loved the intro, especialy when the guitar comes in. For those who don't know, the song is about the bands founder Pink Floyd and how Waters saw his deterioration.. Anyways.. It had just come to the part where the guitar comes in..and there was me dazed and confused. It was awesome! Instead of guitar I herd words. Words about Syd and how the band misses him. It gave whole new meaning to the song for me. I dazed off again.\r\nEventually it started playing the Sgt Peppers album, and it was on the track 'Within You and Without You'. I fell asleep to John Lennon gently calling my name over and over again.\r\n5:+ AM\r\nSomething scary happened. At the end of Sgt Peppers theres a weird track after song 13. It woke me up quite violently and I thought there was some creep in the room yelling chants. When I realized what it was I just went back to sleep.\r\nHangover\r\nDay 1\r\nThe next day wasn't that great. I felt bored, emotionaly exhausted, and hollow. I didn't want to move or do anything. I did feel more 'open minded' I guess you could say, and kinder though. I decided that I wasn't going to fall victim to boredom so I called a friend. Hmm, busy till the end of the day...So I watched seven hours of King of the Hill. Also, I kept listening to 'Within You and Without You' over and over again. I went to bed the hoping the next day would be better.\r\nDay 2\r\nStill feeling hollow and mentaly drained, though not as much. On that day I felt more depressed though. I don't remember what I did, but I could tell it was finally starting to where off. At around 7PM I was myself again.\r\nOverview\r\nI don't know if I'll do this again due to the two day depression-fest. If I do I'll be sure not to whimp out again! Another reason I might not try again is because it's so easy to OD on meds, and when I'm high, those pretty pink pills look good!\r\nFor anyone thinking about trying this out I say be careful. Always start with low dosage and good research. Also make sure your in a safe enviroment to.\r\nGood Luck\n\n\n"
}
