{
 "title": "The higher I Go, The Lower I Stay",
 "author": "Pharmtard",
 "citation": "   Pharmtard. \"The higher I Go, The Lower I Stay: experience with Bupropion & Various (ID 42074)\". Erowid.org. Aug 2, 2007. erowid.org/exp/42074",
 "substance": "Bupropion & Various",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Bupropion",
   "(daily)",
   " ",
   "  ",
   "insufflated",
   "Pharms - Bupropion",
   "(ground / crushed)",
   " ",
   "  ",
   " ",
   "Various",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 42074",
   "Male",
   " ",
   "Not Given",
   "Aug 2, 2007",
   "Views: 13653",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The Fall before last, due to an obvious lack of motivation and 'happiness' seen by my parents, I was taken to the doctor and prescribed wellbutrin xl 150mg to be taken daily. In addition to mild depression, the medicine was reputed to alleviate my nicotine cravings and make quitting smoking more bearable. At the time however quitting smoking was not in my immediate plans. In reality I perceived these purple coated pills as a new means of recreationally escaping my daily woes and stress, yay! </p><p>After reading several experience reports likening the insuffulation of crushed bupropion to a mild cocaine buzz I decided to give it a trial run. I crushed up lines of it, and upon snorting I noticed, 'This crap burns like holy hell!'. I have snorted all kinds of pharms, coke, speed, but this was way up there on the pain-o-meter. Immediately however, the alleged mucus membrane analgesic effects took over the pain, which then led to a quickly intensifying sensation of stimulation. This could be comparable to coke, but in my observation the stimulatory effects led me to compare it much more closely to speed, only less euphoric. Reasoning and higher thinking was exponentiated to the point where I actually started performing complex mathmatics and algebra (something I'm not usually fond of) just to compare the boost in mental capacity! This experience led me to the habit of crushing up the pills and railing them, along with popping one-a-day to keep a steady stream going through the bloodstream. </p><p>Needless to say the effects, however pleasant and desirable, steadily decreased with usage leaving me more drained and depressed after coming down from some good lines. I tried augmenting its effects with caffeine, which worked well and boosted its effects considerably until I realised I was drinking up to several pots of coffee daily! At one point months later I recoursed (to great regret) to smoking some meth my friend had been getting lately. At this point I didn't even think of my bupropion habit as anything more than a medicine that kept me 'normalized' throughout the day, not a hint of a high or buzz. The meth hit me harder than ever, I got hooked again and tweaked for a week or two until one night I started experiencing panic attacks. These weren't ordinary, I've had panic attacks before. These were severe and overwhelming. Thinking the wellbutrin could be affecting my brain in combination with the meth I had built up in my system, I ceased all stimulant intake, including the wellbutrin. However the panic didn't go away, instead I started becoming psychotic or manic If I was alone. I would slip into this psychosis to the extent that I would *swear* I was about to die. </p><p>The next evening it was worse, I distinctly remember having a cigarette and a small toke of weed outside and began hearing (hallucinating) voices conversing off somewhere close. I mentally created the scenario that my parents caught me smoking weed outside and were trying to find me. Scared out of my gourd, I ran inside to my room and remained there for the rest of the night, convincing myself the voices were being created in my head until they eventually ceased, thankfully. These psychotic episodes lessened over the next few days, and haven't ever really returned since stopping the wellbutrin. I also haven't done any meth since, except one sole incident in the summer. I had learned my lesson about stimulants. THEY WILL TEAR MY BRAIN APART. The more I rely on them to improve my focus, concentration, energy, or mood, the worse I will feel without them. And it takes a very long time to recover from the damage. I am still getting better, even as a year and several months have passed. I may never have the natural mental strength and energy I once had, and I am now 30 pounds lighter, have trouble gaining any muscle mass, and my joints ache so bad sometimes that working a full-time job is a terrible strain, but I can find what I sought from stimulants through much safer venues. </p><p>Wellbutrin definetely *can* be a very therapeutic drug for the right people, but mixing with stimulants, even caffeine, increased my tolerance very quickly and retarded its effects. So if you aren't really sure, think twice before taking it to get high. If you must do stimulants, don't recourse to pharmaceuticals!</p>"
}
