{
 "title": "Beware Heart Effects",
 "author": "Kevin",
 "citation": "Citation:   Kevin. \"Beware Heart Effects: experience with Tabernanthe iboga (whole root powder) (ID 42104)\". Erowid.org. Jul 28, 2005. erowid.org/exp/42104",
 "substance": "Tabernanthe iboga (whole root powder)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "8.0 g",
   "oral",
   "Tabernanthe iboga",
   "(roots)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42104",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2005",
   "Views: 17146",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSummary:  \r\n1) Would-be Iboga experimenters are advised to avoid whole-root powder and ensure that they are using a preparation based on root bark only.   Whole-root powder does not have psychoactively significant concentrations of alkaloids, and I found it nearly impossible to swallow without gagging. \r\n2) Iboga should not be taken by people with heart conditions or blood pressure problems.  I add my own anecdote to the many others who have observed Iboga having undesirable side effects regarding blood pressure and heartbeat.   \r\nNarrative:\r\nI dosed myself with 8g of what was claimed to be Iboga root powder mixed with orange juice over a period of several hours.  The taste was unimaginably bitter, and the sawdust-like character of the powder brought on intense gagging.  But I was able to get down 6g without gagging it back up.   \r\nA few minutes after the first dose, I felt what I believe was a blood pressure effect... the force of my heartbeat increased, and I felt flushing on my face, neck, and ears.   I got a mild headache.  I felt a very slight disorientation.   I laid down for a few hours, and nothing ever happened.  All effects disappeared after 8 hours.\r\nI am certain that the ineffectiveness was due to it being a whole-root powder instead of just powder of the root bark.  The Iboga root bark has the highest concentration of psychoactive alkaloids, while the root itself has very little.   Thus, if the whole root is powdered, I am getting a very diluted and foul-tasting product that will not induce any significant effects.  I was cautioned about this possibility, but I decided to try it anyway because a certified product was unfeasible to obtain.   \r\nI also want to report that my heartbeats became very strong and I felt slightly short of breath for this whole time.  Also, I had a mild headache and flushing of the face, ears, and neck, which I attribute to a change in  blood pressure (these symptoms are identical to what I experienced from Viagra a couple of years back).  If someone has a heart condition or blood pressure problems, they probably should not take Iboga.\n\n\n"
}