{
 "title": "My Head is on Gears",
 "author": "Mosekid",
 "citation": "   Mosekid. \"My Head is on Gears: experience with Cannabis (ID 42107)\". Erowid.org. Jul 17, 2007. erowid.org/exp/42107",
 "substance": "Cannabis",
 "bodyweight": "101.5 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42107",
   "Male",
   " ",
   "Not Given",
   "Jul 17, 2007",
   "3095",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been a light Marijuana user for a modest amount of time, but nothing even came close to this experience.  I was at home alone and I decided to smoke a little of the Marijuana I had bought from a friend earlier in the day to help me relax.  I smoked what couldnt have been more than ½ gram.  Within five minutes I knew something was off, I had intended to take a shower afterwards so I was in the bathroom and the shower was running.  After smoking I could barely clean up.  I began feeling like I was daydreaming; only whatever I dreamed up became real.</p><p>About ten minutes into the experience I was swept out into what seemed like space.  I was floating and I had completely lost connection with my physical body.  Then I came back, instead of floating in space I was floating in my bathroom.  I knew I had to clean up so I stuck my head under the shower, which seemed to partially ground me for about a minute.  I cleaned up my stuff and went back into my room.</p><p>I started feeling like I could hear ever ligament and nerve and bone in my body move and click as I moved any part of my body.  I felt as if I was a robot, when I moved my head I felt like It was being moved by gears.  Eventually I had almost convinced myself that I was a robot.  I moved downstairs by my TV, a change of environment seemed to ground me for a minute or two.  Once the effects were back I realized since my head was on gears I could move it to any part of my body.  I could move my head down my sides and see all different perspectives.</p><p>Then I was sucked into another all enveloping hallucination.  I was being roasted rotisserie style over an open fire by African Natives.  Where the fire should have been burning me, I felt only warmth, like an extreme concentration of body energy.  Eventually the feeling had enveloped my entire body, I felt as if I was in space again, only this time I was floating with warmth and body energy flowing through my body.</p><p>I came back to reality and realized that 28 days later, that zombie movie, was on TV.  I felt like my eyes were bouncy balls bouncing around my sockets.  I couldnt move my eyes straight to something, if I tried to move them to the left, they would zigzag up and down until they got there.  I felt hungry all the sudden, I started eating crackers since they were right next to me.  All the sudden I felt almost like an attachment to a cracker and I started licking it uncontrollably.  I licked it and then took a bite, which felt like the ultimate ecstasy.  After that I dont remember much, I think that Phone both came on TV and I began to come down.  I woke up this morning on my couch with the TV still on.  I dont know why this happened but if given the choice I would repeat an experience like it without hesitation.</p>"
}
