{
 "title": "Gummie Bears and Rainbows",
 "author": "Sparkles",
 "citation": "   Sparkles. \"Gummie Bears and Rainbows: experience with Ecstasy (ID 4213)\". Erowid.org. Dec 14, 2000. erowid.org/exp/4213",
 "substance": "Ecstasy",
 "bodyweight": "98 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4213",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Dec 14, 2000",
   "Views: 10070",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nTo understand what ecstasy is like for me you would have to understand who I am first.  I am a shy 19 year old female, who just became seperated and feel alone, afraid, rejected, unloved, and unimportant. I guess thats the reason most people start using drugs. I woke up one day to find I had no true friends, no husband, no job, and my family could only console me so much and help me in small amounts financially.  I was alone.</p><p>I met a friend who was experiencing the same trauma in life as I was and we immediatly clicked and became best friends.  We were looking for adventure and looking for love so we began to hit the club scences.  We ended up a rave club in a near by city but neither of us knew what all the rave scene was about.  I had quit smoking pot (which was the only drug I ever used) for 2 yrs and she had never taken anything harder than an asprin.  She met a guy there that she was very interested in and he was a 'roller'.  One night we decided 'what the heck' and decided to try it for ourselves.  We both took one 5 point triple stack blue speckled rolexes (its not as complicated as it sounds) at around 11 pm.  With in 30 minutes I began to feel the effects.  Its hard to explain the way you feel on ecstasy because it is the greatest feeling in the world.  My legs began to feel tingly at first and then later my whole body began to radiate with this wonderful new sensation.  My state of mind changed completely.....I went from a bashful little girl...to this friendly warm hearted person with a wonderful personality that people seemed to be drawn to. I started to see myself for who I really am.  Ecstasy opened my eyes to the person inside I hid from the world in fear of rejection. People were walking up and talking to me and I would just smile and have the best conversations with complete strangers.  I wasnt afraid anymore to speak, I didnt think of rejection.  All I could think of was how important I felt, how I was the center of attention, how all my fears melted away with just one pill.</p><p>I later met a crowd of people, which now are my best friends. I sat with this people all night talking for hours and hours about life and who I was and who they were. It was the best 8 hours of my life.  We bonded on a level that night that nobody could ever dream of without the magic of XTC.  My friends form a perfect circle made of the most diverse personalities which makes each of us special and unique. Some may say our friendship is a 'drug induced misconception' but I beg to differ.  When you are rolling you speak the truth from your heart and you bond with others because your fears are washed away.  I have always had a problem with telling people how I feel but when I roll I speak my mind and tell everyone just how important they are to me and how I appreciate everything they do for me and how much I love them.  The magic I felt the first night I rolled will last a life time because it has led me 'home' to people who truely care for me and love me for who I truely am.</p><p>'Reality is a crutch for people who cant handle drugs, reality is full of lies and masks we all wear. I'ld rather die telling the truth and being who I really am without being afraid than to live, lying to myself, misserible, dying on the inside, and hiding my true face.'</p>"
}
