{
 "title": "Peaceful on a Hill",
 "author": "Bob",
 "citation": "   Bob. \"Peaceful on a Hill: experience with DMT & MAOI (ID 42150)\". Erowid.org. May 3, 2007. erowid.org/exp/42150",
 "substance": "DMT & MAOI",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   " ",
   "MAOI",
   " ",
   "  T+ 0:30",
   "100 mg",
   "oral",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 42150",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 3, 2007",
   "Views: 12290",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend had been extracting DMT from this root for a few weeks now, and one day he calls me up and says, 'it's ready.'  So he comes over and weighs out 100 mg, and puts it in a capsule.  We had to take what he called, MAOI, something about it helps the dmt not get broken down in the stomach, I don't know.  So we take the maoi and 30 minutes later, down goes the dmt.</p><p>About 30-45 minutse later, i could feel the chemical starting to flow through my veins, tickling my brain.  We had on a CD by Boards of Canada, and it was making the lower back part of my brain pulse with the crazy drums that were going on.  We were trying to play pool, but everything was too weird.  Colors were definatly more vibrant, tracers were there, but not too intense.  There was a buzz i could sense and it told me that this was going to be a good ride.</p><p>60 minutes into the experience we decided to go for a walk up the road into the fields that are close by my house.  Every night we go up there to partake of the sacred herb marijuana, but not this night.  We got up there and had no desire to smoke anything.  Our thoughts were clear, consistant, i had a very good sense of everybody's personalities, i guess is the word.  If in a social confrontation, i would have been able to remain completely calm and clear headed.  My thoughts and ideas were expressed very clearly whenever i wanted them to be.  It was similar to lsd and mushrooms as I had a 'trip' going on, but the 'trip' was entirely different.  Not intense, not overwhelming, just smoothe, mellow, relaxing. </p><p>90+ minutes.  The auditory hallucinations were very noticable.  Sounds were so insanely clear and crisp.  Everything in the area was synchronized, it was really something to experience.  For a while all the colors were all one color, very monotone, until somebody pointed it out that it looked like that, then colors were everywhere, this being at night was really something.  nothing intense though, very pleasent.  On our way back into the city from the hills my friend, the one who was tripping with me, pointed out that this was a very peaceful experience.  I couldn't agree more.  I was on my way to becoming one with the universe.  It was very reminiscent of an acid trip i had once, just a lot more mellow, and relaxed.  It was amazing.</p>"
}
