{
 "title": "Hectic Hallucinations",
 "author": "Jim",
 "citation": "   Jim. \"Hectic Hallucinations: experience with Paroxetine (Paxil) & Lorazepam (Ativan) (ID 42163)\". Erowid.org. Mar 4, 2011. erowid.org/exp/42163",
 "substance": "Paroxetine (Paxil) & Lorazepam (Ativan)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)",
   " ",
   "1 mg",
   "oral",
   "Pharms - Lorazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42163",
   "Male",
   " ",
   "Not Given",
   "Mar 4, 2011",
   "8958",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've had OCD, depression, and severe anxiety for most of my life and was diagnosed with these conditions at a relatively young age. I have always been against selective serotonin reuptake inhibitors because the psychopharmacological aspects are not even entirely understood. </p><p>I was having uncontrollable suicidal ideations so I was hospitalized for 72 hours to be evaluated. My psychiatrist prescribed me Paxil and Ativan so I decided to at least give these medications a try. I was informed to take Paxil daily and the benzodiazepine only when necessary. </p><p>Well, after 4 days of being on only 10 mg of Paxil, I became very nervous and I couldn't stop worrying. So, as directed, I took 1 mg of ativan to combat this extremely intense anxiety. It definitely seemed to work, because within 30 mins I was anxiety free; however, something just didn't feel right and I wasn't able to put my finger on it, so I decided to get some rest. As soon as I turned the lights off and my eyes adjusted, I began to hallucinate severely. My bed would warp around and melt into the walls, I could see people drinking coffee and walking around in my curtains, and the walls and my pillow were fluctuating and breathing. Keep in mind, that there were absolutely no traces of any other substances other than the ones specified in my system.  While all of this was occurring, I managed to remain calm. Once I turned on the lights, all of the hallucinations vanished, and I was instantly relieved. After 2 hours, I was able to fall sleep with the lights on. I informed my doctor about this adverse reaction and he switched me over to alprazolam. </p><p>I continued taking paxil for a few days but just could not tolerate the way it left me feeling, or, if you will, not feeling. I felt like an emotionless zombie with no motivation, interests, or desire to do anything. I stopped cold turkey and luckily didn't experience any of the horrible withdrawal symptoms that are notorious when abruptly stopping any SSRI, mostly because I only took it for 10 days. </p><p>Conclusion: I'd rather be severely depressed than feel like a machine with no emotions; at least when I'm down, I feel like I'm human.</p>"
}
