{
 "title": "A Wild Ride To Remember",
 "author": "To Young To Die",
 "citation": "   To Young To Die. \"A Wild Ride To Remember: experience with MDMA & PCP (ID 42171)\". Erowid.org. Jul 23, 2008. erowid.org/exp/42171",
 "substance": "MDMA & PCP",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 3:00",
   "1 tablet",
   "insufflated",
   "MDMA",
   "(pill / tablet)",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42171",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2008",
   "Views: 12545",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: This report is marked as a PCP report, but readers should be aware there are aspects of it that suggest the identification is speculative.] \r\nIt all began when I started to feel bored with the usual everyday partying. Over Spring Break I felt tired of the same situation, get drunk and stoned to the point of stupidness. Everybody's been there but after a while, it gets boring. So 15 of my friends decided to get together and try something wild and new. What drug do we pick? MDMA of course! The club drug, the drug that puts you in a state of Euphoria and 'Well-Being'. We Tried it once, threw a little rave at a buddy's house and had a great time. We told ourselves 'Hey, ya know what? This isn't all that bad! Actually, it's amazing! But let's keep it to once a month.'\r\nSo much for that, next thing you know, we're throwing these insane raves spending thousands of dollars every weekend just to get that 'same high' again. Field raves, house raves you name it, we threw it. Me and the original 15 people who tried it started an ecstacy boom at our little Tampa, Florida High school. Being the kind of person I am, I didn't think much of it, you know every high-schooler thinks, 'Well shit, nothing will ever happen to me, blah blah blah.' Thats how I was until recently, actually just this past weekend I purchased a Bean called a Tahj Mahal. Picked up 50 of them to be exact. Boy what a mistake. The usual bean dealer I go to, he makes them himself so I would always make sure there's a reasonable amount of MDMA in them and nothing else. But this one certain weekend, he so happened to be out of town.\r\nThe night started off well, I picked them up from a friend who said they were pretty strong, containing about 200 mg. of MDMA only and one will do me just fine. I went and picked up all of my equipment: turn tables, music, ground speakers, the whole deal, and set it all up at a friend's house. 8:30 approached and I began handing out these blue beans. At around 9:00 when I made sure everyone had at most 1 1/2 I popped two for myself. Oh boy are these good, we raved and raved and raved until I for some reason had the urge to snort a half for myself and then take another half at around 10:30. I did, and thought nothing of it. When 12:00 rolled around I decided to snort and pop another full one, because I felt as though my high wasn't reaching that point of excellence.\r\nAt around 12:30 it happened. I was running around making sure everyone was hydrated and feeling ok. As I walked into the kitchen, the walls began to bend and I realized I was visually hallucinating off the beans, it was great until I noticed that the lights were flickering on and off. I looked up at the light and noticed it wasn't on, but there were flickering lights, I looked at the switch, It was off. It struck my chest like a canyon, a pain so great that it made my mind run wild. The kitchen began to swirl as I held my chest, I noticed that my heart was racing faster and faster to the point where I thought it was going to burst completely out of my chest.\r\nI fell to my knees, everything became a blur, the pains were terrible! Shooting up and down the entire left side of my body like bullets. I than began convulsing. The only thing that saved my life was my ability of great self-control and being able to put myself in a state of tranquility. After watching myself flail my arms and throw my chest out, I began to take very deep intense breaths until I regained control of my body. I stood up and began to walk around the house. The music turned off and everybody shrieked at the sight of my face. I was pale as a ghost and very clammy cold. at around 12:45 I made sure everyone understood that I was ok and I did not need any medical help, all I needed was a good blow up to kick my high back in. That was my final mistake.\r\nWhile I was passing myself out, my friend who sold the beans to me arrived at the house and warned everyone that there was 2-3 mgs. of PCP in every bean. 1-5 mgs. of PCP is enough to put a person in a good state of mind and have a decent trip. But I, not knowing that there was PCP in the beans, had taken 4 by that time. That's anywhere from 9-10 mgs. of PCP taken by ingestion. I kicked started my PCP as I woke up from passing myself out. I received an absolutely amazing high, one that cannot compare to any drug I have taken.\r\nI was on my road to Genesis, on the heavenly stairs approaching the gate. But the affects of PCP are dark and mysterious and I soon fell into a state of fear. My mind was exploding with unthinkable and un-answerable questions that I could understand completely. I zoned out of my body and began to float around the house feeling a good pain. A pain that was numbing, something un-explainable and unique. My pupils became abnormally large and I began to have strong visual and auditory hallucinations. I began seeing people who weren't moving but just sitting and staring. After getting up out of the seat I passed myself out in I became immediately dizzy and very disoriented. I began having serious illusions and delusions.\r\nWriting began to fly out and hit walls. Random words such as 'Titanics Away' and 'Sky Clerks'. After my paranoia vanished, I began to enjoy my trip. Mirrors distorted images so intensely, peoples faces dripped away and rewinded back to normal. Body's became completely distorted, no one looked the way they should have. I fell into a state of Catatonia and caught myself out of it 30 minutes or so later. I felt as if I did not belong to any part of the universe, I almost didn't feel human. Walking was immensely hard, the ground gave way like a sponge, as if I was walking on the moon. Every object around me was either moving or breathing violently at me.\r\nLater, I felt a sudden rush of anger and strength, But I managed to contain myself and sit still. I than began to have a conversation with myself in a mirror because everyone else was too afraid to talk to me or come near me, they said I looked like I was ready to kill someone. After that, don't remember a single thing...I woke up the next day at around 2:00 P.M. and found myself in friends lawn, my hands bloody and bruised. The blood though, was not mine. My body ached terribly and I have yet to figure out to this day what happened or to find out what I did. My friends said they kicked me out of the house after I began yelling at the mirror. Anyway, the positive side is that I learned my lesson and I haven't done a single drug since.\n\n\n"
}
