{
 "title": "Where Heaven Meets Hell on Earth",
 "author": "Omar",
 "citation": "   Omar. \"Where Heaven Meets Hell on Earth: experience with Cocaine (ID 42187)\". Erowid.org. Nov 15, 2005. erowid.org/exp/42187",
 "substance": "Cocaine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  ",
   " ",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2005",
   "42187",
   "Male",
   " ",
   "Not Given",
   "Nov 15, 2005",
   "Views: 10598",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had always had a strange infatuation with cocaine before I ever decided to try it. My first time to try it was the night I graduated from high school, and I won't go into the mundane details of the night but I loved it. I did what I later found out to be an eightball, which was an unusual amount for the first time. I felt like an absolute god. Literally like I was above everyone around me. Invincible. Unvulnerable. Theophanic. I remember the friend that I tried it with and I stepped outside to smoke, and when I finished my cigarette I noticed he still had about 3/4 of his left. Since I didn't experience any kind of 'crash' afterwards, I thought very highly of it. I also didn't even really want to do it that badly until a few months later. </p><p>About 7 months later, the weekend before thanksgiving, I decided I wanted to do it again. My friend told me he wanted to try it, so i said 'let's do it this weekend.' We got a couple of grams and did them throughout the night at my house and at various parties. After this time for some reason, I needed it. I started getting a half gram every other day, trying to keep it under control. Occasionally on Fridays, I would get a gram and a half. The twenty's and fifty's that left my pocket seemed irrelevant as they did. I didn't care if I didn't have gas in my car, or if I had food, or if I had bills to pay. After a month or so of doing this, I quit for a month. I was just tired of being dependent on this, even though I had convinced myself that I wasn't. I would tell myself every time I went to get it that 'If I couldn't afford it, then I would just deal with it and go without.' Ironically, I ended up doing just the opposite after this month break from it. I ripped people off, stole, borrowed and lied about what it was for to people that didn't even know I had ever tried it, and were close friends. Right now, I do about a gram a day, and just finished my daily dose about twenty minutes ago. </p><p>Looking back, I know I never should have tried it, having such an addictive personality. </p>"
}
