{
 "title": "Dad's on Phens Again",
 "author": "Sammy54543",
 "citation": "   Sammy54543. \"Dad's on Phens Again: experience with 2C-I (ID 42229)\". Erowid.org. Sep 26, 2008. erowid.org/exp/42229",
 "substance": "2C-I",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 1:00",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   "  T+ 1:00",
   "1 repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42229",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 26, 2008",
   "Views: 2649",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs a stay-home dad,I sometimes forget how amazing it is to be/see a child through nonaggravated eyes,taking in the world all around them with a constant flurry of new experiences and wonder. I got to feel like that again yesterday(if even for only a short span of time)thanks to a combination of ally chemicals I had tucked away.<br>Around 1 pm i dissolved 30mg of 2ci in warm water,and then proceeded to drink the bitter concoction,grimacing,yet still enjoying(in a masochistic manner)its chemical goodness. As i waited i read online some tips for the shrooms i'm growing and waited for the first alert which showed up 45min later.It quickly accelerated to a weak but very enjoyable +3 experience.I felt hints of MDMA and 2CB in the experience and as the plateau continued.<br>I smoked a stuffed bowl of salvia leaf in my gravity bong.3 good tokes later,as I exhaled,i saw an amazing set of clorful patterns spiraling on the wall in front of my bed taking the rest of the room with.The rotation sensation is a common theme with salvia for me,but doesn't resemble the dizziness of most room spins,but rather seems more like a ride on a entheogenic-based spiral motion.My body was pins and needles and I forgot about the 2-ci for 10-15 min. or so.Nothing overly profound except on the visual stage of things.It was all very nice indeed,but I didnt mind when sally had to go.<br>I seemed to be wiggling alot in my seat due to the 2-ci stimulatory effect,so i decided it was mary janes turn to step up to the plate. I rolled the last of my blueberry cough into a pinky wide spliff and lost myself soon thereafter in the combination of those allies of mine who were still mingling nicely in my current(and temporary)state of conciosness. My visuals were beginning to fade to heightened colors only so I sucked down one more series of sally hits and watched as my my visual field began to contract and expand.Another excellent journet that wore off quickly but smooth,still,all the while. This gave me time to think and admire my surrondings when suddenly my children burst in surprisingly on me. I let go and allowed myself to be caught up in their joy,and awe and their love,reminding me of my own youth and the excitement of it ALL back then.<br>On some days(most)I forget what its like and tend to be grumpy.Thanks to the chemical cocktail I was able to be young again seeing through a childs eyes rather than the jaded eyes of an adult. thanks sasha!!!\n\n\n"
}
