{
 "title": "I Wish I Had a Huge Eraser",
 "author": "Look@me!",
 "citation": "   Look@me!. \"I Wish I Had a Huge Eraser: experience with Amphetamines & Methamphetamine (ID 42303)\". Erowid.org. Mar 18, 2010. erowid.org/exp/42303",
 "substance": "Amphetamines & Methamphetamine",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   " ",
   "Amphetamines",
   "(daily)",
   " ",
   "  repeated",
   " ",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42303",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 18, 2010",
   "Views: 6057",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAdderall is a horribly addictive substance that morphed me into a grotesque shell of a person. The long term effects mimic almost every kind of social, mental and personality disorder on the books. Amphetamine psychosis is disturbingly real to me now. After being prescribed to Adderall daily which insued a still lingering methamphetamine addiction I now have zero self confidence, I am very suspicious of everyone. I started stealing and lying and cheating my way out of any scenario possible. I became an actor, not in the positive sense at all. All of my emotions were smeared on with almost a B movie quality of acting.<br>I would start a conversation with someone and start talking about completely irrelevant shit that had nothing to do with the original topic. I would reveal more about myself to people than I wanted but I did it in such a way that only by looking back on it do I slap my head and cringe. I would stay up for days jacking off watching porn repeatedly. I met a girl who had dexedrine and went to her house completely manipulating her emotions just so I could steal the bottle and she called me the next morning first thing to ask if I took it. I would feel like the shit and like every girl I passed wanted me but wouldn't ever act on it...I'd just look at them and gawk because they looked only like a slab of something to fuck and I wanted to treat them just like I treated all those pornstars in my head while bombarding my dick with relentless stimulation to the point of disgusting fatigue.<br>I became more and more obsessed with my own thoughts to the point where I would try to dominate every conversation with my half knowledge of whatever was being discussed. And the worst, absolute most disturbing thing I have ever experienced on any drug was the paranoia...I thought people were constantly talking about me when I was right there...making general statements seemingly directed towards me that I internalized as being directed towards me. I literally cannot distinguish now whether it was actually being said and concieved by the person as an indirect roundabout joke or if I was just stringing it together in my own head in some kind of sick genius wit from my I'd that bubbled its way up to the ego and delivered a punch so hard I was left speechless. I felt like everyone and they're mothers were looking at me and mocking me or looking at me and saying wow hes strung out.<br>I would get increasingly irratable during this stage and would shun conversation staring blankly out seemingly thinking but monitoring every syllable of the conversation either smugly dismissing it as mindless banter or picking out jokes or things I thought people knew about me. Doing uppers especially meth made me feel homosexual at times though I'm pretty sure I'm not. I don't know if anyone else has had this same kind of experience but I know that alot of methheads and speed freaks are gay men who can only have sex with other men while on speed. Like I could switch back and forth from women to men eventualy deciding on one that would suit me for the evening. It was strange...I am very attracted to women and when I'm not on the speed I am not attracted to men at all. So alot of the things I would pick up on were words like 'fag' or 'gay' in any context. The worst incident involving this was at a party at my own house where I went upstairs for a moment and heard my friends saying that I was a faggot and announcing it to the party...I still can't determine whether this happened or not...my friends claim they said nothing at all. But when I came downstairs again I got such a terrible vibe like everyone was whispering about me WHILE I WAS RIGHT IN THE FUCKING ROOM...I know my brain is now not right and its gonna take a long time to get my personality back.\n\n\n"
}
