{
 "title": "Dying and Meeting God",
 "author": "Keta D",
 "citation": "   Keta D. \"Dying and Meeting God: experience with Ketamine (ID 42324)\". Erowid.org. Jun 3, 2005. erowid.org/exp/42324",
 "substance": "Ketamine",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 42324",
   "Male",
   " ",
   "Not Given",
   "Jun 3, 2005",
   "Views: 22505",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was 46 years old when I took enough ketamine to enter the 'k-hole', during a camping trip with some hippies in England. A friend who I know well, a dealer in psychedelics, gave me some ketamine (K). This was my first full on trip into the k-hole, a visionary experience (I had taken smaller amounts before, and was upgrading my dosage, so I was not a novice). I went into my tent, made myself comfortable, and snorted five fat lines (about 250mg) at 8.00pm. I intended to have an experience, of some psychedelic sort, but was not expecting anything triggering an NDE like experience.</p><p>As soon as the horrible taste of the chemical rose in my throat, I lost all awareness of my body, I did not know who I was and where I was, and I was subject to pure visuals. The exact details I cannot remember, only I that was pure being and was in a world of constantly changing patterns and stripes resembling a fractal like deep within the mandelbrot. I had no sense of time, whether of past present or future, so I could say I was in a roller-coaster ride in a multidimensional giant fractal for eternity.</p><p>This went on and on and on and on and on...</p><p>... and on and on and on...</p><p>... and on...</p><p>...</p><p>Eventually, very occasionally, some fleeting thoughts emerged, such as 'I must have died', 'I must have poisoned myself', 'This must be like when I die'. I had no awareness of how I came to be here. Only occasionally though, as I was constantly rolling about in a stripy universe of shapes and sliding walls, and sudden shifts.</p><p>I began to feel a little lonely and frightened, as there was no one else in this universe. Then I said to myself, 'be centred', and kept my awareness 'centred'. I could feel sense of time pulsating slow and fast, but there was still no sense of past or future. I was still unware of my identity or name, or of where I came from.</p><p>Then while observing a pattern resembling a part of a mandelbrot fractal, a whole bunch of association with the word 'K' emerged:</p><p>k k k k k k k k k k kate k k k k k k k k keta k k k k k k k ...</p><p>Then I realised that it was something I took and it was called K, and it reminded me of my sister (who died the previous year from cancer).</p><p>Plus chains of thoughts and feelings, sometimes linked, to do with police, hospital, who was my friends, not hurting other people and so consequently I will not get hurt.</p><p>Then I wondered if there was hell, and the patterned universe became red and foggy, with sheets of flame. 'Eternal?' I thought. 'Help! I don't wan't to get roasted here for eternity!'</p><p>The universe polarised into two parts, the red hell on the lower half, and a white foggy upper half. Except there was a sphere of white light shining through the fog, and He was 'God', with the capital G. He radiated pure awe, a mixture of love, light, and power radiating from Him. I went to God to merge with Him, in order to escape from hell. There was a feeling of oneness, and then a comforting, secure feeling, then an understanding that I done something stupid and shouldn't be here, and so He sent me away. He wasn't going to send me to hell, (apparently it was reserved for killers  and its not eternal), so there was only one way out, back through the fractal again.</p><p>So there was more of the same, visuals, except it was getting more rainbow like, and accompanied cycles and waves of a wide range of emotions ranging from bliss, serenity, happiness, contentment, to loneliness, anxiety and fear. I began to be aware of my head but not the rest of my body, and was paralysed. I felt my mouth fill with spittle, and could not turn my head, so all I could do was gargle!</p><p>Eventually bits and pieces were coming together... I was in a tent but I didn't know where... I recalled my name... a camp... I remember where I was...</p><p>I was able to move a bit, but that's all. I opened my eye, it was now dark. Some time had passed. I wanted to reach out into my bag beside me, but couldn't find it! My hand kept reaching out for the bag, but saw many hands, many bags and they were dancing all over the place. I didnt know which hand should reach out for which bag! Also I felt very dizzy whenever I moved my head. If I just stayed still, and closed my eyes and see patterns, I felt okay.</p><p>Then I felt sick, so I miraculously unzipped my tent door, stuck my head out and chundered. It was raining heavily now and there was a mighty flash of lightning and a loud rumble of thunder. I chundered a few more times in like manner.</p><p>Then I realised that it was at least 2 hours since I snorted the K.</p><p>I decided to go to sleep, and then I had a dream, 'that I took a tab of LSD and went on a full blown trip!' I woke and staggered to the camp fire, some one was up, and we had a cup of tea, and he said it was about 4.00 am!</p><p>My comments...</p><p>My spiritual beliefs closely approximates to reincarnation, karma yoga, and developing inner peace. I commune with the One through visualization, a being who is an orb of light that pulses with patterns of lights, sparks, and rays. She is pure love, healing, patience, and many other virtues. She is also He, as they are of both sexes. She can polymorph into Buddha, Mary, or Jesus for the benefit of the visualizer, thought it appears that the glowing orb is the most basic form of the One. Also the One may appear as Buddha or Jesus from the mental and spiritual view point of the perceiver, as the light coming from the One passes through at least 4 (as far as have discovered) layers of spiritual, religious, cultural, and personal filters and takes on form as the light passes through the perceiver's filters. The purpose of life appears to be merging with the One, so that we become one with the One. The more practice that we do in union with the One in this life, and avoid killing or harming people and animals, and generate love and caring, as well as releasing ourselves from all addictions, there is a greater chance of merging with the One after we die. Otherwise we go round and round through death and rebirth until Union happens.</p><p>I dont usually take psychedelic substances, as I prefer to maintain clarity of mind. My main spiritual practice is visualization, developing inner peace, and praying for peace in the world. If asked who I worship, I would reply a glowing white orb who is peace and love, who is called The One. If asked what is the purpose of life, I would reply union with The One.</p>"
}
