{
 "title": "Reducing the Nausea and Bad Trip...",
 "author": "Alucinigeno",
 "citation": "   Alucinigeno. \"Reducing the Nausea and Bad Trip...: experience with Amanita muscaria (ID 4233)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4233",
 "substance": "Amanita muscaria",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "1 cap",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2000",
   "4233",
   "Male",
   " ",
   "Not Given",
   "Dec 25, 2001",
   "22933",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI live in Brazil, in the very south of the country. Here in my state (Parana), in winter we have some damn cold temperatures, and I discovered that we had Amanita muscarias avalailable by the Kilo. When we first try the experience, we dried about 60 specimens in the oven at 80 degrees Celsius for about half an hour, with the oven half open. Then we made a tea and divided between 6 people: every single one of them got sick (4 vomited). I was one of the 4, but before that I had the beginning of pleasant effects: body felt kind of light, mind was clearly more controllable (without a tornado of thoughts that is usually hard to control) and visual distortion (not heavy). </p><p>Then we tried about 4 other times, all of them with around the same amount of mushroom, sometimes leaving the mushrooms more toasted, other times less but in every single one the nausea was pretty bad. Then I talked with this teacher of the Federal University down here, that told us that we should take the red skin OFF! She is Swiss and is a teacher of anthropology that studies ethnomycology (the study of mushroom interections with cultures). Back in Italy (where she lived), they used to ingest this way, she said, and the nausea was reduced tremendously! I tried and really realized that, eating just 1 Amanita without the red skin, and had a very weird, I would say, but pleasant trip. </p><p>Dramamine half an hour before the ingestion (smoked are almost nul effect) ensured no nausea. And here in Brazil, we realized (a council of about five well prepared and informed trippers!) that the ones in the beginning of the season had better trips, while the ones on the end had less peace and more bad trips (restless anxiety, nausea, etc...).</p>"
}
