{
 "title": "Even My Clothes Feel Good on My Skin",
 "author": "EveryGirl",
 "citation": "   EveryGirl. \"Even My Clothes Feel Good on My Skin: experience with Piperazines - BZP, TFMPP & Citalopram (ID 42337)\". Erowid.org. Nov 7, 2005. erowid.org/exp/42337",
 "substance": "Piperazines - BZP, TFMPP & Citalopram",
 "bodyweight": "84 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   "  T+ 0:00",
   "90 mg",
   "oral",
   "Piperazines - BZP",
   "(capsule)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Piperazines - TFMPP",
   "(capsule)",
   "  T+ 0:25",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42337",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2005",
   "Views: 12259",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was with a friend of a friend one afternoon. I'd been considering trying MDMA for a while but hadn't quite made up my mind. I was feeling relaxed and a little tired from the party I'd been to the night before. I hadn't taken any drugs that night and only drank moderately. I had been sitting in a familar lounge watching tv mostly. In my opinion a familar setting is important when trying any drug for the first time. If I had been in an unfamilar place I wouldn't have given it a try.\r\nHe suggested I try some BZP. I knew BZP was promoted as a legal alternative to MDMA (BZP is not a restricted substance in new zealand). I agreed to give it a go. I swallow the gel cap with a small amount of water. This contained both the BZP and TFMPP. \r\nI wondered to myself what I was doing for a moment, but realised I couldn't chicken out now. I know feeling anxious and trying a new substance don't mix. I try to clear my mind and assume the mindset of merely an obeserver as I usually do when I try something new for the first time.\r\nPrecription medications: Citalapram (40mg per day).\r\n+0h:05m I feel somewhat more awake similar to drinking a cup of coffee. Nothing yet. \r\n+0h:15m I feel something slightly like nausea. Not quite though. Things seem to be a little spinny. I try to stand up for a bit and feel quite unsteady on my feet. I think I might fall over. I sit back down on the bean bag and think I'd better just stay there for a bit.\r\n+0h:25m After giving up trying to check my email on my PDA because it's too difficult to write using the stylus. I still feel rather uncordinated. But I'm not easily discouraged. I stand up and try to walk around. To my surprise I now feel as light as anything. I'm floating, walking is easy. I no longer feel as if I'm going to fall over. I head outside for a cigarette. I notice a sense of contentedness, just a subtle feeling. I'm quite intregued by the experience at this point. I sit on the step and close my eyes to try and pick up anything else I might be missing. The wind blows past a bit. It feels lovely on my skin. \r\n+0h:35m My sense of touch is definately enhanced. I touch my finger tips with my fingernails and then try running my fingers along the concrete. I take a drag on my cigarette and a new feeling grabs my attention. It's like a rush of warmth though my body. It's hard to describe. It's a feeling that could be relaxing or stimulating depending on the setting, at least to me. I feel drawn to trees for some reason. It's almost as if they're highlighted in my perception. \r\n+0h:50m I sit back down on the bean bag in the lounge and run my fingers along it. The texture of the beans though the cover is amazing. I'm quite a sensual person by nature, finding I love the feel of a cirtain texture is not unusual for me; but this is really exagerated and has a slightly different quality to my normal experience. I seem to lose any sense of locality associated with touch perception and anything I like the feel of spreads through my whole awareness. \r\nMy mate who gave me the capsual asks how I'm doing. I describe what I've experienced so far. He notices I'm running my fingers along everything. He asks me what different things feel like, his denim jacket, the sofa, cusions, the carpet and so on. He tells me it seems as if this is just as good as ecstacy for me, but without the risks. Then he starts suggesting things that are fun when you're on MDMA. He gives me a hand massage. What an amazing feeling! I close my eyes and totally give in to it. Right at this point in time this is the most amazingly sensual thing I've felt. I feel overwhelmed. I fall backwards on to the bean bag I have a few tears running down my face. He asks me if I'm OK. I give him a thumbs up and relax for a bit. Talk about unusual reactions. Maybe there's some kind of interaction between citalapram and BZP? They say you aren't meant to take BZP if you're on antidepressants. Maybe it has an amplifying effect? This is possible. My mate's friend took the same dose as me at the same time and didn't seem to be affected at all.\r\n+2h:00m I'm playing a board game. Things have quieted down somewhat. I feel quite comfortable where I am now. I'm getting used to it. Even my clothing feels good on my skin. I wonder to myself what MDMA would actually be like on me if BZP does this to me?\r\n+3h:30m I'm content to lie around and chill out really listening to the stereo. \r\n+4h:00m My other friends return. I'm more affectionate than usual and somewhat cuddly and just want to be physically close to people, which unfortunately leads to some of the guys there getting the wrong idea.\r\nI have difficulty sleeping and feel run down and a bit sick the next morning. This would probably be 14-17 hours after I took the dose. I still notice the highlighting of trees and subtly increase tactle sensations for a few days. I'm generally in a good mood and I don't seem to suffer from the normal wednesday blues I get. \r\nAdditional notes on combining BZP with citalpram: I think that either BZP or TFMPP interacts with citalapram in some way. I speculate this explains both the unusual similarity of how BZP affects me to what my friends have experienced with MDMA, the way such a low dose is enough for me (he said the normal dose was 180mg) and also explains the afterglow like effects lasting 3 days or more. I have subsequently taken BZP many times with 180mg and noticed that if I take it odd days in a row I tend to experience jaw clenching and the like if I don't reduce to 90mg on the second night. \r\nOn one rather misguided experiment with 360mg I had a rather different experience. The effects described earlier were present, though with lesser impact as I was now used to this but I found myself in a state of overwhelming empathy for others. I was wanting to run up to random strangers and hug them. This is not supposed to happen. I also experienced jaw clenching and had to sit down and sip water often and go outside for I fresh air on more than one occasion as I felt overheated like I was going to burn up. I experienced subtle symptoms of serotonin syndrome the following few days however. Some residual jaw clenching, my feet wouldn't behave themselves, I couldn't sleep and I just felt generally strange. An amazing experience though. \r\nTo confirm my hypothesis I tried discontinuing my citalapram for a week (citalapram has a half life of 34 hours) before trying with 90mg. My experience with this was more like a small dose of methamphetamine, though with a slight enhancement of my sense of touch. \r\nIndividual differences are the norm, just because I got away with this and had this result doesn't mean others will.\n\n\n"
}
