{
 "title": "Detection Cut-Off Too Low",
 "author": "Job Hunter",
 "citation": "   Job Hunter. \"Detection Cut-Off Too Low: experience with None (THC detected) (ID 42346)\". Erowid.org. Mar 28, 2006. erowid.org/exp/42346",
 "substance": "None (THC detected)",
 "bodyweight": "200 lb",
 "header": [],
 "footer": [
  [
   "2005",
   "ID: 42346",
   "Male",
   " ",
   "Not Given",
   "Mar 28, 2006",
   "Views: 18463",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI was on the market for a new job recently...and I found 2 that I REALLY liked. I also had a third job to fall back on in case those didn't follow through. Anyway, I was asked to do a drug screen for all 3 jobs...ironically on the same day and at the same lab. I went to the first test and gave a sample with no problem. Second, again no problem...they just gave me odd looks. Third time I got questioned by an MRO to confirm that my tests were all for different companies and I wasn't just fucking with them. (BTW, it ended up being the bitchy fat nurse that complained to him). I wait two days...and get a call back from all the jobs.</p><p>Job 1: You've failed your drug test.</p><p>Job 2: You've passed your drug test</p><p>Job 3: You've failed your drug test.</p><p>Huh? Failed!!!! I don't do drugs! Plus I passed one of the tests...why?</p><p>I investigated...the two failures had been confirmed by GC/MS as positive for THC...now to remind you all, the limit is 15ng/ml mine was at 15.2 and 15.6.</p><p>Here is my story as to why I may have failed even when I don't do drugs. My home is a split level apartment with conjoined heat and air ducts. So anything they smoke goes into my house. I smell pot being smoked everyday...for the past 3 years of living here. I contacted the MRO for the lab and spoke with him about this and he said that no study has been conducted for 'low-level, chronic exposure' and that since the government actually had raised the levels for the immunoassay from 20ng/ml to 100ng/ml then down to 50ng/ml because of greater study into THC absorbtion, I may have a case to change those levels in the federal mandate...I'm not really a crusader but I've been thinking about it.</p><p>Basically my experience report is a warning. Drug tests are unfair and suspect. I don't do drugs but I have been unfairly branded due to a flawed system. I lost 2 out of three job prospects because of them.</p>"
}
