{
 "title": "Shot Through Time",
 "author": "Marc",
 "citation": "   Marc. \"Shot Through Time: experience with Salvia divinorum (20x extract) (ID 42344)\". Erowid.org. Jul 26, 2008. erowid.org/exp/42344",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 42344",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 26, 2008",
   "Views: 4598",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Okay, to start things off, I consider myself pretty veteran when it comes to psychoactives, stimulants, and depressants. I only started doing drugs about 16 months ago, but have done around the same amount, if not more then most of my friends who have 2 or 3 years experience. I'm a -big- fan of mushroom, and cannabis. I have tried ephedrine, morning glory, a couple inhalants, nutmeg, alcohol, caffeine, ginger, salvia  (x10, and just the herb), datura, DXM, coke, and codeine. Not all that many popular chem drugs, but I'm more a fan of the naturals. But anyway, that night I was planning to do mushrooms, and had nothing to do for the day. So, I had an extra 20$ and went to the local pot and hippie store in town, and got myself a 1 gram vile of 20x salvia, the vile with the salvia in it weighs 1 gram, not just the salvia. I quickly walked home, which left me a bit sweaty when I got there as it was a pretty warm day, I grabbed my big bong (your normal big ones, like a foot and a bit long) and emptied half the vile into the bowl as the guy at the store said to do.</p><p>So I burned it all up quick, and gulped it down in one breath. I then began to hold it in, maybe 15 seconds went by, and then it all began. Slowly I was running out of breath, and as I sat there on my couch holding it in, it began to feel almost like two people were sitting next to me, or like two bodies, or 2 presences where there. And as I started to blow it out, the presences started to feel like they were holding my arms, or like my arms where being pushed on the front of them, and then !BOOM! - as the last bit of smoke left my lungs, I got launched from a canon, and I guess I must have blacked out. Now, before I took it, I put on a movie (half baked) and it was going on in the background the whole time. I do remember hearing it (sort of) it wasn't understandable, just sounded like inaudible talking, and it was in the farrrr far back of my mind. </p><p>What the rest of my mind was filled with, and what I did exactly I don't know. All I know, is that when I came to, I think I was still sitting on the couch, because I kind of remember standing up quickly, quite scared, and confused, and weird feeling. I had no idea what happened to me, and I wasn't quite sure where I was. I had totally forgot I took the salvia, and just knew I felt bad, and needed help. I walked around my couch and into the kitchen, and for a moment I thought I was looking for someone/following someone, but as I looked into the kitchen, and no one was there, I remembered I was at home by myself and that I had just done salvia. I think the talking voices from the tv confused me, cause when I came to I do remember thinking there was like 2 or 3 people with me. I went back into the living room, and began to breath very deeply, and everything started to come back to me.</p><p>I felt extremely weird. My whole body was tingling, my chest had that uneasy/uncomfortable feeling in it, similar to what I've felt during the come up for a bad mushroom trip, the entire front side of my body felt like it had pressure against it, a pretty hard pressure, which made it hard to breath, like something or someone was on me/ pushing on me. I remember not liking it at all, and just wanting it to go away. I was also sweating hella lots, and I opened the sliding door and poked my head outside to feel the breeze. My reality perspective was legit enough, I wasn't hallucinating (blurry vision though), just everything looked as if I hadn't seen it before, just like as if it was my first time being in that apartment. Just visually though, I knew I had been there before, and recognized everything individually, just seeing it was altogether weird. Like being away for a long time and seeing it all again, but I can't compare it to anything I've felt before.</p><p>I sat back down on the couch, still a bit confused of what happened, not thinking the trip would be anything like that, then I consciously heard the tv, and looked at it, I couldn't understand what they were saying, but I do remember the movie being about 20-25 minutes farther along then when I was holding in the smoke. But I didn't much think on it at the time, I only cared about the uneasy feeling, and why my body felt like it had pressure on it, and the tingling. Really all 4 effects together is what made the trip so horrible. I guess my physical sensory was slowly normally returning, because I could then feel the roughness/texture of the couch, and damn that was uncomfortable, like sitting on a small prickle bush, that doesn't actually stab into you, just irritates and scratches/annoys your skin. So I tried to just laydown sideways on the couch, which seemed to help the tinniest bit.</p><p>I then decided to say something 'That was weird.' was what came it, and even talking felt weird, like it wasn't a normal thing to do, like I hadn't done it for a very long time. So I decided to get up, and I went and laid in my bed. I'm not positive how long I was in bed for before I fell asleep, maybe 20-40 minutes, as the trip subsided. The tingling left first off, the pressure and uneasyness easing until they too dissipated, and I wasn't sweating anymore, just sweaty. After the ill effects left though, I had a nice heavy head feeling, almost like mj, and fell asleep eventually.</p><p>I seriously have no memory of what happened between blowing out the smoke and suddenly standing up in confusion. It was almost like being launched from a cannon, or into another world, where I had no consciousness, and then suddenly being thrust back into the real world. I like to compare it to being launched through time as the time from standing up, and going to bed only lasted maybe 2 minutes at the most, and the time from taking it standing up seemed maybe like either 100 years, or like 4 seconds, but 20 mins had gone by on the movie. It kinda made me think about being physically pushed through 20 minutes of time, compressed in 4 seconds. Now imagine what that would feel like on your body and your mind. A friend of mine who did a big hit like this once, said he was standing there, and people looked/felt like they were moving by him and mach 5, when really they were just walking by him normally. </p><p>Anyway, after I awoke, I ended up finishing the vile two more times later during the day, each time being half as much as I took first. They were mild, short lasting, and didn't really surpass what a good joint could do. I do plan on trying it again, but I think I'll have a sitter next time, and maybe not take it all in one fat bong hit.</p>"
}
