{
 "title": "Seduced by the Vixen of Emptiness",
 "author": "J.R. Leach",
 "citation": "   J.R. Leach. \"Seduced by the Vixen of Emptiness: experience with Risperidone (ID 42396)\". Erowid.org. Aug 17, 2007. erowid.org/exp/42396",
 "substance": "Risperidone",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "Pharms - Risperidone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42396",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 17, 2007",
   "Views: 14298",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI would like to start you off with some background information on myself. About 3 years ago I was diagnosed as having an obsessive compulsive narcissistic personality disorder. My mind is plagued with ego-based delusional philosophy/perceptions of reality and extremely violent sexual fantasies (my mind is never calm). I also suffer from a slight surgical mutilation addiction, among other things. The doctors have tried many different psych drugs to attempt to fix me. For the most part these drugs only made me more inhuman and abusive. And then we came to Risperidone.<br>My first reaction was 'Well, it's just another psych medication, I wonder how many people I'll hurt this time'. I started at .5-mg nightly for a week as I was being weaned off Paxil CR. The dose was increased to 1-mg nightly. After 1.5 weeks of being on Risperidone I felt safer around others and my vicious thoughts had subsided greatly, I also had stop lying impulsively. Then something wondrous happened.<br>At just over 2 weeks something in me clicked off and I no longer felt bothered by my ego, sex, violence, or even reality, most all my thoughts had stopped. It's as if they just vanished, my will to dominate and control was gone. I became increasingly interested in just admiring the blankness of reality, nothing mattered and I felt truly set apart from the world but at the same time I felt in oneness with everything. I have included a clipping from my journal around the time this was taking place:<br>'I stand at the edge of this northern expanse, gazing into the west coast swell. If I fell in, I don't think I'd struggle against its liquid embrace. It's not that I wish to die, it's just; everything seems so wonder filled. I can't help but be overcome by awe. In the event of my 'untimely' drowning, I'd be too enthralled in sensation and imagery to care that I might not wake from slumber.<br>Am I depressed? I'm not sure. I don't think so. But I don't think I'm happy most the time ether. It's like sleeping but wide awake.  My mind wanders constantly, but in a hush. I can't stay with one subject for even minuets. I could sit for days, by myself, in front of nothingness, and never lose interest. I have been seduced by the vixen of emptiness and my printing has gone to hell. Complex events, or events that involve action on my part or the parts of others, bore me. To the point that I feel ill with discontentment. I just want to sit with the people I enjoy and look at them. Maybe chat of childhood or of never-lands not yet imagined. I want to bask in this new light I feel, this radiance. It seems to come from unadulterated existence.<br>'Never slaughter the emitted light with human questions' says the distant voice. Who am I? I AM. What am I doing? I AM EXISTING. Where do I come from? I HAVE NO PAST. Where will I go? I HAVE NO FUTURE. I have found 'love' for nothing and in that, everything.<br>In ups and downs. Strokes of left to right. I swoop and lift. My pen is light gray with some black near the writing tip.  I can see a white page, filling with excited black scribbles. They seem to have trouble staying in-place on their little lines. I don't understand their malformation, why don't they all look the same?<br>I see space now. It's more interesting than the other objects. Its pure and virgin. Bliss exists in that place between objects, the space between memories and thoughts. I could cry at any moment. Why? I don't know why.  I think I'm sleeping. How could this be real. This feeling, this understanding. My hand is cramped, do I even have hands anymore? I bet I'm someone's day dream. That's why I'm not aloud to control my own mind. I know now, I must 'be' and except 'being'. I must not struggle against the under toe. I must embrace mindless oblivion if I wish to live, live and be happy. I will never be what I think is happy, I will never be without thought, not naturally anyway. I wish simply, to be swept up in this ballet.'<br>It has been two months since I started taking the Risperidone and I am sad to report that the earlier effects have totally left me. They wore off at about 1.25 months. I have returned to a state of being on edge constantly with a mind filled with things that I am not happy with. I'm thinking about moving myself to 2-mg nightly. It's hard for anyone living without psychosis to understand why I want those earlier feelings, or lack of, to return.  I would give anything to trust myself around other people again. Obviously this drug has very little recreational appeal as other stories on this site prove, however it is the only thing that has worked well for me, and if you suffer from similar problems I recommend you discuss Risperidone with a qualified doctor, as it really is a useful substance.\n\n\n"
}
