{
 "title": "Datura overdose in Africa",
 "author": "tonbo",
 "citation": "   tonbo. \"Datura overdose in Africa: experience with Datura stramonium (ID 42410)\". Erowid.org. May 4, 2005. erowid.org/exp/42410",
 "substance": "Datura stramonium",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 cup",
   "oral",
   "Brugmansia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "1975",
   "42410",
   "Male",
   " ",
   "Not Given",
   "May 4, 2005",
   "22500",
   " "
  ]
 ],
 "report": "<p>I was 18 years old and living in Senegal, Africa. Some native friends, knowing of my occasional marijuana and LSD use at the time, urged me to try an amazing plant that grew in the cemetery. However, some people warned me that the plant, which they called Kubijara, was extremely dangerous. I pretty much dismissed these warnings, figuring that they had never done acid. This was a mistake.</p><p>One night an acquaintance dropped by my apartment (my parents apartment), which was on the 18th floor. He had a pod and leaves from the plant. I figured we should just make a tea out of both, so we did. I drank about a cup, mixed with instant coffee. This was probably about 8 p.m. He left, not having drunk any.</p><p>I cant remember the period of time after I ingested the drug, but the next thing I remember is answering the door and seeing two very grotesque monsters come into the apartment. In reality, it was my sister and her boyfriend. I had no idea I was hallucinating, unlike acid, where I'm aware of reality. I was completely unaware of reality for the next 24 hours. I was awake all night, seeing armies of insects on the kitchen floor, playing poker with people who were not there and having long conversations with dwarves under my bedclothes. This was not in the least funny. It was the scariest thing that has ever happened to me. I only recall bits and pieces of the night, but the parts that I recall are terrifying. I remember looking in the bathroom mirror and seeing that my pupils filled my entire iris, with no color left over at all. I had a conversation with the person in the mirror, not realizing it was me.</p><p>I could not urinate, even though I desperately had to. My mouth was dryer than Death Valley. I remember awaking my mother at dawn by standing at her bedside and asking if we were going to the Montreal Olympics that year. The rest of the day was a nightmare. I was continually drawn to the balcony, and when I looked over at the streets I kept seeing horrible car crashes. I could clearly see the cars crashing and hear the noise they made, plus the screams of the injured. Then planes started to crash. I saw people flying outside the balcony.</p><p>Friends came and went during the day and they were all extremely alarmed at my behavior. Someone watched me carefully all day. It was only towards the next evening that I began to realise that I had done a drug and that nothing I had seen had been real.</p><p>I believe I was a hairs breadth away from seizures and possibly death. I do not recommend any experiments with this drug whatsoever.</p>"
}
