{
 "title": "5-HTP Used in Recovery from 2C-D",
 "author": "Barium",
 "citation": "   Barium. \"5-HTP Used in Recovery from 2C-D: experience with 5-HTP & 2C-D (ID 4241)\". Erowid.org. Apr 8, 2001. erowid.org/exp/4241",
 "substance": "5-HTP & 2C-D",
 "bodyweight": "67 kg",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Tryptophan - 5-HTP"
  ]
 ],
 "footer": [
  [
   "2000",
   "4241",
   "Male",
   " ",
   "Not Given",
   "Apr 8, 2001",
   "Views: 30012",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nDecided to do some 5-HTP recovery a few months ago, four days after taking 65 mg 2C-D. Big mistake.</p><p>Surprise #1: Wake up 2 hours after taking 5-HTP, to find that I have beautiful closed-eye visuals. Apparently, 2C-D takes a long time to get out of my system. Something I'd already gotten hints of on my first session with 50 mg. Enjoy visuals for a minute, go back to sleep. Everything OK.</p><p>At 2pm next day, when I'm awake for four hours: suddenly find out that things are `weird'. Words don't make sense. The things that they represent are `normal', it's just the words that are weird.  `Yellow' is a perfectly normal color, but a strange word. Communication with others is normal; maybe a bit more sparkling. Behaviour is normal. Odd feelings go away after about 2 hours, only to resurface about 6-7 hours later, for the same period. Overall, feels very much like Shulgin described it in Pihkal's part 1, `fugue state'.</p><p>Sad insight: when doing some cleaning up, I notice that I behave like a very complicated automaton; I'm just reacting to external stimuli.  Rationalization of my actions lags behind half a second. Free will is a joke.</p><p>Next day, same regime, only a bit more intense. Am glad that so much of my behavior is automated. Have small anxiety attacks centered about the thought `what happens if I have to do something which isn't automated', `what should I do if people notice?' and `would I recognize it in time if I do something incredibly stupid, or which could get myself injured?' Feels like insanity.  Insanity is strange.</p><p>Funny thing is, memory works OK. I did remember my PIN correctly for a bank account that I hadn't used in five years to withdraw money from it. Remembering shopping lists (short term memory) wasn't a problem either.</p><p>After a few days, things slowly bounced back to the normal, thank goodness. Five days later, I was `the old me' again. I regard this experience with mixed feelings: in some aspects, it was absolutely terrifying. OTOH, I have more respect for people who have to live in this condition forever. </p><p>Another note: On the second day of this experience, I could  suppress the `oddness' and accompanying anxiety by taking two vodka's;  on the third day, the comforting effect of alcohol was substantially less.  </p><p>So this is one for the pharmalogical guru's out there: It seems to me that 2C-D does something on the re-uptake side, for a loooong time. Any suggestions?</p>"
}
