{
 "title": "Time Warp",
 "author": "Pandora",
 "citation": "   Pandora. \"Time Warp: experience with Mushrooms (ID 42436)\". Erowid.org. Aug 10, 2007. erowid.org/exp/42436",
 "substance": "Mushrooms",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2004",
   "42436",
   "Female",
   " ",
   "Not Given",
   "Aug 10, 2007",
   "3811",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After smoking a big fat joint, my friend and I decided to come back to my place to take the shrooms I had left over from my birthday.  This would be the very first time I had ever experienced these kinds of hallucinations.  About an hour after ingesting the shrooms, we were very disappointed, because nothing -or very little- seemed to be happening.  When I got up to show her to the door, I felt myself shrink down to the ground and eventually collapsed because of the amount of pressure I felt pulling me to the ground.  This was no time for me to be alone.  </p><p>As I started to giggle, I noticed her beginning to feel it to.  We walked around the apartment and ended up in my room, where many posters hung on my walls.  I told my friend that the eyes of the people seemed to be looking right through me, and that I had no choice but to tear them down.  Anxiously and in a panicked state, I began ripping the pictures down.  I knocked down all the teddy bears that were facing me and tore down all the family photos.</p><p>When we walked out of the room to calm down, things got strange.  The wallpaper started moving, and the corners where the walls met seemed to be stretching infinitely, and pulling me- I was falling into them!  These odd feeling continued for hours, until finally it was time for my friend to go home.  When I walked her to the elevator I had no idea which way to go...the hallway was like a maze to me- like unknown territory.</p><p>I was petrified by the time my dad came home.  I knew for sure that he would be able to tell that something was up.  Fortunately, he was too tired to notice anything was wrong.  After he went to bed, I was alone with my demented thoughts.  Everything began to look like eyes...the little wholes in my jeans, the tiny ones in my speakers, the triangular designs on my carpet - everything.  I felt as though I no longer existed because of all of these spying things looking straight through me.  Nothing made sense.  I had no way of telling what was real from what my delusional mind was creating.</p><p>I spent the next few hours rocking back and forth, trying to get the voices that were yelling at me to shut up.  Finally, at about 5 am I passed out.  I woke up feeling completely out of it and told my dad that I needed to go to the hospital.  I was kept in a in-patient unit for two weeks due to psychosis.</p>"
}
