{
 "title": "Brain Movies of a Grotesque Elderly Couple",
 "author": "Morninggloryseed",
 "citation": "Citation:   Morninggloryseed. \"Brain Movies of a Grotesque Elderly Couple: experience with Syrian Rue & DPT (ID 4245)\". Erowid.org. Jun 6, 2001. erowid.org/exp/4245",
 "substance": "Syrian Rue & DPT",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 Tbsp",
   "oral",
   "Syrian Rue",
   "(seeds)",
   "  T+ 1:00",
   "240 mg",
   "oral",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 4245",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 6, 2001",
   "Views: 11959",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n8/30/2000 \r\nFirst use of a MAOI to potentate a tryptamine.  First use of DPT.  Not looking for anything in particular, but I am still hoping some answers come.  Not looking forward to drinking this brown strange smelling brew.  I read it is worse than my old friend morning glory.  I'm very interesting to experience the beta-carbolines in my body, as my medicinal use of adderrall prevents this.\r\n10:28 PM\r\nDrank the rue.  Amazing, it truly tasted like vomit.  No exaggeration.  Glad I only had to drink a small amount.  Strangely, in retrospect it was easier to drink this rue brew than morning glory/woodrose seed juice, yet those seeds do not have much taste.\r\n10:42 PM\r\nI do believe I have a MAOI alert.  I have a warm and very pleasurable sensation enveloping me.  We will see what this develops into.\r\n10:49 PM\r\nSlight headache noted.  I did eat small amounts of cheese today and a small amount of caffeine.  I am hopeful this won't get worse.\r\n11:29 PM\r\nDown 240 mg of DPT into my consciousness.  Much more than is recommended for use with a MAOI, but someone has to take it to the extreme.  I am very cold.  Seems due to the rue.  I find the rue to be mildly sedating.  Mildly Psychedelic at the dose I took, but it could very well be the pot I consumed earlier.  \r\n11:41 PM\r\nAbsolutely +1.  Not sure if it is the rue, or the DPT.  I think it is the DPT.  Regardless, I feel great.\r\n11:49 PM\r\nBecoming slightly visual, but a lot more mental.  Very interesting effect.  \r\n11:58 PM\r\nNot much more development, but I'm sure it's not leveling out.  Perhaps just a strange delay.  I recall reading that DPT takes longer to develop than DMT when orally consumed.  \r\n12:04 AM\r\nMusic from the TV changed pitch back and fourth.  Delay time was too large to result in psychedelic-induced flanging.  Maybe I need to turn off the TV?\r\nEpilogue...\r\nThat was as far as the journal went.  I lost track of time for a while.  It stayed at its original level of intensity until 1:30, when I vomited.  That shot me up quickly and I started peaking.  Now don't get me wrongthe peak was intense but it was not as intense as I figured 240 mg of DPT would be.  The visuals were unlike any other psychedelic I've tried, but very mellow.  They did have a startling realistic quality to them.  I did actually see some things develop into snakes and jaguars, ala ayahuasca.  However, since I know it is capable of producing that effect, I might have seen them via the power of suggestion.  At times, I looked at the world as if it was a painting, and strangely enough there was even a picture frame surrounding it all!\r\nMentally, everything was negative.  All of my thoughts led to death and destruction, and I had constant CEVs of people I know with blood streaming from their mouth.  I did have some interesting experiences I can only call 'brain movies', which were these intense dream-like fantasy sequences that I experienced.  One involved me visiting the lives of these grotesque dirty filthy gnome-like elderly couple.  We never interacted with each other, but I experienced all aspects of their lives, and all of its filthiness.  I spent some time in their home watching them.  There were other brain movies, but I really could not describe what actually happened.  This trip did not have any spiritual aspect to it, but that may be due to my set at the time.  It was an interesting experience but I will use pure harmine hcl next time.  I don't like the taste of vomit both going up and down.  I am also very curious as to what a neat oral DPT trip is like.\n\n\n"
}