{
 "title": "Living Nightmare",
 "author": "Guy Incognito",
 "citation": "   Guy Incognito. \"Living Nightmare: experience with Cannabis (ID 4246)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4246",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 4246",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 24, 2001",
   "Views: 31783",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had the following traumatic/enlightening experience about 2 months ago.  It's really long, but I think it is very interesting.\r\nI was at a 'party' out in a field, and had a couple beers, nothing enough to even feel.  A friend held up a baggy of weed and a makeshift aluminum foil pipe and grinned.  We lit it up and started smoking.  I noticed no effects until it was almost all gone.  Then i just got real spaced out, stoned feeling, and things started moving like they were under a strobe light.  My friend said he'd had enough and staggered off (he was already pretty drunk), and I finished what was left.  After I finished it all, I kept getting more and more stoned.  All my coordination was gone.  Pretty soon I started seeing a red-violet colored random patterning appear evertime I blinked.  It would last about 1 second and then disappear.  I got into my car to drive back to my house to get something, planning to return.  I had no idea what was in store for me.\r\nAs I drove I kept getting more and more disoriented.  I kept realizing that I was fidgeting an unbelievable amount. Then I started rapidly blinking involuntarily.  By the time I got home, it was like my whole body was in hypertension and I was just blinking, writhing, and fidgeting up a storm.  I sat down and tried to calm myself down, and I just started to panic more and more.  I kept catching myself moving my legs and hands(which were really shaking) involuntarily. My blinking had slowed down by now, but every time I blinked, i'd see a bright blue flash. By this time, I could hardly keep a thought in my head for more than a few seconds.  I felt like I was just insane and couldn't think at all.  Then I got all panicked, thinking I might never return to normal. My thoughts kept getting more and more messed up.  My attention span was so short, I could think about something, and it would instantly trail off into a stream of random thoughts. I doubt I was even capable of saying the whole alphabet.  \r\nBy now I was completely terrified, and my mind was just a swirling jumble of random thoughts.  This was about 1/2 hour after I had smoked the weed.  My imagination was so vivid, I could see everything I was thinking when I closed my eyes.  The things I was seeing with my eyes closed seemed more vivid than what I'd see when I opened my eyes and saw the real world.  When my eyes were closed, I just saw bright yellow and swirling colors, and occasionally very bizarre things, such as an abominable snowman with globules of cheez-whiz over for eyes which had rapidly revolving black olives for pupils.  I felt like I was in a nightmare with no escape.  I was utterly TERRIFIED that I would never return to normal.  Then crazy thoughts kept jumping into my head, like how I should just kill myself now and not have to deal with insanity/retardation for the rest of my life. \r\nEventually I started to feel like I was coming back to normal, but then it would keep coming back in HUGE waves that just completely incapacitated me, even worse than before.  By now, all the fidgeting, etc, was gone.  Every time I'd start to feel better, a huge wave would just hit me like a load of bricks.  Every time it happened, I'd feel and hear my heart start to slow way down.  This was really freaking me out, because although it was probably just a hallucination of some sort, it seemed VERY real to me.  After it happened the first time, I got up and staggered into the next room thinking I should get my mom to take me to the hospital, but I came right back.  As I walked, I could hardly feel my feet touching the floor.  I could just hear my footsteps.  My heartbeat got all fucked up again briefly when I walked, and I felt like I was blacking out. I could hear music from the TV in the background, and I kept thinking, 'Maybe my perception of time is messed up so it seems like my heart's beating slower than it really is', but when I'd listen to the music it was at normal speed.  I thought I would die unless I got to a hospital.  But every time, it started to slow down, it would go back to normal so I figured i'd be ok.  \r\nIt kept getting worse and worse.  Every time it would hit me, my vision and all sense of the world would fade away.  I kept praying, because at the time I was sure the weed had been laced with something very powerful and I was fearing for my life. About the 3rd time this happened, I actually felt my heart stop beating.  I hope to god this was just a hallucination!  Everything was cold and black, UTTER black.  I felt like I was in a huge void, and drifting away. I was sure I was dead! I also felt so peaceful, like this is what I really wanted.  Then I thought about all I would be missing out on if I let myself die at the age of 19.  All this happened in about 2 seconds.  I heard an erratic heart beat start again, and then start beating normally, and I was disappointed at first, but after several seconds my vision/consciousness returned.  My eyes had been open the whole time, and as I came out of it, I could see my sight coming back like someone turning up a dimmer switch for the lights in a dark room.  I started to get back to normal again.  \r\nThen ANOTHER wave hit me.  A feeling of spiraling down into sheer terror.  I felt my heart slow down again... this time after pumping weakly for about 2 seconds it returned to normal again, and so did everything else.  This happened one or two more times. This seemed SO REAL I still have a hard time believing it was probably a hallucination/dreamlike thing. I don't remember falling asleep or passing out, I just woke up about an hour later.\r\nI got up feeling sort of weird, really tired and spaced out feeling.  This was about 2 1/2 hours after I had smoked the weed.  I decided to go back to the party, to let them know I was all right, because I had told them I would be coming back.  Then as I was driving, all of a sudden I just started tripping again.  I suddenly became completely disoriented.  I kept thinking I was passing the same spot in the road over and over.  I had no idea where I was.  Then boom, I snapped out of it.  After I got back I was standing around telling some other people about what had happened to me, and all of a sudden I heard rain falling all around me.  I was like 'shit, it's raining!', and everyone just looked at me and said 'That's just someone taking a piss!' (we were in a field).  I swore for all the world I heard rain all around me!  When I drove back about 45 minutes later, I freaked out twice more, I just became totally disoriented, everything looked so confusing, it looked like I was seeing the same thing repeating over and over.  As I drove over the top of a hill, I kept thinking I was about to go off a cliff!  Then I'd just snap out of it as quickly as I'd go into it.  This even happened when I was driving at 4 PM the next day, 18 hours later.  Hasn't happened again since.  \r\nI still don't know if that weed was laced with anything, or if it was just extremely powerful. The other kid that smoked it was bigger than me and didn't smoke as much, and he was violently ill, puking/dry heaving non-stop for a whole hour. \r\nIf I am watching TV and it shows someone dying or something, and they have the sound of a heartbeat slowing down in the background, I get completely terrified.  I was so traumatized by this 'Trip', that I can't even see/hear anything like that without turning into a scared cowering fool.  It's like when a vietnam vet hears a helicopter or something! \r\n don't even drink or do any drugs anymore.  That one experience was just TOO intense for me to handle.  I go to sleep every night thinking about it.  It was the worst and best experience of my life, because after thinking I was insane for over an hour, I have learned the IMMENSE value of having a good brain that works.\n\n\n"
}
