{
 "title": "A Remarkable Psychedelic",
 "author": "Snookn42",
 "citation": "   Snookn42. \"A Remarkable Psychedelic: experience with 2C-E (ID 42477)\". Erowid.org. Mar 4, 2008. erowid.org/exp/42477",
 "substance": "2C-E",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "12.5 mg",
   "oral",
   "2C-E",
   "  T+ 3:00",
   "1 repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 42477",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Mar 4, 2008",
   "Views: 3298",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started the day out at about 12:30, I was in a pretty good mood before the trip and I had nothing to do the whole day. I took 12.5 mgs of 2C-E at about 4:30pm. I had originally planned to stay at my house and lsiten to how this substance reacts to music. ( this is my favorite part of the Psychedelic experience)</p><p>Im fairly well versed in pschedelics. Ive done many of the psychedelic phenethylamines, as well as the tryptamines. My favite thus far was LSD, with 5-meo being second. (alpha-O was waaay to stimulating for me.) im 20.</p><p>It wasn't until probably 5:30, when I started feeling the effects. It first started as an uneasy feeling. I also found it a little nauseating. I never did vomit however, and these feelings soon faded after about 30 minutes. In the middle of a Mark Farina CD, my friend called us and said he was in town. So I told him my current status, and he offered to pick me up. </p><p>At about 6:00 I arrived at my friends house, where there were a few other people i knew skateboarding and just messing around. By this time I was tripping fairly hard, there were patterns super-imposed over every thing. my friends face had geometric patterns plastered on his face moving around. Another thing to note was the lack of anxiety or strange/unwanted thoughts. I was not the least bit worried about anything. Every thing was just beautiful and funny. </p><p>At about 7:00  it had felt like I had been at my friends house for ages, but it's only been an hour. Nobody there does any psychedelic drugs, so they were facinated by how I acted and what I was seeing. They also thought It was fun to try and confuse me, which was very easy at this point. Again I am just amased at how little stress there is. I'd also like to add that the CEVs surpassed many of the drugs Ive ever tried, and that at a higher dose they would have been better than Acid.</p><p>I probably started to peak right at about 7:30. Me and my friend were smoking bowls, and catching up for a while then got boared and started shooting random things out of a huge sling being shot at a house that wasnt finished being built.</p><p>at 9:30 I am already coming down a little and decide to go home becasue he is throwng a big keg party to make money. When I get there my girlfriend calls me and she comes and hangs out with me. Its now abut 10:30, and I am still tripping a little but the visuals are not as pronounced. </p><p>I got to sleep by 2:30.</p><p>All in All I thought that 2C-E is a remarkable Psychedelic. I cant wait to try it out at probably 16mgs, I want to see just how much music sounds better. Hanging with people who werent tripping stopped me from listening to some psychedelic music, but I will have another chance to do this wonderful chemical again. I would always start out at the low end of the dose spectrum, 12.5mg was much more intense than I thought, even though I didnt get too much of the anxiety/Schitzo part of the trip, I could see that at a higher dose things could get quite crazy!</p><p>Peace and safety, R</p>"
}
