{
 "title": "Not the Drug for Me",
 "author": "Stellar",
 "citation": "   Stellar. \"Not the Drug for Me: experience with MDMA (Ecstasy) & Cocaine (ID 42500)\". Erowid.org. Aug 25, 2008. erowid.org/exp/42500",
 "substance": "MDMA (Ecstasy) & Cocaine",
 "bodyweight": "192 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "8 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 42500",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Aug 25, 2008",
   "Views: 11915",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, it started as a regular night hanging with some friends.  My one friend had some extra cash, and she suggested buying some ecstasy.  The 2 males I was with decided to purchase some cocaine.  Once we had received the goods, we went to the one guys apartment.  Me and my friend each popped our pills, and by midnight we were starting to feel good...a little too good.  We were feeling so good, that we were willing to do anything and everything to feel even better than we did at that moment.</p><p>That's when the other 2 suggested that me and her try a line of coke to enhance the high.  Now I don't know if this is with everybody who combines E and coke, but I found that within 5 minutes of doing my first line I was coming down off the e, and the cocaine was taking over.  And maybe it was the combination of the two drugs, but I didn't think the coke was doing much at all.  It felt like I had the comedown of the E, mixed with an odd feeling of the coke.  It wasn't a bad feeling, but it wasn't the best feeling, either.</p><p>So I thought to myself that maybe I just needed a few more lines to feel the high my friends were feeling.  So they prepared me more, and over the course of the night I had approximately 8 lines of cocaine.  About an hour after the 8th line the most terrible feeling washed over me.  My heart was beating uncontrollably, I was sweating everywhere and I couldn't keep still.  I kept fidgeting in my chair.  Then the paranoia set in because I knew this feeling wasn't normal, and I had it in my head that I was overdosing.  I'm sure some food would have aided me at that point, but the mere idea of eating anything was making me ill.  I didn't even experience any of the happy moments or euphoria that everyone else talks about.  It was pretty much snorting, then straight to the shitty feeling.  There was no middleman.</p><p>I got home at around 4am, and I had to work at 11.  Those seven hours before work were Hell.  I couldn't sleep.  I couldn't eat.  I couldn't even focus my eyes without them rolling backwards.  But, it was my own damn fault, so i went to work refusing to leave them hanging over my own stupidity.  This is where I took a turn for the worse.  I couldn't stand in one spot for more than about a minute.  I couldn't concentrate on anything the customers were saying to me, and I made several errors on the cash register.  I even had to go to the back and just rest my head because I was literally going to black out.  I just passed it off to my boss that I was coming down with the flu, so she let me rest periodically in the back.</p><p>But, judging from my own experience on this drug, I will never, ever touch the shit again.  I don't think it was possible for a human to feel worse than I did following that night.  Maybe it was the combination of the two, but I don't care.  And I'm actually grateful that I had a bad experience on it, because now I know that I've tried it, but won't ever again.</p>"
}
