{
 "title": "Coat Hangers",
 "author": "Lilsteve",
 "citation": "   Lilsteve. \"Coat Hangers: experience with Salvia divinorum (20x extract) (ID 42503)\". Erowid.org. Aug 18, 2007. erowid.org/exp/42503",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "109 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42503",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 18, 2007",
   "Views: 3289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy roommate and I purchased a gram of 20x salvia extract off the internet. He had smoked a 10x extract before, and had a negative experience, but was eager to try it again. He was a highly seasoned tripper/roller with over three years of experience and I was an amateur tripper at the time. I was in a poor mental state when the package arrived, and I decided I wasn't fit to be tripping as hard as we had heard we would, so I abstained from it until I was feeling better. \r\nMy roommate, A, along with my suitemate, E, decided to give it a whirl. They borrowed a friend's bong and each sat for the other, E going first. He tripped way hard, and began laughing uncontrollably until he was majorly drooling. He then went to the bathroom and tried to urinate (it got all over the place) and 'woke up' in the middle of my room walking around. A few minutes later, after E could compose himself, he sat for A, who took a good two hits and collapsed before taking the third one. He stayed stationary in his seat, and didn't really do much other than looking around and laughing. Soon after the experience, he couldn't remember what he hallucinated, but he eventually remembered that he saw an orange t-shirt hanging out of an open drawer, and when the salvinorin hit him, he became the t-shirt. After he returned to us, they both felt exhausted and went to sleep. This was around 2 or 3 in the afternoon.\r\nA few days later, I made the spontaneous decision to try it at about 12:00am. I was feeling better psychologically and expected to have a really cool crazy (but not necessarily scary) trip. We setup two chairs in the closet, one for me and one for A to sit while tending me. He held the bong for me while I lit the bowl. We had a dube tube (a plastic bottle stuffed with drier sheets, used to filter smoke out and leaving a fresh scent when smoking in the room, tee hee) and I managed to exhale one hit through it. The second hit was way huge, but I blacked out just long enough to exhale. \r\nWhen I awoke, I had no clue who I was or where I was. But that was not important. What was important was that the universe around me, space and time, was being cut into molecularly-thin strips and hung on white wire clothes hangers for sale at some sort of market. I could feel some sort of dimensional blade enter the base of my spine and slide all the way down, and when I tried to move, it prevented me. When I turned my eyes to look at my arms, I saw the slices in space separating it into many layers.\r\nMy vision was distorted: shadows had a sort of purple aetherial quality to them. When tripping on shrooms once in the past, I had described this phenomenon as Einstein's theoretical aether. I looked across at A, who was looking at me and grinning hugely. When I finally could muster the energy to speak, all I could whisper was 'What's happening to me??','What's happening?' to which he replied 'Sallllviaaa.' As I came down (the experience lasted from 3 to 5 minutes) I began to slowly recall who and where I was. I kept asking 'What's happening to me?' Until A finally answered 'Dude, you smoked a bowl of 20x salvia.' Holy shit. I had absolutely forgotten. As I regained my senses, I did all I could do to get confortable by stripping down and going to sleep. As I laid down, I noticed some slight open-eye visuals, like those that come with shrooms or 2C-I.\r\nI woke up after 8 hours very well rested. I realized that I knew salvia wouldn't be an easy, fun high, a lesson a group of my friends learned the hard way when they all thought they were going to kill each other. When I made the decision to partake, I had a high respect for salvia as a hallucinogen. I mean, A said it was not something to play around with, and he's the local war-hardened veteran. I respected salvia, and it still beat the crap out of me. And for that, I recognise it as a teacher.\r\nIn retrospect, the feeling I felt was like the realization that I was being grown for sale, such as cattle. I relate this to the scene in The Matrix where we see the huge walls of pink pods containing the hard-wired humans generating enectrical energy energy for the robotic world. I also think that the course of the trip came from me seeing some wire coat hangers before releasing that second rip. I mean, I was sitting in a closet.\r\nFor me, Salvinorin-A isn't psychadelic in the sense that tryptamines and phenethylamines are. When I trip off shrooms, DMT, or SC's, I see things, my thoughts are very abstract, I get heavy body sensations, but as far as hallucinations, I may see things that aren't there, but never have I experienced anything as heavy or full-blown as salvia 20x. A group of 5 friends of mine treated it like a recreational trip, and they had the shit scared out of them. They're still afraid to this day to even see the stuff. If you decide to smoke a salvia extract, you need to approach it with the mindset that it's not just a cool fun ride. It's some heavy shit. Not to say that it's not enjoyable. I mean, you can't eat only sweet foods ;)\r\nThis experience with salvia did NOT act in the same way as other psychadelics. This is also why I say it is not the same kind of drug as, for example, shrooms or DMT. The nomenclature I use differentiates between 'psychadelic' drugs (shrooms, lsd, dmt, 2c-i) and 'hallucinogenic' drugs (salvia, so far, also perhaps ether or n2o). That doesn't mean that psychadelics aren't hallucinogenic, but that I don't find hallucinogens necessarily psychadelic. But that's just my name for the game.\r\nConcerning my mental health:\r\nAs I wrote in another experience, I am potentially bipolar. I'm very sure, but I haven't been diagnosed by a professional as of yet. People who are mentally unstable/unwell should normally not do psychadelic drugs. For me, it's the opposite. They seem to help me keep a grip on reality where my sober mine plays tricks on me.\n\n\n"
}
