{
 "title": "Who Needs a Tv?",
 "author": "Stunna",
 "citation": "   Stunna. \"Who Needs a Tv?: experience with Eszopiclone (Lunesta) (ID 42519)\". Erowid.org. Apr 21, 2006. erowid.org/exp/42519",
 "substance": "Eszopiclone (Lunesta)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4.0 mg",
   "oral",
   "Pharms - Eszopiclone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42519",
   "Male",
   " ",
   "Not Given",
   "Apr 21, 2006",
   "23991",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nAfter getting these from a docter for sleeping problems as well as sonata and ambien. I took 2 lunesta which had 2mg each (4mg). I was outside my house Hookin my MAF intake kit  I was just getting done when I thought for sure my g/f walked up behind me and I started to say hey looked back and it was nothing I also felt a very bad taste in my throat and mouth that was strong at first but then weakend a bit. </p><p>I started to walk inside and my driveway seem to move a bit and I knew that the effects of the sleeping pill were kickin in 'thats pretty fast' I thought as it was only 30mins after i took it. As I walked inside I got a drink and as soon as it hit my tastebuds it turned sour and very bad tasting. 'Forget that' so I walked downstairs to my room and begin to play my PS2 a while and the effects got stronger and I was very sleepy but didnt wanna fall asleep just yet. I got up and went to my computer looked at a few websites and noticed that every word on the screen would begin to move and was hard to read colors became a lil brighter. 'cool I thought' I stoped trying to read anything and started listening to some music which sounded very nice at the time. </p><p>When I would look at my wall it would move and my fishtank started almost swingin from side to side. 'Damn' well its only the effects of the pills I told my self, and began to relax a little. A fews mins later I go lay in my bed and stare at the wall across my room where a little light hit from outside and stared to really see some weird shit as I was lookin at the wall part of it almost like a TV square and in this square were 2 people talking and moving and it was almost like i was watching tv but there was nothing there but the wall, very strange it was.  After watchin this for around 10mins and I went to sleep, I'd say this is great to try if you like that kind of stuff. just be prepared for a strange taste you might like it but I didnt and i've heard of a few that did.</p>"
}
