{
 "title": "Lessened Dream Recall",
 "author": "Dann",
 "citation": " Dann. \"Lessened Dream Recall: experience with Calea zacatechichi   (ID 42520)\". Erowid.org. Mar 12, 2007. erowid.org/exp/42520",
 "substance": "Calea zacatechichi  ",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Calea zacatechichi",
   "(tea)",
   "",
   " repeated",
   "smoked",
   "Calea zacatechichi",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42520",
   "Male",
   "",
   "Not Given",
   "Mar 12, 2007",
   "6919",
   " "
  ]
 ],
 "report": "<p>I ordered Calea because I saw it on the same website that was selling Salvia, and I've always wanted to find a way to increase the clarity of my dreams.  I've had some success in the past with having clear dreams when taking Melatonin.  So when I ordered Calea, I was very excited and had high expectations.</p><p>The first night I got the Calea, I took 3 pills and had tea with about 2 grams in it.  When I read the reports online about the nasty, bitter taste of Calea, I thought to myself 'It can't be that bad...I'm sure it'll be nasty, but I'll be able to handle it'. I was underestimating the stuff.  This is the worst tasting thing I have ever tasted..it really was unbearable..it's so bad, words don't really do it justice.  </p><p>I also took 2 500 mg capsules filled with the finely crushed up herb.  I felt no effects while awake.  I went to sleep about 2 hours after taking the pills. During the night, I must have gotten up like 8-12 times. As soon as I awoke each time, I attempted to remember my dream but found it was impossible.  When I woke up the next morning I felt a little hazy, but I couldn't remember one of my dreams (I usually remember about 1 a night, or one every other night).  </p><p>The next night, I smoked 3 bowls and took 3 500 mg capsules.  I thought that increasing the dose would help. I went to sleep, didn't have any trouble sleeping this time. I woke up, couldn't remember even one dream. But oddly, everything I looked at had a strange kind of clarity.  When I looked in the mirror, I got kind of freaked out because my face looked unusually clear in terms of the details and outline with the surrounding environment. </p><p>The next night, I decided to try Calea one more time, and took calea resin, rolled up into a pea sized ball and swallowed.  I was  assuming that this resin is much more potent than ordinary calea.  I took it about an hour and a half before sleep.  The effect I got while awake was that my heartbeat slowed down to what seemed to be a considerable degree. It wasn't relaxing though..kind of nerve racking feeling like your heart isn't beating regularly.</p><p>I woke up the next day, and once again, couldn't remember any dreams.  </p><p>Overall, for me, Calea did not increase the recall of my dreams, it actually worsened it.  I'm assuming that it works for some people, but realize that it might not work for everyone.  My friend took a similar dose of Calea, and got the same results I did.</p>"
}
