{
 "title": "Absolute Craziness",
 "author": "Mdma_Gaaren",
 "citation": "   Mdma_Gaaren. \"Absolute Craziness: experience with PCP & Cannabis (ID 42566)\". Erowid.org. Aug 25, 2008. erowid.org/exp/42566",
 "substance": "PCP & Cannabis",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "PCP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "42566",
   "Male",
   " ",
   "Not Given",
   "Aug 25, 2008",
   "17857",
   " "
  ]
 ],
 "report": "<p>Well the whole night started off with us about to crash some random person's party. When we arrived at the door, there was about 7-9 of us and then the random person let about 5-7 of us in, but not letting myself and another friend of mine in because we weren't on the list. 'Fair enough.' I thought, I'd probably do the same.</p><p>Well me and my friend were pretty much left to die by our other 'friends' and we started to walk off, then one of my mates came running back from the house and crashed into us saying 'If you guys aren't going in the fuck it! I'll come with you.' So we walked back to this friends house and started to make plans as to what to do for the night.</p><p>Well I had a bag of unnaturally brown buds covered in crystals, later found out to be PCP, in my sock and suggested that we have a session because my mates parents didn't care. But sure enough before we find a billy, my mates phone rings and it's another mate asking us to meet up at this school oval for a session. So the 3 of us walk there and meet up with two other people. Well alot of stuff happened between that time and first bong but lets just move on. We decided that I should have greens and it was a triple hitter cone piece so me being the 'hero' decided to take the offer. Little did I know what I was in for.</p><p>Well I had the billy, sunk it and surprisingly didn't cough for the amount of nugget just roached. Although at the time it felt like I had swallowed more smoke than had going into my lungs. I proceeded to exhale and walked off the bench we were sitting on to a tap we used to get the bong water. Well although I didn't cough my mouth and throat had a strange slimy sensation and when I had the water, it made me feel better. Then all of a sudden as soon as I sit back down on the bench BANG! Like a wave crashing an intense trip just kicked in.</p><p>I was sitting down and started thinking that we were in a pac-man game but at the same time I knew it was just the park and I was sitting on a bench. But I couldn't feel my head so I thought that I was pac-man. Then the slimyness feeling in my mouth came back and I just thought, man not cotton-mouth. So I decided to lick my lips to produce some saliva. But this is when the intense visuals started setting in. I would put my tongue out of my mouth and it would feel to be doing 360's and 540 loops and then untangling on the way back in. I kept doing it and then I realised that my eyes had rolled in the back of my head.</p><p>In my head was an image kind of like what you'd see if you drew an image on paint. There was a big blue square where if you close your eyes you normally see black, well that was all light blue. And on the light blue was an iguana type lizard. A Two dimensional picture of a lizard blinking at me and when my tongue went to lick my lips, the lizards tongue would shoot out and do a 360/540 and then when I put my tongue back in it would untangle. This absolutely freaked me out so I opened my eyes and came back to reality but then my eyes rolled into the back of my head again and this time something even more intense happened.</p><p>I felt my pupils on top of my brain and it felt like they were running a maze on it. Then in my head as if on a documentary, A picture of a brain formed with two little dots running through a maze going nowhere. But the thing that really made no sense was that the maze walls were made from uncooked grains of rice. This also tripped me the fuck out. It was about at this point I realised that this wasn't just snow cones because I've handled so many drugs before, but off of this one bong, I was unnaturally fucked.</p><p>Well things got even more intense when it started raining and I would have to sit in the rain with my eyes closed kind of meditating or I'd start to feel sick. But then my friends finally convinced me to walk. Well it was raining hard and all I remember about the walking is that there were 4 people in front of me and I had somehow turned into the guy from GTA III and they were the pedestrians and I could see all my health bar and gun ammo status on the top right of my field of view (exactly like GTA III). Well it was then that I thought that I was carrying a shot gun and kept arguing with a voice in my head saying 'Shoot them' and I would say 'Man you're tripping balls, you don't even have a gun!' That was probably the most enjoyable part of the PCP experience.</p><p>Well I don't remember much else from that night, but I remember I gave one of my friends a hit from a bong with my shit and he started throwing up! Oh and I got driven home and thought I was in Need For Speed coz I was listening to some gangsta music and kept focusing on the road and thought we were in a race. But my eyes kept rolling in the back of my head so I can't remember much more.</p><p>But the next day I went to the dealer I got it off and asked what the hell was in this weed and he said that it was PCP. My advise is that because I had PCP buds as my real first hard drug (apart from snow cones) to not do them unless you're ready to feel fucked up. But I might do it again someday now that I've had alot more substances in my body, just to remind me of the feeling!</p>"
}
