{
 "title": "Not The Next Dope Sick Junkie",
 "author": "Baddshit",
 "citation": "   Baddshit. \"Not The Next Dope Sick Junkie: experience with Heroin (ID 42577)\". Erowid.org. Aug 20, 2007. erowid.org/exp/42577",
 "substance": "Heroin",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "IV",
   "Heroin",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2001",
   "42577",
   "Male",
   " ",
   "Not Given",
   "Aug 20, 2007",
   "57153",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first and only expirence with heroin was absolutely awesome.  I have always been a fan of the opiates, as I have tryed an array of perscription pills such as percocet, vicoden, lortab, norco, and others.  I loved the feelings of peace and serenity it bestowed upon my very soul.  It wasn't so much that they made me happy, more just a laid back, peaceful, I jus don't give a fuck kinda deal.  It was great.</p><p>I was always interested in Heroin, and always wanted to try it.  I was living in Salt Lake City at the time and Heroin was easy to score.  Well not so much easy but it was possible.  Where there's a will theres a way and when there's a drug to score there's a always a will right?  Well anyway it was kinda crazy, I was working and living with my parents, and barely 17 so I had a pocket of money and new drugs that I was extremely curious to try so I set off to score some heroin.  </p><p>I set off to score some, which was an absolute disaster.  I had no idea where to get some, so basically I asked any random person that even somewhat resembled a stoner where I could get some.  Most everyone either thought I was joking, or looked extremely discusted.  Well after a while I was about to give up and retire to my home to smoke some midgrades, when someone suggested that I talk to some homeless people.  </p><p>Damn within 30 minutes I was lead to the homeless shelter by some drunken crazy ass.  The sight was discusting, dope-sick junkies leaned up against a wall huddeled in blankets pissing on themselves.  I was warned to get out or I would be the next dope sick fucker leaning up against the wall.  I told him to fuck off, and found some fairly good shit from a black dude within 10 minutes.  It was all too much, I sensed so much human suffering it was nausiating, but not nearly as nausiating as that first good hit of dope.</p><p>After a day of hanging out with a junkie, I scored a good sized 50 bag, and a good clean point.  I was set.  I didn't know how to slam very well, and since I was sketched out about slamming with some junkie that I jus barely met, I was on my own.  I looked up shit on the net and I was set.  Cotton swab, clean needle, spoon and lighter, tyes, rubbing alcohol and good 50 of Heroin.  I rolled up my sleeve and hit a good vein.  Damn I still remember that good hit, my first really good hit.  I was loaded, fucking loaded.  I loved it.</p><p>Its like a wave of relaxation coming over my soul, slowly spreading from head to toe.  Well actually at first it kinda scared me when it first entered my brain.  I got really lightheaded like a very extreme intense head rush.  I felt like I might die, but in a good way.  It was a very dreamy trip.  I felt like I was a god, I felt absolutely eternal.  I fell into the nod.  Fantastic.  Marvelous.</p><p>I would have short dreams of hanging out with friends, watching a colorful sunset, being at the beach in Oregon with my friends.  It slowly wore off until I finally became overtaken by the gentle waves of sleep.  </p><p>I awoke the next day feeling refreshed.  No feelings of craving, but I soon realized the potential of addiction.  I knew that herion grabs you by the throat, and doesn't let go.  I sure as hell didn't want to be one of those dope-sick junkies, so I never touched it again since, and I most likely never will again in my lifetime.  I've quit all drugs and I realize that life isn't about pure bliss and intense pleasure, and even if life is about pleasure, heroin sure is NOT the place to find it.  I refuse to let myself become the next dope sick homeless junkie, savvy?</p>"
}
