{
 "title": "All Night Binge",
 "author": "Corey",
 "citation": "   Corey. \"All Night Binge: experience with Cocaine (ID 42588)\". Erowid.org. Aug 31, 2007. erowid.org/exp/42588",
 "substance": "Cocaine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 42588",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 31, 2007",
   "Views: 40283",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 2.5 grams of cocaine is considered an extremely high dose] </p><p>I was all excited about doing cocaine because I had only done a couple lines before and so I bought over an eight ball - in all, about 7 grams. Three days before the experience that I will go into here I did about 2.5 grams with my friend (1.25 grams each), had an amazing time for the first couple hours. Immediately after I went home and we stopped snorting the lines, I became extremely depressed. Now, you'd think this would be enough to stop me as I'd never been that depressed before in my life. Three days later my other friend came home from college and she wanted to do cocaine. Since I had a little less than five grams left and had nothing to do with it, I decided that we should finish it off within the next two days. I don't know why I wanted to do it again after the previous night - maybe it was that I just remembered the euphoria. So here's how that night went. It was the last time I ever did cocaine.</p><p>My parents were upstairs sleeping. My friend and I assembled in the basement around 1:00 and took the first bag onto the table. We had four small zip loc bags of a gram each and one last bag that had almost a gram. We poured this one out first on my very red, shiny, and smooth table. We sat on the couch; I had my labtop down there so we could talk to people online when we were feeling social.</p><p>We took small lines and just enjoyed the euphoria of it. It was so much fun to talk and be social. We felt jittery but it wasn't as if we needed to run around and do things. We were content with just talking very fast. The lines started out moderate size I'm sure. We became very serious with each other; telling each other more about ourselves than we'd ever told to anyone before. We analyzed each other extensively. We'd snort a line and then leave a little left over. This was so that we could smush our fingers against the leftovers and lick them, causing our mouths to be delightfully numb. Until about 6:00 we talked and did lines; the time went by very quickly. Around 6:00 we stopped because we felt we had done a great deal of coke. Throughout this time we kept feeling our pulses and counting to see if our hearts were beating too fast. For a while it didn't seem that they were beating dangerously so we kept going with the coke. We didn't want to stop.</p><p>At 6:00 we talked for about an hour while lying back on opposite sides of the couch. We knew my father would have to come through the downstairs to go to work and we kept listening for him to come down the stairs. When he finally did, we were ready and pretended to be asleep. My friend said later that it was difficult for her to keep her eyes closed for those couple seconds when my father walked through the room. We weren't too nervous about him finding out; I knew he wouldn't want to wake us up for any reason.</p><p>At around 7:00 we wanted to do more. We did another gram in the next hour or so, our conversation becoming even more serious and even more personal. I told my friend I didn't think either of us had ever been so serious in our entire lives. I felt jittery and still social but my mouth was very dry and I felt like I kept making a clicking noise everytime I talked (like my dry tongue slapping against the inside of my mouth I think). Anyway, I also had the nummies which made me rub the top of my mouth a lot and also made me lick my lips. I had been trying to keep track of how much we had done. I kept all the full bags in the coat pocket and the empty ones in my pajama pants pocket.</p><p>Around 7:30-8:00 we heard my mother rummaging around upstairs. We were very nervous she might come down for some reason or another, yet we wanted to do more. Our desire to do more overpowered the paranoia, which honestly wasn't that bad (but should have been). I mean, she could have come down to use the fax machine or to get something for her work as she used the downstairs computer for her job. Anyway, so we got really quiet and took out the next bag and put it on the table. We wanted to do it quick so that afterward we could just lay back and talk quietly.</p><p>We did grow quite paranoid when I poured the bag onto the table - the entire thing and we heard my mother directly above our heads in the kitchen. I kept trying to listen for the stairs and we stopped many times and put the covers over the table. My friend was more paranoid than I was and she had reason to be. It was intense. I think my mother even came down the stairs at one point to use the garage. We were pretty stupid that night, but it was a crazy experience.</p><p>Anyway, so my friend had become very quiet while I was still in a talkative mood. We wanted to do this gram quickly and we had done so much already that our lines had become bigger and bigger. We did the entire gram in about fifteen minutes. We snorted two huge lines each to finish the gram (4 lines for the whole gram). They were giant lines and exhilirating. We spent most of the fifteen minutes trying to gather the cocaine into perfectly defined lines without any stray powder on the table. We constantly used our fingers to lick up the white smears on the table. At this point snorting the lines had begun to sting the inside of our noses and behind our eyes. It hurt and caused us to stop mid-snort a couple times. Those huge lines were very difficult, but we did them and then laid back on the couch and talked. I was feeling my pulse constantly; had my hand there the whole time.</p><p>My mother continued to walk around upstairs but we were calmer because we weren't in the act. Anyway, we were still talking (mostly me now). We planned to do the last bag around 9:00. However, when it was time to do it we couldn't find the bag. Had we already done almost five grams in less than 8 hours? It seemed as though we had. For the next two hours we kind of just talked quietly to each other or to people online. Finally around 11:00 we went upstairs and I told my mother we were going to the mall. When we looked in the mirror our pupils were extremely dilated. My mother didn't notice; thank God. I told my friend to drive as I was too crazed and fucked up to do it.\r[Erowid Note: Driving while intoxicated is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>We went to the mall. First I wanted to return something I had bought a week before. During the car ride there, the comedown began. It had at most been an hour since we stopped snorting, and already it had begun. While we were in the return line I began to get hot flashes and felt massively depressed. It was one of the worst experiences of my life. Then we got in the car and my friend drove to an empty parking lot where we talked about the comedown. Apparently my friend has started it awhile before me. It was why she had gotten so quiet before - that was back when we were still doing the cocaine!</p><p>For about 45 minutes we sat in the car and I felt horrible. I felt more depressed than I'd ever felt. I then dropped her off as we had used my car and drove home. I got in bed and begged to go to sleep. Millions of thoughts were swarming my head, I kept feeling my pulse, and I felt so depressed - like I could never be happy again. Furthermore, my heart was beating very erratically, like it was doing flips. I thought mildly I might have a heart attack but good thing I didn't flip out about it because that might have made my heart beat faster. Instead I lay in bed for hours feeling absolutely depressed and it took me two months before that depression completely left me. It's been about four months since the experience and I'm still not the same.</p><p>Sometimes I think if I had the opportunity I would do coke again, just because the euphoria part was so much fun. But the euphoria part pales in comparison to the depression. The comedown lasted from 11:30am that day to 12:00am that night (12.5 hours). It was worse than you can imagine. Neither my friend nor I have done cocaine since, and I really hope I never do it again.</p>"
}
