{
 "title": "Disconnected",
 "author": "Paul Mireles",
 "citation": "   Paul Mireles. \"Disconnected: experience with Salvia divinorum (10x extract) (ID 42597)\". Erowid.org. Aug 24, 2007. erowid.org/exp/42597",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42597",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 24, 2007",
   "Views: 2507",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have become very interested in shamanism and healing magic in the past few years.  I had been researching different websites on the internet and found that a lot of shamans and healers used certain psychedelic substances to find themselves and to help others.  I began to read about salvia divinorum and its powerful properties.  I became very interested in it and wanted to try it very badly.  I feel that I am a very strong person mentally, I live alone and I like to be alone a lot of the time.  I like to read, listen to music and meditate.  So one day I walked down to the local headshop and purchased a small pipe some screens and a small 50mg bag of salvia divinorum 10x.</p><p>The headshop is a few miles from my house and the walk is through a wonderful stretch that goes through a park.  The walk is great with all the trees and nature around.  After leaving the headshop I wanted to try the salvia so bad that I couldn't wait to get home so I had to try it when I got to the park.  I didn't know it yet but I didn't experience the power of salvia at the park.  I was so respectful of its power from what I had read that I just smoked a very small amount.  I took just one big hit from the pipe knowing that I had to remember how tho walk home.  I remember that the trees looked great and I felt very powerful like I had control of everything but no really strong effects that I had expected.  I dismissed salvia as fluke and thought that it was a waste of my money.</p><p>Two days later I decided to do it again at my home.  It was about 10 o'clock in the morning and I packed a much larger bowl this time.  I wanted to really see what salvia was all about and boy did I ever find out.  I put the flame to the salvia and took a large hit and held it in for as long as possible blew it out and did it again and immediatly knew that I needed no more.</p><p>I felt as though my spirit had disconnected from my body and everything felt very delayed.  I was barefoot and when I walked back to my easy chair each step I took was felt after it was taken.  The soundtrack didn't fit the motion picture.  Everything was delayed.  I sat down in the chair, The tv was on and I was watching something.  I felt very strange unlike anything I had ever felt before and I do believe that the setting has a lot to do with the slightly unpleasurable experience.  The tv was absolutely non existent to me, I knew it was there but I wasn't really paying alot of attention to it.  I felt as though I understood life and that it was all a big joke and nothing really mattered because it was all folly.  I felt as though I was slipping off the edge of a mountain but would never fall just keep on slipping and slipping off.</p><p>The whole time I just sat there in the chair not making a sound or even moving, just staring and slipping further and further down the mountain wondering when I would fall off.  The anticipation of when it would all end and I would finally come back to normal was overwhelming.  I felt as though I was being shown the truth and that the truth was grim.  I was being shown that life isn't what it really seems and that there is alot of things unseen that we don't understand.  I entered a different state of existence and it felt very strange and different, maybe this is why it was slightly uncomfortable. </p><p>I finally returned to my normal state of existence and took a deep breath.  What a tremendously rewarding experience.  Wow, I have never journeyed like this ever before.  I feel like I have gained enourmous amounts of wisdom from this experience.  Salvia is unlike any other thing I have ever tried.  It allowed me to peer into a rip in the universe and see whats on the other side.  I highly respect its power to explain and teach.  The next time I peer through this rip I will be more prepared for the journey not as afraid and more open.</p><p>I see why shamans use these type of plants.  They teach and give insight.  They show the truth.  I thank salvia for the powerful experience.  It is definitely not a party drug or something that to take to feel good, it is something to take if you want to learn something about yourself and how small and insignificant everything really is.</p>"
}
