{
 "title": "Fell Far Short",
 "author": "Scotto",
 "citation": "   scotto. \"Fell Far Short: experience with DOM (ID 4262)\". Erowid.org. Dec 14, 2000. erowid.org/exp/4262",
 "substance": "DOM",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "DOM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2000",
   "4262",
   "Male",
   " ",
   "Not Given",
   "Dec 14, 2000",
   "19266",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOur study of the DOM entry in PIHKAL led us to believe this had the potential to be a rather strong experience, and that's what we were ready for, my companion and I, as we climbed out of bed on a Sunday morning and put capsules in our mouths around 9:20 a.m.  We had heard of one maniac who had administered about 7.5mg via an intramuscular injection and had described the experience as very intense and very difficult; one of the PIHKAL entries, something about how the experience opens up a window to some kind of darkness, was also provocative.</p><p>Sadly, my personal experience fell far short of anything I'd care to repeat.  I vomited twice in the first two hours, and then spent the next 8-10 hours essentially bored, with only minimal visual distortion.  Listening to music was fun & interesting, but I wrestled with the question: am I having fun listening to this music because it's already fun & interesting, or is the drug somehow stimulating my enjoyment? I concluded the latter, ultimately. I wasn't particularly disappointed, however... I am reaching a place in my life where the novelty of one new drug after another is wearing off, and I did manage to spend most of the day pondering my relationship to drugs, and pondering issues related to work.  But I felt that the drug itself was not engaging on a psychological level; my exploration of these issues was not the insightful flash of content that I might get from something like acid, but was rather my mind occupying itself while my companion had her experience.</p><p>My companion took 9mg and seemed to have a significantly stronger experience than I did.  She reported being very unable to make conversation & very wrapped up in a wash of physical sensations for several hours, after the initial two hour period of coming on in which she too vomited at least twice.  She expressed that she felt a great amount of synaesthesia, and lots & lots of visuals, including hallucinations.  Physically, she had a severe case of spasms or jitters which lasted almost the entire experience, an uncontrollable shimmering in the body that she claimed was not uncomfortable, but was simply her body's way of handling the sensations.  Toward the mid point of the experience, perhaps eight hours in, she brought up the fact that the drug was bringing up childhood memories for her, memories that only seemed to come up in her mind when she was on psychedelics, & we discussed to what level the memories might be actual, versus a reconstruction, or a blurring of multiple events; these were memories stretching back to when she was four years old, and we agreed to try to think about it later, when we were sober.</p><p>As we got late into the night, it became apparent that neither of us would be able to sleep, and her jittering was still proceeding apace.  At this point, perhaps 8 or 9 in the evening, she was still going relatively strong, whereas I felt I had come down altogether, but was not particularly tired, either.  We watched a couple of movies, & she was down enough to enjoy them without being distracted by the drug experience.  By midnight or so, we began employing various substances to try to get to sleep.  I wound up using benadryl, GHB, and valium in various amounts to make myself drowsy.  Unfortunately, my companion, who used GHB, valium, and numerous muscle massages from me, could not stop the jittering, which continued essentially all throughout the night, preventing her from sleep & bringing her to tears with frustration.  These physical side effects may be specific to her; she has had similar jitters on other substances, such as acid and 2CB.  Nevertheless, it's worth a word of caution, since so little has been reported about DOM it seems.</p><p>I was left with little desire to repeat the experience.  My companion did not particularly report anything from her experience that seemed engaging enough for me to put my body through that many hours of tripping.  Obviously I didn't get a threshold dose for me, but even if I did, I would be wary that DOM would wind up in a similar category for me as something like 2CT7 an interesting and unusual aesthetic experience, without anything psychologically or emotionally useful that would convince me I needed to repeat the experience.  Part of this analysis, though, needs to be contextualized: I have done an enormous amount of tripping this year, and am in fact planning a year off to give my brain a break.  It may well be that DOM had little effect because, overall, I am exhausted with psychedelia, and just need a rest.</p>"
}
