{
 "title": "The Twilight Dreaming",
 "author": "The Storm",
 "citation": "   The Storm. \"The Twilight Dreaming: experience with Mugwort (ID 42628)\". Erowid.org. Apr 19, 2006. erowid.org/exp/42628",
 "substance": "Mugwort",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Mugwort",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 42628",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 19, 2006",
   "Views: 15712",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThere is a reason that Mugwort is called the dreaming herb. </p><p>Having been curious about the effects of Mugwort for some time, I decided to give it a go and see what happened. Knowing that it was a legal high (well in Australia anyway) I didn't really expect much from it in the way of a buzz. And that's what makes Mugwort interesting - the fact that it doesn't really give me much of a high. Well, at least not while I am awake. </p><p>I'm not saying that Mugwort is anything spectacular, but there are definately an increase in vivid, even bizarre techicolour dreams after using it.</p><p>Smoking it seems to provide the strongest effect, in my experience. Rolling it up with tobacco and smoking it, is somewhat simular to smoking a clove or herbal ciggie - smooth, without the bite of tobacco. Not altogether unpleasant to smoke. There is a mild buzz, simular to smoking a very small amount of cannabis. This tends to quickly pass. Alcohol can mildly increase the effects, as can tobacco. I'm not sure what the effect of smoking it with pot would be.</p><p>Its also very effective to leave some mugwort under my pillow, I get virtually the same dreaming effect, tho perhaps not quite as strong as if I'd smoked it. Even just having the mugwort in the same room can produce a number of technicolour dreams.</p><p>Once I fall to sleep, the strong and vivid dreams start almost immediately, and last right through until I wake up. The dreams aren't always stunningly realistic however, they can also be colourful and somewhat cartoonish. I've found the dreaming can sometimes last a few nights, but with greatly diminished vividness of the dream. </p><p>This is just my experience with mugwort. No doubt there may be stronger mugwort out there, but I've found Mugwort so far to be mild but pleasant.</p>"
}
