{
 "title": "Coming To Terms With Death",
 "author": "oblivion",
 "citation": "   oblivion. \"Coming To Terms With Death: experience with LSD & Mushrooms (ID 42633)\". Erowid.org. Aug 2, 2005. erowid.org/exp/42633",
 "substance": "LSD & Mushrooms",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "14 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "oral",
   "LSD",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 42633",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 2, 2005",
   "Views: 6960",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is an attempt to recount the details of my first experience using psychadelics. I realize the above-stated doses are extreme, but they are accurate. I took these quantities out of ignorance having no prior experience or knowledge of appropriate first time methods. I had this trip 7 months ago and am still recovering.\r\nMy mental state going into this was one of 'lets do it man, lets  see what life's all about,' but below the surface I've always had a good deal of anxiety and depression. I took the drugs at an outdoor concert venue in Washington state. First the mushrooms (all) and then the acid within 10 minutes. I was with two friends that I did not know well and did not completely trust. Initially, I felt small changes in sensory perception, beginning with color changes and auditory variations in volume. I made my way to the top of a hill where I could hear the music, and look out over the Columbia river gorge. Shortly after sitting down I heard my friend mention something and I turned my head to talk back. This is when the drugs hit me. When I turned my head, everything smeared visually. I shook my head, but doing this just made the smears start bouncing around and morphing into one another.\r\nHaving no prior experience with psychadelics, this was insane and I began to have intense pulsations of fear. I started reaching out with my arms for someone nearby, but my arms would disappear into these smeared geometric patterns and come back to wrap around my face. I tried yelling, but I couldn't understand the words coming from my mouth. Then the panic hit me really hard. My heart was pounding, I was sweating heavily, and I suddenly couldn't feel myself breathing. I then lost all subsequent feeling in my hands, feet, and facial organs. At this point I was roughly 2 hours in. Things got so distorted that I couldn't tell which one of my senses was picking up what. The things I was seeing are unexplainable. Just radical morphing images in my periphery whether I had my eyes open or closed it didn't matter. The things I focused on would lapse into the periphery. I began to have the experience of living distorted memories again, and I was seeing and touching faces, shapes, and forces that were not there (technically). It grew from this into my being just morphing with the sky and the earth. I felt like I was physically coming apart and transforming into different parts of the universe. I felt strongly that I was sitting in front of my body, and my motions were independent of it.\r\nAt roughly 4 hours the fear rose to a new level for me. It was a new kind of fear that I've never felt before. I was just completely paralyzed and I knew that I was approaching death. I had wave after wave of panic attacks, but there were also new emotions that I've never before encountered. At this point I couldn't take the fear and the horror I was going through, so I began trying to crawl toward a cliff I had seen earlier in an effort to throw myself off. Fortunately my motor skills were so impaired I was physically unable to move. I remember at that point just crying and giving up control. I just said 'its over let it take you' and in doing so some of the fear left me and I just laid there thinking about my family and friends and trying to connect with them on some level to send them my love. \r\nAbout 6-7 hours in, my friends had managed to get me to an ambulance crew. There is only one thing I remember during the following 4 hours or so and that was asking the Medic what time it was. He replied '6:30' after awhile I asked him again and he said '6:15.'   I couldn't fully comprehend this, but I can say that over the course of the trip (lasted about 18 hours) I thought years had gone bye. \r\nI honestly cannot recall anything from about the 7th to 15th hours of the trip. I have snapshot-like memories of some very unexplainable things. Coming down was very sad. I was just overwhelmed with empathy for every living thing. I felt extremely detached from everyone around me, and my view of reality and the world was very distorted.\r\nFor months after this trip I had severe panic attacks/flashbacks and depression, along with a major change in reality perception. For the first several weeks after I felt like I was drifting on the line of psychosis. I am not the same person I was before this experience. Although I have healed spiritually, I have a hard time relating to anyone who has not had similar experiences and I continue to feel like this reality is a cage that I have to escape from. A note to all: don't take doses like this, I found it very hard to reintegrate myself into reality after doing so. Drugs are not necessesary to reach answers for the ultimate questions in life.\n\n\n"
}
