{
 "title": "Cartoons, Cartoons",
 "author": "7into1",
 "citation": "   7into1. \"Cartoons, Cartoons: experience with DPT & Cacti - T. pachanoi (ID 42640)\". Erowid.org. Aug 16, 2006. erowid.org/exp/42640",
 "substance": "DPT & Cacti - T. pachanoi",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "60 oz",
   "oral",
   "Cacti - T. pachanoi",
   "(liquid)",
   "  T+ 2:00",
   "200 mg",
   "oral",
   "DPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 42640",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2006",
   "Views: 3887",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Hello all, I'm reporting about a very good experience that I had with San Pedro and DPT. I was on my way to a Primus concert and I had processed 3ft of San Pedro into about 6 30oz glasses (via blending and straining), I had downed two of these glasses before I set off on my 2 hour drive to the Primus show. </p><p>Finally I arrived at the show and decided that I wasn't quite tripping hard enough for a Primus show and downed a gelcap containing 200mg of DPT, I had never mixed anything with cactus before, but what the hell. Anyway about 30 mins later after dosing the DPT, the visuals started getting crazy and cartoon-like; with just the cactus, the trip was very mild, but the DPT just kicked everything into overdrive and everything was very foreign and cartoony, it was an awesome way to experience claypools' artistic creations. </p><p>The DPT also boosted the duration of the trip, I was peaking for about 24 hours straight. The cartoons were unbelievable, the only problem was getting back to home base 2 hours away; me and my friends decided against the dangerous drive home that night and opted for a hotel in the area(as we were tripping quite hard even as we left the concert).</p><p>Overall this was quite a novel combination because the trip was so positive and fun, unlike a lot of research chemicals and LSD; I felt as if a bad trip was impossible, and that I had complete control over my cognitive voyage, this may have been all in my head but in fact I loved this trip.</p>"
}
