{
 "title": "Too Strong",
 "author": "Sha",
 "citation": "   Sha. \"Too Strong: experience with Blue Lotus & Alcohol (ID 42685)\". Erowid.org. Oct 17, 2009. erowid.org/exp/42685",
 "substance": "Blue Lotus & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "10 g",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42685",
   "Male",
   " ",
   "Not Given",
   "Oct 17, 2009",
   "13144",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Lotus is an old friend, I have had many experiences with the flower of the Nile.  I started with joints mixed with weed or alone, then the tea, both were very relaxing and some visuals with higher doses. </p><p>But every time I soak the lotus in wine for up to 2 days and consume, I get a stimulant effect.  I could drink a glass or 2 of the lotus wine and continue to drink the rest of the night without getting too drunk and little hangover.  I wanted to see how a larger dose felt so I soaked 10g lotus in 1/2 bottle resling wine (2 glasses), for five days.  On the night of the fifth day I drank the two glasses with some of the plant matter.  The mix was extreamly bitter compaired to the usual 2day soaking.  It had a dry aftertaste that the wine alone dosn't have.  The first effects were felt within ten minuets, the usual warm head (wine), and clearness of thought and a feeling of wanting to converse with everyone (lotus).  I am normaly introverted and like to sit quietly. </p><p>Normaly it stops there and I have a great night.  But I kept going higher and feeling more energized.  It had only been a half hour since ingestion, and I was higher than I've ever been on lotus.  It felt like I had taken a rail of coke.  I had to walk around and couldn't stay in one place long.  I found myself pacing around my house and yard incredably jacked up.  My heart was pounding and my body felt like every cell was vibrating, strong CEVs and visuals 1 1/2 hours.  Then I droped down to a normal feeling of lotus and wine.  I cant stress how uncomfortable I was and I will not let it soak so long ever again.</p>"
}
