{
 "title": "Tearing My Self Free",
 "author": "IMPerfection",
 "citation": " IMPerfection. \"Tearing My Self Free: experience with Salvia divinorum (10x extract) & Cannabis (ID 42748)\". Erowid.org. Aug 31, 2007. erowid.org/exp/42748",
 "substance": "Salvia divinorum (10x extract) & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 1:00",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42748",
   "Male",
   "",
   "Not Given",
   "Aug 31, 2007",
   "2493",
   " "
  ]
 ],
 "report": "<p>Setting: Small, pine-forested area behind a fence near the local mall. My tripsitter/fellow psychonaut and I lean agains the fence near some fallen branches. We had earlier shared a bowl of some high-quality weed and were mildly buzzed, which helps a lot with the unsettling effects of the trip. </p><p>Dose: One small bowl smoked from a water pipe. </p><p>One hour after the cannabis was smoked: I have done this before, and I know how to break through if I am going to, so I get down to business. I rip the first hit from the mini-bong, holding in the warm (even through the icy bong water) smoke for as long as I can. I repeat the process twice more, and barely manage to hand off the bong to my friend before reality is vaporized. I am forced into the fence as though I am part of it. Oh no, I am part of the fence and the fence is riding along an english country road made of reddish clay. I fight to free myself and I hear hellish grunting and moaning, which I was later told I was the source of. Interspersed with this is hysterical laughter, almost unrecognizable for laughter, and completely spasmic, wracking my body.</p><p>I fight to free myself and I feel myself pull away from what was once the fence, long forgotten to me now, in a gooey spasm. I turn to my right to see what was next to me, and stare at an entity for just long enough to recognize it as something unworldly, yellow/black, a ring. Then the entire scene disappears, and all concept of self is gone. I am a neighborhood, I realize, as I survey my new set of surroundings. I am a back to back row of houses, the kind you find bracketed by a set of streets in a suburban planned community. All my houses are identical, and I survey their stern white visages from atop something indescribable.</p><p>This whole time, I have been fighting against the unknown force, the same one I was fighting a moment before the scene change, and I am still struggling now, upward and out of the neighborhood, which distorts and after a moment of abject suburban-elicited panic, I have elevated myself through my violent thrashing (remember, I still think I am a neighboorhood; my buddy says I didn't move at all, other than twitching slowly and making the odd grunt) to a higher vantage point, seeing several other streets in the larger area. I commiserate with them for a brief instant before I return to my struggle.</p><p>The neighborhood fades in and out now to a phase of surreality, where I can see I am lying sideways on my right side, and the neighborhoods are transparent now, each is a branch of the fallen pine branch near me, their needles somehow formed into houses for a sparse moment of my consciousness before the neigborhood illusion is gone and I am slowly coming back to terms with my reality, the grogginess and disorientation fading over the course of the next couple minutes as I upright myself and prepare to share the experience with my tripsitter, who is now packing his own bowl and getting ready to trip (sadly, he didn't break through once that session). </p><p>Half an hour after the first trip, I smoked it once more, and to be honest I don't remember much of anything about that trip, except that we had changed locations to one with a hanging pine bough in front of me, and my buddy said that while I was tripping, I pointed at various locations on the branch and slurred, 'You're not my family!' at each place I pointed to. I then dropped my arm, and yelled in a garbled manner, 'You're not coming on the plane with me!' once before I lapsed into silence again. Later, as I come down, I remember repeating over and over again, 'You're not real,' but my buddy says it must have been in my head because I didn't say anything out loud, though I swore I said it. No recollection of who all these exclamations were directed at, however.</p>"
}
