{
 "title": "Three Boring Tries",
 "author": "Micah",
 "citation": "   Micah. \"Three Boring Tries: experience with Anadenanthera colubrina (ID 42755)\". Erowid.org. Jun 14, 2007. erowid.org/exp/42755",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "3 seeds",
   "insufflated",
   "Anadenanthera colubrina",
   "(ground / crushed)",
   " ",
   "5 seeds",
   "smoked",
   "Anadenanthera colubrina",
   "(ground / crushed)",
   " ",
   "3 seeds",
   "smoked",
   "Anadenanthera colubrina",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 42755",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2007",
   "Views: 7938",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Okay Im going to go into my three separate experiences in chronological order. I received about 10 grams of colubrina seeds in addition to what the salvia that I had ordered. One night I decided to give it a try. I had read stuff about putting banking soda in with it but thought to my self for one that it would suck to snort any more than I had to, and two the shamans didnt have baking soda, so it must not be a necessity.</p><p>I toasted three seeds and the aromas filled the kitchen, I then ground them (with shells because I didnt know I should remove them) and laid out two lines one for each nostril.  Wrapping try number one up it had a disgusting drip, I vomited but not because of the drip and then laid on the couch hoping something more would come than this sick feeling.</p><p>Try two: smoking, I took five seeds ground them (again with shells) And for some reason I decided to add a bit of baking soda to the bowl. Whet outside took numerous hits 4 or 5, the majority of the bowl but not all, and I felt that heaviness people talk about before there trip begins. So I stepped inside ' while I could still walk  I thought' And lay on the couch with some blues playing lightly in the back ground. I sat there with the heaviness for about 15 minutes. I didnt want to smoke more because the majority of what I felt was a cloudy and painful sickness. I did however see slight close eyed visuals, But nothing much 'seen better on a bowl of hashish'. Didnt vomit this time</p><p>My third and final trial up to this date. Toasted 3 seeds removed seeds Shell, ground and loaded bowl (no baking soda this time). So again stepped outside and started smoking holding large amounts in this time for longer periods of time. By the time the bowl was just about gone I felt the heaviness approaching again and took another hit. I went inside and lay on the couch for a few seconds when I became nauseated, so I stepped outside puked three times (came out rather smoothly none of this bile mumbo jumbo). Went back in to the couch felt slightly sick as usual, but visuals were better this time...not much though. I saw what looked exactly like a 3-D picture of some sort of box and then the normal colors. </p><p>So far I have not reached a level that I am looking for with Anadenanthera colubrina.</p>"
}
