{
 "title": "Caffeine Fatal",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Caffeine Fatal: experience with Caffeine (ID 428)\". Erowid.org. Jun 22, 2000. erowid.org/exp/428",
 "substance": "Caffeine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3200 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "428",
   "Female",
   " ",
   "Not Given",
   "Jun 22, 2000",
   "73382",
   " "
  ]
 ],
 "report": "<p>\nmy sister and i decided to get what we thought might be a 'high' one night in december and nearly died. i decided to take 16 caffeine pills with a 200 mg amount of caffeine in each pill (equivalent to 2 cups of coffee) and drink a diet coke. my sister liked the idea because she thought it might be like speed. it was like hell. i shit three times i peed like a race horse about three times. i also thought maybe consuming some good h2o and some nourishing food might help but everything that went into my body came back up. i had an intense headache and body temperature that seemed to range from boiling to arctic freezing. i reached a point where i could not stop tremoring or shaking and my heart was pounding out of my chest. i really thought i was going to die. my sister had taken half the amount that i did and saw what i was going through. i had called an ambulance and was carried out in a stretcher and just about bounced out out of it from being unable to keep still. on the way to the hospital i blacked in and out and the blackouts got longer and longer. i was given numerous amounts of shots and hooked up to hooplas of equipment and was told to drink charcoal or i would die. my sister, i later found out went through the same thing just when i was hooked up to all of the monitors and what not. we were both told that we could have died from the amount of caffeine that we had taken. </p><p>my reason for telling this to whomever is reading it would be, be aware of what how much something can do to you. i just thought i would be very awake. it turns out i was almost asleep permanently.</p>"
}
