{
 "title": "Cosmic Egg Experiences",
 "author": "Sideways Squid",
 "citation": "   Sideways Squid. \"Cosmic Egg Experiences: experience with 4-HO-DiPT (ID 42802)\". Erowid.org. Aug 27, 2006. erowid.org/exp/42802",
 "substance": "4-HO-DiPT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "4-HO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 42802",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2006",
   "Views: 6310",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had ordered several hundred mg's of the substance from an online supplier and was very anxious to try it.  The day the chemical arrived I immediately took approximately 10-15mg of the substance.  I waited for maybe an hour or so for the drug to take full effect, shortly after I experienced a very heavy body load that tapered off very quickly.  It was a rather disappointing run.  </p><p>A few days after I took approximately 30mg of the substance.  I laid down and experienced overall anxiousness, namely what Shulgin refered to as 'leg tremors' which were easily controllable by merely laying down and taking my mind off of it.  I put on some headphones and proceeded to listen to pink floyd, which was a good idea to say the least.  </p><p>I soon noticed that with eyes closed, I easily drifted off into hyperspace, a truly incredible cosmic sensation that probably would not have been possible if it werent for pink floyd's space-like qualities.  I immediately fell in love with the sensation of weightlessness achieved with 4ho-dipt with the eyes closed and repeated the experiments several times after (with dosages ranging from 30-50mg).  </p><p>I learned from this experience not only how conducive pink floyd is to cosmic experiences, but also about becoming one with myself and the universe. I found them to be a very immersive, inexpensive, and extremely beneficial set of experiences.</p>"
}
