{
 "title": "Meeting the Highest Self",
 "author": "Monster_288",
 "citation": "   Monster_288. \"Meeting the Highest Self: experience with Mushrooms - P. cubensis (ID 42808)\". Erowid.org. Aug 27, 2008. erowid.org/exp/42808",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 42808",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2008",
   "Views: 3101",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After having tried shrooms once and not having quite a successful trip I thought I would give it another chance. I knew they had special power. The first time I got real nausiated and couldnt focus on anything else but my sickness.</p><p>I have always wanted to use shrooms with a spiritual purpose. To set a goal. I felt that they could show me things that religious doctrine and books couldnt. And I was right.</p><p>In the summer of my 19th year my best friend M invited me to go for a trip to Yosemite national park with him and several others. I thought it was about time I conquered my fear of tripping. So we drive up in 2 cars, each of us with our own baggy of an eighth of shrooms, appx 4stems and 4caps each, maybe a little more. The day we get there I do not eat anything. I have learned fasting from my old religion and decided it would help clear myself and my body. As well as giving the psilocybin a better chance inside me.</p><p>The next morning we all wake up around 8am. I decide to fast that morning as well. We each buy our own 10oz orange juice to help the magic down then we embark on the trails of Yosemite. We decided to wait for ingestion until we find a nice spot way far away from the main camp. I knew this was going to be a spiritual journey. I could feel it. I was going to make it one. We stop at a nice stream and we all sit down and pull out our bags. Somehow I got the feeling I shouldnt eat all of it so I leave one cap and stem in the bag. I chase with the orange juice.</p><p>I knew that empty stomach/body + orange juice + shrooms = hard trip so I was ready. We get hiking again, all waiting for shrooms to kick in. Forgot to mention the eldest couple were SOBER and our guides. At 20 minutes after ingestion, I am the first one for the psilocybin to hit. My body weakens with difference and I ask if I can lay down. Ira one of our guides stays at my side while the others go off hiking. The shrooms are hitting hard. My joints feel like Im rocketing into space and massive velocities. I lay with my eyes closed letting the darkness envelope me and learning to 'surf with it' while Ira reads her book.</p><p>Every several moments I open my eyes, no distortions, no colors, no visual hallucinations, just hard to focus. I keep my eyes closed and fall through the back of my mind into deep darkness. I observe the outside world through my hearing. So spacial and under analyzed. I cannot understand sounds but I recognize them. A plane flies way high in the sky and I feel the vibrations moving me up and down.</p><p>The sound of frogs everywhere begin chirping and croaking. I know this state. It is the natural state. All of the sudden I am in a vast darkness, with such small particles of matter spaced out for miles. Each particle was bigger than I! And I was just an energy ball, minute and almost non existant. I notice a distance away an octopus of energy/light barrels towards me and is throwing its arms all around me. I happen to spurt the words 'Please dont hurt me' from my fear. This being is not hurting me. But its so powerful and overwelming. It is trying to dance with me! He being much greater than I, let him dance with me and pull me through space.</p><p>I am opened to his influence and he knows it. He says 'Ask anything and I will give the answer.' But I was sucked back to reality when Ira said people were coming and we had to move a ways away from the trail. I lay down again and go back into that realm. I dance with the being still. I forget that I had a life in another realm with a family and friends. We dance and all of the sudden WHAM! Im back in reality faster than the speed of light.</p><p>I am confused 'What am I doing?' 'Am I still tripping?' My guides come to ask if Im okay, 'Yes' I reply but I dont recognize who is talking to me. Their faces are unfamiliar. I notice Im sweating and my bowels are loose. I feel I can pee myself but I dont fear. I remember last time I thought I kept peeing myself and worrying. That wouldnt stop me this time. If I pee myself, then I pee myself, SO WHAT.</p><p>WHAM BAM WHAM BAM in and out of reality, each time taking an eternity in the dark realm, dancing. At some point our tripping friends came back. M was having a bad trip, he thought our parents and cops were coming and everyone was staring at him. During the times I was in reality I was concious enough to say 'M calm down, sit here with me, we are tripping and no one is bothering us'. I am focused.</p><p>Unfortunately my comedown started just after the being said I can ask anything.</p><p>The shrooms (separate from the being) showed me how everything has meaning and reason. How some things are meant to happen at specific times. How there is always someone watching over at all times. Someone greater than you, and I. After the major come down (which was way harsh) we had to walk back to camp, and this was no easy task! The trees were enveloped around us and the ground was not stable. I felt as if a tree from 100 feet away could bend over and touch me.</p><p>I was not scared though. Me walking behind M I was watching his footsteps or else I would get lost. I went into a trance of a sleep like state while walking at the same time. It took forever just to make it back to camp. We felt good to be in our sleeping bags again. We laid there as we watched faces on the tent walls and odd sounds all around us. I could not understand the speaking of anyone other than M for a while and the sound of the frogs vanished.  Trip total appx 6.5 hrs.</p><p>That day I was so curious who that being was. God? Satan? Didnt seem right. Months later I would come to figure that it was my highest self. The part of myself that is all powerful and deciding. The part of me that knows who I am inside and out. And since then I have been learning to be that highest self. I have become a more discerned person, stronger willed, and more at peace with who I am.</p><p>I know myself.</p>"
}
