{
 "title": "12 Stories Up and Tripping",
 "author": "Leper King",
 "citation": "   Leper King. \"12 Stories Up and Tripping: experience with Mushrooms (ID 42897)\". Erowid.org. Aug 29, 2007. erowid.org/exp/42897",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 42897",
   "Male",
   " ",
   "Not Given",
   "Aug 29, 2007",
   "Views: 3540",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The story of my first trip begins with Incubus.  Me and several of my closest friends traveled to Cedar Rapids IA to experience Incubus live in concert. We had made all the usual accomodations including a quad of shrooms to be taken after the concert. The ride down was long and painfully crowded but knowing what we had in store for us made the trip memorable none the less. Arriving at the concert venue we unloaded our gear and went to our hotel room which was directly connected to the arena.  One of my older friends in the group decided he couldn't wait for the concert to be over and took his eighth of shrooms before the rest of us. </p><p>At the concert we met up with more friends who had rode up seperately, being non drug users they immediatly noticed the differece in our mutual friends antics. This however was immediately surpassed by the first notes of the concert.  The show was incredible and the mutual feeling of everyone was one of sheer delight and happiness. My friend who had taken his portion before came running out of the pit completely covered in sweat screaming that everyone was forming into one another and that he would soon be sucked in. This outburst was soon followed by many hugs from him which were not overwhelmingly approved of on account of his sweaty stench.</p><p>Back at the room me and my two friends who have been padres since kindergarten prepared ourselves for the trip. There were alot of people in the room including ones who didn't approve of such actions so the ingestation was kept at a low profile. I caught my self questioning whether or not I should go through with this on account that we were in a hotel 12 stories up with heavy security outside. These thoughts however were soon removed and I gladly shared an eighth with my one of my friends, being a first timer and slightly nervous I thought it was best to just take half an eighth and see were that got me. Well it got me beyond what I thought was possible and more.</p><p>Having forgotten about hall security me and a couple others ventured into the halls of the luxurious hotel, and we ended up in the chairs which were next to the main elevators.  There were people walking and talking everywhere and we delighted ourselves with conversing with some guys that were a couple rooms down from us. This was approx. 15 min. after taking the shrooms and I found myself staring at the celing light. It seemed to be getting closer and closer to me and I looked around to see if anyone else was noticing. Seeing that everyone was still in deep conversation I returned to the light. After about 10 minutes of staring at the large orbe on the ceiling I became aware of a bright light in my face and a man standing over me.</p><p>I quickly and quite rudly told the man to get the light out of my face and began swinging my hand at him trying to tell him to get away. After what seemed like ages the light turned off and the man walked away. Thinking nothing of the experiece I walked into a waiting elevator with a my friends and sat on the ground. As soon as the doors closed I was bombarded by what seemed like hundreds of questions and laughs. I quickly found out that it had been a Cedar Rapids police officer that had been shining a light in my face.</p><p>There was no way that he could have not know that there was something wrong with me. My pupils were the size of quarters and I was incoherantly muttering to him to get the light out of my face. When informed that I had had a close encounter with the law I began to freak out and I was sure that he had to be waiting for me where ever we were going so I told everyone that we needed to go back to the room as soon as possible and that I was not to leave there until the next moring. Its still hard to tell that part of the story and the fear of the moment will probably be with me forever.</p><p>After returning to the room and locking the door multiple times I began to feel at ease and became almost giddy at what was in store for me. Everyone that was along had found themselves back in the room and thats when everything started to click.  All the conversations I had were so in depth and everything I said seemed to come out so easily. I felt that everything was correct and that the situation that I was in was exactly how I wanted to feel for the rest of my life.  It was around this time, about an hour into the trip, that I made contact with what I refered to as Heidi.  Heidi wasn't a person, well she was, but she wasn't in the room.</p><p>It was the name that was sewed into a purple bag that was sitting on the hotel room desk. My friend had bought it at a rummage sale a few weeks prior and brought it along to carry his stuff in.  The bag was set in front of a mirror with a clear water glass in front of it and a green disposalble camera just to the left. For some reason I was completely obsessed with this configuration of colors and shapes.  I couldn't take my eyes off of it for a good half hour and through out the night my eyes were averted to it at least 3 or 4 times every 10 minutes or so. It was the most amazing thing I have and probably ever will see. Aside from heidi the walls were teeming with what seemed to be slithering jungle vines. These were not a threat to me and when ever I became bored with my company I averted my attention to the ceiling to entertain my self.</p><p>It was about 4 hours into my trip when I began to feel that I was losing my high. But this feeling was soon interuppted by what felt like the peaking of my high. I was at my lowest low's and then I would be shot up to my highest highs. The diffrence between was massive but every up and down I enjoyed it more and more. About 5 hours in I was still tripping balls.  It was about 2:30 in the moring and I thought it was safe enough for me to venture outside for some fresh air. Me and one of my friends to the long walk and ended up out in front of the hotel. The street was completely packed with cars and I thought this was strange being it so late at night so I turned to my friend to ask him about it.</p><p>I about screamed at what I saw.  My buddies face had turned a deep jungle green color. I didn't know what to say so I turned around and all the traffic was gone. There was absolutly not a car to be seen.  This obviously gave me a start but I was soon soothed by the simutanious blinking of all the stop lights. The colors red, yellow, and green were blinking everywhere all together in a harmony which seemed to be incredible music in absolute silence. </p><p>After enjoying the light display on the street we returned to the room. My friends face was back to normal and I was feeling that trip was coming to a close. The cracks on the steet from our room window seemed to stretch for miles into the rising sun and the guysfromnextdoorhad exited after an extremely insane outburst from one of my conpanions who had enough of their stories of fights, chicks, and beer.  All of us being pot heads who avoid confrontation at all times simply agreed with our friend and told the invaders to leave before the situation got out of hand. I cheerily shut the door behind them and spent the last remaining moments of my trip watching the sun rise over the flat land of Iowa occasionaly sipping on my coffee and reading a news paper that I had found outside my door. It was a night that I would never forget and that I hope I have plenty more of in the future.</p>"
}
