{
 "title": "It Fried My Brain Forever",
 "author": "Anonymous",
 "citation": "   Anonymous. \"It Fried My Brain Forever: experience with Inhalants (Gasoline) (ID 42951)\". Erowid.org. Jun 19, 2007. erowid.org/exp/42951",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1997",
   "ID: 42951",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 4548",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nI got a mouthful of gas. I was kind of scared I would die but I really didn't care. I didn't call a doctor or try to throw it up. I lived but I had gas burps for two weeks and everything I ate tasted like gas, which I didn't mind because I love the taste but most people don't.\r\nI huffed gas every day for several years, hours at a time,(usually in a garage) and my friends and I would see who could huff the longest without breathing oxygen. Many times I would suddenly find myself in another room or outside with no idea how I got there. Every sound had a never ending echo and even things I could see had a visual echo which would spiral out into eternity. \r\nI never knew when I would black out, there was just missing scenes from one moment to another, however I could see my friends when they blacked out. Their eyes would roll back and they would drool or mumble nonsense. Sometimes I would get sucked into a spiral pattern coming from a sound or an evergreen tree that had some crazy pattern and I would go through it like a tunnel with a light at the end which could have been where death was if I went through it. \r\nHuffing gas made everything beautiful and awesome and it's the most high I can get, but I eventually had to give it up or become a vegetable. To this day the whole world is a total mystery and everything is confusing and nobody understands a thing I say unless I try as hard as possible to speak legibly. The side effects don't go away.\r\nI do not regret huffing gas but I'll never do it again. I am ok with what it did to my brain though because I am an artist and now I can see the world in a special way. The person I used to be might as well have died, especially because I can't remember most of it. My memory is full of holes.\n\n\n"
}
