{
 "title": "Miprocin Days",
 "author": "MiPTy",
 "citation": "Citation:   MiPTy. \"Miprocin Days: experience with 4-HO-MiPT (ID 42954)\". Erowid.org. May 11, 2005. erowid.org/exp/42954",
 "substance": "4-HO-MiPT",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "24 mg",
   "oral",
   "4-HO-MiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42954",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 11, 2005",
   "Views: 14967",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'll never forget the day that miprocin arrived in the area where I live. I had read tons of reports on it on an internet forum, and it seemed to be a 'cleaner version of mushrooms'.\r\nI measured out three doses of 24 mg and I took one with my girlfriend and a close friend. We set out to walk around the still slightly wintery world and the effects quickly set in.\r\nI have a very fast metabolism, which accounts for my insignificant body weight. Most chemicals still take ~45 minutes to hit me, however. The miprocin had me feeling pretty crazy within fifteen minutes. The only things I can ever remember hitting me this fast are mushrooms and, on occasion, high doses of LSD.\r\nThe 4-HO-MiPT had been described as psilocin (the active chemical in shrooms) without any of the body load. Shulgin states in TIHKAL that 4-HO-MiPT is more potent that psilocin (4-HO-DMT) and all of my testing confirms this. \r\nI've always been a bit of a hardhead and my fellow trippers for the initial testing were hardheads as well. 24 milligrams, however, was enough to get my visual field warped to the point where all the plants I could see looked like weird alien life forms. I've taken 3.5 grams of cubensis mushrooms many times and none of those trips touched this one.\r\nMy body felt very receptive to the compound and I actually feel like 4-HO-MiPT makes my body feel better than at baseline. It gives me a certain acuity towards my body that seems like it would be very helpful for diagnostic body work. I could feel every fiber of my body and my balance and poise seemed dramatically enhanced.\r\nThe trees were just beginning to develop leaves and flowers again after the winter frost and I couldn't believe how well-defined the fractals were. I jumped up and down on a trampoline while I watched the world erupt with alien chaos around me. I felt complete.\r\nI've since imbibed this compound at the 27 milligram level and I felt like the peak was a lot more intense. I want to try ~35 milligrams as I think this would be either a +4 experience or very close.\r\nI have experimented with LSD, mushrooms, 2C-I, 2C-E, 2C-B, AMT, 5-MeO-AMT, 5-MeO-DMT, 5-MeO-DiPT, DMT, 2C-T-2, 2C-T-21, nitrous, ketamine, DXM, MDMA, salvia, and a few other notable psychedelics. DMT, salvia, and 5-MeO-DMT are not traditional psychedelics in my opinion because they are such short experiences with seemingly no value to be gained mentally. Of the traditional psychedelics then, I feel that LSD and miprocin are far superior to any others I have tried. Mushrooms are very comparable to miprocin, but I find the bodyload is a bit overwhelming at large doses. In the future I will stick to 4-HO-MiPT when I want a medium length trip and LSD when I want a long trip.\n\n\n"
}