{
 "title": "Spinning Out of Control",
 "author": "Adam",
 "citation": "   Adam. \"Spinning Out of Control: experience with Salvia divinorum (20x extract) & Cannabis (ID 42985)\". Erowid.org. Sep 5, 2008. erowid.org/exp/42985",
 "substance": "Salvia divinorum (20x extract) & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42985",
   "Male",
   " ",
   "Not Given",
   "Sep 5, 2008",
   "4528",
   " "
  ]
 ],
 "report": "<p>May 11th, 2005</p><p>This is an account of my first two experiences with Salvia D.</p><p>1:10pm - Prologue</p><p>I and two other friends (Main B and Main J) had gotten wind of a downtown pipe shop selling Salvia. In our never ending search for new psychedelic experiences, we had to try it out. After Main J and I had polished off a roach, we picked up Main B and a gram of 20x Salvia D. fortified extract. Main J felt 20 times was way too heavy for a bunch of first timers, we all agreed. We laughed with excitement the whole car ride to the Main Bs house.</p><p>2:00pm  The Trip</p><p>We sat in his bedroom with his acrylic green bong, ready and filled with water, loading the first bowl. Main J would be the first to take a hit, being careful of our new substance. Almost immediately he reports the effects, he says he feels really good and comfortable. According to Main J: </p><p>It fucked me up so bad physically that I could barely move to smoke more. I had to struggle to do everything. I felt like I was being sucked into the endless mass of mattress which I was laying on. My body weighed millions of tons. Everything was so surreal and I was trying to keep in contact with the others to see how they were doing but nothing was really letting me keep legit communication flowing. I slowly got pulled to the floor more and more until I felt so tired from resisting the force that I was nearly sleeping. </p><p>It would be my turn next. I emptied the chamber that Main J had left, and proceeded to light the bowl filling it up once again. I emptied the chamber half way and motioned Main B to take a hit. I held the hit for as long as I could, about 15-20 seconds, and let it out. I immediately felt a slight tingle, Salvia had taken me hold. I was still coherent enough to take another hit as Main B had finished his first hit. We loaded another bowl and both I and Main J took another hit. I then began to laugh hysterically, for no apparent reason. I then notice Main B making hand gestures in the air, pulling out imaginary drawers, flipping pages of an imaginary book. Holy shit, this guy is in another world. I found this hilarious and continued to laugh hysterically.</p><p>I tried to get Main Bs attention, only to find him in a trance. He could react to my gestures, but they would always be about a 30 second delay. I would point to the floor, just to get him to look, and then I would watch as he eventually got to it. This had to have been the fact that I was fucked up as well. What happened next is that my body became stiff, and I was found in a choreographed movement along with Main B. Time began to glitch. We were sitting down, Main B and I were facing each other, and we would tilt our heads down, come back up, and repeat, over and over. We were on repeat for what seemed like about 20 seconds. All the while I could hear Main J in the background laughing as I tried to communicate with Main B.</p><p>I regained control of my body and layed back on the bed. Main B was coming to by this point and had left the room in a panic, this worried Main J. He thought Main B would do something stupid, but I reassured him that he had only left to get a drink. Suddenly I was sweaty, I did not recall gradually becoming sweaty, I just was. I then moved the water bong off the bed so I could spread out and get comfortable. By this time the effects had began to wear off. I felt like I had just woken up, and was slightly disoriented, trying to comprehend what just happened. The whole ordeal felt like about a minute, but in reality it had taken almost 10 minutes. </p><p>2:30pm - Aftermath</p><p>Main B would later give me and Main J his side of his trip, not recalling the trip so much, but recalling coming back from the trip and being melded into his chair and the wall. Main J had this to say about his first Salvia D. trip: None of us knew what the fuck happened. Main B had this to say: </p><p>I got the big green fucker (the bong), filled my lungs with the smoke, and sat down. The next thing I know, it feels like I had just woke up from a nap and my body has melted to the wall, and Im FUCKIN STUCK THERE. My face is stuck and I am staring at my drum set (which I am most likely melted to). I notice music is playing and it reminds me of school and it really starts to annoy me so I turn it off. All of sudden it feels like some fat mother fucker sat on the fabric of space and a great force is pushing my body sideways and down simultaneously. I try to speak but my jaw doesnt work and it feels like Im slobbering all over my self. I look over Adam whose head is moving up and down, my head seems to get stuck in the same rhythm. I try to say something but nothing comes of it. I realize now that I do have a body. By this point Im freaked out as fuck, so I get up and say FUCK DIS SHIT, I need a drink and leave the room. Now Im sober and I have no idea what happened before I melted into the wall.</p><p>We would sit outside in the backyard talking about our trip. We all felt drained, and agreed to separate and get some rest.</p><p>6:30pm  A Second Chance</p><p>I get a message over MSN, Main B and Main J want to go on another trip with the remaining Salvia D. Why not? Perhaps this could be a chance to really trip out, much like Main B did. My first experience with Salvia D. was fun, but it would pale in comparison to what would come next.</p><p>7:10pm  Nothing could prepare me for this trip</p><p>We gathered our green acrylic water bong and drove to the outskirts of town to the largest public park in the city. We would venture across two small ditches, through some brush, up a somewhat steep overgrown hill and up onto a bicycle path near a farm. We were nice and isolated, free to trip out. This time I would be the first to take a hit. We packed a decent size bowl and I smoked it up in one hit, along with the shotgun. I held it for about 20 seconds this time. I let it out and begin to feel it grab hold once again, that familiar tingling feeling that I had just freshly experienced a few hours previous. I felt I had to communicate this with my fellow psychonauts, I wanted to say Hey guys, nothing feels like the first couple seconds Salvia takes hold eh? but as I opened my mouth to talk, I felt time glitch again. I would feel and hear myself skipping like a broken record in the middle of the sentence. </p><p>Main J and Main B started laughing at the fact that I couldnt communicate. They hadnt even loaded another bowl yet, but I did not know this for by now (from the account of others) I was keeled over on the ground rolling around for about 2 or 3 minutes. What I felt after I heard them laughing was a feeling of pure detachment. My ego was no more, I no longer existed. I felt like I was split in half vertically and one half was spinning, all the while I couldnt connect with my body. It was as if I didnt have a body. This scared the fuck out of me. I would never see my house again; I would never be able to lie in my bed again. It was as if things that gave me comfort were being spun around right in front of me, taunting me to the fact that I didnt exist. I felt endless despair; I would try to ground myself, much like you would in a dream in order to wake up, only it wouldnt work. I had immediately forgotten that I had smoked Salvia, so much like you feel like youre grounded in reality now as you read this, is how I felt when I was spinning, body-less in a state of endless despair. It was reality to me. All this was while my body was rolling on the ground, completely out of my control.</p><p>I started to come back to reality to the voices of Main B and Main J asking if I am alright. I dont remember standing up, but I was told by Main B and Main J that I examined the bong and a few sticks and generally looked very confused and terrified. I felt a tingling, pins & needles feeling on my lower lip and forehead, the remnants of my head being split in two? I felt very weak and dizzy at this point, I remember laying on my back and seeing Main B and Main J, looking very tall, towering over me. I was confused, freezing, sweaty and frightened. I had no idea where I was. Main J would reassure me that I had just smoked a bowl of 20x Salvia and that I was in a public park, and that I was safe. I was reassured with this and the fact that I was now beginning to reconnect with my body.</p><p>This time I remembered getting to my feet, but it was hazy. I walked back and forth, still very confused; I had that feeling as though I had just woken up. Time was making sense again. Main J and Main B asked me if I wanted to smoke another bowl of Salvia. This was the last thing I wanted to do at that moment. I was still frightened, very cold and very confused as to what just happened. They would ask me about my trip, and I couldnt put it into words yet. It was still too fresh. I wanted to walk back to my car, I was so cold and uncomfortable, and I needed to sit down, or lay down really bad. I felt anxious, and embarrassed as to what I had just went through. I was still shook up, but Main J would remedy that. He pulled out a small joint, enough for me to get 3 decent hits from. After the second hit I began to mellow out. </p><p>7:40pm  Aftermath</p><p>They began to tell me what they saw me do during my 3 minute ordeal. I was so shocked when they told me I rolled on the ground for 3 minutes, as it seemed as if the whole thing went by in a flash, like I had just woken up from a dream. We walked along a set of railroad tracks smoking the last of the joint. By this time I was no longer anxious, somewhat relaxed but still felt strange. I began to be able to put things into words now, and I began recalling things, piecing them together with what Main B and Main J had told me. I felt that since my two friends had not taken hits but rather just watched me act a fool, that I had been betrayed. In retrospect Im glad they didnt, because it was the fact that they were solid and sober that I was able to grasp reality. Salvia is fucking powerful, and it made me its bitch.</p>"
}
