{
 "title": "Dancing Elephants",
 "author": "steve-o",
 "citation": "   steve-o. \"Dancing Elephants: experience with LSD (ID 42988)\". Erowid.org. Aug 29, 2007. erowid.org/exp/42988",
 "substance": "LSD",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 42988",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 29, 2007",
   "Views: 4712",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was my last day of four awesome years of living the american dream. I am colombian, at the time I was 18, I had moved to orlando fl with my family and now I was about to leave for colombia by myself to study. I myself, am a very intelectual person even more after the night that am about to tell you about. \r\nThe setting, one of my best friends house. He, along with a few other friends had just gotten back from a hippie gathering in the woods in a county about 40 minutes away. They had spent three days at the gathering, I know the didint even notice those two first days. Anyway, he brought a little present, a going away present. It was a little paper square with a dancing elephant on it. This was the moment I had been waiting for. Four years I waited to try acid. This experience had been very much anticipated. We sat, 4 of us in my freinds living room. It took like 45 minutes to hit me. It started with a light tingle right under my ears, it felt, to me, just like coming up on mdma. Then my friend lit a stick of nag champa incense, when I saw the smoke comeout of the incense burner I knew my adventure had started. The smoke took life and explored the house until the house became the breathing lungs of a smoker. I was never interested in the hallucinations of lsd. Ever since I found out about it I always wanted to sleep or dream how we called it. \r\nAfter a while of looking at the smoke of the incense I took a walk out back, where the pool is at. I sat on a chair by the pool and I put my feet on an other chair. I looked up at the sky and fixed my eyes on the beautiful full moon. A big precios eye looking down on me. I think I spent about 40 minutes staring at that moon. I finally felt comepletely under the influence of the most beatiful chemical. I went back inside the house and I was surprised by the sweet sweet sound of music. I sat down on a chair and listened. The band that was playing was tool. How much better can it get? It was the first time I felt the full power of music. Each song had a different feeling, smell, taste, color. I had ever in my life heard sounds as orgasmic to my ears. Then I closed my eyes. There are no words that can fully explain my experience. All I can say is that it changed my life forever. The night went by and I slept and woke up numerous times. My trip lasted for about seven hours with full effects. \r\nThe next morning I was the first one up. I walked outside and the world was completly different. The sun was bright, the day was beatiful. I felt more alive than ever. My feet were stuck to the ground, it was like I felt closer to the earth. My mind was at peace. Everything felt right. That was the last day I saw most of my best friends. I can tell you this, I belive that our intelligence and our mind are the pure esence of mankind. LSD, to me is the greatest thing ever invented. Now I know, that a thinker really can do what a thinker thinks. I got a little taste of the price at the end of the road and I think maybe its not that bad to take my time in this world.\n\n\n"
}
