{
 "title": "An Ancient Herb, with a Lot of Hype",
 "author": "ceosion",
 "citation": "   ceosion. \"An Ancient Herb, with a Lot of Hype: experience with Kratom (spp. Kroth) (ID 43006)\". Erowid.org. Jul 15, 2005. erowid.org/exp/43006",
 "substance": "Kratom (spp. Kroth)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43006",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 15, 2005",
   "Views: 7513",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wanted to try this plant, mainly because it has many origins in Thailand, my mother's home country.  The active chemical alkaloid mitragynine is what supposedly causes the majority of its stimulating effects.  Unsure of how to really go about using it, I decided to try it in a multitude of ways.</p><p>Firstly, just out of the spur of the moment, I went ahead and tried to smoke it.  Terrible idea.  The smoke was harsh, and was quite similar to perhaps trying to smoke a pile of lawn leaves.  No effect, other than pain in my lungs, was felt from this.</p><p>Secondly, I tried doing the quid method.  I found the leaves to give off a very bitter taste, to the point where I didn't want to chew them anymore.  I did, however, manage to chew them for about 10 minutes.  I waited, but still, no effects felt.</p><p>Finally, in an attempt to try and feel anything from the stuff, I dumped the remainder of my Kratom supply into a pot of water, and boiled it for 10 minutes.  I drained the liquid which was now like tea, and I boiled the leaves again for another 10 minutes.  I combined the two volumes of liquid, and boiled that down to about 1/3 the original volume.  The result was a mildly dark liquid that smelled very much like normal tea.  It was VERY bitter, however, and even with spoonfuls of sugar, retained its bitterness.</p><p>I drank about half of it... and waited.  I started to notice a very... subtle numbness.  The carpet felt very awkward; basically the nerves in my foot went somewhat numb.  I felt a bit at ease - and slightly more awake than I was before.  To my dismay, however, the effects weren't as powerful as I would have liked, so I downed the rest of the 'tea'.  Nothing else really happened, it just seemingly prolonged the very subtle feelings.</p><p>In conclusion - Kratom doesn't really do it for me, it was an interesting experiment, but I need something a bit stronger.</p>"
}
