{
 "title": "A Well Timed, Incidental Transcendence",
 "author": "Psyonic-One",
 "citation": "   Psyonic-One. \"A Well Timed, Incidental Transcendence: experience with 5-MeO-DiPT (ID 43017)\". Erowid.org. Aug 7, 2006. erowid.org/exp/43017",
 "substance": "5-MeO-DiPT",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 43017",
   "Male",
   " ",
   "Not Given",
   "Aug 7, 2006",
   "Views: 3706",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A friend of mine, who I'd shared some other such research chems with told me happily that she had a present for me and presented me with five 10mg capsules of 5-MeO-DiPT.  I happily thanked her and put them in my special stash place for a while, almost forgetting about them.</p><p>It was the world premiere of the Sci-Fi channel's remake of the movie and book 'Dune'.  While I anticipated a cheesy experience, I though it might be fun to test drive the Foxy that night while I watched the several hour long TV-movie.  At about 7:30 I popped two capsules with a glass of water on an empty stomach and waited.</p><p>T+0:20:  First alert, just that feeling of 'Something' lurking in my body.  A hint of a sensation, but nothing much.</p><p>T+0:30:  As the movie began I felt a little nervous, I could feel something coming on and it felt big.  There was that familiar feeling of looking down the barrel of a gun, 'Oh, only 4-7 more hours to go and no clear idea what's about to happen.'  But still, things were pretty mild.</p><p>T+0:45:  Definitely up, noticing the usual shifts in the visual field, a brightening of colors and sharpening of edges.  Still nothing too exciting.</p><p>T+1:15:  Right about now, I am feeling very interested in getting water.  I get up and leave the dark sanctuary of the living room to forage for something to drink.  I remember being VERY thirsty and somewhat nauseated.  I went into the kitchen and that's about when it hit me.  I was on a trip.  Mild shifty visuals, wavy patterning like the first hints of LSD, and body load.  It was difficult for me to organize my motions after not having moved since effects began, and getting water was a shaky affair.  I drank a big gulp and returned to the living room, now somewhat bracing for impact.</p><p>T+2:00:  Ok, now I have full delusional style visuals, waves, patterns, halos, and the like.  I was told that this substance was not so much visual as a body buzz, but I was definitely getting distortions.  At this point, the fairly bad 'Dune' remake is totally enthralling.  I am fascinated by the interplay of my experience of this high (which was still slowly coming on it seemed) and the experiences of the main character Paul.  As he begins to discover the relationships of the spice and the rest of the universe, it occurs to me that psychedelics were probably a catalyst in our rise from mere primates to where we are today.  </p><p>T+2:30:  Body load feels pretty heavy at this point and the mental aspects are pretty heavy too.  I am SO involved with this movie.  at which point, the main character, Paul, drinks 'The Water of Life' and goes into this coma/trance/psychedelic experience.  When he awakes after days of death like sleep, he has finally become the 'Quizatsaderach' (read messiah), the only man to drink the water of life and live.  His mother, who sits near by, nervously concerned with he son's condition, comes to his side. 'Paul, are you alright!?' (Or something to that effect)  Paul says, Mother!' and grabs her arm at which point, she is propelled into this spining fractal vortex.  She is there with her son, Paul, who says, 'Time, and space, these things are just illusions!' She says, terrified 'No! Not the place we cannot look!' as she stares into the vortex.  Then!</p><p>I Slipped out of normal reality for a minute, I was IN the vortex, I spun, my body dissolved, time and space folded.  It was true, time and space are illusions of perception, safety nets to keep our brain from overloading, we COULD simply wish it and through that, evacuate our reality.  Isn't that what I've just done.  Is it possible that time travel is a state of mind?  At this thought, I overloaded.  I lost track of everything...</p><p>T+2:45:  Back in the comfort of my living room, heart still racing, I realized two things.  First, that what had just occurred was unlike anything else that I had ever experienced, and second, that the rest of the night would in know way compare to the last ten minutes.  I watched the end of the movie, but felt exhausted.  I had spent everything.  After deciding that the rest of the night would produce no further insights, I stopped watching the clock, I stopped taking note, I just stopped.</p><p>T+?:??:  BED...restless...sleep...</p><p>CONCLUSIONS:  Well, I enjoyed my Foxy experience, but I do not think that I would repeat this chemical.  The body load was significant for me but perhaps this could have been tempered with some food.  I realize that I do not like the load that tryptamines seem to produce but the experiences are fantastic.  Much easier to me than LSD, which can often seem, well, menacing or mischievous somehow.  But the tryptamine family has always been nice to me.  But perhaps I have seen all I need, maybe everything from this point forward will be redundant, perhaps this is the final trip.</p>"
}
