{
 "title": "This Newspaper of Yours",
 "author": "Anonymous",
 "citation": "Citation:   Anonymous. \"This Newspaper of Yours: experience with Mushrooms (P. Cubensis) (ID 43036)\". Erowid.org. Dec 16, 2007. erowid.org/exp/43036",
 "substance": "Mushrooms (P. Cubensis)",
 "bodyweight": "101 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 43036",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2007",
   "Views: 2613",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis particular experience wasn't my first, but was the most profound experience I have had. That morning I had listened to Soul Coughing on the bus ride to school (this is an imporant fact for later). Upon entering the school, I was approached by a good friend, who produced the mush, and suggested that that day would be a good day to indulge. (I would suggest not taking any psychedelic at school.)\r\nSo, At around nine in the morning, on an empty stomach, I consumed two grams of mushrooms. When the bell rang, I dropped my my guitar off at the office, and went to English class. My friend and I went our separate ways.\r\nWhile coming up, I felt a sense of discomfort in my abdomen, as well as anxiety, and a chill throughout my body. About half an hour after entering the class, I noticed that anything glass would wave, and something was wrong with the overall context of my situation. The saying 'a fish out of water' came to me, and then I started to believe that I could be a fish. We were supposed to be working on a worksheet for the play Othello. The teacher said to 'split into groups'. I could not grasp this concept. I sat at my desk, alone, and wondered why I was so alone. I could not understand why the 'teacher' in front of me had such control over the humans. I convinced myself that it was a large conspiracy, and that the kids in front of me were from the matrix. When the bell rang, seventy five minutes later, I decided to create an illusion, and follow the kids out the door. I discarded a blank sheet of ripped paper into the recycling bin. I had been very sure that it was evidence against me.\r\nDuring the break, I stood around with my usual group. One particular friend was told that I was tripping. He grabbed me by the shoulders, and told me that I was a human being, from the planet Earth, and that I had taken a psychedelic drug. This calmed me down. I saw that this was true, and stopped acting like a fish. (Or... I thought I was acting like a fish...)\r\nWhen the bell rang at ten thirty, I followed my friend to our French class. This would have seemed weird to my regular self, because we skipped every single French class, but at that moment it seemed like the good thing to do. We were told to grab a newspaper, and to write an oral on it. This, is when my day went wrong.\r\nI was enabled to see every particle in every object, and I believed myself to be inside the newspaper. I kept pressing my face into the newspaper, and desk. I was crying, but when I finally looked up, to see my friend, I thought that she was the one crying. I had no preconceived notion of feeling. I could not feel that I was crying, and so I thought that everyone else was. That French class lasted about two years, for me. The same pattern, happening over and over again. When asked to do my oral, I looked up, and sighed, babbling some inconceivable notion, that didn't make any sense. Most likely I was asking where my 'reassuring friend' had gone. I felt like if I could see him again, I would feel better. This made me jump up, and walk to my friend, saying 'you're crying, we have to go'. She glared at me, and told me to sit down, and stop freaking out. The idea that I had been freaking out, freaked me out. (I hadn't known I was freaking out before, because I thought that it was normal, and that it happened all the time. I also didn't remember taking the mush until around four.) I went back to my desk, and watched as a pool of water soaked into my newspaper.\r\nAt 11:45 the bell rang, and I ran out of the room. I went to where my reassuring friend had been, and proceeded to be slightly freaked out, until I found him again, standing in an adjacent hall. I looked up at him, and then I was in a loop. I thought that it was that morning, and that he had just reassured me of my existance as a human being on Earth. Because of his authority, and obvious power over my emotions, I started to believe he was my boss. When he wasn't around me, I would ask for him, saying that I had to ask him what the 'article' had to be about, because the deadline was the next day. I made myself believe that I worked for a 'college newspaper'. And that he was my boss. \r\nAnyway, at around noon I went searching for my original friend. She was having a pleasant trip in the library, with another mutual friend. She had apparently been telling him all the secrets of life. When I came, I calmed down slightly, but then went on a tangent, and cried because the walls were crying. My friend slapped me, because I had 'ruined her trip'. Anyway, the wall was crying, and I was crying... I kept rambling about how much experience the wall had had. Apparently I talked about this a lot. I don't remember it that well. \r\nWhen the bell rang I got my guitar from the office, because I remembered that it was there, on passing. I then went to science. This was confusing. I would normally have had a pile of books to bring, but couldn't figure out which locker was mine, and even if I had found it, I don't think I'd have been able to open it... \r\nIn science class, I started to remember the words to the soul coughing song I had been listening to earlier. ' Los Angeles Loves Love'. Along those lines. I wrote in my journal. 'If I love, and Los Angeles loves love, then I must be in Los Angeles.'\r\nI turned to my friend, and asked her if I was in Los Angeles, she just sighed. \r\nScience class ended quickly, and I left the room, walking through a catwalk. The glass was moving, and everything was warped, but it felt nice to just be walking in and out of these seemingly natural movements.\r\nI walked back to the original hall, and talked to my friends a bit. They were asking my friend how her trip was. I felt so alienated. I was just coping and trying to see why they were ignoring me. In all truth they weren't, but I still didn't understand why it was snowing so heavily in Los Angeles.\r\nIn my last class (history), I looked up from my doodles, and asked a kid if I were always there. (I would get the sensation that I was always everywhere, and anywhere that I went.) He gave me a weird look, and then went back to his work. I still felt very alienated.\r\nThe trip lasted until around 6. I slowly, came down. But roughly. It was hard to lose the reality that I had lived in for most of the day. I could call this a bad trip, but have found that it was more of a learning experience. \r\nI would say that before taking any drug it's best to research it, and just make sure to have a good setting, and nice understanding, grounded people around. Also to be prepared efficiently for the experience. (Whatever that might mean for you.) (I would like to add that throughout the day there were periods of time in which I knew I was tripping. It was not all complete chaos, I knew who I was every once in a while.) Anyway, Peace.\n\n\n"
}