{
 "title": "A Spiritual Guide",
 "author": "Trevor",
 "citation": "   Trevor. \"A Spiritual Guide: experience with Salvia divinorum (leaves & 20x extract) (ID 43066)\". Erowid.org. Aug 30, 2007. erowid.org/exp/43066",
 "substance": "Salvia divinorum (leaves & 20x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43066",
   "Female",
   " ",
   "Not Given",
   "Aug 30, 2007",
   "Views: 4228",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI was told of salvia by one of my good friends a while back and decided I would like to try this sacred plant. I have very spiritual intent with the use of consciousness altering substances, so my friend and I decided to start growing our own plant as to develop a nurturing relationship with the salvia before inducing and experience. I had been told that salvia may not affect one upon the first time smoking, so I smoked a very small amount to prepare for an experience. </p><p>My first salvia experience took place in my friends garage. It was mid-afternoon, and there were four of use sitting in a circle with a homemade hookah in the middle. The garage door was closed, creating a very dim lighting, but not dark. No music was playing. I crumbled dry leaves into the hookah bowl until it was full and instructed one of my friends to keep crumbling the dried leaves in until I could not smoke any more. Before I began smoking I said what might corresponding to a prayer addressed to the entity that is Salvia Divinorum, asking to be guided through the experience, for the experience to enlighten me further than I was at the current time.</p><p>I smoked approximately two and one half bowls through the homemade hookah with a flame on the salvia constantly. I do not recall deciding I had smoked enough and thus stopping, but more an unknown force pushing on my body with greater and greater force until I had eventually been pushed out of my current reality and into a parallel dimension. As this happened I had the conception of my essence being gently grasped by the hand and guided out of my physical body. My consciousness simply floated away from my physical body. I floated into the air with an unprecedented calm and willingness. I felt as if I was completely at one with my environment, which at this point was multi-dimensional. As I floated away I was accompanied by the being that I conceived to be salvia, which was most definitely female in its essence. Although no feelings of even the existence of sexuality were present at that time, the energy of the being was female. I felt more comfortable with this being than I had ever felt before.</p><p>When we had reached our destination my three friends were waiting there for me. It was in a plane of existence where I saw absolutely nothing but white except for my friends and myself. I saw my friends and I sitting together from a different perspective. I could actually look at myself from many different angles. I was not using my physical body to see. My friends did not look as they did before. In fact, they did not look like humans at all. I conceived them as different beings. One was an aura of radiant color, another looked almost mythological, most closely resembling a great wizard. Although my friends did not appear the same physically, I knew it was them in their essence. Myself in my essence was meeting with my friends in their essence, in a completely different plane of existence. I was given a completely new way of looking at life as most of us know it. Upon meeting with my friends I was given much insight in how we all fit into the big picture of things. Not just people, animals, and plants. But absolutely everything. I had come one step closer to understanding the fundamental underlying force of the universe.</p><p>I was eased back into the garage with my friends and had the conception that the hookah hose had brought me back, as if I was holding onto it as not to get lost. I had the conception that my experience had been narrated, although no words had been spoken to me. I felt as if communication on a completely different level had occurred.</p><p>Most of my salvia experiences have been very pleasant and enlightening. It is, however, important to not underestimate the power of salvia. Most recently I smoked a full bowl of 20X salvia from a relatively large bong. The following experience was the most intense experience I have ever had, far surpassing experiences I have had on mushrooms, lsd, dxm, and lsa. I remember exhaling my last hit and then being sucked into another absolutely terrifying, perfectly vivid reality. The most intense part of the trip only lasted about 5 minutes, but I was sweating and trying to catch my breath for the following two hours. My sitter told me of my physical activities while I was tripping, which included me frantically crawling around, screaming a barely comprehensible NO! while slamming my hand on the ground, and eventually just collapsing. I have no recollection of any of these activities. However, I do have an almost perfect recollection of my experience, which terrified me. I believe this occurred because my intentions were not in the right place during this particular trip.</p>"
}
