{
 "title": "Successful Spiritual Tonic",
 "author": "Moondog/Ben",
 "citation": "   Moondog/Ben. \"Successful Spiritual Tonic: experience with Calamus & H.B. Woodrose (ID 43068)\". Erowid.org. Mar 7, 2007. erowid.org/exp/43068",
 "substance": "Calamus & H.B. Woodrose",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "9 seeds",
   "buccal",
   "H.B. Woodrose",
   " ",
   "  T+ 0:10",
   "5.0 g",
   "oral",
   "Calamus",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43068",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 7, 2007",
   "Views: 7135",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have experimented with many psychadelic substances both common and uncommon over many years, as a part of my research to discover the self and the connection between humans and nature. I have used hallucenogens recreationally in the past, but I only recommend such use for serious self exploration or spiritual developement. Although it's always pleasant to have a good laugh, these substances are natures tools to help awaken us and should not be abused or taken lightly. </p><p>I have found an excellent psychotropic mix that works wonders for meditation, self enjoyment, and connecting with nature and the cosmos. Through trial and error I found that the following works best to aid in my rituals... Chew 9 to 18 Hawaiian baby woodrose seeds for 5-10 minutes, sucking on the juices. Spit out or swallow the seeds. (may feel mild nausea, motion sickness pills will help) Then swallow 3 to 6 grams of chewed chopped or powdered Acorus Calamus. </p><p>The full effects could take up to three hours before noticed. So be careful and be patient. This combo mix's effects should be easily equally intense to a good shroom trip or can be compared to a hit of good paper.(LSD) Calamus by itself can create a speedy but relaxing MDMA like feeling and can be hallucenogenic in larger doses. It often creates feelings of hapiness and great energy. HBWR seeds create hallucenogenic effects similar to LSD, but not as potent and have a tendancy to be more of a downer by themselves. Mixing these two together is not dangerous. They will greatly intensify the effects of each other. The experience is mind opening colorful and psychadelic to say the least. My experience with it has been nothing but positive. The trip has an energy of its own and can last up to 12 hours. The experience really shouldn,t be compared to alot of recreational drug use or other Psychoactive use. A nice long walk through the woods is recommended. So this is what I call my spirit mix.  Good luck to all thats interested and have a good trip...See you on the other side....</p>"
}
