{
 "title": "Very Interesting Seeds",
 "author": "Shamsu",
 "citation": "   Shamsu. \"Very Interesting Seeds: experience with Voacanga africana (ID 43102)\". Erowid.org. Aug 4, 2005. erowid.org/exp/43102",
 "substance": "Voacanga africana",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "40 seeds",
   "oral",
   "Voacanga africana",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43102",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 4, 2005",
   "Views: 14396",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At the time of the following report I was Taking 10 mg Elavil a day. I had just signed up for the summer session and was feeling good. The setting was a little warm but I live at the beach and its hot all the time, I just havent acclimated yet. Anyway set and setting were good and I love psychedelics, and have had several high dose experiences of Salvia, LSA, LSD, DXM, DXO, Yopo, cebil, and others. But I was looking for something new. I was also intrigued by the lack of knowledge on the subject so I felt I was on a seldom walked trail, I get a thrill of thinking of origin and traditional use of ethnobotanicals and following a traditiona that few people have the opportunity to do. Anyway.</p><p>I recently was given about 200+ Voacanga africana and did not know what they were, after finding very little on the use besides eating fifty seeds would induce visions. I was hesitant to try because the first thing mentioned is that it is poisonous. </p><p>After about a week and a half of searching the web on any info I decided to take forty seeds.</p><p>I am writing this as I experience it.</p><p>12:30: Swallowed forty seeds with water. First five were chewed to aid in total absorption, but this method was exchanged for swallowing whole because the taste was like eating rotten moldy bark witch the water intensified. Then a sat back and smoke a bowl of MJ to relax while I waited for the effects to kick in.</p><p>1:10: Getting tracers and floaty feeling. My head is getting hot around my ears. Very mellow</p><p>1:30: took a ride on my scooter was easily focused and maintained easily. But was slightly surprised at perception of other peoples speech at ice cream shop. I felt straight but was responding slowly to questions. Slight visuals more like distortions. Wind feels very weird and relaxing. When I return home I find it difficult to get off my bike and get its kickstand down properly. Now I feel uncomfortable, like I should not have gotten off the bike.</p><p>2:15: Getting mild hot flashes, feel like Im going to sweat at any minute, very relaxed and jumpy at the same time, I guess the weed is fighting the seeds stimulant effect. Some CEVs many more open eyed visuals. Body feels labored by breathing any more than needed. Feel my pulse over my hole body and slight dissociation from limbs, things feel good.</p><p>2:50: After almost falling asleep and being in a half dream world with weird colors and sliding visions, I am very stimulated and clear headed with trails and CEVs.</p><p>The rest of the night I drank wine and smoked a few more joints, I had a head ache when I went to bed but that was probably from the wine. I had weird dreams that I was waken from and started right back up when returning to sleep throughout the night. </p><p>I woke early this morning and still have weird and complex CEVs. I also feel the chest pain that the other experience reported. Definitely the poison part of the deal. This is the only thing that would keep me from trying the seeds again. I will look for a possible extraction that can eliminate the poison and isolate the iboga if its possible. </p><p>All in all it was worth experiencing once, it has a very distinct feel and its own set of visuals. Unless I find a safer form or extraction without going to the illegal Tabernanthe iboga, I dont think ill be exploring it any further just because it has obvious physical effects that cant be good.</p>"
}
