{
 "title": "The Art Gallery: A Thousand Little Movies",
 "author": "Chaos w.w",
 "citation": "   Chaos w.w. \"The Art Gallery: A Thousand Little Movies: experience with LSD, Alcohol & Caffiene (ID 43131)\". Erowid.org. Sep 7, 2008. erowid.org/exp/43131",
 "substance": "LSD, Alcohol & Caffiene",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 9:00",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 9:00",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43131",
   "Male",
   " ",
   "Not Given",
   "Sep 7, 2008",
   "Views: 2515",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThe fun started at about 12 in the day when me and a friend both dosed on acid, I took 2 blotters and he took 1. We walked up to the bowling club and on the way he smoked a joint, but I decided to wait to see how hard the acid hit me first as I had only done it once before (1 blotter). We started playing pool downstairs at the club and after about 50mins I started to notice that I was getting worse. The finger marks on the table started to stand out more and swirl a little, the balls seem to be getting bigger and smaller, shadows were starting to move and I was finding it harder to concentrate on playing the actual shots.</p><p>My friend decided to go check bus times as we were going to go in town and check out the art gallery. Once he had left, I finally realised that I was fucked, because now I was alone and actually started to pay attention to what was going on around me. I was the only one downstairs at the time but as I looked around the room I realised that everything was alive. The walls were breathing, the patterns on the floor were swirling and morphing, the lights above the pools tables looked as if they were swinging and the room was getting lighter and darker. I sat there in amazement until my friend came back because the visuals in my first trip were pretty shit and I barely noticed them but that may have been because it was night.</p><p>We made our way to the bus stop about 30mins later (bout 2-2.5 hours after dosing) and we were fucked. I got a msg on my phone and the letters on the screen were waving and  dropping down into the lines below and it took me about 2 mins to read a 10 line msg. It took about 10mins to write back and Im pretty sure it made no sense at all. We sat in a school for a while because the bus still had 15mins til it arrived and we just marveled at all the sounds and sights of nature. Extreme confusion started to set in and Im amazed I even made it onto the bus, I remember walking up to the driver and him saying something but it sounded like complete gibberish so I eventually just handed him money and sat down. I dont remember getting off the bus but I remember walking down the street, Id walked down that street about 100 times before but nothing looked familiar and we werent even sure if we were going in the right direction.</p><p>Amazingly we made it to the art gallery and holy shit was I fucked; the art gallery is my new favorite place. We came on a good day, some guys collection was being shown and almost every painting was of a landscape or farm or just of the out doors. I walked up to the first painting and I couldnt believe my eyes, it was of hills, the sky, clouds, a house, trees and there was even horses. Immediately the clouds started to move across the sky, the sky started to change colour going from blue to green to purple to red etc, the house started growing and shrinking and the horses started galloping across the bottom on the painting. I swear I must have stood at this one painting for a about 15mins with my eyes the size of dinner plates and my mouth wide open only moving to giggle. I must have looked like a fucking retard but I didnt care, everyone could have seen me because it was so open but maybe I didnt look anything out of the ordinary, I just couldnt tell. We went upstairs and the whole place was just covered in photos, they were so bright and all of them moving in there own direction. We tried to watch this arty movie type thing but it was in this little room and the walls were freaking me out, moving in closer and closer so we ended up leaving after about 1 min.</p><p>We finally left the art gallery because we were starting to get a little paranoid that people were watching us. This was about maybe 4:30 now, we just totally had no idea what time it was. We started walking down the street trying to think of somewhere to go or something to do but neither of us could, our minds were completely blank. Then I remembered there was a museum down the road but it was a fair walk, my friend tried to explain something about a bus but his words came out jumbled and he made no sense at all. This is when the laughing started, we laughed none stop for about 15mins, we both had tears running down our faces, my side hurt so bad and I thought I was bleeding internally.</p><p>We started to walk past a park and spotted a bench, we both decided we needed to sit down. Still completely confused we just talked absolute shit and tried to think of something to do. We made some phone calls but no one could understand us and every time we tried to be serious we would start laughing hysterically. We then decided we had to do something and started walking across the park, all the trees branches were moving like crazy and the bark was changing colour and seemed to be eating itself. After about 30secs we needed to sit again and this went on for about an hour. Wed get up to move and then want to sit down straight after, it was a pretty big park and I think we sat on every bench in it. Every where I looked patterns were forming, the ground was doing completely crazy things and the cement path was swirling like crazy.</p><p>After about an hour and a half in the park it started to get dark and look like it was going to rain. I finally stopped fighting with myself and decided the weird feeling I had was actually hunger because I hadnt eaten all day. We started to make our way to a near by street that had heaps of shops when my friend decided it was time for another joint, I was still fucked so I passed. But while he was smoking it I was sitting down on this cement block, I looked down and the rocks in it were moving like crazy forming all sorts of patterns. I put my hand on it to touch them when all of a sudden I lost depth perception and it was 2D, my hand was flat on the cement, and the cement started to eat my hand, I couldnt see my hand anymore, just my arm connected to the cement block. All of a sudden I thought it started to rain because drops of colour started to appear on the cement, but when I finally realised I wasn't getting wet the whole cement block suddenly went that colour and new coloured dots started to appear until suddenly it changed again.</p><p>My friend finished his joint and we started walking again, almost at the shops we started crossing the road when my friend yells my name and pulls me backwards just as a car flies straight passed me, if the car was 2 secs earlier Im sure I would of been in hospital with some nasty injuries. We made it to pizza hut (my friend works there) and got a free pizza (super supreme). It was the most colorful pizza I had ever seen, all the toppings were moving in sync with each other and I think I stared at it for about 5 mins before I even started eating it. Eating felt really strange but good at the same time, I could feel the piece getting bigger and smaller in my fingers.</p><p>The sun was gone by the time we finished and so had the visuals and our happy giggling mood had changed as well. The sun definitely had something to do with this; its like darkness just totally killed the effects except for the confusion. We got a friend to cum pick us up and take us to a pub to meet some other friends. We played some more pool and had a beer or 2. I could notice small visuals when I paid attention to them, but I found it hard to pay attention to anything. After about 30 mins I felt totally straight again and decided to walk to my car back at my mates house (20 min walk) so that I could drive home and have a shower and get some more money so that I could come back out and continue to drink. I was walking by myself and I could start to feel slight affects again but nothing major, just weird shadows out the corner of my eyes and stuff. I finally made it to my car and got home with no trouble at all.[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I walked inside and talked to my mum for awhile, I was able to act totally straight and she had no idea. I got in the shower when all of a sudden I started to get visuals again, the tiles started moving and morphing and changing colour. I finished my shower and got out but was totally shocked when I noticed that my skin looked fluro green, and I didnt look like myself at all, this was kind of cool but didnt really bother me that much, though shaving while my face is bubbling is quite hard to do. I got dressed and headed over to a chick friend of mines house where a heap of my other friends were just chilling and drinking, I picked up a bottle of vodka and about 8 cans of red bull on the way. Vodka and red bulls one of my favorite drinks.</p><p>It was about 8 or 9 by the time I arrived and all my friends were pretty happy to see me and pretty interested in my bizarre day, many saying that theyd like to join me next time I trip. I got a few weird looks from the people that I hadnt met before while telling of my adventures but that could possibly be because I have 1 inch plugs in each ear, a 10 gauge ring through my septum, a ring through the side of my tongue and my lip pierced, and basically just look like a freak. I started drinking and while sitting noticed that the roof and top of the walls were still bubbling but slowly dying. By about half way through the bottle the visuals were pretty much dead unless I concentrated really hard. Possibly because of the alcohol I started to get heaps giggly again, laughing uncontrollably at just about anything, falling over onto the floor and finding it really hard to get back up, even thought I didnt really feel that drunk and the red bulls mad me feel right awake.</p><p>By the time I finished the bottle I was starting to get these really weird thoughts and just say completely random and stupid things. Not long after most people had either left or passed out but I was still wide awake and this is when things got kind of weird. I couldnt stop giggling, it hurt so bad but I just couldnt stop, nothing was funny and I felt really tired but still I couldnt stop. Then I started getting these strange thoughts and I seriously thought I was going crazy, every time I thought of something it would some how link to something else totally different and then that would link to something else and then I would start giggling and then another thought would pop into my head.</p><p>After about an hour of this I had convinced myself that I was going insane, I was talking to myself and I was really starting to scare my chick friend, she was almost in tears. But the thoughts just kept coming and I couldnt stop them. she made me a bed on the floor and told me to lay down, but I just laid there all night thinking to myself, I seriously thought I would need to be put in an institution, but strangely enough that didnt really bother me, I wasnt scared because somehow I knew I was just doing it to myself.</p><p>My friend the next day said that I kept repeating myself, saying things like 'Im gunna be crazy one day', 'One at a time, just one at a time' and 'Im doing it to myself'. I vaguely remember these things but not very well. I didnt get any sleep that night and I didnt really start to feel better until I saw the sun start coming up. I eventually got some sleep at about 3 that afternoon but only for like 2 hours and I felt like shit after wards. Its the day after now and I feel completely normal and looking back on my day/night I enjoyed every part of it, strangely enough even the part when I thought I was crazy.</p>"
}
