{
 "title": "Nothing Much",
 "author": "Aaron",
 "citation": "   Aaron. \"Nothing Much: experience with Melatonin, Vitamin B-6 & Tryptophan - 5-HTP (ID 43136)\". Erowid.org. Oct 29, 2006. erowid.org/exp/43136",
 "substance": "Melatonin, Vitamin B-6 & Tryptophan - 5-HTP",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "10 mg",
   "oral",
   "Vitamin B-6",
   "(pill / tablet)",
   " ",
   "100 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43136",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 29, 2006",
   "Views: 14178",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI took all of these at once around 9:30 pm. I had gotten 3 hours of sleep the night before and forced myself to stay awake all day because Ive been wanting to wake up in the morning. About 2 hours before I went to bed I ate a bit of orange chicken and fried rice along with a half a cup of this nasty sugar fried Caribu Coffee.\r\nI've been taking 100mg 5-htp regularly now to help both with sleep and depression. and I have noticed some subtle effects with absolutely no side effects the next morning. But usually a case of gut rut or so for most of the day, which is easily cured with a healthy breakfast and some green tea. I have read that 5-htp, depending on how much exposure to sunlight and darker areas I have, releases both serotonin and melatonin, however Im not sure which it produces more of.\r\nMelatonin Ive been taking on and off for a while. These tablets I have now come with several small white pills with 3mg melatonin and 10mg b6 per one dosage tablet. Now. Im not entirely sure weather melatonin actually does everything I read it did. By taking at the right time before bed, with the right dosage, it is said to 'quite easily help the body adjust to healthy sleeping patters with sound sleep and little or no side effects come morning time, and a typical dose being anywhere from 3-10mg'.  \r\nIn my previous experiences with taking this much melatonin (most of the time without 5-htp) I felt very groggy the next morning, a side effect compared to smoking heavy amounts of cannabis the night before, and usually lasting the better part of the day. I then cut the dose down to 1.5-2 grams and rarely noticed any adverse side effects come morning, and falling asleep was usually easier. Vivid dreams also were usually accompanied by taking any noticeable dosage of melatonin, but does not have any effect on being able to remember my dreams come morning time (and I have a huge problem with that most of the time, unless I awoke in the middle of a dream).  \r\nThis time with melatonin, it was the same as every other time really, and Im not sure if any of the side effects were intensified due to the 5-htp and or the caffeine I took the night before. \r\nT+0:00\r\nAn hour after ingestion I started to feel very relaxed and distant, sort of disconnected with my body (tripping over things a little more, zoning out etc). I then went to sleep due to the overwhelming drowsiness I felt. I have had a long history of sleep disorders and irregular sleep patterns that have not been diagnosed by any doctor what so ever. Some nights I sleep just fine, and other nights are hell and almost insomnia. I recall waking up at least 5 times throughout the entire night, which I believe is a typical thing for me to do. But the first time I woke up it wasnt until about 2am. After that it was every 1-2 hours until I finally decided to get up at 7am. I faintly recall having scattered, weird, vivid dreams, but I do not remember them at all.\r\nT+9:30\r\nAnd I feel extremely groggy, shitty, disconnected, the empty gut rut stomach feeling, and sort of a thin white haze over everything. near emotionless and not passionate whatsoever. these are typical symptoms for me when I wake up in the morning, but it is definitely more intensified with use of the melatonin. I have sort of bad allergies as well, and almost every morning I wake up with clogged sinus's and a headache. And I understand that may be more than allergies. Im going to go drink some tea, eat some breakfast, meditate and see if the side effects dissolve.\r\nT+11:30 \r\nFeeling much better after eating and taking vitamins, but I still feel some lingering effects, sorta spacey.\n\n\n"
}
