{
 "title": "Now Look at Me",
 "author": "James",
 "citation": "   James. \"Now Look at Me: experience with DXM with CPM & Various (ID 43151)\". Erowid.org. Sep 7, 2008. erowid.org/exp/43151",
 "substance": "DXM with CPM & Various",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "DXM",
   "(pill / tablet)",
   " ",
   "  repeated",
   " ",
   "Various",
   " "
  ]
 ],
 "footer": [
  [
   "2005",
   "43151",
   "Male",
   " ",
   "Not Given",
   "Sep 7, 2008",
   "11790",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] </p><p>I had first learned of coricidan from a friend of mine at school. I decided that one day I would get some coricidan cough and cold pills from my local grocery store and take them to school the next day and trip out with my friends. When I got home that night I was really bored and I was getting more and more curious about the effects of coricidan. Finally I gave in to my curiosity and opened up a box and downed 16 pills.</p><p>When I first started the trip I was a little scared because the only drugs Ive done before than was marijuana and morphine. As the trip got harder and harder I kept getting a little bit more and more scared. I was very agravated at the fact that I couldnt focus on the t.v. so I just turned it off put in some good techno music and flipped on the black light. Now that I was getting a little bit use to the high I decided to be a little daring and try some things to increase the fun and turned on the strobe light which just ended up throwing me into a deep deep state of confusion to the point where I didnt even know myself or why I was actually feeling that way.</p><p>The next day I could still feel some of the effects of the DXM which made me quite happy to tell you the truth. I was a little scared though because I had to drive about half an hour to get to school. I drove up the street about half a mile and decided I couldnt handle the drive so I drove down the road to a good friends house and I had her drive me to school. Once I got to school I took an additional 16 pills and passed out the other 6 boxes I had. Every one I gave the coricidan to freaked out and went home.</p><p>After school I had to deal with driving home, and I was at the peak of my high. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]Unfortunately I never made it out of the school parking lot before I got in an accidant because I was talking to my girlfriend in the passenger seat. My girlfriend is very anti-drug and has no idea Im under the influence. Instead of doing the sober thing and pulling over and trading information I decided to run from the scene. I drove up to the next light and my girlfriend started freaking out and made me go back so I did and now I have to pay a thousand dollars in damage. </p><p>Days and days go by and I keep ending up with more and more coricidan. I was tripping every day, until I had to go to MEPS (military entrance processing station). I was now officially apart of the U.S. army. After I returned from MEPS I made my first stop at a grocery store to pick up more ccc's.</p><p>Weeks went by with continual abuse of the drug my friends noticed a drastic change in my behaviors. The DXM made me extremely bipolar and deeply depressed. I hit a downfall when I decided to have an overnight get together with friends and we would all trip out on triple c's. I dont remeber exactly what happened but when I woke up the next morning I found many people to be mad at me. Eventually I realized I had lost all my friends due to my drug use. I broke down crying begging my friends for help I even confessed to my friends parents, my father, and even the youth pastor at my church. Later that night I went to my first N.A. (narcotics anomonyous) meeting, where I felt a drastic change and knew I would be able to quit without a problem.</p><p>The next morning I freaked out about the idea of being sober so in this five minute time period from when I woke up I decided to run away from home. I packed all my stuff into my car and I left. That night I slept in my car behind an old movie theatre downtown. I had a little brush with the cops because they thought I was trying to break in to my car and I was lucky enough that my dad didnt report the car stolen or me missing so I was free to go. The next day I pawned off my guitar amp and my keyboard and spent the rest of the day doing random drugs with a complete stranger. That night I drove for 2 hours to Gainsville where I snuck into my cousins house for the night. That weekend Ill never forget. I went to numerous parties and did so many drugs and mixed so many things that I have no idea how Im alive today. In those couple of days I grew a huge reputation for myself, half the city knew me by name. Monday night I stayed with a new friend at his place where I met his sister and her friend. I introduced the two girls to coricidan which I think they enjoyed as much as myself.</p><p>That night in all the confusion I raped the guys sister totally oblivious to what I was actually doing. The next day the police were at his door they took me away in handcuffs and took me to the police station where I was questioned for hours. Then they released me to my mom whom also lived in Gainsville. I continued doing the triple c's. I ran into the girls brother a couple of weeks later, he took me to an abandoned house where we smoked weed for hours and as we were getting ready to leave he kicked my ass till I was passed out and bleeding on the floor. I woke up a little later I was alone in middle of nowhere having to walk home. I now go to Gainsville high school where I ended up becoming popular in a matter of a day or two because of the reputation I had built around my self since coming to Gainsville. </p><p>I still continue to do coricidan despite the major damage Ive done to my mind and body. My father has disowned me and is trying everything to ruin my life. I got arrested for trying to steal ccc's from wal-mart. My mind is so fucked up Im to the point where I dont know if Im depressed, happy, or even insane. I keep a journal now just to keep myself from going completely nuts. I tried killing myself by overdosing on DXM I took 78 ccc's but I was fine, it was a hell of a trip though. I didnt feel like killing myself because I was depressed or anything but Im so lost right now I dont know what to do. The army has been searching for me for awhile now. I have like 20 messages on the phone from them. I was suppose to ship out for basic training 2 days ago. Im still in love with DXM but I wont let anyone else touch it if I can help it. I used to be a normal church going kid now look at me. Its fucked up.</p>"
}
