{
 "title": "Mellow Peace",
 "author": "Electric Shaman",
 "citation": "   Electric Shaman. \"Mellow Peace: experience with TMA-2 (ID 43164)\". Erowid.org. Aug 16, 2006. erowid.org/exp/43164",
 "substance": "TMA-2",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "TMA-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43164",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2006",
   "Views: 7319",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Around a month ago I received 100mg of tma-2. It was a light brown/tan color. This concerned me at first, but after seeing that the results of Shulgan's synthesis of tma-2 produced the same color, I was reassured.</p><p>I took 50mg on an empty stomach. The come on was slow, smooth, and subtle. I started to get a feeling like I was asleep and dreaming even though I was wide awake. This feeling persisted for most of the trip. I lay on a couch and started to have the most incredibly relaxing hallucinogenic experience I have ever had. First things started to look furry, an effect I usually associate with 2cb. Everything surface looked like it had hair coming off of it. </p><p>Around then is when I started to notice something else: my visuals were almost completely colorless. I'm used to psychedelics immersing me in a world of color, so it was quite novel to start to have visuals in black, white, and varying shades of grey. It was like watching a black and white movie.</p><p>As the trip became more intense, I became more and more relaxed. My mind did not race along like I am used to, rather it ambled along sideways to reality at it's own pace. I could have easily fallen asleep at the peak of the experience. OEVs where very similar to colorless 2cb, but there were also two dimensional geometric patterns that appeared to be around 5 feet in front of my face. </p><p>While I didn't spend as much time with my eyes closed as I should have, I noted that CEVs where detailed and easy to get immersed in. At one point during the trip, my roommate gave me a light show in a dark closet. I lost all sense of size and proportion. One second he seem miles away, the next second he was a giant towering over me.</p><p>Overall I enjoyed this substance a great deal. The entire trip lasted around 9 or 10 hours. It was very novel, quite different from most other hallucinogens.</p>"
}
