{
 "title": "Seratonin Escape",
 "author": "Madstonerfool",
 "citation": "   Madstonerfool. \"Seratonin Escape: experience with Paroxetine (Paxil) & DXM (ID 43192)\". Erowid.org. Sep 25, 2008. erowid.org/exp/43192",
 "substance": "Paroxetine (Paxil) & DXM",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Paroxetine",
   "(daily)",
   " ",
   "270 mg",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43192",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 25, 2008",
   "Views: 14401",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report documents my experiences with a small dose of dxm, standard dose of paxil (paroxetine), and a large dose of depression.  I am a typical 18 year old psyconaught and had been going to a job corps trade program for 2 months, in an attempt to obtain my high school diploma and a welding certification.  I was very motivated and ambitous about starting a good life, until I got terminated from the school (yesterday) for providing a less than perfect urinary analysis.  I was depressed despite my paxil perscription which was, most likely, the only thing that kept me from entering an oblivious depressed insanity.  I noticed that there is a drug interaction between paxil and Dextromethorphan;  being intelligent on the topic of chems I note that both chemicals vastly increase levels of seratonin.   </p><p>I am sitting home by myself the day after I am termed when I decided to eat 18 robo cough gels (dxm only).  Turned out to be 270mg of DXM.  I expected to have a siezure or have a repulsive, horrific seratonin syndrome experience.  But to my avail; I had a very euphoric, mind boggling rush of happiness much as marijuana gives you while on an SSRI like paxil.  It was as if everything was in it's place and I was making the best of my everything.  As I type this document 4 hours after the initial ingestion I am blatently striken by the ability to type while in this euphoric wormhole of dreams.   </p><p>T+ 4:05   I run to the window and stare in amazement and extreme interest as a tow truck rids our parking lot of a drunk womans car (whom I just remembered can find some high grade MJ in this god-forsaken town) just before returning to the computer to finish my experience report.</p><p>T+ 4:20   I would like to type more about my fading trip however I had a black out.  The last thing I remember is downing those lil red pills.</p><p>I had robotripped 11 times in the past, but never on paxil.  I give the combination a 9 (due to seratonin syndrom potential).</p><p>2 days later - for some valient, appreciative reason my depression seems to have been permenantly deleted scince the experience and I feel happy as I did before I even needed paxil!</p><p>I recomend paxil for anyone who is depressed -- paxil/DXM for anyone who wants a complete and utter seratonin excape.</p>"
}
