{
 "title": "A Sinuous River of Relaxation",
 "author": "BlindMind",
 "citation": "   BlindMind. \"A Sinuous River of Relaxation: experience with Alprazolam (Xanax), Cocaine & Cannabis (ID 43205)\". Erowid.org. Sep 7, 2008. erowid.org/exp/43205",
 "substance": "Alprazolam (Xanax), Cocaine & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "0.5 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43205",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 7, 2008",
   "Views: 17163",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDisclaimer: I am very very Xanax-dependant. Dicksizing aside, 4mg is a very large dose for a non-tolerant person, so be aware.\r\nI'd been coming down from a night out on the town in the pouring rain, riding the rails and softly listening to Medeski, Martin and Wood. I was crashing pretty terribly afterwards, and decided to soften the come-down with a four milligram adminstration (orally) of Xanax. \r\nT-0:45 Familiar radiating warmth, intense sedation, and mild euphoria. Like being quite stoned and very pleasurably drunk, but with all negative side effects removed. Setting into my quilt on the hot summer's night, I was able to have a very life changing conversation with a friend of mine, which I've saved for further inspection. Though I suspect the mixture of cocaine and xanax led me to being so open and the friend reciprocating, I give at least 90 percent credit to the xanax.\r\nAfter the duration of our talk, and leaving me in deep thought, I packed a larger-than normal bowl of high quality herb in a one hitter, taking two large tokes from the pipe before placing it down and exhaling.\r\nFreedom. The synergistic characteristics of many Benzodiazepines with Cannabis are undisputed, and for good reason: the feeling nearly mimics that of a blissful opioid-induced nod. Thoughts flow freely and unrestrictedly, allowing more room for interpretation of their meaning. They are rational thoughts, though absurd in basic nature occasionally. Some deep thinking is done, and the presence of the Third Eye was felt strongly.\r\nThe preparations for the rest of the night were then collected, including the standard mirror, flat dark surface, and baggie of fairly highly ranking blow: some stuff that'll make ya say 'ahhh,' at least. I popped in some of my very favorite comedy series' DVD's and watched jewish actors do a whole lotta nothing in complete and utter mentally gluttonous relaxation. I non-sexually carressed my body, and was surprised at the omnipresent tactile sensations of warmth and security upon contact with my own body. Halfway into the half-hour episoide, I decided to make my move, and extending the night a bit further. I cut two lines of the cocaine and snorted them, one line per nostril, having pre-hydrated masal cavities to prevent bleeding/excessive drying out of the nasal membranes.\r\nI watch Fear and Loathing in Las Vegas for kicks. By the time the movie had finished, I'd consumed two more bowls of cannabis and 6 lines of average quality cocaine. The Xanax mutes the euphoric effects of the cocaine somewhat, but also helps control heartbeat and created a pleasant ticklish feeling all throughout the body.\r\nI went to bed shortly thereafter.\n\n\n"
}
