{
 "title": "'Danger! Danger!'",
 "author": "Scumbag",
 "citation": "   Scumbag. \"'Danger! Danger!': experience with Mushrooms & Cannabis (ID 43209)\". Erowid.org. Sep 2, 2007. erowid.org/exp/43209",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Mushrooms",
   "(fresh)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "43209",
   "Male",
   " ",
   "Not Given",
   "Sep 2, 2007",
   "Views: 14532",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI would like to consider myself experienced with psychedelics, but this trip took me down a peg or two. A few years ago, my friends and I discovered a perfect mushroom pasture. We spent the summer raping the pasture. I say this because I now realize we were not showing the pasture or the mushrooms the respect they deserve. After a summer of hot nights eating shrooms, I thought we were pro's. I was wrong. </p><p>One night my friend Ebo and I decided to hit up the pasture. He set off, while I stayed with the truck. He returned with a couple of our friends that he ran into in the pasture. All three started handing me shrooms. Ebo had the unmistakable grin of a mushroom fiend. He had eaten his while still in the pasture. So we head back to Ebo's house. When we get there, I begin chowing down. I should probably mention that most of the shrooms I ate were naturally dried by the sun. I would estimate that I ate around 5-7 grams of dried shrooms and many, many fresh shrooms.</p><p>After I choked them down, it was time for bong hits.  Ebo reached his limit and began playing Killer Instinct on his snes. I continued hitting the bong and listened to Ebo giggle and ask 'Is the screen changing colors?' I took one more fat bongload and exhaled. Instantly, I start hearing strange noises from outside the window. I asked 'Do you hear noises?' I turned to see his reaction and was greeted with Ebo staring at me with a look of anxiety and terror. I suggested we go outside. Silently he stood up and walked to the door. </p><p>As we walked to the porch, I realized that the world had come alive with movement. The longer we sat and smoked cigarettes, the more menacing and distubing the visions became. This was also the first time I experienced auditory hallucinations. Ebo's cat, Squirrel, was meow-ing backwards. Everytime Sqirrel opened her mouth, an additional set of eyes would fall out. I payed it no mind and focused on the grass. It was full of shadow-like images and 2 dimensional creatures. I took a drag off of my cigarette and blew it at one of the creatures. The creature became a skull that started screaming 'Danger! Danger!' I heard this for the duration of the trip. And let me clarify. The sound of this was as if someone had a bullhorn in my ear screaming that shit. And if anyone has played Killer Instinct, they know the sound. We headed back inside.</p><p>I went to the guest room and tried to go to sleep. Not happening. My mind was filled with very detailed and, for some reason, vexing images. In retropect, the images were quite beautiful. I could not keep my eyes closed, and they finally popped open. The pitch black room began to fill with tiny points of green light. These lights came together to form what looked like a genie. I decided to find Ebo and some sanity. He was in the bathroom staring into the mirror. He told me the next day that all he could hear at that point was a million voices screaming in his ears. The normal mushroom body high had become a troublesome feeling in my chest.</p><p>I was convinced I was dying. I told Ebo I was considering calling an ambulance. He said,' No. We're okay. We're....' and he hit the floor. He jumped up with his eyes rolled into the back of his head and screeching like a monkey. I freaked out and dialed 911. I had a short conversation with the woman before Ebo snatched the phone out of my hand and hung it up. We incoherently argued for a while until the operator called back. She said she had dispatched an ambulance. Ebo told me to go wait for them on the porch. I slowly make my way down the hall. As I reach for the doorknob, I hear 'What's going on?' I turn to see Ebo's mom, a psychiatrist, standing there. She began to question me, and I tried to answer. All I could consentrate on was the outer three inches around her body. They were breaking off into squares, spreading out into the room, and then returning. </p><p>We waited on the porch as she counseled me. Suddenly, about 5 cop cars surrounded the house. The cops jumped out and charged at me screaming. I was finally loaded into the ambulance. It was full of activity. I saw my pennial eye floating around. I remember being angry that it wasn't attached to my body. We made it to the hospital, and my trip reached it's peak. My vision was segmented like an insect's. Out of 10-14 nurses, cops and other patients I came in contact with, I could only make out 2 or 3. And they were obscurred to the point that they didn't even look remotely human.</p><p>I began screaming 'Give me some fucking water! Give me some valiums! I just want to fucking sleep!' By this time my mom was there. I couldn't see her. I could just hear her cry. They gave me some sort of drip. I don't know what it was, but I began to come down. The trip returned to a recreational level, and I began laughing hysterically. They charged me $1,500 and sent me on my way. By this time Ebo was down the hall being examined. They were taking his temperature when he began to accuse them of 'stealing his spit'. But he was fine, as was I.</p><p>It was one of the most terrifying experiences of my life. I love mushrooms.</p>"
}
