{
 "title": "Woah, I Wonder if Curry Works Too?",
 "author": "Ricky Spice",
 "citation": "Citation:   Ricky Spice. \"Woah, I Wonder if Curry Works Too?: experience with Nutmeg (ID 43237)\". Erowid.org. Apr 14, 2006. erowid.org/exp/43237",
 "substance": "Nutmeg",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3 Tbsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43237",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 14, 2006",
   "Views: 40052",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAbout me: 30 yrs old.  5'10, 200 pounds.  Last smoked pot 8.5 years ago at which point I had done it for about 1.5 years and loved it but quit as my wife hated it.  To her all drugs are \r\nbad, yadda yadda.  So I became a health nut.\r\nLately I had been bored, uninspired and listening to way too much McKenna (hah, like one could) that I thought, fuck it, gotta get out of my head.  So I started reading up on trip reports on the net, even finding out that there is a store not too far from here where I can actually legally buy a lot of this stuff (Ayahuasca, Salvia, Syrian Rue, Organic morning glory seeds etc.) and an even closer store where I can buy... Nutmeg!  hah!  The reason I tried nutmeg was largely because one of the trip reports said the effects were mild and that his family couldn't tell he was stoned... and it is legal so if my wife busts me I can point to the illicit substance she has in the spice rack already.  I should have paid a little more attention to those reports that talk \r\nabout how long it lasts though as it sure lingers... hooboy.\r\nTimeline...\r\nFriday morning - had little sleep which for me is about six hours, feeling tired yet wired as adrenaline has kicked in where sleep did not.  I do go through patterns of sleeplessness, in fact one of things I did like reading in previous reports was the 16 hour nap pay off at the end! 8) Still waiting for that one...\r\nFriday 5pm - had been rereading trip reports etc. off and on at work during the day.  Stopped and scratched my head when I got to nutmeg... (the 'nutmeg'?) and thought, fuck it, try it.  \r\nSo I skip out the last twenty minutes at work and go to the yuppie food store down the street.  I figure the spice will be fresher there... no idea if it was.  Just a big old bag for $4.50.  So I also bought a big 1.5 liter bottle of water.  Outside of the store I sat down at a table, pulled out the nutmeg, a spoon I borrowed from work and proceeded to shove a big ass table spoon of Grandma's Finest Nutmeg into my mouth.  Then I just pushed it back with about half a liter of water.  Gargle, rinse, repeat.  That was easy.  I have no idea why people bitch about this part, it isn't bad at all if you just chase it down with lots of water.\r\n10pm, 5 hours passed.  Watching TV feeling barely nothing at all, just feel tired from lack of sleep I figure.  Decided to watch a movie, it may still kick in as I read it can take 1-5 hours. \r\nAt this point I am feeling a bit weird but still nothing too heavy.  Part way into the flick I have a moment of impatience and think, fuck it, shovel another tablespoon.  Not sure if this was a good idea or not but what the hell, why just get mildly fucked up if tomorrow may be a write-off anyway?  By the end of the movie I am... how you say? waaaay stoned.  \r\nIt is quite different than weed or alcohol for sure.  The strangest thing is that I could speak just fine to my wife and it didn't seem to effect my coordination at all.  So anyway, I finished the movie (which probably was way more fantastic to me than had I seen it while straight) and even though I was messed up went to bed at around 1am when the movie was done.  Anyway, little sleep was done...\r\nNutmeg is categorized as a 'deleriant' which I think sounds like an appropriate word as it really reminds me of when I have had a high fever without any intense fear and dread though.  It was not like the hallucinogenic aspects of weed in which there is an overarching silliness or absurdity to it.  The same sort of 'concept fuckery' happened to me but not as surreal.   It was more like my thought patterns and opinions where simply scrambled.  Either that or my subconscious pushed a little closer to my conscious mind?  perhaps I am reaching though and that \r\nmay be asking too much of kitchen spice...  \r\nWhile it did get uncomfortable at points (which weed never did for me) at the same time it is like weed in that the 'brain food' factor seemed high.  At one point I thought I should get up and write as ideas and concepts really seemed to flow.  It totally tweaked my imagination.  I never felt nauseous but I could totally feel my guts processing this material.  Churning quite hard in fact.  \r\nSaturday 11am - managed to get a couple hours of what I assumed was sleep... here is where things got interesting.  I awoke quite physically weak and relaxed yet mentally wired.  I sat down at the table with my wife and we had a fantastic conversation about metaphysics and life in general.  I could not help but intimately feel her point of view and certain topics that we had previously got into 'unwanted heated debates' over merely flowed.  It was so nice to experience this as it reminded me of how I can communicate better if I just relax and let my guard down.  \r\nAt one point we were on the floor with a blanket just playing like a couple of kids, playing and snuggling.  it was really nice.  All the while I am feeling stoned out of my tree realizing that I need to work on the defensive part of my ego.\r\n2pm - went for a nap.  We had made plans to go to some friends that night at 6:30pm and while I would have normally been a bit uptight about it due to the lack of sleep my head was all doughy and I just knew things would be fine based on how I felt earlier with my wife.\r\n5:30pm - 'woke up' I put big quotes on that as I do not think I really slept so much as I meditated in bed while stoned and time passed me by.  Washed up etc. Waiting for my wife getting ready... 6:30 we are running late.  I hate being late for friends and normally I get really bitchy at this point and start grumbling and barking.  Well I felt a bit snagged and miffed but it was really easy for me to just stay composed and tell my wife, no big deal.  In the end we were late but at least we didn't get in a fight over it beforehand and make the evening difficult.  So again, nutmeg leads to marital bliss.  ;)  \r\n7pm - anyway, arrived and spent three hours there.  Just us and the other couple.  I was more chatty and relaxed than usual.  We all had a lot of laughs and I felt really great about myself and everyone there.  This couple had very recently gone through a rough time due to a personal tragedy and I was glad that we could be there for them and that I was relaxed and aloof rather than too serious and analytical.  In hindsight, my doing this spice this weekend was a bit of a dub risk but it worked out well.\r\nAs for general sensations while we were there the music in the background was very hard to focus on and the vocals, rhythm etc. just blended into a big audio soup, which is what always happened on weed.  Individual voices of the people in the room though were crystal clear and I could make out concepts really well, often seeing visual metaphors in my imagination.  As a side note this couple has a pair of heavy accents that are usually difficult for me to fully make out but being in my current understanding mindset it wasn't a problem at all.  It got me thinking that maybe lack of linguistic understanding often comes from our preconceptions of what we feel the package is delivering.  In this case an accent is how words look... sort of like \r\nhow food tastes or a face looks... \r\nThe conversation was great and just flowed, as I mentioned before all of my defenses were down and I just took everything as it came.  I was pretty tired and we left at about 10pm, had a lovely talk/walk home in the dark and the rain.  Hit the pillow at about 11pm, so bagged and tired and relaxed.  \r\nSunday 9am - woke up with some sharp stomach pangs.  Nothing a trip to the washroom didn't fix as I took el grande dumpo and felt find.  I had just slept 10 solid hours without interruption (rare for me, very rare) and feel a bit tiny stoned but mostly tired at the moment. \r\nSunday 11:23 am -  just wrote this line.\r\nSo all in all.  It has now been close to 42 hours and it is tapering away fast.   One more sleep and I am sure it is fully over.  Glad I did it but doubt I will do it again.  What I liked about it is the very covert nature of it.  No way I could have been productive at work but for the weekend I could remain composed with those who were not on it and had no idea I was.  It was like having an overactive subprocess in my mind running really fast that took up lots of mental bandwidth and somehow busy-ed up a part of the ego that enabled me to just sort of float through the day relating to others and totaly enjoying their company.  The only thing I didn't like was the physical weakness but at the same time I think that is an important part of the experience, at least for me it was in that I think it makes you feel a little helpless which helps melt away boundariess.\n\n\n"
}