{
 "title": "Not What I Expected in the Least",
 "author": "Funny duck",
 "citation": "   Funny duck. \"Not What I Expected in the Least: experience with Hydrocodone (ID 43248)\". Erowid.org. Apr 11, 2007. erowid.org/exp/43248",
 "substance": "Hydrocodone",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 0:30",
   "40 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43248",
   "Female",
   " ",
   "Not Given",
   "Apr 11, 2007",
   "29880",
   " "
  ]
 ],
 "report": "<p>I'd been told that hydrocodone was fun to take because it gave you a nice, loose feeling that typically lasted a pretty good amout of time. So, when my friend was perscribed a 2 bottles of 60 pills each I decided that I should ask for a few. I was visited my friend and I asked If I could have one and he agreed. I took the first one without much effect after about 30 min. I then took 2 more and began, almost intstantly to feel some results.</p><p>For about the first 5-10 min. I felt giddy, looser, and everything sounded somewhat muffled. Soon after that I started to become quite dizzy so I layed down. The lights were bothering me so we turned them off and the my nausea set in. I got very hot and my face was very, very clammy. I was so hot and disoriented that I turned up the air conditioning to about 60-55 degrees and layed on the floor with my face positioned directly over the air vent. I found that helped my nausea some. It had been 1-2 hours after original dosage and I became very tired. My friend had been watching all of this and so he of course tried to keep me awake because we both knew that if I was to sleep that there was chance of me going into a comotose state.</p><p>I couldn't walk so he helped my outside thinking that if I had a cigarette that it might wake me up some. DO NOT think that! Two hits of the cigarette and I instantly started to dry heave intensively. I hadn't had anything to eat all day so I was wretching stomach acid. It was horrible! After throwing up the symptoms became to fade somewhat. After about another hour they were mostly gone so I decided to have another cigarette, of course that was a dumb move. All the symptoms came back and that lasted about half an hour.</p><p>After that experience I don't want to ever dabble with perscription that I don't know the effects of yet. I guess I learned my lesson.</p>"
}
