{
 "title": "Crushing Light",
 "author": "Rafterman",
 "citation": "   Rafterman. \"Crushing Light: experience with Salvia divinorum (ID 4329)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4329",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4329",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 24, 2001",
   "Views: 6813",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI read all the experience reports here and other places and decided I'd like to try this legal drug. So I ordered the 5x. I first loaded my pipe with about .05 grams and inhaled the smoke in two hits. I felt a little dizziness and just a general weirdness. I figured I hadn't held in the smoke long enough. </p><p>So about 1 hour later I tried again with .08 grams or so. I smoked the first hit and held it for about 30 seconds then the second for about 20. As I exhaled I suddenly found myself standing up. It felt as though I was being forced backwards but I was stuck. It was almost like I lost the third dimension for a while and was stuck on a plane. This is a terrible feeling and I feared that I would be stuck like this. I tried to move, but I could not, then I remembered that I had just done a drug. So I forced myself to move. I then looked towards my two buddies and tried to stop them from smoking any. I never wanted that experience again. I realized that it was light that was pushing me, and the light bouncing off my friends bodies was smashing into me. The stereo was playing Start Me Up and singing about 'you make an old man cry' and I suddenly thought 'I'm the old man' and I blurted it out. It was as though I was trying to remember who I was. I was glad it was short lived because I was shocked by the power of this drug. I smoked once more later in the night and had a much better trip but still the feeling of being smashed.</p><p>I think salvia is a great introspective drug. But be prepared for the possibility of a strange smashing feeling. It is quite different from any other drug I've ever experienced.</p>"
}
