{
 "title": "Spiraling From Death To Life",
 "author": "Hazzy",
 "citation": "   Hazzy. \"Spiraling From Death To Life: experience with Mushrooms (ID 43300)\". Erowid.org. Jul 17, 2005. erowid.org/exp/43300",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "0.125 oz",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 43300",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 17, 2005",
   "Views: 3265",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, I finally had a truly bad trip from shrooms, and it may mean the end of my use of hallucinogens.</p><p>About a week ago me and a buddy went to the Aquarium in Monterey to see the Great White (first great white shark to ever be held in captivity and not die after a few days) they have there, and we decided to shroom...so we went to a burrito place, made our own 'custom' burritos, and digged in before going.</p><p>Now let me tell you...the aquarium is SHROOM HEAVEN. Everything is glowing and is light by shades of blue or green..there are trippy lights and signs everywhere, and the exhibits are really dark, so these stand out alot. Not to mention all the crazy sea creatures, especially the Jelly Fish. What a trip! </p><p>We went into the room with the giant tank, and lights began to flicker out of the corner of my eye, and that's when I knew I had started to trip. The room had WAY too many people in it, so we wondered off to the Jelly exhibit and watched these things...it was friggin amazing...just watching them glow and move....wow...</p><p>Anyways, I gradually began to feel uncomfortable, kind of feverish and pent up, so I went up to the very top deck and looked out over the bay....the sky was overcast with rain clouds and a swift breeze, so it was truly beautiful...one of those 'awe trips' I talked about earlier....</p><p>Anyways, after screwing around at the aquarium, looking at stuff, running around and laughing, the place closed and we left for home...it had starteed raining so we ran to the car and headed out. As soon as I got into the car, I began to have a really bad trip. I felt shitty...feverish, sick, lost...and it just got worse as we went on. I was sitting in the back, while my buddy and my brother were in the front...so as they talked, I just stared off down the road in front of us, and my mind began to darken. and wander.</p><p>Suddenly, I found myself focused on a single idea: death. I remember thinking about our culture and life, and realizing that death is the one thing that is truly unexplainable, the one thing that artists and other people don't 'go over'. I realized that I could die at ANY MOMENT, and I remember the question 'what about death?' kept moving through my head, and I imagined what it would be like to die. BIG MISTAKE. The shrooms fed off of my thoughts, and seemed to react with them. My world started to darken as I imagined this death, and I became COMPLETELY afraid...more afraid than I have been in my entire life. I started shaking and tried to pull myself away from these thoughts, but it was too late...I was fully entrenched in a bad trip. </p><p>The next few hours can only be described as hell. Pure hell. I have never felt this way in my entire life, and it was the worst feeling ever. I have been to hell and back, and I can barely describe it. ALL happiness was taken from me...all of it. </p><p>Happiness in life is measured in the values which we hold dear, correct? This means family, friends, hobbies, the world around us, everything that is positive in our lives that drives us to keep on living. Well all these things, everything that gave me a reason to live, were RIPPED from me. They were taken away, and I could not find the reasons why I was living. I believe I felt the purest form of despair...I was feeling horrible physically, emotionally, and mentally, and I was depressed to an extreme I have never felt before...I was trapped in this hellish spiral, falling down down down to a bottomless abyss from which I couldn't escape.</p><p>Funny enough, all this took place back at my parents house, which is a very positive environment for me. I have a very close and loving family, and when we all get together for the holidays, it's always a pleasure. My brother was around and so were my parents. I actually had to sit at the same table and eat dinner with them while trying to act sober during this horrible trip. Maybe it was partially because I had to hide the fact that I was tripping that my trip became so horrible...I don't really know...</p><p>I felt like a little kid again...I was helpless, and all I wanted to do was tell them what had gone on that night, so that somebody would comfort me, so that somebody would tell me everything would be okay...that my life was full of wonderful things and that no drug could take away these things. But I couldn't. I realized that now that I'm an adult, this was something I had to conquer myself, an experience which I had to survive and learn from on my own.</p><p>I couldn't talk to my brother about it...he was completely sober and playing video games..I tried calling friends, but I couldn't even say anything to them....I told my parents I felt crappy and went to my old room and laid down in the dark. I don't know how long I lay on my bed, but it was probably at the worst part of the trip. I would lay there, kicking and punching the bed and gripping the sheets with white knuckles as the emotional, mental, and physical pain swept over me. I cried for the first time in many, many years, and I didn't even know why I was crying. I had nothing. NOTHING. I had no identity, no family, no friends...there was no good in the world, no good in my life, only darkness and emptiness. I can't express to any of you in any sort of language the extent of this feeling, nor can I express how terrible it really was. I doubt many have felt this pure feeling of despair before, and I hope that none do in the future.</p><p>Eventually I made it through after a shower and some tea...and I felt.....very strange. I felt as if I had survived a disaster...like I had died and been reborn. As I came down from the trip, all the values in my life gradually began to be restored, but these values were now much higher than they were before the trip. Maybe it was because I had a whole new appreciation for them. Anyways, I felt sooo relieved, and had a great talk with my mom about things I had been wanting to talk about, (family junk) and with my brother. It was like I was finally doing the things I always wanted to do, because I had a sort of near death experience. I felt a new found love for life and everything in it, as well a whole new appreciation for my own life.</p><p>I realized that life, as well as intelligence, is a gift, and that many have not had the chance to live out their lives as I am able to (tsunami, etc.) So a new feeling of 'live like there's no tomorrow' came to me..most likely linked to my scary 'death trip'.</p><p>It was definitely a learning experience, and I did find a new appreciation for life...but it was NOT worth it. It was the single worst feeling I have EVER felt in my entire life, one of the worst experiences. I don't know if I'll try shrooms again...maybe in the right time in the right place....don't know.....</p>"
}
