{
 "title": "Layer Processing",
 "author": "Epstein",
 "citation": " Epstein. \"Layer Processing: experience with Mushrooms - P. mexicana (ID 43357)\". Erowid.org. Sep 28, 2007. erowid.org/exp/43357",
 "substance": "Mushrooms - P. mexicana",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.3 g",
   "oral",
   "Mushrooms - P. mexicana",
   "(plant material)",
   " T+ 1:00",
   "3.3 g",
   "oral",
   "Mushrooms - P. mexicana",
   "(plant material)",
   " T+ 2:00",
   "3.3 g",
   "oral",
   "Mushrooms - P. mexicana",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43357",
   "Male",
   "",
   "Not Given",
   "Sep 28, 2007",
   "6826",
   " "
  ]
 ],
 "report": "<p>I began the day with a light breakfast and skipped lunch so there wouldnt be too much in my stomach to soften the effects. Then just before taking the truffles I had a small snack to get the juices going. In the morning I had spent a small time meditating in silence in my room, maybe ten/fifteen munites. Just clearing my mind, calming my body. We had just over 30 grams between three of us and we divided it up fairly roughly. We didnt eat them all at once. We each ate our ten grams in three portions with about an hours gap in between. In my experience this makes coming up far more relaxed and increases the duration of the trip.</p><p>After about an hour I just seemed to relax completely in to the big black leather armchair I was sitting in, comfortably numb and drowsy. The other two where like cut-out figures to my left and right, I was unable to talk or relate to any conversation for some time and any attempt interact ended before it had started with manic giggling. This seemed to be affecting Kelly as well while Chris in his camping chair slipped in to silence. It felt like the trip was coming in waves, each stronger than the last, each taking me to a new unexplored level. I tried to relax, avoid panic and let the waves wash over me. For the best experience I find it is best to stay calm and still and meditate while coming up.</p><p>After watching TV for a bit I looked around the room and was suddenly jerked awake, I felt vibrant, alive and aware of my entire physical body. The friction of blood in my veins, the movement of my diaphragm, the tensing of muscles, the clenching of my heart. I looked down at my hands and was acutely aware of the bones within, I could feel the flesh sliding over the bone internally while my normal sense of external touch was reduced so every thing felt like cold chrome. Moving my hands became a beautiful ballet of stretching sinew and the movement left a purple trail in the air. Amazing.</p><p>I was aware that Kelly and Chris were talking but was completely absorbed in myself. Closed eye visuals were crowding in. fractal shapes in cool blues and violets emerging from the horizon point and drifting towards and past my vision. The most vivid of these was four liner fractals that emerged from each corner of my vision. They moved in creating a square and then each line exploded out into a wing shape of misty blue. The whole structure of four transparent intersecting wings rotated and then sped past me. </p><p>I opened my eyes and laughed, Kelly said I had been muttering to myself and was laughing.  Colours in the room were ecstatic, like vibrant paint with no shading between light and dark areas. Like drippy cell shading. We all started talking and during the conversation I found I could shift between the layers my mind was processing. To explain; there was the layer of the conversation, the layer of my own train of thought (completely unrelated to the conversation), and the layer of my physical bodily processes. I could completely immerse myself in any of these forgetting the other two but when I returned to the conversation layer I knew exactly what had been said. Of course I had been listening all along but it was like I was a little man looking at the workings of my mind from an objective point of view only seeing one operation at a time.</p><p>Suddenly we all entered a very active phase, we sprung to our feet and began to explore the room. I felt springy and soft and perspective became very distorted. Whereas before, when we were coming up, we were on different planes, now we came together, started to explain how we were seeing things and it rely felt like our minds were connected. We were finishing each others sentences.</p><p>Chris mentioned the clutter on the floor and it became a tiny city environment. We all put our heads to the floor and explored the juice cartons, plates, boxes, magazines and musical instruments as if we were tiny, inch high, people. The room really was a playground and we were tiny children seeing it all for the first time.</p><p>We started to talk about the notion of all we are experiencing at a given point being all of our reality. This seemed to make Kelly nervous and when Chris mentioned going down stairs she froze up, afraid of the corridor outside. For her it had become a void because she couldnt see it at that point, then when we opened the door she said it looked like something out of a horror movie. Blood stained walls and peeling paper. She talked of a terrible sense of foreboding.</p><p>Me and Chris couldnt understand this and I tried to talk her out of it. I was still in a euphoric state, and I said Being afraid of an empty corridor is as absurd as being afraid of an inanimate object like a cheesecake! but even as I said this I began to feel uneasy looking at the expression of fear on Kellys face. The prospect of being afraid of a cheesecake seemed more and more like a genuine possibility. So much so that when Chris picked it up and jokingly thrust it towards my face a jarring spike of physical terror shot through my heart. It was there for a split second and was gone. I remember thinking how absurd this was at the time but the feeling was still very real.</p><p>All this time everything felt dreamy and unreal and I remember looking in the bathroom mirror and seeing my face In vivid contrasting colours like clown make up. My features were hilariously distorted and I didnt recognise myself at all. At one point gravity left all of us completely at the same time. The wall was the floor then the ceiling was the floor, it felt like we were stuck on the ceiling and I remember looking DOWN at the light shade. Unsettling. </p><p>At the peak of my trip I stood up and leant on the wall, pushing my fingertips into it. My core was vibrating, my fingers were buzzing and I felt the same vibration pouring out of the wall, the room, everything. I lost my physical self, normal senses left me for a second and I rolled along the wall and into the corner of the room laughing ecstatically. I was overwhelmed by the profound feeling of being the wall, of the wall being me, of me being everything, and everything being connected by this vibration. I was feeling with a non physical sense. Not touch, taste, or even sight. I felt my sphere of existence in its simplest and most profound state, without ego, without a centre. I could not be afraid because I was no more. My friends were distant shapes looking at me, I knew they were people but I wasn't one of them. As this passed my memories flooded back like warm water. My self retuned to me.</p>"
}
