{
 "title": "Deep Sleep",
 "author": "hangoverish",
 "citation": "   hangoverish. \"Deep Sleep: experience with H.B. Woodrose Seeds (ID 4337)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4337",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "Dimenhydrinate",
   "  T+ 0:30",
   "7 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "2000",
   "4337",
   "Male",
   " ",
   "Not Given",
   "Dec 24, 2001",
   "11053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA few weeks ago, I had ordered 200 hawaiian baby woodrose seeds from a seed company.  They turned out to be old, though they still germinated.</p><p>I ate ten the first time, crushed in water. No effects. The next day I took 30. No effects. No nausea. No nothing. A week later I ate 75 in about ten minutes. Just chewed them up really well and swallowed, no other prep. Nothing again. </p><p>So I decided that I should get some from a different source.  I ordered some from an individual in Hawaii who had just harvested them himself. Fresh, guaranteed.</p><p>So yesterday I woke up at 6:30 feeling very well rested, and took 2 dramamine. Then at 7:00, I ate 7 seeds. Just like before, I chewed them up, coating and all, and swallowed.</p><p>I felt a little sick in the stomach by 8:00. Took a shower... had to sit down, I felt pretty sick when I stood up.</p><p>Around 9:15 or so, I felt even more sick to my stomach. Though I never really felt like I had to vomit. I sat on the couch with a blanket around me. Fell asleep in seconds. I had very vivid dreams for the next 5 or 6 hours. I would wake up every hour or so, but felt so groggy that I didn't even move, and just fell back asleep sitting up. The phone rang a few times, but I had no desire to answer it. I didn't even attempt to get up. </p><p>I really didn't have any kind of 'trip' feeling at all.</p><p>I had to work at 3:45, so at 3:30 I got up, pissed, ate a sandwich, and went out to my car. I felt very dizzy, and had a bit of trouble judging distances. Luckily, it only takes me 2 minutes to drive to work. I would have walked, but it was December.</p><p>I felt like I had a severe hangover until about 7:30. Disoriented, dizzy, slightly blurry vision, a bit sick to my stomach.</p><p>I just scraped the fuzzy coating off of 10 seeds and crushed them. I'm going to put them in a glass of water before bed and drink it first thing in the morning with a caffeine pill... maybe that will offset the sleepiness I experienced.</p>"
}
