{
 "title": "Wonder Wolf",
 "author": "Lugarsh",
 "citation": "   Lugarsh. \"Wonder Wolf: experience with LSD & Cannabis (ID 43381)\". Erowid.org. Sep 8, 2008. erowid.org/exp/43381",
 "substance": "LSD & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43381",
   "Male",
   " ",
   "Not Given",
   "Sep 8, 2008",
   "Views: 3256",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm 17 years old. The night started off with my friends and I driving around trying to get a hold of some dank herb. We finally got a hold of our friends dealer, and we headed over to his place. My mindset was pretty good I was having a good time with my friends just being sober.</p><p>When we got to the house I discovered I could get a hold of some good acid from California. My previous experience with acid happened a year before this when I was in trouble with my parents because they found out I smoked pot often. I felt that before I got in trouble with my rents that I was very carefree and I felt that karma would keep me safe. I generally had a blast with life. After they discovered that though there whole demeaner towards me changed, and they made me feel like constant shit and I resent them still for this.</p><p>Anyway I dropped 3 hits of potent cid and had a bad experience at this crappy punk show and I was being picked up early by my dad and all my siblings where home and I just panicked. I remember seeing huge crowds of people everywhere in the show parking lot, but there was really no one. It got hard to breath and my throat went completely dry. It wasnt fun. So during the next year I smoked a whole lot of really good pot all the time. When Id stopped Id think way too much about things that where negative in my life with my family, and pot could take me from complete rage to calm and laughing in a few minutes so of course I did it all the time. But during this time I started feeling like my life was grey and dull.</p><p>So back to this great night. I dropped 2 hits of this good buddha print acid at about 6:30pm and it felt like I could feel it almost immediately. I drove with my friends S and M to Ks house which was our party headquarters. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] While leaving the neighborhood I saw the middle lines of the road raise up like a barrier, but I dismissed it as visuals and drove to Ks house. When we got there we decided I should take S to get his car so he could be our non tripping ride for the meantime before he dropped later that night. While driving him to his place I started seeing the rearlights on the cars in front of me starting to pulse and move around and the other city lights where radiant. I wanted to hurry and get back before I started frying harder. </p><p>When we got back to K's place. We smoked some dank herb. S drove us all downtown so we could hang out by the riverfront. The drive was great I was looking at all the lights and I was moving all over the seat like a child. K, M, and I went to hang out by the river, while A and S, the 2 non tripping people, went into this cool art gallery/live music restaurant. So the trippers are having a great time, we see this boat go by and we start running along with it laughing like kids. We must of looked crazy to onlookers.</p><p>We went to join A and S in the art gallery part of this place.  We hung out there and K and I spent a long time talking about this impressionist painting of some flowers. Every different color was flowing and radiant. On the way Back to Ks house I remember looking at this light post and it just smeared all across the sky, as we drove past. </p><p>Now for some reason S was being sort of an asshole by the time we got back to K's house. I guess he was tired of being around goofy people on acid and he was giving us all really bad vibes. He sometimes get absorbed in his own reality and isnt very considerate of other people. He left after awhile to R's house. I started frying super hard and I just got lost in my reflection in this standup mirror. I looked hollow and full of darkness. K realized what was happening and jumped in front of me saved me from that eternal dark stare.</p><p>I packed a bowl and passed it around and when it got back to me I'd forgotten I passed it in the first place and I would zone out super hard into oblivion. At this time I recognized I was thinking way too hard about how I would get home. I lost my keys but I found them later, it turns out I just put them on the table. I was starting to have a bad trip again. So I got up and started dancing to the song Touch Me by The Doors. I was bouncing off the wall and it felt like every time I'd rock my head shocks of glorious light would go thru the darkness in my body. Then the most amazing thing happened, I took everything I hated about myself (the darkness) and crumbled it up in a ball and threw it away. I also turned around that gay mirror so I wouldnt get lost in it. </p><p>I went into Ks mom's room and sat on her bed which has these white curtains draped over the bedpost and I was watching this screensaver of this nature scene. I then transended into this amazing forest of that had this peaceful river and I felt my energy flowing with this river. I believe that religion and spirituality tries to tap into this mystic energy and I was so overjoyed with happiness.</p><p>Then one of Ks cats walked up to me and it morphed to a giant wolf that came up to me to guide me. It was the most amazing thing, I now consider the wolf my spirit animal. I was also now having these closed eyed visuals that were like paintings by Alex Grey. I would also see thousands of geometric shapes floating around and melting into one another only to have more melt out of this shape and spin around. When I opened my eyes Id see shapes floating around like those in the music video to the flaming lips song 'Do you realize'. M and K walked in on me and I was in this calm meditation pose (funny that it was buddha print) and I told them about my experience. I had this really enlightening conversation with K, and she looked so amazing and joyful.  This all happened around 9:30.</p><p>The rest of the night was fun, I felt like I'd accomplished in losing a whole lot of mental baggage that night. Another friend stopped by and I just gave her some cid because I felt like everyone should experience this. I went home around 12:00 after Id mostly stopped frying. Once in my room I smoked a nice big bowl and my walls started spinning around in a beautiful kaleidoscope manner. I went to sleep about 2 hours later.</p><p>The next week or so I was in a really great mood. The day after I smoked all day with my good friends R and S and Id start seeing stuff again. It was mindblowing. I wish I could remember every single detail about it.</p>"
}
