{
 "title": "Alone in Vondelpark",
 "author": "Jesse",
 "citation": "   Jesse. \"Alone in Vondelpark: experience with Mushrooms (ID 43396)\". Erowid.org. Sep 2, 2007. erowid.org/exp/43396",
 "substance": "Mushrooms",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "10 caps",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43396",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 2, 2007",
   "Views: 3393",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It's really quite hard to describe the feeling and experience on the fateful Friday afternoon I first tripped, but it's like a sort of catharsis to help figure out just exactly what happened.  Let me set up the context for the trip before I describe the subsequent events.  I was in Amsterdam for the weekend with 5 girls and we had begun our day with a traditional Amsterdam pastime, smoking, smoking and more smoking.  I decided that since the girls only wanted to do mushroom tea, which I would later find out is hard to come by in the 'dam and I didn't want to buy one of those cheap shitty tea packets, that I would buy a pack of fresh Thai shrooms.</p><p>This was at 1 o'clock or so in the afternoon, just after a joint session at a local coffeeshop.  At five or so, I decided it would be a good time to eat the shrooms and go walk around Vondelpark and just see what the upcoming hours would hold in store.  I'd say it was about a half-hour when I started to notice the effects of the shrooms.  The first thing I noticed is of this sort of bar/restaurant in Vondelpark, which, at the time (on a nice spring day) was quite crowded.  At first, I wasn't going to go in but after slowly approaching the place it seemed like a crazy location to enter.</p><p>The patrons seemed as though they were wild and louder than I had ever heard humans before.  The building itself had a weird green tint to it that reminded me of a forboding lighthouse.  What happens next is very, very odd.  I continued the walk through Vondelpark and the trees started to change colors.  It was as though they were trying to speak to me.  Each one possessed a different set of colors that was exagerated by the shrooms.  I remember one particular tree that struck me as being quite strange.  It's leaves dangled and all I could see of the tree was this red, light green, and orange-ish tint.  Yet, it was as though at that point I had never seen a tree with such vibrant colors.  That was the peaceful part of the trip.  </p><p>Eventually, I made my way out of the park.  At this point I was aimlessly wandering, having no idea in which direction, and I began to feel a fear slowly rising within my conscious about finding my way back to the hotel which I was staying.  In fact, I couldn't stop thinking of this, it dominated my thoughts and I felt that if I did not get back home, I was somehow a failure and that great evil awaited me, whether in the city or within my own mind, if I failed to return.  Somewhat miraculously I mananged to push on in the journey, convincing myself that maybe food would help take my mind off of the returning to the hotel obsession.</p><p>This began the most intense part of the trip, probably just over an hour or hour and a half after intitial consumption.  I ended up in a kebab joint where even upon entering felt strange.  I set my coat and book down and immediately my head pounded.  The strangest sound kept repeating itself in my mind, this sort of slow and methodic humming.  It's a very hard sound to describe, but the closest thing I can think of is a buzzing power line or electrical line.  I thought maybe going into the bathroom would help cleanse myself of the current condition, but there I felf vast feelings of chlostropobia and the white walls reminded me of solitary confinement.</p><p>Realizing that I had not even placed an order yet, I staggered up to the counter and saw an Arab clerk.  I told him that I wanted a kebab sandwich and this seemed okay and everything was normal at this exact point in time.  However, I went to sit back down in my seat and the humming noise began again and I became very disturbed by how long the food was taking, albeit it was probably the vast distortion of time.  Also the mirror behind the counter was absolutely fucking with my mind.  I couldn't see myself as I was seated and the mirror was above the level of my head, but I could see everything behind me which included the entryway to the restaurant and the street in which it was on.</p><p>Then the most worrysome part of the trip occured.  After receiving my food, I started to hallucinate.  I saw the man that took my order back in the kitchen talking to other employees, I could have sworn at the time I saw and could hear continual laughter from the kitchen area.  He would occasionaly look over and be laughing.  I, in the meantime, simply stared at my food.  The sandwich became completely and utterly terrifying.  The meat was flowing out of the bread and the sauce also, this disorder was like a monster or some creature was trying to crawl out of the sandwich, I completely lost my appetite and was only focused on the kitchen laughter.</p><p>I had the recurring thought that the Arab man was laughing at the 'silly American' and that this somehow led to a deep hatred of our culture and citizens.  I was enforcing all stereotypes, not only of Arabs but of myself.  For an instant, I thought maybe this clerk is a terrorist and he plans to do harm.  Now, I realize how unfounded and narrow this view is.  But at the time, the fear in my mind instantly grew when I assosciated the Middle-Easterner with terrorism.  I immediately left the table and went to go pay the bill, all with only picking at my food in wonderment.  He noticed that I had left the place clean and asked 'was everything okay?' to which I gave an affirmative.  In retrospect, I realize how funny this was, some kid walks in and orders 9 euros worth of food and leaves the plate and then says the food was fine.  But this overall sensation was that I had to remove myself from this environment.</p><p>Next, I began to walk around the streets of Amsterdam, completely lost.  After maybe 20 minutes of this, I asked a man on a bicycle how I could get back to Vondelpark.  He spoke in English but it was so strange, I processed the words but it seemed like he took an eternity to convey an answer.  Finally, he said 'it's quite far from here' which only led to more fears about the initial I have to make it back to the hotel plan.  After some more walking, I kept having more recurring thoughts, like this is a really bad nightmare or dream but at the same time wondering if I can ever escape this situation.</p><p>Also, there were some amazing moments walking around.  Eventually I found the Van Gogh museum and the sun shone over the field of green grass and this was just about the most stunning panorama I can remember.  The sun seemed closer that I can ever imagine, as if I were to extend my arm I could easily reach out and touch it.  The whole scene that unfolded in front of my eyes seemed like a divine painting.  This helped to calm my inner fears, to a certain degree.</p><p>I sort of knew where I was at this point and worked my way back to the hotel.  I could feel the insane part of the trip winding down and now subtle visuals persisted.  Finding the Best Western again felt like I had achieved my one goal in life, and it also sobered me up in the sense that I no longer felt I was living in another universe or nightmarish reality.  I entered the hotel and walked to the room where my two roomates were.  At this point it was still hard to talk to people, but at the same time if felt good to have some human contact.  After all, walking around Amsterdam, alone and tripping for three hours, really fucked with my sense of time, space and communication with other people.  It had never felt so good to lay down in my bed and relax.  An hour later, I went to a comedy show with the girls and afterwards proceeded to get insanely stoned, this also felt very relieving after a day of smoking, tripping and now smoking again.</p><p>But this experience was not without several key lessons.  Tripping taught me that if I could survive an experience such as that one, living sober would be a piece of cake.  I really still feel this way in the sense that the feelings I had to deal with and control while on shrooms pale in comparison to the spectrum of emotions while sober.  Finally, shrooms were nice in that the visuals presented to me a world that I truly had not seen before.  The colors and light propetries made me appreciate nature and the natural world more.  So, in conclusion, would I do mushrooms again? Well, yes.  However only with the right people, under the right circumstances, and in the right setting.  And this is something that will be higly scrutinized after what happened on my initial trip.</p>"
}
