{
 "title": "The Farthest I Have Ever Been From My Body",
 "author": "Jay",
 "citation": "   Jay. \"The Farthest I Have Ever Been From My Body: experience with Salvia divinorum (20x extract), Cannabis & Alprazolam (ID 43409)\". Erowid.org. Sep 28, 2007. erowid.org/exp/43409",
 "substance": "Salvia divinorum (20x extract), Cannabis & Alprazolam",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43409",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 28, 2007",
   "Views: 3103",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As with most posts I shall start with a tad of background information. I am not a newbie to salvia by any means.  About 7-8 months ago I caught wind of this 'legal drug' that supposively worked, so I had to check it out.  I bought a pretty weak G from a local head shop and tested it out and got the usual Salvia effects.  I felt like I was part of whatever I was sitting on, the whole room would seem like I was looking at it in another dimension, people on TV I thought were talking directly to me.  And I also had that wonderful self conscious feeling that salvia gives me, worried that the world is looking at me like some sort of mental patient or something.</p><p>I continued to use it, bought a few more G's off the internet, introduced it to almost everyone I know.  I then had the trip of my life, where salvia took me far away up in the sky and let me look down at myself, and voices were surrounding me.  It was the closest to heaven I have ever been.  It became a good 'once in awhile thing' but I realized that my trips didn't seem very strong anymore.  Often times I just felt uncomfortable and no visuals or distortions at all, I could not achieve that strong of a trip again, so I gave all my salvia away and said good riddence.</p><p>2 months later I got reaquainted with an old friend and happened to tell him about it, and salvia once again became part of my life, in a very big way.  We bought a G of 20x from the headshop, looked and smelled pretty damn potent so I couldn't wait to give it a try.  I had just popped a xanex for my anxiety and smoked a blunt, so I was pretty high before things got underway.  He then handed me the bong packed full of salvia and I was happy I could be reaquainted with my old friend.</p><p>He turned out the lights, and all I could see was the glowing stars on the ceiling.  The room was silent minus the bubbling of the fish tank.  I lit the bowl and couldn't really tell how much smoke I was getting because of the dark, but I inhaled until I couldn't anymore.  I set the bong on the floor and leaned back in the recliner awaiting the effects.  I looked up at the stars and when I saw them moving a tad I exhaled.  I closed my eyes to see if I was getting any fractile visuals, the ones where I feel like I'm a part of something huge, spinning around. I remember catching a glimpse of them and like a flash I was gone.</p><p>I have had insanely hard salvia trips where everything in the room I'm in gets so distorted it seems like another world completely, but this time I was indeed in another world.  I remember looking at myself, in this insanely beautiful place, full of vibrant colors.  And I really would love to explain how beautiful it was, but there is no earthly words to describe it.  I was in a place that my imagination could never have came up with.  I was beyond this world, above this world, in a place so stunning I could only call it heaven.</p><p>I had alot on my mind that day prior to trying it, a really bad tooth ache, a migrane, and my lungs were really hurting me (hince why I took the xanex) and I saw the pain leaving my head, mouth, and chest.  Like a black cloud flying out of me.  I was completely at peace, in a happy and tranquil state that I have never felt before in my entire life.  Many trips have made me feel like im a part of something bigger, but this time I felt free, so free.  I was in a world meant for gods, a place where every desire I have ever had can be granted, a place that releaves me of every pain and doubt.  </p><p>The sound of the fishtank began ringing throughout the world.  I knew I had heard it before but I didn't know where.  I ran towards the sound, and what happened next is almost impossible to explain.  I felt myself crawling through a tunnel, towards the sound, and when I reached the top I peered out and saw the living room in which I was seated.  I hid in the tunnel, scared, not knowing what to do.  Finally I made the ascent and climbed into my body, and for the first time ever I came down without worrying about what everyone was thinking, I was still at peace.</p><p>For the next couple minutes I was sitting there, and I kept slowly sinking back into that tunnel, and had to keep pulling myself back to reality.  I wish I was more aware at the time, for I would have returned to that world if given the choice, for nothing on this planet could ever compare to the pure beauty I saw.  I feel knowledgable now, as if I have found a place very few will ever get a chance to see, and feel sorry for all of those who haven't been there.</p><p>The odd thing is, when I crawled back to my physical self, my friend was staring at me in shock, he said I just sat there the entire time, with my eyes open, but he knew I was gone, he knew there was no mind/soul/conscious inside my body, it was merely an empty vessel.  Right before I came back he said he saw something move in front of my body, a shadow, a black portrait, his girlfriend saw it as well.  Whether it was them being stonned or lying, a being watching over me, or my soul returning to my body I do not know.  All I know is that night will live on inside me forever.</p><p>I do want to try salvia again, though I fear I will never return to that heavenly world, and anything less than that will be unsatisfactory.</p>"
}
