{
 "title": "Epiphany in 2 Dimensional Space",
 "author": "Losing Dimensions",
 "citation": "Citation:   Losing Dimensions. \"Epiphany in 2 Dimensional Space: experience with Salvia divinorum (10x Extract) (ID 43401)\". Erowid.org. Sep 8, 2008. erowid.org/exp/43401",
 "substance": "Salvia divinorum (10x Extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43401",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 8, 2008",
   "Views: 3662",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirst off I don't want to bore you with personal things like my background with entheogens or anything else.  Salvia is a substance like no other.  I can be inside, outside, around others or alone, it doesn't really matter.  It always gives me the same effect.  It's like my soul leaves this reality, or even dimension, and departs to some strangely familiar plane of existance that only a select few can truly understand.\r\nToday I sat on the top of a hill overlooking a river and a small metropolitan area, and took one long pull from a large pipeful of 10x extract.  Immediately I felt the effects, and was lost in salvia space.  I felt the world shrink and the third dimension disappear.  I was like an image on a TV screen, only much more complex.  My father's dog was with me during the experience and took the form of a 2 dimensional snake swirling around my painting like body, which I saw from an outside perspective.\r\nI felt connected to everything around me, to the point of total loss of ego.  I was no longer a being, just part of some infinite pattern.  Birds chirped, dogs barked, the wind blowed, all in tune with this pattern, a perfect song, powering the serpent's forceful dismantling of my soul.  The serpent which was my father's dog swirled around me, absorbing all my negative feelings and energies and letting them disperse like hawkings radiation from a blackhole.  I was in a state of total bliss and harmony.  If nirvana truly exists, this is as close as I will probably ever come to 'being there'.  I felt the presence of god (or maybe lack of god) in everything, including myself, and realised that this (sober reality) is not the only existance, but one of many.\r\nThis was one of the most powerful experiences of my life, far surpassing any other.  I have no plans on repeating this experience anytime soon, I don't need to.  I learned even more than I expected.\n\n\n"
}