{
 "title": "The Red Nets That Hold the Universe Together",
 "author": "LandoandI",
 "citation": "   LandoandI. \"The Red Nets That Hold the Universe Together: experience with Mushrooms (ID 43482)\". Erowid.org. May 7, 2007. erowid.org/exp/43482",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "43482",
   "Male",
   " ",
   "Not Given",
   "May 7, 2007",
   "2902",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Lando and I are both fairly regular cannabis smokers, this is our first experience with mushrooms. Other psychoactives I have used recreationally include codeine, percocet, valium, dexedrine, and dipenhydramine. So far, percocet is easily my favorite and nothing is more pleasant than an opiate euphoria. We are both in good health and are 19 and 17.</p><p>Lando and I parked the car near the forest. It was 10:15pm, the sun was beginning to set. I opened the 2 bags, both containing 3 grams of dried cubensis mushrooms, and began splitting each piece in half, one half going to Lando, and one to me. This was done to ensure that we both received the same amount of the drug. They didn't taste nearly as foul as one might expect, they really arent that bad. Sort of a combination of sunflower seeds and cardboard. We washed the fungus down with a can of soda each, grabbed everything we thought we would need for the evening, and left the car. Both of us immediately lit up a clove cigarette and started making our way to woods. </p><p>Within 15 minutes a mild stomach ache appeared. It was not especially painful of uncomfortable, but it was definitely present. A few minutes later, the same sensation started in both our lower backs. My cell phone vibrates, I picked it up. It's Anita. She asks us if we have eaten them yet and we, excitedly, tell her yes. We talk for a few minutes and she wishes us good luck. She's comforting to both us, her house isn't far from here. If anything goes wrong, she can help.</p><p>We make our way down the big hill. Ahead of us is an enormous array of forests, rivers, and grassy areas. A residential area is only a few blocks from here. Our first destination is a small creek where we will lay and watch the sky turn dark. It's been about 30 minutes. My coordination seems different. Neither of us can really put our fingers on it, but something isn't the same. We begin to march through the field, heading towards the river. Lando is walking in front of me, and out of the corner of my eye I spot an intensely bright light in the sky. I screamed, and pointed towards the sky. I wasn't afraid. I'm confused as to why I would have screamed. </p><p>We arrive at the river and lay down. A few bats fly overhead, swooping here and there, eating mosquitos. For some impossible reason, I SCREAM whenever I spot a bat. They are not scary, and I am not new to seeing them. I have been around them my whole life. The sky looks different. It's not calming, but it's quite beautiful. The blues seem bluer then normal, the pinks seem to be more alive. Lando telephones Anita again. Listening to her speak, it is quite apparent that the way we are acting is quite abnormal. I'm jumpy and relaxed at the same time. Lando starts to melt into the grass and nearly slides into the creek. At this point, I decide we have to leave the creek or we will both drown. I shine my flashlight into the water and the flow of the water is so entirely fascinating. I've not seen anything move like this before. The light glistens every moment and is always dancing around and moving, so I can't focus on any specific pixel. We climb up the hill and get back onto the grassy plain. </p><p>The sky isn't there. Something took it away and replaced it with a rainbow of implausible complexity and perfect beauty. I think to myself that this drug is finally speaking to me. What beauty. We are talking much more frequently now, both of us trying to explain to the other exactly how we feel, what we are seeing. We come to the conclusion that we are saying remarkably interesting things, and that we should be recording them. I have a small microphone in my car. Lets go get it.</p><p>The field has gotten at least a thousand times as long as it was when we first walked across it. It's been approximately one hour since we ate the mushrooms. I start to get cold so I zip my sweater up. Every step I take towards the end of the field asks me a question. I start to answer it, but before I can answer, the next step asks me another. The pauses between conversation are very sparse now, Lando and I both talking with great speed and detail, but no thought lasting more than a few seconds. We reach the end of the field. Why did we come here? My legs bend in half and I hit the ground at the bottom of a hill. The ground starts to ask me questions and I try to answer them. After a few minutes, Lando reminds me that we are heading towards my car, we get up and continue walking.</p><p>There is a bench at the top of the hill, overlooking the valley we just came from. Three twentysomethings sit there, drunk on Vodka, laughing and chuckling to themselves. I only pray that Lando is experiencing the same fear as me. Who are these aliens? What do they want from me? Run away. Turn around and run away back to the forest. They speak to us. My heart stops racing. We approach them. They are beautiful creatures of intense complexity. I seem to recognize all of them. They are so familiar. Lando begins talking with them, and realizes that he lives three houses down from one of them. I think how small the world is. The girl is talking to me but I can't hear her. I ask Lando if we can leave and we go, quickly, towards the car. </p><p>The city is trying to scare us. Every molecule contained in every house and streetlight asks me a horrifying question and I play stupid, pretending to not know the answer. I tell Lando that I am scared and I want to be in the dark. We leave the main streets and take a detour through the alleys, towards my car. They are comforting. They don't ask so many questions. My mouth is saying one thing to Lando, and my mind is saying another. I'm not sure if he's listening to me. I'm not sure if I'm listening to him. I can see my car finally. Why did we park here? We should have parked anywhere else. We are 15 feet away from the car. A man starts jogging down the street towards us. I can't let him know it's my car. If he knows it's my car, he can get the license plate. If he gates the license plate, he can track us. I change direction and head towards a nearby soccer field. Lando follows. Ten feet later, I collapse on the ground. Why did the man scare me so much? Why should I even have to ask myself that question? </p><p>Lando doesn't like it here. We have to be spies he tells me. We have to be spies and get somewhere safe. But I'm so hot. I take my sweaters off and they coil around my arms like two snakes. We start heading towards the school. It's an elementary school. Did I go to school here? Are we at recess? We have to get safe. We have to be spies. Hurry! I can't juggle these snakes much longer! We finally hit the brick wall of the school and lean against it. I'm 5 years old in kindergarten. My sweater is a blanket. I ask Lando what's going on. He's as confused as me. The whole city goes black except the brick wall. I look down and see a small plastic bag. It's the bag I pulled my mushrooms out of. When was that? I take my hat off and look at Lando. He is resting his head on an invisible pillow, slouching against the wall. I'm so cold. If only I could put these sweaters on. HEY BOYS! We hear. We look left. There are two shadows in the distance. Are they talking to us? Are they looking at us? When is recess over? I'm terrified. Lando tells me we have to leave. We arent safe. Lets go the car, it's right there. We walk forward and there is an electrical box in front of us. A cowboy leans against it, smoking a cigarette. I blink and he's gone. Lets just get to the car. </p><p>This car is terrifying. My eyes are huge. There's people everywhere. Lets get back to the forest. What? Are we in a boat? This used to be my car. Lets climb out of this boat and swim across that cement and go back to the forest. We walked up a little hill and I leaned against a tree. Lando is almost vomiting. I ask him if you're ok dude? Yeah, I'm fine he says. I tell him thats called the purge. It's a good thing, no need to worry about it. I ask him if he's enjoying the effects. He is, thats what he says anyways. I'm not so sure.</p><p>We made it back to the alleys. They're darker, they seem safer. Lando doesn't feel like vomiting anymore. How much further until we get to nature? I want to be in nature man. Dude, look up! I can see all the different planes of existance. There are three of them, they're all purple! They are shuffling back and forth and sideways, right through each other! I can feel them flowing through me. There's nature! We cross the well lit street and I can feel a breeze move right through me from one side to another. Amazing. We make our way down the hill. This is incredible. </p><p>The universe is asking me a thousand questions every second. The flashlight prints a constantly altering pattern on the grass. The patterns are so beautiful. Lando takes my hand and we make our way through the field again. My hands are in my pockets but I can feel our hands holding each other. Our minds are linked together on this adventure through our consciousness. We reach the river again where the bats were and we walk near it. I don't want to stay down here Lando, I think one of us will drown. Lets go somewhere else.</p><p>I look up towards the sky and I see the tracks. Everything in existence is on a track. Their tracks are mostly red but they have green dots that appear sporadically every few moments. The tracks relay information from the universe to my brain. They tell me where the molecules have been and where they are going. I can see where they will be in 5 minutes from now. It's later, it's 5 minutes later. Go. Lando is Bob Dylan. He talks and thinks like him. Did he ever eat mushrooms? Where are we? Lando turned into me. He's talking just like me. He's wearing my hat and walking ahead of me. We're going over the bridge. Underneath, water flows so beautifully. I have to keep moving or I feel sick. Lets just keep moving. We have walked so far, man.</p><p>Lets lay on the pavement. This is balance among the chaos. Lets just lay here for a while. There are a billion stars for every layer in the sky. They all dance and swoop and spin and laugh until I focus on them. Then they stand still and wait for me to stop paying attention. Lets go faster man, lets go back to the plains. The purple fences are everywhere. They don't block us at all but they are there. How do we respond to this? They have diverged into three paths. Which one should we take? This one is the least obvious, lets take it first. Oh no, a real fence. We can't walk past it. The hill is right there, lets go back to the city and the lights. I feel better now. Not so confused.</p><p>We walk around the city for 100 miles. Every step isn't sure if it was ever there. We are only a few blocks from the car, lets go back there. It won't scare me this time. Once we got back into the car, it's very sobering. The world has stopped dancing and throwing questions in my brain. The universe is just laughing now, not screaming. Much more relaxed now. But am I? Am I back to normal? I don't feel totally normal? What if I am weird like this forever? What will I do!? How do we get out of here? I'm so confused Lando, help me. Wait, this is normal. We still have an hour to go. Lets sit here. We spent the next hour and a half in the car, returning to reality. Familiar music helps us feel normal. I dropped Lando off at his house after that, turned the music a little louder and drove home. </p><p>It was the most confusing, terrifying, amazing, profound, intense and overwhelming experience of my life. I'll never see the world the same again. I felt slightly strange the next day, like I had a hangover and a great night behind me. I wouldn't trade the experience for anything, and I wouldn't do anything different. Mushrooms are a great drug, but nothing I would do regularly. It was a life changing experience, a great one. I will cherish it. I thanked the spirits for their wonderfully complex poison and felt great the day after. Mushrooms are bigger than the other drugs. 95% of the time I would rather pop a percocet or smoke some herb. But every once and a while, Mushrooms will find their way into my psychosis and play their tricks on me again.</p>"
}
