{
 "title": "Hooked On It",
 "author": "anonymous",
 "citation": "   anonymous. \"Hooked On It: experience with Melatonin (ID 43529)\". Erowid.org. May 30, 2006. erowid.org/exp/43529",
 "substance": "Melatonin",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Melatonin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "43529",
   "Male",
   " ",
   "Not Given",
   "May 30, 2006",
   "Views: 40155",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been having some sleep problems a while ago until I was introduced to melatonin. My sleep deprivation was getting in the way of school because I was often falling asleep in class. Most nights I would be lying in bed for hours at a time, usually falling asleep at around 3 or 4 when I had to wake up at 6.</p><p>I began taking melatonin to get out of my bad sleeping habits and to get into an earlier set time of going to sleep. At first I loved it because I was getting all the sleep I needed to do well in school and make it through the day, but soon I found that I was getting into a habit of taking melatonin before bed. In a matter of weeks, there were no nights that I went to sleep without it. It was just something normal for me. </p><p>But then I realized that it was probably not good for long term use so I didnt take it for a few nights. The nights I didnt take the melatonin, I got pretty much no sleep at all. After that I began to get into a habit again. A few months later I was still taking it habitually every night and eventually I had to up the dose. Some nights I would end up taking more than 3 tabs (each being 2 mg each). The next morning I would be groggy and would find it harder than anything to get out of bed. I ended up taking melatonin for about half a year, every night since the first night I took it. I finally decided I had to get off of it. I would do anything I could to get sleep without it. Sometimes I would not get any sleep but eventually I broke the habit... The few months that I was on melatonin were probably the worst nights of sleep I had ever gotten. Now, about 2 years later, I still am free of melatonin except for some nights when I cant get to sleep.. But now that I think of it, I had a huge bottle of 1mg tabs in my room (maybe 500 tabs) and there are only a few tablets left which makes me realized how hooked I was. Occasionaly I take 5-HTP which seems to work better than melatonin. </p><p>Overall melatonin is good for trips and things when I'm getting used to a new time zone or something like that but I try to keep off of it because I remember how bad the habit I had been stuck on was.</p>"
}
