{
 "title": "Partying",
 "author": "PhreekRaver",
 "citation": "   PhreekRaver. \"Partying: experience with GHB (ID 43543)\". Erowid.org. Sep 9, 2008. erowid.org/exp/43543",
 "substance": "GHB",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43543",
   "Male",
   " ",
   "Not Given",
   "Sep 9, 2008",
   "Views: 8424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the last few years, Ive been totally surrounded in the act of recreational drugs, it's sure fun, I somewhat think different through my experiences and in someway grown though the experiences I have. I used go to raves every weekend. At first I only took Speed and Ecstasy, both were very pricey, yet I still continued to do them week in week out. I would always see GHB/GBL/14B overdoes at every party, it was almost certain I would see at least one person get pulled away from paramedics at large parties, but it didnt concern me that much, because it was never people I knew.</p><p>As months got on, tolerance got higher, I had to take more, I got to know more people. My friends started to do GHB more cause of its value; $5 will get you ripped for 2 hours, seems a bargain to me, dont you think? Months comes to past, I had started practicing using G quiet often, not every weekend but most, I learned to respect it and never had a G Accident.</p><p>Few months ago we were at a local club. Things were normal, everyone was enjoying themselves, going out to the car once in a while to measure up a G dosage using a plunger (Syringe without needle, we measure up to the exact mil to be certain with our dosage). At about 2am, I went to the car and had my first, one my friends, had speed earlier, was also in the car, started to loose co-ordination and track of time, he forgot about his last dosage (which was 3mls) 30 minutes before hand, and had another 3mls. </p><p>30 Minutes later, he went unconscious in the busy club, we then proceeded to try to keep him awake and conscious, we tried to restrain him while when he was severely spasm, he constantly tried to bite us while we were trying to restrain him. With the help of 5 people, we carried him outside through the back way of the club. The next few hours were horrible, we were outside checking on breathing, trying to keep him moving and stimulated by pinching him, slapping him and generally trying to hurt him to get a response, which was normally him trying to bite us, which was fine, we didnt care. He spent most of the time moaning and groaning and we kept on trying make him wake up. He was going in and out of conscious, throwing up a few times in between. If at any point, he didnt respond to us we would have taken him to the hospital, for after all, waking up in hospital isnt bad as not waking up at all. Finally about 5am, he became responsive like nothing had happened, just grumpy and really sore, not knowing what happened.</p><p>Just one story out of many Ive had with G, Ive personally dealt with about 10 G overdoses, sometimes its because of recklessness, sometimes out of not knowing how strong that clear liquid is, or what type it is, and mistaken it with weak G and overdosed, when it's something like 14b, and hasnt metabolized and kicked in. Im not anti-G, its certainly a very fun drug to enjoy, but as everything else, be careful.</p>"
}
