{
 "title": "Wow, Strong",
 "author": "spaceman",
 "citation": "   spaceman. \"Wow, Strong: experience with Buprenorphine (ID 43571)\". Erowid.org. May 11, 2006. erowid.org/exp/43571",
 "substance": "Buprenorphine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43571",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 11, 2006",
   "Views: 43926",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had extensive experience with all the different varieties of junk, smoked, swallowed, sniffed, and injected. I have had a consistent habit for at least two years and have maintained this by staying cautious and keeping myself educated (and employed). </p><p>Up to my experience with buprenorphine I had been using at least 80mg of Oxycontin a day to maintain my habit. This past week on a visit to my dealer's home he asked if I had ever tried Buprenorphine. I told him that I hadn't but had heard of it and knew it to be a detox drug. He asked if I'd be interested in purchasing some and I declined because I was not about to detox. The dealer said he wanted to know if people would be interested in buying it in the future and wanted to know the effects so he gave me an orange 8mg sub-lingual lozenge to sample. I thanked him, bought my usual Oxycontin and left. The next day, having exhausted my Oxycontin supply I decided to take my little orange lozenge. I put the thing under my tongue and it began to melt. It tasted like orange candy mixed with hardcore pharmaceuticals, not entirely pleasant. 'This may hurt a little, but it's something you'll get used to'. I then waited. the first effect surfaced about half an hour after taking it, like with any other swallowed pill. 'This is great' I thought. An hour later I was full-on dope high. Like a shot of junk. I have a very high tolerance for opiates and never nod-off but with this stuff I swear if I had given in to the substance I could have nodded off at any time. </p><p>I was very impressed with the strength of this medication but then I began to wonder. My tolerance for opiates being what it is, I grew concerned about those who might recreationally use this drug who don't have as high a tolerance. They will no doubt get knocked on their asses. I am also concerned with how much it would take someone to overdose. Buprenorphine is a very strong drug and is used for junkies who want to come off dope. </p><p>It is now the day after and I am still a little high, I was expecting this.</p>"
}
