{
 "title": "A Woman and the Line-Up",
 "author": "Alex Kosavinco",
 "citation": "   Alex Kosavinco. \"A Woman and the Line-Up: experience with Salvia divinorum (10x extract) (ID 43650)\". Erowid.org. Sep 27, 2007. erowid.org/exp/43650",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43650",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 27, 2007",
   "Views: 2345",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPreface: Ive decided that this will be my last experience with Salvia for a while. I have much respect for this hallucinogenic plant, and it truly has taught me a good deal about my friendships and myself. I do believe I will return to the plant later in life. Hopefully its legal status does not change before I can make a revisit. It is truly a magical plant.<br>History: I have had two experiences with Salvia (10x) before the trip that this report deals with. The first was very uncomfortable, as it was such an intense experience that I was certainly not prepared for it in any way. Extreme heat came over me and I panicked a good deal. The feeling was as if I were looking at the world through a kaleidoscope, and it was moving away from me at an unbelievable speed, and there was nothing I could do to save the world or myself. The setting was a fairly large and loud party; that was my mistake. I should have done more research before diving into this unknown and potentially scary world. My second experience was very similar to my first experience as far as the visualizations go, but there was only one other person in the room, and it was much less frightening. Grateful Dead was playing in the background, and the music seemed to soothe me but keep me in this world, perhaps defeating the larger goal of the Salvia experience. There was a period of about a month or so between my second experience and this night.<br>Background: I had had one beer. I smoked three small bowls of Salvia (10x extract fortified leaves), increasing in size, about one every half hour. With these smokes I had minor visualizations and a generally good feeling. As I now believe it, these smokes were not carried out for the correct reason. It is now my belief that Salvia should be used for the purpose of journeying into the mind and the non-visible realm, not to simply gain a high. During the first three smokes, I also experienced extreme (to the point of discomfort) heat; in fact, I was sweating quite profusely after the second smoke. Then I decided to smoke a larger bowl, unmeasured, about two and half hours after the first smoke. I used a mini water bong.<br>Setting: I am in the woods at a campsite. There is a fairly large fire going. I am with three very good friends that Ive known for about four or so years, a person that Ive gotten very close to over the past year, and a person I know slightly. The time is decent: good, not bad, not amazing. Im sitting with two of my very good friends by the campfire on a park bench staring at the fire and talking with them. The three others are sitting in a car smoking an herb. The three come back from the car, and I decide to go to my car with one of my very good friends. I sit in the front drivers side seat. My friend sits in the front passenger side seat. We are both sitting very comfortably. <br>My friend tells me that he is unsettled by the fact that we have been getting on each others cases lately within our circle of friends. We agree that we spend a lot of time together and perhaps it is inevitable. We both acknowledge the fact that we have all been bickering somewhat lately, and we decide that we can easily work through it as long as we are all willing to try. We believe our love for one another is something unmatched nearly anywhere else in our lives. Im happy with the outcome of the conversation.<br>Both of our windows are open slightly, but I cannot hear our other friends by the fire. I only hear myself breathing. There are no lights on in the car, and no light besides the fire. We are looking straightforward into darkness, and some trees of the forest are visible in front of us and to the sides of us. The fire, picnic bench, other friends, etc are to the right of us and are visible to the right in our peripheral vision. I am slightly anxious to smoke. I packed the bowl and breathed in deeply. I breathed out, breathed in, and breathed out. I took one look at my friend, and he nodded letting me know he was there for me. I was still slightly anxious, but I could not have been more comfortable with my situation.<br>The Experience: Now for the actual experience: I use a clicker type grill lighter. I light the Salvia and draw all of the contents very deeply. I pull out the slide and inhale the rest of the smoke into my lungs. It was a decent sized hit, but only about 1/10 of a gram. While passing the bong to my friend, I hold the hit for about 20-25 seconds. Slowly, I exhale with eyes closed. I feel as though nothing is going to happen, and that I may have wasted that bit of Salvia. My eyes remain closed. Suddenly, Im forced into my chair. It is not a violent thing, but I feel as though I am being pressed firmly down and back into my chair. I am not becoming part of the chair; Im just being pressed against it. I equate the feeling to the feeling I get sitting in an airplane during takeoff.<br>This sensation stops suddenly, and I get a sudden urge to stand up. I think about standing up but know that I cannot. So I just think about standing up. I open my eyes; at this point, I can no longer feel the presence of my friend that was in the car with me. I have no awareness of the car itself, and I do not see the fire any longer. Then I ask myself, Did I just hear a woman ask me to come with her? At that moment, this is my reality: I am sitting on the floor in some black area. There is blackness surrounding me on the sides; I can only see in front of me. I can no longer feel my physical body. I have no recollection of any feeling anywhere in my body on the physical level during the entire experience. My legs are crossed; Im sitting kind of like they make you in the large school assemblies in grammar school when you have to sit on the floor in a cramped space. Im looking at my legs.<br>I look up, and I see myself, my back to be exact. In front of me, I am lined up. It is a line as long as I can see of me. Every one of me sits the same way looking forward, not moving. Everything in my line of sight is lined up similarly. All the trees around me stretch in this fashion as far as I can see. I hear a woman ask me to come with her. I never see this woman, and I never actually hear her. Our conversation is assumed, meaning I know exactly what she is trying to communicate to me without her having to talk. The presence is distinctly female as well. I never actually hear her, but I speak clearly and out loud. My friend would later tell me that I was mumbling to myself. She asks me to come with her again. This time I feel a firm tug from my left side pulling me to the left. Visually, I see the entire row of me being moved to the left, but the row snaps back to its original position. This happened many times, for minutes or years I cannot say. Time certainly disappeared altogether.<br>I tell the woman that I cannot go with her because I am aware that my friends are on the physical level. I feel as if she will take me very far away. She assures me that my friends will be coming with us, but I am hesitant to trust her. I feel the heavy tug every time she asks me to come with her. I tell her that it is so hard to understand all the different levels on which my friends live. This meant to me that we are all so different, and it is hard to relate sometimes. I am about to give up on friendships because I realize how difficult it is to understand another human being.<br>The woman assures me that it will be okay. She is still urging me to come with her, and I still refuse. She explains to me that all people live on different levels, and thats a fact of life. However, she makes sure I know that these friendships are still possible. I am still sitting in the black space while all of this is going on, being tugged left and then moved back into my starting place. I still have no awareness of the car or anything of the physical world besides the trees. I keep telling her that is so hard to understand people, and she acknowledges this. Yet she still urges me on, telling me that my friends will come too.<br>I give in and tell her that I will go. Then I change my mind. I do this several times, but Im not sure how many times exactly. Finally, I decide that I would rather stay. At this point, I begin to regain a sense of my physical surroundings. I see the inside of the car, and I notice something on the dashboard. I reach for it and grab it quickly, and I realize that it is the open container of Salvia. I had promised my friend he could smoke the rest, and I got very upset that I might have spilled some out. I snap the container shut and mutter, Its better that way, as Im staring off into the darkness to my left. Im not sure if I was referring only to the container, or if I actually was talking about it being better that I had gained this new knowledge.<br>After apologizing, I look at my friend and see the fire about thirty feet behind him. I get very confused by the people moving around by the fire. I dont fully know whom my friend is sitting next to me, but I ask him anyway, What are those people doing by that fire? He explains that they are cleaning up the site a bit, and I take that very easily. He tries to hand me the mini bong, but I do not yet want to touch anything of this world because I have a slight fear of our physical world after what happened with the container of Salvia. Finally, I slowly start touching things, easing my way back into reality. I tell my friend that I will turn the light on in a bit, but that I cannot do it yet because She might get me if I do. By saying this, I meant that I felt as thought if I made myself visible, that the woman would come and take me away from my friends before they noticed. I was not really afraid of this, but I felt as thought this was a possibility, and I wanted to avoid that situation for some reason. Within five minutes, I am comfortable with the physical world. I come down off a high for about twenty minutes. <br>Afterward: It would not do this experience justice to just say, It taught me a lot. I believe that no amount of word can completely capture my experience. Much of what transpired is beyond logic, reason, and language. It would be impossible to one hundred percent accurately describe the trip, but the above is the best I can do. I also believe that my experience was heavily influenced by the conversation I had with my friend concerning our group of friends just prior to smoking. I had an experience that explained to me some of the complexity of human relation, and the woman assured me that although people are very different, relationships are possible. I believe it is helpful but not necessary to discuss ones experience with some one afterward. For me, it helped to make sense of the whole time. After discussing my time with my friends, one offered the explanation that perhaps the woman calling me was Salvia herself, calling me to take another hit and get deeper into her world. I knew not the physical world and would not have been able to take another hit if I wanted to though. Altogether, I loved my experience. It caused me to respect Salvia even more than I previously did.\n\n\n"
}
