{
 "title": "Rebuilding My Self",
 "author": "Teknic",
 "citation": "   Teknic. \"Rebuilding My Self: experience with Salvia divinorum (5x extract) (ID 43662)\". Erowid.org. Sep 27, 2007. erowid.org/exp/43662",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43662",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 27, 2007",
   "Views: 2402",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first time really hittin' the Salvia.  It wasn't very eventful, but I'd like to describe what was going on in my mind in a detailed play-by-play to illustrate how my 'self' was rebuilt.  I tried to write this without using the surreal visual and mental analogies everyone always uses because we all know they're nothing like the actual experiences.  It's like trying to represent a place with a photograph. There's a whole dimension that can't possibly be presented; but in the case of a trip report it's not a spacial dimension that's missing, it's the 'trippy' one.</p><p>To eliminate any confusion I'll explain the experiences in terms of a consciousness, an ego, and a body.  At first the 'consciousness' was just knowledge, but thoughts started coming from it shortly after.  The 'ego' I describe was really nothing more than an id for nearly the entire trip, but I thought 'id' might confuse some people so ego id is.  As I sober up, the separate memory trail of each 'part' of me are all starting to weave together into one big 'me' experience, but I can assure you that when I started writing this they were all very distinct and detailed.</p><p>Times listed are rough guesses of actual time because there is no Salvia time.  When I first came back I thought that time had felt dilated during the trip compared to actual time, but now while I'm writing this (~3 hours later) I almost remember it as being contracted.  This gives you some idea of the validity of Salvia time. The setting was simply a room with two windows, one to my left and one to the right, to the dimly lit outdoors.</p><p>Start: Burned 2 big bowls of crap non-standardized 5X in a bong and experienced some mild trippage.  When I walked across the room my upper body wasn't keeping up with my legs so they were always about three feet in front me like I was connected in the middle by a rubber-band.  I thought this was hilarious and I did a couple laps around the room laughing out loud like an idiot.  If I tried to look close at something while I was walking my head would stay back with the object while the rest of my body just kept on goin'; then when I stopped looking my head would snap back up to the rest of me which was a good 6 feet ahead.  It was a cool funhouse but I was looking for something deeper.</p><p>3 minutes later: Sat back down and torched one last huge bowl.  Everything around me started to crystalize over and the feeling of crinkled tin-foil spread from out from my burnt throat to my entire body.</p><p>1 minute later: I turned off the light.  Bingo.</p><p>+10seconds: The consciousness was aware of a flat, black, 2D plane with a couple of dim, blurry rectangles on it.  The plane was actually my field of vision but at this point the consciousness had no concept of 'vision'.  The consciousness was not 'seeing' plane, it was just 'there'.  Kinda like how you can feel your toes without having to look at them.  I didn't exist and never had, there was no concept of 'I'.  The black plane was everything.</p><p>+5sec: the rectangles started flying around picking up speed.</p><p>+30sec: The consciousness figured out how to make one rectangle disappear and the other one take it's place. I was actually turning my head from one side to the other.</p><p>+15sec: The concepts of vision and a movable head to guide it started to vaguely flicker in and out. The consciousness wondered if the head was spinning completely around.</p><p>+30sec: The consciousness noticed a dark spot move across one of the rectangles and a faint ego emerged that wanted it to happen again.  The ego was totally separate from the consciousness at this point.</p><p>+5sec: The consciousness learned it could control the spot.</p><p>+10sec: The consciousness and ego started to link up slightly and they figured out that the dark spot was caused by a hand at the end of an arm that they were controlling.  The ego was having a blast watching it.</p><p>+30sec: The consciousness and ego fully merged and became aware of a body.</p><p>+5sec: The body merged with the consciousness and the ego and the three of them became 'me'.</p><p>+15sec: Mysterious real-world concepts started rushing back in this order</p><p>\tFuck!</p><p>\tI'm in a room.</p><p>\tI have an ass and it's on the floor.</p><p>\tI just smoked Salvia.</p><p>\tThose two kick-ass rectangles were just windows.</p>"
}
