{
 "title": "Instead of OTC Painkillers, For Back Pain",
 "author": "Seeformiles",
 "citation": "   Seeformiles. \"Instead of OTC Painkillers, For Back Pain: experience with Poppies - Opium (ID 43681)\". Erowid.org. Oct 11, 2006. erowid.org/exp/43681",
 "substance": "Poppies - Opium",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Poppies - Opium",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43681",
   "Male",
   " ",
   "Not Given",
   "Oct 11, 2006",
   "Views: 22808",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently went on a cycling and walking holiday with my wife in Northern England. Since I hadn't done a great deal of exercise for a while I managed to put my back out! We had been cycling round the grounds of a stately home when this happened. In some considerable pain we carried on with the guided tour (since we had paid £10 each to be there!) and wound up in the gift shop at the end. I spotted some dried poppies in this shop and decided to give these a go instead of using ibuprofen or similar OTC painkillers. </p><p>When we got home, I ground up three of the heads in a coffee grinder and steeped the resulting powder in hot water for about 45 minutes. I strained out the liquid and gently heated it through with a good dollop of honey. 20 minutes after drinking it down I began to feel the effects. A warm glow spread across my body accompanied by a pleasant sedation and (best of all) my pain receded into the background. This sleepy contentment was only interrupted by 2 bouts of nausea and vomiting which sounds unpleasant but didn't particularly bother me at the time. I went to bed early, had some wonderful dreams and woke up still feeling the effects until about midday the following day. Overall the strength of the tea surprised me - as did the cost of the experience (about £0.50!!). I will certainly try it again but will leave long gaps between experiences as it's a bit too nice!</p>"
}
