{
 "title": "Another Glimpse of the Divine",
 "author": "shruming human",
 "citation": " Shruming Human. \"Another Glimpse of the Divine: experience with Mushrooms - P. cubensis (ID 43726)\". Erowid.org. Sep 29, 2007. erowid.org/exp/43726",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2.6 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43726",
   "Not Specified",
   "",
   "Not Given",
   "Sep 29, 2007",
   "4535",
   " "
  ]
 ],
 "report": "<p>I made a tea earlier this evening from 2.6 grams of small, dried, closed-capped cubensis by breaking them up into tiny pieces and steeping them in 208 degree (F) water twice for 8-10 minutes each time.  These particular mushrooms are extremely potent, I learned several weeks ago by taking 3 grams and having my brain turned inside out.  So I expected a strong experience from this amount.  Instead of merely having a strong trip, however, I turned into a shadow of my former existence, except that the shadow was real and my former life was revealed to be the creating of a small mind.  I lost myself to the waves of pure spirit that came crashing down.</p><p>It was only 20 minutes after drinking the tea that I had to close my eyes, and lost track of where I was, and soon after, who I was.  I was squirming around on the floor for hours, not in control of my body, giving it all up to God's will, following the whim of the divine hand.  I laughed like a maniac, I may have cried but it's not clear if that's the correct word for it.  I saw through my everyday games like an adult knows about a child's world, and also knows the adult world, someone with duplicity of vision and the capacity for multiple simultaneous understanding.  Too much went on in my mind to describe, all at the same time, as I made connections between seemingly disparate and distant things and saw the interconnectedness of all things clearly.  I actually experienced this, although that is meaningless to say in words. </p><p>Death was nothing to me; a perspective which differentiates life and death as opposites was a pathetic misunderstanding from my viewpoint.  I felt that one human life was an extremely short period of time, like a race run by children without any determinable purpose other than fun, or just the love of breathing the air, or doing something, anything at all. However, I saw that each life is lived with some meaning to it; what can be learned through one person's challenges is the lesson of the lifetime, and then death comes momentarily, until we are born again, and thousands of lifetimes pass in what is one afternoon for the gods that are revealed by the mushroom, as we make our ways slowly towards purity and love, taking one small step each hundred thousand years. I saw myself as one little addition to the tapestry of life, a hundred of my lifetimes like a single dot on the canvass of life, so insignificant, but still a part of the beauty.</p><p>I felt as if everything that was happening to me had happened once before, in a long deja-vu that must have lasted an hour or more.  I endured quite a bit of suffering during this time.  My horrible trip on LSD almost 20 years ago came back to me, with some of the same words being offered occasionally to my mind like bait for the fish of my fears: 'hiccoughs in the fabric of life', 'vomit'. I saw vaginas appear from above, pink and plastic-looking.  I heard all kinds of hallucinations, voices talking, bugs vibrating, and more that I can't remember.  </p><p>I asked my wife to help me get out of my deja-vu nightmare.  She tired, but everything she did seemed like she had done the same thing last time I took these mushrooms, about three weeks ago - a very strange trip, where I wasn't sure what was happening during the trip, and even afterwards I couldn't really figure out what had happened.  Finally, somehow, with her support, I got unstuck from the nightmare, and focused on following god's will each second.</p><p>I should mention that even during the horrible deja-va episode, I was fairly calm and accepting of my situation, far better than I felt 20 years ago during my bad trip.  I was surprised that the mental instability I accessed with LSD was present to some degree with the mushrooms this time, as I had imagined that LSD was synthetic, and therefore could more easily lead to such mental states, whereas mushrooms tended to be linked to more spiritual experiences, rather than pure psychosis.  However, mushrooms can lead to as much of a psychotic experience as LSD, I discovered, if I take enough.</p><p>What an experience - beyond normal human consciousness, beyond the limits of the skin and mind. I'm now at T + 6.5 hours and still tripping strongly as I write this, though I'm back in my body for the most part. </p><p>The next day: I feel tired from the experience, and from staying up until 5 AM, but it was one of the most powerful experiences in my life, and so fatigue is par for the course.  I had some insights into my life and some poor decisions I had been making, and I am grateful for that, but to move only where the hand of god pushed me was the part of the trip that I will never forget.  </p><p>This trip was fantastic, scary, overwhelming, emotional, and facilitated a great amount of learning for me.  It was as strong or stronger than my other strongest mushroom trips, most of which were on 3.5 to 4 grams of cubensis.  It might even compare in sheer power to the 8 hits of LSD I took 20 years ago when I freaked out, but this was so much gentler mentally and so much more powerful spiritually that I still prefer mushrooms to any other drug.  I will be experimenting with them again soon, though for my next trip on these potent mushrooms I will probably take about 2 grams so that I have a more moderate experience.</p>"
}
