{
 "title": "Suprise! You're on Camera!",
 "author": "Jojocircusmonkey",
 "citation": "   Jojocircusmonkey. \"Suprise! You're on Camera!: experience with Salvia divinorum (24x extract) (ID 43722)\". Erowid.org. Sep 10, 2008. erowid.org/exp/43722",
 "substance": "Salvia divinorum (24x extract)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "0.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43722",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2008",
   "Views: 2490",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've done salvia many times. I really enjoy sharing the salvia experience with others. I shared 24x about a week or two ago with my good friend Jacob and his friends, Chris, Tom, and Alex, while we were all stoned. I quit salvia for a while by request of my therapist, so I let Jacob smoke first that night. None of them were scared, and Jacob loved it so much, he did it 3 times that night. <br>Well, tonight was a continuation, because Jacob wanted me to bring salvia to a party. We went out and smoked it in my car, for quiet. Jacob smoked several times once again, laughing hysterically and saying very profound things (NO BILLY, WHY ARE YOU PUTTING THE SKATES ON?! and I know which way is up! Its the direction the ocean is pointing when you arent standing in it holy shit, Im at Walmart!). Then he went out and pissed on a tree or something, because we told him to and knew he was high enough to listen. <br>Next, Alex smoked. He actually felt it kick in and giggled profusely, which was great, because he only felt minor effects last time. Next was me. This was all leading up to Alexs sister, who seemed nervous about trying it, and I wanted to make sure she wasnt afraid. I smoked a half bowl of 24x, worried my tolerance may be decreasing. I felt it slowly start to pull me in the usual way. Reality began to flutter. I looked over to Alexs sister. She is very cute, and although I had just met her and she is several years younger, I felt very friendly toward her. I struggled not to act stupid or drool on myself. The act of chewing gum and tensing my jaw really added something strange to the high-intensity part of the trip; the part I never remember too clearly. Shutter effects, repeated sounds and visuals.<br>Anyway, as I was sitting there, drifting in my mind, everyone was watching me. I suddenly realized that my vision was like a camera, and was being watched by other entities. I had the sensation that someone was narrating, here is the life of a teenage boy in his car, getting high. The view of everyone looking at me intently slowly dissipated, as my head drooped to the left and backward. It was as if the entity looking through my camera was turning away, and what I saw through that entity was very amazing and frightening. There were thousands of other tiny camera screens being rotated around in a sort of factory. Assembled, watched. The sheer number of them was what got to me. My tiny little life/scene, was so insignificant among all these others. Whats more, they were created for the enjoyment of some higher being. Its like Gods view of each of us, from our own eyes. I didnt panic, but I wanted my life back. I started to come to, and I saw everyone again, looking just as they were before. <br>Then, something strange happened. Alexs sister sitting next to me suddenly looked  exactly like my ex-girlfriend of 2-3 years prior. The first girl I can say I really loved, but the one who also cheated on me and broke my heart. I was sort of startled, but then I realized it wasnt her. But I couldnt just look at her anymore, because every time I did, she looked exactly like her. I suddenly felt like I had known her for a long time. I sensed what I had felt towards my ex-girlfriend before all the bad times. I felt like I was in love with her. I was embarrassed, and I turned away giggling, opened the door, and sort of fell sideways, hanging halfway out, laughing. But the feeling didnt go away. <br>Next it was her turn. I am intuitive, and I sensed that she was still afraid. I touched her and told her that no matter what, she would come back. She smoked while I was still halfway in reality. She got nervous and started to freak out a little. I tried to calm her. I had been nervous about giving salvia to a girl, and rightfully so. Girls tend to be a little more high-strung than guys. I kept telling her she was okay. She turned and said, Im not okay?? Why am I not okay?! Whats happening?!. I tried to reassure her that everything was fine. Then her phone rang, and I think that tweaked her out a bit, but it gave her something habitual to reattach to reality with. We talked and she calmed down quite a bit. Two more girls smoked it, who had been drinking, and they both had outbursts of laughter. <br>Now Alex, Jacob, and Alexs sister had to leave. I hugged her goodbye in the car, which seemed so familiar, and told her playfully, It will be ok! Cry on my shoulder, we will be together again soon!. She played along and we laughed, and I was tempted to kiss her, with my face so near hers. Why do I always go for my friends younger sisters? I dont know. But after she left, I felt empty inside. I feel like somehow, salvia made me fall in love with her. This feeling continued all night and I had trouble sleeping. The next day, it was completely gone. I wonder if salvia can cause telepathy like acid. Further experimentation required.\n\n\n"
}
