{
 "title": "20 Hours of Good Turned Horrible",
 "author": "CwUeReSzIeVrE",
 "citation": "   CwUeReSzIeVrE. \"20 Hours of Good Turned Horrible: experience with LSD & Mushrooms (ID 43732)\". Erowid.org. Jul 11, 2007. erowid.org/exp/43732",
 "substance": "LSD & Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "3.5 g",
   "oral",
   "Mushrooms",
   " "
  ]
 ],
 "footer": [
  [
   "2005",
   "43732",
   "Male",
   " ",
   "Not Given",
   "Jul 11, 2007",
   "Views: 5129",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At jazzfest this year I bought some acid and mushrooms the guy told us the acid was one hit wonders but we didnt believe him. O I took 4 hits and later an 1/8 of shrooms.  As the concert went on I was trippin out of my mind. I saw hundreds of planes in the sky and clouds were rushing past me. At the end of the concert we leave to be picked up by my mom and dad and I'm driving through the park as I realize that I'm in mario. So my parents drop us off at my car and I get in and drive off. </p><p>I ran a red light with a cop right behind me and I failed the field sobriety test so he arrested me and brought me in after an hour of fuckin with me at the jail he let me go and brought me back to my girlfriends house. So then me and my girlfriend are chillin in her room and now Im trippin wayyy to hard. Im so far from reality at this point and it hasnt even reached the hardest of the trip. So then I start screamin things like nooo to black and tellin her to come back. Because of all the screamin her mom comes up and finds out. At this point I can barley move and I cant talk. So they call my parents and my parents come to get me. The carried me to the car. I black out. </p><p>And wake up being wheeled into the hospital. All these nurses are askin me questions and I cant even think straight. I cant even process a single thought.  So they rip of my clothes put all the moniters on me start an iv. So then I think Im dying and I rip the iv tube out of the iv bag because I just wanted it all to end. I pulled the white sheet over my head thinkin that it would make me die.  Then they give me charcoal so I thought it looked yummy and I chugged it.  Bad idea.  I puked it alll up haha. So then for 4 hours my thought circled in the same exact path always leading to the conclusion of insane. I was literally insane for hours. They then had to put in a catheter not cool at all I'm trippin then a guy shoves a tube in my dick wtf.  I tripped for about 20 hours straight a good trip turning horrible</p>"
}
