{
 "title": "My Boyfriend Dealt It",
 "author": "Anonymous",
 "citation": "Citation:   Anonymous. \"My Boyfriend Dealt It: experience with MDMA (Ecstasy) (ID 43746)\". Erowid.org. Jun 20, 2007. erowid.org/exp/43746",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 43746",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 20, 2007",
   "Views: 10397",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nEcstasy is exciting and rare to come in contact with a truly wonderful roll.  In 2004, my boyfriend began selling this drug.  It was extremely profitable at first.  We would only do it maybe every weekend in the beginning.  Then more and more.  We probably averaged taking this pill 6 times a week. Not just six times but every time we would go up on the amount we would take.  I would stay awake for an average of 3-4 days a week with no sleep.  While I was doing this I was going to a university and struggling, and also working out and working 5 days a week.  In the beginning everything was fine, we were still the same weight and our faces looked the same...refreshed.  \r\nAfter about maybe a month into this I began to loose weight, in places I use to workout to loose day on end but never could.  My body soon went from in shape sexy, to skinny bean pole.  I went from 127lbs to 108 lbs.  Like I said, at first it was profitable, but not after we became serious users.  Usually on the weekends it was about 5 or 6 of us who always rolled together.  Sometimes my boyfriend and I were able to have sex on this drug, but other days he could not get it up.  Still all the same, foreplay felt phenomenal.  Sex felt phenomenal.  Every time I would take my pill, it usually took about 30-45 minutes to kick in(different other times).  I would snort it or chew it and some nights just swallow.  Some people plugged it (force it up you anus) but I never had that desire.  I even had my routine:\r\nMake sure I attempted to eat before another go around(usually didn't work). Go to the gas station and get plenty of powerade, vicks inhalers, candles, water, gum, and really good music. We would get to the house we always rolled at and I would hop into a very hot shower and wait for it! As soon as it was time to hop out, I would be rollin balls!  The vicks came out and so did the gum and plenty of cigarettes.  The next day after we would take 3-5 or 6 each we would be vegetables. \r\nI would look like shit at work and be very moody and weak.  My eyes would still be wide open and I would still have a bit of swing jaw or lock jaw with me. Eventually, without me noticing, I developed acne from sleep deprivation.  My dad finally approached me and said take a look in the mirror.  I looked like shit and got my act together. I packed up and went to AA\r\nAbout 5 months later I tried it again with new friends. I only took 2, but it was the worst roll ever. I never felt anything. I just felt uncomfortable, because if I am around people that are taking beans and I am not, I feel crazy out of place by myself. I quit and a year later I am still nursing myself and body back to normal.  My acne is still with me in scars and I am about to have micro dermabration.\n\n\n"
}