{
 "title": "Great Interaction",
 "author": "Matt",
 "citation": "   Matt. \"Great Interaction: experience with Gabapentin & Sertraline (Zoloft) (ID 43776)\". Erowid.org. Feb 9, 2007. erowid.org/exp/43776",
 "substance": "Gabapentin & Sertraline (Zoloft)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Pharms - Sertraline",
   "(pill / tablet)",
   " ",
   "1800 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 43776",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 9, 2007",
   "Views: 17438",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Lets see...it was Friday and when I woke up for school. I felt a need to be messed up, so I took 600 mgs of Zoloft. The rest of the day I was really cloudy, my vision seemed to have static around the edges, most people probably woundn't like it but, I do. Anywayz, that night there was a football game. I could sort of feel the Zoloft, but much of the buzz or high was gone. I went, receiving the 1800 mgs of Gabapentin during it. I took them immediately, so I would say around 7:30 or so. When the Gabapentin kicked in, around 8:00 or 8:15, I became very happy, yet tired at the same time. The world seemed to move up and down, as in a wave. At the end of the game, I walked up a hill to exit, and this hill seemed huge, but in reality it was barely even a hill. I went straight home and went to bad. </p><p>When I was in bed, I began to trip, I think maybe because of the darkness. Way walls seemed to breathe, and I closed my eyes. The image was very faded, but I thought I was in my kitchen, and I saw a bag of popcorn in the microwave. I love popcorn, so I went to press the start button, and my hand went though the microwave. I immediately jumped back to reality, and my arm was extended, my finger too, as if I was actually going to push the button. I closed my eyes again, and, the picture still faded, I saw a dragon and a knight fighting. I thought this was the greatest thing ever, as I had never tripped before, and watched the to fight until I passed into sleep.</p><p>All in all, I loved it. From that moment on, my favorite pill was Gabapentin.</p>"
}
