{
 "title": "Meet Wormwood",
 "author": "Noman",
 "citation": "   Noman. \"Meet Wormwood: experience with Absinthe (Homemade) (ID 43778)\". Erowid.org. Jan 12, 2007. erowid.org/exp/43778",
 "substance": "Absinthe (Homemade)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43778",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2007",
   "Views: 11156",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI have several wormwood plants growing on the west side of my house. I started them all from seed in Jiffy pots and they've been some of the easiest plants in my garden to grow. I cut them back several times each season and put the growth tips directly into a jar of 100 proof vodka. I leave this to sit in a sunny window for a month and let the brew take on a greeny amber color. If you use pure ethanol the extract will be bright green. This tincture can be used right out of the jar if you want to get the whole essence of this truely weird ass plant. The intensity of bitterness is truely beyond description. Wormwood this raw is also pretty damn toxic.</p><p>For a more civilized encounter, the tincture is distilled. An easy way to distill less than gallon quantities is with a slow cooker with an inverted lid and ice bag. Herbal medicine texts (like Jim Green's Herbal Medicine Maker's Handbook) explain the set up much better than I could here - anyway, it's easy. You need to start with the vodka rather than the straight ethanol tincture because the procedure is to gently evaporate the alcohol off the water and gunky sick making stuff. The psychotropic stuff follows the alcohol. It is important to filter the tincture thoroughly. It should run freely through three layers of coffee filters before distillation, otherwise the distillate will have a nasty cooked vegetable taste.</p><p>Also watch the drip and make sure it's nice and clear, a yellow drip means you've gone too far and should redistill. Starting with a pint of 100 proof vodka, start checking at about 7 oz of yield, and smell the vapors - if you're smelling plant instead of alcohol, it's done. If you do it right the result will be strong and smooth - bitter, but without the edge of the raw plant. But still dangerous.</p><p>Wormwood will take you to the moon but she takes so much out of you. I first tried doing shots of this, being stupid and having only experienced her in insipid absinthe. A wormwood overdose is a flight like you've never known followed by a crash into an abyss like you've never imagined as your whole system shuts down as it rids itself of your stupidity. A starting dose (for me, from my plants) is about 5ml to feel an effect.</p>"
}
