{
 "title": "True Consciousness",
 "author": "Leadingone",
 "citation": "   Leadingone. \"True Consciousness: experience with Nitrous Oxide (ID 438)\". Erowid.org. Jul 14, 2000. erowid.org/exp/438",
 "substance": "Nitrous Oxide",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 438",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 14, 2000",
   "Views: 17187",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have done nitrous on various occasions for years.  When doing nitrous there is a point that you reach when everything in the physical and non-physical world meet. Everything comes together as one and I feel it is the meaning of true consiousness. The most frustrating part of it is trying to describe what exactly it is that you feel.  Everything is so clear while on it and I have the whole 'life' thing figured out.  Everything good and bad all come together in a fully connected swirl.  It is very hard for me to put in to words but it is definitely a higher state of consciousness (moreso than just a drug experience).  I think that the eastern religions have this figured out and is ultimately where they are going or trying to reach when meditating and putting themselves in a 'trance' state.  I have tried many times describe it physically and I think that the yin-yang symbol possibly depicts the oneness of consciousness.  (Everything black and white...good and bad...conscious and un-conscious are part of one whole.) It is one big swirl and there is no way out persay. Everyone and everything thing is connected and is just part of the bigger picture. THere is much much more to this but as I said it is hard for me to put into words.  I JUST KNOW! So next time think of what I have said when doing that balloon and hopefully you can help me describe it into words.  If everyone could figure this out, and as a world see this big picture, We...as humans..would evolve and as James Redfield referenced in THE CELESTINE PROPHECY...A Mass Awakening would occur and make it possible to move to the 'next level', in which I believe is connecting life and death as one. I have come to realize this because of nitrous and if it sounds unconvincing please just give it a thought while on nitrous.</p>"
}
