{
 "title": "Insanity, Death  Years of Rebuilding - Peace",
 "author": "Throy C.",
 "citation": "   Throy C.. \"Insanity, Death  Years of Rebuilding - Peace: experience with LSD & Hash (ID 43800)\". Erowid.org. Jun 25, 2005. erowid.org/exp/43800",
 "substance": "LSD & Hash",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1.5 hits",
   "oral",
   "LSD",
   "(pill / tablet)",
   " ",
   "0.5 hits",
   "insufflated",
   "LSD",
   "(pill / tablet)",
   " ",
   "200 mg",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "1995",
   "ID: 43800",
   "Male",
   " ",
   "Not Given",
   "Jun 25, 2005",
   "Views: 70469",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>If LSD or another Psychedelic has left you dangled, confused, afraid and tormented;   Breathe  In time the trauma will unravel  </p><p>You have found a difficult path, but you are OK.  Living will still have beauty.  You are not alone.  I have seen total eclipse without hope of day.  It took years but I am happy with a loving partner and a healthy sane life.  I am a better,  more aware, more caring and happier person than I would have been without these experiences.  I would not change the choices Ive made:</p><p>It started with 2 hits of Blue Microdot.  The 16 hours or more of tripping was only the beginning.  It took years for me to stitch myself back together.</p><p>I ate 1 and a Half hits of LSD, and I insufillated another half.  Then I smoked about .2 grams of Hash.</p><p>All ready I felt uneasy, that something wasnt right.  It didnt take long before nothing was right.</p><p>It is unexplainable  Beyond a thought, or feeling, or sense.  A door opened  I was flooded with a new seeing.  I was unprepared and resisted.  This is when I met with insanity.</p><p>I wont go into the details of my complex and confused mind.  It still give me shivers.  Ill just say that without a doubt that I was now insane, and going to stay that way for the rest of my life.</p><p>Metaphors grew out of nothing.  A string of strange coincidences and some strong acid made me believe that I was suddenly in on some syndicate that operated on a psychic level., through metaphors and feelings.  I was being welcomed into the circle.  Insanity was a network.  I didnt want to be a part of but it was too late.  Then I realized I wasnt insane but dead I had Overdosed on LSD (I now know this is impossible) and I was riding in limbo needing to choose heaven or hell. My cousin who I was close to all my life was cool with smoking cigarettes, weed and was high on the same LSD(having a great time with it I might add) became to me, a manifestation of Satan. </p><p>My older brother who was as clean as they come and totally naive to drugs became to me a manifestation of Jesus. Of course I followed him around all night bugging the shit out of him to take me to heaven.  This scared the ever living shit out of him. At one point I pissed my pants on purpose to try and convince myself I was still alive But the trip had roots and that was not enough to snap me out of it.  </p><p>I was willing to do anything he suggested However with his inexperience he would tell me to do things like go to sleep  Go lay down in my room with the lights off.  There my body would feel as though it was disappearing.. That I was slipping into hell. (I wish now that I would have let go and experienced my inner workings). I lept out of bed and did anything I could think of to get to heaven. I even tried calling my parents who were away on vacation. I went through my peak doing these random and frantic things as I was certain I was going to fall into hell at any moment.</p><p>That night was long.  As my cousin and I came down from our trips he ultimately talked me into finally going to bed and getting some sleep I dont recall if I actually ever slept.  He left the next afternoon.</p><p>What is most formative and important is the week, and then, years afterward.  A journey few people will ever make in this life.  The first week I spent afraid, confused, unable to eat or sleep.  Alone in a true dementia.  Id watch Television and it would be spewing messages directly to me.  EVERYTHING was a metaphor for heaven or hell, or a message from this syndicate.  I began to believe this blanket of metaphor was a secret code that the world spoke and I was getting hip to it.  Going down to Strawberry fields.  Still, nothing really made sense all a jumble.</p><p>One night that week I went to a friends house and believed every sentence they said to one another was linked to my dementia.  Another close friend, who definitely knew I was in trouble said that he believed life was a test and that everything had a reasonable and rational answer.  Dunno if thats absolutely true, but it snapped me into my first taste of reality in over a week.</p><p>I decide it was time to drive home to my parents house to reconcile my mind.  I entered the house not really knowing what to say or do  I began telling them about this experience I had Telling them that I had achieved a higher state of consciousness etc.  They looked frightened and confused.  I realized that so was I. Suddenly I broke down  Began telling them about my use of LSD, Marijuana and other  Drugs, how I was out of my mind, paranoid and afraid.   Just the facts.  My mother cried and my Father listened stone silent.  That night was the most relieving and uplifting of my life.  Likely the most difficult for my parents all they could do was listen and hug me  This ladies and gents was way out of there league.  I knew it I knew I was teaching them.  What mattered was that I was in a place where I was loved and accepted.  </p><p>I was 16 years old and I slept on the floor at the foot of their bed. I released all my secrets.  If there is a sacred confession. This was it  I was cleansed by fire.  I felt as though I rose from ashes  and I did.  That night I was utterly humbled and humiliated by existence.  I was a child again but also evolved.  </p><p>The next week I didnt leave my parents house I helped them with various jobs and house projects If I found spare time, Id find something to fill it.</p><p>It was like every day I died.. and re-awoke.  Every day I teetered between heaven and hell.  Small decisions like Which juice shall I buy and drink? were wrapped in meaning and metaphor that extended beyond daily life, seemingly deciding my eternal fate.  Just under everything was a mechanism, a test or a plot  Unraveling.  I saw powers that we are all capable of  The power to live or to die any moment I began seeing through the facades of judgment and morality.  My learned belief systems eroded and were replaced with experience.</p><p>Id raise my concerns with a close friend who had had similar experiences.  He would console me, encourage me to believe in what was in front of me, work with what I knew and be wise not to open up these thoughts to the wrong people, as most would just label me insane and become afraid of me.  He was of course totally right and a good friend for his patience and protection.</p><p>For a time I lived my life shadowing my true thoughts and feelings about daily situations.  I made some stunning life decisions.  I traveled overseas alone to search my soul and mind.  I shed all my addictions, tobacco, TV, caffeine, sex, all drugs, and even meat/processed foods.  This was all between the ages of 16 and 23. It took me over a year till I could even talk to my cousin again.  Many more till I could truly trust him.</p><p>I wish that databases such as Erowid, The Shroomery etc. existed when I went through this journey.  Their help could have turned this vicious, horrific and difficult experience into something meaning full and useful from the beginning.  </p><p>Much of my delusions  werent so at all.  This life, this existence is a blanket of meaning and metaphor.  Everything we see, touch, hear is a creation of our own perceptions.  This can drive you mad, or make you powerful, exalted and blissful.</p><p>I am 27 as I write this.  The lessons and impressions left by the LSD trip, the full week of dementia and the years of re-evaluating evolved me to a state of consciousness few ever reach.  I am at peace with myself and my existence.  I dont want to die, but I am virtually unafraid of it.  I see through the bullshit of war, violence and destruction.  I seek and participate in peace.  I believe we all wish to.  LSD helped push these to the front of my consciousness.  I had to go through hell.  But these moments I now live are truly awake and free.</p><p>To this day I wonder if I'm actually alive or if  Im alone - A drifting consciousness lingering in an endless construct of my own imagination - It doesnt matter really.  I found peace.</p>"
}
