{
 "title": "The Fun Side of a Broken Arm",
 "author": "Cal",
 "citation": "   Cal. \"The Fun Side of a Broken Arm: experience with Nitrous Oxide (ID 43844)\". Erowid.org. Sep 10, 2008. erowid.org/exp/43844",
 "substance": "Nitrous Oxide",
 "bodyweight": "20 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 43844",
   "Male",
   " ",
   "Not Given",
   "Sep 10, 2008",
   "Views: 13296",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Name: Callan</p><p>Current Age: 15</p><p>Current Date: June 13, 2005.</p><p>Experience Date: Exact date unknown, sometime in 1999.</p><p>Drug: Nitrous Oxide (gas, administered in hospital)</p><p>Location: Hospital (Melbourne, Australia)</p><p>When I was nine I broke my arm. I won't go into the details, but I will tell you that it hurt like hell. Whence I finally arrived at the hospital, I was told to stop complaining and was administered with morphine. All this did was make my leg (where they stuck the needle) hurt instead of my arm. What seemed like hours later some doctor man came in told me (maybe not in these words) that my arm was fucked and needed to be fixed. To fix it they didn't have any high tech medical procedure, they were just going to realign the bones by hand. They needed realigning because after the bone had broke it went like this: __-- instead of like this: ----  .</p><p>Anyway, to the point. They put me on one of those wheely beds and wheelied me into the OR. Here they asked me what flavour I wanted. What's this you ask? Why, in hospital you get to choose your flavour of nitrous oxide. Cool, huh? I chose strawberry. They put this little stawberry canister onto the gas tank and then put a mask over my face. Instantly forgetting there was actually nothing there, I tried in vain to eat the delicious gas. After a few seconds I drifted off. When I try to remember what happened then I have this memory, I can't tell if it's a real hallucination or what my mind made up to fill the gap. It is of TV static. But not regular white and black, but bright green and white with a few other colours floating around too. On this green TV screen there are faces. They are the faces of my dad, who was in the operating room with me, the doctor, and a nurse who didn't actually exist but did in the dream (or trip, hallucination, whatever).</p><p>My dad's face looked worried about something as yet unknown that the doctor's face was going to do to me. So was I. The doctor looked very angry - I had done something wrong and he wasn't happy with me. Then suddenly there was this horrendous whirring sound, like when something gets stuck in a bicycle tyre, except several thousand times louder. The sound was physical - I could it punching me very hard all over my body. It was very, very uncomfortable. It felt like something was happening to my arm. Then I realized that that terrible noise was a drill and that the thing happening to my arm was that it was being drilled. It wasn't very pleasant. After kicking and screaming for a while the world came back into focus and the drilling stopped. I felt very sedated and calm for some time, but then returned to normal.</p><p>In conclusion, I think nitrous would have been more fun if I hadn't taken it while my broken arm was being contorted by some evil doctor who didn't even do it right (it needs further contorting because my arm bone is now growing wrong, thanks to him). I will endeavour to find some nitrous oxide in the future and take it in a more hospitable, less hospitalized, environment.</p>"
}
