{
 "title": "Out of My Skin",
 "author": "Chantelle",
 "citation": "   Chantelle. \"Out of My Skin: experience with Paroxetine (ID 43879)\". Erowid.org. Apr 10, 2007. erowid.org/exp/43879",
 "substance": "Paroxetine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "50 mg",
   " ",
   "Pharms - Paroxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 43879",
   "Female",
   " ",
   "Not Given",
   "Apr 10, 2007",
   "Views: 8559",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI was prescribed Paxil after a several-month episode of depression during which I did little else but live at the computer. I hardly slept, ate, or spoke to people at all.  Before starting this medicine, I felt surreal, desperate, tired, and lost. That was my baseline.</p><p>After several weeks on Paxil, the full effect of it began to take place.  I had motivation and opinions. However, I also began to have very serious side effects.</p><p>One side effect of Paxil was my constant, nagging, insatiable hunger.  I ate a lot of food, all the time.  I had absolutely no self control when it came to food, and after stuffing myself, I would eat some more because of the irresistible mental need to do so.  I gained around twenty pounds during the six months I was taking Paxil.  Gaining weight like that will counteract any antidepressant qualities of a medication.</p><p>During this time, I also became very volatile and explosive.  I would violently burst into a rage at very little provocation, and my emotions switched up and down within a matter of minutes.  My mother and younger brother walked on eggshells while I was on this medication.  I was very reactive, and as I mentioned before, I had no self control.  On Paxil, I was a total kleptomaniac.  I couldn't walk into a store without stealing something; it was usually something I didn't even want, but I would steal it anyway.  Impulsiveness was a big part of my experience with Paxil.</p><p>Perhaps the worst side effect was the continuous bodily malaise. I felt so uncomfortable in my own body that I was always fighting the incessant urge to physically rip the skin off of my arms and legs.  This medicine definitely did not improve my mental state.</p><p>I am aware that some people benefit greatly from Paxil, but it was not the right medicine for me.  I hope this account gives some insight to people taking, planning to take, or related to someone taking Paxil. -Take Care-</p>"
}
