{
 "title": "The Danse Macabre",
 "author": "Therese",
 "citation": "   Therese. \"The Danse Macabre: experience with Mushrooms (ID 43891)\". Erowid.org. Oct 1, 2007. erowid.org/exp/43891",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43891",
   "Female",
   " ",
   "Not Given",
   "Oct 1, 2007",
   "Views: 2809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am 18 years old and consider drugs to be a sort of option for entertainment. I am recognized as one of those 'all-star academic achiever' kids that everyone secretly hates. But that isn't me. </p><p>I traveled to Seattle to pick up cocaine and hydro for the weekend. I only buy from dealers I trust and don't know people in my town. I was hanging out at my dealers house for a few hours just smoking and talking about various things when he asked me if I'd be interested in blacktop mushrooms. I had no idea what 'blacktop' was and declined because I have an extremely creative and self-manipulating mind as it is. As I left my friend walked me out to my car and said, 'You know, I think you'd really enjoy these so I'm going to give you some just to try.' I don't turn down free drugs.</p><p>The next day at home it was around 8pm and I had yet to do any coke or even smoke pot. I was contemplating eating the mushrooms but wasn't sure if I could handle myself around my parents. My dad walked into my room to tell me they were going to go gamble, this means they won't be back until 3am. I saw this as my chance. Around 9pm I ate the 1/4 ounce of mushrooms with an orange juice chaser.</p><p>Around 30 minutes later I began to feel rather anxious. I have a prescription for lorazepam (ativan) and I took one of those. I sat in bed and decided that I would not leave my room. I noticed that my stomach felt funny. It didn't hurt and I wasn't sick, it just felt funny. so I started to giggle about it. I laughed for a long time about how my stomach felt, 'funny'. I decided to get on my computer to talk to my best friend. I for some reason thought that if I used a phone it would suck out my brain through my ear. I wasn't scared of it, it was just a matter-of-fact and I didn't do it. </p><p>Talking to my friend online, the words were just falling off the screen. I decided I could peel them off if I wanted to and so I did. Then I began to put them on my body, thinking they were tattoos. This whole time I knew how incredibly ridiculous everything was but I couldn't help being completely enthralled with my affixation with the smallest things. It seemed like I could bring myself out of the high if I focused on being rational or I could sink deeper into it by glazing my eyes and overcasting my brain with irrational verbal beliefs.</p><p>I told my friend about my new tattoos and she suggested that I eat the words. I thought this was the best idea in the entire world. I peeled some words from my computer and slowly placed them in my mouth. In my head I thought they were too wet to eat and they kept slipping out of my mouth. I asked my friend to come and pick me up so we could dance. She agreed.</p><p>Once I stopped talking to her I put on The Faint, possibly the best music for this situation besides floyd, the doors and beatles, and I laid in my bed. The music is an electro-synth kind of music and the second I laid down all brain activity stopped. All I could think of was 'Let it go, let it go. Sink sink sink.' And so I did. I sunk in my bed for what seemed like hours. I just kept going. I was convinced that the music was eating my body and the only thing left was my soul to keep me alive. I wasn't scared at all, instead I was laughing, I just thought it was the funniest thing in the world. </p><p>When one of the songs was over I kind of snapped back into reality and had this uncontrollable urge to dance. I got up and spun. All the walls were moving in on me and the lines in my hardwood floors were moving back and forth. I closed my eyes and fell. In my mind I had fallen to the beginning of time and, (rationally thinking again) since people didn't wear these clothes in the beginning of time I would be sent to jail. So I got completely naked.</p><p>By the time my friend came to my house I had made it to the kitchen (still naked) and had taken a potted plant from inside our house, took out all the dirt and was trying to replant it on the tile. All the while I was laughing because of how funny everything was. When my friend came in she was laughing her ass off and I thought she was laughing at the same thing I was (which I still don't know what the hell I was laughing at). She asked me if I was out of my mind and I responded, 'No, you are the one that is going to be put in jail for wearing those kind of clothes.'</p><p>She helped me replant the plant back into the pot and told me to get some clothes on because we're going for a ride. I was still convinced that I couldn't wear clothes and the only thing I would wear was a bath towl because 'That is what people wear these days.' She's a cool kid and let me just wear the towel. We walked to the car and at this time it was kind of cold and windy and the first thought in my head was 'Oh no, the ice age is beginning.' I quickly ran back and put on snow pants and a ski jacket (this is in march).</p><p>We started to drive in the downtown area. it seemed like she was going 60mph. the lights, the motion, the blurred faces on the street. It was a mind riot.. The faster the frenzy around me, the more I was detached from reality. We drove a quite a ways from town into some orchards. I was calmed at this point and just enjoying the euphoric tingles in my body. She stopped the car in the middle of some private road.</p><p>'Let's dance.'</p><p>We opened the car doors, blasted the Beatles and danced in the headlights. I began to notice what I was wearing and laughed at myself. I stripped off my clothes and danced naked. Soon, my friend was naked too. She wasn't high on anything but has a very, 'Why the fuck not' attitude. I'm not sure how long we danced in those orchards, or if anyone noticed two naked girls driving back into town but none of that mattered at the time. We were children again.</p><p>She dropped me off at my side door, naked and happy. I flopped in my bed and couldn't sleep. Instead I just thought, and I didn't stop. I couldn't believe the past few hours of life had actually happened. It made me laugh. Instead of thinking how stupid I was, how diluted, fucked, crazy or twisted I just smiled. It's something I'll never forget. A life experience. And it's fucking beautiful.</p>"
}
