{
 "title": "I Snorted The Blue Pill",
 "author": "Subvert",
 "citation": "   Subvert. \"I Snorted The Blue Pill: experience with Sildenafil (Viagra) (ID 43938)\". Erowid.org. Mar 17, 2007. erowid.org/exp/43938",
 "substance": "Sildenafil (Viagra)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "insufflated",
   "Pharms - Sildenafil",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43938",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 17, 2007",
   "Views: 86295",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI snorted Viagra the same way one would snort some coke or a lil speed. I did the krypto-wonder drug, Viagra, right up my nose. In preparation for nasal inhalation, I first pulverized the little blue beauty with the hard plastic shell of a pill cutter, the very pill cutter I had just used to chop my 100mg tablets in half with, leaving me fifty mgs, the recommended dose. First order of business is to remove the electric-blue skin. The crushing renders it nearly intact, like a snakeskin thats been shed; I just toss it in my mouth and swallow, for it is fortified with some residue of the caplets drug.\r\nThen, just like with cocaine and other powdery alchemy, I chopped it into tiny bits with a razor blade, forming a small pile of powder the likes of an anthill. I drag the blade, cocked and angled just so, to form long slim lines of powder that trail off the aft end of the blade like a jet stream. An IKEA straw from a bulk pack that lies in third drawer down, left of the fridge, is cut just so. Nostril bows to straw end, and in a flash the slippery line vanishes, slinking its way toward my brain. \r\nThis is not my first Viagra experience.  Though I suffer from no sexual dysfunction per se, I really wanted to know what all the hype was about. I found after a bit of on-line research that it is very easy to cop a script and a bottle of this blue magic. Just get on the net, youll have it in a coupla days. I have been doing some trial runs lately, about once per week, with my live-in girl friend and soul mate. \r\nShe, mind you, is in her early thirties and has experienced a real sexual awakening in the past several years. She loves to fuck, a lot. We have sex and make love an average of 3-4, maybe 5 days per week, and in my late thirties it can be a little hard to keep up. So I thought, what the fuck, lets try it. I have a long history of drug experimentation and I love to fuck, so I am willing to try pretty much anything. After a few trial runs I am pleased.\r\nI have not actually used any streets narcotics in over 13 years. I smoke grass frequently; drink wine and beer more than some, but heavy narcotics just kind of stopped fitting into my lifestyle. That said, I had done enough street crap to know that nasal inhalation is the most effective method of ingesting anything, short of main-lining of course. I am though, just a fucking suburbanite, so no injecting unless its from the Doctor or Im injecting a flavor syringe into a holiday turkey.\r\nWhen snorted, all the ill side effects of Viagra are amplified. Normally, it can cause nasal congestion, a red and flushed face, a slight sinus type headache and this strange purple aura seen around anything that is bright. Its really quite trippy, reminiscent of acid trails, though you can still feel the ground and your cigarette isnt breathing in between your fingers.\r\nAfter snorting, these symptoms show up nearly immediately, especially the congestion. As well though, the magic of Viagra, the cause we seek, kicks in right away. Within 5 minutes, I was in the shower with my girl, sniffling and snorting but rock hard, all it took was the slightest glimpse of her very perky A-cup tits and I new this was going to be a great afternoon. I found myself with a devastating dick control, so goddamned hard and ready to plow.  It doesnt exactly give you greater longevity, but the control afforded by the power boner really helps. We went into a long shower session that ended up on the bed. After a time, I was just too turned on and exploded. Up to that point, we were having some epic sex, but that was only the beginning.\r\nOn any normal, drugless sex day, that would be it, a day. I am usually done for the day as far as sex goes once Ive cum. It wasnt always this way, it may be a sign of age, health, who knows, but it is my reality. Now, with my nitro burnin hot rod dick, it just kept coming back. Within minutes, for no apparent reason the dick rears up as if detached, ready for more. My girl got fucked that day, fucked savagely with three or four long lasting sessions spanning the next few hours. I came again and the dick came back once more. Id have to stop periodically just to rest, catch my breath and towel off. This is a workout that beats any gym, this is real deal sexual aerobics, those with conditions, be aware.\r\nThe beauty of it is that there is no restraint, no trying not to cum. She got flipped, fucked, spun and twisted every which way, we used a vibrator on her clit while fucking, she just spread out, legs and arms akimbo, exhausted as well, while I just boned the ever loving life out of her. Finally, we just collapsed in a fleshy, sweaty heap, too tired and winded to go on. It had been an ethereal, surreal, sensual journey.\r\nI have, with normal oral ingestion methods, noticed a slight lingering effect the next day. Not with snorting. This method ensures the full-blown Viagra experience in a short time span. Orally, one must wait up to an hour for full effect, as stated earlier though, while I was still choking down the bitter blue pill drips, my dick was looking me straight in the eye.\r\nOverall, I give the whole experience a 4 out of 5 stars. I would never want to substitute the Viagra fuck-fest for normal lovemaking, it does have its place though, in my 'approaching middle age, watered down version of the sex-drugs-rock and roll lifestyle'. While you wont see Jesus or paint sunflowers, in fact you may not even write clever prose afterwards, but you will have a great time, your partner will dig it and youll feel cool at having gotten actual script w/ out having to see your Doc. The next step will be to try some trail mix, a blend of ecstasy and Viagra. Stay tuned for a new installment!\r\nMost Candidly, Subvert\n\n\n"
}
