{
 "title": "Complete Loop of Existence",
 "author": "Scyrus",
 "citation": "   Scyrus. \"Complete Loop of Existence: experience with Salvia divinorum (6x extract) (ID 43949)\". Erowid.org. Sep 11, 2008. erowid.org/exp/43949",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "165 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 43949",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 11, 2008",
   "Views: 6362",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n~12:40AM, June 16, 2005.<br>I had decided to try Salvia tonight. The main reason being that I when I took my garbage-can to the road, I caught a whiff of the minty-aroma that Salvia stores and took this as a hint. I went up to my room, got all the essentials for a Salvia smoke, and had only one dim light on in my room. I put my laptop to play Nitrogen by Juno Reactor, as always. I crumbled some of the new plain leaf that I had received and lit it up. About 20 seconds in, I started to feel the slight buzz of Salvia. I decided to try out the Standardized 6x this time, as the Non-Standardized 10x had done nothing before. I took about 1/6th of a gram and put it in the bowl, lit it, and inhaled.<br>Wham!       ----------No, really . . . WHAM!!!!!<br>I dont even remember exhaling the smoke from my lungs. The feeling was so sudden, and so confusing, that I had lost track of who I was, where I was, and what the hell I was doing. I looked down in front of me at my supplies I had used to smoke with. My vision was faint and dim like the reverberation effect when a video camera is pointed at a blank TV screen, but the supplies (lighter, bong, Salvia, trash bag) I could see seemed like they were 10 feet apart from each other. I tried to realize what the purpose of this trip was, but the feeling and quest had already engulfed me; I was to put back all my credentials in their appropriate spot in a certain amount of time. Why? I have NO idea. It was like something or someone would find them and punish me for having them (i.e. my mother).<br>So I sat there, DAZED as ALL HELL, holding my bong in my hand, trying to figure out what it was that I was holding. Reality came in for a split second, just long enough to say Its a BONG! So I got up, still dazed and confused to eternity, and wobbled over to my bed with the bag of leaves that I smoked in one hand and my bong in the other. These items were supposed to go in my dresser and my desk  on the OTHER side of the room. I had NO idea what I was doing or where I was going. So I finally made it to my desk and put the leaves in safely, then went over to my dresser and hid my bong. The whole time, the music was playing, and it did nothing other than scare the living shit out of me  the beat and noise it made was very frightening and deceiving. I dont know of any other way to put it.<br>I picked up the rest of the things that needed placing back. Again, still dazed out of my mind. I couldnt see straight for the life of me and I was beginning to panic. Ive never been drunk (only buzzed) but from what Ive experienced with alcohol, I dont think you could get any more drunk feeling than this. The feeling I had was worse than fear. It was a feeling of never coming back to my real self. At that moment, I realized just how much I missed reality and being normal. This Salvia feeling was not to my liking at ALL. The feeling that this would never end was in the back of my head the whole time, but I kept telling myself that it would be over soon, and that it had already been a few minutes since I had inhaled the smoke.<br>I panicked even more. My head felt like it had been filled with lead. It also felt like part of my brain (possibly even my mind) was extending out of my ears, like it was trying to expand (funny, huh?). I felt like I wasnt in my body. It resembled the feeling of being at the point of asleep and awake at the same time. I could SEE what I was doing, but I wasnt exactly CONTROLLING it. Everything that I did was out of sheer habit, and nothing more. I had no mind to guide my body and tell it what to do, and I was scared shitless that this feeling would never end. I took a few deep breaths and drank some water to try and calm myself down (myself = my mind that I couldnt control).<br>I went downstairs and outside to try and get some fresh air. I was stumbling<br>around aimlessly on my porch thrusting my body back and forth to get some air into my lungs as if it were the first time I had tried the little technique of breathing. My cat was on the rim of my pool, in which he quickly sprang forth towards me and ran his body on the side of my leg. I went around the corner of my house where my dog was barking uncontrollably and tried to whistle for her to come back near the house. Instead of a whistle that came out of my mouth, I made the noise Shhhh! Odd.<br>I went back inside, still panicking to get rid of this non-existing feeling now, and went back upstairs to take a shower. I managed to set towels out and turn the faucet on a decent temperature for the water. I jumped in, and splashed water all over my face trying to wake myself up from this nightmare it had become. I managed to clean myself, only asking controversial questions like if I had washed my hair yet, but not remembering a thing that I had done 20 seconds ago. I peaked out of the curtains at my sink to see if I might be coming down from all of this, but as I saw all of the colors and light from my sink look as if a sunburst had appeared in my bathroom, I decided to stay in the shower a bit longer to see if the water might help to wake me.<br>What seemed 10 minutes later, I stepped out, with still a very euphoric-like feeling, got dressed, and went back into my room which had become a horror scene in my mind from what had happened in the last 30 minutes. All of the fear I had was still with me. I could have broken down and cried from the agony that my mind had weighed upon me. The feeling of this fear was similar to the feeling of being so utterly and dreadfully bored to the point that you just give up on finding something to do and feel like doing nothing else but dieing. Although it may have been that feeling, multiplied by about 5.<br>About 10-15 minutes later, I had made up my mind that the feeling WAS going to pass, after all. It had come down quite a bit since taking a shower, now that I had realized it. I just hoped that I wouldnt have to interact with any of my late-night family members that might be wandering the house. I decided to interact with a game on my downstairs computer, instead. I always got myself engulfed by the game, wasting hours of enjoyment playing, so I decided that this would probably be my best bet at losing some time to release me of this prison I was in. About 30 minutes passed, and I looked around in the kitchen at my surroundings. They all seemed very still and quiet, and more importantly, I was back to myself again.<br>I sat there for a few minutes, trying to recollect what all had happened to me in the past hour or so, but couldnt even comprehend the fact that everything that happened in that 1 hour time period seemed like 5 minutes. And now, I am writing this report, informing you that it will be a loooooong time before I embark on another journey with Salvia. I think this was her fair warning of telling me that I am not quite ready  and I dont plan on arguing with something that can throw me for a complete loop in my existence. Maybe a later day.\n\n\n"
}
