{
 "title": "Switching Bodies with an Alien",
 "author": "Chief",
 "citation": "   Chief. \"Switching Bodies with an Alien: experience with Salvia divinorum (20x extract) (ID 43964)\". Erowid.org. Sep 11, 2008. erowid.org/exp/43964",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43964",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 11, 2008",
   "Views: 3314",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me start off by saying this was not my first experience with Salvia. A couple of months earlier I had tried Salvia, but could not feel the full effects. I was feeling gravity pushing against my face and I was a little bit off balance but other then that I did not experienced anything too intense.</p><p>It was me and two other friends, we were all sitting in a circle with the lights off. I was sitting on the floor as one of my friends (Dave) began to hit a bong with 20x Salvia. After a couple of hits he began to trip out. We sat around for a couple of minutes and then decided that it was a good time for me to hit the bong, Since Dave was already coming down from it. I switched spots with him and began to feel inticipation as I held on to the bong with the bowl full of 20x Salvia, I let my other friend (Andrew) light it for me because he was more experienced with salvia then me or Dave. Andrew began to light it as I began to relax. I inhaled deeply and held in my breath as my friend took the bong out of my hands. The longer I held in the hit, the stranger my face felt. It felt as though it was changing, after a couple of more seconds I exhaled. I had underestimated the effects of Salvia, and was not prepared for what had followed.</p><p>I began to feel as though the room was turned 90 degrees and that we were all sitting on the wall. I began to feel fear and confusion at this point. I started to struggle with my balance as I tried to get back on to the floor, which through my eyes was where the left wall should of been. I felt like I was knocking things over and banging my head against the wall. As a way to not injure my self I began to crawl on the surface I was previously walking on. The longer I stayed there crawling, the more I heard children's music and had a sudden urge to escape the room. I told my friends this later that day and they told me that I did not crawl on the floor, all I did was stood up and walked over to the other side of the room, with them helping me walk in the right direction, and step out into the hallway. I did not break anything because my friend had removed any obstacles in the room that would cause me to fall over and break something or injure myself.</p><p>Once I was in the hall, which at that time was extremely long and had bright white walls, the children's music began to fade away and the floor was were it was suppose to be. I still had no balance and was using one of the walls to support me. After a couple of minutes I got an intense body buzz. I then began to feel the full effects of the mysterious and wonderful plant. I could feel myself entering my body, I couldn't remember leaving it but I felt as though I was a different person. As my friends tried to talk to me (I couldn't understand english at this point) I began to realize that I was different than them. Thoughts began to cloud my mind as if I had a mild case of amneasa, then I remembered what I had forgotton. I was from a different universe, somehow I had switch bodies with an alien being and that my old consciousness was lost, and that the people in front of me were not my kind.</p><p>I remembering thinking that human kind was a threat and that my life was in danger. Also I knew that eventually I would have to tell these beings that I am not who they thought I was. That I was somehow brought to this universe and switch bodies with there former friend. Then I thought to myself that this could be dangerous, so I decided not to tell them until later on. All three of us moved back into the room and I sat onto the bed. I felt as though the bed and I was surrounded by the universe and that a higher being was watching me. I began to feel my face, which at this point felt unfamiliar. My hands were cold and felt as though they were not my own. Gravity was also constantly pushing me as I began to remember that I had smoked Salvia. I started to realise I was hallucinating and the universe began to disappear. </p><p>It took a couple of minutes for everything to be back to normal and after it was, it took me about an hour to remember everything that had happened to me. This was my very first intense experience with any drug and I will remember this for the rest of my life. I recommend having someone watch you while you smoke Salvia because during the experience I had little control over my entire body.</p>"
}
