{
 "title": "Evidentual Mushrooms",
 "author": "Bewilder",
 "citation": "   Bewilder. \"Evidentual Mushrooms: experience with Mushrooms + Marijuana (ID 43997)\". Erowid.org. Aug 11, 2005. erowid.org/exp/43997",
 "substance": "Mushrooms + Marijuana",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 43997",
   "Male",
   " ",
   "Not Given",
   "Aug 11, 2005",
   "Views: 12077",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>What a beautiful, intense, magnetic trip last night on the Grand Magic Mushrooms of Mexico.  I ate a mushroom peanut butter cup; I remember as it crept it slowly eased in, with an intense body high, transluscently overlapping with the weed making everything melt before my eyes. </p><p>The painting on the wall coiled and flowed.  Drawers lightly and effortlessly opened and closed.  I recall time being the butt of the moment, not even there.  I found my finger suddenly back where it was a split second ago, 3 inches from the light switch.  This seemed to repeat itself for several minutes.  </p><p>As I reached to turn the light out, my finger suddenly returned to where it had been just a half-a-second prior, at incredible velocity and kinetic strength.  The yellow of the room's light glowed warm and autumnal.  Such intensely different setting than the basement, where I masturbated (be mature about this one) into incredible crescendo.  I recall spacing off indefinately all night, smoking heavy amounts of herb and becoming completely free of the boundaries of time.</p><p>I called a friend wice throughout my trip, as she was tripping, too. After calling her the second time I was wondering confused when I was going to call her for the second time.  I recall time just suddenly stopping for many phases, me in complete oblivion, a similar feeling to the alteration of time due to weed, only at much more profound and vast boundaries.  It was these sort of bouts which took the stream of time and turned it into rain. </p><p>Time was out of order.  As I recalled what I had just done, a moment prior, the literal chronology of time intuitively rearranged by unsteady pace, a pace I couldn't begin to be even aware of.  What an unspeakably incredible feeling it was to fully hopscotch the slim and mossy stepping stones of time.  Sparingly withdrawn, and still abundantly involved; as time played its glossy, fluidic musical chairs, I seemed to almost become disoriented which is to say I did fall into the cruel depths of petrafiable oblivion.  As the trip reached its supposed peak it no longer crept, but pounced, and the negative energy periodically arrived, bouncing in and out of existence like electrons. </p><p>I recall a desert, as I was the sand, quite obviously.  Wind blew maternally frittering away the crusty surfaces of my knees, laying there dreamily in bed, feeling the grand and beautiful undertoe of Now becoming a specific quintessential.  That very precise and flawless Now was steadily Now, a rare and sensual surface into one small spanse of time.  I recall some sort of vision, with someone speaking slower still in mild, passive voice, my voice.  'You're not gonna remember this are you?  Are you?  Are you?  Are you?  Are you?......' and on and such so forth. I said 'I'm somewhere.'  It seems when it comes to finding confirming, full-circle literal 'answers,' for lack of a better word, from mushrooms is difficult for me.  It all feels so baffling, I think, because they last a good amount of time, creating a gorgeous banquet of experience. </p><p>Salvia Divinorum, for me, brings faster learning because it doesn't last long.  It's hard to come out with what I've come to discover last night with mushrooms, and water them down into mere words.  Salvia Divinorum brought much more obvious and intense learning because the experience is much more intense and devouring and epitomous than mushrooms are, probably because you don't eat salvia.  If I ate marijuana, I honestly wouldn't even realize i was stoned when it did kick in.  Anyway, a part of me wishes I wrote as I went last night, but I didn't want that to be an element of the trip, sitting there taking notes, as a passive observer.</p><p>The results of the trip would have been not nearly as good.  It occurred to me that a mushroom trip is a whirlpool, downward and inward spiral into frantic ultimatum, clean and longing epiphany a breasy cacaphony so thick as to almost liquid.  I went to bed begging my body to disappear, leaving me with dreams.  I can't remember my dreams from last night, but I have no doubt they were beyond anything I've dreamt.  I have no doubt that they reached full Lucidity.  I had to have some Valerian Root supplement with my last bowl of the night. It did help, but I woke up groggy, fatigue and stoned....'</p>"
}
