{
 "title": "Accessible, Addicting, but Fun",
 "author": "Clampet",
 "citation": "   Clampet. \"Accessible, Addicting, but Fun: experience with Inhalants: Freon (ID 44)\". Erowid.org. Sep 10, 2000. erowid.org/exp/44",
 "substance": "Inhalants: Freon",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 44",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 23867",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>My first experience with freon was excellent.  I tried it after an awesome night at a rave.  You get the same 'wa-wa' effect as a single n2o ballon except with just a more little potency.  I soon found myself emptying whole airconditioning systems in a single evening.  The most difficult problem I had was getting the dose right, too much and you just black out (stitches in the head suck, had my share), not enough and you get the 'wa-wa's'.  Somewhere in the middle was an excellent hallucent plain. I found the best was with my eyes closed.  I could see the surroundings around me..walls, cars, cardboard-boxes, ect., but with an amazing  brilliant color coating (much better than any acid trip I've had) like the background from a Grateful Dead poster.  </p><p>I had many 'friends' visit during my 30-60 second highs.  Voices and faces would come in and go.  The other bad part was the occasional (every 2-3 days or evenings) vomiting.  This is caused from the oil and other impurities not found in n2o)  I was usually too high to care, I have a weak stomach anyhow (more than 3-4 beers an hour makes me sick).  </p><p>I did find myself addicted for a couple of months, although it was mostly a mental addiction not physical.  I was a junky, if you can become one off of freon.  I was spending 75% of my free time huffing on any A/C that wasn't in plain sight of a street.  Mostly at schools or churches that i knew no one would be at in the middle of the night or Saturday afternoon.  I eventually did get caught by the police (simple tresspassing and destruction of property, no charges pressed, the cops didn't really know what to do with me), I was making too much noise behind a business that backs up to a neighborhood.  </p><p>The reasons I choose freon was of it's accessibility (every car, home, refrigerator, trailer has some, you just have to have a pair of pliars and a drinking straw or ink pen), it's duration (all motor skills return in 5-15 minutes, vs. alcohol 2-6 hours), and it doesn't come out in blood or urine tests.  </p><p>Some suggestions: don't do it at a location that you frequent (your house or car), freon is expencive to replace. Second do it with a friend in case you black out so they can keep an eye on you. Third sit down, I had stitches in the back and top of my head twice.  I have since turned 21 and can get alcohol for myself or find acid, although i still enjoy the occational 'binger'.</p>"
}
