{
 "title": "It Has Now Been Done",
 "author": "Raoul Duke",
 "citation": "   Raoul Duke. \"It Has Now Been Done: experience with DMT, Salvia divinorum (15x extract) & LSD (ID 44002)\". Erowid.org. Jun 18, 2006. erowid.org/exp/44002",
 "substance": "DMT, Salvia divinorum (15x extract) & LSD",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 1:00",
   "2 hits",
   "smoked",
   "DMT",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44002",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 18, 2006",
   "Views: 49017",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me take a timid peak</p><p>Into deaths</p><p>Other kingdom</p><p>How is one suppose to describe the indescribable?  There is truly no way I could ever account to anyone what truly happened.  I myself cant quite come to terms with the heights I reached that night.  but ill try, ill try my damn harderst.</p><p>Ive done drugs before.  I am very experienced with acid, enjoy shrooms and DMT, and have used Salvia on a number of special occasions.  I found that even though DMT is amazingly intense and powerful, I can still keep some perspective of what is happening.  even in a full blown DMT hyperspace journey I find that there is some nerve in my mind still connected to reality. This does not apply to salvia.  I have lost myself in salvia before, an experience I am both eager to do again and yet I am terrified beyond all belief at the sheer intensity of the experience.  </p><p>I have done a LSD and DMT mix before, to profound and utterly mind blowing results.  and on one other occasion I smoked both Salvia and DMT together.  It was tricky at first.  I had to have enough salvia on top of the DMT crystals in order to protect them from the open flame.  I think deep but narrow bowls work best for this. The heat of the flame will vaporize the DMT while burning w/e is on the surface.</p><p>Anyhow I stared things off by coming to the realization that I wanted to go somewhere I doubt many people go.  What would happen to one if they unleashed the three most powerful psychedelics known to man on their own mind.  Would they snap?  Self destruction would be a likely possibility.</p><p>Anywho I put my fears away and embraced this as some sort of spiritual orgasm in which I will ride all the way to the almighty peak and back.  First things first, I needed the acid, lots of it.  Then I needed some DMT, an easy thing to do in California at 5 forty 4 on a warm Saturday midway into the summer.  But salvia was tricky.  Odd, seeing that it was the only legal substance in the list, and I couldnt find any, a number of websites wouldnt ship to California, and the only too known headshops werent equipped with the drug. Anyhow I ran into a 'sub'friend who had a gram of salvia 15x.  very potent.</p><p>I arranged for a good friend to sit with me.  He would remain somewhat sober, avoiding the acid and sticking to good marijuana.</p><p>I think ill skip all the preparations.  all thats necessary is I had a pre made and specially arranged mix of salvia and DMT already prepared for me and already packed in a bowl (in a bong).  I thought I could probably get a good two rips before I was completely twisted.</p><p>The acid was medium in strength, and after one hour of riding out one hit I decided that if I was to do things they must be done right.  So I dropped another blotter.  That did the trick.  The waves and spider web thoughts were intense, the patterns and visuals were of profound beauty: it was time.</p><p>We were in my room of my apartment, a warm comfortable place.  I propped myself up on my couch and my bud held the bong and lighter for me.  I positioned it and held the carb shut.  I gave him the signal and he began to light the mix as I took my first rip.  it was long, and I held it for a good fifteen seconds.  As I exhaled I could slowly feel the rushing sensation of the DMT pronounce itself at the same time the odd 'salvia gravity' sensation became noticeable.  I knew that in order for me to break through I needed to take a monster rip, and I needed to hold it.  So thats what I did.  I dragged that fucker for the longest time, advising my friend to hold the lighter a little further away from the mix so that the flame wouldnt touch the DMT crystals arranged at the bottom of the bowl.  the salvia extract started making funny sounds as it burned.  </p><p>As I held my breath a loud whining sound soon enveloped me.  I never exhaled.  My friend said that I closed my eyes and entered a trance as I fell back onto the couch.  Good thing he was there or I would of dropped the bong.\r</p><p>                   let us peak</p><p>                   into deaths</p><p>                   other dream kingdom</p><p>    'and alice followed the rabbit down into the rabbit whole..'</p><p>          jjjjjjjjjjjkkkkkkkkkkkkkkkk jjjjjjjjj kkkkkkkkkk</p><p>*&*&^&**&^^*&</p><p>            ?!?!?!?!?!?!?!?!?!?!?CC</p><p>and that is C minus four</p><p>                  z?  </p><p>no</p><p>                  D?</p><p>no</p><p>                  8?</p><p>yes.</p><p>       eight what?</p><p>bannas</p><p>                    what was happening?</p><p>it took me a while to figure out what I was seeing.</p><p>I still cant quite say.</p><p>some say it was a mass of needles</p><p>I was looking for the hay</p><p>        the needles all smiled</p><p>werent that bad in the end</p><p>I was stuck without reality</p><p>    the goose without his friend\r</p><p>I was peaking over from the edge of some great peak of (mountains?  Or was it the warted body of some massive toad..) Something, looking at what seemed to be a pulsating valley.  Take the intensity of an acid pattern, the rushing sensation and fucking amazing breakthrough high of DMT, and add salt, pepper, stir, and yes, add some salvia.  I wasnt sure of what I was seeing.  I wasnt sure what it was.</p><p>It was a valley, incredibly real, yet it seemed to spiral out in front of me like some, well, big spiral.  The valley walls stayed still but the matter of which they were made of seemed to be sliding and melting.  as I stared at the valley I saw it elongate and slowly I took off.  Was I peaking?  wasnt I already at the peak?  Holy fucking Christ if this isnt the peak then where the fuck am I going?  </p><p>Idk where I went.  The valley lost all shape and form and simply became something else.  it was some sort of warped tube at which I was traveling down at amazing speeds, invincible to all aspects or forces of nature.  Suddenly, I know because before it happened I could feel that I was about to take a step to places no one had been to, suddenly I detached.  The best way to describe it is that what I thought was the peak was magnified ten fold, and I lost it.  The trip itself became the reality at which I was judging the current reality on.  Normal wasnt what I was when I was baseline, normal was now defined as the first thirty seconds of the trip.  What I had just entered was a place beyond time.  </p><p>The spiral went white, and what I saw was a white space.  Sort of like a negative shot of the space we have come to know.  What should of been glowing stars were big balls of black matter.  I think I looked down at my feet and realized that this whiteness was infinite.  Spaced fairly evenly throughout this white space were the big balls.  At first they seemed alien, then they became somewhat more placid, a little crispy, too much pepper, then suddenly all the balls exploded in vibrant colors and once again I was rushing.  The DMT was coming in hard, what had taken it so long?  Hot fucking Christ almighty I still hadnt peaked.  Never had one minute seemed so incredibly fucking long.  slowly the white place melted into blackness and I was indeed space.  The stars were indeed stars.</p><p>Then I blacked out.  I cant remember anything clearly after that, too intense. </p><p>What I can remember was one thing.  At some point I was very high in space, I was 'close' to the edge of space.  If I was to reach out with my arm I would exit space and enter the beyond. It was then I saw the great machine, the interworkings of the universe.  It was literally a great machine.  I had turned away from the edge of space and was looking down at everything, and hot damn it was a machine of which the knobs and levers on it were of sizes unheard of.  I dont know why this single image of the peak has stayed with me while most of everything else has simply faded into one astonished wow.  </p><p>It was like my mind took one desperate snap shot of the single highest point during the trip, and that is all I have to hold onto, the last fragments of something so amazing.  there is really no way I could describe the feeling that I was part of that machine, yet even though I already new that my part to play in the machines workings was planned out, I could see that I didnt have to follow those rules.  What would happen if I strayed?  Chaos.</p><p>The very last memory of the peak I have is of looking at the machine and realizing that it was breathing, then, well, I dont quite know.  Perhaps the peak continue to grow, perhaps I entered the beyond.  What happened still clouds me, two days after the experience.  Perhaps a few hours of meditating will bring back what happened.  </p><p>All I know is that when I opened my eyes and saw a mass of pink pixels staring at me I was amazed that it seemed so ordinary.  As I came back to acid baseline I swore that this was real and that I am finally normal.  Thats how high I was folks, so high that when I came off the DMT/Salvia mix the acid seemed mundane.  I was amazed.</p><p>I then began to go dance in an effort to try to explain to my friend what happened.  After that I simply sat down and enjoyed the acid as it did odd things with my carpet.  Idk if it was some lingering side effect of the previously consumed combo, but I could swear that all the patterns I was seeing afterwards were somehow magnified and intensified.  Even two hours after I had blazed and was slowly coming off the acid I could swear that the patterns and visuals were more 'real' than they should of been.  Didnt bother me though, it gave me a feeling that I had been left with something from that experience</p><p>I dont think ill ever understand what happened there is no way I could really describe the utter horror/fear/amazement/aw at what happened. I think the best way to put it is that I had sex with my mind.  My mind took me and completely fucked the shit out of me.  She threw me on some invisible bed and for 8 minutes we fucked harder than any animal.  Sick yes, seeing that I was technically fucking myself, but it was incredible.  Will I ever do it again?  yes, I probably will.  it was so amazing that I think I will prob have to live it again.  Perhaps ill push it a little further, up the dosages a little more, go into the beyond...</p><p>I will be honest, the entire time I was twisted on the three drugs at the same time I had an intense fear that I had finally taken my mind on a ride that I couldnt afford.  But fuck, why do people ride roller coasters anyways?</p>"
}
