{
 "title": "Kicked Out",
 "author": "Thedude369",
 "citation": "   Thedude369. \"Kicked Out: experience with Salvia divinorum (10x extract) (ID 44027)\". Erowid.org. Sep 11, 2008. erowid.org/exp/44027",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:00",
   "1 capsl",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 10:55",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44027",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 11, 2008",
   "Views: 2163",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took out the bong with pre-loaded salvia, sat down in front of my TV against a make-shift padded wall made out of pillows and such resting against some old speakers. I took the bong hit of salvia and put my bong down to my right. Still holding onto it I thought, as I always do, When does this shit start working.</p><p>Suddenly I was gone. I was shot, pulled, ripped, torn in all directions, reality fell all around me, like cheesy fake walls to some stupid fake reality set/façade, a cruel joke someone/something is playing on us. Blackness and black patterns enveloped me. I was in salvia space, I remember having the distinct feeling like I wasnt welcome there yet, like I had come too far 'in' this time, and I subconsciously tried to get out and had no control over it, like I was being kicked out! My identity/ego tried to come back as different things, like looking from the perspective of objects and parts of my own body (odd). I was the ground I was sitting on, I was the pillow I was leaning against, I became the bong I was holding, then I and all of my awareness/consciousness was centered on and in my right hand, I felt as though I was shot into my right hand and was able to look at all the little workers that made my right hand function. The workers were not entities or divine spirits of any sort, they were just, things, working.</p><p>I was flung through somewhere and landed on their level, in their reality. It looked as if I were in some sort of control room or busy office space (confusing), inside or far far away from my own body. A strong sense of family connection overwhelmed me at this time, connections felt towards these workers. The connections dissolved and I felt I had caught a glimpse of something perhaps I wasnt meant to see, I thought, My right hand and everything I think to be real and mine and sane is run by forces out of my control!!!! A sharp jolt and I was looking through my own familiar eyes again with some interesting reality creases, I looked down at my right hand, there was no bong, just a rather large water spill, I panicked for a moment thinking Im still not right then checked behind the speakers where I normally keep it, to my surprise I pulled it out a little less full then before. I have no idea how it got behind the speakers. </p><p>Note: I had been smoking pretty potent weed with friends all day that day and I had also dosed an xtc pill and been rolling since about 1:45p.m. earlier that same day. I smoked the salvia at 12:40am.</p>"
}
