{
 "title": "My Head as a Match",
 "author": "MorphoneMania",
 "citation": "   MorphoneMania. \"My Head as a Match: experience with Hydromorphone & Alprazolam (ID 44042)\". Erowid.org. Jul 8, 2007. erowid.org/exp/44042",
 "substance": "Hydromorphone & Alprazolam",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 0:10",
   "4.0 mg",
   "insufflated",
   "Hydromorphone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44042",
   "Male",
   " ",
   "Not Given",
   "Jul 8, 2007",
   "Views: 22839",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started with one 4 mg hydromorphone (HM) pill, which I crushed in my bowl with a metal spoon, as not to waste any, I licked the bowl and spoon clean and created a line. After the HM was prepared I downed 0.5 mg of alprazolam and waited 10 minutes. This seemed like the longest 10 minutes of my life. I was so pumped about trying this new drug and could not wait to hit a line. I rolled up a $100.00 bill, which I got just for the ocassion, and continued to snort the line. </p><p>As soon as the powder hit the inside of my nose I felt as though a match had just been lit in my head. All of a sudden a mild wave of relaxation fell over me. I began to smile uncontrollably, not because I was high, but because I new this would turn out to be an awesome journey. I walked into the family room to turn the TV on, I timed it so that I would feel all of the effects at 11:00 eastern time, adult swim time.</p><p>I sat back in my favorite chair and as soon as the familiar futurama chime kicked on the TV I felt the euphoria kick in. Every 2 minutes the feeling increased two fold until I hit a point of bliss. I had never in my life felt so amazing. Warm, Fuzzy, Happy, and loving don't even come close to describing the way I felt. The only way to describe where I was is by saying that I had just taken a 4 hour field trip to the garden of eden.</p><p>All of lifes greatest problems seemed to go to a complete standstill. Nothing bad exited in my mind. Life, love, and happiness are all I could focus on. All of my problems faded into a series of vividly colored friendly cartoons. The slightest attempt at comedy on any of these shows would make me laugh uncontrollably. It felt like I had all of the happiness of MDMA with NONE of the stimulating effects. </p><p>As my high and the TV shows continued I never felt the effects start to diminish, as a matter of fact after about 3 hours I entered 'the nod'. I don't know why I was able to stay out of the nod for so long (could have something to do with the alprazolam) but it was very welcome.</p><p>Waking up every few minutes and catching a few minutes of sealab and then falling right back to sleep was my special little world of happiness for the last hour of my conciousness. After that I settled myself deep into the loooong comfy 'cloudlike' chair and feel to sleep with the TV on in the background.</p><p>All in all this is an experiance that I desperatly desire to repeat, however, HM is not the easiest thing to come by, so all I have for now is the memory of my night as a match.</p>"
}
