{
 "title": "A Lower Level of Consciousness",
 "author": "Sun Tzu",
 "citation": "Citation:   Sun Tzu. \"A Lower Level of Consciousness: experience with DXM (ID 44073)\". Erowid.org. Mar 2, 2010. erowid.org/exp/44073",
 "substance": "DXM",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "708 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 44073",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 2, 2010",
   "Views: 8573",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was not my first experience with DXM, although it was the most enjoyable and memorable. I had extracted the DXM from 2 8 oz. bottles of maximum strength cough syrup via the agent lemon method, because my friend, Shaela, wanted to try it after I told her about it. We each drank our half of the extracted liquid, and immediately left to visit another friend, Sandra. Over the course of the 2 hours that we spent at Sandra's house, the effects of the DXM gradually came on. The 'heavy limb' feeling and the '3rd person vision' sensations were most prominent.\r\nWe decided to go hang out at a nearby Chili's restaurant. The three of us each ordered a beer there, and Sandra ordered some food (Shaela and I weren't hungry, probably because of the DXM). Shaela and I were absorbed in our DXM experiences, which by now were quite strong. Because of our interest in the altered state of consciousness, we were not particularly talkative, so Sandra (who still didn't know that we were tripping), started drawing a picture on a napkin. This caught my attention, and I watched, utterly fascinated by the simple act of drawing.\r\nWith unaltered consciousness, I probably would have just seen it as 'Sandra drawing a picture.' On acid, I would have seen it as a sort of gestalt form: picture and artist together as one (that would be considered a 'higher consciousness'). DXM, however, was taking me in the other direction. Not only was the picture separate from Sandra, every other part of the act of drawing was separated as well. The napkin was separate from the picture, which was separate from the ink it was made of, which was seperate from the pen it came from, which was separate from Sandra's hand, which was separate from Sandra's mind. These seperate elements had only the most tenuous of connections between them, in my perception (probably imparted by what was left of my rational mind).\r\nSuddenly, it dawned on me: I had achieved a 'lower consciousness!' This was almost a spiritual experience for me, which I had never had with any other drug, or even with my previous uses of DXM. Even my experiences with seeing the unity and wholeness of things on acid did not produce this reaction in me. Maybe I just had to see everything separated and distinct on DXM to realize that the opposite was true with acid.\n\n\n"
}