{
 "title": "Good Morning",
 "author": "Orestes",
 "citation": "   Orestes. \"Good Morning: experience with Datura (ID 44095)\". Erowid.org. Aug 27, 2006. erowid.org/exp/44095",
 "substance": "Datura",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 44095",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2006",
   "Views: 4736",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>During the summer of 2002 I came across a very beautiful Datura in the Southern Pyrrenees (near the French/Spanish border)</p><p>I immediately fell in love with this plant and I cut of one of the seedpods and took it with me. After returning to my camp I hung it on a tree-branch to let it dry.</p><p>Once dried I gave the pod a place of its own in the front pocket of my backpack and that's kinda where it stayed until I got home in April 2003. I gave my pod a special place on this little altar I set up, sort of as a souvenir (heck, it was more than that, she was my traveling companion for more than 6 months)</p><p>I'll soon tell you what happened next but first this:</p><p>Travelling is fun..or so they say. Along my way I had lost a loved one, a lot of faith in things I used to believe in and of course..a lot of money. Once back home I felt this huge gap between me and the people I used to call friends, between my life before and after embarking on my (spiritual) journey.</p><p>I was not in the best frame of mind, no girlfriend, no job, no money....</p><p>It was around that time, a month or so after coming back home that the pod openened up. I noticed  this when I came home drunk one night and thought 'why the hell not?' I put the kettle on , holding the pod and all it's seeds in my hands. I then put my precious traveling companion in a cup and bathed her in the fresh-boiled water.</p><p>For about 20 minutes let it cool down and while waiting I wrote a goodbye-letter to my flatmates saying something like: 'I love you guys but I can hear datura calling me, she's a woman and she's waiting for me.</p><p>I don't know what's gonna happen but she's too horny to let her walk on by.' I took my woman upstairs, into my bedroom and sat down on my bed while drinking her. She tasted o.k., just as I thought she would (I had smoked some seeds from other datura plants before and the taste was familiar)</p><p>I really don't know how many seeds where in that pod but it seemed like millions of them where swimming in my cup.</p><p>I drank the whole thing, including all of the seeds that weren't sticking to the bottom or sides of the cup.</p><p>This was about one in the morning.</p><p>Next thing I know I wake up feeling all refreshed... there I was, in my bed with the morning sun coming through my window and a cup with something in it that was once my beloved traveling companion.</p><p>I woke up feeling like I'd had a weird dream but it was too far away to recollect anything of it. No nasty side-effects, no hangover, no nothing....I just felt better then I did before.</p><p>I don't know what happened, I've read and heard reports of people who took way less dried seeds than I did and going completely nuts on 'em. I guess she just didn't want to hurt me.</p><p>I was at a point where it seemed like I had nothing to loose, I guess she went easy on me for taking my chances and surrendering my life into her hands.</p><p>That was the only time I tried Datura-tea. I still smoke Datura seeds quite often, it gives me a soothing feeling, almost nursing.</p><p>( about 5-10 seeds per smoke)</p><p>The experience I described above is now about two years ago, sometimes I wonder whether I did really wake up from the arms of Morpheus my beloved Datura put me in that night, who knows; maybe my body is strapped to a chair in some mental institution right now.... heck...reality?. Theres no such thing.</p>"
}
