{
 "title": "The Duster Driver",
 "author": "Nick",
 "citation": "   Nick. \"The Duster Driver: experience with Inhalants: Duster (ID 441)\". Erowid.org. Jun 29, 2000. erowid.org/exp/441",
 "substance": "Inhalants: Duster",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 441",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 29, 2000",
   "Views: 29948",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nBowling isnt the most entertaining sport when sober. But when your fucked up it can be pretty fun.\r\nAfter skipping half the day of school me and 3 friends decided to go bowling. But first a stop at the computer store. We picked up a can of duster (air keyboard cleaner). Now the day became very interesting. \r\nIt was probally my 3rd time doing duster. Other times were not very intense but this time was unexplainable. We start passing the can around the car getting fucked up each time. We went bowling for a few hours which was very hard. I fell 5-6 times and tossed the ball backwards ect.\r\nThis is were the story gets interesting. On the way home we all passed it and took as much as we could, including the driver. (mistake!) Im sitting shotgun so I take 3-4 hits then pass it over to the driver. He takes 5 or so. As we drive down a 5 lane street. BAAAM!! The car smashes into a curb. Everyone is screaming 'Stop the fucking car!!', 'WAKE UP!!' going around 45 on the sidewalk for about 50 yds. I look at the driver. His head was leaned all the way back and eyes rolled back.\r\nSuddenly the car drifts onto the 5 lane street at 3:00 in the afternoon. 'That was crazy' im thinking to my self. right when errrrTT!@!!  the car jerks onto oncomming trafic. We dodged a red grand prix and slid to the other curb! BAMM!! A kid from in back throws the car into park. As we come to a complete stop we are 2 inches from hitting a huge computer store sign.\r\nLesson: never take any inhalents and drive, you can get really fucked up doing inhalents. there alot more intense then some think!\n\n\n"
}
