{
 "title": "A Gentle Night",
 "author": "Siduri",
 "citation": "   Siduri. \"A Gentle Night: experience with Poppies & Alcohol (ID 44120)\". Erowid.org. Sep 11, 2008. erowid.org/exp/44120",
 "substance": "Poppies & Alcohol",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 ",
   "oral",
   "Poppies - Opium",
   "(tea)",
   "  T+ 2:00",
   "  ",
   "oral",
   "Poppies - Opium",
   "(tea)",
   "  T+ 3:00",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44120",
   "Female",
   " ",
   "Not Given",
   "Sep 11, 2008",
   "Views: 11685",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend and I decided to try poppy tea after researching it on the Internet.  We obtained our dried poppy pods from the internet.  I found wildly conflicting advice regarding how many pods to grind up for a dose of tea, with some recipes advising only 1 pod and some calling for as many as 20.  I think this problem may stem from the difference in size between various strains of poppies.  We had gigantheum pods so I decided to err on the side of caution and ground up four pods for the two of us.</p><p>I put the ground powder into a french press and added the juice of half a lemon.  I let it sit while I heated a cup of water on the stove.  Before the water was quite boiling I added to the french press and let the mixture sit for a few minutes.  Then I pressed the herbage down and poured off the tea into two glasses, measured carefully so the doses were exactly the same.  I added honey and stirred.  The taste was not great but not as foul as I had been led to expect.  It wasn't unlike chamomile; my friend said it tasted like mate.  The aftertaste was the worst.  We gulped it down in a few sips and started to watch a silly movie.  It was about 7pm when we drank the tea.</p><p>I felt the effects in my fingers first.  They felt tingly and weak.  The effect gradually spread up my arms.  I started to get irritated by the movie--it was an action flick, and I was feeling like what I really wanted to do was light candles and listen to something slow and trancy like Loreena McKennitt.  Loud noises and flashing lights were not doing it for me.  But my friend was into the movie so we watched it to completion.  At some point the weak-tingliness made it all the way up my arms and into my chest, blossoming under my ribs in a very pleasant sensation.  I lay back on the couch and just relaxed, and it was nice.</p><p>After the movie was over (about 9 pm) I was feeling definite physical effects as described, but I wasn't feeling euphoria or any mental effects.  My friend agreed that his experience was relatively mild as well.  We decided to make a second tea using the grounds we had already steeped.  We figured this mixture would be half as potent, and would enhance our experience without drastically upping it.  When I got up to make the second batch of tea I got dizzy and weak in the knees and had to lie down.  Eventually I got up again and finished making the tea.  The second batch was much weaker, and therefore much easier to drink; it tasted almost pleasant.</p><p>We got in bed and lay around for a while.  I started to doze off and to dream, but I decided I would rather have more of an active experience, so we got up and went for a walk.  That turned out to be a very good idea.  The night air was extremely pleasant and the lights of the city were beautiful.  We went to a park and I lay on my back watching the clouds.  We were both feeling a gentle, mellow sense of well being at this point--a very light touch of euphoria, nowhere near as intense as, say, drunkenness.  We were also feeling very 'normal' mentally, and having ordinary conversations, even though we were aware of the effects of the drug.</p><p>We both started to get parched throats, mine so intense that it actually hurt to talk.  We decided to go to a pub and get a cold beer.  That beer tasted soooooo good.  We sat in a corner and drank our pints slowly and talked.  We were both feeling gentle and happy.  I started to get sleepier and sleeper and it became difficult to hold my eyes open, so we finished our beers and walked slowly home.</p><p>I went to sleep almost immediately.  It was about 11:30pm.  I woke up at 8am in the morning with a mild headache that quickly went away.  I went to work and felt normal all day.  My friend reported that the effects lingered longer for him; he slept late, got up at 10:30 feeling refreshed, but didn't feel totally normal until noon.</p><p>Overall I would say the experience was mild and pleasant.  I plan to wait a while before trying it again because I am somewhat concerned about the addictiveness of opiates, but next time we will probably increase the dosage.</p>"
}
