{
 "title": "What a Beautiful Place...",
 "author": "ASCII32",
 "citation": "   ASCII32. \"What a Beautiful Place...: experience with Wild Lettuce, Passion Flower, Catnip,  Mint & Scullcap (ID 44140)\". Erowid.org. Dec 22, 2005. erowid.org/exp/44140",
 "substance": "Wild Lettuce, Passion Flower, Catnip,  Mint & Scullcap",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 joints/cigs",
   "smoked",
   "Various",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44140",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 22, 2005",
   "Views: 15513",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is the most amazing blend of herbs that I have ever tried...I really love it.  This is my story, forgive me if I mess up a little...I'm still under its effects.</p><p>I was on a school french trip to Quebec, and my friend came up to me the day we had to pack to go back home.  She looked a little tired, so I asked her what happened the previous night.  Apparently, her and her friends got ahold of some canadian grass and some 'Ecstasy Cigarettes'.  She told me that it was the one of the greatest experiments ever.  I couldnt believe this, because I had never heard of 'ecstasy cigarettes' before.  I figured it was worth a try.</p><p>So, about a month later, I'm on Google looking for the product.  After a few minutes of searching, I found a good site that looked legit.  Their product:  Cannabis Free and Tobacco Free herbal ecstasy cigarettes.  Wow!  That looks like it!  I purchased it for about $5.00 including shipping in total.  The package that arrived was the same as the site.  It's got 20 cigarettes that look just like normal smokes, and burns the exact same as well.  So, I walk outside to my favorite place at the entrance of the woods, and light up.</p><p>I took a medium puff, held it in my lungs for about 5-10 seconds, and exhaled.  All of a sudden, my spirits seemed lifted, and everything was more detailed.  So, I walk into the woods to a boulder that I sit on, and enjoyed the smoke.  Everything was different.  It was like I had never been here, it was all strange and new, but in a remarkably adventerous way.  I loved it.  All the grass, trees, flowers, and just...everything seemed beautiful.  'Wow, am I supposed to be here?'  I wasnt out of my mind, I was just kind of amazed.  Once I got out of that phase and was thinking clearly, I realized that I overreacted a little, and laughed about it.  I felt great.  I took out my cell phone and talked with someone that I really cared about, and my whole life at that point seemed great.  I had a second cigarette just for the hell of it, and it was pretty much the same as before.</p><p>Overall, this isnt really a trip, but its an amazing feeling.  I instantly felt great with these things, and I admired the beauty of nature.  The taste was pleasant, the thoughts were great, and I will definately enjoy this pack of herbal smokes.</p>"
}
