{
 "title": "The Dream Juice",
 "author": "HippieJason",
 "citation": "   HippieJason. \"The Dream Juice: experience with Calamus (ID 44156)\". Erowid.org. Mar 7, 2007. erowid.org/exp/44156",
 "substance": "Calamus",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "5 in",
   "oral",
   "Calamus",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44156",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 7, 2007",
   "Views: 14055",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have never been one to just go and try every drug out there without any information first.  So after studying up quite a bit on Calamus Root, it seemed something that I would greatly enjoy.  I wasn't looking for anything to give me a 'trip', merely something for relaxing, possibly meditation purposes.  I read that you could steep portions of the root in cold water in your fridge overnight, so i decided this is how I would try it first.  I filled an average 12-16oz water bottle and dropped approx 2-3' of the root in and let it sit overnight.  The next morning I poured the yellow-ish liquid into another container and removed the root pieces and threw them away, placing the liquid back in the fridge.  That night, I drank the entire mixture, sipping on it over the course of around 10-15 minutes.  It didn't have a bad taste (as I had expected it to). </p><p>After approx 30-40 minutes I felt this warm blanket of relaxiveness begin to cover me.  It was a very enjoyable, mellow experience, and I noticed I began to lose advanced dexterity. (I couldn't play video games any more)  And my focus kept drifting away from the video game.  So I went into my bedroom and meditated a bit.  It was rather late in the evening, and it also made me rather sleepy.  After about 1-2 hours of mellowness, I drifted off.  This is where some of the most intense dreams I have ever had started.  It was absolutly incredible!  My dreams were SOOOO vivid and lifelike.  I woke up once through the night, after I had forced myself awake from my dream.  At that point, I realized that the whole thing had been a dream.  I went back to sleep and was able to pick up where I had left off, and resumed dreaming.  I woke up the next day feeling refreshed, and very happy.  </p><p>I wasn't sure if this was a coincidence, so I tested it again the next night.  This time with approx 4-5' of the root steeped again in cold water overnight.  However, I forgot to take the root out of the water that day, and wasn't able to remove it until later on that night.  The liquid was slightly a bit more yellow than the previous night.  It still tasted fine, and I removed the root pieces and again drank down the 12-16 oz of liquid.  Same time frame, same feelings. . . the best way I can try to describe it is when you have your first couple of alcoholic drinks.  Not to the point where I'm drunk, but feeling very relaxed, and almost euphoric.  I do not go into this EXPECTING and WAITING for it to arrive.  I just relax and calm myself, and it will slide up on me very pleasantly.  </p><p>After various experiments with dosage, I have found the best amount to be between 4-6' of root steeped in water for however long I want (I have left it in up to 3 days without a negative affect) It seems to get the most out of it after the second day. . . so I'm not sure if it does any good to let it sit longer, I had just forgotten I left it in there.  </p><p>People may use this for a variety of purposes, but I have found my purpose for it. The 'Dream Juice' making dreams more incredible, more rememberable, and more vivid.  Sometimes I have woken up from a dream wondering if it was in fact real or not.  Another awesome thing about this root, is that in the dreams, once I realized it actually WAS a dream. . I began to be able to control certain aspects over it.  As opposed to other dreams where I'm just kind of 'Taken along for a ride'.  And being able to control / manipulate my dreams has greatly increased my enjoyment of such dreams.</p><p>After some research, I found a few sources advising not to develop an extract from this root, and to NOT steep it in hot water.  I have not tried either of these methods, and do not see a reason to.</p>"
}
