{
 "title": "Cheaper Than Cigarettes",
 "author": "Irimias",
 "citation": "   Irimias. \"Cheaper Than Cigarettes: experience with Inhalants: Trichloroethylene (ID 4418)\". Erowid.org. Dec 18, 2001. erowid.org/exp/4418",
 "substance": "Inhalants: Trichloroethylene",
 "bodyweight": "65 kg",
 "header": [],
 "footer": [
  [
   "1995",
   "4418",
   "Male",
   " ",
   "Not Given",
   "Dec 18, 2001",
   "Views: 17443",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>***Disclaimer***</p><p>I do _not_ recommend trying this stuff or other hardware store inhalants. The masturbatory fascination of being extremely high for cheap can lead to serious health problems, like death or coma. Remember, if you work in a laundry, it's not impossible for you to DIE over a trichloroethylene jar, someone has already tried this cool experience. It isn't a research chemical, it is only a chemical not to research with.</p><p>Several years ago I heard a girl saying that she inhaled trichloroethylene a few hours before and she was still having a moderate buzz. I know how street voices go, I didn't know the girl, I didn't ask her for anything, I was quite stupid to invite a friend as moron as me to go to a hardware store. I don't even remember the first time we did it. We did it together a lot of times, I did it alone. We did it in the street, we did it at home. It was a stupid and disrespectful idea, a social sado-maso approach to drugs. We loved alcohol, but we had discovered the way to get high for at least 1/20 the price of an alcohol high. When I met an alcoholic friend, I didn't drink with him, I always took my plastic bag containing a piece of cotton soaked with the stuff. In my car or in my pocket there was a bottle to recharge the cotton when all the trichloroethylene was evaporated (into my lungs). We found that the drug was more efficient if we inhaled deeply through the nose. The buzz was instantaneous and several times more potent compared to oral inhalation. We had even curved the cotton so that we had a 'U' shaped inhalation device with its 'arms' directly slipped into our nostrils. We called this technique the 'direct', introducing this word in our micro-social slang. We made idiot games like 'let me see if you can take more hits without oxygen than me'.</p><p>The experience started with auditory strobe effects and if we didn't take more than five or six hits it didn't come over. Then I can't say anything precise about the vision, 'cause the auditory and memory field of the trip was predominant. Loops, terrifying dejà-ecoutés, sentences that I was convinced I had heard and would continue hearing for millions of years, like I was trapped in mnemonic and acoustic loops eternally. But the bad thing was that it wasn't unpleasant at all, so we carried on with this habit, although not daily, for about two months. One day I was sitting in a deserted pub inhaling from my bag and I heard my parent's voices searching for me. I turned my head and no one was there. It was anti-social. When we did it together we isolated ourselves in our individual trips. Once, finally, when I was inhaling outside of a pub with some friends drinking beer, I fainted over my bag. I had a confused dream, very fast subsequent visions, I can't remember anything but some faces. One of my friends took me and lay me down, allowing me to breathe oxygen and to rouse out of the trance.</p><p>It may have been a coma, if I had remained over the plastic bag.</p><p>This was several years ago. Now I'm very different. I'm learning from sacred plants. I think if I only will see someone doing this stuff, I'll try and explain how stupid he is.</p>"
}
