{
 "title": "A Low Calming Feeling",
 "author": "Anonymous",
 "citation": "   Anonymous. \"A Low Calming Feeling: experience with Crack (ID 44240)\". Erowid.org. Jul 26, 2007. erowid.org/exp/44240",
 "substance": "Crack",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Crack",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44240",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 26, 2007",
   "Views: 10392",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIm 16 years old. Smoked weed daily for about 4 years. Decided to quit after I tried cocaine, which I have been using for about a year.<br>Yesterday I spend the whole day looking for some coke and couldn't find any. B my neighbor came to my door and tells me he has crack so whatever I decided to experiment. So I bought a rock for 40. It was a bright yellow sort of rectangular prism shaped thing. He said he would show me how to smoke it and all that so I hopped in his car and we went to a near by park at about 10 pm and smoked inside the car.<br>So I broke up the rock into four peices. He took out his crack pipe and a rock of his own and showed me how to melt it and hit it and all that stuff. I put the first rock in and took the biggest hit I could. It wasnt like smoking pot or anything I couldnt even feel it in my lungs. Before I finished even taking the hit my lips and mouth went numb and my ears started to ring to where I couldnt hear anything else. I put the pipe down as my body went numb and my heart beat shot up. It was such a low calming feeling. WAY diferent than coke. Its not a social drug at all. Then I remember that I didnt exhale and started at that.. I took 3 more hits and at this point I couldnt move and my heart was pounding like crazy. My body was so relaxed and warm and everytthing felt soothing. My vision got verry blurry and I wasnt able to see. While Bryan was just the oposite. He was driving around, paranoid and up. I guess peoples bodies react diferent to it. I dont know.<br>About 10 minutes later I came down quick. I was kind of dissapointed. But all I could think about was more. Now I was feeling nervous and I couldnt stand coming back down. So I grabbed the pipe and smoked like a feind.. Bryan had a gram and I had those 3 rocks. The whole night was one big blur of highs and lows till we were clean out.<br>When I came down for the last time it sucked. Bad. Not sure when I got back, I was way too out of it to function. All I could think about for about halve of the morning was getting more. This drug is ADICTING. Its been a day and I still feel like shit. This drug is to addicting and dangerous because I cant control my self on it. If you absolutly have to try it, be prepared..its way to easy to get hooked.\n\n\n"
}
