{
 "title": "Terrifying Experience",
 "author": "Ralph",
 "citation": "   Ralph. \"Terrifying Experience: experience with Salvia divinorum (15x extract) (ID 44338)\". Erowid.org. Sep 11, 2008. erowid.org/exp/44338",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44338",
   "Male",
   " ",
   "Not Given",
   "Sep 11, 2008",
   "Views: 3548",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I want to start out by saying that I had experienced Salvia several times before but only in a 5x extract form.  The 5x just made me laugh uncontrollably for a few minutes which it did to everyone else I saw try it.  The 15x however was a completely different experience and not one that I would ever like to feel again.  I was sitting on a couch surrounded by friends who were all taking turns hitting the 10x salvia and having a good time.  Then I decided to try the 15x in hopes that I would have a strong trip.  To say I had a strong trip would be an understatement, here is what happened.</p><p>I packed a small bowl of the 15x and took it all in one hit.  I held it in for as long as possible and as soon as I exhaled I began to laugh as usual and felt ok.  About 30 seconds later everything took a turn for the worse.  I was suddenly launched into another world.  When I say another world I mean another world.  Everyone and everything around me disappeared and I suddenly found myself in a room made of blocks.  Blocks that were red, blue, green, and yellow.  All other colors were absent in this world.  The next thing I knew I felt like I had become an inanimate object made of blocks and attached to the floor of the room.  I remember becoming extremely scared possibly due to the feeling of being held down and not being able to move.  Although like I said I had become an inanimate object so I obviously would not be able to move.</p><p>The next thing that happened was a feeling of being ripped apart.  Like the layers of blocks that I was made out of were being torn away row by row.  This feeling lasted for the rest of the trip.  Shortly after this feeling arrived the real world and my trip world began to merge together as my friends that were around me appeared in my world but as inanimate objects too.  In the real world they were trying to comfort me and tell me everything was going to be ok because by this time I was no longer on the couch.  I had stood up and started to scream uncontrollably which to say the least really freaked them out.  In my world I began to become human again clawing my way up off the floor I was attached to and trying to run away from this crazy world I was in.  I was grabbing on to anything around me trying to pull myself up but the blocks just kept breaking away and I kept falling back down.</p><p>Just as quickly as the trip had started I snapped out of it and was back in reality.  After a few minutes had gone by and I was clear headed again I tried to describe what it felt like to my friends.  Besides for what happened in my trip there was an overwhelming feeling that the world as I knew it had come to an abrupt end and I would never see it again.  The new reality that I was launched into felt like the real world and the actual real world felt like it was just a big dream.  I also had the strange feeling that everyone was against me and that they knew all along that the world I thought I knew was never real.</p><p>While I was tripping I managed to get up off the couch.  I stood there for a few seconds then began screaming.  One of my friends came up to me to try and comfort me telling me everything was going to be ok and I ended up balling up my fist and started rearing back to punch him.  My GF had to hold me back and pin my arms behind my back to keep me from harming him or the dog which by that time was wondering what all the screaming was about.  Eventually the screaming gave way to an extremely heavy breathing and moaning and then I came back to earth.  I know all that sounds extremely strange but that is what happened.  The whole thing was recorded on video.</p>"
}
