{
 "title": "Dimensional Rift.",
 "author": "Formaldehyde",
 "citation": "   Formaldehyde. \"Dimensional Rift.: experience with Mushrooms & Cannabis (ID 44332)\". Erowid.org. Jan 8, 2007. erowid.org/exp/44332",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 0:15",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44332",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 8, 2007",
   "Views: 2964",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Alright, so there I was getting ready to get on the plane to leave my vacation from Belize. I had been there for a week, was very relaxed, and in a great state of mind, and I got the strangest urge to trip a bit. So, I talk to one of my peers that I met and spent some time with down there, and asked if he knew where I could get ahold of some shrooms, and he told me that he knew a guy growing tons in his own home, I shell out $30 belize dollars(about $15 US) and get a bag of shrooms that were alot more colorful and ornate than any acquired in the states. I ingested the shrooms on site, washed it down with a bottle of orange juice, and went off on my way toward the airport.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>On the drive to the airport I sipped on my own personal blunt, so needless to say, by the time I got to the terminal, I was blown. I go through security and everything fine, and even after sitting down in the plane, I felt nothing. However I did notice that the clouds were indescribably beautiful, nothing really too different about them, I just found them infinite amounts more interesting. About 20 minutes after takeoff, I look out the window into the distance and see something moving in the clouds, I couldn't tell what it was, so I kept staring.</p><p>The Dragon...</p><p>I stared off into the clouds watching this thing in the clouds, moving very serpantine, it resembled a snake as it drew closer. And then it dissappeared. I looked around waiting for it to come back out because I wanted to know what the hell it was. And then out of nowhere a creature that was about 5 times the size of my boewing 737 burst out of the clouds right next to the craft. The only thing I could call this creature, was a dragon. It seemed reptilian, but it's scales were silvery colored, this creature was very reflective in the sun. There were black spines and trim among the dragon, which made designs on it's broad sides, and it's wings had what looked like deep indigo tattoos on them.</p><p>When one hears about a dragon, they first think of a frightful being, but this dragon was absolutely beautiful. And it made me feel safe with it being so close, as I knew it's potential power, but I sensed an auro of good all around me. At this point my plane had dissappeared and I was simply floating through the sky on my own, staring at this gargantuan beast in awe.</p><p>The birds...</p><p>After watching the dragon for a good amount of time, I noticed other creatures in my view, down on the ground I saw more giant beings, most of which resembling dinosaurs, but the most notable ones, were the creatures that flew up near and around me. I could only describe them as icebirds. They were about the size of a condor, very large for birds, were very graceful, and were a very beautiful icy blue in color, with varying blues, clears, and purples in the feathers. It's head resembled a peacock, with frills sticking straight up from the back of it's head, these frills looked to be made from pure ice, as did the long sinuous feathers trailing behind the birds. The sun was bright, and as it hit the birds body was I most able to discern that these had to be made out of ice, because the sun refracted through them beautifully. Winged, icy blue prisms.</p><p>The underwater cities, and my ascension(passing out)...</p><p>As the sky got darker my visions of the birds and the dragons slowly diminished, but as I looked down on the earth, I saw the lights from the cities below, and in my mind I saw these as being far deep underwater, as if I was flying over Atlantis, whales, dolphins, and fish were all swimming in plain sight, some were up as high as my nonexistant plane. I watched these glorious looking cities with interest, but I slowly started to feel a greater sense of calm about my person, I looked up and saw what the physical embodiment of the feeling of peace would look like, now I can't describe this image in words, but it definitely made sense in my mind at the time, and I slowly dozed off, however at the time I felt as if I were slipping away into eternity.</p>"
}
