{
 "title": "For Better or Worse?",
 "author": "Jake",
 "citation": "   Jake. \"For Better or Worse?: experience with Mushrooms & Cannabis (ID 44342)\". Erowid.org. Sep 11, 2008. erowid.org/exp/44342",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44342",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 11, 2008",
   "Views: 3018",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was my first time trying shrooms and after years of drinking, smoking, and pill popping, I wanted to try something new to see what its like on that next level, and I found it. It was around 6ish when we sat at the table to split the shrooms up. The sun was still up. Cups of orange juice and equally proportioned shrooms were being eaten. I remember examining the shroom cap I was about to consume, while popping stems and pieces of caps into my mouth. After eating the shrooms everyone seemed to sit around. </p><p>I had known these people for about a year and a half from school, and they're cool to hang out with but not close friends. I don't know if this added to the anxiety I felt later on. After eating the half eighth of shrooms while listening to music, a blunt was rolled. We went outside to smoke it and I remember it being really cold. I asked my friends and they all agreed that it was cold. While passing the blunt around I started feeling my body high kick in. It was like being on a really good high and buzz from drinking at the same time. I can easily say it was the best high Ive had. The blunt was finished and we stood outside to talk for a while but ended up heading inside to trip out. I heard shrooming is best in natural settings, but this happened in a big city urban environment.</p><p>We relaxed inside and listened to some Bob Marley and watched TV and played some videogames. I remember Halo was being played and I felt like I was on auto-pilot, not too into the game, not really thinking about anything, just watching myself play. The lighting in the room was really trippy. I was sitting on the couch trying to figure out if I was breathing normally and I looked at the wall. It's usually a beige colored normal room wall, but this time it was moving in a wave-like motion. Then it would pulsate in and out and just be moving and making waves. Shrooms seemed a lot like a drug that sends me into my own world. I did a lot of zoning out. There was a sitter who wasn't shrooming and I knew she didnt understand how I was feeling while I was zoning out but it still bugged me.</p><p>So we decide to walk to the QuikStop about a block away. I remember thinkin that one of my friends might be gay, then thinking its just the shrooms, but wondering why I thought that, maybe because I dont know him well? As we walk Im staring at the nearby apartment buildings and they seem as if theyre alive, staring down at me. They seemed like huge intimidating objects, I just thought of the girl from real world San Diego who was scared of huge ass boats, and then tried to think where this feeling of 'fear' came from. I remembered that thinking negatively was not good on shrooms so I immediately switched my thinking path. I found myself doing this a lot while on shrooming.</p><p>While walking to the store I keep seeing a shadowy dark figure on the sides of my vision, but when I look to see what it is nothing was there. This happened a couple times and I stopped looking after learning. I remember when we entered the QuikStop it seemed like Id never been there before, even though Ive been there almost every day and driven by it everyday. While buying the chips I finally decided on it seemed like it was the first time Id ever bought chips at a Quikstop. We walked back to the place and I remember not eating all the chips. </p><p>After this Im not sure how much time has passed but its dusk, the sun is low. We decide to walk up to our friends next door to buy some more weed, just a small sack. I remember while waiting for the sack in the room, the guy who lived there looked like he had a huge head and a small body. I was trying to talk to them, but couldnt say much because I only saw his disproportinate body. We walked back to my friends place where we were shrooming and packed the bowls.</p><p>This is where its really blurry and I have no idea whats going on. The bong was passed to me so of course I hit it. As soon as I felt that hit my body the shrooms mind trip escalated. I looked at the clock and I don't know how much time had passed, but I remember thinking there NO WAY only that much time had passed. I started to panic wanting the trip to end. I then started tripping hard feeling my body high go to shit. I felt like my entire body was shutting down. Conversation was heard but I wasnt listening. I remember thinking I was going to die right there, and that they'd find shrooms and weed in my system and I would die a lesser man.</p><p>As soon as I thought I could last no more, EVERYTHING flipped. All of a sudden the world was all put together. I felt so like I was reborn. I felt as if I could take on the world and do anything I wanted, anything I could put my mind to. This is one of the ideas that stuck with me after shrooming, 'Anything is possible.' I have a whole new vision on life and a better understanding of death after that. Then everyone started staring at a crazy psycadelic poster my friend had of spirals. It was almost too much. We all were stuck on it. The spirals all seemed to move around but while I was stuck on it I felt my body high increase the more I stared at it. It was so intense I had to look away. I couldnt stand staring at the poster feeling my body high just increase more and more. We all agreed the poster was trippy and went out to the living room. </p><p>It's dark out now and the blue light in the dark room is looking really good. As soon as we walk out of the room the sober sitter is there asking about my high but I was still thinking about how she shouldnt be talking to me because she wasnt shrooming. I talk with her a while but conversation seems difficult. I had to think of every word she was saying and put the entire sentence together. I felt retarded. Then responding was just as hard. I had to think of each and every word that I was going to say. This didn't last too long. I go to the bathroom and the walls seem to pulsate and flash colors of blue and orange as I take a piss. I check my eyes and laugh at how dialated they seem.</p><p>We then stand outside on the porch for a while. This is where I got my visuals. I could not stop staring at the full moon that was out. It seemed so close that I could touch it. I wanted to try to grab it. I was stuck staring at the moon over and over. It was like almost attractive to me, I couldnt stop staring at it for some reason. When I looked at it I saw every dark and light spot on it, every pattern. I don't remember if we're smoking a blunt during this time, or if we were just standing outside. Then I stare up at the stars. I can see the actual stars, but it seemed as if each star had an exploding aura around them. Each explosion of light around each star ran into and crossed over each other. It was so beautiful and I wanted to stare at it all night but we went inside. </p><p>I'm not sure what happens but I come down some from my high. I'm analyzing my high and feeling alert and awake. Everyone decides to play poker, since we played a lot. While playing I thought as if the game was so easy. I knew what to do in every situation and I knew what to fold and what to keep. Ironically, I dont remember if I won or lost any $ in the game, the buy-ins were small so who cares. </p><p>I can easily say I was not ready for mushrooms but I am glad I did it. After shrooming Im left with the impression that anything I want to do in life is possible if I put my mind to it. I know it sounds cheesy and cliche but I have a totally different outlook on life. The downside, life at times seems extremely dull. I don't know if paranoia is increased or if I notice more about life, but it seems as if I can control the tempo and mood in any room at anytime. I feel like it's almost too easy to be the life of the party. I was once the center of attention, life of the party, guy cracking jokes, but now it all seems like an act. It's as if there are set rules and actions I follow to get whatever I want in life, and I know them all. I feel like Im living the videogame of life, but Ive played the levels over and over already, it's lost its fun. </p><p>While there is still hope because of the feeling of being able to be the best at whatever hobby or career I put my mind to, I still miss the genuine feeling of happiness I once got from life. Did mushrooms trigger depression or do I now just see a reality that my childhood was blind to? Either way, I wouldn't trade how I look at the world now for anything. It seems as if I can see through all the lies, bullshit, and fake smiles that people do, and I can see the truth of it all, and still laugh at how simple it is. </p><p>P.S. I have yet to shroom again. I feel if I do again, it will end this dull feeling to my life. Hopefully if I shroom again it will be like the second half to me understanding life more, since I now know what to expect from shrooms. I have yet to wait for a pleasant time in my life to shroom a second time and find the truth of this whole perpective I have on life.</p>"
}
