{
 "title": "Within a Yemen Wedding Context",
 "author": "bengt",
 "citation": "   bengt. \"Within a Yemen Wedding Context: experience with Khat (ID 44364)\". Erowid.org. Jul 9, 2005. erowid.org/exp/44364",
 "substance": "Khat",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  leaves",
   "sublingual",
   "Catha edulis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44364",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 9, 2005",
   "Views: 21883",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI live in a relatively culturally diverse area of the U.S. Last night I worked valet for a Yemen wedding reception, and after noticing several guests with curiously large, aromatic quids in their mouth I asked an adolescent guest what it was that they were chewing. He replied that it was Khat, which I had vaguely heard of but knew little about. He proceeded to explain what Khat was and told me that it is a staple in Yemen and that it's very common throughout the culture and easily attainable both in and outside of the Middle East, provided you know the right sources. He didn't know the exact weight, but held up a bag of what looked to be several ounces of fresh Khat and said the price can range from $30-$100 U.S. (depending on inflation from being imported), whereas in Yemen the same amount would go for around $2 U.S. He offered to let me try some if I was interested, and I opted to wait until the rush died down and I had some free time. \r\nAs guests continued to arrive, nearly every male had a plug in his mouth and a bag in his hand. They were openly and comfortably using and distributing the Khat in plain view, and many guests made frequent trips to their cars to get more... it was everywhere, which was somewhat liberating to watch another culture practice so freely a custom subversive to the country they are currently in. The reception was segregated as I assume is their social custom, and interestingly enough while nearly every male was using, I didn't notice a single female use or handle any the whole night. \r\nEventually a few of the workers inside the hall were even trying some, and I decided to give it a shot. The boy I had been talking to earlier gave me a decent-sized quid and explained how to chew it, what to spit/swallow, and what to expect. The Khat was fresh and looked as if leaves/twigs had been somewhat ground with a mortar and pestle. It had a very distinct 'spicy' aroma and a strong bitter taste. It was easy enough to get the hang of chewing, although some of the twigs scraped my gums a bit. After a while, I felt the way I had felt when I first smoked a cigarette: dizzy/light-headed, somewhat nauseous, and slightly buzzing. Eventually this passed, or I got used to it, either way any unpleasantness was not noticed. Physically, it felt very similar to getting my daily caffeine fix, relaxed yet still stimulated; and frequent dry-mouth. Mentally, it was similar to a low dose of cocaine -- a sharp but clear-headed buzz. I felt pretty good and easily struck up lively conversations with guests. \r\nIt was very fun to have this experience in the presence of a culture where it's celebrated, and I felt that I understood why everyone was in such high spirits. It was a clear night and being the 4th of July weekend, we were privileged with a good vantage point of some fireworks being set off at a nearby function... not that I had any visuals or anything, but it was still that 'in the moment' feeling of well-being. Eventually the effects tapered and my jaw was getting exhausted, so I got rid of the quid and finished my work, thanked the guests for being so generous, and rode the comedown home. I took a shower and was able to fall asleep with little effort.\r\nOverall, it was an interesting experience, particularly because I got to experience the cultural aspect as well. I would liken Khat to a high-dose of caffeine or low-dose of cocaine, and although I would recommend it if the opportunity presents itself, I doubt I would ever pay to experience it again.\n\n\n"
}
