{
 "title": "Beyond Blown",
 "author": "Bassmaster",
 "citation": "   Bassmaster. \"Beyond Blown: experience with 2C-E (ID 44360)\". Erowid.org. Jan 11, 2007. erowid.org/exp/44360",
 "substance": "2C-E",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bump",
   "insufflated",
   "2C-E",
   "(powder / crystals)",
   "  T+ 1:30",
   "1 repeated",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44360",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 11, 2007",
   "Views: 3323",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having snorted 2c-t-2 and other 2c's, some friends and I decided to snort 2c-E to test the waters. My friends snorted their first keybump at about 8:30. When I arrived at 12:00, they had already done 2 keybumps. We had all taken it in 15-25 mg doses in gel tabs in the past. At 12:30 I took my first keybump (about the amount you could easily fit a straw over), and my friends took their third. Having never heard of this drug being snorted before, i was pretty nervous. </p><p>After about 15 minutes I felt my first effects. I'm not sure what my friends had felt for the 2 hours before I arrived, they were pretty hard to communicate with due to their fixation on a Ronco infomercial and uncontrolled laughter towards the snails mating on the deiscovery channel. After about 10 minutes i began to feel loopy. 1 hour passes and me and a friend complain that the effects are too weak. This is 1:30 am or so. We sit arround laughing and making jokes, laughing about reality and past inner jokes from powerful, past drug experiences together. 3 am we smoke hash. WOW. I was beyond blown. We drive to my house and sit in the backyard. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I start to have a bad trip. Marijuana can impose a sense of imminent doom upon me, and that hash made me feeling as if my heart were going to explode. I begin to walk in circles, aimlessly, until I get a grip and realize it is the hash making me feel this way. A sober friend drives us along back roads for an hour and takes us back to where we took our doses at. By 5 am we are fried and cracked out on the 2c. We lay on my friends roof and medatate with preventive breathing. The visuals are pretty strong and eye shakes are frequent. Shooting stars are prominent and amazing. Good visuals continue until about 6 am when we head to get food. We drive arround for 30 minutes looking for a good food joint and settle for whataburger. None of us are really hungry but manage to eat. I forgot to mention, between 4-5 I puked about 7 times, most likely this marked my peak and after the episode i returned to a healthy state of mind. Currently it is 7:30 am and the effects are fading except for my hightened color perception, eye wiggles, and loopyness.</p>"
}
