{
 "title": "Cluster Headaches and Psychedelic Cures",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Cluster Headaches and Psychedelic Cures: experience with DMT (ID 44397)\". Erowid.org. Jan 8, 2007. erowid.org/exp/44397",
 "substance": "DMT",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44397",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 8, 2007",
   "Views: 16275",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had my first cluster headache when I was 15, I can still remember it clearly. Although I had only heard about migrane as some kind of nastyass headache I immideatly, almost instictivly, recognized it as such, strange as it may seem. The past few years things have really improved for me though, since I first tried mushrooms the attacks are fewer in numbers. I do however doubt that the change is to be accredited to the mushroom alone, the decrease in headache-attacks started even before I ever tried mushrooms. At present I don't really suffer from it, I get it about once every other month but the attacks are very painful and incapacitating, they usually last about 4-5h including a ~2h onset before the real headache.</p><p>I've tried alot of different things to treat the attacks as they occur, a large dose of strong Tylenols, smoking opium, weed etc. Smoking weed didn't really affect the condition in any direction, opium is quite alright actually but it rarely falls in my lap (and when it does I run out all too fast!). Then there is what I usually take, good old Tylenol /w 30mg codeine. I crush 4 pills and add to a glass of water and down quickly, it's no miracle cure but better than nothing.</p><p>This night however, the migrane would appear at a very bad time. The plan was set for me and my buddie to venture of into hyperspace, this was a well planned session. Before I even met up with him I could feel it, a mild headache, it just hadn't caught my attention yet. We walked back to my appartment where the smoking was to take place, we prepared the place with some candles and incense and so on but I was really starting to hesitate now. The headache grew worse by the minute and now I knew that alot more was to come. By coincidence I was also all out of Tylenols, what was supposed to be a nice evening was turning into a nightmare.</p><p>My typical symptoms when the headache really starts distinguising itself include a painful pressure behind the left eye which usually spreads up my forehead, vision becomes severly impaired but nausea is actually rare. Loud sounds and bright light usually triggers tremendous pain, thinking becomes difficult. I didn't really feel like riding it all out without anything to help me through it, so an idea popped up in my head. The DMT... that was something we had plenty of right now and right here. As I said I've had good experiences from mushrooms easing my headaches and I was also well aware how ergot was used in treatment of migrane. The structural similarities between all of these compounds are obvious to anyone when comparing them side by side. I carefully considered what the worst thing that might happen could be, this was not all too obvious as I was unsure if the headache would affect my trip in a negative way. I decided to go for it.</p><p>At this point I was in some pain, I had problems keeping my eyes open due to the fact that it hurt to look at things, sounds were slightly distorted and amplified. The pipe was loaded with 30mg and handed to me. I emptied the pipe in one huge breath and laied down on the couch. What happends next still baffles me, right before I enter hyperspace I feel something snap in my forehead and just like that my headache is gone! Not just dulled away by drugs but actually completely gone!! The experience itself was not affected by this at all (although I would still advice anyone attempting anything similar to use caution) and the headache didn't return when the experience ended. I'll definitely try this again when the circumstances are ok.</p>"
}
