{
 "title": "I Really Enjoyed my Trip!",
 "author": "Viaticus",
 "citation": "   Viaticus. \"I Really Enjoyed my Trip!: experience with 2C-I (ID 44489)\". Erowid.org. Mar 19, 2008. erowid.org/exp/44489",
 "substance": "2C-I",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44489",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 19, 2008",
   "Views: 2840",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>We had talked with my friend about spending one saturday evening at my place, and he asked if I wanted to try 2C-I. He had done it himself several times before over the last year. He appeared to my place and after discussing about the substance for a while (I always want to know what to expect as specifically as possible), we were ready to go.</p><p>We took about 10mg each, dissolved in a small amount of mint-liquer (this was about at 10pm). Then we ate little, which wasn't probably the best possible idea, but I hadn't had a good chance to eat that day and my blood sugar was running a bit low. We then just started chilling out, listening to music and talking. The first effects I noticed (about 30min later) were little lightheadness and slight discomfort in my stomach. It wasn't actually nausea and I think it was due to the eating just after ingesting the substance. This lasted for about 15 minutes. After that I felt like I'd done few bonghits or drinked couple of beers and we both were laughing. This is was the takeoff... From that forward, I couldn't keep accurate track of time.</p><p>We laughed for a while and then I went laying on my bed, watching at the ceiling. I saw beautiful fractal-like patterns growing down towards me. After admiring them for a while I stood up and was astounded of how my room looked like. So many details, so much movement. Moving objects (ie. my hand) produced either trails or more movement on the edges of my vision. I tried to use my computer but it was pretty hard, typing seemed to require too much effort. So I just watched fractal-patterns growing and moving on the sides of my screen.</p><p>We had a lot of fun just looking at each other or objects in my apartment. There seemed to be at least some subtle movement in everything. We went outside a couple of times to smoke some cigarettes. I think it was about midnight at this point. It was so beautiful outsied that we decided it was time for a walk. We went to a nearby park and just marveled the sights around us. Nature seemed to be so much more ALIVE. We walked in the park and around my neighbourhood. After finding a peaceful place to sit we stayed there for what I'd say was about half an hour, just talking and looking at the trees.</p><p>I started to get hungry and we went back to my place. I ate some tuna right out of the can and we continued talking. I wathed my friends face slowly morphing, growing mouths in his forehead and then changing back. I thought this was hilarious beacuse it kinda reminded me of the 'I'll remember your face'-scene in Fear And Loathing In Las Vegas.</p><p>We spent the rest of the night sitting outside my apartment talking and listening to the sounds of the night. By 6am there were no more apparent effects, except for the dilated pupils. I went to sleep and woke up next day around 3pm feeling perfectly fine.</p><p>I really enjoyed my trip and was surprised of how much control I actually had. The substance didn't mess my head more than a few bonghits would have done, so my contact with reality was pretty good through the whole experience. Keeping track of time was the only hard part. Time seemed to slow down, speed up and 'form cycles'. At one point it felt like I'd been sitting at my computer for a long time, but when i checked the clock, it was really just five minutes or so. Some conversations seemed to last ages, but in reality took ten minutes. This was a positive thing in a way, because I really felt I was 'getting my moneys worth'. And the visuals were very pleasant. All in all, I'll probably do this substance again if given the opportunity.</p>"
}
