{
 "title": "A Full Realization of Infinity",
 "author": "Paul P",
 "citation": "Citation:   Paul P. \"A Full Realization of Infinity: experience with Salvia divinorum (13x extract) & Nitrous Oxide (ID 44482)\". Erowid.org. Sep 15, 2008. erowid.org/exp/44482",
 "substance": "Salvia divinorum (13x extract) & Nitrous Oxide",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "3 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44482",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 15, 2008",
   "Views: 6650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLately I have become interested in the effects of Salvia. I have only used it about 5 times now, but I am starting to get accustomed to the intense hallucinations. On day I decided that I wanted to mix both Salvia and Nitrous (aka whip-its) together because I knew each one's individual effects, but I was curious to see what they would be like when used consecutively. Earlier that week I had ordered a box of whip-its (120 cartriges) off the web. I had also recently purchased a gram of some Salvia 13x extract that same week. \r\nI brought along 3 people with me on this adventure, my friend, my friend's girlfriend, and my cousin. We were all seated in my car, which was parked, and listened to some Bob Marley. Normally I would have smoked some marijuana before engaging in these activities, but I only wanted the effects of salvia and nitrous. So I packed a nice bowl of the Salvia into my pipe, as my cousin filled a balloon with 3 cartriges of nitrous. I proceeded to take the hit of salvia and breathed it deeply into my lungs, holding it for about 15 seconds. I then took two more hits of the salvia in the same fashion. Directly after I set down the bowl of salvia (this is literally seconds before the salvia hit me), my cousin handed me the balloon full of nitrous. I inhaled the nitrous from the balloon and let my body sink into my seat and relax.\r\nNow normally I feel very unpleasant, uncomfortable, and apprehensive of my surrounds when I use salvia, but with the nitrous added, it produced a great feeling of euphoria and deep understanding. I finally began to hallucinate as I became more inwardly focused, a typical effect when I inhale nitrous. I closed my eyes and noticed the repetition of the Bob Marley music, as well as the repetition of the voices of my friends. All of a sudden I was brought into a world of complete understanding. I had felt as though I knew everything about existance/universe/life etc. I was completely motionless, staring down at the ground with my eyes closed. Within my newfound self-awareness, I began to see some closed-eye visuals.\r\nI slowly began to invision my face on what seemed to be a geometrical plane, not a two or three dimensional plane, but a plane with an undescribable extra dimension. The sounds of the music and voices began to blend, and they seemed to repeat, as if a record player were to skip and continue playing the same thing over and over again. I began to witness infinity first hand through an auditory point of view, hearing the exact tones and sounds being repeated consistantly. At the same time, my face, planted in the complex undescribable plane, began to split into many different parts. When I normally trip on salvia my reality becomes extremely distorted, where what I see/feel/believe is strictly based upon the objects in my immediate surrounding. Since my eyes were closed, my reality was based upon the splitting of my face. For a few seconds it actually seemed like I was stuck in a loop in infinity, and that I was unable to get out. My face was splitting to the tempo of the music, and kept repeating the initial face splitting as if that moment was constantly being replayed. I then reached another point of understanding, but this time I had truly understood infinity.\r\nFor some weird reason I began to predict the future, sort of like deja vu, except I felt these predications before they happened. Only about a millisecond before I put my hands on my head, and I had already knew I was about to do it, even before I actually made the decision to do it. As I was coming down from that great feeling of understanding, I slowly was unable to keep predicting the future. I believe that at my peak, my understanding of infinity aided me in predicting my upcoming actions. Everything started slowing down and ceased repeating. The spinning reality of the never ending timeline of infinity soon faded away.\r\nI was finally brought back from my intense experience by my cousin when I heard him yell, 'PAUL, YOU ARE DROOLING ON YOURSELF'. Sure enough I look down and there's a puddle of spit on my shorts. The whole time I was hallucinating, I had really thought I was there, not just sitting down motionless and drooling. I'd say this concoction of salvia and nitrous brings along very interesting effects.\n\n\n"
}