{
 "title": "The Train",
 "author": "Entropy",
 "citation": "   Entropy. \"The Train: experience with Salvia divinorum (ID 44484)\". Erowid.org. Oct 16, 2007. erowid.org/exp/44484",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44484",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 16, 2007",
   "Views: 4131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been experimenting with salvia for the past year now, and would like to share some of my experiences. I am a rather experienced tripper, smoked marijuana first when I was nine years old, was a regular smoker by 15 and I am now 27. I've taken LSD over a hundred times, mushrooms several times and have played around with almost everything else. I first ran into salvia when my mom brought home some dried leaves from a trip to Arizona. I had read a little about it before but did not know a whole lot. We rolled two joints with it and smoked it between the two of us after smoking several marijuana joints. I noticed a very slight tingle. It had a pretty unique taste and it seemed cool, but certainly not a mind shattering thing like I had heard about. \r\nI did a little more reading when I got home, and decided to pack several bowls in my bong and suck them down fast. I smoked about 2 grams of dried material in three fast 2 foot bong loads. I got a strange lopsided headrush, its hard to explain but it felt like I was moving very quickly down and too the left. Next I began to see geometric shadows forming in midair where there should be none, they would form and then quickly move away in the same direction I felt like I was moving. I also noticed for the first time that physical movement of my body quickly degrades any hallucinatory effects. On top of the minor hallucinations I had a much stronger tingle feel, similar but still different from a strong marijuana body high, maybe closer to the jangly feeling sniffing glue produces, either way it was overall a pleasant feeling. The main effects lasted about 10 minutes, with a slight weirdness lasting about an hour after use.\r\nThis experience convinced me to spend some cash for the extracts I had read about. I purchased a gram of 20X extract, and the company threw in a free gram of 5X. I had read enough by then to know that it would take only a small amount of the 20X extract to produce effects, so I took a small pinch and put it on top of a little marijuana (to avoid sucking it straight in) in my bong. WOW... I knew it was strong but the results were amazingly powerful for such a small amount. Immediatly after exhaling I was in another world. Everything was strange shades of neon green, and the lopsided headrush I had felt before was transformed into a full on hallucination that I was on a moving train, traveling through this strange green world. I got the feeling that there was some group watching me, that I could not see. I turned my head to look for them, and could see my computer monitor and the rest of reality. If I turned my head back, I was back on the train in the strange green world. Strangest of all when I could get it just right I could be in both worlds simultaneously and view them overlapping. When I stood up about 8 minutes later all hallucinations stopped cold but I was left with a slight body high, and mild euphoria for about 20 minutes. I was pleased, and a bit awed. Salvia certainly demanded my respect. \r\nAfter a couple of months I was ready to try it again, this time I put a little more, maybe .05 of a gram of 20X extract. It was two small pinchs worth. This time I was even deeper into the hallucination, I had completely broken free of reality. The fresh prince of bel aire was on the tv, and I soon found my self being lectured by the mom about needing to clean my house up, cause I was filthy. I lost all concept of this being a hallucination, my only thoughts concerned the lecture I was recieving from this woman. However I was aware that I could not move. After about 5 minutes of this state I opened my eyes to realize I had closed them in the first place. It seemed to have knocked my unconcious for a couple minutes. \r\nSince these experiences I have tried salvia in several situations. One major thing I've noticed is I can not accuratly determine how much of an effect the amount I take is going to have, it seems almost random. Sometimes I go flying into another universe, sometimes I only get a strange buzz. Some people I have turned on to salvia were unable to feel the effects the first couple times they tried it, others had major hallucinations to minor amounts their very first time.\r\nDrinking one or two beers before smoking it really smooths out the high of salvia. It's rather fun and the easiest way to trip with a whole group. But I have noticed on nearly every occasion I have done so that I experience near total memory loss of the night before when I wake up the next day. Alcohol alone never does this to me. One time I awoke from a party with several friends where all of us but one had smoked salvia and drank heavily the night before and none of us could remember key incidents the night before such as other friends coming by, furniture breaking, etc. The only person who could was only drinking. It was a very disturbing feeling. \r\nI didn't use any of the 5X extract for a long time, thinking why bother when the 20X the same thing only I use less right? Wrong. 5X extract produces a very different overall high, and can be much more pleasant. I've found a great combo for myself. First I drink a couple beers with several joints and bongloads (bongloads are a daily thing for me). With the third beer I take a Soma muscle relaxer. After cracking a fourth beer I smoke a decent amount of 5X extract in a bongload. By this time I have a great high going from how complimentary all the chemicals are. The chemicals nullify any negatives from the others, and if I get a full 8 hours sleep in before work I have no risidual effects. I wouldn't suggest doing this daily, but it's a nice little midweek personal party when it's needed.\r\nSalvia is great for someone like me, I'm an adult now who has too many responsiblitys to trip my balls out on acid or shrooms and spend the time recovering from it. But I still get that itch to step out of my mind from time to time and play around.\n\n\n"
}
