{
 "title": "Amazine Trip, Not So Good Aftereffects",
 "author": "allielicious420",
 "citation": "   allielicious420. \"Amazine Trip, Not So Good Aftereffects: experience with LSD & Cannabis (ID 44493)\". Erowid.org. Jul 11, 2007. erowid.org/exp/44493",
 "substance": "LSD & Cannabis",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:40",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2005",
   "44493",
   "Female",
   " ",
   "Not Given",
   "Jul 11, 2007",
   "4966",
   " "
  ]
 ],
 "report": "<p>I do alot of drugs. I do pharmies, I do hallucinogens, and most of all, I smoke the chronic. My experiences so far have only been good, though people continue to warn me about the dangerous after effects of acid. I never listened, and now I feel like puking my brains out.</p><p>On saturday night I took an ambien, smoked some salvia and went to sleep. I passed the fuck out and slept until work the next day. Then at 10:20 I took my first hit of acid, and started smoking herb. We kept a bowl loaded the whole night, and went through approx. A half 8th. We drank a ton of juice and ate alot of fruit. I have done acid three times before, never with adverse effects. An hour and forty minutes later I took another hit of acid, and soon after started to feel queasy. The rest of the night I felt like puking my brains out, but couldnt get anything up. I just kept a bowl next to the toilet and sat there in a fetal position wanting nothing more than to puke. I still enjoyed the trip, going for a brief walk outside and discovering a beautiful sky of both night and day. And my stomach still feels sick whenever I eat something, like my body is rejecting it and doesnt want to digest anything, I dunno. Its been 5 days since I took the acid. I want to puke my guts up, get that shit out of there!!! I wish I had some weed to help the nausea. I have never felt like this before. I think it was the combination of acid and ambien in my system that messed me up.</p>"
}
