{
 "title": "Whoops, There Goes Gravity",
 "author": "D",
 "citation": "   D. \"Whoops, There Goes Gravity: experience with Salvia divinorum (10x extract) (ID 44518)\". Erowid.org. Sep 15, 2008. erowid.org/exp/44518",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "153 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "44518",
   "Male",
   " ",
   "Not Given",
   "Sep 15, 2008",
   "2462",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report is of my usage of salvia.  I am an experienced user of enthenogenic and dissociative drugs.  I've done PCP, Mushrooms, 5-MeO-DMT, MDMA, LSD and DXM.  The only real bad trip I had was on PCP in penn station and that was not fun I can tell you.  Other than that I have a pretty good understanding on controlling my trips and taking them to whatever extent my mind will bring it to.  I also did a lot of research on salvia and have wanted to try it for some time now and finally got a hold of a gram of 10x extract.  I came into this thinking it was just going to give me some stupid visuals and auditory hallucinations like a dose of morning glory, but I was in for it.  I have two accounts of smoking Salvia out of a water bong, holding in each hit for 25 seconds and releasing.</p><p>The first account was on my friends deck at about 12:30 AM, we decided to load up the bong with Salvia and he took the first rip and looked like he got hit by a truck, so I was like Alright, my turn, loaded up the bong, ripped it, felt nothing.  So I loaded it up again, ripped it, held it in for a good amount of time, but when I let it out, I was completely lost and in a dreamlike state.  My friend understood absolutely nothing I was saying because I was mumbling every word that came out of my mouth, I was really messed up.  I remember being pulled to the left really hard and then full on hallucinating that I was a little boy and my mom was dragging me through a Caldor and people were trying to purchase me.  All of the sudden I got up extremely fast and pushed my chair away and went to run through my friends glass door, good thing he was sober enough to hold me back.  This was the first paranoia inducing trip that Ive had in almost a year and I just wanted to get out.</p><p>About a minute later (I think I was tripping fully for about 3 minutes), I snapped back into reality, and had to throw up, so I threw up over my friends deck and went and laid on the couch.  I was still having a little bit of visual hallucinations, sort of similar to the breathing effect of patterns that you get while on LSD.  His couch was really interesting to look at, as there were a lot of weird looking patterns on it, so I just laid on my stomach and looked at the side of the couch.  I closed my eyes and opened them and I was laying on my back and the bright light above me was blinding me, and I started hallucinating again and thought the light was the sun and I felt heat heating my face, and I seen sand at my feet, but that was short-lived.  After that, I was completely sober; kind of a left over haze high remained for the next few minutes.</p><p>The second account was in a friends bedroom, same smoking situation as before, except this time I felt a bit more on the first hit, and then was hallucinating fully on the second.  But one thing I noticed is that this drug, whenever I take it, makes me salivate and makes me mouth feel weird, I think thats what was causing me to throw up.  That alone makes me not want to do this drug anymore because it is extremely uncomfortable and definitely not worth the short trip.  But regardless, I closed my eyes and laid back on the bed, and started floating, up and away towards the clouds, then I started mumbling again and my friends started laughing, and then I started laughing and I stopped hallucinating.  It was extremely short-lived and extremely disappointing.</p><p>The first account of salvia was truly unique and like nothing Ive ever felt before, it was really awkward to say the least, but it was fun at the same time when I look back at it as it gave me the early stages of the fear.  The second trip I can compare of the coming up on 5-MeO-DMT, but ending abruptly without all the goodies.  I dont really thing this drug is worth it, but I think it would give an amateur a good idea of what it is like to hallucinate to unlimited extents.  I probably wont do this drug again, do to the fact of the uncomfortable feeling I get in my mouth and the amount it makes me salivate.  I think this drug would be a lot better if the trip lasted longer and it allowed you to explore more instead of giving you one hallucination and then being back into reality.  Otherwise, I think its a waste of time and for the price of a gram I can get an eighth of mushrooms or a couple hits of LSD and have a much longer lasting and better overall trip.</p>"
}
