{
 "title": "Not Prepared for the Magnitude of the Experience",
 "author": "Rift80",
 "citation": "   Rift80. \"Not Prepared for the Magnitude of the Experience: experience with LSD (ID 4452)\". Erowid.org. Dec 18, 2001. erowid.org/exp/4452",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 drop",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 4452",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 18, 2001",
   "Views: 7575",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy first (and only) experience on acid was one of the most intense times of my life.  I was a freshman in college at the time and smoked pot pretty regularly.  So one night when I had already been drinking at a party I took one hit of liquid acid (black magic I think it was called)  I assumed that it would be pretty cool but I wasnt prepared for the magnitude of the experience.  </p><p>My first mistake was drinking beforehand.  Secondly, I was with a group that I know consider to be more of acquaintances than friends.  Finally, I was not prepared for what I experienced.</p><p>After taking the hit my tongue immediately had strange sensations running through it.  After that though relatively nothing happened for a while.  When the acid finally kicked in it was fun at first.  There was a DJ spinning (techno was never a favorite of mine but it sounded really good early that night).  A female friend of mine was there with me at first as well.  We hung out for a while and then went back to her room.  I played my djembe which was also fun.  However, shortly after that another guy came by and she started talking to him too.  I began to feel really insecure.  I still to this day dont know if she like really ditched me that nite but it seemed like it to me in the altered state I was in.  I was really down at this point but I decided to go back to the party.  </p><p>The techno that had sounded good earlier now seemed to be laughing at me.  With each pulse of the strobe light I felt worse and more depressed.  I decided that I would go back to my dorm room (which was in the same building I was in) and go to sleep (little did I know that my night was just beginning).  I started looking for my keys at the party.  This usually normal task of looking for lost keys was made much more difficult by the acid.  I looked everywhere but still couldnt find them.  It was at this point I came really really close to freaking out.  A friend carried me back to her room and tried to calm me down.  I was completely oblivious to reality.  I though I was going to die.  I even at one point wanted to jump out the window.  But, I kept making myself come back to reality when I had the thoughts.  I started thinking all the strangers around me in the room were undercover cops and going to arrest me.  All the other ppl left besides me and her and her friend (who I also trusted) I made the girl lock the door and push her chest of drawers in front of it to keep the police out.  And I still didnt have my damn keys.  She gave me a big blanket and a teddy bear (it made me feel better).  So I hugged the bear and watched a movie with her.  This girl singlehandedly made a difference by helping me out.  I really believe that I would have freaked out a Im sure the cops would have been called, the university and my parents would have been notified.</p><p>About half way through the movie I started feeling really good.  So after the movie I decided I would go back to my room, forget about my keys and knock on the door and get my roomate to unlock it. When I approached the door it was unlocked!  Then when I opened my door to my bedroom I saw my keys!  The sun was rising right outside my window and seemed to form a halo around my keys, like some kind of divine intervention.  It was a really cool moment.  And it seemed to be the theme of my trip: one can spend ones whole life looking for something that they already have in the most obvious place.  After having this realization my trip started being loads of fun.  I put on some Bob Marley and started having really neat visuals.  At one point my skin looked like the ocean.  It had waves and stuff on my bare belly.  I saw some pretty neat trails as well.  All in all I tripped for nearly 18 hours.  So I guess the moral of this whole story is that I should not take acid unless completely prepared, and even if I decide to it might be a good idea, to start out with weaker stuff.  I hope this helps somebody, somewhere.</p>"
}
