{
 "title": "A Purging",
 "author": "nujw",
 "citation": "   nujw. \"A Purging: experience with Salvia divinorum & Cannabis (ID 4454)\". Erowid.org. Dec 18, 2001. erowid.org/exp/4454",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   " ",
   "Salvia divinorum",
   " "
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4454",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 18, 2001",
   "Views: 5810",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had acquired a salvia extract and tried it twice before, but even at a 'strong' dose I only felt mild effects.  That didn't strike me as too odd, because every now & then, acid and mushrooms don't do much for me.  When that happens, I can 'jump-start' a trip by smoking cannabis.  So I decided to try salvia again after smoking.</p><p>At first I thought I was just really stoned, but when the physical dimensions of my bedroom closed in on me and disappeared, I knew salvia had kicked in.  I could still see the floor and the walls, but they were 'enchanted' somehow.  I opened the window to get some fresh air, turned off the lights, and enjoyed a dim color show.</p><p>Then I felt like I wasn't alone... I stood up and saw this presence facing me.  It was evil.  It wanted to fight.  I threw my shirt off and started taunting it.  The next thing I knew, I was being pummeled with punches, knocked to the floor.  To a sober observer, it would have looked like Jim Carrey in the movie Liar Liar-- 'I'm kicking my ass!!!'  I didn't feel any physical pain... the physical world had long since disappeared, but the fight was still very real.</p><p>I didn't fight back.  This presence was every personal demon that had been bothering me the past few years, so different tactics were needed.  It threw me to the ground one last time, and I started coughing, gagging, going through all the motions of trying to puke the bugger out from inside me.  I could feel it in the back of my throat, struggling to stay in, so I reached in with two fingers, grabbed it by the head, and yanked it out.  I grabbed it between my hands and shrank it down into nothing.</p><p>The journey was ending and I could feel the physical world dissolving back into reality.  I lit a candle and reflected upon what happened until I was only stoned.  Now that it was over, I felt empty.  Not empty like I had lost everything, but like a vessel waiting to be filled.</p><p>Was it a bad trip?  No, I didn't feel any sense of fear or terror.  A trial or a test is a better way to put it.  It was one I was ready for, and I knew I would succeed.  I've had peace of mind ever since.  Thank you, Salvia.</p>"
}
