{
 "title": "Trancy and Extremely Pleasant",
 "author": "LibraZebra",
 "citation": "   LibraZebra. \"Trancy and Extremely Pleasant: experience with Salvia divinorum (10x extract) (ID 44585)\". Erowid.org. Sep 16, 2008. erowid.org/exp/44585",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "44585",
   "Male",
   " ",
   "Not Given",
   "Sep 16, 2008",
   "2382",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've tried Salvia Divinorum in the past: Chewed dried leaves, tinctures, 5x, 10x, 20x dried leaves. It does seem that the diviner's sage has a reverse tolerance, I've found that once I found my personal groove with this plant, that I can expand upon that every time it's used. I've been away from Salvia Divinorum for a couple of years now, and recently purchased some new 10x dried leaves to once again visit this fascinating plant. </p><p>About me, I have an open-ended philosophy, and though I lean upon the scientific process, I still believe in new-age things such as astrology, untapped powers of the mind, the metaphysical properties of stones and plants. Most anything is possible in my opinion. I've also tried many drugs in moderation, never overstepping my boundaries. Salvia is the one that really blew me away.</p><p>I read reports about so many different effects, and I must say that I prefer to see the entire experience as chemical and physical. It's easy to be distracted by what one's deeper mind is capable of masking the experience as. I've seen the Green Goddess, she appeared to me floating like a green cloud as I rested on the floor while dying my teeth green with a tincture. Chalk it up to prior programming. I do have a jewelry box for my Salvia, and there's a green lady on it, appearing Egyptian, inlaid with mother of pearl. I found it by chance on a Marine camp in Iraq. It's an homage to the mythology of this mysterious plant. </p><p>Well, on with the experience. Smoking this herb is always met with a little trepidation. I cannot describe exactly what it is like. Everyone might have their own experience. Mine is always similar to the following, based on a trip that I enjoyed a few hours ago. After a few seconds of holding it in, I lose conscious control of my mentality. Everything I was trying to do must stop (putting away the pipe, worrying about ashes, etc), and the mind must be allowed to relax and roam. My body will feel energized from head to toe in a prickly way, and the sensation feels like movement through some kind of exquisite and euphoric force. Suddenly I'm just being. There is no end, no beginning, just being right here in the present time.</p><p>When I think about it, this feels great. Why do I feel this good? It's such a trancy and extremely pleasant feeling when I let go. I am in the center of the Universe again, floating through it in Salvia Space. Welcome again to my life. Who I am becomes the larger question. Who passed on and made me a divine being? My sitter asks me a question, and I distantly hear 'How are you feeling?' And I'm on top of it, but perplexed. A constant theme that resurfaces is the question: Should I be worrying? Sometimes I decide that I should be and worry is the only thing that ever makes the experience difficult. I'm talking to my friend and it's absolutely harmonious, I put my worry aside and come out of the trance of being one with 'all that is' talking and laughing. It's like a perfect dismount. I'm still feeling the effects slightly, but am lucid enough to describe the experience and explain my present state. The exchange is humorous and light between my friend and I. We'll be coming back to Salvia Space soon enough.</p><p>Remembering it later is like remembering a dream. The memories are not easy to relate to the fully conscious mind. It's not always been a pleasant journey to the center of the Universe, but once I've fallen off the horse a few times and realized how to stay on, it becomes perfectly natural and I've found myself getting right into it all the time. I always feel that there's more to this herb than just what my present experience tells me. The only way to know is to respectfully continue my journey with Salvia. I find that it continually gets better and better with time, just like life when viewed properly.</p>"
}
