{
 "title": "The Green Dream Experiment",
 "author": "Libertine",
 "citation": "   Libertine. \"The Green Dream Experiment: experience with Absinthe (ID 44591)\". Erowid.org. Sep 16, 2008. erowid.org/exp/44591",
 "substance": "Absinthe",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 oz",
   "oral",
   "Absinthe",
   "(liquid)",
   "  T+ 0:05",
   "1.5 oz",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44591",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 16, 2008",
   "Views: 12528",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First let me tell you as a connoisseur of mind-blowing experiences, whether through altering my consciousness or philosophical discussion, I was very excited to try this Americanized brand of Absinthe called 'Absente'.</p><p>I took 3 oz of Absente and poured into a glass making sure to measure appropriately. Next, I poured 3 oz of cold water over the sugar cube held over the glass of absinthe with the spoon which came with the drink. After trying to get over the aroma, which is like Clorox mixed with Anisette, I gulped it down--well half of it. The burning sensation immediately jolted me and so I took a Rolaids (I have a hiatal hernia). After a few seconds, I drank the rest and waited. About 5 minutes later, there was a slight effect, but nothing really significant. Finally, I mixed another 1.5 oz and drank it.</p><p>About 5 minutes after that, I felt a tingly and numbing of my fingers and hands. A warm feeling came over me and I begin to get a high buzz. It crept up finally to a strong level and I decided to try to alter my consciousness a little more and turned off all the lights and hooked in my strobe. After turning on a little Pink Floyd, I begin to laugh and grin. My mind became a total blank and I could not think at all, but I felt so incredibly and comfortably numb (no pun intended) that all I could do was enjoy the moment. My words did not want to create logic, but rather just talk for the sake of talking. As I was on my bed, I stared into the alarm clock (which caught my attention). The red numbers seemed to pulsate and come out of the clock. Finally, as I moved, they came off the clock. The more I moved, the more the numbers moved and came completely off the clock. I bounced on my bed and the numbers were going everywhere. I laughed and kept entertaining myself. I kept going in and out of my mind, so to speak, kind of like when I was on Seroquel and had a glass or two of wine.</p><p>Finally, I crashed and woke up the next morning, slightly dizzy, but ZERO negative hang-over effects. In fact, I felt great. I recommend this to those of you who can't get any other kind of Absinthe. It may not be what you are looking for, but for me, it is a great experience nonetheless.</p>"
}
