{
 "title": "The Great Eastern Secret",
 "author": "Veng",
 "citation": "   Veng. \"The Great Eastern Secret: experience with Tobacco (Shisha) (ID 44602)\". Erowid.org. Oct 17, 2007. erowid.org/exp/44602",
 "substance": "Tobacco (Shisha)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44602",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 17, 2007",
   "Views: 28838",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have never really liked cigarettes, and always felt sort of 'dirty' and nasty after smoking them, from the chemicals I assume. I never found them enjoyable. I then began smoking cigars, and found it to be quite relaxing to just sit around and smoke a cigar with some friends.</p><p>Then, my friend told me about a Hookah bar in my town. 'A hookah bar?' I thought.  This form of smoking tobacco is not too common in the western world. My friends and I went one night, and although it was a bit intimidating the first time, I fell in love with the whole practice of hookah smoking very quickly. </p><p>The setting is very relaxed. Dark with limited lighting, and candles on tables, with some comfortable couches that you usually have to reserve ahead of time. On some nights they offer live accoustic music or poetry, and it fits the bohemian atmosphere quite well. The menu has many different shishas. Shisha is a tobacco made for hookahs, with bits of dried fruits for flavoring pressed into it. I have to this date tried Peach, vanilla, mango, orange, among others. The menu also offers various Teas, beers, and wines.</p><p>Upon ordering, they setup the hookah for you and bring it to your table. The smoke from a hookah is unlike ANY other tobacco. It is water cooled, so the smoke feels quite different, and it is very well filtered through the water chamber. The taste is amazing, and I find the actual process of smoking the hookah combined with the setting of the soft lighting, sitar/ambient music, and relaxed environment to be extremely pleasant.</p><p>The smoke feels much 'cleaner' then the smoke of a cigarette. There is no chemical 'dirty' feeling afterwards, that I typically feel from cigarettes. Instead, I feel very refreshed. </p><p>On a typical night, when I go with 1-2 other friends, one hookah coal lasts us about 45 minutes. We typically go through 2 coals through the night, and a pot of tea. It leaves me feeling very relaxed, very calm and collected. </p><p>I would suggest trying a hookah with some authentic high quality shisha. It is entirely different than any other form of tobacco, and the cost effectiveness is not bad. Plus, unlike smoking a cigarette, smoking a hookah can be a social night. It's very easy to spend 2 hours relaxing with some close friends, smoking a hookah, and just talking and enjoying the night.</p>"
}
