{
 "title": "God or Insanity?",
 "author": "Glimpses",
 "citation": "   Glimpses. \"God or Insanity?: experience with LSD (ID 44601)\". Erowid.org. Jul 15, 2005. erowid.org/exp/44601",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 44601",
   "Male",
   " ",
   "Not Given",
   "Jul 15, 2005",
   "Views: 16959",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experiences with hallucinogenic drugs have been a mixture of positive and negative. I have been experimenting with them for years; sometimes with friends, in search of a high, and others with a more spiritual purpose. Always in the back of my mind has been a deep respect for the power of the drugs. The first time I tried LSD, I knew that this was special, but far from a toy. The enlightening effects carry with them endless insight into life, but can also produce an equally negative effect, if taken in a careless manner.</p><p>My personality is such that I have, many times, gone the careless route. Most times I have gotten away with it, but it does come back to bite. It's like roulette.</p><p>The story I want to share, however, is a glimpse into hope rather than despair. </p><p>It wasn't the first time I had taken acid, but it was my fathers first. I had recently begun attending college, and had consequently been introduced to the world of acid. Always being comfortable with dad, I mentioned it to him. Surprisingly, he didn't offer any resistance. In fact, he had struck up a friendship with a well respected gentleman from town, who had been filling him with positive stories about his decades of experimentaion. In retrospect it nearly brings a tear to my eye to understand the way that it all played out. Like it had been written long before it happened. </p><p>We decided on Saturday. Mom would be at work, and we'd have the house to ourselves. With great anxiety I waited for him to arrive home from morning coffee with his 'well respected' friend. Finally, at around 10AM he pulled in the driveway.</p><p>Pink Floyd echoed from the speakers as we each ate a tab and a half, and began a shoot the shit session. The session began with some small talk (relatively speaking) about the coffee conversation of the morning. As time slowly disappeared, it was replaced with an overwhelming feeling of love. Our converstation drifted toward the time when he and my mom were divorced (5 yrs. when I was 4-9 yrs old). He began telling me of the mess he had made of his life during that time. He had been living with his drug addict friend and his family for those years untill one day, for some reason, he took notice of his friends son sitting on his daddies lap. </p><p>I meanwhile am beginning to sense something very special, very near. An unspeakable and undeniable power was beginning to settle in the room.  Dad continues his story explaining that he and mom decided to give it another whirl right after that.</p><p>At this point tears began streaming down my face as I recalled to him a memory which chronologically seemed to coincide, with his 'son on daddies lap' epiphany. I clearly remembered grabbing the top of a Yahtzee box and all over the underside of the box, drawing crying, sad faces with the words 'I miss my daddy' coming from the mouth. I showed the box to my mom and we both began to cry. Right after this they decided to 'give it another whirl.'</p><p>Now I am overtaken with a total release of any sense of despair and feel as if God himself had settled into the entire room, connecting my father and I in an otherwise unknowable way. For that short time I was fully aware of my connection to everything, but particularly to my father; interpretations of the word father are welcome. </p><p>If the word God is a turnoff to you feel free to replace it with whatever you see fit. I know of no other way to describe what I felt that day.  Anyway, I don't know if this story will help anyone else, but it is the first time I have put it in writing and it is kind of healing to relive it. My Dad passed away a few years ago, but it is a comfort to have shared that experience with him.  Thanks for reading.</p>"
}
