{
 "title": "A Miracle for Withdrawal",
 "author": "Chris",
 "citation": "   Chris. \"A Miracle for Withdrawal: experience with Opioids & Kratom (ID 44652)\". Erowid.org. Oct 10, 2005. erowid.org/exp/44652",
 "substance": "Opioids & Kratom",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Kratom",
   "(dried)",
   " ",
   "  ",
   " ",
   "Opioids",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44652",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 10, 2005",
   "Views: 10992",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've abused various types of painkillers for more than five years, and Ive been using kratom since Ive discovered it, more than two years ago.  \r\nIt all started when one of my friends came down with cancer.  He was first prescribed codeine for the pain and ended up giving me three tylenol 3s.  I was overwhelmed by the warmth and comfort that came over me.  Even though I truly enjoyed the high it provided, I felt no need to try and find more.  Whenever he offered, I'd accept, which was probably a couple of times a week.  Well, as the months went on they switched him to morphine, then oxycontin, and finally, fentanyl.  Needless to say, he became extremely addicted and would suffer withdrawals 4-6 hours after the last dose.  He would still be able to offer me a dose of whatever he had every once in awhile.  After doing oxycontin and fentanyl, I knew I would be absolutely screwed if I ever had easy access to these substances.  I had never felt so absolutely amazing when on opiates, but I still hadnt become physically addicted, just mentally.\r\nAfter awhile, my friend's doctor realized how physically dependent he was becoming, so they lessened his prescriptions dramatically, only enough to get by without feeling major withdrawals.  It bugged the hell out of me that he wouldnt be able to give me painkillers anymore, but I completely understood and accepted it.\r\nTwo months after that, I moved to the East Coast and ended up discovering a connection for vicodin.  Even though vicodin didnt compare to the more potent opiates, it still worked and this time I had access whenever I wanted, instead of waiting for a sick friend to offer.  I had just graduated college and had a decent amount of money.  In a matter of three months, I blew all the money I had saved.  I was taking numerous amounts of hydrocodone daily, up to 25-30 of the extra strength every day, where it was costing me around seven dollars a pill.\r\nThe problem with pain meds, at least in my experience, is that when I've become dependent upon them, they completely lose their wonderful euphoric feeling, which is the reason I became addicted in the first place.  I find that I need them just to function in any normal everyday task.  And when I ran out of money and my supply was gone, that's when the withdrawals hit me without a warning.  What my body and mind goes through during withdrawals cannot be described through words.  It's the most horrible feeling.  It would last four days for me, but those four days feel like an eternity.  Anxiety and depression overtook my mind, while at the same time my body felt like it belonged to a 90 year old man.  Constant sweating, crying and shitting would consume the whole day and when I thought the worst was over with, it would hit me like a sledgehammer at night.  Sleep was absolutely out of the question.  I heard stories of how junkies would try and commit suicide when they couldn't get their hands on heroin, and now I completely understood.  Well, I did finally make it through the withdrawals, but even after all that hell and torture, I still thought about the high.  So much so, that I started researching the net for alternatives.  \r\nThats when I discovered kratom.  I ordered the highest potency offered (6 grams for a strong effect) and was pleasantly surprised by the effects.  I ordered more and more, and then became worried that I would have to suffer the withdrawal effects again, so I stopped abruptly, worrying that I would have to suffer extreme hell once again.  The withdrawals never came, and so I continued to order.  Well, it's been about two years since I ordered my first batch of kratom, and I now get sick when I discontinue use, but it doesnt even compare to the withdrawals off of opiates.  It's tolerable and I don't fear what would happen if my supply were to end.  I wrote this report, because I just wanted to share how easy it is to become dependent on what seems like a harmless little pill.  \r\nTrust me on this one, kratom is a miracle drug for withdrawal symptoms. I'm still using and have no plans to stop, but when I don't have access, its nowhere near the effects of opiate withdrawals. One last note, it is possible to do too much kratom.  I was having a bad day and decided to take arounnd 20 grams of super premium kratom.  I ended up collapsing into a full on seizure right in front of my mom and sister and had to stay the night in a hospital.  Just a little warning:  don't overdue it.  Kratom needs to be respected like every other drug.\n\n\n"
}
