{
 "title": "Poppies: The Shape of Our Undoing",
 "author": "Post Modern Sleaze",
 "citation": "   Post Modern Sleaze. \"Poppies: The Shape of Our Undoing: experience with Heroin (ID 44664)\". Erowid.org. Mar 3, 2008. erowid.org/exp/44664",
 "substance": "Heroin",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44664",
   "Female",
   " ",
   "Not Given",
   "Mar 3, 2008",
   "Views: 8764",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nMy compatriates, the psychic vampires, cold and pale beneath the NewArk moon, scammed and stole and sold their mind, body and souls, to what,i did not know but soon would know too well. A grey morning, sitting among the dreary drear listening to mind-fucking tales of near deaths and great escapes, my curiosity overwhelming me,i tossed my doubts aside and plunged a rolled up bank note into a wax-paper stamp collectors bag with hesitation. Prickly,sickening realisiation of what i had done was quickly dismissed by a cloudy feeling encompassing my mind. A pleasing warmth spread throughout my extremeties, leaving me paralysed with ecstasy. The vampires sat around with heavy heads and black, toothy smiles.</p><p>Another pretty young thing sired. </p><p>The following months were blurred and busy, spent stealing, selling, copping, cooking, shooting and nodding.  And soon those months became years and the pretty young things became haggard and shaky. The real world disapeared and I left my youth behind to focus every fiber of my being on getting my beautiful,hateful fixes. A 2 bag tolerance soon became 12, and satisfaction was unnatainable. And yet, i forged on, too afraid to return to the Earth i left behind. Everything else just fell away into the backround when I had a serious junk habit. I feared the normal things that living humans did on a day to day basis. I was the walking dead. </p><p>I awoke every morning, my guts burning and my bones twisting. Shaking, shivering, sweating mass of flesh and ache. My morning routine started with a fast trot to the bathroom to vomit up my stomach lining and dope-sick demons hacking at my spine. And then the first shot of the day. My eyes still sticky and sagging from sleep, i'd carefully pour the contents of 6 bags into a bottle cap and squirt a few drops of water into it, watching the off-white powder liquify and turn brown. My heart pounding and my stomach turning with anticipation, i drop in the balled up peice of cotton and suck the poison into my dull-tipped rig. After a few frustratingly unsuccessful attemps at poking plastic veins i see a bit of red and push the dropper home. Sweet, sick, tingling rush of pleasure courses through me, unfolding and relaxing my pain-stricken self. And now i am ready. </p><p>I spend the day collecting anything i think i could trade or sell to the goldchained, toothless, greasy gangsters at the local hock shop. TVs, stereos, VCRs, DVDs, gold braceletts, diamond earrings, CDs, power tools, computers. I seemed to have an endless supply of things to sell for dope. But it was never enough. I took to spanging at rest stops on the parkway, sweetly feeding the old wifies and home-bound yuppies a sob story about a poor college student trying to make it home on gas fumes. I should've been an actress. 'And the Academy Award goes to: The junky girl at the rest stop!' </p><p>I wasnt too keen on begging for money, but desperate times call for desperate measures. Whether it be giving an ex a blowjob to borrow their rig, or ripping off one of the shadows that lurked on the corner. 'We do bad bad things...' But it was still never enough. </p><p>The years went by and the struggle continued, more and more young kids joining the ranks of the undead and I was queen of the damned. My kiss was like cyanide. One by one my lovers and family died off or disapeared into the darkness,Blue-lipped and unresponsive on the bathroom floor. Red lights flashing through the window from his waiting carriage to Hades,leaving me to find another partner in my slow-dance to oblivion.</p><p>In the autumn of my demise i found him, all doom and gloom and beautiful love that no poison could destroy.Standing on a line under flickering bulbs, wasted early sunday morning at the methadone clinic. An invisible barrier from his eyes protecting me from those old familiar shadows lurking outside the back door. Wretched cherry savior and my return to the world, walking hand in hand with fate, averting my eyes from temptation. 7 months and counting, rebuilding my lost future and wasted years spent dizzy and evil. I take with me the pain of loss and the cold lust for smack. A day at a time, a drink every morning and a daily battle with my psyche.</p>"
}
