{
 "title": "Great for Sleep",
 "author": "AKT_UndertheBridge",
 "citation": "   AKT_UndertheBridge. \"Great for Sleep: experience with Trazadone (ID 44673)\". Erowid.org. Mar 24, 2008. erowid.org/exp/44673",
 "substance": "Trazadone",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Trazodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44673",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 24, 2008",
   "Views: 26331",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Trazadone is not really for recreational use, since it is nothing but a powerful sleeping aid, but if you're looking for a long and deep sleep, Trazadone is what you're looking for. I have taken this drug on several occasions, and it's great for sleeping. The pills I take are 50mg each. Here is a little chart of what each amount of Trazadone will do.</p><p>50mg-100mg: Within an hour of taking the pills, I will feel tired, but not to the point of passing out or anything. This amount of Trazadone will usually give me a good night's sleep without waking up during the night. Dreams may be clearer than usual, and I may remember them with more accuracy than usual.</p><p>150mg-200mg: After taking 3 pills (or 150mg), I will feel the tiredness feeling come on slowly. Within an hour, I will be very tired. Four pills (200mg) will make me feel extremely tired, almost to the point of passing out. Taking 150mg-200mg of this drug usually causes me to have very vivid dreams, and I am usually able to remember them much clearer than I normally would. I haven't had a lucid dream while taking this drug as of yet, but I would imagine it is very possible. When I take Trazadone, I usually sleep at least 8 hours. One time when I took 4 pills (200mg) I slept for around 11 hours.</p><p>When I wake up from sleeping, it takes me an unusually long time to get fully awake. Also, my eyes always are red, almost bloodshot, for about 30 minutes after I wake up, which is a clear sign of deep sleep (which is good, considering this is a sleeping pill). The day after taking Trazadone, especially after large quanties of it, I feel very drowsy and tired. This doesn't really occur with dosages of 50mg, but it will occur with higher dosages.</p><p>Positive Effects: Works wonderfully as a sleeping pill. It makes me very tired about an hour after taking it, and gives a great sleep with vivid dreams.</p><p>Negative Effects: The day after taking Trazadone is always clouded by drowsiness. I just feel tired and uninspired for a large portion of the following day. Some caffeine or some other kind of stimulant should take care of that.</p><p>Overall, this is not a recreational drug. It is a sleeping pill, but a powerful one at that. If you are having trouble sleeping, I suggest you take Trazadone. I don't use this drug on a normal basis, just every once in a while, so I have not noticed any negative physical effects.</p>"
}
