{
 "title": "Murderous Lego Men",
 "author": "Casual Toker",
 "citation": "   Casual Toker. \"Murderous Lego Men: experience with Salvia divinorum (15x extract) (ID 44698)\". Erowid.org. Jul 26, 2007. erowid.org/exp/44698",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 44698",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 26, 2007",
   "Views: 4497",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a short account of my first time using salvia divinorum.</p><p>My friends and I had been using mushrooms for a while and had decided we wanted to try another psychodelic before the transition over to taking acid. As salvia is available legally over the counter (providing you're 18) we all had a totally false conception of what salvia would be like.</p><p>We had decided to bong it in my living room so I packed the first cone. At this point I had no idea what was going to happen. I sucked a two hit cone of 15x salvia and held the smoke down for approx 20 seconds. After breathing out I waited a few seconds and the began to laugh un-controllably and maniacly. At this point all of my friends, who were just sitting around watching me, began laughing as well, which was pretty dis-concerting t me at the time.</p><p>Now, here is where I remember things went really wrong. Most people who have taken salvia had a feeling that my skin was being pulled or pinched and on feeling this I began to panic and try to resist the trip. In a flash I remember being brutally pulled across every letter on the page of a book by my ankles, all that was running through my mind was getting off the book and stopping whatever was pulling me from pulling me.</p><p>Next thing I know I'm running through a huge white room being chased by (and yes I know this is ridiculous) small men made out of lego, eventually they catch me and restrain me on the floor and then all I can hear is this odd english voice repeating 'Hold him down' 'Don't let him move an inch'. At this point a feeling of utter desolation sets in as I get so confused I forget I'm tripping and think I'm about to be murdered by short lego men, and then I'm back in my living room with all my friends sitting around me.</p><p>Afterwards my friend told me I had attempted to run up my living room wall and then dropped to the floor screaming 'Get me out of this reality!' it was at that point my friends felt the need to hold me down.</p><p>I have since had many good experiances with salvia and still have the odd cone every so often.</p>"
}
