{
 "title": "The Best of Times, The Worst of Times",
 "author": "Mick",
 "citation": "   Mick. \"The Best of Times, The Worst of Times: experience with Cannabis (ID 44738)\". Erowid.org. Sep 25, 2008. erowid.org/exp/44738",
 "substance": "Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "11 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44738",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2008",
   "Views: 2814",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had first tried weed almost a year before this night and was smoking regularly for about 5 months before this night. I thought I was very knowledgeable about the drug but this night really showed me otherwise.<br>We smoked through my friend's bubbler and the weed tasted of pine. Shortly after the first hit I could feel the muscles in my face and eyes completely relax. I was at a point where I very well knew I wasn't normal, but not quite high yet. 3 of us went through about 3 bowls at first. Now, we had already ordered the pizzas so it was only a matter of waiting. Quickly, paranoia set in. The phone rang and none of us answered it. As we ran into the room with the answering machine all we heard was, '...so I'll be there in a few minutes K.' <br>We flipped out. My friend's parents were gone and no one was supposed to be there so we just flipped. None of us even attempted to listen to the entire message; we just left the place with pizzas on the way. As we drove around my friend's neighborhood time was so stretched out. Minutes felt like hours and I was shocked to find out how only 5 or so minutes had passed since we left the house. We passed the pizza guy, who was parked in the neighborhood, 3 times! As it turned out they simply couldn't find the house and were calling for some help. I think this is a great example of the paranoia that weed can sometimes cause.<br>My appetite became larger and larger. My stomach was like a never-ending pit. I ate 6 pieces of pizza, some mini ice cream sandwiches, and a hot pocket. I was still hungry. After feeding our gluttonous selves we smoked more. At this point (about 1-2 hours after the initial smoke) I started feeling an extremely painful headache. Stupid high me thought, 'Well it will go away if I get more high.' Well, it did go away, for about an hour. After that the headache just got worse and worse throughout the night. My skull was pounding, I was hungry, tired, yet I couldn't sleep because of my headache. This is the first time I've experienced an extreme headache of this sort with weed. Before we smoked my friend said it would be the most potent weed I've smoked and I COMPLETELY underestimated his warning. My brain throbbed and the coming down process seemed like it took days. Nearly 12 hours after the initial smoke the headache finally ceased yet my mind still felt very fuzzy.<br>All I can say is never over-indulge in weed you're not sure about. That night my mind felt like it ceased to function. Every word that rolled off my friend's tongues sounded beautiful. Every morsel of food tasted more delicious than I can remember. But an incredibly painful headache ruined my night and I will always be wary of how much I smoke from now on.\n\n\n"
}
