{
 "title": "Beware of Ego",
 "author": "Glimpses",
 "citation": "   Glimpses. \"Beware of Ego: experience with LSD (ID 44746)\". Erowid.org. Jul 17, 2005. erowid.org/exp/44746",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 44746",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 17, 2005",
   "Views: 8173",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As a sort of flip side to my submission titled:'God or Insanity', in which I describe an LSD experience with my father, I felt compelled to share another experience which is an example of what can happen when (through my interpretation),ego and arrogance decide that they are more powerful than the drug.</p><p>In the months following the experience described in the other submission, I felt a presence, a sort of new found wisdom, clarity, and happiness toward life... However, gradually, my ego began to become dangerously intertwined with the experience; it slowly crept in and began a kind of claiming of responsibility for this new gift, twisting it in a way that was not honest. I don't recall if, in the back of my mind, I was aware of this or not at the time, but if so, that crafty ego was successful at pushing it far enough back so as to be ignored.</p><p>At any rate, the 3 months that followed were the best of my life. My relationship with my father was incredible and I felt at peace and genuinely happy. Paragraphs full of wisdom would come from my mouth, coming without any thought at all, surprising all who knew me, including myself. This, I thought, was something that had to be shared with my brother.</p><p>My brother has always been a tormented person. He has great difficulty letting go of pain. His relationship with Dad was always rocky at best. So when I mentioned to Dad the idea of including Bro in our gift, he thought it was a good idea, and plans began. Apparently we were now Gods and would take it upon ourselves to make decisions for my brother; in his own best interest of course.</p><p>We informed my bro of the plan, which was to go into the mountains, rent a cabin and reproduce the experience shared by dad and I. Bro was very resistant to the idea of the LSD, but didn't want to pass up the chance to do some bonding with Dad.  (I feel it necessary here to defend dad on this whole thing. There was nothing in the world he wanted more than to have a relationship with his son. As wrong as this whole thing was, it was born out of love. (As for me, I was just pretty much selfish and hoped to expand on the gift I had been given.)</p><p>Once at the cabin, we all partook in a tab and a half and began talking about life. After an hour or so I didn't feel 'high' enough so I ate another tab and a half. </p><p>The conversation was good for a while, but eventually I began to talk without a breath for what seemed like forever. When Dad asked if he could get a word in, I said, 'Just overpower me,' ego full throttle now. Dad snapped back, 'listen to yourself....' Well these three words triggered a hellishly abusive, psychologically damaging, introspective character assassination on myself which I in fact still battle with at times to this day. All of the clarity and joy that had been present since the previous experience, was suddenly replaced with insanity, fear, and a despair that can only be understood by those who have experienced the abyss of darkness induced by a catastrophic trip. Would I ever recover from this? I deserved it didn't I? Who the hell did I think I was? God? ....Well God sure put me in my place that day. The rebuilding, I knew, could take a lifetime.</p><p>Surprisingly (or maybe not), my brother was actually the dominant figure that evening. He was the only one who went in without any disillusioned ideas of what would occur that evening. He, for a change, was the pillar of strength. He didn't have any mystical experiences, but I think he actually gained some confidence seeing his 'stronger,' older brother reduced to a babbling moron, and his father struggling to explain himself. As to exactly what happened between he and Dad that night I don't know deatails due to my being trapped in my own hell, but from what dad told me, it was the worst night of his life. Suffice to say, our desired effect was far from realized. He described his nightmare that evening to me months later, once we had enough distance from the night to actually discuss what happened. He was enclosed in a capsule, slightly larger than the size of his body, the capsule permanently sealed by the hand of God, and floating through space for eternity,,,, in total darkness,,,, alone.</p><p>While the whole thing was indeed a setback, there was no choice but to look it in the eyeballs, and learn everything possible from the experience. In fact it has only deepened my respect for the drug, rather than instill any sort of fear of it. Using the drug the way that we did here was a recipe for disaster. When I began to think that I was more powerful than the drug I should have backed off for a while and gotten a grip. BEWARE OF EGO.</p><p>I am far enough away from that experience now that I think I have a pretty good handle on what happened and why. At first, it was sort of like surviving a violent hurricane, then climbing a nearbye mountain and looking down upon the wreckage to better assess the damage. Now the view of the landscape looks even better than it did before the hurricane, though there are still some areas which remain under construction.</p>"
}
