{
 "title": "Methcathinone Experiences and Mixtures",
 "author": "Xorkoth",
 "citation": "   Xorkoth. \"Methcathinone Experiences and Mixtures: experience with Methcathinone, Caffeine, Ephedine, Dextro-amphetamine & Alcohol (ID 44779)\". Erowid.org. Mar 2, 2007. erowid.org/exp/44779",
 "substance": "Methcathinone, Caffeine, Ephedine, Dextro-amphetamine & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Methcathinone",
   "(powder / crystals)",
   " ",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  repeated",
   " ",
   "Amphetamines",
   "(pill / tablet)",
   " ",
   "  repeated",
   " ",
   "Ephedrine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44779",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 2, 2007",
   "Views: 14822",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, considering my general liking of stimulants, I ended up finding out how to make methcathinone.  I had recently received a small amount of dexto-amphetamine (adderall), and remembered how much I love that feeling.  So of course, I begin to search online, and lo and behold, I find methcathinone.  After discovering how easy it is to make, I set to work slowly gathering the ingredients, making sure to go to different places for each thing and paying in only cash.  Once I had everything together, I began to follow the procedure using potassium permanganate.</p><p>It took longer than expected and I spent two nights in a row staying up until 5 am on ephedrine when I had to wake up at 6:45 for work.  I was a bit worried that I had failed until the very end, when I ended up with a yellowish-white, flaky, sticky powder that smelled like it was supposed to.  I must say, cat does smell great, like sweet pistachios, in solution, but as crystals it smells a little chamical-ish and not as good.</p><p>I proceeded to first try to eat some of it, as it was very difficult to cut up in crystals small enough to snort.  The effects were weak but noticeable, nothing to write home about.  Smoking it had some similar effects.  Then I tried snorting it.  </p><p>OUCH!!!</p><p>Man, this stuff burns wickedly!  I've heard it's like meth in the snorting pain department, though I've never had meth and probably shouldn't try it for my own good (though I want to!)  I didn't feel much so I snorted some more.  Unfortunately, dosages are tough for me to estimate, but I'd say that once I had about .5 grams, I started to feel... good.  Not great like with amphetamines, though.  Not powerful, not like my brainpower was increased.  Just a general sped-up body feeling that was rather weak, and a general mood lift.  I must say, I was pretty disappointed.  I consumed the rest of the cat in this manner over a few days.</p><p>I made it again about a week later, and this time I definitely produced a better product.  About half of my crystals were a very, very faint yellow-white, and the ones that I gave an extra acetone-wash were so white they looked blueish next to the yellowish crystals.  This time, all of them were easy to cut up.  I tried my product again this time, and noticed a marked increase in quality of effects, though still nothing to write home about.  Also, the terrible burn was made easier to handle, not b y reducing its intensity but by making it short-lived.  A few moderate lines (maybe 250 mg total) would give me a nice speedy buzz that would remain for a couple of hours, leaving me feeling a little strange (though nothing like the coke come-down).</p><p>So I decided to experiment with some mixtures:</p><p>Dextro-amphetamine, alcohol: </p><p>I snorted 30mg d-amphetamine.  After enjoying the buzz for a while, I chewed and ate 20mg more.  Now I was feeling great, talking non-stop and generally feeling very loved-up.  I decided to try some methcathinone then, when the amph. began to wear off a bit.  I did about 100mg (estimated), and felt instantly the effects brought back up to almost the level they had been at, though not so pure.  Then I had a shot (actually, 1/2 shot of Everclear mixed with Sprite to make one above-normal-strength shot).  Now this was awesome.  The body buzz was amazing, and I had pleasure coursing through my veins.  So of course I wanted more after about 20 minutes of this.  So I took another line or two and another shot.  In this way, I kept myself at a constant level of bliss until a freakishly late hour, about T+6:00 from beginning to drink.  This is while I am taking 2-3 shots per hour, with cat each time.  I ended up taking about 12-15 shots, which is amazing considering I normally would be practically dead from this amount.  And I really didn't feel very drunk at all, just good.  The next morning, however, I felt HORRIBLE at work.</p><p>Just alcohol:</p><p>Another time I tried mixing cat with alcohol in the same way as above, except without Adderall added in.  This time, I made it to about 10-12 shots and quite a lot of cat, when suddenly I was being woken up by my girlfriend the next morning.  For some reason, I had blacked out and passed out on the couch instead of the bed.  I had a terrible hangover, again, and the general icky, slightly depressed feeling I get when I black out from alcohol.  Not particularly pleasant - it seems like the amphetamine was a crucial part of the mix here.</p><p>Ephedrine, caffeine:</p><p>Seemed to cancel the effects of these two, but also made the cat feel better, speedier, and stronger.</p><p>All in all, I'm disappointed by methcathinone.  It's not that it's bad; I enjoy the effects, but I was just expecting more.  The burn makes it barely worth snorting, and other ingestion methods seem not to work very well.  I really fail to see how anyone could love it so much that they'd ruin their lives on it.  Besides that, it's cheap as hell (start-up costs and the cost of pseudoephedrine).  However, it is easy as hell to make, and the materials you need to buy will last for many syntheses.</p><p>Just my two cents.</p><p>Peace,</p><p>Lightwarden</p>"
}
