{
 "title": "Trip to Anywhere",
 "author": "Miro",
 "citation": "   Miro. \"Trip to Anywhere: experience with Ecstasy, Mushrooms & Cannabis (ID 4479)\". Erowid.org. Feb 19, 2001. erowid.org/exp/4479",
 "substance": "Ecstasy, Mushrooms & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:30",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4479",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 19, 2001",
   "Views: 13396",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n11:20 pm: first hit of e</p><p> 2:30 am: second hit of e</p><p> 4:00 am: 1.5 grams of mushrooms</p><p>Well, for new years, i was able to get a group of my very closest friends in the world to come with me to a wonderful new years eve party.  We had decided to do ecstacy that night.  I had brought with me about 1/16 of dried mushrooms and a couple bowls worth of pot.</p><p>A little history on me.  Up until this summer, my entire use of drugs consisted of drinking every once in a while, and smoking marijuana frequently/daily.  9 days ago, i was finally able to obtain 3/8ths of a mushrooms, and this same group of friends and i tried 1.75 grams each.  That left us with 1/8th left over.  About 3 days ago, i dosed again with mushrooms, same dose as before, but this time by myself as therapy for a bit of depression. I wanted to see if i could overwhelm my mind, and learn something about why i felt that way.  It ended up being extremely positive toward the end and im glad i did them that way.</p><p>So, we arrive at the party at approximately 11:15 or so, and it took a bit to find the e for us.  We all purchased 2 hits, and took 1 of them right there.  My friends seemed very restless and not into the party at all, so they kept wandering from room to room, never settling anywhere.  After about an hour or so, the e finally started to hit, very slowly as well.  This first peak was nothing special...it must have been a relatively low dose in the capsule.  I had the standard good feelings etc normally associated with e, but no emotional breakthroughs.</p><p>At about 2:30, we decided to take our second hit of e.  It started to hit faster, and by 3:30, i was starting to hit my second peak.  This was much more what i wanted to experience that night, and was much more intense.  It is difficult to put into words what it was like.  </p><p>My personality is such that i get alot of pleasure by making other people happy, so when i see someone who is not completely happy, i do everything i can think of to try to help.  Unfortunately, my friend R. was having some stomach problems, and wasnt really able to dance or get much into the party.  But the others, A and L were fine, and we spent alot of time together.  I had a wonderful conversation with both of them, and really was able to feel like i got a bit closer to them.</p><p>The real experience started around 4:45 or so when the mushrooms hit.  I decided at 4 that i wanted to do them, and at first, i was just going to take half of my normal dose, but after giving a little bit to A, i decided to just eat the rest, so that left me with about 1.5 grams.  I didnt really know what to expect, i just hoped that it would be intense.  I was not dissapointed.</p><p>After they came on, EVERYTHING changed.  I was standing outside, just kind of moving to the music when suddenly, everything went to slow motion, and i said immediately, ok NOW im tripping.  </p><p>I walked inside to the hardcore techno room, where they were playing some VERY intense, HEAVY bass pounding music.  I think that they were playing stuff specifically for those people who were on psychedellics, because my other friends being there, and not tripping like i was just couldnt appreciate the experience.  Everything was leaving trails, and with the strobe light, everyone got this weird aura around them, its very difficult to describe, but it looked like one of those 'blur' t-shirts where the printing is out of focus.</p><p>At one point, when the music was climaxing and it was just this one pounding note, probably at 180 bpm or more, i was facing some colored flashing lights and closed my eyes. I was immediately in a different world.  I was having real closed eye visuals for the first time in my life.  Any image i wanted, i made appear.  It was usually in black and white, sort of like that generic greyish-whitish plastic color that computer graphics have before you put a texture on them.  At one point i thought, can i have some color?  And immediately, these beautiful colors started raining over the shapes i was creating in my mind.  I was manipulating them in 3d, rotating them around, just to show myself that i could.</p><p>After finally starting to take everything in, i put in my earplugs and stood in front of one of the big speakers, leaning my whole body against it.  When i closed my eyes, i suddenly was travelling down this psychedellic type vortex at a thousand miles per hour.  Then i decided i wanted to be on water, and this most amazing scene appeared.  Suddenly, i felt like i was skimming right above the surface of this long straight aqueduct lined on either side by HUGE marble columns, very greek in nature.  After what seemed like a very long time, i opened my eyes and walked out of the room.  I found that i was completely out of breath and very taken aback.</p><p>Through the rest of the night, my mushroom/e trip turned much more intellectual and i became EXTREMELY introspective and analytical.  My mind is like this when im sober, so when i was tripping, it took it to the nth degree.  I noticed the huge difference in people that i saw.  Those who took the e to be the end all be all of drugs, who were so caught up in it that they looked like lip smaking idiots.  The grimacing and other facial expressions some people were making just appalled me.  </p><p>At this point, it was 7 in the morning, and the party was starting to wind down.  I had closed eye visuals for the rest of the morning, and finally fell asleep around 12.</p><p>I guess in conclusion, i was very impressed by this, but not at all challenged intellectually.  Even at the most intense moments, i knew that i could handle more.  I am looking forward to my explorations with these very amazing substances.</p>"
}
