{
 "title": "It's All About (inter-dimensionary) Love",
 "author": "Jack",
 "citation": "   Jack. \"It's All About (inter-dimensionary) Love: experience with Salvia divinorum (ID 448)\". Erowid.org. Jul 30, 2000. erowid.org/exp/448",
 "substance": "Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 448",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 30, 2000",
   "Views: 6721",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHaving previously had about 1 g of Salvia a night for the past 5 days, and had good experiences each time, I thought I was now ready for a more powerful experience. I packed a large bowl full of salvia leaf (carefully crumbled) using the scientific Buchner funnel as a bong. It has very close tolerances, and the flow of smoke throughout is great.</p><p>I turned the lights off so the room was completly dark, and used a laser pointer to navigate my way to the CD player. I put on the DJ Scott Project 'How Deep Is Your Love'. About 5 minutes long, I put it on a reasonable volume. Even without drugs this was a worthwhile experince. Not having any sight makes the music seem amazing.</p><p>Anyway, I held two lighters to the salvia until it glowed red hot. I then took a huge toke, and felt the burning smoke go into my lungs. I breathed a bit more air in, and held it for 30 seconds. Even after this the effects become more noticable; the music gets louder, and my vision had had the usual salvia blues around the edges. However, I still had my senses, and I took another great toke, holding the lighters to the salvia whilst breathing in. I held this in as long as I could, and let it out as I lay down. </p><p>However, the weirdest thing then happened. Instead of feeling solid floor underneath my back, I sort of just swung around so I was sitting on the bottom of the floor. Imagine a pin going through your feet sideways, and pivoting on that, and that's how it was. I wasn't upside down though, I was the right way up. As if I had my own plane of gravity. I then proceeded to move on an airport style lift, whilst in front of me there were many people, blue and red, sitting down. They formed a huge word - LOVE. I remember marvelling at the word - a feat of human engineering I thought. Meanwhile, in the song a loud voice was saying in a Barry White style voice 'You know what I mean... It's all about LOVE' As usual , a female force was directing the whole event, and her voice was occasionally heard. I have no recollection of how long this lasted, or if I had my eyes open or closed. Next thing I know my sense had sort of returned and I remember trying to test if this dimension was real by grabbing one of the people as I travelled by the massive love. To my surprise, I felt something solid under my hands! I was very excited, as I couldn't wait to tell my friends that a Salvia dimension physically existed. I was also a bit scared that I wouldn't be able to get back to the normal dimension.</p><p>Next thing I know I've sat up, and am a few yards over the room to where I was, staring at my hands. I'm still holding the lighters very tightly, and I literally gasp out loud and start breathing really heavily as I realised what I've just done. The music sounded plain annoying, so I turned it off, and the bloke's voice was just scary. </p><p>I couldn't believe that the Salvia had engineered the trip from the start to involve me holding the lighters. I still can't really comprehend how it knew I'd be holding the lighters, or how it knew I'd grab hold of one of the people.  It really overwhelms me how real it was. It was like I was in another dimension.</p><p>Having only done 'fun' drugs (hash resin, shrooms) I really can't compare it to any substances like 2-CB or DMT. But for me this was the peak of my salvia experiences. Having done it several times more after this, it's never really compared. I learned from this trip that there is a greater meaning to everything, and love really is important, if not the most important thing in human lives. Sounds a bit hippy I know, but it seems so true now.</p><p>I am totally overcome by the fact that the Salvia or my brain could engineer such a detailed trip and  predict and make the trip to what I had previously decided or was going to decide to do. I also am in awe of why _everybody_ gets a woman's voice and presence. Surely this proves that other forces DO exist.</p>"
}
