{
 "title": "Riding the Tram Car",
 "author": "Cashmoney",
 "citation": "   Cashmoney. \"Riding the Tram Car: experience with Tramadol  (ID 44803)\". Erowid.org. Feb 10, 2008. erowid.org/exp/44803",
 "substance": "Tramadol ",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "44803",
   "Male",
   " ",
   "Not Given",
   "Feb 10, 2008",
   "Views: 28689",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My affair with Tramadol began about a year ago. Persistant migraine headaches prompted me to begin using. After Exedrine stopped working I got a perscription from my doctor for Tramadol. I am a veteran opiate user at only age 19. I have never used heroin or injected any drug, though I have taken a multitude of opiates. I did not want to keep this pattern of drug use because opiates can consume your life if you are not careful. Yes, they feel wonderful. But, those magnificant feelings fade and it becomes a way of life rather than a social, recreational experience.</p><p>I tried Tramadol last year for about a month then stopped taking it with no problems. Last year, I didn't establish any sort of dosing pattern or habit. I did it occasionally and only when I needed them most. However, in April of this year I reaquired a prescription from my doctor because the headaches returned. It was most likely due to the stress of my sudden move to Los Angeles, CA from Philadelphia, PA. It's a big move for a 19 year old, especially by yourself!</p><p>I began taking two 50mg tablets just before I started work. An hour later, I'd start to feel the effects. The effects are not unlike other opiates. I get euphoria, pain relief and relaxation. Unlike the 'real' opiates, such as, oxycodone, codeine, hydrocodone, morphine, etc., I have other effects such as increased energy. I get unusual side effects as well. I still have the itching, which I've noticed goes away as my body becomes accustomed to the drug. However, Tramadol can cause seizures at recommended doses in susceptible individuals.</p><p>The effects generally lasted about eight hours from start to finish, which is very long compared with other opiates. About six hours into this, I would take two more 50mg tablets as directed by my doctor. I'd get the same effects but to a lower degree. It could have just been that I didn't notice a difference because I was still feeling the effects of the first dose.</p><p>This pattern of use continued over a period of a few months. I decided to drink one night and I did indeed take my prescribed dose. I have found that I can drink like a fish on these and still be on my game. This is *NOT* recommended and I do not do it anymore because it really is not safe. While unlikely after a few drinks, the respiratory depression of both drugs combined can cause you to die. Also, that puts incredible strain on your liver.</p><p>I was having a great night. I went to bed and didn't sleep very well. I could not stop moving my legs around. I did sleep for a little but then I woke up with hot flashes, aching knee joints, muscle pain, and the feeling of doom. I could not stop moving. I had to be moving always. If I stopped, I felt like I was going crazy! I couldn't quite figure out what was wrong. I took one pill, fell asleep for a few hours in the midst of the midday rush of the house I was living in. I had a good number of roommates and the atmosphere was anything but quiet. I fell right to sleep and woke up with all my symptoms gone. At that point, I was introduced to true addiction.</p><p>I still take Tramadol and I would like to stop taking it. I have worked it out so I can gradually ween myself off of it over the course of a month or two. It has helped me in many aspects of my life which were lacking because of the daily headaches I was experiencing. I just want everyone to know of my experience before you decide to take it. It's good. It's bad. The choice is yours. To each his own.</p>"
}
