{
 "title": "I never thought it would happen to me",
 "author": "Alaura",
 "citation": "   Alaura. \"I never thought it would happen to me: experience with cocaine (ID 449)\". Erowid.org. Jun 29, 2000. erowid.org/exp/449",
 "substance": "cocaine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "449",
   "Female",
   " ",
   "Not Given",
   "Jun 29, 2000",
   "Views: 8030",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI couldn't tell you when I became addicted to coke. I realized it when one day when I couldn't get any. Im 16 yrs old and I am a coke head. Last month I weighed about 150 pounds. Now I weigh between 120-125. I cant eat. My entire life is planned around coke. This past week I spend about $900 on it. My closet friends call me a coke head. I throw up almost every day. Somedays my nose hurts so bad I can't snort coke, so I'll buy some crack. I do about 4 lines before school, and more lines whenever I can sneak them in. I carry my coke with me everywhere. Everytime I do a line it makes me want to cry because I know that I'm hurting the person that I care most about. But I cant stop. I used to tell myself that it would never be this bad, that I wouldn't let it happen. I guess nobody's that strong. I've thought before about trying to quit, but Im not sure if Im ready yet. </p><p>I feel like shit all the time. When Im on coke and when Im not on it. I get so weak sometimes I cant walk. In school I can hear kids whispering about me. They say there she is, shes the coke head. They walk by me and snort. You know its bad when the people that you sometimes snort it with tell you that you might want to slow down. I ran out of money a long time ago. Now I sell whatever I can. I had a job but I got fired, and now I dont have the energy to look for a new job. Nothing gets me going anymore. The other day I looked in the mirror and the reflection staring back at me didnt even look familar. One day before school I did a little too much. I puked and started shaking really bad, I got dizzy and I thought I was going to die. That was when I knew that this was serious. I had become what I promised myself I would never be. A junkie.</p>"
}
