{
 "title": "Dr. Phil in a Pill",
 "author": "Shaggy",
 "citation": " Shaggy. \"Dr. Phil in a Pill: experience with MDMA (Ecstasy) (ID 44944)\". Erowid.org. Oct 3, 2008. erowid.org/exp/44944",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 1:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "44944",
   "Male",
   "",
   "Not Given",
   "Oct 3, 2008",
   "3901",
   " "
  ]
 ],
 "report": "<p>It was Friday afternoon, and I was getting a phone call from Mike. He asked if I was doing anything later that night, and seeing as how I said no, he asked a favor of me. He asked if I would be willing to drive him, Lyle and Daniel, all good friends from high school band, to the movie theater so they could see Charlie and the Chocolate Factory while they tripped shrooms. I agreed, on the condition that they smoked me out really well so I could put up with them in that state.</p><p>Almost immediately after I got off the phone with Mike, I got a call from Stan, a friend from college that the other guys hadn't met yet. He had been asking me for a while if I could get him some shrooms and trip with him for his first time, and tonight he said he was in the right mindset, and had the money. I told him how I had already told Mike and the other guys I would babysit them. Stan then suggested that we just get really stoned so that way I'm not 'alone' while I'm looking after three guys in another universe.</p><p>I then called Mike and told him to forget smoking me out because Stan was going to be getting some good pot. Mike asked if he Daniel and Lyle could come over and smoke instead, because the shrooms fell through at the last moment. I told them to come on over and that way they could meet my friend Stan. Before long I had all four of these guys over, and we were trying to get our hands on some dank. While hunting down some dank, Stan happened to call someone trying to get rid of seven rolls. He asked if we were interested, and we all looked at each other (having never tried X before) and enthusiastically said yeah.</p><p>Forgetting all about smoking, we went to get the pills. On the way Marcus (good friend, and raver) called me and asked what I was up to. I told him the whole story, and he asked if he could join because for some strange reason he felt like rolling from the second he woke up that morning. I said sure, seeing as how we were getting 2 more hits than we needed. When we got back with the pills that were blue and had imprints of little bears on them, we couldn't wait and each swallowed one half at about 11:30 pm.</p><p>Before long my roommate Rob got home. Rob and I had been having a lot of issues with each other for the past few months, and I was afraid his presence might ruin my experience. In any case he asked what all of us were doing, and after we explained he asked if he could join. Rob is an alcoholic, but rarely smokes pot let alone does anything else. Stan, being good friends with Rob, immediately gave him his extra half.</p><p>An hour after swallowing a half each, nothing was happening. Me and Lyle were beginning to get pissed thinking we threw away $17 on a placebo. So naturally we all chewed up the other half except Rob, who took another fourth and gave his extra fourth to Daniel. Almost instantly Marcus gets up and walks off in an obvious state of euphoria, soon followed by Stan, Mike and Lyle. Daniel, Rob and myself are left on the couch playing video games beginning to get a little impatient, when suddenly I feel this intense surge of pleasure working its way up from my legs through my chest and then my face. I tell Daniel and Rob that I'm gonna go find everyone else because I think I'm starting to roll. I find everyone outside, some sitting in their cars listening to techno (Marcus) and some wandering down the street (Mike and Stan). When I catch up with Mike and Stan I suddenly feel very connected to them, and when I look at them I know they are thinking the same thing.</p><p>We wander around for a bit, admiring the awe-inspiring beauty of nature, and finally decide to go back to the house to see how everyone else is doing. We all convene on my back porch and sit at the table and have a smoke. I notice Rob is missing, and ask Lyle where he went. He said 'I think he went to his room, but I know he's rolling.' 'How do you know that,' I asked. 'Look at the beer Rob couldn't finish,' Lyle said. About that time Rob steps outside with the biggest smile I've ever seen a man have. He sits down and joins us in smoking.</p><p>We start reminiscing about times past, and then proceed to discuss every single thing that we've ever been pissed at each other about. I tell Mike that I know there was a lot of competition between us in high school because we were competing trumpet players in an award winning marching band, and apologize for it. Rob apologizes to me, Mike, Lyle and Daniel because he went to a rival high school from ours, and while he was there managed to help our rivalry make midstate news. Rob and I apologize to each other for all of the shit that had been going down between us in the past month. As the conversation went deeper, and more apologies were made, I could feel the drug getting stronger and stronger with each kind word said. Finally when every problem got worked out, it was like there was an explosion of pleasure within me. It was so strong that I had to get up and walk by myself to preserve the moment in my head.</p><p>When I returned from my walk I found Stan, Marcus, and Daniel in Marcus's car listening to music. I joined them and noticed Daniel was talking about something really strange. After sitting in there for a while with my eyes closed, I sensed something wasn't the way it was supposed to be. I had visuals, and realized that's what Daniel was describing. I listened more to what Daniel was saying, and guessed that that little bit more that he had from the rest of us, really fucked with his head. He thought we were driving on the interstate, and that we hit a cat. However we were sitting in the driveway the whole time.</p><p>The music we were listening to in Marcus's car wasn't doing much for me, so I went to my car and popped in a live Phish album. After listening to a 17 minute Harry Hood, I took a deep breath and went back to the house, where everyone was visibly crashing. No one looked happy anymore, and I could feel the euphoria fading as well. We agreed to do this again sometime, and after a final cigarette, said our goodbyes, and passed out in our respective beds.</p><p>The next day I woke up in one of the best moods of my life, except the irritating jaw clench I was having. I ran into Rob, and shook his hand, and we both agreed that's what we were needing. I talked to Daniel on the phone that day, and he told me that he was walking in the park, because he was still rolling, a full 14 hours after taking his first half.</p><p>This was three nights ago, and we are already planning on doing this again at a concert in three days. It is an experience that for me went beyond the mental realm of most drugs, and is something I will most definitely be doing on a few occasions in the future.</p>"
}
