{
 "title": "We Have Created a Monster: Psycaine",
 "author": "John L",
 "citation": "   John L. \"We Have Created a Monster: Psycaine: experience with 2C-I & Cocaine (ID 44951)\". Erowid.org. Mar 4, 2008. erowid.org/exp/44951",
 "substance": "2C-I & Cocaine",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "2C-I",
   "(powder / crystals)",
   " ",
   "100 mg",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 44951",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 4, 2008",
   "Views: 5687",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friends and I first came across the wonder drug 2ci about 6 months ago (2005).  We exprimented with various doses over a extended period of time, not knowing much about the substance but enjoying life as it was given to us.  We began with small doses ranging from 5 to 15 mgs a dose.  Wanting to push the limits farther, we aquired a large amount of the product with hopes of finding a powerful yet enjoyable high. 40mgs was our claim to fame with highly stimulating visual effects and varing patterns, we were stunned by the drug's flexiblity.  </p><p>Hallucinations varied by user but some of us were taken away from this plane.  Ranging from the extreme to the scary to the silly and funny.  We exprienced many different variations of what my good friend will coined as a 'sensory buffet'.  My circle of friends engages in many variring mind altering drugs.  On many occasions we found ourselves combining substances in order to obtain new highs.  One fateful night Will and I were doing the usual (I:E smoking cannibus).  </p><p>On this night the gang was all there, our friend Justine was feeling generous and gave us a decent helping of Coke, we cut the small pile into 3 lines no bigger then a half a straw.  I had a remaining 20mg hit of 2ci from the night before and I suggested to Will 'why not mix the Coke with the 2ci and blow both?' He smiled and I poured the substance in with the coke, mixed it up with my favroite tool, the razor blade.  The coke took on a new consistancey, it got clumpy and thick after a few minutes of swiling the 2 substance together on the mirror.  </p><p>We shook hands, blew the lines and after a few seconds I was higher then I have ever been in my life!  I immediatly felt my teeth go numb and the room started to spin.  I had a complete body high and felt vary distant from the world.  I was in a glass jar under water!!!  To both of our surprises we instantly started to trip, the patterns began to form right in front of our eyes.  No more wait form the normal oral dose.  The trip was incredible and since then it is the only way we use 2ci.  </p><p>The both of use were in outer space for a good 12 hours.  However I couldn't sleep ... The mixture had all of the good effects of both drugs with none of the bad.  Everyone that has used the combination since then has compared it to using 3 triple stacked E pills at the same time.  Truely a wonderfully powerful exprience.  My buddy Will dubbed the mixtue 'Psycaine'...Have a safe and happy trip!!!</p>"
}
