{
 "title": "Full Body Intoxication",
 "author": "Nobody Lives Forever",
 "citation": "   Nobody Lives Forever. \"Full Body Intoxication: experience with Kratom (extract) (ID 44963)\". Erowid.org. Jul 28, 2005. erowid.org/exp/44963",
 "substance": "Kratom (extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Kratom",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "44963",
   "Male",
   " ",
   "Not Given",
   "Jul 28, 2005",
   "25131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have tried Kratom many times now and felt that I would like to share my current experience with you. Firstly I would like to tell people not to be put off by the taste. Although it is terribly bitter and can induce nausea at taste it is bearable. I find that adding 2 teaspoons of sugar and some lemon juice helps. Also if I follow every swig with holding my breath and eating some bread the taste is far less intense.</p><p>11:47-12:34- I drank my Kratom tea and experienced a strange numbness in my tongue when I pressed it against the roof of my mouth. This is a good sign to me. I drank it a little too fast to start off with and as I stared at the floor I experienced minor visual hallucinations (the floor moved and waved).</p><p>12:34-2:20- Between these hours I experienced the most fantastic high I have experienced. It is similar to an orgasm crossed with a MJ high. Shivers of warmth ran down my whole body and my fingers and other extremities went totally numb. I found myself playing a game in which I sat still in silence just experiencing these feelings. Any movement brought pleasant, warm tingling sensations all over my body although especially noticeable around the head and neck area. Any touch from another human was sensational and I found myself making excuses to be near people to feel their warmth and experience what I can only presume was their aura. There was a neutral sensation of pressure in my ears as well although that only added to my feelings of intoxication</p><p>At the time I ingested the Kratom I had been under a lot of stress as my girlfriend and I had had a couple of arguments. Straight after the experience ended I rang her and sorted it all out. Although I wont credit this all to the drug some of the things I said were from reflections I had experienced during the intoxication.</p><p>Altogether it was a pleasent trip. I experienced stimulation of nerve ends, sedation of my limbs but my mind remained sharp and I was given time to think. I must say however that I felt intensely emotional during this time and expereinced shivers and cold flushes during the hangover period. Aside from this though Kratom still remains my favourite legal drug.</p>"
}
