{
 "title": "Overwhelming, Yet Still in Control",
 "author": "MKUltra",
 "citation": "Citation:   MKUltra. \"Overwhelming, Yet Still in Control: experience with LSD, BZP & TFMPP (ID 44985)\". Erowid.org. Dec 7, 2006. erowid.org/exp/44985",
 "substance": "LSD, BZP & TFMPP",
 "bodyweight": "68 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Piperazines - BZP",
   "(pill / tablet)",
   "  T+ 0:00",
   "50 mg",
   "oral",
   "Piperazines - TFMPP",
   "(pill / tablet)",
   "  T+ 4:00",
   "100 mg",
   "oral",
   "Piperazines - BZP",
   "(pill / tablet)",
   "  T+ 4:00",
   "50 mg",
   "oral",
   "Piperazines - TFMPP",
   "(pill / tablet)",
   "  T+ 5:00",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 44985",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 7, 2006",
   "Views: 9749",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had taken Acid twice before this trip, and had taken a whole tab both times. I've been told that this is very good acid mind you, and I found both other times on acid to be too intense for my liking - it really seems to have a strong effect on me. Living in a country where BZP and TFMPP are legal over the counter drugs (which also contain electrolytes and amino acids to help the comedown) means I've tried the BZP and TFMPP combo quite often.\r\nSet and Setting:\r\nMe and a few mates had a great Drum and Bass gig lined up for the night, and I was quite sceptical about going to a D&B gig on Acid, considering my two previous trips. I was in a sound psycological state - I was happy with my life and where I was heading (attending university etc).\r\n8:00pm - Take 100mg BZP + 50mg TFMPP\r\nI feel the effects after about 40 mins, an 'Amped' feeling along with a feeling of inner content, I am happy to sit around, waiting for the gig which was to start at about 12am. I am very talkative, (as I usually am on BZP's). I spend the next 4 hours chilling out while more friends turn up to start drinking/dropping BZP/TFMPP.\r\n12:00am (midnight) - Take 100mg BZP + 50mg TFMPP\r\nThis seems to slightly intensify the current feelings, just keeping me on the same level. I feel great. I'm getting excited about going to this gig now, and we start to talk about going down to the venue (a 15 min walk). We talk...then talk...then talk some more. \r\n12:40am \r\nFinally we leave the house and wander off. Nothing particularly interesting is happening to me as we walk along, although I notice the intensity of light more and everything seems much more crisp than usual. We pick up some chewing gum on the way - a necessity for BZP's, as otherwise I grind my teeth to bits.\r\n1:00am\r\nWe reach the venue, I feel anxious about doing the acid, but tell myself that it's going to be great. I drop half a tab of acid and enter the gig. The music and BZP combo make not dancing almost impossible. I just had to get up and jump around, great times indeed, the music feels very absorbing.\r\n1:40am\r\nThe acid started to kick in now, and I don't feel anxious like I usually do when I feel acid kicking in, which is great. My excitability for the music is huge, I wanted it faster and louder, and thanks to the great DJ, thats just what I get. Need water..\r\n2:30am\r\nAcid seems to be at around peak now. I see little amounts of visual halucionations, but my vision is all over qutie hazy and undefined. Lights are great to look at, and glow sticks/braclets are great to watch, as they leave tracers accross my vision. Drinking lots of water, as cotton mouth is getting quite bad. Music seems to be all around me, and inside me at the same time. I feel at one with the music, and dancing allows me to express this. I have energy out the walls, hypo, yet a perfect feeling of sublimity. I think to myself - this is the best night of my life. Nothing can come close to how good I feel at this moment. I want it to last forever. \r\n6:00am\r\nI begin to become more and more aware of my surroundings, the people dancing beside me and I notice all that is happening on the stage. I see the main act packing up while a new DJ comes to take over, and get a feeling that the nights about to end. My body feels as though I have little control over my dancing although this is most likely due to the fact that I've been dancing for a good solid 4 hours now. The music is no longer as encapsulating as it was, although when I finally leave the dance floor, I'm still boucing round to the music.\r\n6:30am\r\nWe leave to go home, I'm still tripping quite hard off the Acid, and I have this awake feeling that could either be from the acid or BZP's. I stop to look at a statue and it does a dance for me - very cool.\r\n7:30am\r\nI go to bed, all my mates are still up on bzp's, they can't get to sleep. I manage to get an hour and a half's sleep, then another 4 hours after that. I feel drained for the remainder of the day, but nothing too bad - alot better than a nights heavy drinking thats for sure.\r\n*******************************************************************\r\nBZP/TFMPP and LSD is definatly one of the best experiences I've had with or without drugs. The BZP seemed to help greatly to relieve the anxiety that I usually experience with Acid. I didn't dwell on thoughts like I usually do with just Acid. \r\nI must say that I had my doubts about combining these drugs, but they seemed to work together to create an almost overwhelming, yet still in control experience.\n\n\n"
}