{
 "title": "Sunburn in a Pill",
 "author": "Spencer",
 "citation": "   Spencer. \"Sunburn in a Pill: experience with Niacin (ID 45003)\". Erowid.org. Nov 1, 2007. erowid.org/exp/45003",
 "substance": "Niacin",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Vitamins - Niacin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45003",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 1, 2007",
   "Views: 9017",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I used to be the occasional pot smoker (when I could get it for free). After Applying for a new job, I was informed of random drug tests. Since pot was fun for me, but not something I needed, I was willing to give it up. Worried that the test could be soon, and me not wanting to fail, I sought help to pass the test. A friend had told me niacin could clean your system quickly. I was skeptical, but was willing try it anyway. I thought it couldn't hurt to take one. I was recommended to take it right before I fell asleep. </p><p>I took his advice and after a late night of T.V., I was feeling fairly tired. I was ready to take the pill. I read the bottle and it said to take immediately after a meal, and to not take more than one pill per day. Not wanting something bad to happen, I popped 2 eggo waffles in the toaster, and just ate them quickly. Then I took one 500 mg pill, went to my bed, and laid down. I checked my clock at this point, it was about 3:50 am. I closed my eyes waiting for sleep to consume me.</p><p>I don't know if I had fallen asleep or was half asleep or whatever, but suddenly I became very, very hot. Then I started itching all over, an itch that would not go away. Soon after, the heat became unbearable and I looked over, it was about 4:02 am. I stood up, stumbled to my bathroom and hit the light. when my eyes adjusted, my face, arms, chest, and probably my legs too, were dark red, as if sunburned. My eyes were bloodshot and it felt as if my skin was tightening up around the softer, more sensitive flesh (face, arms, neck, crotch). I just laid down on the cold tile floor for about 10-15 minutes. I realized that I would have to wait it out, like a hangover, so I stumbled back to bed in extreme discomfort.</p><p>My skin seemed to be extremely sensitive, as if my body had become sunburned. There was no actual pain, my stomach and other organs felt fine. The occasional scratch burned like a bad sun burn would, but I just tried to ignore it and thankfully, fell asleep. I awoke around 8:30am, and most of the effects had worn off. My skin was still sensitive as if sunburned, but not nearly as bad. This lasted all day, and by the next morning had worn off. After the initial 'oh shit' feeling, I fealt pretty calm, constantly telling myself it will be gone by morning. </p><p>I later found out that an adult needs about 8-12mg of niacin a day. And like anything in excess, can be really harsh on the body. Symptoms of to much included 'flushing' and 'irritation' of the skin. They need a better word for 'Burns like hell and itches like herpes'. As for the drug test, it was three weeks from when I took the niacin, so I have no real clue if it helped or not, but I did pass.</p>"
}
