{
 "title": "Worked Very Well Together",
 "author": "Dwizzle",
 "citation": "   Dwizzle. \"Worked Very Well Together: experience with Salvia divinorum (extract) and Amanitas - A. muscaria (ID 45018)\". Erowid.org. Dec 14, 2008. erowid.org/exp/45018",
 "substance": "Salvia divinorum (extract) and Amanitas - A. muscaria",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "13 g",
   "oral",
   "Amanitas - A. muscaria",
   "(ground / crushed)",
   "  T+ 0:00",
   "250 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:15",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:15",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45018",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 14, 2008",
   "Views: 5173",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: I have had a few experiences with LSD, many with magic mushrooms, cannabis, and DXM. I am a very positive person who also has a very strong stomach and a very strong mind.  </p><p>Salvia Extraction: I used the extraction technique for Salvia as mentioned in the Salvia FAQ.  I powdered about 50 grams of dried salvia leaves that I purchased online. Then poured the powdered leaves into a glass pie dish and added a significant amount of acetone to the bowl, enough to cover the powder by about 1.5 inches.  I then stirred the solution of acetone and salvia powder leaves periodically (6 times total) for about 24 hours.  Then I used a paper towel and a plastic cup to filter the powdered salvia out of the acetone mixture.  </p><p>I then was left with another glass dish filled with a very green (almost black) fluid of acetone that contained the chemical of Salvia in it.  I then placed 5 grams of dried whole leaves in this green liquid and let the acetone evaporate.  I placed a fan in front of the dish to expedite the process.  Once evaporated, the leaves were covered with a dry resin that made the leaves appear very dark green or black almost.  Due to some spilling and the extraction being imperfect these 5 grams of leaves with the extracted resin on them are about 8 times as potent as a normal dry leaf, maybe a little more than that.  </p><p>Amanitas Preparation: This was easily done.  I simply ordered the Grade A Amanitas from the same online source.  I then placed a combination of mainly caps and some stems into a food processor and ground the mushrooms up.  I then measured 13 grams of mushroom powder out and mixed the powder with peanut butter.  This makes the taste pretty nice and not hard to down. </p><p>Experience: I ingested the peanut butter/amanitas mixture at about 7 oclock on an empty stomach.  Then I smoked a small bowl, weighing no more than .25 grams, of my salvia extract. I smoked it out of a small pipe.  I figured I would do this and start my trip while I waited for the mushrooms to kick in.  I took about three hits and held each hit in for about 15 seconds!  The longer the better but it is hard to do for me.  I didnt finish this small bowl but as soon as I put the pipe down I was blasted off to another reality!</p><p>I got very sweaty and I stood up.  I had lost all short term memory for about 10 min and didnt know my own name, if I had smoked anything, or where I was!  It was crazy.  I did not have any visualizations but that is because I didnt hold the smoke in long enough.  I stumbled around my apartment for about 15 minutes wondering how I had gotten into this state.  It was still pleasant though.  This altered reality to which I was foreign was still nice.  My body had a slight floating and euphoric effect to it.  I then came down about 15 minutes later.  The after effects were kinda similar to being stoned but a little more noticeable in my body than in my mind.  I continued to take this little 10 minute journey two more times before I realized the mushrooms were talking a hold of me!</p><p>I did not feel any stomach irritation.  The trip was very mellow.  I did get plenty of closed eye visualizations and when I would close my eyes I would enter into a dreamy, half awake state where my mind could fly through galaxies of though and color!  It was amazing.  I ventured to a nearby golf course, which was somewhat difficult because my limbs felt very heavy and hard to move.  I laid on the soft grass feeling a mild leftover from the Salvia but primarily the mushrooms!  This is about 3 hours into the trip now and I just sit on the grass almost sleeping but more dreaming and listening to Dave Mathews on my IPod.</p><p>For the next 3 hours I was peaking and enjoying every minute of it.  When I finally went inside my friends told me I was walking very slow and seemed very mellow.  I do not remember actually climbing into bed or even going back to my apartment but rather just a long adventure in my dreams!  I may have walked all over the place!  The next morning I actually woke up early, feeling refreshed and happy with the entire night!  </p><p>In summary, both of these substances seemed to have a VERY powerful effect on me and worked very well with each other.  Overall, I would change two things.  I would have smoked the Salvia from a water bong as to make the trip more intense.  And, I would not have ground up the mushrooms as they are easier to eat just plain because there is not a powdery mess afterward.</p>"
}
