{
 "title": "Insert Witty Title Here",
 "author": "BILL",
 "citation": "   BILL. \"Insert Witty Title Here: experience with LSD, Ecstasy (MDMA) & Cannabis (ID 451)\". Erowid.org. Jul 30, 2000. erowid.org/exp/451",
 "substance": "LSD, Ecstasy (MDMA) & Cannabis",
 "bodyweight": "70.5 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 7:00",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 8:50",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 451",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 30, 2000",
   "Views: 8403",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The setting and mood was joyful. I had been away for about six months and could only stay a couple of days. I had been clean for the time I had been gone, and was expecting my tolerances to be near nothing. </p><p>2:00 p.m. - half a black gel was downed</p><p>3:00 p.m. - the effects are becoming noticable. I have mild stimulation and am intigued by the most simple objects. The music is wonderful and I complement my friend on his excellent taste as we drive to the mall. I arrive at the mall with all intents a tripping teenager. Not many visuals but I felt a sense of joy which I had not grasped in some time; a piece of myself had come back.</p><p>9:00 p.m. - ate the rest of the gel</p><p>9:50 p.m. - I did not know that I could 'build' on (the effect) with acid, from what someone else had told me, but I was now experiencing the total ramification of a single hit. Laughing; tripping; insane.</p><p>10:50 p.m. - took the roll. The name, I presume, was 'Lemondrop'. The guy supposedly swore by them as the best to hit the area in a while. I had rolled once before and recall it as the most peaceful moments in my life (then I came down and felt like shit for a week). I was very psyched about candyflipping. The fractals were off the wall, literally. I was at light speed.</p><p>11:45 - my face is flat on the floor. The roll hit me like a Mack Truck and I'm left smiling; saying 'oh my god'. Massages and Vicks Vapor sticks were all around me. Comforting me. LOVING ME. my teeth were not still and I mangled the hell out of a glowstick. The beanbag chair seemed to hug me; love me. Everything was so beautiful. The colors; the faces; even persons I do not like I liked. It was perfect. The CD player didn't work so I took my music to my car and the sonics poured out of the speakers with the intensity of lava. I made statements; regrets; apologies; and intentions to my friends. I loved him. </p><p>We were now nomads. I was treking up a hill when these sudden panic attacks pelted me. I had been through these before (bad trip episodes) and could now handle them very well. I turned away from the fear and searing heat that attempted to take hold. I came again and I raised my hand.  I sat down and stared at the stars as they were smeared across the sky. I felt my feelings being reflected back from them; I felt spectacular. The facts came to me and flowed like a playful brook about my head. I made mindless assumptions which have left me since then. The X was talking. [I talked to my friends about stuff and blah blah blah, the story goes on]</p><p>2:05 a.m. - we went back to the cave to meet with MacCleod. We puffed on him and he told of a cat and good days past. I was now uncontrollably laughing and the colors were in a rage. Red, Green, and Purple were shooting everywhere; wrapping around me. I tasted them. It was the taste of color. Take all four tastes: Salt, Sweet, Sour, and Bitter; and then add a fifth, Color. It was creamy and melting, smothering my head with this other candy.</p><p>I mistook the glowstick for a lighter and my hand for the bong. The colors were getting in the way as I was shifting from reality to candyland. I saw my hand melt into space-time? am I here. I'm back again and so is MacCleod. Cool; soothing (Note to guys: on drugs or not, put Gold Bond foot powder on your balls. No joke. I am serious. Just a small handful. There is nothing better than pineapple sherbert on your pieces). 'Wait, did I ask you?'.'Where did you come from?', and the story writes itself. My mind has been running to so many places that it is getting tired. It will have to take a break. The couch is very comfortable. </p><p>I wake up. </p><p>Beaten and exhausted.</p><p>What he hell had happened?</p>"
}
