{
 "title": "The Amazing Green Fire",
 "author": "Laiko",
 "citation": "Citation:   Laiko. \"The Amazing Green Fire: experience with Absinthe, Alcohol & Tobacco (ID 45173)\". Erowid.org. Nov 2, 2007. erowid.org/exp/45173",
 "substance": "Absinthe, Alcohol & Tobacco",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1 shot",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "2 shots",
   "oral",
   "Absinthe",
   "(liquid)",
   " ",
   "  repeated",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45173",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 2, 2007",
   "Views: 27918",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nCliche of cliches, I was on a school trip to Europe when I first tried absinthe. A few friends and I were in a very posh hotel room in Rome when somebody produced an ill-gotten bottle of green they'd procured in Paris a few days before. I had to try it; I knew I might never have this opportunity again.\r\nI was shown the age-old absinthe ritual and did it myself. For those who are not au fait with it, it goes something like this (and it varies depending on where you learn it):\r\n-Fill a shot glass with absinthe, to about 3/4 full.\r\n-Pour a small amount of white sugar into a spoon.\r\n-Dip the spoon into the absinthe, but just a little--just enough to get it sludgy.\r\n-Light the sludge on fire and let the spoon sit atop the shot glass (so that only the spoon is burning, not the shot!!). Wait until the sugar starts to melt and bubble. Blow out the flame (and make sure the flame is out! Invisible flames do exist!)\r\n-Drop the caramelized sugar into the shot glass, and immediately take the shot.\r\nIt tasted distinctly like black licorice. It had the strongest burn I've ever had from alcohol--but it was a very sharp, clean burn, not like vodka. Like I could feel it killing every single bacteria in my mouth and throat. This burn caused a bit of a loss of feeling, a bit like doing a numbie of coke, only there was a bit of a tingle along with the numbness that seemed to last forever. I was nearly gasping for air from the sheer strength of it until I drank some water.\r\nI took another shot this way and almost immediately found myself extremely drunk. I'd had a shot of Crown Royal earlier that night, so I was feeling pretty good, and I'm a lightweight. It was a different kind of drunk, though. Lucid, but heavy, and everything is just slightly... different, as if I was experiencing it for only the third or fourth time.\r\nI'd heard a lot of rumors that you hallucinate. I never tripped, and I remember most of the experience. I did, however, have the distinct impression that I was floating (if walking) or melting (if sitting) which I have never gotten from any level of being drunk. I was very, very into any conversation I wound up in. I went out to the balcony to smoke cigarettes many times, and I remember salivating a lot and not being able to feel the smoke going into my lungs. These were Lucky Filters, bought in Rome earlier that day--and I can ALWAYS feel Luckies. Near the end of the cigarette I would always get the feeling that my hand was tired of holding it and my lungs were tired of working--a distinct but not overpowering heavy feeling.\r\nI kept thinking I was going to throw up, but I never did. Even after nearly half a pack of cigarettes, all I could feel in my mouth was the leftover tingle, like it had coated my mouth. Somebody had an MP3 player and either speakers or really loud headphones. I remember feeling a cannabis-esque appreciation for the Smashing Pumpkins and some old-school Modest Mouse.\r\nI lost track of time almost immediately after the first shot, but it must have been a few hours at the least before I stumbled down to my hotel room and passed out on the bed. My sleep was incredibly deep and completely dreamless; I woke up feeling like a million bucks, with no hangover whatsoever.\r\nHands down, absinthe is the best alcohol I've ever had. I've never been a fan of black licorice, but right about now I would absolutely love to taste it again...\n\n\n"
}