{
 "title": "Light Withdrawal",
 "author": "P Jimmy",
 "citation": "   P Jimmy. \"Light Withdrawal: experience with Cannabis (ID 45176)\". Erowid.org. Jun 27, 2007. erowid.org/exp/45176",
 "substance": "Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45176",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2007",
   "Views: 4125",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, I started smoking my freshman year in High School.  It became a daily habit within 2 months of my first toke.  I'm not a big smoker, I don't burn bong loads all day long.  I just smoke a few small pieces throughout the day to keep a nice buzz.  <br>I graduated from High School recently and applied for a Government Job in a nearby town.  The catch is that I need to pass a drug screen.  And I'm expecting a Urine test within the next week.  Obviously, you'd think I'm screwed because habitual use can leave your body with THC in it for months.  But I've had U.A.'s in the past and know that if I quit smoking, drink huge quantities of water, and exercise heavily that I can detoxify myself quite rapidly.  <br>It's been alright so far, because I do drink a lot of water and exercise all the time anyways.  Being this is the first time I haven't had pot in years, Id naturally expect some withdrawal.  What I've experienced is some irritability, loss of appetite, and I'm having some issues with sleeping.  I've had nightmares every night since I quit, which is very odd to me.  I'll wake up in the night in a cold sweat and then can't get back to sleep.  So the lack of sleep probably adds to my irritability.  <br>Another thing I noticed is random aches in my stomach throughout the day.  Even if I eat, the aches persist.  And normally if I have any pains, Pot is my medicine of choice...but I'm out of luck here.  But overall, I can say it's nothing extreme.  <br>The worst part about quitting isn't the physical withdrawal, it's the mental aspect.  I'm definitely psychologically addicted.  Throughout the day, I notice things aren't as enjoyable as they would be if I were smokin'.  So for those who say Pot has absolutely no Withdrawal or Addiction potential, you're wrong!  It's nothing like quitting cigarettes, alcohol, or hard drugs...I'd compare it to quitting caffeine.  Nothing serious, but the side effects are there.  it's too bad people have to discriminate against responsible marijuana users by policing their urine, so much for that whole Pursuit of Happiness deal.\n\n\n"
}
