{
 "title": "Thought It Was MDMA",
 "author": "2C-B",
 "citation": "Citation:   2C-B. \"Thought It Was MDMA: experience with 2C-B (ID 45187)\". Erowid.org. Mar 9, 2006. erowid.org/exp/45187",
 "substance": "2C-B",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45187",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2006",
   "Views: 13301",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast january a friend of mine and I went to a concert.  We had what we thought was one MDMA tab and 2 10mg oxycontins.  We decided he'd take the oxys and I the MDMA. The following is my experience:\r\n+0:00 Take the pill.\r\n+0:20 Notice effects similair to MDMA come up (body temp change, slight anxiety, shift in perception).\r\n+0:30 Notice things are not happening as normal with MDMA ( we are in our seats high above the stage at this point).  Start to see visuals, think maybe its strong pure MDMA. This is where things go bad\r\n+0:35 This is not X. 'I don't think this is good' ~myself. Visuals start morphing entrances into inner area of stadium. \r\n+0:37 Decide to walk around to chill out possibly.  Walking feels good, takes my mind off the tripping factor.  Decide to hang out in a lounge area outside, inside is too intense.\r\n+0:40-70 Talk outside about how pissed we are at my dealer and what I could possibly be on.   I see helicopters flashing lights on me, but theyre are first of all not there, and second of all liquid-chromatic color/texture.\r\n+1:15 Decide we must leave. Try to find our way out, I see cops roaming the stadium, make very frightened eye contact, they turn and watch me, but continute walking. (I figure I'm not the only one trippin at this conference). \r\n+ 1:20 Make it to my car, my friend starts driving.  Anxiety subsides now that I'm out of the public eye, but intense confusion sets in.  I interpret all the freeway signs wrong and continually ask if we're going the right direction and many of the same questions over and over again till we get home (30 minute car ride). \r\n+ 2:00 I feel fine as soon as I walk in the door (security of being in a comfortable place such as home is great).  Many friends are over, but I don't mind, I'm safe now and can enjoy my trip. I watch part of the movie 'Rising Sun' which feels as if it's in slow motion.  *I am still unaware I am on 2C-B because I don't know it exists (more experiences friend thinks its LSD or DXM).  \r\n+2:15 Finally get ahold of my dealer who informs me its 2C-B (thanks fuckhead why didn't u tell me earlier).  Look it up online.  Find it very interesting and accurate to what I'm experiencing. \r\nFrom here on out, I'm fine.  My friends start fucking with me and telling me I'm insane and seeing things which are not there, when in reality they were.  I decide that I want more 2C-B immediately, yes this same night.  \r\nOverall, this experience wouldn't have been so bad had I known what I was getting into.  Visuals are amazing, so much different than shrooms, yet no less interesting. I had pure hallucinations (seeing things that were not there, like the helicopters and shit), and most had a chromatic metallic coloring to them.   I definitely felt the body buzz and was very into the concept of my existence (which I thought was b/c I was on 2c-'B' and the B represented 'being' as in the verb -- yes i was fucked up).  I also made a connection with the concept of eternity which a sober human mind can never understand.  The 2C-B kept me up awhile, I made a PB & Jelly and just stared at it.  The texture of the jelly was beautiful.  One thing I noticed was the CEVs.  Different than the morphing like vines seen on shrooms, they were more of a gyroscopic texture over my eyelids.  REd and yellow.  That night my dreams were definitely influenced by its effects.  If I could experience any reality, it would be the one I dreamed of that night.  Imagine living in that old PC game 'Myst'.\n\n\n"
}