{
 "title": "Subtle, But There",
 "author": "Psychonaughtess",
 "citation": "   Psychonaughtess. \"Subtle, But There: experience with Sceletium tortuosum & Tobacco (ID 45193)\". Erowid.org. Sep 14, 2007. erowid.org/exp/45193",
 "substance": "Sceletium tortuosum & Tobacco",
 "bodyweight": "128 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Sceletium tortuosum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45193",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 14, 2007",
   "Views: 11186",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I ordered 10 grams of this substance from the internet after reading an article on how it helped minor bouts of depression.  As I suffer from extremely bad pmt (pre-menstral tension), I thought this could be useful in temporarily allieving my symtoms.  Being a bit of a caner I couldn't really wait for my pmt to begin before giving this a bash.  A friend and I smoked a joint of about half a gram of dry milled sceletium powder with some tobacco.  It was pretty difficult to toke as it didn't burn very quickly so a very strong pull was needed.  It tasted herbal (obviously!), kind of woody and not unpleasant.</p><p>I felt mildly stoned after a couple of tokes but it could have just been a nicotene rush or deprivation of oxygen due to the length of time it took me to get a decent toke!  After a few minutes I felt mildly buzzy and warm.  I didn't really feel too motivated but when I did go out for a walk out of neccesity, to stock up on wine, the walk was very enjoyable. After the walk we smoked another couple of joints. It was comparible to a really small amount of coke but without the palpitations and strong desire for more.</p><p>I did find myself wishing for the experience to intensify but gathered from other peoples' experience that this feeling was probably the best I was going to get and had I smoked more I may have experience some kind of unpleasantry.  I did feel quite happy and quite alert but I wouldn't really say I felt anything like I was on MDMA, it was not that noticable to myself or anyone else witnessing my behaviour.  I may have been slightly more energetic and impulsive than usual.</p><p>The next day I felt a little bit edgy but this may have been the beginning of the aforemenmtioned pmt.  I didn't smoke any more just in case I got myself into a worse state, pmt plus seratonin deficiency, but I wouldn't rule it out for a nice sunny day with a beer at the beach.  I definitely think it should be investigated further.  There are too many other factors operating upon me at the moment to determine whether this substance does have any come down but if it does then I would think it is probably the last thing to suggest for depression.  If it could be a quick and instant seratonin boost with no negative effects it could be a godsend.</p>"
}
