{
 "title": "Don't Smoke When Depressed",
 "author": "cptmarginal",
 "citation": "   cptmarginal. \"Don't Smoke When Depressed: experience with Cannabis (ID 45196)\". Erowid.org. Nov 7, 2007. erowid.org/exp/45196",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45196",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2007",
   "Views: 2366",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me start by saying that I have been a heavy smoker for a couple years, although I have stopped now. This is the first time I have experienced something like this.\r\nI have been going through an extremely painful breakup with my girlfriend lately. Very messy. She cheated on me, has been trying to kill herself, and generally everything was fucked up. Around when this started, but while we were ostensibly still together, I went through a small episode of cutting myself, thinking that I would see if she really cared the way I did when she cut herself before. Needless to say, this was a bad idea. I had never done anything like that before to myself, and it felt insanely bad. And to top it all off, she didn't really care when I told her on the phone right afterwards.\r\nI fell asleep at this point, then woke up at about 2 AM and hear that a close friend of mine had come over and was downstairs smoking. I came down and decided to smoke with him, despite my fucked up mental state. This is mostly because I was using weed as a crutch at this point, and was mentally addicted. I acted like everything was normal and fine just so I could hit the weed. We smoked out of my new bong, which hits very hard, and I was high as hell. Something felt really wrong, but I ignored it and made small talk with my friend and acted happy (when I was actually anything but).\r\nI started feeling higher & higher at this point, with no real ceiling to it. I began to believe that I had lost too much blood when I cut myself and that my legs wouldn't work. I also thought that the razor blades had given me an infection because I didn't disinfect them. I still hid it from my friend, and eventually wobbled my way back upstairs and laid down in bed. Everything went to hell from there. I was hallucinating, my whole world was crashing down, I thought I was going to die. My only hope was to clutch the phone and think that I could call an ambulance at any moment if I needed to. But I was too afraid to do that, and was letting myself 'die'. I called my girlfriend in tears and begged for her help, because she had always been the only one who could help me with something like this. She blew me off and went back to sleep, not caring at all that I was begging for my life. I rode it out and survived, of course, but it was extremely difficult and horrible.\r\nI see now that I had hinged my mental stability and happiness on her so heavily that I could only think to call her when this was happening. I didn't realize that it was happening because she had not cared about my cutting and my mind had crashed. I can safely say that it is not a good idea to depend on someone to that extent, no matter how much you trust them not to betray you. Some people's personalities can hurt you badly, because they really mean it when they say they love you forever etc, but all it takes is a flip of the switch in their head for them to shit all over you. I can say even more safely that it is NEVER good to smoke weed or do any drugs when something like this is happening in my life. It can be severely damaging mentally. This experience messed my head up for a long time. I'm still recovering slowly, but I have gone through some severe suicidal episodes, especially once my girlfriend cheated on me.\r\nI have smoked weed one more time since then, and once again it was horrible. Much easier to get through, though, especially since it was a much smaller dose. Right now I am looking at bowl of weed packed in a bong and am fighting to not smoke it. I know that if I do, there is a very good chance I would kill myself. But maybe that's what I really want, especially since I have been very weak mentally today. I feel like every stupid teenager who commits suicide for attention. I know that if I went through with it, she would understand.\r\nI guess I just have to hold on and stay far away from cannabis. I hope that anyone reading this will think twice before repeating my mistakes. It's really not worth it to get high when the consequences can be so bad.\n\n\n"
}
