{
 "title": "A Factor in Focus",
 "author": "Anonymous",
 "citation": "   Anonymous. \"A Factor in Focus: experience with Piracetam (ID 45206)\". Erowid.org. May 19, 2006. erowid.org/exp/45206",
 "substance": "Piracetam",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Piracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45206",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 19, 2006",
   "Views: 44909",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been using Piracetam since July 25, 2005. At the time of this writing it has been 12 days. I bought it for self-help with some cognitive difficulties I have.</p><p>The effects of this drug are subtle compared with a recreational drug, but relatively potent compared with common nutritional supplements that I have used for other reasons; calcium, ginkgo biloba, or kava kava are examples. I felt effects from piracetam on the first day. I was somewhat discouraged to find that these effects did not continue on subsequent days. However, I have read that this is normal with piracetam. It gives effects with the first use, then gives a smaller effect for a few days. Eventually, with daily use, the effects begin to become stronger. </p><p>I have been pretty easygoing with the dosage. I have been altering the dose that I take, according to my own curiosity.</p><p>I take this drug in multiples of around 900mg. The drug changes my consciousness in a way that is interesting and pleasant. Sometimes it makes me tired. I have read conflicting information that taking choline can help with this. I have not done this, but I try to eat a lot of chicken because it has choline. Other foods rich in choline are peanuts, eggs, and milk. I currently take ~2700mg or ~3600mg, daily, in 2 or 3 divided doses. One time I took ~2700 mg at once, before bed. The effects were very interesting, and were the strongest I have felt so far. I felt very lively, and the music playing in my head was very loud and clear. I have read that a lower dose is sufficient after a few weeks of use, and that a higher dose is good the first few weeks, to build up the drug's effectiveness, and concentration in the brain. </p><p>The reason I have not decided to take 2700mg at once every time is that I have not found any information on whether a tolerance to this drug will build up with daily use. I do not wish to build a tolerance to piracetam.</p><p>I have in the past, used DXM, alcohol, and marijuana. My past drug experience has affected me negatively. I now have some minor difficulty concentrating and reading, and thinking freely. I also now have major difficulty listening. It's been a long time since I used the 2 substances above on a regular basis. I eat well and do cardio regularly, but still I feel some level of impairment. I am interested in using nootropics to give my cognitive functioning a boost.'</p><p>To be honest, piracetam has solved the problems mentioned above. </p><p>I do not feel like a genius because I take this drug. I do however, feel wonderfully normal. I can read a little better in a noisy environment. I can lose myself in my work. I can pay attention to someone speaking while having internal thoughts at the same time. I can make an attempt at remembering things that have slipped my mind, and have them surface quickly. These are all things that I have not been able to do very well in past years because of my drug use. The drug also gives an interesting feeling of altered blood pressure (or something that feels just like that) in my head. This morning I was singing and could improvise words much more easily than I can normally. This is actually an improvement above and beyond my abilities before recrational drug-use. </p><p>My physical coordination has, to my surprise, increased a little bit. I have always been fairly uncoordinated, so I noticed this effect quite clearly.</p><p>One con that I will share: I am taking Organic Chemistry, which is a class that takes up most of my time. I have to study lots. Piracetam causes me to want to do interesting things. This is only a minor problem. I just need to tell myself more to be responsible and to take joy in my work. </p><p>The following was written on the first day I used piracetam. 'I tried a tiny bit over the labelled dose of 880 mg. Effects are very present and noticeable, while still being subtle. I have certain minor abnormalities of my consciousness that I cannot explain well [What I meant by this was that my thoughts seemed more normal and less weird]. The drug is without a doubt effecting a positive impact on these symptoms. The mind feels balanced and agile- a well oiled machine, so to speak. I am very happy with my purchase.' </p><p>Effects like those I felt with my very first dose are no longer felt at that dose. I do not know yet if the effects of piracetam will decrease or increase for me over time. I have read that it takes several weeks for the effects to come into full swing.</p>"
}
