{
 "title": "Its Only Bad Thing?",
 "author": "Mike",
 "citation": "   Mike. \"Its Only Bad Thing?: experience with Cannabis (ID 45247)\". Erowid.org. Oct 30, 2007. erowid.org/exp/45247",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45247",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 30, 2007",
   "Views: 3054",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This actually just happened tonight, when I was smoking a nice fat joint at 6:00 pm. I am a everyday smoker and I never expected a trip  like this would ever happen with weed. Right after I smoked that joint, I decided to go on the computer and listen to music I felt a little numbness in my throat. 20 minutes after that I could feel my heart pounding. I was also experiencing my legs and arms constantly shaking. Almost 30 minutes went by, and I was still experiencing these problems. I was really confused and didnt know where to go so I decided to go back in the computer room. I started listening to music and I actually starting rapping and it seemed like once I started to talk and speaking out loud my heart started to return to its regular heart rate on weed. Once I did this for about 10 mins an amazing high came in. </p><p>I started seeing double of things. As I moved my head slowly back and forth it would feel like an amazing fluid circulating my head and once I took a deep breathe I could fell a warm slow feeling going in my bloodstream and its like every time I would breathe in oxygen and exhale I would also feel it going all over my body. </p><p>I'm still high right now but it was really messed up. I am taking a acne pill right now but I blazed that a few months ago and up till the incident that happened today. My heart now feels normal. Of course I'm going to blaze again, but I think I'm goin to take a break n not blaze that much.</p>"
}
