{
 "title": "May Restrict Urination - Dose Carefully",
 "author": "Henry S.",
 "citation": "   Henry S.. \"May Restrict Urination - Dose Carefully: experience with Kratom (ID 45265)\". Erowid.org. Feb 14, 2006. erowid.org/exp/45265",
 "substance": "Kratom",
 "bodyweight": "76 kg",
 "header": [
  [
   "DOSE:",
   "14 g",
   "oral",
   "Kratom",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45265",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 14, 2006",
   "Views: 12432",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One of the problems with the Kratom market is that quality is massively variable. I have taken 6 grams before and it's been a stronger experience than another batch of 12 grams. I have stuck solely to the powdered kratom going round the UK at the moment. There seems to be a lot of discrepancies about whether it is stronger in powdered, resin or leaf forms. No suppliers seem particularly concerned with clearing up any of the confusion.</p><p>I strongly recommend starting on a low dosage. Many headshops sell it in packets of 6 grams. Sometimes this hasn't done much, sometimes it has been quite powerful. I've knowingly taken 12 grams of this. Recently however I was sent some from a friend and didn't actually check the weight. I thought it was a few grams; turned out it was more like 16 grams! I didn't find out till aftewards and what followed was unpleasant.</p><p>The usual opiate-like effects came on, but I was more euphoric than usual. The problem was I couldn't urinate; I had what they call 'billy willy' in the UK where you take speed or E and can't relax your bladder muscles because of the serotonin rushes. This was pretty bad. I tried to relax for ages but couldn't piss and had to go back to bed. Very painful and distressing. I later woke up to find blood in my boxers. I had pissed out blood. By the morning I had come down and with the help of a diuretic (tea) managed  very long piss, normal piss.</p><p>Naturally this was very disturbing. I wouldn't recommend high doses; check the levels. This drug is similar to codeine in effects. We don't know anything aout the toxicity of kratom. Just because it's natural doesn't mean it isn't dangerous.</p>"
}
