{
 "title": "Nothing Could have Prepared Me",
 "author": "Weebl",
 "citation": "   Weebl. \"Nothing Could have Prepared Me: experience with 2C-E (ID 45270)\". Erowid.org. Jan 13, 2009. erowid.org/exp/45270",
 "substance": "2C-E",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "45270",
   "Male",
   " ",
   "Not Given",
   "Jan 13, 2009",
   "3152",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Set: I was very happy to be experiencing 2ce for the first time. I wasn't depressed in the least before the trip.</p><p>Setting:I was lucky enough to recently have some 45mg of 2ce shipped to me by a friend so i decieded to give it a try. I took 15mg and started a little online chatroom. Everyone was very excited over the drug since a lot of them were also waiting the arival of a sample of it. I had just eaten to prolong the effects untill a friend got back home.</p><p>---</p><p>+1 hour: I played the flashback movie and that sparked the first paranoia in me. I was greatly upset by the drug at that point. I couldn't get it out of my mind that that movie was how my entire trip would be.</p><p>+1.25 hours: I decieded it would be a good idea to go downstairs and watch some TV with my younger sister. As I left I noticed that the screen names on my buddy list were bending tword me whichever way I went.</p><p>+1.25 hours: I went downstairs and turned on Aqua Teen Hunger Force and sat down. I was very very cold from the 2ce and due to the fact that the AC was on and I had a fan blowing on me. I think it was mainly the drug though, I normally do not shiver in that room. I was still very nervous so i deceided to get some more food.</p><p>+1.5 hours: I walked to the kitchen, I felt taller but at the same time shorter. I grabbed a bag of pretzels to take back to the living room. When I got back I laid down and watched some more ATHF. I noticed the sky on the show changing so I commented on it to see if it was just me. My sister said she noticed that too (Good Im not crazy yet I thought).</p><p>+1.75 hours: I looked down at the floor and saw paterns and fracticals forming. I decieded to go upstairs back to the chatroom before anyone noticed I was on 2ce.</p><p>+1.75 hours:As I walked upstairs I noticed that I seemed to flow up the stairs rather than walk. I sat down and noticed that life kept getting farther and farther away from me somehow.</p><p>+2 hours: The computer monitor kept sucking me in. My Background picture on my desktop kept turning into images, I remember fry and bender from futurama as well as a dying soldier... The images turned into fracticals then I turned into a fractical myself.  I kept falling in and out of reality, my vision kept moving and then I lost track of time.</p><p>+4 hours: I finally snapped back into semi-reality when the guy who shipped me the chemical reminded me that it was all just a drug. </p><p>+5 hours: My vision still was jerking around.</p><p>+5.25 hours I went into my bed and thought about how the world works and how silly life really is. I started thinking that the world was pointless but kept trying to keep a good outlook so the trip didn't go bad again. </p><p>5.5 hours: I went back online and I kept trying to contact people in hopes that they would keep my mind from going crazy again.</p><p>7.5 hours: My vision returned to semi-normal with the only problem being blurriness. The bluriness was as if I was going to cry.</p><p>+9.5 hours: I finally fell asleep</p><p>+22.5 hours: I awoke very sore all over. My body felt as though it had just swam 20 miles non-stop. My mind was very alert constantly although the expression on my face looked tired. This continued for about another 24-36 hours. I was able to sleep fine and function normally during this time </p><p>---</p><p>In the end, I think that 2ce is a very helpful drug if I were in the right mindset and if I were completely ready for the experience and knew exactly what to expect. Nothing could have prepared me for what I experienced.</p>"
}
