{
 "title": "Kava Kava Relaxation #1",
 "author": "Sids",
 "citation": "   Sids. \"Kava Kava Relaxation #1: experience with Kava Kava (ID 4530)\". Erowid.org. Dec 26, 2001. erowid.org/exp/4530",
 "substance": "Kava Kava",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "50 capsls",
   "oral",
   "Kava"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4530",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 26, 2001",
   "Views: 16997",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was at a dull new years eve party and I had brought the contents of 50 of the CVS gelcaps to the party.  The GelCaps are filled with a foul smelling grainy powder.  I decided to open all of them up one night and pour the powder into a baggie for easier transportation.  At the party I decided to make myself a 'cocktail' by mixing the kava kava powder from inside the gelcaps with some chocolate flavored Boost drink, which is this gluey sweet soy based protien drink that I happen to like.  I hoped that it would mask the smell and taste of the powder well.  It didn't.  Drinking the potion was PURE hell and it is not something that I want to repeat.</p><p>I began to feel the effects on my toungue within seconds.  The numbing effect was intense and lasted about 30 minutes after my last sip.   I worked on the potion, about 10 oz, for about 30 minutes, giving a few sips to my friends, who told me I was retarded and that there was no point to doing something that nasty.  Little did they know...</p><p>After the numbing disappeared I noticed that my limbs felt very disconnected and strange, and moving became a chore.  All I wanted to do was to sit down and lean back.  I could barely stay awake.  The effect was intensly soporific.  I didn't want to pass out so I started listening to music and telling my friends to keep me awake.  I felt very loving to them and I started leaning on my friends back and concentrating on the music.  I tried to sing along but the words didn't come out very clearly.  After about an hour I started to feel less tired and heavy and more buzzed.  I felt very happy for somebody whose mouth tasted like dirt.  The taste of the Kava Kava powder was very heavy and stayed with for a couple of days.</p><p>Anyways, I had to go home with mom and pop at about 1 o clock and I was very tired and relaxed.   All I wanted to do was get into bed.  In the morning I felt slightly sick but the feeling passed after I ate breakfast.</p>"
}
