{
 "title": "Am I Gonna Die?",
 "author": "Jaylee",
 "citation": "   Jaylee. \"Am I Gonna Die?: experience with Cannabis (ID 4532)\". Erowid.org. Dec 27, 2001. erowid.org/exp/4532",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "4532",
   "Female",
   " ",
   "Not Given",
   "Dec 27, 2001",
   "Views: 9955",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is not my first or last experience of this type.  In fact, it started happening around 8 months ago or so and has happened numerous times since then.  Before these 'panic attacks' started, I had been smoking regularly for about 4 years.  When I take a hit (always kind I'm not a shwag smoker) at first it's the pleasant feeling that I would expect.  Soon after it turns ugly.  My heart starts racing and in my head I keep thinking 'I'm going to die oh my god I'm going to die'.  I also feel very hot and antsy, like I can't just sit still, I have to start walking around.  My boyfriend says he can't even tell when it happens so I must not look flushed or anything but in my mind it's horrifying.  </p><p>Sometimes I just wander around the house until I start coming down or I'll go upstairs to take a shower.  There is always an intense feeling of panic with the thoughts that something is definitely wrong with me.  For some reason, even though this would happen almost everytime I smoked, I kept hitting.  I started taking Celexa (a drug for depression) about 3 months ago and while I was on it these symptoms didn't occur!  In fact I felt like I could smoke an ounce myself and not feel all that high.  Then, about 2 weeks ago, I stopped taking the Celexa and within a week it was the same thing, feeling like I was going to die.  About a week ago, I had the worst experience yet, My legs and hands felt numb, my heart feeling like it was going to beat right out of my chest, anxiety, and hot flashes.  </p><p>Since that night I have not smoked and don't plan to anytime soon.  Even though I remember how nice it used to be to get high, it's just not worth the anxiety and panic it makes me feel now.  It's the scariest thing to feel like I am going to die any minute.  The thing that confuses me is I never used to feel like this.  I would get a little paranoid but thats it.  I don't know if there is any correlation but it started happening after I had taken ecstasy for the first time.  Is there anyone else out there with this type of experience or who knows what could be going on with me?  One of these times am I gonna die when I smoke?</p>"
}
