{
 "title": "Exercise, Health, and Urine Testing",
 "author": "Barabbas",
 "citation": "   Barabbas. \"Exercise, Health, and Urine Testing: experience with Cannabis, Vitamins/Supplements & Drug Testing (ID 45377)\". Erowid.org. Dec 18, 2008. erowid.org/exp/45377",
 "substance": "Cannabis, Vitamins/Supplements & Drug Testing",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Cannabis - Hash",
   " ",
   " ",
   "  ",
   " ",
   "Vitamins / Supplements",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45377",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 18, 2008",
   "Views: 12222",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The common urine test (immunoassay) is a very simple test and can be beaten, but this is NOT legal. What IS legal is the ingestion of water and vitamin supplements. This report is about how my specific exercising diet has turned up negative results for my ingestion of THC.</p><p>Doctors reccomend drinking between 8-12 glasses of water a day, that is 8-12 servings of 8 fluid ounces of water. As a cyclist, (25 miles / 40.2 km a day) I drink almost three times this amount (2 gallons a day which is 32 servings of 8 fluid ounces). Alone this will make many people's (and my) urine too dilute for the immunoassay and you will fail for adulteration due to suspected dilution. To prevent a failure for adulteration we must replenish the chemicals that the immunoassay searches for to prove that the sample is human urine.</p><p>Depending on diet Creatine may be an ingredient lacking. Creatine aids in muscle toning and building of lean muscle which is a good thing to take if you're trying to build healthy muscles from exercise. Creatine can be found in muscle building powders or in some of the new 'power drinks' on the market such as 'SOBE No Fear' (regitered trademark of 'No Fear Inc.' and 'South Beach Beverage Company Inc.'). To ensure the proper levels of Creatinine, the chemical that the immunoassay searches for to prove the sample is human urine and is what is excreted when creatine is metabolized, I take 25mg of Creatine twice daily. This equates to 1 serving of the specified energy drink twice daily or with a powdered creatine supplement, this is usually 1 serving twice daily which is approx. 1 'scoop' per 8 fluid ounce glass of water.</p><p>Now some immunoassay testing sites check the color of your urine to back up the test. This is rediculous as color is subjective, but a lot of people will fail because their urine is totally clear like tap water. To add color to urine a B-Complex vitamin supplement is the best, but again, the specified 'energy drink' (for 'some reason') contains the proper amounts of B6 and B12 to color urine.</p><p>With this diet of water, creatine, and B vitamins I have tested negative on 18 consecutive immunoassay tests where THC metabolites were being tested for. I do not think that doing this will help me 'beat' the test but rather that it ensures I do not 'fail for adulteration' by having dilute urine. I'm not sure WHY many energy drinks are formulated in this way except that they 'pump you up' and give you energy.</p><p>But either way, as a cyclist, I was drinking this much water ANYWAY, and using creatine and vitamins ANYWAY. When I went for my first random screening I was sweating because I had smoked the night before and I had also heard that dilute urine can make you fail the test. I was happily surprised that I came up negative! But why? This is why I investigated and found out the facts. This is a diet that I have followed in conjunction with exercise. I am happier and healthier because I do it, and I can enjoy my herb of choice without fear of being fired for an invasion of privacy.</p><p>DISCLAIMER: I am only relating PERSONAL experience. Your results may (and probably WILL) vary. The adulteration of the immunoassay is probably a breech of contract with your employer and may result in disciplinary action or termination. However, this diet is not illegal in any way, shape, or form...and is a healthy diet to promote stamina for exercise.</p><p>P.S. I am a Vegan and Cycling activist in PA. I am a member of NORML and I do not endorse the use of ANY illegal drug while cycling OR while in the workplace.</p>"
}
