{
 "title": "Ecstasy Amongst Everyone",
 "author": "Victor",
 "citation": "   Victor. \"Ecstasy Amongst Everyone: experience with MDMA (Ecstasy) (ID 45389)\". Erowid.org. Jun 28, 2010. erowid.org/exp/45389",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45389",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2010",
   "Views: 3782",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience was my first with the 'love drug' aka Ecstasy aka MDMA.</p><p>The night started around 11:30, my friend who shall be called N and I went with our dealer who shall be called G.  Previous to this experience, C had rolled once, and N had rolled twice.  We picked up the pills, which were Blue Dolphins and made it back to N and his room mate C's house, which has been dubbed, 'Thug Mansion'.  N, C, and I took the pills at exactly 12:50AM, we chilled on the couch and listened to some relaxing music till the pills kicked in.</p><p>Around 1:30AM the pills kicked in, by which time N had put some Trance music on the XBox and was playing that, he also got out a spinning light toy.  After he got the music on, we started dancing our asses off in front of the TV with the lights off and the XBox Visualisations going.</p><p>N had us stop dancing and had us sip some water (we sipped as to not drink too much water).  After we sipped some water, we went into the bathroom and I saw my face for the first time.  My eyes were like dinner plates, and N rubbed some Vicks Vaporub on my face and chest and man did it feel amazing.  We went back onto the 'dance floor' and listened to trance, and all sorts of different dance music.  We would stop after every few songs, and take a few hits off of a black and mild (which felt amazing, I couldn't even feel the smoke go in) and take a few sips of water.  Each time we stopped we would wipe our sweat off and cool down a bit, and apply some more Vicks vaporub.</p><p>We danced all night, till about 4AM.  One of the most enjoyable parts of the experience, besides the constant dancing was when N would make me 'fly'. He would have me lay down on the floor and tell me to relax every part of my body, and then he would get behind me and lift my arms up.  Then with my whole body motionless and relaxed he would tell me I was flying and at one point I went, I'm flying over Canada.  I closed my eyes, and I could see the great lakes and the city of Vancouver and I really felt as if I was flying, in a total euphoria above the trees and clouds of Canada.  When it was time for me to 'land' N would go, 'Okay, Victor I'm going to bring you in for a landing, you are going to land, and fall straight through the floor.'  After he slowly brought me in for a landing, I actually felt like I fell right through the floor, and I was in a total state of...ecstasy.  I felt like everything in the world was right, and that every problem I had ever been faced with had melted away at that point.  I was in a total state of numbness, relaxation, and euphoria.</p><p>We rolled till around 4:30AM.  After we stopped dancing, we all chilled on the wrap-around couch, and me and C smoked a black and mild together. The 'after roll-roll' is almost as enjoyable as the roll itself.  We were all in an intense state of relaxation and euphoria, and my mind was totally blank, as it was the entire night.  A lot of people think guys telling each other that they love one another is gay, or weird.  But that night, the words, love and friend were thrown around so much, and nobody cared.  Nobody cared that I couldn't dance, (I actually hate to dance, but that night I loved it)  And everybody loves everybody.</p>"
}
