{
 "title": "Ritalin, Summer of Love '00",
 "author": "deadhead",
 "citation": "   deadhead. \"Ritalin, Summer of Love '00: experience with Methylphenidate (ID 4539)\". Erowid.org. Dec 27, 2001. erowid.org/exp/4539",
 "substance": "Methylphenidate",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "65 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   "  T+ 2:00",
   "50 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   "  T+ 3:40",
   "45 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "4539",
   "Male",
   " ",
   "Not Given",
   "Dec 27, 2001",
   "68852",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nConsidering the fact that my Ritalin reports have not been posted before, yet there are no other ritalin reports on this site, I decided I will try again, I think that people have the right to know about every drug there is.</p><p>Well, it took a long time to finally get some ritalin, I finally talked someone into giving me some. I ended up paying 50 cents for a bottle full of half 5 mg and half 10 mg, about 70 tabs in all. But, then I found out that ritalin is easy to get and later aquired a bottle of about 70 10 mg tabs and 70 5 mg tabs for free.</p><p>Mindset:</p><p>I had a slight cold, but I was in a ok mood and ready to go snort some of the tabs.</p><p>Experience:</p><p>I always snort ritalin, it gets in my bloodstream faster and gives a bit of a buzz.</p><p>6:00 -- Two friends of mine chop up 60 mg, the usual amount to get the ritalin buzz, I do 65 mg because I had been using ritalin all week.</p><p>Normal Ritalin Buzz kicked in. The ritalin buzz is hard to explain, it's reminiscent of speed, but different. I feel a pretty nice euphoria, the need for sleep dies out completely, and I get the urge to talk alot. I mean alot.</p><p>It lasts for about an hour to me, and then I get about a half hour of a still buzzing, yet coming down feeling. I've did it with some people that the buzz stays with them for hours and hours. So, I guess it all depends on how your body takes it.</p><p>8:00? -- Well, after this wore down, I snorted about 50 more mgs, for a total for 105 mgs. By the way, after I've been high on ritalin and am on the comedown, I can snort all the ritalin I want and I won't be as high as the first time for some reason. (There is a way to get around this, and that's smoking it, gotta smoke it over a tin foil, like with meth.)</p><p>9:40</p><p>Well, I decided to go for about 45 more mgs, I didn't even get a buzz this time, it just kept me from feeling like crap.</p><p>12:30</p><p>I felt like crap, I didn't want to snort any more ritalin because I wanted to go to sleep, I thought I could, but I couldn't, I just sat on my friend's couch all night and didn't sleep a wink until 9:00 the next morning.</p>"
}
