{
 "title": "Shapes in the Ceiling",
 "author": "Barrett",
 "citation": "   Barrett. \"Shapes in the Ceiling: experience with LSD (ID 45415)\". Erowid.org. Nov 18, 2007. erowid.org/exp/45415",
 "substance": "LSD",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45415",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 18, 2007",
   "Views: 5194",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Over the last few years I've been increasingly interested in psychoactive drugs and did a fair bit of reading. Like most I imagine, I was quite nervous about the idea of trying mind altering substances, but my curiosity got the best of me I guess. The only other substance I've used before has been marijuana, and by crude comparison, LSD didn't seem to be much worse in terms of bodily physical/mental damage.</p><p>A buddy of mine at work seemed to know a good deal on the subject, his own experiences and understandings seemed to match up from what I learned from other sources online. So I gave in and asked him to get me a hit or two. He recommended that a first-timer should really just try one hit, but the ones he had on him at the time were of relatively lower potency, so I was given a hit and a half for roughly the value of one. I knew that LSD was prone to giving you 'hangover like' feelings the next day or so, so I picked a time where I had a few days off to myself.</p><p>At home by myself the afternoon came where I was going to try my first trip. Roughly around 6pm I was listening to some music and playing some console video games on the computer for an hour or so. I got up, took the acid out of the freezer and popped it down with a swig of coke. I'll admit I pulled a stupid face for a few seconds, with a classic 'What the hell did I just do to myself' thought drift through my brain. Oh well, I just plunked myself back down in my comfy leatherback chair and resumed listening to Tool and just relaxed. 10 minutes. Nothing happened. 20, 30, 40, 50! I was thinking to myself, 'What the hell, were they duds?' I knew the guy at work for a while now, felt I could trust him no problem and wouldn't give me just little coloured pieces of paper. I mean he gave them to me for pocket change, so I didn't feel ripped off. I shrugged it off and resumed playing some games.</p><p>Almost an hour and a half later I kept noticing little blotches of light appear in the corners of my eye. I could swear that something just moved or scurried along the floor like a mouse would. Occasionally I rubbed my eyes while playing that game because either my vision got a bit blurry or the colors were intensifying. I got up quickly and started for the bathroom for some reason (maybe to check my eyes? can't remember) but I felt all woozy and slightly disoriented, like I was drunk, but it wasn't the same, almost like a 'cleaner' drunken sensation. For some reason I kept clenching my teeth together, but it wasn't bothersome. I must've got up, walked around a few paces, sit back down about five or six times. After about an hour of that I trudged into the bathroom and looked at my puples, wide as nickels. Almost immediately I started to giggle and laugh at myself. I don't think a grin left my face the rest of the night.</p><p>Now I wanted to experience everything all over again. I remember pouring salt and pepper on the table and closely examining it, moving it around watching the spacing between the granules seem to take shape of drawn fictitious faces almost cartoon like. I would dab up a small amount with my finger and feel its coarseness between my fingers as I rubbed it together, the tips of my fingers would tingle afterwords. I made some freshly ground coffee and carefully boiled the water. The smell of it brewing was nothing short of amazing and was intense, like I was smelling the insides of a factory processing bags of gourmet coffee beans. The taste was too complicated for me to describe, the slightly bitterness on the sides of my tounge with richness in the background and sweet taste of cream. It might sound silly, but it was one damn good cup of coffee.</p><p>Then I took a shower, a 25-30 minute shower. The feel of the shampoo in my hair lathering, scrubbing my arms with a wash cloth, pretty simple, common place stuff everyone does in the morning, but for that instant I don't think I felt more alive coming out of the shower than ever before. I dried off and laid on the bed with the fan on just staring at the ceiling. The bedroom ceiling is all white and textured by gooping plaster on it with a sponge giving lots of detail. The single light is centered and is mounted quite closely to the ceiling, casting countless shadows on the little plaster marks giving them relief and depth. In the dim light I watched in amazement as they calmly moved around and seemingly arranging into little faces like with the salt I explained earlier, making single-color mountans, valles and trees.</p><p>After a good hour of that I managed to make myself get up and get something to eat out of the 'fridge. I finished off the other half of a sandwich from subway and it really seemed better than the first half I had hours earlier. For the next couple hours I listened to music with winamp visualizations running fullscreen. The colors were captivating and I simply got lost in it. I shut my eyes and just relaxed feeling completely elated. Several hours later I felt the effects wearing off and decided to head to bed.</p><p>Without recalling any dreams I woke up feeling quite 'blah' and drained, but not the hangover I was expecting. I had a shower, but it just wasn't the same I like last night. The blah feeling wore off gradually during the day and felt fine afterwords. LSD was an amazing experience that I will defiantly try again sometime. I doubt that I'll increase the amount I took the first time.</p>"
}
