{
 "title": "One Lump or Two?",
 "author": "NickAtNight",
 "citation": "   NickAtNight. \"One Lump or Two?: experience with Yerba Mate & Kratom (ID 45413)\". Erowid.org. Sep 27, 2005. erowid.org/exp/45413",
 "substance": "Yerba Mate & Kratom",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "1.5 cups",
   "oral",
   "Yerba Mate",
   "(tea)",
   " ",
   "20 g",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45413",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 27, 2005",
   "Views: 17612",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBackground: After a very long week of moving and packing, with more still do to, I came home from work feeling burnt out. I had just recently put an order in for kratom, h.b. woodrose (awesome stuff by the way), kava, and flavored yerba mate tea and was quite happy to find it on my doorstep upon arriving home to my apt.\r\nPrev. Experience: I have experience with all kinds of weed (I smoke just about everyday), lsd, lsa, shrooms, every narcotic from darvon to oxy, benzos, barbituates, amphetamines, amanita muscaria, salvia, etc etc.\r\nSubstance and Dose: 1 teabag Yerba Mate Tea, steeped for 15 minutes in hot (not boiling) water. ~20g regular grade Kratom brewed for about 20 minutes in the same kind of water, stirring occasionally.\r\nExperience: After downing the Yerba Mate tea, I started packing. Almost instantly after drinking the stuff, I felt a boost of energy, similar to caffeine but much more...stable is the best word for it. I get jittery and get headaches on caffeine and this was like a higher dose of caffeine but much more enjoyable. After 5 minutes, I drank the Kratom tea as well (both teas were just the water, not the actual plant material). Within 10 minutes I felt the familiar warmth kratom (and all opiates) gives me. I was energetic and wanting to get stuff done, yet euphoric and composed. I am a huge fan of the combination of an 'upper' and a 'downer,' my favorite thus far being ritalin and oxy, but this felt a lot less oppressive than that combination. This combination is exactly what I needed to help me get through another long day of packing and moving. I can report no negative effects, and am very very happy with the results. This combo is LEGAL in every way, and I think I just found my new favorite after-work fix. Both substances are cheap and while the kratom tea doesnt taste wonderful, it certainly isnt bad and the yerba mate tea I had was flavored and tasted awesome. This is a very safe combo as well, which I like about it too. Well, time for me to get back to packing! Be safe!\n\n\n"
}
