{
 "title": "Another Joins the Debate",
 "author": "Iching",
 "citation": "   Iching. \"Another Joins the Debate: experience with Red Rock Opium & Cannabis (ID 4544)\". Erowid.org. Jan 8, 2001. erowid.org/exp/4544",
 "substance": "Red Rock Opium & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Red Rock"
  ]
 ],
 "footer": [
  [
   "2001",
   "4544",
   "Not Specified",
   " ",
   "Not Given",
   "Jan 8, 2001",
   "9844",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night i had an encounter with the controversial red rock opium.  Having read the report on this site concerning the substance i was naturally skeptical, and even though i purchased it from a highly trusted source who had been smoking it for 3 weeks, i was inclined to believe even he had been duped and that this was in fact incense.  It came in rocks nearly identical to those pictured on the website, though it was blacker looking.  My source claimed he had seen it distilled from the raw opium and that this was the result, and swore by its effectiveness.  I sprinkled a small portion on some marijuana in a small pipe and smoked it with a friend who had had the opportunity to try opium before (i had not, though i have had both morphine and codeine before, and both administered by doctors).  It should be noted here that the doctors observed that i had an unusual tolerance toward morphine despite the fact that i had never previously used opiates.</p><p>We smoked this and there was a mild flowery taste accompanied by the familiar feeling of being high (though it seemed to have a distinct punch to it), but we both were already high and figured the effects we were experiencing were from the pot.  I went to dinner disappointed, but by the time a good three hours had passed i was surprised at how high i still was.  Still not believing it was opium i contacted my source and showed him the information on this website.  He was concerned that maybe HE had been screwed and brought some of the rock over and we smoked a pipe with a bit of rock on top of some pot, then a bong of just the opium.  At this point i was UNBELIEVABLY high, but for some reason still unconvinced.  I was lying back in my chair and not wanting to move anywhere.  He rolled up a tobacco cigarrette with a healthy portion of the opium on it and we walked outside smoking it together.  </p><p>By the time we got to my friends' house i was hammered in a way i have not been in a long time (and i smoke marijuana regularly).  This was definitively NOT just pot and definitively like i remember both morphine and codeine, but because the method of administration was different (not ingested or injected) i believe there were some qualitative differences.</p><p>I remained high for a good three and a half hours before i had anything else, and there was the onset of a distinctive 'crash' which was accompanied by a strong desire to do more.  This was identical to the feeling of stopping my codeine medication after a month of regular use.  I finished up the evening by smoking a hookah with flavored tobacco and opium with a number of people, all of whom got really fucked up (no marijuana).</p><p>CONCLUSION: While there may be people out there selling bunk red rock opium, and the government hasn't found any that contains opiates, there is not enough credible evidence to rule out the existence of opium [or some other psychoactive substance] in a form that resembles this type of incense.  I found it to be a great experience (i really want more right now) but a bit too druggy for my average thursday night.  Don't go around buying all the red rock you can find though: chances are you are getting screwed.</p>"
}
