{
 "title": "Mine Got Out",
 "author": "Manbrainpan",
 "citation": "Citation:   Manbrainpan. \"Mine Got Out: experience with Mushrooms, Cannabis & Beer (ID 45460)\". Erowid.org. Nov 19, 2007. erowid.org/exp/45460",
 "substance": "Mushrooms, Cannabis & Beer",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45460",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 19, 2007",
   "Views: 3058",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was a freshman in college down in NC. I had not been there for more than a month and a half or so, and I think being in this new environment, which was drastically different from what I was used to, greatly influenced my experience. Stressful environments, I have found, make for stressful highs and trips in most cases. But this time the stress transformed into ultimate release and virtual loss of sanity. It was a confusing but enjoyable experience.\r\nAnyway, me and two of my friends started right after dinner, sometime around 6:30-7. None of us had actually eaten anything since lunchtime, in hopes of intensifying our trip. We each prepared and drank mugs of psilocybin tea, prepared in a microwave. Ive forgotten the exact process for making mushroom tea, but its not complicated, I basically made tea like you would with a tea bag, only with caps and stems instead. We had all bought eighths (an eighth of an ounce), and we each put half of what we had into our concoctions. We drank the stuff down. Tasted pretty foul, as I was expecting. We sat in the dorm room for a little while, and then went for a walk. None of us felt anything at that point.\r\nWe took a nature trail to a familiar spot to smoke some pot. This was good stuff, pretty to look at, nicely cured, orange and fluffy. We smoked a few bowls. Still no affect from the mushrooms, but I felt really high.\r\nIt was still light outside when the three of us started walking back. I think one or two other people were with us at that point, but that part of my memory is a little fuzzy because thats precisely when I began my trip. I had eaten mushrooms several times before, but had never achieved a full trip. I would either have the mind job by itself, or the body buzz, or some slight hallucinations - but never a full trip. I could tell from the onset, though, this one would be much different. I got ahead of the group and stopped for a second to wait up. By myself in the woods, all of a sudden I felt like my thoughts were not my own. Or rather, they were my own, but they all led away from me in a serious way. My simple thoughts (look at that tree, etc.) seemed to me to be secret attempts to tap into some grand scheme. In a matter of minutes, I had decided that there was some frantic, expanding and breathing lattice work of energy, always present, in every little object, and that by accepting that I could never really become part of that grid, by realizing that perfection is the quest for perfection and not perfection itself, I was and always had been and always would be a part of that scheme, no matter what I thought or did. All in an instant this came to me. The mushrooms must have been pretty potent. The onset was quick and strong. It hit me like a wave. (also, at this point I wasnt very experienced with shrooms).\r\nThe rest of the group had a little laugh when they caught up to me, probably because I was standing with my hands in my pockets staring up at a tree with a big grin on my face. We walked back to the dorm. Back in my room, we were down to the original group of three. Me and my roommate decided to finish off our mushrooms. Didnt make tea, just ate them. At this point I was tripping physically and mentally. No visuals, though.\r\nI had forgotten that the whole campus was crawling with old alumni, there for a fifty year reunion or something. They had set up a huge tent right in front of my dormitory. I was not expecting so many people when I stepped outside. I think all three of us were a little taken aback, not wanting to walk right through the festivities.. so we stood on the front staircase of the dormitory, taking huge goosesteps down the stairs and back up again, until we collected our wits and somehow we ended up at the grocery store trying to buy alcohol. This sounds weird, I know, but thats exactly how I remember it happening. Dont know how we got there, I mean, the place is a good ten miles away, but there we were, picking out some Sweetwater (kick ass beer) and trying to find someone 21 years old. We got lucky, met someone from school, made the purchase, and called a friend-of-a-friend to come pick us up and take us somewhere where we could get drunk in peace. We wound up at said friends house, all of us tripping very hard. I had full on visuals, and I had that familiar floating feeling. \r\nThe three of us killed the beer (full case) and smoked a fat joint of the previously mentioned pot with the friend-of-a-friend, and then proceeded to run around the house, yelling at each other and trying to light the ceiling on fire (no lie, scouts honor). Usually I dont feel euphoric when I mix multiple drugs, especially when shrooms are involved. But this night I was in another world, living inside a fractal, trying to reach the peak of some never ending triangle, speaking in monosyllabic shouts and laughing uncontrollably. What few sentences I formed, or any of us formed, make very little since in retrospect, but were all-important at the time. Two stand out: Mine got out, and I lost the top to mine. \r\nLater that night, still firmly in the grips of a pot- and alcohol-intensified psilocybin trip, we piled back into the car and headed for campus. We were taking a twisting back road in a small car, and it was very dark outside. We were all still yelling (note: the friend with the car had only smoked pot. She was okay to drive). [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] The scene reminded me so much of a part of A Clockwork Orange that I actually thought I was in the movie. \r\nWe pulled up to the entrance to the school and to our surprise, the alumni were still everywhere. They were filing out of the auditorium, crossing the road right in front of us. Someone in the car, Im not sure who, chucked an empty beer bottle out of the window, and it smashed into the Welcome sign right by the entrance, and right by all of the alumni. The car screeched to a stop, and the three of us started yelling louder than ever, thumping the roof and shaking the car. I remember being on the verge of insanity, not knowing whether I was in trouble or whether I was imagining the whole event, and honestly not caring. All of the alumni stopped and stared. I felt like a criminal but again, I didnt care. This is honestly my last memory of the night, before I remember getting into bed and trying to go to sleep. Sleep didnt come easy. \r\nThis trip influenced my thoughts for at least a week after it happened. I felt like I had cleansed my palate by totally losing control, in the company of two other people who were likewise losing control. We achieved group think in a way I have yet to duplicate, and Ive been trying. For the rest of my life Ill probably try to experience this night over again. It was that powerful for me. This was definitely an historic drug experience in my life. \r\nI think under the right circumstances, with the right people and with the right substances, totally losing my mind can be an extremely spiritual and therapeutic experience. It was this time.\n\n\n"
}