{
 "title": "Strange Days Out in the Yard",
 "author": "Gregarious",
 "citation": "   Gregarious. \"Strange Days Out in the Yard: experience with Inhalants (Gasoline) (ID 45486)\". Erowid.org. May 20, 2007. erowid.org/exp/45486",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1982",
   "ID: 45486",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 20, 2007",
   "Views: 8623",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]<br>I started huffing gasoline with my brother and a friend in our garage out of a little red moped.  I was fifteen. I did it everyday for about two years before it stopped working all together.  I then had a short stint of use around age twenty with renewed affects, but tired of it quickly as it stinks for an extended period of time.<br>The reason I did it was because in the eighth grade a police officer had come to tell my class about the effects of drugs and I remember that inhalants were appealing to me on some level, especially the hallucinations. It was a spur of the moment thing and I was emotionally troubled for some time prior to attempting this.  I had found mind altering experiences recently and craved release from my existence, which I felt was unbearable at times.<br>I remember feeling very warm, espcially around my genitals, anus and resporatory center.  The inital feelings were somewhat sexual. I had been given a late 60's Ford Ranger and would put a hose in the tank just above the level of the fuel in the tank. I breathed deeply in rapid succsession until an event would occur and then stop to take in the event.  These events were always visual, audible and tactile.  It was either extreme bliss or eternal fuckedness forever.  I don't know how else to put it, but if you imagine both ends of the emotional spectrum I went to one or the other; there was no in between.  There were many characters and the sounds were repetitive and nonsensical.  I always felt very child like. Joyful or terrified, but childlike.<br>Once I was out by the truck before school when suddenly a voice said 'Move out old timer, we're tearing this place down.  Suddenly, only The truck, a huge ambiguous piece of equipment and myself existed on vacant land.  I went to look at my watch and realized one of my arms, one of my legs, and one of my eyes were gone.  Besides this, I was ancient.  I had wasted my entire life sniffing gas. I was in such a fright that I began to hobble frantically toward where my house had been and finally got a glimpse of my watch when everything returned to normal.<br>Another time I looked across the street and there I was, only it was a cooler, composed version of myself.  I could tell that I was very angry when suddenly I threw a ball of pure energy at myself.  It grazed my head removing a good portion of my skull and brain.  Now I was angry too.  I walked over to myself and whispered, 'If you do that again, I will kill you.'  <br>There were devils, gods beings of all shapes, sizes, and temperments.  One time I fell through the earth continuing through space for all time.  I even met death himself, and death and killing were a common theme in the hallucinations.<br>I did no other drugs during this time in my life.  This was cheap and available and it worked.  After hours of this I would be exhausted and my motor function was very poor.  Hallucinations always ended abruptly.  Even though there was much activity from my perspective, I was told over and over again by witnesses to this behavior that I would just suddenly start laughing. A very low repetative laugh, which sounded like an impaired person's laugh. Then I would stop and begin huffing again.<br>I formed a world apart from reality during my time on gasoline.  In retrospect, I wanted to stop from very early on and many of the hallucinations reinforced the desire to quit, yet the total escape it offered drew my concious self back again and again.  Until I read the stories I thought people had a different experience with this substance.  Anyone, I did it with claimed what was happening to me was not happening to them.  Perhaps it was progressive.<br>After all is said and done, given the choice, I would not have this as an experience.  I know that it has affected me.  I have never had any testing or anything, but I am sure of the damage, which has subsided in it's severity as time has passed.  I feel fortunate to live a decent and productive life today. to work a job and have a family.<br>I don't know what else to say.\n\n\n"
}
