{
 "title": "An Analysis",
 "author": "Discovery",
 "citation": "   Discovery. \"An Analysis: experience with 2C-I & 2C-T-2 (ID 45501)\". Erowid.org. Jan 12, 2009. erowid.org/exp/45501",
 "substance": "2C-I & 2C-T-2",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "2C-I",
   "(pill / tablet)",
   "  T+ 4:00",
   "6.0 mg",
   "oral",
   "2C-T-2",
   "(pill / tablet)",
   "  T+ 5:00",
   "6.0 mg",
   "oral",
   "2C-T-2",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "45501",
   "Male",
   " ",
   "Not Given",
   "Jan 12, 2009",
   "2781",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Two tablets, I've taken first the 2c-i one (10mg), it takes about 1 hour to feel first effect, and two other hours to get on the plateu. Plateu during 4 hours, and down 1 hour. I've taken half of the 2c-t-2 (6mg) 4 hours after the 2c-i ingestion, and the second half 1 hour later.</p><p>Pills bought in a smartshop (Substance sure 100%) and consommed in a goa party. I've consumed 1 beer (33cl) and 3 joints while trip, and 4 chai-tea.</p><p>Onset: a lot of physical effects as transpiration, cold/hot sensation, muscular tension specially in the legs, light nausea,while moments axiety and oppression sensation. State of mind light changing with very shorts moments of fusion with the music.</p><p>Plateau: transpiration and muscular tension persist, light hallucinations (little distorsions, color enhancement),enhanced feeling perception, time perception altered, little dissociative (difficult to talk in an other language). I was searching to get in a fusion with the music, this was possible only during moments (sec to min) and ther was always a come back of lucidity, muscular tension and a light oppression sentiment. Sensations were fluctuating between wellness and strange but not so pleasant. I'd to work hard to stay in a positive state.</p><p>Down: while on hour moments of normal lucidity alternating with returns to an altered conscience. Physical effects quickly desappeared, leaving the body in a state of relax very pleasant. after 1h30 any effect was sensible.</p><p>After: any physical down in the two days later, and neither after the down of the substance. Only point not negligeable, a sensation of heart oppression and heart fatigue, which desappeared while lying and reappeared while smoking cigarettes or joints, and under effort.</p><p>Conclusion: mitigate experience, not negative, not positive. those are very long substances (particular 2c-i), and the effects are not sensationals, i'd really dislike the heart oppresion ,during the 24 hours succeding the ingestion, beacause I haven't had an important physical experience (like dancing all night long,...) so it make me suspicious.</p>"
}
