{
 "title": "Next Time I'll Show It Some Respect",
 "author": "Jude",
 "citation": "Citation:   Jude. \"Next Time I'll Show It Some Respect: experience with Salvia divinorum (20x extract) (ID 45517)\". Erowid.org. Nov 19, 2007. erowid.org/exp/45517",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45517",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 19, 2007",
   "Views: 2969",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIve done acid twice shrooms a bunch and have tried all the other usual stuff one does before getting to those, none of those can compare to the intensity of my trip last night. Now I've tried salvia before, but the quality is always up in the air depending on how shady the company your buying it from is. Ive always gotten mine from headshops with a 'dont worry it works' promise. Its always worked to an extent, but theres a big difference between 'breaking through' and tripping on salvia. I've tried it about 5 times and only this last time have I actually 'broken through'.\r\nTo be perfectly honest I cant remember anything past exhaling until I came up through the floor of the room and saw the rug on the wall attempting to digest my friends watching me bug out in amazement. I then convinced myself that I was somehow having an acid flashback and became pretty terrified. I had completely forgotten in my current unbelievably-headfucked-state that I had smoked salvia. I believed that I was now looking at all my friends in the room from another dimension that I was stuck in, I could hear them fine but something just 'felt' wrong. this lasted a good 10-15 minutes until I 'learned' that this wasnt a different reality but I was coming back to the one I had always known. My friends said that during the time I was tripping I was talking about nonsensical (sp?) things like christmas presents and my pet cat.. I can assure you no thought of christmas presents or my cat ever passed through my mind while tripping.. or at least that I can remember I guess. I heard afterward that while I was tripping real hard my friends were screwing with me which probably added to the 'bad' feeling I had while tripping... looking back on it it was a shitload of fun but while I was tripping it was a terrifying experience.. kinda like a rollercoaster for your brain. be careful.\n\n\n"
}