{
 "title": "Did Not Break Through",
 "author": "Brent",
 "citation": "   Brent. \"Did Not Break Through: experience with Mimosa hostilis, Passion Flower & Cannabis (ID 45535)\". Erowid.org. Sep 26, 2005. erowid.org/exp/45535",
 "substance": "Mimosa hostilis, Passion Flower & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Passion Flower",
   "(pill / tablet)",
   "  T+ 0:45",
   "7.0 g",
   "oral",
   "Mimosa tenuiflora",
   "(extract)",
   "  T+ 1:05",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:15",
   "11 g",
   "oral",
   "Passion Flower",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "45535",
   "Male",
   " ",
   "Not Given",
   "Sep 26, 2005",
   "12407",
   " "
  ]
 ],
 "report": "<p>Recently I had purchased some Mimosa Hostilis online, and having not yet had the chance to extract it I decided to make an Ayahuasca-like brew. For a couple days prior I did reading on the religious and spiritual aspects of the brew, the Jivaro people, and anything else I could find on the subject. The day of ingestion I had purchased some Purple Passion Flower Extract pills from a drug store in a large town after giving my friend's sister a ride home (She lives 80 miles away). Everything had been pleasant, I felt good and was very eager to taste some DMT. I busted out my bag of wood over at a friend's house and asked him if I could test it out. I was going to try it first, and then if the Purple Passion Flower was a satisfactory MAOI everyone else could do the same the next day.</p><p>At around 6pm I ingested 4 of the store bought tablets and began boiling my mixture of lemon concentrate (1 part), water (2.5 parts) and finely ground mimosa bark (7g). This was boiled lightly and stirred for 40-45 minutes, filtered through a thin sock and chugged. Shortly afterwards it seemed as though I could pick up mild changes in perception, as it usually occurs on tryptamines for me. Within 10 minutes I knew something was changing, and it was undeniable at the 20 minute mark. I smoked some low grade bud for nausea (It was all I had), but at around 40 minutes into it I finally puked. Strangely, this seems to have been my peak. I was on the verge of having beautiful closed eye visuals, and the room was starting to breathe and move in/outward a bit. I was hoping it would build up and I would break through, but it did not.</p><p>An hour and a half after ingesting the brew my stomach was finally up to taking 2 more of the Purple Passion Flower pills, so I took em and managed to keep them down. There was no significant difference, and I didn't feel up to taking anymore DMT or Purple Passion Flower, so I decided to call it a night and laid in bed until I finally managed to fall asleep.</p><p>I'm still waiting for a chance to do an extraction, and I'm currently looking for some Syrian Rue to make another attempt at this.</p>"
}
