{
 "title": "Outward Bound",
 "author": "mind7",
 "citation": "Citation:   mind7. \"Outward Bound: experience with Meditation & OBE (ID 45544)\". Erowid.org. Jun 25, 2007. erowid.org/exp/45544",
 "substance": "Meditation & OBE",
 "bodyweight": "200 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45544",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2007",
   "Views: 4154",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nPrevious mystical experiences: A feeling of pure bliss/love while meditating on mushrooms  knowing that I and everything else was God.\r\nPrevious drug experiences: I sniffed coke about twenty times during a span of about a year/ Consumed E at least once every weekend for about four months/Tried acid once/Smoked crystal for about two weeks . \r\nPrevious plant experiences: Ive smoked a lot of Cannabis/ Ive smoked salvia divinorum a few times in the last month (only light doses).  \r\nI have been mediating daily for about a few months now, and Ive experienced some pretty incredible coincidences. When I tap into this infinite organizing field of intelligence, my deepest wishes seem to manifest. But something happened today that I was not expecting. I was kind of stressed out, so I decided that I would mediate for a while. I hopped on my bed and closed my eyes. While lying down, I used the mantra so- hum (thinking the word so while inhaling, and hum while exhaling, while concentrating on the sound of my breath)(1). I also would periodically stop the breath work (every minute or two), and just lay there in silence  allowing no thoughts to enter my consciousness. When this became too difficult to sustain, I would return to the breath work. \r\nIm guessing that I was meditating for about fifty minutes, and then it happened. My body felt very light, and I could sense that I was disconnecting from it. I then consciously made it my intention to leave my body (although I didnt actually think it was going to happen). I felt myself going up towards the roof in a quick-like fashion  and even though I didnt look down  it was evident that I was out of my body ( I could see that I was in my room , even though my eyes were closed). I wasnt really happy or scared at first  I just 'was'. I then started to think that maybe I would die if I stayed 'out' for an extended period of time, so I tried to return to my body. I opened my eyes (which was difficult), and I laid there in amazement. An out of body experience  and I wasnt even high! This was the most amazing thing that I have ever experienced. Next time, Ill see if I can prolong the experience for a little longer.     \r\n(1)  this is the mantra Deepak Chopra recommends\n\n\n"
}