{
 "title": "Voacanga Research",
 "author": "Anthony",
 "citation": "   Anthony. \"Voacanga Research: experience with Voacanga africana (ID 4558)\". Erowid.org. Jan 8, 2001. erowid.org/exp/4558",
 "substance": "Voacanga africana",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "70 seeds",
   "oral",
   "Voacanga africana",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4558",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 8, 2001",
   "Views: 16045",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had wanted to smoke weed tonight, but had none, and since I had some Voacanga africana seeds lying around, and no place to be tomorrow, I decided to try them.  I had read 2 reports on the internet of users who had taken 50 seeds and reported a mild experience, so I decided to try 70.  I counted them out and began to chew them, about 15 at a time.  They are pretty small so chewing 10-15 at a time is no big deal.  They didn't taste horrible or anything, but they sometimes stuck to my teeth so I had to drink water to wash them down.  I knew the effects weren't supposed to take hold for something like an hour or more so I patiently waited.  </p><p>About an hour into, I began to feel the stimulant effects it's said to have.  Basically it's much like a medium to high dose of caffeine.  For those that don't know it, these seeds are supposed to have psychoactive properties as well.  I wasn't experiencing these when the stimulant effects kicked in, but this didn't seem at all unusual as I've noticed with other drugs the physical effects often becomes noticeable before the mental effects do.  So I waited.  And waited.  And waited.  It's been 4 hours now and I'm still waiting.  I seriously doubt they would kick in this late so I'm giving up and going to bed.  Apparently, in order to attain the psychoactive properties, one would have to ingest a lot more seeds?  Either that or the claims to psychoactivity are exaggerated.  Also, the stimulant properties aren't even that strong and I feel quite capable of going to sleep now, so perhap it is a matter of dosage.  Whatever the case, it's not something I'm going to be experimenting with again anytime soon. (the seeds I got were free and I certainly wouldn't pay for them now that I know how mild the effect is).</p>"
}
