{
 "title": "Super Milk Chan to Infinity",
 "author": "Kane Zen",
 "citation": "   Kane Zen. \"Super Milk Chan to Infinity: experience with 4-HO-DiPT (ID 45617)\". Erowid.org. Jul 10, 2006. erowid.org/exp/45617",
 "substance": "4-HO-DiPT",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   "(powder / crystals)",
   " ",
   "7.5 mg",
   "insufflated",
   "4-HO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 45617",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 10, 2006",
   "Views: 6327",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>20 y/o male 200 lbs  My Girlfriend= 23 y/o female 145 lbs</p><p>This was a night me and my girlfriend had rented a hotel room in and brought a lot of old drugs that had been sitting around forever.  First we tried 6 month old molly after giving it a few hours to manifest it flat lined completely instead of taking off. So after getting bored we pulled out the 4HO (this capsule was actually 8 months old) 15 mg.</p><p>I emptied the capsule and split the material between the both of us and we both snorted it up and licked the trace remnants of the powder.</p><p>T+0:15: We both begin to feel the alert of it coming on. Vision begins to fade and it is hard for both of us to stand or walk straight</p><p>T+0:30: Visuals begin to kick in we have been engaged in conversation about what is going on for a while now after struggling to the bathroom to go for one last urination each we decide that its best if we stay near the bed walking right has become increasingly difficult.</p><p>T+0:45: Visuals begin to kick hard and body load goes up no intestinal distress for either of us we sit down to watch some Adult Swim. If ever there were shows designed with the tripper/stoner in mind these are it. After a while the TV is still clearly visible when we are focusing on it but the world around it begins to flex and flange with terrific color and erratic wave and spiral patterns. This goes on thought the entire trip</p><p>T+1:30: Visuals still kicking hard our favorite show comes on (Super Milk Chan!) This show is already like an acid trip in cartoon form. This is the final episode of it too and it is one trippy episode  the colors change wildly and visual distortions appear on screen the characters are all absolutely bizarre sometimes speaking pure gibberish (I assure you this is not due to the drugs we have had it is the actual show itself) with random unrelated and unusual interludes depicting a park with pigeons (which the colors of their feathers change constantly) and a girls voice speaking about her own thoughts of the world ( its a very deep show really). Anyways needless to say watching this just trips us out even more.</p><p>T+2:00: Time keeps going by who knows how long it has been. After watching through adult swim we have taken to watching each others faces and talking to each other. Our faces swirl and distort just like the room was I know when Im speaking I sound crazy and everything turns repetitive and almost feels like Im rhyming. The conversation is deep and my thoughts shift very much towards her and the swirling vortex that is her face. Facial features are recognizable but at the same time they twist and turn rapidly. She at one point tells me I look like the devil (I find it fun to make weird faces at her while she is watching. I can do some pretty odd and crazy faces) this goes on for quite a while</p><p>T+4:00: Visuals begin to subside although still not gone completely they subsist in a minor amount for another hour or two and after that there is still a pleasant afterglow we both enjoyed this experience immensely she has said that these are the best visuals she has had (she is fairly experienced with LSD). I would have to say they are right up there myself (I have a lot of experience with LSD Mushrooms 2CT-2 Ketamine and a few other research chemicals).</p><p>T+5:00: After glow is coming on nice she has decided to go to sleep Im still wide awake (I cant sleep after psychedelic use or X usage) so Im watching adult swim again (it cycles through a second time after its run through all of its shows) after about another hour I go to sleep myself.</p><p>The next morning we can still feel a slight afterglow which is 12 hours later. Its nice and subsists for another few hours. This is mid January and when we leave its ice cold outside a very nice feeling.</p><p>All in all I would have to say this is one of the better trips Ive had. The visuals were stunning the mindset very beautiful as well. No intestinal distress (a big plus considering the other chemicals Ive taken usually cause me quite a bit). </p><p>This is still one of my favorites. Nice minor ego loss great visuals fun enjoyable mindset with no radical moodswings. Something id like to do again and again.</p><p>Also on a side note the conversations we had helped us open up and learn a lot about each other. At this point in time we are about three weeks into our relationship. The first time we met we rolled together and the second weekend as well. I would have to say that without a doubt our experiences with ecstasy and 4-HO-DiPT have deeply affected us and our relationship.  Perhaps it had a synergistic effect with the bad MDMA in us im not sure.</p>"
}
