{
 "title": "Fun If I Could Remember",
 "author": "Derek",
 "citation": "   Derek. \"Fun If I Could Remember: experience with Alprazolam & Alcohol (ID 45614)\". Erowid.org. Nov 19, 2007. erowid.org/exp/45614",
 "substance": "Alprazolam & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "4 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "0.5 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45614",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 19, 2007",
   "Views: 16156",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]<br>The night began with a get-together at a friend from work's house. I take a 2 MG xanax before even walking into the door. After a while of hanging out, I decide its time to get a little drinking done. I had been warned about mixing pills and alcohol, but I had no clue how serious they were. I played it off. I said I'd be fine... But I proceed to take 4 shots of licorice hard liquor. After this, I decide its time for another 2 mg xanax. I take half, and insufflate the other. By this time, I have a pretty good buzz going. And I was talking a lot.<br>The next thing I know I wake up... In bed... I feel fine. I dont question anything. I just get out of bed like I always do. But I have 4 missed calls on my phone. It's my buddy from work. He's wanting to know if I'm ok. I wondered why he cared since he gets trashed all the time, just never off pills. He's strictly a drinker only. Well, as I'm calling him back, I walk onto the front porch to find that my car is a block down the road. Parked kinda funny. My friend proceeds to tell me that he fought with me for an hour not to drive home last night. He states that I was falling in the hallways and actually had me hang out, drink water, and sober up before I left, none of which I remember. <br>This doesnt seem like the worst of nights, but realizing that I didnt remember any of this was very scary. I had no recollection of the night before at all. I woke up and felt fine. This will forever end my mixture of pills and alcohol. It is very unnerving actually knowing that I didn't remember anything.\n\n\n"
}
