{
 "title": "Bliss and Then Nothing",
 "author": "Tucka",
 "citation": "   Tucka. \"Bliss and Then Nothing: experience with Mushrooms & Inhalants (Duster) (ID 45621)\". Erowid.org. Jun 19, 2007. erowid.org/exp/45621",
 "substance": "Mushrooms & Inhalants (Duster)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1.86 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45621",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2007",
   "Views: 8976",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]<br>Well Ive taken lots of shrooms in the past and the dose has ranged from 5 grams 2 of which were aborts (more potent) to 2 grams. <br>I was expecting an OK trip that would last for about 2 hours because thats what happened to me when I took 2 grams. I was wrong. I started by crushing up the shrooms to a dust the night before and decided not to take them because I had eaten too much. The next morning I slept in till about 11:00 and fasted till 1:30. Thats when my friends mom had left for work and we had the house to ourselves. I poured all the dust into my mouth and got it under my tongue. It turned into a ball and I would chew on it put it under my tongue for awhile and suck the juice out of it then swallow.. haha that didnt sound quite right .<br>About an hour later I started to feel it. The trip started out very visual. All the walls and floors were moving and when my friends would speak to me there faces would morph and there eyes would get huge. My buddies were huffing duster and literally freaking out and spitting all over them selves and fighting. It was really sad because when they were done they would stand up and say, What the fuck just happened?! I didnt partake in it because I wanted to keep them under control and every once and awhile I would steal the duster from them and hide it so they wouldnt go insane.<br>It was really hard for me to stay cool because I was literally in a different world. Everything I looked at was different. Wood had crazy patterns and rivers running through it and the floor boards to my friends kitchen were messing with me when I walked on them. They would get big and then little but only when I tried to step on them. I could make anything move and transform just by looking at it. If I looked at a picture and concentrated it would change and this applied to everything. <br>I found all of this to be terribly funny and was having the time of my life. After getting tired of the downstairs I went upstairs and gave my buddies the duster back. I sat down on the couch and my friend handed me the duster. I thought what the hell I gotta try it once on shrooms. I didnt think anything too crazy would happen because I can handle my drugs very well. Even when I go crazy on duster I still know what Im doing and the worst that happens is I just sit there smiling for 5mins. I took a huge hit and sat back. While I was holding it in a screen of blue and red and purple covered my vision and I started to hears waves that would get louder and then quieter and they were very consistent and drowned out almost all the other sound. <br>Suddenly I found myself in nothing. I was sitting in the same position but I couldnt move and everything around me was pure white. If I would say something I would hear it echo in the distance. After what felt like 20mins I started hearing static and it got louder and louder. I fell back and the purple red and blue screen appeared out of nowhere and dissipated into what was the room. My friend couldnt stop laughing and said that I just sat there with a huge smile on my face and didnt say or do anything.<br>Half an hour later I decided to try it again. I took my hit and the colors once again took me to another world, But this time it was different. I was in the air without a body looking down on myself sitting in a wooden stool in the middle of nothing. There was nothing around me and if I looked in different directions I would just see the same thing (me in a stool). When I started coming out of it what I was seeing though got closer and closer to the person sitting in the chair until finally I could only see the back of there head. I got too close and could only see black until the colors came back and brought the room back to me.<br>I did that a few more times and each time it was a strange and wonderful experience that was like nothing I have ever experienced before. Afterwards I decided that I never need to experience it again because air duster is just too damn harmful and have decided never to do air duster again.<br>The shrooms wore off around 5:00 maybe 5:15 and I was very surprised at the trip I had gotten. It was one of the best ones ever and yet I took the smallest dose ever. Ill never understand why I got such an amazing trip but hell Im not complaining!\n\n\n"
}
