{
 "title": "Faith",
 "author": "Slash",
 "citation": "   Slash. \"Faith: experience with Mushrooms - P. semilanceata (ID 45640)\". Erowid.org. Nov 27, 2007. erowid.org/exp/45640",
 "substance": "Mushrooms - P. semilanceata",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "70 g",
   "oral",
   "Mushrooms - P. semilanceata",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2004",
   "45640",
   "Male",
   " ",
   "Not Given",
   "Nov 27, 2007",
   "Views: 2545",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've always been a fan of psychedelics. Over the years Ive come to believe that the scope for insight and self-improvement whilst under the influence of the aforementioned is not only priceless and unparalleled, but also divine and sacred. You may say Im a dreamer, but Im not the only one. My first forays into the realms of expanded consciousness were typical. Marijuana, then ecstasy and lsd, gave me happy, euphoric experiences that re-affirmed my faith in life itself.</p><p>As a teenager, with all the accompanying hormonal and emotional handicaps, I was not happy. Being a relatively ugly person (in my own eyes) and going through the aggravation of my parent's divorce and subsequent dual domestic life, left me drained, depressed and sad. This all happened at about the age of eleven. Whilst my parent's tried to retain a mature and dignified approach to the situation, I was not receiving the love an attention any adolescent requires. I hated life. I wanted to escape. So, I got high.</p><p>Cannabis was a revelation. So little effort was required to produce such profound effect. On my first time, I had three tokes from a red-seal laced bong. I soared. I must have laughed for half an hour straight, just at the fact I couldn't believe what I had been missing out on all this time. Every sense was amplified, and distorted. I was hysterical and hyperactive, but, above all, I was happy. I ended up having an excessive habit for seven years.</p><p>During this period I experimented with ecstasy, then lsd. Ecstasy was exactly that. Totally mind-blowing. Experiencing it with my closest friends we talked endlessly, with a profound and true connection between us all. We were able to compliment and criticise each other, without any awkwardness or ego. Pure understanding. Ecstasy taught me how to low let go of my ego, and how to have faith in myself. In so many social situations I used to say or do things in order to gain some kind of 'upper hand', to boost my ego and social standing. Ecstasy completely obliterated all that bullshit. It taught me that it doesnt matter what other people think of me, it's my own sense of self-worth that precedes contentment. The key to happiness is by doing what I want to do, for my own reasons.       </p><p>Lsd was ridiculous. I've always likened acid to someone grabbing me by the balls and twisting them - if they get it right, it's quite a thrill, but if they get it wrong it can cause serious pain. I've had uncomfortable experiences with acid, but nothing I couldn't handle. The good parts of acid were phenomenal. Deeply spiritual, emotional times. I can recall one time when I was just staring at myself in a mirror, straight into my eyes, and I ended up crying because I just felt so unbelievably privileged to be alive and young. Experiences like that have changed my life for the better.  </p><p>Anyway, the reason I have outlined these experiences is to illustrate the fact that my mindset has been dramatically altered by these illicit drugs, and it is from this altered state in which the experience I am about explain, took place:-</p><p>We really deserved our harvest. After roughly 20 hours of field work, we finally stumbled across a field brimming with liberty caps. They were everywhere. Two hours of frantic picking later we had approximately a kilo of fresh mushrooms. Hyperventilating and happy, we returned home and examined our bounty. We invited all our closest friends round. Shock and awe was the general reaction to the colossal pile of fungi we had amassed. There were seven of us in total. Obviously still reeling from the adrenaline rush of our find, I decided that we were going to do half of the mushrooms that night.</p><p>We gathered round the seething cauldron of mushrooms and boiling water. We laughed and joked about what could be in store, and watched the clear water turned into a deep, jet-black syrup. Once the brew had been prepared, each member of the establishment helped themselves to a generous portion. Less than ten minutes later the initial effects were apparent. I suddenly went weak at he knees and had to sit down. I started seeing shafts of luminous light spearing from all angles, and everything was drenched in a sparkling, iridescent coating. It was obvious that I was in for quite a ride.</p><p>Half an hour later and we were in another dimension. We were confused and delirious. I felt as if I had no control over my limbs; they were flapping about like a branch in a gale as we laughed uncontrollably. Anything that anybody did seemed unbelievably hilarious and I also started to feel a profound connection with everybody else in the room. I seem to remember that when I was laughing it felt totally amazing, like a primeval release of energy. It felt purifying and energising. We were laughing so hard that it seemed to echo inside my chest. At that point I started to think about how natural and right the whole situation was. I understood how for thousands of years humans had been undertaking the exact same ritual of picking mushrooms, getting high with their mates and having a fucking good time. I thought about the people walking the streets, walking past these mushrooms, knowing they were there, and that they were psychedelic, yet completely disregarding them out of sheer ignorance. Why the hell werent they getting them there selves? Dont they want to feel like this? Coz its fucking brilliant! Fools!</p><p>Once they started to wear off somewhat, the trip became even more enjoyable. The sheer confusion and delirium of the earlier stages started to subside, to be replaced by a pure, comprehensive understanding of everything. Thats how it seemed anyway. Every question I could possibly imagine in my mind simply dissolved into the answer. Thats how clearly I believed I could see. I felt as If I could see in into the future  not literally, but that I could make an accurate prediction of future events based on the knowledge of previous ones. My reality seemed to be the epitome of a perfection that I had created, if you get what I mean! Its difficult to explain. I embraced a lust for life I had never previously experienced and carry with me to this day. As we shared this collective experience between us, I had never ever felt so alive. It was breathtaking. I felt like a god.</p><p>Eventually they did wear off and I came back down to earth. As I said before though, the knowledge and wisdom that experience gave me is still with me and I have been a happier person ever since then. If there is one thing that I learned that night though, it is that there is only one thing we really need in this life  faith. Also, I dont think this experience would have been possible without the experiences I had already had with other drugs, as I outlined before. To me every experience (drug-related or not) re-wires my consciousness to some extent and I did happen to be a very open-minded, understanding individual beforehand.</p>"
}
