{
 "title": "My Week Of Hell (Thanks Vicodin)",
 "author": "Xyphus",
 "citation": "   Xyphus. \"My Week Of Hell (Thanks Vicodin): experience with Hydrocodone & Oxycodone (ID 4568)\". Erowid.org. Oct 27, 2001. erowid.org/exp/4568",
 "substance": "Hydrocodone & Oxycodone",
 "bodyweight": "145 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 4568",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 27, 2001",
   "Views: 73386",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me preface this report by mentioning that I have had addiction problems with perscription narcotics and before this experience i never had any withdrawal effects. Let this be a warning to those of you who also don't react to badly to these substances.\r\nWhen I went back to school this past summer, I left all my pills at home because I knew they would distract me from my schoolwork. I didn't have a problem with this at all. It was a very easy trasition.\r\nWhen I returned home for christmas, they were all still there, and I figured what the hell, and started taking them again. About a month later, I was taking the largest doses my body would allow (the acetaminophen being the limiting factor) on a daily basis. As the time to return to school aproached I knew I needed to stop. I started steping down my dose with no adverse effects. Then one day I stopped totally when I thought it was safe to do so. Obviously it wasn't.\r\nI woke up in the middle of the night and my thoughts were racing and irrational. I knew something was wrong with me but i couldn't tell what. I began pacing back and forth for hours. I began panicing because I could tell I was dillusional. This was the first panic attack i have ever had.\r\nThe dementia lasted for about three days, and anything that would cause even a tiny ammount of stress caused me to have a panic attack. I could not sit down for the first two days. I couldn't be alone or in the dark or watch TV or read. My dillusional mind would become obsessed with the source of the fear or stress. My perception of time was also skewed. It felt as if everything took huge ammounts of time and the experiance felt like it lasted 3 weeks instead of three days. However, I would look at the clock occationally and realise that I had lost entire hours at a time. I have amnesia about many of the details of those three days.\r\nI was also unable to eat for about 5 days. All I could stomach then was rice and applesauce. Only now, seven days after I stopped taking drugs do I feel normal in any way.\r\nI thought I was safe with these drugs. I thought these sort of withdrawal symptoms only happened to hardcore users and heroin adicts. I feel as if I have lost something forever now. I will never be totally the same after this experience. It was the most hellish thing in my life to this point.\n\n\n"
}
