{
 "title": "No Parking",
 "author": "Ak57",
 "citation": "   Ak57. \"No Parking: experience with DOB (ID 45774)\". Erowid.org. Jun 11, 2006. erowid.org/exp/45774",
 "substance": "DOB",
 "bodyweight": "9.5 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "DOB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45774",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2006",
   "Views: 7220",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having attended the glade festival (uk) we dragged back a few friends and associates for an evening of lunacy in our home town. A friend of mine had been given a bottle of DOB as part of a larger arrangement and none of us had tried it before.</p><p>Still, the guy who'd given it to us was adamant that it was the dog's bollocks so we thought we'd give it shot. We all had a drop each. It must have been early evening as it was definitely still light and I didn't really notice any effect for quite a while. The first signs were the sort of 'coming up' feeling that I'd get from mushrooms with a little speedy jitteriness. This went on for quite a while until someone suggested maybe another drop was in order. </p><p>After that things got a bit more surreal. It was definitely a very speedy high and the second drop and the darkness that was falling gave it a much more acid feel. Very colorful and kind of like an old 8mm cine camera. As the evening progressed conversations became more confused (lots of us all talking at once) and the decision was made to go for a walk. We headed to a local park and the darkness in the wood really did send us all into lunacy. I think we had another drop but it's had to tell. Everything was happening in a sort of stop-start reality. How log we were at the park I cannot say. </p><p>The walk home (eventually) was really very odd. Im certain we got lost and it is probably a miracle we weren't arrested as one of our members had a police traffic cone on his head and was attacking cars (moving or otherwise) with a long plastic stick with a 'no parking sign' on the end whilst - oddly enough - screaming 'NO PARKING' at anyone (or anything) that would listen. I think someone still has pictures of this somewhere although again it's surprising that anyone could operate the camera. When we finally got back it was getting light and the dawn did kind of kill the trippy edge to it all. </p><p>Sleep was still totally impossible and I wouldn't have minded some valium at around this point. I wouldnt say it was unpleasant but after the extreme 'trip' it seemed very strange that the sun was coming up and it was all over. It was on the other hand unpleasant that I chose to go and sleep in the back of my van full of lumpy junk, especially considering I had to be at work that day (irresponsible?). I think I had about twenty minutes sleep all in all and was sent home from work almost immediately (thank god for understanding bosses). When I got back home it must have been around 10.30am which must have been about 14 hours after the first drop and I fell to sleep almost immediately until around 3 in the afternoon. Id love to give this another go; unfortunately we lost the bottle though.</p>"
}
