{
 "title": "Poisoned",
 "author": "Chris",
 "citation": "   Chris. \"Poisoned: experience with Calamus (ID 45781)\". Erowid.org. Mar 7, 2007. erowid.org/exp/45781",
 "substance": "Calamus",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "7 in",
   "oral",
   "Calamus",
   "(roots)"
  ]
 ],
 "footer": [
  [
   "2005",
   "45781",
   "Male",
   " ",
   "Not Given",
   "Mar 7, 2007",
   "8148",
   " "
  ]
 ],
 "report": "<p>I ordered some calamus root from an online herbal shop. Worst idea ever. I remember reading that if you chew 2in of the root, you will experience stimulation. I tried it, and felt a little more upbeat. Then a few weeks later, (yesterday) I wanted to 'trip-out' from it. I have done weed, alc, dxm, methadone, demerol, soma, salvia, and nitrous. </p><p>4:00pm I chewed and swallowed about 7 inches of the dried root, which tasted spicy and bitter. I also took some tums with it to ease any heartburn that might follow. I went to the mall and two hours later I still wasn't feeling anything. </p><p>6:00pm I said screw this and got some panda express. 10 min later it started my whole stomach turned upside-down. I ran to the bathroom where i puked up a crap load of food, and calamus root. Soon after every 10-15 min i puked again. I puked in the parking lot, then got a ride home. As soon as I got home, I ran to the bathroom, where i stayed for a while. </p><p>7:00pm NOthing more is coming out, just lots of dry heaves every 15 min.</p><p>8:00pm  I leave my bathroom finally and go lie down.</p><p>9:00pm  Thinking I am going to die, now a very bitter foam like substance is coming out..</p><p>10:00pm  I have a suppository from when I had the flu really bad, the puking stops finally.</p><p>11:30pm I fall asleep still feeling like shit.</p><p>4:00am  I wake up and feel completely normal again.</p><p>I reallly dont recomend this shit to anyone, its not worth it. I didnt even get high, and i missed out on a crazy party because of this shit. I say we all stick to weed and alc.</p>"
}
