{
 "title": "Amplified Daydreams",
 "author": "Windchild",
 "citation": "Citation:   Windchild. \"Amplified Daydreams: experience with Syrian Rue, A. peregrina & Dimenhydrinate (ID 45799)\". Erowid.org. Dec 23, 2005. erowid.org/exp/45799",
 "substance": "Syrian Rue, A. peregrina & Dimenhydrinate",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   " ",
   "3.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   " ",
   "4 seeds",
   "oral",
   "Anadenanthera peregrina",
   "(ground / crushed)",
   " ",
   "  ",
   "oral",
   "Anadenanthera peregrina",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45799",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 23, 2005",
   "Views: 9082",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDuring an ongoing series of Ayahuasca Experiments I decided to use Dramamine to alleviate the typical nausea. I'm identifying Dramamine with Dimenhydrinate.\r\nI ingested the dramamine pill (50 mg), prepared the harmala (grinding ~3g, putting it in capsules), and ingested it too, capsule for capsule, 30 min-60 min after the experience. I experienced a quite noticeable, specific drowsiness, which I attributed to the Dramamine.\r\nI ingested 4 Yopo ground seeds for getting DMT effects.\r\nBefore the DMT really kicked in, i got sick and vomited, so that what followed was rather a slight DMT trip, together with a very subtle Dramamine trip (which appeared to be much amplified). After vomiting, i chilled out on the couch and enjoyed the DMT trip, which turned out to be quite noticeable. I still felt very very drowsy, unable to get up and do meaningful stuff. I did not have pupil dilation though.\r\nThe thing why I write this was a very different beast though.\r\nDuring chillout, I ended up in a dozy state from which I had some effects in the dozy/daydream/nap/'paver nocturnis' range, which were much more pronounced and complicated than any daydream i ever had, though. For example, I dreamed typing my trip log. a 5 pm entry. this daydream was completely authentic, and partly lucid, and I snapped out of it thinking 'wtf its only 2 pm'. Others were not as dreamy, just normal thoughts, that suddenly became visual and had a got a life on their own.\r\nI'd love to attribute this to the DMT, but I've never had such a dozy/daydreaming/confused state on any other tryptamine or tryptamine+MAOI setting, and I've had quite a few. When i got up and did stuff (halfway not wanting to really fall asleep, halfway pissed by the low DMT trip), I could ignore the effect completely.\r\nI re-dosed DMT and it turned out to be quite a pleasant trip on a wonderful day.\r\nI'm very glad that I had this experience. It'd be insane to do a full-blown trip on this alone, though, and still a little insane to do so with a sitter.\n\n\n"
}