{
 "title": "No Distinct Ending Or Begining",
 "author": "Strangewurkah",
 "citation": "Citation:   Strangewurkah. \"No Distinct Ending Or Begining: experience with DOC, 2C-I & Alprazolam (ID 45811)\". Erowid.org. Sep 5, 2005. erowid.org/exp/45811",
 "substance": "DOC, 2C-I & Alprazolam",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 mg",
   "oral",
   "DOC",
   "(capsule)",
   "  T+ 6:00",
   "25 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 13:00",
   "2.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45811",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 5, 2005",
   "Views: 16676",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI would like to start by saying that I swallowed the DOC capsule at about 10:00PM.  It took nearly an hour and a half to begin to feel the effects. It was certainly not what I expected. It was almost not visual at all, and that would normally steer people away from trying it, but the physical sensation was very strong, very distinct, and quite unique.  \r\nBy the three hour point I was definetely feeling the drug. I would draw a comparison to this drug with MDMA. Although the emotional side is much less intense the physical reaction is quite similar to MDMA. The visual distortions were even somewhat similar. It really is like blowiing up on MDMA, but only longer, and without alot of the negative mental and physical effects. By about hour six into the experience I was beginnging to get bored.  I then ingested around 25 mg of 2C-I. The 2C-I took effect much faster than normal, and was extremely visual. This makes me think that possibly DOC could have an MDMA like effect on the receptor site doubling or possibly tripling the effect of the psychedelic. \r\nMy 2C-I experience was no better or no worse than any of my others (some of which are posted on this site), but it had no definition. What I mean by this is there was not distinct beginning or ending to the trip, but I was certainly in inner space the whole time. I have done alot of 2C-I, and find no reason to explain much more about it in this report. It was nearly 1:00 PM the next day when I began to feel tired, but still wired. That might not make too much sense to most, but with 2C-I it does. So I ate a bar of xanax to calm myself down.  At this point the DOC effect had diminished to nearly nothing, and the 2C-I was tapering as well, but the xanax pretty much aborted them both anyway, and I went to sleep.\n\n\n"
}