{
 "title": "Way Too Much",
 "author": "Gumby",
 "citation": "   Gumby. \"Way Too Much: experience with LSD (ID 4592)\". Erowid.org. Dec 28, 2001. erowid.org/exp/4592",
 "substance": "LSD",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "8 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "4592",
   "Male",
   " ",
   "Not Given",
   "Dec 28, 2001",
   "6856",
   " "
  ]
 ],
 "report": "<p>\nIt had been about 8 or 9 months since my last trip, and during that time I was constantly looking for acid.  Finally, about 2 or 3 weeks ago a shitload of what I would find to be VERY strong acid came through town.  So my friend A called me up and asked if I wanted to buy some and trip with him the next day.  I, of course, agreed and we put our money together and purchased about 15 hits.  </p><p>The next day, I went over to his house at about 10:00 AM and we ended up dropping at about 10:30 after his mom left for work.  Right after we dropped we started to clear his room of anything that might scare us into a bad trip.  After that we started listening to some music.  </p><p>Suprisingly, I could feel it start to come on about 20 minutes after dropping.  I was feeling giggly and lightheaded.  We went into his living room and watched the ceiling wave and the streams of color flow through it.  A few minutes into the ceiling watching our friend J called and said he was going to come over and fuck with us.  This is when it gets a little fuzzy.  Altough I was already tripping hard I could still feel it coming on stronger.  Before J got there we went back to A's room and chilled.  That is my last fully clear memory of the trip, but I also remember a few scattered things.</p><p>I remember J being in the room and laying on A's bed when J informs us that A's dad just got home.  It was hard for me to understand what was going on, because I would see like a few little frames of what was happening, then I would fall into my trip, and then I would come back out and see a few more frames like time had completely stopped while I was in my deep trip.  The next thing I remember is A begging J to take him to the hospital.  Then I remember being outside and running around in A's front yard into bushes and stuff.  Then I remember J holding onto me and I asked him if he was really J.  He then asked me who I was and I told him I was my drug dealer N.  Then I remember being on a porch swing and seeing the real N, some girl, some guy, and A naked in the backseat of a car.  At the time I thought that these were all hallucinations, but I later found out that they were all real.  Then we went in N's house and I came down at about 6 or 7 PM.</p><p>During my trip I thought that all of these things were a dream.  There was even a period between running in A's front yard and sitting in the swing where J took me to his friend's house and I played with Christmas lights and could only say 'Whoa' and 'What?' that I don't remember at all.  I later learned that I had eaten 8 hits of what was said to be REALLY good acid.  A also neglected to mention that the dude he bought it from said we shouldn't take more than two.  This experience taught me that LSD is way more powerful than I thought and to respect it.  A has sworn off acid for good, I however will probably continue to explore my mind, but at much lower dosages.</p>"
}
