{
 "title": "Mix It Up",
 "author": "DoorOfPerception",
 "citation": "   DoorOfPerception. \"Mix It Up: experience with Alcohol, Cannabis, DXM, Valerian & Melatonin (ID 45970)\". Erowid.org. Dec 3, 2008. erowid.org/exp/45970",
 "substance": "Alcohol, Cannabis, DXM, Valerian & Melatonin",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1.35 g",
   "oral",
   "Valerian",
   "(capsule)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "35 mg",
   "oral",
   "DXM",
   "(liquid)",
   " ",
   "3.0 mg",
   "oral",
   "Melatonin",
   " ",
   " ",
   "5 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45970",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 3, 2008",
   "Views: 13664",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off, I'm very experienced with many psychoavtives, including cannabis, LSA, diazepam, oxazempam, amphetamines, cocaine, nitrous, DXM, alprazolam, codeine, hydrocodone, nicotine, sertreline, dextroamphetamine, zolpidem tartrate, oxycodone, salvia, etc. </p><p>I awoke one Saturday morning and decided that my house work would be more enjoyable if intoxication came into the picture. Within rapid succession of each other I consumed three 450mg Valerian capsules, smoked a huge bowl in my water pipe, swallowed only 35mg DXM, 3mg melatonin, and 5 beers, all on a totally empty stomach, as I dosed before breakfast. I couldn't have much DXM because the only syrup I had also contained guafenisin.</p><p>T=+1.00:00- Put on some ambient tunes and lounged on the couch. I have begun to get heavy audio hallucinations. I hear a marble rolling down a track, a bird singing right behind my ear. When I close my eyes my body seems to swim forward at incredibly high speeds. My linear memory is smashed to pieces as all of the other substances amplify and are amplified by the cannabis. An intense feeling of peace and tranquility has now taken over me, and I'm off to listen to more music.</p><p>T+1.20:02- I just had something to type, and then I promptly forgot what it was. The high is still coming up, so I imagine the peak will be intense.</p><p>T=+2.25:03- My high has peaked. I have now achieved tacticle and visual hallucinations. For example, a red car keeps appearing in my driveway. As I double take back to get a better look, the car is gone. [The squemish be warned] Unfortuanately I have had one major problem. Drinking and taking valerian capsules on a completely empty stomach apparently isn't good for you, as I just deficated what I could swear was urine. But coming out of the wrong place. Hopefully I'll be okay on my come down.</p><p>Conclusion: Wow, I was pretty incoherent during my writing, so I must apologize. Overall, the experience was very long (6 to 6 and a half hours), and had the same characteristics as drinking and smoking weed together, only more amplified and relaxed, with more frequent and realistic hallucinations. I would recommend this combination to any responsible person who is well experienced with psychoactives. Also note that there is a slight hangover the next day. Nothing a tylenol and a shower can't fix, however :)</p>"
}
