{
 "title": "Not Terrifying In The Slightest",
 "author": "Haeldoran",
 "citation": "   Haeldoran. \"Not Terrifying In The Slightest: experience with Mushrooms (ID 45978)\". Erowid.org. Mar 15, 2007. erowid.org/exp/45978",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 45978",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 15, 2007",
   "Views: 3775",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA friend of mine was on leave from the US Army for Labor day. It is rare that we get to enjoy his company anymore, and since he extremely dislikes military life, he asked a colleague of mine to obtain some magic mushrooms, as he had never done them before. Seeing as he and I have been through a great deal together, I agreed to try the mushrooms with him.\r\nAround 10:15pm I arrived at the location of the party, settled in with my friends and the others who had decided to join us. Much beer and Captain Morgan was drifting about, but as it was Labor Day weekend and the police were out in full force, I decided not to drink.\r\nThe mushrooms were in chocloate form, each piece of chocolate containing about 2 grams of mushroom each. About 10:45pm I decided to eat half a piece of chocolate. Everything was straight for about 20 minutes.\r\nAbout 11:05pm I became extremely euphoric and very hyper. I was bouncing around, smiling, laughing, just so pleased to see my good friend safe and in high spirits, like we used to be in high school. Which, might I add was only two years ago. I was being so incredibly social and friendly with everyone, including the two people I did not know and that is very odd for me because I normally paranoid in social situations.\r\nAnother twenty minutes have passed and now the time is 11:25pm, by this point I have become somewhat cold and very restless, I had to be up and about, talking and joking with everyone as I was just not content to sit in one of my host's very comfortable chairs and enjoy an episode of South Park. I was moving around so much, and there were so many thoughts racing through my head that for a moment I became quite exhausted and breathing became very labored, almost as if I was under the influence of an opiate. I remember having some difficulty swallowing due to dry mouth, and my ears seemed to pop somewhat, but a cigarette and a nice glass of water fixed that easily.\r\nI continued to walk (read: float) around the room, but now I had entered into fits of uncontrollable laughter in which my friends quoted me 'If that fucking Burger King ever shows up in my bed, I'm going to kick his ass!' I began chain-smoking cigarettes and was able to feel somewhat of a close mental rapport with my host's dog. Might I also add that the inevitable happened and I found a toy lightsabre, complete with sound efects and flashing green lights. I went to town with that in the hallway for a good 10 minutes, until someone took a picture of me and I became distracted with my friends again.\r\nAround midnight I noticed somewhat of an elongated aura around lights and the television screen. I do not know whether this was due to the excessive amount of smoke which was permeating the air, or a very subtle visual effect from the psilocybin. We had turned most of the lights out and were just talking amongst each other, enjoying our trip. My host and my soldier friend were quite obviously having a trip at this point, as they kept reffering to me as the 'Litte fucking demon in black'. I however, became very sedated at this point, and had an ever so slight body buzz going on, again, almost like unto an opiate. I also noticed alot of peripheral hallucinations of movement coming from drapes and other inanimate objects, but it was nothing too intense.\r\nThese effects continued on until about 1:30am at which time they gradually became more and more subtle, until the vanished completely. I drove my car home at 3:00am feeling dead sober and not experiencing any other effects aside from about hour of sleeplessness, possibly due to overstimulation.\r\nAll in all, I could compare my initial outing with magic mushrooms/psylocibin to a mixture of the stimulant/euphoriant properties of Cocaine as well as the subtle visual effects of marijuana, but without the negative effects of the respective 'crashes'. \r\nI enjoyed the magic mushrooms, and  I may eventually use them again someday for a relaxed social situation.I do not think I would alter my dosage for my next experience, as I was completely happy with my experience.\n\n\n"
}
