{
 "title": "I Want Their Windshield Wipers",
 "author": "Anonymous",
 "citation": "   Anonymous. \"I Want Their Windshield Wipers: experience with Datura (ID 45977)\". Erowid.org. Aug 27, 2006. erowid.org/exp/45977",
 "substance": "Datura",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 45977",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2006",
   "Views: 7763",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm pretty experienced when it comes to mind altering substances (drugs), and I see a positive side to even the most seemingly pointless ones. Except Datura! I have done it twice. Both times were unpleasant and dangerous, with very noticeable health problems coming from it.</p><p>The first time, I ate all the seeds from one pod (about 250). I dont remember it kicking in. I remember eating them, then wondering if it was even going to work while smoking a cigarette on the couch. I remember brief segments of the experience. I remember smoking some bud and getting extremely bad cotton mouth, forcing my throat to close up making it hard to breathe. I remember smoking a cigarette, looking closer at it, and having it disappear (it was imaginary). Finally, I remember passing out next to my friend having a hard time breathing still.</p><p>The second time I did it, I ate 300+ seeds at a rave and ended up in the parking lot pulling windshield wipers off of cars to collect them or something (so my friends tell me). I was a danger to myself and my friends all had to restrain me and keep me in their car. My friend told me I turned blue in my face and acted like I couldnt breathe. I actually remember that and it scares me a lot to think I almost died. The same restriction of breathing happened the first time, but to a lesser extent.</p><p>Thats all I remember from the two times I tried this substance. Neither experience was fun, and both were very dangerous. I couldn't see well for about a week afterwards and reading was impossible.</p>"
}
