{
 "title": "Never Underestimate the Power of LSD",
 "author": "Moondog",
 "citation": "   Moondog. \"Never Underestimate the Power of LSD: experience with LSD (ID 4600)\". Erowid.org. Jan 15, 2001. erowid.org/exp/4600",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 4600",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 15, 2001",
   "Views: 9695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThe day started off as any normal day.  I got up and knew before hand that I would drop acid this day.  I had recently made a decision to stop smoking weed, and I thought a little LSD would give the introspection I needed to understand why I had to stop smoking.  \r\n12:30: After calling the supplier met up with him in town.  The supplier was with a friend and she showed me what they had.  She was cutiing the pieces with some scissors.  She handed me two little pieces that were about the size of 2/3 of a normal tab.  I asked her if she was serious and she then told me that they had intended to buy a vial, but instead the guy soaked up all the acid from inside where it was made onto three pieces of paper.  Having known her a while, I believed her and went home.\r\n1:00: I decide to go on a hike up a creek by my house.  It would take  me to the top of a hill which I thought would be fun to look at. I dropped both hits and started walking.  I had a video camera, two Red Bulls, and a mind starting to expand.\r\n1:45: Drink one Red Bull,resume hiking.  I'm getting the pre-trip feeling.  Hope Red Bull will help me out.  \r\n2:30: Acid had taken over.  I am on an outlook on top of the hill.  I watch the town below undulate and contort.  The distant clouds look like I could touch them if I wanted. Pulled out video camera and started to film.  \r\n3:15: I'm at top of hill.  If I dont concentraight on my thoughts they will wander off on tangents.  I start to get paranoid that I was in Mountain Lion teritory and if one was to get me, no one would know.  I start back home.\r\n3:45: Before going home I sit on a rock and meditate on things, in general.  Then I go home.  No one is there so I'm cool.  I watch Dark City and it blows my mind.  I relate it to everyday life.  I get lost in it and when it is over I feel sad.  Now the hallucinations are everywhere and I feel like I'm in a kaleidescope.  I turn on VH1 and watch the 100 greatest Rock and Roll Artists.  I have a paranoid thought that maybe all old 70's bands did acid and got to the same level of tripping as I am in right now.  I start to appreciate all the artists I see and other things about them.\r\n4:45: Totally lost now, this stuff took me over.  Every thought I have turns into a vison. I ponder running to the beach, which is foutyr miles away.  Seriouslly.  Sanity comes back and I meelow out.  Start having real visions.  Like being in a dream while awake.  \r\n6:45: Mellow now.  Hallucinations have stopped.  Stll freaked out about the visions.  Am in awe the rest of the day.\r\nThe moral of this story is NEVER UNDERESTIMATE THE POWER OF LSD.  Once you do your fucked.  If i had been in public, I would have been arrested.  I totally lost contact with reality for about an hour.  Now, I am going to stay away from LSD.  To all you new, eager acid heads out there, beware.  What I thought was a joke of a dose turned into the most powerfull trip of my life.\n\n\n"
}
