{
 "title": "And I'm Buzzzzzzing",
 "author": "Tree Fingers 171",
 "citation": "Citation:   Tree Fingers 171. \"And I'm Buzzzzzzing: experience with Cocaine & Various (ID 46048)\". Erowid.org. Dec 20, 2007. erowid.org/exp/46048",
 "substance": "Cocaine & Various",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46048",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 20, 2007",
   "Views: 10395",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThough my stint with cocaine was shortlived, it nonetheless had a mind-numbing, empowering effect on me that kept me captivated until I plain ran out of money. I've experienced numerous drugs, including mushrooms, ecstacy, salvia, amphetamines. But nothing quite like the raw, addictive feel to coke.\r\nMy week-long marriage to blow began with a simple nudge in the right (or wrong?) direction from a good friend of mine. I was at a party, a little high, severely drunk, and though my sober self would have completely denied the white powder, I gave in easily to the suggestion at trying my first line. As my friend chopped up the white stuff into two seperate lines about half my pinky-size, I very haphazardly second-guessed myself, but the seductive quality of attempting a drug so 'dirty' got the best of me. I leaned over the table, stuck a $20 into my right nostril, and insuffulated. Sucked in a little too hard, a little too quick, and then smiled, stupidly.\r\nAfter a minute or so, I remember saying 'I don't really know what the big deal...' and then felt a rush of energy run up and down my body, ignoring the numb quality of my tounge and throat, and immediately felt empowered, ready for action, movement, anything to get me going and get me somewhere fast. I breathed in deeper, tapped my toes, flickered my tounge, held minute-long conversations that went in too deep for summary. I felt cool, I felt suave, I felt like I knew what it was about. This feeling carried on for about 15-20 minutes when a nagging sense that I should do more popped into my neural trainwreck of a brain. I tapped my friend on the shoulder and pleaded with him, and he caved.\r\nHe poured the powder, chopped, seperated, and I inhaled, smiled, and sniffed. Another rush momentarily, though not quite as fast, or satisfying. I wanted more. And more. And my friend began to say he was afraid of me. 'I don't like you like this, you're bossy, and you seem addicted already.' I brushed it off, said it was the alcohol. I remembered later to tell myself to listen to my friends.\r\nWhen I couldn't find more the next day, I called around to distant drug dealers I shouldn't have played with. I finally reached one who ripped me off by $20, but I, being a newbie, knew no better. I did 4 lines in a row right before going to bed, and ended up with 9 or 10 pages of brain droppings that carried me into the early hours before I had to head off to school. I awoke with a mild hangover, slightly nauseous, but happy that I had two lines left. I brought the coke to school, made like a teen angst movie and snorted lines off the toilet seat before Chemistry, and moved on through my day, happily answering questions and hoping for more of an after school special.\r\nI called the dealer again, bought twice the amount I'd bought previously, and snorted all of it. I was crazy numb, and though the experience was absolutely a rush of power and praise, my heart gave me a jumpstart to reality. I realized I was flushed, red, moving too quickly for comfort, and still wanting more. I even borrowed $60 dollars from a friend to buy another couple lines, which I snorted again in school the next day. I made a habit of this, borrowing money, snorting coke, out of school and in, and buying more. For the entirety of 6 days, until I had run out of $360 dollars and when even the dealer, who most likely just didn't want a dead girl on his conscious, refused to sell me any more.\r\nAnd boy, was I heartbroken. I screamed at friends, cursed at the dealer, called around even more desperately for coke and even went into the back alleys of a nearby town hoping to meet a junkie or someone who could give me the 411. After a day of trying this, and skipping school for it, I resigned into a slumber of depression. I kept up my search for the next two days, with no luck, until I started to feel like I'd been hit by a train. I started shivering, getting real nauseous, and having flu-like symptoms for about 3 days, until I realized it was none other than withdrawal. After experiencing that hell, though the craving was still there, I decided to monitor myself and cut myself off from the coke world, at least for the time being.\r\nMy time with coke was fun, pleasant---for me. For my friends, school work, and body, it was hell. I would only recommend coke for someone sans addictive personality. If easily excited, coke is not for you. I was lucky, I had no money to pay for coke and a very rare, caring dealer on my hands. Hopefully, I will never be wanting snow again, but if the time comes, I will know my limits and have my friends to watch my back.\n\n\n"
}