{
 "title": "Not Sure About This Whole Thing",
 "author": "April",
 "citation": "   April. \"Not Sure About This Whole Thing: experience with Nutmeg (ID 4604)\". Erowid.org. Dec 27, 2001. erowid.org/exp/4604",
 "substance": "Nutmeg",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "6 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4604",
   "Female",
   " ",
   "Not Given",
   "Dec 27, 2001",
   "Views: 9027",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nDuring the Christmas holidays I decided to try something new.</p><p>My boyfriend (we'll call him B) and I went to the local health food store and purchased 12 whole nutmeg nuts (2 ounces). In a recipe I found it said to grind the nuts in a coffee grinder, but they didn't fit! So, I did the best I could by hand. Then I emptied out a few tea bags and refilled them with the fine nutmeg dust I had created. Then I stitched them up and placed them in 3 cups of water to simmer for 1 hour.</p><p>The task of getting the steamy liquid down my throat was extremely underestimated in my mind. It isn't the best tasting thing in the world and it can not be masked with anything sweet.</p><p>After the hard and nauseating part was over it was time to sit back and hope that it works. B said he felt 'giggly stoned' but I still felt nothing. It had been a good 45 minutes and the disappointment was starting to kick in.</p><p>Two hours later B had to work, so I went home and sat around for a few hours.</p><p>Seven hours after I had ingested the nutmeg tea B was off work and we were cuddling on the couch, he had fallen asleep. Out of nowhere I said to him, 'So, 11 minutes??' He looked at me extremely confused. I had daydreamed or had a nutmeg trip that I asked him how much longer until he had to go home. He looked down at his watch and I looked at it too and it said 11 minutes to 1 am. Then out loud I must have said, 'So, 11 minutes??'</p><p>It turns out he has never worn a watch. I thought that that experience was kind of neat. Over the next 3 days I had a few more of these. I feel that they have made me more aware of my spiritual and physical being. Now when I smoke cannabis I can tell exactly what is happening to my mind and body.</p><p>Overall, the experience was nowhere near worth the effort put towards finding, making and drinking the nutmeg.</p><p>The effects were minimal and included some slightly unpleasant side effects. I don't think Ill do it again.</p><p>Thank you for listening and Id just like to thank all of those people who have submitted their experiences and deepest thoughts with the world.</p>"
}
