{
 "title": "The Other Use",
 "author": "Goatkiller",
 "citation": "   Goatkiller. \"The Other Use: experience with Amitriptyline (Elavil) (ID 46066)\". Erowid.org. Jun 16, 2007. erowid.org/exp/46066",
 "substance": "Amitriptyline (Elavil)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 46066",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 23945",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Earlier this summer, I discovered that the pain in my neck and arms was from more than just tense muscles; I have a herniated disk in my neck, pressing directly against the spinal cord.  One of the side effects of pressure on the spinal cord is that all the muscles in my right arm, part of my chest, and recently my right leg are constantly tense.</p><p>The doctor has prescribed me Elavil (Amitriptyline) for the pain.  I was somewhat surprised when I looked this up and found out that it's normally an anti-depressant.  But it does have secondary uses for direct nerve pain like mine.</p><p>I haven't had any serious traumatic issues with it.  Instead, there was a very subtle flattening of emotions, like what I've heard people who take Zoloft and Prozac describe.  Only, I'm not normally depressed.  After a month of feeling distant from my wife, it finally clicked that I'd started feeling that way on exactly the day I started taking the Elavil.  </p><p>Normally, I'm very much in love with my wife, in an almost giddy kind of way.  So when I started feeling not giddy towards her, I assumed that it was because I was mad at her for something.  (Isn't it amazing how we can convince ourselves of things?)  So I started harboring this pain and anger at her for whatever it was she'd done, which made things worse.</p><p>Once I'd figured out the coincidence of timing, and realized that I had no reason at all to be mad at her, it all cleared up.  I feel a little bit less intense now, but I know in my heart that it's the drugs, and so I'm not worried.  I'm just glad that this is only a pain management thing until the surgery can actually correct the problem.</p><p>Lessons learned:</p><p>* Pay attention to what Im feeling, and why.  It's entirely possible that I've talked myself into a feeling based on an assumption that just isn't true.</p><p>* I have a lot more empathy for people who suffer from depression.  If being in that head space is preferable to where they were before getting on medication, I certainly don't want to find out what it's like.</p>"
}
