{
 "title": "Done for Life",
 "author": "Mark",
 "citation": "   Mark. \"Done for Life: experience with DXM & Paroxetine (ID 46134)\". Erowid.org. Mar 1, 2006. erowid.org/exp/46134",
 "substance": "DXM & Paroxetine",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "1065 mg",
   "oral",
   "DXM",
   "(liquid)",
   " ",
   "  ",
   " ",
   "Pharms - Paroxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 46134",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 1, 2006",
   "Views: 5180",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was taking Paxil for like three days and was bored and was online.  Read about Robitussen and how it can make you go on some kind of trip.  I've done all other drugs before that and was interested in it.  So I bought the robitussen and drank it all (12 oz). <br>This is not meant to tell people that I had fun or what my trip was like.  Cause it was hell.  Something snapped in my head and broke.  And thats for real.  I have something majorly wrong inside my brain in the back on the left side.  I thought it was nothing for a long time.  Im messed up for life.  Im not myself and its serious.  <br>I of all people never thought something like this would happen to me.  I'm past any  help I can get from anyone.  Im over, finished.  I had like a minor heart attack/stroke because of it and Im only 22 years old.  All my feelings are all over the place and anything that you can think of is not normal.  Im in hell but I've learned to deal with it. I dont want anyone to go through what Im going through.  Its so stupid to think that if I didn't just do that stupid thing I could be a normal happy kid.  And if someone thinks they are not happy now cause they still do drugs or they are struggling...  Let me tell you, wait till your mind comes out of any drug haze. <br>Im really really messed up and I think clearly but something is wrong in my brain theres a glitch.  That Robitussen is not meant for people to drink the whole bottle... Just stay the hell away thats it.  Take this seriously and have a good freaking life.\n\n\n"
}
