{
 "title": "Left Me Feeling Indifferently",
 "author": "Agean Moss",
 "citation": " Agean Moss. \"Left Me Feeling Indifferently: experience with Kratom (ID 46142)\". Erowid.org. Oct 21, 2005. erowid.org/exp/46142",
 "substance": "Kratom",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "11.5 g",
   "oral",
   "Kratom",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46142",
   "Male",
   "",
   "Not Given",
   "Oct 21, 2005",
   "25109",
   " "
  ]
 ],
 "report": "<p>T= 7:30 PM</p><p>Mindset and setting:  Psychologically healthy and happy.  Comfortable, soulful apartment dwelling with all needs met.</p><p>Preparation:  Powdered Kratom mixed into cold water and consumed</p><p>Other meds: None</p><p>T + 0:30  Quick onset from baseline.  Initial effects: euphoric, rolling feeling with physical effects like MDMA (but no similar psychological effects).  Chatty, and happy.</p><p>T + 0:45  Laziness in speech otherwise maintaining perfect mental clarity.  Conversation requires considerable effort so resort to relaxing quietly, nausea setting in.</p><p>T + 1:00  Lying on back still, eyes closed to reduce nausea.  Dreamy like feeling which is pleasant, but overshadowed by nausea.</p><p>T + 1:30 Attempted sex with partner (primarily for experimental purposes only, as desire was not there due to drug action).  Sexual responses significantly depressed, difficulty maintaining an erection.  No sexual interest but enjoying touch and intimacy from the perspective of comfort and warmth.  Nausea continues with the slightest bodily motion.  </p><p>T + 2:00 Completely immobilized on floor, listening to music. Considerable nausea whenever I moved.  Music not pleasurable.  Mental clarity neither obstructed nor enhanced.  Mood indifferent.  Attempts to walk uncomfortable due to nausea and dizziness.  Slipping in and out of light sleep, mostly awake and indifferent.  No desire to socialize.</p><p>T + 2:30 Try eating ice cream, which is one of my favorite things to do.  No enjoyment, indifferent to taste.  Decide to go to bed, as nothing productive is happening.  </p><p>Sleeping: Sleep is very comfortable, long and deep at times, with occasional but pleasant waking during the night.  Sporadic mild bodily itching (although not intense or overly bothersome), in all warm spots of body, crotch, behind knees and elbows, neck and head.</p><p>T + 12:00 Upon waking, hangover much like alcohol.  Headache, shakes, fatigue, nausea.  Still feel high, dizzy, disoriented, hot, and itching all over the body continues, but mild.  No rash or hives.</p><p>T + 16:00 Still hungover but mild.  Disoriented with low energy.</p><p>Summary:  My girlfriend had a similar experience this evening with 10.5 g at 135 lbs. but it was not overshadowed so much by the nausea as she experienced much less.  She too experienced bodily itching throughout the night, which is interesting.  We agreed that while vaguely pleasurable, and comparable to an opiate high like codeine, it produced little pleasure other than a dreamy state.  Very antisocial drug, and poor for productivity.  No noted mental benefits.  Would not consider doing again, or at least not at this dose, and particularly for the cost $1.00/g.</p>"
}
