{
 "title": "More Depressed Than Ever",
 "author": "Moe",
 "citation": "   Moe. \"More Depressed Than Ever: experience with DXM & Cannabis (ID 46160)\". Erowid.org. Dec 3, 2008. erowid.org/exp/46160",
 "substance": "DXM & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "DXM",
   "(extract)",
   "  T+ 1:00",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46160",
   "Male",
   " ",
   "Not Given",
   "Dec 3, 2008",
   "Views: 14747",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been feeling more depressed than usual, maybe it was because I was almost out of weed, I'm not really sure.  I had a little plastic tin of sucrets in the drawer.  I once told myself I'd never resort to it, since its side effects are poorly documented, but last night I thought I just had to.</p><p>I had a beer with dinner earlier that evening.  Two hours later at about 9pm, I take the tin of sucrets and microwave it with water tying to make a powder.  2 sucrets were missing from the tin since I had used them earlier, leaving 240mg total, my estimate 200mg made it through the extraction process.  I dumped the water, and had a pink sludge left.  I poured the sludge into some juice and slowly downed it all.</p><p>T+1:00 later I feel like its been 2 hours, I'm so very bored and nothing is happening.  I decide that the DXM is gonna take a while to kick in, so I smoke a bowl.  Maybe a couple more.  </p><p>T+1:30, and this is where everything becomes a little fuzzy.  I start playing some video games, and I was actually having fun, I think.  I was happy, I felt a little drunk, the game seemed a little more real, nothing special.  Then I stopped, tried to watch a movie, got bored.</p><p>And then it hit me.  I'm not sure when, maybe T+2:00.  Everything was terrible, nothing could satisfy me.  My weed munchies had kicked in, mildly, but I hate it.  I feel like I have to eat the food like a chore, to satisfy some whiny little bitch inside of me.  </p><p>Physically, I was very comfortable, I felt like jelly, but I didn't have much time to concentrate on that.  I was so depressed now.  The world became a pain, I felt like I had now lived my entire life and I was ready to die.  Normally, when I smoke a few bowls of weed, I feel like going to sleep an hour or so later.  It was now T+4:00, the height of the depression had kicked in, and there was no way I was sleeping through it, no matter how much weed I smoked.  It lasted until about T+6:00 at which point I fell asleep at 3AM.  </p><p>I woke up the next morning remembering every feeling and emotion I felt the previous night, and it won't go away.  It is now 16 hours since I did the DXM and I've never felt worse, mentally, in my life.</p>"
}
