{
 "title": "Most Incredible Moment in My Life",
 "author": "Floruro",
 "citation": "   Floruro. \"Most Incredible Moment in My Life: experience with Ayahuasca (ID 46163)\". Erowid.org. Sep 21, 2005. erowid.org/exp/46163",
 "substance": "Ayahuasca",
 "bodyweight": "74 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 ml",
   "oral",
   "Ayahuasca",
   "(tea)",
   "  T+ 2:30",
   "125 ml",
   "oral",
   "Ayahuasca",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46163",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 21, 2005",
   "Views: 8819",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI just arrived home from my first Ayahuasca experience, and have to write something since I was blown away. I have been lucky to have been at a Santa Daime ceremony this weekend, where we had a priest, his translator and the priests assistant flown over from Brazil for this event. \r\nThe Ayahuasca brew was brought from Brazil. This specific brew was brought from a tribe in the Amazon of 600 people. I will try and keep the experience short, but I too cannot find words to describe: \r\nAt around 8:00 pm we (around 30 ppl) took our first dose of around 120-130 ml of the brew. The usual upstarts with some purging after a little while, but I didn't have to before around 2 hours after the second dose. Suddenly I started seeing things, and strong visualisations of blocks and barriers and canals being filled up with energy came in my brain. All nervousness disappeared. It felt like I was at home in myself like I never have been before, and the intensity was so powerful I had to giggle a little. \r\nThe first drinking of the brew seemed the start of all my 'unblocking' and connecting in my brain, and getting used to using the energy I visualise to gain access to other areas. 2-3 hours later, we had a second 120-130 ml serving of the brew, and here is where it all took off. \r\nSuddenly the visualisations were mindblowing, and in my mind extreme forces of matter and energy transitioned between each other seamlessly. After this, I started to focus on this pure energy and what it was. I felt it was like something so pure and powerful, and my mind was crunching trying to keep it in check routing it in my mind. Then suddenly I felt something truly astonishing. I felt I was connected with the universal spirit of life. Visually it was like there was intense flowing patterns like a machinery that had been stale (which was me in the spirit form in that dimension. Still trying to process this), that were unfilled, but now suddenly were filled with this amazing energy flow. It was like I had been included in the flow of life and activated. \r\nThis led me on to feel my spirit and I also searched my links in this system to my relatives. This I am also still going through. \r\nAround 2 hours into the second session, I was busy trying to connect to energy flows in the room, testing and seeing how I could be able to find other people and feel their connections (find energy flows). Then out of the blue, the priest started speaking in Brazilian, which was then translated to us. He started saying 'can you feel the spirit of life now coming through', and the reason why this was strange is that at that time my mind was at the exact same 'level' as him, and I soon started feeling this tremendous flow of energy through me. He continued speaking, talking about the truth of life, and that we now are seeking the truth. It was the most intense situation in my life, where the whole universe came to me, and invited me in to see 'them', and flow with them. Be with them. The priest felt like the 'director' of the force that he gave to us. With his words he controlled the flow so that it really pulsated and gave us intense feelings. \r\nI also had some intense space/sky related sessions, where looking at the sky there were 2 stars 'inviting me'. Looking at the sky was like layers of onionskin being peeled off, and I could see 1000 times more in the sky than I ever saw before. I could not look at the sky for long, since my mind wanted me back, and the only way to connect to the stars was through the mind. I sat a good while outside in a crunched position on the ground focusing on this. \r\nI cannot say more right now, since I have to think for a few days. One thing I know is that it has been the most intense and most giving thing I have ever experienced in my life. I feel now like a member of the spirit of life in a true way, and I am so at peace and honoured that nature and Ayahuasca has showed me the true complexity of life. The fusions, energyconnecting and logic has blown me away. This energy has 'lended' me the key to life, and its ancient secrets. \r\nI have never understood or talked like this in my life before, but now I understand that there are no words for this.... I will write more when I have had time to start figuring this out, but I am definitely going to be back at ayahuasca ceremonies to find my truth and explore.\n\n\n"
}
