{
 "title": "What Is Time?",
 "author": "Xyz",
 "citation": "   Xyz. \"What Is Time?: experience with DMT (ID 46184)\". Erowid.org. Jul 14, 2006. erowid.org/exp/46184",
 "substance": "DMT",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "DMT",
   "(freebase)",
   " ",
   "  repeated",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46184",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 14, 2006",
   "Views: 18047",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was not my first experience with DMT. I had combined it with mushrooms a couple of times before and had a wonderful time. We smoked the DMT crystals out of a glass pipe. Two big fat hits to the head. To me it was like multiplying the mushroom effect X10 for about 20 min. However, nothing prepared me for the effect of DMT all by itself. </p><p>It was an afternoon just like any other.  I had not planned on smoking DMT when I went over to my friends house and I was in no way mentally prepared for the journey I was about to take. I had planned an evening of relaxing and watching TV but when I got there my friends had just gone on their first trip and were looking to go again. I was offered the pipe and I thought to myself, what the heck? I really do not know the size of the dose but it was enough for me to take two HUGE hits from the pipe. That's when I went into hyperspace. </p><p>I had an Altoid in my mouth to help with the harsh taste of the smoke. I guess that I forgot I had it in there after I took my second hit because I was completely consumed with the overwhelming fear that I had broken my teeth. I felt the altoid rolling around in my mouth (and chunks of chewed altoid) and I could swear that all of my teeth had broken. I spit everything out and thoroughly checked each and every one of my teeth to make sure they were all still whole. At the same time that this was happening, my whole world had changed. To me it was like I was flying through an out of focus world composed of rainbows and digital neon patterns. The only thing that was in focus was me and my apparently broken teeth. </p><p>At this time my friend could see I was in distress and handed me a glass of water. Suddenly like a wave everything changed again. Now things were more in focus, but the presence of patterns shooting out of the walls was still overbearing. Again I fixated on my teeth and I had to check each and every one again with my finger. After I was thoroughly satisfied that my teeth were not gone (for the second time), Intense hallucinations, which included a complete stranger walking across the living room and into the kitchen (no one was really there) began. I paused for a second and said to myself WTF!!! Am I crazy?! </p><p>This brought on an intense moment of inner reflection where I could not remember where I was or when I was. Had I already come down and was just remembering what had happened? Was I foreseeing the future? Is this all actually happening to me now? What is now? When am I? Where am I? Am I in my friends house or am I in a hotel in Tahoe? </p><p>Confusion ensued for what seemed like an eternity as I tried to reel back in reality. I looked to my friend/sitter for help but, other than the glass of water (which I think saved my life) and his constant reminders for me to breathe, he only added to the confusion. His eyes had turned into pinwheels and were spinning wildly. His mouth had turned cartoon like and I thought he was laughing like the bad guy from Rodger Rabbit. </p><p>The suddenly as quickly as my trip had began it started to end. The world suddenly began to make sense again. The visuals evened out and became understandable. I felt the greatest relief that I had ever known. I was okay. I am sane. I remember now, I took a drug! My teeth are okay!</p><p>The next 10-15 min were like a nice shroom trip and then it was over. I went outside and smoked a number of cigarettes trying to figure out what had just happened to me. I swore that I had been places only the select few ever dream of and that now I have seen it all. The only thing stronger than my fear during the trip was my relief after it was over. I swore that I would never take only DMT again. That was an experience that I needed to have but never needed to repeat. </p><p>It took days to sort out my memories and recollections. I was completely obsessed with DMT for about three days. It dominated my every thought.</p>"
}
