{
 "title": "Relaxing, Much Like Pot",
 "author": "lucky_trio",
 "citation": "   lucky_trio. \"Relaxing, Much Like Pot: experience with Leonotis nepetaefolia (ID 46196)\". Erowid.org. Apr 11, 2006. erowid.org/exp/46196",
 "substance": "Leonotis nepetaefolia",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Leonotis nepetaefolia",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46196",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 11, 2006",
   "Views: 9473",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently tried Leonotis nepataefolia (wild dagga) which I bought off the internet in Australia.</p><p>I've been smoking it at uni and at home, by myself or with friends. I find it approximately half as strong as ground grown marijuana.  I have been having rollies but I bought a pipe to use which is less time-consuming. It's reasonably harsh on the throat, but certainly still smokable.  I did loose my voice a bit, from smoking it.  It kind of strips the lining off my throat and I always have water handy.  A bong would probably be easier but I haven't tried it like that yet. A friend of mine coughs a lot when he smokes it.</p><p>I get pretty relaxed when I smoke it.  I recently had a break up and have found it excellent in soothing my nerves, helps me cope.  I feel giddy and a bit high immeadiately while smoking it and it lasts a couple of hours.  I smoked in the morning and went to uni in the afternoon and I was giggling uncontrollably.</p><p>It smells a fair bit like pot.  I couldn't really smoke it publicly because people sniff and stare.  It doens't make me paranoid like pot does, possibly because it is weaker.  It is also dirt cheap, I got 10 grams for $5 Au dollars, and pot is $20 Au dollars a gram here.</p><p>I've been smoking 2 cones or 2 rollies and that is nice and enough for me.  I think exercise brings it on as well because going for a walk seems to reinvigorate it.  I don't hallucinate or anything on it, but I giggle a fair bit and come across as pretty stoned.  It's hard to concentrate properly at uni if I smoke before class.  It's a depressant.  </p><p>I have been drinking after smoking, which is much the same as drinking after smoking pot.  I feel kinda nauseous but drunk/high at the same time is still good.  </p><p>A relaxing, easy-going high.</p>"
}
