{
 "title": "A Great Mix",
 "author": "Phyllobates",
 "citation": "   Phyllobates. \"A Great Mix: experience with 5-MeO-DiPT, Ecstasy & 2C-B (ID 46193)\". Erowid.org. Sep 22, 2008. erowid.org/exp/46193",
 "substance": "5-MeO-DiPT, Ecstasy & 2C-B",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 mg",
   "oral",
   "5-MeO-DiPT",
   "  T+ 2:00",
   "1 tablet",
   "oral",
   "MDMA",
   "  T+ 5:00",
   "15 mg",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2005",
   "46193",
   "Male",
   " ",
   "Not Given",
   "Sep 22, 2008",
   "4347",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience occured at a large festival this year (2005).  I have done quite a few hallucinogens (LSD on many occasions, mescaline, shrooms, 2-C-T-7, DMT, robotripping, 2-CB previously on two occasions, e on two occasions and foxy once a few nights before), but this was a unique experience.  </p><p>I should also mention that I have been on the anti-depressant/sleep aid Remeron for about a month.  I didn't take my Remeron that night as a 4th psychoactive substance seemed to be pushing things a bit.  I took the foxy first, about two hours before the e.  4 mg of foxy did almost nothing to me (had the same dose two nights before with only slightly more effect).  </p><p>Within half an hour of taking the e I was rolling harder than I ever had before.  Evey step I took seemed to transmit my entire lifeforce into the ground only to be replaced by some much stronger energy force from the earth.  I got a much stronger color enhancement than one might expect from the e alone, infact it was similar to LSD or mescaline (I should note that LSD, mecaline, mushrooms and 2-CB don't give me any visuals beyond color enhancement anymore, but DMT can still give me strong patterns and other visual effects).  </p><p>I experienced the dissolving of boundries between myself and others that you would expect from e, but it was even stronger than in my previous e experiences.  And, as before, physical contact with others was incridibly comforting (not so sexual though).  We took the 2-CB another three hours or so later (nine other people took e with me, I was the only one on foxy), not waiting for basline recovery.  As usual the 2-CB made me feel very positive and made everything fun (had only had it alone, not with e, before), but no visuals beyond colored lights being particularly pleasing.  I ended up talking to one of my campmates at length about relationships, professional issues etc. and was unsually forthcomming about myself.  I do have some memory loss from the night, especially while on the 2-CB.</p><p>Two nights later I took 300 mg of mescaline as the hydrochloride salt dissolved in grape juice.  I have always enjoyed mescaline, but this time I felt completely unable to reason logiacally or to have any emotional response to anything.  I would call it a bad experience, but I as unable to experience 'bad'.  I have been home for a week now and am having trouble getting back into a regular sleep schedule and am having some emotional problems (but I was before anyway, hence the Remeron).</p><p>The combination I described was incredible, but I also believe it could be incredibly bad.  Foxy and 2-CB both have steep dose-responce curves and very different effects on different people.  Ecstasy is more consistant in its positive effects, but in combination with two wildcard substances seems dangerous to me.  Having had such a good experience I might be willing to try it again.</p>"
}
