{
 "title": "Dangerous Combination?",
 "author": "Psychotron",
 "citation": "   Psychotron. \"Dangerous Combination?: experience with Hashish & Sertraline (Zoloft) (ID 4623)\". Erowid.org. Dec 29, 2001. erowid.org/exp/4623",
 "substance": "Hashish & Sertraline (Zoloft)",
 "bodyweight": "69 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "Pharms - Sertraline",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "Pharms - Sertraline",
   "  T+ 7:30",
   "0.33 joints/cigs",
   "smoked",
   "Cannabis - Hash"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4623",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 29, 2001",
   "Views: 27228",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHmmm... how to start this off...</p><p>I never done any hard drugs... in fact, 1999 was the first time I tried any hash.  I used to toke pretty regularly, but I never mixed it with anything.  I had a friend that had access to Zoloft, a drug similar to Prozac.  He told me that if I took a pill and smoked later, I would be in for a trip...  </p><p>Considering myself a 'psychonaut', I agreed to this for experimental purposes.. I was well aware of the risks... I know everything about this...</p><p>12:00pm... I took in a pill from his Zoloft pack... felt nothing at all hours later.  It's 3:00pm... decided to take another.  </p><p>Ok... 6:00pm... two pills of Zoloft already working, although I wasn't aware of it...</p><p>Sometime during that evening me and the ZoloftMan hooked up with our friend, Asshole, and he had a nice J already rolled.  We smoked out, and me bein the hit-hog that I am, I had most of it.  Almost right after I finished takin my hits... it started to occur to me that everything was 10 million times more intense.  </p><p>     We were in an apartment my band uses as a jam room.  I remember walking out of the main room into the hallway, and then blinking and finding myself back in the room, totally seated and everything.  This freaked me out.  I started to tell Z-man about the feelings I was having.  He said he knew everything I was talking about.  He got on the drumset, and each time he kicked the bass drum, I felt a wave of electricity through my body.  This was definitely not a hash high.</p><p>    We left the J-room, and Z-man got me in his car, strapped me in, said 'Close your eyes.... Listen to the music.'  I did... and what a trip.  I could feel the car moving... I felt like I was flying, felt the wind in my hair, on my face.  The music was totally speaking to me.  Z-man was a real close friend of mine... I remember thinking about how I can trust him with everything... he totally had my mind in his hands at this point.  The song 'No Good' by Prodigy came on, and I felt the synths in that song as if they were speaking to me.  I cant describe it.  I was full blown tripping.  Z later told me that my eyes where rolled up and shaking... a sign of the REM state of sleep.  I was totally tripping.  I saw things... and the cool thing is HE was orchestrating everything in my mind... He would tell me and I would see.  Painting in my brain.  It was amazing.  Then He started tapping his fingers on my head to the rythm and 'walking them around my head' like a spider.  I saw water... and every tap of the finger was a splash, and it was all rippling... then I started imagining spiders on my head, so I told him to stop...</p><p>     After, that, 'Poison' came on, and I saw a tunnel... and it was surrounded with musical notes, and they were all spiralling inside the tunnel, like it was a whirlpool, then I saw myself runing into it... It was great.  The car felt like a rollercoaster.</p><p>      I kep tripping my balls off, and then Z man told me to open my eyes for a minute.  I did, and I found that the car was still parked right outside the J room.  It was there the whole time!  He diidn't even move yet!!  Time distortions?  I dont know.  </p><p>     After the ride, he drove me home... and he parked outside my house and waited for me to finish tripping.  It was great.  He didn't try to snap me out of the trance.  He just stopped and waited for me to 'finish'.  I got myself home..... fell asleep... not easily.  Too many thoughts raced through my head.  I woke up feeling great.  Virtually no headache no hangover... But I kep thinking about the trip.  Emotional intensity... it's unbelievable.  </p><p>     In conclusion, I wouldn't really recommend doing this if you don't know what you're doing.  If you do, and can measure the dosage and stuff, then try it... But dont get caried away... I seriously doubt doing that again... No..no... definitely not.  But it WAS the biggest learning experience of my life.  I really learned from it.  And Z-man... When it comes to substances, you're always my man... I know I can trust you with my state of mind.  Thanks.</p><p>'I got the Poison... i got the Remedy!!'</p>"
}
