{
 "title": "Small Dabs",
 "author": "Brick plane",
 "citation": "   Brick plane. \"Small Dabs: experience with bk-MDEA, Methylone, 2-CI, MDMA (Ecstasy) & Inhalants (Nitrates) (ID 46258)\". Erowid.org. Sep 26, 2005. erowid.org/exp/46258",
 "substance": "bk-MDEA, Methylone, 2-CI, MDMA (Ecstasy) & Inhalants (Nitrates)",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "bk-MDEA",
   "(powder / crystals)",
   "  T+ 0:45",
   "25 mg",
   "oral",
   "bk-MDEA",
   "(powder / crystals)",
   "  T+ 0:00",
   "4 hits",
   "inhaled",
   "Inhalants",
   "(powder / crystals)",
   "  T+ 0:00",
   "15 mg",
   "oral",
   "bk-MDEA",
   "(powder / crystals)",
   "  T+ 0:00",
   "80 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 0:00",
   "20 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 0:00",
   "20 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   "  T+ 0:00",
   "35 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46258",
   "Male",
   " ",
   "Not Given",
   "Sep 26, 2005",
   "13380",
   " "
  ]
 ],
 "report": "<p>Subject: </p><p>Male, age 22, 65 kg, Western Europe, student</p><p>Substances:</p><p>bk-MDEA (Ethylone)\t\tapprox. 90 mg\t</p><p>Methylone\t\t\tapprox. 80 mg\t</p><p>2-CI\t\t\t\tapprox. 20 mg</p><p>MDMA (powder)\t\tapprox. 40 mg\t</p><p>Isobutyl nitrate (poppers)\tinhaled 4 times</p><p>Ingestion: </p><p>All consumed orally in the course of four hours by taking on the tongue and swallowing with water. The main dose of 2-CI was rolled up in toilet paper and ingested. Less than 10 mg of MDMA was insufflated. Popper was inhaled, of course.</p><p>Duration:</p><p>Coming up: 2 hours, plateaus and peaks in the next 2.5 hours, long return to baseline in 4 to 5 hours.</p><p>Medications: </p><p>Low dose of Claritin (anti-histamine). </p><p>Five weeks off an SSRI, after halving doses several times over the course of several months. Currently on something herbal. Vegecaps with St. Johns Wort, Siberian Ginseng, Gingko Biloba, Coleus Forskolii; vitamins B3, B6 and folic acid.</p><p>Preparations:</p><p>I drank several cups of tea with anti-oxidant properties and made sure to eat fruits. I had a light meal around 18.00. I did some cleaning, meditating, stretching and light physical exercise before taking a shower. </p><p>Experience:</p><p>At 19.30 I ingested 50 mg of ethylone. 45 minutes later I still felt nothing so I took a 25 mg booster. I noticed a very slight change of perception but I doubted whether it was placebo or real. I tried to attain a breakthrough by inhaling some isobutyl nitrate but it did not seem to do much. During the wait I was at my computer, preparing a play list, surfing and chatting. </p><p>30 minutes later my head was spinning a bit, breathing became more intense and I noticed a feeling around the very top of my head. Some call it the crown chakra or Sahasrara. This crown chakra feeling usually pairs with light euphoria that I can experience on other substances as well. Also, I had to burp lightly which is typical for these research chemicals. From there on I did not keep track of things that much anymore. I went into my other room to meditate and stretch. In the course of the next three hours I took booster doses of ethylone, and small doses of methylone and 2-CI at irregular intervals. Rather than taking them at once, I took them in 4 or 5 times, taking very small dabs of the powder on my tongue each time. A minor dose of MDMA was snorted, a dose of about 10 mg 2-CI was swallowed in toilet paper.</p><p>I had gone back to my computer. Uf dem Anger from Orffs Carmina Burana sounded celestial. Orbital, goa trance and other electronic music all passed by. I have a very broad taste in music and it all sounded good. After 11.30 I turned off my computer because I craved stimulation that was more natural. I stuck my head out the window to inhale the cool night air and to gaze at the stars. The 2-CI was now clearly the predominating substance.</p><p>First clearly distinguishable OEVs: I saw a breathing sky and crystalline webs forming, these looked like those ice crystals on windows. I also experienced double vision and fuzzy vision and I was unable to focus on objects. Later in the trip these latter three would become dominant features. I knew I had to be very careful moving about. </p><p>I snuck outside to walk in the grass barefoot and to stare at the sky some more. It felt so good. There was slight paranoia when I thought someone inside had turned on the lights, but what I saw were the lights that I had turned on and that had been amplified as lights in general seemed brighter. At first I did not know how long I was out there. It turned out to be ten to fifteen minutes. Time seemed to be stretching. I went back in to wash my feet and watch some TV. I thought I saw very small bugs on the stone floor but I knew better. I looked again and they were gone. The pattern of the natural stone was still fascinating, though. </p><p>After 01.00 I decided to live out the rest of my trip in my bed. I closed my eyes. CEVs looked a lot like psychedelic art. They were sometimes kaleidoscopic and spiraling but mostly symmetric, looking like glass-in-lead church windows. For brief moments I lost awareness of my body. Some time after the CEVs and OEVs had faded I was still awake. My body was tired and demanded sleep but my mind kept blabbing on. I was not able to sleep until 07.00.  I attribute this mostly to the ethylone.</p><p>Aftermath:</p><p>Upon coming down I took my herbal meds. Later that day I also took approx. 35 mg of Effexor, an SNRI. (Like I would take an SSRI after a night on MDMA, except I had no SSRIs around). Some hours later I was really talkative because of it so I knew it was working. The hangover was less significant than the one I would get from MDMA alone at a larger dose. I drank tea and ate some fruits just like the day before. It has been over a week now and I have not experienced an MDMA-type crash.</p><p>Reflections:</p><p>Mentioned dosages should not be taken as a norm. I admit I am a fool for eyeballing doses and not even using alternative weighing methods and this was the main reason I took very small doses at a time. It could be possible that my past and current medications slightly weakened my experiences. Maybe I should have gotten a xanax or something similar as well, to get myself to sleep sooner. Lastly, I could have used a vegecap instead of toilet paper.</p><p>Most of the revelations came in the comedown. I (re)learnt a lot about myself, my personality, but these revelations are personal so I am not mentioning them here.</p><p>I thank you for your time and attention and I hope this report will be useful to many.</p>"
}
