{
 "title": "Home Depot to the Rescue",
 "author": "Xtasee",
 "citation": "   Xtasee. \"Home Depot to the Rescue: experience with Morning Glory Seeds (ID 463)\". Erowid.org. Jul 31, 2000. erowid.org/exp/463",
 "substance": "Morning Glory Seeds",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "6.5 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 463",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 31, 2000",
   "Views: 18670",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nWell, I had read several accounts of extractions of MG seeds, and happened to go with the polar/nonpolar method.  Materials used include Naptha and 9 packets of 'Flying Saucer' MG seeds from Home Depot, as well as a bottle of nearly 100 proof Bombay Sapphire gin from Costco.  Upon opening the seed packets, I noticed that most of them were tan, with the exception of a few black ones.  I had read from previous accounts that the black ones were more potent, but anyway...\r\nI ground up the seeds in my grinder, and then dumped them into a jar, and in went the Naptha...oh, about 300 or 400ml.  Shook the hell out of it for about 30 min or so, and then strained the resultant mixture through a #4 coffee filter...gotta open that window, or you'll get a major headache from the petroleum distillates.  Since the resultant mush still smelled like petroleum, I aired it out overnight, and in the morning...no more smell.  I then added about 2 oz worth of Bombay Sapphire to the mush, dumped it into one of those 1/2 pint Bell canning jars, and intermittently shook it for the next 1.5 days.  Finally, the day of reckoning...I filtered the resultant mess through 2 coffee filters (so damn slow unless you have a vacuum setup because the mush impedes the flow), yielding 2 shots worth of tan-looking Bombay Sapphire gin.  My wifey and me looked at each other, smelled the mixture- kind of like gin- and reading reports that we should hold the mix in our mouths to aid in mucous membrane absorption, said bottoms up---blech!  I nearly choked on the mixture...it burned ALOT more than straight gin, and could only hold the mix for about 30 secs before swallowing.  For the next 2 hours, the back of my throat burned like crazy, and despite the whole processing, I felt vaguely nauseous as well.  \r\nAs for the trip...well, let's just say that 4.5 packs worth of MG seeds didn't quite do the trick.  Very vague visuals if we stared at the granite on our countertops...the patterns moved a bit, but nothing major.  Colors were enhanced, and we both had the giggles.  I was feeling a bit randy, but nothing like the 'I've gotta meld my groin into yours' feeling that I get somewhere along my acid trips.  Also, the much of the day, we were both extremely lazy, VERY relaxed, and felt like we could just melt into our sofas.  \r\nWe spent the day (we started around 11am) lying around, watching TV, taking a walk (we did a lot of smiling, but people didn't seem odd to us, and we never felt that paranoia which sometimes occurs when you are on acid in public) around the park, and marvelling at the beauty of nature.  The trip, which was mild at best, was mostly on our mental outlook on life and our environment, but no overt visuals, no auditory hallucinations.  In a sense, it almost felt like getting buzzed on some good cannabis like Durban Poison which knocked you back a couple of rows deep.  Two things- perhaps the equivalent of 6 grams of MG seeds were not enough, and we should have gotten 9 packs each (the seeds were Burpee), or perhaps Flying Saucers were not the variety to get- could anyone comment on the relative strengths of other types, such as Heavenly Blue.  All in all, pleasant enough, but given the trouble it took to prepare it, not to mention the cost (heck, 2 tabs of acid is $10 max here in SF), I doubt I'll try it again.\n\n\n"
}
