{
 "title": "It Actually Works!",
 "author": "Former Jerk",
 "citation": "Citation:   Former Jerk. \"It Actually Works!: experience with Flouxetine (Prozac) (ID 46356)\". Erowid.org. Sep 5, 2009. erowid.org/exp/46356",
 "substance": "Flouxetine (Prozac)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 46356",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 5, 2009",
   "Views: 26454",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me start off by saying that I was once extremely sceptical of the pharmaceutical industry and avoided all perscription mood-effecting drugs like the plague. I believed the industry as a whole consistently put the interests of their shareholders before that of the patient and society.\r\nThat doesn't mean that perscription drugs do not work! I discovered this when I began taking Prozac. For a long time I had dealt with intense feelings of panic and depression when around other people. As a child I was able to temporarily overcome these feelings but they seemed to only get worse as I got older and entered college. In college I felt that I couldn't talk to anyone and that all of my thoughts were useless - this was obviously very distressing. Despite my best intentions most people assumed I was an asshole because I was so withdrawn and dismissive. My academic performance also began to lag as my attempts at self medication through Ganja grew to occupy more and more time. After blowing most of the money I had earned in high school on weed and MDMA and nearly being kicked out of school I decided things had to change. \r\nI visited a Psychiatrist and he immediately perscribed me a 20mg daily dose of Prozac and mentioned that I would probably experience sexual side effects. I was sceptical as hell because I expected to first go through a period of therapy before being perscribed anything but decided to try it anyway. \r\nWeek 1: Not feeling much of anything. A bit of an energy boost and some insomnia but that's it.\r\nWeek 2: Starting to change. Half way through the week I no longer feel like running away and hiding under the carpet whenever I see someone in the hallway. I begin casually talking to people and get to know some people from my classes.\r\nWeek 3: The mood effects are comming in full swing. I feel like my brain is inside a warm fuzzy blanket - a bit like an extended E trip. It's bitch to concentrate so my academic performance doesn't improve but talking and socializing feels alot like E!\r\nWeek 4: Concentration returns nearly all the way but doing homework still takes longer. The intial warm fuzzy high of the Prozac also sadly wore off. Conversation feels fluid and natural - I can easily guide myself through the ether of human communication. \r\nFrom when I started using Prozac to now (one year later) I believe I've undergone a complete personality change. I went from being what really amounted to a self-centered jerk to feeling more compassion enjoying human relationships - that's what it all amounts to. Oh yeah, I also have not experienced ANY sexual side effects. If anything I have an easier time maintaining an erection because I feel less anxiety about my sexual-self-image. \r\nRemember, what works for one person might not work for another so don't take this as the be all end all! Cheers & good luck in all your chemical pursuits!\n\n\n"
}