{
 "title": "Worst Experience of My Life",
 "author": "Not Jeff",
 "citation": "   Not Jeff. \"Worst Experience of My Life: experience with Datura (ID 46362)\". Erowid.org. Aug 27, 2006. erowid.org/exp/46362",
 "substance": "Datura",
 "bodyweight": "158 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46362",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2006",
   "Views: 15886",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]<br>I was drinking after work and someone told me about these things so I went and picked one (there was a few plants right in the middle of town). While at the bar I was eating the seeds. It was about 11pm.<br>Then I wake up in a hospital. 3:30 a.m<br>As ashamed of myself as I am, I will tell you what others told me I did. Driving a car into the other lane and grazing someone elses car. Then leaving the scene of the accident and driving into the woods. My car got stuck and then I walk away from it. I guess the car I hit called the cops and so did the owner of the land I was on. An ambulance took me to the hospital. I guess I was really hallucinating and smoking fake joints. Then in the hospital with an IV in my arm. kept sitting up and wanted to get a drink but the cops wouldnt let me (they were actually there) and everyone was asking me what I ate and I just told them I was drunk and didnt know what was going on. Then at about 830 in the morning (I was at the hospital for 6 hrs) they said I could go. But thinking about it now I dont know why they let me go. <br>I waited outside for my dad to pick me up and I was talking to people who werent there, and hearing voices. I could also make anything I wanted to disappear. I had gotten three tickets for that night, and I couldnt even read them, I also couldnt read a newspaper and right now, 24 hrs later, it is still hard and my pupils are still dilated.<br>I cant even begin to describe my hate for my actions: almost killing some people. I would have woken in jail not know what I did, but killing someone, goddamnit. Right now I cant  even live with myself. I consider myself to be very lucky and I am truly happy no one got hurt last night.\n\n\n"
}
