{
 "title": "Intense, Unexpected Trip",
 "author": "K",
 "citation": "   K. \"Intense, Unexpected Trip: experience with Mushrooms (ID 46363)\". Erowid.org. May 7, 2007. erowid.org/exp/46363",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 46363",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 7, 2007",
   "Views: 2633",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first time I did it was my first time on any sort of hallucinogens. I'd read my share and knew what I was getting myself into. The trip was a very positive experience. With only injesting 2 grams of dried cubensis, I sat with my tripping buddy, R, and several other friends who were drinking instead, around a well prepared fire at my buddies cottage. The vibes were awesome, the freedom was definitely present and sense of euphoria had overtaken me as I became very curious and impressed by every little thing around me. The damp grass beneath my wooden muskoka chair slowly bristled threw my fingertips as I dragged my hand threw it, the moon was illuminating the clear night sky and allowing me to focus deeply on the patterns of clouds that flew across and the fire giving off a sense of comfort and relaxation and reminding me that there is more to life then any of the issues I had tucked away neatly in the back of my head. I was in my own little world, every so often interrupted by R to ask me how I was doing and giving him the short-descriptive reply of 'awesome.' Great conversations were brought up by my friends and soon I realized that this is one of the greatest feelings I have ever had.</p><p>I tripped around 4 times after that before returning the cottage, ready to recreate that beautiful night. The most I did was 3 grams and had an amazing time in the back of my friends backyard, on an beautiful day. This time I was going to up my dose to 3.5, half-quarter, this did not intimidate me. I had all positive experiences before, why would taking a half-quarter around really great friends in a very pleasant environment give me a bad trip? I never thought this because it was not expected. I knew I would have a blast with 3 other trippers and bunch of other friends, enjoying the wonderful weather and scenic terrain which we had available. We had 3.5 grams each to consume. We decided to dose as soon as we got to the cottage to enjoy nature to it's full potential, until the sun went down.</p><p>When we got our stuff unpacked and settled in nicely, one of my tripping buddies, A, handed 3.5 grams to me, R and M and made a little stash for himself. R suggested that we eat the mushrooms with ease, eat them slow to avoid and intense comeup. Fair enough, A, handed me a shot glass full of my dose. We went outside to the deck to enjoy the weather and R's tabla playing. We each began to eat the mild-tasting mushrooms, they weren't so bad. I began drinking water to wash the mushrooms down. We only ate a sub about 2 hours prior to we dosed, so our stomaches should be pretty much empty by now. </p><p>I began getting distracted by R's playing, and I ate the entire 3.5grams in a sitting. The rest of the trippers still had some left, they decided to save the rest (a gram or so) until they started to peak. I wasn't too worried, if it was too intense I would just make my way inside and hangout with myself for a bit. Within 15 minutes I started to notice the mild come up effects. My stomach was beginning to cry and my adrenaline was starting to pump. I kept thinking that this was the fastest come up I've ever had. I was getting lost in R's playing once again while waiting until I began to peak. </p><p>A came running up beside us to inform us that people were there visiting. We all went silent. You could hear a pin drop. The intensity began to climb and climb as my nerves were beginning to shake with paranoia. The neighbors had come over to check out the lake we had at the bottom of the big hill. As I saw them making they're way to the lake, I could fell my stomach being pushed to the back of my spine. I was full of nervousness, I made my way inside to avoid any confrontation by them. I sat on the couch and M sat on the chair in front of me. 'I'm comming up now man,' I exclaimed, he nodded and told me he was begining to too. R was not nervous by these people, he continued to play, getting lost within his own sound.</p><p>I sat on the couch for around 5 minutes knowing that the next four hours are going to be heavy, as the non-trippers came up to us and tell us that they were going swimming. By this time the neighbors had left, but my nervousness didn't. We made the long journey down to the lake. I was behind them all, starting to peak, getting lost in my own footsteps down the hilly, rock ridden path. I remember growing. It felt like I grew several feet and I was looking beyond my friends in front of me. My motor skills were beginning to lacken as I began tripping over my feet several times.</p><p>When we finally got to the lake, I began to shrink down to my normal size but feeling incredibly light headed. I decided that I would not swim due to the fact that I may forget how to. I stayed back and sat on the green cottage chair and watched my friends have a blast. At this point, I was certainly in the middle of it. The sand began to take shapes that I never knew existed. It twirled, waved and lumped around in front of me. My hand began to start breathing and twist around as I moved it. I started to melt into the chair, I was the chair. I was a stationary object but was still responsive and could move if I really wanted to.</p><p>Grabbing the sand beneath me was certainly mind-boggling. All the little crystals began to shine like the first star to appear at night. I needed to take a piss. I did not know if I could get myself up and find a bush in the nearby forest. I started to argue with myself, mentally, if I really needed to piss or if it was all in my head. My concentration of this inner debate was broken when one of my friends asked if I was alright. What should I say? All the words I've learned since I was a kid and I couldn't think of anything to say, my mind was racing as all of them were looking directly at me. 'Good,' I hesitated as they all got back to enjoying themselves as soon as I answered. Fuck this, I told myself, I'm going to take a piss. I managed to get myself up without much hassle and make my way over to the nearby bush.</p><p>All around me was tall grass, all I could see what tall grass. I unzipped myself and began to urinate. I closed my eyes in the sense of relief. I probably really had to go or else I wouldn't feel this damn good. I hear the little insects nearby as I am doing my deed. The tiny little bugs surrounded me and were playing music just for me. I open my eyes as I finish up and head back to my chair. My friends were still out there, having a great time as I sit here full of energy, adrenaline and paranoia at the same time. I started to get nausea, my head was so light that I let it float side to side, front to back. I felt tremendously uncomfortable, I became restless and started breathing heavily. I looked up at the clouds and felt completely calm. I was still peaking extremely hard, but the nausea and uncomfortableness had left. For some reason looking up at the clouds had relived me of any negative feelings. I was on a continous cycle of feeling uncomfortable but looking at the sky and feeling better again.</p><p>I wanted to swim. I got up and checked out the water, but suddenly I felt like I didn't want to swim in the first place, a feeling like the last thing I wanted to do was swim. So I went back to my chair and began agreeing that I was tripping balls. My friend AM decided to come to shore. I did not want this. All I wanted was to be left alone. Talking to anybody, especially someone who was sober made me get that uncomfortable, nervous feeling again. I had to leave. I gathered my socks and shoes and made my way up to the cottage. I was breathing very heavily going up that hill again. My legs felt like steel, I was running out of breath but I had to keep going to avoid socialization.</p><p>I made it to the cottage, dropped my stuff off and sat on the couch. I looked at the opposite wall as it began to move closer to my face and back again. My arms started to grow but thinning out at the same time. It was certainly at this time that I concluded that I had indeed taking too much, too quick. I had underestimated mushrooms and it felt like the mushroom gods were punishing me for being stupid. I layed on the couch but the restlessness kicked in again. I could not get comfortable at all. Tossing and turning for a good 10 minutes before I found a spot which involved me stuffing my face inside the cushions for comfort. That only lasted a few seconds before I had to get a new position.</p><p>I started to wonder if there was anyway I could tame my trip a little bit, make it less intensive for me to enjoy it more. I would certainly enjoy it more if I was more relaxed about my surroundings. I decided to give orange juice a try. Trying to get the orange juice down was a battle and a half. It was like my brain thought the juice was some kind of poison and didn't want me to take it. I forced it down and thought I should inspect my pupils while I was up. They had dilated very much so, barely any blue left. I layed on the couch again and could not get comfortable at all. I thought maybe my car would be a good place.</p><p>I layed on the back seat of my extremely warm car, tripping like hell, uncomfortable again. My thought pattern raced and raced with thoughts of how useless I really was. How no one loved me, cared for me and how I was going nowhere. I just wanted it to end. Tame trip or not, this was very uncomfortable and very hard for me to deal with. I got up, exited and locked the car and went back inside. I layed on the couch again and got a little more comfort than usual. I got distracted by the quilt on the side of the wall near me. It was manipulating itself all around the wall and making very funny objects that I laughed uncontrollably at.</p><p>Then I heard something I wish I didn't hear, my friends were comming back up. The intensive feeling was back again and all I could do was lay there and try and socialize with them. R, A and M were still tripping and they seemed to be enjoying it alot. R asked me what was happening and I told him honestly that I was tripping way too hard. He acknowledged and tried to ask me questions that would help make me calm. I appreciated his help, but it was pointless, the mushrooms were pissed and were not going away for awhile. The majority of my friends went outside to start the BBQ for dinner as R layed in the bed next to mine and began to trip out to the ceiling.</p><p>I was breathing very heavily now, as breathing normal made me very uncomfortable. It was as if I needed to make sure I could feel my every breath so I know I was still alive. Laying there I could feel my right-arm getting numb. It gradually became worse and worse as my arm was now paralyzed and my hand was frozen into the clenched position. I have never heard of this happening to anyone before and it started to scare me. R left to go outside and I was getting restless again. I decided to make my way outside to see if my sense of surroundings had changed. My arm started to loosen up a little but was still pretty numb.</p><p>I saw a tree that looked appealing for me to sit by. I put my back against the bark and slid down. My left hand landed on a frog and totally scared the living crap out of me. I got up and went to the porch to sit on one of the chairs. A, came to sit with me and chat for a bit. I could tell he was getting a little freaked out by the way I was acting so he left. I decided that these chairs were less comfortable then a chair made out of steel, so I layed on the grass and looked at the clouds. My mind began racing a million times a second as I became restless yet again. I was rolling around in the same spot trying to feel good. Fetal position, very straight, lying against a rock and stomach down on the ground. Stomach on the ground wasn't too bad but every so often I would have to turn over to avoid the nasuea.</p><p>I had my sunglasses with me for some very odd reason and decided to put them on to see what happens. It was like I entered a new world. I entered a new body, I was looking through a different pair of eyes. Everything was extremely close up when I had the glasses on, I felt like I could touch the clouds. I quickly took them off to avoid getting myself trapped into a hole, which happened several times during the trip. A, came to ask if I wanted a hot dog. Food, that might tame the trip a little bit. 'Sure' I replied. He quickly left and what seemed like 3 seconds he was back again with a hot dog full of my favorite condiments. I was thrilled, I love hotdogs, so delicious, but I couldn't eat it. My brain was again refusing to let me eat it. I was like I was way too full to eat anything. Even if I tried, I had to spit it out on the ground next to me.</p><p>After several more minutes of what felt like hours of restless movement I became deeply interested in the broken pieces of a plastic gun we broke earlier in the day. I just had to put it in my mouth to chew on it. The texture was amazing and felt so nice between my teeth. After awhile I felt like I started to come down, I slowly drifted back to reality. It was a very slow progress but it was worth getting my hands on. I made my way back inside to lay on the couch some more. My friends were done eating and starting to gather around the fire pit for a fire.</p><p>I layed on the couch for around 20 minutes to relax myself for my comedown. It was all over. I had a minor headache and was still feeling some effects of the mushrooms but at a comfortable level. I went outside and hung out around the fire and to loosen up even more by smoking weed. I was very relaxed at that point, the mushrooms had vanished and left me feeling like I had it coming. Throughout the night I was very social and very happy that I was done tripping. Euphoria started to kick in and the same feeling I got when I first dosed on mushrooms.</p><p>I will definitely do mushrooms again, but only around 2 grams. That experience did not ruin hallucinogens for me. I learned from it. I learned to never underestimate powerful drugs or you will truly get to see their full potential.</p>"
}
