{
 "title": "Energy Enhancement",
 "author": "Jean",
 "citation": "   Jean. \"Energy Enhancement: experience with Meditation (ID 46379)\". Erowid.org. Jun 24, 2007. erowid.org/exp/46379",
 "substance": "Meditation",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46379",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2007",
   "Views: 4074",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>Having found yet another blockage in my base chakra, I couldn't help but feel rather despondent. After gritting my teeth and getting stuck in, I finally managed to remove it. This blockage in the Base Chakra was the last one there!!! </p><p>The next time I sat down to meditate, I suddenly felt a tickling sensation in my pelvis above the perineum. This sensation increased in intensity, and felt like champagne bubbling up my body from below. The flow of energy around my body had risen to a new level giving me an increased ability to track down blockages and an increased confidence in myself. Wow!</p><p>I suddenly remembered the writings of the inspired Poet and Meditation Master, the Persian Shakespeare, Jal Al Uddin Rumi and that always he talked of the wine of his meditation and this feeling was what he was writing about and I was feeling it, here and now!!</p><p>Next, I came across a particularly stubborn blockage to remove, and knew that I would have to prepare myself well during meditation. I consciously sourced as much energy from above to flow through my body, and in doing so, rather than my body being filled with golden light, I had somehow tapped into an immense source of white light. As well as feeling this increased energy stream through my body, I realised I had involuntarily suspended breathing somewhere near the top of an in breath. My body felt like a beacon of light, with more than enough energy to direct toward a blockage and watch it dissolve in an instant.</p><p>Since that time I am always connected to and able to source the white light from above my head. Many times during this process I just forget to breathe as though my breathing is just naturally suspended. I am now living in the Light!! </p><p>My energies are naturally far higher than when I arrived on the Energy Enhancement course just two weeks ago. I am experiencing the fruits of meditation which normally arrive, if they do, after twenty years of meditation and it has only taken me two weeks. </p><p>This is the first meditation course I have been on. I have an injured knee from a few months ago in a motorcycle accident, yet the knee is now healed of its blockages and of its pain here on the course and I am sitting in meditation for more than three hours a day, on the ground in the easy meditation posture, here in the light and working on more of my deep internal blockages. </p><p>Truly, perhaps Enlightenment is next!!</p>"
}
