{
 "title": "Unknowing Shroom Recipient",
 "author": "GuNNerS DowNUndER",
 "citation": "   GuNNerS DowNUndER. \"Unknowing Shroom Recipient: experience with Mushrooms (ID 4637)\". Erowid.org. Dec 30, 2001. erowid.org/exp/4637",
 "substance": "Mushrooms",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "60 ",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4637",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 30, 2001",
   "Views: 10258",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt all started on a rather strange night in around June of 2000, the Australian Winter and the perfect conditions for the collection of the many hallucinogenic mushrooms that abound in my local area. I had gone to a friends house to chill with some mates, and little did I know what was in store for me.</p><p>It was a chilly winters night, and we kicked off the night with a few bongs outside with some music cranking. I was not a dope smoker prior to this, and therefore I had to be co-erced into joining the session. As this was the first time I had consumed marijuana in such a large quantity I was unsure as to its effects, a factor that came in later when I had inadvertently consumed shrooms. Part way through the evening, at the peak of my stonage, I decide to try my old 'fire breathing trick' using a butane lighter, entertaining my friends quite adequately. </p><p>I was completely blase as to the scheme that my 'friends' were hatching inside in the kitchen, probably a result of my bud consumption. Nevertheless, something was about to hatch; something that I will never forget.</p><p>My friends had been acting rather strangely, and now on recollection, kept me well clear of the kitchen. This was not noticeable to me at the time, once again due to the marijuana. After a period of time, one of my friends emerged from the kitchen, asking if I would like a drink, and of course, being a first time stoner/non smoker with a rather parched throat, I accepted willingly. So, right then, I consumed my first glass of what I assumed was pure red cordial, but as I was to discover later, was actually laced with a shroom brew in place of water.</p><p>By this time, I was still nicely stoned, and for what seemed an odd reason at the time, my friends kept offering me drinks and using 'sculling competitions' as and excuse to co-erse me into drinking the cocktails. On one occasion, they offered me some pizza that also contained shrooms as a topping, which I ate greedily, as I had the 'munchies'.</p><p>I must have consumed at least 8 glasses of the brew/cordial mixture plus the pizza, when I first began to notice slight hallucinogenic effects. I remember it vividly, there I was sitting in a comfortable chair under the porch, staring at the corrugated iron roof when it began to uncontrollably 'morph', and 'wave', much like the ocean. I commented to my friends that I must have inhaled too much butane with my earlier party trick, or gotten too stoned (remember, I was a first time dope smoker with no idea as to its effects) and they laughed at me, knowingly keeping the real reason hidden.</p><p>After around 10-15 minutes subsequent to my first hallucinations, I began to feel the 'trip' much more intensely. The waving roof became a shimmering plethora of colour and light and this led me to believe that something had been mixed in with the marijuana I had consumed. Not for one second did I consider the theory that my own mates had spiked my drinks. We sat around for probably another five minutes when my good friend Leon suggested we go for a drive to the 'servo' (petrol station) to get some food. I agreed hurriedly, pining for something to take my mind away from this experience. I still had no idea that shrooms were the culprits messing with my innermost mind.</p><p>We took off in Leon's panelvan, but soon enough, even I could realise that we were not heading for the servo, but instead we headed for the beach that was only around a minutes drive from our 'base'. Upon arrival, I asked Leon what we were doing at the beach and he replied that we were going to have a little talk. At this point, I was tripping hard and I vividly remember the steering wheel metamorphosise into a seething mass of snakes, and this had the effect of freaking me out horribly. I sat there, trapped in my own nightmare while Leon spoke.</p><p>He explained the reason for us being there (which I will not divulge any further suffice to say that he asked me several questions about his ex-girlfriend about which I had knowledge) He then uttered the words that sent me over the edge of an abyss into a world of pure terror. Leon said to me, 'Steve, what do you think you're on?' or something to that extent to which I replied 'I don't have a clue, its probably the butane or something you guys mixed in with the dope'.</p><p>He then looked at me, and said in a very caring, gentle manner, 'No man, do you really want to know the truth?' Of course I was anxious to find out what was messing with my head so I answered in the affirmative. With the slight hints of a grin, he uttered those fateful words, similar to 'No dude, you've just had a major dose of magic mushrooms, and I'm on them too.'</p><p>The words hit me like a shockwave, and I instantaneously began to sweat. My mind travelled at a million miles a minute, crashing through the hallucinogenic minefields of my soul. Later I was to find out that I had 'tripped out'. After a few minutes of coming to terms with my affliction, I regained enough composure to ask how much I had consumed. He looked at me and told me that I'd had around 50-70 shrooms, and told me that this was an incredible dose. At this point, I began to notice my surroundings, and the fact that I was seeing everything in an almost 'eerie' light and in a 'freeze frame' perspective. By this I mean that when I would focus on a certain area, say the dunes in front of us, and then move my head say to look at Leon, my mind would have to play catchup with my eyes. This gave the effect of the previous image being almost 'superimposed' over the top of the fresh image, with trails of light and colour following the turns of my head and eyes.</p><p>After we had sat there for around 20-30 minutes just talking, I began to freakout and had an overwhelming sense just to 'go home', and had I been allowed to, I would have walked the 10 or so kilometres home. We then drove to the servo which only intensified the trip further and I cannot recall anything of my time there. I was peaking hard. Later on I learned that I totally nutted out and was paranoid that the station was going to explode and wouldn't let Leon leave my side. That I can believe, given my behaviour beforehand.</p><p>Subsequent to this, we went back to my mates house where I 'crashed' out on the couch and inadvertently reverted to the foetal position and began to suck my thumb vigourously. My various friends thought this was rather amusing and took a photo of me that I laugh at now. I remember lying there, completely isolated from reality, in my own detached world where everything in the room took on strange proportions. The curtains were moving in the wind in a very hypnotic way, and it had me entranced. It was if they were alive, with a mind of their own, intertwining with the trails and streaks of colour that were still immersing my world.</p><p>At one stage, my friends dog decided to deposit the contents of its bowel on the carpet near me. One of my friends scooped it up on a magazine and then proceeded to terrify me with it. I can still remember vividly, the proportions of the faeces compared to my friend holding it. It was as if the entire room shrank, and the faeces was the only clear thing in my vision, with this tiny little guy holding it on a gigantic magazine. It freaked me out, as it waved and morphed in front of my eyes and I was convinced that it was a bad omen come to take me away. I lost all sense of control and hid in my jacket, curled up in a tight ball, on the point of weeping and crying out until the offending item was taken away.</p><p>I began to suck my thumb again, and I clearly remember the texture of my mouth and lips. It was as if my entire oral cavity had been somewhat 'inflated' by some way or another, and my tiny thumb was a mere matchhead in a giant cavern. It was very intense for me.</p><p>By now it was around 11:30pm, around 3 hours since I began tripping. I remember staring at the clock on the VCR, turning away for what seemed an eternity, then glancing back only to see that it was only around a minute. This was one of the scariest parts of the trip for me, not being able to grasp the concept or longevity of time freaked me to no end.</p><p>After more eternity, my friend came and asked me to come with him to the phone at the other end of the house to ring a chick he liked. I took my mobile with me as I had the number that he required in it. We reached the room, and he asked me to dial her number but I couldn't focus on the numbers. I remember looking and my phone in low light (it has one of those green LED faces for night use) and I couldn't differentiate the black writing from the intense green colour that I could see. Almost magically at that point, the numbers on the keypad and the illuminated face began to 'melt' into one mass of green molten goo. I freaked out and told my friend that I couldnt give him the number because 'the phone had melted'. He then took the phone and suggested that I dial the number on the normal phone as he read it out. He read out the number, but each time I was unable to summon the coordination and vision required to press the keypad. As with my phone, it too had melted into a grey plastic lump, with blobs where the pad was. I began to laugh uncontrollably, and at this point my friend began to get frustrated and decided not to ring her.</p><p>We went back out, and I once again assumed my position on the couch in the foetal position. I looked at the clock, and it was now nearing 1:00 and I could tell that I had conquered the 'mountain' and was now on my way back down again, nearly some 5 hours since I had started the ascent. After this point, reality returned with surprising speed, as the hallucinogenic properties of the shrooms vacated my spent carcass and left me feeling absolutely morbid. I felt extremely tired and irritable and all I wanted to do was sleep, so that is what I did.</p><p>The next morning I awoke feeling rather alive and everything seemed much more vivid than usual for the first few hours of the day, this I assumed was a legacy from the shrooms. After this, I felt completely normal, although I have had several 'flashbacks' over the time since. These involve me suddenly tripping out or getting intense 'deja vu' I suppose you could call it. They don't last very long, but they always remind me of the first time I consumed mushrooms.</p><p>I would not recommend a first time mushroom taker to consume the amount of shrooms that I did, nor for his or her friends to delight in 'spiking' my drink. It is very dangerous and to the weakminded it could be very frightening and maybe life threatening, albeit through behaviour and not via overdose. I believe that the only way I did so well with my first trip was the fact that firstly, Leon helped me through it, and secondly, that I have always had a strong reserve and unshakeable mind even in difficult situations. I would not recommend someone that is more prone to drug effects (eg. those people amongst us that feel the full effects from small amounts of narcotics) to use mushrooms, and if they must, make sure it is supervised and a controlled dose suited to their characteristics must be enforced. Also, as with most hallucinogens, a comfortable, happy, 'mellow' environment is desirable, to prevent 'freaking out' and being on a 'downer'.</p>"
}
