{
 "title": "Side Effects",
 "author": "Diggoy Venn",
 "citation": "   Diggoy Venn. \"Side Effects: experience with Hydergeine & Nitrous Oxide (ID 46385)\". Erowid.org. Aug 24, 2007. erowid.org/exp/46385",
 "substance": "Hydergeine & Nitrous Oxide",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "4.5 mg",
   "oral",
   "Hydergine",
   "(pill / tablet)",
   " ",
   "12 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 46385",
   "Male",
   " ",
   "Not Given",
   "Aug 24, 2007",
   "Views: 10533",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I went on a bit of an ecstasy binge and in the week following experienced some dizzy spells and general anxiety that this time I had *really* messed up my brain pretty good.  Proof of this was my intuitive understanding that the only way to remedy the destruction of my nervous system was to try another drug, one I'd never used before.  Uh, hydergeine?  Why not?  I got the 4.5 mg pills from a website; they came in crushed up boxes in a padded envelope and all of the documentation and labels were in Spanish.  Also, this day, I decided to do some nitrous.</p><p>I was about 4 or 5 cartridges into the nitrous when I dropped the hydergeine pill.  I guess I should also mention that I also drank a beer, because, due to the nitrous, I wasn't thinking too clearly.  Within 20 minutes of ingesting the hydergeine, I'd finished about 12 cartridges, and decided to lay down for a while and take a nap.  Not a chance.  There was a nervous rushing in my head, a kind of flushed, throbbing feeling that prevented me from falling asleep.  I lay there a while and when I finally got up, my vision was blurry and I felt overheated and 'out of it.'  Also, my sinuses were completely plugged, although my nose wasn't runny.  This feeling lasted for about 30 minutes, and began to reside, slowly.  Although at no point in time did the 'uh-oh' feeling arise, there was a strong sensation of having done something stupid and pointless.  I felt kind of weird, off-balance and detached, for the rest of the evening. I don't feel any smarter.</p><p>My first impression of this experience is that I took too much; maybe I should've started with half a pill.  Something was obviously going on in my brain; I'm just not sure it was something good.  It almost reminded me of a low-dose amanita trip. Yucky body load, flushed face, and weird, but not really trippy, thought patterns.</p>"
}
