{
 "title": "No Sleep and a Good Smoke",
 "author": "Irish Day Tripper",
 "citation": "   Irish Day Tripper. \"No Sleep and a Good Smoke: experience with Sleep Deprivation & Cannabis (ID 46453)\". Erowid.org. Jun 14, 2007. erowid.org/exp/46453",
 "substance": "Sleep Deprivation & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 35:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 46453",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2007",
   "Views: 6596",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Intro: To start, I am a 21 year old, heavy marijuana user.  I usually smoke the best that I am able to find in my area.  On top of my recreational drug use, I am also a chronic insomniac.  The 4 days preceding the experience at hand, I hadn't smoked a thing due to being away from home and in a drug-less suburban hell.  I also didn't sleep very much on my weekend adventure and I was extremely tired for my four hour ride back north.  </p><p>T+0:00-T+12:00</p><p>When I returned home, I had to find some decent stuff, so I called my good friend and he hooked me up with a thick bag of some decent outdoor nuggets, very sticky and slow burners.   I didn't smoke that night, though I should have considering the fact that I absolutely could not sleep.  And this after driving for four hours on boring interstates.  I attended 3 classes and drove my tired, grumpy ass home.  Attempting to relax once I get home, I made an effort not to fall asleep until a time where I would get a normal amount of sleep and wake up in the morning.  </p><p>T+12:00-T+24:00 </p><p>I ended up actually not sleeping at all and went to work at 8am.    </p><p>T+24:00-T+35:00</p><p>Following work, I attended 3 classes including an exam.  I then drive home.   I crash in my room, still unable to drop off to sleep.   I roll around for a short while and finally decide to smoke in order to aid my long-overdue sleeping venture.</p><p>T+35:30-T+36:30</p><p>I packed a nice sized bowl and ripped it on and off for about twenty minutes.   My high came upon me gradually over the next half hour, and I knew that by the time all was said and done, I was going to be the highest I'd been in recent memory.   </p><p>I began to realize that I was almost as high as I used to get when I first started to smoke as a freshman in high school (age 15).   I began to see colored light flashes and faint hallucinations barely qualifiable as open eye visuals, but still unfamiliar and interesting.   My body high is near numbing and my eyes slowly descend to half-mast.  </p><p>T+36:50</p><p>I figured at this point that it was reasonable to assume I could fall off to sleep. I got in bed and closed my eyes.  Immediately, I was aware of the closed eye visuals which included rotating color patterns and strange images. The first few times that I began to reach sleep semi-conscious, dank-bud induced night terrors that would rouse me.   Eventually I fell into a strange sleep, waking rested and slightly disoriented about 8 hours later.</p>"
}
