{
 "title": "Five Hours of Freedom",
 "author": "Q",
 "citation": "Citation:   Q. \"Five Hours of Freedom: experience with 2C-E (ID 46511)\". Erowid.org. Nov 4, 2006. erowid.org/exp/46511",
 "substance": "2C-E",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   "IM",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46511",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 4, 2006",
   "Views: 5078",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a 30 year old business man who has not done any mind altering drugs in about 10 years.  I have looked for Mesc and LSD but I have been out of the scene too long and I cannot find it.  This led me to research chemicals. The first one I tried was 5-meO-DMT but that substance was not enjoyable to me.  Through research I decided 2c-e looked like my cup of tea.  \r\nI ordered 100mg and repaired a 10mg/ml sterile solution for injection using a drop of Benzyl Alcohol mixed with sterile water.  Then I dissolved the 2c-e in the solution and pushed it through a sterile syringe filter.  Now all I had to do was waiting for the right time to try the substance.  I have a wife and a child so I cant go getting high when ever I want.  \r\nThe day came where my wife and son would be out of the house for 5 hours.  I figured I would start at the threshold dose for snorting it.  I used an insulin syringe to load up 2mg and injected into my leg.  2 minutes later I could feel the affects.  I peaked in about 30 mins and I would compare the affect to that of a really good tab of mescaline.  I had a really nice euphoria, with mild open eye visuals and nice closed eye visuals.  The entire trip lasted 3 hours with lingering affects for the rest of the evening.  \r\nI am glad that I tried such a small dosage because I was contemplating 10mg for a good trip.  Now I think 5mg would get me to +3 and 8mg would be the absolute max I would want to go.\n\n\n"
}