{
 "title": "Removing the Coating Helps",
 "author": "Altered",
 "citation": "   Altered. \"Removing the Coating Helps: experience with Morning Glory Seeds (ID 4654)\". Erowid.org. Dec 30, 2001. erowid.org/exp/4654",
 "substance": "Morning Glory Seeds",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "4654",
   "Male",
   " ",
   "Not Given",
   "Dec 30, 2001",
   "23444",
   " "
  ]
 ],
 "report": "<p>\nBefore, I had taken 3g of morning glories, then several hours later, after the effects had worn off, I took 4.5 grams more. I had a, for the most part, bad trip.  These seeds I had washed with water and crushed and ingested alone. I also hadn't eaten beforehand. I find it much better on a (mildly) full stomach.  Through experience, I am very very certain that these 'bad' trips are for the most part due to the coating on the seeds.</p><p>A few days later, I washed 4.5g of seeds with LIQUID LAUNDRY DETERGENT in water, then rinsed ALL THE DETERGENT OFF. I then ground the seeds to a very very fine powder and ate it. It was a great trip, and MUCH more potent. I had little nausea, but much less than before. The only bad parts of the trip were that it was relatively short (it was, after all, a small dose) and for a minute or two, when it was starting to come on strong, I panicked in a fit of paranoia, but this was suppressed quite easily by playing my guitar and watching TV. After that, my trip was all good. And this time, I could easily get to sleep.</p><p>What I did to avoid my bad trip with morning glories was pour a generous amount of liquid laundry detergent in water with the seeds, and shake the container around on and off for about 5 minutes. Then I rinsed. I would prefer to do it with a friend too, because it's much easier to get paranoid and scare myself alone.  When I do feel my experience going bad I can get over it by playing a musical instrument, watching TV, listening to soothing music, or touching something that I touch everyday (like my pillow). This, in most cases, will greatly ease my experience and leave me feeling good.</p>"
}
