{
 "title": "6 Months Regular Usage",
 "author": "wackary",
 "citation": "   wackary. \"6 Months Regular Usage: experience with Tramadol (ID 46596)\". Erowid.org. Feb 10, 2008. erowid.org/exp/46596",
 "substance": "Tramadol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46596",
   "Male",
   " ",
   "Not Given",
   "Feb 10, 2008",
   "10311",
   " "
  ]
 ],
 "report": "<p>I was prescribed Tramadol for the relief of chronic back and joint pain. I am an ex-motorcycle racer and have had many injuries and surgeries over the years which have left me, at 38, in chronic pain. I have also had a lifelong on and off experimental relationship with drugs of all kinds. I have always been very fortunate to not have cultivated any long term addictions over my lifetime except possibly to Marijuana. Although I would hardly consider that dangerous. I have been taking Tramadol regularly for approx. 6 months. I can say without question that it is indeed an addictive drug with a very unpleasant withdrawl syndrome. </p><p>When I first began taking Tramadol I thought I had lucked out and found the solution to my pain problem; I still feel that it is a wonderful panacea for chronic pain and depression. Tramadol can very discreetly cover and manage moderate pain and it lasts much longer than anything except time released oxycodone. I started out taking a reccomended dosage of 50mg, twice a day. Almost immediately I upped this dosage to 200mg a day which caused me to run my prescription short on several occaisions. The withdrawl I suffered was very similar to any opiate withdrawl. Nausea, tremors, sweating, shills, pain, aches, shuddering, depression, just short of absolute misery. Did I mention the diahrea? Fortunately, my physician was sympathetic to my level of pain and upped my dosage to 100mg, twice a day. This is a very managable dose and I am able to function very well with regards to pain control and opiate effects. In fact, there is little noticable opiate effect anymore other than the masking of pain. At times I will take higher doses, up to 300mg at a time for days of excessive pain or when I need to perform physically without the interference of pain. </p><p>The beauty of Tramadol is it seems to have a negligable intereference upon my motor skills, but it can effect judgement, particularily in the period before a tolerance is developed. I have been noticing some long term effects of increased anxiety, tremors, sleeplessness and a feeling of abject physical misery when I am at the end of a dosage cycle (i.e. first thing in the morning). I am undeniably dependant upon this drug and I suffer greatly at its withdrawl. This, to me, makes it not the panacea I had hoped for. All in all, however, Tramadol is a fantastic drug, but if I have to suffer such withdrawl and tolerance issues, I would prefer to be taking oxycodone and enjoy the higher level opiate effects.</p>"
}
