{
 "title": "Much More Then I Expected",
 "author": "euGene",
 "citation": "   euGene. \"Much More Then I Expected: experience with Mushrooms (ID 4662)\". Erowid.org. Dec 30, 2001. erowid.org/exp/4662",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "0.125 oz",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4662",
   "Male",
   " ",
   "Not Given",
   "Dec 30, 2001",
   "Views: 17003",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nBefore I start the story off, I'll fill in some background information. I have consumed mushrooms on multiple occasions previously, and although my experience with psychedelics is limited solely to psilocybin, I don't consider myself an inexperienced tripper.</p><p>I recently aquired a quarter of an ounce of some very potent mushrooms. The stems were longer than any I'd ever seen before (about 5-6 inches dried.) The caps were also very large and a lighter golden color than the mushrooms that are usually around this area. There was also the occasional gold flake on the caps and stems.</p><p>At around 3:20 or so my friend and I both consume an eighth, washing the shrooms down with some oj. We chill for a while, listen to some music and then decide to walk to a nearby store. On the way home I can feel the mushrooms kicking in, that familiar body high taking over my body. We decide to go for a cruise and smoke a few bowls of some very high quality sativa. We drive by the beach and are mesmerized by the waves and magnificent pink sunset. We smoke a fat joint of the same kind bud.</p><p>I'm getting intense visuals but still feel fit to return home and make some phone calls. My mother's home and listening to some book on tape, which kind of freaked me out because I didn't know where these strange voices were coming from. We go upstairs and listen to some mp3s. My eyes are more dilated than I've ever seen them, so much so that I can barely stand to look at the monitor because it's hurting my eyes. everything is distorted and I start to get a little worried. I hear my father's voice downstairs and realize he just got home from work. I tell my friends that we gotta get out of there. I shut down the computer and we prepare to go. This is when things start to get weird. By my guess it is about 5:40 or so, maybe six.</p><p>I walk to the bathroom and then forget why I went there. I come back into the room and for some reason I cant tell if I just puked. I ask my friends and they say no. My face feels funny and my teeth seem extremely sharp when I run a finger inside my mouth. I realize I'm starting to freak out. A million thoughts start running through my mind and my head starts to feel extremely heavy. I'm standing up holding a bottle of Sprite, next to the half-open door. Next thing I know I'm down on the ground and stumbling back up, after I have crashed into the door, knocked over a speaker and spilled my soda all over the floor.</p><p>I hear voices downstairs asking what the noise is about. My friends dont believe whats happening and ask if I'm alright. I rush into the next room over and try and sit on my bed, only to fall down on the floor once more, this time making a huge crash as I hit the wood surface knees first. My parents come running upstairs, my father yelling about the commotion. He can tell by the size of my pupils that I'm on some kind of drug. He asks me what I've done and what I'm on and tells me to level with him. I deny everything and then my sister shows up and tells him to go away.</p><p>I tell my sister to keep the parents away from me and lay down on the bed. My head feels tiny and my arms seem like their extremely long. The skin on my hands looks groutesque, almost like it's melting. My friends sit in silence, watching me. I reassure them I'm not falling asleep and that I just have to lay down. We sit for a long time, they try to entertain themselves by drawing. My saliva seems very thick and it feels as though my throat is closing up. Its difficult to swallow. The whole time I'm getting intense visuals- I look at my friends face and can only see the outline, I cant make out any of the features of his face. The light hurts my eyes so bad I have to keep them closed.</p><p>I ask my friends what exactly happened earlier and they say I just hunched over and fell to the floor, with my eyes WIDE open the whole time. They're scared shitless, as am I. I get my friend to put on some music, which thankfully was some great reggae on a wonderful radiostation, WERS 88.9 in Boston. We sit or a long time, I'm just staring at the wooden floors and door which have the characteristic breathing effect to them. After about an hour and a half the visuals finally go away. I tell my friends that I can finally see normal again. They tell me color has returned to my face and I know then that it's over.  We try and come to terms with what just happened and we agree it must have been a panic attack. My brain hurts. Eventually they leave and I just lay on my bed in the darkness, with the radio on to maintain my sense of reality. I fall asleep and slept soundly.</p><p>This all happened yesterday, and to me was a wake up call. It scared me and made me realize just how powerful psychedlics are. I can't say I'll never do shrooms again but knowing what happened I'm pretty sure I will never experiment with any stronger psychedelics (ie acid , pcp).</p>"
}
