{
 "title": "Kicking Myself Around",
 "author": "Scelza",
 "citation": "   Scelza. \"Kicking Myself Around: experience with Gabapentin (ID 46697)\". Erowid.org. May 10, 2006. erowid.org/exp/46697",
 "substance": "Gabapentin",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   "oral",
   "Pharms - Gabapentin",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 46697",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 10, 2006",
   "Views: 53737",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>About half a year ago, my moms boyfriend got into a semi-major ATV accident. After messing up his whole nerve system in his left arm, he was given a slew of different medications. At first when I looked through them, I was only looking for pain killers that I knew of, such as Oxycontin, Vicoden, etc., but to my dismay, I just found a bunch of bottles meaning nothing to me. Well six months later and in  an absence of marijuana, I decided to take another looksy and with the help of my new laptop, I grabbed all the bottles I could find and began researching what would bear a good high. After researching Morphine pills, I decided to wait on those until I had a sitter of sorts. But this bottle of Gabapentin seemed to be the safest thing I could find, which brings me to the 'what went on' portion of this report.</p><p>Currently it is 4:30am and about 5 hour ago, I downed 3x 300mg pills of Gabapentin. Having heard that soda gets the high going sooner, I drank a full can of Mountin Dew. At around 12:00am, possibly later, I began to just feel happy. Not quite high or anything, just relaxed. This feeling of a sort of euphoria began to highten the buzz. I jumped on to the internet to again check on other persons doses and reactions. Again, finding no negative impact from Gabapentin, I decided to have another at around 1:00am, along with a can of MD. Mac & Cheese soon followed, with another can of MD, and also some singing was tied in there too. </p><p>Can't recall what was being sung, but I didnt care. I was in my own world of pure imagination. I then just layed around watching TV and enjoying the atmosphere of the room. The lights, the sofa, the blanket, the cat, the glow of the television reflecting off of the windows and hard-wood floor. Details of ordianry things began to just kinda pop out. Ordinary objects in a 3D world were becoming more 3D, if that would be possible. Everything just filled the room properly and kinda moved around. Everything was connected in a perfect way. A large scale puzzle that someone had taken time and effort to assemble. It was a sight to me and no one else. At around 3:00am, I popped in Pink Floyd; The Wall and watched it in awe. It was the first time I had ever seen it, and being that I was in a sence, high, I figured why not? So many things happened while watching it. But I will point out the effects that deserve merit. </p><p>1. While watching the movie, the aura or the TV light danced around the TV almost like it is when you look through or around a flame. Everthing is just kinda flowing around, like the surrounding air is showing off and moving like a witch on acid. </p><p>2. The music just surrounded the room, or be it, my head. The surround sound was definately not on (I checked just to be sure not to wake anyone up), and the volume wasn't even that loud. But the sound just enveloped the entire room. It was amazing. This euphoria is just amazing. I currently am still on the decline of the rush, but feel that the past few events should be shared to those questioning this drug. I feel that it is entirely safe, in small amounts of course, and should be used in groups to heigten the effect. Others say that they feel like they are more outgoing and such when on Gaba, and I completely agree. If someone was with me, I probably would have yacked my head off to them.</p>"
}
