{
 "title": "Childhood Regression",
 "author": "Strawalker",
 "citation": "   Strawalker. \"Childhood Regression: experience with Salvia divinorum (10x extract) (ID 46718)\". Erowid.org. Nov 9, 2007. erowid.org/exp/46718",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 46718",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2007",
   "Views: 2809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAt home, 11:30 p/m, my wife and son were asleep in an adjoining room. I had never taken Salvia before so I had no real idea what to expect. I had read many Experience Reports, but nothing I read prepared me for what happened. <br>I lit a candle and loaded a glass water bong with 1/4 gram of 10X Salvia. I had made sure I had some ice water to drink nearby and a blanket to keep me warm and comfortable. This proved to be completely useless. After taking a massive inhalation of a huge amount of smoke I started to count while holding in the smoke and by the time I counted out 15 seconds I had completely lost consciousness. \t<br>I was then experiencing reality as a seven or eight year old. I was sitting on a sun-warmed sidewalk a few houses down from the house I grew up in. I had no concept of my future self, no memory of anything past being eight years old. Everything seemed as real to me as could be. So real in fact, that when a fissure or crack in the clear blue sky above and to the left of my head appeared and contained within it the memory of my life I was terrified. I remember thinking I must tell Ralphy about this. Ralphy was my childhood friend. I then thought is that me, or is this me? The question of what is happening to me arose, before I was pulled into the crack and was confronted by a giant moving snake-like ribbon covered with the faces of all of the people I had met in my life to date and even though it was moving fast I could recognize every one of those faces which were like little living portraits framed in a window. As the face snake thing was moving past me focused on one face and that frame became stuck and it was my wife. I realized I loved her and began to come back to her. <br>Now what happened next, I had read about but nothing can prepare you for it, as I was returning to my reality and was struggling to focus my mind I realized that I was the walls, floor and furniture of my apartment and I was gathering myself up and merging into my body. This happened very fast and was confusing as hell. Now like I said when I first inhaled the Salvia my wife and son were asleep in the next room. Well upon returning to this reality my wife was sitting in front of me with a very worried look on her face. She told me she was wakened up by the sound of me laughing and talking loudly, and then I appeared standing in front of her staring blankly. I then turned, walked back to the living room sat back down on the couch and pointing at the blank TV screen said loudly; look at that, look at that! <br>The whole experience lasted about 20 min., with a ten min. recovery and I was sweating and in a state of shock. Another 30 min. of total incredulity and disbelief in what had happed to me. Yes I will try Salvia again, but this is not something to be taken lightly. This is a very intense experience and you do need a baby sitter because you can lose complete control of you body. I have absolutely no recollection of standing up and moving around or of speaking at all. I believe I entered a state of shock because, like I said, nothing you read can prepare you for a total reality shift. Having said that my next trip will be much more relaxed because I have some idea of what to expect and that I will return, which was a major fear for me as I was leaving my childhood reality behind. The next morning as I am writing this I feel slightly euphoric as a result of re-experiencing the total naivety of being eight years old again.<br>[Follow-up: Experience #49260]\n\n\n"
}
