{
 "title": "The Dryad in The Dresser",
 "author": "MacDog",
 "citation": "   MacDog. \"The Dryad in The Dresser: experience with Salvia divinorum (10x extract) (ID 46726)\". Erowid.org. Oct 4, 2005. erowid.org/exp/46726",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2000",
   "46726",
   "Male",
   " ",
   "Not Given",
   "Oct 4, 2005",
   "Views: 3771",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I now have some ability from long consideration of the experience itself, on how to describe an experience that is well beyond words or any requirements to sound rational. The experience itself has left a long residue in my psyche, and no one is more surprised than I to announce that what may have been only thirty or forty seconds in the real world, and was an obvious state of intoxication, was more informative and in an ineffable way more real than paranormal experiences I have had while stone cold sober for more extended periods. My experience is more typical perhaps of that of DMT, which I confess I have not tried, than of Salvia. However, much like the descriptions of DMT experiences, there is far more than a suspicion but an absolute certainty that I had accessed another realm of existence. A dimension as intimate with our own as we are largely unaware of it. Compared to innumerable acid trips and other peak experience (again some while quite sober and in the presence of witnesses), I have not been able to 'write this one off' as it were. I have not used Salvia since the event, and had used it only a few times before, with significant results, but this event was singular in its depth and lucidity. </p><p>In a way it was not the kind of superimposition of conceptual wanderings that one might associate from a psychedelic or experience of being stoned and/or drunk. Nor was it dreamlike, with the kind of whimsical inconsistencies of high REM sleep pattern experiences. The only thing I can tell you in a descriptive effort is that it is a real place, and it is right there, right now. Now that I know this, and I mean I know it, absolutely nothing about life has the same casual causality that I had once deluded myself into believing it was. Now I know that my everyday experience is truly rich with the reflections of a world almost indescribable in every day terms but intimately woven into the common everyday experience that we all have a right to. </p><p>Think about  it! What is the biggest cosmological discovery of recent years? The existence of dark matter and dark energy comprise that vast bulk of the universe. The world of atoms and chemistry as we know it is a single digit fraction of the total continuum. Our world is not the main event, that's scientifically proven, we're some kind of freakish sideshow. If that dark part is inhabited by sentient beings, how do you suppose we look to them. the easiest and most appropriate metaphor might be that we're like a pond scum on their otherwize pristine lake. And yet they don't hate us, not all of them are benificent, but it should be that any of them are instead of any of them being not beneficent that impresses us at all. Think about how you treat the bacteria in your toilet, and be thankful they don't treat us that way. God only knows how many times they may have saved our lives as a civilization and a species, but speaking personally I have at times felt the Hand of Grace and Will of Providence move through my life, and I'll bet you five bucks you have too.</p><p>From my former experience simply smoking dried leaf in a joint, and almost falling off the damn porch, I took the extract into the bedroom, where I had run the AC for a good long time. Salvia seems to make me break out in hot prickles all over my skin, and I admit I find it deeply unpleasant, as well as the sudden pouring of sweat that accompanies it. others may or may not have had similar experiences, and my own sensitivity to the substance could have been a factor. I laid down on the bed with the bat, and lit the fully packed space which burned hot and instant with a taste I am not fond of. I hadn't finished inhaling when I lost full motor control, as I had expected and used what volition I had left not to drop the hot bat on my face or the bed. I barely manage it.</p><p>The hot prickling sensation begins, it is almost as though one were a star, and sensing the convection cells moving within. I again to science to note and conjecture that the extra dimensions of existence implicated by string theory may exist, with these unexperienced dimension wrapped up very tightly just above the substrate of Planck's space and time, floating on the quantum foam below. For no reasons other than the experience itself, I believe these unpleasant sensations are a liminal stage as the chemistry of the body harmonizes somehow with these hidden levels of existence. It is a feeling of great movement and inertia, but very internal and there is a ratcheting quality to it, as though something mechanical were literally involved. the experience of panic is intense. I was convinced I was dying in some fundamental way, and perhaps I did. And then the ego, the locus of all that self-centered anxiety, dissolves away.</p><p>There is a feeling of purification, perfection, joy. It is the base level of my awareness that moves through the eternal as does a fish through water. There is no fear because all is acceptance. there is no better. There is no worse. There is only NOW, and it is glorious.</p><p>It is only in careful retrospect that I came to realize that many of things in the depths of my experience had relationships to the aspects of my immediate surroundings. this fusion may in that manner be considered artificial, but without such constructs relating the experience would be impossible. So when I talk about the Dryad in the Dresser I mean that both in a literal way as it is related to the cone of my experience (a cone which continues to grow along the edges to this very day), but also in a metaphoric way because the true ultima of the experience wer beyond the requirements of reason.</p><p>'Hey gorgeous' a decidedly sultry female voice came from my left, from the large oak dresser next to the bed. Without looking I look at it, I see the woodgrain not simply as wood, but an erotic stretch of flesh for a nearby being whose form might be definite, but was doubtless female.</p><p>She gasps in delight. 'He can see us!'</p><p>Suddenly the room seems filled with entities. Some of them quite close, and unabashedly intimate. Without gainig an erection (salvia makes my dick shrink up for like a half hour afterwards)I become deeply aroused. I must admit, in some weird way, I think I got laid...hard.</p><p>The experience begins to ebb a little, but the gathered entities have gained a somewhat more protected air, and I get the impression some are telling others to keep their hands to themselves. There is no malicious intent, and despite the erotic component there is less a predatory sense from those being held back than the sense of children who see a basketful of tiny kitten and want to pick them up. There is also a significant sense in this manner that all those around me feel similar. imagine a group of people gathered around the basket of kittens and going 'awwwwwww'</p><p>The Dryad come back and I have this sense that we are left alone for some polite reason of privacy. She cuddles me, screws my eyes blue, and tells me all about her adventures all at the same time. Of course, her adventures are being a tree that got turned into a nice dresser, and it would make no sense to relate them, but there was a deep sense of spirit and of mind from her. Also, no small sense of acquaintance, and a passion inspired as if by too long a separation. </p><p>She climbs back into the dresser, or turns into again, whatever. As she fades from my awareness I realize that I am staring at the dresser. the wood grain patterns continue to do interesting things but it does not last long.</p><p>All told I think it lasted just over a minute.</p><p>I smoke a cigarette and take a shower. </p><p>I have not done it again since, and I no longer have the dresser, though my mother does, as one of the only furniture pieces that survived my divorce. I do wonder about her, the Dryad. And in many ways she seems as real to me still as any of the great lovers of my life. Only she was more than a lover, she was my love. I think it might be one reason I have yet to use Salvia since then. If I did it and didn't see her, I think it might break my heart. There resides in me though, as the saying goes, a confidence that she'll meet me on God's golden shore. Perhaps in our next life we could grow as trees together in the wood, with intimate knowledge of each other for centuries on end, and sharing every adventure.</p><p>Then again, she is pretty hot, and I'd probably settle for being matching end tables. You know the kind that stack? Rowr. I'll take a piece of that action any day.</p>"
}
