{
 "title": "Pharmacist's Best Kept Secret",
 "author": "Windswept",
 "citation": "   Windswept. \"Pharmacist's Best Kept Secret: experience with Tramadol (ID 46775)\". Erowid.org. Jun 19, 2007. erowid.org/exp/46775",
 "substance": "Tramadol",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46775",
   "Female",
   " ",
   "Not Given",
   "Jun 19, 2007",
   "Views: 4809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having a mother diagnosed with chronic pain has given me consistent access to pills for years. The first time she offered me Tramadol, I was rather skeptical as the literature described it as a non-narcotic. To me this sounded about as fun as popping Ibuprofen. But since I had a sore back, I tried them anyway.</p><p>First of all, I don't think they're very effective as a painkiller. A prescription-strength anti-inflammatory alleviates my pain just as well. A doctor once told me that morphine doesn't actually alter perception of pain, it just makes you feel so good you forget you hurt. Same concept with tramadol.. Twenty minutes to an hour after oral ingestion, I just get happy. Like a switch is activated in my brain,  I can pinpoint the exact moment it hits me. One second, normal, next second 'Damn I'm happy to be alive.' That's where the parallel with opiates ends, however, in my experience.</p><p>The label warns about drowsiness, but I can't take it after about two pm, if I want to sleep that night. It also causes other stimulant-like side effects like loss of appetite and dehydration. Much like meth, it becomes easy to 'zone in' on monotonous physical tasks like household cleaning , filing paperwork or even sex. The most trivial things are infused with enthusiasm. One must be careful, it's easy to start talking a mile a minute, or go on a marathon organizing/cleaning binge. At higher doses, physical effects include pinpoint pupils and profuse sweating. Twice I got heart palpitations.</p><p>I would describe the high as the bliss of Demerol minus the head-fog, and the energy/stamina of meth. There's no mental high to speak of, but reasoning and comprehension seem to be decreased. Combining it with marijuana gives me the mental high that's lacking, and counteracts the lethargy pot can induce. Best of both worlds. If I take it with Xanax, the energy of Tramadol balances the drowsiness of Xanax, isolating the calming effects of the sedative. Taking it with meth doubles the energy and concentration, but I can access the creativity and intellect that Tramadol restricts. If I wake up with a line or two, chasing it with a few Tramadol in the afternoon gives it legs, and I avoid the comedown.  Im careful with alcohol. A day in la-la land usually leaves me with an empty stomach, and it's easy to overestimate my alcohol tolerance and go into blackout territory.</p><p>In closing, I think Tramadol is the Pharmacy's best kept secret. It has the potential to be the new 'mommy's little helper'.</p>"
}
