{
 "title": "Heart Racing Panic Attack",
 "author": "straight edge",
 "citation": "   straight edge. \"Heart Racing Panic Attack: experience with Cannabis (ID 4678)\". Erowid.org. Dec 30, 2001. erowid.org/exp/4678",
 "substance": "Cannabis",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "11 hits",
   "smoked",
   "Cannabis",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4678",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Dec 30, 2001",
   "Views: 11637",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'm not an experienced drug user. I am pretty young and I had only done cannabis about 2 times prior to this experience.  During both previous times, I did not get 'stoned nor high'. I have been drunk a couple times...but nothing big. I also believed I have tripped on DXM before, but not intentionally. I have been thinking about trying some new and better drugs.</p><p>It all started one day after school on a lazy afternoon.  I was really bored and had nothing to do.  I had bought about 3 bowls of kind bud the previous week.  I thought this would be the best time to try it out.  So I filled up my really really tiny stash pipe I bought from France, lit up, etc. </p><p>The buds were beautiful. The smell was intoxicating.  I could even see crystal formations on each leaf and flower. They were in the shape of nuggets. The person I had bought it from promised me that this was high potent shit. I live in Arizona, by Mexico, so I figured it was true. This was definetly not schwag. </p><p>My intentions were to get real baked. I don't even know what I was thinking then...I didn't know how much the average user smokes to get 'baked' or anything of that sort.  In other words, I was almost clueless in smoking pot.   So I took my first hit.  Waited a few SECONDS, didn't feel anything. I did it again, didn't feel nothing...again.  I had no idea how long weed takes to kick in, but for some reason I was thinking only a few seconds. I ended up taking 11 hits or so of HIGH POTENT bud.  </p><p>I kept looking at my backyard door to see if the effects were starting yet.  Nothing. I decided to give up on weed forever since this was the third or fourth time I smoked and didn't feel anything.  About five minutes to ten minutes later, I began hearing a loud buzzing, humming noise. It was really wierd. I checked myself in the mirror and of course my eyes were bloodshot. I smiled to myself and thought maybe this will work afterall. Then I began to experience drymouth and an increased appetite.  I smiled some more. </p><p>After about twenty minutes into the experience, my heart began palpatating. Very fast. I could feel it beat through my sweater very fast. Damnit it beat fucking fast! I began to get scared. I measured my heart rate and it was probably around 160bpm. I didn't know if this was normal or what.  So I jumped on my computer straight to erowid.org to check out effects of cannabis. I found out heart rate higher than 150-180bpm could be bad news. I was terrified. </p><p>I began to panic. I mean fucking PANIC. I was hyperventalating...I almost lost it. I measured my heart rate again and this time it was 200bpm...I fucking lost it!! I don't know if it was impaired judgment, paranoia, or the heart fluttering that made it seem to beat faster that made me think my heart rate was 200 bpm. I was experiencing a panic attack. I don't think I knew at the time...I was just really scared. I thought my heart was going to blow up. I didn't know what to do. </p><p>I was powerwalking around my kitchen and house at this time. I was going to call 911 but thought of the consequences. BAD consequences. I was so goddamned close to calling them...I'm so glad I did not. So I called my friend. I told her what happened and she said if anything happened she would come over. I was so relieved to talk to someone but i felt my heart pumping through my chest at this point faster than ever. I measured again: 250bpm. Yikes!! Somehow, I got through it. ....slllooooowwwwwllly, I began to calm down and come down.</p><p>After this scary experience, I re analyzed. I don't think my heart was going 250 bpm. But I believe my heart rate was close enough to put me in danger. My heart is usually faster than the normal heartrate anyways, since I have low blood pressure. </p><p>I was also disappointed that I didn't even get stoned. No hallucinations, no nothing. Just a fucking panic attack that scared the living shit out of me. Ironic as it may seem, I will definetly try cannabis again, only at a much smaller dose. I know now what to do and what not to do. And I will most definatley do my homework before trying new shit out.</p>"
}
