{
 "title": "We Are All One Mind",
 "author": "anonymous",
 "citation": "   anonymous. \"We Are All One Mind: experience with B. caapi &  M. hostilis (ID 46791)\". Erowid.org. Dec 9, 2005. erowid.org/exp/46791",
 "substance": "B. caapi &  M. hostilis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Banisteriopsis caapi",
   "(tea)",
   " ",
   "  ",
   " ",
   "Mimosa tenuiflora",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 46791",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 9, 2005",
   "Views: 12670",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nSo the brew wasn't new to me this time, I had tried twice before, once using syrian rue extract for the MAOI but after mixing that into the boiled down rootbark it proved unable to keep down, everyone who drank some puked within minutes.</p><p>Lesson learned, tried again with 40g mimosa and 60g (roughly) caapi, reduced first extraction down to maybe 10 ounces of very dark liquid. myself and three other friends consumed half a shotglass full after some serious mental preparation, effects felt very quickly within 20 minutes, very nice and light, tingly body high, closed eye visuals, nothing to intense, descision was made for myself and two others to consume a full shot each...ouch...we were in a friends bedroom at 4 A.M. ish, everyone laid down, we talked a little until it came on full strength, at which time, no one spoke for what seemed like lifetimes and we were all consumed by our internal realities that were blossoming right before our eyes.</p><p>I remember seeing this giant crystal, and this crystal contained the understanding of DNA and was perfectly holographic and all information in the cosmos was kept here, then as I stood in awe of its perfection it reached out with a crystalline 'Arm' and touch what was once void and in an instant a galaxy evolved from aparrently nothing. Millions of different races spawned in moments...I was faced with what I had always suspected, life birthing life, somehow a respository of information....</p><p>I visited the Akashic Records as I had on many occasions though this time the vividness was unsurpassed, many questions I had long pondered were answered.</p><p>Remember folks, DMT is endogenous, meaning created in your brain and spinal cord, right now, as you sit and read this.</p><p>There were many different facets to the trip, all guided by the most beautiful fractal imagery I have ever witnessed.</p><p>I could go on and on but I hope I will leave you with the thirst to find truth.</p>"
}
