{
 "title": "Real-Time Geek Report",
 "author": "bluedolphin",
 "citation": " bluedolphin. \"Real-Time Geek Report: experience with BZP (ID 46860)\". Erowid.org. Oct 24, 2005. erowid.org/exp/46860",
 "substance": "BZP",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "225 mg",
   "oral",
   "Piperazines - BZP",
   "(capsule)",
   " T+ 3:00",
   " ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46860",
   "Male",
   "",
   "Not Given",
   "Oct 24, 2005",
   "28889",
   " "
  ]
 ],
 "report": "<p>I've tried BZP a few times before at doses between 150mg - 200mg and thought it was basically similar to Adderall except maybe a little bit more fun and a little bit less focused. Anyway, today I am going to eat some with the intent of practicing guitar for a few hours. Adderall always gives me excellent focus while playing and usually makes me play a little faster, if not better. So we'll see how BZP works in this situation. I haven't done a report in this format in a long time but this isn't really a 'trip' with deep insights or anything, and I don't want to take the time to write it afterwards, so here we go:</p><p>4:20pm (T+0:00h)</p><p>I swallow 2 gel caps with a total of 225mg BZP. I am going to take a shower and brush my teeth now.</p><p>4:50pm</p><p>I started to feel first alerts about 10 minutes after I swallowed the caps. By this point I feel kind of like I'm coming up on 20mg of Adderall. I am very awake, have a very light tingling sensation in my body, and easily distractable. I am slightly nauseous, most likely from eating the BZP so soon after I had a bunch of eggs for breakfast. My heartrate is elevated about 50% above resting rate. Unfortunately I have also lost the desire to play guitar, but I'm sure that can easily be fixed by listening to some good tunes. Actually, I think I'll start to listen to that new Breakfast show I just downloaded. That should get me in the mood.</p><p>5:12pm</p><p>Well now I am buzzed a bit more, a bit stronger than 20mg of Adderall would feel to me, although I have a little amphetamine tolerance (but not much). I spent the last 10 minutes cleaning gunk off my strings and off my fretboard. This chemical definitely makes me a bit O.C.D.</p><p>5:36pm</p><p>Just jammed out to Mooboo's Voodoo by Breakfast... this stuff definitely is similar to Adderall. My playing is a little faster (at top speed), more confident, not sure if more accurate but considering I'm playing closer to top speed, maybe. Then again I'm pretty comfortable with this particular jam and usually have no problem shreddin it up. I am pretty much only interested in playing lead solo along to jammy songs right now, cuz it's fun as hell and I'm on piperazine-speed... so anyway back to playin.</p><p>5:54pm</p><p>Played some Max Creek but it's too slow. I don't have the patience for these old dudes right now. I'm gonna take a break and check my email and stuff. Feeling a slight bit dehydrated so I chugged some water.</p><p>6:48pm</p><p>Feel the same as I did an hour ago. Playing some Strangefolk and Breakfast, nice fast tunes and all the while I'm pushing the limits of my skills. But I'm just gettin warmed up ... time to play some Steve Kimock stuff and slow down the pace for a few minutes.</p><p>7:03pm</p><p>My fingers are tingling from all the work they've been doing, and not tired at all (normally they probably would be getting a bit tired and my high-speed accuracy might be suffering after a couple hours of intense jams), actually I have a bit of a tactile buzz overall. I'm still peaking on the BZP and I'm a bit more focused and less O.C.D. now that it's settled in. The last jam I played was Tongue n' Groove by Steve Kimock and I rocked that on a professional level. Hell yeah. Well I'm feelin' really good about my playing today, as I almost always do when I play guitar on amphetamine-like substances.</p><p>7:11pm</p><p>I'm going to go sip some rum and coke and watch TV. New Family Guy and Simpsons tonight! Based on my past experiences with BZP I expect to start coming down in an hour or two, as it doesn't last as long as amphetamine.</p><p>10:31pm</p><p>The new Family Guy was hilarious. I can't say I really feel the BZP anymore but then again over the last couple hours I managed to get pretty drunk and stoned. I would expect it to be mostly worn off by now anyway.</p><p>...</p><p>Overall BZP is a lot like amphetamine except it is a bit less focused, and I'd have to say a bit more 'fun' like cocaine. Maybe there is more of a dopamine element to the way this chemical works. I don't think BZP is any bit worse than speed, at least in terms of immediate effects and noticeable side effects, the primary difference being that the duration is only 2/3 or 1/2 as long.</p>"
}
