{
 "title": "Long Time Use",
 "author": "Minty Fresh",
 "citation": "   Minty Fresh. \"Long Time Use: experience with Gabapentin & Bupropion (ID 46902)\". Erowid.org. Aug 29, 2007. erowid.org/exp/46902",
 "substance": "Gabapentin & Bupropion",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Gabapentin",
   "(daily)",
   " ",
   "150 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46902",
   "Female",
   " ",
   "Not Given",
   "Aug 29, 2007",
   "Views: 57204",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was first prescribed Neurontin while I was in-patient at a psychiatric facility in 2000. I was misdiagnosed (AGAIN) as having Bipolar II disorder and the Neurontin was to be used a mood stabilizer (I was diagnosed BPII because SSRIs throw me into mania - other than that I do not have hypomania). I was 'in' for a major depressive disorder and given antidepressants and they were trying to prevent mania I think.</p><p>Psychiatry is a guessing game and all psych patients are guinea pigs at one time or another - trust me - I have been a patient off and on for 32 years. I have Post Traumatic Stress Disorder from childhood sexual abuse and severe PMS (PMDD) but other than that, I am mentally ok - actually pretty well-adjusted most of the time. Well, I got home with my 'N' and was supposed to start out taking like 300 mgs twice a day or something, and since I was miserable and quite ill (and a long time controlled substance adventurer) so naturally I take 900 mgs. (my thinking was 'You cannot overdose - the more you take the less you 'get'')</p><p>About 2 hours or so after taking the 'N' I went from feeling like I weighed 400 lbs (I'm very tall and skinny as hell) and like I could cry any second to spinning Deadhead style barefoot in the lawn of my backyard talking to my Mom about God on the phone. (We do often talk religion). SO! I was 'euphoric' and after being so sick for so many months I felt like I found a miracle. I've never felt so great in my life - even when I was high on good weed.</p><p>The next morning I was washing my hair and BAM!! Some old 50's song that I probably hadn't heard in 20 years CAME ON IN MY HEAD like I was hearing it from outside (now I know what it must be like for folks who 'hear voices'). I wasn't afraid, I was FASCINATED! I have tripped about 10 times in my life so I was VERY COOL with this! What could be going on in my brain to make me spontaneously hear music? We all get 'songs in our head' but these play all the way through and they are clear. It stops in between doses (4 hour half-life?) and continues 20 minutes after another dose.</p><p>Well, I reported this to my Dr. that day and because I felt 'euphoric' (and they didn't believe me about the mental juke box on free play) they took me off of it and put me on, OMG! Depakote. I guess they were afraid I'd think I was the Queen of England or something - God they can be stupid! I was SAD not crazy.</p><p>For a year I was so sick I had a gallbladder function test and then endoscopy to look for ulcers. All Depakote, but that leads me to where I fired my 20th psychiatrist and got a new, improved one. I told her how great I felt on Neurontin and asked could we try it again since I can't take SSRIs - they make me really, really sick and I never would 'get over it' with time like they claimed I would. Serzone almost killed me.</p><p>Back on Neurontin (2400 mgs daily or less) I became very social, very gregarious, even taking to singing out loud around people (which I would never, ever do before). Music became something all new to me - it sounds so different and I can tap out fast as hell metal riffs without missing a beat. I became almost addicted to System of a Down.</p><p>Now, the downside. The drug makes me a moron. I can't spell things, or find the right word for something. I have memory problems. Long-term memory glitches like being unable to remember all of the Rolling Stones names without a concerted mental effort. Things I used to just grab right away become elusive. There is sexual dysfunction, delayed or impossible to orgasm and a general lack of desire most of the time, but this can be remedied by skipping a dose or two. I also experience urine retention, but I think this is because I can't 'feel it' when I have to go. When I do urinate it's like I drank a 12 pack of beer.</p><p>So! Now I need some feedback on this.  I am addicted. I have tried to stop taking 'N' when I lost my health insurance (it's over $600 a month now AND I try not to take all that were Rxed unless I am feeling crappy, like with PMS) I am a recovering alcoholic (10 years) and I KNOW when I am addicted to something. The 'withdrawal' symptoms are;</p><p>1. After 24 hours the first sign is intense itching - my face, hands and feet mostly, but it keeps getting worse until I'm yelling about it. One hair across my face and I am violently rubbing it.</p><p>2. I get very hot and then very cold.</p><p>3. Insomnia</p><p>4. Extreme irritability - really extreme, like yelling at bank tellers and store clerks.</p><p>5. That craving feeling comes on</p><p>This has lasted for two weeks with no let up. I eventually go crazy and cry all day and can't get out of bed. I figured I'd never be able to live without it, or no one would ever be able to live WITH me, so I borrowed some money to get it refilled. I have gone without food to have 'N', and by the way, I don't feel hunger and along with the Wellbutrin I take (150 SR one a day) I don't eat unless I smoke some pot.</p><p>Now, I have taken 'N' with and without smoking pot for extended periods (I was burnt to a crisp (1/2 oz per week for 4 years of serious dankness) and lazy as hell so I took a year off from weed). It's very, very pleasant with weed, (what isn't?) but if I O.D. on the weed and 'N' I nod off like a heroin junkie. But it's still nice, especially if I can't sleep. Not good for parties, though. Drooling moron! I hope someone else out there thinks they are addicted for life to this ALLEGED non-addictive medication.</p><p>I would LOVE to be able to feel good again without Neurontin. I'm afraid my kidneys will blow out on me. Plus, it would be nice to be able to pay the damn rent! I suppose I have a GABA problem in my brain and that made me shy and grumpy for most of my life, maybe even alcoholic. Neurontin is so much more than they say it is.</p>"
}
