{
 "title": "Hallucinogen Persisting Perception Disorder",
 "author": "Nick",
 "citation": "   Nick. \"Hallucinogen Persisting Perception Disorder: experience with LSD (ID 46958)\". Erowid.org. Sep 21, 2007. erowid.org/exp/46958",
 "substance": "LSD",
 "bodyweight": "119 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 46958",
   "Male",
   " ",
   "Not Given",
   "Sep 21, 2007",
   "Views: 7502",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been a chronic LSD user for quite a while now. I loved the world it brought me to and enjoyed it maybe a few times too much. </p><p>After the first time I did LSD I noticed the world looked just a bit different to me. There was a little something just 'different' with my vision. Things looked farther away then usual and words waved a little bit. I thought it was nothing, did LSD again and these strange new visual distortions actually disappeared. Then I did it again... and again, again, and again thinking there was no damage done to me at all. I continued chronic LSD use for weeks on end. </p><p>One monday, over a week ago. I became so dependant on this strange drug that even though I was sick in bed I still reached for a hit. I did the hit, tripped out and had the time of me life but then I couldn't sleep. The next day I continued on, went to school and noticed that I was still hallusinating. I told everone that it was just because I haden't slept yet and I thought it was. Days passed, still no sleep, until one day I took some NyQuil and finally closed my eyes and drifted off. </p><p>I woke up the next morning, and thought 'good, now that I've slept all these reacurring hallusinations have stopped!' then I took a look around my room and realized I was wrong. The walls were still melting, I was seeing faces and eyes (reacurring hallusinations) everywhere, my blank grey walls appeared to have neon flashes and patterns all over them. </p><p>I searched the internet for permanent damage LSD could do to people but all I got was information on 'flashbacks' and thought nothing of it. I continued on with my life. Another few days passed, still hallusinating like mad. Not tripping out, just hallusinating still. Words still melting, walls, floors and ceilings still waves and faces, eyes and tribal patterns still appeared everywhere! I almost snapped but instead, decided to get a grip and accept that this may be permanent.</p><p>Today I was diagnosed with HPPD: Hallucinogen Persisting Perception Disorder. Basically I am type 2 which is consistant visual disturbances 24 hours a day, and it may be for the rest of my life. I've gotten used to everything around me melting, seeing things when I close my eyes and blank walls appearing to flash and show my patterns. It's now a part of my everyday life.</p><p>Have fun, and just take this as a personal warning. If it has happened to me, it can happen to you. I don't know if I will ever again be able to touch LSD though I'm sure I will again, though it just may make my condition worse.</p>"
}
