{
 "title": "Chilled Out",
 "author": "Austin",
 "citation": "   Austin. \"Chilled Out: experience with Damiana & Skullcap (ID 47012)\". Erowid.org. Dec 4, 2006. erowid.org/exp/47012",
 "substance": "Damiana & Skullcap",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 Tbsp",
   "oral",
   "Damiana",
   "(tea)",
   "  T+ 0:00",
   "1 Tbsp",
   "oral",
   "Skullcap",
   "(tea)",
   "  T+ 1:30",
   "2 bowls",
   "smoked",
   "Damiana",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47012",
   "Male",
   " ",
   "Not Given",
   "Dec 4, 2006",
   "Views: 27618",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Tea Preparation:</p><p>1 Tablespoon Damiana</p><p>1 Tablespoon Scullcap</p><p>1 1/2 Cups Of Water (about a half cup will be boiled away)</p><p>1 Tablespoon Sugar</p><p>I brought the water to a boil and added the herbs.  Boiled for 10 minutes stirring occasionally.  Strained mixture through a coffee filter into a glass measuring cup.  After boiling I was left with just a bit over 1 cup of the tea.  It didn't really smell that great, so I did not have high hopes for a good taste.</p><p>5:30 T-0:00  Drank the tea down real fast.  It didn't taste bad at all!  It had a strong odor and a dark golden color (kind of like urine).  The sugar might have helped the taste, which was somewhat bitter.</p><p>6:00 T-0:30  I feel quite relaxed right now, kind of like a very mild stoned feeling.  I'm interested in where this is going.  I put on some music.  I'm kind of paranoid and I don't usually get paranoid.</p><p>6:15 T-0:45  Maybe I need to wait it out a while longer, I took a pretty good dose of tea and effects are very mild still.  Music sounds really good.  I'm getting tired.  I'll give it more time.</p><p>7:00 T-1:30  Still feeling the mild high off the tea, I smoke a couple bowls of damiana through a water pipe.  Pleasant smoking experience...I feel quite stoned after this.</p><p>7:15 T-1:45 WOW!!  I'm spacing out bad.  I feel like a smoked a joint of some goooood weed.  I never expected this kind of a euphoria, this is great.</p><p>7:45 T-2:15  For the last 20 minutes or so I have felt a gradual comedown off the high and anything I am feeling right now is very mild.</p><p>All in all it was a good experience.  I'm not sure If I felt much effects from the tea, it was barely anything.  When I smoked the 2 bowls I felt a great high for about a half an hour, which is pretty awesome considering I paid $1 for my ounce of Damiana.</p>"
}
