{
 "title": "Yet Another 'Realilty'",
 "author": "JC",
 "citation": "   JC. \"Yet Another 'Realilty': experience with Salvia divinorum (20x extract) (ID 47015)\". Erowid.org. Dec 30, 2007. erowid.org/exp/47015",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47015",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 30, 2007",
   "Views: 2423",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is not my first encounter with Salvia Divinorum, however it is probably the most intense 'trip' it has provided me with so far.</p><p>First off, let me state that I'm by no means an experienced drug user. I've been smoking marijuana for the last 4 months and have only recently, out of curiosity, decided to try Salvia.</p><p>I have somewhat of a fascination with the way in which our mind interprets 'reality' and often find myself questioning reality itself. I'll emphasize this thought a little later on. Now, without further ado; My Salvia Divinorum reality compromise!</p><p>-------------</p><p>For this trip, I was at a friends house (here forth deemed: Friend-A). Another friend was also present (here forth deemed: Friend-B). The plan was to each take a turn while the other two served as 'sitters'. We waited until Friend-A's parents and siblings were all asleep before Friend-A broke out a home-made water bong made from an empty 'Pringles' cardboard tube. Yes, I know. It doesn't get much more ghetto than that...</p><p>I filled it with water and when I returned to Friend-A's bedroom I was greeted with a small package of '20x Salvia Divinorum'. Not sure how much I needed, I tapped the bag until a small mound of the dark flakes had collected and was told by Friend-B 'That'll get you fucked.' I asked who was to go first and they both said that I should. Having no objections I took the water bong over to the window and lit up.</p><p>Having the understanding that Salvinorin-A is released under very high temperatures, I kept the lighter on throughout the entire hit and saw that it was burning a very hot red, almost white glow that took moments to fade even after I put the bong down. Even using a water bong, the smoke still became quite hot as I neared the end. Not wanting to waste any Salvia, I endured it and handed the bong to Friend-A. Holding my breath, I moved away from the window onto the bed where I sat myself down comfortably as I waited for the effects to set in. After about 30 seconds I exhaled. I explained to my friends how, like previous trips, I can sort of feel reality slipping. My vision seems to move down and to the left a bit, and vision seems to lag slightly behind if I turn my head.</p><p>During all my salvia trips including this one, I always have a consistent feeling near the beginning. I feel like I'm going to feel a little distorted, but the salvia isn't going to do anything significant. I feel that I still 'see' reality. I still 'see' my friends, so there is no way that salvia can really take me much further. And like always, I was wrong.</p><p>It started out with me simply trying to explain how I felt. I would simply try to tell my friends that I feel distorted, but that I'm still very aware of the fact that I'm on salvia, and that I'm in control. From that point, things steadily changed. They would laugh when I tried to speak to them. I was confused. I hadn't said anything funny as far as I knew (later, I'm told I was speaking complete gibberish). Each time I spoke they would laugh, exchange glances, and then both set their gazes on me. </p><p>At this point I simply said 'What the hell?' Immediately they started laughing at me again. Knowing that they wouldn't be laughing so hysterically at nothing, I began to wonder if something was wrong with me. I had now completely forgotten that I had smoked any salvia (which is where things really started to feel real). I was extremely confused. In my confusion, I said again 'What the hell?' Once again, they burst out laughing but continue to watch me, waiting for what I'll do next. I don't understand why they are laughing at me, which is why I keep saying 'What the hell?' I'm thinking to myself 'What the hell are you doing.. why are you staring at me.. and why do you laugh every time I speak?'</p><p>And then it hits me. I suddenly realize that I'm in a constant loop. The best way I could describe it would be in comparison to a progress bar of a process on a computer, going from 0% - 100%. In this loop, I would say 'What the hell?' and that would be a certain percentage, and then Friend-A and Friend-B would laugh at me, completing the loop and taking it to 100%. After it hit 100%, it would go back to 0% and start over. I said 'What the hell?' again, and they laughed. I did this multiple times to see if they laughed each time, and sure enough, they did. I told them 'Stop it'. It felt like I had to focus all my energy to say any words other than 'What the hell'. They looks at me, and in my reality they were thinking something along the lines of 'You cannot break the loops, you are slowing the cycle, but eventually it will make 100% and start over.' </p><p>At this point I can't seem to form the words for the feeling I had. I could actually SEE the pattern. I could see that I was in my friends bedroom, in the dark, with the glow of his computer monitor in my peripherals. At the same time though, I could visually SEE the pattern of the loops forming the reality of 'life' as we know it. I was the only one that could see it, but I couldn't communicate to my friends to help break the cycle to free me. I was trapped.</p><p>At one point, I simply stopped speaking. I thought that if I don't start the loop, then they can't finish it. Sure enough it seems to work. The loop progress didn't stay at 0% though. It seems that it was trying to work around it to complete the loop in a different manner. Visually I saw that it was working and was scared that I truly couldn't do anything about it. That is when I saw Friend-A, who was now watching some anime on the computer, reaching for the monitor to turn it off. His monitor was the only source of light in the room, and I thought that if the light was gone I would have absolutely no connection to any means of reality at all. I quickly barked at him 'Don't touch it'.</p><p>I then suddenly became aware of a presence within the monitor. His anime was speaking complete english! I saw that he was clicking things on the computer and I feared he would turn off the presence in his monitor. I told him 'Don't touch that! Stop pressing things!' He dismissed my orders and continued to press and click things on the computer. I knew that the anime was originally Japanese, so I was amazed that somehow they were now speaking fluent english to me. I leaned closer to attempt reading the sub-title translations to see if their audible english matched the sub-titles. It wasn't, and they told this to me themselves. They said that they were my only connection to reality and that Friend-A was trying to turn them off.</p><p>At this point Friend-A looked at me and was beginning to speak normal sentences to me. Skeptical that it didn't quite fit in with the 'loops' and replied and found that I could communicate with him again. The reality of the loops still felt very real, but I began to realize that I was no longer bound to them. I kept trying to make conversation as to make sure I don't get trapped in the loops again. For a while I just stared at the anime. They were still speaking english, though it was quiet and hard to make out. They were trying to warn me about something. At this point I was now aware that I had smoked salvia. Though it's effects still felt very real, I dismissed them, putting my faith in the fact that I had smoked salvia and just assumed that all I felt to be right would fade and I'd fully regain my normal consciousness again.</p><p>-------------</p><p>I believe at this point it had been about 6-7 minutes since I smoked the salvia. I am writing this the day after, and I still clearly remember how real it felt. The amazing thing is, while I was on it, everything I was seeing, feeling, etc. was all REAL to me. For me, it brings into question what 'real' actually is. It was no less real than sober reality. So what make's one perspective of reality more right than another.</p><p>Salvia is the first and only hallucinogen that I've used to date so I cannot compare the intensity of salvia to anything other drug experiences. I would definitely not recommend the drug to anyone just looking for a good time. The experiences can be very abstract, sometimes scary, and very impressionable. I spend hours thinking and reflecting on my experiences and I'm still in awe of the immense abilities of salvia to effect the mind.</p>"
}
