{
 "title": "Figments of my Imagination",
 "author": "Matt Robinson",
 "citation": "   Matt Robinson. \"Figments of my Imagination: experience with Salvia Divinorum (13x extract) (ID 47029)\". Erowid.org. Jan 22, 2008. erowid.org/exp/47029",
 "substance": "Salvia Divinorum (13x extract)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47029",
   "Male",
   " ",
   "Not Given",
   "Jan 22, 2008",
   "3226",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experiences range from 2003 to yesterday, October 11, 2005.  My first experience was a mild one; I felt slightly pushed to one side, and I was giggling a bit.  A friend's very long hair seemed to leave trails of dark rainbows in the air.  Other weaker experiences involved temporary paralysis; my head was pushed down to my desk, I could not move it for a few seconds, and I saw what I can only describe as another plane or dimention right there before my eyes that it seemed I could have stepped into, had I been able to move.  I remember thinking it was much like a video game - Super Mario World, as I called it, not knowing any other way to describe it.  On multiple occasions when I was not sure what to expect, I went numb and dropped the bong, or tipped it over, spilling water everywhere.  </p><p>The first very strong experience I had, I began speaking words that I had never heard before.  At first I could not control this language that flowed from my lips, but after a short time, I realized that I was, for lack of a more accurate description, 'speaking in tongues.'  On two seperate occasions I sat down at my computer, and a friend's (two different operating systems, both of which I am very familiar with, but seemed foreign to me at the time) and managed to pull up a word processor and type a small fraction of these strange words I was hearing and saying.</p><p>The 'Salvia Language' has never since occurred, but my experiences continue to get more intense.  On multiple occasions, I have felt as though I am being 'torn apart' from the inside, simultaneously recognizing spiraling shapes remarkably similar to ones made by using the Fibonacci Ratio (1:1:2:3:5:8:13:.....).  This led to a phase where I produced a lot of Salvia-influenced drawings - decent art by amateur standards.  Immediately after the pipe hit, there is always an occurance which I can only describe as amnesia; just about every time I 'black out' only to awaken in a world which feels much more real than this one.</p><p>The most unbelievable, shocking, and intense effects occurred yesterday evening, 10/11/05.  I hadn't smoked Salvia in many months, perhaps even a year had passed.  Let me emphasize that I still DO NOT remember exhaling the smoke yesterday.  This is a first because usually the effects occur shortly after or during exhalation.  A few seconds after I inhaled, I felt the typical fuzzy feeling and remembered what it was like to be on Salvia.  But after that, everything changed.  I blacked out, and the first thing I recognized was auditory hallucinations that have occurred during previous trips.  The only thing I can liken it to while not under the immediate influence of the substance is hearing very long, nonsensical words starting with each letter of the alphabet spoken very rapidly, in reverse alphabetical order.  These sounds normally dictate what I see and feel, and, per usual, I began to have sensations of being 'torn apart' from the inside.  Normally though, I can still recognize my surroundings.</p><p>Yesterday was frighteningly different.  My mind AND body (or so it seemed) were completely seperated from reality as I have ever known it, and as I realized I was in a completely different place, I attempted to get up and run away.  The effects pinned me down, and for a brief moment I was being held against my will in this strange place.  That instant was the most terrifying experience of my life.  I can liken it to the disbelief one would have if 'The Matrix' was real and one found themselves waking up in it, and over the course of a fraction of a second, he knew for a fact that everything he had ever experienced or seen or knew or loved was as unreal as any dream.  That was definitely the case for me.</p><p>After a moment, I was able to recognize my 'earthly' surroundings again, but was still stuck in this 'Salvia World.'  It made me think of what it must feel like to die; one's soul leaving and everything he surrounds himself with is seen from outside his own body, the soul struggling in vain to reenter the lifeless corpse, feeling forever stuck outside of what he always knew was real.  This, again, was not unlike my experience.  After another moment, I was able to walk again, and my first instinct was to find my phone and call my friend to tell him what was happening, if for no other reason, than to reestablish myself in this world.  But I decided against it because, by that time, the effects had decreased to where I didn't feel like I would be able to sufficiently describe them to anyone.</p><p>For many minutes I could not do anything but walk around and say 'Oh my God,' and things like that.  I felt the overwhelming desire to be alone, hide the Salvia making sure no one could experience what I had just experienced, and make sure no one found out about what had happened or where I had 'been.'  For many hours afterwards, I could not see anything for what it is; lamps, desks, couches, computers, they all seemed to be figments of my imagination, and part of a world that seems remarkably unreal when compared to where my mind had just been.</p><p>During my literal 'out-of-body-experience,' I was alone in my house, and yet I felt as though someone was watching me suffer, and moreover, taking delight in it.  The majority of my feelings were that it was a nightmarish, truly hellish experience.</p><p>This was in addition to the normal reactions like extreme sweating, followed by chills from the excess sweat rapidly cooling my body.  I consider myself an extremely seasoned user, but last night made me reconsider anything I had previously held to be true about this misunderstood, underestimated herb.</p>"
}
