{
 "title": "Bad Combination",
 "author": "stiv",
 "citation": "   stiv. \"Bad Combination: experience with Tramadol (with Acetaminophen), Diphenyhdramine & Fentanyl (ID 47062)\". Erowid.org. Jul 18, 2006. erowid.org/exp/47062",
 "substance": "Tramadol (with Acetaminophen), Diphenyhdramine & Fentanyl",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1200 ug",
   "buccal",
   "Pharms - Fentanyl",
   " ",
   " ",
   "75 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " ",
   "650 mg",
   "oral",
   "Acetaminophen",
   "(pill / tablet)",
   " ",
   "200 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47062",
   "Male",
   " ",
   "Not Given",
   "Jul 18, 2006",
   "11974",
   " "
  ]
 ],
 "report": "<p>I had a terrible experience by mixing diphenhydramine and ultrcet one evening which almost culminated ina trip to the hospital.</p><p>I had been using actiq all day, my drug of choice and when I ran out I realized I had a few ultracet's laying around. At about 8 p.m. I dropped the two ultracets and half an hour later decided to go to bed. Since I have a large tolerance to deppressant drugs I took four sleep eze -d tabs which is equal to 200 mg. of diphenyhdramine, my usual dose for insomnia. Approximately ten minutes after taking the antihistamines I knew I was in trouble. It started with a vague sense of paranoia, which I unsucessfully tried to shake off. I turned the lights out and tried to go to sleep but the combination of drugs actually left me highly stimulated. Soon my heart was racing. I could actually see my chest beating. I woke my wife, who was not too pleased after I admitted what I had done and she helped me get dressed to go to the emergency room since I was sure I was going to have a heart attack. I forced myself to vomit but didn't see any pills fragments, by this time it had been a good hour since I had ingested the diphenyhdramine. </p><p>After I puked I started to feel a little better and slowly my racing heart returned to normal. The whole incident probably lasted 2 hours but was the most frightening incident of my life.</p>"
}
