{
 "title": "Avoiding Sleep",
 "author": "G S",
 "citation": "   G S. \"Avoiding Sleep: experience with Adrafinil (ID 47085)\". Erowid.org. Apr 18, 2007. erowid.org/exp/47085",
 "substance": "Adrafinil",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Adrafinil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47085",
   "Male",
   " ",
   "Not Given",
   "Apr 18, 2007",
   "Views: 8666",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having kept track of Modafinil, but not using it for a number of uyears expecting something terribly unsafe about it to arise, I finally ordered some Adrafinil to give it a try this past month.</p><p>My goal in using this drug was not to enhance my wakefulness during a normal day, but to avoid sleep altogether for several consecutive days.  The plan was to take two 300mg tablets three times a day, at eight hour intervals.  I wanted to stay awake from Monday morning, until Wednesday evening.</p><p>For my first experience, I woke up at 11 AM, and took two 300mg pills at noon.  I took two more at 8 PM.  at 4 AM, I was feeling a little drowsy, I assumed because I hadn't had a lot of sleep the night before, perhaps 5-6 hours.  I took my two pills, thinking they'd keep me up.  Around 7 AM on Day 2, I decided I would need to more evenly space out the dosage, so I started taking one pill every four hours.  This seemed to alleviate any tiredness, until about 8 PM on Day 2 at work.  At this point, I started feeling very tired.  I do work a tedious, inactive job, but this drug was supposed to keep me awake and alert, so I was disappointed.  I decided that perhaps I should increase the dosage to a pill every 3.5 hours, which I started doing.  The rest of the esxperience went fine.   I took my last pill at 7 PM on Wednesday, got home from work, and sleep for 9 hours.  Felt fine the next day.</p><p>The only side effect was known prior - my urine smelled odd.  Thankfully not evacuate-the-washroom odd, and the smell doesn't linger.</p><p>I seem to have normal recollection of everything I did and read. I used the spare time to read, mostly.  I stayed away from all other substance use, as well as strenuous physical activity.  Only worrisome part was that I did get drowsy both on the first night, and in the evening of Day 2. Due to my later experience (below), though, I think this may be somewhat unavoidable if you aren't keeping yourself stimulating either physically or mentally.</p><p>As I write this, I am at the end of another session, however this time it's three sleepless nights instead of two.  I started taking it at noon Tuesday, a single dose, continuing with another dose every 3.5 hours.  Again, I got a bit drowsy the first night, but a cold splash of water and some household chores woke me up.  And, again, I got drowsy on Day 2, in the evening. This time, my job was even more mind numbing than normal, though, and there was no way for me to try to fight it off except for willpower.  Not fun, and my only major qualm with the drug.</p><p>I'll be going to sleep tonight, but decided not to wait to write this as I don't foresee any complications arising.  The only other drugs I've done is the standard alcohol and marijuana, so I can't compare this to other stimulants that might be available.  It appears the other submitted experiences were talking of using the drug to enhance awareness.  I didn't experience that effect to a noticeable degree, and no one commented on my behaviour being different.</p>"
}
