{
 "title": "Stronger than Caffeine -- Yohimbe",
 "author": "Divalion",
 "citation": "   Divalion. \"Stronger than Caffeine -- Yohimbe: experience with Yohimbe (ID 4708)\". Erowid.org. Jan 19, 2001. erowid.org/exp/4708",
 "substance": "Yohimbe",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "225 mg",
   "oral",
   "Yohimbe",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 4708",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 19, 2001",
   "Views: 25647",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nWell, I'm always curious about natural herbs and highs, so I decided to experiment with yohimbe bark. I didn't expect much, most reports I heard were vague and unhelpful. So I took 2 tablets, each containing 112.5mg yohimbe bark (or 8mg yohimbimine) at around 9:00 pm. I sat down at my computer and started chatting with my friends.\r\nI got so involved in conversation I had completly forgotten about the yohimbe.  Then around 9:30 I began to feel cold, which I thought was strange since I was pretty bundled up. Soon after I began shaking violently. I thought I was getting sick or something, and I put on more clothes.  Then I began sweating and just generally felt like I was on speed or a megadose or caffeine or ephedra. At this point I remembered about the yohimbe! \r\nI also noted a slight discomfort of the stomach, but nearly as bad as I had heard others complain about from taking the herb. The extreme hyperactivity lasted about an hour, and after that I began to enjoy it a bit more. I put on some trance music and just kinda rocked out by myself, having a generally good time.\r\nWell, at about 2:00am I decided I should probably go to sleep, so I went to bed. I layed in bed for over two hours, then said screw it and came back to the computer. its now almost 6:00 in the morning, and I don't feel the least bit tired. \r\nThis herb certainly has its time and place. I'll definitely use it again, maybe I'll try a smaller dose in a different setting.\n\n\n"
}
