{
 "title": "I can't do anything except what I am doing",
 "author": "Metasyn",
 "citation": "   Metasyn. \"I can't do anything except what I am doing: experience with 4-HO-DIPT (ID 47130)\". Erowid.org. Dec 18, 2005. erowid.org/exp/47130",
 "substance": "4-HO-DIPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "4-HO-DiPT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 47130",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 18, 2005",
   "Views: 13112",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my third time with iprocin (4-HO-DIPT).  The first two times were with approximately 10mg and 15mg respectively, which both resulted in rather mild but potentially intriguing experiences.  This time, with more like 25mg, was considerably more intense.  Note: all doses were eyeballed (not even by myself), so they are loose estimates based on the intensity of others' trip reports.  </p><p>10/6/05</p><p>6:00pm ingested somewhere around 25mg swallowed in capsule.  Have had nothing to eat for several hours.  Mindset is anticipatory and prepared for a strong trip.</p><p>T+0:35 Minor tryptamine body buzz.  I feel relaxed, almost lethargic.</p><p>T+0:50 Mild +. I'm a little frustrated at the mildness and slow come-up.  I'm worried that the material has degraded becuase 50 minutes is a long time to wait to feel something on this drug - especially with reports of strong alerts in 15 minutes.</p><p>T+1:00 Relaxed and drifty ++.  The tryptamine feel is very warm, enveloping, and comforting - like its bubbling up from inside of me.  This is probably as intense as my last 15 mg experience.  </p><p>T+1:15 I am suddenly quite energetic (a no-longer-quite-so-mild ++).  Rapidly ascending.  Very FUN feeling - there is a distinct 5-MeO-DIPT type body energy that is becoming more and more pronounced.</p><p>T+1:20  This is very intense but not at all what I expected.  There are no visuals to speak of ... it is very body oriented. Jittery.  Mentally I jump quickly from one thought to another without much depth.  But simply moving THROUGH this galactic energy field that my thoughts are immersed in is so beautiful.  Speaking of energy, I am literally not able to stop moving, even for a few moments.  Either my muscles tremor uncontrollably or else I have to channel that energy into dancing around, which I do to great enjoyment.  It is as if the drug wants me to oscillate at a specific vibrational frequency - for what purpose I don't know.</p><p>T+1:30-45 +++.  I can't do anything except what I'm doing.  I can't imagine doing anything except what I'm doing.  Have I always been doing this?  The experience is totally enveloping.  'Just +++ smashed' (from TiHKAL) is as apt a description as is possible.  There is a deep euphoria and contentedness with the world.  What difference does anything make?  Things will happen as they happen and you're either along for the ride or else continually fighting the ride. Analyzing it while you're going along is probably not even worth it.  Just ENJOY it for what it is because if you just relaxed it WILL be beautiful.  It is what it is. </p><p>T+2:00 I have passed the peak and am slowly coming down.  Still +++, but the intrusive energy felt earlier has evaporated and now things feel very gentle.  Deep.  I try drawing.  Things feel gloriously chaotic and I am well in tune with the quantum mechanical improbabilities of the universe.. </p><p>T+2:30 ++.  I feel downright fantastic.</p><p>T+2:45 +</p><p>T+3:00 Largely baseline with an empathic and lucid afterglow.  Amazing.</p><p>T+7:00 Sleep difficult, as is typical for me after a psychedelic experience, no matter how baseline I feel.</p><p>This was a wonderful experience by any standards, and I was quite amazed at the rapidity of comeup, peak, and comedown - even though it took longer to hit than expected. The body buzz was almost annoying, but not too bad since I was able to channel it well and it lasted for at most an hour. Similar to a 5-MeO-DIPT trip, for me the experience seems divided into an ascent dominated by body energy and a plateau and descent that is much more mental/emotional.</p><p>I liked this chemical but at this dose I feel it lacked the spiritual depth of mushrooms or the malleability of many of the phenethylamines. For most of the trip I was mentally scattered, buzzing and euphoric but unable to do anything else except experience it. Perhaps revisiting it at a similar or higher dose will reveal it more meaningful, since the first time seeing the true colors of a psychedelic you are often put in the observer's role. It was surely an intense little trip however, the short duration of which is a major plus.c</p>"
}
