{
 "title": "The Introduction",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The Introduction: experience with Coleus (ID 47160)\". Erowid.org. Mar 28, 2006. erowid.org/exp/47160",
 "substance": "Coleus",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Coleus",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Coleus",
   "(tea)",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47160",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 28, 2006",
   "Views: 7962",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It's 8:15 I have about 8-10 leaves drying right now drying with a piece of tinfoil and a candle. Flame is about 8 inches away from tinfoil I got the plants from where I work we have lots of landscaping and tons of different plants that I have planted personally and picked out myself.</p><p>Ive opted for smoking it tho I do have enough to eat some, if smoking does not work then I will take it to the kitchen and chop it up add some water then eat/drink the shit.</p><p>8:25 Its well that didnt take long, most of it is dry I think I have enough to try it gonna go outside and smoke a lil bit of it.</p><p>Its 8:46 just got back from trying to kill the whole bowl. I feel kinda stoned, definitely feel stoned, very hard to concentrate on things tho when I do I feel compelled to stare and zone out .</p><p>Its 8:51...I feel restless yet very calm very at ease.</p><p>9:03 just cracked open a PBR still feel stoned like a mary jane high...everything seems a lil 'off',screw it I think I will just eat a bunch of this shit as soon as I get an empty stomach(I had dineer an hour ago). Just got back from smoking 2nd bowl.</p><p>9:19 Just opened my 2nd PBR listening to some techno, I feel like dancing I feel really good!</p><p>Between these times I drank 2 more beers and zoned out on a computer game</p><p>10:18 I am coming down (I think) all it was, was a real stoned feel. I didnt see any distortions of any kind, I just felt really stoned but calm as if nothing could go wrong...</p><p>12:25 Just drank/ate the rest of the coleeus I didnt count the leaves but it was about 3 good compressed handfuls. I chopped the stuff up as best as I could then added a pint of warm water to it I let it sit for a half hour then I started to drink it when the tea was gone I ate the rest of the leaves with a fork.(I gagged a couple of times those leaves are hairy)..1:02 my stomach seems 'funny' hard to describe.</p><p>1:52 I cant even begin to know how much time has elapsed between my last entry and this one. I am not gonna even try to do the math. I have no concentration and the light hurts my eyes...soon to smoke more leaf and some low-grade pot(male flowers) I have opened the wine and soon to drink it with my pot....2:19... 3 glasses of wine (8oz. each)a bowl with half/half of coleus and low-grade pot...mucho buzzz I feel the pot I feel the wine and I also feel the coleus..ive turnwed the light way down and I now have the music channel on..</p><p>After this I really dont know what happened I ended up waking at 7 with my shoes still on and fully clothed but in my bed. It was a good time and worth the effort.</p>"
}
