{
 "title": "Pseudo-Speedball",
 "author": "The Candyman",
 "citation": "   The Candyman. \"Pseudo-Speedball: experience with Ephedrine, Caffiene & Hydrocodone (with Acetaminophen) (ID 47221)\". Erowid.org. Jan 16, 2008. erowid.org/exp/47221",
 "substance": "Ephedrine, Caffiene & Hydrocodone (with Acetaminophen)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   "  T+ 0:00",
   "200 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   "  T+ 0:00",
   "1 tablet",
   "oral",
   "Vitamins / Supplements",
   "(pill / tablet)",
   "  T+ 4:15",
   "200 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   "  T+ 4:30",
   "25 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   "  T+ 4:30",
   "15 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47221",
   "Male",
   " ",
   "Not Given",
   "Jan 16, 2008",
   "26657",
   " "
  ]
 ],
 "report": "<p>Introduction:</p><p>I've been taking 200mg-600mg of caffeine daily for the past few days, but I haven't consumed any amount of ephedrine in about six months. My first goal today is to get myself reaquainted with the ephedrine+caffeine combination, and if all goes well I'm going to throw in 15mg of hydrocodone, for what I'm hoping will be somewhat of a legal speedball. I'm going to be sure to drink plenty of water throughout, and since my metabolism is so high naturally I've got to make it a case to get a good amount of calories in me. I'll be writing down everything as it happens, wish me luck!</p><p>10:30 a.m.:</p><p>Immediately after waking, I swallowed the following with a full glass of water:</p><p>25mg Ephedrine</p><p>200mg Caffeine</p><p>315mg Aspirin for my headache, also gives me the full ECA stack :P (not that I need it...)</p><p>one multivitamin</p><p>I'm noticing a bit of nausea, but I always feel slightly sick if I take anything before breakfast in the morning.</p><p>11:00 a.m.:</p><p>Feeling the first effects coming on. The typical alertness boost associated with caffeine in the morning, along with a slightly elevated heartrate and a noticeable tingling sensation, mostly in my scalp, reminiscent of the first few times I tried ephedrine by itself. </p><p>11:20 a.m.:</p><p>I just ate two Eggos with syrup and a cold glass of milk, and my stomach is fine now. Definitely feeling more speedy than usual, I've got some work to do today so I'm going to go ahead and jump on it while I've got all this energy. ;)</p><p>1:00 p.m.:</p><p>I've been getting quite a bit accomplished! It's been 2 1/2 hours since my first dose, and I'm taking another one now, then getting some more work done.</p><p>2:45 p.m.:</p><p>I was feeling nauseous again (around 1:45), and figured I should eat, even though I have no appetite. Some saltines with peanut butter cured it, then I fired up the XBox, took another 200mg of caffeine, and played me some good ol' Dance Dance Revolution. I was able to play longer, harder and faster than usual, and it also seemed a lot easier than usual to concentrate on the more difficult patterns.</p><p>The tingling sensation has gotten quite a bit stronger, but it's definitely pleasurable. I've also received a pretty strong mood lift, more so than I remember ever getting with ephedrine before. Could be due in part to the exercise (due to ephedrine potentiating endorphins, maybe?) Still no negative side effects, at least that a bit of food wouldn't cure.</p><p>3:00 p.m:</p><p>25mg Ephedrine</p><p>15mg Hydrocodone(tablet with 500mg Acetaminephen), taken with a full glass of water.</p><p>4:00 p.m.: Tingling and slight warmness over my entire body, slight head rush, but very relaxed overall. Thoughts remain clear, but aren't racing either. Much more euphoric than either substance alone would cause me to be at this low a dose. No adverse effects yet, would probably be slightly nauseous if I hadn't eaten anything. Finishing another glass of water now. So far so good!</p><p>The effects, as they were at 4:00 p.m., stayed at peak for a good three hours before slowly tapering off. All in all a worthwhile experience, and a combination I'd be willing to try again. I'm going to wait at least a week, though, to remove any chance of starting up an opiate addiction.</p>"
}
