{
 "title": "My Body as an Orchestra",
 "author": "Nekrow",
 "citation": "   Nekrow. \"My Body as an Orchestra: experience with Cannabis (ID 47241)\". Erowid.org. Jan 24, 2008. erowid.org/exp/47241",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47241",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 24, 2008",
   "Views: 4137",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWhat follows is a detailed account of last night's events, described as clearly as I can recall. This wasn't exactly my first experience like this, but it was more extreme in some manors than others times like it.<br>Now, before I really start going into the experience I think it paramount to give you a little back ground on my experience with marijuana as well as myself to maybe help you gain perspective into my story. I am 18 years old. I have been smoking for almost 2 years. I have smoked some of the worst pot and some of the best pot, as well as everything between. From dead and brown Mersh to glowing red AK-47. I love the feeling of being high. I don't smoke because I'm addicted, I smoked because I feel it expands my thinking capability, allows my mind to think and feel in ways otherwise almost impossible. I will say in honesty, that since I have started smoking I have became considerably more intelligent. Whether I can solely attribute this to my smoking seems unreasonable, I have also gone through many life changing events that also could have helped to improve my intellect.<br>At any rate, cannabis has never made me stupid, or slow. Lazy, yes, but I have always been lazy to an extent. I have lost interest in some things, but not school. That may be because I go to school for something I enjoy doing a lot. Smoking does have its bad points, after all, breathing in something thats burning can't be healthy for you. I have problems with depression and anxiety. I know the chemicals in my brain that produce these emotions/feelings can and do interact with the THC and other chemicals in Marijuana as well as other psychoactives.<br>It was just another day, same as usual. I hadn't gotten too much sleep the night before, a little more than 4 hours. That probably was not a good idea, because I require a decent amount of sleep on a regular basis as to avoid having problems with my anxiety. One of my friends and I had stayed up until about 4:20 in the morning before I finally decided to try and get some sleep. I woke up, got high and proceeded to get ready for what the day had in store for me. The course of the day itself is rather unimportant so I'll fast forward to that night.<br>My room-mate had just gotten home with a fresh bag of some good green buds around 10 o'clock, or maybe it was closer to 10:30, I'm not too sure. Moneys been a bit tight lately so finally getting a bag after about 4 days of smoking resin felt pretty good within itself. We wanted to get really baked, sit down, enjoy a good bag of green, so we rolled a decent size blunt out of a Royal Blunt Green Apple. I always have liked the Royal Blunts, this new package they use thats lined in what appears to be tinfoil really helps keep the paper moist, that, and they always taste rather good. The pot itself was just Green Bud. It was covered in a decent amount of crystals and was still somewhat moist. Other than the crystals I'd dare say it looked like really good mersh, it just didn't have the Green bud look to it. It was lacking that wonderful green color, instead it was replaced by more of a dull earth green.<br>We lit up the blunt and began to smoke it. My first hit was very harsh, much harsher than most Green bud I have smoked and I coughed for about 20 seconds. Not sputtering coughs but deep, forceful ones that leave your lungs and throat hurting. While I was coughing my room mate took his first hit, passed the blunt to me and then proceeded to cough a lot as well. I took another hit, held it for about 8 seconds and then blew out. I didn't cough so much this time, but my room mate still was. I passed it to him, he held it, didn't hit it then passed it back. By this time, about 2 or 3 minutes after my first hit, I was starting to feel the effects. I took my third (and last) hit, held, blew out and then sat there while my room mate took his last hit.<br>After about five minutes I began coming up very quickly, so fast, in fact, it was uncomfortable. I had been watching videos on my laptop so I continued to do so. After about 10 minutes I began to feel really tense (no doubt my anxiety kicking in) as my heart rate sped up. I made sure I kept myself breathing normally, I know a lot of bad things can happen when one overlooks these things. My chest felt very hot (my lungs reacting to the smoke, if I had to guess), and it felt as though my heart was beating very fast. I checked my pulse, normal except I could feel my heart thumping just a bit more than normal. No big deal. However, soon my pulse sped up a bit and I began shaking. It felt as though my muscles in my legs tensed up and then became relaxed, very quickly. Soon, I began loosing my concept of time. What was really 8 minutes dragged on for what I honestly believed was half of a hour. At this point I was sitting in my room watching 44 Minutes: The North Hollywood Bank Shoot-Out. It was during the process of watching this movie I hit the very peak of my high.<br>I was sitting on the floor, leaned up against a bed. Then, gradually every heart beat, every shake, every inhale and my every movement began to produce a sound. My heart sometimes would thump so hard I'd feel and hear a very loud, crushing thunder clap. When I breathed out sometimes I heard a deep grumbling, as though produced from a very tuned down electric guitar loaded with reverb and distortion. My shaking sometimes produced a very fast and very intense onslaught of mixed sound, what I could usually make out was the endless sound of what could be determined as ice breaking and cracking. Swallowing tended to produce the sound of an army of armored troops fighting like in the middle ages. At first the sound was random and didn't fit together, but then, it seemed as though my body was an Orchestra, playing a grand set, like one composed by Beethoven or Bach. The crescendo's and decrescendo's were part of me. The great ups and downs of the music seemed to be produced by my movements and thoughts. As I started to come down I slowly began to drift out of the music and into a tranquil sound of the wind blowing through tree's or something of that nature.<br>Eventually, I came down all the way and passed out. A lot of what I did other than that is a blur. The experience was very intense. I have had 2 panic attacks before, the first being very bad, leaving me unable to smoke for months. As well in a constant state of depression and anxiety for several months. Thankfully, most of the anxiety has gone away. The second I managed to almost stop before it happened, leaving me with the weak after effects for a couple days. I'm not sure if what I experienced was a panic attack, anxiety attack or what. I smoked once today at lunch, I took 4 hits from a joint and I barely got high but at least I didn't have any problems. I think the experience as a whole was a good one, even though while I was going though it it was very intense an almost scary. Had I not been though something similar before, I would have really had a hard time.<br>There are many, many reasons why that could of happened to me. I'm not sure why it happened. It wasn't very fun at the time. Looking back on it even a day later isn't too bad, but I wouldn't want to have that happen again.\n\n\n"
}
