{
 "title": "A Euphoric Introduction",
 "author": "KA",
 "citation": "   KA. \"A Euphoric Introduction: experience with Mushrooms (P. cubensis) (ID 4726)\". Erowid.org. Jan 3, 2002. erowid.org/exp/4726",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "2001",
   "4726",
   "Male",
   " ",
   "Not Given",
   "Jan 3, 2002",
   "Views: 7711",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was to be my first time using this drug. I had spent a long time previously researching mushrooms and their effects, as well as discussing them with knowledgeable sources. I felt well prepared, and thought I knew what to expect. I tried, but I personally believe that it is completely impossible for anyone virgin to psychedelics to possibly understand. So if you're a content person, try them out. But be very careful. So, in any case, let me tell you about this first trip...</p><p>So we began eating, one of my best friends and I, while playing Half-Life. We ate a fair bit, probably around 2 grams. We were searching for effects, and this early on, naturally found none but the strange feeling in the guts. We shut off the game and flicked on the psychedelic screen saver, but it felt fake, and was boring as we were getting no visuals or such. We proceeded downstairs to make some mushroom tea. We brewed, and drank, and went to relax in my perfectly suited living room.</p><p>And then it hit.</p><p>Not, WHAM, you're tripping (like some trips), but it eased into it gently. We began to feel isolated from the outside world, though in a secure way. Not alienated, but rather separated. The thought of leaving the room was bizarre, and amusingly unappealing. We sat, and began to talk. </p><p>Conversations on mushrooms can change lives. We had a blast. We spoke of the obvious in ways we had never considered, and to this day my friend says that it made him a better person. I feel the same way. Judgement of others melted away, with us shouting 'Who are we to judge?!'. Feeling as though no one should judge us either (logically enough) we ventured out to the living room. I collapsed in a joyous haze onto the floor, and got up. 'That was fun.' I said. 'A good fall.' Brian replied, 'Let's FALL KEVIN!', so we fell! How could falling down ever be so liberating! So justifying. We were in the right. We were the righteous, the true. Yet we would judge no one. We proceeded to the 2nd floor deck, and relaxed in chairs. That was when the first hallucinations began to kick in for me. As I spoke, enthalled in the words, Ryan's head began slowly to dissapate until it was but a part of the brick wall behind it. I didn't seem to realize how odd it was for brick and mortar to be speaking to me - seemed quite normal at the time. I looked away, and in looking back the image was gone. I remember that talking wall vividly to this day. We spoke about high school and the caste system of the 'popular' and 'unpopular', with the myriads levels between. We were enlightened. We proceeded inside.</p><p>So we called our friend Nick, whom had originally been instated as the one to moniter our progress and keep us nice and safe. At this point we realized safety was not an issue - my mother's empty house was 100% safe. He arrived, and we laughed and acted mad over the house to door intercom - hilarious to us. We told him how lucky he was to arrive and be part of this night. He entered, and we gave him mushrooms. Excited, he wondered how much to take: we gave him about 2.5 grams of the cubensis. </p><p>From here we walked, and experienced astonishing beauty. Lakes and trees and open fields greeted us. I ran through an open field with one rolling hill... I felt I was flying. To this day I remember this as one of the most beautiful experiences of my life. This, and seeing the Ottawa Tulip Festival. The flowers were so full of life, such a miracle of creation. The lake was inconceivably deep, and full of glorious mystery. The sights I saw that night left a deep impression on me. We eventually became cold, and began the walk home.</p><p>The night finally ended at my house. We lit matches and watched them gutter out. The final match died, and we retired for the night (though not after smoking a nice pinner). Sleeping is difficult on mushrooms, especially when things are still bulging and shrinking, though sleep took hold around 5 at night.</p><p>FINAL NOTE: Block off AT LEAST 14 hours and a good sleep for any serious mushrooms trip - their aftermath can be rather harsh.</p>"
}
