{
 "title": "Arguing with Myself Out Loud",
 "author": "Krt",
 "citation": "   Krt. \"Arguing with Myself Out Loud: experience with MDMA (Ecstasy) (ID 47272)\". Erowid.org. Oct 29, 2007. erowid.org/exp/47272",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "  T+ 4:10",
   "1 tablet",
   "oral",
   "MDMA",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 47272",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 29, 2007",
   "Views: 3304",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>You know I remember when I was 12-13 (im now 17) I always said i'd never get into drugs when my parents threw that anti-drug sober goober bullshit at me. Anyways turns out by the time I was 14 I was buying about a bag every two weeks and i've literally been smoking everyday since. Everything in my life is in check, im going to a good college, have a steady job mon-fri, and for the most part have my priorities together. Anyways as for my psychedelic and drug experience goes, i've spent my time with cannibus, opium, morphine, pills (no uppers, im am very strong willed against speed based ANYTHING) 2c-i, 2c-e, DiPT, 5-MeO-DMT, 5-MeO-AMT, shrooms, dxm, nitrous oxide, and finally mdma. </p><p>The day started out with me picking up my paycheck from work and heading to the bank to cash it. Upon cashing it I phoned my guy for a bag and turns out he just ran out but he offered me some rolls. I had remembered being over there tripping on some 2c-e hard that night and talking to him about how much I wanted to try some rolls. Turns out he can't get me a bag but hell hook me up fat with some as what he described 'bomb ass rolls' I trusted him alot, hes sold me bags for 3 years now, always fat, always cheap, hell front me, help me out, get me outta trouble, have my back. Hes cool as fuck. So I head over there planning to be home by about 5pm. I ended up only buying 2 at about 3pm. Upon obtaining them I very stupidly chewed them both at the same time, instead of one and wait and another. Well being my first time tripping I didn't know what to expect and figured it wouldn't kill me so wtf am I worried about, enjoy the experience I reminded my self. We had a gravity bong and began to load buds into the bowl and toke them down one after another until I was straight fried, he was straight baked, and our other buddy was straight blazed. About 4pm I noticed very warm and euphroic sensations surge through my body in random intervals. Almost like it was creping up on me and I cuoldn't distinguish fucked up or sober. Turns out I was argueing with my self outloud about this until my buddy finally asked what I was doing and without an answer to give him I decided that I was obviously fucked up. haha. by about 5pm I am feeling great and we head to walmart to get glow sticks etc. I remember the funny thing about that trip was once we got into walmart we all have the biggest smiles on our faces and every person that looks at us thinks were hella fucked up on something. So as we walk by these people they seem to be scared of us? Everytime one stares me in the eye and I wouls stare back they'd instantly look away like they were just staring at me. I got quite a kick out of this b/c literally EVERY person did it! </p><p>Arriving back at his house with plenty of new bottles of dasani I broke out 2 and drank them back to back, I had an extreme cottommouth going, which I usually don't experience anymore from smoking cannibus alone. I was beginning to feel hot when I was thirsty so I decided it was the MDMA and I should drink some water. About 6 oclock two girls come over to pick up some rolls an dhang out for a bit. We end up hooking em up with about 3 rolls to split between eachother and they pop em shortly after. By this time were all tripping and playing with the glow sticks and light balls we got from wal-mart. I decided this WAS the best drug i've tried, over anything else i've experienced. Don't take that the wrong way, it was the best drug experience but the worst drug habit in my opinion. Cannibus is by far and always will be my best buddy/ right hand man. </p><p>By about 7 I notice I always find myself staring at something very unintriguing for no reason what-so-ever. After waht seemed like 10 minutes but turned out to really be an hour he offered me another one to peak again as he could even tell I was starting to come down. After complemplating my budget I decided to get another and immediately poped it there after. I ended up purchasing all three for 45$, a fairly good deal I hear. After poping this I began to feel neausous, after almost throwing up but quickly standing up when the urge came I held it in my stomach and almost instantly felt better, odd I thought. About 10pm I decided I would go home and told everyone good night and to take it easy. I once again thanked him for the enlightening experience and to call me whenever the chance comes around again. Hopefully next weekend.</p>"
}
