{
 "title": "Vomit and Deep Thought",
 "author": "RaSman",
 "citation": "   RaSman. \"Vomit and Deep Thought: experience with H.B. Woodrose (ID 47299)\". Erowid.org. Jul 10, 2007. erowid.org/exp/47299",
 "substance": "H.B. Woodrose",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "5 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47299",
   "Male",
   " ",
   "Not Given",
   "Jul 10, 2007",
   "4078",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Date: 10/22/05</p><p>Preparation: ~3 weeks prior; 10 Hawaiian Baby Woodrose seeds (5 for me, 5 for a friend) are scraped of most furry coating, sanded, rinsed with water with a lil bit of dish detergent, and rinsed with distilled water. The seeds were placed in airtight container with enough distilled water to cover them, and a drop or two of vodka was added to keep them from germinating (Ive had them germinate overnite without the alcohol).</p><p>Initial Setting: My friend's basement</p><p>Timelime:</p><p>T +0:00 (around 2:00PM): My friend and I shake up the seeds and liquid and evenly split both up between us. Half the liquid, half the seeds. The liquid has like no taste, but the seeds are still crunchy and bitter-tasting. Perhaps the alcohol preserved the seeds' hardness.</p><p>T +0:45: Effects are setting in slowly. Heavy, relaxed feeling with some nausea, but mostly mental, I thought.</p><p>T +1:00: Minor visual trails, some CEVs, deep thought, some minor color distortion. Things periodically looked purple and/or green for a second.</p><p>T +2:30: Trails, CEVs, etc. have ceased, but body nows feels light and wired. I decide to leave my friends house and go home. I figured the seeds had spoiled from being stored.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>T +2:40: Stop @ 7/11 and my body feels extremely light and bouncy. Driving is not impared at all. No problems with concentration or reactions.</p><p>T +2:50: Arrive at home; shortly thereafter I get first feeling of sickness and vommit the pizza from my friend's house I knew I should have not eaten (DAMMIT).</p><p>T +3:30 to T +7:30 (6:30PM to 9:30PM): Vommited about 2-3 times early-on and kept trying to fall asleep. Then I felt wonderful. Drunk and high and numb. Some OEV in the dark. Deep, deep thought. Kept having to urinate every 5 minutes.</p><p>T +7:30: Around when I finally fell asleep.</p><p>T +8:00: I woke up feeling the sickest I'd felt, but not intoxicated. I rushed to the bathroom. A small amount of projectile vomit. My parents arrive home, thankfully. I came close to blacking out. Drank some gatorade and ate some crackers. Felt somewhat better. I went back to sleep.</p><p>T +13:00 (3:00AM): Woke up feeling 100% better.</p><p>T Next Morning: No hangover or other side-effects.</p><p>Notes: My friend kept having people call because he felt like a million bucks and wanted more. He had no negative effects. We had the same dose and were both first timers, so I really don't understand this, but I suppose everyone is different. This friend is also more experienced and a heavy user of other drugs, compared to me who does things like twice and moves on. Overall the experience could have been better, but I'm sure it could have been worse. Perhaps the seeds were sitting for too long or the lil bit of coating left made me sick.</p>"
}
