{
 "title": "Mass of Confusion",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Mass of Confusion: experience with Mushrooms - P. cubensis (ID 47296)\". Erowid.org. May 28, 2006. erowid.org/exp/47296",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "110 kg",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47296",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 28, 2006",
   "Views: 2788",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo we sat around the kitchen table, dividing out these mushrooms that were blatantly, superb. Thick stems of white and blue swirl, the drugs were hypnotic in themselves. I ate about 1 gram and noticed the texture to be that of sunflower seed shells. I finished off the other 2 grams with about 5 of my best friends. <br>It was a wierd day, perfect for shrooms, it was hot the sky was half lit and the day followed with many sun showers. This whole experience was truly eye opening. Mushrooms don't give me the same euphoria and bliss that I experience from E or blow. Anyways, moving ahead, I continued to move my car out of the drive way and onto the street, my friend who had aten about 6 grams at once was completely twacked by this point, walking back towards the house with him suddenly he exclaimed 'I dont want to be wearing a shirt, shirts suck!' and he continued to take off his shirt. Walking back into the house I found myself wondering 'what should I be doing right now?'. So I went into the back yard and had a cigarette with some friends. We ended up sprawling out across the grass. <br>It felt like we were on an animal, and the grass when I pulled it, felt as if I was tugging on the fur coat of some type of creature. Looking around the yard there was a deer lawn ornament and by god it was breathing to! It had come alive. Flowers were implanted in the soil and were just dripping with radiance. What an ideal world we live in? It all just makes so much sense. My friends mom called him and reminded him to pick the mushrooms growing on the front yard! This is just out right hilarious. I poke my head over the fence and I see one of the local police officers (not in uniform). I exclaim to everyone 'oh its larry'. IM TRIPPING BALLLLLS! screams one of my friends. Obviously this was a good time to vacate the back yard. We went back into the house and went down stairs. We all just relaxed on the couch and waited for the mushrooms to work their magic. Indeed they did, before I knew it I was staring at the remotes holder on the table, and surprisingly enough it was floating! and moving back and fourth. <br>I was sitting on a blue patterned couch with my best friend, when it dawned on us that we were both wearing blue sweaters and we magnificently matched this couch! 'WE HAVE TO LEAVE', this came from the house owner so we all packed up our stuff and decided to go on a nature walk. We stood on the driveway for about 5 minutes and I began to have an emotional run in when I realized that I just simply didn't know what I wanted. Feeling like this, out of control and not knowing what to do with myself only left me with emptiness. Well, I guess I'll have a cigarette. yuck, why was I even smoking this. It's so weightless, am I even smoking it? Or is it just burning and if so, how does it perform this function so perfectly? We walked on past my car and I opened it to get my sweater (not knowing if I was hot or cold of course) I put it on and we went through a hold in the fence that lead out to quite a busy road. The breeze felt so refreshing, I walked out onto the road just to feel the cars passing me by. Quickly my friends took me off the road. At this point we were in a group of about 8 walking down the main road each in our own little world of hallucinations and self actualization. No one could relate to eachother. We just did not know what to do with ourselves. <br>Eventually we all came together and though we would go get a slurpee from seven eleven. Walking by the store we see a man in a construction uniform setting off fire crackers in the parking lot. We were terrified, not one of us could look this man in the eye. I thought it was a boy who went to our school, he turned out to be a 40 year old construction worker. We decided not to go into seven eleven because of this man we were scared of him for some reason, why we didn't know. When I am with this many people simply roaming the streets in broad daylight tripping, contrary to public belief it does not only feel as if someone is watching me, they actually are. Eating mushrooms surrounds me with some kind of aura of displacement. I felt like life is only a random factor of your soul, reality trickled by me making contact only at my own consent. A feeling of peace and gratefullness waved over me. The clan kept walking into a condo subdivision and we saw a group of young children playing at a park, this just seemed odd to me. We walked by them and it even felt as if these 4 year olds were staring at us thinking what the fuck is wrong with them. <br>It began to rain! Ahh how cooling and refreshing. The raindrops shot downwards at the pavement creating the most brilliant leapord print pattern. That is such a gorgeous tree. It was so geometric and oozed with dimension. And as a bonus, was patterned with the most vibrant orange berries I had ever seen! embrace! Me and my friend each picked a handful of the berries and we squished them as we walked under the long, flowing branches, tickling us with green leaves. Walking under this tree was like walking through another realm. I looked at my hands and was immediatley disgusted, they were yellow and almost corpse like, I wish I had gloves. I looked at my middle finger and it was leaking. This is amazing. I thought to myself, but I was beginning to wonder why this had happened to me and exactly how? Did that tree cause this. Im bleeding! Im tripping, I thought I might need 911 and I showed everyone the wound trying to figure out if it was serious or not. No body knew, we were all inebriated. I felt so alone, and I didn't know what to do! I always knew what to do, and the question arose among my group of ' why did we even eat the mushrooms in the first place'. Aha! ingenuity! Just what I have been looking for. Why would even expose ourselves to a situation like this? <br>We didn't know what reality was, and could not decipher if we were in it or not. We found ourselves in a field, with a small playground off to the side. A playground could be interesting. I went and sat on one of the swings and began going backwards , I almost fell off and help me my finger is still leaking this red oddity. It just wont stop! Something must be done. I called a meeting and we all gathered in a circle in the middle of the field. We were trying to figure out what we should do, should we go to someones house? Or did we want to stay outside. Me and my 2 closest friends decided to walk to her house. Off we went as if on a journey to find some sort of great divinity. We walked down a residential road when we saw a vehicle we were familiar with, the kid we knew came out of the car with a tooth pick in his mouth. I was sure it was a farmer! Why is there a huge loaf of bread on the side of the road? Its humongous! It was too much, I had to look away.( This turned out to be a school bus) There was another person we knew who for some reason (who knows why) was sitting on the curb and continued to ask us if we had any 'free money'. Free money!? is there such a thing? <br>Reaching into our pockets and pulling out shiny, beautiful coin that shimmered in the sunlight. This is free money! I suppose I have some, but I didn't give it to him. Once again I was confused. This time I shed a tear, feeling completely out of control with this situation the tears rolled down my face and were directed into my mouth. I felt so insignificant in a way, who is this girl allowing herself to cry out of bewilderment. I must get myself together! I have to get through this!. I felt as if I was going to throw up. But we kept walking. Through a construction side and hills of dirt, looking to our left side we saw chaos and trees being torn down to be replaced by buildings. Heart breaking. Peering to the right was on a level of its own, there was a rainbow, blanketing the trees, flowers, birds, hills and in all, nature. We could only stand there and admire this for so long and decided to move on. We reached her house! the confusion and chaos was over. I felt so incredibly at peace with myself and while looking in the mirror, I exuded purity and beauty. Me and my friends all got on the trampoline in his back yard and we laid there. For hours. Came down from our trip together and never before had we felt closer. <br>I cried once again? who knows why, I havent cried since I was born. The whole experience felt so in-depth at the time. Thinking about these trips after you have endured them is sincerely comical. I didnt know what the FUCK was going on nor did I really care. Left me with new outlooks and thoughts and developed a severe hatred to ignorance and especially to those who displayed it.\n\n\n"
}
