{
 "title": "The Ideal Self-Esteem Producer",
 "author": "Moe",
 "citation": "   Moe. \"The Ideal Self-Esteem Producer: experience with Cocaine (ID 473)\". Erowid.org. Jul 31, 2000. erowid.org/exp/473",
 "substance": "Cocaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 473",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 31, 2000",
   "Views: 12414",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>i used to use coke, socially, at first. a friend and i would get some blow on the weekends and spend our time drinking and doing lines. i remember the euphoria. it made me feel powerful, beautiful, and i secretly enjoyed the </p><p>ritual preparation of cutting lines. most of my friends used and it was relatively accepted in our group. </p><p>i started using in my late teens, but as i matured and began to question who i was and why i do the things i do i began to feel very guilty about my coke use. i realised that the person i wanted to become didn't include the use of drugs and alcohol. </p><p>at about this time the friend i was using with was using way more frequently and a whole lot more. all the basic signs of addiction were apparant. she began hanging out with other people. i decided that if i were to stop i'd need to stop hanging with her. but my use didn't end at that. although i didn't see her anymore i still had a hard time saying no to offers when i was drinking in bars. addiction? habit? caught it in time? i don't know. all i know is i liked the high, but i had to stop. </p><p>i haven't used in almost two years. i'm now dating a crack addict! ironic or what! it's a painful ride, but now i know how my ex was feeling when i was using. it's a sick habit that lies to you. it makes you believe you're invinsable. the only reason i think it affected me as it did is a lack of self-esteem. now i'm clearer in my thinking and of who i am. i feel better about myself(that took work) and this drug doesn't fit into my life anymore. to all of you out there who continue to use... the answer lies within you not within the dope.</p>"
}
