{
 "title": "4 Hours Inside My World",
 "author": "Bignose on wall",
 "citation": "   Bignose on wall. \"4 Hours Inside My World: experience with Mushrooms & Cannabis (ID 47306)\". Erowid.org. Jan 11, 2008. erowid.org/exp/47306",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2.3 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 47306",
   "Not Specified",
   " ",
   "Not Given",
   "Jan 11, 2008",
   "Views: 5082",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>(The nice thing about shrooms is that I dont get really addicted, I discover feelings and emotions, the universe inside my head. . . And they are cheap. )</p><p>It all started around 12pm, on lunch break at college. For almost a week me and some friend had planned on buying some shrooms for the weekend. It had been a long time since I didnt do some and for some reason I was really into it this time. All my previous experiences were in the range of what I would call fun and bizare but never in the hilarious/profound/mysterious way some people have sometimes on some kind of shrooms. So we bought an ounce of shrooms at school that were supposed to come from B. C and supposed to be good shit. Me and some friends, Ziu, Zia and Zio, bought each g of shrooms for half the price (5$/g) me taking 2. 3 gms and Z and Z 3gms each. We planned takin them late in the afternoon. </p><p>Around 7pm Ziu got by my house, and then other dude who was there just to take his shrooms(from the ounce we had)and do it the day after. We smoked some ganja waiting for Zio and Zia to get there. When they finaly arrived, we decided to go to Ziu house since my parents were supposed to get home soon and knew we coudnt trip on shrooms by my house with them there. So me Zia, Zio and Ziu went to his house 5 minutes awayfrom mine. We got there and in no delay ate those magic vegetables. </p><p>TRIP:</p><p>9. 30pm chewing them a long as possible even if they taste like shit. Ziu and Zio ate each like 1. 5g Zia and me 2. 3 gms each. We decided to kill the time in Zius room, playing guitar and listening to music. </p><p>(around)9. 50pm: first uncomfortable feelings in my belly. As if I had eaten some rotten food. In fact thats what we did. </p><p>(AR)10. 15pm: all along we had played guitar with a lamp on on the corner of the room. First impressions of the buzz, I started to find the light too bright but not uncomfortable, just brighter than before. We started to get groovy with the music. We played some simple chords but I was starting liking the sound of the guitar extremely. I closed my eyes to concentrate more on the sound and liking it more, and realized I was giggling beacause of the music. </p><p>10. 20pm: Ziu turned off the light. We continued playing music. I had some problems concentrating on the movement of my fingers on the guitar but played anyways and with nothing to see but all to hear I went in some form of mild but very pleasant music trance. Suddenly the light comes on again and sudden but not total back to reality (I remembered I was in a room). </p><p>10. 30pm: stopped playing guitar. At his point I cant tell what happened to the others, just Zia who for some reason didnt get a thing off the shrooms, very straight. I started to get into MY buzz, knowing there were other people tripping but not interested or able to analyse their trip. We let some music in the background and found myself again giggling, laughing for no reason. . . Just some bizarre/NICE euphoria. </p><p>(From this point I put some random hours, not the exact but hours that make this story have some sense for at some point I really lost the thing I have in my head that makes me know time continues and in at what pace)</p><p>10. 40pm: extreme euphoria. Not the same euphoria as I could get on E or alcohol, a little like pot but much more intense, just outburst of laughs for no known reason and knowing theres no reason just makes me want laugh more. First dancing 'forces' in my body, I already knew the music being played at the moment but for some reason this time it appeared more fun, inspired, nicer than before. Need to get up and move my knees, arms and neck. (dance I guess but with my neck included)</p><p>10. 50pm: need to chill a little. Belly hurts because of the shrooms and because laughed too much. First open eyes visuals: in the corner of the room where was the lamp a bob marley poster appeared to have a perfectly drawed face in it and with some 3d pattern. It wasnt bobs face just a face created by the lights angle on the poster. Incredible. </p><p>10. 55pm: between the vision on the poster and this seemed like a loong time, maybe an hour. We checked the clock and 6mins had passed at the most. We laughed at this for we all were lost in the time sense, even in the space sense. We were talking laughing and making I think a lot of noise; later I remembered Zius maman was there, and that we were in his house. We decided to forget the clocks and I put away my watch. Lots of thoughts about anything and everything, really fast thoughts but not concluding at any point. </p><p>11pm-11. 10pm: nice closed eyes visuals. Red-blue colourful lines waving, rolling travelling spinning on themselves. Very nice interesting to see but knew I coudnt stay just fixing them. Opened my eyes stared at things in the room until I saw a closet door. The rectangle patterns carved on the door started 'breathing', moving in and out like lungs would. I stared those lungs for some time maybe 5mins maybe more. </p><p>(time)pm: at this point we all looked mentally ill. We would get up walk in the room, talk with one another but not finishing any conversation or talking corehently, but in my head I was more clear than ever. We would be talking then in the middle of the talking stop suddenly and stare at something. I was losing it and so were all I think so we decided to go outside to change the setting and see if it would be different outside. </p><p>While outside we saw my friends mom arrive in her car from somwhere while we were looking at things everywhere. I needed to piss so went on the side of the house. While pissing I saw what I think the most misterious, beautiful nice 'drawings' I had ever seen on the sidewall of the next house: I saw faces again but more like indian faces, not in the sense the faces looked amerindian but the way of drawing, the art looked like those faces in aztecs/inca temples and more precisely like the faces in the Easter Island: long, big rectangle like noses big ears and looking down, giving them an impression of being higher, godlike. I was somewhat freaked out because they were moving, changing sizes and expressions on them. Then I realized they were formed out of the shadows of the trees in my friend backyard; the moonlight had give birth to them in the wall and the wind had give them life. </p><p>For the rest of the trip we walked on the streets, and where each one of us I think in our little worlds. I was amazed by the way I felt whole but empty at the same time, like with lots of things in my mind but at the same time nothing. I really cant explain this state of mind I was in but in anyway I really liked it. I knew I was on shrooms but at some points I forgot and was sure, though not scared, that I would be like this for a long time, forever maybe even if I coudnt explain normally what time was. Each on of us tried to talk to the other but coudnt really say what we wanted the way we wanted it. I would sometimes feel really deep and think about personal things but (and maybe too bad because it helps focus on personal matters)decided I wanted to be more amazed than reflective so I started thinking outwards, about the bizarre street, neighborhood, bizarre land I was in. While walking we smoked some joints we had rolled with great difficulty because I coudnt concentrate on something too long and didnt feel the need to. We finally got somewhere and each on of us decided to go home, I knew I was supposed to but didnt want to get home and crash, I wasnt tired or sleepy. Anyway it was cold outside and around 2am so I walked a little and got home. </p><p>Overall: it wasnt a scary experience at all, I felt deep and more aware of my surroundings but at the same time everything seemed different but worthy to watch. The final point of my trip was when looking at the moon, I felt what I just felt once in my life and because I have great difficulty understanding it and explaining it I can only make an example: imagine yourself looking at the very bright moon, at 2am in the morning, face upwards and hands in pockets. You are looking at the moon. Now imagine you are seeing this as it was a movie, so you see yourself in some place doing something at the same time that you know you are somewhere else. Now put away the television your are seeing the movie with: so your are seeing yourself LIVE watching the moon at the same time you are just elsewhere looking at yourself, but LIVE. Thats what I felt for some seconds, as if I was watching myself from another angle at the same time I was in that myself: I felt like as if I was at two different places at the same time and it freaked me out, amazed me, puzzled me and then I liked it.</p>"
}
