{
 "title": "Subtle but Substantial",
 "author": "Shoebox",
 "citation": "Citation:   Shoebox. \"Subtle but Substantial: experience with Passion Flower (ID 47312)\". Erowid.org. Jan 8, 2010. erowid.org/exp/47312",
 "substance": "Passion Flower",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Passion Flower",
   "(extract)",
   " ",
   "1 bowl",
   "smoked",
   "Passion Flower",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47312",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 8, 2010",
   "Views: 12856",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nJust recently I have been experimenting with alternative substances other than what you will usually find in the city. This is some what due to the fact that I have to abstain from the usuals for the duration of my probation >:(  One of these is Passionflower, a mild sedative (hallucinogen?). I have brewed it into a tea, and smoked the stems and leaves, and both simultaneously with minimal effects, but the best experience I've had was one of a more involved procedure.\r\nI took about 1/2 oz. of my passionflower material and started to brew it in close to 1 1/2 pints of water. I allowed the water to evaporate, causing the brew to concentrate. When the water level was reduced to about 1 cup, I poured it into a smaller pot, straining out the plant mass, and allowed it to boil down some more. I repeated this procedure twice, pouring more liquid into the smaller pot as its contents reduced, making sure I would get the most out of the plant. Once the brown liquid was reduced to an amount small enough, I poured it into a spoon (1 tablespoon), and held it over the stove. When all the water was evaporated, I was left with a sticky, brown, fragrent mass of goo. I pulled it off and placed it on some aluminum foil. The whole thing took about 2 1/2 hours. Anxious to see if my little creation was of any worth, I went to go smoke it.\r\nI took about half of the glob and put it in my pipe. Smoking it was pleasant, but if I didn't hold the pipe at an angle, the hole would get clogged. (Pain). Effects were starting to occur 3/4 the way through, and by the time I was finished, I knew it was worth the trouble. Sedation and euphoria were prominent, as well as very slight visual distortions. Having never been this altered on the passionflower, I decided to smoke a pipe of the regular leaf and vine. Much more effective than usual. I was very pleased to know that this was a sufficient source of mind alteration.\r\nPassionflower is also a wonderful preparer for my adventures with lady salvia. It puts a nice 'boost' into the experience. I will continue to use the passionflower for its great contributions towards relaxation, creativity, and elation.\n\n\n"
}