{
 "title": "On the Other Side of Reality",
 "author": "Rcin",
 "citation": "   Rcin. \"On the Other Side of Reality: experience with LSD (ID 47362)\". Erowid.org. Nov 3, 2007. erowid.org/exp/47362",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 drops",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47362",
   "Male",
   " ",
   "Not Given",
   "Nov 3, 2007",
   "3913",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was week 4 of my freshman year in college, and I was going nuts. Smoking pot at least 15 times a day, taking Oxycodone and Hydro left and right, drinking, taking Ecstasy, but the experience I am about to describe quite simply blows every other drug experience I've ever had right out of the water. </p><p>On a Friday it came to my attention that a few friends (a female we will call C, a male named A, and another male named J) had found a hook-up for liquid acid. 'Holy shit!!!' I thought. I'd run into acid only once before this in my drug taking history and it was crappy (and very expensive, $10 a hit) blotter. This shit turned out to be $5 a hit and apparently very potent. All my friends went and dosed at about 12:30 pm, I did not as I had no money at the time. After they came back, 2 hours or so later, they said it was soooo intense and they needed to be alone. So I decided to go get money and dose myself. Everyone who had tripped had done 2 hits maximum, stupidly I thought I'd do 4. </p><p>I arrive at the dealers house and take my 4 hits. The dealer and his girlfriend are already tripping and we listen to some Moody Blues. After about 30 mins, and 2-3 bowls of some fine herb later, I left the apartment and headed back to my friends' dorm rooms. Walking home everything began to morph. Lights were shining like the moon into my eyes, the street began to look like I was looking at it through a fish eye lens. Walking by people I was convinced I was acting really high and not normal. Anyway, after about a 20 minute walk back to my friend's place, which usually only takes about 5 mins, I sat on the couch. At this point I thought to myself 'This is quite possibly the craziest thing I've ever done.' I had just taken 4 hits which, from what the dealer told me, was equal to about 6-8 blotter hits, I was in my friend's shitty dorm room that was piled with garbage, and everyone else was nearly done with their acid highs by this time. </p><p>So there I was, tripping BALLS, and watching Blue Collar Comedy (which I fucking hate) while sitting next to some buds. At this point I began to feel very sick, but I stayed on the couch. This is when the visuals truely began. I looked at the couch I was sitting on and it suddenly became not just a small 5 foot couch, but 10 miles of couch. The entire room I was in expanded to the size of an airplane hanger, while I remained small. 'I don't feel so good' I said and made my way to the bathroom. After urinating for about a minute I looked in the mirror. What I saw may have been the most terrifying thing I've ever seen in my whole life. It was me, but as an old man. Somehow I knew I had had a dissapointing life and knew death was inescapable. My flesh was wrinkled and I wanted nothing more then another person to be with.</p><p>I went back outside to the couch where there were about 5 people all smoking. I saw them all as giant frogs, disgusting and horrid, who wanted nothing more then to please themselves. I was disgusted by the obvious egotism I could literally see coming off of them. My friend, C, looked at me and said 'Man you don't look so good, do you want to go back to your room?' At this point I could barely answer. My entire mental state was so incredible, but so hard to describe. I saw that at every moment I am the only thing keeping myself from happiness. Every emotion I felt was a direct cause of doing or not doing something, and I could see these paths these decisions would take me on. Every decision I saw as a string of energy coming from my heart and connecting to a point where my next decision would be made. The responsibilty I suddenly felt terrified me greatly and I realized what a child I was. </p><p>At this point I was in no condition to just 'chill' with people. I asked my friend's J and C to take me back to my dorm room. On the walk there I could barely understand what was going on. Everything looked like a terrifying jungle to me, and everyone struck me as so disgustingly ego-centric that it made me insanely depressed. After finally getting to my room, my trip really pulled into high gear. I experienced something I have never felt on any other drug. It was as if my memories were literally tied to my mouth. Every time I spoke or moved my mouth, it was not my mouth that moved, it was a memory that was evoked. At one point I yelled that I didn't feel well, this evoked a memory from my childhood when I lost my favorite jacket. It was literally like I could experience a memory on demand with my mouth, they were literally cross-wired.</p><p>My eyes too were connected to memories. Many times I looked in the mirror and when I did I felt the most intense love for a stuffed animal I had not played with for years. At this point I was completely gone, when there was no light I hallucinated that everyone I had seen that day was in my room looking at me and studying me. I was sweating a lot at this point and my gut was making A lot of noise. I felt so sick and just wanted this overly intense trip to be over. At this point I opened my window and puked onto someone elses open window. The room was spinning, and I kept having a vision of my consciencess being a glowing ball of white static light. It made noise that was too intense for my ears and terrified my with its power. another hour of indescribable visions and insights and my trip began to come down.</p><p>I went to sleep about 8 hours after I had dosed due to sheer exhaustion. Waking up later that night though I felt the most intense feeling of peace and contentment. Everything was going to work out, it felt as if I had been through physical therapy and could finally walk again. The next day the after-effects were still with me, my touch especially felt very soft and insulated in a pleasent way. While this was a very intense and memorable experience I do not suggest 4 hits of liquid unless you have tried it first.</p>"
}
