{
 "title": "My Experiences",
 "author": "Graddock",
 "citation": "   Graddock. \"My Experiences: experience with Barbiturates (Butalbital) (ID 47407)\". Erowid.org. Oct 3, 2007. erowid.org/exp/47407",
 "substance": "Barbiturates (Butalbital)",
 "bodyweight": "206 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Barbiturates",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 47407",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 3, 2007",
   "Views: 16831",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my report of what I call a great experience. I would like to say that I usually get a script of Fioricet for tension type headache (Which, for once, I actually suffer from). Now I like to enjoy the effects on my 'Enjoyment Level' sometimes. Meaning I dose out at 6 times the recommended dose. After I reach my usual 300mg I will work it up to 600mg or so. No more as I know my limit.</p><p>It's Alcohal experience without the Alcohal. It has it's cravings for more when I'm out of Alcohal. Effects are strikingly similar, though I experience light euphoria. Keep in mind I don't take the preparation w/ Codiene. While enjoying Butalbital, an intermediate acting Barb, I experience: Euphoria, Energy, Unfortunatly occasional aggression, and oddly an increased ability to use advanced style vocabulary correctly. Also, I sometimes experince shakes or shivering which is due to its effects on the body being able to regulate temp.</p><p>My post is mainly about the breathing problem and my intentions for this to be a warning. I can still breathe fine, but it's more shallow though not at dangerous levels, probably due to my tolerance to this substance which develops within days. I am sure my PULSE-OX is lower than it should be. I breathe more shallow than I should and, when I realize it I compensate by taking deep and slow breaths. Usually breathing like this is refreshing but while taking this dose of Barb I find it barely effective.</p>"
}
