{
 "title": "Beware of the Job Interview",
 "author": "Andrilla",
 "citation": "   Andrilla. \"Beware of the Job Interview: experience with LSD (ID 47460)\". Erowid.org. Jan 7, 2010. erowid.org/exp/47460",
 "substance": "LSD",
 "bodyweight": "119 lb",
 "header": [
  [
   "DOSE:",
   "2.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1997",
   "47460",
   "Female",
   " ",
   "16",
   "Jan 7, 2010",
   "Views: 3596",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a funny/not-so-funny at the time story I just wanted to share just in case any of you decided to be a daredevil and go to a job interview while trippin' balls!!!!</p><p>I was 16 years old and had experimented with quite a bit of drugs by this point, considering myself a veteran.  This included : LSD (20+?)times, shrooms, meth, crack, coke, weed, Special K, and X.  I had a job interview that day at a large chain store.  I had tripped the night before so I decided to double the dose and go to this interview (obviously I wasn't too serious about the job).  I new it would be boring so what the heck?  It was a interview and training session in which they would go over everything one needed to know about being a prize employee :) </p><p>Right before I left my house I dropped 2 1/2 hits (about 10:00 am), doubling the dose because I had tripped the night before.  To the interview, I was told to bring my driver's license, social security card, and references, the usual.  My mom gave me a ride and told me to call her when it was over.  That's when I first felt it kick in.  I felt energized and a little nervous (I always get this weird perma-grin when I trip as I headed into the store.  This particular store was attached to the mall so the only entrance to the actual store was right inside the mall.  I went inside and headed to the manager/employee section in the back.  </p><p>I was fine at this point (actually smiling to myself thinking how cool I was).  Then I started tripping just as I walked into a small room with a T.V., a long table, and folding chairs that we would all be training in. I went in and waited for everyone to get situated.  This was about 10:45 and I was starting to trip HARD!!  I was still just chillin', when someone I knew from school walked and sat across from me and said hi. The manager asked for everyone's I.D.'s and SS cards.  I went to reach for mine... and that is when the panic started.  </p><p>I realized I had left my I.D. in my room at home.  Under normal circumstances this would not have been a big deal...  I raised my hand and told the manager what happened.  She suggested I go call my mom and just have her bring it over.  I left the room trying not to freak out.  It did not cross my mind to use the office phone so I headed through the store and down the mall to the pay phone.  As I walked through the store everything was a blurrrrr.  I was tripping HARD.  I thought everyone was looking at me like I was a freak and imagined how strange I looked.  I started to sweat and panic, walking faster and faster down the mall.  I was wearing high-heeled shoes and my feet kept slipping off them because they were so sweaty.  I finally reached the pay phone and called my mom stammering to her about what I needed.  She said she would bring it when she picked me up.  I walked back to K-MART, still freaking out but feeling a little better.  I saw clothes, people, lights blurred and throbbing.  Everyone was staring at me.  I got back to the room a little flustered but was able to calm down when we started to watch some video about catching people shop-lifting.  </p><p>Then it was time for the questions.  The lights came on and we were randomly asked questions about the video.  She asked me one and everyone looked at me.  I did not comprehend what she was saying, whatsoever, so I look at the table and said 'ummmmmmm.... I am going to have to pass.'  Everyone looked at me strangely, including her, and I started to drip sweat.  People were looking at me really weird and all I could think about was how strange I probably looked to them and how I had to get out of the room.  The table started swirling into a lake and I politely removed my elbows, pen, and papers from it... She asked me another question and I just said some strange thing that made everyone look at me again... I have no idea the question or reply.  </p><p>Finally, it was over.  Time for the one-on-one interviews in the managers office.  We patiently waited for our name to be called, one-by-one.  I was trying to avoid eye contact with anyone.  That's when the guy I knew asked me, 'are you okay? you seem sort of weird.'  Oh no, I thought, he knows!!!  I just stared at him, he looked like the evil guy from the first Mask movie.  FREAK!!  Just then my name was called and I raced out of the room, knocking over  my chair in the process-I did no bother to look back.  </p><p>The manager's office was in a tiny white room with florescent lights blaring and a small desk.  She asked me to sit in the seat across from her to ask me some questions.  I was sweating, my eyes were DIOLATED like mad, and her face was completely distorted to the point I couldn't even tell what she looked like.  She asked me some questions, of which I don't remember, while I tried not to run.  And then... I was hired!!  WOW!!!! I can only think that they needed help really badly or that there are a lot of freaks who apply for jobs there.  </p><p>Anyways, story of the moral (I know I said that) is: DON'T GO TO A JOB INTERVEIW ON LSD!!!!  And remember your Social Security Card.</p>"
}
