{
 "title": "Fun, But Not a Replacement",
 "author": "Todd712",
 "citation": "   Todd712. \"Fun, But Not a Replacement: experience with 2C-I & Various (ID 47522)\". Erowid.org. Sep 17, 2009. erowid.org/exp/47522",
 "substance": "2C-I & Various",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "2C-I",
   " ",
   "  repeated",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "2005",
   "47522",
   "Male",
   " ",
   "Not Given",
   "Sep 17, 2009",
   "7635",
   " "
  ]
 ],
 "report": "<p>I must confess, I've used 2C-I a lot in the past few months, in fact far too much at times, but now I have a feel for this chemical and can relate the persistent effects from trip to trip, and also how the chemical interacts with other drugs. </p><p>First of all, the chemical itself. 2C-I, whether it is one or not, feels like a very dirty trip. I've never had a hit of really dirty acid (I've been blessed), but I'd expect a normal hit (20-30mg) of 2C-I is something what it would be like. Full psychadelic visuals in the closed eye, and powerful visual hallucinations with eyes open, however the visuals feel cheap, dirty, and alien. Somewhat like acid's visuals, and especially like mescaline's, but the visuals are contrasted by a sharp and uncomfortable body load and especially a tenseness throughout the body (shown by clamping of the teeth and bouncing one's legs) has (only once) led to powerful muscle cramps after I tried to sleep the tenseness off.</p><p>The visuals are quite enjoyable for the most part, however, but the mind is relatively at peace, with none of the playful internal banter one grows accustomed to with LSD-25. Socializing is quite enjoyable, but only with people I already know well and feel comfortable with. Paranoia, especially if I am tripping alone, is increased tenfold ('Everyone's looking at me...') -- The urge to dance is strong, and music is incredible on 2C-I. Artistic appreciation in general on 2C-I, especially in combination with cannabis, is just beyond amazing. I can take a bite of just about any food there is, no matter how boring and common tasting it might be normally, and it will be so intense I'll see it if I close my eyes. Likewise, I found that when taking a drink of water during the peak I could picture a wireframe tunnel and SEE the liquid go down in my visuals. I told a few friends about this and they tried it, finding that they too could 'see' themselves drink. Pretty crazy stuff, and not something I've seen on other drugs.</p><p>Mixing other chemicals with 2C-I produced various levels of intoxication, and I do not recommend that ANYONE try my idiotic trip on 750mg of DXM and 35mg of 2C-I. That level of intoxication is reserved for the few, the stupid, the trippers who just do not care how far they go anymore. I barely felt the 2C-I and never got visuals from it, the DXM just overpowered it but it was much more intense than just the DXM by itself: All I can suppose is that 2C-I is some kind of DXM booster. </p><p>Mixing pot with 2C-I, however, is quite mandatory, as pot smooths over some of the chemicals innate nastiness, as well as providing a powerful boost to the visuals. One of my favourite things to do at the end of a long 2C-I trip (or any trip, for that matter) is take a big capsule of Calea Zecatechichi 10x extract. After a mind blowing trip marathon I'm dropped into a lucid dreamworld where I'm often still tripping balls. It's absolutely insane, and I recommend it to anyone who wants to trip even when they're sleeping. </p><p>Mixing 2C-I with mushrooms didn't improve the mushroom trip for me that much, but I got some of the 2C-I body load to go with it. You have to understand, Mushrooms are my God, and every time I trip on mushrooms I just roll around on the ground with my hands waving around in the air like that episode of the Simpsons where Lisa drinks the water and trips out ('I can see the music'), just going 'mushrooms are sooooo awesome'. 2C-I didn't make mushrooms any more awesome than they already were, I guess that's basically what I was getting at.</p><p>As for other side effects (besides the tenseness, cramps, and jaw clamping), extremely dark brown/black stool was noted every single day after using 2C-I, no matter what else was eaten before/during or after the event. After about 15 trips on the chemical (including 4 in one week) I realized that this is probably not one of the safer ones to fool around with. The side effects, while not usually too painful, lead me to believe that this drug could represent a serious long term toxicity hazard. This is why I quit, and why I just wrote all this. 2C-I is fun, but it is not a replacement for acid or shrooms, both of which give me a better trip with fewer negative side effects.</p>"
}
