{
 "title": "The Start of a Beautiful Friendship",
 "author": "Anonymous",
 "citation": "   Anonymous. \"The Start of a Beautiful Friendship: experience with Salvia divinorum (20x extract) (ID 47541)\". Erowid.org. Sep 21, 2007. erowid.org/exp/47541",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 47541",
   "Male",
   " ",
   "Not Given",
   "Sep 21, 2007",
   "Views: 3780",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well, I've never done anything beyond eating a few brownies and getting buzzed off of alcohol.  I read all about salvia for the past few weeks, talked to people I know about it, etc.  I decided it was a great psychedelic to try for the first time, since the duration is so short - if I didn't like it, it would be over in minutes and that would be that in my exploration of psychedelics.  Little did I know what I've gotten myself into...</p><p>Head-rush.  I sat down in my friend's apartment, and took a hit of the 20x salvia.  I'd never used a bubbler before (I do know how to inhale, I have smoked cigarettes in the past) and don't think I inhaled properly, as I didn't get that much smoke in my lungs.  I laid back on the couch and about 30 seconds after I'd put the bubbler down I got this really weird twisting feeling.  I remember saying to my friend 'I feel like I'm being pulled down and to the left.'  It really was odd - as if I was in a constant overbanked turn of a rollercoaster, sinking and twisting.</p><p>Melt-down.  I'd never been a couch before.  After being pulled for a minute or so, I realized where I was going.  Into the couch, of course.  It didn't feel like I was glued down, or stuck, or unable to move.  It just felt like I'd been pulled so far back into the couch that I was a part of it, we melted together and were seamless in that moment.</p><p>Trip #1, done.</p><p>Visuals.  A short while later, I decided I needed to get a better hit, and took some more than the first trip and inhaled it properly.  The reason I'm sure I did it properly is because no sooner had I let go of the bubbler (I don't know who took it, my friend or if I put it on the table, or if it disappeared into thin air for that matter) than the visuals came on.  Things looked a little funny, like something was out of tune in my head, screwing up the path from my retinas to my brain.  The visuals had barely begun.</p><p>Cornerstone.  I looked up at the ceiling, which was bare and white.  There was an even off-white lighting and it just sort of flattened, and my sight was fixated onto it.  Slowly but surely, a corner appeared in the bare ceiling.  It was the corner of a cube, going into the ceiling, calling me to go inside.  This was the cornerstone, the foundation of my short but amazing trip.</p><p>Flight, Space, and Fractals. I stepped out of myself and into the cube in the ceiling, and realized that I was flying over 'the town.'  I don't know which town, it wasn't my town or any town I've been too, it was just 'the town'. At least, those are the words my brain picked to describe it to me.  It was a countryside, with houses, somewhat hilly, and very vibrant green, full of life.  I've never been in an airplane before, but I didn't know I had the ability to go on one in my own mind.</p><p>I don't want to say that I went up 'above the town' but it seems somewhat like that.  It would be more accurate to say that the colors faded, and the stars turned on.  All the while, there was still the shape of this corner, as if I was standing in something and looking out.  And what's interesting is that I can't draw a corner in black on a black background, or in white on a white background, but the presence of the corner was there even though its image was not.  The stars were painting the sides of the cube, and the cieling.  And then the vines crawled up.</p><p>In the final stage of my journey, green fractals sprouted up from the base of each side of the cube, and extended back and up into infinity.  They looked almost like vines, and crawled straight up the walls.  The colors and shapes were so vivid, as if it really happened.  Of course, it did in my mind.  Snap back to reality.</p><p>Trip #2, done.</p><p>When I'd come down from the 2nd and final trip (about 5-10 minutes), I drew my friend a picture of that final scene and he said it was amazing that my mind could be so imaginative, even though I'd never tripped before.  You can think of the vines as the salvia plant, or the black void as the astral plane, or whatever else you want to think happened to me on my trip.  What I've said is as close as I can put words to what happened in my mind, and if you've never tripped before it will be up to you to discover the meaning on your own.</p><p>Just one last thing to say: This all went down about 2 or 3 hours ago, and since that time I've been absolutely euphoric.  I've definitely got the 'afterglow' as they call it, and this feeling of supremacy, of pure enjoyment, is enough in and of itself to make the whole experience worthwhile, let alone the trip itself.  I think this could be the start of a beautiful new friendship.</p>"
}
