{
 "title": "The Hype is Real",
 "author": "Iyntynsyty",
 "citation": "   Iyntynsyty. \"The Hype is Real: experience with Salvia divinorum (10x Extract) (ID 47553)\". Erowid.org. May 25, 2007. erowid.org/exp/47553",
 "substance": "Salvia divinorum (10x Extract)",
 "bodyweight": "260 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47553",
   "Male",
   " ",
   "Not Given",
   "May 25, 2007",
   "3715",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Okay, a few personal notes first. I'm a male in my mid thirties with some (long ago) experience with psychoactives. As a kid I took a gram of 'shrooms following a Scorpions concert and on another occasion dropped half a hit of acid with my friend. On both occasions I experienced what would probably be considered a mild threshold sort of trip, but at fifteen I felt like the walls of Jericho were coming down. Anyhoo, that's the limit of my experience with psychadelics going into the situation I'm about to relay, what I can recall of it anyway.</p><p>So, as I said, I'm in my mid thirties and recently divorced, which basically felt like an amputation sans anasthesia. I found that my thoughts were more and more preoccupied with the days of my misspent youth (can you say 'midlife crisis' boys and girls?), and this leads me to investigate the possibility of growing some shrooms (chitake's perhaps). So while online I notice this salvia shit, 'legal high', trip your friggin nut sack off in a perfectly legal manner. Strikes me as too good to be true, but I press on with my research. Apparently this shit makes acid look like a routine day at the office. So I'm intrigued right? I mean, who wouldn't be? Of course I don't actually *believe* this hyperbolic bullshit but I throw down my money anyway. What the hell? I suppose there's like a two percent chance of actually getting something out of it. Yesterday it arrived.</p><p>This is what happened.</p><p>I took my package into the house, opened it, inspected the contents. Sure enough, salvia 10x, said so right there on the package. I then did something I wasn't at all prepared for, and wished afterward I hadn't done. Which is to say I loaded the bowl of a small pipe and proceeded to fire up. But let's not get ahead of ourselves. My initial feeling as I sat there with a fully loaded bowl of salvia was one of apprehension. Not that something *bad* was about to happen in the sense of an overwhelming psychadelic trip (of course not, why would I think anything like that?), but apprehension that what would undoubtedly occur is nothing at all. That I would get no buzz whatsoever from the substance other than that peculiar buzz one gets from the sense of being had. And with that mindset I sit down in front of the computer and proceed to flick my bic and put fire to substance.</p><p>I smoke it just like the trip reports have all said. I hold the fire on the S throughout and hit that fucker hard. Big lung busting mother fucking hit. Tastes kinda harsh. Before I'm through inhaling (INhaling mind you, not EXhaling) I start to notice a buzz in my whole body. Thoughts seem kind of disjointed. Okay, I've taken my hit, now holding the smoke, counting one onethousand two onethousand in my head in an attempt to hold the smoke for at least thirty seconds. Feeling strange now. Really having to concentrate on the counting. Blow out my hit. Now I have to load up another bowl QUICK. I know this because five million trip reports have told me I must take a second hit immediately after the first. So I try and dump out a bit more S onto the cd case, and at this point the weirdness broadens.</p><p>My vision narrows to no more than my hands and that little bag of power. I forget what I'm doing, sort of like losing your train of thought when you're trying to make an important point and forget what the fuck you were talking about in the first place. With great concentration I focus what's remaining of my coherent thought processes on shaking out that bit of S but it's turned into a chore of almost unimaginable magnitude. Apparently I'm still intent on getting that second hit. My hands, oh Jesus my hands are suddenly these alien looking.....things. Totally detached from my body these 'things' are. Just a pair of floating fucking hands. They shake and I have no control over them. They're the only things that seem to exist and they're really fuckin' freaking me out. I put the bag of S down on the desk and from there, all I can really recall are impressions. Once the bag is down I lean back in my computer chair and then it hits in full force. </p><p>The aspect I remember chiefly is the gravity distortion thing. Despite having read about this numerous times and seeing that it was quite apparently the thread of commonality that binds various people's salvia experiences together, I am nonetheless astounded at the actual power of this occurence. Reading about being 'pulled in every direction' from a trip report just doesn't convey sufficient meaning to actually prepare one for this experience. I was being rolled up, I was falling, no not falling, being *hurtled*, toward what exactly? I haven't a clue, but it was the strangest sensation I've ever felt. Not at all pleasant.</p><p>At this point in the trip I don't know if my eyes are open or closed. I think they were closed. Maybe it doesn't make a difference if they were open or not. All rational thought was obliterated. I didn't know my ass from a fuckin' monkey wrench. Strangely enough I wasn't frightened at this point. I think being scared would have required some thought, some realization, some contemplation on what was happening and I really wasn't capable of any of that. I was pure sensory, no thought at all. It wasn't something I was doing as much as it was something that was happening to me.</p><p>At some point I open my eyes, either that or the *real* reality drifted back into its proper place, and see my bed. I have to go lay down, this is way too intense, I'm gonna come flying out of this chair if I don't hit the bed. So, marshalling all of my mental and physical capability, I fight the effects of this alien gravity and take the two plodding steps to the bed and collapse into it. Right on my face. I have to roll over. Now I'm sinking into the bed. Now it's lights out again. Utter obliteration. Falling. Being rolled up. This isn't possible. This simply can't be happening. I can hear something like a rushing sound. My shirt is strangling me. Oh fuck I gotta get this shirt off. Herculean effort to get the shirt off. Success. Back in the *real* world for a moment. Oh God don't let me go under again. Please. I can see things as they normally are right now, please don't submerge me in this madness any longer.</p><p>Ever experience sleep paralysis? That moment of being almost awake enough to start moving around but not quite? This is basically what I experienced for the next minute or so. Just laying there staring and trying to move. Finally I'm capable of movement. I go out to the living room. Drink some water. Tv. Normalcy. That is without a doubt the most intense fucking experience I have ever had. I didn't care for it nor do I wish to feel it again. I like shit that I can control, I guess that's why I only did hallucinogens a couple of times in my life in the first place. Anyway, this is what happened to me on my first and probably only trip on salvia. Don't go into this unless you're prepared to go all the way. Follow the rules. Get a sitter. All that shit. The hype is real.</p>"
}
