{
 "title": "Wonderful Pain and Enlightenment",
 "author": "MQDuck",
 "citation": "Citation:   MQDuck. \"Wonderful Pain and Enlightenment: experience with Morning Glory (ID 47578)\". Erowid.org. Aug 8, 2009. erowid.org/exp/47578",
 "substance": "Morning Glory",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "28 g",
   "oral",
   "Morning Glory",
   "(ground / crushed)",
   "  T+ 7:30",
   "2 tablets",
   "oral",
   "Unknown",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47578",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 8, 2009",
   "Views: 2602",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: 28 grams of morning glory seeds is considered an extremely high dose, see Morning Glory Dose Chart] \r\nI spent $27 on 14 packets of Heavenly Blues, ground them in a coffee grinder and drank the powder. Yes, I wanted to trip hard, and I did. This was Sunday evening. I'll divide this review into two parts.\r\nFirst, the bad:\r\nJesus Christ this stuff is toxic. I got a pain mainly in my legs that lasted many, many, many hours. All parts of me went back and forth from feeling numb to being in great pain. It's been 48 hours and I still have trouble walking, like my nerves are damaged or something.\r\nI drank all the seed powder at 4:30pm. I watched the World Series game two which ended probably around 6:30-7:00. The pain came quickly. Around midnight I was unable to take it any more and went to bed (which was quite impossible for hours - my brain was wacked out). I normally take a prescribed sedative every night and decided to take two. When I got up to let my cat out of my room around noon, I discovered that I had lost control of my nervous system (I think - I'm no doctor). I had trouble getting to the door, and when I did I had trouble opening it. I ended up lying against the wall, while very carefully moving my hand and arm to open the door; cat ran out; I stumbled back to bed. I made myself get up at 5:30pm Monday for a test. I got up, threw up, got a ride, took the test, wanted to throw up, left class early and walked home. I'm surprised I was able to walk. I'm sure I looked like a drunk who was about to pass out trying to look normal.\r\nI got back in bed somewhere around 7:30-8:00pm and continued sleeping until about 1:00pm on Tuesday. That's about 36 hours in bed, if you ignore the two hours I was up for school, and I only got up on Tuesday by force of will. I still moved like I drank so much I was about to die of alcohol poisoning, now hungover. Every muscle on my body was shaking. I was mentally and physically very sedated. All this sedation was undoubtedly aided by the extra sleeping medicine, but this was still very extreme even considering that. I went and got some espresso, which helped wake up my mind a bit and probably made me even more jittery. I thought about eating but couldn't think of anything that sounded good. I tried to play a strategy game I just got but was too sedated to learn it. I'm finally feeling a bit better, though my thinking is still foggy.\r\nBut let me make it clear: the worst part was that first night, while I was tripping. The pain was unbearable. Every time I tried to move a pain shot through my legs and groin.\r\nAnd now, the good:\r\nOh, the good! Everything was swirling, swirling, swirling. The grains on the wood in my kitchen were dancing and growing and moving back and forth. Everything waved as though liquid, or blowing in the wind. Every pattern had infinite detail; the closer I looked, the more detailed it became. I saw tiny numbers in the patterns on the tiles on my bathroom floor. As I looked closer, they turned into complex-looking mathematic formulae. As the effects grew stronger, the game went from watching for hallucinations to trying to stop the hallucinations and see things as they actually were.\r\nThe best part was how it effected my enjoyment of music. I decided that listening to my new Doors album would be appropriate, and it turned out to be a very good choice. I became fascinated with the jazz keyboarding of... whoever the keyboardist is. It truly is impressive and very sophisticated.\r\nI got hungry and decided to heat up a TV dinner, which took maybe 45 minutes since I couldn't keep track of what I was doing; my brain was fascinated with anything and everything. I finally finished cooking my food, and decided to try to relax and eat it while watching an episode of the Simpsons on my computer, all of which I'd seen a million times. I think I spent around an hour and a half or even two hours watching that 23-minute video because I kept pausing and going back to watch the same part over and over. I kept discovering new jokes and what the writers must have been thinking at this point or that and all sorts of similar things.\r\nThe visuals were enough to astound anyone, but the highlight was my new appreciation for the detail in things. I had this sense that I had discovered something great, that I could do great things with this drug. The phrase 'open your mind' went from a being silly phrase by kids forty years ago who thought taking drugs could change the world (which is of course mainly all it is) to profoundly resonating with me. I felt awake.\n\n\n"
}