{
 "title": "The Forbidden Vein",
 "author": "June",
 "citation": "   June. \"The Forbidden Vein: experience with Cocaine (ID 4772)\". Erowid.org. May 19, 2001. erowid.org/exp/4772",
 "substance": "Cocaine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "IV",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "2001",
   "4772",
   "Female",
   " ",
   "Not Given",
   "May 19, 2001",
   "20115",
   " "
  ]
 ],
 "report": "<p>\nI write this as a wake-up call to anyone who has or has had trouble with moderation, and to be as informative as possible on a topic with an impossible stigma-- IV drug use.</p><p>I began experimenting with drugs when I was 12...pot, pharmaceuticals, LSD, mushrooms, MDMA, DXM, heroin, and ketamine...but nothing has compared with my love affair with cocaine.  </p><p>Two years ago, I began snorting coke with my friends on a semi-regular basis.  It was a social interaction, and to tell you the truth, I wasn't all that impressed with it.  Back then, I was a diehard fan of 'downers'...mostly heroin and morphine, so feeling like my eyes were bugging out of my head and my brain was going to explode was not my idea of fun. </p><p>Eventually, I met a special friend.  Soon after we encountered each other, we found that we both shared a comparable love for injectable drugs, for some reason.  After conspiring together for paraphenalia and goods (you can't buy needles from drug stores where I live without a perscription), we sat down one night to shoot cocaine for the first time. </p><p>At first, we didn't do quite enough.  The effect was a slightly metallic taste in the mouth, shivers, and a strong euphoric feeling.  Ten minutes later we each did more...the amount of which I'm not sure, because it's difficult to measure in a spoon.  Anyway, this second injection gave me the most beautiful feeling I have ever experienced in my life.  The world started to sparkle, there was an intense, high-pitched ringing in my ears, my cheeks were hot, but my eyes were opened.  It was amazing.  We only had a gram between the two of us that night, so that was enough for about four or five injections each.</p><p>This became a trend with us.  Then it became quite a habit.  Every weekend, we would get together with two 8-balls (7 grams) of coke and shoot it till it ran out. We would begin at 9:00pm...wait 30 minutes, shoot again, wait 15, shoot again, wait 15, shoot again, etc. etc., until I would look at the clock and it would say 5:30am.  I was not careful with my habit, and let it destroy me.  Soon, I grew dehydrated and weak, couldn't eat, absolutely could not sleep, my eyes turned dull and I grew irritable and grey.  The track marks on my arms, hands, and legs were large red and navy blue bubbles whose bruises turned yellow and translucent.  I began not to care how people saw me...my friends would call concerned, and I'd tell them to stop caring about me.  I wanted to die, and soon...oh, but that would mean I couldn't shoot any more coke, so nevermind. </p><p>This escapade went on for four months, which may not seem like such a long time to you.  Trust me, it was a lifetime.  Eventually, my best friend forced me to go into rehab, which changed my life forever.  I didn't want to go, but I was sick.  I was weak and hungry for anything that was white and powdery and pure. It was not easy to give up, and it took me a long time to decide that's what I really wanted to do. Many people will say that cocaine is not physically addictive, but it was for me.  It took three weeks of IV's to feed me, of not walking, of not sleeping more than a couple hours a day...it was hell.  Now when I think about shooting coke, I still experience that feeling of intense desire and hunger that only an ex-druggie can truly know.</p><p>I do not write this to tell anyone what to do, or even to dissuade you from experimenting with intravenous cocaine use. If you are responsible, they produce fun and spiritually exhilirating experiences.  For me, the problem was with moderation and self-care, with losing myself and my spirit to a drug, which is not supposed to happen. Drugs, I believe, are here to enhance the mind and spirit, to turn you inside out and let you experience yourself in a different way.  </p><p>So I leave you with a part of my life...perhaps it is here to save yours.</p>"
}
