{
 "title": "I Guess I'm Addicted",
 "author": "illus1on",
 "citation": "Citation:   illus1on. \"I Guess I'm Addicted: experience with Oxycodone (ID 47769)\". Erowid.org. Jul 28, 2007. erowid.org/exp/47769",
 "substance": "Oxycodone",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47769",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2007",
   "Views: 11450",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI guess I'm addicted.\r\nWell, I've always thought I was one of those people that would never do hard drugs.\r\nAnd now, here I sit at 4 AM, high on cocaine and oxycontin, wiping blood from nose. This writing is the result of a day or so of contemplating about my past oxycontin use, and my recent encounters with cocaine. I think this nosebleed is also contributing.\r\nAnyway, I'm an 18-year-old male that lives at home with his parents and doesn't go to school because I dropped out at the age of 13. I chose the 'underground' life around the age of 15-16. I won't say a lot, but I'm not gonna be able to get a job and I'll be fucked if I'm living on the streets, so I get by doing what I have to do. I've experimented with, recreationally and chronologically, weed, nicotine, alcohol, ssri's, opiates (oxy-ir, percocet, oxycontin, t3's, codeine-contins), benzos (ativan), methylphenidate, and finally cocaine. I also experimented with mushrooms and various opium preparations (extracts, raw latex).\r\nI wanted to write something to document my past experiences and addiction to oxycodone. It all started with curiosity, when one day I aquired a 20mg Oxy-IR tablet and crushed it up, railing 5mg. I didn't feel much that particular time but it was enough to let me know what oxy was all about. I had done codeine recreationaly before this, and it was very simular to that in its effects. I actually scared some of my friends with my codeine experience, taking 400mg of codeine-contin 100 tabs, which I had scraped the yellow coating off of (I now know doing this didn't defeat the time release mechanisim of the pills. Thank god I didn't chew them or anything; 400mg of codeine is half the LD50). So, I ended up being constipated for a week straight, followed by a VERY painful bowel movement. I should have learned my lesson then, and when I gave all my oxy and pills to a close friend with the instructions to keep them away from me. \r\nwell, I didn't learn and I soon relapsed into a full addiction which began with the aforementioned 20mg oxy-ir's. It has now expanded to 80mg oxycontins, and it takes at least 25-30mg in a single insufflation after I wake up in the morning to feel the warm, euphoric buzz. Including the continuous 2.5-10mg bumps throughout the afternoon and evening, I normaly do 60-80mg in a day.  Alternatively, I can rail only 10-15mg just to relieve withdrawl symptoms and feel 'normal.' Doing this whenever necessary, I can keep it at about 20-30mg/day. I have tried to quit several times but, I still can't seem to. I always relapse the same day, or the day after, even with staggered-down doses.\r\nI guess I just needed to talk to someone about my epidemic. I hope you can learn something from my experiences with this substance. All it's gained me is a bad reputation, an addiction, and lots of embarassment when I keep saying I'm going to quit, and really mean it, but I can still never seem to. Sure, I've made money on it and it's gotten me ridiculously stoned out of my mind, but when I look at it all, I know what I'm seeing. A story about an addiction, my addiction, and I still don't exactly know how I'm going to overcome it. It's almost like I'm still thinking I'm not even addicted, like I don't want to accept the fact, but I guess this writing is just one of the steps toward my realization. I just noticed how much I said 'guess' in this fuckin' summary. I guess I'm fuckin lost and rambling.. I guess I have a title for this, too..\r\nillus1on\r\nNote: thanks goes out to my friend mike for proof reading and spell checking this b4 i submitted it.\n\n\n"
}