{
 "title": "Bowel Cleansers & Psychedelics Do Not Mix",
 "author": "aquapan",
 "citation": "   aquapan. \"Bowel Cleansers & Psychedelics Do Not Mix: experience with LSD & Supplement (ID 47762)\". Erowid.org. Mar 8, 2006. erowid.org/exp/47762",
 "substance": "LSD & Supplement",
 "bodyweight": "185 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 47762",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 8, 2006",
   "Views: 4991",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>An foaf and and an foaf took 150mcg of LSD and expected a cruisy journey for themselves one morning. The plan was to have a wonderful morning experience with the sunrise.</p><p>At t+40 (M) needed to go home for an unanticipated bowel movement which being on a cliff side watching the sun come up had no spaces to cater for (if you get my drift). (F) agreed going home was a wise choice at that point in time.</p><p>At home in less than 10 they both noticed serious nausea and disjointedness in their communications. CEV and OEV were quite marked and the synchronicity of their inner pains to their outer experiences was escalating. They were in a state of alarm whilst still aware of their alarmed state and therefore contained panic. Both remarked that they had never experienced such disjointedness in earlier experiences - ever - and both had never experienced such physical discomfort.</p><p>They both traced the changes in their experience to the usage of a herbal bowel cleansing device used to remove impacted food from the lining of the bowel. A quick research of the ingredients reveals that there are very similar products out there that are reputed to have the same cleansing properties.</p><p>The discomfort continued throughout the duration of the experience and herbal colon relaxing teas were of little help. It was to be a rough ride to the end. At t+10 hours the pain and discomfort was subsiding and communications between the two were back online and clear.</p><p>Both M/F noted that they had previously attempted a pscilocybe experience whilst using this same cleansing material and discovered to their amazement also that this was a very uncomfortable experience with a lot of nausea.</p><p>Both M/F stopped the usage of the bowel cleanser and immediately set up another test to find that there were no ill side effects to be noted. Since this experience both have not had any ill side effects at all from various substances.</p><p>They were taking at the time 1 tablespoon of Fibreblend morning and evening when the bizzare effects were noted.</p><p>Both would like the world to know that using psychedelics whilst doing herbal bowel cleansing treatments is potentially a bad and uncomfortable experience.</p><p>:)</p>"
}
