{
 "title": "What Happened?",
 "author": "mdk",
 "citation": "Citation:   mdk. \"What Happened?: experience with Mushrooms (ID 4783)\". Erowid.org. Jan 4, 2002. erowid.org/exp/4783",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 4783",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 4, 2002",
   "Views: 5823",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nIt was about 6pm on a Saturday night, I was with a few friends on our way to go pick up some weed.  The person in the car who was hooking us up informed us that there might be a chance to get some 'shrooms.  I had only done 'shrooms on two other occasions, and both those times not much happened.  We all chipped in some money and told him to go for the 'shrooms if they were availible, and if not, just go for weed.  After about 20 minutes, he returns to the car and tells us the good news, he got the 'shrooms!\r\nWe decided to go back to my friend's place because his parents were out for the night and because he had a game system we could trip out on.  So we get back to his place, divide up the mushrooms onto some chocolate ice cream, and dig in.  We then played some games and watched some tv for about 45 minutes to an hour.  No one felt the 'shrooms coming on yet, so we went out to smoke some weed just to get things going.  After a medium sized joint and a full bowl, we went back inside to play some more games.  I grabbed a coke, went downstairs and sat down on the couch.  It was just shortly after that I felt the 'shrooms kick in.  There was about a minute of the 'things are different' feeling and then everything started to go wrong.  I felt like I had to get up, but my vision was starting to go dark.  I got up off the couch, feeling very strange.  I tried to make it to the stairs but I hit the ground about halfway up.  I woke up with everyone in the room standing above me, yelling my name.  My nose was bleeding and I had no idea where I was.  They helped me sit up against a wall while I tried to stop my nosebleed.  I still had no idea where I was, and I was wondering why everyone was still looking at me.  I told them I was alright, and that I just needed to sit down for a bit.  They were all freaking out because they thought I was going to black out again, I was pretty pale and I couldn't really move yet.  I had to ask for some blankets because I was really cold at this point.\r\nI was more or less alright after we watched tv for another hour or so.  I had regained most of my color and was able to move.  I could feel the mushrooms working now, but I wasn't in any kind of mood to take advantage of the trip.  Since I could move now, we thought it would be best to drop me off at home, so I could just take it easy.  I sat in my bed tripping out for about 3 hours before I was able to fall asleep.  It wasn't a good trip, but it wasn't really bad either.\r\nOut of the 4 of us who ate 'shrooms, one guy didn't feel anything, another guy had a really mild trip, and the other person (who ate about twice as much as any of us) had a decent trip.  I can't say whether or not I'll try them again. I do really believe mushrooms are a great way open up your mind, but maybe I'm just not meant for them =P\n\n\n"
}