{
 "title": "High in Hawaii",
 "author": "Rxjunkie",
 "citation": "   Rxjunkie. \"High in Hawaii: experience with Cannabis (ID 47841)\". Erowid.org. Apr 20, 2012. erowid.org/exp/47841",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2.5 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47841",
   "Male",
   " ",
   "Not Given",
   "Apr 20, 2012",
   "1295",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before this expirience, I had been smoking cannabis off and on for about 6 months with mostly pleasant and mild expiriences. I was on a organic farm exchange in Hawaii on the big island and had yet to meet one of my goals while there: get some real good bud. I knew that would be easy since so many people smoke there and are very open about it. I met alot of hippies and rastafarians while there and would see people just chilling at the beach smoking. It was awsome how laid back it was and that people weren't all paranoid about doing it. </p><p>One day I got a ride from a guy called B the flying Hawaiian and one of the first things he asked was ' hey man, you like to smoke herb? ' I said yeah I did but had yet to smoke while in Hawaii. So he said maybe he could help me out with that and we headed to the beach and sat down with this big islander named bj. He spoke alot of pidgin so I had a hard time understanding him so he pulled out his pipe and a tin full of some dank home grown 'Kona Gold' and passed around the pipe. I took a massive hit and held it for about ten seconds. ' shit mon, e took a fuckin big it!' said bj. The smoke was harsh but sweet and I tried to control my coughing but couldn't. I passed the pipe and took just 2 more hits, the last one being mostly ash and took a break to wait before I smoked more. That was a very good idea cuz soon after they packed another bowl I was feel very high. I had very strong physical sensations of warmth and tingling and started to feel very heavy. Cannabis always seems to sedate me more than others, possibly cuz I take 10 mg of lexapro daily. b and bj smoked a couple more bowls and I decided it would be best to pass on anymore. </p><p>I closed my eyes and tried to relax and concentrate on breathing cuz I was feeling a bit anxious. I saw in my minds eye myself and I could see my heart and my lungs expand and contract with each breath. It was very surreal and I started to panic thinking the usual paraniod thoughts of ' oh shit, what if this is laced? I manahed to talk myself down and the panic subsided. I opened my eyes briefly and bj was explaining how to prepare some Hawaiian dish and was showing me some taro and other veggies I had never seen but I couldn't understand him due to his heavy accent and pidgin dielect. I realized after listening to him ramble on for what seemed like an eternity, I hadn't said a word. I thought I had but realized I had been thinking thoughts and responses and not saying what was on my mind, like I had telepathy. I felt like he could read my mind but I snapped out of it and began to try to respond as best I could but was too stoned to say much of anything intelligent or even move. I kept dozing off which I tend to do when I smoke, and I saw very brilliant colors and shapes shifting and changing into all sorts of bizzare patterns that I can't begin to describe. They were much stronger visuals than any I had before, so after a while I opened my eyes and looked out on the bay and at the palms swaying near the ruins of the place of refuge. </p><p>It was very beautiful and everything was so bright and all the colors were very vibrant and I saw trails whenever I shifted my eyes. I sat there for quite some time listening to bj give history lessons and complain about the state of the islands and I felt bad about how america and other countries had taken advantage of the Hawaiians and the islands. I had killer cottonmouth so I took a drink from bj's 40 and dozed off. I woke up a few minutes later and several people had shown up and I was still very high but for the first time in what must have been hours, I managed to move into some shade since my back wy getting burnt. A very wild eyed man sat down next to me and introduced himself as ' have a good day' I thought I was hearing things so I asked him his name again and he said it was have a good day. He proceeded to ask me why I was there and predict my future. He told me to go back to Oregon and study agricultre and he told me some things about me that I had no idea how he knew, like how I felt lost and felt I had no purpose and so on. It was really wierd and I thought he was like some oracle, something I would normally scoff at but I was too stoned for skeptisism. He was clearly fried from way too much acid and every few minutes he seemed to forget he had been talking to me and would reintroduce himself and mumble about random things and predict my future yet again. This time telling me to go back home and study archeology. It was really tripping me out and I wanted to leave but my ride wasn't ready to leave. So we passed around a joint and I just took a couple puffs and went back into my head to ignore the ramblings of the lunatic sitting next to me. </p><p>I finally left and got back to the farm and only four hours had passed. I was still a little high but not tripping out of my mind like earlier. I ate a huge meal of pbj sandwiches, and bananas and lilikoi. I smoked the remainder of the joint and put on my headphones and listened to sgt. peppers. It was so much better sounding than usual, and I felt great and drifted off to sleep.</p><p>This was a great exprience and really made me respect cannabis alot more and it felt good to talk myself out of a total freakout. This was the strongest bud I've ever had and I hope to run across some this good again. Good luck and have safe, smart and happy tripping.</p>"
}
