{
 "title": "Seperation From Reality",
 "author": "Lee",
 "citation": "   Lee. \"Seperation From Reality: experience with Ether (ID 47845)\". Erowid.org. Feb 10, 2008. erowid.org/exp/47845",
 "substance": "Ether",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Ether",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47845",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2008",
   "Views: 22485",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]<br>I first experienced ether at a friend's house.  I was already very high on weed at the time, however, and the only effects I felt were a mild alcohol-like intoxication.<br>I became curious again a few weeks later, so I separated some started fluid in a glass jar, dipped in the corner of a rag, and placed it over my face. After the first breath, I only noticed the chemical taste of the ether and a mild head rush. after the second, I felt more light headed. After that, I took several more breaths and took the rag off of my face.  For the Rest of the night (max 90 min.) I was disoriented and light headed, and also extremely apathetic. At one point, I heard my girlfriend's ring-tone on my cell phone at least 3 times, and did not feel the usual desire to speak with her. This is unusual, even when smoking cannabis, I always feel like talking with her.  I fell asleep while still under the effects.<br>The next night, I decided to repeat the procedure, but prepare better. I soaked the rag more heavily this time, and I did not take the rag off until I was certain if I took another breath I would not be able to move my arms to remove it.<br>This experience was amazing. At first I felt as though I was falling into my bed, but this gradually changed into a feeling of falling into myself.  I saw reality, in the form of my field of vision, start to spiral off into the distance.  I was scared at this, and successfully regained my real field of vision, briefly.  Soon, I saw everything spiraling off again, and this time I was powerless to stop it.  I was there in blackness for awhile, and remember wondering if I would ever go back to my room.  However, this time, I was not scared at all: I didn't have a preference in where I stayed.  Soon after, I realized that my eyes were closed and opened them.  Everything was very grainy for the next few minutes as I was coming down, and when things were finally starting to come into focus, I let myself fall asleep.<br>Overall, it was a very pleasant experience for me to be able to just watch the real world leave for awhile. I have done ether since, but never with such pronounced effects.\n\n\n"
}
