{
 "title": "I Don't Recommend It",
 "author": "HipPOnotick",
 "citation": "   HipPOnotick. \"I Don't Recommend It: experience with 5-MeO-DMT (ID 47877)\". Erowid.org. Jan 15, 2008. erowid.org/exp/47877",
 "substance": "5-MeO-DMT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47877",
   "Male",
   " ",
   "Not Given",
   "Jan 15, 2008",
   "Views: 7665",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So I sit in my chair.  Take a hit.  Lose all ability to control my self as I see everything start to break apart by each individual atom.  I have music playing so that I can have some sort of connection with the real world.  After 5 seconds, I find that it doesn't matter.  Within 1 minute all I know is my breathing and a wonderful feeling all through my body.  I try to focus on breathing, impossible.  </p><p>Next thing I know, Im on the ground, vomit bursts out my mouth as I reach for the toilet which seems miles away.  I lay on the toilet as everything begins to come back together and I feel as though I ate a load of acid and everything is some what melting back together.  My body aches, my face feels as though I will never smile again and it is slowly falling off.  I end up feeling so shitty and I see that my legs are all beat up and scratched with blood on them. Dont know why, so I take a shower.  </p><p>I sit there for about 10 minutes still waiting for the world to fully connect and become solid again.  Once out of the shower I walk out side of my room and into the living room to see three friends staring wild eyed at me and I say, 'If I new I was going to just pass out, throw up and then want to kill my self, Id stick to herb.'  Well it turns out...this is what happened (That is what I remember, I do not remember any of what is below, this is an account from my roommate and friends).</p><p>I took the hit, started to breathe real heavily.  My roommate leaves my room, where two other male friends and a female where sitting waiting to find out how this drug was.  Then, they hear me screaming from my room very excitedly and they hear banging and I am yelling at the top of my lungs 'I am free!!!!' and when my room mate comes back in, he sees everything in my room thrown around and I am on the ground spinning round and round hitting my body into everything imaginable.  I have dents in my wall on the corner from my head.  </p><p>My other two friends come and try to restrain me so that I do not hurt my self, I give them the look of death and my entire body is bright red and my eyes are bulging out of my sockets.  I then go through every single emotion possible.  As they try to hold me down I try and pull away from them down a hall way in my room towards the bathroom, they are unable to hold me down, or restrain me.  I supposedly have supper human strength... (They just didn't know Ive been working out lol ;) I make it to my bathroom where I squeeze my self in between the toilet and the bathtub still screaming it seems, but this time I was yelling something about pairs.  </p><p>Finally they where able to get me back in the hall way some how and the two friends left the room and the other original friend stayed until I was calm.  Supposedly laying on my back tapping my toe to the music.  At this point, I am guessing this where I came too and reached forward towards the toilet.  I have no memory at all of any of this.  Honestly.  I don't recommend it.  It was no fun because what good is all that happened if 'I' wasn't there to experience it or get anything from it.  Also, I think I may have just been given way too much to smoke for my mind and body to handle.  </p><p>In the end, my shoulders were bleeding and my shins, and I had bruises on my thighs and two huge ones on my lower back on both sides, my head was fucking killing me and I hope I didn't cause brain damage...although I can still add, so things are looking up.  My elbows and arms were scratched up and I felt like shit inside.  It was fun for the first 5 seconds, and then...I just don't recommend this crap. Plenty of better drugs out there.  Good day.</p>"
}
