{
 "title": "Glimpses of the Infinite",
 "author": "Wayne J.",
 "citation": "   Wayne J.. \"Glimpses of the Infinite: experience with Mushrooms - P. cubensis & Cannabis (ID 47892)\". Erowid.org. Sep 29, 2007. erowid.org/exp/47892",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:20",
   "100 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)",
   "  T+ 2:20",
   "1 capsl",
   "oral",
   "Cannabis",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47892",
   "Male",
   " ",
   "Not Given",
   "Sep 29, 2007",
   "10831",
   " "
  ]
 ],
 "report": "<p>Saturday afternoon, homegrown buds & shrooms.</p><p>Bear arrived for our fortnightly cookout, followed by shamanic doses of psilocybe cubenis mushrooms and spiritual tripping about 5:00 pm. I started the fire and soon we were roasting corn, with ribs and potatoes while smoking a fatty. Around 6:20 pm the meal was ready and my wife had returned from the market. We ate a full meal and about 7:20 pm Bear and I each took a fruit drink containing the actives from 100 grams fresh psilocybe cubenis mushrooms. My wife acts a guide when we seem to need it.  In addition I took one Cannabrex 3X Platinum capsule. The Platinum formula I used called for two grams butane extracted cannabis resin in twenty-four capsules with an inert filler and a piperine bioavailability enhancer.   </p><p>7:47: Time for Takeoff</p><p>The drink brought a strong come on. My wife came into the room with a funny greeting card. One look and convulsions of laughter ripped through my body like a high intensity earthquake. Soon Bear and I were rolling with laughter on the living room floor. </p><p>Arrival of Immanence</p><p>The trip then picks another level of intensity and the room is suffused with extra dimensional light, it evokes an awesome presence. Like the air of an ancient cathedral, the room is suffused with a warm golden glow. I have a feeling that I been transported into a divine dimension and that my creator welcomes me to stay if I so wish. But I vaguely recall I have responsibilities, a business to run, people who are counting on me to make things happen and resign myself to fact that I cannot stay forever.</p><p>The Garden and Eden and knowledge</p><p>Iron Butterflys In the Garden of Eden, better known as In a Gadda Da Vidaplays and I suddenly understand that the allegory of the Garden of Eden describes mans development of higher faculties, the knowledge of good and evil. And that once possessed of that knowledge man became able to judge himself, and more importantly other men, thus infringing on the sovereign territory of God. It becomes immediately apparent then that knowledge it mans greatest gift and greatest burden and that when it comes to understanding the nature of God knowledge is ultimately useless. One must go before God sans knowledge. </p><p>As a small child, my companion says.   </p><p>For a few moments I am left feeling deflated, trapped in the hell created by knowledge. But that passes soon enough and I understand that whilst knowledge can be a spiritual impediment, it is a pragmatic gift: it penalizes in one sphere, rewards in another.   </p><p>The Primordial I AM</p><p>Feelings of an infinite presence intensify and an ancient voice reverberates through every fiber of my being.  It is, I am certain, the voice of the creator--the original I AM which rises up from the void and creates all existence with the power of the word. Suddenly I understand that all that exists is an emanation of the force that speaks existence in being. I feel All that exists is possessed of sense of self, a sense of being, for in all that exists a small repetition of the divine I AM echoes within all just as it echoes within myself.</p><p>The strands of existence whirl about in extravagant geometric patterns and I see at once how monks in ancient Tibet had been able to walk though walls. It is almost as if I had been there while it was happening. Images of stone temples and Himalayan panoramas rise uphalf realized, half transparent like distant memories, hover before me an instant, then unravel into swirling strands of wildly colored geometrics. The universe is alive, all of it every last atom reverberates with the primordial I AM. Thus everything that exists must at some level have a sense of itself and so deserve respect. Truths Hindus hold as self evident are suddenly self evident to me as well. Even the dung beetle has a sense of itself and as an extension of the creator deserves respect. Everything that we see is but an extension of something unseenicebergs. Or in the Christian tradition we see through a glass darkly.    </p><p>I also comprehend how fragile yet how eternal existence is; everything that exists always has and always will a quiet voice tells me. Yet all exists because of faith in its own existence and nothing more. I see all existence as a circle where nothing is ever wastedever and it seems true and right. How could things possibly be any other way? I am filled with sense of awe at the forces that hold existence together while it trembles constantly on the edge battling forces that would unravel it. I feel compelled to go out into the night and gaze into the heavens.</p><p>The night is preternaturally bright under a near full moon. It dazzles me. I am struck by sudden understanding of the power of the original creative voice, that voice which spoke I AM and created all we behold. I contemplate the cold void that must have been before the voice arose and brought forth light and warmth and tremble at what would be without the essential creative force. I am filled with trepidation of the power of such a voice that and brings everything from nothing.</p><p>I go back into the house shivering. Bear asks for something warm. I look at the clock and find its only a few minutes past ten.</p>"
}
