{
 "title": "A Gateway to Hell",
 "author": "Virismala",
 "citation": "Citation:   Virismala. \"A Gateway to Hell: experience with Salvia divinorum (ID 47928)\". Erowid.org. Apr 4, 2007. erowid.org/exp/47928",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 47928",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 4, 2007",
   "Views: 3270",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nMy first experience with Salvia divinorum was, for lack of a better word, thoroughly disappointing. A couple months ago, I was in Phuket with a friend. We had a great time sightseeing. It was great, too, that everything was free. My friend has a friend who works there and that friend was able to drive us around the island. The hotel we stayed in was also great. I realize most people are still loath to go there due to last year's tsunami attack, but I assure you, Phuket is still a very beautiful island and everyone should definitely visit! \r\nOkay, now to my very first Salvia experience. \r\nI had purchased an ounce of Salvia leaves a couple weeks prior to my Phuket visit. I'd rolled around half a dozen joints of shredded dried leaves to take with me. On my first night there, I decided to try it. I was very excited about trying Salvia. I'd read mostly everything I could get my fingers on (from the Internet) about Salvia and was looking forward to losing myself (and my mind) in it. \r\nThat night, I smoked all 6 joints, making sure to hold the smoke in for as long as I could. The smoke was, quite surprisingly, mellow and smooth. I was glad it was so easy to hold in. And...nothing. There was just a slightest buzz. And aside from making me sweat profusely, I felt nothing else. I was sad and disappointed. And I comtemplated what I should do with the rest of my Salvia. Since Salvia yields no effect when drank, I was at a loss of idea. \r\nThen a week later, after I'd returned to Bangkok, I was able to get my fingers on another piece of information regarding Salvia. You see, I didn't want to believe that I was THAT insensitive to Salvinorin. Marijuana has no effect on me. I dreaded to think that Salvia wouldn't work on me, too. I found that Salvia rarely works when smoked in a joint, that it needs to be burned extremely hot for the Salvinorin to evaporate. So, I decided to get my hands on a pipe!\r\nDetermined to feel the effect of Salvia, no matter how much of it I had to smoke, I ordered a cool bronze pipe from a well-known online vendor. It came in the mail just a few days later. I was, once again, excited!\r\nTwo weeks ago, approximately, I thought it a good time to give Lady Salvia another try. I filled my pipe 3/4 full of finely cut & sifted dried leaves, sat comfortably back, and braced myself. I lit it up, held the flame over the herb all the while, and inhaled deeply. First hit... hmmmm sweating profusely again (Bangkok heat, and I couldn't smoke in my bedroom where it was air-conditioned -- now I only had a huge fan to cool me down). Hmm...there was something. I exhaled and waited. And I felt something. A definite buzz. Not so mild, either!\r\nI got rid of the remaining ashes in the pipe, somewhat clumsily, and refilled for another hit. I took it in the same manner this time. And yes, definitely something. My vision was a little blurry and I was seeing light flashes. My arms felt heavy and my throat felt sticky. I remember thinking how my throat was probably coated thick with tar. And then...my sister showed up. She just got home. I didn't exactly look stoned and she didn't exactly pay much attention to me. We exchanged a few words and she was gone. And that's when I realized I was already coming down from my oh-so-little way up. I would say I was only up like half a step. By then, I was too hot to smoke more. A huge glass of water later and I was heading for my bed.\r\nMy third experience with Salvia took place just last night. I'd decided after my second try that smoking Salvia in a pipe, with just a steel gauze as filter, was inadequate. The smoke is just too hot when smoked that way. Also, I was inhaling more tar than anything. As a result, I'd opted to purchase a water bong. But last night, still without my water bong (it just arrived today, actually), I wanted to try her again. Same procedure as my second try, I smoke 3 hits, each time holding the smoke in as long as I could. It was hard. The smoke was way hot and irritating. Anyway, even after the first hit, my eyesight was already going awry. I was, once again, sweating like a pig. After my third hit, I felt like my arms were getting pulled down, like I was sliding down. But where? \r\nMy sister, a party pooping bitch that she is, chose that precise moment to come home. She rang the door bell twice. My brother yelled at her in response. Whatever I was feeling, I held it until she showed up. We exchanged a few not-so-kind words: me telling her to stop breathing my air and her telling me to fuck off. \r\nShe left, I closed my eyes and lay back, hoping for at least some close-eye visuals. At that point, I was too annoyed to take more hits. I didn't exactly see clear pictures. It was hard to describe. Picture a greek temple, Parthenon-like, Doric. From the edges of the stone top, naked humans slithered about, trying to escape. They were screaming, but there was no sound. I didn't see clearly and everything was pretty much painted transparent red. But I could make out what I saw as such. I saw arms and legs, and some bodies. They were all wriggling about, trying to get away. After like a minute, all faded. I opened my eyes and I was still hot and sweating. I got up and after a huge glass of cold water, I headed for my bed. \r\nWhat little I saw, I wasn't afraid. I was actually hoping to see more and even hear voices/sounds. I'm a lover of all things horror and quite frequently, I would dream of horrible things I quite enjoy. If I were to tell others of my dreams, they would label them nightmares. I don't get nightmares. Or I simply don't consider them to be. \r\nWell, my water bong's here (yay!). I will try again tonight. Hopefully, Lady Salvia will take me somewhere, far away from here. Notice that I first thought I was insensitive to Salvinorin. I figure I'm not insensitive to it at all. If one hit of 1x dried leaves could give me a strange buzz and light flashes, imagine what a hit of 5x or 10x would do to me.\r\nBut I wonder, was what I saw a gateway to hell? I definitely need to find out.\n\n\n"
}