{
 "title": "Mild Sedative Nothing Special",
 "author": "Pop the Shizz",
 "citation": "   Pop the Shizz. \"Mild Sedative Nothing Special: experience with Damiana, Valerian & Lactuca - L. virosa (ID 48031)\". Erowid.org. Apr 21, 2006. erowid.org/exp/48031",
 "substance": "Damiana, Valerian & Lactuca - L. virosa",
 "bodyweight": "290 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7.5 ml",
   "oral",
   "Valerian",
   "(extract)",
   "  T+ 0:20",
   "7.5 ml",
   "oral",
   "Valerian",
   "(extract)",
   "  T+ 0:30",
   "7.0 g",
   "oral",
   "Lactuca - L. canadensis",
   "(tea)",
   "  T+ 0:30",
   "7.0 g",
   "oral",
   "Damiana",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48031",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 21, 2006",
   "Views: 11542",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nTwas another sad day knowing that all my opiate connects were dry. I've been searching for weeks for a legal alternative to getting that opiate buzz. Even though I was unsuccessful in my quest, I came across some interesting herbs.....\r\nPrevious experiences and doses:\r\n1-3 grams Wild lettuce - mild sedative, not much\r\n1-2 gramsDamiana - the opposite sex seems to be very strongly in mind on this stuff.\r\n1/4 - 1/3 fL. ounce Valerian extract. It came in a one fluid ounce tincture - calming and brain relaxation. Fould it fairly easy to fall asleep.\r\nHere are the doses\r\n15 mL or half ounce valerian extract\r\n7 g wild lettuce\r\n7 g damiana\r\nNo food or other drugs were taken prior to ingestion.\r\nvalerian was taken orally with a little water\r\nwild lettuce and damiana prepared in 55 oz of water NO sugar\r\n12:30  7.5 mL of valerian was taken. If I to compare the taste of this to somthing it would have to be peas. Taste like someone took a bag of green peas and made some kind of liquor out of it. It almost instantly lets me know its there with a tiny little head buzz.\r\n12:50 Starting to sweat a little bit, I notice a feeling of chill in my brain almost telling me to stop writing and listen to some music. Another 7.5 mL was taken.\r\n1pm After confirming that the heat was coming from my body and not my house, I sat in my kitchen a smiled a bit.  Nice enjoyable heat though, very odd that im auctually enjoying this heat. The tea is just about ready, looks like a dark cloudy maple syrup. A very bitter and rancid concoction, especially without sugar. Instantly calming like chamomile, however. The kettle says a little over 50 oz, so i got a lot of drinking to do. I'm going to take a break from writing and watch some rocky marathon.\r\n1:58pm just drank all the tea and only got minor sedative effects.\n\n\n"
}
