{
 "title": "Exploring",
 "author": "Wolf",
 "citation": "   Wolf. \"Exploring: experience with Mushroom - P.  cubensis & Cannabis (ID 48056)\". Erowid.org. Sep 17, 2007. erowid.org/exp/48056",
 "substance": "Mushroom - P.  cubensis & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 3:00",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48056",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 17, 2007",
   "Views: 3812",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a report about my first experience with mushrooms.  Im going to try to explain my experience to the best of my abilities and with the greatest detail possible.  First off, Im a 17-year old male.  </p><p>Briefly describing the setting, it was Friday and my friend D and I were planning to trip today.  D had tripped several times on mushrooms and was experienced, but I had never tripped before.  The trip began after a goose-chase of obtaining 5 grams of hydroponic mushrooms and finishing up my job at an ice cream store. D was experienced in experiencing the mushrooms, but I had extensive knowledge about psilocybin, mushrooms, and the psychoactive affects of the trip.  Ive spent at least 4 hours reading about how mushrooms affect the brain, and Ive also read numerous reports on individual experiences with mushrooms.  I knew exactly what to expect.  Im also a post-addict from marijuana and use to smoke 5 times a day for a little over a year, although now I smoke weekly.  </p><p>I show up at Dereks house 30 minutes after 10PM and the trip is going to take place in his room.  At first, I felt the need to test my sensitive to psilocybin, because I am extremely sensitive to pot.  </p><p>T11:05PM  I Ate .3 grams with a spoonful of honey and some orange juice.  This was the first time I had eaten anything for about 5 hours.  </p><p>T11:25-12:00  Affects were not felt after slowly increasing my dose.  By 12:00 I had eaten a total of 2.5 grams.  D also ate 2.5 grams.</p><p>T12:20  I began to laugh uncontrollably.  Every single time I breathed, I would have the biggest smile on my face as I exhaled and would almost always giggle; I had never been so happy in my life.  </p><p>T12:30  The trip began.  I began having the best euphoria I had ever felt; the body high was very impressive.  The hallucinations werent as intense as I had anticipated,  they were very subtle.  Slowly colors began to be extraordinarily beautiful and I was able to smell the colors.  My body high was constantly changing, based on thoughts and what I was looking at.  I felt unbelievably good; I felt like I was experiencing the best feeling in the world, like there was absolutely nothing that could feel better than this.  I was still laughing every single time I exhaled and was constantly giggling and smiling.  I was in a deep bliss.  During the peak the euphoria was felt inside my head and the rest of my body.  There was no confusion present and there were no thoughts present; I felt like I was home.  There was no trip going on inside of my head; the trip felt external and not a mind trip.  As the trip continued, the high sensation moved more towards my stomach and was not present in my head anymore.  </p><p>T2:30AM  The peak was noticeably over.  I was no longer laughing like I was earlier and felt mildly depressed.  D and I wanted to smoke some pot; we had some decent chronic.  </p><p>T2:45AM  I feared it might have been to late to smoke, because it felt as if much of the trip had worn off.  I smoked one hit out of the bong; it tasted and smelled better than usual, because I was still tripping a little.  I felt the affects of the marijuana immediately and it improved my body high and mood dramatically.  But, where I went wrong was when I decided on taking a 2nd hit, the 2nd hit was way too powerful.  Keep in mind Im sensitive to pot.  For instance if I smoke pot, the following day Im usually thrown into a day long manic-phase and then a day of depression.  I was in control of the high initially and was feeling great, but then things started to get bad.  I had no clue how powerful pot was combined with a mushroom trip, it multiplies the affects of pot by probably 3-5 times, but that is only my estimatation.  </p><p>T3:05AM  I had extreme cotton mouth-and the mind trip was extremely intense.  I was nauseous and had a very strong cold feeling; I simply could not warm up.  I felt the transition from the euphoria to the eternal black void.  I believe I began to hear wu-wus in my head, but Im not positive.  The sound in my head sounded like some sort of loud rumbling lawnmower; this was accompanied with a weird shriek-like, frightening monkey-cry (for lack of a better description) occuring a few times a minute.  My body high began to feel dark and black.</p><p>I had a kaleidoscope rainbow pattern covering my vision while my eyes were open and closed.  Every single object in my field of vision morphed into various shapes and colors spontaneously. I could only think in shapes.  When my eyes were closed I saw countless shapes changing.  I completely lost track of who I lost my ego.  My pulse was about 3 times higher than normal and I was breathing rapidly.  When I looked at D with my peripheral vision, he seriously looked like some type of primitive mix between a lion and a monkey; it was very weird.  I began to fear that I had permanently screwed up my vision and possibly inflicted myself with HPPD.  I was significantly colorblind; many colors were differant than they were suppose to be and objects were flying all over the place in my peripheral vision.  </p><p>T5:00  The black-void affects finally worse off and I was glad to have made it through the eternity of bullshit.  But, when the experience was over I felt very accomplished and was surprised at how powerful 2 hits were.  It was my most intense high I had ever had.  </p><p>Finishing up, I learned a lot about mushrooms this night.  I learned not to smoke my normal dose of pot after a mushroom high.  Preferably I would never smoke pot until the peak affects of the mushroom high wore off, because pot changes my trip dramatically and changes many positive aspects of the mushroom trip.  Before I tripped I feared that I was susceptible to HPPD and I was unsure if mushrooms caused HPPD, although it seemed like that wasnt likely after I had read many reports on mushrooms.  Finally, mushrooms are my new D.O.C. and Im looking forward to doing them again, unfortunately I found them quite addictive and I might end up tripping again in 2 weeks.  I wrote this report the day after the experience and strangely enough, I feel much happier than I did before the trip.  I feel like my life has more meaning and more of a purpose.  Sadly, part of the reason I feel this is because I found an unbelievable drug to look forward to.</p>"
}
