{
 "title": "Pure Ecstatic Bliss",
 "author": "Plagueangel",
 "citation": "   Plagueangel. \"Pure Ecstatic Bliss: experience with Kratom (ID 48055)\". Erowid.org. May 3, 2006. erowid.org/exp/48055",
 "substance": "Kratom",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "18 g",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48055",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 3, 2006",
   "Views: 6364",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently purchased a one(1) ounce bag of Kratom at an online vendor. I had poured it into some dark blue glass jars and set aside. One day I was feeling kind of bored, and not particularly looking forward to going to class. I decided that since I had nothing important to do in my classes today, I could go ahead and give this stuff a shot.</p><p>First, I brought about 2 cups of water and brought it to a boil in a teakettle. Then, I poured the boiling water over 9g of kratom in a pyrex container. It steeped for about 5 minutes. Then I strained the mixture and placed it into a coffee cup.</p><p>I drank this mixture and was feelin a nice body buzz. I was about to head off to class, so I quickly repeated the above process with the used plant matter plus an additional 9g of plant matter. I placed this mixture in a nalgene bottle.</p><p>The bottle went with me to English 111, and sipped it during class. It really doesn't taste that bad after a while. At worst it is just a tad bit bitter. So anyway, as I sipped this in english, the full effects of the previous batch (or at least I believe it was that batch) began to kick in. </p><p>I cannot find sufficient words to describe the feeling that coursed through me. It was as if my blood had turned to lead in the sense that my whole body felt instantly heavier. Also, my sensations that I felt seemed intensified. After another 10 minutes, I felt a permeating sense of bliss coursing through my body. I felt like doing absoulutely nothing but sitting there and riding the wave. It was undeniable, pure, ecstatic, bliss.</p><p>The feeling is undeniably wonderful.</p>"
}
