{
 "title": "From MariPills to Cookies",
 "author": "BT",
 "citation": "   BT. \"From MariPills to Cookies: experience with Cannabis (Oral) (ID 48103)\". Erowid.org. Nov 21, 2005. erowid.org/exp/48103",
 "substance": "Cannabis (Oral)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cannabis",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 48103",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 21, 2005",
   "Views: 8845",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nDosage is kind of difficult with taking cannabis orally.\r\nI once tried a product called MariPills that smelled much like hash, but was made orally active. A package was two 200mg pills, and lasted about 5 hours ( I took all 400mg), with onset taking about 20-30 minutes. I don't think it was very well made, considering the dosage and short effect. \r\nThat hade me intrigued, so I used butane extraction to produce 40ml honey oil, which was then added to 40ml 95% ethanol (everclear), and heated until just before boiling. I then slowly dripped in about 20ml melted butter (real, unsalted butter, not margarine), sealed the container, and shook. This didn't quite produce an emulsion, so I added 5ml more ethanol, heated until the alcohol was boiling, added 5ml more melted butter, and shook like hell. This time, an emulsion formed, and I allowed it to sit, hot and open, overnight, where it cooled to room temperature, and most of the ethanol evaporated. \r\nI then added this, in place of butter, to a batch of 6 large (about 4in dia.) chocolate chip cookies. Let me just say.. one had me stoned out of my gourd. Another half, and I could barely keep my eyes open. Unfortunately, I can't say true dosage, but I'd say an average of about 6.5 ml honey oil per cookie, and I couldn't even guess how long the effects lasted, but it was from about 10 a.m. when we ate the cookies warm from the oven, and I believe I passed out some time around 2 a.m. that night. \r\nPlease note that at this point, it was my second day off an 18 month sober binge, so it's possible it was just my extremely low tolerance at that point, but it seemed to effect my friends the same way as it did me (they smoked the entire 18 months I couldn't).\n\n\n"
}
