{
 "title": "Chronic Insomnia",
 "author": "Dakota Pink",
 "citation": "   Dakota Pink. \"Chronic Insomnia: experience with Amitriptyline & Alcohol (ID 48124)\". Erowid.org. Feb 8, 2008. erowid.org/exp/48124",
 "substance": "Amitriptyline & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48124",
   "Female",
   " ",
   "Not Given",
   "Feb 8, 2008",
   "Views: 18987",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had chronic insomnia for years and nothing was working, infact it was ruining my life because I had to drop out of school and had to find a job that didn't require a set schedual.  Well I started stripping to pay the bills because I can stay up all night and I am reasonably attractive and even used to model.  I started taking Elavil at 50mg then 100mg and finally at 150mg. I was able to sleep everyday and wake up feeling great.  </p><p>Well because of this drug I gained 25lbs and lost my job, but I had begun Real Estate so I didn't care and I was back in school.  The highest dose began to stop working, gave me mood swings, constipation, a weaker eye perscription and began to make me be constantly depressed, not to mention turned my skin and nails yellow.  I started drinking with my pill because if I could still sleep every night I could deal with the side effects.  Alcohol did work for a short time, but eventually I needed more and more to go to sleep.  The thing with Elavil though was I got a different type of drunk when I mixed this pill with booze.</p><p>This drunk consisted of irrational and unhealthy behavior which I had never had.  This new kind of drunk gave me a feeling of euphoria and invincibility and because of this I got arrested.  My designated driver was more drunk than I was and normally I would have called a cab, but instead I wanted to have fun.  I got in my car to drive my friend home and thought screw the speed limit, I can drive fine, which I could.  Well I got pulled doing 60 in a 35 and didn't care or even worry.  When the cop came up to my car he asked how much I had to drink and I said too much.  I passed all of the field tests with flying colors but the cop still wanted to breathalize me and I blew a .19.  He was shocked because my physical reactions were perfect, but my attitude was so happy and care free that the cop felt bad for arresting me.</p><p>I was never put into handcuffs, the cop took a 30 min walk with me to try to sober me up and we even began to talk about our personal lives and I got him to give me very private information of his life because I was so laid back.  He never put me in jail because I was so nice and he even drove me home after the arrest to ensure that I would be safe.  Well I'm charged with a .17 and a speeding ticket but I'm waiting for my court date.  The cop will testify in my behalf, but I still have to get a breathalizer on my car for a year, go to counciling, pay a fine, lose my license, do community service and hopefully not be givin any jail time (possible for me up to 3 years).</p><p>I cheeted on my boyfriend but don't remember a single thing the whole night, I tried to jog around my city at 1:30 in the morning in a bad neighborhood because I could and even lost $900 at work stripping because I drank champange and let the man walk out with out paying me because I didn't know what was going on.  For some people the pill may work under a doctors supervision and with out alcohol.</p>"
}
