{
 "title": "The Walmart Lives",
 "author": "Risner",
 "citation": "   Risner. \"The Walmart Lives: experience with Salvia divinorum (ID 48131)\". Erowid.org. Jan 8, 2008. erowid.org/exp/48131",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48131",
   "Male",
   " ",
   "Not Given",
   "Jan 8, 2008",
   "Views: 4043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Watched two other people trip this stuff we got from here in Austin, TX.  First guy to do it, Phil, was smarter than my sister and I and wanted to hit his bowl outside.  He went completely retarded, and ended up walking back into the house and into the kitchen.  He looked scared as shit the whole time, and after he was done tripping he said he didn't like it at all.  When he was comming down he refused to give us the rest of the Salvia because he didn't understand why we'd want to take something so horrible.  Can't say I blamed him.  </p><p>I'd tripped Salvia twice before.  The first time was at Lake Travis in this crazy camping spot.  It had this little lizard that kept checking us out, and there were two rocks on the picnic table; a piece of flint and a crystal.  The rocks didn't look like anything special, but I thought it was kind of weird they were there.  Not too long after arriving this chick showed up alone, and my cousin says he saw her 'transform' into some sort of monster.  I knew there was something about her.  When I saw her drive up I caught her eye and I felt like I pulled her to us.  We weren't on anything but Weed at the time.  The girl asked us how to get to some spot across the lake that wasn't even on our map, and then she left.</p><p>Later that night when I actually tripped on Salvia, my cousin and his friend were tripping on a low dose of acid, and my other cousin wasn't tripping on anything.  All of us heard deep earthy footsteps, so chillingly close it scared us when we realized there wasn't anything around that could have made the noise.  I perceived the steps as moving in one spot, and yet somehow getting closer.  I fell asleep while my scared little compadres were so moved by their fear that they picked up sticks and went around trying to find the culprit who made the foot steps.   </p><p>The salvia trip that time was undefineable.  My body felt all weird and hard like plastic, which was brought on by what I'm going to call 'the rain of segmentation'  - I saw 'rain' and it brought on the feelings, and also the perception that all there was was a grid in front of my eyes, and that somehow I was the grid.</p><p>The second time I tripped on it I was in my sister's room.  There was the 'rain of segmentation' and then more weird thoughts.  I heard some girl ask 'Is he comming?'  That's the only thing I can remember.</p><p>This time was totally different.  As I said I watched my friend Phil get high first.  Then it was my sister's turn.  Unlike Phil and myself, my sister did not go retarded.  She had to move around just like us, but she had the most serene look on her face, and she couldn't walk.  She had to crawl around.  She also ended up in the kitchen.  She experienced something unique, and was able to tell me about it.  Phil could only say that durring one point in his trip he realized he was missing his self.</p><p>My sister's goal durring her trip became the return to reality, possibly due to the fact all of us who tripped on the Salvia felt the need to get away from the other people in the room. Lia knew that in order to return she had to move.  She and Phil both saw 'the grid' but my sister realized that she had to 'pull back the pages of the grid' in order to return to reality.  At one point her friend Ashley got in her way, and my sister freaked out a little because she knew that the thing she was looking at wasn't her friend - 'it was someone pretending to be her.'</p><p>Now to get to the point.  I'd been thinking about that girl at the lake earlier that day, and she'd been the subject of a conversation between my cousin and I a few days before.  Then Phil comes back with Salvia.  Didn't matter if it was coincidence or not, I decided it was once again time to trip on this strange, strange plant.  I didn't know what to expect - I'd forgotten about the discomfort the plant caused.  I did know that I was going to have some extremely weird thoughts, but I hadn't figured out what those thoughts were, even though I'd read some of the experiences on this site before, and I'd been reminded, right before I tripped, that people 'become' other things.</p><p>So, I white walled the bong, and held the hit in for as long as I could.  I felt the 'rain of segmentation' and I said loudly, 'Ohhh, now I remember...' and then I was out.  No one heard me say anything.  I went the most retarded.  My sister says I was drooling and making retarded hand signals with my arms up against my chest.  I don't remember any of that, but eventually I was able to grab onto sobriety and the next thing I knew I was outside, pissed off.  I just layed down on some stones in the front yard.  Then some guy walked up and had the nerve to ask me if my sister was inside.  I told him something stupid.  Then Ashley came out to get in my way.  I cursed and got up.  She told me she was fucked up too and knew how I was feeling.  I told her to go lay down in the yard. That's what I was going to do.  </p><p>As I looked down at the ground to find the best place to lay, I couldn't distinguish one 'circle' of grass from another. I said 'God damn it' and then just layed down where I was standing.   That whole little time I was sober I felt like I was holding something back, and the only way I was going to release it was to lay down on the ground.  Basically I was still tripping, but I was able to filter out the trip to carry out the semi sober movements of someone trying to avoid other people.  So, when I finally hit the ground, I immediately started tripping again.</p><p>The first thing I felt was that I was being eaten.  I could feel something chewing on the top of my head.  That most horrible and disgusting feeling didn't last long, as I was being pulled away.  The next thing I knew was that I was rooted to the ground.  I could see the formation that gave me this feeling - I saw the grid and at the bottum it was sucked down into spikes.  Everyone who tripped on the salvia saw or felt something similar to this.</p><p>But, then I heard the people, so many people.  I felt the sun, and I realized I was a wall.  But that wasn't good enough - I was something else too.  I heard a little boy.  He was talking, talking.  I couldn't understand anything he said, but through him I saw what I was.  I was The Walmart.  I felt elated at one point, while I was still in the sun (we tripped the salvia at night time btw).  But when I became the inside of the store, that was the most disoriented I've ever felt.  I still had perception of the grid, but it was different - it had a different structure inside.  The only thing I can say to describe it is that each square of the grid represented a structural unit, in the case of Walmart, each structural unit was a person.  I could hear all the people.  What complete madness.  Especially sinse I couldn't understand any of them.  I knew they were speaking in English, but it didn't matter because none of it was relevant.  While I heard them all, I heard one woman specifically, and something told me it was because she had a cell phone.</p><p>Next I became shelves.  First I was the shelves inside the gardening part of the store.  I could hear little boys, but it was very feint.  I felt like I was upside down.  Very uncomfortable.  Then I felt like I was being peeled away, and I became a different set of shelves.  This was even more maddening than hearing that cacaphony of people, because this time all I could hear was little girls, and although I heard everything they were saying, the only thing I could understand was 'I want.'  I felt definate fear - 'the fear of getting taken off the shelf,' and 'the fear of not getting taken off the shelf.'  The fear of not getting taken off the shelf was far more relevant than the other fear.  </p><p>Relief came when a box was taken off.  I gained perception of the girl who took the box, the box itself, and the item inside the box.  Aside from the brief vision of what Walmart was to that little boy, this was the only time I perceived visuals that weren't the grid.  I saw the box, like a bubble, merging off of the shelf, and also the toy pony inside the box.  Both were red and featureless.</p><p>After I gained perception of the toy pony, I was once again outside - this time I was one of those coin operated horsey machines.  There was a little girl - I don't know if it was the same one that bought the toy.  I heard her conversation with her parent, but the parent was irrelevant.  All that mattered was the quarter, and the little girl.  I wanted more than anything for the quarter to go in the slot, and for that little girl to ride me so that I could move.</p><p>At one point the question occured 'What happened to that guy?' and then I experienced images of myself.  I had the warmest feeling towards 'that guy.'  I can't place when I had that thought, but it's relevant, because that's what Salvia does - it removes your self from the picture.</p><p>After the pony ride, I began regaining sobriety.  I knew I had a body, and figured that everything I was feeling was going on inside of my body, even though as my feelings continued to move, I realized this was highly impropable.  I felt everything on the top right side of my head.  The two most relevant feelings were that a door was sliding back into place, and that there was something alive and moving on the top of my head - it had a tail and I could feel the tail pushing against the ground.  I was disgusted with that tail.  It felt like it had nothing to do with me, and that it had a mind of it's own.</p><p>I've considered what the trip means to me, but sinse these Salvia trips have nothing to do with the self, can I really say that I experience a truth about the self while I'm tripping?  What relevance is there to thinking I'm a patato chip on top of a bag?  Does it prove that people are insane at the most basic of levels?  Or does Salvia seek to show me the grander picture - that me and my fellow men are certainly NOT the only things that are aware - that EVERYTHING is aware, and that those things we pay the most attention to gain a peculiar human perception?</p><p>Perhaps it would be wise for all of us to realize that the only thing we know that exists is awareness.  When you go to sleep at night, whether you recall it upon waking or not, you will dream a dream where the dream is the only reality you know.  There is nothing else.  When all your awareness is gone there is nothing.</p><p>To be fair to those who are skeptical, I tell you that before this trip I've had the growing suspicion that computers are aware.  There was and still is a desire in me to become the machine, to know if it is alive.  However, never in my wildest dreams would it have occured to me to consider 'The Walmart' the machine.  I have spent more time in front of a computer than most people, and compared to most, very little time inside retail stores.</p><p>I will also say that I consider the Carlos Castenada books (and those books of the two women in his party) the next 'bible.'  Not because they are popular, or because they were popular, but because, before I even read the books, it was proved to me, through my own observations, that at least some of what they say is true.</p>"
}
