{
 "title": "Replacement Therapy",
 "author": "Jeff T.",
 "citation": "   Jeff T.. \"Replacement Therapy: experience with Buprenorphine & Naloxone (Suboxone) (ID 48201)\". Erowid.org. Mar 22, 2007. erowid.org/exp/48201",
 "substance": "Buprenorphine & Naloxone (Suboxone)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   " ",
   "4.0 mg",
   "sublingual",
   "Naloxone"
  ]
 ],
 "footer": [
  [
   "2005",
   "48201",
   "Male",
   " ",
   "Not Given",
   "Mar 22, 2007",
   "Views: 18555",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been taking 16mg of Suboxone daily for about a month now and it seems to work wonders for me. As someone who was snorting about 320mg of Oxycontin a day  I can absolutely say that this drug preparation will safely prevent withdrawal symptoms and most importantly cravings to abuse other opiates (morphine, oxycodone, herion, and yes even methadone). Now this is something I have never experienced. Obviously every time I did OC's or some heroin the withdrawal symptoms subsided temporarily but no matter what I always wanted to do more. I no longer feel the need/want to do opiates. Suboxone will make me feel 'high' for a good 6 hours after taking it and makes me feel comfortable (lack of withdrawal) well past the time of my next dose, which would be every 24 hours. Some people report that it takes as long as 20 minutes to feel the effects but this could very well just be the amount of time that it takes to dissolve under the toungue for that individual because significant blood levels are reached in 3-5 minutes (Mendelson, Upton, Everhart, Jacob, and Jones 1997). I personally begin to feel the effects as I am dissolving my second 8mg tablet which would be about 5-10 minutes.</p><p>Buprenorphine and Naloxone will also bind to Opiate receptors making it impossible to feel the effects of other opiates when Suboxone is taken for 2 weeks or more. My prescribing doctor even told me of a man who injected 380mg of oxycodone into his Carotid Artery (big artery in your neck that will get a drug to your brain in less than a second) and felt nothing. To sum it all up this drug is a perfect choice for anyone who wishes to stop abusing opiates, but not so much for someone just looking to get high for the moment until they can snag some pills or heroin. The only drawback is that it is extremely hard to find a doctor who can prescribe it because not only does a doctor need a special permit, but the permit is only good for 30 perscriptions.</p><p>Important note: Taking benzodiazipines while buprenorphine is in one's system or vice versa is unwise. Injecting suboxone tablets, which contain naloxone, can cause someone to go into heavy withdrawal.</p>"
}
