{
 "title": "The Matrix of Life and the Cat-Shaped Buddha",
 "author": "Redefine",
 "citation": "   Redefine. \"The Matrix of Life and the Cat-Shaped Buddha: experience with Mushrooms (ID 48219)\". Erowid.org. Jun 17, 2006. erowid.org/exp/48219",
 "substance": "Mushrooms",
 "bodyweight": "14 kg",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "6.0 g",
   "oral",
   "Mushrooms",
   "(tea)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "48219",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 17, 2006",
   "2695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Earlier this year I had the good fortune of being asked over for the night to my friend J's house. He told me on the phone that he had bought some magic mushrooms and asked if would like to come round and try some with him and his friend, S.</p><p>The following day I arrived at J's house with some extra clothes, food, and a DVD of 'Yellow Submarine' (a very trippy animated film following The Beatles as the fight a war against Pepperland. Phew). J and S had tripped before, whereas I hadn't. I was a little anxious about what to expect. J and S ran me through the experiences they'd had and they sounded very positive. So, we went into J's living room where he had drawn the curtains and dimmed the lights to give it a chilled out feel. We ate the mushrooms. J and S ate all theirs in one go. I chose to eat mine at around 5 minute intervals. We started at around 7pm. I didn't like the taste so I went to get a drink of tea to wash them down with. I ended up putting around 6g of the mushrooms actually in the tea and left them to brew.</p><p>About a half hour later, we went outside and sat in J's beautiful garden. I had never been to J's house before since it is about 15 miles from my house and Id only known him about 6 months, but I'd never seen a garden like his. It was full of garden gnomes which we sat amongst, much to our amusement. As we waited for the mushrooms to take effect we sat and did a couple of bong hits. I smoked a cigarette and went inside to see if J had any alcohol (I felt like experimenting). There was none, however. When I got back outside I sat with J and S in a kind of circular sitting area in the garden. That was when I started to feel it. I felt the familiar stoned feeling I have had many times before from smoking hash. S started to giggle which in turn started me and J off. No-one had any idea why we were laughing until S went into a kind of trance. He was staring at something in the distance and sitting absolutely silent. It took me and J about 15 minutes to figure out what he was looking at. It was a tower block in a valley below. He started laughing at a face which he could see on the building. After a while, J stood up and walked inside. Ten minutes later he returned. We asked where he had been. He said he didn't know. This freaked everyone out, especially J.</p><p>Twenty minutes later we went back inside to watch TV and wait for our trips to peak. We smoked a few joints and had a good laugh. Whilst S was rolling a joint he pretended to throw something at J. He didn't actually throw anything but told J that he threw his weed at him and asked for it back. By now J seemed really spaced out; he fumbled around down the chair, behind the TV, and under the table, trying to find the weed. We fucked with him for about an hour (the time period is just a guess since no-one had a watch and the nearest clock was upstairs, therefore we had no concept of how much time had elapsed). S owned up to having the weed all along and J gave him a hefty punch in the arm. It wasn't out of malice but J didn't say anything for a while after that.</p><p>I suggested we watch 'Yellow Submarine' and everyone agreed. I put it in the DVD player (which took a while) and chilled out. The film contains some very psychedelic images and sounds etc. By this time I was very high and all I wanted to do was get higher and higher. I could no longer feel my body but I felt about 10 feet tall (I had never understood the term 'feeling ten feet tall' previously, but now I do). </p><p>After about half an hour I went upstairs to find a CD that J was talking about. I didn't know why I was looking for it or where it could possibly be. As I came back downstairs I noticed something on the wall to the right of me. I looked at what I thought was a very detailed painting. As in moved closer to inspect the fine brush strokes, the painting came out at me. It was then that I realized that it wasn't a painting but a mirror. That was the weirdest experience of my life. And just the idea of not recognizing my own face still gives me the creeps to this day. It was also then that I realized that I was way too high to be left alone so I went back into the living room where J and S were still watching 'Yellow Submarine', mesmerized. I sat down in the chair and went down my own internal path. This involved a lot of feelings and emotions that I hadn't felt since I was a small child. I then realized that being a child must be just like a mushroom trip. I felt like a kid again. </p><p>The film had a profound effect on me. I experienced a trip like nothing I have ever experienced before. I felt like I was in the 60s. For about an hour I knew that I was in London in 1968 (Camden Town maybe). Anyway, as I watched the film my eyes began to wander. I noticed how my vision had become very sharp and I could move my head quickly and nothing would blur. I tried wobbling my glasses for a while, the same way that Eric Morcombe used to. I could see J sat in the chair at the far corner of the room. It felt like he was moving up and down instead of the glasses. I started to feel slightly nauseous so I stopped. My eyes wandered to Js carpet. I could see tiny roads and streets in the pattern of his carpet! At one point I even heard what sounded like traffic noise coming from it, but it may have been coming from the TV.</p><p>My thought patterns and closed-eye visuals got very intense. My thoughts went into a loop. It wasnt unpleasant but slightly strange. I could change my emotions at will. I could laugh, cry, scream, and be silent all at the same time. And then</p><p>BANG!!</p><p>I felt my ego dissolve into a million pieces and then completely disappear. I felt like there was nothing outside the room I was in. I felt like I could communicate with anyone in a very understanding and loving way. The thing was I didnt want to at that moment. I knew everyone would understand if I didnt speak.</p><p>I started seeing some amazing visuals. Walls seemed to be breathing, colours merged into one another and my arms got longer. It was the strangest feeling I have ever had. Then, my visuals became incorporated into my thoughts. I realized that the behavior of everything in the Universe is influenced by everything else. I started to think about everyday objects. How sometimes its what isnt there that counts. For example, a window. A window is a hole in a wall. Its not there. A bowl is another example I thought of. The space inside the bowl is the most useful part of the object. The part of the bowl that is not there.</p><p>After about ten minutes of deep thinking, Js cat walked into the room. I watched the cat with awe at every move that he made. He looked like he was looking for something like a Ninja would. Being as quiet as possible and making the slightest movements. I gazed at him for a good five minutes until he suddenly turned around and stared into my eyes. I could sense that he knew I was high. I felt like I had reached a certain state which no-one had ever achieved before and that it was possible for me to communicate with the cat telepathically. The cat was sending me feelings and thoughts. He told me that everything is alright and that he was a trapped soul inside a cats body. He had a mission, given to him from a giant cosmic entity, to protect mankind. He told me that I am one of only a few people who know this and that I should keep it a secret. They will reveal it when the time comes. This was all very surreal. Suddenly the cat said he had to go and ran off into the kitchen and out of the back door. I didnt see him again for the rest of the night. I relayed my story to the guys (except the bits the cat had told me not to say). They both fell over laughing. I felt quite embarrassed but calm that I had some knowledge most people didnt.</p><p>We sat talking for another couple of hours, smoking. Suddenly, I felt very bored so I decided to go into the kitchen and make myself a drink. I ended up making a cocktail of Southern Comfort and pure orange juice. I was quite happy with my little concoction. I went into the living room and told the guys that I had an overwhelming feeling that, if we went back outside, the trip would start again. They werent too sure so I sat back down and sipped my cocktail. I was very suggestible at the time and realized I was peaking. J asked me what I was drinking. I told him. He told me that the guy in the shop told him that if youre having a bad trip to drink pure orange juice and the trip would end. I spat out a mouthful. I certainly didnt want this trip to end. However, I had already sipped a fair bit already so I set it down and never touched it again.</p><p>After a while we all started coming down together and got a lot more vocal. We talked for hours about the experience we had just had and were still slightly experiencing. After that me and J went upstairs to listen to some Jimi Hendrix on his record player. I slowly fell asleep and woke up at 2pm the next day feeling very good and refreshed, happy about the valuable experience I had just had.</p><p>I had to work at 6pm the next day and was so paranoid about catching a bus or train (it was only 3 days after the London bombings). I ended up dragging my mum to to pick me up. She was mad. I gave some excuse about there not being any buses because it was a Sunday.</p><p>I havent done mushrooms since but would like to. Unfortunately, the government made them illegal on July 18, since they found a loop-hole. Peace.</p>"
}
