{
 "title": "Analytical Account of my Experience",
 "author": "Psych",
 "citation": "   Psych. \"Analytical Account of my Experience: experience with 2C-B (ID 48222)\". Erowid.org. Jan 31, 2007. erowid.org/exp/48222",
 "substance": "2C-B",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "16 mg",
   " ",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48222",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 31, 2007",
   "Views: 3564",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n+1 hr: The onset is very mild and relaxed with overtones of anxiousness and mild paranoia, which is common with any first experience. Music has taken on a different dimension or realism, I am experiencing it as if it were more encompassing, I feel more immersed within the experience of it. Euphoric feelings rush me as I realize what I have done, this experience feels quite familiar for something completely new. Description has become quite enthralling, I am actually overjoyed at expressing my emotional reactions which seem to be completely in line with the rhythm, timber, and beat of the music I am listening to. I have become bored with descriptions now and will be venturing outside to experience nature how fun!!!!!!!!!</p><p>+2 hr: Visualizations have become more frequent yet are very malleable, cognition seems to be slightly diminished or altered in an indescribable way. Social interaction has yet to be experienced on this trip, yet I feel as if a social scenario could easily be integrated into my present state. Anxious feelings come and go in intervals, when feelings of anxieties arise, they are easily subdued due to the high level of rationalization available to me during the experience. </p><p>+3 hr: Social interaction has just taken place, was very normal, if not slightly more sensitized, I felt more empathy and understanding toward the person with whom I was interacting. My altered state was unknown, yet had the subject been less intoxicated, Im sure certain aspects of my personality would have been construed as altered. </p><p>+4 hr: Altered state remains constant with diminishing visualizations, overall energetic state has become more prevalent. Social interaction or shift of focus changes the experience almost reducing the intensity.</p><p>+5 hr: At base line with increased energy and a slight tightness or tension in the temple region, probably due to stimulant effects. </p><p>These were all written during my actual experience. I found this to be a very rewarding experience. 2cb has great potential especially if used properly.  I think given the malleable nature of ones focus this drug enables, it could be ideally used for introspective journeys or therapeutic purposes.</p>"
}
