{
 "title": "Painful Memories",
 "author": "blink",
 "citation": "   blink. \"Painful Memories: experience with Zopiclone & Fluoxetine (ID 48249)\". Erowid.org. Nov 27, 2005. erowid.org/exp/48249",
 "substance": "Zopiclone & Fluoxetine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(capsule)",
   " ",
   "25 mg",
   "oral",
   "Pharms - Zopiclone",
   "(pill / tablet)",
   " ",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "48249",
   "Male",
   " ",
   "Not Given",
   "Nov 27, 2005",
   "Views: 44464",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report details one of the lowest points I've reached in my life and I hope that it finds its way to somebody in that same place so they won't have to take the same path I did.</p><p>From the time I was in grade 6, I had been taking varying dosages of Prozac (and at some points switching to Paxil), on and off again, for 6½ years.  During this time I was also taking Ritalin and Controlled Release Ritalin, but stopped taking them going into my last year of high school.  Around this time I also began to go into a deep depression and at extremes, became suicidal.</p><p>Late September of 2001 - I went for a scheduled checkup with my family doctor to have my dose of generic Prozac (Fluoxetine) increased from 40mg to 60mg and to renew a separate sleeping pill prescription (Imovane).  Before the increase in dosage, I was taking 4 x 10mg pills daily.  My doctor and I agreed that taking 6 pills each morning was excessive so we switched from 10mg to 20mg capsules. </p><p>That evening at about 10PM, I measured my dose.  I forgot about the change in dosage units and took my regular 4 pills for a total of 80mg; 20mg more than the maximum recommended daily dose.  Upon realizing my error I thought out loud Well, I've gone this far, why not go for it.  I took 5 of my sleeping pills with an unknown amount of alcohol (no more than 2 shots at most) and took a further 10 to 12 Prozac, then went to sleep.</p><p>The rest of this report is both a patchwork of my own fragmented memory and 3rd party accounts I solicited after the fact from friends.</p><p>I remember nothing about that night or the quality of sleep (if any).  I awoke at 8am and out of habit, managed to dress myself and get out the door, in time to catch my bus at 8:15am.  I boarded the bus and stared out the window with my memory alternating between recording 5 seconds of memory then blanking for another 5.  I began to feel ill but held down the vomit for almost the entire duration of the bus ride.  Near the end of the ride to school, literally only 30 seconds away from the school, I couldn't hold it in any longer.  By a cruel twist in luck, I had seated myself in one of the two only emergency exits and proceeded to lift the red handle, push the window outwards and evacuated the contents of my stomach across the side of the moving bus.</p><p>I closed the window and looked to my left.  I had either terrified or shocked the girl seated next to me into standing in the aisle for the few remaining moments on the bus.  As it came to a rest I made my way off and apologized to the driver for the inconvenience I caused her and offered to clean it.  I don't know if she answered me because my next memory flashes to the inside of the school.</p><p>I found myself in the washroom alone, looking into the mirror, squeezing non-existent blemishes, feeling a strange, full body shiver.  I left the washroom and slumped down across the hallway facing its doors.  I had sat down next to some aquaintences of mine and struck up a conversation about something nonsensical.  After about a minute of trying to talk with them, the first bell rang.  The next bell would ring in 5 minutes, signaling the beginning of first class.  Around this time I pulled my right sleeve back and showed one of the group what was apparently several self-inflicted puncture wounds as well as 5 or 6 large safety pins going into and coming out of my skin.  Strangely there was very little blood.</p><p>The group I had been seated with were understandably shocked and left me sitting on the hallway floor.  I made my way to my locker and attempted to open the lock holding the door shut.  After several unsuccessful attempts, I lay down in front of my locker and went to sleep.  How long I lay there, I don't know.  At some point later, one of my friends found me on her way to her own locker nearby, and put my arm over the back of her shoulders to me in stumbling to the front office.</p><p>Once there I asked the office attendants not to call for an ambulance, urging that they instead call my mother.  For whatever reason, they agreed to and after nodding in and out of conciousness in the office chair for 20 minutes, she arrived.  I got in the rear seat of the car and explained I had the flu, took my medication on an empty stomach the night before and hadn't had any water.  She drove me home and went back to work.</p><p>At 11am, I was at home again, in my bed, nursing a bottle of water and crying due to the pain in my midsection.</p><p>After this experience, I swore off the sleeping pills and Prozac, opting instead to solve my problems on my own, without the aid of medication; not something that everybody can do but something I have thus far been able to accomplish. To this day, I have difficulty looking in the eyes of the people who saw me that day, especially the aquaintances who saw the puncture wounds.  Every time I see them their eyes change and I can see a mixture of fear and discomfort as they relive the same moments I can barely remember.</p><p>I managed to come out of this experience with no lasting effects (save a few gray scars) beyond the shame and social stigma of being a cutter/self-mutilator.  It seems to me as though I was simply delirious and amnesiac and was nowhere near close to dying.  I may be wrong in that assertion but the mental scarring is still fresh 3 years later and has yet to begin healing.</p><p>Hopefully this gives some insight into the self-destructive behavior that high dose Prozac brought out in me.  Reading it back to myself years later, all I can do is shudder.</p>"
}
