{
 "title": "Insanity",
 "author": "Alexa",
 "citation": "   Alexa. \"Insanity: experience with Amphetamines - Adderall (ID 48291)\". Erowid.org. Feb 18, 2008. erowid.org/exp/48291",
 "substance": "Amphetamines - Adderall",
 "bodyweight": "112 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "48291",
   "Female",
   " ",
   "Not Given",
   "Feb 18, 2008",
   "14027",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have done almost every goofy teenager-labeled drug - speed for over a year, coke, mushrooms, LSD, heroin, morphine, methadone, GHB, ecstacy, pot, and every prescription out there, and I have used the internet for helpful precautionary and side effect information through most of my drug usage. The one drug I must comment on is Adderall.</p><p>I had stopped, for the most part, doing drugs after my senior year in high school (I'm a college sophomore now), but after a few screw-ups and a really bad, but mostly sober, summer (physically, emotionally, grades) this past summer, I began buying Adderall a month ago to help focus and make up for my past bad grades. Since I already had past speed issues, I knew taking Adderall (which I had tried before) would entail certain remembered side effects. But two months, I told myself, to get through a semester and I could be sober again.</p><p>Adderall is amazing for studying.  I did every Calculus III problem in every section assigned; I will sit for hours to figure out just one Physics problem or concept.  When I take 80-100mgs of Adderall for a class, I know that shit.  Classes for which I have stared at exams in blank horror, Ive taken other exams doing each problem twice, every single line of math in perfection so the teacher just cannot mark one move wrong.  Its not even about confidence, whatever goal I had upon taking Adderall MUST be met.</p><p>There are a few bad things I feel while actually high.  Sleeping is out of the question.  Sometimes Ill get a half hour, which is filled with thoughts and all sorts of weird crap. The best comparison is probably somewhat like how I may feel when coming down from LSD or mushrooms  tons of strange, sketchy thoughts zooming into my head.  I get a bad taste in my mouth, so I obsessively brush my teeth, usually finding my mouth scraped and tongue bitten.  Sometimes, when getting up from a chair my legs and body have been almost uncontrollably strapped around for hours, I feel funny and my vision is distorted in a too clear way.  Contrary to some of the Adderall experiences Ive read, I become extremely devoid of a sexual appetite, I think it depends on my true personality what characteristics are exaggerated.  </p><p>I also feel very empathetic with other people when Im high, as though I completely understand everything about everyone around me, but it feels so stupid because its just a fucking drug  you know? Im really against drug-bonding because theres no telling whether it's really me talking or whether I am just tweaked as hell.    </p><p>Anyway, the main reason why I wrote this is to warn others of the comedown.  I have been buying Adderall probably weekly for about a month now, and this is the first weekend Ive undergone a dry spell.  I have lived through dry spells of many drugs, speed included.  Maybe other stresses contribute to these effects, but damnit if this is not the most handicapping drug comedown I dont know what is.  </p><p>I have been bed-ridden for seven days; seven days and next to no studying.  I ate about 7 caffeine pills, drank coffee, everything else, and felt sick and stayed in bed.  I stared at the once conquerable Calculus book and NOTHING HAPPENED.  I just sat there and stared.  Adderall makes me forget that I'm really tired and havent eaten in a really long time.  So when I come off of it, I realize I am brain-dead and I have no nutrients for my body to use.  I may be lying there in bed, but I'm dead.  </p><p>I remember being 15 and telling somebody speed is the devil because it tricks you into thinking everything is normal.  Amphetamines are funny because they dont fuck me up by way of hallucinations (like shrooms or LSD), or ridiculously fuzzy feelings (like ecstacy or heroin).  Therefore, its easier to forget that I'm high, the high becomes me.  Amphetamine highs = me * exponential enhancement.  I learned this from doing speed and Adderall still tricked me.  This shit is legal.  I dont know what those little kids do whose shitty parents put them on it instead of disciplining them better.</p><p>Im just warning others out there that Adderall, just like the street drugs mean rich men try to ban, is as good as it is bad.  The power I have when high may be just half as weak and insane as I feel later.  And, as with most drugs, if my mind set is right, I take it when I feel stable, things will go smoother and end more smoothly.  So I advise those who think Adderall is tons safer than the Draino-derived truckers speed some trendy goth kid at your high school worships, this is not necessarily true.</p>"
}
