{
 "title": "A Gently Brominated Sunset",
 "author": "spackboy",
 "citation": "   spackboy. \"A Gently Brominated Sunset: experience with Bromo-Dragonfly (ID 48300)\". Erowid.org. Dec 15, 2005. erowid.org/exp/48300",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "250 ug",
   "sublingual",
   "Bromo-Dragonfly",
   "(liquid)",
   "  T+ 3:30",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 4:30",
   "1 cig.",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 9:00",
   "8.0 mg",
   "oral",
   "Codeine",
   " ",
   "  T+ 9:00",
   "500 mg",
   "oral",
   "Acetaminophen",
   " ",
   "  T+ 9:00",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 10:30",
   "1 cig.",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 10:30",
   "16 mg",
   "oral",
   "Codeine",
   " ",
   "  T+ 10:30",
   "1000 mg",
   "oral",
   "Acetaminophen",
   " ",
   "  T+ 11:30",
   "400 mg",
   "oral",
   "Pharms - Ibuprofen",
   " ",
   "  T+ 15:30",
   "  ",
   " ",
   "Ketamine",
   " ",
   "  T+ 16:30",
   "3.0 mg",
   "oral",
   "Melatonin",
   " "
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48300",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2005",
   "Views: 22647",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Male, late 20s, medium build, previous drug experiences... well, a fair amount, the usual classics plus a handful of the more exotic tryptamines and phenethylamines.</p><p>Tolerance issues: 10 days previous, I had a small amount of MDMA and and phetamine sulphate (~120mg/15mg respectively). Nothing else recently.</p><p>Background: I had aquired a small sample of bromo-dragonfly, from perhaps the last reputable online vendor, so was fairly sure of the quality. The 1mg sample was in 2ml of EtOH solution, and dose was measured out from that. I had pretty low expectations of the substance, the very mixed reports which seemed to indicated poor oral bioavailabilty had made me put off trying it. However, I was to be pleasantly suprised.</p><p>I had been thinking about trying a smalll dose sublingually for a little while, and on a whim as I got up that morning, I decided to ingest some. </p><p>11.30am, t +0 - 250micrograms of B-dfly in ethanol solution were dropped under the tongue, and held there without swallowing for 10 mins, and then it was a further 20 mins before I drank any liquid. I left the house pretty much straight after taking the dose, as I had brief business in town I did not expect to be hit that hard or fast, if at all, so I was confident I could deal with going into town.</p><p>t + 1.30 I suppose this is roughly where I would place the first noticable alerts, but they were broadly spread, as was to be every phase of this experience. I had returned home, and was tidying up and sending a few emails.</p><p>t +2.30 - definately something going on, at a +/-. Excess salivation, mild feeling of stimulation, am continuing with the days tasks, tidying up etc, but feel a little distracted and my attention's wandering.</p><p>t+3.30 -I feel at about +. Typing is a little bit trickier and slower than it should be... and the computer screen looks a little brighter with a psychedelic subtle colour shift going on. Feel definate anorexic effect. Have a balloon of nitrous, which was fun but not as enjoyable as with other hallucinogens. Have to head out quickly to the beach to see the sunset! </p><p>t+4.30. Just back from walk down the beach, watching a gently brominated sunset, and the wheeling birds over the wreck of the pier. Smoked a spliff down there watching the colours fading. The purples and reds I saw are echoed on my walk home through the lights coming on in town. I pause to enjoying the the red neon glow outside some shops. Still at + I think, but cant decided if this is the peak or still a little bit go. Colours definately brighter, and typing is again a bit more difficult than it should be. Very cold outside... glad to be back in the warm.</p><p>Listening to Neutral Milk Hotel, and wondering what the political analogy in 'Holland, 1945' is. If i were a less altered I would look into it, but i feel quite lethargic and lazy on this substance, although stimulated. But it seems that way for a lot of my experiences recently, stimulating without wanting to do anything, on a variety of substances. Maybe to do with getting older? Overall, I would liken this to a threshold LSD dose in intensity, but more physical and stimulating. </p><p>6pm t+5.30 Feel at steady  ++  now.. Just had a shower, which was pleasent, but for what I would objectively expect to be a quite warm shower,  felt quite cold, especially my extremities. Circulatory problems? Will have to look it up later. No visual movement or pattening, very slight trails. music sounds great... enlivening and detailed.</p><p>slight headache... keep drinking water</p><p>t + 9.00 still ++. have quite a bad headache now, taking some paracetemol and codeine (500mg/8mg). Just cooked myself some dinner no problem, even felt quite hungry, but felt very full quickly and couldnt finish it. drank a beer (leffe blonde) with dinner. Socialising with my housemates (who I have neglected to tell I'm indulging in an unusual drug today, and now it feels awkward to!) is not difficult, but I am definately giggly and more loose than I would usually be.</p><p>t+ 10.30 - still much the same. tightness in the jaw, headache still pronounced and unpleasent. keeping hydrated, but that doesnt seem to help. take two paracetemol and codeine. Unfortunately not ibuprofen around.</p><p>Smoke second spliff of the day. queens of the stone age on the stereo... music still sounding very enjoyable and engaging. I'm about to go out with a couple of friends to watch an hour long cut up video with live DJ performance at the local cinema, hope its not too heavy going. Have only felt small twinges of anxiety so far, which were all easily dealt with - if i was the same level of inebriation on mushrooms or LSD I would be definately more anxious/paranoid.</p><p>Go to watch the film thing (its 11.00pm now) - buy some ibuprofen on the way, and 400mg seems to finally shirt my headache. The film is odd - cut up Hindu-blaxplotation, some decidedly unpleasent dismemberment, but an awesome final animated sequence of what looked like an ayahuasca expereince from a film (with Juliette Lewis in), where the participant watches himself and surrounding dissolving into black spiders and millipedes and golden snakes. Glad I was not anymore high at some points!</p><p>t+ 15.30 After watching film/sound thing, and staying up chatting, listening to more music. Feel tired now, but definately kept awake, don't think I've come down much if at all. After deliberating, I decide to do some some ketamine, so rest of trip should be considered as not very informative for the continued duration of the Br-Dfly.</p><p>Ketamine is ok, but none of the sharpness and clarity I've experienced on other substances (2C-x etc). Lie down to sleep a bit after 5 am (t + 16.30), after taking 3mg of melatonin.</p><p>t + 26.30 (2pm next day), woke after sleeping fitfully for 5-6 hours. I still feel a bit altered, but the K hangover and bad sleep mean I can't be sure if there's anything still going on with the Br- Dfly. However, I definately slept badly and kept waking up, feeling stimulated, which the ketamine and melatonin on their own wouldnt have  done to me, until around t +24 hours (very roughly). Further testing of this substance on its own would have to be done to determine the correct duration.</p><p>Out to help a friend record the sound of clapping in the park for a short film he made.</p><p>t + 29 I would say I was pretty much back to normal now, but again I can't be totally sure, Brandy in the pub to warm us up.</p><p>Conclusions: Br- Dfly appears to be active via the sublingual route, but further tests with higher levels must be done to confirm this. It was certainly more than I expected, given the previous reports, and damn long lived. But it was highly enjoyable, and fun to be on, quite gentle, and I never got the 'bored' feeling that other long dose drugs seem to give me (e.g. AMT). Next time I will do 350-400mg, to see what my dose/response curve is like. The various stages of the experience seem very broad, with come up between 1-2 hours in, and the peak around 4-5 hours in.</p>"
}
