{
 "title": "The Bench Lady",
 "author": "Grandma Bench",
 "citation": "   Grandma Bench. \"The Bench Lady: experience with Inhalants - Gasoline (ID 48325)\". Erowid.org. Jun 1, 2006. erowid.org/exp/48325",
 "substance": "Inhalants - Gasoline",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48325",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 1, 2006",
   "Views: 6448",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I've huffed probably twenty times by now but at very short intervals. </p><p>My mother's garage had the tough shit. I'd huff for about five minutes and if I breathed, it's like the very 'folicles' of existence would ripple around me. Never had auditory hallucinations.</p><p>Throughout my huffings I developed this crazy little story about the meaning of the universe existing in the scenario of an old lady sitting on a bench tapping her foot that the sound of the crickets. Then an old lady would go by and scoff at her, but the lady on the bench would continue to enjoy the sound of crickets and tapping her foot once again.  If I could just decipher it, I would figure the ALL out!  </p><p>Anyways, I eventually did and lo and behold, it's just some fun little story that becomes grander while huffin'.  </p><p>At first my heart beats faster, I breathe harder and inhale more and sweat yet in the end, gasoline becomes no longer fun and is just a waste of time. I now huff this lighter stuff that seems to be watered down or something. That might attribute to it not being that fun anymore. I'm not crazy, my mind's functioning perfectly well.</p>"
}
