{
 "title": "Working Towards a Ritual",
 "author": "windchild",
 "citation": "   windchild. \"Working Towards a Ritual: experience with Anadenanthera peregrina, Syrian Rue & Dimenhydrinate (ID 48392)\". Erowid.org. Jan 28, 2006. erowid.org/exp/48392",
 "substance": "Anadenanthera peregrina, Syrian Rue & Dimenhydrinate",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 g",
   "oral",
   "Syrian Rue",
   "  T+ 1:30",
   "  ",
   "oral",
   "Dimenhydrinate",
   "  T+ 2:00",
   "  ",
   "oral",
   "Anadenanthera peregrina",
   "  T+ 4:00",
   "  ",
   "oral",
   "Anadenanthera peregrina"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48392",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 28, 2006",
   "Views: 10062",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is a compiled account of a series of Ayahuasca Experiments that i conducted in the late summer/fall of 2005.\r\nI tried following preparations:\r\n* Anedananthera Colubrina (non-Cebil): 4-8 seeds, roasted and crushed with limestone, nasal - some effect, but not very enjoyable. Later learned that that's because the principial substance is bufotenine.\r\nAll other experiments were done with A. Peregrina as a DMT source.\r\n* A. Peregrina (Yopo): 4-6 seeds, roasted and crushed with limestone, nasal - very noticeable hallucinogenic effect, kicks in after a few minutes - this amount of substance is very harsh though. And then there comes the nausea.\r\n* same, with Peganum Harmala: ~3g peg. harmala, 4+ seeds Yopo, Yopo roasted, both ground, packed in capsules and taken in time intervals (Ayahuasca Analogue). Best form of preparation so far, still very sickening though. Sometimes experimented with 'Dimenhydrinate' pills to counter the sickness.\r\n* same, cooked as a brew, taken in intervals: extremely vile. Taste = Shit. Vomit Taste = Shit. Do not try this!\r\nI worked out the following order and timing of substances:\r\nT0        harmala intake\r\n(T+1.5h   motion sickness drug)  \r\nT+2h      first dose of DMT\r\nT+(2+2k)h redosing DMT\r\nI found no meaningful way to prevent vomiting. It appears unavoidable for me. So, no food on that day, then it's at least not as much. \r\nAbout the motion sickness pills ('Dimenhydrinate' - i think thats 'Dramamine') - They might help some, but either I've taken too few or they don't work wonders. Sad. I dont want to go tripping balls on these either ^^.\r\nSo I've done this a few times during the course of a few months. Trip-wise, I experienced Harmala as being very gentle and subtle first, then very open and clear in the higher levels.\r\nThe vomit is ritual too. I know I'll vomit, and it still catches me off guard. I barely have time to lean over the bowl, and then it's nearly gone again in a second. Must be a reason why it's called 'la purga'.\r\nRedosing like this, every 2h or somesuch, vomiting about every 3h, I've been able to crank myself up to the one or other serious trip. It's very hard to comply though, after like the 3nd dose I think 'oh no not again'. But I certainly think it's worth the experience.\r\nIt is similar to the mushrooms, but not as emotional and chaotic. \r\nAnd its more of an ongoing thing, a whole day tripping. After like 12 hours of trip, I'm happy and delighted, but endlessly tired. And yet restless and tensed.\r\nI've done this a few times, and i really tuned in to it (meaning I had some kind of secret second life going on, all about my trips and what I could learn) and there is a lot of power to wield. I had the chance to look at my life, and some of the impressions I was having in that Ritual time were quite true. I somehow got my life in order now.\r\nDo NOT cook Harmala to make a brew of it. Under no circumstances. The taste is beyond words.\r\nI think i will go back there and do it again. Even though I'll be sick as hell again. I should try to do something meaningful next time, like drawing or writing.\n\n\n"
}
