{
 "title": "Time Travel",
 "author": "Double Eff",
 "citation": "   Double Eff. \"Time Travel: experience with 2C-B-Fly, Alprazolam & Amphetamines (ID 48413)\". Erowid.org. Mar 9, 2006. erowid.org/exp/48413",
 "substance": "2C-B-Fly, Alprazolam & Amphetamines",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "2C-B-Fly",
   " ",
   "  T+ 3:15",
   "2.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 3:45",
   "  ",
   "oral",
   "Amphetamines",
   " "
  ]
 ],
 "footer": [
  [
   "2005",
   "48413",
   "Female",
   " ",
   "Not Given",
   "Mar 9, 2006",
   "Views: 11730",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Material (order consumed) - 15mg 2c-b-fly, 2mg Xanax, 10mg Adderall and 20mg Adderall XR</p><p>Person: 20, 160lbs</p><p>Location: Mysterious Rave on East Coast</p><p>0:00 - Me and friend Cosmo had been anticipating this event for weeks: a hardcore, people-smoking-meth-in-the-corner-with-the-staff rave. At this particular point in time we were 40 miles from the event, speeding along the highway to a night we both hoped we'd never forget. I consume 15mg of 2c-b-fly at a stoplight, assuming it'll be a good 2 or so hours until I'm starting to get hit hard. Cosmo, although in possession of some 2c-c tablets, decides to wait until after he gets to the party and picks up some rolls to get his groove on.</p><p>+0:45 - We arrive at the party and the setting is just beautiful; UV-painted spiderwebs cover the ceiling, with fluoro paintings all over the walls. There are even fluoro paints that you can use if you feel in the mood to be artistic (I found them spectacular last time on a few hits of acid). The music is fast, vibrant, and colorful, mirroring the visual atmosphere. Cosmo and I socialize some, meeting up with various people. Cosmo got some rolls and promptly dropped them. I was still quite sober at this time.</p><p>+1:00 - There are alerts, bits of a body buzz, and lots of energy. Dancing is spectacular! Socializing seems well enhanced, too. I have a feeling that this can go nowhere but good places, although my thoughts are started to get a little jumbled... Certainly not quite as clearheaded as its non-fly counterpart, 2c-b. Nausea and body load coming on a bit.</p><p>+1:30 - There are visuals occuring, color enhancement, light carpeting and spade-like swirls all over the place. I have become quite foggy now, but continue dancing and talking to my friends and some new people I'd just met. Music sounds very nice. A nice +1.5. A bit nauseous, though.</p><p>+2:00 - Pretty quickly launched up some, and start to get a little nervous; What if I have taken too much, this being my first time and all? I locate Cosmo, now happily rolling, and pull him close to my side: 'I think this may've been a little much. Stick around, okay?' Time dilation is very extreme. OEVs remind me of a mix of MDA and 4-Aco-DiPT. The nausea gets very bad at this point, I feel like I wanna vomit very extremely, but do not.</p><p>+2:45 - Things are very messy here. The intensity continues to rise steadily, and I hit a strong and insistent +3... Outside this environment it probably would have been manageable, but with the loud music and lights it is extremely intense. Cosmo sticks by my side and reassures me that I'll be alright. The visuals creep out from everything, the wall is constantly changing color (reminds me of DOC), and there is massive synaesthesia on all levels (I would see a picture and feel it on my body). At some point in time, a guy who was rolling who I vaguely knew asked if I wanted to make out... As completely fucked up as I was, and in the interest of research, I did so; the feeling was similar to MDMA, but less intense. Certainly enjoyable. The nausea seems to be subsiding some.</p><p>+3:15 - Another one of my friends is talking to me and realizes I'm horribly floored.. He passes me a 2mg Xanax and tells me to relax a bit. I swallow it and resume clinging to Cosmo, effects the same as they were a half hour ago.</p><p>+3:45 - Xanax kicks in and I feel like I'm barely tripping hard at all all of a sudden. Relieved, I resume talking to friends, and consume some amphetamine and time release amphetamine. Cosmo, coming down some, takes his 2c-c and relaxes.</p><p>The night is kind of a jumbled dancey blur after this point, probably do to the memory blocking effects of Xanax. At t+12h, I was still getting light visuals, and at t+14 CEVs.</p><p>Verdict: Good material, but I seem much more sensitive than the others who've tried this. Start low and work your way up. =)  Watch out for nausea, too.</p>"
}
