{
 "title": "Looking Back at Innocence",
 "author": "Lab Rat",
 "citation": "   Lab Rat. \"Looking Back at Innocence: experience with Datura (ID 4844)\". Erowid.org. Jan 24, 2001. erowid.org/exp/4844",
 "substance": "Datura",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Datura",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1990",
   "4844",
   "Male",
   " ",
   "Not Given",
   "Jan 24, 2001",
   "Views: 16370",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've been reading these reports on peoples experiences with datura and I'd like to add my take on it.</p><p>Over the course of the year I was a big fan of datura, it was cheap, legal, and freely available.  Once tried, all else seemed like childsplay.  It's hard to describe the effects of datura but in general it was otherworldly.  I can see how people got bad trips on it because it is not quite like any other drug.  It is possible to get stuck in no mans land on it, and get really freaked out.  There is no way out once you begin and it can last for several days which is way too much for most.  Personally I believe it did me the world of good though it took some years to properly assess and come to terms with the things I came across.  I believe it takes you away from yourself and into the universal, it is no way an ego drug, in fact it destroyes the ego completely.  One of the pleasant effects that seems common to datura is telepathy.  This is a profound and moving experience, it has to be done to be believed.  Sure, I hear you say, you were so gone you could have thought anything was happening; believe me it was for real.  I suppose I'm a bit of a believer in the no pain no gain thing so the physical and mental price of such and intense tripping was worth it to me.  </p><p>I would only advise people who know no fear of themselves to take datura, there is no way it should be taken lightly or as an escapeist thing.  It would be preferable to have a minder, also to record some of the things you will say as they will supprise you later.  As with all drugs, stay away from negative people and situations, like vampires they will suck the life out of you.  </p><p>I hope this helps someone make the choice that is right for them.</p>"
}
