{
 "title": "Over and Over Again...",
 "author": "Twaddle",
 "citation": "   Twaddle. \"Over and Over Again...: experience with Cannabis (ID 48462)\". Erowid.org. Sep 16, 2008. erowid.org/exp/48462",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48462",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 16, 2008",
   "Views: 3518",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI hadnt smoked marijuana in three months. That was a long time for me. But it made everything more so active, potent, and useful than not... <br>I was sitting in a car that I was working on with a close friend of mine that I had never chiefed with before, and I thought (since I was moving the next day) that it would be a memorable experience for the both of us before I went away... You know, something to remember... Well anyway, He had maybe taken three or four hits off of my joint and he was baked, while I (being not as baked, but pretty up there) had taken the liberty to smoke the entire thing and chief all the rest of my weed into the car. <br>The car was like a gas chamber, but with weed. He was sitting there staring at his mindful hallucinations, telling me stories of old, and in the beginning, I was seeing the same things as he was. I was sharing his hallucinations! <br>Now, I do this a lot. When I am with people doing other things beside chiefing, I get glimpses of what they are experiencing, and it is something more than the visual aspects (even though the visuals are extreme and are there). I can travel into their world, their complex world. No, I can travel into their complex universe, where there they behold marvelous things... I can, when stoned, put my hands out as if I am playing a computer game, except with a complex keyboard with multiple dimensions and codes with complexities of nothing that can ever be imagined to be fathomed. I can see into my past. I can see things in my past that I have long forgotten. Things that seem unreal, yet are entirely real can be too real to me (if you can understand where I am coming from). I can become in the presence of God, and feel his warm smile upon me... I can be anything... <br>But this night in the car was different. While my friend was telling me his stories, I seemed to drift farther and farther from my body... I became lost within a boundary that kept stretching to keep me thinking that the end was just at fingers grasp... But it was not. I kept falling and falling deeper and deeper into a state of depression that knew no bounds. I became like lead, constantly falling, yet gradually growing in speed, falling... There was never a 'rock bottom,' the state of mind that I was in was psychotic and kept changing from bad to worse. Things that once made since made no since, and I became aware that humans were not perfect... I was fully aware of this previously, but this was different. I saw a disturbing visage in my minds eye. I saw a completely wrong 'after death.' I saw that we as humans were all apart of a system, and that our souls were bound to the same central processing unit, but what it controlled I could not become aware of... I saw the souls of man aligned in rows and columns, which were perfectly in alignment, yet they were all the same... Like a program of little ants marching in, one with the same thoughts as the other, to do that which is told, and that no matter what they did, they could not change their fate, that they were apart of the system, and that no matter what they did, it was said to be done, and was in essence... Perfect. I saw every man on the face of this earth, and I knew each of their names, but they looked all the same. They looked, acted, and were all the same... They were perfect beings; following the motherboard everywhere it went. It was as if they had no free agency, and they were all under some sort of evil congregation disguised as something good... This scared me into a deeper state of depression, for I saw the light and was then, after almost grasping freedom, away from the shackles that were trying to bring me down... But just as I thought that I had achieved the state out of the state that I was in, I was pulled back to the pit of crude understanding that made me ill... I was tortured for a while. <br>Over and over again I was given a glimpse of light and hope that God would save me from my state of mind, and almost when I felt that I had achieved freedom, the hope was raped from me and replaced with horror and belligerence and the thought that I was slowly dying and could not escape my fate that no matter how I tried, I could not escape the pit that I had fallen in. I felt like a dog jumping up for the ball hanging over his head by his master, and when he jumps up to grab at it, the ball is pulled out of reach and then let down so that he can believe that he has a chance to catch it and be in a happy land with his ball... <br>Then I saw the light, I saw a foggy visage of Lucifer, and I knew the truth I knew what my experience had meant. The entire time I was in that pit without any light was the way life would have been if Lucifers plan had been the plan of life instead of Gods plan. Lucifer would have raped us of free agency, and kept us as that which I have described with the rows and columns But they all had accepted their fate, and were given no glimpse of hope as I was given that free agency existed, and that my experience was one to grow on <br>I see now that my experience was worthwhile and was significant to my own personal revelation and testimony I see the importance of all things, and that God gave man, that man might use to better himself and glorify the father I thank God every day for giving me my unstable, yet stable mind to conjure and realize these things I have grown from my experience and am now more so wise than before I believe that man should not follow the law of man, but the law of the land, and that is: Do not Harm. Everything else falls under that rule alone. <br>Too much of anything is not good. You must learn that there is a limit to all things, and learn that limit You must seek to expand your mind beyond the box that your mind lies in You must learn, love, and live (among many other things) <br>So much more I could say So much more I could teach <br>But for now, this will do <br>Peace, Love, and Pancakes\n\n\n"
}
