{
 "title": "Enlightenment via Insanity",
 "author": "Rill the Lorx",
 "citation": "Citation:   Rill the Lorx. \"Enlightenment via Insanity: experience with 4-HO-DET (ID 48479)\". Erowid.org. Jun 11, 2006. erowid.org/exp/48479",
 "substance": "4-HO-DET",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "38 mg",
   "oral",
   "4-HO-DET",
   "(capsule)",
   " ",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48479",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 11, 2006",
   "Views: 9163",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe shit is fucking crazy. I would put the general ambient vibe of the drug as an odd and unsettling cross between mushrooms and LSD. Definitely good shit, and I took a lot of it.\r\nZero Hour. I and my friend R are fucking around in some music store in my hometown. We are making chronic drug references, and everyone there seems to go along with it and our tripped out demeanor. At some point in this hippy infested hole in the wall, we pop our capsules with approx. 38mg of 4-ho-det. A swig of water, a few more minutes of bullshitting, then we get on the road.\r\nWe are heading to the most supernatural woods in Ohio, to once again test how close we can skate along the edge of the abyss. We smoke some pot on the way; I have an odd feeling of anticipation common with all psychs, and a chilling numbness that goes in waves from my head to my toes.\r\nThe on setting tremors. Leg tremors. Spine tremors. Very slight twitching; it seems as if I am shivering from a deep cold that does not exist.\r\nIndeed it seems I am now entering an entire new universe or mental operation. Ideas and thoughts are felt and observed from all angles. We start marching forth into the dark and looming woods, fresh with the smell of death. Its fall, and everything around us is rotting. The sky, is pitch black. I see red runes in the sky, stern symbols that look like pure evil.\r\nI hear odd screeches going on in the back ground, and a guttural demonic whispering keeps buzzing in my right ear. I am prone to all the misery and misfortune of Lucifer himself the sadness is overwhelming. There is no point. The cold embrace of nihilism has my soul in chains. I feel so lost and hopeless. Right now I need some good vibes, some music, some affirmation of love. All I have is the fascistic embrace of the jointmaster general (my friend R) and the cold lonely barren and rotting woods that hold so many evil secrets.\r\nI see tortured and twisting faces screaming at me in pointless protest from the trees. The spirit of this once beautiful land has been ravaged by the blind and violent idiocy of my people. Everywhere I look, there is something horrible to be seen.\r\nI close my eyes. I see a gigantic, gnawing black void. It is a huge hole, swirling and sucking everything around it into disparity and destruction. Anguish. ANGUISH. Why god, why?!!? Is there anyone out there?!? What is the point if everything just goes back into hell?! It is at this time that I start being marauded by 1111. I see it swirling and dancing around the dark void, its neon green a beautiful refreshing. The numbers swirl around the void but arent sucked in.\r\nI now (and still) wonder if 1111 is the mark of the gateway to hell, or is somehow an implication of the dance of existence around annihilation.\r\nI open my eyes. The grey and black of the void is replaced by the dark woods. My friend is sitting next to me on a rock, overlooking a huge and beautiful valley. I am disgusted at the marks humans have made on this place, the chopped down trees, the un-natural paths, the wooden rails and walkways. Hatred. Hatred. I am burning with hate... but this is not what I want.\r\nMy friend and I are talking about san fransisco, and about how many acid burn outs there are there. I feel like I am in the electric embrace of LSD, but yet it is somehow different. Less spacey, more clear headed.\r\nI am trying to comprehend the failure of the LSD culture, the influx of evil, the state of the world. Why god? WHY?! I begin to think of things in profoundly non-linear and abstract terms. If there is only 'one' thing in existance, and it essentially an illusory reflection, then how can there be 'good' AND 'evil'.\r\nThe red energies of evil and malice that emanate from my body are in full view. The green energies of compassion that I also emanate , are also in full view. Duality. God damned duality. I begin to think about my past lives... the horror and bloodshed I have unleashed upon innocent populations.\r\nThe sky begins raining blood. I look up and I see thousands, if not millions, of red pentagrams dancing around in the sky. swirling and tipping back and forth. They look stern, remorseless, and hurtful. I know this is just a pagan symbol, but the fear it stirs in me is all to familiar. The blood is raining from the sky but not touching the ground or myself. It looks electrical. I want to cry, but I dont because of my company.\r\nI am seeing huge warplanes in my mind. Dropping payload after payload of bombs, not caring where they land, just hoping to inflict pain and terror. The swastika is emblazoned and revolving in my mind. The swastika. What have I done.\r\nI am the devil. There is no deeper evil than I. This realization brings about a great feeling of relief. If I am indeed, the greatest evil on this planet, then I have nothing to fear but myself. All of the sudden it becomes so clear.\r\nEvil, malice, discord, chaos, they are all tools. Divine troubleshooting tools. They are created to form a platform from which those with the will may transcend to better ways of thinking and acting. The universe is threatening itself to provoke strength, respect and love. I begin to realize that all the oppression on this planet, while it brings great suffering, also brings people together, and people learn from it.\r\nEvil just stresses the weak points of the system, provoking positive change. Considering the amazing , ridiculous amount of evil I have been involved with, I contemplate the possibilty of my own positive change. I am the king of all hell. In my mind, I say 'You are all free'. All the tortured faces, all my minions, go do whatever you want.\r\nDo what thou wilt, shall be the whole of the law. Love under will. This is all a laughable illusion. I laugh at myself for being stupid and blind enough to fall for my own tricks. I laugh, profusely. Hysterically. I am the darkest and lightest being that has ever existed, yet my comprehension of myself is childish and narcissistic. Its funny. Its the funniest thing ever.\r\nThe forest begins to clear up, the mood begins to lift. I look up into the sky and unleash a furious powerful energy through my body. I want to scream, but it is too powerful for me to scream. It rips through my being, the horrifying spiritual pollution that wrack my being is lit aflame. I begin hearing indian flute music in my head. I feel fucking groovy. The LSD culture was just a precursor.\r\nThe flame has not been snuffed out, it is merely hiding, slowly growing into a massive fire. We smoke another bowl of pot which drastically increases my pleasure and positivity, and we head into the town. The smell of death is rank, but it no longer frightens me. The evil things that lurk in the darkness at my home will have a new enemy to deal with.\r\nUniversal comprehension. My friend R has one thing on his mind, trying to hustle the local hippies out of some money via his 'sport' of choice, billiards. We arrive at some random pool hall in the middle of town.\r\nThe scenery is like some weird, awkward scene straight out of fear and loathing. And someone was giving booze to these god damned animals. This is like 2 weeks after Halloween, but cheesy and trippy Halloween decorations are still abound. A gigantic pumpkin shines a deadly smile at me. I laugh at it. The bar is filled with aging and decrepid negroids, burnt out hippies, and a small coven of hardcore pool players lining the table in the back.\r\nI sit down. I dont even want to be here. I dont pay attention to the pool game, but the music catches my ear. They are playing some odd form of Negro bebop, and in my vulnerable state, the female vocals are throwing my emotions for a loop. I have never felt this way before, never felt so open and alive, never have I before sympathized with the soul of another peoples, especially the blacks. Again, I wanted to cry, but I kept it in. I know my eyes are lined with tears, and I know my pupils are HUGE.\r\nA stoned and drugged out hippy teen in a random bar, its a common sight in this town. Nobody notices or cares, but I love them anyways. God damned beautiful idiots. Fear owns them all. I seek to destroy that fear.\r\nThe game is concluded, R loses money, and we go home. On the ride home, I concentrate on spreading green compassionate energy, and I feel like I am glowing. I look in the mirror and my eyes are glowing green. My eyes look like snake eyes.\r\nWe put in shine on you crazy diamond, and it starts softly raining. Pink Floyd is divinity. Soothing space rock calms my nerves, and the insane peak begins to plateau into a loooong period of clear headedness and energy. It's been a beautiful experience.\n\n\n"
}