{
 "title": "Zoning and Speeding",
 "author": "Where-Am-I",
 "citation": "   Where-Am-I. \"Zoning and Speeding: experience with Caffeine, Pharmaceuticals & Migraines (ID 48536)\". Erowid.org. Feb 23, 2008. erowid.org/exp/48536",
 "substance": "Caffeine, Pharmaceuticals & Migraines",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharmaceuticals",
   " ",
   "  repeated",
   " ",
   "Caffeine"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 48536",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 23, 2008",
   "Views: 12401",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I lost 3 years of my life</p><p>I started suffering from migraines during 7th grade. I first started out on atenol, 50mg a day. This sufficiently lowered my blood pressure to make me tired all the time, lazy, and I found it hard to concentrate. When I started 8th grade, I switched over  to nortriptyline, 75mg a day. Although in most people, it made  them sleep, it made me an insomniac. I couldn't sleep. Further more my mind slowly began to scramble. I had trouble thinking things through. Sun light became painful, as my eyes stopped adjusting. After 6 months I changed over to cymbalta (duloxetine), 60mg a day. This was by far the worst. I had a nasty, sick body feeling all day. I felt nervous. My insomnia continued, although I spent the day zoned out. I found myself losing trains of thought. It became hard to even watch tv. </p><p>After 6 months on this hellish substance, I started on 50mg topamax(topiramate). This lasted 3 weeks, and had little or no effects, although I never was able to regain my ability to focus. After this, I spent 2 weeks on 120mg of verapamil, still with no real side effects. My focus however started coming back after I got off of it. I spent about a month sober. </p><p>Then I began a caffeine regiment. It started out very small. One or two 200mg caps a week. My focus during the next few months returned completely. I was able to think straight. I could remember things. I wasn't zoning out anymore. I had energy. I wasn't depressed. But I was an idiot, and slowly increased my usage. Soon I was using a gram a day. If I ever tried and stop, I stopped thinking. My memory went as far back as a few minutes. People would talk to me, and I'd just see their mouths opening and closing while my brain thought about random things, but I couldn't complete each random thought. I was also horribly depressed. So I just stopped not taking caffeine, and my long attention span returned. And my happy-caffeine hi continued.</p><p>I was speeding on caffeine for 3 months like this. A gram a day, everyday. Slowly, I became depressed again. My mind started losing focus. Everything became pointless. I could break this cycle by taking 2 grams a day every once in a while, but knew that wasn't good at all, so I limited it. My last month or two, I tried to limit my use. Cutting down to 400mg a day on average, and recreational doses of a gram. My mind went crazy for the first month. I couldn't even spell basic words. I lost the ability grasp concepts. But I knew this was better than if I continued my gram a day system. But it wasn't enough. </p><p>There came a night where I took 800mg of caffeine, with one of my old cymbaltas (I've done this combo many times before, usually adding in various other things as well). I was ok for about 5 hours. I felt nice and calm, and went to sleep. I woke up around 10am (I had taken them around 5am) and calmly walked into the bathroom, and puked a yellow/green vomit which severely burned my throat, more than any other puke I've ever puked. As soon as I was finished, my mind completely zoned out. I spent the next 24 hours in a fog of concentration. I wouldn't watch tv, I'd stare a corner of the tv and just look not processing anything. </p><p>I haven't been able to stomach any caffeine, cymbalta, or any of my other stuff since. I padded the withdrawals with 20mg of hydrocodone a day, which has actually restored my ability to focus and think. I'm not sure why, but I can think straight again because of it. I'm now getting off the hydrocodone, and have almost reduced it to nothing a day. I've decided I'll take the migraines and actually have a life.</p>"
}
