{
 "title": "Will it do the Job??",
 "author": "Ringen aka g00se",
 "citation": "   Ringen aka g00se. \"Will it do the Job??: experience with AET (ID 48547)\". Erowid.org. Mar 10, 2008. erowid.org/exp/48547",
 "substance": "AET",
 "bodyweight": "84 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6 oz",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 0:00",
   "50 mg",
   "oral",
   "AET",
   "(pill / tablet)",
   "  T+ 0:35",
   "50 mg",
   "oral",
   "AET",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48547",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 10, 2008",
   "Views: 9975",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was sitting at home, drinking som Cognac and playing socialgames, on the net.</p><p>I decided to take just half the pill i had, coz of the drinking i've been doing. Swalloved half (50mg) the pill AET, playing psycedelic music wich a love! Been drinking about 6-7 shots(4cl â peice) of 40% Cognac. </p><p>10minutes nothing.. </p><p>15minutes something..</p><p>20minutes having thoughts about yesterdays DXM trip... </p><p>That DXm did really give me a brainjob, but today (about 20hours later) it's really no hangover from that. Dxm is not something i recommend, it's just too hard(nervotoxic) as it is.   </p><p>less then 25 min has gone by. Feeling a MDMA effect in my brain, euforia, wanna dance, </p><p>not as nice as MDMA, but kinda like Methylone but a better high feeling . </p><p>35min, cant keep the rest of happiness waiting, I drop the rest another 50mg.... </p><p>I'm sitting with my computer, listening, changing tunes, digging with my legs and body.. no sound hallusinogenic yet, just an ok feeling on/in top of my head.</p><p>60 minutes.. feeling fine soft, wanna chat with others, (chatting). No enhanching just enyoing it.. I'ts  a gentle feeling trouhg my system that passes, no max just middle all over... great party drug(with alc) if u ask me.. not to much and none the less..</p><p>Now 1hour n 45mins it's no bettre than when 45mins had gone by. Kinda soft .. but not much.. a filling feeling all over.</p><p>3 hours.. feeling fine.. a bit wasted, a slow comedown...</p><p>Feeling is like a fever, warmth.. feeling sleepy.. no pain , just tired n used.. </p><p>Well it's  surely working and it's pretty nice, if compared to E and Methylone, not at all the comedown of E and methylone, but then again not as nice. Sure i'll give it:</p><p>For mental use a 6/10, for party use also a 6/10.</p>"
}
