{
 "title": "Attacked by Negs",
 "author": "Ibogahuasca",
 "citation": "   Ibogahuasca. \"Attacked by Negs: experience with Tabernanthe iboga, Anadenanthera spp., Salvia divinorum & Leonotis leonurus (ID 48553)\". Erowid.org. Mar 27, 2006. erowid.org/exp/48553",
 "substance": "Tabernanthe iboga, Anadenanthera spp., Salvia divinorum & Leonotis leonurus",
 "bodyweight": "68 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Tabernanthe iboga",
   "(rootbark)",
   "  T+ 3:00",
   "2.0 g",
   "oral",
   "Tabernanthe iboga",
   "(rootbark)",
   "  T+ 3:00",
   "3 seeds",
   "smoked",
   "Anadenanthera peregrina",
   " ",
   "  T+ 0:00",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   " ",
   "  T+ 0:00",
   "2.5 g",
   "oral",
   "Harmala Alkaloids",
   "(extract)",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Leonotis leonurus",
   " ",
   "  T+ 0:00",
   "3.0 g",
   "oral",
   "Tabernanthe iboga",
   "(rootbark)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48553",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 27, 2006",
   "Views: 12971",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI woke up early at one morning and very slowly started to eat some iboga rootbark chips on empty stomach.  About 3 hours later I had consumed about two grams of the substance (alkaloids 3-6%). I started to feel MAOi effects, I was slightly off balance and my vision started to become electric ie.  visual buzz, lots of moving multicolored particles on every surface, harmala does this for me also. I created some art, self portrait with my plant allies growing out of my body, this was a good concentrational exercise. <br>After some 5 hours and 4 grams of ingested rootbark I started to feel some nausea, spitted and puked couple of times, but did not feel much better, I was only getting out small pieces of what was bothering me. I had a contact with a shaman on IRC and that helped me further on my journey. I raised my kundalini, put myself in bandhan, smoked some pretty impressive Yopo seeds, then experienced some telepathy and energy transfer with the shaman. I had the notion that I had something attached to my head, purple radioactive alien type, some kind of parasite, at this point I did not have much trouble working on etheric space, I grabbed the thing with my hand and commanded it to leave,  it refused and I burned it with holy fire, it immediatly detached and not many seconds later I started to experience the symptoms of psychic attack. I managed to bind the thing to a container and sealed it with bandhan,  I was then about to let in some fresh air and burn some incense on charcoal, this did not go very well, because of the psychic attack I suddenly became very clumsy, the charcoal didnt ignite and when trying to open the window, the handle broke off! Then the container with the thing fell on my carpet and hell broke loose. I grabbed my psychic self defence book for consultation and sat on my artificial telluric spring (supposed to quickly drain negs).<br>Not very long after the thing was at my head again and I was pretty fucking out of it, it was making me totally crazy, didnt know what was true anymore and I was surely in worst hell ever, I had some body parts missing and major energy leaks. I smudged the house with garlic and lost a piece of my leg to some entity in the process. I applied some Anamu to the wound and went to shower, I managed to spray water to my head so that it made a really strange sound, like a chainsaw, I attacked the intruder with this and visualised that I was fucking it up with chainsaw, it worked mighty fine, but right after it managed to shut down my water! first there came only ice cold water, then nothing. Have never before experienced negs doing this much for me. <br>Smoked salvia and scanned the situation, seemed to be alien symbiote attached to back of my throat, ear, eye and brain, like astral entity gains partial control of every sense through my body. It was attached to some traumatic core images, that I was unable to remove at the time, due to extreme concentrational difficulties. <br>Popped a few balls of harmala extract with calea, which helped a lot, I purged some more and then it was gone... well not really gone but too low on energy to interfere with me anymore. After this I experienced ecstasy of the revalation, for something like 48 hours. Good syncronisations, humour everywhere, boosted creativity and just really lots of pleasure. Smoked some good dagga petals and ate more iboga. Total amount of consumed rootbark was 7 grams. <br>It has been something like two weeks since I did this, I have taken lots of alcohol and cannabis without any ill effects I normally get, I can control my nicotine addiction better and my chronic depression has lifted.  I am somewhat telepathic and astrally conscious, have been doing some shamanic stuff and had a good time with a nice girl. I also have started to have pretty wierd dreams, I think im gonne be lucid really soon :)<br>I dont want to try to explain any visual/mental effects, because these are 'see for yourself to know things' but imagination was very vivid and sound quite pleasing. All the vision I saw were very meaningful and quiding.\n\n\n"
}
