{
 "title": "Subdued",
 "author": "kwmi",
 "citation": "   kwmi. \"Subdued: experience with Sertaline, LSD & Alcohol (ID 48587)\". Erowid.org. Feb 9, 2006. erowid.org/exp/48587",
 "substance": "Sertaline, LSD & Alcohol",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Sertraline",
   " ",
   " ",
   "  repeated",
   "oral",
   "Alcohol",
   " ",
   " ",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2005",
   "48587",
   "Male",
   " ",
   "Not Given",
   "Feb 9, 2006",
   "5051",
   " "
  ]
 ],
 "report": "<p>I experimented recently with SSRIs and psychedelics by undergoing a one month treatment of sertaline and trying different psychedelics at that time.  I was curious as to see what the effects would be because I know that psychedelics (especially mushrooms) cause a rush of seratonin to the brain.  My hypothesis was that the SSRI would lengthen or intensify a trip by inhibiting the reuptake of the released serotonin.  I submitted a trip report for my SSRI/ P.cubensis trip and I will note here that my trip was shorter but much more intense (especially the body high) than any experience I had without the SSRI.  </p><p>The acid I got was from a friend.  I was skeptical at first because it had seemed like ages since there was any good acid going around.  However, he said he took two of these plain white blotters and tripped for over twelve hours.  I had taken acid once (well more than once, but only once was it enough to have a noticable effect) in Spain and enjoyed it quite a bit.  I had strong enough of a trip to get good OEV and could finally understand what my friends were talking about when they tried to explain how the visuals on LSD and shrooms are different.  Anyway, I took the two blotters late at night.  I had been drinking.  I actually was planning on saving them for later, but when I have drugs laying around, I usually take them.  So I had been drinking all night with my friends and I bust out the 8 blotters and suggest we do acid.  Some of my friends were skeptical so they decided to only take one, while I took two, knowing that my friend had tried this same batch and said that two was a good trip.  None of my friends had tripped before and the subtlety with which acid comes on caused one of my friends to eat a couple of grams of shrooms about an hour after taking the acid because he was convinced that it wasnt going to work.  </p><p>However, at about 3 or 4 hours we were all peaking and we all knew something was up.  I was listening to the beatles, yellow submarine and some doors watching visualizations on my computer.  I kept waiting for the intense and great visual I expected from acid but they never came.  I had very little visuals.  At one point however we were watching a movie with Julia Roberts and I started ranting about how she was not that hot.  Suddenly it flashes a close up of her big ugly face and I shot back out of my chair and fell to the ground in disgust, it was really funny and right then I knew I was on drugs, but I just wasnt getting any visuals (which are my favorite part of psychedelics).  After the peak I couldn't sleep for a while and was a little dissapointed.  I had been assured by an experienced tripper that 2 blotters would send me to another world.  He laughed when I suggested I might do 3.  </p><p>My conclusion is that the SSRI  definately deflated the acid trip.  It was fun and I felt the effects of the LSD but there was simply no visuals, no synesthesia or anything that I was expecting from this 'godfather' of psychedelics.  I'm going to try to find some more now that I've been off the SSRI for over six months.  </p><p>SSRI + LSD - subdued trip</p><p>SSRI + Shrooms - Shorter but more intense trip</p><p>These are my own personal conclusions and are by no means theories of the interactions between these drugs.  There are obviously many other 'Z' factors that could have contributed my experiences.  Hope people find this useful.</p>"
}
