{
 "title": "Fed Up",
 "author": "Mr Wiggles",
 "citation": "Citation:   Mr Wiggles. \"Fed Up: experience with Inhalants - Gasoline (ID 48682)\". Erowid.org. Jul 31, 2006. erowid.org/exp/48682",
 "substance": "Inhalants - Gasoline",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 48682",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 31, 2006",
   "Views: 7401",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, I have huffed before many of times and this was the start of the crazy events. I was in the room with my cousin who was playing the guitar when I told him I would be back in 5 minutes and that I was gonna 'Hit the gas can.' I went outside to the carport and started huffing in the deepest breaths possible. I have passed out many times before so I walked to the grass and sat down. Didn't really but I thought I did. \r\nI woke up about twenty minutes later with my head bleeding, my eyes bleeding, lips bleeding from my teeth going through them, my nose bleeding and a big ass cut on my chin. Thats not all folks...I went inside to my cousin and started freaking out and pulling my hair out in chunks...lol. But then my cousin said smile, I did and he started laughing really hard. \r\nI chipped about 3/4 of my tooth off. I started laughing really hard and thought about what I should tell my grandma, who was sleeping in a rocking chair in the living room. I started brushing my teeth (didn't hurt at all, nothing did) to get the smell off my breath and then went outside and pulled the handlebars off my razor scooter. Then I woke her up and told her that I was going to her car to get a CD out of it to listen to while I go to bed and I was on the scooter and it slipped when I was getting off it. \r\nI stayed out of school for about a week to get rid of the black eyes and bruising on my face. I am still 'Hitting the gas' can to this day. I am hardheaded and on my way to Alcoholism because I have a lot of experiences in this category too.\n\n\n"
}