{
 "title": "Smacky, But Not Overwhelming",
 "author": "EatSomeLSD",
 "citation": "   EatSomeLSD. \"Smacky, But Not Overwhelming: experience with Alcohol, Hydrocodone, Propoxyphene, Caprisoprodol & Butabital (ID 48683)\". Erowid.org. Dec 12, 2006. erowid.org/exp/48683",
 "substance": "Alcohol, Hydrocodone, Propoxyphene, Caprisoprodol & Butabital",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)",
   "  T+ 3:30",
   "1 tablet",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   "  T+ 3:30",
   "1 tablet",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   "  T+ 3:30",
   "1 tablet",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)",
   "  T+ 4:00",
   "1 tablet",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)",
   "  T+ 6:30",
   "750 ml",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 7:00",
   "750 ml",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48683",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2006",
   "Views: 29591",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>4:00 PM: Friends arrive, start on 40 oz. Budweiser.</p><p>6:00 PM: Friends return.  Consume 1/2 of Budweiser 40 ounce malt liquor.</p><p>6:30 PM: Friends leave, as I'm finishing last half of Budweiser 40 ounce</p><p>7:00 PM: Down first Soma and one Vicodin, and first Loricet chased with Budweiser malt beverage.</p><p>7:30 PM: Down second Soma, second Vicodin, second Loricet, chased with Budweiser malt beverage.</p><p>8:00 PM: Finish Budweiser malt, down 50 mg Butabital and third Loricet with it.</p><p>9:00 PM: Am starting to feel drowsey; not with the alcohol or opiates alone (which I'm used to downing morphine sulphate with 140 proof+ Absinthe anyway), but I experience a sort of 'leaning' sensation; as if I'm actually drunk.</p><p>9:30 PM: I decide to call my dealer to ask him for more Barbies...please.  Forget the morphine, the mushrooms...nevermind my stash of 'sinthe and 2-CE; just give me some more Butabital, tonight.  No luck, have to wait until tomorrow.</p><p>9:45 PM: I call my dealer AGAIN...please, more Butabital.  No luck, just gotta wait.</p><p>10:30 PM: Am losing intoxicated state, crack open a spare bottle of Rinfrescante.  This state is similar to the state induced by MSContin x Absinthe, to an extreme.</p><p>11:00 PM: Have finished the first 750 ml of 14.2% red, am cracking the second.</p><p>12:30 PM: Have finished the second...effects of the pills have nearly worn off.  Am starting to feel the GI-related side-effects of alcohol and APAP over the alcohol.</p><p>1:30 PM: Decide to take a moment to fecate; feces leaves strands of red (more of a burgandy than crimson)...obviously serious GI altercations, but no yellowing of the skin differs from any possibility of serious infection.  Small (~1/4' diameter) scabs are also apparent.</p><p>4:30 AM: All effects of alcohol have faded, am simply hungover at this point.  Feces is 'foamy' and somewhat dissatisiying at this point.</p><p>It's not recommend to dose APAP over 1 gram (1,000 mg), though, in this particular experience, I consumed nearly (or over) 4 GRAMS (4,000 mg) of APAP.  Normally this would result in an ER visit, complete with charcoal stomach-pumping (useless at this dose) and probably heavy downer injection.</p><p>This is extremely harmful to your liver and kidneys, do NOT fool yourself.  Also be aware that ~32.5 mg of codeine, ESPECIALLY in combination with ~5 drinks of alcohol, is severely dangerous and, under any circumstances, is not condoned.</p><p>Red wine, while is constructive of the CV (cardio-vascular) system (by removing excess blockage from arterial tissue), is extremely harmful to the GI tissue; I did not mention (simply because it was not correlative to the report) that I've gone through a case of this same wine, as well as 500 cl of 74% Au Blanche' absinthe in the preceeding week.</p><p>Psyche view: Would have stayed clean for a week, and only consumed the 'sinthe, Soma's, and barbs...</p><p>Rec view: Would have skipped the alccy and just dropped the three Lori's, the Soma's, and the Barbs.</p><p>Between the anal bleeding and inability to comprehend simple functions in a work environment the day after, I would probably eat this everyday...</p>"
}
