{
 "title": "Oral DMT",
 "author": "Anonymouse",
 "citation": "   Anonymouse. \"Oral DMT: experience with DMT & Syrian Rue (Extract) (ID 48732)\". Erowid.org. Mar 13, 2008. erowid.org/exp/48732",
 "substance": "DMT & Syrian Rue (Extract)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Syrian Rue",
   "(extract)",
   " ",
   "150 mg",
   "oral",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48732",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 13, 2008",
   "Views: 7801",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSince there seems to be a lack of trip reports regarding oral DMT usage, I thought I'd write one (this is my first real trip report, go easy on me!\r\nI've been experimenting with oral DMT with mixed results. Since I don't really know how drug absorption works through the stomach, I have been slowly realizing that I've been doing it all wrong. Previously I had fasted for 8 hours prior to ingestion of an MAOI capsule, then 1/2 to 1 hour later a capsule of DMT freebase. It never worked that well. In another thread it was suggested to me to try to take the components dissolved in a liquid (skip the gelcap) and try to take a light carbohydrate snack with each. That was the first real successful trip. So next time (this time) I decided to not fast at all (but I still observed my dietary guidelines before taking an MAOI).\r\nIt seems that it takes food 2-3 hours to completely leave the stomach (depending on how easily digested that particular food is), so I decided to eat like I normally would, and to prove a point have a large dinner (which I did, mmmmmmm). 2 hours after finishing dinner, I took 300mg of harmala alkaloids (gotten from the manske extraction of syrian rue) mixed in with a tablespoon or so of water. In the meantime, I prepared my psychedelic lemonade - 150mg DMT extracted from m.hostilis dissolved in a tablespoon of very warm lemon juice and a tablespoon of sugar and approximately 75-100ml of water added after all the oily freebase dissolved.\r\nInterestingly, this time I really felt the harmala alkaloids. About half an hour after taking the liquid I felt very relaxed and content. The Christmas lights around me had a very soft warm glow. I finally understand that these alkaloids are a drug on their own and can see that times I could use them all by themselves .....\r\nIn all my previous experiments, it took pretty much 2 hours on the nose to start feeling the DMT, so I took the lemonade about 45 min before my oldest kids bedtime, about 1.25 hours after taking the harmala alkaloids.\r\nWell, my theory was correct in a large way. 25 minutes later I was tripping as hard as I would be.\r\nThe room took on a sort of alien feel/vibe. Even though I knew everything around me, it seemed like it was the first time I was seeing any of it. Everything took on a sort of soft appearance (in contrast to LSD's sharp visions and edges). Things seemed to be made up of small pieces that were all buzzing and moving around.\r\nExploring thoughts and deep thinking was very rewarding. Visions changed as I thought deeper about various things. I watched webs of light and electricity race across the ceiling. Walls were breathing - skin and body hair appeared very alien in appearance. Talking and getting ideas across to my SO was slightly difficult. I was a little confused at times as to what I was doing - Several times I had gone to get something, but forgotten what I was doing halfway through. Maybe I was just sidetracked by the visions.\r\nUnfortunately, the trip wasn't quite as therapeutic as I had hoped, due to the rapid onset and me not being ready for it. Good thing my SO was around to help take care of the things that I couldn't (like the kids). My pupils were huge and while the experience was not overly strong, it was strong enough that I wouldn't have had to want to deal with real life.\r\nAfter about 3 hours it was over.\r\nIt was a very successful experiment and indicated to me that fasting is not only not necessary, but can be a detriment to the trip. There was no nausea whatsoever. It didn't last as long as I had hoped, but maybe it was because I was fully MAO inhibited for at least an hour before the DMT took effect, so that was an hour less of the trip.\r\nI am surprised that more people don't try DMT orally. Its completely different than smoking the freebase. I imagine that if you really like smoking freebase that the oral experience may be disappointing, but if you are looking for more of a traditional trip feel that you may really like it. I'm already looking forward to the next one.\n\n\n"
}
