{
 "title": "God, a Metaphor for Time",
 "author": "Hinkleshire",
 "citation": "   Hinkleshire. \"God, a Metaphor for Time: experience with Mushrooms (ID 48784)\". Erowid.org. Sep 30, 2009. erowid.org/exp/48784",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48784",
   "Male",
   " ",
   "Not Given",
   "Sep 30, 2009",
   "Views: 2332",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I went with a good friend of mine who is also my roommate into the mountains to embark on a tripping experience on a warm Saturday morning where dew still clung to the pine needles and there was a general amiable nature about the beginnings of the day in general. We had planned to share an eigth in light of their quality and our inexperience. We climbed up a little bluff overlooking the path at which point we ate the shrooms plain and washed it down with a cracker or two and a swig of cool water. We then began to apprehensivly await the trip to come.</p><p>After a distance we encountered the path again and I had already begun to feel the mild nauseas effects accompanied with a sense of being overheated. We found ourselves eventually strolling at a quickened pace and began to gain on two people ahead of us. And it being only my third time I wanted to negate any discomforts or problems of any sort, so we decided to get off the path again. After a quick scramble up a rock field we began to start tripping and arranged our packs and such into makeshift beds in a little grassy grove amongst the trees. A reflective pool was nearby and a little beyond a waterfall we could drink from. We were all set up just as the we reached our peak. I had sunglasses on as it was such a bright day and found that my visuals of looking up at the clouds were more intense by looking through them.</p><p>I had a little struggle however at the peak. My stomach was acting up, bringing me to a state of discomfort and leading me to my first amazing realization: The power of my conscience mind. I was able, by concentrating profusely and without interruption, to dissolve the pain and discomfort in my stomach. It felt almost as though I had thrown the pain to a whirlpool in the middle of my abdomen and it had been swallowed up. At this time of discomfort my thoughts began to find holes of which I had to climb out of, just as I had healed my stomach I had to heal my mind of painful past occurences, realizing my inability to change the past. After completing these tasks I was able to respond to my friend and to begin thinking and observing. There were general themes at this point of a few exchanged words, exclamations of amazement and then moments of silence that lasted up to what seemed an hour, swallowed in our thoughts.</p><p>After a period we traded off exploring, eating wild rasberries and becoming wet trying to drink from the waterfall. Each waking moment was ecstasy in its wonder and beauty. We were in a new world where we could see ourselves as important strands of the fabricated web of the universe. Time was all powerful and allknowing but not all loving. It destroyed and created in a perpetual motion of change. We were caught in a series of explanations, understandings and revelations. I learned of my body in relationship to my space. I was able to be observant of my surroundings and to appreciate what tools and abilities I had acquired. As time passed the sun came in patches as light summer rain clouds came in. Then came thunder that rumbled for miles rolling along the mountains like a dream of great giants playing at bowlers with great stones. It was a treat for the ears.</p><p>The last conclusion I remember of that dream of a day was the formula for friendships and why we connect to some people instantaneously with open arms and a life of trust, and others we take time become close and sometimes never really trust. To some degree we concluded that there are many forces and happenings in the universe that cannot be explained in words. And that this was one question that would need a great understanding of things to answer.</p><p>We returned to society tired looking, full of wisdom and quite dirty to the amusement of fellow passing hikers he he.</p><p>A fellow citizen of the world/universe</p>"
}
