{
 "title": "End of Midlife Crisis",
 "author": "Motown",
 "citation": "   Motown. \"End of Midlife Crisis: experience with MDMA (ID 4878)\". Erowid.org. Jan 27, 2001. erowid.org/exp/4878",
 "substance": "MDMA",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 24:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 28:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 32:30",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "4878",
   "Male",
   " ",
   "Not Given",
   "Jan 27, 2001",
   "27531",
   " "
  ]
 ],
 "report": "<p>\nDivorced in my mid forties and living in Asia. High stress position in University setting. On vacation in Batam, Indonesia.</p><p>Took an invitation to experience Ecstasy (for the first time) with a beautiful young Indonesian/Malay woman in late 20's about 10 p.m. at the local club. One hour later...Erica and I are tracing the beauty of her high cheekbones with both of our entwined fingers. I was only drinking water.</p><p>I felt mounting insight just after the drug 'rushed' palpabally into my extremeties. I had friends visiting with me on this 'boys' weekend in Indonesia from USA and our mutual love for each other became quite easy to express. I individually told each guy how much I appreciate and care for them and two of them..not on MDMA..kind of shrugged me off. My other and closest buddy (who took MDMA) smiled and allowed me to hang physically close to him without any reservations and it just continued to grow as an experience of pure love.</p><p>Then I hit the rave floor! Whoa! Danced up to assorted women and Indonesian men and touched foreheads and rythymically and synchronously moved our heads back and forth. I would just look at a person and their smile back seemed to be a conversation of deep and spiritual insightful processing.</p><p>Shared an Ecstasy pill with Erica about T + 4:00 Hours after first ingestion. The half took me to closing at 0630 a.m.</p><p>In our hotel room. Turned off all lights,lit candle and got the baby oil. She is a strong Island girl from Aceh and I weightlift so we just took our mutual knowledge of deep muscle massage and touched for hours, but with incredible force and torque. Before I would 'bust a move' and pick her upside down to force blood to her head so I could deep massage her skull and brush her long black hair...she would shift her body as if knowing my plan. Quite incredible.</p><p>Later...after lovemaking which inevitably followed..she indicated that she has insight with jungle animals moods and desires and learned to 'talk' to them in her native village as a girl.</p><p>'I hold snake and tell him I understand and he stops hissing and accepts me.'</p><p>Hmmmmmm. O.K. But knowing the Indonesian culture, it felt that as a 'bule' or 'white ghost' (Caucasian)...I was gaining insight into things that previously were hidden from my American culture.</p><p>Whatever. Rested could not sleep. Had psychic closed eyes conscious hallucinations or 'brain movies.' Felt unburdened by all that had burdened me but in a way that gave me hope to deal positively with what I would face tomorrow. Ordered room service and massaged and touched all day. Went out that night again at 10 p.m. and did it all over again.</p><p>But this time stayed at Erica's side and we both swayed and stayed extremely physically close, with the same level of MDMA..but with an added half hit as we left at 0630 am. But that extra hit put Erica in great need of having her hands deep massaged in order to lull her to sleep. Slept till noon and we parted.</p>"
}
