{
 "title": "To What Lengths I Would Go",
 "author": "LSDose",
 "citation": "   LSDose. \"To What Lengths I Would Go: experience with Opiates (ID 48803)\". Erowid.org. Apr 9, 2007. erowid.org/exp/48803",
 "substance": "Opiates",
 "bodyweight": "143 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Opiates"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48803",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 9, 2007",
   "Views: 48723",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So let me start by saying, this article is not only about one experience with painkillers, it is also about addiction and the things you will do and endure to get the pills/liquid/patch in which you are addicted to. It all started when I was 16 and had knee surgery and was given a bottle of 60 oxycodone. I had never really dealt with pain killers before that but all the sudden I knew that I loved these things! I kept taking them until that bottle ran out.</p><p>Since I was uneducated and ignorant about painkillers, I didnt realize that there would be a serious withdrawal form them. And folks, I hit rock bottom. I hated feeling this was and felt as if I could not function or be happy without them. I began asking friends or acquatances if they could get me some or if they knew anyone who could get some. I came across a few people and were getting them pretty steadily for the next 3 or 4 months. I wouldnt be able to take one every day, but I came to the point where I would skip a day on purpose or maybe 2 days in hopes that the next time I would take some, it would be stronger. I lost a few very good and true friends along the way. They said that they had never seen me like this before and that it changed me. I didnt care, I just flicked them off and said 'who needs you'.</p><p>I then found out that my girlfriends Father had back surgery and was given a bottle of hydrocodone that could be refilled. He said he didnt need him though because he was a 'man' and didnt need drugs to get through his pain. So, I began swiping those. I had told myself that I was only going to take enough of them to where they still didnt notice. I couldnt stop! I took them until there were only 3 left in the bottle. Even then I was thinking, why dont I just take the bottle itself and make it seem like they lost it. Eventually the parents caught on and someone else got blamed for it. I started to think 'Wow I'm a shitty person.' But that didnt stop me. </p><p>My mother was later diagnosed with Pancreatic and Liver cancer and began getting the pain killers for those. I decided to not take those like crazy and to keep getting them through my friends and dealers. Every once in a while I would take a Morphine or 2 but I didnt think it mattered because she wouldnt take them every day. So it was like I was taking the ones she didnt. Stupid me! My Aunt came to visit and she is highly addicted to pain medications. She ended up stealing 37 of my moms morphine tabs that she needed while going through chemotherapy. I remember sitting there in the living room while my mom sobbed uncontrollably saying 'Now how much more pain am I going to have to suffer without these.' That really hit me hard and I decided to stop.</p><p>Nope, didnt work. As her sickness was getting worse she was having to get stronger medications. So therefore, the leftover ones were free game for me to take. So basically I was always a step behind her. Then next new ones she would get. I would go up a step also. I went through Oxycodone, oxycontin, morpine, hydrocodone, fenatyl, liquid morphine, lorazipan and then finally my mom got on a morphine drip I knew when to draw the line. It is a sadder story from here.</p><p>I began to always be doped up on an insanely high amount of meds. I was not even there. I started taking the fentanyl patch. I became a zombie. When the doctors told our family that my mom had anywhere from 5 hours to 5 days, it depressed me and I began taking more. My mom has long since passed away and its sad because I hardly remember my last few moments with her where she could actually speak to me. After a while, cancer patients are so sick and doped up, communication is impossible.</p><p>I feel as if I didnt know her and didnt get to say goodbye. Do you know what it is like to regret something everyday to the point of crying in the middle of any moment? I feel as though I can not get through the grieving stage. A big burden is constantly with me and I would give ANYTHING to speak to her again, but I cant, not in this lifetime. And to this day I am still taking the many bottles of morphine leftover. </p><p>It has ruined my life and I'm scared that I will never move on or get over the death of my mom.</p>"
}
