{
 "title": "A Crazy Physical Rollercoaster",
 "author": "Phiz",
 "citation": "   Phiz. \"A Crazy Physical Rollercoaster: experience with Quetiapine (Seroquel) & Amphetamines (Adderall) (ID 48807)\". Erowid.org. Feb 24, 2008. erowid.org/exp/48807",
 "substance": "Quetiapine (Seroquel) & Amphetamines (Adderall)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Quetiapine",
   "(pill / tablet)",
   " ",
   "2 tablets",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48807",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 24, 2008",
   "Views: 21772",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy close other has been prescribed to Seroquel and Adderall for most of his life. Even though he's never actually *needed* either of them, he still enjoys the highs off both (along with at least 4 other prescriptions) and it's free thanks to his highly conservative father. :)\r\nI believe that my experience with Seroquel was a lucky one. I didn't take it in a good mood so that may have a little to do with it. I was going through a rough week and decided to call a mental day or two out of work 'sick'. At the time, we had the entire house to ourselves on a very warm, rainy week, so we felt a lot more chill than we usually would have on the day off that this took place. Most of our week there was spent smoking pot and reading or painting. So we decided to make the most of it. \r\nHe was explaining how it was like to be on Seroquel. Since it's apparently used for a schizophrenia sleep-aid, and I didn't want to fall asleep, I took two adderall (the mg content is unknown to me, honestly. I believe it's up there though) along with it. \r\nUnfortunately, I conked out almost 30 minutes after taking it. I woke up facing the back of the couch about two hours later and my body was burning up. It felt like I was asleep for only 5 minutes. I got up and my head felt like it was in a half-asleep, muggy, feverish kind of state and I staggered over to the King-size bed and passed out all over it. I woke up with my guy in my face about an hour later and he was peeling my clothes off and putting a cold compress to my forehead. Next thing I knew, I was mumbling about taking two adderall and one of his seroquel. It was audible enough, but I had a LOT of trouble speaking. He got really worried but I started laughing and told him how I felt like I was on 9 valiums and it seemed to lighten him up for a bit. After a few minutes, we were both in bed, he was holding me upright to keep me awake because he apparently said I might've 'took too much'.\r\nUnfortunately for him, I passed back out. Over the course of the next hour, I spent most of it falling in and out of a sudden, heavy sleep. It was like my brain was hitting REM at a rapid pace but then shaking itself out. I jolted awake most of the time. The times I would wake up and see him missing, I would call out pathetically for him to come back and hold me. After another hour, I questioned 'When does it end?' He told me it would take about a half a day for the trip to wear off and then it would actually wear off after about 24 hours. Looking back on it, it did take a rediculous amount of time to wear off and since I'm not one who really likes to waste a whole day in bed, this is probably the main reason I've never taken it again. \r\nI think the worst part about Seroquel was it had a severe reaction with my sleep apnea. The fact that I was speeding up and slowing down had a huge physical reaction on my body. Sometimes, it would be waves of euphoria. It would feel like I had taken valium or codeine. But then my entire body would tense up uncontrollably and shake like crazy. It must've been while I was sleeping that one of these shaky tense-ups had occurred because I was frantically shaken awake by my guy. It looked like he was about to give me CPR and I fell off the side of the bed in a daze, gasping for air. He said I had started turning a weird color and convulsing when I was on my side. All he had to do was roll me on my back and I probably would've been fine but he was so scared that I decided to make him force me to stay awake.\r\nSo we went at it for about a good half-hour and I ended up changing into a cooler set of clothing and wiping my face with a cold cloth to stay awake. After a while, we went outside for a smoke, him leading me by the hand the whole time and, disorientated, I plopped down to watch some movies which all turned out to be forgotten in the long-run. I don't remember much of the rest of that day but it did get to a point where he himself decided to take a seroquel and we both fell asleep around 5pm of that day. We both didn't wake up until around the same time the next day and enjoyed some coffee, a bonghit, and cartoons together until the final effects were wearing off. I'd say if not for the fact that it took a day and reacted so harshly with my apnea, I would definitely take another day on seroquel spending it with him, but without the adderall. \r\nNote: I've only had apnea while laying on my side. I'm not overweight at all, just a really heavy smoker. ;| I was extremely fortunate to have someone trustworthy and helpful being there with me at the time, especially when he knew all the reactions from experience. I can honestly say that this isn't a pill for everyone. It's an antipsychotic and should only be used for that purpose. But regardless, I didn't do it right. You're supposed to force yourself to stay awake to trip out. My other who stayed there with me has stayed awake for the full 24-hours before and has had both audio and visual hallucinations, extreme body highs, and deep sleeps. I believe a side-effect of long usage of this drug is memory problems and the inability to remember your own dreams. He hasn't remembered a single dream in 4 years.\n\n\n"
}
