{
 "title": "Parsimony Overload",
 "author": "Psychonautical",
 "citation": "Citation:   Psychonautical. \"Parsimony Overload: experience with 4-HO-DiPT (ID 48843)\". Erowid.org. Jul 24, 2006. erowid.org/exp/48843",
 "substance": "4-HO-DiPT",
 "bodyweight": "275 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "4-HO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 48843",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 24, 2006",
   "Views: 4973",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[ Erowid Note: 100 mgs of 4-HO-DiPT is considered an extremely high dose, see 4-HO-DiPT Dose Chart ]\r\nThe most unusual thing was it lasted a very long time.  Instead of two hours, it lasted at least eight hours and I did not fully recover until a full night's sleep.  I was starting to think it might never completely wear off.\r\nI started off with a much lower dose, but after an hour it did not seem like much was happening.  I then was somewhat reckless and took all 100mgs I had acquired.  Perhaps my physiology is just different that it acts slower, and lasts longer on me than others. I'm no expert so I can't be sure.\r\nIt was fairly intense though I have tripped more intensely in my life.  The visuals were quite bizarre.  One notable effect is things appear to change tint and color.  Odd patterns were also seen along with the occasional random images.  The patterns are most vibrant with eyes closed.\r\nAs far as the random images go- they were brief and of the outline on the wall variety.  Some seemed religious in nature and some were as discussed below.\r\nOne of the most disturbing was hallucinating shadows of other faces looking at me.  The most realistic was some sort of gory eye visual that would flash by occasionally with my eyes shut.  It is very hard to describe.\r\nMentally, I had the delusion that I had died and come back.  I also felt as if there were three realities I was warping between as the tints and colors changed.  Text on the screen at times seemed to fade in and out.\r\nNext day, there was no noticeable hangover but I did feel somewhat depressed.  I consider myself lucky as I took way more than I should have of a substance that is not commonly used.  There was no telling what the effects might have been and I suggest others stay well below that threshold.\r\nI tend to have a high tolerance for substances in general.  It takes more of them to get me high than most people so this was probably also a factor.\n\n\n"
}