{
 "title": "Blood on the Walls",
 "author": "Abby",
 "citation": "   Abby. \"Blood on the Walls: experience with DXM with CPM (ID 48855)\". Erowid.org. Mar 2, 2010. erowid.org/exp/48855",
 "substance": "DXM with CPM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "960 mg",
   "oral",
   "DXM",
   "(pill / tablet)",
   " ",
   "480 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "48855",
   "Female",
   " ",
   "Not Given",
   "Mar 2, 2010",
   "Views: 8996",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]  </p><p>Ok. I don't remember much of the day this happened, or the entire month before, so bear with me. I learned about DXM from the rehab I was in. (Crazy, huh? Well it gets better) I had been taking anything containing DXM for probably around a month. So one night I decided to go to Walmart and buy 3 boxes of Coricidan Cough & Cold. Like I said, this is all a little foggy but I got home, and I was chatting online with a friend, and for some reason decided to take them all at once. I'm pretty sure I took 2 boxes at first, (Around 9:30 PM) which is 32 pills, and 960 mg of DXM. Here is a few lines from the conversation I had with my friend. </p><p>Me(4/12/2005 10:38:22 PM): hurry uo</p><p>Me(4/12/2005 10:39:18 PM): i onlty hacve 1 pack left</p><p>Me(4/12/2005 11:11:29 PM): stepn is she thaere uet</p><p>Friend(4/12/2005 11:11:41 PM): lol i can tell ur fucked up</p><p>Friend(4/12/2005 11:11:47 PM): yes but she wont let me take her car </p><p>Me (4/12/2005 11:12:20 PM): wilkll whe let me pick u uop? </p><p>Friend(4/12/2005 11:13:11 PM): can u drive?</p><p>Friend(4/12/2005 11:13:12 PM): lol</p><p>Me(4/12/2005 11:13:30 PM): yeah i can drve</p><p>Me(4/12/2005 11:13:38 PM): vfeine</p><p>Well, thank God I didn't go get her that night, I probably would have killed us both. My typing got worse and worse, until I guess I just stopped talking to her. From what I heard, I went into my room and cut my wrists, and let the blood drip all over the bathroom floor. I took the last box, 16 pills, 480 mg of DXM.  Then I started puking up blood, all over the bathroom floor and walls. I smeared the blood over my face, and realized that I was probably going to die.</p><p>I walked into my dad's room and tried to talk to him, of course he couldn't understand me. He grabs me by the arm and drags me out to the van to take me to the hospital. At what I guess to be around 1:00 or 1:30 AM, I start remembering things. They pumped my stomach twice, the whole charcoal deal, and ran a drug screen. I'm not sure about everything that showed up, but I know PCP was there. I never did any PCP. Three days after I was admitted to the ICU, I was still high. My vision was still blurry, I was still shaking. And it wasn't a good high. I kept telling my parents, 'I just want to come down.'</p><p>From the hospital I was taken by ambulance to a mental hospital, where I stayed for 9 days. From there I went back to the rehab I was in before, only a month ago. I stayed there for 34 days. Since then I've been back to rehab for 114 days, I just got out on November 6th. I was sober for somewhere around 2 weeks, and even at this moment I am a little shaky from taking DXM last night.</p>"
}
