{
 "title": "Best Synth We Know! Have an Excellent Flight!",
 "author": "Davros",
 "citation": "   Davros. \"Best Synth We Know! Have an Excellent Flight!: experience with 2C-T-7 (ID 4889)\". Erowid.org. Jan 28, 2001. erowid.org/exp/4889",
 "substance": "2C-T-7",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-T-7",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4889",
   "Male",
   " ",
   "Not Given",
   "Jan 28, 2001",
   "Views: 7243",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nYou find me, staring, in complete amazement, at the end of my finger. I am watching agog as energy spirals curve and loop off my finger tip. The edges of my fingers are fizzing with particles. YES, I CAN SEE THE PARTICLES WHICH MAKE UP MY FINGER. </p><p>My girlfriend takes a digital snap of me lying there. It is not a flattering photo, but you can see that my face is radiating delight and amazement. I look like a baby under a mobile. </p><p>Three hours ago, I took swallowed three blue 10mg pills of 'Blue Mystic', commercial 2C-T-7 available in Amsterdam. They call it 'PT-DM-PEA', and the man in the shop insists, with a wink, that it's just 'a dietary supplement'. </p><p>The instruction pamphlet, however,  tells a different story:</p><p>'about 15% of the people that try this psychedelic need much less than others. Being careful may cause that you miss the boat, but that is better than to take too much [sic]. This is a strong one. The way up to the peak may be a little bumpy. Some experience time dilution [sic]. Best synth we know of! Have an excellent flight'</p><p>These are wise words. </p><p>2C-T-7 gave me the beating of my life, tripping-wise. After LSD, mushrooms, and MDMA, I was the archetypal cocksure tripper. I could take anything. </p><p>But 30mg of this stuff was like being taken into a side alley and soundly thrashed . But I deserved it. And I enjoyed it. </p><p>It took ages to come-up. I cooked a meal, chatted with my girlfriend, got my music ready, lit candles - the usual waiting game. The effects gradually crept in and after two hours - enough! I sat down, relaxed, and let it come for me.</p><p>And come for me it did. </p><p>I held onto my girlfriends hand as the most intense trip of my life began. As soon as I relaxed, my ego started shredding and didn't stop until I hit peak about two hours later. Visuals poured into my eyes. After-images and tracers. Rippling, pulsating, scribbling, churning, flowing, melting.  Layers upon layers. It kept coming. Stronger and stronger. </p><p>These were not hallucinations. I wasn't making this up. The neat little mental compartments where I keep my definitions of things just started bursting open and leaking into each other. </p><p>'this is a strong one. The way up to the peak may be a little bumpy'</p><p>Everytime I closed my eyes, I dissolved. My senses merged. In every direction, infinity. My stomach lurched like I was on some cosmic rollercoaster. 'Interior 3D spirtual vertigo'.  Infinite peacock feathers fanned out in infinite directions - a symbol of  my own consciousness - I realised - reflected back at me, like a hall of mirrors.</p><p>Things settled slightly when I reached peak. Amazed, I sat there coaxing more and more details out of my eyes. By deliberately 'not seeing' and not recognising what I was looking at, I could throw my stare 'through' objects. </p><p>I stood an inch away from a wall in my hallway and directed my gaze 'into it', grinning as more and more detail sprang into focus. The grain. The pattern of the paint, like the surface of the moon. And then finally the molecules making up its surface.</p><p>Later, I just stood in my bedroom, strecthing, unlocking physical tensions and gasping as huge surges of energy coursed through my muscles. </p><p>And, in the midst of all this, total clarity. My girlfriend said I didn't even seem like I had taken a drug. I made two phone calls without the recipients realising I was tripping. I didn't need to assert control. </p><p>What an amazing substance. </p><p>Heed those wise Dutch words:</p><p>'This is a strong one. The way up to the peak may be a little bumpy. Have an excellent flight!'</p>"
}
