{
 "title": "I Forgot I Was Paralyzed",
 "author": "ComputerHead",
 "citation": "   ComputerHead. \"I Forgot I Was Paralyzed: experience with Salvia divinorum (10x extract) (ID 4891)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4891",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "4891",
   "Male",
   " ",
   "Not Given",
   "Jan 10, 2002",
   "Views: 5952",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n20 Seconds after the 1st hit I felt as if reality was dirt and I the worm. Crawling out. As I looked around everything seemed so 'kindergarden' like. I didn't need reality anymore. It is nothing but a bunch of matter for your spirit to dwell in. I took off my gloves because they were not a part of me. I wanted to remove all of my clothes but there were people in the room. Then I felt as if I needed to remove my flesh. I didn't need it anymore. I started to stand up but realized that I can't because I broke my neck 18yrs ago. I totally freakin' forgot that I was paralyzed and confined to a wheelchair. All of a sudden, the corner of the coffee table stretched out beyond it's normal limitations overlapping other parts of the room. It moved like a snake. Slowly metamorphosizing with the object next to it...  Which happened to be a girl. I could easily make out here face but everything around here was intertangled with her extremities, energy constantly flowing slowly between her and the surrounding objects. I looked into her eyes and felt her life-force. I wanted to kiss her but I'm shy around other people. Throughout the 1st trip I felt like I possessed the meaning of life. I felt the wisdom of my ancient ancestors embedded in my soul. I felt as if I weren't even human. I wasn't from this earth.</p><p>I waited about 30min before I took another hit. This time I took a really big one and held it forever...     Big mistake..</p><p>Everything in the room (including the room itself) came alive. The walls came apart at the seams and then back together, over and over again, like someone zipping and unzipping the fabric of space/time. I was a little worried that I might roll right off the floor and through the unzippered wall. The room kept tilting from one side to the other. I had to roll my wheelchair to compensate so I wouldn't fall out of reality. As I pushed the wheels with my hands it felt like my hands and the wheels were integrated. Again, I looked at the beautiful girl as she walked back into the room and sat down. Her clothes and golden hair grew into and throughout the room like snakes. It (she) seemed to wrap around me and become a part of me. I was drawn towards her. I was going to kiss her. I had no choice. Something overpowered me to do this...  But again I stopped short. Not because I was shy but because I was too f*cked up to concentrate. My whole world was falling apart all around me. I knew that outside these 6 walls was nothing...  No air, no world, no space, no nothing. All I had left in my reality was everything in this room and it was about to tear itself into shreds. Just as fast as it snuck up on me, the feeling subsided but with occasional flashbacks throughout the remainder of the day.</p><p>I've always wanted to have hallucinations and never could. Not even on lsd. This 10x was purely magic.</p>"
}
