{
 "title": "Psychotherapy Trip #10 - Human Dignity",
 "author": "Psilocybe",
 "citation": "   Psilocybe. \"Psychotherapy Trip #10 - Human Dignity: experience with Mushrooms (ID 48918)\". Erowid.org. Dec 18, 2007. erowid.org/exp/48918",
 "substance": "Mushrooms",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "48918",
   "Male",
   " ",
   "Not Given",
   "Dec 18, 2007",
   "3186",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I want to share one facet of my trip, as I deem the rest of the trip too personal to be disclosed on this public message board. What I want to share is my realization, on a cellular level, what the word Dignity means, and what it means when that dignity is taken away from us humans. This experience made me surrender to the horrors of the most humiliation and degridation that my mind has ever known. I was forced to be stripped of any sort of self worth whatsoever almost hitting the 'cosmic bottom' of existence. It was the most intense experience of my life.</p><p>I realized on a cellular level that I have never actually harbored any Dignity for myself, None whatsoever in my real life. The fact that I had to experience, on a cellular level, not only my lack of Dignity, but the Humiliation and suffering of the Human race as a whole, was the absolute Maximum I have ever suffered in my life. This Trip took me to hell and I accepted all of it. I fought not once. I was in hell.</p><p>Once I was completely humiliated, I took the role of a Teen-Age woman in a concentration camp during WWII. She had the words 'Feld Hure' (field whore) with SN A135633 Tattooed between her breasts. She was 'recruited' in the concentration camp to -pleasure- the German men coming to have some fun before they go back to the fighting on the front lines. She was instructed to Smile and be happy, If she was reported 3 times for not being this way, she would be killed. I felt the absolute Mother Fucking Moral Degridation and Fucking Pain and mother fucking suffering of that woman. My God. I also felt what the Nazi soldier Fucking her shamelessly was feeling. And I was also able to look at the whole insanity of the situation from the 3rd person, as a complete outsider.</p><p>I have never cried so hard and uncontrollably in my life. I picked up a movie entitled 'The death camps' with a picture on the cover. The picture was the men in the concentration camps, the looks on their faces. I cannot describe in words the absolute fury and insanity I felt for any Man or Woman throughout time who has had thier DIGNITY stripped away from them. At that moment I became a Fighter, I am not a light worker anymore. I am a light Warrior. At that moment 'My adventure of self discovery' ended.</p><p>It has become an evolutionary step for mankind. I am going through this pain and suffering for all those people you see in amnesty international files. Those people who have been torchured, oppressed, and thier dignity stripped from them. I continue this Journey For Humanity not for myself. For My Brothers and Sisters. I am a light warrior.</p><p>I feel like shit today, but I'm enrolling back into school. I have Dignity God damnit. And I will graduate not so much for me, but for my fellow man who has never had the chance at education. For Trancendence of ignorance and a push towards a higher Realm of existence. I will continue doing this for Mankind. I have no hope anymore, I realized it was fake magical thinking. I will just exist and be pushed and pulled wherever. But I will still be here, And I will have DIGNITY.</p>"
}
