{
 "title": "Glory Before The Morning",
 "author": "Rafiki",
 "citation": "   Rafiki. \"Glory Before The Morning: experience with Morning Glory Seeds (ID 4895)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4895",
 "substance": "Morning Glory Seeds",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "13.5 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4895",
   "Male",
   " ",
   "Not Given",
   "Jan 10, 2002",
   "Views: 9475",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI would like to relay to you all the experience I had last night with morning glory seeds. During the day I purchased a beautiful pepper grinder and 9 1.5gram packs of Burpee heavenly blue morning glory seeds. I got home, cleaned the grinder, washed the seeds, and began grinding. </p><p>1 hour and 15 minutes later I was finished - what a tedious chore. I now had sitting in front of me a large plastic cup with a fine powder of morning glory at the bottom - 13.5 grams to be exact. </p><p>I poured 8 ounces of distilled water over the seeds and covered the cup with plastic wrap. I then set the cup in the refridgerater - making sure to shake every 15 minutes. </p><p>2 hours and 15 minutes later I strained the liquid and discarded the seed pulp. Bottums up. </p><p>I quickly downed my brew, it didn't taste nearly as bad as I had expected. I drank a glass of orange juice to wash it down. </p><p>I began to feel light headed and very 'full' after 15 minutes. I began getting tingles. These tingles advanced to what I would call 'hella tingles.' Shapes started to morph and shadows shook - as when you have a candle lit. I saw a tree in the middle of my living room and it disappeared after some strange animal jumped out of it. At this point I was quite apprehensive, for I was starting to trip hard and it was only 30 minutes into the trip. </p><p>I was nauseous and getting cold flashes so I turned up the heat and went into my room to listen to music and lay in my bed. After some time of arranging the light content of my room to a comfortable level I laid down and tried to avoid throwing up. </p><p>I was getting out of bed and going to the bathroom to urinate literally every 10 minutes - laying in bed wasn't working, I was still cold and had to get up to often to piss. I thus came up with the idea to lay in the bathtub. </p><p>I was very proud of myself for choosing the bathtub and felt almost as though I had discovered something wonderful. In the bathtub I was able to control my temperature easily, urinate without having to move and throw up - if the need arose - without ruining clothes and sheets. </p><p>The water felt magical on my body and at times it felt like the droplets of water running down my back were cold fingers. The nausea was gone and I was in a state of tranquility. I found my thoughts were dancing around my head - not racing, but dancing. </p><p>After some time of contemplating life and reality in the tub I came to the following conclusions: </p><p>1. I can sleep on my head</p><p>2. I am cat</p><p>3. I am a big ball of dirt</p><p>4. I am a water molecule floating about without a care in the world </p><p>I got out of the tub and went back on the computer where I entered T3P IRC chat. The insanity was obvious. Everyone was everyone else yet all one. People were speaking of hilarious yet mind blowing things. </p><p>Here are some of the things I said in #dxm last night ( thank god for logs ): </p><p>[02:35] the dentists are rosebushing christianity</p><p>[02:35] lol</p><p>[02:35] you are fun</p><p>[02:35] people</p><p>[02:35] of earth </p><p>[02:36] you are all one big mutant murple being the color of fun man </p><p>[02:40] i turned into a water molecule and went into the ocean</p><p>[02:40] then turned into a phish fishing for balls of dirt </p><p>[02:42] i am a cattitucas monkeiest ballio dirtobal </p><p>[02:44] you cant trip on jaguars</p><p>[02:44] the car maybe</p><p>[02:44] but not cats </p><p>[02:52] jesus rises again. to the beat of viagra</p><p>[02:52] and loves all the children </p><p>[03:11] same here koma</p><p>[03:11] but my balls are being fucked by mimes </p><p>At this point I left the channel and went to IHOP. There was a football team there preparing for the superbowl, I think they were the Baltimore Ravens. I tried to eat but got very nauseous and almost vomited. I went home and went to bed. I went to sleep at 5 am. </p><p>Overall I learned that morning glories are a tool. It is obvious why Native American cultures used them - they can be fun, but only after you learned the lesson they were meant to teach.</p>"
}
