{
 "title": "Thanks Ecstacy",
 "author": "Older Wiser Man",
 "citation": "   Older Wiser Man. \"Thanks Ecstacy: experience with MDMA (ID 4897)\". Erowid.org. Jan 29, 2001. erowid.org/exp/4897",
 "substance": "MDMA",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1992",
   "ID: 4897",
   "Male",
   " ",
   "Not Given",
   "Jan 29, 2001",
   "Views: 77816",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIn 1991 I discovered the rave scene.  What can I say it truly took my breath away and nothing could have prepared me for it.</p><p>People from all races, rich and poor dancing together under one roof whereas in years past some of these people were kicking the hell out of each other.  The rave scene was incredible and I do believe that it did and still has a massive hold on our particular generation.</p><p>When attending raves I would often just smoke marijuana and drink alcohol and I still had a buzz but many of my friends were in to Ecstacy at that time.  I had seen the press articles about Ecstacy at the time and this had scared me in to not taking pills with them and besides I had a good time just smoking some reefer and chillin'.</p><p>Eventually curiousity got the better of me.  I was just seeing that week after week what an incredible time my friends were having Rolling on E's and unlike all the Press and News 'Scare Stories' I had seen at the time that my friends were taking E's every week and NOT dying.  In fact it looked as though they weren't coming to any harm whatsoever.</p><p>So in 1992 I took my first E along with them.  I had an incredible experience.  My friends couldn't drag me off the dancefloor.  I was going mental all night dancing on the stage, watching other people moving to the beats, my friends felt like more of a friend than ever before (and I had always got on with them really well anyway), we had deep conversations.  It was absolutely incredible.  It was breathtaking.  I had to work the next day and I was amazed at the fact that I did not have a hangover or a come down of any kind.  </p><p>The 1992 experience of my first E started a 6 year habit of dropping at least 3-6 pills almost every weekend at a local club (2-3 on Friday, Another 2-3 on Saturday).  6-10 pills in one night for Christmas, New Years Eve and Festivals.</p><p>My first bad experience came at a large summer music festival I went to in 1997.  I had taken 10 pills by 5am as the festival was winding down and up until this point I had an unbelievable night.  Again I was dancing like a madman and soaking up the sounds and the vibe of the people.  </p><p>Now some people may say 10 pills you are asking for trouble and you would be right but after 4 years with little or no side effects and being young I thought 'I am Immune, I can take as many of these pills as I like and nothing bad will happen to me'.</p><p>I met up with my friends at 5am to make the journey back home as the festival was now winding down.</p><p>My previous feelings of euphoria, urge to dance and general friendliness towards other people came crashing down within minutes and turned in to extreme paranoia and I would say maybe even agression.</p><p>I started thinking that people knew I was on an E and that they were all talking about me rolling and criticising me(in reality of course most of them were on E themselves).</p><p>I was shouting at them.  I was hurling abuse at them.  I was so convinced that they were talking about me. My friend had to calm me down.</p><p>I waited at a train station to catch a train home. I sat on the train station platform on my own because I was so paranoid being around other people (my friends and other festival types were downstairs in the train station cafe).  </p><p>The next train home only took around 10 minutes to arrive but it seemed like hours.  </p><p>I was convinced that some cleaners that were on the train station platform knew that I was on E and that they were going to report me to the police and I was going to be arrested (ridiculous looking back on it but it 'seemed' so real).</p><p>Apparently (according to my friend - who was coming down at this point and really didn't need this) on the train home I was still swearing and shouting at anyone and everyone and was convinced that they were all talking about me rolling on an E.  I was even coming out with 'speeches' to strangers (who weren't interested in reality and probably wanted to get off the train and away from me as soon as they could !!) justifying why I was on E in an effort to try and counteract their criticism.</p><p>The next day when I came down I had uncontrollable shaking, sweating and twitching and for the next week I was a wreck - paranoia, terrible mid-week 'blues'.</p><p>Now most 'sensible' people would have curbed their use of E at this point and maybe start thinking to themselves 'Maybe I've done too much'.  Did I do that ?  Hell no.  I kept repeating to myself the tired old lines 'I did too many pills that night, I'll cut down' and 'It's only one bad experience'.</p><p>I continued on the weekly cycle reducing my pill intake to 2-3 week.</p><p>Meanwhile (without me noticing) my depression and paranoia was getting worse.  My friends kept trying to point it out to me but I just kind of 'brushed it off' or ignored them.</p><p>Eventually in 1997 it finally hit me how the drug was affecting me (I began to realise my cycle of depression and paranoia) and I decided to call it a day and say goodbye to the love drug - ecstacy.</p><p>2 weeks after quitting I had what can only be described as a 'panic attack' at work.  It was bizarre ..</p><p>I was working as normal on my computer at work and chatting to one of my work colleagues.  Suddenly I couldn't hear what my work colleague was saying clearly any more or I couldn't concentrate on what he was saying.  Coloured SpotLights and Balloons started appearing above his head at first and then all over his face masking it so I could not see it anymore.</p><p>I turned away from him and tried to calm down and continued to work on my computer.  The text in my computer screen suddenly turned in to what can only be described as a Garbled, Swirling Pattern in effect ensuring that I could not read the text on screen.  It looked 'mashed'.</p><p>I suddenly burst in to a cold sweat and had trouble breathing and my heart started racing.  I became slightly paranoid.  I wondered 'Is anyone noticing me like this or is it all in my mind ?'.</p><p>I quickly ducked in to the toilets, locked myself in there for 5 minutes or so and splashed my face with water several times and tried to calm myself down.</p><p>I couldn't believe what was happening.  I thought 'Why is this happening ?  I have quit drugs now'</p><p>I was still shakey and was sweating a lot for the rest of the afternoon.</p><p>I still can't explain to this day what caused this ?  I don't have any ideas ?</p><p>After stopping E the paranoia wore off after a month or so but the depression and boredom remained for around 6 months.  That 6 months seemed to go on for ever.  It was like I had lost something deep inside and that it was never ever going to return.  </p><p>I wondered if I was going to feel that low for the rest of my life ?  I even had thoughts of taking my own life although I had the will not to carry them out.</p><p>Now after being clean for almost a year and a half now it is only now that I can see that I feel like my old self again and that things are returning to normal.</p><p>Some of the experiences I went through while on E were fantastic and incredible and I would say life changing.  I still love the music and buying the music (both old and new) has become my new obsession.  I can listen to a track and still remember what I felt. It triggers so many good memories and feelings.</p><p>Other experiences have scared me so much that I would never ever touch another E again.</p><p>This is just my experience told as honestly as I can.  Take what you will from it.  It's not a scare story and it's not an endorsement to take E story.  It's just my story.</p>"
}
