{
 "title": "Bathroom Asylum",
 "author": "EL",
 "citation": "   EL. \"Bathroom Asylum: experience with Salvia divinorum (ID 48975)\". Erowid.org. Feb 24, 2008. erowid.org/exp/48975",
 "substance": "Salvia divinorum",
 "bodyweight": "128 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 48975",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 24, 2008",
   "Views: 2428",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had read about Salvia online. It sounded interesting, and the fact that I hadn't ever taken a hallucinogen before made me want to do it more than ever.</p><p>I bought some.</p><p>Came home.</p><p>Loaded my hand-bong.</p><p>Torch lighter.</p><p>...gone.</p><p>I was in my small tiled bathroom. One large completely tiled Shower and one large Mirror were the main points of the room. Instantly, even as I'm setting the bong down on the counter, I could feel the electric surge of toxin pulse through my body. I could almost see it. I look up, into the mirror. The tile all around me look like hundreds of tiny hallways. Each going deeper and deeper. I stare at myself in the mirror, barely able to stand up, yet feeling like I'm floating instead of about to fall. As I stare at myself in the mirror I assume that I am looking at a patient in an insane asylum. I cannot speak, no matter how hard I try. It is imposible. I forget what words are made of, and end up barking at myself. I soon realize that this is not right, and bark louder, almost moaning. I'm trying to make myself speak.</p><p>I give up. Its a lost cause. So instead, I turn around, strip off all of my clothing and curl up in the shower that I had turned on ahead of time. I wasn't sure if I would be able to operate it once I was gone. I'm sitting with my knees to my chest as the water pours on me. It feels like sand. It starts ripping through my skin, and hundreds of little people crawl out of me and dance on the floor. At this point I am starting to become more and more afraid of what I had done and was wondering if it ever would stop. electricity was pulsing through me, and all outlines were sparkling. The square tiles start moving around me in a very uniform fashion. They move faster and faster until I cannot stand it anymore and just close my eyes. </p><p>I am floating in space and wondering what the hell happened. I thought my memories were being pulled away from me so I clench my eyes tighter and do my best to not lose track of them. As if they were folders of some sort. In an instant, I'm on my bed, wet. The shower is off. Music is playing, and I'm dressed. I don't know what happened, but I am convinced that it wasn't me who took me out of the shower. I am off my peak, and rapidly regaining normality. My heart races, fear pumps through my veins, and I try to stay wide awake all night in fear of not waking up if I shut my eyes.</p><p>Somehow I wake up the next morning.</p>"
}
