{
 "title": "Neither Here Nor There",
 "author": "K",
 "citation": "Citation:   K. \"Neither Here Nor There: experience with Cocaine & Cannabis (ID 49008)\". Erowid.org. Feb 27, 2008. erowid.org/exp/49008",
 "substance": "Cocaine & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 49008",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 27, 2008",
   "Views: 10958",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBefore I start, a little background on me: I'm a 21-year-old college student. I consider writing and music to be my two livelihoods. I drink fairly heavily on occasion, although probably not that much by college standards. I smoke pot probably about once a week on average; sometimes I'll smoke every day for a while, and sometimes I'll go weeks without smoking. I smoke cigarettes very rarely, usually when I'm using some other substance. Lately I have been in a somewhat experimental phase, trying a number of substances that I don't plan on using regularly at any point. These include various painkillers, some amphetamines, a high dosage of Dramamine, and most recently, cocaine.\r\nThe experience occurred when I was at my friend Wilson's house with him and my friends Pete and John (not their real names). We were the only ones there except for Wilson's younger brother. Wilson, who was selling weed at the time, packed a bowl for himself, John, and I (Pete doesn't do any drugs). We smoked a fairly large bowl, and it was pretty dank stuff, so I was stoned within a few minutes but still completely coherent and functional. We sat around listening to Xiu Xiu and Leonard Cohen for a while, just relaxing and enjoying our high. After a while, John told us that he'd acquired some cocaine and wanted to try smoking it in a bowl with some pot. I was previously unaware that you could do this. Wilson was up for it and they asked me if I wanted in. I hadn't really given much thought to trying cocaine or researched its potential effects like I usually do before I try a new drug, but I figured that I was in a safe environment with a sober person present, so it wouldn't hurt to try it. \r\nWe smoked another good-sized bowl with some coke sprinkled onto it (I don't know the dosage size, sorry). Before we even finished smoking the whole bowl, I noticed that I was feeling much more alert than usual. Normally when I smoke, I become very perceptive to the things going on around me, but this was a different kind of experience in that things didn't feel as generally pleasant as they do when I'm just stoned. I had already decided at this point that I wasn't a big fan of cocaine. When we finished, John noticed that he had spilled some coke onto the table, and asked if I wanted to split it with him and snort it. Since I didn't really plan to try cocaine again for at least a pretty long time, I decided to go ahead and do it and get the full experience. Once again, I have no idea as to how much I insufflated, but he assured me that it was a standard amount to be snorting. I inhaled it through a rolled-up dollar bill and immediately felt a jolt as if I had been suddenly shaken awake. I thought to myself that this was going to be an interesting night.\r\nWe listened to some more music for a while, specifically Kid Dakota and Ugly Cassanova. Then we decided to get out some guitars and jam. All three of us were clearly feeling the effects of both substances, and we spent the next half hour or so taking turns improvising on two guitars while the third person drummed on a table or used a large PVC pipe as a makeshift dijeridoo (sp?). Pete was watching us and joked to Wilson's brother, 'This is what drugs can do to your life. Look at them, smiling and laughing and playing music. Is that how you want to end up?' So far so good: I was feeling really alert and jacked-up, but also experiencing the inspirational effects of the pot.\r\nAfter a while, I left Wilson and John to go play pool with Pete in the other room. For some reason, I was suddenly amazing at pool: all the geometry of the game made perfect sense in a way that it never had, and I dominated in nearly every game. At the time, I attributed this in some way to the coke, although I'm not sure if there was an actual correlation. At the same time, though, I started feeling some adverse effects. The alertness that had been fairly cool before started to instead register as an oversensitivity to stimuli that ordinarily wouldn't bother me. The sounds of the balls hitting each other seemed inordinately loud; any sense of itchiness, rather than being a mild nuisance, was simply unbearable; I kept sniffing and rubbing my nose; and, the lights and colors in the room seemed glaringly bright. It wasn't enough to make me call it a 'bad trip' or what have you, but I was definitely starting to question what the positive effects of the drug were supposed to be. I suspect that these experiences would have set on much earlier, but that the calming experience of the pot had canceled them out. \r\nThe other three guys went to sleep in a few hours, but I just couldn't, and for some reason I decide that it was a good idea to drive back to my house 20 minutes away at around 4 in the morning. I am not sure what motivated this decision, as I spend the night at Wilson's regularly. When I got home, I climbed into bed and slept for a few hours, but when I woke up, I was unbelievably fidgety and just could not get comfortable. I was shifting and turning constantly for what felt like hours. At this point, I had decided that my experience with coke had been an essentially negative one. Eventually I did get back to sleep, and when I woke up, I felt fine: no negative after-effects or anything like that. \r\nI certainly don't regret my experience with cocaine and it was very interesting, but I don't see it as being something I would ever want to do recreationally or on any sort of semi-regular basis. It didn't suck, but it wasn't particularly good either, and I can't imagine it being something I would ever come to actively enjoy. My purpose in writing this is to offer a rounded first-time report that is neither especially tragic nor laudatory.\r\nI'll stick to pot.\n\n\n"
}