{
 "title": "Please Don't Take It All",
 "author": "mr jingles",
 "citation": "   mr jingles. \"Please Don't Take It All: experience with Buprenorphine (ID 49019)\". Erowid.org. Mar 9, 2006. erowid.org/exp/49019",
 "substance": "Buprenorphine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   "oral",
   "Pharms - Buprenorphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49019",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2006",
   "Views: 26787",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have tried various substances, including many opiates, so when the chance to try suboxone came up, naturally I accepted. I took home the little orange pill and broke it into four equal pieces. Each about two milligrams. I took one piece and it tasted like chemical oranges, nasty, but hey, they're trying. </p><p>About 45 Minutes later I felt that odd sensation that comes with a rising opiate high, the feeling that everything is slowing down. I continued to watch tv. About 20 Minutes later, I realized I was in for a ride. I recall getting up and being suprised at how strong it was. I had set up a comfy spot to lay down on so I laid down and closed my eyes. After laying for a while, I realized I needed to be in the dark, as the light was somewhat irritating. I shut off the lamp, layed down and played some bob marley. I felt warm and fuzzy, and as though I was floating off the bed. I kept telling myself that I couldnt fall asleep, sounds faded in and out. I eventually did get to sleep once I let my guard down. The next morning I felt sick, I immediately ran out of bed and to the bathroom and threw up, the rest of the day I felt somewhat tipsy. I only have one thing to say for someone trying suboxone or a similar med. BE CAREFUL!! it is strong. Only take small amounts, unless of course you are told otherwise by your doctor (if its being perscribed).</p>"
}
