{
 "title": "End of a Vial",
 "author": "guy",
 "citation": "   guy. \"End of a Vial: experience with LSD (ID 49021)\". Erowid.org. Feb 20, 2008. erowid.org/exp/49021",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49021",
   "Male",
   " ",
   "Not Given",
   "Feb 20, 2008",
   "Views: 4002",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wish I had a better idea of how much I actually took which is partially why I'm writing this report.  I had not used acid in approximately six months, and the dried up end of a vial was given to me as a gift.  The giver reported a very weak experience from the liquid squeezed from the dropper, and he assumed what remained was even less concentrated.  No preparations were made in advance, and thankfully I was at home where my roommate also was. </p><p>At eight pm I bit the top off the dropper and chewed on it while I reconstituted the dropper with water and drank it all.  I repeated this twice more to be sure nothing was left behind, and then went about some household chores.  One half hour later I felt abruptly disoriented, with a perceived loss of balance.  For fear of falling over and hurting myself I sat down on my couch as the room started to spin out.  Within a half hour of the onset I had reached what I would later realize to be the peak.  I was sweating so profusely that it was pouring off of my face and I could collect it in pools in the palms of my hands. I experienced intense visual, and auditory hallucinations.  Mentally speaking the only uncomforting thing was that I didnt know how deep I was going to be going until I had began to come down.  Because this was my first and only encounter of this magnitude I felt a good deal of anxiety in the sense of not knowing at the time if I was going to be alright afterwards.  These feelings along with the intense perspiration subsided with the most intense part of the trip in about one hour.  Even then I wouldnt call it a bad trip.  (I can imagine feeling similar anxiety if I were to try skydiving for the first time. In that sense I see it as a potential personal fear of radically knew experiences. Although I might have felt scared at the time I would consider it one of the most enjoyable experiences I have ever had.) </p><p>Being veterans day I watched a war movie with my roommate which was mentally very intense in terms of how vivid and lifelike it was, but I experienced no feeling of terror.  I found it difficult to sleep at about one a.m. as I was still experiencing visuals.  I layed there in my bed for another hour or so tossing and turning before I fell asleep.  Unfortunately I had to work bright and early the next morning, and with my alarm at five a.m. sharp I awoke to find I was still experiencing full visuals.  My only point of reference is that I was still tripping harder than I had on any other trip.  At work I experienced feelings of disorientation, and confusion along with difficulty concentrating. Visuals had subsided by nine a.m. and my body still felt lifted until aproximately noon.  I was told the type of acid I had was called silver surfer, but I cant verify this.  I appologize for any unuseful information included. If possible I would be interested in finding out approximately how much I had.  </p><p>Thank you for this opportunity to relate my experiences, and have a nice day.</p>"
}
