{
 "title": "Talking to Mother Nature",
 "author": "Captain Pistachio",
 "citation": "   Captain Pistachio. \"Talking to Mother Nature: experience with Mushrooms & Cannabis (ID 49052)\". Erowid.org. Sep 25, 2007. erowid.org/exp/49052",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 5:00",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "49052",
   "Male",
   " ",
   "Not Given",
   "Sep 25, 2007",
   "3074",
   " "
  ]
 ],
 "report": "<p>My friend Noodles is waiting for the right time for he and I to eat psychedelic mushrooms. He has one previous experience with them in some mansion. Noodles talks fondly of this time. I have yet to eat these mushrooms. On one fine spring day Noodles decides that this is the day he and I shall eat magic mushrooms. This day is indeed filled with this season's best atributes: sunshine, crisp air, blooming foliage, verdure all around, and a perfect temperature of roughly seventy degrees.</p><p>It is good to note that this spring day is on a Friday. At the beginning of this week Noodles and I begin to fast. This is that we only eat fresh and raw fruits and veggies. We also drink water only. Noodles and I fast until our fine spring Friday.</p><p>The purpose of our fast is to purify our spirit, mind, and bodies before our psychedelic experience.</p><p>Noodles and myself are in his college room when we decide to prepare for our mushroom expedition. My friend packs a backpack with the following items: An orange, some swiss chocolate, a plastic egg of silly-putty, and a shiny pin-wheel of the American flag. The last item is simply for our inside jokes on patriatism. The sun is shining chatoyantly in Noodles's room when he suggests that I go out and purchase the magic mushrooms. I walk down my friend's college building out to a quad area. </p><p>Sitting on a pick-nick table are a group or six friends and associates of mine. They are all selling various substances. I approach them to inquire about some psychedelic mushrooms. A hippie friend of mine pulls out a quarter bag of shrooms and sells them to me. This is for $60.00. The mushrooms all have medium to small caps. The stems of them are relatively thin. </p><p>I walk back up to Noodles's room. We close the door to his place and calmly sit upon his bed. Noodles and I open up the bag of magic shrooms. We split the caps and stems between us evenly. Most of the caps are of a smaller size. Noodles remarks how this is a good thing. This is as he finds that smaller caps are more potent than larger ones. The sun is shining through Noodles's room window onto our faces. He looks at me and we both indulge in our psychedelic mushrooms. As we chew them I have an almost giddy anticipation of what is to come. It is good to note that Noodles and I have a friend with us at this time who is sober. He is a close friend and reliable. Noodles and I call him Gumdrop. He is coming along with us wherever we go and making a log of our time. More importantly Gumdrop is also going along with Noodles and I to ensure that our psychedelic mushroom experience is safe. </p><p>So my friends and I walk out of Noodles's room, past the quad and head for the art department of our college campus. As we walk towards this side of our campus I do not feel a thing. This is roughly fifteen minutes after eating the shrooms. Noodles, Gumdrop, and I are walking on a large area of fresh grass. All of a sudden I feel something. This is a butterfly-type tingle behind my ears. I look down at the grass and something is different. There is a light crisp breeze outside. The grass is as the ocean. Families of earth-worms are moving in and out of the grass as dolphins and whales do in the sea. This scene is beautiful. Soon I am near overwhelmed with joy and a sense that nature is more alive than I am normally conscious of. An enormous smile paints itself across my face. My cheeks flush a rosy red. </p><p>I inform Noodles and Gumdrop of my observation. They giggle a bit and nod. I notice that Noodles face is flushed and is overcome by a great big grin. His face glows with the joy I know is within my dear friend. A powerful sense of love is present between Noodles, Gumdrop, and myself. My friends and I head over to a swing right by the art department. We start to swing when I look at Joe. His smile is somehow getting bigger and growing. I ask him to stop as I laugh and he says, 'What?'. This is with wit and overwhelming humor. I turn away, laugh, and again repeat my request. He repeats, 'What?'. I look back at him and all of a sudden Noodles is a clown and flames are firing all around us. 'Shit!', is my response. I turn away and ask my friend to stop. 'Okay,', he says. Looking back at Noodles his face resumes the loving grin of friendship I know. </p><p>My dear friend, Gumdrop, and I notice a mother pushing a stoller with a baby in it. She is walking across our campus. 'We can not let her see us like this,', I say. 'Why?', Noodles replies with a glowing smile. 'Because look at our faces. *giggle* We look absolutely absurd! *laugh*'. Noodles laughs and says, 'Alright, alright.'. We are both wearing hoodies. Noodles and I place our hoods over our glowing faces. Our enormous smiles are still visible with our hoodies on. Gumdrop, Noodles, and I head across a street that leads to a river. This is where it is most handy to have a sober friend watching his two tripping buddies.</p><p>As Noodles and I cross the street it feels like we are going so slow. Cars are zooming by and we are giggling along. Noodles and I feel great and are laughing. We are still moving so slow. Luckily Gumdrop catches this quickly and aids us safely across this street. Noodles and I look so silly crossing the road. He and I have our hoodies over our heads with two glowing grins exploding from our hoods. Soon we are across the street. Gumdrop, Noodles, and I end up in a parking lot that is just behind the river we are heading for. </p><p>I look down and all of a sudden there is green acid pooling all around me. There are those orange tags and blocks that are used to block off a part of a road when it is under construction. These are all around me. Soon the acid is up to my neck. Gumdrop grabs my arm and says, 'Hey. You okay?'. I laugh and the acid and road blocks are gone. 'Yup.', I giggle. </p><p>Noodles pulls out the plastic egg of silly putty and gleefully hands it to me. 'What is this for?', I ask. Noodles says it is fun to touch it when tripping. I open the egg and begin to smoosh the putty with my fingers. All I can say is that it feels so good. I laugh out loud and feels absolutely giddy. I smoosh the whole putty glob onto my right thumb and hold it up. 'I think you should hold this too,', Noodles says. He hands me the pin-wheel. The sun shines on it's metalic colors of red, white, and blue. The light flickers off the wheel chatoyantly as it spins in the crisp breeze. The red, blue, and white colors form into a sort of a metalic purplish color as it spins. 'Smile!', Gumdrop says. He takes my picture. My hoodie is by now off my head. My right thumb has a teal glob of putty on it and my left hand is holding the spinning pin-wheel. </p><p>Noodles, Gumdrop, and I head for the river. We walk out of the parking lot and head into a verduous setting by the water. Gumdrop, Noodles, and I sit down among straw, grass, and other plants that live by fresh water. The straw is up to my chest. All of a sudden I look up and see the sky. It is tye-dyed blues, purples, whites, and oranges. Usualy this would be corny or tacky me. However the aesthetics of this tye-dye are incredible to me. 'Now I know why Jimmy Hendrix kissed the sky!', I say. Next I begin to trip relatively firmly and I am not sure exactly what I see. However Gumdrop has documented this. He has something down to this affect: I say, 'The sky is all purple and shit and Gumdrop you are like a psychedelic DJ just masterfully doing your thing!'. </p><p>Noodles has been staring at the river since we have been sitting down. He says it is alive and talking to him. Noodles is silent and beaming with so much happiness tears are welling up in his eyes. 'Laugh and the whole world laughs with you. Sneeze and it's good-bye Seattle!', I say. I begin laughing hystericaly. So does Gumdrop and Noodles. Tears are pooring down my face. I repeat this line from 'Roxanne' simply because I just know it is perfect to say in the moment. All of a sudden I look at the sky. I am not sure exactly how to say this what happens.</p><p>Mother nature comes to me. She is not just the sky but also the earth, the river, and life in general. Everything around me is so alive! 'Hi,', she says to me. I pick up a blade straw and use it as an organic-psychedelic-microphone. 'Hi,', I repeat. Mother nature says, 'We love you. We always have.'. The sense of love I feel at this point is overwhelming. I begin to cry with warm joy. My face and whole being are comfortable and at a really nice temperature. Mother nature says, 'We have always been here. We will be here for anytime that you want to talk to us.'. The loving feeling I get from Mother nature is so strong it feels cleansing. I feel so clean, fresh, and loved. I look at Noodles and he is crying by the river. He says it is so beautiful.</p><p>I suggest that we go back to campus. By now it has been roughly four hours that Noodles and I have been under the influence of magic mushrooms. The sun is setting and the air is cooled to roughly sixty degrees centigrade outside. Noodles asks to be left alone by the river to take in what he has been experiencing properly. The tears are streaming down his rosy cheeks. Noodles says that he feels like an enormous burden has been lifted from him. 'Everything is going to be alright from now on,', I tell him. Noodles nods with his flushed face. 'We'll be back on campus,', I tell him. Noodles nods again. This time he has his knees pulled up to his chest and his arms wrapped around his legs. He is looking pentitively at the river. The prasmatic colors of the setting sun are painted on Noodles's face.</p><p>Gumdrop and I head back to campus. I give him a hug and tell him that everything is going to be alright from now on. With my arm around his shoulder we head back to our college. My friend Gumdrop and I stop by my room. He hands me some of passion fruit juice he picks up from somewhere. I take a sip and it feels orgasmic going down my throat. Gumdrop and I are on my bed. I lay my head against my wall and it goes right through. This is as if the wall gives way as an organic substance to my head. I pull my head out in awe.</p><p>I tell Gumdrop to meet me in Noodles's room. We both head out my room. Gumdrop heads out to Noodles's and I head to my girl-friend's room. I walk into her place and she is on the phone. My pupils are as black as a bunny-rabbit's. I ask her frequently about what her life's dream is. She is reluctant and then tells me it is to own a restaurant. I tell her that she should go after it. She blushes. Eventually I tell her that I am shrooming. Initially she does not believe me. However upon further convincing she does. She escorts me back to Noodles in her boxer shorts. My girl-friend knocks on my friend's door. 'Enter,', chimes from within the room. She opens the doors and bubbles are blowing all around the room. Noodles is smiling with his rosy flushed face. Gumdrop is sitting on his bed blowing bubbles all around the room. My girlfriend sits and stays for a while but the atmosphere is a bit overwhelming for her. So she leaves us to our own plans.</p><p>Noodles offers for us to smoke a bowl or two of some very fresh and sticky Mary Jane. The nuggets are gum-ball sized and have red and white hairs protruding from them. The Mary Jane smells fruity and and fresh. Noodles explains that smoking just before coming off of shrooms heightens the experience a bit. So he, Gumdrop, and I all smoke two bowls of MJ. The smell of the marijuana is so good. Noodles, Gumdrop, and myself chat the night away about life and how the mushroom experience has affected us. Noodles and I jam fluidly on our acoustic guitars. We spout out reminants of Smashing Pumpkin songs mixed in with our own stuff. </p><p>The week following this day has a fresh, light, and up-beat feeling about it. Since this fine spring day I have this feeling that something about my life is going quite right. Maybe it is an internal aspect. Perhaps this feeling is just aesthetic. However I feel better since my first shroom experience with Noodles and Gumdrop. These are two of the finest friends I have ever had.</p>"
}
