{
 "title": "Grateful Response",
 "author": "Picture of You",
 "citation": "   Picture of You. \"Grateful Response: experience with Anadenanthera colubrina (ID 49054)\". Erowid.org. Dec 5, 2006. erowid.org/exp/49054",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "1.31 g",
   "insufflated",
   "Anadenanthera colubrina",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49054",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 5, 2006",
   "Views: 5895",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>BACK GROUND</p><p>Ive been looking for certain answers that were hard for me to understand and to define in my life. This really serious research started like a year ago (november 2004) it was practically based on finding the missing link with the source. After a very mind opening experiene with psilocybe cubensis I understood that ecstasy (the counciousness state obviously) or psychedelia was the only door for 'men trying to go further'. After different expieriences with salvia, bufo alvarius poison, morning glory, jurema I didnt felt identified with any of theese common alies. So after researching a little bit my andean roots I got to the snuff yopo wich is really unknown in south america by civilized or urban people.</p><p>I got some beans and tried sniffing the plain grounded beans wich several times it only produced a nasty taste and a running nose. after more research I found that the grounded beans need to be toasted like popcorn before grinding them. Once grinded I needed to basify it with baking soda in a ratio of 2 parts of vilca to 1 of baking soda. After mixing I crushed a little more till the mix is a little more pastel. After doing that process I made 3 long thick lines and snorted as much as I could got in wich ended up being 1.31 grms  (2 lines of the 3). </p><p>SET</p><p>My mind by the time was very clear and I had a few of meditation of my goals in the experience but nothing really defined. Which I guess made it interesting because during the onsett all my questions and doubbts got in to an automatic importance list  that fits my requirement and fits my needs. I had a rough night the day before with a couple of extra beers(nothing outrageous), my body had a kind of hang over (which completely dissapeard after the experience)</p><p>SETTING</p><p>The experience took place facing the north at 9:00 p.m. in a closed space lying on a couch. Since the experience is mostly within ones self the outer visual stimuli didnt affected me much. What I felt extremely enhanced was my olfatory system.  I am almost sure an incense or some sage would be of great delight during it. Also the music was a guide during the further lands you go so pic a meaningful and enjoyable album(relaxing preferably).</p><p>THE TRIP</p><p>Once I had the substance in I was not expecting too much with the experiences before (actually the taste was better now) but affter a few second I started feeling a little numb in the head but with a rush in the body so intense that kept me still. </p><p>T+3min Suddenly a explosion of light and patterns took me to nothingness. This place was very similar as the sea of holes in yellow submarine eventhough my mind was in a complete clear perception, almost as reseting the memory of a pc. The plant showed itself with a male voice asking me the questions that were bothering my head and started explaining each one with short sentences very vividly heard and with emotions very deep inside ending up in a complete loose of ego.</p><p>T+5min The intesity was far beyond what I had expected, I could not handle the snuff in my nose anymore so I cleaned my nose and almost simultaneously I felt this nausea wich ended in a self produced vomitin just to make the nausea go. Affter doing all that in the bathroom it hitted again, I just managed to pull a blanket and gulp some water wich felt like the best in my life.</p><p>I layed on the couch listening to shpongle spores with an incredible lucidity in my thoughts and an extreme joy or happines mixed together making my eyes fill with tears apreciating each infamous small thing that touched my life in some sort. The whole experience lasted ONE hour. There are no enough words to explain the need I had for the answers it gave me. I had even said before this experience that life is not worth but now I have a complete different perspective. I will experience more with this beautiful teacher and let you know furher results of comunication with the source.</p><p>ROAD NOTES</p><p>With my earlier experiences with plain yopo I found that the taste is awful and has a lot to do with the nausea afterwards. Something highly recomended is to have a container (mug works well) for the saliva and a big paper towel for the mucus that is produced. Just in case have a bucket around.</p>"
}
