{
 "title": "Death and Rebirth In the Matrix",
 "author": "Ryuuseki",
 "citation": "   Ryuuseki. \"Death and Rebirth In the Matrix: experience with Mushrooms & LSD (ID 49064)\". Erowid.org. Jun 19, 2006. erowid.org/exp/49064",
 "substance": "Mushrooms & LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 49064",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 19, 2006",
   "Views: 7935",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWhile this was not technically my first acid trip (I had tried a single square of the same print months prior with some minor psychological effect, but no visuals) this would be the one that I remembered clearer than anything else.\r\nA lot of this trip stems from ideas presented in the movie The Matrix. While I wish my life changing experience hadnt been based off a Hollywood blockbuster, the associations made are fine by me.\r\nTo establish this trip, I will provide a summarization of some events in my life which I feel shaped the trip. I had begun my first year at university, a feat that took me an extra year of high school and some substantial money saving. It was in November that this event happened, and at that point in time, I was incredibly depressed. I had been dealing with the idea of whether or not to break up with my girlfriend at the time, as I had been cheating on her, and felt terrible about it. The girl I was cheating on her with was, at the time, nothing more than a booty call whom I really showed little appreciation towards. On top of this, my financial situation was horrendous, as I had managed to blow through thousands of dollars on alcohol alone. My life was in a downwards spiral, a testament to the very notion of excessive living.\r\nA few friends had been searching for mushrooms, which thankfully, I had a reasonable quantity at the time. They were to be doing them for the first time. Initially, my roommate John and I had planned to do acid I had purchased earlier on in the year, but he decided against it at the last minute, opting for the mushrooms instead. I believe it was around 7 when I dropped the 2 tabs left, and I also ate 2 grams of dried mushrooms. The potency of these mushrooms were very high, as 1.5 grams had given trips for the full 4 hour range before dying off. Initially, not a whole lot was happening. We sat in our room watching visualizations thanks to milkdrop in winamp, listening to some QOTSA and Nas before finally deciding to go smoke a joint. It was after this joint that the effects began to present themself. \r\nI have always been a fan of science fiction, a technophile of sorts, and it was upon entering the darkened residence, with a foamy green carpet and white walls that the effects began to make themselves known. I reached towards the door handle, and suddenly the green carpet began to present itself entirely in the matrix code. My hand sliced through the falling text, rippling waves cutting through the very fabric of reality. I remarked to my roommate that I felt as though 'I was falling out of phase with reality.' It was after this initial hallucination that we went to play Halo 2. The guys fired up Ivory Tower and hit the lights. Sitting roughly 3 feet away from a 27 inch tv, the graphical prowess of the Xbox made itself known. It felt as though I was plugged in to the character on the screen, although I was not playing. Somewhere in my head, I could feel the visual stimulus being converted into raw neural inputs. \r\nMy eyes began to stare into the television, captivated by the thought of direct neural interfacing, feeling as though Microsoft was on the verge of something huge (this would later lead to some scary schizophrenic conspiracy theories.). I was handed the controller, and initially I tried moving around, but found myself unable to process the motor control skills necessary to play at the time. Earlier on while playing, my friends began to use very specific jargon relating to the game, and the nature of one of my friend's voices (it's a baritone, very resonating and official sounding) made it seem as though they were in some form of military intelligence and the like. \r\nWhen I searched through my mind, I find myself able to communicate with them, without saying a word. I was able to channel myself into a telepathic state of mind, transmitting words wirelessly and carrying on a full conversation. This, of course, was not real, but at the time felt so. I felt like I was on the verge of uncovering a huge conspiracy, one that revolved entirely around the movie the matrix (damn Hollywood.) It felt as though I was hacking the neural inputs placed down the vertebrae, I was accessing things I wasn't supposed to. My friends played dual roles in this, in one hand, they were experienced hackers, waiting to show me how to do this properly. On the other hand, they were agents, forcing me to stay away from this phenomenon, distracting me (it turns out they were distracting me, because they could tell I was going insane). It was at this point in time, that we decided halo was simply too intense.\r\nWe returned to my room, watched a few more songs and proceeded to pack up the hookah and go outside. During the hookah session, I felt myself converging on something huge, an impeding invasion of sentinels. I justified to myself that they were just signs that the controlling forces were onto me, showing me that they knew what I was up to. I began to experience delusional paranoia, worrying about the information that only I had inside of my head somehow being known. Being in a capital city at the time, the sounds of the night were mostly helicopters and sirens, which only aided to my feelings of paranoia. I decided at the time, I could not trust my friends at this point until I was able to actively sort everything out. Especially when I felt as though they were talking to me inside of my head.\r\nI returned to my room with my roommate. I believe the feelings I was about to experience stemmed from a line by nas which stated I never sleep, cause sleep is the cousin of death. I should also note that throughout the night it seemed as though the controlling forces (the machines from the matrix) wanted me to die. And now, I was there, in my room, feeling the incredible urge to sleep (I am thankful I tried, even though I realize the futility in sleeping while on psychedelic drugs.) I stripped myself down to my underwear, as my roommate was present, and climbed into bed. It was there that I pulled myself into a vessel, sheets wrapped tightly around me and eyes closed tightly. \r\nSuddenly I was there, in the tanks were bodies were kept (in the matrix). I could feel the fluids surrounding me, the ebb and flow of warmth. I could feel the dermal implants imbedded along my spine, the sharp pain of needles. Suddenly a cold feeling washed over me, the warm fluid began to drain, and I could feel my life slipping away through my spine. I knew that I was dying, and at this point in time, I began to reflect on my life. I can not describe adequately the infinite sadness that I felt, the regret that I had for my previous actions in life. My thoughts went to friends and family, to the girl I was currently cheating on my girlfriend with. I could see her face, I could feel the pain that I had caused her, and I knew that I wanted to tell her that I was sorry, that I had never truly intended for her to feel that way. I had so much regret, but I was coming to terms with it. I wanted to die being at peace with myself. And as I grew colder, I found myself free of the limits I had put on myself, I was one with everything. My death occurred, and no longer was I bound to the earth by my body. \r\nI was able to transcend every psychological barrier I had put in place so I wouldnt have to deal with problems stemming from my life. I destroyed them, I asserted them so fully that by the time I was no longer dying, I felt as though my entire life had changed for the better. At this point in time, I spoke to my roommate. He acted in analog to the oracle of the matrix, I felt he possessed such a full understanding of things. Once I was able to piece together the notion of the matrix, I began to come to terms with the system in which we were placed. The consumer fed machine that leaves nothing in its wake. I understood the role of the machine; it was not to harm us, but to protect those who were not equipped to deal with the fact that we were controlled. The corporate entity provided our daily lives with a meaning, as shallow as it may have been that the majority were content with. The sheep were well tended, as they should be. \r\nAt this point in time, the nature of our existence was clear. I will not go on explaining that idea, as I cant readily verbalize how I felt.\r\nWe went on a walk, to a rural area. In my head, I felt as though I was able to contact the ones that had been talking to me before, so I sent them a few messages, letting them know that I was not an enemy of the system, and that I would aid them if it meant happiness for those controlled. The walk was rather uneventful, but it did provide me with a beautiful memory of staring over the city with the full moon hanging over it.\r\nWhen I returned to residence, at this point in time it was near 3 or 4 in the morning, I searched out the girl whom I wanted to see so badly one last time while my life slipped away. I wanted to talk to her. We talked, we talked until my jaw fell off, in an intimate position afforded to me thanks to a rather ergonomic chair. It was not sexual at this point in time, but our bodies pressed together and I felt a great understanding for her. No longer did my feelings for her seem base and empty, she had become a fully developed person. A person that I felt strong feelings towards. Part of me wanted to voice those feelings, but I knew the credibility of my words at that point in time were undermined. By the time we finished talking, it was 8 in the morning. We had talked for 5 hours, straight communication. She went to bed, and I followed. \r\nI didnt sleep, instead I watched her, I reflected on everything she said. I ran my fingers through her hair. My trip was coming down at this point in time, but I still was having minor visuals that I was playing with (I managed to figure out how to focus my iris so that I could look at images that were normally blurry. Specifically, the fabric of the pillow I was pressed against.) When she did wake up, after a solid 4 hours of voyeurism on my part, we made love. \r\nIt may be an odd notion to those reading this, but it was the first time in my life that I have ever felt so close to anyone. We spooned, and our bodies pressed together. I could feel her fully, and our bodies moved in such a rhythmic fashion, that I would later comment that it felt like an orchestra. I could, in my head atleast, see myself sliding into her, I could see us joined together in an internal view. She was beautiful, the definition of perfection. We had become one, a perfect union of soul and body. The sex that night was the best of my entire life, and my orgasm left me feeling completely drained, in every sense of the word. \r\nI decided after that night, that I would never push the boundaries of my own existence so far, not for a while. Acid is an incredible drug, and this recollection does not fully illustrate the negative feelings of being nearly schizophrenic and delusional. At times, I felt as though I would end up a conspiracy theorist, forced to live on the streets on a cardboard box. \r\nIn case you are wondering about the girl, it has been only a month, but I feel as though I have met someone who is my equal in everyway. It is the first time that I have felt so close to someone. It is the first time I have ever been in love. All it took to realize how I felt about her was for me to die.\n\n\n"
}
