{
 "title": "Sublingual Handcuffs",
 "author": "brdrline",
 "citation": "   brdrline. \"Sublingual Handcuffs: experience with Buprenorphine (ID 49083)\". Erowid.org. Dec 28, 2005. erowid.org/exp/49083",
 "substance": "Buprenorphine",
 "bodyweight": "59 kg",
 "header": [
  [
   "DOSE:",
   "4.0 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "49083",
   "Male",
   " ",
   "Not Given",
   "Dec 28, 2005",
   "19261",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>What is there to say about subutex? I started on Subutex/Suboxone around 2003, approximately 2-3 months after it became available in the US for treatment of opioid dependency. I found the initial transition from heroin to buprenorphine difficult. Maybe the dose was too high, I can't remember. Basically I'd get overwhelmed by it - confused, muddled, nauseaus. That went away after a week or two. And now, 4 doctors, 2 cities, and 3 years later, I am still on Subutex (not Suboxone -  the naloxone disagreed with me) 4mg daily. It has saved my life (I was a heroin addict for the previous 3 years). I rarely want to get high any more and I dont use heroin more than rarely (one or two occasions a year). </p><p>But there is a downside. This stuff has, without any doubt, worse withdrawal than heroin. The withdrawal feels different, and lasts about 4 WEEKS. My doctor says this is not uncommon, but still on the bad side of the withdrawal spectrum. The first week of withdrawal (this was after tapering down to 1mg) was hell. NO sleep at all for the entire week. I spent 7 days in bed sweating rivers and changing clothes constantly. The anxiety was unbearable. All I wanted in the world was a xanax. After that week I started to regain my ability to sleep (but it was the full month before I could really sleep through a night without sweats). I ended up getting seriously into other drugs in my desire to stay away from opioids. My Ketamine and DXM usage was seriously dangerous and very irresponsible. Every day/night for 3-4 months after quitting subutex. Either this  heavy dissociative use or the withdrawal itself triggered my first manic episode. What a nut I became. But thats another story all together.</p><p>Anyway, six months later I relapsed on a whim, crashed a car and got back on subutex. And here I am - unsure if I will ever try to quit buprenorphine maintenance again. I'm alive. I go to work every day. I'm safe and numb and I don't know where to go from here and I don't like where I am.</p>"
}
