{
 "title": "Fighting Death with Love",
 "author": "Relentless",
 "citation": "   Relentless. \"Fighting Death with Love: experience with Salvia divinorum (5x extract), Methamphetamine, Alprazolam (Xanax) & Cannabis (ID 49099)\". Erowid.org. Sep 25, 2007. erowid.org/exp/49099",
 "substance": "Salvia divinorum (5x extract), Methamphetamine, Alprazolam (Xanax) & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)",
   " ",
   "1 tablet",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "2.0 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49099",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2007",
   "Views: 10067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off, I'm an 18 year old male with a strange obsession for getting as far away from reality as possible, I have a major drug problem and I'll probably be dead or retarded or psychotic by the age of thirty at the rate I'm going, I'm addicted to crystal meth. I do DXM way more than I should at doses that have me walking around like an ape on crack. I smoke a ridiculous amount of marijuana daily. I smoke a cigarette every fifteen minutes. I take double the dose of shrooms everyone else takes when they're in season. I'm always on prescription drugs, mostly Xanax and Vicodin. And then once a month I'll combine all the drugs I do and get so twisted that my friends think I'm gonna be permanantly fried. All that, and none of it even compares to the trip salvia divinorum threw me face first into.</p><p>I tried Salvia a couple times before and didn't have much of a trip other than feeling stuck to the couch and kind of numb, even with the extremely powerful 20x extract. I have come to the conclusion that it's not even worth smoking Salvia unless it's out of a water bong; because I smoked 5x extract out of a bong and I now know what dying and becoming a bodyless soul feels like.</p><p>My brother and I bought some 5x Salvia extract and took it to his house. I wasn't really excited about it since my past experiences with Salvia were annoying at best, and I was already feeling good from the Xanax, weed, and crystal I took earlier in the day. My brother brought out his bong, loaded a bowl of Salvia and handed it to me. I took the biggest hit I could and held it in as long as I could. I don't remember exhaling, I was instantly thrown into a dimension so strange and so damn real feeling that I had no clue I was on any drugs, I had forgotten I smoked Salvia. This is what made the trip so special, because I had no clue all this was in my head, I thought it was real. I was still in my brothers living room but I felt I was on a totally different plane of reality. It felt as if I had been knocked out for a year and then woken up too fast and thrown back into the same place I was when I got knocked out - totally clueless and detached from all that was worldly. That probably doesn't make much sense but that's the best way I can think to describe the strangeness of my mindset.</p><p>Then it happened, everything started to breakdown, and by breakdown, I mean literally. The room started to spin in a strange direction that I can't even describe. I felt light, I felt like I was fading, pieces of me were being broken off, first my shoelaces, then my pockets, then my feet, but so slowly that I was not alarmed until it was only my head left. I asked telepathicly to anyone that would listen what the hell was happening to me. I was answered by a calm voice, he let me know telepathicly that I was in the process of death, that everyone gets one life and I just lived mine, I then took a look at my life, and I could look at the entirety of my life like I could look at a picture on a wall.</p><p>I remember being disgusted at how pointless and wrong my life was, I wasn't ready to die, I needed to live first. I knew that once I was broken down completely I would be recycled back into the earth as pure energy with no memories of anything, like before I was born, I just didn't exist. It wasn't scary, I knew it wouldn't be painful, and I would have gladly let it flow if I was ready, but I wasn't, and I knew that's how it worked and it could not be changed and I was pretty much shit out of luck. But I still had the feeling I was not finished on earth. I had to do something and quick, I had only my head left, the rest of me had been stripped away and the room had sucked into itself.</p><p>I yelled out with my whole soul that I needed to go back. The voice, who I determined to be just some lowly celestial worker, mostly because it sounded like he answered the same questions I asked 1200 times a day, asked me what I meant, he sounded confused, and my break down started to slow down, I tried to explain reality to him, but it was as hard as describing a salvia trip. He didn't get what I meant, and I continued to breakdown again, and then I panicked as I realized what I wanted earth for, what it was that was tying me to the shithole we call reality, it was the girl. I know that sounds cliche and stupid and I probably sound like a 13 year old, but it isn't, because she was the only thing that kept me from dying, and I figure that makes her pretty damn important, at least to me, and that's all that matters to me.</p><p>I needed to go back to earth and spend A LOT more time with the girl I loved, and I would do anything it took to go back and be with her, I went postal and started cussing mostly saying 'THIS IS FUCKED UP'. The guiding voice was in shock I could tell he didn't know what to do, I kept cussing and thrashing the best I could without a body, I was driven by love, and it stopped death for me. I came back to reality cussing and yelling and having my brother try to calm me down, it was then I remembered what I smoked. With the room still spinning I remember thinking about never smoking salvia again and not wanting my brother to smoke it, in fact, I waited outside while he tripped, I didn't want to be anywhere around salvia for a long time.</p><p>Though, now I wonder what it would have been like if I had been broken down completely. After I was completely sober all I wanted to do was go see the one I loved and just be around her, so I did. And because of salvia, I'm never too far away from her and I take it a little bit easier than I did with the drugs I do. Because, I never want to be permanently seperated from her like I truely thought I was gonna be; not for a long long time at least. If I ever do Salvia again I think I'd have to have my girl in my arms for it to be a completely positive experience. I still can't tell if this experience was more positive or negative for me.</p>"
}
