{
 "title": "Like Strong Coffee",
 "author": "Joseph Smith",
 "citation": "   Joseph Smith. \"Like Strong Coffee: experience with coca tea (ID 4909)\". Erowid.org. Jan 31, 2001. erowid.org/exp/4909",
 "substance": "coca tea",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1.5 cups",
   "oral",
   "Coca",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4909",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 31, 2001",
   "Views: 36991",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have never done cocaine and don't think I would like to. I know that it's a drug which acts on the I-Want-More area of the brain, and not the I-Feel-Satisfied area of the brain. But I came to the idea of chewing coca leaves when I was thinking about the sense of taste. I was thinking about how when I was a kid, the very smell of coffee made me sick, but that today, if I leave my desk at work to go to the bathroom, I often turn around halfway there to go get my coffee cup, because it just taste so good and the taste seems to be missing from my mouth.</p><p>I also now enjoy the taste of alcohol, which I used to hate, and when I used to smoke pot I quickly started to enjoy the taste of the smoke. So anyway, my theory was that your brain quickly associates the mental effect with the taste, and after a few 'doses' (depending on the habit-forming potential), any intoxicant you take orally will begin to taste delicious. I wanted to test my theory by chewing on some coca leaf to see if I started to enjoy the taste. </p><p>So, I searched on the internet for 'coca leaf'. I found something I had not heard of before: coca tea, also called mate de coca. A packaged consumer product in Peru and Bolivia, illegal in this country. It is dried coca leaf in a tea bag, and is used in treatment of altitude sickness and sour stomach. It's considered a herbal tea. I was able to purchase some from someone in the US (like me), who was probably not aware that it was illegal. I won't tell you exactly how I did this, but anyone who has even the slightest internet searching skill should be able to do it.</p><p>I received it on Saturday and made my first cup immediately. The bag smelled foul (kind of like ash), and I was expecting it to taste the same, but it was actually (at this point) fairly tasteless. It was close enough in taste to Chinese green tea that I could have switched it with a cup and the average drinker would probably be unaware of the switch.</p><p>Psychoactively, I was not expecting much. I had heard that most North Americans don't report feeling anything when they first drink it. I have heard that cocaine makes you feel, more then anything, like taking more cocaine, so I was expecting this on a smaller scale.</p><p>I started sipping it while I took a shower. When I finished showering, I got dressed to go for a walk while I finished the cup. It was cooling down by now. To my surprise, I was starting to feel something other then normal. It was mild, but it's something I would have noticed even if I wasn't being introspective. It wasn't the I-Want-More effect I was expecting, or even stimulation, it was just this feeling of being a little detatched, of being one level removed from everything.</p><p>So I went for a short walk. During the walk, I noticed that sharp sounds were amplified and that they grabbed my attention more immediately. For example, I hear a door slam, and turn my head very quickly to see what it is - then I'm surprised how loud it sounded, since the car whose door was being slammed is so far away. I didn't walk long before going home. I got into the house, and sat down. I had about half a cup left. Suddenly, I felt a slight panic. I started to pace around, and decided I shouldn't drink anymore. I dumped it down the drain. The panic subsided, and I went to see a movie then to visit a friend. The whole rest of the day I was in a good mood, which may or may not have been related to what I was drinking.</p><p>The next day, Sunday, I decided to have another cup. Again, I started to drink it in the shower. I drank the rest of it slowly. This time I felt a stimulation, like a very strong cup of coffee - but with no jitters. You feel energetic, but in such a way that you don't associate it with the tea. At one point, I was talking to my dad on the phone, as I took big sips, and noticed that I was saying 'um' a lot - and forgetting what I was about to say. Later I called another friend and was talking a lot and was much more articulate. </p><p>I also started to notice the more subtle aspects of the taste - I could taste the similarity it has to Coca Cola (which now uses de-cocainized coca leaves). When I first sip, I taste the green tea/leafy type taste, and then as I swallow, I taste the coca-cola type taste. It tastes good!</p><p>Early this century there was a drink called Vin Mariana, which was a coca leaf wine. I have 198 bags of tea left so I think I might sacrafice some of them in an experiment to make some Vin Mariana.</p>"
}
