{
 "title": "Taking Off a Heavy Load",
 "author": "Mr. Pants",
 "citation": "   Mr. Pants. \"Taking Off a Heavy Load: experience with Ecstasy (ID 4914)\". Erowid.org. Jan 31, 2001. erowid.org/exp/4914",
 "substance": "Ecstasy",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 4914",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 31, 2001",
   "Views: 7336",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was in a terrible mood all day. Nothing was going as planned. People were late, money was lost, substances were hard to come by...I'm sure you all know how that is. I was heading off to a rave for the first time with a group of friends, not real close friends but friends none the less. I had had a real rough week dealing with some personal issues so I was yearning for a release of some sort. I was a wreck, literally. My life was coming apart at the seams, or at least that was how I felt. Some of my friends who were going with me were also attending their first rave, so we had decided earlier that week to all take some ecstasy. For many of them, this would be their first experience with it but it wasn't for me. I had taken esctasy twice before with very pleasant results, but those two previous rides paled in comparison with what I was in store for.</p><p>We got to the event and made our way inside (we all had taken our pills just before we got inside) and just started taking it all in. The music, the lights, the people....it was a very relaxed atmosphere in which we all felt 'safe' being in. I was starting to get 'the rush' after I had started dancing. I started to feel the familiar tingle, then for some reason my head went ballistic. All of the emotions and frustrations that I had been wanting to forget about were now coming at me like a freight train going 100mph. Keep in mind that I had no one I felt safe to express these feelings and fears to around me. </p><p>I started freaking out, crying like a little kid, sitting in the corner of a room. Suddenly I felt a warm hand on my shoulder with a soft voice following it. It was one of my friends that came with me. She was truly worried because she had never done ecstasy and what she saw scared her. She sat down next to me and just started talking to me. Nothing too personal, but it helped me to deal with the situation. After I had relaxed somewhat, she asked me why I was crying. Now I am a very shy person. I don't usually tell people what is going on with me on any level, but for some strange reason I opened up to her like I had known her my whole life. I found myself telling her things that I would never tell anyone before. Real personal things like what angers me, makes me happy, sad, anything and everything. That is when it happened. Somehow we got on the subject of relationships, and that is something I would never discuss with anyone outside of the relationship. I found that I have a real difficult time dealing with loneliness. Like I need to be with someone all of the time, and that I don't like to let go of things. I also learned that I can open up to people, and that they will accept me for who I really am as a person.....that my shyness is really me just trying to hide the fact that I am really 'depressed' because of my loneliness. (not really depressed, more of a heavy sadness) She and the 'E' allowed me to understand so much about myself that I had never known existed. </p><p>We finished up our conversation and went on to dance the rest of the night. All the while stopping every so often to give each other heartfelt hugs. Since we had this experience together we have become real close, dear friends. That night a very heavy weight was lifted from my shoulders.... the weight of my own self-imposed insecurities. oh... another thing.... I also gained a very dear friend.</p>"
}
