{
 "title": "Saved My Life, But A Slave To It Now",
 "author": "Jammer",
 "citation": "   Jammer. \"Saved My Life, But A Slave To It Now: experience with Paraxtine (Controlled Release) (ID 49145)\". Erowid.org. Feb 14, 2008. erowid.org/exp/49145",
 "substance": "Paraxtine (Controlled Release)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 49145",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 14, 2008",
   "Views: 8131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In 1998 while in college, I experienced my first panic attack.  It happened actually in a very calm and serene moment, I was very happy and was about to go to bed with my girlfriend.   Thats when it hit me, my mind was racing faster then I could handle it, I started sweating, feeling nauseous, like I had lost my mind. I was convinced I went insane.  I couldnt sit still so I got up and drove over 100 miles to one of my work sites just to try and shake it off.  After an exhausting night I got home and was mentally paralyzed at what had just happened to me.  My grades were horrible that quarter as you can imagine.  </p><p>After about 2 years trying to do research and learning about my illness  The hardest part was trying to figure out what I exactly had, and to un train my natural aversion to mental illness.  I bought books, read articles on the internet, tried to exercise, eat healthy, sleep adequately etc. I also tried to take alternative drugs to heal myself (St. Johns Wort, Tea, meditation, breathing exercises etc) Eventually after 2 years of painful bouts of panic attacks  it seem to go away.</p><p>One day at work during a meeting I had this uncontrollable urge to urinate, and no matter what I did it seemed to not go away.  I had to excuse myself from work numerous times and I knew people were confused.  Embarrassed I just told them that I was taking allergy medication and it made me have bowel problems.  At this point I knew that I had to seek professional help.</p><p>I went to see a Doctor and he prescribed me Paxil.  Thank God, it worked immediately  all the problems went away.  </p><p>The biggest problem about it is I may very well be on it for life.  Its not cheap either $133 for 30 25mg pills.  I have been on it now for 3 years and I think I might be on it for life.  Anytime I stop taking it, I start to feel the panic come back.  Also if you miss a dose I get bad headaches and nausea.  But considering this drug probably saved my life  I will not complain.</p><p>Thanks</p>"
}
