{
 "title": "A Day of Insanity",
 "author": "Pilly2",
 "citation": "   Pilly2. \"A Day of Insanity: experience with Piperazines (BZP & TFMPP) (ID 49191)\". Erowid.org. Dec 1, 2006. erowid.org/exp/49191",
 "substance": "Piperazines (BZP & TFMPP)",
 "bodyweight": "11 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Piperazines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "49191",
   "Male",
   " ",
   "Not Given",
   "Dec 1, 2006",
   "13144",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>  It was the christmas festive season and after finishing work in the evening I meet up with some friends for a drink and a few lines. Around 00:00 we had ran out of coke and I remembered about the pills I had ordered off the internet from New Zealand. They were in the form of smilies. We decided to go and get them and see what they were like. I had done some reasearch online before and thought they would just be an alternative to E or Speed. But I was very much mistaken.</p><p>T-0 We dropped the pills just sat around chatting. These things seemed to kick in slowly. For about the first hour they felt slightly like E or Mushrooms, we were in stitches of total laughter and anything seemed to be funny. A feeling of total coldness followed by extreme hotness was far from comfortable.</p><p>T+4 The last 4 or so hours feel like they lasted twice as long. Any good feeling has now totally gone and I really feel mentally unbalanced. We decide to go for a walk outside. My body feels really strange and my vision is all fucked up. Simillar to Mushrooms but not as smooth. I can see things cars miles away in the distance and hear the slightest sound miles away. </p><p>T+6 We eventually arrive back at my house. Things have started to go from bad to worse. I really hope I will recover from this one. We decide to call the hospital to speak to a doctor but he has never heard of BZP before. Start to get slightly paranoid that we have done extreme lasting damage to our minds and bodies.</p><p>T+8 - T+12 Things are getting worse all the time. No one can get to sleep at all. The more you try the worse things get. I cannot stop being sick. Still tripping but things stopped being slightly fun hours and hours ago.</p><p>T+13 - T+18 Still no sleep at all. My is still in overdrive. My whole life story is going through my head. All the things I've done and all the things I have done wrong. If I wake up tommorrow I will be a changed man. I will not take my sanity for granted and I will treasure my life and other's around me.</p><p>T+26 - I eventually must have got some sleep. 7 hours in all. Thank God thats over. I never ever want to experience anything like that again as long as I live.</p><p>The conclusion of the story is that these pills are not fun at all. I have tried many drugs in the past and I have never came as close to insanity as I did that night on BZP. They were not like E at all. These are the most dirty, horrible, though wrenching pills that I could ever have come accross. They have made me see that my health and sanity are important to me and If I ever came accross the guy who makes and sells this shit to kids over in NZ I don't know what I would do.</p>"
}
