{
 "title": "The Beginning of Permanent Bliss",
 "author": "Rammy",
 "citation": "   Rammy. \"The Beginning of Permanent Bliss: experience with MDMA (Ecstasy) & Cannabis (ID 49227)\". Erowid.org. Mar 9, 2008. erowid.org/exp/49227",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 49227",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2008",
   "Views: 5016",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI cannot even begin to explain the magnitude of my disbelief right now.  My own ideas, the dogmas by which I live my fruitful life, all solidified, colored in with ship-sinking meaning.  \r\nI was out with the guys (hereafter referred to as PCP's to ensure confidentiality) on one of our usual nights.  We had rolled (taken MDMA) on several days before.  I took three rolls about four days ago, one hour apart each.  Later I took two more, also spaced out.  That was a total of 5 triple stacked smileys in a 24 hour period.  About two days later I took a single one; that was the best one.  I will start from the beginning.\r\nThe first time it was indescribable.  I had done shrooms and salvia before, but this was beautiful in a completely different way.  It took about one and a half hour to kick in.  I had read that when one starts thinking like it may have started to hit, they will go into the full experience shortly thereafter.  It was just like that.  I had three peaks, since I took three rolls, each about an hour away.  Everything felt perfect, I knew everything would be alright.  I all of a sudden understood my friends, the world, everything.  I did it with my close friends, and the bonding experience was astoundingly priceless.  My life had never been so beautiful.  I feel that I can speak about anything, and I'm not scared at all.  Time loses meaning, it doesn't really matter anymore.  We smoked some cannabis.  It hits me instantly, and so heavy, the experience is noticeably intensified.  \r\nWe just lay back in the car and blast up the music.  We all love this music; this cd is perfect.  We all have such a big smile on our faces, this feeling is indescribable.  The music overwhelms not only my auditory receptors, but the visual ones as well.  I see so many closed eye visuals.  The music brings so many ideas to mind, and they are all visually represented at the same time, and in all the chaos there is still so much coherence.  The music is beautiful.  We go back to the house.  The fan's breeze feels natural and perfect.  I see everyone's heart.  They are all a different color and shape, and I see the truth about all of them.  I tell them and feel their awe.  I'm right on the nail, my descriptions were perfect.  No one denies it.  We lay back, listening to the music.  The music is beautiful.\r\nThe next day I woke up still rolling, coming down, and everything just felt so perfect, and at home.  I was worried about getting depressed because I had read that it happens to many people, but things were all right.  We smoked some more cannabis, and it took me back.  I felt like I was rolling again.  \r\nI took 2 more later that day, and once again, it was amazing.  We first took it before going to one of the laser shows.  It started hitting me during the laser show.  Beauty, so much beauty.  I'm just lying down starring up at the lasers, listening to the music.  I purposely open my eyes really wide for a long time and start moving my head around, so as to overflow my visuospatial receptors.  What happens is magic.  Like a beautiful explosion that sends you floating into space.  I could almost grasp the laser lights.  The show ends and we leave.  But this time, the six of us end up in the same car, pouring our other hearts out, rejoicing in the beautiful extrication of supressed emotions.  \r\nThat night I peaked four times, and everyone else did as well.  It was as if we were recycling or hot-boxing the MDMA inside the car.  We all held our hands together and hummed.  I felt everyone's vibrations, I was overwhelmed with warmth.  I never knew that so much tranquility was hidden in the resonation of our harmonized vocal chords.  It was a breathtaking moment.  I was left so drained; I slept amazing that night.  The next day wasn't happy nor sad; it was normal, but still better than usual, although I could tell this wasn't due to the MDMA.  \r\nAbout a day later I had another one.  Once again we were inside the car.  I peaked six times.  Each different song was a different peak, and so long too.  It was the best so far, and with only one.  At this point I feel I should lay low for a while, and allow for my serotonin (and possibly dopamine) to be replenished.  \r\nSo today we packed several bowls of cannabis and smoked before going to another planetarium laser show.  Everyone smoked, three of the PCP's rolled.  The show finished and we went to a park to smoke more and relax.  On the way back, a depressing thought came into mind, but I remember what I thought when I was rolling:  that everything would be alright.  I started telling myself that.  Then I start feeling more and more relaxed, and happy, and knowing that everything is perfect.  And my train of thought shatters and the music seeps into my mind.  I lay down in the back seat, like I did when I had my strongest peak four days ago.  \r\nI was rolling.  There was no doubt, I didn't want to believe it, I needed more prove but now I knew I was rolling.  I go to the front seat and start telling PCP # 3 about it, he says he felt the same, like if he was kind of rolling.  He hadn't rolled in four days, but he knew what he felt was not from the cannabis.  We started talking about it and realize how honest we're being to each other, which is what happens when we roll.  We start laughing because this is not plausible.  All of a sudden I come back to reality, all that had been in another time and space.  That's when I knew, when we both knew, we were rolling.  We parked at my house, taking deep breaths, still not able to easily believe what just happened.  We lay back and listen to the music.  I'm pretty sure he peaked, and I felt his vibes so strong.  Finally, the real test: he suggested we look at our pupils (they get extremely dilated when one takes MDMA, and the surroundings are white, even if you've done cannabis and would otherwise have bloodshot or squinty eyes).  We each looked in the mirror.  \r\nMy heart started beating incredibly fast when I saw the image in the mirror.  I got goosebumps, and waves of fear, accomplishment, and happiness swept through my entire body.  Our eyes were white as ghosts, and our pupils were immense.  We were rolling.  As I write this now I still feel the effects.  For so long I have believed that the mind was capable of literally anything, and this just gives my ideas so much reinforcement.  I am now on a true quest.  MDMA is such an amazing substance.  This world would be so much better if everyone had it just once in their lives.\r\nThis brings a completely new perspective to me.  Can we teach ourselves to feel like this at will?  Can we feed off others' vibes and have such an amazing experience.  I am pretty sure the music had a lot to do with it.  Much experimentation awaits.\n\n\n"
}
