{
 "title": "Nice Red Mushrooms",
 "author": "Funk Shui",
 "citation": "   Funk Shui. \"Nice Red Mushrooms: experience with Amanitas (ID 49265)\". Erowid.org. Mar 5, 2010. erowid.org/exp/49265",
 "substance": "Amanitas",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Amanitas",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "49265",
   "Male",
   " ",
   "Not Given",
   "Mar 5, 2010",
   "7641",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Some time ago I ordered an ounce of amanitas advertized as 'Grade A+' from Latvia, and I have to remark on how great these mushrooms have been for me.  From reading other reports it seemed that the mushrooms varied greatly in quality, which is why I decided to order high quality shrooms.  I  must say I'm glad I did.</p><p>For me, these mushrooms have two uses.  I've taken about 5 grams on several occaisions with a small amount of cannabis for a mellow 'trip' that lasts several hours depending on dose and if you space apart when you take the mushrooms.  I put the word 'trip' in quotations because normally when people hear that word they think of the experiences from lsd, psilocybin, or other 5-HT hallucinogens.  While the amanita experience bears more similarities to these substances than, say, a dxm or salvia 'trip', it really is it's own unique substance and if someone takes it looking for a psilocybin trip they will probably be disappointed.  I find that on lsd or psilocybin shrooms it's generally a very 'active' trip, I feel compelled to be out doing something, whereas with the fly shrooms I just like to sit back, smoke a bowl, and chill.  It can be mentally very stimulating for me, but relaxes my body into a sort of euphoria similar to kratom.  I feel the two would probably be a nice mix, though I have not yet tried it.  </p><p>As for visuals, the fly mushrooms don't have the same kind of colors and patterns as lsd or psilocybin, but objects tend to take on a sort of surreal quality, like in a dream.  This quality is similar to that from lsd but not really the same.  There also tends to be some visual processing errors mostly in the periphery of vision, like objects seeming to 'jump' from one place to another, although that description doesn't really accurately portray what happens.  The trip came down gently and flowed very easily into a good night's sleep.  It seems to be important to get a lot of sleep afterwards.  When sleeping for a long time afterwards, I wake feeling very good, well rested, and almost euphoric.  When forced to wake up early, however, I feel very tired the whole next day, in a very unpleasant way.</p><p>More recently I have taken a liking to only taking about a gram to a gram and a half of the caps before going out to a party with friends.  I find it gives me a great energy and makes me more talkative, and goes rather well with moderate amounts of alcohol and weed.  Some of the psychedelic effects are also present at this dose, but it's mild enough to be able to function normally at a party.  No one wants to be 'the tripping guy' at the beer/weed party.  I find the mushrooms really enhance my enjoyment of social gatherings.</p><p>The only downside to the mushrooms is they tend to make me feel a little 'crazy' for a few days.  They seem to build up in the system and the effects wear off gradually.  It's nothing unpleasant really, and I know it's from the mushrooms, but after a few low doses over a few days the weird feeling can get a bit annoying.  Once I stop taking them those effects taper off after a few days, with seemingly no lasting negative effects.  Definitely much better than the horrible burnout from lsd or psilocybin.  </p><p>Peace, Unity, and all that crap.</p><p>-Shui</p>"
}
