{
 "title": "LSD First Time and Belief in God",
 "author": "Quale",
 "citation": "   Quale. \"LSD First Time and Belief in God: experience with LSD (ID 4926)\". Erowid.org. Feb 4, 2001. erowid.org/exp/4926",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 4926",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 4, 2001",
   "Views: 8386",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHaving LSD available to me for the first time, I immediately took four drops of the mint flavored liquid.  I had tried a low dose of AMT before and about four days previously a dose (~45mg) of 2C-T-7, but was unable to break into the psychedelic region with either.</p><p>My inhibitions rapidly dropped away, but I remained in complete control of myself mentally and physically (maybe it was weak acid or I was still somewhat tolerant from the 2C-T-7).  Before long I found myself hitting (well, more accurately, politely asking for sexual favors) on a sober friend of mine (but not before calling my gf and asking if it was okay).  Luckily, my friend is cool with that stuff and didn't read anything more into it than a compliment on attractiveness.</p><p>Not too much later, someone brought out the nitrous.  I took a ballon and entered the nitrous world, but with far more euphoria than I had ever experienced before.  After a ballon, I would experience five minutes of bliss listening to music so distorted by my mind that it was really something else entirely (I refer to it as the nitrous song because every time, no matter what I listen to, it turns into the same thing).  I started going through ballons like mad and ended up 'wasting' a great deal of my trip trying to work the stuck cracker.</p><p>It was only later coming down that things got really interesting.  Mostly down, I went to wander around outside in the dim predawn light.  I ended up lying down next to a fountain and telling myself that, like the Buddha, I would not move until I experienced a revelation (I had been reading a lot about LSD and religious experiences).  Trying to concentrate my mind on religious issues, I sat there for about 15 minutes.</p><p>Then a bubble of realization appeared in my mind, telling me that I could not believe in God because my parents had divorced.  God was the father and as I was raised by my mother, I could not trust that God would be there to take care of me.  Right then I started believing in God with a great sense of relief and euphoria.  I was completed because I could believe and trust in the goodness and purpose of the world.</p><p>I got home and actually kneeled down and began to pray (for a longtime atheist, this was quite a change).</p><p>Later I sobered up.  I was still deeply affected by my experience, but I wasn't naive enough to actually believe in god.  After all, even if the psychological cause of disbelief had to do with my parents, this didn't give me any reason to believe god existed.  Moreover, I was not convinced this was the reason for my loss of faith.</p><p>Psychedelics provide insight into the workings of our minds, but these insights can be traps for the unwary.  Certainly god and my parents' divorce are important issues for me, but who can say how they relate or if they even do.</p>"
}
