{
 "title": "For Dreamtime",
 "author": "Omen",
 "citation": "   Omen. \"For Dreamtime: experience with Datura Stramonium & Dreams (ID 49308)\". Erowid.org. Mar 9, 2008. erowid.org/exp/49308",
 "substance": "Datura Stramonium & Dreams",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2 seeds",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49308",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2008",
   "Views: 12821",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Taken 90 minutes prior to bedtime.  Before laying down for sleep, I noticed an ultra subtle alcohol like 'buzz'.  By ultra subtle, I mean I had to ignore external stimuli to even notice at all, and even then it was BARELY noticeable.  I was seeking to use Datura to aid the facilitation of lucid dreams, and as such employed other techniques that brought me close in prior attempts for lucidity.  These techniques were effective to some extent, but didn't quite get me there.  I had only tried 4 or 5 times prior, so to achieve lucidity this quick is astounding!</p><p>Datura did it. I had a lucid dream that seemed to last for a whole day, though I only slept for 7 hours.  My dream recall has NEVER been very good, so don't expect me to recap the whole thing, but I do recall drinking a beer and a half, pouring out the other half of the 2nd beer, going to the grocery store, eating at a restaurant, mostly normal day to day shyt.  Upon waking I went to the bathroom to pee, and looking in the mirror, my pupils looked normal, so I went to sit on my bed and quickly make note of my experience for this report.  I swear, my handwriting is the best cryptography known to the human race, good thing I'm able to read it :)</p><p>I'm going to wait a week or so before trying it again, because I've read that the after effects can last for quite a while and I don't want to add more while some is still lingering in my system.  I'll be doing the same dose, with the same intent, why adjust a dose that works for the desired purpose without any apparent negative effects?</p>"
}
