{
 "title": "Truly Intense",
 "author": "Fotch",
 "citation": "   Fotch. \"Truly Intense: experience with Salvia divinorum (20x extract) & Nitrous Oxide (ID 49334)\". Erowid.org. Mar 29, 2008. erowid.org/exp/49334",
 "substance": "Salvia divinorum (20x extract) & Nitrous Oxide",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:45",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 0:45",
   "2 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 49334",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 29, 2008",
   "Views: 3287",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was sitting in my friend the worms basement with my other friends the bird, the cricket, the ant and D. I loaded up this medium size acrylic water bubbler with about a half bowlpack of 20x extract. I fired it up with a butane torch and inhaled as much as physical possible then exhaling and taking another hit, I did this twice. On the last hit i held it in for extremely long and when I exhaled a feeling of disconnectedness entered my soul,the smoke was patterning all around the room. I was looking at reality from a distance, I yelped out but noone could hear. I attempted to grasp on my sanity. At that time I truly believed I could just grab the reality I had just lost. I kept myself mentally calm for the next 5 minutes as the effects wore off. I had lingering effects for the 30 minutes</p><p>Approximately 45 minutes after that expierence I loaded up some more extract and also had D hold a ballon of nitrous ready for me for when I exhale the Salvia smoke. I vaguely remember grabbing the ballon after smoking the salvia but I do remember how it felt when I got that nitrous in my lungs. As soon as the nitrous got in my body all the colors in the room mushed together and came flying into my face only to dissolve into pure white. For about 7 seconds I reached true euphoria. All the sounds I had ever heard in my life came together and were just being played over and over in my ears extremely loud. The vision of white dissolves into a liquid patterning of color back into reality.</p><p>I was in shock of this utopia I had just reached for the rest of the night, even now as I sit here hours later all I can think about is those 6-10 seconds where my body was feeling all the touches, warmths and colds my body has ever felt doubled with the raging sound of all the sounds I had ever heard blaring in my ears. My mind was in a perfect place for those few seconds, it was beautiful and truly intense at the same time.</p>"
}
