{
 "title": "Tea Time!",
 "author": "Murple",
 "citation": "   Murple. \"Tea Time!: experience with Coca Tea (ID 4941)\". Erowid.org. Jan 31, 2001. erowid.org/exp/4941",
 "substance": "Coca Tea",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Coca",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 4941",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 31, 2001",
   "Views: 68741",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI obtained a box of coca leaf tea from a company in Peru. The tea came in a box of 100 tea bags, identical in appearance to any other tea  bags you've ever seen. Not surprising, since coca leaf tea is a legal product in that country. The brand of tea I obtained was Zurit Mate de Coca, and the box had an amusing design of coca leaves and berries. Just looking at the box made me chuckle. Here in my hands was one of the most demonized plants in the world, a plant so feared that the might of the US military has been sent to try and eradicate it... looking not all that different from a box of Lipton's tea. Steep one bag in hot water for 5 minutes. Sweeten to taste.</p><p>The tea bags smell very much like green tea, or more specifically, like the roasted form of green tea known in Japanese as hoji-cha. The smell is somewhat rounder and less tannic than hoji-cha, however. After steeping, the tea has a dark greenish brown color. I gave the tea a taste, its not particularly good so I add sugar and some cream. Although the tea smells very much like hoji-cha, the taste is only somewhat like it. Although its not bad, its not good either. Perhaps with some added flavorings such as mint it could be made better. After a few sips, I realize that while Coca-Cola is flavored with coca leaves, it must be in very tiny amounts - there is no similarity in taste whatsoever. I had expected it to numb my mouth a little, but this didn't happen. Interestingly though, I could detect a faint trace of the taste of cocaine - definately a very minor component of the taste though, and it could've been my imagination.</p><p>I began to notice the effects by the time I'd finished half the cup, and it developed slowly, reaching its peak a few minutes after finishing the cup. Its a very mild and subtle energized feeling, about as stimulating as a cup of coffee. There is a nice warm feeling that spreads through your body. There is a happy and content feeling from it, but nothing at all like the ego-inflated euphoria of snorting cocaine. In fact, the effects don't resemble snorting cocaine at all. I could spot a few similarities, and I could tell that cocaine is part of the picture, but the other alkaloids in the leaf obviously make a big difference. The effects lingered for an hour or two, then gradually faded away. There were no aftereffects at all.</p><p>I'm glad I got the opportunity to try mate de coca. It seems like a nice occasional alternative to tea or coffee, and it may have some very real health benefits. Research has shown that in addition to its traditional uses as a remedy for digestive problems and altitude sickness, it is also rich in vitamins and minerals. It is patently ridiculous that this product is illegal in most of the world.</p>"
}
