{
 "title": "A Close Call",
 "author": "Anonymous",
 "citation": "   Anonymous. \"A Close Call: experience with Damiana & Alcohol - Hard (ID 49462)\". Erowid.org. Jun 18, 2006. erowid.org/exp/49462",
 "substance": "Damiana & Alcohol - Hard",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "3 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "  ",
   " ",
   "Damiana",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 49462",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 18, 2006",
   "Views: 11333",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nK to start of I just recently tried salvia 20X extract and was really hit hard so I want to try something milder. My friend recommended that I smoke damiana leaf powder. So I went to the local health food store and picked up 500g of damiana leaf for about $12.00 when I got home I set up my surroundings and was feeling really good about myself I grabbed my coffee grinder and shredded all the leaf till it was powdery ended up with about 20gs of powder I turned off the lights so only my TV was one I sat down and packed a full bowl into my water bong, the smoke came so fast and it was really white it tasted quite good. \r\nI sat back and started to feel my legs and arms go numb my heart started to beat faster and faster I slowed it down by remembering it was the drug and breathing slower then it hit hard I started to drool so I decide to go to sleep the next day I went to the alcohol store and bought a mickey of everclear(95% grain alcohol)when I got back home I don't know why but I added all the 19 and a half grams of damiana powder to the everclear shook it for about 3 min then it was a green like absinth I sat down and was vary happy because it look good.\r\nSo I turned on some music oh yea it was about 2:30pm after I turned on the music I sat at my kitchen table and drank 3 shots strait it was harsh I could not breath for a sec because of the high alcohol fumes 2 min later I got a bad head rush then I started to see my old dog it was weird he died two years ago all of a sudden like 20 of my friends surrounded me and started giggling at me then I think I passed out when I woke up it was 2:00 pm again I was really dizzy still but at that point I could not recall any thing I got up and turned on the TV and realized I had been out for two days on my floor overall it was fun to try but I would not do it again it.\n\n\n"
}
