{
 "title": "Foxy Over a Candyflip",
 "author": "Nathan Messer",
 "citation": "   Nathan Messer. \"Foxy Over a Candyflip: experience with 5-MeO-DiPT, LSD & MDMA (ID 495)\". Erowid.org. Aug 4, 2000. erowid.org/exp/495",
 "substance": "5-MeO-DiPT, LSD & MDMA",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   " ",
   " ",
   "  ",
   "oral",
   "MDMA",
   " ",
   " ",
   "7.0 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 495",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 4, 2000",
   "Views: 12246",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA friend of mine had been talking a lot about 5-MeO-DiPT, and I was pretty curious about it.  Many of my friends said that it was a tryptamine equivalent of 2-CB, and from the trip reports of 2-CB in PIHKAL I was really anxious to try the 5-meo-dipt.  I went to a party, and was already candyflipping (LSD and MDMA) when I was offered the foxy methoxy.  I was so anxious to try it that I accepted the offer, even though I usually tend to try new drugs by themselves.  </p><p>I mixed the 5-MeO-DiPT (it was a fine, white powder) with water and drank it.  About an hour later, I started to feel some effects that were definately NOT due to the LSD or MDMA.  Actually, the best way I can describe it is that the 5-MeO-DiPT overrode the candyflip.  I suddenly just wasn't candyflipping anymore.  There were visuals, but not like those from acid.  Colors were bolder, and objects just outside of my focus (like the wall behind a friend I was talking with) would move and jump, and if I stared at anything for a few minutes it would start to slowly move and pulsate.  My body temperature started to rise really rapidly, so much so that shorts and a rayon T-shirt was unbearably hot.  Also, I was feeling much more creative.  </p><p>I grabbed a sketch book and started writing what could only be described as fairly weird and demented ramblings.  At the time I was extremely proud of my writings and took them around to show everybody.  Most of that was pretty much besides the point, however.  More than anything, I was HORNY.  I mean WOOHOO was I horny.  It wasn't like the sensualness of MDMA, but more of an all-encompassing libido.  Foxy is definitely a powerful aphrodisiac, at least for me.  Another thing I remembered, the effects would generally come in waves, and dancing for a few minutes never failed to bring about another, stronger wave of the foxy.  </p><p>During the comedown, I started to get a really banging headache that really didn't go away for about a day or so.  I assume that the headache was due to dehydration more than the foxy, however.  I definately want to try this again.</p>"
}
