{
 "title": "Blue Smiley Faces",
 "author": "Epidemic",
 "citation": "Citation:   Epidemic. \"Blue Smiley Faces: experience with Bupropion (Wellbutrin) (ID 49536)\". Erowid.org. Mar 19, 2008. erowid.org/exp/49536",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "450 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   "  T+ 11:30",
   "600 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   "  T+ 17:00",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 49536",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 19, 2008",
   "Views: 50275",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI decide to take 450mg of Wellbutrin SR (150mg/pill), purple smileys when held just the right way.\r\nI take a shower and emerge refreshed, though I can't tell if they have taken effect; I realize I am wearing a dumb grin - and know now that it has. \r\nI sit and watch TV.  There is a slight hazy feeling and though I can't distinguish it - but at the same time I can - there is haze in my vision.  There but not really there.  I find my mood somewhat elevated and though I already have a good sense of humor, it, too, is elevated.  I find the humor in various small things and menial tasks.  I pour myself a glass of Coke and say 'diabetes' as I take the first swig.\r\nAt around 10:00 PM the local news comes on - usual doom and gloom reports.  I notice I am callous - reports of deaths make me laugh at the circumstances in which the people have died, I feel no pity or remorse for these people.  \r\n11:00 PM A slight sense of euphoria, it is as if it is on the very edge, coming but not coming, there slightly.  I notice that when I'm not paying any particular attention to anything, that my mouth is slightly open - in the dumb sort of way, expecting drool sort of way - I close it when I find myself doing that.  I notice there are no thoughts of impending doom about starting school again after the long winter break - usually I find myself feeling 'Ahh, Fuck. School soon.' but I do not have this feeling at all, even when I think about how many hours away it is, which makes it seem sooner.  I enjoy this loss of the slightly anxious feeling.\r\nI am watching The Boondocks, and retrospectively I enjoyed it more than usual.  On a commercial there is a trailer type preview for the next Boondocks which will concern the Martin Luther King Jr. assassination.  I come to a profound realization that the picture in which MLK is on the ground and all around him are pointing 'off camera' would make the most awesomest damn poster ever to grace the wall of any room.  The symbolism is so profound, but I can't think what the symbolism is, exactly.\r\nNotable increase in libido.  Ew, right?\r\n1:30 AM, I am laying in bed.  If I try I can feel the tiredness and it almost takes me away to sleeeeep, but it doesn't.  I have to wake up at five and I've been laying here in darkness waiting for sleep to come.  I note that there is no restlessness what so ever.  \r\nThe noises outside seem so distant, yet so close.  They are silenced and they are seemingly loud because I can hear them in such detail.  I realize that I am randomly focusing on noises and those that are selected, by what process I don't know, are in such detail.  \r\nI hear a motorcycle revving and burning rubber and going faaast and I hear screech and I am paying even more attention and then skid, crash, bang.  'You killed yourself.  Good job.' I said to myself.  I think about what I heard and I realized the only straightaway in which such speeds could be obtained is pretty damn far away.  A minute later I hear the motorcycle rev, rev, revving working as hard as it could and then it trailed off - too bad, I was interested in hearing the wailing sirens in such detail.  \r\nI hear what sounds like a skateboard right outside my window going over cracks on the concrete sidewalk but the noise stops when I try to concentrate on it and it doesn't seem right - running over crack and crack, badunk badunk, would have gone on and trailed yet it stopped pretty suddenly.  I hear this a few more times.\r\nAt five when I rouse I seemed to have fallen asleep yet I cannot remember, at all, the circumstances.  Right before being awake I feel the sleep - it is awkward, like two layers, the one I lay on was asleep and the one below was oh so awake and coherent.  Body sleeping yet mind still churning.\r\nI am groggy.\r\n7:00 AM, 600mg Bupropion - though I have gotten less than an hour of sleep, at best, I do not feel tired.  When I think about it I can almost feel it, the tiredness pulling me down, but immediately the feeling stops and I am awake....comfortably numb?  I guess.\r\nI want to be fucked up in school so that 600mg should do it - nope.  I am not feeling the onset like I did last night, the haze and so forth.  I just feel the...elevation.  I am awake and not wanting sleep but I know that I need it and a part of me wants it, take it, but it can't and it doesn't fight much.\r\nI ditch the rest of the day because I have a new class and it's shit so fuck it, fuck you, but at the same time no.  As I walk toward a covert exit I am passing under bleachers.  I can hear it, foot steps and, someone talking?  A few more footsteps.  No one was up there, I know this, but I heard them.  But wait, the sound was odd like that of the handicap ramps to access the portable classrooms, and people stepping on them and walking up them and talking to each other - though it is so far away I wonder why I heard it in such detail for a few seconds.  I am paranoid and I'm pretty sure it's the lack of sleep.  \r\n12:30 PM I want to get fucked up, something happen. I take 300mg.  Not much noticeable.  It is like an amphetamine and I do stuff, I clean.  I notice again the callousness and humor-in-all again when, while I'm washing the dishes, a coffee cup slips out of my hand and shatters.  My reaction is 'Hah, heh.  Fuck.'  Kind of like a manic laugh and then the realization that I broke that shit there, in the sink, and it's one less coffee cup, what a waste.  I notice I am paranoid, almost not paranoia but easily frightened at certain noises in certain circumstances.  I attribute it to the lack of sleep.  \r\n4:28 PM I would probably be nodding off as I type this were Bupropion not keeping me up - I am not tired, I am alert and coherent.  Insomnia.  Maybe my experience with sleep deprivation (I'm a gamer, CS and Tribes and shit) allows me to function better in this state, maybe not - but I note the absence of the 'drone zone' one enters when missing that night of sleep.  This shit would be great to take to war.\r\nWith the effects not as pronounced as I had hoped, I will probably try snorting in lower dosage the next time.\n\n\n"
}