{
 "title": "The Withdrawal Process",
 "author": "realized overuse",
 "citation": "   realized overuse. \"The Withdrawal Process: experience with GHB & GBL (ID 4959)\". Erowid.org. Dec 28, 2001. erowid.org/exp/4959",
 "substance": "GHB & GBL",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "1 cap",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 4959",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 28, 2001",
   "Views: 18000",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI began using GHB 3 and a half years ago.  Like many people who abuse the substance, I passed out in public on numerous occasions and went to the hospital unwillingly a couple times.  I realized the point I was getting to after a friend had a bad car accident while driving.  I was taking it for a period every night for sleep and at least once during the day.  I controlled it for a while but in the past 7 months I have used heavy doses, 2-5 times per day and at least twice at night for sleeping.  And this is a fact... GHB can and will cause gynocomastia in individuals that are sensitive to estrogens namely prolactin.  I have been attempting the approach of stopping all together and it never works.  <br>Today, I am starting a 2-3 week process of diminishing use to a weekly basis at most.   I am limiting the first 3 days to 1 cap of this product which would be equal to 3/4 of 50 water 50 pure g or about 3/4s of an ounce of renewtrient or like products.  Days 4-10 -- a half a cap of furanone (used conversions above).  After that, depending how I feel, I will either cut it off at day ten or shrink the dosage.  I have many friends in my boat and I know there are others out there.  If you are not to the point where you must stop and you are becoming a chronic user, you could get there unless you adhere to a strict regimen.  For sleeping purposes, I buy a combination of melatonin and a valarian complex.  Also, before bed a phosphitylserine complex really helps my groggy mornings when I cant think too straight.  One vault here, pushed me to the point of doing an extreme cutback, hopefully someone that realizes it is taking over can do the same. \n\n\n"
}
