{
 "title": "Life Saving",
 "author": "Josh",
 "citation": "Citation:   Josh. \"Life Saving: experience with Methadone (ID 49653)\". Erowid.org. May 26, 2006. erowid.org/exp/49653",
 "substance": "Methadone",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "Methadone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 49653",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 26, 2006",
   "Views: 18038",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMethadone has saved my life.  I was just another typical teenager addicted to opiates.  Oxys were my favorite and then Fentanyl and then H. I spent all day every day looking for drugs or money to buy drugs. I had no time for a girlfriend, no time for my family, and definately no time to goto school even though it was my senior year.  I tried an inpatient 30 day shit but that just put my problem on hold until I got out and then went into an IOP (Intensive Outpatient Program) that lasted a minimum of six months.  I stayed in that program from valentines day (Feb. 14) 2005 until august 4 2005 because that was my court date to get off probation from my DUI charge.  \r\nMy probation officer was so awesome, she never piss tested me once because I was being tested in the IOP program and she was in contact with the director of the program and would tell her everytime I failed a drug test which was almost every one.  I couldn't get my clean time above 15 days.  But honestly, I was never clean for more than 2 days they just wouldn't test me all the time and I could lie about my clean date because I only got drug tests on mondays and thursdays.\r\nAnyways I kept using oxy the whole time i was in the IOP program and when I got out I just went crazy.  I stole 1500 dollars from my mom, got fired from 2 jobs for stealing money, pawned my ps2,xbox,all my games, my $700 guitar, my $400 amp, my TV and my moms jewelry and all our dvds, our dvd player...and more.  \r\nI wanted to stop living this way.  I wanted to stop hurting my mom most of all because she loves me so much.  I entered the methadone clinic in late september and I have been clean from then up until yesterday when I missed my dose and did 3 80's which I totally regret but at the same time I had a blast.  Anyways, the clinic just allows me to get through the day without really thinking about pills that much.  I take 80 mg methadone every morning and it really helps.  Its saved my live.\n\n\n"
}