{
 "title": "The Rumors Were True",
 "author": "NewRisingSun",
 "citation": "   NewRisingSun. \"The Rumors Were True: experience with Cocaine (ID 49667)\". Erowid.org. Feb 5, 2008. erowid.org/exp/49667",
 "substance": "Cocaine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 49667",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 5, 2008",
   "Views: 4801",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAround december 1st I tried cocaine for the first time. Was only a small pinch but I felt kinda weird. I decided to sniff a full line and I got pretty wired and happy and everything was great. I get numb and tingly. I also feel like I can do anything and I can. I can be extremely persuasive and get things done because my mood is so good. I couldnt lose the good mood. I did it every couple days just for fun but then I'd stay up all night with a half a gram of coke split over 2 hours. The comedown is the loneliest, saddest feeling. Its that feeling you get when someone dies and you know you wont see them again. I didnt buy more though. I started doing it at school occasionaly with friends and by jan. 1st I was doing a half a gram a day. Today is January 14th and I'm halfway through a half a gram now. Ive been doing half a gram everyday for 9 days now and I feel like soon I'll need to go to detox to lose it completely. \r\nWarning: If you dont want to like coke a lot dont do it. If you do do it dont listen to lies you'll tell yourself. For example: if I had the right girl everything would be ok, or if I had this or that everything would be ok and I wont need it. WRONG. I'm not saying everyone will always do it but I'm telling you I found it strongly addicting in my head. I also get headaches after doing it a few days and suddenly stopping, like maybe a withdrawl symptom I dont know. BE SAFE!\n\n\n"
}
