{
 "title": "Improved Dream Recall with Side Effects",
 "author": "L'ange",
 "citation": "   L'ange. \"Improved Dream Recall with Side Effects: experience with Calea zacatechichi (ID 4969)\". Erowid.org. Feb 3, 2001. erowid.org/exp/4969",
 "substance": "Calea zacatechichi",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Calea zacatechichi",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "4969",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 3, 2001",
   "105211",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nJust received a shipment of dried leaves and stems of Calea Z. I prepared a small amount of the plant by slow boiling appx. 500 mg in 250 cc water for 15 minutes then simmering for another 15. I then used a small strainer and poured it into a flask, seperating the liquid from the plant, and then refrigerated it for a few hours. </p><p>I drank this and after a severel nauseous episode, which lasted for 30 minutes, I began to drift off. I experienced a flow of easily recallable dreams, all of which were relevant to my past and present life experiences. I daresay some dreams may even be prophetic, although this may just be the result of the mind's incredible power of prediction given the correct interconnectivity of analytic and holistic (abstract) thought patterns. (IE you are your own psychic...You just don't know it yet.)</p><p>This is the first time of use, and I will try smoking instead, mixed with tobacco, as the leaves appear to have an extremely low moisture content.</p><p>First off, do not drink this infusion cold. It is extremely unpalatable, even moreso than when hot, and may induce serious nasuea. Second, I recommend using distilled water, as tap or fast filtered water will 'foam up' more during preperation, due to impurities, pushing the leaves away from the water and onto the pot's rim. Chlorine in tap water does not make this any more palatable either!</p><p>Another side effect that I experienced was that I had severe inner leg cramping four hours into the sleep. This is most probably the result of a combination of lactic acid buildup from working the previous night on my feet and decreased bloodflow and increased skeletal muscle tonicity that so often accompanies the dreamstate. </p><p>I recommend to anyone who works in a high motion job such as restaurant work or bartending to take caution against leg cramping, when using Calea Z, by assuring that the room temperature is not too cold, and to drink fluids, and to perhaps use an extra blanket over your legs to promote peripheral vasodilation, thus reducing the chance of a cramping episode.</p>"
}
