{
 "title": "Significant Euphoria",
 "author": "Limpet Chicken",
 "citation": "   Limpet Chicken. \"Significant Euphoria: experience with 2-Aminoindan (ID 49701)\". Erowid.org. Mar 27, 2006. erowid.org/exp/49701",
 "substance": "2-Aminoindan",
 "bodyweight": "57 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 0:00",
   "2 cups",
   "oral",
   "Kratom",
   "(tea)",
   "  T+ 0:00",
   "100 mg",
   "rectal",
   "2-Aminoindan",
   "(liquid)",
   "  T+ 0:10",
   "100 mg",
   "rectal",
   "2-Aminoindan",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "49701",
   "Male",
   " ",
   "Not Given",
   "Mar 27, 2006",
   "15849",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Alright, I felt it time to post another trip report on my evaluations of 2-aminoindan, or 2-AI, which is basically a cyclic amphetamine, with the alkyl side chain attached back onto the benzene ring. My previous experiments included snorting it (extremely painful) and orally, which produced quite a strong painkilling effect, with little euphoria yet a strong awakening effect, as I imagine modafinil (which I have not yet taken) to be.</p><p>This time, at the end of a tiring day, smoking a fair amount of good weed throughout the day, (time is 02.55am) I weighed out 100mg, dissolved it in 2.5ml of tap water, and plugged it.</p><p>No ongoing medication taken, 10 bag of good skunk smoked throughout the day, and two cups of kratom tea, with a fair tolerance to opioids, no caffeine intake save a few sips of coke hours earlier in the day.</p><p>Set: moderately tired, bored, listening to music, more or less bollocks all to do.</p><p>Setting: my bedroom, alone, listening to music.</p><p>I waited around 10 minutes, feeling a moderate effect, so I decide it would be prudent to try a second dose, to get a feel for this compound, a further 100-mg was measured and plugged.</p><p>By T-15 minutes the 2-AI had made itself fully felt, pulse fast and strong, quite considerable euphoria, a very clean headspace, I would say slightly more stimulation than a moderate dose of amphetamine, but the headspace far far FAR clearer, very clear mind, if I were in company, I am quite sure I would be talking my arse off, sort of electric body high, feeling of pleasant tension in the calf muscles.</p><p>There is intense focus, and motivational effect, I feel like I could easily get down to doing work, if I had anything that actually needed doing. I went from tired, as I have to be up tomorrow fairly early to claim jobseekers allowance, to wide-eyed and fully alert, I am going jobhunting later tomorrow with a friend so I should stay awake all night and be quite ready to face my public, I may redose tomorrow morning, and sleep everything off in the afternoon, substance willing of course, after my last experience I know benzos+promethazine, my usual combination for sleep will be totally overpowered, so I won't waste any sleep aids this time. </p><p>Overall, there is quite a bit of euphoria, very clean stimulation, not nasty and tweaky like dirty UK amphetamine paste, but wired and very pleasant up, nonetheless, rectally, its a whole different ballgame to snorting or orally which although providing pain relief, failed to produce any significant euphoria.</p><p>I think I might try 2-AI intravenously, I can't stand needles, but with a 31 gauge, I might just be able to push myself to do it, I certainly wouldn't mind trying that, perhaps combined with a dose of GBL.</p>"
}
