{
 "title": "My Tinnitus",
 "author": "Balloon Eye",
 "citation": "   Balloon Eye. \"My Tinnitus: experience with Nitrous Oxide (ID 49717)\". Erowid.org. May 3, 2006. erowid.org/exp/49717",
 "substance": "Nitrous Oxide",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 49717",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 3, 2006",
   "Views: 10768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've got mild tinnitus from nitrous use.</p><p>I've been experimenting with nitrous oxide in whippet form off and on for appx. 6 months.  I more frequently use cannabis and alcohol, and I've dabbled in other things as well.  I have read nearly everything available online about nitrous usage and began to wonder what exactly was 'too much.'  Usually, the health concerns were written of in conjunction with individuals who had used pure nitrous from a tank w/o enough oxygen, or who were doing a box or two daily for a period of months.  As I'd experienced no ill effects after the occassional box once every couple weeks, I'd become less concerned about the amounts.  </p><p>Eventually I was doing a box a week, and this lasted for 4 weeks.  Over the period of the final week, I split five 24 cartridge boxes with a friend, and in one ten hour sitting inhaled appx. 45 cartridges while drinking beer.  Since only one online report that I found mentioned tinnitus, and that was only in passing and w/o specified dose amounts, I felt I should offer this for anyone wondering about real side-effects of what I consider to be short-term whippet use.  I am only experiencing a low-level ringing, and it isn't enough to disrupt my day-to-day activities, but it has been persistent for two days, with no change.  I believe that this is a result of pressure in the ears from the mechanics of balloon inhalation/exhalation, not necessarily the gas itself.  However, I'm not a doctor.  I assume it will pass, but right now I just accept it and have no more interest in nitrous.    </p><p>Although I question its relevance in this case, I had also eaten ginseng and have been on venlafaxine for a few years.</p>"
}
