{
 "title": "Great Trip and Fun with Nitrous",
 "author": "Japes",
 "citation": "   Japes. \"Great Trip and Fun with Nitrous: experience with 2C-I & Nitrous (ID 49729)\". Erowid.org. Oct 30, 2008. erowid.org/exp/49729",
 "substance": "2C-I & Nitrous",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 2:30",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49729",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 30, 2008",
   "Views: 9220",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've just finished one of the best nights of my life. Sitting here wishing it wasn't over, I'm just going to type up what I wrote down on a sheet of paper. First trip journal I ever made.</p><p>9:50pm Split a 100mg bag of 2ci with four people. Dumped 2ci on a .1 scale and it didn't register. Split into 4ths, drank in gatorade, then licked the bag clean. Dose was ~25mg.\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>10:00 Slight body numbness when walking around. Could be placebo effect.</p><p>10:10 Starting to feel warm, slightly naseous stomach.  </p><p>10:24 Strong feelings of onset. Already starting to see some shapes morph and changing of colors.  Smoked a blunt with a few friends, naseau was making me only take small hits.</p><p>10:52 All of the sudden very cold. Can't stop shaking. Feels like I can 'feel' or touch colors and are drawn to them.</p><p>11:10 Feeling sensitive to sounds so I crept into the dark with a glow stick. My buddy syays 'tell him this is INTENSE.' Trails are very evident, very bright colors.</p><p>11:40 Music is amazing. Running around with glow sticks.</p><p>12:06 Roommate grabbing the pillow and saying 'it feels like a cold frosty cloud.' Conversation is awesome. I am very concentrated on what I am doing.</p><p>12:15 Roy is still playing with the pillow and rubbing it all over his face. 'Me and the pillow are one.'</p><p>12:20 Nitrous is amazing. Best thing I have ever felt in my life. Can only be described as a really intense and extremely long orgasm. Louder = Better (talking about music).</p><p>1:08 Still feeling great. Music is distorted and feels like it runs through my body. 'Feel the vibes.' Time seems frozen. I have never felt so awake, so alert.</p><p>1:23 Ice Cube=Great. Sounds are much more sensitive then usual. Notes can be felt like deep bass, but with higher frequencies that generally are not 'felt' but only heard.</p><p>1:46 Everyone is very concerned with the journal. Would like to help future trippers across the globe. Wish there was more information about 2ci and other psychadelics. Perhaps I will write a book, a full length novel on trips and experiences. A book where every chapter is a new drug or experience.</p><p>From this point on I didn't write anything else in the journal until the end of the trip. I recapped the night.</p><p>2-3am included a lot of raving with glow sticks. The upbeat tempo of techo music feels really great to dance to. Trails looks really great and are the centerpiece. At one point I felt like a conductor of an orchestra with the light sticks and was swinging them furiously like I was controlling the beat.</p><p>3:30-4am Beginning to come down. Completely crashed by 4:30am. Slight headache which continues through 7:16am when I am writing this now.</p>"
}
