{
 "title": "Amplified Intuitive State",
 "author": "tony",
 "citation": "   tony. \"Amplified Intuitive State: experience with LSD (ID 49747)\". Erowid.org. Jan 24, 2006. erowid.org/exp/49747",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "LSD"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 49747",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 24, 2006",
   "Views: 4318",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nAlthough I do not take LSD now, there was a time when I must have taken it several thousand times over the course of some years.  I began taking it when I was rather young, when it was still used legally by psychiatrists.  I was introspective to begin with, into poetry and intricate pencil drawing.  When I first took it, I did so expressly to achieve any and all forms of evolutionarily empowering insights.  I believe, that more then anything, LSD simply amplified my already intuitive state.\r\nOf course this amplification came with observations that were seen at the time as enlightening or clever at least.  Senses, of course, gained dimension which in turn resulted in impressions that often contracted traditional beliefs.   Later, after my frequency of use increased and taking it became more casual, I remember using LSD as a sort of virtual force field.  When my field was on, I felt I was protected from any risings of negative energy.  In this light LSD seemed to give me more control over this,the environment of energy we all seem to inhabit.  Most of us with almost any degree of western education have at some point learned that matter is made up of what we call atoms.  \r\nIf we studied a bit more we learned that atoms consist of mostly empty space.  We also may have learned that, it seems, there really are no atoms per se, but wave-clumps of energy...and so on.....LSD's effect on visual impression seems to give one a real-time impression of an environment in which, nothing is in a fixed state.  Where things meld from one into the next seamlessly.  Apparently this is in some ways a more accurate observation.  We learn that brain chemicals induce perceptive variance to a degree that questions the notion of a fixed reality.  Mind as an unavoidable precursor to all impression.\r\nThen again I knew people who took LSD and wanted to get drunk.  Clearly the outcome of the ingestion of LSD seemed to depend on the pre existing state of the subject.  At the time I felt that LSD in very light doses accelerated my capacities.  I could use it as a mild dose amplifier in sports for instance, or meditation.  I took it many times in the military to help on long marches and difficult field training.  It seemed to give me, what I might call, an arrogant aloofness.  There seemed also to be a greater risk of unconsidered transference under the influence.  While transference may have applications and may for instance, help understanding during a learning experience.  If unaware, it  might also lead one on to distinctly unworkable, fanciful actions, with possibly catastrophic results.  After all we still live in a causational universe.  Perhaps humans don't naturally see this way, because the organism which now seems so insightful, could not have survived the gauntlet of natural selection with so much input.\r\nIn the end, I feel that psychoactive are good for people who have not considered, or feel that they cannot change or see outside of their own mind, AND WISH TO DO SO.  For those who do not wish to do so, who lack evolutionary intent, they will just pray for it to wear off.   The use of LSD, as most other things, has results that depend on the observer.  To blame a drug or to extol it's virtues seems in the end, to ignore the lesson learned.....that mind is the precursor to all phenomena, drugged drunk sitting in lotus or what.  Reality is this impression, in pure unattached dispassion.  One can get excited, be arrogantly aloof, we can open our entire, known cornucopia of ideas and pour it on top......still, it all dissolves in the endless endings and birthings, one into the other, into the other, seamlessly, with or without ideas of any sort at all..\n\n\n"
}
