{
 "title": "An Indifferent Abyss for an Immature Mind",
 "author": "Warwick Nz",
 "citation": "   Warwick Nz. \"An Indifferent Abyss for an Immature Mind: experience with Salvia divinorum (10x extract) (ID 49767)\". Erowid.org. Jan 1, 2008. erowid.org/exp/49767",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49767",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 1, 2008",
   "Views: 2865",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had spent much of the year neither drinking alcohol or smoking pot (both of which I used to do regularly), and instead had picked up an LSD habit which I in no way regret.</p><p>Thinking I was a matured tripper (having taken relatively large doses of LSD and always holding it together) I thought I could experiment with Salvia. I heard it could be much like DMT (which I tried once and loved) and had tried it years before but had smoked it incorrectly.</p><p>I was only smoking the salvia because I felt like a trip and couldn't get any for a couple of weeks. I guess it had become a fortnightly habit.</p><p>Needless to say I was disrespecting this potent atypical psychedelic. So this is where the nightmare begins:\rPART 1</p><p>I smoked about half a gram of 10 times concentrate in one hit through a bucket bong. I filled a whole cone, torched it with a butane lighter to half fill the bucket, then filled another cone and used that to fill the remaining half of the bucket.</p><p>T+0:00:05</p><p>It took me 5 seconds after inhaling to feel like I had just made the biggest mistake in my life. In short I had an out of body death experience. </p><p>Initially, a painful wave of tingling flooded my nervous system. I stumbled two long steps to a waiting mattress in the dark and collapsed into a shallow coma, drooling, completely incapacitated. </p><p>I felt as if I had become a spirit, my being was just my face and soul floating in an eternal blanket of inverted space - my body was irrelevant... but I felt no welcoming divine force. I felt alone and dead.</p><p>The pain crawling towards my extremities would not subside and it was distracting. I got the fear. I started thinking (barely capable of cognition) that the only reason this chemical is legal is because it does brain damage. The only way I can really describe its effects succinctly would be to say it is like being slammed by a mental cudgel. It's like experiencing brain death. I couldn't do anything. I just existed in an empty void of a limbo, sense-less, where I was being pulled away from my body. My precious body and all of my memories felt as if they would soon become irretrievable. </p><p>I started to fight the drug; in an abstract sense, I existed in space and was being sucked/pulled through a black doorway by an indifferent benevolence. I didn't want to go, I had had enough. I wanted my precious life back so I fought and fought and stretched my way back to my body. Finally my body started to move, although my head was limp and my eyes could not focus. Stumbling to my feet I made my way back to the bong and my friend (who was going to smoke some after me). I started swearing profusely claiming that the drug is a social experiment allowed to go on by the black government designed to mentally retard all those stupid enough to indulge in drugs. </p><p>Picking up the bong, I started making the motions of tipping it out, thinking that such an action would rewind time and undo what I had done to myself. [During this time I was still fighting with the black doorway (my mental time-space rift) to maintain control of my physical existence.] My friend barked at me not to tip out the bong water because he needed to use it. So I didn't. Then I looked at him and didn't recognise him, saying 'who are you?' kind of accusatorily. He looked back at me and said 'oh my god' and proceeded to tell me that my eyes were at differing angles and half of my face had collapsed. This came as no surprise to me as I was essentially paralysed. I had to give up and return to the mattress, defeated. There I let the drug do its work.</p><p>T+0:02</p><p>Lying down and curling into the fetal position my consciousness entered the void.  I forced myself back to my body with will power but my body was useless, uncontrollable because of the drug. I spent my time panicking as I phase shifted between physical reality and spiritual oblivion. I was terrified, but with absolute terror comes resignation and acceptance. I did not want to be in the abyss; I recall my realisation of the importance of life and how lucky I am to have a separate consciousness and free will. I wanted to rewind time and undo what I had done but knew it was futile. I felt like there was an entity watching me, but not helping, not as if it was surprised to sense me but more of a bemused observation. The herb kept pulling me, pulling me from four dimensional reality, pulling me from my body, from my past, from my life, pulling inside the fourth dimension, folding me inside and out of time. </p><p>My consciousness was removed from its recognised patterns of existence, my universe, unprepared. There were fractal visuals quite unlike those commonly experienced with LSD. While still fractal like in essence, the Salvia produced a visual effect that seemed to give off a taste as well... difficult to explain, but it is like the merging of sense into an abstract conglomeration. </p><p>T+0:40</p><p>When I came back to sane normalcy I felt destroyed. I was so ashamed at how I had acted in the renounced 'wisdom' state. I felt like my life had been designed so that I might come to experience and understand death, felt like from the moment I was born I was destined to experience that moment. Destined to be shown how stupid and alone I really am. I had been so immature and naive, and I realised how unprepared for death I really am. All that changed in an instant. I feel much older now. I am awed by the concept of God, a consciousness that exists outside of time. I felt that because we have independent consciousness we are mini -insignificant- gods with dominion only over ourselves (personal sovereignty) if we are lucky. Our independence is a blessing... as fleeting and unrecognised as it is.\rPART 2</p><p>A few days after my horror experience I felt I needed to overcome my fear so this time I was more respectful in my consumption.</p><p>Smoking progressively stronger doses I managed to reach a state where the following was revealed to me:  </p><p>The final large dose resulted in a feeling of separation from my history. I did not know where I was. I tried asking the presence I felt behind me 'what is going on?' 'why am I like this?', only after doing this did I realise that there was no one physically with me... Only a series of events (i.e. having just smoked salvia). </p><p>After collapsing near the wad of paper I had prepared I found myself trying to shut off all external influence - light (I covered my eyes), clothes (I took them off), gravity (I couldnt get rid of that, man I felt heavy). My mission to remove all influence of sense was so I could create a perceptual reality that I wanted to be in. Initially this was frustrating as I found myself using my eyes to hallucinate in the darkness, and this was an automatic response I needed to overcome. After some time I managed to remove myself from my sense of sight and precognitive association with it. Then all of a sudden everything changed, the environment I created was no longer simply three dimensional directionally perceived space, it became complete environmental understanding and expression. I walked around the room with eyes shut, recreating magnetic/fractal/aura type representations in my mind of my physical environment much unlike any sense of perceptual construction I have ever had before.  </p><p>Once I conjured up enough focus I wrote the following (this is translated as I could barely write - writing was a chore, recoding history is only relevant for my brain, not mind, as I recognised the mind as the meta-pattern of intuition based decision construction):  \r'It pulsatingly enters the body and creates entire physical awareness where the body just collapses begrudginly onto other atoms that offer impact/support. A kind of humming and throbbing with a beautiful focus on life and function that allows for refined creativity in the physical nothingness of internal space. Almost as if consciousness is removed from the physical universe and time with no impact in anything... then gravity pulls away. (I then question how much sense I am making).  </p><p>Is life of any use while in these states? It certainly feels more productive than following the temporary influence of games. What needs to be done? (I then started on about love, power and social commitment - which i will leave out).  </p><p>My life is built on automation. My existence but to oppose the physical. The routine I abhor I build with purpose.  </p><p>The dimensional doorway exists within the mind. It places itself in a universe of prediction and pattern and senses its way through the predictions, using what it can. </p><p>Use only what wants to be used.</p><p>Love to let live.'</p><p>\n\n"
}
