{
 "title": "A Pleasant Inebriation",
 "author": "Fat Rukelo",
 "citation": "   Fat Rukelo. \"A Pleasant Inebriation: experience with Wormwood (extract) & Alcohol (ID 49775)\". Erowid.org. Nov 4, 2009. erowid.org/exp/49775",
 "substance": "Wormwood (extract) & Alcohol",
 "bodyweight": "275 lb",
 "header": [
  [
   "DOSE:",
   "4 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "2 oz",
   "oral",
   "Various",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 49775",
   "Male",
   " ",
   "Not Given",
   "Nov 4, 2009",
   "Views: 7130",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've had previous experiences with wormwood before. The experiments involved using an eyedropper to drop the wormwood (in liquid extract form) into a shot of vodka. Due to wormwood's infamous bitterness, it goes without saying that this mixture tasted terrible. However, the effects of the wormwood had proven to be fairly potent, much like a giddy stoning effect that could not be attributed to alcohol alone. I wanted to continue my experiments with wormwood, but I needed a way to get around the taste.</p><p>While researching on the internet, I found out that one cheap and easy way of making absinthe is to simply mix wormwood back into a thujoned-free (which is all that is legally available in the U.S.) bottle of Pernod Absinthe. This poor-mans' absinthe is a welcome alternative to buying a $200+ bottle from Europe.</p><p>So, last Saturday night (around midnight) I mixed a 750ml bottle of Pernod Paris (not Pernod Absinthe) with a 30ml bottle of liquid wormwood extract. In order to allow the bottle room for the extract, I decided to first drink a couple ounces of the Pernod. Though the ones sold off the shelf (at least in the U.S.) don't have the thujone, it's still a yummy drink. To be honest, I find it a bit reminiscent of NyQuil, except it's more refined.</p><p>Anyway, after drinking about three or four ounces of the Pernod, I decided to add in the wormwood extract. I unceremoniously dumped the foul smelling liquid into the Pernod, which, after being stirred with a straw for about a minute, changed from its original happy translucent emerald-yellow into a forebodingly opaque poison green. Such an evil metamorphosis gave me brief pause, but, resolute to continue my experiments with *Artemisia absinthium*, I marshalled my will and sally forthed.</p><p>Pouring about two ounces of the homemade brew into a goblet, I added a couple ice cubes and watched them crack and fizz in the glass. Swishing the concoction about, I found myself uncharacteristically hesitant to follow through with the experiment. From previous encounters, I knew well the sheer *nastiness* of the taste of wormwood, the unholy smell of ultimate bitterness. However, I did my duty and slowly poured the potion down my gullet. </p><p>It was bitter; I grant that. In the grand scheme of all things bitter, what I drunk last night was *bitter*. Bitter indeed. *But* it was not *that* bitter, not nearly as terrible as the evil poison of my previous experiments. For whatever reason, the Nyquil-esque Pernod helped alleviate the more wicked characteristics of the drink. Next time I might drop a sugar cube in to make it more palatable, but what I drunk was bearable, if not exactly pleasant. </p><p>As for the effects, they were rapid and pronounced. Only a couple minutes after my ingestion did I feel the familiar wooziness that I find characteristic of a wormwood trip. I suppose at least some of the effects can be attributed to the alcohol, but my tolerance for spirits is such that I find it highly unlikely that a mere few ounces of liquor could properly account for the sheer inebriation that I felt. A sense of giddiness swept over me, and I stumbled to my room to lie down. I felt the desire to listen to music, but found myself too intoxicated to remove myself from my bed. Through my body, I felt a vague sense of being poisoned - but not enough to cause discomfort. </p><p>I lay there, thinking great thoughts concerning the mind-body problem and had vivid flights of fantasy regarding myself as a Medieval count fighting Muslims (I spent much of the day playing the computer game 'Crusader Kings'). After a couple hours of lying in a stupor, I grew annoyed at the brightness of the lights and managed to stagger to the switch to turn them off. I must have went back to bed and fallen asleep, because I woke up ten hours later (around noon). I had no noticable hangover.</p><p>Just from the alcohol, I should have felt no more than a slight drunkenness, and many of the effects I experienced, such as the lightheadedness, are atypical to my experiences with alcohol. On the other hand, I had not drunk for a couple weeks, and it is possible, though unlikely, that I lost my tolerance to such an extent that the equivalent of about three shots of an 80 proof liquor could put me in such a state of inebriation. Further experimentation is needed to isolate the effects of wormwood.</p>"
}
