{
 "title": "Woodrose Ecstasy (My First Time)",
 "author": "iJoe",
 "citation": " iJoe. \"Woodrose Ecstasy (My First Time): experience with H.B. Woodrose & Cannabis (ID 4979)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4979",
 "substance": "H.B. Woodrose & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6 seeds",
   "oral",
   "H.B. Woodrose",
   "",
   "1 hit",
   "smoked",
   "Cannabis",
   " T+ 6:30",
   "1 hit",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "4979",
   "Male",
   "",
   "Not Given",
   "Jan 10, 2002",
   "27276",
   " "
  ]
 ],
 "report": "<p>\nI dosed on six seeds. Removed the woody coating, crushed and coarsely chopped with a chefs knife, swirled the seed chunks in a cup of cold water for a minute. Then I drank the whole thing down, spooning the residual seed pulp into my mouth, chewed and swallowed it. Tasted very plant like -- reminded me of the way chemical lawn fertilizer smells. Followed by 1 bong hit.</p><p>First effects were noticed within half an hour -- I noticed a speedy kind of lightness in my  body, and soon my limbs were very heavy. I kind of felt this very bright energy inside me, as if the plant spirits were sprouting from the seeds and coursing through my veins.</p><p>My spirit guides started outlining the plan for the evening: you have ingested 6 seeds. The first three will act individually -- seed 1 will give you plant perception so that just for tonight, you will experience what the woodrose plant experiences. Seed 2 will help you remember a particular incident in which you were hurt as a child. Seed 3 will allow you to ask six questions of the Ally. Seeds 4,5, and 6 will act together to bring you the healing you have requested (the relationship with my life partner has been strained as of late, because of my angry and destructive behavior and attitude, and I had prayed a couple of days before, for some kind of release, some kind of healing, so that I would not be angry anymore and I could heal my relationship). </p><p>By the end of the trip, these had all come to pass.</p><p>The spirit guides then suggested I focus my energy on my partner; I gave her a massage, and already, at about 35 minutes into the trip, I was becoming aware of my whole body. I could feel every muscle and organ and with my mind's eye, I could calm tensions. I also could locate my partner's tension just by closing my eyes; on my eyelids was a map of her body, replete with zones of tension and energy over and underflux. When I was finished with her massage, she was lying there utterly relaxed. I felt happy.</p><p>Next the plant spirit talked to me. It had the voice of an impatient elder. It said, okay, ask me your questions, but hurry up, you only have five minutes. So I asked my partner if she had any questions, which she did. So she asked me a question, the ally would answer in my mind, and I would recite the answer. After the sixth question, the ally said 'No more questions. Now be still!'</p><p>At this point, around an hour into the trip, my limbs were so heavy and achy that I could no longer stand up. So I crawled into bed. But the music was all wrong (Laurie Anderson), so I just turned it off and listened to my partner breathe instead. At this point, I noticed that my throat and stomach were constricted, and had it not been for the bong hit I would probably be very ill.</p><p>I closed my eyes and I felt my being gently but forcefully sucked into a very pleasant bubble like enclosure. And I just floated there for some time, until I became aware of a dull body ache -- the ache was especially pronounced in my limbs, my hands and feet. My guides told me to practice yoga style breathing and relaxation, and with a little effort, I was able to 'relax' the ache away. And once my body became comfortable again, that's when the waves of ecstasy started hitting.</p><p>When I say 'ecstasy' I mean this experience felt very much like one of the five times I've participated in MDMA ceremonies -- only much more intense!</p><p>I was carried on wave after wave after wave after wave of somatic, psychological, and spiritual bliss. I felt such empathy for the people around me, and I felt love and compassion for people that I had previously mistrusted who had tried to be my friends (this modern life is so good at creating isolated and mistrusting humans). At the peak of the ecstasy waves, I felt an electricity throughout my body, and I felt healed and this great relief deep in my soul. At this point, I could see a dim outline of the ally, swirling, dignified and grand in my bedroom. I offered my thanks and praise and humble gratitude. I think I would have offered tobacco were I able to stand up.</p><p>It was 2 AM. The trip had started about 10PM.</p><p>The remainder of the time, I slipped in and out of sleep, kind of like a feverish delirium. I would wake up from a trance with an unknown word on the tip of my tongue or some vague recollection of some really great idea that had slipped my waking intelligence.</p><p>At 4:30AM I took another bong hit, which curbed the still burgeoning nausea. At 5AM I began reading a magazine, and not quite understanding what the words meant, I put it down.</p><p>At 6AM I crawled back into bed.</p><p>I woke at 7:30AM with severe nausea (so severe I couldn't even get my bong lit), and I had to go to the toilet to gag and wretch, after which I felt better. I had been informed early, by my guides, that puking was actually purification, part of the healing process.</p><p>I felt a bit groggy all day, but I also felt that something had changed in myself -- I felt free and clear.</p><p>So far this week I have been happy, joyous, and free. I plan on participating in HBWR at least once every season, just because it was so purifying and enlightening. </p><p>I would suggest that people who try HBWR (and these other plant spirits), please respect the Ally, and be courteous -- the Ally doesn't want to be our entertainer -- it wants to help us with our struggles. Approach it as you would approach any traditional healer -- with a good heart, good intentions, and a gift (tobacco, food, water etc, or try growing the plant yourself).</p>"
}
