{
 "title": "The Way a Trip Should Be",
 "author": "Dj Washington",
 "citation": "   Dj Washington. \"The Way a Trip Should Be: experience with 4-HO-MiPT (ID 49835)\". Erowid.org. Jan 23, 2006. erowid.org/exp/49835",
 "substance": "4-HO-MiPT",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "4-HO-MiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "49835",
   "Male",
   " ",
   "Not Given",
   "Jan 23, 2006",
   "13328",
   " "
  ]
 ],
 "report": "</p>\nSubstance: 4-HO-mipt\rDose: estimated 40-mg (powder)\rSubject: Height :6'1 Weight : 210lbs\rCountry: Japan, Tokyo\rConditions: empty stomach only having eaten a bowl of cereal in the morning (12 hours prior to ingestion of chemical). Also 4-5 days into new regime of taking a 40-mg pill of isotretonin in the morning and before sleep (had taken one pill of isotretonin in the morning only).\r9:13pm : \nPoured out 100-mg of 4-HO-mipt onto a card and divided it into fifths and took 2/5ths (40-mg) of the substance down with water. Immediately afterwards I began to eat my meal ( a small hamburger, small fries, and small chai tea latte)\r9:18pm :  I can tell something is different around me, but the notion that i actually feel different is more apparent. The drug is already kicking in and is about to take off within the next 2-3 minutes.\r9:21pm : By this time i've been kicked into a total psychedelic trip, and feeling a lot of anxiety and nausea caused either by it's extremely strong and quick onset or because of a chemical reaction to the isotretonin. </p><p>Intense audio distortions are being experienced as everything I say is followed by a loud echo, music is slowing down and changing speeds on it own. Intense open eyed visuals like I've never experienced before are taking place as I notice the walls are shifting though a bright neon color spectrum and every pattern and groove on the wall and wooden floor is in motion and making up their own moving images with each other.</p><p>I begin to try and calm myself down and understand that the nausea and anxiety is more than likely only due in part to the unexpected intensity of it's onset. My friend next to me asks me how I feel and what I'm seeing but I don't feel like talking very much as I feel lethargic, nauseated,and speech is tense. Apparently I look completely fine but I feel the opposite.\r9:25pm: I'm feeling a little bit better and my friend who took a 20-mg dose on an empty stomach as well is beginning to feel the effects. He mentions that suddenly he has become a bit tied and I notice that I am feeling really tired as well, in fact I realized the feeling of tiredness was actually like being heavily stoned (the supposed hashish-like effect of the drug taking place) everything seemed bright and fuzzy, and I was totally relaxed.\r9:28pm:I'm pretty confident in the fact that I'll be okay and my anxiety and nausea has passed. I had barely eaten any of my food (a third of the burger and a few fries) but had lost total interest in it, as well as my friend. We decided that we should go outside and roam the streets of Roppongi. I noticed that the simple task of getting up and neatly cleaning up my table became rather difficult. As we walked towards the doors the room seemed to be distorted and stretched out below me, i felt tall and stretched out and my vision was like an inverted fish eye lense.\r9:30pm: \nUpon walking outside on the streets gazing at all the neon lights  scattered across the buildings around us, and people passing by us in every which direction I realize that nothing really seems to be psychedelic (morphing and moving) but rather as I understand I'm in a dream like state, everything seems to be floating towards me rather than I walking towards it. All white light and colored light is glowing and  fuzzy.</p><p>As we're approached by the typical nigerian club bouncer or whatever, he begins trying to bring us in for a free drink and massaji I begin to laugh hysterically at him as he tries to lure my friend and I into the bar. At this point I am totally thrilled and in awe at the world I am seeing around me, this once completely recognizable place has become some other alien world of the future, like something out of a movie and I was a part of it.</p><p>(I'm not sure if this drug lowers your body temperature but I was able to handle the cold completely fine prior to ingestion, but upon going outside my teeth were chattering uncontrollably and if I clenched by jaw down my leg would begin to spasm. While standing at the street waiting for the pedestrian light to signal, the cold became almost unbearable almost to a point where I swear I felt my vision begin to go and my consciousness into something else.)\r9:35pm: We're on a subway to Shibuya and I realize that the more enclosed of a space you're in then the more the inverted fish eye vision takes precedence. The whole interior of the train is amazingly tinted green. My friend and I jokingly refer to how it looks like the matrix especially with everyone inside wearing their business suits sitting down politely, quietly, like robots. We both mention that time distortion is a definite effect of this drug as the 5 minute subway ride felt like 10.</p><p>From this point on we spent our time in Shibuya sitting atop the second floor of Starbucks gazing out towards Hachiko Station with all the neon signs and people intertwined in their motions. Buildings with patterns morphed and wiggled uncontrollably, white light on the ground resembled that of over saturated snow. Closed eyed visuals were intense as any other psychedelic but I did not play around with that as much as I was more focused on looking at what was going on around me.</p><p>Overall I'd say the peak of the experience was over around 1 or 2 am, but the usual after effects and second nature wiggles and patterns moving on their own lated until 5 or 6am.</p><p>I definately had myself a very fun night, my only problem with the drug is it's duration. The trip after the initial first two hours is breathtaking but not as surreal as the onset which can sort of take away from your enjoyment of the remainder of the trip. If the duration of the intitial hour could be extended then it would be the perfect (already the best in my experience) psychedelic yet.</p><p>for more updaed information on drugs and experiences in japan check out\rhttp://wintertour.royalestarr.com</p>"
}
