{
 "title": "Perked Me Up",
 "author": "MattGillespie",
 "citation": "   MattGillespie. \"Perked Me Up: experience with Damiana & Scullcap (ID 49848)\". Erowid.org. Sep 8, 2010. erowid.org/exp/49848",
 "substance": "Damiana & Scullcap",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 joints/cigs",
   "smoked",
   "Various",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 49848",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 8, 2010",
   "Views: 8796",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had read a lot about a damiana/scullcap combination and was eager to try it out as a substution for tobacco cigaretts. After visiting my local healthfood store, I made four cigaretts at a local park and smoked them over a 30 minute period.  I used a ratio of 3/4 damiana and 1/4 scullcap. They burned quite fast and produced a lot of smoke. The smoke its self went down quite well and tasted somewhat exotic.\r\nAfter smoking my first cigarett, I noticed that I started feeling much more sedentary. When I stood up I felt like I weighed 190lbs. I sat back down after a few seconds and lit up another one. I personally found this effect interesting. I could tell a real difference in the preception of reality, similar to taking a small hit of weed. There was euphoria but not in the sense that would be applyed to nicotne or thc. This type of euphoria is more along the lines of when I am happy I will perk up even more, but if I am feeling 'alright' I will most likely not expirence much. This was not as good as it sounds, mainly due to the fact that I hate to smoke in general, and find the act some what revolting. I thought to myself, this is the type of thing I would smoke when coming home from an exciting day long event with my girlfriend and looking to relax, maybe spoon. Very relaxing, to the point of lazyness.\r\nAs I moved on to my 3rd and 4th cigarett I started feeling depressed of all things? This perplexed me, mainly because I was out having fun with my friends in great spring weather. Looking back I think I smoked too much and that most likely is what pushed me into a depressive state of mind.\r\nI had her many claims that Damiana could make a person sexualy excited. The idea of sex had never crossed my mind the whole time. Once I started thinking about the matter, I realised the ideas became much more vivid. I was not any quicker to excite, but I will say hitting the sack after ingesting some of this herb might make the expirence much more passionate.\r\nAs for ingestion I am going to brew it as tea from now on, so the effects will supposedly last longer, and I dont have to go through the pain of smoking to get them. I cant wait to combine these herbs with weed and see what happens.\n\n\n"
}
