{
 "title": "Merck may be Right",
 "author": "Been",
 "citation": "   Been. \"Merck may be Right: experience with Ecstasy & Sildenafil (Viagra) (ID 4985)\". Erowid.org. Feb 4, 2001. erowid.org/exp/4985",
 "substance": "Ecstasy & Sildenafil (Viagra)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 0:30",
   "50 mg",
   "oral",
   "Pharms - Sildenafil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "4985",
   "Male",
   " ",
   "Not Given",
   "Feb 4, 2001",
   "38991",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThought I would take the time and give you readers my take on the MDMA subject. I started using MDMA two years ago. Started out using only one tab (didn't test it), and was on the roll of my life for at least five hours. The empathy for my partner, and people in general was beyond my wildest imagination. Wanted in the strongest way to be in a sexual situation. My partner was all for it, so we turned off the lights, except for some low background lighting, and headed for the bedroom. What a disappointment to find out that I was unable to perform. My partner was disappointed, but understanding, so we contented ourselves with each other's company.  Not being the type of person to give up easily, especially when i feel that there is some real potential to have the ultimate experience, I did some experimenting. Found out that if I took fifty milligrams of Viagra thirty minutes after dosing one tab of MDMA, the sexual aspects of the MDMA experience could be enjoyed to the max. What times my partner and I had frequently for the next year or so. I would estimate every other week on average for that first years time period. </p><p>Sounds ideal doesn't it? Well the rest of the story tells the whole story, at least as far as I'm concerned. During the two years that we've been using MDMA, it became obvious that the one tab dosage wasn't having the effect that it used to bring. Upped the dosage to two tabs. Helped some at first, then back to very mild effects. Bought a test kit, could be that I was buying bogus E was my thought. The next dosage was tested and indicated the presence of MDMA, or a like substance. Great I thought, the real thing no doubt. Took two tabs and waited for the effects. Pretty mild roll, hummm........maybe weak MDMA tabs. Took another tab, and found that the effects didn't change. What the hell? I've bought bogus MDMA. Meanwhile my partner said that she was rolling pretty well, but not like she used to when we first started two years ago. What to do ? Gotta get that old feeling back again. Purchased fifty MDMA tabs of a known reliable logo from a trusted friend. Tested them with my reliable test kit and found MDMA. Great, Let's get rolling. Guess what? Nothing to get excited about. Even at varying dosages the best it ever got was only a faint shadow of what we experienced not so long ago. </p><p>All of the experience reports that I've read on EROWID over the past couple of years that seem to indicate that MDMA may loses it's effect after a fairly short time ring true to me now. For the longest time, I believed that those people who reported reduced effects and deep depression were exaggerating. Not any more. </p><p>I have to report that I don't believe that I have suffered any serious memory loss problems, but the depression problem is very real to me, so much so that I convinced my doctor that I needed an ssri to deal with a depression that I was experiencing for no known reason. My being fifty years old , he didn't suspect that my problem may have started as a consiquence of MDMA use, but I do. No hard feelings, that's the way things go in life, the panacea that you believe to exist sometimes shows itself to be nothing more than a mirage. So,,,, I take my ssri daily, and reflect on the fact that Merck Pharms may have been right, there may be no practical long term use for MDMA.</p>"
}
