{
 "title": "Comprehensive Analysis of Use",
 "author": "Slugbone",
 "citation": "   Slugbone. \"Comprehensive Analysis of Use: experience with Tramadol  (ID 49872)\". Erowid.org. Jun 24, 2007. erowid.org/exp/49872",
 "substance": "Tramadol ",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 49872",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2007",
   "Views: 6607",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had two years experience with recreational use of this drug in daily use.  I have used it alone and occasionally used with alcohol.  </p><p>The high:  not as strong as Hydrocodone, it has a very pleasant, slow to act effect.  </p><p>1. The first time I tried it I vomited within 45 minutes of  ingesting.</p><p>2. I have taken 300mg at 6pm, and still felt somewhat high the next day when I wake up at 8am.  </p><p>The high:  mostly opiate feel with some speedy sensation. I never felt like nodding off.  This is something I have taken at work all day.  It is a mood enhancer.  I have never had anyone notice I am high.</p><p>Problems: </p><p>1. Urination:  At first, I had a problem urinating.  I had to concentrate and it feels constricted.  It took me 5 minutes standing there to get a stream going. It was a problem for me the 1st 3 months.  My body got used to it because now it is no problem.  </p><p>2. Itching:  at the 200-300mg level I have experienced some itching.  It can be bothersome.  I don't consider it to be too much of a problem, but others may notice you are doing it. Be aware.</p><p>3. Sleeping:  I have had trouble sleeping at the higher levels. I feel very good, calm, buzzing.  However I have had many nights awake thinking the whole night.  It feels good, but too many of those nights have left me exhausted later on.</p><p>4. Maintenance:  If I am without for a period of time after long term use, (and I mean a week) I felt agitated, and restless without it.  </p><p>5. Mixing.  I have taken this with alcohol. I am very tolerant to both alcohol and tramadol, but I would not drink more than 2-3 drinks while taking tramadol.</p><p>6. Overall:  I have used daily for 2 years now.  It is a solid, workman like high.  I can dictate how high I want to get, from a good buz at work to very high on the weekends with careful monitoring.</p>"
}
