{
 "title": "My Big Scare",
 "author": "Chris",
 "citation": "   Chris. \"My Big Scare: experience with Dimenhydrinate (Dramamine) (ID 499)\". Erowid.org. Jul 18, 2000. erowid.org/exp/499",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "20 tablets",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "499",
   "Male",
   " ",
   "Not Given",
   "Jul 18, 2000",
   "15473",
   " "
  ]
 ],
 "report": "<p>\nI had heard about Dramamine from a couple of my friends.  One who had tried it and one who hadn't.  So we said what the hell and gave it a shot.  One night we went and acquired some of this wonder pill and set out for our trip.  That night we took about 8 pills to start off and some Two-ways (Ephedrine) to keep us perky throughout.  Well...about a half hour into it and I just got this rush over me.  It was hard to move and I couldn't really concentrate on too much.  I would want to move but it would seem so hard I would give up.  Then all of a sudden I was fine...like it was over so i got disappointed and took 12 more.  </p><p>Time passed on and on and on and I started to feel the way I did before but not as intensely.  I'm not exactly sure when it happened, but after one of my friends had left, he came back and stood before me talking to me (He wasn't really there though) I began to answer back to him and my other friend was wondering who I was talking to.  I then turned back to my friend that wasn't there and he was indeed not there any longer.  So I just smiled, because that's what I do when I realize the drug I'm on is working.  </p><p>My friend and I soon began laughing hysterically because we couldn't keep a conversation going in one direction.  Nor could we remember what we were talking about when we needed to clarify something.  I would think of what I wanted to say and it would be there when I said it.  It was like the whole thought itself came out when I talked and I would forget what I said right after I said it.  Time passed on and a bunch of failed conversations and friends who weren't really there instances later, we decided that it was done and we decided to call it a night.  Damn was I ever wrong.  I woke up and it was still dark out.  There were so many people in the house.  They were all my friends too.  It didn't occur to me at the time that everything that happens from here on out wasn't real.  All of my friends were really mad at me.  I had no idea what I had done wrong.  They were yelling and threatening to beat me up and they kicked me out.  So I went outside to get away from it all.  It was cold out but I didn't really notice it (Or I just didn't care) I walked around the yard trying to figure out what had gone wrong to make them want to do those things to me.  </p><p>As I was walking around, I would see them outside and I would hide to do my best to avoid them at all costs.  I was really scared.  I went out to the driveway and stood there, watching everything that happened, I saw a moving truck behind the trailer with all my stuff being thrown into it.  I saw my friends move in and out of the bushes and jump around in the trees like it was nothing.  Like no human could possibly do.  I saw my friends come and go (None of whom really came or went).  </p><p>(This really happened) My roommates ride for work showed up and asked me why I was outside so early in the morning and I told her that she would find out. My roommate walked out but I assume he didn't see me and they drove off.  After he left, I decided to go bake inside since I figured everyone should be gone and I could get some sleep before they came back.  I wake up, still thinking I got kicked out, and I call my dad telling him I had a big problem and I really needed to talk to him.  That whole time I was pacing back and forth trying to figure out what I was going to do.  My friend woke up later on that morning and I told him about what happend.  He just laughed and told me that it couldn't have happened.  After much thought and deliberation on my part I realized that none of it was real.</p><p>It didn't occur to me at the time that no one could do what they were doing, a moving truck couldn't fit behind the house, and that there were no cars in the driveway for all these people to be here.  So I started laughing myself.  Then the phone rang.  It was my dad wondering what had happened that was so important.  I had no idea what to tell him.  So I told him I had had one of those dreams again.  He knows about them.  I have dreams that appear very real every so often.  Not as real as this Dramamine induced one though. Not nearly as real feeling.  I've done Dramamine one other time and I pretty much did the same thing as far as talking to people that weren't there, living expieriences that weren't really going on, etc. </p>"
}
