{
 "title": "Intense Sadness and Analyzing My Personality",
 "author": "Psychedelic*Dreamer",
 "citation": " Psychedelic*Dreamer. \"Intense Sadness and Analyzing My Personality: experience with DOI & Various (ID 49906)\". Erowid.org. Jul 25, 2006. erowid.org/exp/49906",
 "substance": "DOI & Various",
 "bodyweight": "274 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "14 mg",
   "oral",
   "DOI",
   "",
   " T+ 5:50",
   " ",
   "smoked",
   "Salvia divinorum",
   "",
   " T+ 9:30",
   "3000 mg",
   "oral",
   "Pharms - Gabapentin",
   "",
   " T+ 9:30",
   "2 ",
   "oral",
   "Poppies - Opium",
   "(plant material)",
   " T+ 9:30",
   "30 mg",
   "oral",
   "Pharms - Amitriptyline",
   ""
  ]
 ],
 "footer": [
  [
   "2005",
   "49906",
   "Male",
   "",
   "Not Given",
   "Jul 25, 2006",
   "20308",
   " "
  ]
 ],
 "report": "<p>The dose I took is pretty high. Some people would probably trip for several days from that amount. Maybe have bad side effects.</p><p>Don't start out with such a high dose, start low and work up gradually. I will probably not take more than 10mg in the future because it does not increase intensity much. Just duration. Most will find 3-4mg to be enough.</p><p>This trip was several months ago. It was the fourth time I used DOI, if I remember right. It was also the highest dose I have taken and I don't think I will go this high again. This is where I started to notice the side effects, though they were not very bad. Did not seem much more intense than 10 or 12mg.</p><p>Nothing really interesting happened, my earlier DOI trips were more interesting but I did not take any notes in those trips. I started taking notes as soon as I ingested the DOI this time and was expecting the trip to be like the earlier ones. (Out of body experiences, extreme clarity/cosmic understanding etc.) Instead, it was mostly spent dealing with difficult emotions and analyzing my personality.</p><p>My mood at the time I took the DOI was slightly good, near neutral.</p><p>I take two prescribed medications, Ziac for high BP and Gemfibrozil for high triglycerides. Neither is psychoactive.</p><p>9:00pm</p><p>I ingest 14mg of DOI. My mood at the time was pretty neutral.</p><p>9:30pm</p><p>I am starting to feel it.</p><p>10:15pm</p><p>Up to a med +2. I am starting to feel depressed. Moderate typical psychedelic visuals.</p><p>10:30pm</p><p>Up to a weak +3. Visuals are quite strong. My mood is getting worse. I also feel some nausea and anxiety.</p><p>11:00pm</p><p>Up to a strong +3. Nausea has increased. Feeling intense negative emotions.</p><p>11:15pm</p><p>It keeps getting stronger, I am starting to wish that I had taken a lower dose or none at all. Bad memories are starting to surface.</p><p>11:34pm</p><p>My mood is very depressed. The intensity is overwhelming. I feel a feeling of awe for a moment, everything looks so beautiful. The visuals are incredibly beautiful. Intricate patterns, rainbow streaks and particles shooting/swirling around. With eyes closed there are landscapes that are a mix of realistic places (mountainous areas, jungles,grassy areas and animals) and fractal images. They are mixed in the same image/mind movie. The beautiful visuals do nothing to improve my mood.</p><p>11:35pm</p><p>I start to feel myself being dissolved. I am slowly slipping away, this is improving my mood, but still lots of sadness. At the same time there are brief moments of joy. The dissolving feels pleasant and strange. It is my mind and body dissolving, the beginning of an OBE and maybe ego loss.</p><p>12:46am</p><p>Getting creepy thoughts and negative emotions. A few minutes ago I was very euphoric with orgasmic pleasure.</p><p>1:35am</p><p>All i can think about is how everyone I love will die and how much pain I will feel when it happens. The only losses I have dealt with are dying pets and friends who've moved away or stabbed me in the back. The pain was so bad that I've chosen to be alone, so I don't feel that again. I haven't had a friend in years.</p><p>Even the death of pets and loss of friends was so painful that it made me want to kill myself. When I was 11 my cat died and I ate a bunch of tylenol pills in a half-assed suicide attempt. It made me sick but I did not die and nobody knew what I did. I can't imagine how bad it will be when a close family member dies.</p><p>Ever since I was 4 or 5 years old I tried to avoid the pain of loss and avoid any relationship that may cause pain. Avoiding the pain of loss has always been the most important thing. Even if that meant having no friends. I don't know why I am like this. It seems like something bad happened a long time ago but I am told that there was nothing. Maybe it was something that seemed horrible to me but not anyone else. I can remember a lot of sadness from early childhood, but don't know the source.</p><p>I know that I need to change my behavior and my outlook on life, and I have tried but never succeed. I am not normal, I don't know what is wrong with me. I have always been weird and don't know why. My emotional responses are not normal. I feel distant from everyone, even my family. I've felt this way to some extent as far back as I can remember but it started getting worse about the time I turned 8. It kept getting worse for years and now I am stuck like this.</p><p>I have tried to open up and connect with people but it just seems impossible for me. I can't get close to or form any relationship with another person. I think I have some kind of personality disorder. I feel that it will always be like this and I will be alone for the rest of my life. I am feeling nothing but sadness and loneliness right now and I want to be with someone for a while. It would probably improve the trip.</p><p>1:55am</p><p>I just keep crying. Although I feel sad, I don't consider this a negative experience.</p><p>Earlier I felt myself dissolving, but it did not finish. It feels like part of my mind and personality has weakened or gone away. The bad parts were left here, the good things are gone.</p><p>4:20am</p><p>For the last hour I've felt okay, before that I was dealing with the same thoughts and feelings from earlier. I may end up having some fun in this trip. My mood is improving. I can now feel something good now, before it was nearly all negative.</p><p>2:50pm</p><p>I smoked some salvia, visuals increased, psychedelic clarity gets strong and there is intense euphoria. Everything is so beautiful. In this trip the visuals have all been beautiful, no insects or gory bloody goo with body parts and eyes. Even at the deepest sadness/despair I felt earlier visually it was very beautiful and all good.</p><p>I am happy and at peace with myself. All is good for me at this moment. I am still at a +3 but I am coming down some.</p><p>6:30pm</p><p>Last few hours have been good. No deep insights but I do feel a connection with everything around me.</p><p>I took some neurontin, ate 2 large poppies + 30mg of amitriptyline and 8mg of tizanidine to get a nicer opiate high/more sedation so I can sleep in a few hours. Still tripping, +2/+3 borderline, probably weak +3. Visuals have decreased but with eyes closed can see mountain landscapes with pine trees, snow on the trees and mountain. The images are dark without much color. They move and change slowly.</p><p>9:00pm Down to a +2, I fall asleep around this time.</p><p>3:30am I wake up, probably still a weak+2, maybe strong +1. Still some light visuals. I go get a drink and fall back to sleep within 30 minutes.</p><p>6:30am: I wake up, feeling slight effects of the DOI and the meds I took last night. Mood is good, body feels fine. I'm a little tired and my mind is just a little foggy or slow. This is probably because of the meds, lingering DOI effects, and tiredness.</p><p>For the next couple of days, my mood was better. Not as depressed as usual.</p>"
}
