{
 "title": "Extra-Dimensional Feedback",
 "author": "inviso-bill",
 "citation": "   inviso-bill. \"Extra-Dimensional Feedback: experience with Salvia divinorum (ID 49915)\". Erowid.org. Apr 14, 2008. erowid.org/exp/49915",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.25 mg",
   "insufflated",
   "Pharms - Alprazolam",
   "(ground / crushed)",
   "  T+ 0:20",
   "  ",
   "smoked",
   "Salvia divinorum",
   " ",
   "  T+ 0:00",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   " ",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(daily)",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Nortriptyline",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 49915",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 14, 2008",
   "Views: 3941",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSalvia was aquired from a less-than credible source. It was assumed to be 'Salvia divinorum'. It appeared as a dark-brown to black 'plant like' substance. The source implied that the amount was two 'hits'. Physically it appeared as a small pile, approximately the size of an American or Canadian penny.\r\nOther substances in effect at the time of administration (TOA) were:\r\nA continued regiment of\r\n-Amitriptyline 10MG TAB orally daily\r\n-Nortriptyline 10MG CAP orally daily\r\nNo strict regiment of\r\n-Alprazolam 0.25MG TAB 'sniffed' by the nose (20 minutes prior to TOA)\r\nA small amount was placed into a pipe and smoked to 'test the water' and then soon after the rest of 50% of the pile (one 'hit') was consumed.\r\nThe user's report is as follows:\r\nI immediately felt very rigid. It was hard to move my arms or legs without giving twice the effort for half the dexterity. I sat frozen in my chair, arms on the armrests. I could see that the whole room was filled with translucent cubes, as if someone played the perfect game of three-dementional tetris with my room and had trapped me inside it. I sat for what must have been a half second physically frozen in place with my percieved hallucination.\r\nAfter that half second, the third-demention fractured. The experience was so alien that I still now (two days later) struggle to describe it. I could percieve objects in the room from angles that were previously impossible for the human mind to comprehend. Every influence on my being indicated this assumption. My movement was restricted because I had no idea how to move through any other dimension than the third (our dimension, consisting of 'length', 'width', and 'height'). I somehow managed to turn my head to the left, and saw what could only be described as 'extra-dimensional feedback'. What could be seen was a fractured image of myself sitting in a chair, beside myself sitting in a chair, beside myself sitting in a chair, beside myself sitting in a chair, on and on, further and further away, off into the distance. The somewhat same effect can be achieved by pointing a video camera at the television it's hooked up to. What I sensed and felt was that all of these visual copies of me, were the same entity, myself. I was fractured too, along with the rest of the extra-dimensional jungle gym that was previously a third-dimensional room. This entire experience ran the course of what could only be no more than three or four seconds. As fast as the dimension shattered, it came back again, and my senses returned to normal.\r\nThe other hit was smoked immediately after, but the same effect could not be achieved. The time and duration of this experience was not marked.\n\n\n"
}
