{
 "title": "Parallel Universe (Deja Vu?)",
 "author": "BoneThugLove",
 "citation": "   BoneThugLove. \"Parallel Universe (Deja Vu?): experience with Cannabis (ID 49937)\". Erowid.org. Apr 5, 2008. erowid.org/exp/49937",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2005",
   "49937",
   "Male",
   " ",
   "Not Given",
   "Apr 5, 2008",
   "3121",
   " "
  ]
 ],
 "report": "<p>When this experience occured I had already gone through various experiments with weed, and was used to the mind altering effects. The story begins when I was hanging out with a couple of friends, hitting the bowl. We had been passing it back and forth taking deep hits of the bud, which was extremely potent. We had been smoking for a while and I had yet to feel the high set in so I kept smoking. We finished off the herb and started to walk down the street, slowly my mind oozed into a dream like state, which was considerably pleasent. </p><p>We had reached my street and as I looked around I noticed a house that seemed to look exactly like mine except completely backwards, also the houses around it were similar to those around mine. At that moment  I could only think that I was in a universe that contradicted the one that I was in while I was sober. I told my friends my thoughts and they all seemed to agree. I then had a vision, but not a halucination about the future. In the vision we were sitting in my neighbors driveway at night rolling a joint when a cop car pulled up. At the time I thought nothing of it and proceeded rambling about my parallel universe.</p><p> About 10 minutes later we were in my neighbors driveway and one of my friends suggested rolling a joint,it was then I remembered my vision,  told my friends that this was my vision and we had to go somewhere else, but everyone was stoned and had lost all motivation to move. I made them move and we went so someones back yard, about 5 minutes later I saw I cop car drive down the street with a spot light going really slow. It was amazing, I still dont no if it was just deja vu or the weed?</p>"
}
