{
 "title": "Finding My Way",
 "author": "Hold Your Colour",
 "citation": "   Hold Your Colour. \"Finding My Way: experience with Cannabis (ID 49949)\". Erowid.org. Apr 20, 2008. erowid.org/exp/49949",
 "substance": "Cannabis",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 49949",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 20, 2008",
   "Views: 3347",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience is more or less how I came to grasp the true strength and power that weed has. Before this particular session I felt I had only really scratched the surface of the true potential of this wonderful plant, and had only really felt just above threshold feelings. This was probably one of the reasons I went above and beyond the amount I would usually smoke.</p><p>I'm a 16 year old white male, not on any medication, without any (known) allergies and on this particular night, I had the house completely to myself. As soon as I was alone I grabbed the almost completely full baggie of bud and proceeded to get my shit together in preperation to enjoy. Although my parents were particulary bohemien in my upbringing, especially my mother of whom I speak openly about drugs with, I felt it was best to hide my smokables and such from them. I feared that if my parents found my weed I would almost certainly be sternly told 'I'm not mad, I'm just dissapointed' which hurts so much more, so naturally I wanted to avoid this as much as humanly possible. So, to recap, I have weed, equipment to make a smoking device and a free house for a good 12 hours.</p><p>I proceeded to go to my bathroom were I began to make the gravity bong (or 'waterfall' as they are called over here) that would no doubt insure numerous good times. I stuck the cone piece in the lid ensuring it was sealed and set about burning a small hole in the bottom of a 1.25 litre pepsi bottle. You may or not know the workings of a gravity bong, but I'll explain anyway. A waterfall works on the principle of water draining and sucking air through the cone piece screwed onto the bottle. As you light the cone piece (filled with weed duh), the water draining from the hole in the bottle will suck the smoke down from the burning weed into the bottle were your left with a bottle filled with condensed smoke, remove lid and suck the smoke in making sure the hole in the bottom is open. </p><p>So now I was ready to take my first waterfall cone of the evening. I lit the cone piece and let the water drain, watching in awe as the bottle filled with thick, creamy smoke, quite a sight indeed! As the water neared its end, I regulated my breathing, unscrewed the lid and took the hit. Now 1 cone is 1 cone, nothing more. It will slow me the fuck down and I would probably notice a change but I wanted something more. I was aware that 3 waterfall cones would get the average person completely fucked up. I decided to up the anty 2 or 3 more cones, for better or worse.</p><p>As 1 became 2 and 2 became 3, I started to notice my bathroom sink and the items which inhabited the area around said sink becoming very interesting. At times I would have to snap myself out of my glazed stare to fill up the bottle again or pack another hit. By the 4th cone I was coughing like a coal miner and felt the need to sit down and asses were I was. It was either brave or stupid to ignoring my physical needs and push onwards for 1 or 2 more cones. After going the extra yard and taking 2 more hits (A total of 6 waterfall cones for those of you not keeping score) I went out to where I spent most of my time, The computer/TV area and looked to see who was on msn.</p><p>I first started to notice something was up when the computer monitor was alot brighter than usual. When I say brighter than usual I mean it was almost impossible to look at. My eyes could not focus on the intense light emmited from it and after looking away to the TV to see what was on, the full realisation of what I had done began to set in. My vision had no chance of keeping up with my head movement, The trails became more and more intense until they were thick and pronounced. This was were I started to bug out a little bit.</p><p>This was unlike anything before. I began to realise that I was alone in the middle of this intense high and began to worry a little bit. After this experience I found that this particular weed comes on relatively slowly compared to others. It took a good 25 minutes for the full high to come on. I started to stress about what I had done and more importantly where I was going. My thoughts were muddled and confused. I found this experience drew parallels with the come up of MDMA of which I had used for the first time on new years eve 2 weeks previous. As the high took hold, for no apparent reason I began feeling very, very uncomfortable with my surroundings and went to my room. I got to my doorway when I started watching TV to direct my attention away from the strange things going on in my head.</p><p>My thoughts soon drifted back to my original feelings of dread and I began to feel scared and alone once again, not sure if I would come out of this experience unscathed or not. I stood in the door way of my room for 5 or so minutes, not being able to make up my mind to turn out the lights in my room and lie under the blanket, or to try and watch tv and let these horrible few minutes pass. Eventually common sense prevailed and I went out to my living room to watch TV. Although I don't remember what was on I believe it was of the comedy qenre and it was fucking, fucking funny. I laughed till I could laugh no more.</p><p>This really helped me control the high I was experiencing and I soon felt good enough to try and get some kind of dinner together. Nachos baked in the micro-wave seemed a good idea. Requiring only 3 ingredients, Nacho chips, salsa and cheese, I didn't think It would take the 30 minutes it took for me to gather my thoughts long enough for me to assemble the nachos. My mind was constantly distracted. I soon became fascinated by the way my arms looked hanging at my sides. If I kept my eyes straight, the look of my arms flailing around in space in my peripheral vision was a very interesting sight.</p><p>At this time I had my bass amp hooked up to my computer and I was able to play songs through it with good results. I had been listening to pendulum and as I let the drum and bass beat intice and entrance me, then it dawned on me, I was in a music video! My warped vision helped perpetuate this feeling and I began to feel a bit like I was in the music video for The Prodigys 'smacked my bitch up'. I grabbed my nachos and began to eat. I had begun to feel intense rushes of energy in my body that went from my head, in particular from my right ear down to my feet. The feeling was momentary but it was quickly proceeded by another rythmic rush of energy.</p><p>I began to notice that If I saw something which prompted me to remember how fucked up I was, be it how my arms looked or how intersting a nacho chip was, I would feel another rush of body energy. It was like the weed was rewarding me with this feeling for embracing what it had done to my mind. This was a very pleasant sensation I thought as I sat, slumped and glazed eyed on my couch. This is were I spent most of my night, I mean, I couldn't really think about doing anything else, let alone expending energy on something frivolus like moving around.</p><p>I enjoyed just sitting and letting the high come and go, just watching TV and letting time slip away unnoticed. Of course I could have done something creative like play a musical instrument, or written a poem or something, but me and the weed both decided that just sitting and enjoying was probably the best thing to do at that moment. So that's what I did.</p><p>To summarise, After this particular session, I feel I have really unlocked at least some of the vast potential of mary jane. After a relativly rough couple of minutes easily on par with and MDMA come-up, the good most definatly out weighed the bad. I still feel I have alot to learn about this particualar plant and its uses beyond just getting fucked up, but for now getting fucked is fun and I will continue to (hopefully) use this plant recreationaly again many more times.</p>"
}
