{
 "title": "Grasping, Letting Go, and Nirvana",
 "author": "Link",
 "citation": "   Link. \"Grasping, Letting Go, and Nirvana: experience with LSD (ID 49943)\". Erowid.org. Dec 31, 2006. erowid.org/exp/49943",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2005",
   "49943",
   "Male",
   " ",
   "Not Given",
   "Dec 31, 2006",
   "Views: 4800",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was fairly late one night in the early summer. At around 11:30 my friend Matt and I decided to stay up late and partake in an LSD experience. What I had was actually one really large square on the plain kind of blotter without pre-sized squares, and it was about 2 large hits' worth. Anyway, we decided to go for a walk to compliment the onset of the experience.  The setting was a pleasant residential area.</p><p>Walking on the sidewalks was great.  We talked the whole time, but I don't remember any of the subjects now.  Both of us kept forgetting what we were talking about. It was really funny in the beginning, but after about the 4th or 5th time you could say it was kind of getting to us.  It was strange how it kept happening to both of us. The conversations shifted towards our memories, long-term and short term.  Matt had the notion that we should carry notepads from then on and constantly write down thoughts that we wouldn't want to forget, so that we would have a lot of information to review when we were older, most of which we would have forgotten by then.  Seems like an okay idea, right?</p><p>After that moment, there was a long period of time when we both kept forgetting what we were talking about.  It was a loop, we kept finding ourselves with no memory of the entire hours-long conversation.  'What were we talking about, seriously?  Something about memory... uh...?'  and then we would both laugh about how we kept forgetting about forgetting.  It was a very bizarre thing to be happening to both of us at the same time.  I've wondered if Matt was just messing with me, but now for some reason I don't believe it's true. Hopefully that'll make more sense when you're done reading.</p><p>Well we came to the conclusion that all the frustration was coming from our grasping at our memories.  We were thinking that we somehow could and should improve the memory parts of our brains and get some benefit to our knowledge, or wisdom.</p><p>Something we learned that night was that we shouldn't try to control our own memories. They'll naturally fade away, which is okay.  Everything that is natural is ultimately okay.</p><p>On a deeper level, we learned how to let go.  Our memories aren't the only part of us that come and go naturally and spontaneously. Actually, I believe every aspect of our lives occurs somehow spontaneously and beyond 'our' control.  Basically, when we become self-conscious and grasp at ourselves and try to somehow control our natural processes, we go against the course of nature. We seem to do it because we want to make our minds more trustworthy.</p><p>Months after our trip around the merry-go-round, I read The Way of Zen, by Alan Watts.  In it, Watts describes the liberated person basically as someone who has seen the fruitlessness of grasping at oneself and stops trying as a result.  According to Watts, that's what's called Nirvana.  The opposite of frustrating self-consciousness.  Of course many thinkers have attached other ideas to Nirvana but mainly the idea is liberation from the whirlwind of trying to figure everything out.  </p><p>That was the state we were in when we finally said 'Forget it!' and relaxed. We figured, 'you just forget it, but don't TRY to forget it'. We didn't even discuss it or think about it much.  We didn't have to TRY to relax, we just let go. It was perhaps the greatest, most peaceful moment of my life.</p><p>Our nerves were calmed, and I noticed the glow in the sky that comes before the sunrise.  I realized we had been in Matt's bedroom most of the night, so we decided to go outside and experience the twilight.  It was magical.  With the knots in our minds blissfully unraveled, we immediately discovered an appreciation for the Here and Now.  A strong focus on the present actually turns out to be a common type of mystical experience. We'd never heard of anything about that before this time.  It just came naturally.  We both had an enormous sense of being present and purely, clearly aware.  It was an amazing experience beyond words. Just for fun, I'll say it was rather like sharpening a fuzzy picture, or wiping the dust off a mirror and feeling like 'oh yeah, that's how it's supposed to look'.  It was a very brilliant, glowing state of consciousness that still lingers today.</p><p>I could feel the LSD in my system again now that I was fully aware. I suggested to Matt that we get up off the porch and explore.  We went to his backyard and by then the sun had been up for a while, so everything was glistening with the dew. </p><p>It was marvelous.  We observed the nature there... bugs and birds, all kinds of plants around us, and the smell, the feeling, taste of the fresh morning air.  Everything we could sense simply came to us naturally, just like it's supposed to. We didn't have to listen for sounds or look to see.  Just being aware and present in the Here and Now, a most fundamental part of life, became ecstatic and without any certain drive to do so for some meaningful purpose.  It was a lot like dancing.  For the first time since we were children, we were alive.  Brightly, blissfully, being.</p>"
}
