{
 "title": "Like a Cracker",
 "author": "CrackerMaker",
 "citation": "   CrackerMaker. \"Like a Cracker: experience with Morning Glory (ID 49982)\". Erowid.org. Feb 11, 2008. erowid.org/exp/49982",
 "substance": "Morning Glory",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "300 seeds",
   "oral",
   "Morning Glory",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2005",
   "49982",
   "Male",
   " ",
   "Not Given",
   "Feb 11, 2008",
   "Views: 7773",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a simple way to make a morning glory cracker.  What I did was take about 300 seeds (for this process it doesnt matter if chems are used on the seeds, however I would feel more comfortable with clean seeds) put the seeds into a cup of water and put the cup in a dark place over night.  After 24 hours pull the seeds from the water and let them sit on a paper towel until they are not dripping wet.  You don't want the seeds to dry completely. After drying the seeds one can very easily remove the husk.  I have found that the husk causes most of my stomach pains.</p><p>Once you have taken all the husks off the seeds put the seeds back into a clean cup of water, put the cup back in the dark for another 24 hours. Take the seeds out and put them on a paper towl like you did the first time.  The seeds have likely doubled in size.  Take a razor and chop the seeds up into a substance that has the consistancy of sawdust.  While the seeds are still white and slimy you need to put them into a mold. What I have used in the past is an empty altoid Tin.  Place the chopped seeds into the tin and use a paper towel to apply pressure.  This should get rid of most of the extra water, and will also compact the seeds.  Put the tin away for a few days and don't touch it!</p><p>You can tell when it is done when the substance looks dry and like a cracker.  I haven't found a good way to remove the substance from the tin, however if it comes out in 2-3 pieces...meh..  You can eat the cracker on its own, it tastes kinda like a wheat cracker! Peanut butter also works.  Ingesting MG seeds this way is ideal for me. The taste of eating raw seeds makes me gag;  It is a very easy way to remove the husk of the seed, thus eliminating stomach pains; it is very easy to make, as opposed to extracting the LSA; And it is very potent.</p>"
}
