{
 "title": "The Typo Speaks Louder than Perception",
 "author": "Minimal",
 "citation": "   Minimal. \"The Typo Speaks Louder than Perception: experience with Aniracetam & Piracetam (ID 49995)\". Erowid.org. Jun 24, 2006. erowid.org/exp/49995",
 "substance": "Aniracetam & Piracetam",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1600 mg",
   "oral",
   "Piracetam",
   "(daily)",
   " ",
   "1500 mg",
   "oral",
   "Aniracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 49995",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2006",
   "Views: 20402",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I only began taking both piracetam and aniracetam yesterday, and since I was unsure of how long they need to take effect, I decided to give it another day or so to make sure that I waited long enough for them to take effect, and that I experienced the effect long enough so as not to be placebo.  I realize that might not be a proper scientific way to go about things, because I think the placebo effect can work for a while, but it's how I decided to do it, so anyways...</p><p>I researched both of these chemicals before buying them and as such, I'm worried that I might be perceiving things that others ignorant of the chemical might not, that being said, I believe they are definitely having an effect on me.  Both today and yesterday I took them before school.  I have school relatively early in the morning for me (10 am), and I am not a morning person.  In both cases, I have noticed a significant increase in my attention and perception, but one that is able to coexist with my tiredness, in a way.  It's a very unique feeling.  I feel that with piracetam and aniracetam, they have almost been able to pick and choose out of those possible effects, narrowing the field of action.  For instance, my perception and attention are significantly heightened, but I actually feel a decrease in emotionality.  I suppose it's like becoming a bit more like Spock.  I was a little hesitant to report this aspect about it, because I was wondering if at first I was just perceiving it , but it is definitely the case for me anyways.  Though I noticed that it decreased throughout the day, yesterday, around this time (morning) I felt very similar, just like I was perceiving things without emotional context, but that waned throughout the day.  </p><p>My heightened attention and perception might have waned throughout the day as well, but I wouldn't have noticed it so dramatically because I wasn't at school anymore, so I wasn't exactly in the kind of environment where you can notice such a significant change.</p><p>I feel like I process things faster, and am more aware of them. Though I've noticed I've been making more typos.  I'm not sure if that's just me being more aware of me making the same amount of typos as before, or me actually making more typos.  I realize that's getting pretty anal about things but I don't know whether it transfers out into other motor areas as well.</p><p>For me, piracetam and aniracetam aren't measured in terms of good or bad, they just are.</p>"
}
