{
 "title": "Experiences with Gasoline",
 "author": "BenTheWorm",
 "citation": "   BenTheWorm. \"Experiences with Gasoline: experience with Inhalants: Gasoline (ID 50)\". Erowid.org. Sep 10, 2000. erowid.org/exp/50",
 "substance": "Inhalants: Gasoline",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "1996",
   "50",
   "Male",
   " ",
   "Not Given",
   "Sep 10, 2000",
   "23852",
   " "
  ]
 ],
 "report": "</p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>A few years ago, I used to inhale gas for a buzz.  If you are thinking of trying this, let me tell you.  The effects are AWESOME, short lived, but NOT AT ALL worth the damage it does.  </p><p>Good expierence:</p><p>On night I was home alone with my brother.  There was nothing to do so I went out to the shed filled a baggie 1/4 full of gas and started huffing away.  I must have been huffing for about 10 minutes when I had the wierdest expierence I've ever had.  I was sitting in the back room buzzing my brains out and I passed out.  I had a dream that an apparition or ghost floated to where I was laying and took my hand.  It told me it wanted to show me something and led me into the front room.  I then woke up and found my self laying on the couch in the front room.  In writing, it sounds kinda lame, but expierencing that BLEW my mind because it seemed so damn real.  Since then I have tried a few other drugs including weed, lsd, speed, and have never had an expierence like that where I completely lost touch with reality.</p><p>Bad experience:</p><p>I was out in the shed huffing gas out of a detatchable vacume tube when the tube slipped down into the gas and I sucked a whole mouthful and swallowed it.  After the effects wore off (about 2 minutes) I realized what I had done and began to panic.  I thought I was going to f@!# die of poisoning. So after about 10 minutes of puking my guts up (and by the way, puking up gasoline is somthing you NEVER want to do, let me tell you about the burning all through your nose and throat and the smell/taste)I went on the Internet and looked up gas poisoning and found a remedy to counteract it.  It consisted of something like burnt toast, Milk of Magnesia, milk, and some other ingredients.  Well, I thought it was a little weird, but I'm alive still so I guess it worked.  After that expierence, I could not stand the smell of gasoline.  Even to this day, I still feel a little nauseous pumping gas.  And I have never since stooped to the inhalent level of getting high.  All of that was not worth the trauma and the fear of dying. </p><p>LSD and THC ONLY for me ;)</p>"
}
