{
 "title": "Fragmented Consciousness: In & Out of Time",
 "author": "Factor 6",
 "citation": "   Factor 6. \"Fragmented Consciousness: In & Out of Time: experience with MDMA & Ketamine (ID 500)\". Erowid.org. Aug 7, 2000. erowid.org/exp/500",
 "substance": "MDMA & Ketamine",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:30",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "0.125 g",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 500",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 7, 2000",
   "Views: 8981",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had settled down one Friday evening in January and had planned on doing some traveling thru my mind. I ingested a tab of E and waited for effects to come on. maybe I was impatient or the E wasnt as good as I wanted it to be. Anyhow, I ended up swallowing 2 more tabs, which isnt for everybody, but im a big guy 6'6 and 240 pounds and I like E. By the way that was about 1.5 hrs. after I took the first pill. Next thing was to snuff up that special K ( about an eighth of a gram ). At the time I had been watching a movie I had rented (RUN LOLA RUN- kick ass movie I might add). Effects of both E & K were kicking in real good at this time and I seemed to be in this movie! I made it thru the movie(barely) with out going into the K WHOLE. I put on the radio and and snuffed another eighth of K. My consciousness completely melted out of time and blended into everythingness and nothingness. I think at this time I nodded out for bit- I wuz really high,low,in,out,and everywhere & nowhere,in other words INEFFABLEY FLIPPIN ! <br>The effects yielded enough to bring me back to partial consciousness. I had thought that everything was alright and then the other wanted to show me more. Time at this point had entered back into my consciousness but it was like some sort of Quantum Time. Time in packets of data moving thru my whole being in waves of an unspeakable energy. At this point ihad the feeling that everything in my life (down to the smallest insignificant happenings) had led to this moment. The intensity of the energy was steadily increasing and luminescence now entered the happening. All of this increased to unimaginable proportions-similar to that point on a great rollercoaster ride when you think you just cant take any more, but infinitely, extremely, Godpower-INFINERGY. Next everything was alive - my room, stereo, computer, pictures, bed, and me!  this INFINERGY continued thru me and everything -then started expotentiating time into those packets which grew like crystals all over everthing. the crystals struck some kind of paranoia in me, as if I had some how changed reality as we generally know it. I thought maybe I caused a riff in space time--that every agency that would handle somthing like that was outside and on there way to my place. <br>The notion that I had started the end of history and the beginning of forever also crossed my mind. I was becoming scared and the other turned up the juice even more and I definitley merged with 'GOD', I was God, for a moment,so I thought! Now forces of even greater power, in my moment of bliss, forces of good, then bad, then indifferent, then altogether worked to put all those crystallized packets of time back where there supposed to be. This did seem to take a little time. Somehow I felt like I had caused some very, very powerful forces to put in some overtime. I feel indebted to them and would like to thank them very much for putting reality back together. The waves of the energy packets were still laced with time as they moved thru my body. I was able to stand up at this point (the walls helped keep me up), as I walked to my bathroom i was coherent but the waves were still flowing thru me. I walked like a robot. different times were at different places in my body! I did worry that this wasnt going to dimminish-and I was going to become a research project. Well if your wondering, it did ware off but I spent all Saturday in bed integrating the experience. I'll end this report with some words of wisdom - It never ends folks-anything & everything that ever was forever will be was first a thought! Unless you know someone or something that knows everything ; ITS ALL MAGIC,AND GOD IS MAGIC BE A H.E.A.D. WERE HERE TO COCREATE!<br>NOTHING(nothingness) IS PERFECT & FOREVER<br>Thats my spew -till next time(s)\n\n\n"
}
