{
 "title": "Legal And Lovely",
 "author": "little_ant1",
 "citation": "   little_ant1. \"Legal And Lovely: experience with Piperazines - BZP ('Red Hearts Party Pills') (ID 50039)\". Erowid.org. Apr 11, 2008. erowid.org/exp/50039",
 "substance": "Piperazines - BZP ('Red Hearts Party Pills')",
 "bodyweight": "77 kg",
 "header": [
  [
   "DOSE:",
   "0.5 tablets",
   "oral",
   "Piperazines - BZP"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 50039",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 11, 2008",
   "Views: 11410",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAge: 18\r\nHt: 5'8\r\nMental status: anorexia, depressed, occasionally suicidal. Also hardly any drugs work good with me eg. weed makes me cry and makes me thoughts attack me. I never smoke weed cus I hate how it affects me.\r\nOverall place taking pill: in a music festival\r\nTaking pill with: guy I just met who I now consider a friend\r\nPlace pill was taken: walking towards a place to sit to have a drink (water) and chat with friends.\r\nAprox. Time: 10:30pm\r\nBody just before taking pill: hungry-starvation, just stopped crying.\r\nMind just before taking pill: mildly depressed, excited.\r\nThought example just before taking pill: 'hopefully this will make me feel happy I mean its only half a tablet so I should be sweet...I hope this wont make me freak out.'\r\nPlace as pill began: sitting down with friends\r\nAprox. Time: 10:45pm\r\nBody as pill began: relaxed a small bit\r\nMind as pill began: very very happy, falling in love with people around me though still at a normalish level (eg.I was scared of a few drunk people as I would have been sober), nothing else affected  at all.\r\nThought example as pill began: 'gosh I love rammstein sooooo much'\r\nPlace at climax: watching the mars volta with a friend\r\nAprox. Time: 11pm-11: 30pm\r\nBody at climax: legs couldn't help me stand up much, really tired, wanted to lean on people in the crowd\r\nMind at climax: I was in loooooove with everyone and I had never been that happy in my whole life, the glow stick I held seemed to be like god or something and the band to me were so amazing!! The music to me was the best I had ever heard. At first it was all exciting but eventually it toned down at the climax into a sort of floating where the only way I can describe it is like being the song 'just like heaven' by the cure (yes Im a goth) if you have ever heard it you will have some idea.\r\nThought example at climax: \r\n'You\r\nSoft and only\r\nYou\r\nLost and lonely\r\nYou\r\nJust like heaven'\r\nPlace at come down: sitting watching a band with my friend and exiting the concert\r\nAprox time: 11: 45pm-12: 30pm\r\nBody at time of come down: eyesight had trouble going from looking far away to looking up close (eg. Looking at the stage then looking at my mate beside me). Wanting to vomit, small headache, big-ish pupils but not too bad, pale face (but thats kinda normal)\r\nMind at time of come down: head drifting in and out of soberness, not able to show my freaking-outness properly, like my insides was scared and swaying from 'Im ok' to 'Im sick' yet my body looked totally fine and I was acting normal. It may sound very scary but at the same time I was very happy which helped calm me down*. I just wanted to escape the concert but I was very astute and even bossy to my friend as to the fact that I wanted to leave.\r\nThought example at come down: 'stupid drugs playing with my head, luckily my friends are here, I want to vomit ick!, but come on its just the crowd and lack of food, when you get home you can have a good sleep'\r\n*really I think it was the starvation and crowd that freaked me out. \r\nFeeling sick/hangover?: in car on way home and at home\r\nAprox. Time: 1am-10am the next day\r\nBody at hangover: really really wanted to vomit, couldn't eat anything!\r\nMind at hangover: still feeling very happy and in love. General good mood and pleasant thoughts/memories\r\nThought example: 'man I loved that concert and I love the cure...I love my mum and I cant wait until I see my friends again'\r\nAll in all=8.5/10 \r\n(1 being the lowest)\n\n\n"
}
