{
 "title": "My Encounter with the Sprit Guide, or the All",
 "author": "Gabriel",
 "citation": "   Gabriel. \"My Encounter with the Sprit Guide, or the All: experience with Datura (ID 50074)\". Erowid.org. Dec 27, 2006. erowid.org/exp/50074",
 "substance": "Datura",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "200 seeds",
   "oral",
   "Datura",
   " ",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 50074",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 27, 2006",
   "Views: 45155",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n23:00\r\nI had frequently indulged in intoxicating substances for enlightening purposes. Only to surmise Datura Inoxia would be appropriate as another endeavor. I have acquired much and sufficient knowledge of such a substance, and its historical use. I read the book the teachings of Don Juan, which in this book personified Datura as an entity. This sprit then was deemed an ally. Thus forth I constantly make reference to this demon creature, sprit, and entity as the ally. It is redundant to state in chronological order the events that occurred, due to the lack of the ally. Thus I shall attempt to insinuate the truth and magic of it. Though I am obliged to summarize. I consumed Datura seeds about 200 or so by thoroughly chewing, along with MDMA. Nonetheless this all took place at approximately 23:00. I then ventured to my associates abode only to disembark to the beaches. And as we proceeded I believe it was 12:30, I was utterly oblivious to time. And the first and last thing, and our creature/entity I saw were the ally. \r\n0:30\r\nI was so peculiarly enthralled by the encounter of the ally; he dashed in front of me from the bushes. He gazed upon me, as though being a separate entity in this so inconceivable existence. I recoiled at his putrid repugnancy his insidious features petrified me so. And as yet he lingered beyond my so fragile grasp, mocking me. This demon like creature is perhaps a reflection of my self, or perhaps the universe, or the incarnation of hell. I was, and still am utterly distraught by this majestic impression. \r\nHe approached me leaping from the vague infinity ambient to us both. At that moment I entered a subconscious trance.  Within this I was incapable of breathing, only attentively speculating. This must be the ally, Don Juan spoke of I pondered. Thus forth I shouted the name mescolito, and it was in vain. Sagaciously he stalked me with his timid fragile frame, and unexplainable small head. Although I was most certainly oblivious as to how he truly appeared from beyond his malicious gaze. I was spellbound, dumbfounded by his presence, and as yet horrified to the extent of petrifaction. He vanished as though acknowledging this distress. Though not to assist me, merely to tantalize me further. Upon his departure I remained unmoved for a lengthy duration of time, simplistically conjuring was this ally? \r\n01-03:00\r\nAs I progressed through out my journey, I had encountered innumerable obscured disgusting creatures. Men and women emanated this unfathomably abhorred appearance. Then so acquiescently, so majestically discreet did this insidious cryptic creature immerge once again. As did he glare violently and frightened me. I desired to consult with my factious friend Daniel, to which I presumed I was in a crowd of 6. Nonetheless I addressed the issue in a besotted incoherent manner. And as doing so Daniels face began fluctuating, and abruptly I was accosted by the atrocious appearance of this creature, or ally, staring at me. Instead of compulsive fright perplexity enveloped me. Immediately I screamed insolubly audible. And the ally diminished, only to follow me and lurk. \r\nNow I surmise that perhaps upon encountering the ally, instead of striking forth and concluding my life, he desired to obliterate my conception of existence, and incite insanity. Thus forth I infer perhaps all these repugnant disgusting creatures were merely bodies to which the ally manifested and accentuated to frighten me. Briefly, and certainly the most significant of events ensued. As I was walking towards the beach I impulsively stopped, only to have this enthralling desire to gaze at Daniel again. In which I did, and saw the shadow consume his body. And then suddenly the ally grabbed my shoulders and contained me. He just watched me. I was so appalled and petrified beyond human conception. Though I had this impulse to mimic his actions. As did he, it was a reciprocal manipulation. Also described in (The teachings of don Juan) I am now incapable of recollecting the vivid image of this ally, but in that moment I was hypnotically mesmerized. Then he vanished, in his so repetitious manner. \r\nHorrified was my state of vague consciousness, utterly marveled by this fluctuating fabled reality. And perhaps this entire realm of intricacy was the result of the ally. All figures, including my dear guiding companion Daniel, were the embodiment of such a gargoyle like creature. Perpetually did he chatter words into my ears, that which I could not coherently comprehend, although in an abstruse manner I reconciled they were words of malevolence. Intuitively murmuring mute violence, and horrific screeches of terror. \r\nNow as I proceeded to the beaches, I transcended to this mystical realm of divinity, only to unravel the secret, that this was the allys domain. Now I assume he concurred that I knew how to evade is consistent attacks, and thus brought me further into his enigmatic universe. Always was this obscure creature 10 meters ahead of me. As I approached my bench at the beach, faintly I could see this recondite figure, seated so propitiously and opaquely on my bench. I consulted with Daniel, only to receive a befuddled look of question, and dismissal. Upon engaging in perhaps a 5-meter vicinity he vanished. At that moment I was oblivious as to it being him (the ally) though now I infer with much elucidation that it was the ally seated on my bench. \r\n05:00\r\nMy final encounter with the ally was at home in my shadow-consumed abode. Upon graciously laying on my bed I shuttered in horror of just the recollection of his so flabbergasting, disgusting, insidious face of the ally. And as I covered my body with my oddly frigid blanket, I heard his calling, his echoing chatter, whispering my name. Compulsively I gazed all through out the room, with a thorough ratification that I was alone. Then as I concealed my self once again, I noted a bewildering image in my Jim Morrison poster. Then suddenly I was maliciously accosted, the ally was embedded in my walls that were closing in on me. Out side a storm begun and this desolate tree clattered upon my window, as though attempting to protrude its why into my room. Much similar to Poltergeists the film. The eerier silence of fear dissipated, only to be replaced by the roaring thunder of a storm that ceased to exist. I then screamed beyond human comprehension. And it was as though the ally also detected this, and induced a silhouette puppet show displaying on wall. I dismayed all occurrences and upon closing my eyes to hide I felt an exasperating slithering figure crawling on me. \r\n05:30\r\nImpulsively I jolted up and thousands of bugs enveloped me. For I was encumbered by insects, that May have been there to cause harm. And then a large centipede traveled up my body and into my ear. Inciting insanity, I struggled extraneously to rub them off, though it was in vain. This ensued for a few moments, when meticulously an albino snake slithered on me.  Its eyes, of hells read hue, its skin of pale misanthropic invocation.  At this moment I endured and excruciating pain, and then all demised I was alone again. My walls returned, the posters remained mundane and irrelevant and the storm diminished. Disorientation encumbered me, and I then disembarked to Daniels, to hear of his perspective of this so horrific endeavour.\r\nNow the unique facet of our final meeting (the ally) was that I reluctantly learned he could harm me. This separate entity could inflict even death upon me. Though I surmise he has not accepted me more so, nor rejected. After assessing the ally, I inferred this in fact was the devil, and I was but a mortal victim to his inconclusive wrath. I feel that if I died I left a non-existent world beyond (reality). After entering that separate reality this world is so putrid and mundane, this essence we call life is but a perpetual sheared, and I reconciled this by conceptualizing and eccentric, yet intricate divine realm most certainly guided by the ally.\n\n\n"
}
