{
 "title": "Among the Living Are the Dead",
 "author": "dannyboy",
 "citation": "   dannyboy. \"Among the Living Are the Dead: experience with Methamphetamine (ID 50086)\". Erowid.org. Apr 21, 2008. erowid.org/exp/50086",
 "substance": "Methamphetamine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 50086",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 21, 2008",
   "Views: 5395",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Trust me I know how good it feels.  I just came to the conclusion that drug addiction and drugs are really depressing things, and so many of us are robbed blind by drugs, they take our talents, our dreams, our believes, and they crush and destroy us, spiritually and mentally.  The path of the drug attict is such a shitty life.</p><p>One good piece of news I have escaped from the pit of methamphetamine.  I was a complete slave to drugs, I wasnt free at all, not in the slightest bit... Its just like the slaves that were brought to america from africa, we as drug addicts are absolute slaves.  We need to pull together and rise above the media and reclaim our lives from an absolute end and bitter distruction.</p><p>My meth use started 2 years ago, not much to glamorize about it, I smoked and stayed up and smoked and stayed up.. But to tell you the truth it made me the most depressed person in the world... Well I remember having dreams, and they died because of drug use.  I used to carry around a doctor bag and play doctor and wish that one day I would be something.. Shit 10 years later every cent that I had went up my nose or to my veins.</p><p>As a meth addict I was absolutely a very dead person, thriving on little sleep and scarce food, smoking day in and day out.  Please I beg of you reclaim your life for what it is worth cause every life and every soul is a very powerful thing.  Use it for goodness. Reclaim your life. Dont be a slave.</p>"
}
