{
 "title": "The Wonderful Leaf",
 "author": "Jman",
 "citation": "   Jman. \"The Wonderful Leaf: experience with Saliva divinorum (6x extract) (ID 50106)\". Erowid.org. Apr 18, 2008. erowid.org/exp/50106",
 "substance": "Saliva divinorum (6x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "2005",
   "50106",
   "Male",
   " ",
   "Not Given",
   "Apr 18, 2008",
   "2458",
   " "
  ]
 ],
 "report": "<p>My friend (Tim) and I purchased some Salvia off the internet from a source referred to us by my friend at work. We bought 3 grams of 6X extract for about $40. I had read many reports and about all the information I could on Salvia before attempting this drug. I suggested my friend do the same so that he is comfortable as possible with the risks. I have heard good things about Salvia, but mostly bad things. These are the accounts of the times I have done Salvia with fantastic results.</p><p>1st time: After purchasing the Salvia, my friend who is very experienced with many drugs said he would be our sitter. We were in his room, which was not the most comfortable place to me since it is not my home. I was a little apprehensive about trying it due to all the negative attitude towards it. After my friend Tim did it and just laid on the bed for a few minutes, my other friend Andy suggested it was time for me. I loaded a good sized bowl of Salvia, smoked it quickly without holding it in for very long. I finished the bowl with no effects. I loaded another. I was finishing the last hit and it hit me. I carefully put the bong down and....</p><p>Whoa.....I felt as if gravity had shifted and was pushing me very hard on the left side of my body. I had a hard time looking left. I was trying to tell Andy what was going on but my words were slurring badly and I couldn't form words for some reason. Very weird, not bad or scary though just very weird and fun at the same time. A few minutes later I was over it and had a marijuana buzz going on, and probably one of the happiest moods I have ever been in for the rest of the night. I felt completely refreshed. From this moment on I have a different respect and love for this herb.</p><p>I soon realized after reading more that you get more effects if you hold it in. Tim and I tried this the next weekend. We took enough Salvia for about 1 hit and I went first. I sparked it up, held it in as long as possible and before I exhaled it started to kick in. I quickly put the bong down and sat on the floor. I don't really know how I can possibly describe the next feeling I had. I remember feeling 'euphoric' if you could call it that. That is the closest term that could describe my feeling. I was happier than hell and laughing histerically at the feelings going through my body. Objects in front of me were blurry, probably due to all the laughing and tears in my eyes from laughing. Objects seemed taller and I felt very small. Tim was sitting a couple feet away at my computer and he seemed like he was hidden behind the desk. I had a hard time seeing him, later I would realize that he was not hidden at all by anything. I remember giving him the thumbs up and saying 'I love this drug.....this is incredible' I remember staring at the computer case which has LEDs and colored fans. The colors were very vivid and interesting to look at. After it was all over we both again had that wonderful 'after-glow' weed type buzz + ultra, super positive happy moods.</p><p>We have repeated this procedure almost every weekend since. Same slightly immersive, highly histerical, tingling sensations, feelings of being heavy and a feeling of sinking into things. No experience has caused a complete loss of reality and I think I like it that way. I have never really tripped hard off Salvia, I think I would prefer the threshold feeling and I don't want to ruin my love for Salvia. A cigarette immediatly following the experience is wonderful.</p><p>My most recent experience experience we tried a cigarette and a bowl of marijuana during the happy mood directly following the experience with fantastic results. The 'after-glow' effect puts a very positive and uplifting spin on my typical marijuana high.</p>"
}
