{
 "title": "Paranoid Delusions",
 "author": "anonymous",
 "citation": "   anonymous. \"Paranoid Delusions: experience with Crack (ID 50109)\". Erowid.org. Jun 23, 2007. erowid.org/exp/50109",
 "substance": "Crack",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Crack"
  ]
 ],
 "footer": [
  [
   "2005",
   "50109",
   "Male",
   " ",
   "Not Given",
   "Jun 23, 2007",
   "6608",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>well let's see... I have smoked crack many times. the first time I tried smoking it I was living in the detroit, MI area for a brief time. I was scared when my roomates offered me some, I had no idea what to expect and like anybody else I had heard many horrible things about crack. the reality was I loved it. during the time that i was living with these people we would smoke crack every weekend, buying about $100-$150 every friday night and smoking it out of an altered tire gauge with some chore-boy. we always had good happy experiences, and when we ran out of crack and started to crash we would just smoke a couple joints and drink some liqour. after about 45min I would feel better, without the desire to do any more crack. so crack is possible to control.</p><p>About a year later I was living in downstate wisconsin. this is when I started to experience a problem with crack. I met these straight-up crack dealers at my job, and they would deliver pretty rapidly to any part of town. I started calling them up weekly for maybe $100-$150 worth. pretty soon though I found myself smoking more and more of it. I remember one night in particular I spent $300-$400 dollars and was just tweaking out of my head. this was 3 months ago, and it is the last time I ever touched crack. well actually there was one more time after that. anyhow that night I was putting such big chunks of crack in my pipe that I could hit it at LEAST six times and still get a huge lungful each time. sounds good but I did not enjoy myself at all, I kept pacing around all paranoid staring out my door watching moving shadows.</p><p>I was pretty delusional, my heart was pounding and I kept thinking that every shadow was somebody spying on me in the bushes. I thought they were going to tell on me to the cops. I tell you, I did this for hours. standing by my door (sometimes even venturing outside, god knows why), hitting the pipe and looking around paranoid. thats about it. it sucked, but I still couldnt stop. I have smoked with people who keep looking under the bed (for dead bodies), in the bathroom... quite a buzzkill.</p>"
}
