{
 "title": "Wonderful, Painful, Life-Changing, Deadly",
 "author": "Echo",
 "citation": "Citation:   Echo. \"Wonderful, Painful, Life-Changing, Deadly: experience with Amphetamines (Adderall XR) (ID 50116)\". Erowid.org. Apr 18, 2008. erowid.org/exp/50116",
 "substance": "Amphetamines (Adderall XR)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   " ",
   "  repeated",
   " ",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 50116",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 18, 2008",
   "Views: 10825",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was diagnosed with ADD at about age 7, and took a countless variety of medications for it during my childhood (ritalin, concerta, etc.).  When I was twelve I was prescribed Adderall, and it helped me immensely through middle school and beginning high school.  I grew up in a good environment with a supportive family.  Everything seemed fine except that I was insecure and didn't have many friends.  Having taken stimulants since I was a preteen, I had no appetite and figured I was naturally underweight.  I sailed through life not really knowing who I was inside, what my appearance was, or how to have a social life.  I was so innocent!\r\nI went off to school in 2004 and it was the first time I was away from my parents.  Around that time there was some controversy in Canada about Adderall causing 'heart e friends, I am daring and successful.  If I hadn't experienced life without it tcomplications and sudden death' so my parents freaked out and switched me to Straterra.  I didn't really care.  So long story short, that first year I went crazy: I gained 25-30 lbs, started smoking pot, just didn't take care of myself and pretty much messed up my year.  My parents and I weren't on speaking terms, it was the most terrible time of my life.  When I went home for spring break I found an old bottle of Adderall and took one 30mg capsule. And DAMN, that's how I became addicted.\r\nI took it in secret one morning and then went to the mall with my parents.  I had forgotten at one point that I took it, and didn't really notice a change.  I didn't eat anything for lunch, the idea of food was boring.  I walked through the department store and felt the fabric of the jackets.  Oh they were so soft!  And the colors, it was so bright.  And the smells and the sounds were so amazing and intriguing.  My parents' talking became uninteresting and every comeback I made to them was very deep.  They looked at me strangely.  I felt overloaded with thoughts, a tidal wave of everything I had messed up just swept through my mind.  I was so mad at myself, I had to fix it, I had to start NOW!  I was fat and lazy and unproductive!  NO NO NO!  I told my parents we had to leave for home right then, and I started crying.   They were freaked out and worried, and I was too, but I didn't tell them that I took the drug.  \r\nI went home and played music for hours.  I paced back and forth thinking and making up song lyrics and singing them out loud, and I did pilates exercises until I was in pain but I COULDN'T stop.  I typed a journal entry about my theories of life and didn't look away from the computer screen for about two hours.  I was so thirsty and hungry but I couldn't eat my dinner.  I tried to sleep but only layed in bed for seven hours, crying every now and then because I was so tired but couldn't sleep.\r\nThis experience was terrible because I took way too much.  Regardless, I suffered terrible depression after it wore off and continued to take it.  The last term of school I scheduled my entire life around what days I would take it.  I would hide the bottle in a different place every day afraid someone would find it.  I became utterly obsessed with it.  I was terrified of what would happen when it was gone.  I was so addicted that I was killing myself.\r\nDuring the summer I became an alcoholic because there was nothing else to do,. without my little pill friend I had no motivation.  I ruined a year of my life because of my foolishness.  It wasn't until I begged to become prescribed to Adderall that I started to turn my life around (ironically).\r\nHaving legally in my posession helped me conquer the stupid addiction that could have killed me.  I DO have ADD, and it helps me in ways it can't help other people, but it still messes me up when I abuse it.  I am one of those people who can only learn things the hard way, and only by hitting rock bottom did I learn who I was.  Now I havhen I would still be a porcelain doll, a marionette whose strings were pulled by parents and teachers, and afraid to take any risks in my life.  I grew up in that year of pain, and I came out of it a strong woman.\r\nI am a musician, a writer, an artist.  Adderall sure makes me focus, but it doesn't cause me to create beautiful things, it only helps push me.  The beauty lies inside of me, and the lucidity I get from Adderall is an easy way to get motivated and it's pretty fun.  But not every experience is good.  \r\nYesterday I went to my friend's house and in her living room there were two of her friends, one of them was sketching a photograph and the other was riveted to the TV screen with her face about two feet from it.  The host was cutting lines of Adderall with her school ID.  She offered it to me and I declined.  They don't know I'm prescribed, no one does, and that's the best way to be.  I smiled at them, they were all seriously tweaked out, especially the sketching girl because she was pressing the pencil down so hard her hands were shaking and she kept complaining about biting the inside of her mouth.  I got her some water and told her I know how she feels.  I felt so proud of myself for turning it down, and without seeing the consequences of messing up my life I would have never been that strong.\n\n\n"
}