{
 "title": "I Hear Through My Skin",
 "author": "SpunkySkunk347",
 "citation": "   SpunkySkunk347. \"I Hear Through My Skin: experience with Morning Glory (Heavenly Blue) (ID 50119)\". Erowid.org. Sep 29, 2007. erowid.org/exp/50119",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "100 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 50119",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 29, 2007",
   "Views: 2916",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Alright. I had been planning this trip all week long so I ate little to nothing and did not eat 1 day before the trip. This was my first time using morning glories. The times are an estimate.</p><p>SATURDAY</p><p>4:00- Had friends pick me up.</p><p>4:30- Went to local flower shop and got 7 packs of heavenly blue morning glories.</p><p>5:00- Got back to friends house and got 3 peanut better and jelly sandwiches, a bowl, a plate, 2 bottle of water, and a can of coke. I began to count how many seeds to a packet. There were 50 in each packet and I decided to take 100 for a first time use. I poured half a bottle of water into bowl and dumped 2 packets of seeds into water. Stirred for about 15 minutes then took seeds out. I put the seeds into the middle of the sandwiches and began to eat the sandwiches, chewing the seeds in my mouth until it wasn't crunchy anymore. Those seeds took a toll on my teeth btw.</p><p>5:30- Finished eating sandwichs and drank the can of coke. I had been warned about nausea and to my surprise I did not experience any nausea. I put in some music and turned off the lights. The rest is sort of a blur and I'll say as much as I can remember. My friends got the great idea of taking me to a mall when the seeds began to take effect. We drove to the mall but it was closed. We decided we'd go to another store instead. </p><p>6:00- There I was, stumbling into the store receiving dirty looks by anyone who looked into my eyes and saw the unnaturally large pupils and the blazing red eyes. I was amazed at how well the seeds worked. Peoples faces morphed around and the floor was vibrating. I could actually hear people talking through my skin. I think this was the climax of the journey and didn't last long. I stumbled around the store for about half an hour, then I believe we got kicked out. </p><p>7:00- My friends told me we were going to a party. When we arrived at this 'party' the topic of jokes was that I was tripping on seeds. They didn't believe the seeds were working so everyone was making fun of me. As one of my friends came up to me and said 'Haha, how can u trip on flowers! What a baby!'. I remembered the 5 packets of seeds in my pocket and I said. 'Say, if they are just flowers than perhaps you would care to try some? You aren't a baby are you?' After I said this he immediately grabbed the seeds and I instructed him on to chew them in your mouth then swallow. I believe he ate something like 150 seeds? </p><p>8:00- The seeds began to work on my little friend here. Everyone was now laughing at him because he was stumbling around. He told me he felt like killing himself. He also told me he was on anti-depressants and the doc told him not to take anything with them. I felt bad for him as he looked like he was going to kill himself. The morning glories must have reversed the anti-depressants or something because he looked horrible.</p><p>9:00- The rest became even more blurry as I had drank a little. I remember going to a pizza place and eating pizza. I remember going to a skate park. Going through a blizzard. And going back to the store again. I remember my friend got over it and he was acting normal again. I think I finally passed out back at my friends house.</p><p>SUNDAY</p><p>9:00- I woke up with the taste of vomit in my mouth. I was sleeping on the floor of my friends house. I had a horrible headache but besides that I felt very great. I was glad I made it through the night and had a wonderful trip. My internal organs felt fine. What a wonderful weekend.</p>"
}
