{
 "title": "My Dreams Came True",
 "author": "Jocelyn",
 "citation": "   Jocelyn. \"My Dreams Came True: experience with 2006 LSD Symposium, Basel (ID 50145)\". Erowid.org. May 5, 2006. erowid.org/exp/50145",
 "substance": "2006 LSD Symposium, Basel",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2006",
   "50145",
   "Not Specified",
   " ",
   "Not Given",
   "May 5, 2006",
   "Views: 4299",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>Hi!</p><p>First of all...I speak french (french-canadian...from Québec...), so, my english is so-so...</p><p>On the january 11, I took a flight Montreal-Zurich, my head full of dreams. At this time, I wished to encounter some of my favorites writers or artists.  But ,above all, I want to sing ´ Happy Birthday Albert' to Albert Hofmann. What an idea?!!! 6 hours of travel and 3000 dollars just to honour a man I never encountered? YES!!!</p><p>And it was some of the most well spend money in all my life. Nothing less. The program was very dense. Often, I have to made difficult choices...I can't be at 2 places at the same time.(not in my normal condition!!!...) The side program (in the halls...) was really great too!. So much to see. So much to hear. 2000 enlightened peoples from all around the world to encountered. The reality exceed all my expectations.</p><p>I effectively shake hands of autors, painters, thinkers, activists, researchers...peoples passionates of entheogenes relatives topics...like me. All those peoples were sooo nice with us, simple visitors. It was very obvious that they talk from the bottom of their hearts. Everyone was interesting. Many were VERY interesting... like:</p><p>Alex Grey...What an ARTIST!!! This guy astounded a lot of us whit his ALMOST PERFECT way to represent the ILLUMINATION STATE. A real feast for my eyes and soul.</p><p>Jeremy Narby...A very friendly french-swiss man...his first book (the cosmic serpent) present what is , in my humble opinion, THE theory about all the entheogene world.</p><p>Rick Doblin...A TRUTH WARRIOR!!!...This man worked  days and nights since near 20 years. He dream of a world where the entheogenes have their places under the sun. And he work so hard for it. And he is so friendly. </p><p>Fire and Earth. What can I say about this couple?...They are THE REFERENCE in all the NET...in all the WORLD! Their Site stop the isolation of thinkers-psychonauts like me. If Rick Doblin is the warrior...Fire and Earth are the CASTLE. Our treasure is very, very well kept in this castle. Thank you Fire and Earth!</p><p>Ralph Metzner...An icon...A part of the LEGEND...He is part of the battle for consciousness since sooo long. Perseverance, integrity; a very articulate </p><p>man. His view is very wide due to his experience spanning on +-40 years. A very special thank for his BARDO BLUES. Touching and funny at the same time!</p><p>Benny Shanon...This one was not supposed to be there...what a surprise for me...because his book (the antipodes of the mind) was the last one I read this autumn...May be the most difficult to go through I ever read...but...WHAT A BOOK!!!...The BIBLE about AYAHUASCA! I talk a lot with him along the congress.</p><p>Ann and Sasha Shulguin...I love them!... They are +-80 years old and they still look like 2 childrens! The archetype of the perfect psychedelic couple. Still passionate...still in love...aging in beauty...I wish my couple will be like that in 40 years. I'm waitting  for the next publication of the 'shulguin amazing couple' to be available in few months.</p><p>I can say something about the majority of the speakers, but...I have to keep it 'short and sweet'...</p><p>The overall athmosphere was simply filled with LOVE, KNOWLEDGE, IMAGINATION and AFFECTION(for the humanity, in general, and Albert, in particular)</p><p>These 3 days were some of the most beautiful days of my life. Nothing less. My only one regret is that my wife was not able to be there. It was a turning point event, and all the +- 2000 peoples who were there sensed it clearly.</p><p>Our community is mature and we are, for the vast majority of people I encountered in Basel, healthy, smily and optimistic.</p><p>A little word about the closing ceremony...</p><p>It was one of the most EMOTIONAL MOMENT IN MY LIFE!</p><p>Try to imagine (for them who was'nt there)...1500-2000 people in the room...speakers and organisators of the event on the stage...and Albert himself who  is in front of us, on his feet, without text...AT 100 YEARS OLD!!! It was so emotive to see this living legend speak with a mix of authority, experience, love and tenderness. A wonderful treat for the heart.</p><p>At the end of the speach, one of his best friend (Rolf Verres, a specialist in psychotherapeutic medecine and a very gifted pianist) played a marvelous, so touching,</p><p>piano piece.</p><p>Believe me or not, but...at the end of the piano piece, I opened my eyes and....the majority of the people around me were crying like babies! I never attended a so wonderful demonstration of love and affection for a single man. A magic moment in my life. I will never forget it!</p><p>A last word for Albert...FROM THE BOTTOM OF MY HEART...</p><p>THANK YOU ALBERT!</p><p>THANK FOR BEING THERE.</p><p>THANK FOR BEING YOU. </p><p>YOU ARE, FOREVER, OUR CHERISH ELDER!</p><p>YOU ARE A LIVING EXAMPLE FOR ALL OF US!</p>"
}
