{
 "title": "Life Improving but with Serious Reprocussions",
 "author": "Adderall fan",
 "citation": " Adderall fan. \"Life Improving but with Serious Reprocussions: experience with Amphetamines (Adderall) (ID 50155)\". Erowid.org. Apr 14, 2008. erowid.org/exp/50155",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "50155",
   "Male",
   "",
   "Not Given",
   "Apr 14, 2008",
   "5535",
   " "
  ]
 ],
 "report": "<p>The very first time I tried Adderall I was actually looking to score some pain killers or xanax, but when I got to my buddy's house he said he was out but had some Adderall.  At first I wasn't interested but he kinda told me about it and its effects, he said its awesome for working.  So I bought 20 10mg tablets and gave 10 of them to my friend and saved them for work the next morning.  The next day of work was intense!  I was feeling so great and working hard was actually fun!  After work the friend I gave some too called me and said we need more!  By the next week I had gone to see my doctor and swindled my way into getting a prescription for 20mg.  Over the next two months my work performance had doubled and I had gotten two raises because I was working so hard everyday just feeling on top of the world and so focused!  I was convinced that this was a miracle drug!  </p><p>But of course after taking it for so long I built up a tolerance and I just kept needing more and more to get to the same level.  So I started running out before the month was up and when I would run out I didn't want to work, get out of bed, or even talk to anyone.  So of course I figured out a way to get them refilled early, I would go see my doctor and switch the dosage and make up some excuse and it worked everytime!  It has now been three years and I still to this day have a prescription for 30mg tablets and 20mg XR.  I definatley get serious come-downs but I also got myself a prescription for Xanax 2mg which almost eliminates come-downs.  It makes the anxiety and stress go away and helps me get some sleep.  My doses  now are around 220mg every two days which I would not recommend to anyone.  It is definatley a very addictive drug.</p>"
}
