{
 "title": "Trumpet Fever",
 "author": "ChrisP",
 "citation": " ChrisP. \"Trumpet Fever: experience with Brugmansia (ID 50223)\". Erowid.org. May 4, 2008. erowid.org/exp/50223",
 "substance": "Brugmansia",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 flower",
   "oral",
   "Brugmansia",
   "(flowers)",
   "",
   "3 flowers",
   "oral",
   "Brugmansia",
   "(flowers)"
  ]
 ],
 "footer": [
  [
   "2005",
   "50223",
   "Male",
   "",
   "Not Given",
   "May 4, 2008",
   "16848",
   " "
  ]
 ],
 "report": "<p>I have a brother who had an Angel Trumpet tree in his front yard yet he knew nothing of what they do. He just put them in for landscaping. I knew somewhat of them yet all I knew was I could get high off of them and I was curious. I did no research before I took them and the following story is what was told to me the day after I took them.</p><p>I was at work with my brother and I had stopped by his house to smoke a bowl. I asked him if I could have about 8 of the flowers off the tree and he told me he didnt care. After receiving the flowers I called up two of my friends (we'll call them John and Chino) and told them I had acquired some angel trumpets. My friend Chino agreed to be the sober one so he could drive while we tripped. Chino picked up John and I at my house around 6 p.m. so that we could go catch a movie. When we were first picked up I had already consumed one Angel Trumpet but John hadnt consumed any. We arrived at the movie theaters and bought our tickets. </p><p>Nothing was happening so I consumed around three more flowers at the beginning of the movie. By this time I had consumed four whole flowers and john consumed two. I started to feel very tired and sleepy so I laid down and went to sleep in the back of the movie theater. When the movie was over I felt like I wasnt sure if the trip had set in or not, and this is where amnesia started to slip up on me. </p><p>The last thing I remember is walking out of the movie theater trying to keep my balance, which I had obviously lost my sense of balance but still seemed to be maintaining self-control. On the drive I kept seeing snakes. Snakes were everywhere in the road yet my friend Chino assured me everything was alright. As far as I know my friend John had just started to get tired. </p><p>Upon my arrival at my house I walked in without a shirt on and my roommate asked me where it was. I argued with him for almost a half hour that I DID have a shirt on and I was scraping the skin on my chest and pulling it out thinking it was my shirt. Not until I looked down did I realize he was right. This was around 11 p.m. </p><p>Around 1 p.m. my roomate came into my room to find me throwing things around and smashing them and he proceeded to ask me what I was doing. I told him I was fighting someone and to help me. He then brought me into the living room and laid me down on the couch staying there with me to make sure I didnt hurt myself or damage the house. I stayed there for a number of hours just staring at random stuff but always seeming to get up every 15 or 20 min. to 'go to the bathroom'. I had the feeling of restlessness yet when I got to the bathroom I would forget where I had just come from. </p><p>Around 6 a.m. my roommate told me to fix breakfast thinking the trip had worn off. I took a silver cake mix bowl and filled it full of milk, then stuffed an Alcopolco (a Mexican type of blanket) into the bowl and started to eat it with a fork and a knife. My roommate caught that real quick and laid me back down on the couch. </p><p>The entire time this was going on my friend John was at his house and his trip started around 4 a.m. He was sitting in his room and he was talking to me, thinking I was right there with him. His brother came into the room and tried to calm him down then went back to bed. Around 8 a.m. John put on his workshirt and started to leave to go to work, yet he always works 2nd shift. His brother caught him and put him back in bed. He also had to go to court feeling the after effects of the angel trumpets.</p><p>My friend and I both agree that it was a bad choice and it was not a pleasent experiance. After effects include dizziness, vomiting, hangover like effects, and muscle tension. If I would not have had someone sober around us the entire time I have no doubt we would have wondered out into the middle of a road or fell out a window.</p>"
}
