{
 "title": "Floaty Kind of Feeling",
 "author": "Hybrid",
 "citation": "   Hybrid. \"Floaty Kind of Feeling: experience with Kava (ID 50245)\". Erowid.org. Mar 24, 2008. erowid.org/exp/50245",
 "substance": "Kava",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 cup",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 50245",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 24, 2008",
   "Views: 52054",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast night, I found myself sitting in my room, with nothing to do. My homework was done, and it was still early. I started browsing the internet, clicking on random substances and following links. I ended up on a Kava page after a little exploration, and this made me remember that I had a small supply of Kava in my drawer! I had chewed Kava before, and enjoyed the numb-feeling in my mouth (in fact, my friend and I chew Kava at lunch sometimes just for that feeling), but I had never actually tried drinking it. \r\nPreparation:\r\nI pulled out my supply of Kava, and put it into a hemp tea bag. The amount of Kava I used was about a handful, but for normal people, I'd say use a slightly smaller handful. I've got really small hands. I heated some water, bringing it to about a boil, and then let my Kava steep in it for a half-hour. This was longer than I had planned, but I had temporarily forgotten about it. This turned out to be a bit longer than I would have preferred. It made the drink extremely bitter to the point of being almost unbearable.\r\nExperience:\r\nT+0:00 - I began to sip the tea. It was so horribly bitter that I had to follow it with a few sips of Root Beer after each sip of tea.\r\nT+0:15 - It was about this time when I started feeling slight effects. I was about half-done with the cup. They were barely noticeable. It just felt as though I had gotten a bit lighter, or something. I was just a little more relaxed in a way.\r\nT+0:30 - By this time I had finished the tea, and it was in full force. Don't take that to mean I was drunk off my ass, or something. It was just pretty noticeable. I was really relaxed, and happy. Everything was pretty darn funny, too. I was talking to some friends online, and everything was funny. Even if it was said seriously. It was a nice kind of floaty feeling, where I was aware of everything I had to worry about, but it didn't bother me. It was like I was underwater, and all my worries were floating on the surface. I could see them, but they couldn't touch me. Considering the fact that I'm a stressed-out guy in high school, this was a nice feeling.\r\nT+0:35 - Uh oh! Confrontation! At this point, my mom came into my room. This was a good chance to see if I was still capable of conversing normally. I was, but it was a bit harder. I could think of the concepts of what I wanted to say, but I couldn't word it correctly. So, I just didn't say anything complex, and mom never noticed a thing. Sweet. I noticed a very slight visual distortion when I was talking to her. I found that my vision was focused around her face, and everything on the edges was rippling like waves in a pond, sort of. It was mild, but I thought it was pretty cool.\r\nT+1:00 - This nice feeling was starting to wear off. I wasn't surprised it was leaving so quickly, though. I was drinking a lot of water and black tea and stuff during this experiment. There was no crash when I fully came off it. I just kind of slid out of the giddy feeling, and was left relaxed and content. I went to bed, and had an awesome sleep. I slept better than I have in a long time. It was peaceful, restful, and stress-free (my dreams have been kind of stressful lately).\r\nThe next day:\r\nThe Kava effect kind of carried over into the next day. At school, I felt really chill the whole day. I was relaxed, happy, and nothing bothered me. I wasn't really mentally incapacitated, either. I was kind of forgetful of what my friends were talking about, but that wasn't so much that I was having a hard time remembering things. I was just happier sort of drifting along in my own little world of chill.\r\nConclusion:\r\nOverall, this was a really nice feeling. I liked it so much that I told a couple of friends, and at a dinner party we're having, we're going to cook up some Kava tea and chill with it. I picked up 2 more ounces today! I also found out that the place I got the Kava at has Stevia, the sweetener! I added some Stevia to a Kava brew that I just cooked up, and the taste is infinitely more bearable. I didn't even need chasers of Root Beer. So basically, if anybody is looking to get really messed up on Kava, just don't try. I don't think it would work. But if you want just a nice little sort of break like I had, then give it a try! It's really nice. But get some Stevia. I'm serious, without it, it's... well, it's just horrible to drink.\n\n\n"
}
