{
 "title": "Sun-Opener Sickness",
 "author": "Solaritea",
 "citation": "   Solaritea. \"Sun-Opener Sickness: experience with Heimia salicifolia (ID 5027)\". Erowid.org. Feb 6, 2001. erowid.org/exp/5027",
 "substance": "Heimia salicifolia",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "30 g",
   "oral",
   "Heimia salicifolia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5027",
   "Male",
   " ",
   "Not Given",
   "Feb 6, 2001",
   "26365",
   " "
  ]
 ],
 "report": "<p>\nUpon receiving 60 grams of poisionous and non-consumable Heimia salicifolia I was disappointed to see many sticks and twigs in the bag with only a small amount of well crushed leaf at the bottom.  My scale said there was about 22 grams leaf, I didn't bother to weigh the stems.  I was told 10-15 grams of leaf should be the starting dose so I was worried that since I was sharing the experience with A, one of my congregation, there wouldn't be enough.  </p><p>I had never heard of stems being used so I assumed they would not be sufficient on their own but might assist the leaves.  So I threw all 60 grams in a jar, added about 8 cups boiling water and placed outside at about midnight.  We started drinking the tea at about 7:30 PM the next day and finishing around 8:15.  The tea wasn't bad, A remarked that it didn't taste nearly bad enough to be effective.  We both soon felt relaxed but didn't feel we could definitely attribute it to the tea.  At 11 we're still waiting, looking for effects.  A says her 'thoughts feel floaty' but nothing more.  I smoke some hash, A eats some marijuana chocolate and we fall asleep about 12 thinking it had been a failure.  </p><p>I awoke at 1 AM shivering and feeling very nauseous.  I ran to the bathroom, well I stumbled to the bathroom to throw up.  I seemed to have a hard time keeping my balance.  The nausea quickly went away but while kneeling in the bathroom I was suddenly overtaken by a flash of heat and I was covered in sweat as I made my way back to bed.  As soon as I lay down I was cold and shivering again.  I woke up again about 1:30 AM with a horrible stomach pain and still shivering.  I sat up in a sort of crouching fetal position and was immediately overcome with heat.  I became drenched in sweat, my shirt wet and sticking to me.  As the stomach pain left so did the heat and I fell back into sleep shivering.  2:00 AM and I was awake again in more pain than before and very cold.  Every muscle around my stomach was contracted and clamped down, calling out in agony.  My vision was shakey, I was reminded of times that I was sick with the flu as a child.  I made my way to the bathroom and crouched down on my hands and knees.  The heat came over me and my pain disappeared after several minutes.  I stayed there for a little longer, watching the sweat drip off of me.  I headed back to bed, cold and shivering again.</p><p>The next day A told me she had been up most of the night shivering in bed but had only slight nausea and no hot flashes.  Both of our legs were sore the entire day.  Maybe I took an overdose, I drank slightly more than she and I weigh about 60kg to her 90kg but it seemed to induce more of a delerium than a psychedelic state.  Even that took 5 hours to come on, much more than the 20-30 minutes I had been expecting.  I don't think I'll be repeating this anytime soon.  Perhaps when I begin to grow it I will try the fresh leaves and keep the sticks out of it.  And stick to the recommended dosage.</p>"
}
