{
 "title": "My Surroundings",
 "author": "Viruk",
 "citation": " Viruk. \"My Surroundings: experience with Mushrooms - P. semilanceata & Cannabis (ID 50299)\". Erowid.org. Sep 4, 2007. erowid.org/exp/50299",
 "substance": "Mushrooms - P. semilanceata & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 g",
   "oral",
   "Mushrooms - P. semilanceata",
   "(dried)",
   " T+ 0:40",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "50299",
   "Male",
   "",
   "Not Given",
   "Sep 4, 2007",
   "3126",
   " "
  ]
 ],
 "report": "<p>To Start off I'm 18 and have only used marijuana before. I read a lot of trip reports to prepare myself. I packed my marijuana smoking gear, warm clothing, and drinks (cola and water). I've been trying to get shrooms for weeks, everyone is always out, but today, a dealer I know comes up to me and says man I heard you want some shrooms. Naturally I said damn straight I want some shrooms. He picks out 'about 4-5 grams' of liberty caps. I buy them for 40$ canadian. A few hours later I'm heading with my buddy oz to another friends place. We get off the bus and he says 'Yo man, break out the shrooms already.'  I whip em out and this is roughly 5:50ish I commence to start eating shrooms with oz, sharing about 2 grams with him.</p><p>I get to my friend B's place and already a few people are there. I finish off the shrooms which taste very woody and dry at first, but with a bitter/sour aftertaste. Cola cures this aftertaste rather quickly. We sit in the kitchen after we finish, I get dizzy and nauseated. We head to my friends room, a small room with foam on the ground, posters on the wall and a yellow light. By this time 6:30 I'm already starting to trip. Everythings pushing in on me, like the air got really heavy, and I'm getting increasingly sick feeling.</p><p>I decide this is already really edgy and I feel nervous, I need to smoke a bowl of weed to calm myself, so I do. Instantly it takes the edge off, but it also throws me into overgear making the trip stronger. I start rummaging through my backpack in search of pen and paper to write down everything I'm starting to see. My buddy gives me a plank of wood to act as a surface to write on. I start writing and it seems the ink is really sticky, and just drags over the paper. I write down some illegible things and lose my train of thought blaming it on my friend. The plank of wood explodes, litterally taking over the entire room, then shrinking again. I whip out my favorite book and open it up. Letters fly everywhere, I shut that pandoras box ridiculously fast. I then think I may be cold so I pull my sweater towards me, it flows with my hand like oil, and I put it on. </p><p>Then this kid goes 'Hey man you're bleeding all over the place man' I wasn't he was just tripping me out and man was I scared, I realized I couldn't feel anything and that physical harm was a real fear. I start to go to the store with my friends, about 50 ft from the house I realize I'm an idiot and run back to the house. I get back to the house and already everything's a little bit too crazy. I start to question everything, something I can't help but do for some reason. I become afraid and slightly paniced about the strength of this drug. Next thing I know I'm lieing on the floor in the living room, its 7:12, I'm so messed up that I forget what my body looks like. I hear shouting (people actually fighting in the house) and man that's a terrible thing to hear stoned.</p><p>I look around and everything explodes into grains of sand, I'm flying through this ridiculous duststorm and I can't focus or understand. I suddenly am back in the room, then I seem to melt and fly to another part of the room. I sit down, something is in my way, what are these ridiculous contraptions, what purpose do they serve, oh wait! It's my legs! All splayed out in front of me. I realize I have arms and hands to. I look at my palms and can see the blood running underneath the skin, I wonder if I were to slice myself with my knife what would happen, because obviously a mind such as this cannot die, I'd live forever in this state, floating around without a body. Quickly I change my track of thought, before I get too many ideas.</p><p>The drug is proving impossible to control, I decide to go with it. I look at the carpet, one of those half shag ones with strings poking up. The rug starts growing and shrinking then flys around my head and I get sucked in again, flying through some other kind of kaleidoscope storm. I phase back into reality and get in touch with my body enough to realize I'm going to vomit. I'm afraid of vomiting because I'm tripping so hard I can barely feel my body, I could choke and die but I walk to the bathroom and do vomit, luckily into the toilet. Sitting there staring into the toilet I get sucked back into madness everything for 5 mins is just a raging swirl into the toilet.</p><p>I pull my mind away and miraculously figure out how to work the sink, my subconcious seems to be bored of my antics and is working on some sort of basic comfort instinct. I look into the mirror and think 'Wow you look sick, red eyes, sweating, sort of depressed looking.' I run into my friends brother and claim 'I'm never doing this again this is not my drug!' He yells to his wife that I'm having a bad trip and to make sure I don't do anything crazy. I look at him like he's stupid, then I'm in the corner again.</p><p>I lay down for another 15 mins and its around 8:00 now, I'm shocked to see so little time has passed. I become aware of who I am and drink some water, then I sit down and start pieceing my mind back together. I start to see that talent and skill is just the ability people have to will themselves a universe, and that nothing is really there until you force it to be. I realize that people in life just try to show me how to better master my surroundings, and that we are all little balls of light floating around trying to understand everything. I gain more respect for schooling and teachers, only to lose it again when I'm sober. I also grasp some concept that things I don't like are things that invade my mind, things that get to my mind. I like my surroundings and if someone ruins them I don't like that person for making me uncomfortable.</p><p>I stop my mad philosophical ranting and stare at the wall. The young children who live in the house have drawn lines with crayons of all sorts of color. I watch these lines and try to figure out what they really are, but they keep moving. They form roman soldiers marching to a town. They walk into the town and speak to someone. They then raise their swords and hack the person down and proceed to kill off the entire town. This was the most entertaining thing I have ever seen, my friends looked at me as I continued to look all over the wall watching this portrayal of history play out in front of me. I start to chat with a 6 year old girl who is awake and in the same room as me, we start playing with simple toys and arguing over the spelling of the word dog. I seemed to relate very well with this child.</p><p>The next 2 hours or so I am coming down and it's just a smooth ride of colors and patterns, and things moving. I enjoy the crazy rug, it's just, well crazy. I come back to reality and realize that shrooms are truely amazing. After I came down I shared my experience with J (B's sister) and G (B's brother in law). The whole trip went 0-40mins coming up. 40mins-2hours was the peak until I vomited. 2-5hours was coming down.</p><p>Luckily the whole time I was freaking out at the peak of it a part of me was sitting there observing saying 'Don't worry you'll come down soon, is there any person that can speed up this come down? Your dad can he help? a doctor? No, only time can help you, time IS your friend, just wait, it may be hard but keep calm and keep safe' This was ridiculously assuring, combined with the fact that this voice occasionally said 'Man you're an idiot for taking so much, dummy.' or something to that effect, making the situation almost humerous. Things that didn't help were the constant screaming in the background and the fact that spongebob squarepants was on and in that episode the characters go mad and scream and shit, it was terrifying and made reality seem that much farther away.</p>"
}
