{
 "title": "Ultimately the Best Drug Ever",
 "author": "420baller",
 "citation": "   420baller. \"Ultimately the Best Drug Ever: experience with Tramadol (Ultram) (ID 50314)\". Erowid.org. Jan 1, 2008. erowid.org/exp/50314",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Pharms - Tramadol",
   "(ground / crushed)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 50314",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 1, 2008",
   "Views: 23120",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A couple months ago I came across a good amount of tramadol in the form of 50 mg Ultram tabs. My experience is as follows:</p><p>Day 1:  </p><p>I had run out of weed, so naturally I was thinking about what I could do when I would have nothing going on for the next few days. I decided that 200mg would be a good first time dose. </p><p>T+0:00 </p><p>I Crush up 2 pills and snort them, then take the other 2 pills with a glass of water. I figured this would be a good way to get going faster and then still keep around a long lasting buzz. </p><p>T+0:05 </p><p>Feeling a little tingly, not really anything else.</p><p>T+0:15 </p><p>A nice hydrocodone like feeling (20-25mg of hydrocodone is what I would compare it to) is passing in waves over my body. However, I am completely clear headed, unlike how vicodin normally makes me. </p><p>T+1:00 </p><p>Effects are very nice at this point. I think the orally ingested pills are in full force. I go to lie down on my bed for a while.</p><p>T+2:00 </p><p>Still just as strong a body buzz as before, very enjoyable, relaxing, and tingly. I am feeling VERY euphouric. I can see how this stuff can be addictive. Although I am feeling completely relaxed, I am not sedated at all. In fact this stuff seems to be keeping me awake. That isn't bothering me; I don't want to sleep and miss out on any of this trip. </p><p>T+3:00 </p><p>I can't believe it, I've found my wonder drug. It's been a good 3 hours and I havent noticed any lessening of the effects. Still getting waves of pleasure passing all over my body. There is slight itching, but not bad at all; much less than any time I've taken vicodin.</p><p>T+5:20 </p><p>I must have nodded off, just looked at my watch and were almost at the 5 and a half hour mark. Effects are slightly diminishing. Still having the waves of euphoria. This seems to happen with any use of muscles. The bed sheets feel extremely soft, very comfortable.</p><p>Day 2: </p><p>Next morning: I wake up feeling very refreshed, despite waking up several times during the night. I can still feel a slight tingly sensation if I concentrate on it. I decide that I would up my dose to 350mg to start off the day. </p><p>After getting an instant breakfast shake and sipping on that for a while (maybe 45 minutes, tramadol suppresses my appetite significantly) I feel extremely like the night before, except much stronger. No unpleasant side effects are present at this higher dose. A little more itching, but it doesn't bother me to scratch, in fact it's quite enjoyable. </p><p>After chilling on the couch for a while I get the urge to get up and move around. Running sounds like a good idea. Whoa, It's extremely pleasant. I don't normally run that often (never more than a mile a day, assuming I felt like it at all), but this stuff has given me an unlimited supply of energy, all the while the physical activity only increases the sensation I get from the drug. After about 3 miles of straight running I decide that even though I could still go longer, a drink of water is in order. I inside, get the drink, and talk to some people online. This is very easy to do, everybody is very easy to get along with (even though it's only instant messenger.) </p><p>After a while online I decide to watch a movie or 2 and just chill out the rest of the day. Effects lasted all day, until the evening when I took another 350mg. Just like the night before except better..</p><p>Day 3:  </p><p>Ok, so lets make things interesting. I take 450 mg of tramadol. Effects are still stronger than the 350mg dose, but I can tell that I have developed a little tolerance. The nice thing about tramadol is that the more you take the better you feel, but your thoughts are completely clear. I make plans to take another 450mg tonight before bed, and 400mg of DXM. </p><p>It's now time for the next dose, the day has been great, I'm in a great mood. I popped the pills and chugged the cough syrup. The familiar dxm feeling comes on along with the tramadol. I had an excellent trip just lying on my bed listening to some Metallica before finally falling asleep.</p><p>Day 4:</p><p>I've decided that this is the last day I will use tramadol for a while, to let my tolerance go back down. I down 500mg with a glass of orange juice and then sit back in front of the tv waiting for it to kick in. Doesn't take long. I'm back in that state of euphoria, that as far as I have found only tramadol can do for me.</p><p>At about T+3:00 I take another 500mg. Effects get way stronger, and my itching increases dramatically, but scratching is still a very enjoyable pass time lol.</p><p>The rest of the day went by as smoothly as I would expect it to when on a gram of tramadol. Nothing could get me down. The next morning I got up, completely refreshed. No signs of withdrawal were noticed.</p><p>Other than the itching and it being a little hard to pee at the higher doses, I didn't have any negative side effects. I never noticed any nausea and constipation. This is definitely the best drug I have ever taken, and unless they come out with a non addictive form of heroine, I doubt I will find anything better.</p>"
}
