{
 "title": "An Unexpected Torture",
 "author": "chris9",
 "citation": "   chris9. \"An Unexpected Torture: experience with Nutmeg (ID 50372)\". Erowid.org. Apr 17, 2008. erowid.org/exp/50372",
 "substance": "Nutmeg",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "1 nuts",
   "oral",
   "Nutmeg",
   " ",
   "1 nuts",
   "oral",
   "Nutmeg",
   " ",
   "2 nuts",
   "oral",
   "Nutmeg"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 50372",
   "Female",
   " ",
   "Not Given",
   "Apr 17, 2008",
   "Views: 5389",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have tried nutmeg twice, and both became very negative experiences.</p><p>My first time was during summer holidays. A few friends of mine had tried it before with minimal but positive results, and I, being the kind of person who likes to try everything, thought I'd may as well give this 'harmless' stuff a go. So I went and bought a few packets of whole nutmeg and went home.</p><p>It was a Friday afternoon, and that night I was meant to go with my mother to a special awards evening. At the time I had been on a severe low for months, I needed something to get me feeling better I figured. So I took one nut before my mother and I left for this awards dinner. Oh, I took two more nuts with me in my handbag, just in case.</p><p>I didn't expect anything to happen honestly, with such a low dosage and all I thought. I was very dressed up that night, with high heels and everything (affecting my mobility later on). About half an hour after we had gotten there, I started feeling this light buzz. We were at this table with lots of my mother's friends, most of which I didn't know very well, but very quickly I started blabbing away to them about nothing in particular, I just wanted to talk. They started buying drinks, and got drunker and drunker whilst I got giddier and giddier. It was the best I'd felt in a very long time. </p><p>My mum looked surprised that I was talking so much; usually I'm a fairly reserved person. She was also surprised by how much I was drinking: she had to order our table several more jugs of water and bought me at least 7 lemonades. This was equalled by the number of times I had to go to the toilet, after which I'd just get thirsty again and drink more. I snuck another nut while I was at the table, and walking straight became difficult.</p><p>Finally, the night finished around 9 and Mum and I got home. I thought it had been all great, and took 2 more nuts thinking it could only get better.Then everything became hazy. One moment I was sitting on the floor in the lounge room, the next I was sleeping for an eternity, my mouth feeling dry but my body too frozen to fetch water.</p><p>I woke up the next day around 2pm on the floor, my throat burning from thirst. The second thing I realised after this was I could hardly move my body. My mum and brother were stepping over me constantly as they went past, often telling me to 'get off the floor' and 'don't be so bloody lazy'. My throat was too dry to speak, so I couldn't ask for water. When I tried to croak it out, my brother just laughed and told me to get some myself. I couldn't explain what had happened to me, so there seemed nothing I could do.</p><p>Around 4 that afternoon I tried to get up - almost successfully - until this horrible nausea passed over me and I nearly vomited kneeling on the floor still. I waited a few minutes and tried to get up again with the same results. I gave up and lay on the floor again until around 7pm, when I finally crawled to the bathroom and climbed into the shower -- finally getting a drink and feeling much better. I was so distressed, I had felt like I was going to die. I had very bad headaches and poor vision the next few days after that.</p><p>My second experience was much milder. I decided maybe I'd screwed up the time before, so I'd take only one nut before bed. I didn't wake up until roughly 14 hours later which surprised me yet again, I usually sleep very badly (3-4 hours per night). I had this stoned feeling, headaches and was yet again extremely thirsty. Luckily I wasn't frozen like last time, so I was able to get up and move around the house after that.</p><p>It's surprisingly strong as I found out. I don't think I'll ever try it again, it's cheap but definitely not worth it.</p>"
}
