{
 "title": "Unreliable but Great When it Does Work",
 "author": "Trip Technician",
 "citation": "   Trip Technician. \"Unreliable but Great When it Does Work: experience with Calea zacatechichi (ID 50401)\". Erowid.org. Aug 15, 2006. erowid.org/exp/50401",
 "substance": "Calea zacatechichi",
 "bodyweight": "100 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Calea zacatechichi"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 50401",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 15, 2006",
   "Views: 14827",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy Dream\r\nThe night before this dream I smoked a  'Dream Stix' Calea Zacatechichi joint. On the strength of this one experience I bought some more. Since then trying it again it seems not to have worked so I am a bit unsure of how reliable the dream experiences are.\r\nThe dream was very inspired by Asimov's 'The End of Eternity', a thoroughly recommended book.\r\nIn the far future the  human race develops the power to control the nature of reality itself. We then attempt to convert ourselves into beings of pure energy, this nano-symbiosis works at first and we become beings of pure spirit or energy but later a nano-viral energy worm appears which eats spirit and renders us into a perpetually time looping hell where we are eaten to bits while still alive. The time loop which would have allowed eternal life malfunctions and traps us in this hell-like state for millennia. Mankind cycles through the nightmare reality over and over again. All hope seems to vanish. We seem to be expected to become symbiotic with the evil energy virus that hates us and wants to destroy all chance of self-realisation. \r\nIt seems there can be no release from the destruction, the universe itself becomes sick and dying.\r\nThe state of hell lasts for so long.\r\nThen eventually a solution to humanity's predicament emerges. The redemptive power of 'The Conscious Human'. A new type emerges, it is a superbeing who can save us by merely living consciously. The new pinnacle - a human who redeems and saves the world by the very nature of his/her being. \r\nThe first of them exists in a parallel Victorian era in London, starched collars meets hi-tech. \r\nI find my way to a place where crystals grow rapidly in a brick cave between terraced houses. From there I contemplate this new development in the universe: conscious beings can hold the time loop secure and thus prevent hell. It is the only way of redemption. The first of these truly conscious beings is a victorian man I visit in my time machine.\r\nIt was a dream that seemed to unify and underly hundreds of other dreams in a mounted diadem of fantasies. Truly about the destiny of all of us, truly prophetic, truly mind blowing. The core of the dream was the feeling of extreme pain and hopelessness of being trapped in hell, I seemed to confabulate the dream around this central feeling. It was as if the feelings came first and then evolved explanatory stories around them.\r\nFascinating but so far not duplicated after smoking more of the stuff. Other than that, no adverse effects noticed.\n\n\n"
}
