{
 "title": "Scared of Everything",
 "author": "CorporateFool",
 "citation": "   CorporateFool. \"Scared of Everything: experience with Cannabis (ID 50414)\". Erowid.org. Apr 27, 2008. erowid.org/exp/50414",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 50414",
   "Male",
   " ",
   "Not Given",
   "Apr 27, 2008",
   "Views: 2647",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been an occasional smoker for the past two years, and have never had a bad experience with marijuana up until recently.  My first bad experience took place one December night, at about midnight I decided to toke up, so I packed my glass bowl and smoked it in about 5 minutes.  At first, I was feeling the normal buzz, but something didn't feel quite right.  I left my room and went to the bathroom, and just as I was looking in the mirror I got what I can only describe as the worst gut wrenching feeling I've ever had.  I felt as if the last two or three seconds of my life just kept looping over and over again, and I was trapped that way forever.</p><p>After that subsided, I has no idea where I was, what had happened, who I was, nothing.  I slowly collected my thoughts and made it back to my bedroom where I tried to calm myself by listening to some music, some J.Geils Band to be exact.  The song was playing, though it seemed to fade in and out, not to mention the lyrics seemed as if they had some deeper meaning, though I couldn't quite grasp it.  This was too much for me, so I just laid in my bed where my heart began to race way too fast for comfort and I started shaking like crazy.  I was terrified, and it got so bad I seriously considered calling 911, though I decided to wait it out.</p><p>It also seemed as if I had a sort of tunnel vision, only being able to concentrate on what's in the center of my view, and everything around it being shaky.  I also began to feel very nauseous, and felt the urge to get whatever was inside of me out.  I ended up throwing up three or four times and the queasiness went away.  The 'trip' lasted about two hours, and I finally regained control of myself, and my heartbeat slowed down.  This was the first horrifying experience.</p><p>About a month later, (I had smoked once since this experience with no bad side effects) I decided to smoke another bowl.  Mind you this was not the same weed from my first experience.  It was about ten o'clock on a Monday night, and I packed and smoked a bowl.  I was feeling fine, listening to music when all of a sudden the music became a little to scary for me, like it had some darker side trying to creep through to me.  I thought nothing of it, and as I left my room to grab a drink the same horrifying feeling hit me like a brick wall.  I stopped dead in my tracks, and I felt as if what was happening to me wasn't real, as if it was only one dimension out of many and my mind kept zooming in and out of the dimension I was stuck in.</p><p>At least this time I had an idea of what was happening to me.  I made it back to my room where I tried going on the computer, but I just couldn't seem to focus on what was on the screen.  I turned on the TV and tried watching some Seinfeld to calm me down, which was working until Kramer (a character in the show) said his line, 'These pretzels are making me thirsty' and it was in some kind of deep satanic voice like nothing Ive ever heard.  I quickly turned it off and laid in my bed trying to regain control.  I had the same extremely fast heartbeat and shakes as before, and it took serious concentration to remember where I was and what had happened.  I had to keep telling myself, 'It's Monday night and Im tripping' over and over again and it was as if I didn't I could easily forget everything and be lost in oblivion.  A few hours later I eventually managed to fall asleep and woke up the next morning feeling a little unnerved, but normal.</p><p>I may never know whether the marijuana was laced, or if I just had an extremely bad reaction to it.  What I do know is that I haven't been the same since those two trips.  I've been having 'flashbacks' for lack of a better description, where I have extreme anxiety of just about everything, nausea and vertigo.  I can definitely say I'll be abstaining from any marijuana use for a long time.</p>"
}
