{
 "title": "I Was One with Space",
 "author": "Stellar",
 "citation": "   Stellar. \"I Was One with Space: experience with Mushrooms (ID 50413)\". Erowid.org. Apr 27, 2008. erowid.org/exp/50413",
 "substance": "Mushrooms",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 ",
   "oral",
   "Mushrooms",
   "(cookie / food)",
   "  T+ 0:30",
   "  ",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "50413",
   "Male",
   " ",
   "Not Given",
   "Apr 27, 2008",
   "Views: 2938",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 12 grams of psilocybin mushrooms, if dried, is considered an extremely high dose, see Mushroom Dose Chart]</p><p>It was summer when this experience took place, and this wasn't my first.  A couple of friends and I had heard of a music festival that goes on every couple weeks at some guys farm.  We decided to go because of the reports of large amounts of mushrooms and possibly lsd at this festival.  We packed our things for camping and headed to the festival.  It was a warm summer day and my life seemed to be going good, I had a girlfriend, I had a nice job, and I had no previous bad trips.</p><p>We got to the festival and started scoping out a spot to camp.  Within 5 minutes of getting to the festival a man approached me with a backpack full of shrooms and chocolate bars for 15 bucks a bar and 20 bucks a bag.  I bought a bar and immediately ate it, it was 5 o clock.  We found a spot and set up camp and within 20 minutes I was feeling the effects.  I couldn't help but giggle and smile at my friends who were stoned but not tripping.  30 feet from the camp site was a giant football field sized field of bright yellow flowers that seemed to glow in a flouresent tint.  The sound of bongos and guitars filled the air and I couldn't help but feel great.  10 mins later I bought a bag of shrooms from the same guy that I bought the bar from.  I ate them plain with water and then went to the concert.  I was still trippin pretty hard but then the bag I ate started to kick in after another 20 mins.  The sounds of the band playing seemed to reach out and touch my mind in a way I can't explain.  The sounds seemed to morph into colors and a strange fuzzy feeling in my head.  I was giggling and thinking of thousands of thoughts at once. </p><p>I went back to the camp and decided to smoke a couple bowls with my friends which sent my trip into a planet.  Colors seemed to radiate off of everything which gave my surroundings a cartoony feel.  My mind was in utter amazement with the world I had sent myself into.  I enjoyed the festival, talking to everyone I could.  I realized I was speaking nonsense to everyone I could so I decided to settle myself down by going back to the concert. It was supposed to thunderstorm while we were out there but it ended up only causing lightning in the sky above because of the heat.  Everyone at the festival was amazed by the dry lightning.  When it would strike it seemed as if it slowed down and left a picture of itself into the sky and would not go away.  The clouds swirled into a pastel funnel that seemed to lead into space.</p><p>This went on for another hour before I decided to go and find more shrooms, and that's when one of my friends gave me half of his bag for free which I ate immediately.  I cannot explain the extreme technocolor world I was walking in, filled with faces, shapes, color, and sound.  Every step I took seemed to sink into the ground like walking on a spongey alien surface.  I sat down with a few rastas that were playing guitar and bongos and smoked a few bowls as I listened to the echoing thunder of the bongos and lighting.  The told me how their friend had bought a quarter of shrooms and still had a bag but didn't want it because he was having a bad trip.  I gladly took the unwanted boomers from them and ate them immediately once again. </p><p>I now had 12 grams of premium mushrooms bubbling in my stomache and sending me into a cartoon wonderland.  I was completely torn from reality and sent into a state of pure nirvana where I floated in a limbo like world.  I was still having glimpes of the real world and it seemed as if I teleported from the drum circle to concert with my friends.  By this time it was 1 a.m. and the festival was in full gear.  The band was jammin and the lights from the stage caught my eye.  They flowed in a wave like pattern to my eyes and almost had a separate water like sound to them.  I looked up into the star filled sky and just as I did someone had fired off a firework which looked like a spider when it exploded.  The spider stayed in the sky and then seemed to grab me and sling shot me into space.</p><p>I cannot explain the extremely visual neverland I was in.  It felt like being born, or what I could imagine what it feels like.  I felt completely weightless with a feeling of anxiousness to get somewhere, but I couldn't figure out where.  Technicolor surrounded me and I felt like I was one with my surroundings, completely covered by its beauty and mysteriousness.  I stayed in a trance like state for almost 3 hours, flowing with the mass of people and dipping in and out of reality.  My trip lasted a total of 12 hours and we finally went to sleep in the back of a friends car after a large smoke session which made us all pretty much pass out right in the middle of it.  </p><p>My experience has opened a whole new world of imagination and creativity in my life and I'm looking forward to many more.</p>"
}
