{
 "title": "Miracle Cure for Opiate Addiction",
 "author": "Lance D",
 "citation": "   Lance D. \"Miracle Cure for Opiate Addiction: experience with Buprenorphine (ID 50462)\". Erowid.org. Mar 19, 2006. erowid.org/exp/50462",
 "substance": "Buprenorphine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Buprenorphine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2005",
   "50462",
   "Male",
   " ",
   "Not Given",
   "Mar 19, 2006",
   "24057",
   " "
  ]
 ],
 "report": "<p>I first began using/abusing opiate painkiller pills when I was a teenager in high school.  I'd take hydrocodone or percosets recreationally.  I would usually only need 3 or 4 to feel a high off of them.  I was mainly a pot-head so I never really got addicted to pills until long after I was out of high school.  When I was 23, I tried oxycontin for the first time and loved it.  Since that first time of trying oxycontin, I have spent over 3 years of being an opiate addict.  I'd typically do about 80-160 mg of oxycontin or 100-200 mg of morpihine every damn day of my life.  After years of abuse I realized that I was in fact an addict.  If I missed one day, by day 2 I'd feel deathly ill until I got my hands on more opiate pills.  I have used alcohol and pot for half of my life, but opiates had the worst grip on me.  After landing in some legal trouble for a dui, I was facing a long time in jail because I was a repeat offender.  I decided soon after my arrest that I needed methadone or some kind of way to get clean so that I wouldn't die of withdrawls in jail. </p><p>I went to my doctor and spilled my guts to him.  I told him how I snorted OC pills daily and took handfulls of vicodin and morphine with alcohol and even injected demerol.  Being diabetic I had my doubts that he'd really want me on methadone.  He told me that methadone is only half successfull because it's just swapping an addiction to one pill for another.  He then told me how 1 doctor in town could perscribe a new drug called suboxone, and how unlike with methadone, that people can eventually ween off of suboxone and remain clean.  After calling and making an appointment with the suboxone doctor, I was scheduled to go take a UA and pay $100 up front to be on the list. Doctors in the US can only perscribe suboxone if they are liscensed by the DEA and they can only have 30 patients at any given time.  Luckily for me I was able to start the next week.</p><p>The only bad thing about starting buprenorphine or suboxone is that I had to be in complete withdrawls before beginning or I would have become severly addicted to the buprenorphine.  SO I went 48 hours and was deathly ill when I went in to start my treatment.  In the doctors office, they started by giving me subutex, it is a form of buprenorphine like suboxone, except suboxone has naloxone, which prevents injecting the pill.  Suboxone also makes other opiates  even heroin inactive if taken while on suboxone.  </p><p>Anyways, after giving me 20 mg of subutex, my withdrawl symptoms completely disappeared!  I had not slept the night before as I was going thru complete withdrawls. After getting the subutex, I stop shaking, color came back to my face, and I felt like I had just got high on oxys!  I then went back to the doctor the 2nd day for my dose and then it was determined that 20 mg was my proper starting dose.  So he wrote me a rx for suboxone.  When I take suboxone, I let the pills dissolve under my tongue.  They actaully taste good, they have an orange flavor.</p><p>Since I hadn't been sober from all drugs (i.e. marijuana, alcohol etc.) in 10+ years, the first few nights it was hard for me to fall asleep on suboxone.  However, by about the 4th day, I began sleeping better and felt like a normal sober person for the first time in a decade.</p><p>The first 2 days on suboxone I thought it was getting me high, but I realized that it was just killing all my withdrawl symptoms.  Anyone that's had opiate withdrawls knows how unpleasant it is.  So I believe that just not feeling the deathly w/d's made me feel as if I was high.  However, by the 3rd day, I felt just like a normal person.  I was told to dose right when I wake up so that I didn't get w/d symptoms and so that it wouldn't keep me awake at night.  </p><p>I started  7 months ago and now I am down to 4 mg (half of an 8 mg pill)  I stayed on 20 mg for 4 months, then I slowly began weening off of it. Weening down isn't near as hard as weening off heroin or morphine or oxys.  However, I do notice it slightly. I should be completely off of the 4mg in a week when I go back to see him. I cannot stress enuff about how well this drug works for me.</p>"
}
