{
 "title": "Ode to Caffeine",
 "author": "Merle",
 "citation": "Citation:   Merle. \"Ode to Caffeine: experience with Caffeine (Coffee) (ID 50463)\". Erowid.org. Apr 30, 2008. erowid.org/exp/50463",
 "substance": "Caffeine (Coffee)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Coffee",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 50463",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 30, 2008",
   "Views: 22942",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nCaffeine has become my favorite drug.  I've had significant experience with other stimulants: nicotine, cocaine, various amphetamines, ephedrine, and free-form amino acids like acetyl l-carnitine, l-tyrosine, etc.  \r\nI've quit nicotine.  I avoid cocaine entirely and have for years.  Sometimes I take amphetamines in the form of Adderall, but only 5 mg or less at once.  I'm sensitive to stimulants yet I enjoy their effects.  In my opinion, caffeine is really the best of the bunch.\r\nIts legality certainly plays into my qualification, but its good effect combined with its relatively benign nature are what really make it so nice.  I enjoy the taste of a good latte, too!  \r\nI rarely drink more than a regular cup of coffee at once.  That's certainly enough for me.  I play music for a living, and I find it to be stimulating both physically and creatively, unlike amphetamine which is only stimulating physically.  I prefer to just sip on a coffee while I perform.  It helps my coordination and concentration and I hear the music better.  I can play by ear better on caffeine.  I can read music more proficiently.  And there's no nasty comedown at this kind of dose.  There's really nothing nasty about it at all.  It just fades away when the primary effect is over.\r\nI can drink a cup of coffee up on stage and nobody thinks twice.  I can drink it while I teach lessons to children and nobody cares. Their parents usually comment on their own appreciation for caffeine when they see me with my coffee.\r\nI've never had withdrawal.  I've often gone weeks or months without consuming caffeine.  Never a headache or other symptom.  \r\nAll in all, after having tried the harder stuff, I find caffeine to be really all I want in the stimulant department.  Pharmaceutical amphetamines in very low doses are occasionally a better bet (for long driving trips, all-night studying, doing really tedious work) but I rarely need all that stimulation.\n\n\n"
}