{
 "title": "A Night (And Day) of Complete Bliss",
 "author": "J Jackson",
 "citation": "   J Jackson. \"A Night (And Day) of Complete Bliss: experience with Clonazepam (ID 50488)\". Erowid.org. Dec 17, 2007. erowid.org/exp/50488",
 "substance": "Clonazepam",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4.0 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 50488",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 17, 2007",
   "Views: 70528",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took my first dose of clonazepam because I ran out of oxy and hydrocodone. It was late night, about 1am and I had absolutely nothing to do the next day. I knew almost nothing about klonopin (clonazepam) when I took it, but I have a ready supply because my parent takes it regularly and gets a 3 month supply at a time. I took two 2mg pills around 1pm and after about 30 minutes, nothing really happened. So I figured this was a waste. No big deal I will get on the computer and research some other recreational drugs.</p><p>Well about 2pm the screen started wobbling back and forth, and as soon as I stood up, I fell directly onto my bed. I am a small guy 150lbs, so I'm not sure what doseage I would reccomend, but 4mg put me on my back. I layed down under my covers in the dark (that's the way I like to enjoy my hydrocodone highs) and from then on it turned into a pleasant feeling of carelessness. </p><p>Once I got used to the feeling I could get up and walk, but speech was slurred. I couldn't really care less about what anyone else who might have been around me said or thought. I was in my own world. It was great. I wouldn't recommend drinking alcohol or mixing clonazepam with other drugs, I think the effect would be too intense. The only negative effect of this drugs, if you can call it that, is that the next day asfter I took it, I slept until 6:30pm and had to be woken up at that time. This drug knocked me out for the long haul!</p>"
}
