{
 "title": "3 Hits From the Vaporizer",
 "author": "BehindtheVeil",
 "citation": "   BehindtheVeil. \"3 Hits From the Vaporizer: experience with Cannabis (ID 50504)\". Erowid.org. May 2, 2008. erowid.org/exp/50504",
 "substance": "Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 50504",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2008",
   "Views: 6526",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My head begins to feel light, floaty, high.  It takes a little while to come on.  The next thing I feel is like Im in the back of my head, it's like Im watching myself from the vantage point of behind.  First I notice these sensations and before I know it Im gone. I speak to Perry and it's like Im not even speaking Im watching myself talk.  I'm not even sure where these words are coming from, how Im answering how this is sane and still working, because the real me is off in some other land, so who is it there able to have this conversation?  </p><p>It flows forth, watching TV, the TV first gets garbled it makes no sense and then begins to make a new sense a divine sense the real sense.  It's like everything is clicking, I realize that it's all a pattern, that this is all nothing that time doesn't exist, that this is how it will be forever.  But the nagging feeling still hasn't gone away forever, somewhere in there it is saying 'Yeah but what about tomorrow?' and what about tomorrow?  Tomorrow will never come, it can't come.</p><p>My body is twitching, it's like a shiver, but Im not cold.  The thought 'Im dying' is constantly flowing through my head.  I go with it though, what other choice is there?  I must go along with the inevitable, to fight would be useless.  It's all familiar, it's all known.  I have questions and the answers come back, 'Always has been always will be'.  I think of reincarnation and a way out, and it seems that there is no way out, that I will come down only to come back up again only to come down again, that's the way things go.    </p><p>I'm extremely attracted to the girl in the room, she is beautiful I think of telling her.  I think through all the past missed love opportunities that is my life and know that this one is meant to be missed also.  I fantasize, I feel stirrings in my crotch, but this is all it will be.  Before I know it she is leaving and I haven't even said a word, I don't even know where the time went.  I've been so caught in this loop.</p><p>Fear is flowing through me and away from me, it is so strong, scary, I mean Im fucking dying!  I know it would be stupid to freak out so I keep my mouth shut.  I go upstairs to go to bed to escape this fear.  If I go to bed I won't have this fear tomorrow, yeah but I won't have this genius this power this knowing this, this, it.  </p><p>In the bathroom everything is normal, but not, colors are normal but they aren't there is almost like a rainbow in everything, but so minute.  I pee, but not sure Im done.  I'm losing myself, who am I, what is going on, the fear.  I'm afraid Im going to lose myself and do something stupid.  I flush walk out, still feel like I have to pee go back in, pee more and come back out Im very confused now.</p><p>I lay down to sleep all my covers on me, I stare at a poster I have on the ceiling it is black and white and crazy like.  Im staring at this poster and I hear sounds one is like the sound of something when you spin it real fast whoosh whoosh whoosh.  I also feel the presence or know they are coming for me, aliens.  It's like they are going to come out of the poster or the poster is going to suck me up.  </p><p>My whole crotch area is going through two phases, first it feels like ecstasy it is extremely powerful great pleasure flowing through it, so good so good.  This lasts for a while then it feels like I had been knocked in the balls, it is pain, not too extreme.</p><p>These thoughts pass and soon Im falling asleep, Im still looking at myself from behind and it's like Im asleep with my eyes open and what Im seeing is what Im dreaming.  I think the thought 'lucid dream' I go over what it means being aware that you are dreaming it has more significance than just this moment it is applicable to this trip it has made me aware of the dream that is life.</p><p>I begin really falling asleep when I close my eyes there are visual and they all make perfect sense and yet they are wild indescribable, beautiful and have feelings attached to them.</p>"
}
