{
 "title": "Multi-Purpose Trial....",
 "author": "ScarsthatStainme",
 "citation": "   ScarsthatStainme. \"Multi-Purpose Trial....: experience with  Kava, Salvia divinorum & Damiana (ID 50541)\". Erowid.org. Dec 4, 2006. erowid.org/exp/50541",
 "substance": " Kava, Salvia divinorum & Damiana",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 cup",
   "oral",
   "Kava",
   "(tea)",
   "  T+ 2:00",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "  T+ 3:00",
   "10 g",
   "oral",
   "Damiana",
   "(tea)",
   "  T+ 3:20",
   "2 hits",
   "smoked",
   "Damiana",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 50541",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 4, 2006",
   "Views: 8735",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had spent the day looking for an alternative to my constant use of cannibas. After looking through the brochure of my nearest Herbal High store, I had decided on a bit of a mix. Firstly figured that I needed a new bong, so I went in and purchased a new water bong (not only for my newly acquired herbs). Having tried Kava Kava and Salvia previously I figured that a bit of that wouldn't go astray. Before leaving work I had a Kava and hot chocolate drink. Apart from numbing my tongue this appeared to do very little.</p><p>I sat down with my gf at around 6pm and had a bong of salvia around 1 gram. T+2hours.</p><p>Upon exhaling I felt my body sink into the lounge chair I was sitting in, as if it was enveloping my whole being. I then had a vision of being on a river boat in the Amazon (dont ask me where that came from, I was thinking about sex at the time!), reallising that it was nearly impossible to speak to my GF due to the fact that every time I went to speak, my throat would close over as soon as the first syllable had escaped my mouth, making it very hard to breath.</p><p>I felt as though I needed to get off the boat. Off the boat I did get. Straight onto the concrete floor! I realised that I was not in my body in a sense but looking down at myself in this green putrid water(the floor of our garage is painted green). I started to come around a bit after this thought hit me and needed to get outside. A state of paranoia hit me, not unlike that which I have experienced of a bad mushroom trip (which I will write about soon). I had lit myself a cigarette somehow and was pondering with great anxiety as to how I was going to get outside.</p><p>As it happened I slithered under the garage door that was slightly ajar. Once outside I realised how hot I had become since inhaling the smoke. Once again I began to panic as I ran to the shower. At this point my GF, whom herself has not experienced any effect (due to the fact that her inhaling failed to bring any smoke through the water) was looking at me in total disbelief as I stumbled around the house, cursing and mumbling to myself. It dawned on me later that she had never been around anyone under the influence of a psychedelic, as she herself only smokes pot.</p><p>Once out of the shower I took the time to think about what had happened and came to the conclusion that nothing I had ever taken (I have experimented with many substances, some legal, most not) had had this bigger of an effect on me. </p><p>After heading out for dinner with no effects left (T+30mins)I returned home at 9pm to brew myself a Damiana Tea. Judging by eye, it was around 10g for one cup. I placed the leaf and water into a coffee plunger and left it to sit for 15 mins. After adding a tspoon of honey I downed the tea. Actually quite a pleasant taste, considering the smell of the herb was giving me a headache.</p><p>20 minutes after ingestion and feeling nothing other than calm, I returned to the Jungle....well no, I returned to the garage for another bowl. This time of Damiana. Burning very quickly and cleanly I managed to inhale 2 large lungfuls of this pungent smelling herb. Surprised by the relative tastelesness I retired to bed to see if there were any effects that I could feel.</p><p>Well, apart from becoming very easily aroused when touched, I only felt a little euphoric. Since my bedmate had found herself in the land of sleep, I attempted a bit of self-gratification. This was very shortlived as I was unable to keep an erection after becoming over-sensitive to the touch.</p><p>I have ordered a kilogram of Kava powder and will continue to drink Damiana tea for a while. However, Salvia, will not replace my desire to be stoned. It is worth noting, that I was very heavy headed the next morning when I awoke. Two hours after geting up I appeared to be functioning normally.</p>"
}
