{
 "title": "Retarded",
 "author": "Derker",
 "citation": "   Derker. \"Retarded: experience with Triazolam (Halcion), Alprazolam (Xanax) & Alcohol (ID 50558)\". Erowid.org. Dec 26, 2007. erowid.org/exp/50558",
 "substance": "Triazolam (Halcion), Alprazolam (Xanax) & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "0.5 mg",
   "oral",
   "Pharms - Triazolam",
   "(pill / tablet)",
   " ",
   "0.5 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "0.25 mg",
   "oral",
   "Pharms - Triazolam",
   "(pill / tablet)",
   " ",
   "1 glass",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 50558",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 26, 2007",
   "Views: 9332",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The night started off with me taking 2 Halcion and 2 small Xanax pills.  I invited my girlfriend over to keep me company.  Right before she showed up I took 1 more halcion (.25mg each) and had one small Bailey's and cream.</p><p>After that drink I have barely any recollection of the night.  Apparently I was completely belligerent, fell over on multiple occasions, sang songs about being a woman, and then passed out.  While I was out my girlfriend said I was convulsing for a short period of time, and then became somewhat catatonic-  I was laying down but holding my hand up, and she could mold my fingers into any shape she liked, they would stay that way.</p><p>I am lucky she stayed with me that night and kept me in check, I have no idea what else I could have done while under that heavy of an influence.</p><p>That said, benzos and alcohol in general will lead to problems, and blackouts.  So doing them together is not a good idea in the first place.</p><p>I use Halcion on a regular basis to help with sleep.  If I take double or triple the dosage then I get into a very hypnotic-esque mood before falling asleep, if not passing out completely.  I make hiphop beats-and have woken up the morning after a halcion use with the loop still playing 8-9 hours later.  Goofy, but true.</p><p>They say Halcion isnt that great for you, especially compared to other benzos.  I enjoy using Xanax and Valium recreationally, but I find them necessary as well for my social anxiety.</p>"
}
