{
 "title": "Time Prolapse",
 "author": "Speedbasssux",
 "citation": "   Speedbasssux. \"Time Prolapse: experience with Salvia divinorum (20x extract) (ID 50622)\". Erowid.org. Aug 14, 2007. erowid.org/exp/50622",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "50622",
   "Male",
   " ",
   "Not Given",
   "Aug 14, 2007",
   "Views: 2873",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The night before the trip, my girlfriend (130lbs.) and I first tried smoking 20x. We vastly underestimated the strength. I smoked four hits and she was like 'No no, this is how you do it.' She took one hit and the plant hit us full force. She was supposed to be my sitter, but now we were both gone. We made the mistake of being outside and walking when we took it. I looked around the gravel ditch we'd been walking in and the horizon line kept repeating itself as I panned around. A gigantic laughing fit overtook us and we held onto each other for support. It was very cold and I suddenly found myself in an environment that can only be described as a cross between antarctica and the moon. We were only two people left on this planet. </p><p>My girlfriend began lying down and I tried to get us back to my house before things got any weirder. We cannot stress enough how quickly and strongly the salvia took to our heads. It hit us in all of about two minutes. Peaked at four minutes and slowly came down over the next forty minutes. We made it back to my room and spent the next forty minutes under the covers listening to ambient music and stay focused on being calm.</p><p>There was a quality about time that peaked our interested. The whole experience to her felt like only five minutes, while I felt like hours had passed. The only analogy we could fit was that time was like a shoestring. Normally we travel from one end to the next in a linear fashion. But it felt like salvia tied a knot in the string, allowing us to vist the same moment more than once and stretch and shrink the passage of time. It should be stated that this effect wasn't voluntary though.</p><p>The next morning I felt as if I should give salvia another chance because the first trip was fucked up in the set and setting department. This time we made sure everything was correct. I laid out a blanket and pillow on the floor, had a glass of water nearby (I cough a lot when smoking), and this time my girlfriend abstained from smoking. We also opened the backdoor to provide fresh air flow. </p><p>After taking three hits, the now-familiar laughing fit took hold. 'Here it comes...hahahahaha!' I spent the next few moments feeling my mind reset itself to the rules of the salvia game. Everything became animistic. I now saw the spirits living within everything. The rug, the t.v., the glass of water, the salvia itself was directing my eyes and pointing out things. It was as if the salvia was showing me how to look at things in a more positive light. I remember saying that the plant had totally redeemed itself.</p><p>I looked outside and very slowly realized that I was on the beach of an ocean. We live in Arizona. I turned around and began describing this to my girlfriend. Suddenly I felt like I had age regressed to being a small boy with a babysitter or nurse figure watching over me. I had the blanket draped over my legs and I got the impression that I was a sick little boy and that my girlfriend was my nurse taking me on a trip to the ocean in my hospital bed. It should be said that this was not frightening or difficult at all. The over all impression of the trip was one of being taken care of and feeling secure. </p><p>As I was relaying this to her, the television suddenly interrupted my conversation. I began simultaniously conversing with my girlfriend and the tv. The tv didn't have much to say, more like just a general affirmation of itself. 'I am a television.' We stood up and she guided me by the hand out into the back yard. I wanted to walk through the door and see what was outside. Outside, the oceanic impression was stronger. I felt the wind across my face and saw the palm trees, which are actually there, swaying against the sky. I caught a glimpse of a tiny blue ball underneath a patio chair and found it's existence very amusing and slightly sad. I wanted to root for this underdog character of a ball. </p><p>About this time, my girlfriend's ecstasy she took prior to my smoking, began to kick in and we went back upstairs to my room. By that time I was already halfway down from the salvia trip. We've come to refer to s. divinorum as a wildcard that throws all our basic assumptions about time upsidedown.</p>"
}
