{
 "title": "Kicked Acid's Ass",
 "author": "Downsouth420",
 "citation": "   Downsouth420. \"Kicked Acid's Ass: experience with DOB (ID 50645)\". Erowid.org. Jan 26, 2007. erowid.org/exp/50645",
 "substance": "DOB",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "DOB",
   "(blotter / tab)",
   "  T+ 4:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "50645",
   "Male",
   " ",
   "Not Given",
   "Jan 26, 2007",
   "15454",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After hurricane Katrina, I found myself living in Baton Rouge. After meeting a friend, I was chilling with him and mentioned that I wish I could get some acid. He then pulled out a 10 strip and told me that this stuff will last longer than acid. I bought two of them. I had a 12:00 PM class the next day, so I figured I could drop it and be straight by the time class started.</p><p>So at around 8:00 I was at a dinner with my family when I went to the bathroom and dropped the 2 hits and went back to eat dinner. At around 8:45, I felt it starting to take effect. So I told my parents that I wanted to leave early to go out with some friends. I drove home and chilled out in my room watching TV. I noticed almost instantly stuff was already popping out of the screen. </p><p>After about 4 hours, I was wide awake but didn't have the urge to smoke a pack a minute like I do with acid. But I did feel like smoking a bowl. So I smoked a bowl of KB and went back to laying down. I popped in Wizards and started watching that. About 5 minutes into the movie the peak of the weed started to kick in and the movie literally popped out of the screen. I don't mean like a finger coming out or anything like that. I mean the movie popped out of the screen and was being acted in thin air in front of me! </p><p>Around 8:00 AM, I was still tripping balls. Everything was like if I was peaking on 2 hits of good acid. I was worried about being able to function around my parents. And I was especially worried about driving to school. I would try practicing talking, but my mind was so tripped out that I would just mutter nonsense.</p><p>Around 10:30, I started to regain my senses. I walked downstairs and helped my mom with her computer. I simply said basic stuff to her, making a point not to ramble or space out.</p><p>I made it to school. I was still tripping pretty hard so when I got to class, I started to look up trippy pictures which popped out of the computer screen. My teacher walked in and announced that we were taking a test that day. My response to the essay question was memorable and should be listed as, 'I can't believe she accepted psychedelic ramblings!' </p><p>By 1:00 PM, I wanted so bad to get home and go to sleep. So I arrived home only to find my brother standing outside wanting a ride to a city about an hour away. After pleading with him, I managed to get him to drive my car while I slept. (I told him that I didn't sleep the night before.) </p><p>We got to his destination, where I took a nap for a couple of hours. When I woke up, it was starting to get dark. I was still tripping though! I drove back myself only to find that it was night time and storming. I could barely even see the road the whole time. How I got home was purely luck and a strong will to not wreck my car and kill myself. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>About 9:00 PM, I got home and said hi to my parents. I immediately went upstairs and straight to bed.</p><p>All I have to say is this: DO NOT take this stuff lightly. Even after plenty of experience with acid I was blown away by this stuff.</p>"
}
