{
 "title": "A Very Bad Trip",
 "author": "MrM",
 "citation": "   MrM. \"A Very Bad Trip: experience with GBL (ID 50725)\". Erowid.org. Oct 11, 2009. erowid.org/exp/50725",
 "substance": "GBL",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 ml",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 0:05",
   "1.0 ml",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 0:15",
   "1.5 ml",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 0:25",
   "1.5 ml",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 0:27",
   "0.5 ml",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 50725",
   "Gender: Male",
   " ",
   "Age at time of experience: 17",
   "Added: Oct 11, 2009",
   "Views: 5324",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n17, uk 200lb male, low bodyfat.<br>Time   Total Ingested<br>1.05 am 1.5ml<br>1.10    2.5ml<br>1.20    4ml<br>1.30    5.5ml<br>1.32    6ml<br>All mixed with diet coke<br>(times approximate from hereon)<br>Previous doses 1.5ml, 2ml. I knew this one was too much and didn't especially care.<br>1.35 got out of chair to go to toilet was swaying about heavily very dizzy, very hot, decided to leave the house. couldnt really move my hands properly.<br>1.45 got up to main crossroads after wanderin down the middle of the road for a bit I felt the need to be sick but only spittle, was layin in the road for a bit starin up and I can remember I could hear loudly whenever I moved my feet. I could also hear advertising boards switching adverts extremely loudly in the distance and cars. From here on it gets a bit blotchy with my memory but witnesses have told me + what I can remember.<br>2. after lots of wanderin about and fallin down I apparently wandered into a kebab shop looked extremely confused then left, a little way outside I then fell backwards over railings and collapsed onto grass, I remember the grass feeling really great and soft so I closed my eyes.<br>2.05 a few shouts as some men from the kebab shop saw me they came over and was saying 'Mate are you alright? Hes fucked. Hes seriously fucked' although I could hear them, I couldn't actually reply.<br>2.10 ambulance is called, they're told to move me into recovery position but I physically refuse to lay anywhere but on my back. I remember one of them saying my name and 'Blink if you can hear me, just blink' and I blinked n opened my eyes but all I could see was a spirally white light, probably a street lamp and some shadows of people. I then go unconcious.<br>Im told I was having a little fit on and off and breathing very shallow from here on. Im covered with jackets to try and keep me warm. An ambulance car arrives at 2.20 and checks my pulse which is 40 and calls for a big ambulance to deal with it. When they arrive my pulse is 36. Im put onto a stretcher and into the ambulance a tube is shoved down my throat.<br>2.30 I can hear people saying my name and saying do you know where you are can you hear me, you're just goin 2 feel a scratch on you're hand, at which point I clenched my fists closed and they kept asking me to relax which I finally did, Im aware they did this to check blood sugar level. I opened my eyes and could see a woman in green and hear her but couldnt look at her or respond, a short while later I snapped out of it a bit and managed to respond, she asked me what I had taken and I looked over at the 2 police and other ambulance person. I was a little worried about the police but knew gbl was legal and probably not the best time to lie and say nothing right? She reminded me that anything I say is completely confidential and I said gbl, she said to the police I hadnt been violent at all and that it would be fine for them to leave. I then went back to sleep or whatever. <br>3am. I woke up back in the hospital all hooked up to all sorts of stuff and noted my pulse was 80, I took it all off and tried to get out of the bed but was still very dizzy and fell over, someone came over and I said I need toilet, so they took me to the toilet. I went back, after some questions she tested my reflexs to which I had literally no response and this worried her anyway after lots of blood tests and finally checking my potassium level was back to norml, sleeping on and off the time was around 8/9am and I was released. <br>9am went home and slept till about 4pm my blood felt really hot in me, woke up felt fine, slept again at 4am for 12 hours. Feel okay but I can't really concentrate.<br>Again I didn't accidently take too much, I knew this much would hurt me. GBL in lower doses is a pleasurable trip, but things can go over the edge real quick.\n\n\n"
}
