{
 "title": "Absolute Lucidity",
 "author": "Dreamscape",
 "citation": "   Dreamscape. \"Absolute Lucidity: experience with Calea zacatechichi & 5-HTP (ID 50796)\". Erowid.org. Mar 13, 2006. erowid.org/exp/50796",
 "substance": "Calea zacatechichi & 5-HTP",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Calea zacatechichi",
   "(capsule)",
   " ",
   "50 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 50796",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 13, 2006",
   "Views: 252692",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Both taken 1 hour before laying down to sleep.</p><p>Had a nighttime herbal tea right before laying down.  No effects felt but fell asleep within minutes of closing eyes.  What happened next is amazing.</p><p>I felt myself fall into the dream World, in fact, I willed myself straight to sleep and right into a dream like I was stepping outside the front door of my home into another realm.  I instantly knew I was in a dream.  I even said to myself, 'Wow, I just laid down to sleep and I'm already lucid!'  I remembered taking the Calea and having my herbal tea just moments ago and here I was, completely ensconced in my dream with absolute lucidity.</p><p>I looked at my hands, played with a cat in front of me and looked into its eyes knowing it was a dream, saw friends and laughed at them that this was just a dream of mine and they looked at me like, I know, but this could be fun anyway.  I was in a dark mansion, looking at the window I could see cobwebs in the corners, a car drove by outside, everything so real, so detailed.  I couldn't get the lights to turn on in the house. I looked closely at the old dusty lamps and was amazed at how detailed and real everything looked.  </p><p>The dream was linear, time moved normally.  I could go into every detail of the dream and experience, but I believe that the 'lucidity' is what is important.  There wasn't a moment that I didn't feel like I was not dreaming.  When I would wake up, I would say to myself 'Wow, let's see if I can go back.' And I thought of a room in the mansion as I was lying there, and tiles started to appear behind my eyelids as visuals and I was walking and again and I turned, I knew I was dreaming and walked right back into the same place, same events, same linear time.</p><p>I plan to try this again tonight and see if I can expand beyond my amazement of lucidity.  I do remember jumping high in the air and landing softly from high cliffs, total freedom and knowing I was not going to die.  What I do find interesting, even though I know I am 100% dreaming, I still protected my friends and was cautious of what they did.  I did not want them to be hurt or perhaps I did not want to see anything bad happen to anyone in my dream.  </p><p>In conclusion, I do become lucid every so often, but not like this.  This was complete understanding of my surroundings without loss of lucidity.  It will be interesting to see after a week of testing if not taking before bedtime will change my dreams, or will it destroy my ability to dream?  Will colors cease to exist?   Will my life become duller? More exciting? More frustrating?  Will there be withdrawals?  As with any natural substance, proceed with caution, and as always, BE CAREFUL WHAT YOU WISH FOR. </p><p>Enjoy.</p>"
}
