{
 "title": "Just an Observer",
 "author": "Tasha",
 "citation": "   Tasha. \"Just an Observer: experience with LSD & Cannabis (ID 5083)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5083",
 "substance": "LSD & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 drop",
   "oral",
   "LSD",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "5083",
   "Female",
   " ",
   "Not Given",
   "Jan 11, 2002",
   "6712",
   " "
  ]
 ],
 "report": "<p>\nI have just started to use drugs regularly and I was anxious to try LSD because I heard of how wonderful the tripping experience was from friends. We came upon our trip by accident on a Wednesday night, just by being in the right place at the right time while we were purchasing some marijuana.  A friend paid the five dollars for my boyfriend and I to trip together (one hit apiece) and took three for himself.  We took our drops at about 6:45.  I remember that they were minty, like breath drops, and that I had to stick my tongue out to recieve the drop.  We then smoked the ceremonial bowl that comes from buying from our dealer.  </p><p>We all got in the car and decided to go and get some food.  We smoked a joint on the way and I was feeling a little high when we entered the restaurant.  My back also had a huge knot in it for some reason, right in the center and nothing that I did could fix it, but soon, I forgot about it.  There were four of us that night and three of us took the LSD.  As soon as we walked through the door, we started to laugh at something stupid that someone said.  The cashier just looked at us.  I was looking at the board trying to choose what I wanted to eat and I remember how bright the board was and how much all of the lights in the restaurant hurt my eyes.  I felt like I was moving in slow motion and I thought that everything was funny.  Throughout the whole meal, all four of us just laughed at everything.  We were bring loud and obnoxious but we didn't notice it then.</p><p>We got back into the car and went to pick up another friend.  As we were driving we listened to Primus and the music felt like it was inside of me.  My whole body felt like it was completely open to every sound and light.  My friend who had taken three drops got out of the car at one point to look at the full moon that was covered by clouds.  When I looked up, it looked as though the clouds were breathing and stretching down towards me.  Rays of light shot out of the moon and reached down to the ground.  </p><p>I was having so much fun, just laughing and chatting with my friends.  More than anything, I just observed what was going on around me.  After we smoked the blunt we headed home because my boyfriend had to be in by his 10 pm curfew.  On the way to J's house, the 'service engine soon' light came on in my boyfriend's car.  It's a bright orange color and I found myself staring at the light.  All that I could see what that light.  We dropped J (who had taken three hits) off at home and then headed to my dorm room, talking the whole way about life in general.  When I kissed my boyfriend, it felt like sparks were exploding between us.</p><p>In my room, I sat at my computer and stared at the wallpaper on the computer.  It is a trippy design to begin with, but the more I looked at it, I realized that the wallpaper was crawling around on the screen.  Every light looked incredibly bright and when I looked in the mirror, I saw that my pupils were hugely dilated.   Stared for about two hours at my computer screen, watching it crawl and melt.  I decided to lay down at 2 AM because my room mate was also going to bed and I just lay down in my bed and watched the red digital clock changing.  I slept restlessly as well.</p><p>When I woke up, I felt weak and lights still seemed extremely bright.  In the shower, I kept zoning out and staring at the floor.  My arms and legs felt a little strange as well, like they were filled with stuffing instead of with flesh and blood.  By that night, I was feeling back to 100% again.</p><p>It was a good trip and I loved it.  I loved feeling completely open to anything.  I was aware of everything, but I was detached from it.  I was just an observer that night, not an active part in the world and I liked it that way.  It wasn't overly intense and I didn't get stressed by the people or situations around me because my friends knew what we were doing and how it felt.  It was an all around good experience and I'm looking forward to doing it again.</p>"
}
