{
 "title": "No Knees",
 "author": "Atom",
 "citation": "   Atom. \"No Knees: experience with Sophora secundiflora (Mescal Beans) (ID 50931)\". Erowid.org. Feb 20, 2007. erowid.org/exp/50931",
 "substance": "Sophora secundiflora (Mescal Beans)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 0:00",
   "2 seeds",
   "oral",
   "Sophora secundiflora",
   "(seeds)",
   "  T+ 0:45",
   "2 seeds",
   "oral",
   "Sophora secundiflora",
   "(seeds)",
   "  T+ 1:15",
   "2 seeds",
   "oral",
   "Sophora secundiflora",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "1994",
   "ID: 50931",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 20, 2007",
   "Views: 18359",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>About 11-12 years ago a friend and I decided to try to find out why a Shaman's belongings displayed in the Whitte Museum in San Antonio, Texas contained a small leather bag with 17 Mountain Laural seeds (Sophora Secundiflora). These had been found in a Central Texas cave dated back 600 or so years ago. I could not find any information about what a Shaman would use these for and all the books just said 'poison' but offered no proof or clear explanation of what these were used for. I assumed the real use in that culture had been lost in time.</p><p>One evening while drinking a few beers and trying to come up with the answer to this riddle, one of us came up with the bright idea to go where no white man had gone before and we began cracking open some Mescal Bean seeds with pliers and slowly eating the bitter peanuts inside. We ate a couple and waited. Forty five minutes later - nothing, so we ate a couple more, still nothing. So we ate a couple more. Finally my friend starting feeling some degree of vertigo followed by nausea and vomiting. I ate several more but I never felt nauseous. After about 2 hours we both began to feel like we had to sit followed by the extreme need to lie down. I thought we were beginning to feel the onset of some mild form of paralysis.</p><p>We both felt like our knees were just gone. Also gone was the will to move. Someone suggested we should call 911 but neither of us was wanting to actually stand up and walk to the phone. I fully expected some sort of hallucinogenic experience but nothing resembling that ever materialized for either of us. The predominant feeling was being overcome with immobility but with normal levels of consciousness. </p><p>All in all, I still can't say for sure what these beans were used for a thousand years ago. Our experience certainly wasn't close to a religious experience although I can see this could have been used in conjuction with something else for that purpose.</p><p>I would not do this again and don't recommend it. From my experience I can say one red bean probably won't kill you but I may have been only one additional Mescal Bean from death and not known it.</p>"
}
