{
 "title": "Thought Music",
 "author": "Derek",
 "citation": "   Derek. \"Thought Music: experience with Mescaline HCI (ID 51001)\". Erowid.org. Apr 25, 2007. erowid.org/exp/51001",
 "substance": "Mescaline HCI",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "250 mg",
   "oral",
   "Mescaline",
   "(capsule)",
   "  T+ 2:15",
   "400 mg",
   "insufflated",
   "Mescaline",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51001",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 25, 2007",
   "Views: 26606",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am somewhat of an experienced psychonaut. But no sort of psychedelic use could prepare you for a somewhat of a high dose of Mescaline. </p><p>I bought a gram of it from a guy I barely knew from a a party a while back. I couldnt decide who to share it with, but I knew a girl whose birthday was during the week, so I decided to give her some. Lets call her Stevie. Being rather exited, I drove to her house which was a few hours away. I arrived at her house.</p><p>T - 00:00 Me and my friend each had a 250mg capsule of Mescaline HCI. Mostly an empty stomach, because we hadnt ate for 4 hours.</p><p>T + 01:00 the anticipation was unnerving. I've heard that it takes a long time to come off base line when taken orally.</p><p>T + 01:45 I start to notice brighter lights, but nothing extremely noticeable. We had to take one of the girls friends home. Luckily we still had a trip setter. Lets call her MAC.</p><p>T + 02:15 We arrive back at stevies house. I have 500 mg left, so I lay 6 fat lines of it on the table in her room. She has 1 1/2 of a line, but she licked it slowly. Very bitter I might add. I then proceded to snort The remaining 4 1/2. Now I knew that snorting hurt, because I snorted a fair share of MDMA. But MDMA snorting is no where near as bad as snorting 400 mg of Mescaline. My face turned bright red. Mac had to make sure that I didnt pass out when I stood up because I had the most bizzare look on my face when I blew those 4 100mg lines.</p><p>T + 2:20 Describing the next 8 hours will be difficult. But a good word to describe it would be FUCK! Feelings of energy yet tenseness swept over the back of my head and went over my body. Deep relaxation. Yet there was something underlying this beautiful energy. The only way to describe this would be a light nausea feeling. I thought that I was going to vomit, but I forgot all about it when...</p><p>T + 2:50 The techno Stevie started to play. WOW the music was familiar. Infected Mushroom, Lords of acid. Incredible. Its felt like the music was coming out of my body, and into the sterio. It was strange. I had a sudden urge to dance.</p><p>T + 3:30 Stevie starts to feel her extra booster. I start to notice waves, closing walls, ect. Almost like mushrooms</p><p>T + 3:45 She gets out these decorative string things with Prizim like beads glued to the end. She stood in front of her computer and started to swing them around graciously and swiftly. The light show! amazing! The light from the comuter was deflecting through it in the most spectacular way. A weird thing about the whole night was that it seemed rehersed. Except for me. Everone was doing everything so perfectly that it was quite impressive. When stevie was swing the prizims around, it was in perfect harmony with the song that was playing, which happend to be a very fast song called techno cocaine. Thats what the powerful feeling of it was. It was that every thing seemed so perfect and needed to stay that way.</p><p>T+ 5:00 We chatted for the longest time about random philosophies and about how the physical world worked.</p><p>T+ 5:30 Her grandma made me leave her room (I was a guest at her house and her grandma didn't know any thing) and go sleep in a room on the other side of the house by myself.</p><p>This is where I lost track of time, because I had no clock to look at. I crawled under the covers of the guest bed and tried to sleep. This of course was not going to happen, and I had insufflated a large quantity of mescaline. I layed there for what seemed like a fucking eternity, but I found a way to keep myself busy. Laying extremly still, so still to where the silence became deafening, I found that whatever I was thinking, could be translelated into music(synestisia?). Different thoughts made different sounds.</p><p>So I decided to rapidly swich thoughts and to my exititment, I had created the most wicked creepy and long techno song in the world. I wish there was some sort of device to record this sort of music. Insane! Well I finally came down to what I'm guessing was 6 in the morning. The 4 100 mg lines were tooken around 11:45pm. I woke up at ten. No back pain, no headache, no hangover, no nothin. Actually extremly rejuvinated.</p>"
}
