{
 "title": "Sensitive",
 "author": "BongBuddha",
 "citation": "Citation:   BongBuddha. \"Sensitive: experience with Cannabis (ID 5101)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5101",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5101",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 11, 2002",
   "Views: 11757",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've been a moderate to heavy cheeva-choker for the past several months, and I seem to be more succeptible to the wonder weed's psychedelic effects than the average person. (If anything, my sensitivity to pot has increased since I began using it.) I often have hallucinations of a sort- although the visual 'hallucinations' are more like daydreams of such extreme potency that i actually see them overlaying reality. Yesterday, though, I had an experience which blew all previous highs away- and without a particularly large amount.\r\nMy friend and I were smoking up in the park with my beautiful technicolor bowl Kate. My mental state at the time is important- I had just previously gotten out of a state of extreme frustration and tension and had begun to release the pressure in a strange, aggressive torrent of energy. It was a Friday and I was finally feeling more or less relaxed and in a state of total abandon.\r\nThe hydro took effect MUCH faster than usual- mere seconds after the first toke. The characteristic hot-and-cold pins-and-needles feeling (yum) was especially intense. My friend and I began to wander aimlessly through the park and I took it upon myself to make him giggle inanely. Then a strange thing happened...\r\nMy vision isn't fantastic, and weed usually makes it more distorted than usual. But I saw, for a moment, a tree with INTENSE clarity. As I continued walking, the episodes became more and more frequent- I would see the grass or trees with a kind of pure pristine vision, and the color enhancement would be MUCH greater than that of a normal buzz... the greenness of the grass would become so overwhelming and so full of light and life that it was literally blinding. I had a powerful clear feeling during each of these occurences, which faded in and out in rhythm, that I was seeing the real world, as if reality were in a dimension slightly askew from our own and i was being granted the opportunity to gaze into it. The body buzz built, and the electric currents I felt moving through my torso became more powerful, until during each moment of superbright illumination it felt like I was being struck by lightning, and I felt shocks of extremely intense, almost sexual pleasure. (I realize that a near-orgasmic experience on a drug as mild as pot seems extremely bizarre. This was NOT a normal high.)\r\nMy friend and I also experienced a kind of telepathy greater than what we normally see on weed, and as we talked pseudo-buddhist philosophy (as we normally do when high, when not making fart jokes and giggling like morons) I KNEW the next word he was going to say before he was going to say it. \r\nI don't know what to say in conclusion, except that the way a drug effects me is based on my mindset at the time, a fact which is all too frequently overlooked.\n\n\n"
}