{
 "title": "Invisible Force Massaging My Body",
 "author": "Geraldo",
 "citation": "   Geraldo. \"Invisible Force Massaging My Body: experience with Morphine (ID 51035)\". Erowid.org. Feb 3, 2008. erowid.org/exp/51035",
 "substance": "Morphine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "insufflated",
   "Morphine",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51035",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 3, 2008",
   "Views: 34771",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all began when I saw a guy in my German class with his arm in a sling.  Being one who uses vicodin for recreational uses on occasion, I saw a prime opporunity for a fun night.  I asked him about the vicodin, he was willing to sell some, but his buddy came up with a better offer.  Two 30mg pills of morphine-sulfate for 20$.  Outrageous price, but I had never tried it before and morphine was a rare occurence to come across.  So we agreed he would drop them off at my work for me and I'd pay him.  The transaction completed, I was happy with my tiny tablets.</p><p>I went home after work excited to associate myself with a new substance.  I ground up and snorted one pill.  I timed the effect to take hold about 5-10 minutes after I finished the line.  It was noticable, but weak.  But I waited.  An hour later I was flying.  It felt like some invisible force was massaging my entire body when I relaxed.  My vision was slightly distorted, but nothing mind-blowing.  I had a tendancy to walk in a strange fashion.  Probably because it felt so foreign an action for me to do.  </p><p>After five hours of introspection, I decided I was ready to pass out.  I climbed into my bed and lied down.  It felt like I was moving, but I wasn't.  Like being thrown through the air in a front-flip motion.  It didn't take long for me to fall asleep, but I felt like I had been dead for three days when I went to work the following morning.</p>"
}
