{
 "title": "No Good for Sleep",
 "author": "The Sleeping Troll",
 "citation": "   The Sleeping Troll. \"No Good for Sleep: experience with DOI (ID 51042)\". Erowid.org. Aug 12, 2006. erowid.org/exp/51042",
 "substance": "DOI",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "DOI"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51042",
   "Male",
   " ",
   "Not Given",
   "Aug 12, 2006",
   "Views: 6466",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I purchase 3 hits of DOI against the advice of my dealer, who says its best to take only 1 hit. He said it would last 16 hours, and I laughed thinking, 'This hippy is trying to talk it up'. I ingest 3 hits and go to a drum circle.</p><p>T+1:00 </p><p>No effects</p><p>T+2:00 </p><p>Slight Euphoria, but the 'feeling' came to me, the feeling I gets when I know tripping shall occur</p><p>T+3:00-4:00</p><p>Heavy Euphoria, body high.. I ride in a car home from the gathering, and it is fantastic... I arrive back to my house, there I contemplate the meaning of 16 hours... for some reason I believe him now.. and it begins...Im very freaked out because I am staying with my parents and I dont have a car at the time.. no where to go, nothing to do... I try to sleep. Nothing. I get more and more freaked out and now every time I close my eyes I hear terrible quality reggaeton music and see various images of skulls, fire, and other such demonic things. Then I quit trying to sleep.</p><p>T+4:00-6:00 </p><p>I watch Curly Sue with a renewed interest. It was fantastic, wonderful, excellent. Haha. I laughed and rejoiced.</p><p>T+7:00-8:00 </p><p>I foolishly try to trick my self into sleeping and all of the aforementioned symptoms occur again. In the same intensity.</p><p>T+8:00-10:00 </p><p>I watch Father of the Bride and it likewise was seeming one of the best movies ever. </p><p>T+10:00-16:00 </p><p>I try to sleep, now I cant really express to sort of hell Im experiencing now, all of the same things but I try to battle them. I try to pray and when I pray I see with closed eyes arrows shooting out into oblivion and exploding. I want to cry but I dont. I just keep going through the same things. Ill have moments of peace soon after I convince myself that God will put me to sleep, little did I know, he certainly wouldnt. </p><p>T+16:00-20:00 </p><p>I feel bad, like I had a bad trip all night and didnt sleep. I watch TV and try to eat, which isnt pleasant.</p><p>The next day, I feel like crap and my eyes are dilated, this doesnt end for 2 days.</p><p>Overall, it sucked and I wouldnt do it again, and I am not an inexperienced Psychonaut either, I dont know what it was that happened to make me think like I did, but I just wouldnt do it again.</p>"
}
