{
 "title": "Take it Slowly",
 "author": "C.J.",
 "citation": "   C.J.. \"Take it Slowly: experience with Brugmansia suaveolens & Cannabis (ID 5109)\". Erowid.org. Feb 11, 2001. erowid.org/exp/5109",
 "substance": "Brugmansia suaveolens & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "2 flowers",
   "oral",
   "Brugmansia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5109",
   "Male",
   " ",
   "Not Given",
   "Feb 11, 2001",
   "Views: 18937",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p> During the last few months I have been experimenting with various psychotropics and hallucinogens. I had my chance to experiment with Brugmansia after finding a couple trees in a tropical garden. i took two flowers and infused them in a tea with 1 liter of water (this is a good recipe). I drank half the tea in one sitting waited an hour and then slowly drank the rest. </p><p>I am going to skip a lot of useless details in the beginning since they were so typical of a datura like trip (i.e disappearing pencils, body buzz). My climax although typical was extremely interesting. Apparnetly i thought it was ten oclock in the morning instead of ten at night. I didnt know what day it was and so i just assumed that i was gonna be late for an 11 oclock exam that i had already taken earlier that day. I didnt realize that i didnt have to study until i asked myself 'why is it so dark out this late in the morning?' . then i proceded to look around my room. then i would get paranoid about my test and start studying again. </p><p>this loop lasted like 30 or 45 minutes. during which i noticed there were people in my room of which i could only make out one. The others were vague but doing weird stuff like climbing under my bed. The funny thing was this seemed so normal that i didnt even focus on them (i was too busy pretending to study). instead i would look up once in a while and think to myself 'wasnt there a person behind me?' then i would turn around only to see them vanish. This was extremely entertaining as was the majority of my trip. However i would not take this drug lightly. </p><p>There are three main things that i think are unique to this type of drug. </p><p>One is the high comes on slowly. For me it took almost an hour and a half to two hours. \rSecond is that the active ingredients i think stay in your system longer than what you would normally think. this explains why you can become high again the next day. What this means is that you should never take some and get upset cuz it didnt work and take more. I'm guessing thats how a number of people get poisoned. \rThe third thing is a lot of times you dont realize you're high until other people point it out to you and not even then all the time. the moral is go slowly and dont be so desperate that you dont stop before you trip. </p><p>\n\nIts ok have a sober night or two and try again later. One final thing about brugmansia is be careful who you run into. For example the peak of my trip which i recounted above occured just after i got off the phone with my girlfriend. At first I didnt tell her i was tripping and she was traumatised until i did. You cant fake it on this drug its not like weed. So before you dose with this think who your going to have to face and make sure they are down with you tripping cuz if you dont tell them they will think you're insane or that you have a serious problem. All in all i will definitly repeat this drug, but i would only reccomend it for those willing to take the time to think and prepare before doing it.</p>"
}
