{
 "title": "Exaggerated Accuracy",
 "author": "Jiffey",
 "citation": "Citation:   Jiffey. \"Exaggerated Accuracy: experience with Drug Testing (ID 51095)\". Erowid.org. May 27, 2006. erowid.org/exp/51095",
 "substance": "Drug Testing",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51095",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 27, 2006",
   "Views: 11104",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\nI was a chronic marijuana user for about 20 years. I used to smoke every day starting at 5:30 AM before work, then on my lunch break at work, more on the drive home after work, and a bowl or two in the evening. I had an excellent attendance record, received great performance reviews, and progressed from an entry level position up to a department supervisor in my 10 years at this job. I moved to a different state and quit my job and also quit smoking weed. \r\nA friend told me that it takes about 45 days to clean out my system for urine tests for chronic users, so I bought some masking supplements just to be safe. 51 days after I smoked my last bowl, I went for a urine test for a job I was offered. I used the supplement (B vitamins and creatine) and passed and got the job. Three days later I gave in to temptation and bought an eighth of an ounce and smoked it over the next 7 days. \r\nOne week later I got another offer for a better job and was scheduled to take another drug test. So I drank my other bottle of masking supplement and reported to the lab. I was shocked and certain that I was screwed when they told me it was a hair test. After I got home I searched the internet and found this site and also the company that analyzes the hair and concluded that I had no chance of passing. It was 66 days since I quit and I had just smoked for 7 of the last 13 days before the test. And I hadn't had my hair cut in about 4 months. They claim their test detects use from the last 3 months, and that ingested drugs will show up in hair after 5-7 days, and that once it's in the hair it stays there. Well I am happy to say that I did pass and I love my new job. I know my situation is unique and I was lucky, but I beleive it shows how the testing companies exaggerate their accuracy claims, and falsely stereotype drug users.\n\n\n"
}