{
 "title": "Huffing to Future Problems",
 "author": "Jesus Christ?",
 "citation": "   Jesus Christ?. \"Huffing to Future Problems: experience with Inhalants - Gas (ID 51206)\". Erowid.org. Jun 2, 2007. erowid.org/exp/51206",
 "substance": "Inhalants - Gas",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "1998",
   "ID: 51206",
   "Male",
   " ",
   "Not Given",
   "Jun 2, 2007",
   "Views: 7168",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] </p><p>In 1998 I stumbled on inhalants as I loved the smell of gas, which eventually lead me to my problems that I have now.  I only huffed for about 1 year on and off experiencing the most bizarre hillucinations.  Now, almost 10 years later, related or not Im not sure but the doctors/ psychiatrists cant say what going through now is related to huffing or not but I have Type 1 Bi Polar disorder and possibly brain damage.</p><p>I couldnt continue school as I was in a state of euphoria for so long thinking I was the second comming of Christ.  If you take anything out of this I'd say that you really dont know what your getting into, this shi* can kill you not to mention the brain damage and possible long term effects that solvents can lead to.  I remember when I thought, this stuff wont hurt me, perhaps Im paying for it now with the 'chemical' imbalance I have to struggle with daily as well as memory problems, decision making, at the time I was never informed that this is illegal at the age of 13.  You may regret doing this drug.</p>"
}
