{
 "title": "Complete Failure",
 "author": "Ravunker",
 "citation": "   Ravunker. \"Complete Failure: experience with Eszopiclone (Lunesta) (ID 51252)\". Erowid.org. May 26, 2006. erowid.org/exp/51252",
 "substance": "Eszopiclone (Lunesta)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "6.0 mg",
   "oral",
   "Pharms - Eszopiclone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 51252",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 26, 2006",
   "Views: 24819",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ever since I could remember, I had a liking for sleeping medication. From over the counter sleeping aids to seditives like Ambien. So when I saw the commercials on TV about Lunesta, I got interested in what it had to offer.</p><p>I was over at a friends house who lived with her parents. She told me her mom was a nurse and had all sorts of goodies in her bedroom. As we glanced around the room, I layed my eyes on a box of Lunesta samples. I instantly ran over and grabbed as many packets as I could and ran to the nearest computer. I researched the proper dose to take, and instantly popped it. </p><p>I truely regret even messing with this substance. The high was really mild, gave me a brain dead feeling, equal to a low xanax dose. Yeah the sleep was refreshing, but I could do the same with some Tylenol PM. What makes me really ticked off about it wasn't the barely notacable effects, but the side effect that no one really knows about it.</p><p>ITS THAT AWFUL TASTE! The next three days I had this metallic taste in my saliva that ruined anything that I ate. Soda tasted like liquified aluminum, and a cheeseburger was more like a chromeburger. The website online subtly states that there is an unpleasant taste as a side effect. </p><p>I imagine if I took twice as much  so I could get a solid high, my mouth would be flowing with steel and alloy for a week!</p>"
}
