{
 "title": "2nd experiment with Smoked BZP Freebase",
 "author": "Itsuoda",
 "citation": "   Itsuoda. \"2nd experiment with Smoked BZP Freebase: experience with BZP & GHB (ID 5126)\". Erowid.org. Feb 27, 2001. erowid.org/exp/5126",
 "substance": "BZP & GHB",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Piperazines - BZP",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5126",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 27, 2001",
   "Views: 22994",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n11 pm: In a second attempt at smoking BZP freebase, I inhaled about 4 hits of the vile chemical tasting smoke. Effects came on very subtly, and I ended up in a very speeded up, euphoric, and sociable mood within half an hour. I wanted to feel more of it, and one thing leading to another, I ended up smoking the substance compulsively, every half hour or so, till about 4am.<br>By the time I decided to call it a night, my pupils were very dilated, and there was no way to find sleep. I was having a seemingly great time while on it, but was craving the company of other people. I was also extremely horny, but orgasm was impossible to reach.<br>The comedown was awful. The effects lasted about another 6 hours after my last hit. When I finally came down enough to sleep, I was able to somewhat objectively look at my actions. What I saw horrified me. I am not a compulsive person, consume substances only episodically, and eschew any kind regular usage. The way in which I systematically toked on the pipe to get back to that stupid buzz horrified me, and reminded me way too much of people I have seen abuse cocaine or meth (neither of which I have done, so I can't compare). I also noticed, that while I was on it, the effects seemed marvelous, but once I was down, the whole experience felt utterly empty and pointless. No insight (nothing like MDMA), no expansion of consciousness, just a ridiculous release of ego-aggrandizing flights of fancy. <br>The scariest aspect of the trip, however, occurred after a few hours of sleeping. I had previously decided to take some GHB at the trail end of the BZP trip, to get beyond the residual speedy feeling and find some sleep. I did sleep, and was woken up a few hours later by the phone. While I felt just a little groggy making my way to the phone, I was horrified to find myself utterly unable to carry on a normal conversation. Nothing made sense. My brain felt completely scrambled. I became convinced that I had damaged my brain. The confused state lasted for about an hour. The sheer terror of it seemed to engage a strong will to pull out of it, and I watched, with relief, my rational faculties slowly return to the surface, as if retrieving pieces of a lost sunken treasure. Was this scary episode due to BZP, or to the addition of GHB? I don't know, but it certainly doensn't resemble any GHB intoxication that I have ever experienced: I was completely awake, not groggy, witnessing my utter inability to understand anything. <br>The day after I had a mild headache, and continued to feel slightly speedy. It was only the second day that I returned to normal, albeit  abnormally anxious (and this took yet another day to go away). I have  not had further residual after effects.<br>While I will never repeat this experiment, and have gotten rid of the BZP, I am nonetheless thankful for what happened: I feel it has given me a first hand peek into the compulsive hell of highly stimulating, non-entheogenic substances. I would advise anyone to stay away from this one. I cannot think of any use that would justify it's addictive potential, and I shutter to think of how this one would wreck havoc on someone with a taste for amphetamines or cocaine.\n\n\n"
}
