{
 "title": "Perfect",
 "author": "Temp",
 "citation": "   Temp. \"Perfect: experience with Mushrooms - P. cubensis & MDMA (Ecstasy) (ID 51277)\". Erowid.org. Jun 23, 2008. erowid.org/exp/51277",
 "substance": "Mushrooms - P. cubensis & MDMA (Ecstasy)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:50",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:20",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "51277",
   "Male",
   " ",
   "Not Given",
   "Jun 23, 2008",
   "Views: 5267",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have found perfection,</p><p>its like a raindrop,</p><p>perfect.</p><p>There is nothing else.</p><p>I'm decently acquainted with hallucinogenics, having done mushrooms and acid many times, and I am even better acquainted with Ecstasy. I started out taking one blue RB at 8:50pm at night, followed by an 8th of shrooms at 9 20. I should add that I smoked 4 grams of Blueberry between two other friends at about 7, finishing at 8 10. The dosage might seem low, but I would judge my trip to have been at least a 8/10 in terms of intensity. </p><p>I started out lying in bed, and staring at my roof, which happens to be textured with many uneven bumps. Every time I've taken mushrooms, the first thing I notice is my roof's texture linking up, melting, swaying and oozing. Around 9 30, I started feeling a slight head weight. Since I was waiting for my family to go to bed before attempting to have a cig in the balcony, I decided to lie down to avoid the body cramps and pains that accompanies each shroom trip as I seem to contract my muscles much too tightly. The next 30 minutes slipped by in a strange way, and in this period I made the transition from headrush to full blown mushroom trip. It hit me somewhere in the last 3 minutes, and by far it has been the most noticeable and sudden change of perception that I have ever had, even more so than salvia. </p><p>I stood up, or rather kind of jumped out of bed, stretched my muscles, and looking at my hands and flexing them, I felt an insane amount of energy and some strange strength and confidence about myself. For the sake of a good report, I'll admit I spent quite some time pretending to be a gorilla, among other things. The most remarkable thing about this shroom trip however, was that it was SO different from the last 3 I have in memory, that I was just kind of shocked. In terms of mindset, shrooms has never been an intense pleasure drug for me. When I decide to do shrooms, I really have no clue why I do so, except for the fact that I just enjoy the change from reality. But from the first time I've done them, my trips have always been mixed. Don't get me wrong, each shroom trip is great, but it's never perfect. For all the beautiful thoughts, visuals, spirituality and energy that shrooms bestow, they also cause discomfort in posture, clenching of muscles, apparently numbing coldness, and slight nausea, indigestion, and of course, the two defining features of shrooms, at least for me: </p><p>1.Inability to carry out simple tasks to meet needs, such as water, cigarettes, switching on the comp, or even just going to the bathroom. </p><p>2. Thought patterns; Intense thoughts, sometimes peaceful, sometimes scary. A mushroom trip has always felt like a ride on a roller coaster in terms of how my thoughts work, I guide it along subjects I like, and very often, brace myself if I think about the wrong thing, such as: family, responsibilities etc. </p><p>This trip had the same thought patterns initially, and I was still unable to do simple things quickly, yet I accomplished them much faster than I previously remember. I talked to a couple of friends online, during which I once again came into conflict with the other personalities that seem to come out with acid and mushrooms. I shouldn't call them personalities rather, I should just call it my several conflicting ideas, behaviors, and self perception. I wandered around my house in this state, watched TV for a bit then went to the bathroom to judge the visuals.</p><p>It was about 11 30 by this time, the shrooms had hit full effect, and the mirror was full of bright colors and rapidly changing contours and contrasts. I could not feel the Ecstasy one bit in this time by the way, but I suppose some of the energy could be attributed to that, along with the superbly positive mood that I have never experienced before so completely off just mushrooms. As I was standing in the bathroom, I got nervous about anyone in my family waking up and me having to talk to them in my present state, so I turned off one of our two bathroom lights, the one that regulates the heater and in effect, the only source of sound in the room. Now the lights were a little dimmer, more reddish. And, the room was dead silent. I believe this was the necessary catalyst for what happened next. </p><p>I leaned against my bathroom counter, and closed my eyes, and instantly I seemed to be drawn out into this huge bubble of comforting lavender, dark blue, green, and deep orange within my head, it felt like being suspended in the middle of some huge swirling ball of gas, and the only way I can explain this part is by saying my mind was sort of gently dispersed, mixing, swirling. I live in an apartment, and the time being around 11 40 by now, I fell into something that very very closely resembled my attempts at meditation, except with a HUGE feeling of tranquility, perfect control of thoughts, and perfect control of motor functions. I could hear people around us about 3 minutes after this, I came to the realization: I had achieved something I never in my life imagined existed: Peace. Complete, perfect, beautiful peace. I had no needs, no wants. my physical body seemed totally abandoned, except when I consciously exerted control to open my mouth so I didn't severely damage my jaws. </p><p>This stage of my trip is what made me decide to write this. The feeling is unlike anything else I've felt. It's not E, it's not mushrooms. I logged online, and typed in one simple line to two of my friends: I found Perfection. The strangest thing was: I didn't want to explain more, I didn't want to tell them how much I love this and babble on for hours like mushrooms or ecstasy made me do. All I wanted to do, was just sit, close my eyes and love what I can only call the greatest trip of my life. So the 2 hours that followed, I sat there in my chair, eyes closed, turned on some Pink Floyd: Comfortably Numb, Dark Side of the Moon, and Metallica-Orion. It was just beautiful. I had an intense control over my thoughts, and I somehow got the idea that life is perfect, and that I could do anything at all that I wanted.</p><p>After 2 hours, I started to notice little thoughts occasionally bumping into my little silence, then gradually more and more until I fell asleep although it didn't completely wear off until the next morning. There was a slight twinge of E crash, but that was easily fixed with a blunt, which also added onto the nice afterglow of bright colors mushrooms sometimes leave behind the following day. I have taken both the same mushrooms and the same E pill separately too, but never felt anything similar.</p>"
}
