{
 "title": "Nature's Beauty and the City's Confusion",
 "author": "Juicy",
 "citation": "Citation:   Juicy. \"Nature's Beauty and the City's Confusion: experience with Mushrooms (ID 51329)\". Erowid.org. Jul 10, 2007. erowid.org/exp/51329",
 "substance": "Mushrooms",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 51329",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 10, 2007",
   "Views: 3093",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo, my friend had tried mushrooms, he really liked them plus we had talked on the subject of them a lot, so we decided to do them together. He had bought an ounce and we planned a time to do them. I had only done pot and zopiclone, which were mild, so I had never been completely fucked before. My trip went good, then bad then good again.\r\n1st Good part:\r\nMe and my friend each had a baggie full of mushrooms, weighing one eighth on an ounce. We just walked down the street and ate them like how you would eat a bag of chips, but we didnt finish them all. We eventually did, but not right away. We decided to walk past the beach and up to the park where at first, all the trees started to look slightly cartoony, like something you would see in a comic book. I was surprised because it had only been about 20-25 minutes and I was already beginning to feel a little strange. \r\nWe got to a part in the park where there was just hills of mossy rocks and a couple of trees, we bent down and pulled the moss out of the ground, which at the time was very strange and funny. We just laughed and went on about how weird it was, then my friend insisted we walk through a little path between the trees and bushes, which made me think about leprechauns that my other friend had been talking about earlier, and it kind of scared me, even though I knew that they didnt exist.\r\nSo, we finally exited the park, where my friend picked me and began to run, and I was just laughing and feeling extremely euphoric. I saw a fence that looked like knives sticking out of the ground, so as my friend put me back on the ground I said 'Hey what are those things....oh...thats the fence' and my friend said 'Thats the fence' and we just looked at each other and laughed, it was just so funny. I looked over at the statue that was in front of the park and saw its arm move 'Look!!!' I said, pointing at it, then I just realized it was a white bird flying off the end of the statues arm which was really cool because it actually happened right in front of my eyes. But it had only been an hour, my trip hadnt even began yet. \r\nI remember once we got to the beach there was a round pool surrounded by land that wasnt completely connected allowing water to come in and go out. When I looked at the pool, there were big white swirls and it was beautiful and I remember saying 'Do it again!!!' as my friend said 'Look at that!' and pointed at the land around the pool. I looked and saw that it was all bright orange and it was so amazing. Then before I knew it, my friend shouted 'Seagulls!!!!' and began to chase the seagulls. I looked over and saw a small silhouette of my friend chasing the seagulls around a huge round meadow and I was laughing so hard that I couldnt even close my mouth or barely stand up for that matter. I kept trying to explain how I felt and how it seemed like I was dreaming but it was too awesome to put into words.\r\nAfter that, me friend and I just went to a field overlooking the beach and sat down at the edge, watching the shadows of the long tall trees move and wave all over the grass. I recall hearing little echoey noises that sounded like something I would hear in a fantasy forest or under the water, kind of like sad dolphin calls. It was mind blowing, because it was so beautiful and it made me really realize how much I loved nature. \r\n1st Bad part:\r\nAfter that is when my trip began to get bad. We walked from the field to a little place on the dark side of the beach where no one went. There was a little ledge that was about 2 or 3 feet off the ground, and we just sat there and looked at a tall tree that bled red and purple into the sky, but I started to get scared because about half a block down the street opposite of the beach I kept seeing people come out of no where and start walking the opposite way, which made me panic because they were coming from no where and I had already been deathly afraid of people because of paranoia. Maybe they were walking out from another street, but at the time that didnt cross my mind. \r\nSo I started to freak out and panic and I went in circles by saying 'Hey werent we just here? Hey what! Where are those people coming from, whats that! Oh my god look! Hey werent we just here like 2 times ago! The whole time I was pulling moss out from the ledge and putting it all over my knee, then I did that about 7 times until I saw some guys from our school and they were walking our way, I immediately got scared and tried to be quiet, so I just sat there and stared at them (accidentally of course) and they gave me the strangest look, especially since the mushrooms were morphing and distorting their faces, the started mumbling something that I couldnt understand, then they went down to where the beach was and just skipped rocks for a while.\r\nAfter that, we walked down the street heading towards the marina and I was terrified because there were so many joggers and people around and every time I saw one I tried to convince my friend to turn around and try to get away from the person, but he didnt let me. I remember at one point I just sat on another little stone ledge and me and my friend tried to figure out what to do. At that point I looked down at my dirty mossy knee and said 'Heeey how did that get there!?!' Somehow we convinced ourselves that we needed to go somewhere and we couldnt just stay in one place.\r\nSo we tried to decide what to do, and I said 'Why dont we just go to my place' so we began to head to my place and discussed it on the way, but kept getting sidetracked by the streets and how they were mixed together with the next one, but by the time we aimlessly wandered to my street corner near my house, I saw that my car was in the driveway and I told my friend that we had to go to his house because we couldnt go to mine or else my parents would know, but then I looked back and my car was gone, but then there again and I didnt know whether it was there or not. \r\nSo we stood there and just irrationally rambled on about whether we should go to his house or mine or just split up and go to out own home and sleep. I had another panic attack where I just kept going in circles and turning around constantly and just swearing and freaking out. My pockets kept melting when I put my hands in them so I would take them out and then put them back in and it just went on like that. But we reached a conclusion that we would go to his house and just watch TV. So we started heading there, which made me feel a but better because I wasnt so confused.\r\nI remember on the way there, I would look at the cars across the street and there would be a person getting out of a green, regular car, but then all the sudden it would turn into a tinted hot pink SUV right in front of my eyes and it was amazing. But I was still feeling quite uneasy on the way to his house.\r\n2nd Good part:\r\nWe were walking to my friends, and I remember him saying 'Look out!' and I looked over to see a small furry brown thing (it turned out to be a dog) jump up on my leg 'Ahh!!' I yelled, and I looked across the street and saw the old people laugh because they thought it was cute that the dog scared me so much, so I started laughing, then my friend started laughing, and soon I was sitting on the ground holding the dog and crying with laughter. From then on my trip was amazing, I was happy and my and friend were just talking about how it was all good and it was fun and how we were feeling super happy. It was great, I loved it.\r\nSo we got to his house, and his sister and mom were watching TV, I remember his sisters face having a big huge moving bulge on the side of it and her voice echoed. Then we went to his room and his cat was on the bed and I just petted it. Then I got up and went next door to the bathroom where I looked in the mirror and just smiled feeling really pretty. I felt as though I was looking at another person who was me if that makes sense. Then I went back in my friends room and he was laying on the bed and I just sat down and petting the cat, which by the way was really cool looking and soft, and my friend said he felt really sick so I just said 'Ok, should I go then?' and he said ya I just want to sleep but Ill call you later and I said ok, and I tried to look really happy about it and stuff but I really wasnt.\r\n2nd Bad part:\r\nAs soon as I left my friends house, I felt calm, but a little scared, and I little upset that he felt sick and wanted me to leave, I almost instantly felt my trip start to drop into a bad one once again. I had no idea where to go so I just walked up the street and as I looked back I realized it looked nothing like it did a second ago. I found myself totally lost, I had no sense of direction and I didnt know how to get home so I just found a bench, sat down on it and huddled up in my coat, because the cold made me incredibly, intensely uncomfortable and to make it worse I was wearing shorts, and to top it off, it was dark out because it gets dark early in the winter. So I just sat on the bench and thought, and tried to make myself feel better. \r\nEventually I decided to get up and start trying to get home. I saw some people and was going to ask for direction, but I was too scared to, so I walked where my instinct told me to and I found the street I was looking for, the one that led to the village. Once I passed the village I would find my house a few blocks away. The street never seemed to end though, it would just stretch on and on. When I finally reached the end of the street there was another bench. I decided I was too high to go home and it was better to get in trouble for coming home late rather then coming home high. So I once again sat on the bench and huddled up into my coat.\r\nI just stared at the moving roads and listened to the noises and echoes, and I could hear people a block down talking and laughing and I wished I could be happy and secure as them. Then I began to feel alone, like my friends and family just werent there and I was alone. It was the most awful feeling Id ever felt before. Suddenly everything just stopped, I remember it had done that a few hours earlier too, it just stops moving. For a few minutes I waited for it to get crazy again then decided I could handle going home and it would be a little more worn off when I got home, so I headed home.\r\nWhen I got home, no one was there, so I just went to my room and sat on the heat vent with an Archie comic which I couldnt focus on, in actuality I couldnt focus on anything at all. I put on some Primus, and just watched my shoe slowly pulsate, it looked like a snail that wasnt moving. Then I heard my dad come upstairs and he just called out to ask if I was home and I just replied yes, so it was fine. I stayed in my room. I didnt feel very happy though the music was making me feel better, and later I made tea and talked to my other friend on the phone. I didnt feel like myself though, I felt like I had lost my personality and my aura, it came back later though. \r\nI think I did some stuff wrong, like not letting my parents know where I was, I also should have had shroom tea because the next day I felt a bit nauseous. I also dont think it was a good idea to be in the town and village where there were people and cars, plus, I should have read up on the before I did them, but otherwise, it was the greatest experience of my life and it really inspired my art and opened my mind to nature, love, peace and happiness. Ive just learned to like everyone and be a better person, because it made me feel like a better person. So, even though half of it was bad, we learn from our mistakes I guess. Thanks for reading.\n\n\n"
}