{
 "title": "Marry and Harry in the Sky with Diamonds",
 "author": "Mary Jane",
 "citation": "   Mary Jane. \"Marry and Harry in the Sky with Diamonds: experience with LSD (ID 51355)\". Erowid.org. Jun 23, 2008. erowid.org/exp/51355",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 51355",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 23, 2008",
   "Views: 3684",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy boyfriend and I, Harry and Marry I'll call us, finally got ahold of some LSD. Anticipation was high, like a drug in itself. He was 18, and I 19. I got home to his apartment with it late, and with different news than Harry had expected. Instead of handing my friend 80 dollars, giving us 5 hits each. I'd given her a hundred and twenty, and she'd returned with fourteen hits.<br>'I'm only taking two' Harry says.<br>'I'm taking four.' I say.<br>And so, we dose. We tear apart the little squares of paper, printed with a funky little design. We were instructed to keep the paper under our tongues as long as possible, and so we do. The stuff is tasteless, except for a very, very strong chemical sensation in my mouth. My stomach was not happy with me, so I chewed an antacid and it settled. Doses taken, we wait. Eventually, he says the stuff is bunk and goes to bed, leaving me to watch Napoleon Dynamite and wait by myself.  After about twenty minutes I decided I hate Napoleon dynamite, turned it off, and went to the bathroom. There, I began to notice effects similar to ecstasy.  A bit of a body high, and halos around candle flames and lights. <br>I yell to Harry 'Baby you have no idea what's going on.'<br>He wakes up, says he feels nothing, and gets up. I see his eyes widen a bit and he grins 'Oh yea, I feel it... '<br>a pause between us. Mischief.<br>'Let's take the rest.'<br>I eat three more, and then pick up Harry's five with my finger, my last memories of the blotter being their entrance into my lover's laughing mouth.  He fubs around on his guitar a bit more, and then we sit on opposite couches, turn on the black lights, and music. I experience a slight revolving sensation and close my eyes. When I open them again, small bolts of lighting are shooting out from the light on the ceiling. I can hear Harry laughing. <br>'Are you hallucinating?'<br>'haaaaahahahahaha!!!'<br>The lightning bolts stretch to the edge of the ceiling, where they turn into a canopy of green vines which sweep down the wall. After following the vines to the bottom of the wall, I look up, and the room is shifting. Repeated images of my paintings on the wall. Repeating downwards, then sliding up to original position and doing the same shift-slide thing again. It is rapidly becoming too intense and I do not remember who suggested we move to the next room, but my next memory is of our bedroom, in complete stillness but buzzing with energy as I viewed it from the door. As I walk to the window, I can see the outside stairs and overhang carved in wood. LOTR's style. Elven. Like our palace carved in mahogany. <br>My next memories are in bed, I lying on my back, looking up with closed eyes, talking, though seeing the entire room and Harry's face as he stood above me. I talk about mysterious things. Inner wishes and identities I had no idea existed. I was no longer myself. In one I was a long haired, slightly heavy, peasantish woman with a babe in a sling, working with heavy pieces of meat. In another thought I saw a stretch of several tapestries, floating in a purple energy field, which I realized will be my gifts to the women and their men I love later in life.<br>Harry is hearing all of these thoughts, and responding. The trip is mostly in my mind, but our minds are one. He is tripping in me, I guess, though now he says that he cannot remember anything that occurred. I remember, though. I remember the sound of bells and the ghostly image of antlers over his head. The cracking of a nut and the sound of water. I had many thoughts of chestnuts, and liquid pouring from them. Chestnuts preserved in glass and other thoughts I cannot remember any more. I also had the strong image of a saddle in black velvet. More water, more chestnuts, more antlers and bells.  One of the last images I had was of vast, grey wings laying beneath my on the bed. I have wings tattooed on my shoulder.<br>And, as couples do, we loved, and at the beginning, I was sent to a black, astral plane. full of stars. I only experienced this place briefly before I heard Harry say <br>'Do you want me to stop?'<br>We were locked together in a hurricane of sensation and my visuals were of a hurricane, I think. A wall of grey wind circling and storming until it's vertigo sucked it into itself, at the point of climax and peak of the trip. After, no memory, until we are lying on the bed and Harry is calling someone. Later, we go driving. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] My little Ford Ranger hums and transports our energy through town to coffee, the green and yellow landscape swirling, up and down ways. The coffee he buys me is not chestnut, but I am drinking hot, sweet chestnut milk. <br>The rest is come down, and unpleasant, so I will spare details, but it was worth it. The best 15 hours of my life so far. This was several months ago. Perhaps next weekend will merit another description.\n\n\n"
}
