{
 "title": "Handmade According to Family-Owned Recipe",
 "author": "Absinthist",
 "citation": "   Absinthist. \"Handmade According to Family-Owned Recipe: experience with Absinthe (ID 51360)\". Erowid.org. Feb 4, 2011. erowid.org/exp/51360",
 "substance": "Absinthe",
 "bodyweight": "76 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Absinthe",
   "(roots)"
  ]
 ],
 "footer": [
  [
   "2003",
   "51360",
   "Male",
   " ",
   "Not Given",
   "Feb 4, 2011",
   "Views: 4566",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My grandfather has been producing absinthe for many years since wormwood grew all over his place and other herbs, such as thujone yielding tansy and juniper berries were widely available since then, whereas now tansy is for example not admitted for trading and can be harvested only in private.</p><p>The amount of thujone present in that absinthe 75 abv was received through skillful maceration, rectification, filtration and destillation and was between 40 and 60mg/l. Because I still carry on producing it, the recipe has never been changed if for additional star anise that had not been originally and at first used. Each glass consumed the traditional French absinthe way measured approx. 20-30ml of absinthe diluted with at least 7 parts of water, there, however I have to mention that the last three glasses contained just 2 parts of water.</p><p>Its taste is incomparable and absinthe is not another potent liquor but involves certain magic. Therefore I will describe each of the glass influence. The first three are usually very refreshing and the feeling is just almost as after any aniseed drink, however thujone which takes over the mind very slowly enhances the fact of being drunk without being drunk, many people call this clear drunkeness, yet I prefer calling it opening of the wormwood gates where stream of consciousness develops just as louche increases. After another 3 glasses I started to realize that if it was any hard liqour I would definitely get a mild buzz which after the real absinthe never appears. To some extent I started to be excited more and more and the fifth glass produced the state of being absolutely safe and what is more in that state I always start writing poems which describe my feeling and pay tribute to what absinthe really is. Within the next few hours as the whole drinking lasted the whole night I noticed that a lot of interesting ideas are approaching my mind and they did make sense, I have noted everything sipping another glass which contained one sugar cube and very little water, hence I did not pay any attention to the taste though I remember it was not so perceptible at the very moment. </p><p>Accompanied by few last glasses I have started translating from English into a Polish PowerPoint presentation designed to be released as a book and not only it went very quickly but absinthe diminished exhaustion and I had no need to look at what I am writing as in the end everything got translated perfectly, by the way the book was published within few months. When I have finished I went to bed and had very colourful dreams as if in Technicolor with strange creatures just as those reported by LSD users though I was not afraid of them. I have experienced very mild auditory /voices hallucinations and at some moment thought my heart was not beating. The next day I woke up very early completely sober and without hangover for which I think absinthe is again the best remedy and satisfied. During the night I had also dreams with Lautrec and others and till morning the beautifully bitter aftertaste remained in my mouth. Nowadays I do not drink so much, usually 1 to 2 glasses, but I use absinthe for sore throat and anything that improves my health bearing still in mind that absinthe is actually a poison but if used wisely and by wise people can only bring benefits.</p>"
}
