{
 "title": "White Beach",
 "author": "College",
 "citation": "   College. \"White Beach: experience with Oxycodone & Cocaine (ID 51373)\". Erowid.org. Sep 6, 2007. erowid.org/exp/51373",
 "substance": "Oxycodone & Cocaine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   " ",
   "0.5 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51373",
   "Female",
   " ",
   "Not Given",
   "Sep 6, 2007",
   "Views: 9722",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have done both oxycotin and cocaine seperately several times before. Generally I do about 20-60 milligrams of oc or between .3 and 1 gram of cocaine. On this one fine february night I was feeling very ambitious and I came to the startling revelation that I have never mixed the two drugs. Well who hasn't really.</p><p>So I started with oc because it is the more long lasting of the two. I broke out two large lines and proceed to blow one and then 5 minutes later the other. Naturally after I blow some oc I start to feel the effects within minutes.  The high is very euphoric and puts me in my 'happy place'. After a little bit I decided to get down to some lines of coke and continued to about 6 or 7 lines over the next hour. The coke got me up like coke normally does, but without the negative down. And, actually I never experienced the cocaine down all night. </p><p>The outcome of the combination was a harmony of epic proportions. I was able to get coked up and then when the coke high went away I reverted to my oc high. Since the oc high last far longer, when the coke was gone I didn't have the normal down side where all I think about is more coke because I felt awesome. It was a good time, however the two drugs are very powerful and it could have easily been a horror story. Personally I was a dumb ass for trying it, but it worked out.</p><p>Side note: I did experience a mild, cold-like feeling, with mild fever the day after. just a little fyi.</p>"
}
