{
 "title": "The Needle and the Damage Done",
 "author": "The Wombat",
 "citation": "   The Wombat. \"The Needle and the Damage Done: experience with Methamphetamine (ID 51377)\". Erowid.org. Sep 1, 2006. erowid.org/exp/51377",
 "substance": "Methamphetamine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "IV",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51377",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 1, 2006",
   "Views: 7109",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So, the first time I ever stuck a needle in my arm I was 16.  I missed the shot, and it left me with a obvious bruise, partially cuz the needle was not big but bigger then necessary.  So all that got me was a numb area of skin, and I didnt try again for probably a year.  And when my curiosity was at a high level because of stories Id heard about the rushs of unbelievable euphoria, no matter what drug.</p><p>So I asked a older man I knew, well call him Dude, for as much info as he could tell me on shooting dope, I knew he was a heroin addict for years.  He didnt tell me straight out everything because he knew the damage the needle does.  And this man Id known since I was born and we cared about each other.  But seeing as it was the hangout for all my friends to get drunk and smoke, drop acid, or whatever just no tweak, I was able to squeeze info out of him while he was drunk.  So, being afraid of doing something wrong, the first thing I shot was pure water.  Just to make sure I knew what I was doing.  Then I fired up some Adderal pills because I had no tweak.  And it, as I found out later, is nothing like dope when shooting it.  </p><p>So when I had a steady connection again, through a nearby house, I could get it almost anytime.  I fired it first with just a little bit.  And then increased gradually.  I used about .05 at first, just to, make sure nothing went wrong, I was very careful about everything back then.  I used alcohol swabs, fresh needles from my old girlfriend whos a diabetic, and had clean cotton from a sterile bag ready to use.  </p><p>Now, I cant dissolve enough to put in one 30 gauge 50 unit needle.  So usually I crush around .3-.4 grams in my spoon, a BIG one.  I usually dont use cotton anymore unless I can see a lot of cut in the bottom that I dont want in my arm, and put it in like 2 rigs on the desk, tie off really good and tight, and slam one and then the other, and release.  It usually takes 5 or more seconds to hit.  But I can always tell when by the 'smell/sensation/felling' in the back of your nose/throat.  </p><p>So Im 18, I've never gotten the same rush after like a month of slamming it, where I puke a couple times, sweat, and then just walk around profusely as my hands tremble and all I wanna do is listen to music and play it. Its taken damn near all of my money for the past year, and it continues to demand more and more out of me.  My judgment is stupid with the needle now.  Ill go through a gram in 10 hours if I have it, which when I get it, I get like a gram or a teener, and off a little of it.  I think the biggest risk of slamming dope is that I can do a lot way too easily, and do so much my whole body becomes highly toxic, dehydrated, and delusional... and still I crave it.  But Ive never to this day shared a needle with ANYONE, but I use each rig for about 30-40 uses.  </p><p>I know, Ive done way too much shit in my short life because I had it available and cheap through good connections and a successful harvest year after year.  I grew my first plant at 15 years old.  Flaw is my drug of choice is speed, and I was ignorant and curious about its power.</p>"
}
