{
 "title": "Three Voices",
 "author": "Brain_Child",
 "citation": "   Brain_Child. \"Three Voices: experience with Salvia Divinorum (10x extract) (ID 51398)\". Erowid.org. May 30, 2008. erowid.org/exp/51398",
 "substance": "Salvia Divinorum (10x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2.5 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "51398",
   "Male",
   " ",
   "Not Given",
   "May 30, 2008",
   "Views: 4713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>January 2, 2006</p><p>10:00 Pm roughly</p><p>Salvia Divinorum 10x Extract</p><p>Dark, stormy, alone, in my car</p><p>First Experience</p><p>I went and parked the car behind a friend's neighbor, down by the lake.  I filled my new bubbler up with water, and packed it FULL of salvia Divinorum 10x Extract.  I remembered 'D' telling me earlier in the day, smoke until I first feel it, then smoke that much more again and stop.  I got out of the car, and walked to the rear of it, approximately 8 foot behind the car.  I didn't know what the smell would be and needed some stealth.  I took one large hit, and immediately felt uncoordinated; my ears swirled and my legs faultered - it was like being VERY drunk.  I took another equal sized hit, forgetting to carb.  I carbed, and took another hit.  This time, I didn't hold the lighter ignited, I relied on the cherry, and again forgot to carb it.  This third hit was half as large as the other two even after carbing it.  I used my right pointer finger to push down and extinguish the cherry. This was both painful and awkward - there were 19 years of motor skills tossed out the window as it took my whole mind to accomplish this task.</p><p>The next thing I remember, I was halfway in my passenger seat, with the door shut, sitting angled to avoid sitting on everything - I had a water bottle, a 1 liter arizone tea, the baggy of salvia, and an ingles bag there.  I could hear voices at this point - the first and most predominant was a tender motherly voice, telling me to throw my keys in the floorboard so I couldn't try to drive, and then it told me to get the crap out of the chair so I could be comfortable.  'Don't worry, it will pass' she said.  Then, I heard a deep throaty man's voice, and saw in my mind the image of a strong steel worker, dirty with soot.  He told me to be strong, it was only a temporary psychological state and it would pass.  Then I could here a third voice, higher pitched and younger - it sounded giggly, and said things like 'Have fun' 'relax' and 'oh man'; this voice sounded exactly like the guy when he tripped in training day.  Then, a fourth voice; I think I was actually saying it, saying things like 'This is retarded' 'I'm dumb' 'This is crazy.'  I'm pretty sure the fourth voice was me trying to reason my way through the experience.  I consider it unimportant compared to the other three.</p><p>I managed to get out and move back around to the drivers side seat.  In the process, my MP3 player came off my belt - I had started with sigur ross or emery reel playing but quickly decided I didn't want it - and was bouncing around the inside of my jacket.  I got into my seat, and placed the arizona tea at my feet, tossed the waterbottle in the back and managed to turn off my mp3 player and remove my jacket.  It was about this time that I realized my overturned bubbler was in my passenger seat.  I turned on my map lights and grabbed it - I hopped up out of the car and poured out the water, and fished out the remaining salvia with my fore finger and tossed it away (I wish I had kept it, I only took 3 hits of a full .5 g bowl, wasted about 13$ of salvia right there).  I managed to place the bubbler and salvia into the pouch and put it all in the trunk in its hidden place.  I got back in the car and grabbed a towel out of my army sack with jumper cables and such.  I wiped up all the spilt water I could, and then tossed the rag in the floor.  At this point, I realized the car reaked of salvia so I found my keys (this took some effort.  The womans voice had wizely told me to toss my keys towards the gas and break pedals of my car so I wouldn't be tempted to try and go driving off or anything) and rolled down the windows.</p><p>I closed my eyes and relaxed - I don't remember any visuals, voices, or anything else - I want to say perhaps I heard my female voice tell me to close my eyes and slumber although I could be fabricating that - I'm not sure.  At any rate, I closed my eyes and opened them at 10:29 (I checked my phone) and could tell that my 'trip' was over.  I was still uncoordinated and confused, but I knew the most intense part was passed.  I decided to wait until midnight to return home, but within a minute or two I had simply decided to wait till 11 when I would be sober - at that point I would clean up and kill some time.</p><p>I wiped up more spilt water, rolled up the windows and stashed everything.  I laid back and closed my eyes again.  At 10:38 I opened my eyes and felt almost 100% sober.  I tossed the towel out the window (I rolled them down again, the smell was very strong) and lit the small 2' section of mountain pine incense I had brought to cover any 'accidental' smell (I had anticipated some smell on my clothes - not a bubbler spilt in my seat).  I called my buddy 'H' and explained that I needed to kill some time, and that I had had a bad trip.  I went over there till about 11:30 before coming home.</p><p>After chilling out for a little while, maybe half hour, I put on a new incense stick I got from the headshop earlier today, lit a candle and meditated. I started by focusing my breathing before I moved on.  I then formed my white ball of 'me' and drew it down into my chest and assured myself it was safe.  I then began thinking about my experience and found the following: There were 3 voices, a tender nurturer, a strong man, and a child (well, someone who enjoyed life and had a good time).  I realized the mother was the first to speak, the loudest, and the most talkative.  The man waited for me to be calmed and comforted by the mother before he spoke telling me to be strong, then he faded.  The child's voice was quietly in the background the entire time, and never grew very loud - I could only hear it between the man and woman.  I discovered that these must be the voices of my inner being.  My compassionate tender nuturer, my strength giving protector, and my inner child.  I discovered the nuturer was the most predominant, and I repressed the child. I decided I want to achieve a balance and unity of the three voices, and discover whether there are more voices to be heard.</p><p>Though this wasn't what would be called a classicly 'good' trip and would definitely be considered a 'bad' trip; I actually think I am glad I had this experience.  I enjoyed the meditation about it more than the actual experience though.  I plan on doing it again with the remaining salvia when I am in the proper setting - a home, with a sitter, and the correct ambience.</p>"
}
