{
 "title": "I Passed",
 "author": "Feesh",
 "citation": "   Feesh. \"I Passed: experience with Cannabis & Drug Testing (ID 51427)\". Erowid.org. May 6, 2008. erowid.org/exp/51427",
 "substance": "Cannabis & Drug Testing",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 72:00",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "51427",
   "Female",
   " ",
   "Not Given",
   "May 6, 2008",
   "5948",
   " "
  ]
 ],
 "report": "<p>Well, the story is basically this. I tried to get a job, was told in a letter I didn't have it and then about five days later got a phone call telling me I did in fact get the job. So, having thought that I didn't get it, I also thought that I did not have a drug test.</p><p>Saturday night I had about a half gram of weed. That next Tuesday I probably smoked a gram. Wednesday I found out I had a job and needed to get my piss test that next Monday, meaning six days later. Granted, before the first time I smoked I had been clean for about two months, but... still. Yeah.</p><p>I did a ton of googling and research and was horrified to find that six days was almost definitely not enough.  I read estimates anywhere from 3-30 days and with that being what it was, and myself not having a high metabolism at all, I figured I was fucked. But I didn't give up. I ran about an hour a day for the first four days and then the fifth day I started drinking TONS of water. Water doesn't really do anything but dilute, but I figured it couldn't hurt. </p><p>So, the night before my test, I took three vitamin pills to keep my piss yellow. I was told if it looked like I tried to flush, they could get suspicious. That next day, I peed twice before I went, drank maybe half a gallon of water and prayed for the best. When I took the test, I gave them midstream. </p><p>This was last Monday. Today, Friday, I found out everything went through and I was negative for having marijuana in my system. I got my job. I passed the piss test. </p><p>After googling this for like days, I figured I'd share my story, there really isn't much out there for responsible stoners to go off of. I hope this helps anyone out there who is ready to pull their hair out. I know I can't tell you exactly how anyone else's test will turn out, but I can say that I'm 5'4'' and weigh about 160. I've got like a 30% body fat thing going on. Six days was enough for me.</p>"
}
