{
 "title": "The Perfect Recreational Substance",
 "author": "I_luv_kava",
 "citation": "   I_luv_kava. \"The Perfect Recreational Substance: experience with Kava (ID 51446)\". Erowid.org. Jan 10, 2010. erowid.org/exp/51446",
 "substance": "Kava",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "3 Tbsp",
   "oral",
   "Kava",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51446",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 10, 2010",
   "Views: 15968",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>PREPARATION:  I have been a regular Kava drinker for approximately 3 years.  I consume approximately 3 tablespoons per day of high quality root. Early experimentation with capsules and extracts produced poor results.  Since that time, I have become very experienced in how to get the most of my kava.  First, I now only purchase freshly prepared root from Hawaiian or Vanuatuan sources.  Second, I prepare the drink by putting 3 tablespoons of chopped root into a blender with 1 cup of hot water.  I blend for a couple of minutes and then filter the resulting 'sludge' with a kitchen wire mesh filter.  I usually have to use a spoon to stir the mix in the filter or it will get clogged up.  I also press the mixture to extract every little bit of juice.  Then I repeat this process two more times with the remaining pulp/fiber.  By doing this, I successfully extract all the active constituents (kavalactones) from the root.  I then dispose of the remaining root pulp and save the juice.  Finally, I consume the kava juice ALWAYS on an empty stomach usually before dinner in the evening.  A full stomach seems to nullify the absorption of kavalactones.</p><p>EFFECTS:  The effects of a single 3 tbsp. prepared as kava juice is very pleasurable.  The juice is drunk in one chug.  It taste horrible, but I have developed an acquired taste for it after a while.  Kava allows me to retain cognitive function, but it lifts my mood, and provides me with a very pleasant feeling not unlike a cross of benzodiazepines/opiates.  However, I have never experienced any tolerance with daily usage for over 3 years.  And I have never experienced any type of withdrawal syndrome.  The only side effect I have noticed is a drying of the skin and the eyes.  I believe that this is the beginning of kava dermopathy.  This appears to be dose related and quickly goes away after 3 days of usage reduction or discontinuation.</p><p>In addition, I have used many different types of kava over the years.  There is great variation in strength and duration of effects depending on the type of kava used.  Excluding strength and duration, the effects themselves are fairly consistent across varieties.  With the exception of the awful taste, kava appears to be an almost perfect recreational substance.  As with any drug, I do not drive after drinking kava.  Consuming too much can result in complete loss of muscle control including my eyes.  This has happened to me on more than one occasion.  Finally, I should mention that my liver enzymes are tested every 3 months (because I take Lipitor) and have remained at safe levels.</p>"
}
