{
 "title": "Into the Beyond",
 "author": "Mike ' The B ' L",
 "citation": "   Mike ' The B ' L. \"Into the Beyond: experience with Mushrooms - P. Cubensis (ID 51447)\". Erowid.org. Jun 10, 2008. erowid.org/exp/51447",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51447",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 10, 2008",
   "Views: 3102",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt started out like any other Friday, woke up, did my usual morning routine, preparing for school. But that day afterschool I planned to try mushrooms for the first time. After school I went over to my friend 'D's' house. I called my friend 'J' over to 'D's' house because he was planning on shrooming with me that day. At about 3 O'clock 'J' came over. We sat in D's room talking about things we've read and other experiences we've read about Mushrooms.\r\nAt about 3:30 I decided to eat mine. My friend J was skepticle about the whole thing, but I was anxious and looking forward to the experience. I read online that you must have a good mind set when going into a Psychedelic trip.  When I finished eating my mushrooms I decided to eat 2 oranges because I heard that something in oranges makes the trip more intense. At about 3:40 Me, D, and J decided to walk to my friend L's house. My friend D didn't have any mushrooms so he poured 5 beers into a water cooler and we began walking. At about 3:45 my friend J decided to eat his 1/8 of mushrooms also.\r\nAt about 3:55 all three of us were walking along a bike path near some baseball fields when I started feeling drunk. My friend D was already drunk as fuck from drinking all the beer. My friend J said he was feeling nothing yet. We sat down on the bike path for a moment when I looked to my right at a row of trees in a tree farm. I noticed the tops of the trees seemed to be moving, wiggling almost very quickly. I wasn't sure if it was the wind making them do that so I pushed it out of my head. All three of us decided to continue walking to L's house because we were almost there.\r\nBy now it is about 4:20 and I am definitely noticing a change in my mind and body. My thoughts are confusing and very deep, and my body feels cold and still drunk. My friend J says he's starting to feel a bit tipsy. By now we are on my friends street, nearing his house, as Im walking I start noticing that everything around me looks 'weird'. Every little thing that moves gets my attention. When I notice that Im noticing every little thing I just burst out laughing and cannot stop. I try to think of things that would make me stop laughing but that just makes me laugh even harder. I close my eyes and put my hands over my mouth to keep me from laughing. It works, I stop laughing, and when I open my eyes, everything around me is moving and shifting, morphing almost. When this happens to me my friend J starts laughing. I know in my mind that I am a couple steps ahead of him in this mushroom trip. I know whatever I go through he will soon follow me.\r\nWe finally reach my friend L's house but I am reluctant to go inside. I feel like I want to keep walking, looking at everything. Me, D, J, And L go into his backyard and into his shed. It is a comfertable inviroment with couches and a chair. I take one of the cushions off the couch and sit on the floor against the wall of the shed. My friend J Sits on the couch. My friend L askes me if Im feeling anything yet. When I look at his face his features are bulging and breathing, his face is distorting, his eyes are bulging out and sucking back in. When I see this I just start laughing. My thoughts are so introcate and deep. At the exact same moment me and J look at each other and just start laughing. Its as if we're telepathicly communicating about everyone in the room through our eyes.\r\nI take a moment and look around at everything in the shed. Every single thing in the room is shapeshifting, moving, bulging. My friend L looks at me and says, 'Does this look sweet?' and takes his hands and wiggles his fingers, his fingers looked like they were a hummingbirds wings flapping at an incredible rate of speed so I say, 'Fuck yea that looks crazy.' Thats when my friend Dan does something with his hands and I notice his fingers look like they are a foot long each and he has about 10 fingers on each hand. Again at that same moment me and J look at each other cause we know we have just seen the exact same thing and start laughing again.\r\nMy friend L asks me what it's like, I say ' I can't even explain it dude, the only way I can only explain it using one word, beyond. I am beyond thought, beyond reality.' My friend L is scared when I say this because I don't usually talk like that. After that All 4 of us decide to go outside and sit on his halfpipe. It is about 5:30 and Im defenetly trippin balls. When I step outside the shed doors the first thing I look at is a tree. I feel like Ive known this tree my whole life, as a friend almost. It looks like its branches are comming within inches of my face and then sucking back into the sky.\r\nAfter that I start walking around the back yard looking at everything I can, and everything looks indescribable. When I try my best to explain what its like, it makes my friend L and my other friend D excited and curious to try mushrooms. My friend L is the one who got me the mushrooms so he calls the guy he got them from and gets 2/8 for himself and my friend D who is still drunk. The shrooms arrive for the two of them and they ask me if I think they should take them now. I look at the shrooms they have in the bag and they look like they are moving around in the bag, trying to escape, pressing on the bag and wiggling around inside. I say, 'Fuck yes, eat them right this second' because I wanted them so badly to experience what I was experiencing. They ate them and we went into L's house to watch a movie.\r\nI sat down on the bed and looked at the T.V screen, The T.V looked like it was 4 feet tall and 1 foot wide, and the faces on the screen were so distorted I couldn't even begin to describe what they looked like. By that time its about 6. I didn't even know what was on the T.V. screen, I didn't even care. I decided to go into the bathroom and look at myself in the mirror. When I got into the bathroom everything was moving, everything was shifting and morphing. I look into the mirror and I don't even reconize what is staring back at me. My head and face are so misshaped and distorded.\r\nI start making faces, My lips melt off my face and down to my chest. My eyes are the size of CDs, my eyebrows are 3 inches thick and moving and wiggling like catapillers crawling all over my distorted face. I bring my fingers to my face and touch my cheek. My cheek ripples like a stone being thrown into a pond and the ripples of flesh moved across my face. I step out of the bathroom with a big grin on my face and as soon as I look at john I don't even say a word and he gets up and goes into the bathroom to look at himself in the mirror. A few minutes later he steps out of the bathroom with a big grin on his face also. It is about 7 O'clock by now and my other two friends D and L are feeling the shrooms. It seems as if we know what everyone is feeling and seeing, it is as if all 4 of our minds are connected on such a deep meaningful level. We all look at each other and just stare for a moment, then at the same time we get up. When we all get up at the same time we realized what we have just done so we all start laughing. \r\nWe all go into the garage and I grab a pen and immidiatly start drawing on the wall. I draw such an introcate drawing, I feel like the pen is just moving on its own and lines are comming together forming such amazing things, I am being sucked into the picture. The picture I am drawing is over come with life, it is moving and swirling, drawing me deeper and deeper into the picture. My friend D, L and J come over to see what Im doing and stop and stare at my picture. Almost at the same time they say,'That is so fucking good.' All I can do is nod. My thoughts are so deep that I am past all my thoughts that come into my mind. It is so hard to explain to people who have never tried mushrooms.\r\nAnyway at about 8 I am comming down from my trip. All I am thinking about is how much of a lifechanging experience this has been. My friend D and L are still trippin hard, so they're just walking around looking at everything, talking about space and the earth and heaven and hell. Me and J are still in the garage knowing exactly how they're feeling and what they are seeing. I feel so connected to J on a different level than I ever have before. At about 9 my friend J and D go home and Me and L are sitting in his garage with his Step Dad talking about Life. At 10 I went home. I went home with the most amazing life changing experience I will ever have. And I know that D, L, and J also had that same life changing experience that I had, and will never forget it. All four of us feel we are now connected, closer somehow than ever before because of this experience. I feel that Mushrooms are Earth's way of letting Humans know about itself.\n\n\n"
}
