{
 "title": "The White Light",
 "author": "BruHaHaProphet",
 "citation": "   BruHaHaProphet. \"The White Light: experience with Morning Glory & Nitrous Oxide (ID 51441)\". Erowid.org. Jun 23, 2008. erowid.org/exp/51441",
 "substance": "Morning Glory & Nitrous Oxide",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 g",
   "oral",
   "Morning Glory",
   "(tea)",
   "  T+ 1:00",
   "3 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 3:20",
   "2 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51441",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 23, 2008",
   "Views: 8303",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've heard many reports (firsthand and online) indicating that LSA/Morning Glory seeds are a 'mild' psychedelic, not capable of bringing on the full breakthrough experience associated with psilocybin, LSD, DMT, and Mescaline. To those people I wholeheartedly say 'Your loss.'</p><p>Often underestimated, more often overlooked, LSA is a jewel among the entheogens.  Not only is it legal (well, sale/possession of seeds is legal, the legality of consuming is iffy), but it is indeed a powerful psychedelic. Granted, it is not as chemically active as LSD (not by a long shot), but do not mistake chemical activity for psychedelic potential.</p><p>The method I have found to be best for me is this: Make a mint tea - boil a few handfuls of mint sprigs in water for several minutes, let cool, strain. Cool the tea in refrigerator. Grind the seeds (in my last case 15 grams) and let the powder soak in the tea for 2-3 hours. Using a metal coffee filter, strain the mush from the liquid. Injest liquid. Wait 20 minutes (mileage my vary) for nausea to pass. Sucking on peppermints seems to help.</p><p>On 10-25-06 I prepared 15 grams according to this method, and experienced the psychedelic world as intensely as I have ever experienced it on p.cubensis, my former entheogen of choice. I had purchased a box of nitrous chargers specifically for this trip, thinking I would use a hit of nitrous oxide every now and then throughout the experience to 'take it up a notch', and send myself further into inner-space. On mushrooms, I can hit nitrous while peaking, and come back enough to myself to take another hit within 3-5 minutes, though I usually wait about 30-45 minutes in between hits. I also have big lungs so I will usually load 2 chargers at a time to inhale.</p><p>About an hour after drinking the tea, I took 3 chargers over the course of about 2.5 full breaths, and did not return from the White Light for about 2 hours. It was as if the visuals (which were very high up to this point) were drowned out by the pure radiance of Being. Complete dissolution of the ego, no sense of self, nothing but a feeling of perfect, harmonic, singularity of Being.</p><p>About 20 minutes after I finally came to, I took 2 more cartridges, with similar results. After the nitrous wore off, I sat/laid in blissful contemplation for another 3 hours or so, near which time I started coming down.</p><p>Even on high doses of cubensis (5.5g of homegrown) I've never been so tripped out to the point that I can't function in the 'real' world on any level. Usually it will take some effort and focus, but I can 'come back to reality' if need be. On 15g of morning glory seeds, plus a bit of nitrous, I was completely unaware of my surroundings and immersed completely in the psychedelic experience. Using the tea 'extraction' seemed to lower the body load immensely, the nausea was not as pronounced, nor as long in duration, and the leg cramps that I usually experience while on the seeds was almost completely absent, indistinguishable from the other muscle twitches.</p>"
}
