{
 "title": "So Close to God",
 "author": "Anca",
 "citation": "   Anca. \"So Close to God: experience with Mushrooms (Mexican) (ID 51585)\". Erowid.org. Jun 10, 2008. erowid.org/exp/51585",
 "substance": "Mushrooms (Mexican)",
 "bodyweight": "49 kg",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51585",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 10, 2008",
   "Views: 3962",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe trip I'm going to tell you about is from my first ever grown mushroom. I was with a friend at my place and decided to take 3.5 g of mexican shrooms in lemon juice. My mistake was to take mushrooms with this guy who never took before, and for a while he was very annoying because he wouldnt just shut up. That been said, let me tell me about my trip.<br>22:00: we take the shrooms drank with fresh lemon juice.<br>22:15: the first effects take place. Im feeling very light and happy.<br>22:30: the trip hits me soo hard that all the room is taking a roundish shape, and little fractals of colours with little letters in them start go go out from the next rooms door.<br>23:00: Im already far away and I just cant help myself looking at the ceiling, from which thousands of eyes come down and surround me. Millions of ideas come in my mind, I feel repulsion to all the fake thing we usually do like smiling when we dont feel to, hating other people, and in all the material needs. Its like the eyes are coming from God cause all I could see in them was purity, honesty and love.<br>00:00: My friend feels seek and has a slight of paranoia. I try to help him out, but he just keeps doing stupid thing like talking way too loud, turning on all the lights and stuff like that. Eventually I am able to calm him down, but he just keeps talking from time to time. For a while a find it difficult to go with the flow.<br>After a while, I start to experience ego loss. I try to fight it, but soon I just cant see no reason in doing it. Im sweating like crazy, so I decide to drink a lot of water and wash my face. Things were talking to me, and in a relatively short while I come to discover all new things about the human mind. Im just amazed by the intensity of the trip, I became one with everything, and everything was right there with me. Though, the definition of me seemed such a big bullshit. I was surrounded by stars, planets, and lots of Universes, seen if it seemed some sort of chaos, it all made sense and I was in peace.<br>03:30: I feel like Im born again, more complete and wise, but still with so much to learn. I start again to look at the ceiling, and the eyes were still there. The most understanding and loving eyes. And they were all over. I was extremely overwhelmed by them that I started to cry. It was just a thing that seemed so natural and helping. I think I cryed for almost an hour, crying and talking to the eyes. About everything that was on my mind, about everything that made me sad or happy. From time to time, for a short while, the eyes got a figure too. Then the faces vanished and they became the way they were before, only eyes. The most amazing eyes ever.<br>5:10: the effect almost vanished, but I just couldnt say a word. I felt like Ive been given something very valuable and I needed to be with it alone.<br>This trip was the most amazing and incredible of all. It was just one of those things that made my life more complete and me wiser.\n\n\n"
}
