{
 "title": "Nothing Effect, Tastes Like Shit",
 "author": "GreenScreen",
 "citation": "   GreenScreen. \"Nothing Effect, Tastes Like Shit: experience with Calea zacatechichi (ID 51597)\". Erowid.org. Mar 31, 2006. erowid.org/exp/51597",
 "substance": "Calea zacatechichi",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Calea zacatechichi",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51597",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 31, 2006",
   "Views: 11360",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last time I got some salvia the place was givin away a free ounce of calea, so I figured I'd get some and if it wasnt any good then who cares, I got it for free anyways.  </p><p>Even though it was free I now slightly regret getting it. At first I didnt know what it was so I looked around to figure some stuff out about it and mostly found the stuff about it making you have lucid dreams. So I took about 4g of my free ounce and decided to make some tea right before I went to bed. So I made it, at first it smelled like grass (not the good kind), which I didnt think was a very good sign to start off with, but I was soon to find out that compared to this shit grass tasted like filet fuckin mignon. While I was waiting for it to cool I took a tiny sip and couldnt believe how bitter it was. Only about a teaspoon of it got into my mouth and I couldnt get the taste out. I looked around for some honey to try and sweeten it up but I couldnt find any so I used the next best thing, maple syrup. I stirred in a couple teaspoons of it thinking it would taste fine once it had cooled, then waited a couple mintutes till it got to drinking temperature. I took a big sip of it and almost spit it out immediately, then I started pouring on the maple syrup. I would add some, take a little sip, add some more, then take another sip. This went on until about a third of what was in the cup was maple syrup, and I still couldnt bear the taste. </p><p>I can honestly say it was the worst tasting thing I've ever had in my life. Every sip I took it made me want to throw up and I had to work to keep it down. Imagine the worst tasting food you've ever had, multiply the bad taste by 100, and you're still nowhere near close to how bad it tasted. Oh I forgot to mention, after about the third sip I went to go get some mint gum to chew with it as I drank it, although it didnt help much. I wanted to see if it would actually have any effects so I was going to figure out some way to drink it. Now, with 5 pieces of mint gun in my mouth and a bottle of soda to gulp in between the tea, I was hardly a third of  the way through the cup. So I just decided to take big gulps now so I could get as much of it down as possible with the least amount of taste. I took one huge gulp and swallowed, I had to recover for a couple minutes trying to keep from throwing up, which was unfortunate because of the horrible horrible taste. After drinking about a liter of soda I went in for the second gulp. This one was even worse than the first one and I hardly held it down. Now there was about a third of the glass left. </p><p>I decided I just couldnt drink it. So I poured that god awful liquid down the drain and went and washed my mouth with listerine. I headed off to bed, I'm not really sure what I expected for the effects to be, but light herbs had never really had an effect on me so I wasnt sure if anything would happen. That night my dreams were pretty clear to me when I woke up, but it wasnt extaordinary. I dont even know if that was an effect of the calea or not, it may have just been one of those nights where I remembered my dreams, which thats not that uncommon. Overall I was disappointed with it. If I ever decide to try it again there is no way im drinking it, that shits goin straight into the pipe to smoke. Theres no way in hell I would ever drink that tea again.</p>"
}
