{
 "title": "The Unseen Reality",
 "author": "J",
 "citation": "   J. \"The Unseen Reality: experience with MDMA (Ecstasy) (ID 51660)\". Erowid.org. Sep 5, 2007. erowid.org/exp/51660",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1.33 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51660",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 5, 2007",
   "Views: 4238",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Looking back on my experience, I envy the time that I spent while on this drug.  It was the single most amazing experience of my entire life.  Nothing can even come close to what I experienced, nothing.  My soul was touched yesterday.</p><p>Lets just start from the beginning, when we took the pills at 10:32.  We chewed them up to get a quicker come up and then swallowed them.  We had previously decided to go to a nature park because we heard it was a good way to spend an ecstasy high.  Honestly, we didnt know what we were looking for going into this experience.  We drove to the nature park, a designated driver doing the driving.  We were blasting techno, searching for some sort of fun that somehow so we thought techno music would bring about.  Unfortunately the music was the wrong thing to be looking into.  </p><p>We arrived at our nature area and got out of the car.  It was a bit cold, but still a very nice sunny day.  The nature area was an amazing sight and it really set off the drug eventually.  When we first walked in we all thought this was a mistake, and we should have just stayed in the car blasting music.  But oh wow were we wrong.  As we went deeper into the nature area the trees grew taller and more vibrant.  I felt one with nature.  My friend and I dipped our hand into a stream, and the cold water sent a feeling throughout my entire body.  My friend E man and I sat down on a bench when the driver and my other friend B went back to the car to get some portable speakers.  </p><p>This moment was when I discovered something about this world that I dont think many others have ever experienced.  I experienced complete and total bliss.  We were listening to my ipod, it didnt matter what song was playing at all, because anything could pass as the best music in the world at that moment.  We could talk about any problems we had without even a second thought.  In the forest there were no feelings of regret or any existence of an ego.  There was only everyone together, just a total bonding experience.</p><p>We bonded for about 3 hours straight just sitting in the sun looking up at the trees.  Doesnt sound like much fun, but for those three hours, the mist over reality that shields all from seeing what is really there was for a second pulled away.  I could see what a person is truly like.  I realized what 100% of a person is made of instantly.  I could say exactly what I meant to say.  I would articulate my self perfectly.  We all bonded seeing 100% of each other.  In a normal day people only show 10% the rest of it is not really there, it is societies super imposed ideals that everyone follows.  This drug set my friends and I free from the chains society has us bound in, for three hours I could be free, and be 100% satisfied.  I know nothing could ever come close to this experience because nothing can top 100% satisfaction.</p>"
}
