{
 "title": "Depersonalization",
 "author": "Mystix",
 "citation": "   Mystix. \"Depersonalization: experience with Quetiapine (Seroquel) & Fluoxetine (Prozac) (ID 51666)\". Erowid.org. Mar 31, 2006. erowid.org/exp/51666",
 "substance": "Quetiapine (Seroquel) & Fluoxetine (Prozac)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)",
   " ",
   "25 mg",
   "oral",
   "Pharms - Quetiapine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51666",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 31, 2006",
   "Views: 22396",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Seroquel is an atypical anti-psychotic. I was prescribed Seroquel to control delusions, anxiety and depersonalisation, which is ironic as it is known to cause depersonalisation. I also take 40mg fluoxetine (Prozac) every day. I am currently on 150mg Seroquel and it is likely to be increased again but this report is based only on the experience I had when I took 25mg for the first time. It is a low dose but I experienced very intense side-effects. Some of the side-effects have since diminished but this I would not recommend.</p><p>I wrote this account the day after the first dose.</p><p>-----------</p><p>Effects of Seroquel experienced over 24 hours:</p><p>- Delusions</p><p>- Depersonalisation</p><p>- Confusion</p><p>- Agitation</p><p>- Apathy</p><p>- Nausea & stomach ache from eating so much after feeling abnormally hungry</p><p>- Dizziness</p><p>- Brief paranoia</p><p>- Motor retardation</p><p>- Memory loss</p><p>- Lack of concentration</p><p>- Tiredness</p><p>- Constantly thirsty</p><p>After all that I was zombified as intended. I expected all those side-effects. I know what these drugs do to a person. That was after one dose. If I stick to the timetable I'll be on four times this dose within a week. I'll see how I cope one day at a time. I will take the next pill in about an hour and the first dosage increase is tomorrow night. Last night and today have been so surreal. I feel ill. It's strange that I am being treated for symptoms such as depersonalisation and delusions with a drug that causes the same kind of thing but with a different edge to it. I think my main fear is that I'll get to the point where I don't realise how much this drug is changing and dulling my personality but I'll continue to take it due to my imperceptive state. My last lecture today was about William James' descriptions of depersonalisation/derealisation. This day feels like it has been going on for weeks. It took me fifteen minutes to brush my teeth this morning and I was confused by my own reflection in the mirror when I managed to get up. Half an hour until I take the second pill. I will persevere with this. Maybe I'd rather not care any more. I've just tried to read back through what I've typed but I can't take any of it in. I will spell-check it. I may be confused but my spelling will not suffer.</p><p>-------</p><p>FYI, I have since discovered that Seroquel dramatically reduces the effects of benzodiazepines. Combining it with cannabis just causes extreme fatigue.</p>"
}
