{
 "title": "Defining the Nature of It (An Experiment)",
 "author": "Nookoo",
 "citation": "   Nookoo. \"Defining the Nature of It (An Experiment): experience with 2C-P (ID 51687)\". Erowid.org. Mar 22, 2006. erowid.org/exp/51687",
 "substance": "2C-P",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-P",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 51687",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 22, 2006",
   "Views: 31799",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was a little nervous preceding the experiment due to the amount of misinformation around it (even from Phikal) and the extreme poor quality of reports from initial testers on the web. The 2CP (10mg) was swallowed at 7.40 am, but although something was felt quite quickly it was very vague till two or more hours, when I was feeling mainly clobbered and lethargic and was hoping this wouldnt be like a-MT, a colourful but rough, nasty and empty ride that lasts forever. I listened to The Undertow live and started to feel better and enjoy it more  fairly typical psychedelic patterning forming in the carpet at my feet. My girlfriend arrived home from her dog walk and pointed out crud all over the floor from yesterday when I had been sorting out all our dodgy old video tapes, so I set about tidying up a little despite being fairly under the influence.</p><p>I spoke to a friend online  amazingly typing proved quite easy, although soon I signed out having said this stuff was rocket fuel and out in space material. I lay myself down since things were becoming chaotic, multi-layered, things moving, my ego structure breaking up and shifting, making it hard to keep track.</p><p>My main memory was staring down into a sort of technological insect hive/city. After some time I was able to regain composure, having reached a plateau. I noted that there had been no nausea at all which is very rare for me, and also, although I made little attempt at eating, the idea of food was not unappealing. Around one oclock our pagan friend Toni arrived and I came downstairs, the effects were now somewhat milder and I became quite social. Having the stimulus of someone in the house highlights the effects  which, like all the phenethylamines I have tried, are distinct from the others.  We walked through the forest and onto the plains beyond  it was blazing hot despite the promise of a storm. I chatted on and on, happily energised, on how magick and nanotechnology and the like were really pretty much the same thing despite many pagan types mistrusting science and, more humorously, how there werent enough performance enhancing drugs in sport since people try and enhance their performance every other way. Expanding on a friends idea of a proposed drug fuelled super-Olympics I suggested a compensatory  organic Olympics, where people wheeze round a field, for those not interested in furthering science in this way.</p><p>We arrived home and Toni left  I noted, when I sat and reviewed my status, the wall sliding away, but it had been quite a walk and long chat so I decided to try and rest and retired to bed, whereupon I was taken by a strange state; I fell into a deep rest and became aware of shadowy silhouettes of maybe three or four basically humanoid forms, their heads large either with dreadlocks or some strange head-dress (I was unsure if it was physiological or technological in nature or perhaps a mixture). The figures shifted and milled around and I became aware of high frequency sounds. Each one (located within my head) was of a different pitch and consisted of a sine wave that would rise in volume for little over a second. At the peak each noise seemed neurologically painful or jarring although I was not unhappy to be in this situation. In fact I took this to be a form of communication from what I took to be benign entities and was simply fascinated by it. I was able to come out of this state and re-enter again and it went on for a little while.</p><p>Soon after the promised bad weather arrives as a huge thunderstorm (water actually ran through cracks in our back door) and I worked at the PC for a bit and listened to some music. For the rest of the evening the drug very, very slowly peters out, somewhat speedy and very drawn out but nothing unpleasant and my mood remains very good. Later I have a bottle of beer and some codeine, have dinner and an otherwise uneventful night of TV until bedtime. Overall a promising, complex and euphoric drug with a duration of 16-18hrs. The next day I am tired but I suspect thats mainly due to patchy sleep.</p>"
}
