{
 "title": "Not Life-Changing, but Cuddly",
 "author": "Nox",
 "citation": "   Nox. \"Not Life-Changing, but Cuddly: experience with Opium (ID 51707)\". Erowid.org. Jun 21, 2008. erowid.org/exp/51707",
 "substance": "Opium",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "smoked",
   "Opium",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51707",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2008",
   "Views: 40992",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have a couple of general rules that I try to apply to my existence: don't do anything too addictive, don't do more than planned, and don't redose anything on consecutive days. I follow these rules, and my body is thankful. But to be fair, this was a special occasion. And, as Uncyclopedia says, opium is the opiate of the masses. Why, so it is!</p><p>We were celebrating a Dead Can Dance concert we'd attended five months before; it had been a beautiful, transcendant experience, one which yielded a remastered recording that we were all itching to (re)discover. There was no way a copy of the home game could compare to the live show, but we figured the four grams of opium we had to share between the six of us would help to fill in the cracks. Worried about my sensitive stomach, I ever-so-cautiously devoured a bunch of Chinese food at 7 PM, then waffled around in hopeful regret until 11, when we gathered and things got underway. </p><p>Lights were dimmed and reddened; my boyfriend's condo began to resemble a whorehouse, but we supposed the vibe was close enough. I was nervous but felt physically sound, which is better than can be said for my state before most shroom trips; then again, I suppose my subconscious knows that opium is a lot less likely to end in a perceived ten billion years of Vin Diesel movies. </p><p>The boyfriend went first, attempting to vapourize a matchhead-sized chunk of the tar-like stuff in a bong using a butane lighter. He took a few deep hits, and remarked that 'It's doing something, but... not much.' The opium was melting into gunk, clogging the metal piping and reducing the amount of smoke able to make it through. The group decided to mix opium and marijuana in a joint, in the hopes of getting better results, but I'm a purist and took over the bong before those proceedings got started. </p><p>The smoke didn't taste like much, which surprised me - the opium itself left a resin that tasted of bitter poppy goodness on my fingers, but by the time it made it through the water and into my lungs, it was much more neutral. To be fair, we had nag champa burning throughout the night, which might have contributed. At first, it didn't feel like much of anything apart from built-up expectations, but as the others rolled their joint and I kept working with progressively larger chunks, I grew progressively more affected. I surprised at how much soupy opiate goo it takes to get someone with absolutely no tolerance going. It's an insidious drug, after all.</p><p>Honestly, I don't know how to describe the high. I experienced only one rush, about half an hour in - it shivered warmly through my head, wrapping me in cotton batton and working its way around my teeth with an inaudible buzz. For the most part, I felt like I'd wrapped myself in a fleece blanket so that no part of me was exposed, and every time I closed my eyes, the fact of my physical being ceased to matter. The music was beautiful, but I was trying so hard to focus on the conversation going on that I missed a lot of it. Occasionally I'd get hit with a melody that caught me and pulled me into ripples of pleasure, but it was largely background noise; I was lulled into complete dullness, and was using up all of my mental capacity just trying to make the occasional joke. They were lame jokes, too. There was a single wave of panic that I think occurred as a result of some marijuana being left in the bowl, it's a usual side-effect of weed for me, but it was overtaken by happy numbness so quickly that I couldn't bring myself to mind. Every time I let my head fall back, it was that much harder to lift it again; whenever I got up to walk around, I was simultaneously dragged toward the floor and lifted toward the ceiling. It was a most pleasing balance. </p><p>Here's a bad thing: we came damned close to becoming a statistic, or possibly an after-school special. One of us went to the kitchen to make some popcorn, then wandered off to use the washroom, leaving everything unattended. I glanced at a mirror that provided a clear view of the other room, and noticed that there were ripples of flame running up the sides of a pot on the stove. 'Hmmm,' I thought to myself. 'Now, that doesn't seem right at all. Someone should really do something about that.' Turning around, I tried to alert my boyfriend to the perturbing incident going on, though I can't say I tried all that hard. He noticed soon enough, and the fire was extinguished. But just so you know, I'm a neurotic, jumpy girl with a panic problem. Although I suspect I could have handled the situation if it had fallen to me to do so, I'm a wee bit concerned about how easily I accepted something so minor as FIRE FIRE FIRE!!!. After the boyfriend returned to the living room, I smiled happily and said, 'Oh, good.'</p><p>Over the course of the night, we grew steadily more disconnected and self-absorbed until we eventually decided to crash around 3 AM. Soon before this, I began nodding off, and was very cheerful about this fact, since I've always wanted to be an opiated literary genius à la Samuel Taylor Coleridge. Unfortunately, the dream-scene that played itself out so gloriously and with such depth over my closed eyelids was the most cliched and trite wizards' war I could ever write, and though I must take some pride in its execution, the content could use some work. The boundary between waking and sleep was so thin that I was dancing from side to side while still talking to my friends, which was warm and comforting and good, but make no mistake: there was no depth to it at all. Perhaps if I'd been alone, or we'd been actively trying to do something creative, it would have been different, but all in all, opium completely killed my hypercreative drive while it was in effect.</p><p>After eight hours of the best sleep I've had in years, we woke up and decided (shock, surprise!) to smoke some more opium. This was such a seductive idea that I immediately discarded all of my principles and gave myself over to a life of degeneracy. It was completely different with the sun up and the night's mess on display: colours were brighter, textures were thicker, and I was cheerily discombobulated. We watched visualizations while listening to blues, and it was completely enrapturing; it took us a solid hour to get up off of the couch, despite how many times we resolved to head out for food. 'Okay, we'll get up in three!... one, two... ohhhh man, that is amazing. OK, just another few minutes...' It wasn't psychedelic, but everything was better than usual, and it was incredibly easy just to let things splay out across my field of vision. The music and the visuals melted together so perfectly that I just wanted to melt into the couch and never move again. </p><p>Finally, we went to the mall and stopped at a toy store, where giant Hello Kitties and satin-covered duckies felt better in my anesthetized grip than anything else ever has. Giggles were rampant. You'd think to blame the marijuana, but I'd just had a few matchhead-sized servings of opium, nothing else. The floor floated below my feet, and breakfast reminded me of my raging hunger. It was so nice to eat after a night of drug use, and the sleep was the icing on the cake; to hell with MDMA! Let's just waste our lives lying around in precious languor!</p><p>That's a bit of a problem, though. In the daytime, lacking the sleepiness of the night before, I felt perfectly competent in public, and have been blessed with an amazingly thorough afterglow. 24 hours after my last smoke, I was blissfully plowing through tasks at work, feeling like I could be fired at any second and it wouldn't matter a bit. Even now, 12 hours after that, I'm aware of slight lingering effects. There's a danger here - opium doesn't feel like it's damaging, and as much as I'd worried, there was no nausea, very little itching, and no other side effects to speak of. It's not too intense and it's easy to trust, and if one can get past the fact that it's the laziest substance in the universe, then one had better leave the remains of her supply at her boyfriend's house and go home immediately before the thought hits: Hmmm. What would make 7 AM on a Monday morning better? Ooooh, I know...</p><p>But to be fair, this was a special occasion, made more special by a drug that didn't really feel like a drug at all. And it it wasn't a life-changing trip into literary brilliance, it was at least really -nice-.</p>"
}
