{
 "title": "It Was a Beautiful Moment",
 "author": "Shroomish",
 "citation": "Citation:   Shroomish. \"It Was a Beautiful Moment: experience with Mushrooms (Golden Caps) (ID 51712)\". Erowid.org. Jun 24, 2008. erowid.org/exp/51712",
 "substance": "Mushrooms (Golden Caps)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 51712",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2008",
   "Views: 6229",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n=============================\r\nSecond Time\r\n4 - 5 grams of Golden Cap Psilocybin Mushrooms\r\nDecember 22 of 2005\r\n1:00 am\r\nFriends house surrounded by five of my friends (who were not trippin)\r\n=============================\r\nWhy I ate them alone is a mystery, I just did it. Today I realize it was a naive move, but I don't regret it at all. I ate them and I ate oranges to wash out the taste. I talked my friends about how I didn't want an immense amount of attention, and they completely understood what I wanted. It was a beautiful moment. \r\nI started getting the feathery feeling. Like my whole body was in a pool of soft down feathers, and they were crawling on my skin, very very pleasing and then this shape, this very mysterious shape appeared on my friends blue wall. Imagine the aquarious/jesus/fish symbol with the 'tail' on each side, with an 'S' down the middle Then these white, ghostly faces started raining down the wall, they weren't mean or scary or anything, just faces. This was just preparing my mind for the trip I was about to have. It was a beautiful moment.\r\nI backed away from the wall to change positions and scenery. I looked at this poster of a girl in front of a waterfall and the water behind her was moving. My friend 'O' came up to me and muttered in my ear in a very 'old man' like voice and went 'lllllllook at those mmmmelon jugggs.' It was like I had just been told the most hilarious thing ever fathomed by a fellow human. My laughing fit was out of control, it was complete delusional hilarium. As soon as I started regaining control, my friend 'D' turned on the T.V. and this monkey was steering a truck with his teeth, and screaming and jumping and all this crazy shit. It was hysterical. The thought that someone out there actually had to film that seriously just made me laugh so hard, and I was partly laughing at how I must look to these guys.  It was a beautiful moment.\r\nThe room started elongating and the ceiling was a theater of rainbow color swirls. People's faces started swirling into themselves and 'B' turned green. I kept on thinking about what they thought was going on in my mind, and how much of a wack-job I must look like. It was amusing to think about that. Then the room lost all verticle and horizontal properties, so I closed my eyes. And I saw these rotating Hindu Swastikas on the back of my eyelids, growing bigger, and bigger with a technicolor, ROY G BIV backdrop. It was a beautiful moment.\r\nFor some reason I had poptarts in my hand and I looked away, and the instance I broke vision with the pop-tarts, in my mind it was a cheeseburger. I had no recollection of pop-tarts, I thought I was holding a cheeseburger casually. When I looked back and saw that the cheeseburger had turned into poptarts, I threw them and it was like a fountain just spewing from my hands. We turned on my friends 'Beach' setting on his alarm clock (you know, the option to wake up to beach sounds instead of the actual alarm) and I just shut my eyes and swayed with the waves. I still get wrapped up in those things whenever I hear one, I never ever want to shut them off. It was a beautiful moment.\r\nI went into the laundry room and 'B's underwear folded up on the dryer turned into a black cat. It was strange and I wanted to be with my friends so I went and sat down to watch T.V. Girls gone wild was on it was soooo stupid. I was making fun of the people on T.V. so badly. To this day I am mesmorized by the stupidity in those damn things. I was stuck in some kind of electronic cycle. It was like the same series of events happened 20 times. What confused me was that it was an infomerical, so they just repeat every 10 minutes. I was saying the same thing over and over and over again without even realizing it at the time to my friend 'C', and I knew it too, I just kept saying them though. I knew that I could now relate to those 'crazy' people who just sit and do the same thing over and over and over again. I was quasi-worried that it wouldn't stop, but it didn't bother me. For some reason I was content to be stuck in the trip. I looked around the room at my friends(all of which were sleeping except 'C' and realized that people are just basically 'pseudo-sophisticated' animals. That no matter how rich, powerful, poor, weak, beautiful, ugly, cool, or lame someone is, they will always be the same species as me. It was a beautiful moment.\r\nMy auditory hallucinations were fun but distracting. I couldn't differentiate the voice of my friend 'C' and the ones on T.V. It all came together to make gibberish at times, then poems at times, then alliterations. Every Single Sentence Someone Said was an alliteration, then at some moments it was stuttering and repeating fragments of words 3 times before the word is over. This was probably the most intense thing of the night. The sounds of his words didn't match up at all with the shape that his mouth was making. We decided to go outside and smoke a cigarette. It was a beautiful moment.\r\nWe made it outside, slowly however. The tiles on the kitchen were soo huge. The backporch was the size of a parking lot. I got in the lawn and I looked up at the sky, the stars, the moon. They all were trying to pull me up. I felt like I was floating. The stars were getting bigger and brighter. It seemed like minutes before I came back to earth. 'C' said it was only 5 seconds. We went to the park to wait for the sun to come up, and for the shrooms to wear off. We went to the top of a hill and watched all the people going to work in their cars, and we just laughed at the differences between us and them. We kept seeing cops everywhere, and we laughed at them too, because Jesus Christ, they would never understand this. I guess you had to be there. It was a beautiful moment.\r\nIt was such a good night, such a good night.\r\n-------------------------------------------------\r\nThis trip showed me that no matter what, people will always just be people, and that I am not above or below any life form on Earth (including Earth herself). To this day, I really don't get mad at people, because, they are just an animal that can talk and where clothes, nothing more. I can forgive people so much easier now, I can sort my problems with a person out with them face to face, in a calm, respectful manner. \r\nI encourage all people who have been blessed and lucky enough to experience this great ectasy, to try to look for a deeper meaning than just hallucinations. Remember, 'The colors and visuals are just the decor of the trip' (Tom Wolfe - Electric Kool-Aid Acid Test).\r\nLaying on a patch of grass \r\nfilled with peace and love.\r\nThe Fruits of Ancient Wisdom\r\nAre Falling From Above\r\nIt was once unclear\r\nlike the waters of a pond\r\nbut now this sacred medicine\r\nhas helped me see beyond\r\nI once viewed life as small,\r\nas if through a hole\r\nbut now this sacred medicine \r\nas healed my aching soul\r\nThe dose was strong enough\r\nto manifest my mind.\r\nI suggest to do same\r\nand see what you can find\r\nSit back and enjoy\r\nthe explosion of the game\r\nbecause after this night\r\nthe world will never be the same\r\nMy senses will be gushing\r\nTime will start to bend\r\nbut if I have a tattered soul;\r\nonly medicine can mend.\r\nI am very much awake\r\nduring this conscience dream.\r\nI am floating through Deep-Space\r\nI am floating down the stream.\r\nQuestions overflowed me\r\nI needed reasons why?\r\nNow I realized all along\r\nthat the answers in the Sky\r\nThe enigma showed itself\r\nupon the great blue wall.\r\nIt then dissentigrated\r\nas the spirits fall\r\nIt's a common misconception\r\nthat it's simply an illusion.\r\nIt's a common misconception\r\nthat it's simply just delusion.\r\nWe are all one,\r\none with living things.\r\nI've experienced the thoughts\r\nof former monks and kings.\r\nI have now become enlightened\r\nand I seem to be at one\r\nwith the rain, sky, and comets\r\nWith the sacred Moon and Sun\r\nI now forever carry\r\nthe mystic form of light\r\nI now forever carry,\r\nthe wisdom of that night\r\nThe true nature of the world\r\nwill forever, always be,\r\nBut will only be revealed\r\nto those who wish to see\n\n\n"
}