{
 "title": "Euphoria with Subtle Life Lessons",
 "author": "childishheaven",
 "citation": "   childishheaven. \"Euphoria with Subtle Life Lessons: experience with Anadenanthera peregrina (ID 51763)\". Erowid.org. Nov 10, 2006. erowid.org/exp/51763",
 "substance": "Anadenanthera peregrina",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 seeds",
   "insufflated",
   "Anadenanthera peregrina",
   "(ground / crushed)",
   "  T+ 48:00",
   "5 seeds",
   "insufflated",
   "Anadenanthera peregrina",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51763",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 10, 2006",
   "Views: 9220",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nIt was the first bright, reasonably warm day this year and I decided to walk my town. I love walking and this can go on for hours and on this particular walk I stumbled on a new herbal store, supposedly selling psychedelic plants. I jumped on that train and asked the shopkeep whether they have something with DMT inside. After a few failed attempts on DMT with ayahuasca and even yopo seeds, I almost gave up on this chemical, but like salvia I finally got it working, but not in this ego-smashing way. Becoming an inanimate object on salvia was the hardest I've ever tripped, and I can't imagine a drug being stronger then this, but that's another story...\r\nThe shopkeep told me to get some lime, another visit to a pharmacy in order to get high. So I heated the 10 seeds in a pan until all of them jumped in the air, they actually did, and got a crack. My room filled with that peculiar smell, and I knew today I will trip from this shit. So I crushed the brown seeds into powder and added about three times more lime powder. The peregrina fully immersed in the lime and gave a white-brownish powder, smelling like my room. A few hours, after getting knowledge, I thought ok, it will hurt and you will barf, but that's a matter of science and has to be done. \r\nSo I began railin' and it wasn't actually this bad as others describe, or I just prepared myself good - whatever... I did this until my body said: one more line and you vomit all over. About the half or more of my 10-seed-lime-mix was gone, and it burned for sure, yes. I felt the first alerts about one minute later followed by strong nausea. About 10 into this I thought - go hurlin' right now, now, now, now... It was like on my ayahuasca attempts, the most painful way to hurl, and I threw up from many substances and gastric diseases. After this I got the all so familiar what if my trip goes bad feeling, which occurs to me on all psychedelic substances prior to their full onset. My teeth and face went numb and a wave of euphoria began crashing on me. The feeling was like being on an indole psychedelic with a euphoria superior to all drugs I've sampled. No confusion, no visuals (exept subtle movements in the corner of my eye), just euphoria with subtle lessons about life - a great feeling. After the mentioned barfing session I felt like a million dollers and began dancing around my flat. This went on about 45 minutes leading to drop off, but the euphoria lingered, like the more sober I get, the more happy I am. \r\nI've had substance abuse problems in the past, but it seems like I got strengthened on my assignment, staying sober and live. The rest of that night was spend with this I've done DMT today feeling and that yopo smell still stuck in my nose and room. \r\nI repeated the experiment with the rest of my powder 2 days later with similar results, but I somehow managed to hold my food down. This drug has a definite addiction-breaking and self-healing property especially when consumed oral (with maoi) - an experiment I still have on my task. \r\nDMT or was it 5meo-DMT - the best and most reasonable substance I've ever had up my nose. \r\n...true love has to be stumbled on, not to be searched for...\n\n\n"
}
