{
 "title": "Acetone-Fueled Nights",
 "author": "Nihil",
 "citation": "   Nihil. \"Acetone-Fueled Nights: experience with Inhalants (Glue) (ID 51765)\". Erowid.org. Nov 30, 2007. erowid.org/exp/51765",
 "substance": "Inhalants (Glue)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Inhalants",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 51765",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 30, 2007",
   "Views: 10037",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>The first time I ever sniffed glue, I was 12 years old. I had read in a book about a seven years old and a twelve year old who were doing glue, smoking dope and drinking hard alcohol. How I could squeeze a dollop of model glue onto a kleenex, twist the kleenex to form a closed ball of liquid glue, stick the ball into a nostril, hold the other one closed, and inhale hard enough to pop the kleenex, sending glue rushing through my sinuses and into my brain.\r[Erowid Warning: It is very unusual for glue sniffing to be done this way, introducing the solids as well as the vapors into the body.  It is not known what additional dangers this may bring.]</p><p>The first time I ever sniffed glue, like coke, I felt nothing. Like coke, I had to decide to do an 'effectless' drug a second or third time before I felt anything from it. It slowed down my reality, and quieted the continual circles running through my mind. My brain feels like it sinks, just slightly, from being to suspended to floating. All the pressure in my head, in my thoughts, in my worries, fades away.</p><p>When I lie down and close my eyes, my whole body sways and rocks gently, as if I were on a hammock, or a raft in the ocean. It's very easy to get to sleep from this point. Years later when I did coke for a few months, I was using glue to get to sleep every night after spinning. If I don't fall asleep, or open my eyes, after about five minutes when life slowly floods over me again, I get back up, and take another two or three hits. If I begin in the early evening, I'll go all night. On glue, everything slows down, and I feel more calm and relaxed, but I know my heart is racing, but I'm too content to care.</p><p>I found cotton undershirts worked better than kleenex, because there would be a slow steady stream of glue passing through the fibers when I inhale. This greatly decreases the sound I make, and therefore, likelihood of getting caught. I had several shirts covered with little circles of dried glue and blood.</p><p>I haven't done any glue since two years ago, at age 21. Will I ever do it again? Probably not, because it's easier and more respectable just to be a pothead, but I remember it as a fairly benign drug, sort of like a children's strength opium.</p><p>I wrote this without paying attention to what I was writing one the last night I ever did glue (though that wasn't necessarily the plan):</p><p>APATHY CREEPS</p><p>I can feel that I've already begun to die. I can feel my body atrophying beneath this cosmic shell of energy, which is failing. The virus is in me, turning my brain black, jellying my muscles. Corrupting me. I am falling apart, I am being disassembled by some sub-atomic force. And I'll lie awake, watching my heart race, feeling its attack but to move would be impossible, unless it was for more. I am much too used to it... Maybe just one more... Then I'm done... But how often can you fly?</p><p>I lie in bed, unable to command my brain. It's created a brand new language for my muscles. All I can do is be. All I know is I need more sleep, my muscles clamour for more rest...6...10...14 hours, bit I couldn't move. Once in a while legs flail, arms twitch, and I  find myself in a new position. All I can decide is more sleep, or if I'm limp I can masturbate. A sensation rips my body apart, as I grip my bed.</p><p>Warm and rich like comfortable slipping I lay back on a cloud which embraces me, coddles me. I doubt I could get up even if I wanted but I'm happy right here on the floor. Sprawled from my original position, but as my ever-growing mass of rotting flesh loses incoherency, my mind is once more occupied with mind-numbing guests, staying too late too loud reminiscing of the time I had more. To turn my eyes to plastic. To set the world on a bright high bright sheet with as much depth as I can reach. Inevitably, bounce returns to my hand and brain as one more drives me to alter my position in no measureable amount. As history melts and fades, it becomes less real than the less real memories of TV, and the life that was less memorable and too painful is reduced to an acetone-fueled diorama of half dreams and half truths, solidifying to evaporate in my growing destructive mass of flesh.</p><p>Apathy Creeps.</p>"
}
