{
 "title": "Snorting the Gel",
 "author": "DejectionVector",
 "citation": "Citation:   DejectionVector. \"Snorting the Gel: experience with Fentanyl (ID 51834)\". Erowid.org. Mar 21, 2010. erowid.org/exp/51834",
 "substance": "Fentanyl",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   " ",
   "  ",
   "insufflated",
   "Pharms - Fentanyl",
   "(patch)",
   " ",
   "  ",
   "insufflated",
   "Pharms - Fentanyl",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51834",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 21, 2010",
   "Views: 14012",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA buddy of mine tossed me a 50 mcg/hour Fentanyl Transdermal patch, and at first, I didn't know how I should take it.  I considered just slapping the thing on, but I wanted to split the patch with a friend, so we decided to cut it open and experiment with it.  We squeezed out some of the gel, and applied it to our gums and cheeks with little effect.  We tried smoking the gel, letting it dissolve in out mouths and under our tongues for a bit, but neither of us felt that rush that we expected (both being daily heroin/pharmaceutical users/abusers), so we decided to mix the remaining gel with a small amount of powdered Percocet (maybe an eighth or a sixteenth of a 10 mg. pill).  There was about 3/5 of the gel left (approximately 3 mg.), and we mixed it in with the Percocet powder.  After snorting the powder, both of us decided we felt a nice strong buzz, but not nearly as strong as we had anticipated.  We decided to try it again a few days later.\r\nThe next time, we squeezed almost all of the gel out of the patch, and deposited it on some powdered Fioricet pill (also a very small amount; just enough to act as a filler) and quickly split the powder into four equal sized lines, and took one each, and went outside to smoke a cigarette.  After a few minutes, we both had reported feeling a little bit dizzy and euphoric, and we noticed each others pupils beginning to constrict, so we decided to finish the powder off.  I got about half way through my second line before I started to feel very drugged, and my friend also couldnt finish his second line at all.  It was a comparable feeling to heroin, but much more intensely euphoric, even at low doses.  After the second experience with the 50 mcg/hour Fentanyl patches,  I decided that snorting the gel was my favorite route of ingestion for the drug, and I intend to try it again next time my friend gets more patches.  Fentanyl, I noticed, is an extremely finicky drug, having little to no effect with one route of administration, and being overly (dangerously) potent with another route.  \r\nWhat I like best about mixing the gel with powder and snorting it, is that it is much easier to dose myself than with just the regular gel.  If I have a 5 mg. patch, for example, and I mix it with some powder and divide it into approximately 5 equal sized piles, each of them contains approximately one milligram of the substance.  If snorting half of a patch sends me into dope-heaven with a 3 bag a day habit, then I cant imagine what it would do to opiate-naïve persons talking the drug\n\n\n"
}