{
 "title": "Nothing but Pleasant Experiences",
 "author": "Nicole",
 "citation": "   Nicole. \"Nothing but Pleasant Experiences: experience with Codeine (ID 51865)\". Erowid.org. Mar 25, 2008. erowid.org/exp/51865",
 "substance": "Codeine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Codeine"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51865",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 25, 2008",
   "Views: 12188",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had my first experience with codeine 4 years ago at age 15. It was prescribed to me for pain after I had undergone a non-serious 'day' surgery. My prescription was filled for 80 tablets; I would eat them beginning at 4 at a time (120mg of codeine), eventually working up to 300mgs after learning of the cold water extraction method. While under their influence, I would experience euphoria, relaxation; a general sense of well-being. I have only once experienced nausea, which resulted in vomitting. I felt much better afterwards. This was while experimenting with stronger doses than I could handle at the time. I occasionally experience a feeling of 'indigestion', though it is easily relieved through eating some crackers, bread, etc.</p><p>As my first prescription ran out, codeine slipped my mind, and I became involved with harder drugs. I began experimenting with X, eventually using it 5-6 nights a week for  over a year. I was smoking weed every day, going through about 1/4 ounce a day, and had been doing this since I was 13. I have tried crack(and precook), mush, speed, meth, acid as well as some legal highs including extracts of blue lotus, opium, wild lettuce, and dramamine.</p><p>Anyhow, long story short: I have alot of health problems now including anemia, a poor immune system, depression, and insanely intense panic/anxiety disorders. I have dropped drugs all together, with the exception of codeine. Codeine helps me to relax, keeps my heart rate quiet, keeps me happy and gives me the munchies - all of which I really need in my life right now, and other prescription medications (prozac, effexor, ativan) are not able to give this to me. I'm thankful for such a great drug, though, I must say a part of me is definitely frightened - I have never once felt addiction with my previous HEAVY drug use. A (seemingly) 'soft', innocent drug, completely legal(OTC in Canada) and I can't see my life without it.</p>"
}
