{
 "title": "Some Drugs Aren't Meant for Everyone",
 "author": "Natas",
 "citation": "   Natas. \"Some Drugs Aren't Meant for Everyone: experience with Methamphetamine (ID 5186)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5186",
 "substance": "Methamphetamine",
 "bodyweight": "146 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 lines",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)",
   "  T+ 8:00",
   "2 lines",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5186",
   "Male",
   " ",
   "Not Given",
   "Jan 11, 2002",
   "Views: 33380",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIve always tried to explain to people how some drugs just arent meant for everyone and recently I verified this personally. Im a big fan of LSD and have used it for years without problems. Many people however have explained to me how much they dont like it so I accepted the fact that it wasnt for everyone.</p><p>A short while ago I started using meth regularly simply because my town was dry of LSD and meth is everywhere and cheap. I soon realized that I wasnt meant for all drugs either. I had used meth several times in the past but never for days at a time. Well one day I tweeked as usual after doing about 2 lines and waited another 8 hours to do more to renew my high. The next 2 lines I did made me feel the usual tweek until about 4 hours into it when I noticed that things were glowing as if I was mildly hallucinating. </p><p>I remember thinking to my self that this wasnt too strange because a lot of people I know had commented that they had mild hallucinations sometimes. So I ignored this and occupied myself by talking to my friends online. About an hour passed and I shut off the computer and walked to get a drink. I looked over at my cats who happened to be fighting and out of nowhere they started shouting obscenities at each other.  My face had a look of shock upon it as I realized that this wasnt something that happened to other people with such small amounts. By this time the glowing had intensified greatly and everything around me was a different color than usual and many things were shooting sparks and rays of light. There was a shadow of another person constantly next to mine who kept whispering random words in my ear. I could no longer breathe without consciously making myself do it so I spent every few seconds remembering to breathe for fear I would die. </p><p>I walked to the bathroom to splash some water on my face which was very hot and there was a man pointing to the light switch with enthusiasm as if waiting for me to turn it on. I couldnt even see myself in the mirror because it had turned white. I was worried but I did not panic because I didnt feel any different than when I was normally on meth I was just hallucinating. I continued to have many hallucinations that would take forever to list and I became worried that I may end up schizophrenic when the drug wears off. The only blessing in disguise I had was that when I realized I was unable to sleep for obvious reasons I just stopped making myself breathe and within a minute or two I was unconscious. I considered the fact that doing this may kill me but I figured that when I fell asleep my body would return to breathing automatically and thankfully I was right. </p><p>I now choose to wait for LSD and dont particularly feel the need to become schizophrenic out of boredom. I dont really know if this will help anyone but I felt the need to express the fact that drugs do different things to different people. Id also like to add that 4 other people did the exact same meth with me and none of them experienced anything like this so there is no chance of it having an additive such as PCP unless they are all immune. So experiment carefully and find your drug of choice.</p>"
}
