{
 "title": "Night in Hospital...Woohoo",
 "author": "brrrrrrrrr",
 "citation": "   brrrrrrrrr. \"Night in Hospital...Woohoo: experience with 5-MEO-AMT (ID 51875)\". Erowid.org. Aug 20, 2009. erowid.org/exp/51875",
 "substance": "5-MEO-AMT",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "5-MeO-AMT"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 51875",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 20, 2009",
   "Views: 4024",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The summer of 2004 I had received a few doses of 5-MEO-AMT.  I had played around with a few research chemicals before, but this was my first experience with this.  My dose was no more then 10mg, but the actual dose is not 100% remembered.  Anyways, soon after ingesting the 5-MEO-AMT, I had an experience of tripping that was highly visual and highly physical - not very emotional at all.  While lying on my bed for a few minutes after the trip had started (~45 minutes), my heart rate began to sky rocket - I tried to calm myself down, but my heart kept beating faster and faster - I got up, went to the bathroom and it looked as if I had taken a shower with my clothes on since I had been sweating so much.  My heart still felt like it was going to beat out of my chest - I mistakenly did all of this without a sober sitter - so I decided to find someone to take me to the hospital - all while tripping.  </p><p>After getting to the hospital, I entered triage, and my heart rate and blood pressure were so high I was quickly moved by most of the people waiting in the hospital.  Once my heart was somewhat stabilized, the questions came...what had I done, how long, how much, etc...Out of fear, I denied the use of drugs, knowing that 5-MEO-AMT would in all likelihood not be tested for in a drug test - I was correct.  It was diagnosed that I had a panic attack, with abnormal nervous system responses - i.e., extreme dilating of pupils, disassociation, etc.  This was one of the most scariest experiences of my life - I had spent the night in the hospital tripping - being jabbed with needles, harshly interrogated, handled in a manner that was not very gentle (understandably so, the doctors didn't want to deal with some ODing kid when other people with other problems were there), and ultimately was forced to concoct a very fishy story to get out of trouble.  </p><p>I have tripped many a times on many different drugs...I've had bad trips, I've had good trips...I have never seriously thought I was going to die except for this one time - and being that I was bordering on having a heart attack - I was close to some very dire health consequences.  I would highly recommend to anyone planning on doing this drug to reconsider and maybe try a slightly safer hallucinogen...acid, mushrooms maybe...cause I can assure you, a hospital is not a conducive environment to tripping, especially when you fear for your life.</p>"
}
