{
 "title": "The Cosmic Love",
 "author": "Abraxas",
 "citation": " Abraxas. \"The Cosmic Love: experience with Mushrooms (ID 51886)\". Erowid.org. Jul 2, 2008. erowid.org/exp/51886",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "51886",
   "Male",
   "",
   "Not Given",
   "Jul 2, 2008",
   "3149",
   " "
  ]
 ],
 "report": "</p>\nBefore this experience I had only smoked grass. I opted to do them after work one night at about 11pm in my room by myself. I didnt find the taste especially terrible and they went down fairly easy.</p><p>About half an hour after ingestion I was on the computer listening to some music and talking to some friends. It was then that I noticed a large red spot on my wall and I wasnt quite sure if it was real or not. I felt a little sick, paranoid and excited all at once. I looked down at my carpet and found that there were dark patterns forming together and swimming towards me. I looked my walls and they appeared to be breathing and pulsating, and one wall extended about a half a mile backwards. This freaked me out as I was unsure of what to expect. Faces began appearing all over my walls and I could hear those faces whispering in my ears. They were whispering in foreign tongues, I couldnt understand a word they were saying but it felt like what they were trying to tell me was important.</p><p>I could no longer concentrate on typing messages to my friends as the words I was typing began falling off the screen. Just then my cell rang and it was my friend. I told him what I was seeing and that I was kind of freaking out. He said he would come over. With this came a great sense of relief, if only temporary. I opened my blinds so I could see my friend when he came. Whenever I looked out the window there appeared to be a very angry facing staring in at me. The face looked like it wanted to get in my room and kill me. This brought back the paranoia. I started pacing around my room trying to calm myself down. Time distorted to an intense degree. I felt like I had been waiting for my friend for hours, even though my clock clearly stated it had only been 20 minutes. This lead to an intense fear that he would never come at all and that I would be alone forever.</p><p>However he finally showed up and this changed the trip completely. It went from completely negative to completely positive. I snuck him in through the back door as I didnt want to inform my parents he was coming over in my state. He told me that he had just been chased by the cops because he was walking down the road smoking a joint. We went back to my room and I turned on my Christmas lights and turned off all other lights. I also turned on the TV but the audio just skipped and I couldnt comprehend what was going on. The Christmas lights added a completely different dimension to my experience, there was intense colors coming from them, every time I looked away from them  everything would change those colors.</p><p>It seemed like everything on TV was a commercial which was terribly frustrating to me. Peoples faces on TV were growing, shrinking, bubbling, popping and then shriveling, sometimes even exploding. My mind felt like it was running at a million miles an hour, it was like instead of having one train of thought like normal, I was thinking at 4 levels all at the same time. I'd try to speak, stop mid-sentence and then re-start that same sentence ten minutes later simply because I was thinking so much. My friend then told me he was hungry and that he needed something to eat. Suddenly I felt hungry, even though when he brought back food I couldnt eat a thing.</p><p>Time seemed completely unimportant, I realized that it was just a measurement, and that this measurement runs everyone's life. If I wanted to be free, I would have to be unaffected by time, but this is impossible in a society completely based around time, schedules and routines. Now it was probably around 4am. I had to go to the bathroom. For some reason I thought I would get caught if I went upstairs to use the facilities so I just went outside. I only had a pair of shorts and a t-shirt, and it was probably about minus 20, but I didnt feel the cold. I stood outside gazing at the sky which was changing colors (pink, purple, green and yellow) and saw blue bars of color floating across the snow towards me.</p><p>Then, out of nowhere, my neighbor's outdoor light came on, which freaked the hell out of me so I quickly retreated inside. This is when the trip became less visual and more introspective. When I came back to the bedroom, I felt like everything was alive, and that I was connected to everything in the universe, and when my mood changed so did the mood of the universe. My mood was good, I was feeling the divine force, the cosmic love. The love wrapped me up and made me feel good, made me feel at peace. I could see the love as well, it was pulsing through my entire bedroom and me.</p><p>After about an hour of this feeling of connection I started to come down. I climbed into bed and tried to sleep. The bed felt like a cloud and  the blankets were floating over top of me in the wind and I couldnt tell if I was comfortable or not. It took about another hour for me to fall asleep and during this time I felt absolutely terrible. I had the worst CEV's you could imagine. I was seeing women getting raped in back alleys and people committing suicide. I was hearing what sounded like blood pouring down the walls around me and I heard people being tortured. I also felt that as soon as the next day comes, I need to get away. Away from my family, friends, responsibilities and stress. I needed to take a vacation by myself and just get myself together. I then drifted off to sleep and awoke the next day to a minor headache.</p><p>Aside from the beginning and end of this trip it was great. And now that I think about it, the bad parts werent that bad, it was part of the experience, something I had to go through. I still feel like I need to get away from everything and gather my thoughts even though its been a couple of months since the trip. I was planning on doing LSD as well but have decided to wait until Im a little more experienced as the intensity of the mushrooms surprised me. However, Ive now done mushrooms a bunch more times and am very comfortable with them. I enjoy them but I want a psychedelic with less of a 'heady/spacey' feeling.</p>"
}
