{
 "title": "Long Hard Road",
 "author": "Neko",
 "citation": "   Neko. \"Long Hard Road: experience with Methamphetamine (ID 51925)\". Erowid.org. Aug 24, 2006. erowid.org/exp/51925",
 "substance": "Methamphetamine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)",
   " ",
   "  repeated",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 51925",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 24, 2006",
   "Views: 10848",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've spent a lot of years doing a lot of drugs and all it comes down to in the end is they are all a waste of my time. <br>I started doing drugs by smoking pot in high school because a friends mom smoked it all the time and asked us one day if we'd like to smoke some with her. So there we were 14 years old smoking dope with her mom. Well that was it once wasn't enough, we started buying it regularly and started to try any other substances we could find. Slowly we worked out way through everything. Before we knew what had happened to us we were snorting cocaine off of a dash board between classes. So high school continued on like this for us till we finally finished. Both barely finishing, but both on time. <br>Not having lived in my parents house since I was 17, I had nothing to stop me from doing what I liked at any given time. I had spent a fair amount of money I should have been paying my bills with on drugs. I got to the point I needed two jobs, one to pay my bills and one to pay for my drug habit. Originally the drugs were just for fun or to relax, now they were to survive. <br>I was no longer just smoking dope, or doing coke a few times a week. I had found myself a fancy new friend, and a boyfriend who sold it. I started to smoke meth when I was 18. It started as just doing it once in a while just for the hell of it. After a while of working two jobs I started using it all the time just to keep myself awake enough to be able to go to work. After using it long enough the fighting with said boyfriend started. All people fight yes, but we were fighting all the time!! We fought because of bills, because we'd spent too much on meth, we fought because of meth, we fought because we didn't have it. <br>I was down to the point that I had to smoke it to function. If I didn't smoke it I slept all day and missed work or family functions. I was mean to the people I love the most. I was not someone anyone  wanted to be around. Meth had consumed my life! <br>On an average day I smoked a gram by myself. I didn't just smoke it either. If I was in a situation that I couldn't get away from for 10 minutes to smoke it, I went to the bathroom and would snort what I needed for enough time until I could sneak away again to do some more.<br>By this time I had sold anything I owned of value to support my habbit. I had lost more then once job because of my drug addiction. I had moved anything I had left back into my parents house but I didn't really live there. I lived a little bit of everywhere by then. I was to the point I was at someone else's house all the time. I spent a ton of time driving hook up's around just to score a free bag of gak. I had gone from a very nice little 135 pound girl to a sick and gross looking 100 pound shell. <br>I was getting to the end of the line with my drugs use not by choice. I could no longer support my habit. I didn't have a job I didn't have any money. I didn't have any friends. I didn't even have the boyfriend I had started with. <br>I had been in jail more then once, I had my house searched by the police, I had my vehicles searched as well. I had stolen money from my parents, I had drained my university fund, I had sold everything I owned almost. <br>Most people when they become bar age abuse that right... Not me. I spent my 19th birthday on a couch at some guys house passing around a pipe. <br>I had learned how to blow glass into pipes, where to get glass to make pipes and who I could steal from to get the glass. <br>It got to the point the cops knew exactly who I was and what I was up to at all times. No one I spent time with at this point wasn't a user. Everyone I hung out with used as much or more then me! <br>I had gone from a very nice person to a terrible horrible back stabbing life sucking individual.<br>I sat at the same table with one of my closest friends one night and watched him die because of a drug overdose and there wasn't anything I could do about it, he was dead before the paramedics even got there. Less then 3 months later I had to bury my first love and best friend of just about 20 years because he had spent too many days awake tweaking out on meth, and shot himself in the head killing him instantly. Neither of these deaths made me even rethink what I was doing. I used more and more because it helped me forget about the pain I felt from losing them.<br>Once I was far enough down my parents thought it would be a good idea to go to detox.... After fighting and screaming and being throw in jail for a night because I had destroyed my parents house, I was thrown into detox against my will. Detox lasted a week the first time. After a week I was out and back to my old ways. My parents had told me unless I changed I was out on my own again and they wouldn't help me. I figured I had been on my own since I was 17 I'd be fine.... Well I wasn't! I was worse then ever before!<br>My life took a turn when I moved in with a friend in another province because they said that they had a place I could crash for a while and they knew a good connection. So away I went again. New place to live new drug dealing boyfriend new set of problems. I spent the next year or so living with these people I called my friends. Using and abusing the drugs I had come to love more then myself. <br>I had gone through job after job after job. I got a job stripping to make enough money to support my habit. Really classy job for someone who had been very shy and self conscious her whole life... But it made me good money and enough to keep me in drugs, at least for a little while. <br>My bubble was burst by the police forcing their way in to our house at 4:30 in the morning waking us all up and arresting and charging every single one of us. I got off on a technicality and that was just barely! So there I was in another province, just out of jail (if they had had more info on me I'd have been in jail for 2-5 years depending on what else they had and my past record!) So I called my mom to come get me. I spent the night sitting at the bus station waiting for someone I knew... At 6 am there was my dad to pick me up. I got in the truck not sure of what I was going to do but knowing I needed a pick me up.<br>Once back in the city I was born and raised in after the longest 8 hour drive of my life, I found gak one more time, I found what I wanted used it all at once and headed home. I got back to my parents house to screaming crying parents. It was at that point I was told this was it! My options were not detox anymore, they weren't get out of the house, the sure as hell weren't do what I want! My options were laid out to be get the hell in the house because I was getting locked in the basement for as long as it took to make me clean no matter what! So there I was under house arrest worse then the police could have ever done. I was locked in my parents basement with nothing to do but wait it out. <br>After 3 months of not being able to go anywhere I was finally given the chance to leave my parents house again.  After I was no longer a prisoner in my parents house I was made to see a councilor and it did help I'll admit though I hated going more then anything. I was put through weekly drug tests to make sure I was still clean for a year after. I have had a few urges to go out and smoke meth again but after everything I went through I realized it really isn't worth it, to gamble with that ever again! <br>This story may not sound that harsh, reading it over I find that it really doesn't sound that horrible because it's just simply words on a page... Yet when I put the memories of each moment with the words my body feels sick and disgusting even thinking about that time again. To live through screaming hell like this for as long as I did I'm amazed that I am still alive. I don't know how I got lucky enough to not end up like some of the people I knew.\n\n\n"
}
