{
 "title": "Shock and Awe",
 "author": "Yarnosh",
 "citation": "Citation:   Yarnosh. \"Shock and Awe: experience with Cacti - T. peruvianus (ID 51953)\". Erowid.org. Jun 16, 2006. erowid.org/exp/51953",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Cacti - T. peruvianus",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51953",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2006",
   "Views: 16157",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe package arrived on a Friday, but it would take at least the weekend to do a proper alcohol/tar extraction. There was no way I was going to eat 50 grams of powder or drink nasty tea/juice. So I had to postpone the trip 'til the following weekend. No big deal. It would give me time to prepare. I intended to fast before the trip. From what hear, that is the best way to avoid nausea. (it works)\r\nThe extraction went well. By the time I was done drying all the green/black alcohol solution and scraping it from the dish, I had about 7 grams of tar. I was surprise how much like tar it really was. It was just like the stuff they use to fill in the cracks in asphalt. It didn't smell bad though. I managed to get the tar into 8 capsules by cutting it into strips, which isn't bad compared to the 60 to 80 capsules that is required for the unprocessed powder.\r\nThe next weekend came and I was pretty relaxed. I had fasted for about 30 hours, which wasn't too hard. I find that when I decide that I am not going to eat, hunger doesn't bother me. \r\nAt 6:30pm on Friday I ate the first few capsules. My brother called and I talked to him for a bit while I ate the rest of the capsules. When I got off the phone with him the wife and I decided to catch up on the latest 'Lost' episode. By the time that was over, I was starting to feel the mescaline kick in. It was nice. Warm and fuzzy. Rather like MDMA, actually. I didn't get any of the tingling that others report. Mostly just a warm glow.\r\nWhat follows is a pseudo real-time report written after the fact. The present tense is only used for effect. There is no way I could have written this down during the trip...\r\n8:30PM (T+2:00) Things are starting to get trippy now. I'm starting to see trails. Still feels similar to MDMA... perhaps with some mushrooms mixed in. The wife and I turn on the movie 'Mirrormask' which I had downloaded the pervious night. Right from the start I am startled by some of the movie's special effects. I can't tell if I am hallucinating them or if they are just that good. A couple times I get the idea that the makers of the movie designed the effects specifically for people on mescaline. They were just *too* perfect. \r\n9:30PM (T+3:00) Ok, the movie is getting REALLY weird. That creeping death stuff is really starting to freak me out. I feel like it is consuming *me*. I don't think I can watch anymore. I'm starting to get somewhat confused. I turn off the movie and the wife and I chat for a bit. \r\n10:00 (T+3:30) My mind is wandering and I can't really stay focused. Heart is racing and I start to do my meditation walk/pace to try to calm down. Although my jaw is tense, it isn't necessarily clenched like it might be on MDMA. So that is good. I always hated teeth clenching.  \r\n10:30 (T+4:00) The wife is trying to relax me. I'm not having any of it. Can't sit still. She takes my pulse and blood pressure (she's a student medical assistant) and I'm over 170 systolic BP! She doesn't seem very worried, but I'm starting to get worried. Not quite panicking like I might on shrooms, but worried all the same. The overall feeling of the mescaline is positive, which keeps me from totally freaking out. One thing I notice at this point is a near complete lack of aural/audio hallucinations. It is a very 'quiet' trip. Which is good as far as freaking out goes because it is usually sounds that freak me out the most\r\nwhen a trip starts to go 'bad.' \r\n11:00 (T+4:30) Wife is getting tired so she goes to sleep. How could she go to sleep at a time like this!? Some trip sitter she is! Its OK, I guess. If things start to go real bad, I could wake her up. And at this point I probably need to be alone anyway. I'm pretty much immobilized by now. I don't really have much awareness of my body aside from the rubbing of my feet and hands against each other. Feels pretty good. I'll be doing this for the next few hours. \r\n11:30 (T+5:00) At this point Im little more than a twitching, writhing (but quiet) mess on the bed next to my sleeping wife. This is where things get really weird. This is where my ego dissolves, reconstitutes.. and dissolves again. The effects are coming in waves (again, similar to MDMA). I can feel the waves moving through my body. My body even moves with the waves to some extent. At the crest of the waves, I'm not conscious of who\r\nor what I am. Consciousness flows through each individual cell of my body. I experience what it is like to be a skin cell, a nerve cell, a muscle cell, etc. And I periodically experience a sensation of annoyance that I have to be the consciousness of 'this guy' again.  This is between waves. \r\n12:30 (T+6:00) I've 'died' so many times over by this point that I cannot keep track. I experience what it must be like to be anyone else in space and time. If I think of a person or type of person, I'm there. I experience every yearning. Every desire. Every passion. And even then it just feels like the tip of the iceberg. I understand why people put themselves through the torture they do. It is about living. It is about experiencing every possible point of view imaginable no matter how painful it is.  So much happens that is just beyond words. I'm just laying here in awe of it all. Not judging it. Just saying 'Wow' quietly over and over again. \r\n1:30AM (T+7:00) It is strange, I never even think to close my eyes and see how the CEVs are or anything like that. My eyes are just plastered open as I stare awestruck at beautiful patterns morphing across the stucko(?) ceiling. It is a chore to blink. I only do so because I think I should. I'm feeling pretty calm by this point and a little exhausted, but the waves keep coming. During one of the lulls, I get myself together enough to move to the living room for a break from the bedroom visions. I find that the easiest way to change my mood/visions is to simply move to another room. I also have a little more control over where my mind goes. If the visions get too grissly, I shift to something else. I'm past the 'ego dissolusion' stage now.  \r\n2:30AM (T+8:00) Still going pretty strong. I consider going outside, but guess that it might be a bad idea. Probably would have done me good, but oh well. I 'discover' the screensaver on my computer and stare in awe at that for some time. I've never had such a visual trip before!\r\n4:00AM (T+9:30) Coming down. Still feeling 'out of it' but I can\r\nalmost read a book now. I take out a book of Kurt Vonnegut short stories and try reading. I can make sense of it, but I can't focus well. The words are moving too fast. ;-) I try waking the wife to tell her about the trip so far but she doesn't seem too interested in being woken. What would I say, anyway, besides 'Wow!' ?\r\nLater that morning I finally got something to eat. Tasted pretty good. I was surprised that I didn't have much of a hangover. I had a slight headache, but a couple aspirin took care of that. All in all it was a worthwhile experience even if it was more than I had bargained for. If I had it to do over again, I probably wouldn't have eaten all the capsules. I didn't realize how fasting would intensify the effects.\n\n\n"
}