{
 "title": "Extra-Spacial Dimensions",
 "author": "Dreamtripper (J)",
 "citation": "   Dreamtripper (J). \"Extra-Spacial Dimensions: experience with Salvia divinorum (10x extract) (ID 51966)\". Erowid.org. Jul 21, 2008. erowid.org/exp/51966",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "51966",
   "Male",
   " ",
   "Not Given",
   "Jul 21, 2008",
   "Views: 2499",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off I must give some back ground info into the situation. A friend T, whom I had used psychedelics such as psilocybin, LSA, salvia plain leafs and extracts, and of course our everyday ally, cannabis, and I had planned on smoking some salvia 10 times leaf in a park nearby. The sun was shining and the trees surrounding the area add a nice texture to the setting. Most of my previous salvinorin A trips had consisted of a rapid come up after exhaling into a strange seemingly extra-dimensional spacial area existing directly within the parameters of our ordinary day to day spacial arena. Objects side by side will begin to move, or rotate, at 90 degree angles to each other, making room for the extra dimensional objects that usually dont seem to inhabit the space.</p><p>Within this extra-spacial arena entities are usually perceived and occasionally communicated with via telepathic phenomenon. Both T and I have confirmed this in many of our previous salvinorin experiences, however we have no insight into it's mechanism. Another entity, much more pronounced, seemingly very wise in character and archaic in nature will make HERself present. She seems to encompass all, make take on may forms, I once smoked and slowly became a giant ferris wheel-like object, who then began to speak to me telepathically, and I knew it was her, and to me appears very nurturing and almost grandmother like in nature. I accept that she is who the mazatecs may refer to as ska pastora, or Lady salvia to others.</p><p>Now that I have givin some insight into my past experiences I will tell you that this one was very ordinary in comparison to my others in a sense, in that I only contacted one entity, which appeared to me humanoid in form, whereas other salvia entities are much more alien and extra-dimensional like. In another sense this one was much stranger in that I seemed to transcend even the extra physical dimensions that become apparent.</p><p>I packed about 1 full bowl of the salvia into the bong and took the hit. I believe that I took all the smoke in one hit and just held it. Now I must have konked right out unconscious because the next thing I remembered is was floating somewhere out into space, complete with galaxies and stars and clusters and the those pretty things that come along with it. Directly in front of me theres this portal, like a wormhole, straight outta sliders or something, and theres other worlds just whizzing by the entrance to this thing, and I get this feeling that I could just fly through into any one of these places and be transported there. But I dont.</p><p>I look to my right, about three to 5 feet beside me and theres this ancient looking wizard-like man just floating there, and I know that he there for me. I want to know how I can come back to this place to explore, and then he speaks to me in thought and tells me that its always been here right inside each of us. Each and every one of us contains the mechanism for spirit travel, we just dont pay attention. Then for some reason I look behind myself about 10-15 feet behind me and I see this other doorway, like a rip in space shaped like the outline of my own body, and inside of this portal I can see my own reality, with T sitting a beside me holding the bong staring at me as if waiting for a response. This seemed to break some sort of trance that I had been in and I thought I could stick my head through the portal can call T to come on in and join me in this other place. As I stuck my head through I was instantaneously snapped back into my body, my full conciousness now with me but with the memory of the trip intact as well.</p><p>I have since the experience come across various websites depicting pictures of the appearance of the so called lemurians. The first time I saw one of these pictures I was shocked as it resembled this humanoid, at least in the cloths it wore and its long grey beard, greatly. However I make no assumptions as I have also described this being to other people as Gandalf like as well.</p>"
}
