{
 "title": "Demons Until I Passed the Looking Glass",
 "author": "Vivid",
 "citation": "Citation:   Vivid. \"Demons Until I Passed the Looking Glass: experience with Mushrooms - P. cubensis (ID 51971)\". Erowid.org. Feb 5, 2008. erowid.org/exp/51971",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 51971",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 5, 2008",
   "Views: 3359",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI want to begin this post trip report by saying that I spent two hours contemplating my state of mind before finally deciding to take these.  My life has been very complicated the last few months and I wasn't sure that I was completely stable.  One type of person I have almost no respect for are those who abuse drugs and see them only as a form of minor amusement.  Although I have never taken mushrooms before, I understand that psychadelics are powerful tools and should be given the utmost respect.  The moment I decided that I would go through with the trip, many positive things happened that, although mostly silly, boosted my confidence in myself and gave me a feeling of safety.\r\nMy roommate and I recently tried to trip on an LSA extraction and the effects on my digestive system were less than pleasant.  I heard that mushrooms also do a number on the digestive tract so I tried to take as many precautions as possible to avoid discomfort.  Online reports suggested that a tea infusion often helps with nausea so I decided to try that method instead of simply eating them.  I was talking with a friend over aim and commenting on how it was unfortunate that I had nothing to help settle my stomach.  After I said that, I went into the kitchen, and to my surprise, I see an odd chinese candy sitting on the counter with a picture of a ginger on it.  This was the first minor thing that made me feel comfortable with the idea of tripping.\r\nAs I began boiling water, I carefully selected an hour and a half worth of music to play, mixing in some soft music with some songs that I consider essential for tripping (Radiohead, how I love thee).  When the water was finished boiling, I poured the mushrooms into a cup and poured water over them.  Now here, I think it is important to note that I made a total stoner move and forgot to cut/grind the mushrooms in any way.  I was completely unaware of my error and let the tea stew while I continued my pre-trip preparations.  After ten minutes, I strained the tea and prepared a second glass (still with whole mushrooms, I had yet to notice).  I put two sugar rock candies in the tea and took it to my room to sip on.\r\nAbout halfway through the first cup, I began to experience a light feeling in my body.  I wasn't sure if the tea was actually having an effect or if it was simply a placebo.  When I finished with the first cup, I realized that the tea was definitely having some effect, although it was very mild.  When I went to strain the second cup of tea, I finally realized my error.  I strained out the second cup of tea anyway, cut the mushrooms, and let my third cup sit, thinking I would come back to it later.  Tea prep guides I had read told me to have two cups and then save the third for an hour later, but I figured I could just take three since the first two probably wouldn't be that potent.\r\nHalfway through the second cup, I noticed my vision tracing was being altered in a subtle but noticeable way.  Here, Radiohead's Everything in its Right Place came on.  This song has a lot of meaning for me and is an immense comfort to me while I trip.  At this point, I was positive I was being protected by some higher force and that this night would go well.  During this entire time, I had my notepad with me, recording observations.  After noticing the 'subtle' vision changes, it was a downhill spiral into Wonderland for the next I don't know how long.\r\nTo give you an idea, here's what I wrote in my notepad:\r\n1:20 'Vision tracing changes, subtle but noticeavle'\r\n1:25 'Having difficulty maintaining sobriety'\r\n1:27 'Oh my God, the words I'm writing down are moving'\r\n1:30 'Complete vision distortion, everything is moving as if it were alive.  Visions even with my eyes closed'\r\n1:35 'Auditory DEMONS'\r\nAnd then writing became too much of a task.  I'm not sure how much time I spent in this odd hallucinatory world, but let me try to explain what happened.  I was definitely uncomfortable throughout the first hour after taking the tea, mostly mental discomfort.  I kept trying to search for a moment in which I could return to sobriety and think clearly for a moment, but everywhere I turned was something else to trip out to.   I went to the bathroom to wash my hands and face, and I noticed my hands would just not stay the same size.  It felt kind of like when I look at something through hot air or during a dream where everything is wavy and doesn't maintain its shape.  The 'wood' pattern on the door was also shifting like liquid and a painting of flowers I have hung up in my room seemed like it was dancing.\r\nAnnoyed that I couldn't maintain a sober state, I tried to lie down on my bed and center myself.  Lying on my back, I look up at my ceiling which is covered in asbestos and it began to move in waves, forming all sorts of patterns.  I tried to reach for my notebook again but as I tried to write, I kept losing focus and little movements from the corner of my eye distracted me too much to get anything else down on paper.  At about this time, the body load hit me full on and I began to feel heavy and weighted whenever I tried to stay upright.  I lied face down in my bead, tired of the moving ceiling, and buried my head in my pillow.  I noticed that I was incredibly disconnected from my body when I was relaxed.  The only parts of my body I was aware of were those that were flexed.  I tried to keep my body flexed for a bit, trying to hold onto my physical form but it was too awkward, as I could not flex my body all at once and it felt as if I were just a collection of disconnected parts.\r\nMusic definitely effected my mood drastically.  A sad song made me cry.  Radiohead's Paranoid Android was... intense.  I can't really describe it.  Up to this moment, I found the trip very unpleasant, although definitely nowhere along the lines of a 'bad trip.'  I was not overly anxious or fearful and I still held faithfully to the idea that I was protected from harm.  Eventually, I finally gave in and relaxed my entire body, letting go of my physical form and losing myself to the images my mind was creating on my closed eyes.  From this point on, my trip took a turn for the better.  \r\nWith my eyes closed, I saw all sorts of odd patterns, although the strangest of which were what I thought were smiling faces that darted in and out of my perception.  Their smiles reminded me of the Cheshire Cat from Alice in Wonderland.  It was creepy to say the least and bothered me much more when I was trying to maintain sobriety, but at this point I was no longer uncomfortable with the situation.  For the next 20 minutes, it felt as if there were demons all over me.  I had strange auditory hallucinations of things laughing at me mischieviously and more images of strange half-formed faces and movements in the corner of my eye, but I found myself calm and unafraid.  I was completely at home with the demons that, although, taunting me, I knew would not dare to actually touch me or enter my mind.  It was a strangely empowering experience.  In control of my mind again (kind of... in that shroomy kind of way) I was overcome by a sense of curiosity and mischief.  I turned out the lights and stood in the dark, watching the lights flicker and calmly waiting for something else to appear in my vision.  Although my vision was still shroomy and the lights weren't exactly holding still, no more faces or odd lights came at me.\r\nAnd then came an overpowering need to babble ad-lib poetry in the dark.  I got on my computer to start writing down what I was thinking, excited that the shrooms had come to a point of creativity.  I opened notepad and typed a few lines.  Then I typed a few more.  And I couldn't stop.  What was meant to be a few lines to be remember in the morning turned into a long, rambling, part-poetic, part-inner dialogue, part-complete nonsense.  This is the part of the trip that I found most fulfilling.  In retrospect, I see that I took these because I was immensely curious as to the inner workings of my mind that was clouded to me due to barriers that I had put up that even I could no longer see through.  I made some incredible realizations.\r\nIt was my roommate's birthday.  He's probably the best roommate I could possibly have hoped for.  I tried to call him about 15 times that night and never got through.  I realized how much I appreciated my friends and family and all the people who take care of me.  At one point, I was crying because I couldn't go up to my parents room and tell them that I loved them (well I could have, but it was like 3:30 AM and I was still tripping balls).  I found myself constantly at a crossroads.  Every decision I made seemed so amazingly important.  The Garden of Forking Paths.  Every moment was so precious and there was so much wonder and beauty and sadness wrapped in every little thing I did.  Wonder and excitement at seeing where a path would take me, beauty in how amazing it was to be alive and thinking, sadness in that I had to abandon an infinite number of alternatives to chase an infinite more ahead of me.  The thought reminded me again of Alice in Wonderland, and I analogized choosing a path and chasing it with chasing a white rabbit.\r\nThe rest of the night, I'm not that interested in sharing.  I continued to freewrite and even got on aim to cause a little mischief and engage in interesting conversation with some friends.  It was odd because I felt very strangely rational, although I was obviously not in a 'sober' frame of mind.  I eventually went to bed, where I laid with my eyes closed, although it didn't seem to make a difference whether they were open or closed.  My mind was racing and I wasn't sure I would be able to sleep.  To be honest, it didn't feel like I slept much at all.  Reality and dreams were pretty intermingled as some strange images (much more controlled and artistic) still came into my mind and I remember thinking it was a pity that I was not an artist.  All in all, a great experience, even the discomfort in the beginning was strangely fun.\r\n-----------------------\r\nIf I tell this story\r\nIt seems very lame\r\nBut I can show you this glory\r\nIt all sounds the same\r\nI feel like a rabbit\r\nMischevous\r\nYet tame\r\nSo much to see\r\nFeels like I can't stop\r\nWhatever I'm doing...\r\nDear Mr Rabbit\r\nWhere are you taking me?\r\nIs it time for good night?\r\nOr do I continue this flight?\r\nWhite rabbit white rabbit\r\nI follow\r\nI flow\r\nSo sad\r\nSo happy\r\nSo beautiful\r\nIt's oh so important\r\nThat we know how to be sad\r\nBut I want to be happy\r\nA Dilemma\r\nMr Rabbit\r\nAnd I know\r\nOf course it is cold\r\nThis loss of control\r\nDemons abound\r\nGoodbye Mr Rabbit\r\nI'll see you around\n\n\n"
}