{
 "title": "Getting Caught Up",
 "author": "Mindsurfer",
 "citation": "   Mindsurfer. \"Getting Caught Up: experience with Tramadol (ID 51987)\". Erowid.org. Jun 26, 2007. erowid.org/exp/51987",
 "substance": "Tramadol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 51987",
   "Male",
   " ",
   "Not Given",
   "Jun 26, 2007",
   "Views: 6220",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experience with substances: alcohol, tobacco, marijuana, mdma/ecstasy, cocaine, various opiates</p><p>How I started taking the non-opiate tramadol, a friend had a script for it, gave me some.  I took 150mgs (3 pills) and felt the general opiate feeling within an hour or so - very close to Tylenol 3s or vicodins or darvocets but not as intense as percocets.  However, it lasted up to 8-10 hours.  A lot longer than other opiates.  </p><p>At first, I felt overall feeling of control over the use of it; took 2 or 3 to relax.  Then, I would stop for a few days, no problem.  Over the weeks, I would continue taking tram more often and as tolerance increased, I took anywhere from 400 to 800mgs.  The feeling of control started to get a bit dim.</p><p>Once, Ive quit it cold turkey from 400mgs down to 0  ran out.  Feeling of fatigue, slight headache, and quite severe depression hit me over the next 3 days or so.  Then, I felt better.  Of course, small doses of authentic opiates helped to get me through the dim days.  Sometimes I would get drunk to get through the couple of days of feeling down.  And the frequent naps helped, too.</p><p>I found an interesting thing about tram as time went on.  As the first feelings of withdrawal were noticed, if I only took 50mgs, I felt good again after an hour or so (even though I could be taking 350mgs a day before).  I assume it messes with serotonin levels a bit and therefore the depressive episodes.  In small doses of 50-100mgs, it acts more like an anti-depressant than opiate.  Very talkative and friendly.</p><p>Although a prescription is required for ultram/generic tramadol, I was able to get it through an online pharmacy after filling out a survey.  I guess they thought my back really hurt, since thats what I wrote in there, huh?!  A personal, online, drug dealer  just click order now.  All for about a buck a pill.</p>"
}
