{
 "title": "I Lost Control",
 "author": "Tebrawler",
 "citation": "   Tebrawler. \"I Lost Control: experience with LSD, Hydrocodone & Ketamine (ID 52002)\". Erowid.org. Nov 26, 2009. erowid.org/exp/52002",
 "substance": "LSD, Hydrocodone & Ketamine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 6:00",
   "30 mg",
   "oral",
   "Hydrocodone",
   "(liquid)",
   "  T+ 6:00",
   "20 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52002",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 26, 2009",
   "Views: 9384",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have tried just about 'everything' in the past 2 years from Cannibis to Datura and Heroin. I have never lost control of myself while under the influence. However this night was nothing like before.<br>I had just gotten into town and called up a really good friend of mine to find some Acid. We showed up at his distributers house where he handed us 3 vials of acid which still had a ton of LSD left in them. We both took the droppers and cleaned the vials. About 5 minutes later we took the vials and rinsed them with non-chlorinated water. We rinsed them about 3 times until we couldn't taste the sweetness of the alchohol it was cut with, leaving nothing left.<br>We probably ingested about 30 hits each of LSD total, then we said our farewells and headed back to my friends house. Now about 15 minutes after taking this LSD we were already starting to feel it which was obvious we were going to be fucked. We were rising and rising on the plateau of inebriation and about 3 hours have passed and we are STILL rising, feeling super energetic, unable to complete simple tasks, and hallucinating like I have never experienced before.<br>We went outside for a little bit where it was raining, and I would look at the sidewalk and notice that flowers of such vibrant and beautiful colors were growing and breathing. There were so many patterns and confusion from the LSD I would forget where I was. The 'trails' I was experiencing were lasting about 30-40 seconds. I constantly heard techno-industrial music playing but it was dead silent except for the rain pouring down on us. I must say being outside in the rain on LSD was one of the greatest experiences I have ever had. I have never had so many visual and audio hallucinations in my life. I could feel the bass of the non-existent music. I could touch and smell the non-existent flowers growing out of cement. The only downside at this point was that me and my friend were completely, and utterly retarded.<br>We ended up going back inside and listened to some music, put on the blacklight and he gave me a light show. The lights were so bright and loud, yes LOUD. I could taste the blues and greens and when the turned the light and music off... everything was dead silent. After a few hours we ended going back to his distributers house where he had just got a new shipment of Ketamine.<br>I was probably 6 hours into this LSD trip from outer space and still I did not level off. My energy and mentral frustration kept building up. When we arrived at his house I grabbed the bottle of liquid Hydrocodone I had and took 2 tablespoons (30mg Hydrocodone, can't recall the amount of acetaminophan). About 10 minutes later I could feel the hydrocodone kicking in.... at which point I noticed I could not even walk.<br>One of the guys at the house just cooked up a vial of Anesket. It was high powered ketamine that was used to tranquilize Horses and even Rhino's (as labeled on the bottle). He came by with a blaster-vial and measured out about 20mg of ketamine and told me to snort it. Immediatly after I snorted it my head hit the table and I passed out.<br>-----------------------------------------------------------------<br>Everything from this point on is what I was told by my friend which most likely saved my life during this whole ordeal. He did not consume anything else at the distributers house besides water as he was frying pretty hard from the LSD.<br>-----------------------------------------------------------------<br>After I passed out I woke up and threw up all over myself, He said that I could not walk or stop vomiting. It was obvious that I had overdosed and was in a tranquilized state of nauseousness. I was heaving so much that I passed out several times more because. I myself can remember some of this, but my concious state of mind had no control. My mind literally recoiled in horror and watched itself as my body began to shut itself down. This was horrifying because I could think but not do anything while my subconcious took over in a fight for survival.<br>I passed out on the linolium floor which I had threw up all over and once my friend realized that I was utterly fucked... he decided to get me out of this drug-distributors house as it was not a safe place to be. He carried me back to his car where I would be nodding in and out of conciousness in an endless state of nausea and vomitting. He drove us both back to his house where I spent the rest of the night on his floor with him force-feeding me water so I wouldn't get too dehydrated from all the vomitting. He talked to me all night and I gradually started to snap out of the ketamine. I started to come to at around 9 am.<br>-----------------------------------------------------------------<br>My previous encounters with ketamine have never lasted that long or tranquilized me that badly. It is obvious that the mixture of the Hydrocodone and LSD made it VERY intense. I to this day cannot thank my friend enough for taking care of me during this. I will not mix LSD and Ketamine together again, as they strongly reacted with each other and overdose in my situation was present. Me and my friend were still feeling the effects of the LSD probably up until the next week.\n\n\n"
}
