{
 "title": "I was the singularity...",
 "author": "Unckie D",
 "citation": "   Unckie D. \"I was the singularity...: experience with 5-MeO-DMT (ID 5200)\". Erowid.org. Mar 2, 2001. erowid.org/exp/5200",
 "substance": "5-MeO-DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5200",
   "Male",
   " ",
   "Not Given",
   "Mar 2, 2001",
   "Views: 13923",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n...and the singularity was me.</p><p>I had the misfortune of obtaining 250 mg of 5-MEO-DMT.  It arrived a few days ago, and I sat on it partly because I wanted to save it and partly because I was afraid of it.  Anyway, yesterday my girlfriend and I went out for a Valentine's Day dinner, during which we drank a pitcher of beer and after which we split a bottle of sparkling wine.  The alcohol gave me the courage I needed to strap on my silly boots and step into the terrifying white glare of 5-MEO-DMT.</p><p>I placed a small amount (perhaps half the size of match head, or even less) in a pipe which had some ash and a little bit of pot in it.  After another shot of courage, I lit it up and inhaled the smoke.  Contrary to other reports, the smoke didn't seem harsh at all to me.  By the time I finished exhaling (the smoke was disturbingly white, but perhaps that was just my perception), I was feeling the effects, which built up gradually and smoothly over the next 30 seconds or so.  This drug, in my opinion, is not at all like acid or mushrooms.  There were no visuals, no strange conceptions, no euphoria, no paranoia.  Just a healthy sized mindfuck.  This was definitely the most powerful drug I had ever done, but I was able to control the experience and enjoy it.  I basically said 'holy fucking shit' over and over.  My girlfriend kept asking me what it was like, but I found it was impossible to describe.  I was just 'fucked up'.  I felt moderate nausea halfway through the trip, but it wasn't too unsettling.  Ten minutes after smoking it I was functional again, and 25 minutes after smoking I was pretty much back to normal.</p><p>So, after awhile, I decided to double the dose and take another ride.  That was a mistake.</p><p>I put what I thought was twice as much in my pipe as before...if I had to guess I'd say 30 mg, but who knows.  I smoked it and as I exhaled I noticed an ungodly amount of white smoke coming out of my face.  At this point I started to think I was in trouble.  I started telling my girlfriend I did too much and that I was dying, but at that point I still thought I was a clever little man.  It continued to get more intense exponentially...each second the experience was 10 times more intense than the previous second.  </p><p>At this point my memory of what happened in the real world gets fuzzy.  I curled up in the fetal position on the floor and start screaming that I was dying.  My girlfriend came over to me (I don't really remember this) and tried to help me or comfort me but the trip kept getting stronger.  Pretty soon I was just howling.  I threw my girlfriend off of me and started destroying things in my apartment...my stereo, my VCR, windows, wine bottles, etc.  My girlfriend ran for help from some neighbors who are good friends of ours.</p><p>I have no recollection of trashing my apartment, but I do remember what I felt like at the time...sort of.  It was as if the whole universe (with me in it of course) had collapsed into a single point which had no volume or mass.  Since this point was all that existed, time, which is a sequence of events, could no longer exist because there were no events...just the singularity.  I don't want to abuse a mathematical term I don't entirely understand, but that's as close as I can come to describing it.  It was terrifying.  I had no coherent thoughts because such things can't exist in a singularity.  The singularity was all there had ever been, all there was, and all there would ever be...there was no universe.</p><p>A short time after my girlfriend left to get help my friend came in.  He has some experience in these matters, so he handled it very well.  By this time I was coming down, still wandering around and bumping into things a little.  Pretty soon I was back on planet Earth and was surveying the damage I had done.  I later found out there were some other neighbors suggesting a call to 911 but luckily that didn't happen.  Today I have a lot of minor cuts and bruises, a trashed apartment, and I cashed in a lot of chips with my girlfriend.  But it could have been worse.</p><p>This stuff is not a toy.  I suggest you don't do it, but if you do make sure that:</p><p>  1.) You have a couple of sitters who are bigger than you.</p><p>  2.) You do it in a room without anything too valuable.</p><p>  3.) There are no weapons of any kind within easy access.</p><p>  4.) More that one person should never do this at once.  It could</p><p>      easily result in deaths.</p><p>I know some people have had good experiences with 5-MEO-DMT, mine was horrible and I won't do it again.  Some drugs take you to strange places in the universe, good and bad.  This drug crumpled up my universe, my mind and my soul along with it.  Be careful.</p>"
}
