{
 "title": "Tingling Goodness",
 "author": "Don",
 "citation": "Citation:   Don. \"Tingling Goodness: experience with Ephedrine &  Cannabis (ID 52016)\". Erowid.org. Dec 26, 2007. erowid.org/exp/52016",
 "substance": "Ephedrine &  Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "  T+ 0:00",
   "4 capsls",
   "insufflated",
   "Ephedrine",
   "(capsule)",
   "  T+ 0:30",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:00",
   "3 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "1 capsl",
   "oral",
   "Ephedrine",
   "(capsule)",
   "  T+ 2:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52016",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 26, 2007",
   "Views: 9296",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n11:00\r\nPicked up a baggy of 15 with a friend of mine from the gas station. We got home and popped four right away after trying one in a line, which burned. It wasn't like extremely painfull, but it was uncomfortable enough to not want to take more lines.\r\nI was feeling tweaky after about 25 minutes. We proceeded to smoke a couple of J's to blow some time and the stoned\\hyper-tweaked combo was real nice. We left to go to a party and the music sounded great in the car. We put the windows down and the air blowing through our hair just felt amazing. We described it at the time as a whole body tingling high with touch\\feel becoming much more sensitive. Rubbing our hands through our hair for instance was a strange yet extremely cool feeling. \r\nWe got to the party and smoked 3 more J's, Still feeling good. At around 1:00 am I took another Ephy and smoked a real stoggey of a blunt, like 4 grams, with some people. From 2am to 4-5am I felt very relaxed yet mentally aware and sharp. I had a pulsing wave like sensation through my whole body. Like I could feel every muscle, It was deffinetly enjoyable.\r\nThe next morning after about 5 hours of sleep we woke up and were unable to get back to sleep. Probably some effect of the Ephedrine. I didn't have any hangover effects besides waking up about 6 hours earlier then usual.\r\nGood stuff. I just popped two more.\n\n\n"
}