{
 "title": "Shadow People and My Disappearing Girlfriend",
 "author": "Charbroiled",
 "citation": "   Charbroiled. \"Shadow People and My Disappearing Girlfriend: experience with Diphenhydramine (Benadryl) (ID 52042)\". Erowid.org. Jun 20, 2007. erowid.org/exp/52042",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "20 tablets",
   "oral",
   "Diphenhydramine"
  ]
 ],
 "footer": [
  [
   "2006",
   "52042",
   "Male",
   " ",
   "Not Given",
   "Jun 20, 2007",
   "8166",
   " "
  ]
 ],
 "report": "<p>It was Friday night, I wasnt with my friends and I didnt have anything to mess me up. I bought a couple of boxes of Benadryl and downed 20 of the little pills. I sat back and awaited the trip. I thought I was ready for hallucinations both visual and auditory. I was wrong. God was I ever wrong</p><p>These are the order in which to the best of my knowledge the advents occurred.</p><p>8:00pm-Take 20 Benadryl with a Mt.Dew. I have a good atmosphere Im at home alone with a positive mind set, this was gonna be great I thought to my self</p><p>9:10pm-Start to get a warm feeling in my legs and I knew what was coming. I just relaxed and let the drug do its work.</p><p>9:14pm-I had to piss like a Russian Race Horse so I got up and my body felt like it weighed a ton, while walking to the bathroom I saw ripples out of the corner of my eyes. I will admit it was pretty cool seeing things.</p><p>9:30pm-Dont know what happened in those 30 mins but somehow I got from the bathroom to my bedroom, things start to get scary it looks like my room is rippling, scary but still somehow neat.</p><p>9:55pm-I was sitting there thinking about how bad I wanted a cig when all at once I heard my name. I looked up and there was nobody there this creeped me out. </p><p>10:00pm-I wanted to go to bed, but every time I closed my eyes I would hear scratching sounds that seemed to omit from every corner in my room, several times I opened my eyes to see a shadow of a man slither across my walls, I was terrified at this point, my heart started beating rather heavily(calm down man its not real I told myself, but for some reason I couldnt comprehend this)</p><p>11:00pm-I had taken a nap but was still plagued by the scratching noises which turned to hisses, and shadows, I believed I peaked at this point, when all of a sudden everything was way better for no apparent reason, I still felt heavy very very heavy but all of the sudden I was at peace.</p><p>11:17pm-I heard another voice call my name this time I knew the voice it was my girlfriends this calmed me.</p><p>12-1am-I slept off and on but I continued to hear well call her K say my name</p><p>1:49am-(this is the best part of the trip and the only real thing I enjoyed)I heard K again This time I lifted up out of bed and she was on my bean-bag in the floor, I had an actual conversation with her, I cant remember what we talked about this one lasted for several mins finally she said 'Well I love you see you in the mourning' which I replied to saying, Ok, and when I got out of bed to give her a hug and kiss goodbye she just evaporated.(I somehow forgot I was tripping balls and she was real)</p><p>1:57pm-feel good inside I sleep for the rest of the night I awoke at 10:00am and went to pick up K.</p><p>All in All I wouldnt suggest this It was a very scary trip. Benadryl gave me the worse cotton mouth I have ever experienced, thats about it</p>"
}
