{
 "title": "Best Lollipop Ever",
 "author": "First Timer",
 "citation": "   First Timer. \"Best Lollipop Ever: experience with Fentanyl & Cannabis (ID 52055)\". Erowid.org. Mar 21, 2010. erowid.org/exp/52055",
 "substance": "Fentanyl & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "800 ug",
   "oral",
   "Pharms - Fentanyl",
   "(cookie / food)",
   "  T+ 2:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52055",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 21, 2010",
   "Views: 11444",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Tonight I enjoyed an 800 mcg fentanyl lollipop I recently acquired from a friend.  I had no idea what to expect, because I have never experimented with Opiates - not even Vicodin.  I've been a daily pot-smoker for 3 yrs. now and had not been smoking when I ate the lollipop.  Heres a summary</p><p>I began feeling effects about 15 minutes after letting the berry-flavored lollipop sit between my gums and cheek.  It was mostly a slightly warm feeling in my head it was kind of hard to see straight.  I stood up and walked into my living room.  I felt kind of wobbly and I was still working on the lollipop.  It took me about an hour to finish the lollipop, and by the time I did I was feeling warm all over.  I just sat and listened to reggae music.  I thought to myself This drug is no big deal I just feel a little high, thats all.  Soon I noticed certain noises around my house kept catching my attention more than usual.  At one point I thought I heard a mouse crawling around in my kitchen (paranoia maybe?). I got up and walked around a little bit.  I noticed I felt more euphoric, like I was really happy about something.</p><p>I sat down more and when I did, I could hardly keep my eyes open.  I dont know why, I wasnt tired but for some reason I just could NOT keep my eyes open.  That lasted maybe 15 mins and thats when I started feeling really excellent!  Rushes of energy going through my veins for about 30-45 mins.  It peaked with a 5-10 minute period of absolute bliss I had a happiness compared to when MDMA first hits me.</p><p>But then suddenly I could feel the incredible high coming to a slow.  I have done E about 10 times before and Im used to the climax at the beginning of a 4-6 hr. trip.  However with Fentanyl, I found it very odd that it was such a lengthy buildup and the climax of the high is closer the end of the trip.  Total time of the Fentanyl experience was approx 2 ½ hrs.</p><p>The come down was yucky but short-lived.  I felt kinda poisoned in the limbs and had about 5 minutes of nausea and shakiness.  I smoked a bowl and that helped a lot with the come down.  In fact, the weed brought the high back temporarily and eased the come down process.  Now it has been 3 hrs. since I took it and I feel pretty normal other than being a little tired.</p>"
}
