{
 "title": "The Catalyst",
 "author": "Reel Big Mike",
 "citation": "   Reel Big Mike. \"The Catalyst: experience with Syrian Rue & Cannabis (ID 52096)\". Erowid.org. Oct 2, 2007. erowid.org/exp/52096",
 "substance": "Syrian Rue & Cannabis",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "8.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52096",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 2, 2007",
   "Views: 23120",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having used Syrian rue twice in the past to potentiate morning glories, once to amazing effect, I decided that I wouldn't be much of a psychonaut if I didn't bare the taste and consume some by itself just once for explorations sake. Not exploring the world in a totally new way like on LSA, or mescaline, but more like exploring my (mostly) sober mind to it's fullest.</p><p>Mindset was curious with a slight apprehension to the purge and what the effect would be in general, but overall mood was relaxed and ready to try something new. At around 1 PM, I ate only a handful of grapes and some water and then dosed on approxamately 8 grams of Syrian rue that I powdered in my coffee grinder. Right after eating the rue, I had some more grapes as I've noticed that just a handful of grapes not only completely covers up the taste of the rue, but also seems to stop nausea completely. After waiting only about 15 minutes after dosing, I decided to take a walk to some nearby woods.</p><p>I walked into the woods and then sat for a while on some cinderblocks while the rue was taking effect. I then got up and continued walking until I came to a small abandoned campsite and waited around for a little while. At this point it was about 1:45 PM, 45 mins after dosing, and I could notice my peripheral vision acting up and the type of 'new' looking vision that accompanies most psychedelics. I also heard a distinct buzz that seemed to be formed from the ambient noise around me. After trying and failing to puke, (my stomach doesn't seem to give up on things until it is through with them) I gave up and walked home. </p><p>By the time I got home I was quite warm, and although wasn't even close to tripping, felt a similar psychedelic headspace, which was interesting to note because although I had some erratic wacky thoughts, my logic and awareness was fully intact. This was around 2:15 PM. I walked upstairs and instantly took my sweatshirt and pants off because I was very warm and uncomfortable. My blood pressure felt rather high and my whole body seemed to buzz with this energy. Oh I should also note that I walked worse than if I were drunk. I could feel my equilibrium totally out of balance, and with eyes closed I could feel my body spinning both horizontally and vertically, although not uncomfortable as with alcohol. My body was jittery and somewhat weak, but if I layed down, I didn't feel dizzy and if I closed my eyes, the uncomfortable buzzing and heaviness felt rather light and energetic. The most important point was that there was no euphoria as with most trip drugs, just an opened up sober mind. Overall it was difficult to relax and quite unpleasent, but when my mom left, I purged and felt a bit better. </p><p>After that I layed back down but blacked out for maybe 15-20 minutes and then woke up and was still uncomfortable, so I had my eyes closed a good portion of this whole time laying in my bed. It seemed like I was completely opened up to some information, or perhaps just superheighted creativity, as songs would just flow, and all these insightful ideas that when looked at logically, made sense. It really felt like I was connected to some information consciousness. I must also note that my body didn't really feel like mine or that I needed it. It felt like I was in a just energy laying on the bed with it's eyes closed. From what I've read about astral projection, I have reason to believe that rue could help achieve it. I should mention that my hearing was very sensitive and my ability to visualize and subvocalize was GREATLY enhanced. </p><p>I then decided to help myself to some ganje. Around this time some of my thoughts were insightful while others were somewhat random with minimal difficulty focusing. When I had the weed though, my thoughts became more guided, which is something I've noticed on LSA and mescaline. This whole time from was about 3-6 PM. Now that my thoughts were insightful and more guided I just listened to whatever came to mind. By this time the rue felt very content with the elation of the weed. I could feel my energy and my body moving in strange positions or spinning around real fast. I feel like I learned alot about the capabilities of the sober mind: the awareness of energy and it's use for healing, lucid dreaming, or astral projection.</p><p>I must reiterate that this drug is not euphoric, fun, or recreational, but I think it's a powerful tool to help cultivate contentment and it's great for opening up that reasoning mind a bit more without being confused or distracted by a trip. If you feel you need some insight on something and decide that drugs are actually a way not to learn deep cosmic truths but to open your mind up to a different perscpective on things you already know, syrian rue may give that chance. Kind of like having the thoughts of a trip with a sober mind of reason and logic. Peacefulness.</p>"
}
