{
 "title": "An Erotic Dreamscape",
 "author": "Ghost Rider",
 "citation": "Citation:   Ghost Rider. \"An Erotic Dreamscape: experience with Valerian, Catnip, Passion Flower, Hops & Caffeine (ID 52109)\". Erowid.org. Sep 17, 2009. erowid.org/exp/52109",
 "substance": "Valerian, Catnip, Passion Flower, Hops & Caffeine",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2758 mg",
   "oral",
   "Valerian",
   "(pill / tablet)",
   " ",
   "258 mg",
   "oral",
   "Catnip",
   " ",
   " ",
   "130 mg",
   "oral",
   "Hops",
   " ",
   " ",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52109",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 17, 2009",
   "Views: 10232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have used Kava for years because of it's calming effects but it has recently been pulled from the shelves at GNC centers. \r\nIt was suggested by the sales person that I buy GNC brand Valerian Root gel caps 500 mg per. I also purchased some 'Calmtabs' made by 'Good'n'Natural'. Four tablets per dose consist of: 258 mg Valerian Root, 258 mg Passion Flower, 258 mg Celery Seed, 258 mg Catnip Leaf, 130 mg Hops Flower, 130 mg Dried Orange Peel.\r\nI took 5-500 mg gel caps of the Valerian Root - 2500 mg and 4 tablets (one dose) of the Calmtabs - dosages listed above. Dosage was one hour before bed and I washed it down with a diet mountain dew, so you can add caffeine to that list of materials.\r\n20 minutes after the dose, I felt nothing. A slight sleepiness, but I was tired anyway so I don't know if the dose pushed it or not. I was watching television and already relaxed. I didn't notice any additional relaxation. A disturbing side effect was noticed: When I burped, the taste of valerian root in my breath was really nasty.\r\n1 hour after dosing, I was ready for bed. Sleep came quickly, which isn't unusual for me, but what followed was.\r\nI spent the night in some of the most erotic situations imaginable. The dreams were very realistic and extremely sexual in nature. Multiple partners ranged from women I knew well to women I had never seen. The dreams changed often to new situations but would often return to previous ones. I didn't feel as though I ever entered a deep sleep. I always felt that I was on the verge of awakening, the way you feel when you sleep late and you're half awake but way to comfortable to fully awaken. The intercoarse I had in these dreams seemed more realistic than I have ever noted in any other dreams. The detail of the womens bodies was unbelievable. As if I was extremely familiar with all of them. \r\nThroughout the night I would wake briefly when rolling over. I seemed to toss and turn a lot. Not uncomfortably, but as if I would reposition myself at the onset of each new dream sequence. I noticed that I maintained a full erection for the entire night. Every time I surfaced and repositioned I noticed this. Often, when lying on my side or stomach I would awaken from a particularly erotic dream and find myself slowly simulating intercoarse by gently pushing my erect penis against the mattress with my hips and pelvis. It was as if I were acting out the actions of my dreams. This went on for the entire night. There were no 'nocternal emissions' but I was aware of being fully aroused and only (seemingly) gently asleep for the entire night.\r\nI woke with an erection and the dreams quickly faded. My morning feels perfectly normal. I feel rested and calm, but I can still envision those seemingly endless transformations from one wonderfully erotic situation into another. It was a unique dream experience to say the least.\n\n\n"
}