{
 "title": "Shrooms vs. LSD",
 "author": "Svobodes",
 "citation": "   Svobodes. \"Shrooms vs. LSD: experience with LSD & Mushrooms (ID 52117)\". Erowid.org. Jul 15, 2008. erowid.org/exp/52117",
 "substance": "LSD & Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "LSD",
   " ",
   "  ",
   " ",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2006",
   "52117",
   "Male",
   " ",
   "Not Given",
   "Jul 15, 2008",
   "76185",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The topic of LSD vs. shrooms is common, and I hope to enlighten some by sharing my personal observations.  </p><p>I think that the notion of LSD being 'more intense' is because shrooms are more expensive per dose on the street.  Large doses of either are capable of severely fucking one up.  The drugs' effects are easier to differentiate at lower doses for me, because once I hit a certain point with either drug, proper recollection and scientific comparison is very difficult.  Based on my friends' experiences, I think individual brain chemistry plays a huge role in which drug a person perceives as more intense.  I think given their rumored lower intensity, shorter-acting and more 'natural' effects (a label which is often based on the origin of the chemical instead of the effects themselves), shrooms are more often used in group-nature contexts which, while not necessarily altering perception of one's trip, do contribute to the drug's social reputation, and associatively, its comparison to LSD.  </p><p>People comment most often on shrooms' shorter duration, more 'organic' visuals and often a pattern of internal questioning and attempted answering.  Probably because shrooms leaves the body faster than LSD, I undergo a faster come-down and may feel that I have more cognitive work to do as I enter sobriety.  In other words, I mean that because the sober mindset arrives faster and with less warning, generally users are more occupied with the task of explaining what just happened to their sober self.  </p><p>Likewise, people most often mention LSD's looong duration, more 'artificial' imagery and a buzz of mental activity that is perhaps more readily steered by context.  My friends do not report having 'lost' something as often as with shrooms upon completion of the trip, nor do I.  For me, things seem more stable on LSD, as my effects do not come and go but are fairly constant.  I feel my overall curve as it comes up and goes down, but never individual effects coming and going like on shrooms, 2c-i or MDMA.  In this more stable, drawn-out state I find it easier to think as I have more confidence that changes in my mindset have less to do with the chemical interaction and more with how I am thinking.  That said, this can flip around for me in a second if the context changes (i.e. parents appear).  On one hand, LSD could be said to be more intense because it lasts longer and is more moldable, its intensity mapped to set/setting more.  On the other, shrooms could be said to change faster chemically and leave the user slightly less in-control in the sense that the high curve passes faster.  'Intensity' is subjective.</p><p>For me visually, the drugs both distort surfaces and geometry but in slightly different ways.  Both drugs' visuals will tend to play off the base pattern that you are looking at, so a regularly-spiky ceiling (the kind that pops balloons) may produce sharper concentric patterns while a more organic garage floor will produce more ebbing, rolling distortions in the oil and grime.  When characterizing one's visual character, I think many users try to apply all-encompassing characteristics (i.e. 'shrooms is more root-like, acid is sharper) and do not comment on how both drugs' vast arsenal of visual tricks can only come out by looking at a variety of surfaces.  The fact that each drug produces visuals out of a blueprint image makes comparing them without keeping one surface as control very difficult.</p><p>How do the two drugs treat the same surface?  For me, a spiky ceiling on LSD will produce rapid-moving spikes in various directions while also breathing and changing in brightness, with intermittent waves of the entire spectrum fluttering over all.  On a higher dose, the particles of the ceiling will be swimming around and the entire room will be pulsing in RGB-type color with high contrast.  On shrooms, the same ceiling will likely appear to be dripping and will probably not be altering in brightness or fluttering spectrums of color as much, though there will also be spiky geometry mixed with breathing and ebbing.  On shrooms, my color distortions appear as a blurring of color lines and a crossing of one color into the next, and at higher doses overtones of sepia and primary colors but not with the same relative intensity or range as LSD.  Shrooms plays more with existing colors, LSD injects more of its own.</p><p>Overall to me, the visuals of the two are similar with LSD being more likely to 'pinch' and distort faces, and the color spectrum more apparent.  Shrooms is more rolling in its distortions and subtle in color.  What one sees in the mirror is going to be more-or-less similar, indicative of similar serotonin action and chemical similarity (acid is technically not a tryptamine but is shaped like one).  Their closed-eye capabilities are hard to compare but both are arguably not as powerful in this area as say 2c-i or 2cb.  Which is more 'intense' visually?  I think this is quite subjective as I have heard mixed preferences.   </p><p>I am curious if others have noticed similar visual observations, or whether this has been a product of my subjective reality.  I will never know the exact answer, unfortunately I cannot occupy anothers' brain.</p>"
}
