{
 "title": "A Paradox In Time",
 "author": "G-day420",
 "citation": "   G-day420. \"A Paradox In Time: experience with Inhalants - Gasoline (ID 52174)\". Erowid.org. Jul 24, 2006. erowid.org/exp/52174",
 "substance": "Inhalants - Gasoline",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2005",
   "52174",
   "Male",
   " ",
   "Not Given",
   "Jul 24, 2006",
   "8443",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>It was in the middle of summer and I was bored, I had nothing to do that day so I decided to go huff some gas, no idea how I came to that point. Well here I am, in my shed, opening up my red plastic gas can. I eventually basically shoving my entire nose into the can and begin to inhale. At first I thought this was bullshit, but then I felt a little funny when I got u to leave, so I went back to the gas can. I began to inhale the fumes for another 30 seconds. I think. I lost all track of time in that shed. I remained there, but my mind went elsewhere. After what seemed an eternity, I was thrust into a story about an evil witch who steals souls. The witch some how I assume was the gas can. The gas can sucked the life out of me I guess, and I think my brain or conscious shut down. </p><p>I was left staring at the gas can, not able to move, thinking I was dead and I could do nothing. Of course I snapped out of it. My mind was blown away. I spent probably 5 minutes staring at that gas can, it seemed like a lifetime weirdly enough. I was so tripped out, I wanted to continue. So I did it again. This time, I heard the most peculiar sound. I think it may have been all the ambiance around me (cars, birds, lawnmowers, dogs) and it all combined in to one, perfectly understandable language, I began communicating with the axe in my corner. If my parents ever walked in on me they mustve thought I was crazy, but I dont even know if they did because I was having such a good talk with this axe, no idea what about.</p><p>Then I turn around and I get the feeling I traveled back in time, no idea why. I thought it was the summer before. Then I had one last weird trip. While I inhaled , and stared at the gascan, I felt as though I was transported to another universe, where the zaniest thing is fact. I had another life there, and once again it seemed to be a lifetime, then that evil witch came back and made me think about the inside of me (my soul) about what it is exactly, the witch told me that I was able to do much more, then my soul turned in to another being and left me (my body), and once again I could not move, anything. Couldnt talk, move my eyes, Im surprised I was even breathing. Then  I became aware of what was happening. I locked the door, and ran away from it.</p><p>I have yet to return to m shed. That trip has left a scar on my brain. Figuratively, and literally. I can't ever go back to the way I used to think of myself, the so-called witch made me see the most disturbing thing one man can ever see, his own death, and his own soul. Ill never be the same.</p>"
}
