{
 "title": "Mild Euphoria",
 "author": "The Anarchist",
 "citation": " The Anarchist. \"Mild Euphoria: experience with Morning Glory (Heavenly Blue) (ID 52192)\". Erowid.org. Apr 10, 2007. erowid.org/exp/52192",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Morning Glory",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52192",
   "Male",
   "",
   "Not Given",
   "Apr 10, 2007",
   "3512",
   " "
  ]
 ],
 "report": "<p>I recently decided to try Morning Glories, hoping to achieve a psychedelic experience similar to those reported by LSD, mushroom, and mescaline users.  I went to the local Wal-Mart, purchased four packs of Morning Glory seeds which contained 1.5 g each, went home, pounded the seeds with a hammer to break the shells, poured the crushed seeds into a glass of milk, and drank, at approximately 1:30 pm.  I then returned to normal activities about the house, and waited for the seeds to take effect.</p><p>At around 3:00 pm, I began to feel tired and vaguely happy, for no discernable reason.  These feeling remained throughout the day.  I was slightly disappointed that I experienced no psychedelic effects, especially since the dose I took was deemed to be between medium and strong, and these psychedelic effects were supposed to be fairly pronounced.  Nonetheless, I was very pleased with my experience, and will most likely pursue it again, as I was able to achieve mild euphoria without any noticeable impairment in my capabilities to perform normal tasks, and noticed no decrease in mental capabilities.</p><p>Here is a list of effects that I felt:</p><p>\tMild euphoria for a prolonged period of time (from about 3:00 pm to 12:00 am.). This was accompanied by increased appreciation of humor, and increased interest in matters that I normally find banal.</p><p>\tRelaxation and tiredness.</p><p>\tSlight increase in abnormal thinking.</p><p>\tSlight increase in talkativeness.</p><p>\tMild nausea at the beginning (cured by one sip of Pepto Bismal), mild headache (cured by two Aspirin pills).</p>"
}
