{
 "title": "Dreamy Stone",
 "author": "Lekt",
 "citation": "   Lekt. \"Dreamy Stone: experience with Hydrocodone, Cannabis & Alcohol (ID 52203)\". Erowid.org. Aug 24, 2008. erowid.org/exp/52203",
 "substance": "Hydrocodone, Cannabis & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "4.0 mg",
   "smoked",
   "Hydrocodone",
   "(extract)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52203",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 24, 2008",
   "Views: 30460",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On small college campuses, certain illicit drugs are sometimes difficult to come by.  However, there is always a large supply of pills of various types available to those who know where to go, leftover from surgeries, psychotic episodes, brushes with ADHD and the like.  It was as a result of this that I was given a pill container full of generic Vicodin.  I have had a history of drug use, mostly marijuana, the psychedelics and the occasional pill, but I have never been all that into the opiates in part because I see myself as an addictive personality.  For this reason I sat on those pills, never indulged in them, and instead gave them to friends at their request.  One night, on a drunken whim, I decided to try the pills.  I wasnt too keen on taking a bunch of acetaminophen, so I performed a simple cold water extraction:  </p><p>Two pills of hydrocodone (10mg/750 mg Tylenol, a piece) were crushed into a fine blue powder and stirred into an ounce of boiling water.  After all possible dissolution, the mixture is a green-blue tinged liquid with fine white powder left undissolved at the bottom.  The mixture is cooled to room temperature, and then strained through a coffee filter for 30 minutes.  The liquid is collected; filter and filtrate are discarded.  The liquid is double-boiled for 20 minutes, but as this is a slow way to evaporate water, is removed and placed in the microwave on HIGH for two separate runs and a total of 2.5 minutes.  The amateur chemists performing being somewhat inattentive, the water evaporates off on the second run and the crystals melt and caramelize.  The smell of burnt sugar pervades the room.  After a short cooling period, a brown and white residue remains.  This is scraped from the bottom of the container.  The finished product is about two teaspoons worth of a cream colored fine powder with small candy-like brown fragments.</p><p>I take the product of the extraction and mix it into a spliff, with about .75 grams decent weed and about .1 grams tobacco.  It is sparked and a rotation of ~6 people partakes.  Whether my fault or that of the adulterants, the joint does not stay well-lit, and this method of smoking only is effective if a lighter is applied to the end of the rollie while hitting.  Hence, the joint is cannibalized and the contents placed in a piece.  The smoking session is extremely long: a full bowl that should not have lasted more than ten minutes extends itself for close to an hour.</p><p>The effects of the drug can be felt immediately after taking a pull.  Considering the (only alright) quality of the marijuana mixed with the pharmaceuticals, I subjectively attribute these effects to the Vicodin itself.  The feeling is somewhat similar to just being stoned, except significantly more dreamlike.  A body high accompanies these more mental effects.  Despite what I had expected, I would not describe the feelings as distinctly pleasurable or even numbing.  Mostly I was just relaxed and altered.  As the seemingly never-ending rotation continues, the world becomes more dreamlike.  My thoughts are slightly muddled or confused, and an ethereal quality overtakes the world.  No euphoria, though occasionally I am provoked to more-intense-than-it-should-be laughter.  The intensity of these effects just increases the more I smoke and do not qualitatively change with higher doses.  Eventually, I take to passing on the bowl when it hits me in the rotation.</p><p>Overall, the effects of Vicodin in general, but through this route of administration specifically, were somewhat mundane.  They were not significantly different from marijuana alone to provoke me to use it again.  However, I was definitely the odd man out in that conclusion.  The others who tried the opioid-cannabis mixture were fairly glowing and remarked, I like it, this is fun, or we should do this more often.  It made everyone pretty visibly messed up, and the girls would often dreamily fall backwards into bouts of silence or lapse into silly dribble.  They commented later how relaxed it made them, but everyone sort of agreed, that at least by smoking the drug, it didnt particularly make us want to sleep.  My experience what it was, in contrast with that of the others, I shortly thereafter turned the extent of my hydrocodone supply over to the other involved parties.</p>"
}
