{
 "title": "Freed By The Butterfly",
 "author": "Ripper",
 "citation": "Citation:   Ripper. \"Freed By The Butterfly: experience with Salvia divinorum (20x extract) (ID 52213)\". Erowid.org. Aug 24, 2008. erowid.org/exp/52213",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52213",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 24, 2008",
   "Views: 3205",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I smoked salvia was a very life changing experience, but before I go into that, I'll explain my setting and knowledge of salvia.\r\nThe day before I smoked my friends were telling me all of their experiences their stories seeming unbelievable. They told me to just hold the hit or 'hippy hit it' as we call it, as long as I could. Then they said just stare at something and like read into it, see what it is. That is what I was thinking when I did it.\r\nWe were sitting in a van, we had just purchased a gram of 20x. I went into this with a very clear mindset, I was prepared, is the only way I can think of putting it. The girl next to me took her hit, passed me the pipe, I took my hit, and turned around to stare at the outside. It hit me immediately. The first thing that happened was I looked to my right, and there was a chain link fence. The fence had a very evil feel to it, and when I looked at it the fence began shaking violently, like vibrating almost. So I turned my head.\r\nThere was a butterfly sticker on the window to my right. I just looked at it.  All of a sudden, my body just melted into the seat.  The most vivid part I remember about the melting experience, was feeling my teeth melt out of my body, as if my whole body melted, but I left all things that are solid behind, it was a very alarming feeling. I looked around and was no longer in the van, I had melted into something different, a different world, a different place. The butterfly was being held, by two giant hands.  And the hands were sitting there holding the butterfly. My friends said that I was sitting there silent, then just blurted out 'Why are you holding that butterfly?' As soon as I said those last words, the butterfly took off. And I felt free. There was a definate connection between me and the butterfly, as if it was part of me being released. At this point I felt my body solidify, I was ripped from my world.\r\nI remember when I woke up I asked everyone the question 'When is it?' Referring to where am I, what time is it, what year is it. They told me to relax and I'll be fine in a minute. At this point I felt the need to talk to my best friend, like I was worried if he was ok, I felt an evil presence outside of the van. He told me he was fine, so I relaxed smoked a cig and came down from the trip.\r\nIf I were to say that I am the same person I was before I smoked would be a lie. It's as if I saw a world so much more beautiful than anything I had ever seen before. I was disappointed to be in this world.\r\nSalvia is not a party drug. I was around too many people when I did it, and didn't know all of them that well. It would have been better if I was with my best friends I think. But to say salvia is just another drug is a complete lie. It is an experience, a journey. It was the most incredible experience of my life, and I cannot wait to do it again.\n\n\n"
}