{
 "title": "Terrible Gibberish - Splintered Memories",
 "author": "Chris",
 "citation": "   Chris. \"Terrible Gibberish - Splintered Memories: experience with LSD & Cannabis (ID 52248)\". Erowid.org. Aug 24, 2008. erowid.org/exp/52248",
 "substance": "LSD & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "7.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   " ",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 52248",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 24, 2008",
   "Views: 3383",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nA friend of mine decided to invest in 100 tabs to sell in my local area as acid now seems pretty rare, an annual or perhaps twice annual occurence, the price was right and the market was there, so he bought them. I had hoped that we would have some of them, but I wasn't holding out much hope of it, I didn't reckon anyone would be up for it. </p><p>It was getting towards 2am on the evening of my friends birthday which happened to be halloween, but of course it was the 1st of November by the time this occurred, and for some reason everybody just decided it wouldn't be so bad to just have one, then another, comprehension of time was long gone, everyone had been smoking weed all day and all night, time was moving by so slowly that by 3am, one hour later 3 of us had eaten 7.5 tabs, and the other participant 3.</p><p>The next few hours were spent sitting in the living room in what seemed like endless silences followed by mad hysteria, until someone would point out the fact that we were seemingly laughing at nothing, then the silence struck again, this went on looping until the sun started to come up. </p><p>It was a few hours before anyone clicked on to the fact that anywhere existed outside of the living room, then the guy in the group who had taken acid before refused to let me outside, saying it was too big, at this point I went up the never ending stairs and was found looking down the toilet bowl which seemed to go on for infinity. I was giggling thinking it would be silly to fall down it. Two of us went in to a room where 2 friends were sleeping under a green blanket, crawling onto the mattress without really giving much consideration to the people sleeping. I found myself feeling as though they were mountains, the green blanket being the covering of grass or trees or whatever, I had a strange feeling of immense size as I was able to reach over what seemed like mountains.</p><p>I spent a while looking out of the window at the rubbish, leaves and general crap on the street below, and gradually they became more colourful and then started moving around. t was like watching a light show go on on the street outside my house. Then my next door neighbour started his car and drove straight through my field of vision, it shocked the shit out of me and it was a sudden real reminder of the existence of the rest of the world and that soon the house would be full of visitors whether we liked it or not, it was really more of a social place than a home.</p><p>It was then that the only person in the group of us who had done it before said he was going to go to sleep, he said after a while the confusion of the trips begin to bug him, and the best way to get out of it is to sleep, its a temporary fix of course, if he is lucky enough to get to sleep with a headful of acid, he's probably gonna wake up still bollocksed anyway. Anyway, this guy can sleep through anything, as could one of the other guys, so as its approaching 7am those 2 fall asleep, leaving me awake with the guy who bought them. Me and this guy have a really bad history of competitiveness in everything and although we spend a lot of time together, it is rare that we really get on, and when we do its a hideous facade.</p><p>So there's me and him left, and we decide to sit in my bedroom, after a little while of exchanging glances at each other I end up thinking I have to say something, we can't sit in silence, but it's difficult to think of anything at all. I said 'It's like a game now really isn't it, a challenge', he turned and said, his face distorted and twisted 'What the fuck do you mean?'. I had meant this in a perfectly harmless manner and stated 'There is just us 2 left, I guess that's the way it would turn out though isn't it' as sods law would dictate if there is one guy who I would have to sit next to with a head full of acid it would be him.</p><p>This really disconcerted him even more. I only meant that it was a challenge to get to sleep as the last one left awake would be on a right headfuck. He asked me what was going on, and until that point, I knew what was going on, I was tripping, at that point my brain just fried itself and reality fucked off rapidly. Suddenly we both had this nagging questioning feeling, a confusion that goes beyond anything I have ever experienced. It was as if there is this constant question that needed answering, but I couldn't answer it, cos I didn't know what the question was for long enough. It's really difficult to explain, but it was really weird, and I felt like we were traveling really fast sat on the couch. After a while, seemed like eternity, was at least an hour or so, I picked up a pen and said 'I've got it'. I get up and go over to the wall, I didn't think what I was doing and put a whacking great ? on the wall, this doesn't help much at all, and really gave my already freaked out friend the fear big time. </p><p>Shortly afterwards clarity begins to return, but it feels like there is some kind of nagging feeling that despite me being seemingly much more clear headed that I am not really as in control as I think I am. At this point my friend went downstairs to play his piano as he thought it would comfort him, he didn't leave it for hours on end, so I went and woke up the guy who had gone to sleep. I woke him up and told him of this nagging sort of feeling I had in my mind that I couldn't quite place, and then he looked at me funnily and then looked away, and then turned to grin at me. It was at this point that I came to realise how manipulative my mind was in this state, we could send each other into oblivious mental chaos just by looking at each other in funny ways, arousing suspicion in the other. I found this tremendous fun, and we spent the next hour or so listening to pink floyd sat staring each other out, pushing each other to the point of dispair and utter confusion, both totally aware of each other's actions, we said a few times we ought to stop, but decided not to. </p><p>I came up with the analagy of describing what is perhaps the comedown from acid as being like a little ball you can set rolling, we could go from having a perfectly reasonable normal conversation to just utter chaos and fear of the other person in a second with the right look, or thing to say. We did this for a while, until a mate turned up, he knew straight away what was going on and we both thought he was conspiring against us, knowing our minds were frail at this time, but it wasn't scary, it just seemed to envoke some kind of instinctual self preservation mode, but before we knew it we were sat in a room full of friends, some of whom knew, some of whom didn't. It was in my eyes really good fun, trying to work out what other people were thinking with this distorted twisted head I had on, all kinds of daft conspiracy theories. </p><p>The guy who I stayed awake with after a while decided he had to leave the house, he needed comfort and quiet, he needed to be out of the drug fueled chaos of our home. So, then a group of us went with him in a taxi to the bank, and then to a hotel in the local town where he decided to spend the night. In the taxi on the way to the bank we were having to explain to him what to do, he was a mess, 'Just go in, sign on the line, withdraw 200 pounds and come back to the taxi' was what we were saying over and over as he had asked us to. The taxi driver asked him what the hell had gone on with him, he used to be a good boy and now he was hanging around with the wrong people and taking drugs, he regularly used this firm and knew all the drivers well, but remained silent for the whole journey, and we had to speak for him. God knows what the driver must have thought with us basically telling him to withdraw cash and then going to the train station car park (which is right next to the hotel he had chosen).</p><p>Nobody said anything, 2 of the 3 other people in the car including myself had had some, everything hadn't quite got back to absolute normality, I had tried not to let it, it was now 18 hours after the initial start of the trip and I hadn't slept for 2 nights now so the effects of slight sleep deprivation, the world's 2nd best hallucogen were now beginning to kick in too. And now came what I had been waiting for in the taxi. I had been thinking constantly of Fear and Loathing in Las Vegas throughout the past 18 hours, silly Thompson-esque comments and observations were filling my head constantly as they often do even if I'm not inebriated. And then it came, checking into a hotel (admittedly without the phony name with intent to commit capital fraud) with a headful of acid. I couldn't help but grin thinking out the scene from the film in my head while we tried to book in.</p><p>After getting the room sorted out, we all went up, and in turn took a shower, which was a strange experience certainly for myself, and then 3 of us went out leaving my friend in the room he had booked, we decided not to return and left him there, by this time we were certain he would be fine, so we caught a taxi back and looked back on the event for a few hours before retiring to bed. The next day the guy who stayed in the hotel returned, vowing never to have acid again in his life, he had fallen asleep moments after we left anyway. </p><p>To sum it up, I would say that it was one of the most fun crazy days of my life, but I can see why a lot of people can get really fucked up thinking the wrong thing at the wrong time - As the late great Hunter S. Thompson would have put it 'I hate to advocate drugs, alcohol, violence, or insanity to anyone, but they've always worked for me.'</p>"
}
