{
 "title": "Unleashed",
 "author": "Rich",
 "citation": "   Rich. \"Unleashed: experience with Oxycodone (Percocet) & Hydrocodone (Vicodin) (ID 52257)\". Erowid.org. Apr 28, 2006. erowid.org/exp/52257",
 "substance": "Oxycodone (Percocet) & Hydrocodone (Vicodin)",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Pharms - Oxycodone",
   "(pill / tablet)",
   " ",
   "  ",
   " ",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52257",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 28, 2006",
   "Views: 30742",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've never been one to experiment with drugs. Raised in a Catholic household in South Philadelphia, I was not only taught the typical anti-drug lingo, but saw Junkies and what-not first hand in my neighborhood. At thirteen, I had smoked my first joint - It was an amusing experience, to say the least, but nothing noteworthy.</p><p>I won't go into details about how I started my usage with the sister's Percocet and Vicodin. It involved dentistry and a trip to the ER - But a prescription later, I couldn't believe how I felt after taking my medicine. Euphoric isn't really the proper word to utilize - I think I just felt at peace with a lot of my passions and hobbies. Everything I loved became something that made my life worth living. But, at the time, I really didn't need a drug to feel so passionate - So when the 'script ran out - I forgot about my experiences with it and continued onward without it.</p><p>Another dentistry nightmare scored me another prescription. This time, however, I used the medicine to my complete advantage and forgot about it again. This was around 2002-2003.</p><p>Around 2004, long after my dentist dramas were over - Life happened. A five year relationship fell apart at my feet, my life changed dramatically - Some things for the better, but a lot for the worse. I suffered bouts of anxiety and depression. I found that the passion I once had for life, for my obsessions, simply ran out of steam. I didn't care, really. I had gotten a new job, which I loved, but couldn't shake the sense of innocence lost that I once held in such ease. Until I once again discovered the Sisters.</p><p>Wham - I was sent back to a time when life was a little more amusing, where my obsessions were something I cherished. And more importantly, I saw how my creativity seemed to unleash itself to ends I couldn't even foresee. I was back to recrafting Barbies into characters, drawing and sketching like a true artist, writing. I had smoked pot a while during my depression - which helped a tad, but didn't dare hold a candle to the sensations and energetic creativity I felt with Percocet or Vicodin. Both of which offered the same sense of energetic creative euphoria that can only be described as childlike innocence laced with a sugar high.</p><p>Now - I'm faced with a dilemma. Procuring them for when I binge, which has become often, is difficult. I don't resort to street dealers, and I'd dare not steal or lie to anyone [save the occasional doctor] for my habit. I don't hurt anyone, nor do I allow myself to get so high that I'm incoherent. I take it and become a pure powerhouse of creativity. Not only that, but I'm kinder and happier. I compliment everyone, and I'm simply ecstatic at living.</p><p>But I know all good things must come to an end. I am hoping to score a prescription today/tomorrow - And that will be the last for quite some time. My binge that I am going to go through, I hope, will help me inspire myself to live without it. But because I adore it so much - I've no intention of stopping it completely. I respect the power of the drug, and my own weaknesses and addictive personality. For those reasons, I must stop if I am to enjoy the use of it.</p><p>In any event, I simply wanted to share with like-minded individuals how, sometimes, drugs can affect me in positive ways. Yes, the 80's propoganda rises within me to warn me that it's not me, but it's the drug. Therefore it isn't real. The drug doesn't invent my passions or obsessions, nor does it give me talent I never had - it enhanced what I love and can do, and makes it all link together in such beautiful unison. To feel like this forever would be divine - but it's not possible.</p><p>Be wary and take note; Percocet, Vicodin, and even the more daring Oxycontin [which I refuse to take] are very addictive. The sensation I get is unlike anything I've ever felt. It rivals orgasm, for me, and can be breathtaking. But I must be careful, and use responsibly.</p><p>I know it sounds odd, but knowing completely about whatever path I'm about to wander down makes it a little easier to walk - and respecting the power behind the drug is simply a good way to not abuse it. I know it will always be available if I don't excessively use it.</p><p>Namaste.</p>"
}
