{
 "title": "Be Respectful",
 "author": "Devanath",
 "citation": "   Devanath. \"Be Respectful: experience with Salvia divinorum (ID 52286)\". Erowid.org. Apr 19, 2006. erowid.org/exp/52286",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52286",
   "Male",
   " ",
   "Not Given",
   "Apr 19, 2006",
   "Views: 3718",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Greetings</p><p>I am a psychiatry resident and meditator with a keen interest in psychoactive substances and their healing/transformative potential. What follows is an account of mine with Salvia Divinorum 10x after a night in the ER where I witnessed but did not participate in 3 separate traumas.  The setting: several candles lit, two on my glass coffee table and one in front of a picture of my teacher Amma; the incense burning with smoke plumes traveling on the sound waves of Deva Premal and her Gayatri rendition.  My intention: to receive physical/psyhospiritual healing and to dedicate the fruits of the healing to the betterment of the collective One. </p><p>On a couch, in my family room, I took two long drags of the plant and at the end of my last exhale immediately found my consciousness transported to the opposite eastward facing wall. It was as if I  defined as a center of 4D perceptual awareness   was located within a camera  on the wall.  The transition from the couch to the wall was so sudden and so utterly convincing that I at least originally did not think it odd that an instantaneous shift of this sort could occur. However the shift was accompanied by a sense of impending apocalyptic doom.  To say it felt as like would be to do a disservice to the experience because there was no faculty available for comparison at that moment  I was completely absorbed in the altered mind-space.  For that moment, my entire life and that of every living creature on the planet was perceived as a series of charades comprising a comedic type of board game which was, or already had been annihilated by an act of cosmic destruction, Lord Shiva at work.  In fact, the entire Universe was being neatly folded up into the nothingness from which it sprang.  I thought about those I cared about and hoped that I would meet them on the other side  despite the sheer cataclysm of the experience.  At this point the east end of my living room began to morph into a wave that existed in a state of perpetual cresting.  I was surprised that the room did not collapse, that the process which had happened to the rest of the planet did not continue where I was.  Then there was the first moment of clarity, a self-reflective moment where for the first time I thought it odd that I had been moved to the wall.  Still aware of the pending danger, I felt that if I could just make it back to my couch, the apocalypse would be averted. By an act of  will, my awareness was restored to the location of the couch, at which point my dog arrived on the scene licking me with kisses of reassurance.  Back in the body, I laid down to process what I had just experienced.  What followed were several minutes of glow, where the lights of candles and sounds of mantra soothed my thoroughly assaulted ego.  I laid still thinking what the f_ck, what the f_ck.</p><p>I share this experience to note that even with the best of intentions and most wholesome surroundings one can never know fully what to expect from Salvia.  She will do as she will.  My experiences with the plant are seldom gentle but usually therapeutic.  Her energy is pervaded by the spirit of Kali, the goddess of ego destruction (its funny to note that I unintentionally store Salvia under a Kali statue).  And I must say that most of my trips are accompanied by a sense of being stripped naked to the core. I suffer to the extent that I resist this process and bliss to the extent that I welcome it.  What followed in the days after was not new intellectual insight or profound psychospiritual healing, but less existential baggage and further freedom to be.  </p><p>Salvia can greatly enhance ones intrapersonal maneuverability; however she must be welcomed and respected.  For inexperienced users a sitter is absolutely necessary. Intention and familiarity with psychoactive/meditative states of consciousness will prove beneficial to the explorer. In short Salvia is not to be taken lightly, and she should never be used by as a means of narcotization or escape, mainly because she will not oblige. Be safe, be humble. This is not a drug of abuse.</p>"
}
