{
 "title": "Awake Again",
 "author": "UnderWater",
 "citation": "   UnderWater. \"Awake Again: experience with Modafinil (Provigil) (ID 52290)\". Erowid.org. May 1, 2006. erowid.org/exp/52290",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52290",
   "Male",
   " ",
   "Not Given",
   "May 1, 2006",
   "9466",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was involved in a very serious accident about a year ago that left me in the hospital for quite some time with a traumatic brain injury.  Luckily, I've made more or less a full recovery.  The one lingering problem I have had since the injury is with my sleep cycle.  I'm no longer able to establish any sort of pattern to my sleeping.  I'll be awake one minute and dead tired the next.  It's as if someone is quickly turning on and off the 'sleep/awake' switch in my brain. This got to be quite a problem, as you can imagine.  On the bright side, even though I'm now narcoleptic, at least I don't have full-blow cataplexy to boot.</p><p>After thinking that I was merely depressed for the longest time, and going on a few different SSRI's and other antidepressants, I realized that it was the sleep problems that were of the most concern.  I went to a post-concussion specialist and he immediately put me on Provigil.</p><p>The effects were immediate.</p><p>There is really no 'high' feeling, other than being completely awake, which after a year without, is a high of its own.  It's not a drug that will keep me awake if I want to sleep, but will allow me to overcome the desire to sleep if I feel it constantly nagging at me.  I do also experience much improved concentration abilities, although again, this may be 'normal' for most people, as I've lost my frame of reference of how I functioned before the accident.</p><p>Unfortunately, the effects don't seem to be as strong as they were when I began taking it.  I've tried hard not to take Provigil everyday, as I did not want to down-regulate any receptors for it, thus loose its potency.  However, it seems as if I have been unsuccessful.</p><p>I'm afraid that this narcolepsy might be a tougher animal than I thought, and I'm afraid that amphetamines may be the next step for me.  Something I'm not looking forward to.  However, Provigil has at least given me a glimpse of what normalcy can be, and even now, when the day is right, it keeps me awake and aware the entire day.</p>"
}
