{
 "title": "So Much Love",
 "author": "Amazing",
 "citation": "   Amazing. \"So Much Love: experience with Mushrooms - P. cubensis & Cannabis (ID 52302)\". Erowid.org. Sep 2, 2008. erowid.org/exp/52302",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1.2 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   " ",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52302",
   "Male",
   " ",
   "Not Given",
   "Sep 2, 2008",
   "2721",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night was far and away the greatest experience of my life, all because of a mushroom, a magic mushroom.</p><p>Today my good friend gave me an eighth bag of cubensis. I have done cyanescens once or twice before never really 'enough' to fry very hard. Even though once I did enough to make myself pass out and fall over probably just from dizziness. One of these cubensis was bigger than the rest and almost all blue with some dark brown tint on the bottom of the cap. I picked it out and ate it with some dark chocolate and washed it down with some orange juice and a vitamin C tab. It tasted fu**ing gross and it was all brown and weird looking in the middle. I was pretty sure I was going to throw it up later. I took one 200mg ibuprofen to avoid a headache.</p><p>About a half hour or so later I started to feel really nauseous, partly from the way the mushroom felt on my stomach but mostly I think it was motion sickness from all the shifting in my vision. I have no pipe (as I dont really smoke much) but had heard that cannabis was good for nausea so I managed to throw a shitty little joint together and headed out the door as fast as possible to smoke it. I managed to get it lit and started walking down the road, I got about halfway done with it before I forgot about it and let it go out.</p><p>My nausea was gone and my trip was getting weird. My steps sounded really springy and I kept catching myself slowing down and even stopping once to stare at stuff. I told myself to get moving cause if anyone saw me I probably looked like an idiot, though I was so excited I didnt really care. I was confused. Uh oh, somehow I think I had gotten lost, which was weird cause I had only meant to go around the block. I recognized all the street signs, I was right near my house but I couldnt seem to place my exact location or my house. hmmm... mild panic... whew, theres my road! My house is just three driveways down, I hope I recognize it.</p><p>I made it inside, totally tripping right now, go lay down in my room and try to listen to music. The trip is intense which is good but I start to feel sick like poison, and my head feels like its on fire. My brain is heating up like crazy and my heart rate is through the roof. I can feel it. I make it into the bathroom and chug some water along with a tablespoon or so of activated charcoal then go lay in my room again. This is weird; Ive never really been scared on mushrooms before. I can feel all kinds of horrible things, I think maybe the reason the mushroom was all blue and big and strange was that it wasnt a cubensis at all but some other more toxic, deadly mushroom. Im sure Im going to die. I feel kind of delirious but everything I am sensing seems too real for it to be delirium.</p><p>I can feel people, most of my friends who live in the immediate area, and some of my family. I can feel my friends stronger, others more than some, as I lay there dying I realized how much God loves me and how much of the spirit is in everything living. I never really got it before. I had always had some sense of spirituality and the need to be nice to others, mutual respect lets call it. But I never understood. Im so stupid. In my minds eye I can feel/see some of my friends and some people who werent my friends (my little brother) and I think some people I didnt even know, welcoming me into the fold, all the people who understood.</p><p>This is crazy! I cant believe this stuff grows on mushrooms! Ive really tapped into something here, like another dimension of some sort. My perception is definitely altered not false though, just like my brain has shifted priorities in terms of what it pays attention to. I am totally on a spritual/emotional, telepathic/empathetic feeling wavelength now, my mind is buzzing. It feels like I know everything. I mean seriously, really it feels like I know everything.</p><p>With my mind working so hard to tap into this other realm it is not able to keep up its normal processing functions at the same time so my body feels kind of weird and my vision is definitely not normal. At one point I worry that I will never be able to see straight again but I realize that it is not a sensory problem, just that when you have tapped into this other realm it is hard to make sense of the normal realm, just like in the normal realm it would be hard to make any sense of this. Most importantly I realized that the only reason I had been able to tap into this sacred place was because of a mushroom, and once its magic wore off I would be able to live in the normal realm again. I wasnt worried.</p><p>Okay, so I said I finally understand and that I feel like I know everything. By everything I mean the true essence of life. That thing that John Lennon was always trying to tell people before he got shot; that thing the Bible says Jesus was always saying was the greatest thing of all LOVE. Really, its that simple, all you need is love and everythings amazing. Seriously I never knew how much I love people and how great everything is. Its overwhelming, I am 100% convinced that if every person could feel exactly how I feel right now at least once in their life, the world would be just about perfect, if not absolutely.</p><p>When I talk of love I do not mean that special someone or any people in particular, but true all encompassing, unconditional, real love. It is the most intense sensation I have ever had in my life. My mind is completely ablaze with realization and knowledge of indescribable beauty. I am totally awestruck. I cannot believe this happened to me because of a mushroom! Surely this is one of the greatest gifts god has ever given me, I am eternally grateful and as soon as I see my friend who gave me the mushrooms I am going to give her a huge gigantic hug.</p><p>There is a lot more I could add to this story, including a good conversation with my dad that I could add to this story but I figure youve probably been reading just about long enough. I kind of lost my sense of time but the whole trip probably lasted about six hours; I will just leave you with this: Last night was by far and away the BEST experience I have ever had in my life, talk about spiritual growth! I felt great in the morning, still thrumming from the exciting discovery I had made.</p>"
}
