{
 "title": "Kiss the Liquid Sky",
 "author": "Stargazer",
 "citation": "   Stargazer. \"Kiss the Liquid Sky: experience with 2C-I & Cannabis (ID 52319)\". Erowid.org. Jan 13, 2007. erowid.org/exp/52319",
 "substance": "2C-I & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "2C-I",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "52319",
   "Male",
   " ",
   "Not Given",
   "Jan 13, 2007",
   "2555",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last summer, I was fortunate enough to try 2C-I. Two friends (who Ill call Joe and B) and myself partook in the experience. We got three doses. I have no idea how much was in a dose, it was just a little bit of off white powder wrapped up in aluminum foil. Anyway, after acquiring the substance, we went to Joes house to consume the product.</p><p>After ingesting the strange powder, we walked to a friends (who Ill name S) house a few blocks away. By the time we got there, I began to feel a sensation as if the world was moving around me while I treaded in place. We smoked some weed in my friends room and stared at the ceiling for a while. We quickly grew board and decided to go on an adventure of sorts. At this point, Joe got a call from some random girl and decided he would rather spend his evening with her. </p><p>Parting ways with Joe, B and I got in Ss car and drove to what was called, the mushroom caves. This was a series of small caves carved into the sides of limestone cliffs that partially encircled a lagoon. We arrived at the trail head in the early evening and there were nats everywhere. This was maddening since I have long hair and in my befuddled state I was convinced they were crawling throughout it. We ran for what seemed like an eternity threw a sea the hungry little insects.</p><p>We finally got to the caves and I tripped out on the images engraved into the interior. There were faces and mushrooms that kept gaining and losing depth as well as just generally morphing. We smoked a bit more weed, but the bugs were still bothering me and I decided to walk back to the car while the others kept exploring the area. By this time, the sun was beginning to set and as I began to walk back along the trail I was stopped sort because of the vision I saw across the lagoon. The sky was ablaze with the most beautiful colors I had ever scene. They were churning and expanding, forming recognizable images and then collapsing into unintelligible swirls of color. I sat on the cliff near the car taking this all in for a period of time that seemed to stretch on forever. Finally, my friends returned and we moved on to our next destination, the beach. </p><p>By the time we reached the cliffs overlooking the beach, I was peaking. It was red tide, which means there were a bunch of dead microorganisms floating in the sea. The result of this was waves that glowed as if they were fused with radiation. As the shining waves cut threw the dark ocean, they exploded (in my mind) into a series of patterns which were indescribable. As I sat on the bluff overlooking this phenomenon, a local inhabitant sat nearby and played a slow sad song on a little trumpet. The effects could not have been better. After watching the ocean for a while, we jumped into Ss car and we drove to a friends house, where we drank alcoholic beverages and relaxed for the rest of the night.</p><p>It is important to remember that, while on 2C-I, you are not just met with breathtaking visions, but with a wonderful euphoric feeling that courses threw your innards. For this reason, some have claimed that it is best described as a mix of X and LSD (both of which I have never partaken in). If that is true I cant say, but what I can is that this was the best hallucinogenic experience I have ever had. And, in my opinion, 2C-I far out ranks mushrooms, Mescaline, LSA and Salvia divinorum. I was completely in control during the experience, even while peeking. I was able to converse with my friend S, who only smoked weed, throughout the entire night. This was very different than other substances, like mushrooms, where I felt I was operating on a completely different wavelength than sober people. It was a very relaxed and at the same time exciting experience.</p>"
}
