{
 "title": "Saved My Life",
 "author": "Lisa",
 "citation": "   Lisa. \"Saved My Life: experience with Methadone (ID 52347)\". Erowid.org. Sep 12, 2007. erowid.org/exp/52347",
 "substance": "Methadone",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "Methadone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "",
   "52347",
   "Female",
   " ",
   "Not Given",
   "Sep 12, 2007",
   "Views: 15067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I began abusing drugs when I was 16, and by the time I graduated high school, I was an addict.  I soon began experimenting with opiates (Percocet, etc.) and eventually found Oxycontin and then later moved on to heroin.  In the end of my addiction, I was using heroin intravenously and was homeless. </p><p>One day, my then-boyfriend let me drink part of his daily dose of methadone (he was enrolled in a maintenance program, on about 90mg I believe.  I was absolutely amazed when, that day, I did not use any heroin.  I did not even want to use heroin, even when my boyfriend was using it right in front of me.  It was incredible. </p><p>Thankfully, I got on methadone maintenance.  This medication has absolutely saved my life.  I was inducted into a methadone maintenance treatment (MMT) program at 30mg.  The nurse told me that if I stayed inside the clinic (to be observed for signs of overdose/sedation/etc.) I could get another 10mg after an hour.  I did so.  Then, within the next week or two, my dose was gradually increased to 70mg.  </p><p>In the first few months, I felt some pleasant side effects of methadone, even though I was taking the same exact dose every day.  About an hour after dosing, I would feel slightly warm and a general sense of well-being.  It is also important to note that even though I felt these effects within about an hour, the full effects of methadone are not felt for up to four hours.  These effects would last around an hour or so, sometimes longer, sometimes shorter, and were similar to the effects of heroin/other opiates, but much less pronounced.  In other words, I can't imagine anyone wanting to take methadone recreationally; these effects would not even be worth it, in my opinion.  During these first few months, I also had no appetite; this was also an effect I experienced when I used opiates regularly.</p><p>However, after about month four, I noticed a lessening of these effects.  I started to just feel normal.  Ever once in a while (this even happens now, albeit rarely, after being on MMT for four years) I would get a 'methadone hug', about an hour after taking my dose, that would last a few minutes, or maybe a bit longer, in which I felt a sense of well-being and a warmth, mostly in the arms and chest area.  </p><p>Another important effect of daily methadone use is that, like other opiates/synthetic opiates, it causes physical dependence.  There have been several times I have accidently missed my dose over the years for a variety of reasons.  On these occasions, I would start to experience opiate withdrawl symptoms like increased sweating, fatigue, and so on.  However, I do attribute some of these symptoms to mentality as opposed to actual physical withdrawal, especially because a dose of methadone generally lasts at least 24 (and up to 36) hours, and I would often begin to notice withdrawal symptoms as soon as I realized I had missed my dose.  </p><p>The most important part of taking methadone for me has been the way it has affected my desire to use drugs.  I have not touched any opiate in over four years, and in one month (May 2006) I will have four years clean off of all illicit and unprescribed substances.  I cannot say that I never crave drugs, but it is very rare.  Having freedom from these cravings is truly what has saved my life.</p>"
}
