{
 "title": "What a Trip!",
 "author": "Béa",
 "citation": "   Béa. \"What a Trip!: experience with 2C-I (ID 52364)\". Erowid.org. Oct 24, 2007. erowid.org/exp/52364",
 "substance": "2C-I",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52364",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 24, 2007",
   "Views: 3029",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy boyfriend and got a hold of two hits of 2C-I one saturday night.  At approximately 10:10pm we each ingested the capsules.  We layed in bed waiting for it to kick in (being first-timers, we didn't know how long it would take).  I didn't really feel much during the first half-hour post-consumption.  <br>My boyfriend started to become agitated because the light in the closet was on. He asked me to turn it off and he turned over in bed and appeared to be sleeping.  I noticed the first signs of tripping at approximately 11:15pm when I began to see the words on a poster moving, but I wasn't sure because it was dark.  I turned on the light and felt like I was floating instead of walking.  Everything in the room started to  move and looked alive.  My boyfriend got up and put on some music and i suggested we have a cigarette.  He agreed and then picked up a pad of paper and asked for markers.  <br>We proceeded to attempt to write all of our thoughts down and kept getting distracted by more thoughts.  We were both elated and laughed histerically at everything.  We finally remembered that we were going to go smoke a cigarette about an hour later.   We got all distracted when putting on jackets to go outside and took about 30 minutes to make it outside.  While smoking, we continually were fussing about little noises and if my parents would wake up and the like.  We went back inside and everything i looked at was moving.  the walls and floor, and we were amazed how the solid colored bedsheets were moving.  During the experience, I felt a great sense of love and affection for my boyfriend and i was really able to talk to him and we were both quite talkative.  It was agreed that we were both intensely tripping even by 2:30am and we were quite amazed at the potency of this particular hallucinogen.  We were both seeing bold trails and our skin seemed to be moving.  We both felt stuffy and hot while indoors as well.  We watched an especially bizarre episode of wonder showzen and were amazed by how strange it was.  At about 3:30am we decided to go to sleep, just because it was quite late.  However, I remained completely out of my mind tripping until about 4:30am, when I was able to fall asleep.  <br>Psychedelic mushrooms being the only other hallucinogen i have tried, 2C-I compares and perhaps surpasses in quality of experience.  Whereas mushrooms sometimes need to be supplemented with cannabis in order to pull an all-nighter, 2C-I alone had me triping for 5 hours, intensely too.  I kept expecting to come down, but I plateaued for a long while, and the onset wasn't that long of a period.  I had a very positive experience with this substance, and would try it again if it became available to me.\n\n\n"
}
