{
 "title": "Stopped Smoking, Panicky Feelings",
 "author": "Lucky",
 "citation": "   Lucky. \"Stopped Smoking, Panicky Feelings: experience with Bupropion (Wellbutrin) (ID 52438)\". Erowid.org. Jan 1, 2011. erowid.org/exp/52438",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52438",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 1, 2011",
   "Views: 11784",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was prescribed this medication to help quit smoking. I had smoked cigarettes for twelve years and was really ready to quit. I was sick of the way I smelled, the way my mouth tasted, and how people were constantly judging me. Most of all, I was afraid of getting cancer. I had tried to quit, but always had cravings. As soon as something stressful happened - I would light up. I specifically asked my physician for this medication, and getting it was very easy. There really weren't any questions asked. Scary... Really.</p><p>I began taking one 150mg tablet per day for three days. After that the dose went up to two 150mg pills per day. The first day of taking the medication I quickly noticed a difference in myself. I didn't quit smoking right away, but I had a significant increase in energy. I felt great. It got better and better. And cigarettes got worse and worse. Around day 3, smoking did nothing for me. It was if a switch in my brain had literally been flipped. It didn't taste good. It didn't feel good to inhale like it used to. It didn't do anything. That's what made me give it up. I figured, what's the point? So I quit smoking.</p><p>I kept taking the medication. I continued to feel very energetic. It was like a had snorted coke, seriously. I could not sleep at night. I figured this effect would go away with time. I had the tingly sensation on my skin and was easily aroused. This was good, but there was bad effects. Very bad effects. One day during week three of being on the meds, I was riding the subway. All of a sudden, I felt like I couldn't breathe. My heart began to beat very fast and I thought I was having a heart attack. The train was especially crowded that day and I felt that everyone was looking at me (paranoia). But most of all, I was afraid I was going to die - right there on the train. My hands and lip went numb and I grew more and more afraid. It wasn't my stop, but as soon as the doors on the train opened - I ran out them and out into the daylight.</p><p>I was so scared. I considered going up to a police officer and getting him to take me to the emergency room. I lingered in this state for about an hour and a half. Finally, I began to calm down. I continued the medication and was fine for a few days. Then, one night I was lying in my bed trying to fall asleep when I felt my heart beating quickly again. Then the same cycle began again. I was so afraid that I was going to die in my bed and no one would find me in time to save me.</p><p>I now know that what had been happening to me was panic attacks. I had never had these before this medication. I called my doctor and told her what happened and that I wanted to stop the medication. I tapered off my dose. It has been almost 3 months and I still haven't smoked cigarettes. I haven't craved them at all. The medication worked in this aspect. I just wish someone would have warned me about the panic attacks... at least so I would have known what was happening to me and that I wasn't going to die.</p>"
}
