{
 "title": "Stimulant & Mild Psychedelic",
 "author": "Psychedelicious",
 "citation": "   Psychedelicious. \"Stimulant & Mild Psychedelic: experience with Yohimbe & Piracetam (ID 52480)\". Erowid.org. Jul 19, 2007. erowid.org/exp/52480",
 "substance": "Yohimbe & Piracetam",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Yohimbe",
   "(extract)",
   " ",
   "  repeated",
   "oral",
   "Piracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52480",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 19, 2007",
   "Views: 16895",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter about 5 months of experimentation with yohimbe extract (in conjunction with piracetam and not), I have found it to have several main effects:<br>1) Extreme vasodilation<br>2) Strong mental stimulation<br>3) Mild physical stimulation<br>4) Very mild visual and aural distortions<br>5) That Wonderful Psychedelic Mindset<br>With piracetam (dosage doesn't seem to matter so much, I vary between 800mg and 2400mg), I get these effects at these doses:<br>~30 drops Yohimbe<br>Orgasms are prolonged and more intense<br>Mind races at a ridiculous pace<br>Hand tremors when sitting still<br>Hot flashes<br>Slight Euporia<br>~30 to ~50 drops Yohimbe<br>Nonlinear thought patterns<br>Mind races even faster, and thoughts get trippy<br>Increased creativity within the mind, coupled with a bit of difficulty explaining these ideas to others<br>Oral stuttering when trying to speak at a speed which others can understand<br>Euphoria!<br>~50+ drops Yohimbe<br>Aural phasing and distortions<br>Cardboard-cutout, puppet-box vision<br>Nystagmus... in many directions<br>Definite Psychedelic Mindset<br>Extreme Euphoria and a sick case of the laughs<br>Without piracetam, I can't seem to take enough to get the effects noted in the 50+ drops category. In addition, piracetam seems to affect the mental, more trippy aspects of yohimbe far more than the physical stimulation. High doses of yohimbe even without piracetam result in intense hot flashes and a tweaked feeling, though it exceptionally clean - not like amphetamine or cocaine tweaked out glitching. <br>Thanks for reading.\n\n\n"
}
