{
 "title": "Assaulted after Mixing",
 "author": "Johnny",
 "citation": "   Johnny. \"Assaulted after Mixing: experience with Cocaine & Ketamine (ID 52537)\". Erowid.org. Mar 3, 2011. erowid.org/exp/52537",
 "substance": "Cocaine & Ketamine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  ",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1998",
   "ID: 52537",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 3, 2011",
   "Views: 11704",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For about a year, I had become comfortable with doing lines of coke recreationally in Chicago's lincoln park neighborhood, unfortunately alone at my apartment, mostly on Friday, Sat, Sun, tues nights.  Once in a while I'd head out, when I happened upon a series of nightmares that impacted my life.</p><p>After doing a couple of lines, I headed north into the Halsted district to some gay-friendly bars.  I met a dude, we did some lines back at my place, and then he mentioned that he had some K.  He wanted to mix it in, although I wasn't really excited about that.  We went back to his place, and I met his roommate.  We did a line of the newly-mixed substance.  About 30 minutes later I did not feel right, in fact I felt fucked up too bad, and I left the apartment.  These dudes lives way north, and as I left the house, I felt my vision become pixel-like.  I continued to walk to home...about 2 miles south toward downtown Chicago.  </p><p>That's when some nightmare happened.  A car with two males drove up, and said something to me.  I mumbled something and walked on.  They stopped the car, one male got out and chased me with either a pistol or tire iron and beat me over the head.  While I was down on the pavement, him standing over me, he searched my jeans for my wallet, and ended up ripping my jeans off me, so that I now a pair of cut-offs on one leg, not to mention my bleeding head.  After the assault was over, I was walking home at dawn, when I girl I ran into said 'dude...your head is bleeding really bad... you need help'. I knew that Illinois Masonic hospital was just around the corner so I ran there.</p><p>For the last decade I have suffered post-traumatic stress disorder.  </p><p>I'm asking for your prayers to heal me.  I'm hurting really bad, and I almost hanged myself a couple times because of this.  I really need help, and I hurt...</p>"
}
