{
 "title": "A Journey Into Apathy",
 "author": "Kylie",
 "citation": "   Kylie. \"A Journey Into Apathy: experience with Methylphenidate (Concerta) (ID 52533)\". Erowid.org. Sep 12, 2007. erowid.org/exp/52533",
 "substance": "Methylphenidate (Concerta)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "36 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "",
   "52533",
   "Female",
   " ",
   "Not Given",
   "Sep 12, 2007",
   "44036",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before reading this submission it is important to mention that I was diagnosed with ADD/ADHD at the age of 8, and was diagnosed this year with major depression and panic/social/anxiety disorder. The reactions that I have had to this medication, of which I take at my prescription dose, are different than the reactions experienced with this medication by people who have none of these disorders.</p><p>I have been on one form or another of Ritalin since 2nd grade, beginning with two doses of Ritalin a day, and then switching to Concerta when in the 6th grade. Around March of last year I made the decision to quit taking my prescription. It was not until I made this decision and lived without the concerta for a few months that I discovered what it actually did to me. After not taking my prescription for almost a year, I decided to take it once more for my semester finals, remembering that it seemed to improve my test scores.</p><p>So the first final rolls around and I wake up and take my 36mg of concerta around 7:30 am, skipped breakfast, and within the next hour I began to feel its familiar effects. While taking my exam I remember at least twice having to stop writing so that I could mentally calm down. Concerta would speed up my movements so that I was able to write almost as fast as I could think. I would also experience random muscle spasms, with which I would become fascinated and almost transfixed by. I would rub random muscles in my hand to try to stimulate them so that they would spasm. This practice could go on for hours, to the point that my hands would become sore.</p><p>After I finished my exam, I went home. I sat down at my desk around 12:30 pm and looked at my foot. The light from outside was shining through a window and onto it. This transfixed me and I continued to stare at it. I continued this and would completely zone out. My boyfriend called me at some point during this and when I looked at the clock it said something like 3 hours had passed while I had been staring at my foot. I decided not to answer his call because I felt anxiety about talking to him. I have found that my concerta greatly increased my anxiety to where it was hard for me to talk, even to people I knew very well and was usually comfortable around. This makes any situation that was acutely social a living hell for me.</p><p>I had eaten nothing all day. I felt weak and light-headed anytime I stood up. Any attempts at eating where thwarted by my lack of appetite. Anytime I would put food in my mouth, my severe lack of appetite would cause me to become disgusted with the food and unable to swallow it. I had gained almost 25 lbs during the 10 months I was off of concerta. Its amazing what actually having an appetite will do for your weight. During the week I took my concerta again, I lost 5-8 lbs.</p><p>I tried to study for my next exam, but found that I would zone in and out of mental consciousness, and, upon regaining my mentality, would realize that I had been staring at the same spot on a page for 30 minutes. I had absolutely no motivation to do anything, and was pretty much in a zombie state. I went to bed that night around 10 pm, for lack of something better to do, and ended up laying in my bed staring at my ceiling for a good 5 hours, all the while floating in and out of mental consciousness, and seeing bright colors/tunneling vision brought upon by not blinking and staring at the same place for minutes at a time. Passive thoughts came into my mind, my apathy towards everything not permitting me to act up on them. I finally became exhausted around 3 a.m. and crashing into sleep, which welcomed me with images of dark spots of color and strange patterns on the back of my eyelids. The next day, I started the vicious cycle all over again.</p><p>While off my medication, I developed symptoms of depression and anxiety disorders. These symptoms had been suppressed before by the concerta, to the point where I either did not notice the symptoms (or anything else, for that matter) or I just simply did not care. While on concerta, I was mentally numb; it killed my personality, appetite, and the messages my body was trying to send me to tell me that I had other problems that needed to be resolved.</p>"
}
