{
 "title": "Shaking Uncontrollably",
 "author": "J",
 "citation": "Citation:   J. \"Shaking Uncontrollably: experience with Salvia divinorum (ID 5254)\". Erowid.org. Jan 12, 2002. erowid.org/exp/5254",
 "substance": "Salvia divinorum",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5254",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 12, 2002",
   "Views: 8332",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nTo begin I will give you some basics of my history; if you dont want to read it skip to the next paragraph.  I first experimented with 'drugs' three years ago, quickly developing a special love for hallucinogens, particularly lsd because of availability and price.  I made it a point to try everything at least once, however.  A couple months ago I heard about salvia divinorum and ordered some leaves.  At first I met with no success; but quickly became able to get level L trips on the S-A-L-V-I-A scale, if with some difficulty.  \r\nBy this time (Feb 2001) I had gotten into taking large quantities of lsd without adverse effects of any sort.  I had ordered some salvia extract (6X), but was too busy with school to try it for a little while.  A roommate suggested we give it a try the other night, and although sober at the time, I had eaten six hits of some liquid acid during the course of the day and so I figured any extra boost might help the salvia really give me a powerful experience.  \r\nThe first hit sent me straight to level L, and after the third I was ruined.  My vision quickly turned into a a fast moving mass of reddish faces that were shaped somewhat like scales.  They quickly began to take over my body and I was unable to move.  They began to scream at me in anguish, but I refused to listen to them although I know that I was capable of it.  I still got the impression that they wanted to take over my soul.  Although the visual effect was something not too unlike large quantities of lsd in words, the effect on my mind was completely different.  I managed to shake the overwhelming visuals enough to recognize my house and I fled into another room where a sober friend was.  \r\nHe was still one of them, but mentally I had broken out of my state of utter panic enough to realize I might actually be able to live a normal life despite what had just happened.  Despite appearances, I was able to shut out there voices to a dim whisper and communicate with my roommate as to what was happening.  I spent the next hour shaking uncontrollably and when I was able to function soberly again I destroyed every piece of salvia I owned.  \r\nTo sum up, salvia is completely unlike anything else I have ever done.  I overdosed and nearly died from ecstacy once, and have been through heaven hell and beyond on lsd and psilocybin; but none of that had nearly as profound an impact on my life than the first ten minutes of this salvia trip.  I will never do it again, and I'm putting off tripping in general to be sure no kind of flashback to this occurs.  I praise God for rescuing me.\n\n\n"
}