{
 "title": "Great, If You Don't Have Side Effects",
 "author": "Rolf",
 "citation": "   Rolf. \"Great, If You Don't Have Side Effects: experience with GABA (ID 52550)\". Erowid.org. Jul 29, 2008. erowid.org/exp/52550",
 "substance": "GABA",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2500 mg",
   "sublingual",
   "GABA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 52550",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 29, 2008",
   "Views: 105217",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nGABA was recommended by an enlightened MD who was assisting in getting me off Ativan.  I was taking Ativan to relieve anxiety and as a sleep aid, I developed tinnitus and ongoing lethergy while using Ativan, and never would have gone on the stuff if someone had also mentioned the nasty addiction/withdrawal element.<br>Anyway, per his recommendation, I was taking up to 3 grams of powdered GABA (NOW Food brand) per day, sublingually, generally in 3 divided doses.<br>I have found it quit efficacious and was so glad to have it during the withdrawal process.  In small doses, it has a nice calming effect, while in large doses, it can really provoke a nap.<br>Minor side effects:<br>-Consuming a large dose can cause a tightness of the chest and shortness of breathe.  This is transient, perhaps lasting a couple of minutes, but it is somewhat disturbing to the uninitiated.<br>-Large doses will put me to sleep, which is fine at bedtime, but not such a hot thing in the middle of the day.<br>Major side effects:<br>I haven't found this side effect anywhere in the literature, and my doctor had never heard of it: if I consume it for multiple days in a row, it seems to impair stomach function in some manner.  The result is gas, but not just garden-variety gas, but Satanic Gas from Hell.  It smelled like I shit my pants, with a lingering odor which infused my clothes.  It's the kind of gas where one offends onself.  Close friends come in the room and say with a voice of loving concern: 'Did you shit your pants?'  This side effect is show-stoppingly embarrassing to say the least.  It may also be accompanied by a pain in the stomach.   I'm concerned that this means my digestion is being impaired to the point where I'm not deriving nutrition from food, and I'm also concerned it is tearing up my stomach in some significant way.<br>Pepto-Bismol was useful for shutting down this particular problem.<br>My doc has never heard of this problem before and could not explain it, nor could the manufacturer.<br>Too bad, I really like GABA and have found it most helpful!  Now I only take small doses on occasion, never for sustained periods of time.\n\n\n"
}
