{
 "title": "Best Trip Ever",
 "author": "Taj_116",
 "citation": "   Taj_116. \"Best Trip Ever: experience with MDMA, 2C-T-2 &  Cannabis (ID 52605)\". Erowid.org. Apr 10, 2007. erowid.org/exp/52605",
 "substance": "MDMA, 2C-T-2 &  Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 lines",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   "  T+ 3:30",
   "1 bump",
   "insufflated",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 7:30",
   "1 cig.",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 12:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52605",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2007",
   "Views: 7524",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>2:30 AM - I first arrived to the festival, with an empty stomach.  Randomly met up with our friends that had gotten there earlier than us and the 3 of us snorted 3 lines equal to 2 capsules of molly.  We continued walking down until we reached a busted in barn type structure with a bunch of lazers and a DJ spinnin' psy/goa trance for 2 hours.  I danced my ass off, more than ever before.  It seemed I was channeling energy from the land and my body and into the air to all of the other people there lucky enough to recieve such energy that I had manipulated.  It felt like a whirlwind of air and a suction from below all at once as I danced.</p><p>6:00 AM - Snorted a bump of 2C-T-2.  WOW!  What happens now is like nothing I have ever experience before.  Comming up at 1,000 miles an hour.  At first thinking I can handle it and a couple seconds later comes the projectile vomit.  Never have a ever puked like that before.  2 out of the 3 of us puked, and then we had to walk up a gigantic incline and we were holding on to each other just to make sure we all made it up the hill.</p><p>6:30 AM - Arrived to my friend's campsite and sat down.  The nausea is dissapearing and I feel great.  Serotonin is being released freely and in a way that I have never felt before.  It felt as if 3 different seratonin doors had opened up inside my brain.  At the same time all this was happening, visuals were starting to take hold.  Everything green was greener.  Everything was luminescent and glowing.  This trip was by far teh best trip I have ever experienced.  A feeling of belongingness and warmth stuck with me throughout.  A trip with no regrets.  Nothing could have possible gone wrong.</p><p>I couldn't stop dancing, I was in the middle ground now and I felt the energy come back to me like I described earlier, but now I feel connections in my brain firing and connecting with points of my body causing me to move in ways I never thought possible.  Dancing is the highest form of meditation/cleansing that I know possible.  Now is when time escapes me.  My phone was dead, but I didn't mind because I felt that time could only hold me back.</p><p>Asumming 2 hours later - 8:30 AM - Start to walk around to different campsites and conversate.  I was extremely extroverted, which is unusual because I normally become introverted when I trip.</p><p>Assuming 1 1/2 hours have passed - 10:00 - Come back to the campsite, and reunite with my friends in the tent.  They felt it would be best for them as a couple and lie down with each other.  I don't blame them.  But I had to get em out of the tent to see the world as I saw it.  I was one with nature in its fullest possible way.  The chemical man told me that it lasted 4 hours when snorted, and 8-12 when injested.  I was having such an joyous experience so far I decided I wanted more but was afraid that the intense comeup would cause me to vomit again so he made me a parachute (a bunch of powder inside a rolling paper and rolled up, so I could swallow it) and take hold in an hour or so.</p><p>Assuming 1 hour later - 11:00 AM - My friends decide they want to walk around just as its deciding to take hold, so I go because I've been trying to get them out of the tent for hours.  Go to the top and decide what we are going to do.  If they are good to drive home or not.  NOT, is the answer.  So I leave them in my car to relax and sober up.  Me on the on the other hand deicide to walk back down and converse with people.</p><p>Assuming 1 hour later - 12:00 PM My personal journey of good karma and good vibes begin.  This festival was filled with half ravers and half hippies, so I got to meet a diverse group of people.  More walking, more talking, just exploring and loving it.  Run into my buddy that I havent seen all weekend and is driving a car to the bottom of the land so I hop in.  Showed me areas of the land that I didnt know existed.  Great wildlife and ravines.  Layed down and soaked it all in.  Met a cool family and talked with them for a good while, had some good convo.  I was lucky I stayed there for them time that I did because my friends were comming down the 'mountain' and yelled and motioned for them to come meet me.  Scored some pot for the ride home too.  Soon after it started to rain and we sought cover.  Caught a ride to the top of the 'mountain' and decided it was safe for us to drive home.</p><p>Assuming 1 1/2 hours have passed - 1:30 PM - We drive my car home, but I'm not driving it.  Still tripping, or 'candyflipping', if you wanna call it that, because seratonin was being released and visuals were being created all in the same.</p><p>Assuming 1 hour passed - 2:30 PM - Once we got gas and was on the main strecth, we rolled a last joint we had for the ride home.  Felt wonderful.  Clouds were shapshifting.  Colors were blending.  Popped in this new breaks CD I had scored from the festival.  Sounds were dissasociative.  No exact point from which they were comming from.  Pure bliss.</p><p>4:00 PM - Sure of the time because we are back in civilization.  Still frying mildly.  If I would of had more pot it probably would have lasted longer.  But oh well I wasn't complaing.  The comedown was beautiful.  Very light feeling, no bad effects whatsoever, and great sleep thereafter.  No hangover that I have felt this morning yet.  Great time, I loved this chemical and all it had to offer me, except for the inital come up.  You have to be a experienced recreational drug user/hardass to snort this chemical.  However not everybody pukes, and I had an empty stomach, so use your own judgement.  If I had the chance, I would try it again.  This was the greatest experience I have had recreationally using drugs, and a campout that I will cherish always.</p>"
}
