{
 "title": "Didn't Know What to Do With Myself",
 "author": "Sosa",
 "citation": "   Sosa. \"Didn't Know What to Do With Myself: experience with MDMA (Ecstasy) (ID 52618)\". Erowid.org. May 14, 2008. erowid.org/exp/52618",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52618",
   "Male",
   " ",
   "Not Given",
   "May 14, 2008",
   "3307",
   " "
  ]
 ],
 "report": "<p>Ive only done it 5 times, but when I did a certain kind of pills I noticed, I had lost interest in life. I did 8 pills over a 12 hour period. It was like I had no ambition at the time of the crash, perfect words to describe it was 'I didnt know what to do with myself.' Nothing seemed appealing, I dont know if you would call it depression, but everything in life had no appeal to it, I didnt know what to do, let alone, I wouldnt enjoy doin anything. The worst part is I couldnt sleep, obviously I couldnt eat. I finally laid in bed and tried to fall asleep, which I eventually did for 3 hours, after that I felt like I had a chemical hangover.</p><p>Ive never done psychoactive prescription drugs, but it felt like I had a residual effect on me for at least 2 days after, I had a descent sleep that night, and I woke up the next morning feeling extremely light headed, the 'I dont know what to do with myself' subsided after the first nap by the way. Very very frustrating feeling, Ive never had that feeling before or after doing ecstacy, and Im not positive it's cuz the amount we took, because my friend did the same as me, and we did it a week later also, I only did 4 pills this time, he did 8 again, and he didnt have the hangover we felt the 1st time we did the pills, and guaranteed he went through the 'I don't know what to do with myself phase' also cuz we talked about it, and he assured me he was went through the same feelings, never had those feelings in my life, very frustrating.</p><p>By the way I did get alot more of a peak/high off the 1st time doing 8 pills then the 2nd time, doin 4, even though my friend did 8 the 2nd time, he said the 1st time was way better of a high, but the crash was horrible, personally I think they had different compounds in them.</p>"
}
